{
    "chapters":{
        "1":{
            "author_id":"dcpsherry",
            "author_name":"DCPSherry",
            "choices":[
                "Richard and Martin - The pampered whale and doctor",
                "Eldonia and Alessandro - The oversized man and wife",
                "Bear and Hog - The growing young couple",
                "Peter and Matthew - Immensity through science",
                "Yoshi - The Sumo with a 5 meter Mawashi belt"
            ],
            "content":"<div class=\"\"><div> <span>Far away from prying eyes, an immense man wanted to build a home for himself and others who shared his passion for gaining. Sparing no expense a facility was built to comfortably care for men and women over half a ton and far heavier. The founder, Richard Maximus the Third chooses about once a year a new resident who is willing to commit to their fantasy of immobile life and an endless feast. It's been five years since the founding of the Maximus Clinic and it's success can be measured in over a ton of weight added to it's five enormous residents.<br>\r\n<br>\r\nHere's a little info about the residents, their spouses and a special visitor to the clinic.<br>\r\n<br>\r\n<u><b>Richard Maximus the Third</b></u> – First man to reach a ton; built the facility for himself and others to grow comfortably. A reclusive billionare from a distinguished line of massive men Richard defines gluttony and devotes himself to staying the fattest man of all time. Recently he has decided to make his appearance publicly known and has invited a reporter to do an exclusive like no other... <br>\r\nAge: 41 Height: 6’8” Weight: 2,267lbs<br>\r\n<br>\r\n<u><b>Dr. Martin</b></u> – Partner of Richard for 15 years the two have been together since college. After graduating top of class in med school and spending several years developing advanced artificial organs he retired from the medical community to work at the clinic his husband was opening up. Martin is the head physician and has been running the clinic since it opened 5 years ago. Using breakthrough hormonal treatments and advanced chemical food additives he's managed to turn his husband into a fat king and though his brilliance can keep Richard and the other residents perfectly healthy.<br>\r\nAge: 43 Height: 6'3\" Weight: 225lbs<br>\r\n<br>\r\n<u><b>James </b></u>– Out-of-state Reporter given the first ever look inside the Maximus Clinic. James was selected by Richard to do an interview by finding his profile on several gaining websites. <br>\r\nAge: 28 Height: 5”11 Weight: 180lbs <br>\r\n<br>\r\n<u><b>Alessandro</b></u> – The head chef of the clinic, Alessandro has honed his cooking through his wife's bottomless stomach, always been willing to consume the same meal a dozen times until it's perfect. Married to Eldonia he was hired when wife moved into the facility five years ago. <br>\r\nAge: 36 Height: 5’10” Weight: 420lbs <br>\r\n<br>\r\n<u><b>Eldonia</b></u> – Resident of facility and inspiration to many, she was in the first group to move in 5 years ago. Eldonia has actually managed to put on an average of 200lbs a year since entering the clinic, more than anyone else in the group. She is married to Alessandro and considering what pregnancy may do to her figure.  <br>\r\nAge: 34 Height: 5’6” Weight: 1,883lbs (Immobile)<br>\r\n<br>\r\n<u><b>Bear</b></u> – Partner and encourager to Hog, an gigantic muscular bodybuilder who offers weightlifting training to anyone in the facility. Hog and he have been living at the clinic for just short of a year. <br>\r\nAge: 25 Height: 6’4” Weight: 360lbs<br>\r\n<br>\r\n<u><b>Hog</b></u> – Partner of Bear, enjoys eating and humiliating comments about his size. While still mobile Hog is incredibly lazy, known for lazing in a spot for days on end only willing to grunt for more food. Bear and he have been residents at the clinic for just short of a year.   <br>\r\n Age: 27 Height: 5’4” Weight: 824lbs (barely mobile)<br>\r\n<br>\r\n<u><b>Peter</b></u> – Partner and co-researcher with Dr. Matthew. Aspires to find a way to gain weight as fast as possible, looking at Richard and Eldonia as an inspiration of size. They have been residents of the facility for the last 2 years. <br>\r\nAge: 32 Height:5’8” Weight: 703lbs<br>\r\n<br>\r\n<u><b>Mathew</b></u> – Partner and co-researcher with Peter. Driven and with more than half a dozen doctorate degrees he wants to help Peter reach his goals and then some. They have been residents  of the facility for the last 2 years. <br>\r\nAge: 29 Height: 6’ Weight: 175lbs<br>\r\n<br>\r\n<u><b>Yoshi </b></u>– Former professional sumo wrestler notorious for being banned from competition for having more than 1ft and 300lbs over any competitor at that time. Since retiring he’s trying to set a record for heaviest mobile man and trains frequently for it with Bear and Hog. Yoshi has been living at the clinic for 4 years. <br>\r\nAge: 31 Height: 7’7” Weight: 1,249lbs (mobile)<br>\r\n<br>\r\nChoose who you'd like to follow<br>\r\n</span></div></div>",
            "created":1327122000,
            "id":1262769,
            "title":"Welcome to the Maximus Clinic"
        },
        "11":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Feeding session(oral, anal, & navel)",
                "Massage Session",
                "Game (non-physical)",
                "Bath in the Hot Tub/Pool",
                "Sexual Intercourse (oral, anal, belly fucking)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Richard &amp; Martin were enjoying themselves during a ...</span></div></span></div>",
            "created":1354165200,
            "id":1478492,
            "title":"Richard and Martin - The pampered whale and doctor"
        },
        "112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "the biggest masseurs in America",
                "the strongest masseurs in America",
                "the first bionic masseurs ever!"
            ],
            "content":"<div class=\"\"><div> <span>Richard grunted as he felt the stretching reach deep into his muscles.  He rolled slightly, better lining up the muscles of his lower back with the intense pressures being exerted by the huge hands of the new masseur.  <br>\r\n<br>\r\n\"Is that good?\" the deep-voiced masseur asked, as he pushed deep again into Richard's fat layers.  He thought he had reached muscle, somewhere deep inside Richard's body, but the 'padding' was so thick he couldn't be sure.<br>\r\n<br>\r\n\"Really good,\" Richard replied. \"I rolled so as to get the muscles positioned just right under your hands.  You are very skilled - I know it's hard to get in there.  The last guy stood on my back to get enough pressure.\"<br>\r\n<br>\r\n\"I imagine,\" replied the masseur, \"but then, I am exceptional, and so is my partner.  We are, after all...</span></div></div>",
            "created":1356238800,
            "id":1493523,
            "title":"Massage Session"
        },
        "1121":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "New Sexual Growth/Girth Tequniques Experiment with Dr. Martin",
                "Feeding Session W/ My Chefs",
                "Internment of Young & Healthy Residents=Feeders/Encouragers Or Gainers"
            ],
            "content":"<div class=\"\"><div> <span>\"The biggest masseurs in America &amp; the ratio for our BMI is 3:1 hard muscle &amp; dense fat, with our weight being around 1,000 lb. of man flesh. Isn't that right Norman my brother.\" Said the first masseur.<br>\r\n<br>\r\n\"Of course Nathan. WE are the biggest masseurs ever. Our services are best applied for the super obese or hyper muscular.\" Norman responded. They then jumped, stomped, &amp; aggressively cuddled/kneaded the fat off of Richard's gut which wrapped around his spinal chord like a bra strap or a huge circus tent filled like a balloon with gelatin.<br>\r\n<br>\r\n\"Thanks boys, your payment is the usual, $10,000.00 per session, plus expenses.\" Richard gestured, or at least attempted to gesture with his near immobile body. \"I hope you enjoyed your workout &amp; routine. Now I'm going to have to cut this session short &amp; add it to next time's session.\"<br>\r\n<br>\r\n\"Really???? Why is that\" Nathan pondered.<br>\r\n<br>\r\n\"I am needed for another project for...\"</span></div></div>",
            "created":1485904920,
            "id":2271777,
            "title":"the biggest masseurs in America"
        },
        "114":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"I'm game for another couple of laps...\"",
                "\"I think that's enough, time to relax...\"",
                "\"Bring me a snack, willya?\""
            ],
            "content":"<div class=\"\"><div> <span>Richard reached out and touched the side of the pool, then turned and headed back to the other side.  He loved being in the water, where his size was as much a help as a hindrance.  Stroke by stroke, wearing the hand and foot flippers, he propelled his massive size towards the other side of the pool.<br>\r\n<br>\r\nMartin looked on with favour from his favourite vantage point, atop the lifeguard's chair beside the pool.  Richard's vast form looked like a floating fat island from up here, or a whale, excepting the long, heavy, splashing arms and legs.  His smartphone monitored and displayed the essential rhythms of Richard's body as it went through it's daily workout - heartrate, breathing rate, oxygenation, basic blood chemistry.  Basically, Richard was as fit as could be expected of a man who weighed ten times what most men his height weighed - better, in fact, then many fat men.  And this daily swimming workout was one of the reasons why.  Still, Martin knew that the such a magnificent weight put a strain on all Richard's bodily systems, so close monitoring was called for.  <br>\r\n<br>\r\nHis heartrate slowed as Richard reached the other side, and Richard tapped in, then called up to Martin, </span></div></div>",
            "created":1354510800,
            "id":1481411,
            "title":"Bath in the Hot Tub/Pool"
        },
        "1142":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a crane...",
                "a motorized cart...",
                "a support cart for his massive belly..."
            ],
            "content":"<div class=\"\"><div> <span>Richard's heartrate slowed as he reached the other side of the pool.  He Richard tapped in at the wall, to log his latest lap, then called up to Martin, \"I think that's enough, time to relax...\"<br>\r\n<br>\r\n\"I'd say so,\" his partner and chief medical advisor called down to him, \"those laps were the fastest you've done in a month!  Time to add another couple, I'd say.\"<br>\r\n<br>\r\n\"Things looked good?\"<br>\r\n<br>\r\n\"Heartrate and all, very good!\"<br>\r\n<br>\r\n\"Great!\" Richard said, then floated out into the pool.  With a few lazy strokes, he started his ton-plus of flesh floating towards the shallow end of the pool, where his means of exiting the water awaited....</span></div></div>",
            "created":1356498000,
            "id":1495367,
            "title":"\"I think that's enough, time to relax....."
        },
        "11423":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "where Eldonia was already eating.",
                "where Bear was already feeding Hog.",
                "with Yoshi just sitting down to it."
            ],
            "content":"<div class=\"\"><div> <span>With a few lazy strokes, Richard started his ton-plus of flesh floating towards the shallow end of the pool, where his means of exiting the water awaited - a support cart for his awesome belly.  As he pushed into the shallows, he gradually flipped around so his feet were down and his belly leading. Martin watched and, at the right moment, made the cart rise up gently from the swimming pool's bottom, taking up the load of Richard's fabulous food-locker.  Richard swam forward with his arms as his feet started to walk on the bottom of the pool.  <br>\r\n<br>\r\nSteadily, Richard walked out of the pool, water dripping off him and his belly mobility device.  Martin smiled, seeing again how Richards inventive mind and his team's engineering ingenuity had together provided the gear that kept his mammoth lover mobile. <br>\r\n<br>\r\nOnce out of the pool, Richard discarded the hand and foot flippers, then maneuvered over to a section of floor with a series of holes in it.  From above and below warm air rolled out vigourously, starting to dry Richard off even as Martin came with a towel and started drying Richard's padded backside.  Richard turned gradually, the cart wheeling freely under his belly, to dry off all sides, before accepting a huge, thick terry robe from Martin.  <br>\r\n<br>\r\n\"Brunch time?\" Martin asked.<br>\r\n<br>\r\n\"You bet!\" replied Richard. He aimed his body and cart towards a huge pair of doors, that opened as he approached.  Beyond the door, a short hallway led to a sunny atrium.  A breakfast table was set up there...</span></div></div>",
            "created":1440714120,
            "id":2026430,
            "title":"RIchard's mobile on land, too"
        },
        "114232":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"Well, yes,.....",
                "\"Bigger in muscle..."
            ],
            "content":"<div class=\"\"><div> <span>Richard aimed his body and belly cart towards a huge pair of doors that led down a short hallway to a sunny atrium, with a breakfast table already set up.  <br>\r\n<br>\r\nAs Richard and Martin entered, Bear was on his feet, getting more food from the chafing dishes for Hog, who was in full consumption mode.<br>\r\n<br>\r\n\"Morning, boss man, doctor,\" Bear said to Richard and Martin.  \"Hog's halfway to a breakfast coma already.\"<br>\r\n<br>\r\n\"He should come swimming with me before breakfast,\" Richard remarked, to which Hog merely grunted.<br>\r\n<br>\r\n\"Someday soon,\" Bear replied.  \"I'd like to see him floating.\"<br>\r\n<br>\r\n\"Don't forget to eat yourself,\" Martin remarked, \"you need to keep up your weight too, Bear.  We need your muscle around here.\"<br>\r\n<br>\r\n\"Aw, doc, you just want to see me get bigger,\" Bear replied.<br>\r\n</span></div></div>",
            "created":1483480560,
            "id":2258662,
            "title":"Breakfast for Hog and Richard..."
        },
        "1142321":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "reporters?",
                "a new candidate to join the fattening friendly colony?"
            ],
            "content":"<div class=\"\"><div> <span>Don't forget to eat yourself,\" Martin remarked, \"you need to keep up your weight too, Bear. We need your muscle around here.\"<br>\r\n<br>\r\n\"Aw, doc, you just want to see me get bigger,\" Bear replied.<br>\r\n<br>\r\n\"Well, yes,\" Martin replied, grinning. \"I have this thing for bigger men, you might have noticed...\"<br>\r\nhe added, then stroked Richard's gigantic gut.  \"Much bigger men....\"<br>\r\n<br>\r\n\"As I do,\" Bear replied.  \"But it's the other men I love to see fat, not me.\"<br>\r\n<br>\r\nMartin just grinned in reply, as Hog took another vast mouthful of breakfast frittatta and Richard angled himself into his 'eating chair'.  As he descended Martin lowered his belly cart a bit, and then grabbed a platter full of breakfast for Richard to gorge on.<br>\r\n<br>\r\nThe two fat men, Hog and Richard, worked their way through mounds of food, until Bear fell asleep.  Richard, bemused, continued to pack it away until he felt repleat, then suggeted to Martin it was time to move on.<br>\r\n<br>\r\nMartin, responsive as ever, raised the belly cart as Richard clambered to his feet, his vast thighs still up to lifting his vast body, as long as the belly was balanced.  Waddling off, Richard wondered what today would bring...</span></div></div>",
            "created":1521233340,
            "id":2465387,
            "title":"\"Well, yes,....."
        },
        "11423212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "and had the heft to join right in!",
                "and was asking for further details of their clinic's aims..."
            ],
            "content":"<div class=\"\"><div> <span>Waddling off, Richard wondered what today would bring - other than lots of food.  Martin had things running so smoothly now, that they they had actually circulate a discreet sort of 'ad' on a couple of gainers' websites, just to see if anybody who was serious about attaining a new size, would respond.<br>\r\n<br>\r\nAs Richard cruised into his office, and started his voice-activated computer, he settled down to deal with email, bills, and his investments - the carefully invested billions that produced the income that kept the clinic afloat.  His inbox was always brimming, but he quickly disposed of most of it, but left open an email of inquiry, from someone who had clearly read their ad </span></div></div>",
            "created":1553894160,
            "id":2636901,
            "title":"An email of inquiry"
        },
        "114232121":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "where I could grow a lot more...",
                "where there'd be other guys like me..."
            ],
            "content":"<div class=\"\"><div> <span>Richard's inbox was always brimming, but he quickly disposed of most of it, but left open an email of inquiry, from someone who had clearly read their ad - and had the heft to join right in!<br>\r\n<br>\r\n\"In the last three years I've gained 180 pounds,\" the email read in part, \"because after I'd recovered from my broken leg, I realised that I wasn't really in love with football, I was in love with being the size of a football lineman - or even bigger. But as you probably know, once you gain enough it gets hard to be out in the 'normal' world, and so, when I read your ad, and decoded it, I realised that you were offering a place...</span></div></div>",
            "created":1577130840,
            "id":2763667,
            "title":"An applicant to join the merry band!"
        },
        "1142321212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "hadn't been kidding about the 180 pound gain...",
                "had been massive BEFORE the 180 pound gain..."
            ],
            "content":"<div class=\"\"><div> <span>\"...when I read your ad, and decoded it, I realised that you were offering a place where there'd be other guys like me...\"<br>\r\n<br>\r\nRichard read on, and the more he read, the more he liked. Before looking at the applicant's stats - a mandatory field - he decided to look at the photographs.  Only two were mandatory - a front shot and and a side shot - but this applicant hadn't stopped there.  The headshot was \"GQ\" glamourous, even if the applicant was far too big to be a GQ model, and the action shots - in football uniform, in workout clothes, even in a wrestling single - were revealing and appealing, and also showed that the applicant...</span></div></div>",
            "created":1604524800,
            "id":2934572,
            "title":"The new acolyte"
        },
        "1143":{
            "author_id":"dcpsherry",
            "author_name":"DCPSherry",
            "choices":[
                "\"I'd like to stay in the pool a little longer and eat\"",
                "\"Hoist me up and let's visit someone...\"",
                "\"Help me with what I can't reach\""
            ],
            "content":"<div class=\"\"><div> <span>Richard relaxes after finishing the days laps, knowing it'll take a while to get hooked into the crane that would lift him out of the pool he calls out to his husband he cant see. \"Bring me a snack, willya? It can't be good letting me go so long without eating.\" He teases to Martin while he gently bounced his hands into his soft sides causing the rest of his belly, and the whole pool to start making waves. Martin knowing his husband all too well to let any chance for a snack go to waste. <br>\r\n<br>\r\nGrabbing a box of donuts he wanders into his massive husbands limited view and sits down at the edge of the water. His eyes twinkling with the excitement of seeing the snack Richard opens wide and lets the man who helped him add nearly a tons worth of body fat one bite at a time work his magic. While he ate two well practiced nurses began the process to get Richard's substantial weight out of the water. Almost like a human iceberg the king sized mattress worth of belly sitting out of the water was nothing compared to the fat below the water which they had to run a neoprene-lined canvas sling underneath in order to hoist Richard up. <br>\r\n<br>\r\nAs Richard polishes off the last donut the nurses give Martin a thumbs up to signal that Richard is ready to get out of the water. Martin asks his husband what he feels like doing now to which Richard says.</span></div></div>",
            "created":1355115600,
            "id":1485671,
            "title":"\"Bring me a snack, willya?\""
        },
        "13":{
            "author_id":"theday",
            "author_name":"Theday",
            "choices":[
                "It's great! Never been better!",
                "Hog is loving the set up, Bear isn't?",
                "Bear is loving the facility, Hog is not?",
                "A spicey third wheel has entered the picture?",
                "They're on the verge of a break up?"
            ],
            "content":"<div class=\"\"><div> <span>They say that opposites attract and with Bear and Hog the opposites are pretty great. Where Bear is a patient and resident trainer at the facility and has focused his growth on muscle gains. In the last year Bear has added 70 pounds of muscle and bulk to his frame. His incredibly large shoulders would probably rub up against the door frames, but at the facility they have extra wide doors for the convenience of the patients and staff. Bear loves to eat big and lift big.<br>\r\nThen on the opposite side of the spectrum is Hog. He he met Bear three years ago he was a mere 305 pound gainer wanting to grow bigger. Two years later Hog had grown to 430 pounds and then the couple discovered and entered the facility and Hog's weight has been skyrocketing since. With his gains Hog has slowly become lazier and lazier. He usually just lies in his over sized bed all day waiting for the feeding tube to descend and connect it to his mouth. Hog absolutely hates having to get up and move any more. In fact he can't even remember the last time he wore clothes. Hog really loves to eat and eat and eat and laze around feeling his increasing fatness.<br>\r\n<br>\r\nHow is the relationship between Hog and Bear doing?</span></div></div>",
            "created":1418599740,
            "id":1902596,
            "title":"Bear and Hog - The growing young couple"
        },
        "131":{
            "author_id":"threecyou",
            "author_name":"OctoBear",
            "choices":[
                "They decide to go to the cafeteria to eat.",
                "They decide to go out shopping.",
                "Bear decides he's not satisfied, and pounds him"
            ],
            "content":"<div class=\"\"><div> <span>Despite their differences, they got along extremely well. Selfish as Hog seemed, he truly did appreciate someone who was able to stay around him, and tolerate his stench. He enjoyed the emasculation of being compared to his more fit partner. Bear found waiting on Hog to be a nice enough exercise too, and likewise Hog didn’t mind his B.O. from a long day at the gym. The two of them were just happy with one another. <br>\r\nToday, Hog was laying in his reinforced bed, sucking down lard from his tube as usual, when Bear stepped in, squeezing himself through the doorway, “Hey fatass!” He called out to Hog, who turned his attention to the musclebound hunk, “Stopped by the clinic’s bakery, got you some high-fat donuts.” The thought made Hog’s stomach growl even as he was already eating. Hog pulled the tube out of his mouth, “Great! I’m starving!”. Bear chuckled, “I kinda figured you would be, lardo.” Each insult towards Hog’s weight made his smaller cock stir, getting him hornier and hungrier too. Hog was more than appreciative of Bear’s venom-tipped jabs. They had met at smaller sizes, and even then Bear acted disgusted by him, but over time, he’d come to develop genuine feelings for the ‘pig’. <br>\r\nBear lumbered over to the bed, sitting down besides his heftier lover, bulky body putting further strain on it, “Hope you don’t mind being so close,” Bear said with a chuckle, “I just got back from the gym. Probably sweaty as hell. Course I doubt an immobile fat fuck like yourself could do anything about it.” Hog grinned, chuckling as Bear playfully slapped and rubbed his gut, “Hell yeah I am. Well I hope you don’t mind that I haven’t showered in weeks either.” He joked back, “Maybe we should get you a nice pair of diapers too? Soon you’ll be so fat, you won’t even be able to get up.” Bear chuckled, grabbing a donut box from the bag, “I’ll bet you’ll even want me to feed you like a baby, huh?” He cradled Hog’s head lovingly as Hog licked his lips, “Could you?”. Bear grinned, “Alright ya big baby, open up the tunnel.”<br>\r\nHog opened his massive mouth, allowing beast to insert donut after high-fat donut inside. The sugary delights made Hog a bit more energetic. He continued to eat, even as he was getting full. He just wanted MORE, not that Bear would stop anyway. He learned early on that Bear wasn’t going to stop feeding him for anything. Eventually he learned to loved that excessive feeling of his gut being put to bursting, “Now eat it all up” Bear said with a smirk, “Daddy got at least eight-dozen. If you’re a good boy, he might even let you suck on some ‘dessert’ afterwards.” Hog’s cock twitched more, “-mmf-Please, babe, get me-unf-off…” He said between bites, crawling at his massive belly desperately attempting to reach his dick. Bear coyly grinned, “I’ve already had my exercise Maybe I’ll feel like doing it again in an hour, otherwise you’ll just have to sit there blueballed. Remember tubby, if you can’t reach it, you don’t deserve to get off.” Hog groaned as he ate, in wonderful frustrated pleasure. Bear often left him pent up and watched him squirm. <br>\r\nEmpty donut boxes soon littered the floor of the bedroom as Bear forced the last one into Hog’s mouth, watching him struggle to eat. The sight was rather appealing, “Hope you saved room for desserts boy”, Bear said, seeing Hog blushed as he swallowed, before emitting a loud belch in his face, “I’m going to take that as a yes.” He grinned, sitting up and taking off his compression shorts, revealing his monstrous 15-inch member. “Open wide, piggie.” He commanded, before shoving it in.<br>\r\nHog was used to it by now. It had practically destroyed his gag reflex, though he didn’t care. Bear forced it down his throat, until it collided with mashed up donuts Hog had recently swallowed. Bear began to pump furiously, his pendulous balls slapping against Hog’s quadruple chin. Hog salivated around his lover’s cock, freely allowing him to use his mouth as a hole. Bear slammed over and over, making the bed creak, until he felt he was getting close, “Alright boy, you ready?” He grunted, before ejaculating thick, copious amounts of jizz inside Hog’s tight pharynx. With a groan, he slid his dick out, causing Hog to spit up some cum. “Hey, savor that,” said Bear, “It’s to help wash it all down.” Hog nodded, licking his lips.<br>\r\nAs Bear enjoyed the afterglow, Hog spoke up, “Now would ya get me off already?”. Bear smirked, “Ask me later, I’m too tired right now.” Hog rolled his eyes, “Well, what do you wanna do now?”. Bear thought for a moment, and shrugged, “I dunno. The days still young though.” He seductively smiled towards his partner, who was clearly looking forward to it. <br>\r\n</span></div></div>",
            "created":1604677140,
            "id":2935532,
            "title":"Bear and Hog's Happy Relationship"
        },
        "135":{
            "author_id":"theday",
            "author_name":"Theday",
            "choices":[
                "Bear, the big body builder looking for a new chub to play with?",
                "Hog, the self obessed gainer?",
                "Keep up with both of them?"
            ],
            "content":"<div class=\"\"><div> <span>While on the surface it might look like both Bear and Hog are getting what they want out of the facility, the relationship between the two has become cold and distant. Hog's own selfish greed to grow bigger and lazier has really hurt the relationship. Hog doesn't even need Bear any more to get off, a few rocks on top of his giant gut sets off his rolls and causes his great pleasure. Bear has his doubts that he could even pleasure Hog the way food does any more.<br>\r\n<br>\r\nHere's where the story diverges, who do you want to follow?</span></div></div>",
            "created":1418600040,
            "id":1902601,
            "title":"They're on the verge of a break up?"
        },
        "1351":{
            "author_id":"theday",
            "author_name":"Theday",
            "choices":[
                "On the fresh meat to the facility?",
                "On the gym?",
                "In the cafeteria"
            ],
            "content":"<div class=\"\"><div> <span>With the last couple of break ups Bear would move across the city he was living in or even to another city all together just so he wouldn't have to run into his ex, but with Hog being the fat lazy pile of blubber that he is and nearly immobile there would be little chance of actually running into him. So Bear decided to stay at Maximus Gaining Clinic to improve his own muscle gains and he also loved the community. Of course Bear being fresh back on the dating market was starting to wonder where to look for a new boy friend. He had a couple of choices..<br>\r\n<br>\r\nHe was tempted to look into the new patients. He loved seeing Hog as he really first started putting on weight and rocket past 400, then 500 pounds, so a new member of the facility just might be perfect for him?<br>\r\n<br>\r\nThere was also the gym where he worked. There has been a couple of guys going for the bulky, world strength competition look. The fat and muscle look. But Bear also liked the idea of a muscular guy letting himself go...<br>\r\n<br>\r\nThen there's the cafeteria where Hog used to be found all the time until he got in suite tubes hooked up. The cafeteria always has guys filling their faces and wanting to be fed.<br>\r\n<br>\r\nWhere does Bear focus his efforts?</span></div></div>",
            "created":1419198180,
            "id":1905635,
            "title":"Bear's Single and Ready for a New Chub"
        },
        "1352":{
            "author_id":"theday",
            "author_name":"Theday",
            "choices":[
                "The facility bring a new gainer method to his attension?",
                "He gets a new gainer coach?",
                "Without Bear's income Hog is going to be kicked out of Maximus?!"
            ],
            "content":"<div class=\"\"><div> <span>With Bear moving out of the room, Hog now had room to fill the whole bed and he was determined to do it. He had been holding back his gaining a bit lately because of Bear, but now that Bear broke up with him Hog was ready to step up his gains, Big time. Hog is so close to being on the verge of immobile and becoming fatter than his wildest dreams.<br>\r\nWhat situation presents itself?</span></div></div>",
            "created":1419198420,
            "id":1905638,
            "title":"Hog, the self obessed gainer?"
        },
        "14":{
            "author_id":"dcpsherry",
            "author_name":"DCPSherry",
            "choices":[
                "Matthew finishes a new chemical compound for converting food to fat",
                "Matthew designs a tube feeding system",
                "Peter finishes translating an ancient spellbook",
                "Matthew creates a fattening ray"
            ],
            "content":"<div class=\"\"><div> <span>At the Maximus gaining clinic every avenue of fattening is given some amount of attention, Richard for several years financed medical companies to develop special additives to food to provide the most fat production possible. However that changed when someone brought Mathew to his attention. A certified genius Matthew had finished his first doctorate in physics at 14, mechanical engineering and organic chemistry at 16, his medical degree and completed residency by 20 and several more after that. Why he stood out was more the man behind him, a renowned expert in archaeology and computational linguistics Peter. When Richard extended them an invitation to stay at the clinic with the offer of unlimited resources for research into fattening processes Peter was already a well-rounded 510lb but with two years at the clinic and a bottomless appetite for his favorite footling sub sandwiches made him into a massive 703lb ball of a man. <br>\r\n<br>\r\nPeter had for years hidden his love of his size, while always overweight it took until college for him to really pork up. He and Matthew met one fortunate lunch on campus, repeating those lunches lead to dating and a whole lot more. It took Matthew little effort to talk Peter into gaining and with his encouragement put Peter into some of the largest pairs of khakis ever seen in research academia. Their willingness to join the clinic wasn't based on need so much as wanting their shared dream to come true, to have Peter weigh 10 times as much as Matthew and then so much further than that.<br>\r\n<br>\r\nNow that they've had a good amount of time to work on multiple projects, both Peter and Matthew are on the verge of breakthroughs to allow them to gain faster than even before, what're they going to get working.</span></div></div>",
            "created":1327294800,
            "id":1264416,
            "title":"Immensity through science"
        },
        "143":{
            "author_id":"dcpsherry",
            "author_name":"DCPSherry",
            "choices":[
                "Try out the slides first, what better way to present them than with results?",
                "Take them over to Richard's room and try them out.",
                "Cast the fertility one on Matthew and see what happens."
            ],
            "content":"<div class=\"\"><div> <span>\"Aha!\" Peter yelled through a mouthful of deli meat and Swiss. His work into ancient translations was finally paying off. He'd been working with a program to identify common symbols and assemble a rough alphabet possible for speaking, the idea of finding and transcribing a language unspoken for so long got him so excited his belly regularly demanded a half dozen of his favorite sub sandwiches.It was an unbelievably rare item, the best dating techniques confirmed the creation of the stone tablets to around 24,000 BC in an area surrounding the discovered site of ancient fertility symbols like Venus of Willendorf; meaning that the book predated any previous text by more than 20,000 years.  Peter had been trying for 14 months to find a translation of the book, it had been written in rough symbols never seen before and the reason it fetched 1.8 million dollars at private auction by an anonymous collector was that the several of the tablets, had symbols of women like Venus, and some that were substantially larger...<br>\r\n<br>\r\nLooking at the monitors Peter hit the switch on his recliner from a leaning position he loved to snack in back to a normal seat to better access his workstation. As the motorized chair lifted his bulk upwards Peter quickly shoved the last few inches of sub into his greedy mouth. The massive sandwich stretched his fattened cheeks to capacity while he picked up mustard covered cheese slices off his once white 12xl button up lab coat and shoved them in as well, pushing the food down his relaxed gullet and into his cavernous belly. Once his chair had lifted into the sitting position he reached past his bulk to his 64oz gainshake, it was his 3rd of the day and while he had gulped the first two down fresh while they were still partway frozen this one was just like a thicker glass of cold milk. \"What the hell, it's a celebration!\" he said before putting the glass to his mouth, gulp after gulp drained the half gallon shake in just under 30 seconds, his spare hand rubbing the upper portion of his belly as he thought about soon having the belly of Richard and how little he could reach of his fattened self then. A massive belch caught the attention of Matthew, who's work in the other lab was dropped to see what his man was up to. <br>\r\n<br>\r\n\"Hey hun, quite a belch!\" Matthew says while Peter wipes the excess shake off his jowls and spare tire of a double chin. \"Making any headway on your translations?\" <br>\r\n*Uuurp* \"Actually just got the first translation done, 14 letters and I think I have a composite of what their speech pattern might have been.\" Peter said now eyeballing another 5-pound sub sitting on the tray. \"Oh go for it babe, I'll set it to assemble translations for a few of the tablets, let's jump to the good ones huh?\" Matthew says while reaching for the mouse to configure the translator. \"Thanks this is the discovery of a lifetime and I'm glad I'm sharing it with you.\" Peter beams before unwrapping and gulping down a quarter of the sandwich. <br>\r\n<br>\r\nBy the time Peter finishes off the giant sub the first 4 tablets are done translating and Peter tries to piece together the rough language. \"Hmm... this does seem to be an incantation like I had estimated, oh! this one too!\" Peter runs his hands under the massive rolls of his apron and shakes excitedly, the motion of his husbands quivering fat distracting Matthew from looking anywhere else. \"Well of these tablets it would seem this one claims to add any amount of 'Oum.'.. their word for fat or mass, I'm not sure but I'd assume fat... They had a number system... oh fascinating! I wonder how their mathmatical.... ok back to the tablet it looks like you'd just have to say it aloud.\"<br>\r\n<br>\r\n\"Unbelievable! what do the other tablets do?\" Matthew asks, prying his mind away from the 86 inches of doughy waistline bouncing around long enough to ask a meaningful question. \"It looks like this one you can... yes! you can multiply your current weight. I can't believe they had addition and multiplication it's outstanding!\" Peter says before attacking his 4th milkshake of the day, he could feel the excitement in his tentlike khakis as another 6,500 calories was gulped down faster than before. \"This one has something to do with fertility, hah better let Eldonia and Alessandro know.\" \"What about the last one?\" Matthew asks, dreaming of the possibilities if these were to work. \"Looks like something to do with loosing weight, hah who needs that one?\" Peter laughs, he really should present the slides to Richard, he'd been asking about them recently and if anyone appreciated them it'd be the man who paid so well for them. <br>\r\n</span></div></div>",
            "created":1327381200,
            "id":1264479,
            "title":"Peter finishes translating an ancient spellbook"
        },
        "1431":{
            "author_id":"maltesevolpe",
            "author_name":"fall",
            "choices":[
                "The mass adder  Tablet",
                "Multiply mass Tablet",
                "Fertility Tablet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So which Slide do you wish to try first?</span></div></span></div>",
            "created":1375743360,
            "id":1640951,
            "title":"Try out the slides first, what better way to pr..."
        },
        "144":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Solid Matter Absorption Ray (any kind of solid matter)",
                "Radiant Roundness Ray (Even lethal nuclear radiation)",
                "Food to Fat Conversion Ray (semi-liquid foods as well, but no soups)"
            ],
            "content":"<div class=\"\"><div> <span>\"Peter, Peter!\" Matthew shouted to his near immobile lover &amp; co-researcher.<br>\r\n<br>\r\n\"What is it Matt?\" grumbled Peter, whose barely waking up from his nap.<br>\r\n<br>\r\n\"I've finished it! I've finished my newest invention. The Fat Ray!\" Matthew responded with glee. \"NOw we can up your weight to whatever size you want &amp; keep on growing indefinitely.\"<br>\r\n<br>\r\n\"Really?\" Peter woke up quite quickly for a man of his stature.<br>\r\n<br>\r\n\"Yes, the ray works like this:\"<br>\r\n<br>\r\n1. It is a ray that causes the body to absorb any solid matter that is being touched by the victim, while also turning the matter into pure nutrients &amp; adipose tissue with durable &amp; strengthened but lean muscle.<br>\r\n<br>\r\n2. The ray causes absorption of sunlight &amp; other forms of radiation harmlessly converted into excess energy which then gets metabolized into fat.<br>\r\n<br>\r\n3. Or the fat ray could transfer the mass from a targeted mass zone, then either in bursts or streams of energy, transfer the nutrients &amp; fat into the belly, butts, boobs, &amp; other body parts without suffocating them or causing disproportionate growth of pure lipid cells.<br>\r\n<br>\r\nSo which is it???...</span></div></div>",
            "created":1361394480,
            "id":1536105,
            "title":"Matthew Creates A Fattening Ray"
        },
        "15":{
            "author_id":"lilhikariboy",
            "author_name":"Sho",
            "choices":[
                "Time to workout with Bear.",
                "Time to eat with Hog.",
                "Time for a weekly visit with Richard.",
                "Time for a checkup with Dr. Martin.",
                "Time to take a shower."
            ],
            "content":"<div class=\"\"><div> <span>\"Yoshi,\" said a man in a suit behind a big, wooden desk in a dimly lit office.  \"We have no choice.\"<br>\r\n<br>\r\n\"It's not my fault your biggest guy is only 700 pounds!\" boomed a huge voice.<br>\r\n<br>\r\nAcross the desk from the small man in the sharp suit was a mountain.  Well, a man who was a mountain really.  He was wider than the desk and taller than pretty much any other man.  Huge, fat cheeks above a thick double- well, triple- chin framed the head as it sat atop broad shoulders.  Those shoulders rested above two, gigantic pecs that were soft, flabby, and as big as some other sumo's bellies.  They rested proudly above a vast, soft, drooping belly that was barely contained by a t-shirt with the dojo's logo on it; no doubt a special order due to the yards of fabric needed to make it.  It rested partially on the desk as it was being rubbed by two huge, strong hands attached to fat wrists and tree-sized arms.  Beneath it sat two thighs big as silos with giant calves, all heavily muscled to support him.  His waist was huge, bigger than any other wrestler, and it melted into two, blimp like butt cheeks.  Each one bigger than a beanbag chair, likely able to crush a car with little to no effort.  They were packed into a pair of gigantic sweats that were strained heavily due to having to hold in all that man.<br>\r\n<br>\r\n\"I'm sorry, Yoshi, but we have to ban you.  We can't risk you crushing someone,\" said the smaller man.  \"Even if you lost some weight, you're still over seven and a half feet tall!  We were accepting before, but you just keep growing!\"<br>\r\n<br>\r\nThe mountain sighed, \"I understand.\"<br>\r\n<br>\r\n\"Good.  Now, you're welcome to drop by anytime but BUZZ BUZZ BUZZ,\" the man said before an annoying alarm started to go off from his mouth.<br>\r\n<br>\r\nYoshi grunted and rubbed his eyes.  His alarm had interrupted the dream he was having.  Though it wasn't so bad really since it was the dream that replayed whenever he was truly exhausted and his mind wandered to the memory of being banned from professional sumo wrestling.  He pulled the sheets off of his gargantuan gut and palmed the sides of it with a small smile.  Who said Japanese guys were tiny and wiry office workers?  His years at Maximus had been good to him.  He had been gaining and training for sumo, but recently he'd been focusing on a new goal.  He wanted to keep growing but stay mobile so he could become a record holder and show that sumo organization.  After putting on a hundred pounds since being kicked out 9 months ago, he's gotten even closer to a ton.<br>\r\n<br>\r\nHe heaved himself onto his side as he tried to roll out of bed.  Flopping onto his side, his belly spilled out before him and hung off the side of his custom sized bed while his constantly growing butt stuck out behind him.  With a flex of his belly he grunted, and fired out a thick fart, expelling his morning gas loudly- a side effect of his high protein diet.  After doing so, he swung one of his huge feet out from under him and planted it onto the floor with a thud.  He pushed himself up a bit and rounded his other leg around to plant his other foot down, slowly raising up.  There he stood at his full 7'7\" height and 16' waist, ready to start the day.</span></div></div>",
            "created":1327294800,
            "id":1264394,
            "title":"Yoshi - The Sumo with a 5 meter Mawashi belt"
        },
        "151":{
            "author_id":"lilhikariboy",
            "author_name":"Sho",
            "choices":[
                "Yoshi goes to eat with Hog.",
                "Bear has him do a second round.",
                "Yoshi has an appointment with the doctors."
            ],
            "content":"<div class=\"\"><div> <span>Yoshi usually started and ended every day with a workout.  He trained with Bear during that time, having the bodybuilder push him to expand his strength and pack on muscle so he could keep hauling his giant ass around.  Plus Bear was fond of huge men so he was more than willing to help out Yoshi.  It was an interest of his to see how big he could get and still move since his hubby, Hog, didn't walk unless he had to.<br>\r\n<br>\r\nThe giant sumo yawned a bit before thundering over to his closet.  Each of his heavy footsteps created a deep thud on the floor and if it weren't for the sturdy floors and walls, everything would be rattling like an earthquake.  Usually he'd just wear his mawashi, but he was waiting for a few new sizes to arrive as he outgrew his last one.  He pulled out a giant jock and a pair of equally huge workout shorts as well as some socks and his massive size 26 workout shoes.  Grunting, he slid the jock on, having to lean around his girth and squat down so he could pick it up.  As he did so his belly rested on the ground and pushed his moobs up into his face.  This made him smile and get mildly excited, but there was no time for that now.  He did the same with the shorts and tucked his belly into them a bit for the extra support.<br>\r\n<br>\r\nHe then thudded back to his bed and sat down, grunting again as he reached around to get his socks on.  It was getting tougher and tougher to do the bigger he got, but Bear had been training him to be more flexible too so he could still do at least this.  Sadly he still broke a sweat as he got one on and rested a bit before tugging the second on.  Exhaling a bit he slipped his feet into his shoes, adjusted them, and then grunted as he pushed his mammoth body up.<br>\r\n<br>\r\nAdjusting his shorts, he started to thunder out of his room, squeezing out sideways through the already wide door.  He waddled down the even wider corridor, huge thuds echoing as he pushed his huge belly along, the massive blimp wobbling and leading his way.  A few workers in the hall stepped against the walls to give him room, Yoshi holding a huge mitt up to wave to them as he pressed on.  Thankfully his room was near the gym so it was only a short waddle to the huge, open doorway and big, glass windows.<br>\r\n<br>\r\nBear was already there, setting things up when he heard the huge thuds.  He turned and smiled, his square, stubbled face beaming happily.  Yoshi returned the smile and rumbled up in front of Bear.<br>\r\n<br>\r\n\"Hey, big man!  Ready to get started?  I think we'll do some weights and squats for now, then Hog's got breakfast ready,\" Bear said in his thick, gruff, but quite sweet voice.<br>\r\n<br>\r\n\"Sure am,\" Yoshi smiled as he and Bear went over to the weights section.<br>\r\n<br>\r\nThey warmed up a bit, did a few curls with dumbells that would make any jock grunt with effort, but for them it was nothing.  They were perfectly in synch- Bear's huge arms bulging and relaxing as he curled the heavy weights while Yoshi did the same.  Though with Yoshi, his fat arms tensed and relaxed, causing the flab to jiggle.  The weight also followed the curve of the side of his belly as he curled, making his gut shake too.<br>\r\n<br>\r\nThe two worked up a decent sweat and then moved over to the bench.  Bear had ordered a bench that could be connected to others to give Yoshi enough space to lay on.  He had connected about 14 feet worth of bench, meaning the massive man still hung off the sides a bit.  Though it didn't matter much as Yoshi eased onto it and spread his huge legs, getting comfortable despite the missing 2 feet.  He lay back as Bear added weights to either side of the bar, filling it with enough to make even him put forth some effort.<br>\r\n<br>\r\n\"Ready?\" Bear grunted as he got the last weight on.<br>\r\n<br>\r\n\"Ready,\" Yoshi said as he gripped the bar.<br>\r\n<br>\r\nBear started to spot Yoshi, standing over the man's huge head.  He counted off reps as Yoshi pumped, monitoring how his arms flexed with each one.  He loved how lazy Hog was, but he also loved how strong and active Yoshi was so for him, living at the center was a dream come true.  Yoshi's forehead broke into a sweat, followed by square inch upon square inch of his body.  His moobs and belly dripped sweat onto the bench, some pooling in his bellybutton and dampening his huge asscrack.<br>\r\n<br>\r\nAfter several reps, Bear had Yoshi stop and cool down as he got a second bar ready.  Yoshi panted and wiped down what he could of his body, but the sweat just kept coming in full force.  Bear helped him up off of the bench and he lumbered over to the second bar, chest still heaving.  He squatted down and grabbed the bar around his shoulders as Bear instructed him to do some squats.  Yoshi did as he was told, rising up from his position to come back down slowly.  He had his huge legs spread apart and was grunting deeply with effort as he squatted.  His belly and ass pressed down into the gym mats, coating them in his sweat before he rose back up.<br>\r\n<br>\r\nHe kept going as Bear encouraged him, forcing him to work hard despite all the weight.  On the last one, Yoshi went down and a thundering fart ripped from his giant ass.  His cheeks were red, but mostly from exertion, having given up most of his modesty since joining up at Maximus.  Bear just laughed and dramatically fanned the air while Yoshi let the bar fall and stood up.<br>\r\n<br>\r\n\"Damn, you ARE worse than Hog,\" Bear bellowed with laughter.<br>\r\n<br>\r\n\"You had me doing squats so this is your fault,\" laughed Yoshi.<br>\r\n<br>\r\nNow...</span></div></div>",
            "created":1327381200,
            "id":1264442,
            "title":"Time to workout with Bear."
        },
        "1511":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "start to nap, to digest better....",
                "discuss what to have for lunch...",
                "ask Bear and the dining room staff for belly rubs."
            ],
            "content":"<div class=\"\"><div> <span>Yoshi set the bar back down, then stood up again, his legs hardly feeling his massive weight now that the hefty squat bar was not part of their load.  Fairly bouncing his 1200 pounds on his toes, he goes to the shower at the side of the gym, strips off, and steps into the enormous shower enclosure - really, a glass-walled cubicle.  Closing his eyes, he activates the shower - which is no ordinary shower, but more like an automated car wash for giant guys.  Yoshi reaches down and grabs his gut, lifting it, then dropping it, letting the floor and wall mounted sprays clean even his gut overhang.  He wiggles about, raising and lowering his vast arms, shifting his oil-barrel legs left and right, so that every square inch of flesh looses its layer of sweat and comes out clean.  The shower, initially warm, slowly shifts to cool to cool him down, then the water ceases, and a cyclone of warm, dry air roars out of slots in the walls and ceilling.  Once again, Yoshi elevates his generous gut to let his overlap be dried.  <br>\r\n<br>\r\nStepping out of the shower, Yoshi picks up a pair of clean fleece shorts and a t-shirt with \"Maximus Gain\" stenciled across the gut region.  Dropping heavily onto a nearby bench, Yoshi quickly dresses (as quickly as his fat allows), then climbs to his feet again.  Meanwhile, Bear has showered as well, and donned his own shorts and muscle shirt. Bear's shirt is stencilled 'Hog Trainer\" across his mountainous pecs, and \"Maximus\" stretches across his gluts on the shorts.  The two fill the doorway, then rumbled along the broad hallway to the dining room, where Hog awaits them.<br>\r\n<br>\r\nLooking fatter than ever, Hog sits in the dining room, stirring a vast pot of eggs.  Spying Yoshi's gut preceding him into the dining room, Hog calls out, \"You've come!  I thought I'd starve to death, waiting!\"  He grins broadly and high-fives Bear, as the dining room waiters quickly take the lids off an acre of high-protein and high calorie foods for Yoshi, and a similar but much sweeter spread for Hog, suiting his sweet tooth.  Bear picked up the vast pot of eggs, and dumped a large quanitity into each of three bowls, one for each of the three big men.  Soon all three are deep into the vast breakfast. Bear finishes first, of course, then helps feed Hog the rest of his super-calorific repast.  <br>\r\n<br>\r\nEventually sated, Hog and Yoshi burp loudly, then sit back, reclining to digest the thousands of calories they have just ingested.  Many go to Yoshi's hard worked muscles (as do the calories of Bear's smaller repast), but Hog's intake goes to Hog's fat layers, mostly.  Hog and Yoshi....</span></div></div>",
            "created":1340254800,
            "id":1364109,
            "title":"Yoshi goes to eat breakfast with Hog"
        },
        "15112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "head off to the daily clinic meeting....",
                "head off to the computer lab..."
            ],
            "content":"<div class=\"\"><div> <span>Eventually sated, Hog and Yoshi burp loudly, then sit back, reclining to digest the thousands of calories they have just ingested.  Bear watches as the two vast guys lazily stroke their engorged guts.  <br>\r\n<br>\r\nAfter a minute or two, Hog looks up at Yoshi and says, \"Well, that was decent.  So, what should we have for lunch?  I know I'll be hungry...\"<br>\r\n<br>\r\nYoshi grins sleepily as Bear chuckles.  \"Hog, you're not hungry again?\"  <br>\r\n<br>\r\n\"Nah, but give him about fifteen minutes and he will be,\" Yoshi remarks, anticipating Hog's reply.<br>\r\n<br>\r\n\"As will you!\" Hog ripostes.  \"So, about lunch....\"<br>\r\n<br>\r\n\"Fish. Beef.  Rice.  Pie,\" Yoshi replies in a well-worn spiel.<br>\r\n<br>\r\n\"You two!  Always thinking about food!\" Bear teases, gently.<br>\r\n<br>\r\n\"Of course, how else did we get this big?\" Hog asks in mock serious tones, as Yoshi nods.  <br>\r\n<br>\r\n\"A sumo is only as good as his appetite,\" Yoshi observes, then leans back again.<br>\r\n<br>\r\nAfter another half hour of sitting and digesting, the two vast men and their big compatriot flex their vast muscles to force their bellies skywards and clamber to their feet.  Then they...</span></div></div>",
            "created":1353992400,
            "id":1476613,
            "title":"Thinking about food?  Always!"
        },
        "151121":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "What brought you to the clinic?",
                "Why do you want to be big?  ",
                "How big do you want to be?"
            ],
            "content":"<div class=\"\"><div> <span>After another half hour of sitting and digesting, Yoshi, Hog, and Bear flex their vast muscles to force their bellies skywards and clamber to their feet - Bear and Yoshi first, then Hog once he gets an assist from Hog. Then the magnificent trio head down a huge hallway, catching up slowly with Eldonia and Peter, who left the cafeteria moments ahead of them.   The mammoth quintet reach a broad set of double doors, which Yoshi opens by ramming his gut into the them.  Inside is a wide boardroom table, with wider chairs scattered around it, and at its head sits Richard Maximus III.  <br>\r\n<br>\r\nMoments after the four men seat themselves, and Eldonia parks her massive scooter, Dr. Martin, Alessandro and Martin hurry in.  With Dr. Martin is a stranger, who tries hard to avoid rubbernecking at the sight of so many huge human beings.  <br>\r\n<br>\r\n\"Welcome,\" rumbles Richard in a deep voice that suits his 2000 pounds frame.  \"Top of today's agenda is our visitor, James.  He's a freelancer - National Geographic, NY Times, BBC - who specialises in unusual human stories, and he's asked to do a report on the clinic.  Welcome James!\"<br>\r\n<br>\r\n\"Thank you,\" James replies, his wonderment and amazement at his surroundings obvious.<br>\r\n<br>\r\n\"Now, none of you have to speak with James, and we get approval for any images he may want to take out of the clinic,\" Richard continued, \"but I'd like you all to work with him - this could be a great opportunity to expand the work we do here.  James, do you want to ask us a few questions as a group first?\"<br>\r\n<br>\r\n\"Certainly,\" replied James.  His gaze swept the room. \"May I first ask each of you to respond to this question:<br>\r\n    </span></div></div>",
            "created":1420929300,
            "id":1916099,
            "title":"Daily we meet"
        }
    },
    "info":{
        "author_id":"dcpsherry",
        "author_name":"DCPSherry",
        "brief_description":"A reclusive billionaire founds a clinic solely for gaining massive amounts of weight. ",
        "created":1327135920,
        "description":"<td align=\"left\" class=\"norm\">Five years ago a reclusive billionaire founded a clinic exclusively for those interested in gaining massive amounts of weight. Since then five residents and their spouses have entered the facility and all have had their desires for extreme fattening become a daily reality. Choose a couple or an individual to focus on and explore.  <br>\r\n<br>\r\nThis is a mature story so any subject material is fine however be sure to include gaining as a pretext to any chapter additions. Feel free to write realistic or fantasy gaining but give warning to extreme activities such as graphic depictions of controversial material. <br>\r\n</td>",
        "id":1842156,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604677140,
        "modified":1604677140,
        "pretty_title":"Maximus Gaining Clinic"
    }
}