{
    "chapters":{
        "1":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Lesbian: Madaline",
                "Bisexual: Regan",
                "Pansexual: Ted",
                "Gay: Justin",
                "Transgender: Karina"
            ],
            "content":"<div class=\"\"><div> <span>Choose your protagonist! The time is now and the place is suburban Greenwake Ohio.<br>\r\n<br>\r\n<u><i><b>WOMEN</b></i></u><br>\r\n<br>\r\n<b>Madaline Baker</b>,19, kind, gentle, spiritual and a free spirit. Five foot three and plump with thick thighs, wide hips, big boobs, and a broad, soft belly. Recent high school graduate living with her thin, masculine girlfriend: green-haired Rachael. After years of insecurity and bullying in her dance career, she's a body positivity activist.  Maintains a close relationship with skinny, voluptuous MILF mom Heidi (friendly, gullible, open minded Heidi) and chubby 13 year old sister Olive. Gets her body type from fat dad Daniel, a movie director.<br>\r\n<br>\r\n<b>Regan Redford</b>, 18, smart and sexy. The most popular senior in Greenwake High. Tiny with straight brown hair and booty for days. Bi, she's torn between thin, strong French exchange student Yanis (a guy) and chubby artist Heaven (A girl). What is she going to do. Best friends with equally bootylicious Zoe (taller, a hipster and lesbian) and goth Brie (purple-haired, thin, awkward, lesbian). The three run the local LGBT support group.<br>\r\n<br>\r\n<b>Karina Law</b>, 16. Formerly named CJ, Karina now identifies as a woman and has no problems hiding it. Flamboyantly walking around in heels and shocking the conservative teachers including the scandalized young Mrs. Linda Heyman. Tall, dark, sassy, smokes and vapes. Has long platinum-blond hair and wears revealing, scandalous clothing. Wants to do drag someday and also seek hormone therapy. Best friends with pansexual Angelica, both outspoken members of Regan's support club. No feelings one way or another on being plus-size.<br>\r\n<br>\r\n<u><i><b>MEN</b></i></u><br>\r\n<br>\r\n<b>Theodore \"Ted\" Ross</b>, 18, friendly. A shy, crafty pansexual femboy. Has a taste for round and fat with an emphasis on bottom-heavy, as that's what he is himself. Loves seeing girls and guys plump up. Gentle and highly intelligent, tall with messy brown hair and sensitive eyes. Has had infatuations with most of the other characters (Madaline, Heidi, Regan, Heaven, Yanis, Justin, Deavon, Karina). Has just broken-up with the sassy fat black junior Lulu.<br>\r\n<br>\r\n<b>Justin Tighe</b>, 17. The handsome, strong lead in the school play and outrageously gay. Obsessed with staying in shape and a little rude to others. Hopelessly in love with the soft, highly sexual Deavon, who confuses him with what he truly desires. Best friends with Lauren, the female lead in the school shows.<br>\r\n</span></div></div>",
            "created":1513746000,
            "id":2430761,
            "title":"Let's start at the very beginning"
        },
        "11":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Starts trying to normalize fatness, gains weight herself.",
                "Starts feeding Rachael.",
                "Convinces Heidi that being fat is good",
                "Walking downtown one day, she enters a mysterious shop...",
                "Maybe you want an expansion story instead"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Great! Let's see what options Madaline has.</span></div></span></div>",
            "created":1513746000,
            "id":2430763,
            "title":"Madaline"
        },
        "111":{
            "author_id":"throwmeaway",
            "author_name":"Blu",
            "choices":[
                "Madaline got up and made herself a huge breakfast",
                "Madaline got dressed for the day"
            ],
            "content":"<div class=\"\"><div> <span>Madaline has always been a rather chunky girl. She never really was proficient at any sort of physical sports, and her interest in dancing began to deteriorate as she grew older and grew heavier. Being the 160 pound 5'3\" girl she was, it was difficult to perform ballet or try to tap dance anymore. Sometimes even the stairs were too much for her. Combine that with her love for food and interest in fat women made her a woman who embraced her \"plus-sized\" lifestyle rather than to avoid it.<br>\r\n<br>\r\nMadaline's closeted attraction towards other fat girls and her arousal at her own chubbiness made her also embrace the fat acceptance movement. She was commonly found calling other large woman online \"queens,\" as she jealously admired their curves and softness. Occasionally she'd mention her desire to be an even larger girl to her girlfriend Rachel, who was a little indifferent towards the idea. So Madaline's fantasy stayed a fantasy for the first 6 months of the two girls relationship, at least until she had moved in.<br>\r\n<br>\r\nMadaline had put on about 30 pounds in the past month as she began to get more and more into the fat acceptance movement. She blogged frequently about her daily meals, her growing waistline, and the rights she was fighting for. Rachel was obedient and had plenty of money to support her stubborn girlfriend's new hobby of eating. Besides, Rachel thought it was kind of hot too, seeing how aroused her chubby girlfriend was after loading her up with about 4,000 calories.<br>\r\n<br>\r\nMadaline woke up on a Saturday morning at around 11am like she normally did. Her belly growled, the 10 hours of sleep she had gotten had given her plenty of time to digest those 2 pizzas she had polished off last night. From here...</span></div></div>",
            "created":1551743220,
            "id":2626414,
            "title":"Starts trying to normalize fatness, and gets fat"
        },
        "1111":{
            "author_id":"throwmeaway",
            "author_name":"Blu",
            "choices":[
                "Madaline eats it all",
                "Rachel helps Madaline finish it"
            ],
            "content":"<div class=\"\"><div> <span>The big girl got up, stretched a bit in her shrunken pajamas, and waddled off to the kitchen where she would prepare a hearty breakfast. She tossed about a dozen strips of fatty bacon onto the griddle and began preparing a few thick bagels loaded with lots and lots of cream cheese to give her something to eat while she prepared more food for her to eat.<br>\r\n<br>\r\nRachel was still asleep on the couch, having gone to bed on the couch while watching TV. Madaline planted a kiss on her forehead as her skinny girlfriend slept, choosing not to interfere with her much needed sleep, then got back to the kitchen.<br>\r\n<br>\r\nAfter about 30 minutes, Madaline had prepared nearly two dozen strips of thick-cut bacon, two 4 egg omelettes, 15 pancakes, and 8 cream cheese bagels. Well, Madaline had already finished her 8 bagels while preparing everything else, but the fat girl sat down, ready to eat.</span></div></div>",
            "created":1551771180,
            "id":2626572,
            "title":"Madaline got up and made herself a huge breakfast"
        },
        "11111":{
            "author_id":"throwmeaway",
            "author_name":"Blu",
            "choices":[
                "Is impressed by how much Madaline ate",
                "Still wants Madaline to eat a little more"
            ],
            "content":"<div class=\"\"><div> <span>Madaline placed her hands on her round and full belly as she prepared herself for the incredibly huge meal she was going to be having to both protest against the dreaded fat-shamers, and to combat her newly heightened appetite. She took a picture of the food and of her belly happily before she picked up a fork and began to chow down.<br>\r\n<br>\r\nMadaline began by tossing a few handfuls of bacon into her wide mouth, while chasing the salty and savory taste down with a swig of whole milk. She massaged her belly, more so in pride as she worked down all two dozen strips of bacon like a queen.<br>\r\n<br>\r\nNext Madaline came around to the omelettes. She covered them in salt, pepper, and cheese before letting them soak up the bacon grease on her platter. She began to take chunk after chunk of the omelettes and push them between her lips like a fat machine, getting them both down in record time.<br>\r\n<br>\r\nFinally, a stack of 15 chocolate chip pancakes doused in syrup sat on the other end of the table from a bloated but determined Madaline. She untucked her belly from her pajama bottoms and began rubbing it in a circular motion with her left hand as her right drowned the pancakes in more syrup. She began polishing those off soon after, making sure to wash down pretty much every bite with a swig of whole milk.<br>\r\n<br>\r\nAbout 45 minutes later, Madaline sat in front of an empty platter, feeling proud, a little aroused, a bit sick, and very fat. She got up from her seat as Rachel began to start moving.<br>\r\n<br>\r\n“Good morning sunshine! You’ll never believe what this fat bitch just ate for breakfast,” Madaline said as she wrapped her pillowy arms around her thin girlfriend, pulling Rachel into her own fat body.<br>\r\n<br>\r\nRachel...</span></div></div>",
            "created":1552030980,
            "id":2627629,
            "title":"Madaline eats it all"
        },
        "111112":{
            "author_id":"jimb0cit0",
            "author_name":"Jimmy Jewell",
            "choices":[
                "Madaline finishes and has to sit down",
                "Continues to eat",
                "She offers Rachel sone bacon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rachel watched as Madaline cooked up a fresh pan of bacon and devoured it all, stuffing piece after piece into her mouth. </span></div></span></div>",
            "created":1583977980,
            "id":2800313,
            "title":"Still wants Madaline to eat a little more"
        },
        "114":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "The woman is an old hag",
                "The woman is also knockout gorgeous, and very soft. "
            ],
            "content":"<div class=\"\"><div> <span>One day, following a very productive rally for fat acceptance, Madaline started walking home from downtown. She was wearing olive green leggings that clung liks a second skin to her  big booty and thunderous thighs. Her shirt rode up somewhat. Already distorted by her breasts, it exposed a pale strip of soft belly fat. This was very much intentional. After all, the local newspaper had printed a very nasty editorial about how gross summer gain is and the local fat chicks had to make a stand somehow!! The summer sun glinted on his glasses and scarf and long brown hair. <br>\r\n<br>\r\nJust them, lost in thought, she noticed she had wandered into a strange part of town by mistake. It was full of grungy little shops and ethnic restaurants. One of them was an Indian place. Inside was a gorgeous average weighted Indian girl, a waitress in a sari. Madaline got very hot and flustered thinking about her, but luckily the Indian waitress didn't notice. <br>\r\n<br>\r\n\"Not my type anyhow.\" Madaline thought. \"Too skinny by about 100 pounds\"<br>\r\n<br>\r\nShe tried to check her phone for directions, but it quickly died. \"Ah no! And right when I'm lost!\" <br>\r\nShe turned and walked into the nearest boutique, \"The Weight Gain Shoppe\" to check with a clerk about how to get to the main drag. She figured the shop was for bodybuilders or something, not holding out hope. Inside, the store was musty and gloomy. Strange srtifacts related to the history of weight gain sat on shelves. A bell sat on the counter. Madaline rung it and from the back emerged a woman. </span></div></div>",
            "created":1516248480,
            "id":2442251,
            "title":"The Weight Gain Shoppe"
        },
        "115":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Inflation (air, water, blueberry)",
                "Belly Expansion",
                "Butt/Boobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of expansions?</span></div></span></div>",
            "created":1514178000,
            "id":2432497,
            "title":"Expansions!"
        },
        "1153":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Butt ",
                "Boobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1514178000,
            "id":2432498,
            "title":"Butt/Boobs"
        },
        "12":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Goes for Yanis, he's an FA",
                "Hangs with Heaven, begins to eat like her.",
                "Zoe or Brie are FAs, they're in love.",
                "Something happens to the entire LGBT club",
                "Maybe an expansion?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Superb! Let's see what options Regan has!</span></div></span></div>",
            "created":1513746000,
            "id":2430764,
            "title":"Regan"
        },
        "122":{
            "author_id":"throwmeaway",
            "author_name":"Blu",
            "choices":[
                "Order double what Heaven does to try and impress her",
                "Ask Heaven if she wants to start actually dating her"
            ],
            "content":"<div class=\"\"><div> <span>Regan sat down next to her crush for one of their usual lunch dates. Heaven and Regan had recently become close friends, and in great part due to the silent attraction between the two.<br>\r\n<br>\r\nRegan had recently been having feelings for other girls around her. Particularly, chubbier girls like Heaven. Something about her appetite, aversion to physical activity, and confidence with her weight was so strangely attractive to the relatively skinny Regan.<br>\r\n<br>\r\n2 months of Regan’s interest in this chubby girl had also had some effects on her. Regan still was as popular as had been, but her figure began to suffer. Her thin build with a perky butt became a slightly pudgy one with a bubble butt. Regan didn’t notice or care much, but her previously strict diet had loosened up a bit as she tried spending more time with the girl she was so fascinated with.<br>\r\n<br>\r\nToday was no different. Regan was going to lunch with Heaven again. Cheeseburgers were the thing Heaven was craving and a horny Regan was more than happy to hear that. The two girls made their way down to the nearby “Grease Shack Burgers,” were they would scour the menu they both already knew so well.<br>\r\n<br>\r\nRegan wanted to try to do something different today. Today was the day she would:</span></div></div>",
            "created":1551772260,
            "id":2626573,
            "title":"Hangs with Heaven, begins to eat like her."
        },
        "123":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Zoe",
                "Brie",
                "Together!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one? Or them both conspiring together?</span></div></span></div>",
            "created":1513746000,
            "id":2430765,
            "title":"Zoe or Brie?"
        },
        "125":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Inflations like Blueberry or Air or Water?",
                "Boobs",
                "Butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind?</span></div></span></div>",
            "created":1514178000,
            "id":2432499,
            "title":"Maybe an expansion?"
        },
        "13":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Ted begins to eat. A lot. ",
                "Ted is fattened by a secret admirer. How the tables turn!",
                "Ted begins fattening up some people?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wonderful! What happens with Ted?</span></div></span></div>",
            "created":1513746000,
            "id":2430767,
            "title":"Ted"
        },
        "133":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Madaline, Heidi, Olive? They're family friends and adore having Ted over.",
                "Regan, Zoe, Brie, Mary Rosalind, Karina? Ted attends the club.",
                "Justin, Deavon, Yanis? Ted is assigned to decorate the prom with the guys."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ted is the lynchpin, he can connect to any of the other stories! But which one?</span></div></span></div>",
            "created":1513746000,
            "id":2430771,
            "title":"Who?"
        },
        "1331":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "A bottle of weight gain liquid",
                "A magical totem",
                "A strange alien device"
            ],
            "content":"<div class=\"\"><div> <span>Ted stood in the mirror, washing his face and checking himself out. At 17, he was remarkably mature looking and very handsome. He had dark sensitive eyes and a classically handsome face framed by a lot of tall poofy hair. He was dressed in a nice button-shirt and dress pants and would have been considered a very cute pretty boy had it not been for one thing. <br>\r\n<br>\r\nTed was chubby. <br>\r\n<br>\r\nAt 6'2\" and 240 pounds  he was very much overweight. His belly strained against his shirt and his moobs were small but definetely prominent. His dress pants were tight against his big butt and thick thighs, but his face seemed to still be thin. And he loved it. You see, Ted had a thing for fat and bottom heavy, no matter the gender of the person. And the good news was, Greenwake had no shortage of women and men for him to fancy. <br>\r\n<br>\r\nToday was something special. His parents were out of town and he was invited to have dinner and stay the night with some family friends, the Bakers. Now, the Baker family had a predisposition to fat. The dad Daniel was overweight, but he would be out of town. The good news was that his wife Heidi was there. She was voluptuous yet thin, and constantly dieting despite her killer curves. Also present would be her daughter, feisty body positvity activist Madaline, very chubby and proud of it. Ted wanted to talk to her about some body positivity stuff and the benefits of fat. Also present would be the younger Baker, chubby little Olive and her friend Carrie, having a sleepover. Possibly Madaline's girlfriend Rachael would drop by too.<br>\r\n<br>\r\nTed smiled to himself, it was time to put his magical plan for the changing of the world into fat into action. And it would start with him and the Bakers. From his pocket, he pulled out and studied:</span></div></div>",
            "created":1514782800,
            "id":2435390,
            "title":"Madaline, Heidi, Olive? "
        },
        "13311":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Take a test swig",
                "Save for tonight"
            ],
            "content":"<div class=\"\"><div> <span>Ted pulled put a large  green bottle. It was somewhat unassuming, but hidden inside was a mysterious liquid of unimaginable power. This was Fat Acceptance in a bottle. He had purchased it at an antique store. The label read \"Grove's Tasteless Chill Tonic\", beneath it the slogan \"Makes Children and Adults as Fat As Pigs!\" There was a cartoon of a pig with a smiling boy's head.  It was very old, from the 1930s, distributed as an end to hunger and starvation during the Depression, and then quickly recalled. <br>\r\n<br>\r\nAccording to the instruction book, the tonic rewrote the mind and body. Causing rapid, instantaneous weight gain by about thirty pounds. It then increased appetite, and every bit consumed added 5 pounds. On top of all that, every pound gained left a warm rush of druglike dopamine, causing a lot of happy feelings, and sometimes even sexual ones. In summary, it made it's drinker softer, hungrier, happier, and freer. The drinker would be a BBW or BHM in no time, and soon inviting others to join in. <br>\r\n<br>\r\nTed looked at it. He wondered if it really worked. Should he do a quality test, get himself in the mood, or save it for later.</span></div></div>",
            "created":1515906000,
            "id":2440838,
            "title":"A bottle of weight gain liquid"
        },
        "133111":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Noticed the gain",
                "Did not notice the gain."
            ],
            "content":"<div class=\"\"><div> <span>Ted decided. He needed to know if the stuff worked. Just a little bit, to get himself mentally ready and more open to share. He cracked the ancient seal and smelled the sweet liquid inside. If he was going to get the Bakers to drink this, then they had to have it slipped in their drinks and what if they prematurely noticed the jig was up? He had to test. <br>\r\n<br>\r\nTed poured himself a glass of water and pulled out the instruction book. One capful of tonic equaled thirty pounds. Ted figured a gain that size would be suspicious to everyone except Madaline (who knew his preferences and supported them), so he poured himself a third of a capful. <br>\r\n<br>\r\n\"Only ten pounds. That's nothing!\" He said. <br>\r\n<br>\r\nHe then poured the third of a cap into the glass and drank deeply. Sure enough, no taste nor smell. Good. Ted got a warm feeling flowing through his veins. Suddenly his clothes began to feel slightly tighter. His stomach pooched outwards, beginning to muffin top over his pants, which were becoming skin tight over his widening hips and thighs. He arms got soft, and his face became rounder, with the slightest hint of a double chin. He felt very giddy and in love with his body. <br>\r\n<br>\r\nThe tonic worked. He pulled on a button shirt with newfound difficulty, packed an XXL pair of pajamas, and drove over to the Baker house.<br>\r\n<br>\r\nWhen he got there, Heidi was at the door, and she-</span></div></div>",
            "created":1515906000,
            "id":2440849,
            "title":"First gain of the evening"
        },
        "1331111":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "\"Talk with Madaline. Where is she?\"",
                "\"Talk with Olive and Carrie. Where are they?\"",
                "\"Try this new shake\""
            ],
            "content":"<div class=\"\"><div> <span>\"Teeeeddd!\" Heidi screamed as she threw her arms around him. \"It's so good to see you! It feels like it's been forever!\" \"It has been a little while, and I'm very glad to see you.\" Ted said. Heidi threw her arms deeply around him and drew him in for a long hug. She noticed the hug was a little squishier than she had noticed. That seemed odd, but not unusual. <br>\r\n<br>\r\nHeidi lived with a somewhat chubby family, and she was once like that too. In her youth, she weighed over 280 pounds, and almost all of it went to her hourglass figure. But now, Heidi had repressed that in favor of her health. In recent years, now that she was reaching her forties, she had begun replacing two of her mostly spinach meals with disgusting VegeCleanse shakes that tasted as if they had sand in them. She was 150 pounds, rail thin but still with an ass and birthing hips that filled her mom jeans and C-Cup boobs framed by her long golden hair. <br>\r\n<br>\r\nTed on the other hand had always been soft, and she worried about him. It wasn't healthy for a handsome boy to be that stout. But still, in the two years since Ted moved into town and the two families became close, she found him very handsome despite his weight. Some nights she thought..,. <br>\r\n<br>\r\nBut no. There was still Daniel, and she didn't want a repeat with Willy, who-<br>\r\n<br>\r\n\"Come on in. I've made some drinks for later. A very special kind of shake just for you, I know you don't like the normal ones. Then I'll show you to where you'll be sleeping.\" She wondered vaguely why Ted was wearing a button-up shirt but put it out of mind. <br>\r\n <br>\r\nTed spoke up \"Actually first, I want to...\"</span></div></div>",
            "created":1516247340,
            "id":2442244,
            "title":"Happy Heidi and Tubby Ted"
        },
        "13311111":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "He pulls out the bottle"
            ],
            "content":"<div class=\"\"><div> <span>\"I want to talk with Madaline. Where is she?\" Ted asked. Heidi pointed up the stairs and said \"She's in one of the guest bedrooms. She'd love to talk with you.\" Ted said \"Great!\" and bounded up the stairs. Heidi watched him go, watching his ass jiggle in the confines of his pants and sighed to herself. \"That boy would be really cute if he weren't so plump!\" She said quietly. <br>\r\n<br>\r\nUpstairs, Madaline was sat in her room, clad in sweatpants and a baggy shirt. She was lounging on her bed, bored by the thought of a night with her diet-obsessed mother, when she heard a knock on her door. <br>\r\n<br>\r\n\"Yes, come in!\"<br>\r\n<br>\r\nThe door opened. \"Hey Madaline! It's Ted!\" <br>\r\n<br>\r\nShe turned, glad to see him. But then she paused a moment. \"Notice anything different about me?\" he said. <br>\r\n<br>\r\n\"You're much fatter.\" She said, gaping. \"Oh yes. I am much fatter. I gained about ten pound since you last saw me,\" he responded. Madaline jumped up and gave Ted a big hug, his second today. Their big bellies squished. \"You know I don't lean that way, but I do have to say you look dead sexy.\" She said, squishing his fat folds. \"It's not the only thing that got big.\" He cautioned before jumping around and sticking out his butt. Madaline giggled. <br>\r\n<br>\r\n\"But that's not all\" Ted said<br>\r\n</span></div></div>",
            "created":1516312140,
            "id":2442499,
            "title":"Two fatties talk"
        },
        "133111111":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "\"Yes, I love my family too much to have them missing out on this!\"",
                "\"No, the feelings this gives me are too weird to have my family feel.\"",
                "\"No, I want it for myself! Gimme!\""
            ],
            "content":"<div class=\"\"><div> <span>Ted pulled out the small bottle of Grove's Chill Tonic. It shone oddly in the light. Madaline looked at it in wonder. \"What is it?\" she said.<br>\r\n<br>\r\n\"This is the key to our revolution, and how I got fatter so quick,\" said Ted.\"It's an old recipe for instant weight gain. A single capful gives you thirty pounds, and I purchased the antique store's entire stock. There's other properties too. Feelings of happiness, feelings of acceptance, it make's your skin better, and it makes you look more beautiful the fatter you grow. And then you want to spread it to as many people as possible\"<br>\r\n<br>\r\nMadaline stood there in awe. This was everything she ever wanted. After years of trying to convince everyone that fat was beautiful, now she could just make them that way. <br>\r\n<br>\r\n\"Can I try a sample? See how it feels?\" She asked. Ted immediately obliged, pouring out another third of a capful. Madaline greedlily swallowed it down and then immediately began to glow as her belly and breasts began to pooch out further and her cheeks got puffier. Her butt swelled, now the size of two volleyballs, but much wider. <br>\r\n<br>\r\n\"I feel amazing!\" Madaline said. Ted nodded approvingly \"Indeed, My plan is to use your whole family as test subjects and then see what happens! That okay with you?\"<br>\r\n<br>\r\nMadaline paused for a moment, hand on her plump middle, </span></div></div>",
            "created":1518017160,
            "id":2450358,
            "title":"The Key to The Revolution"
        },
        "1331111111":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Fatten up Heidi first?",
                "Fatten up *everyone*"
            ],
            "content":"<div class=\"\"><div> <span>Madaline emphatically stated that she was okay with Ted's plan. In fact, she had been trying to fatten up her family for a long while, but it was slow going and they didn't always understand why Madaline felt the way she did. Heidi was once very overweight, but had since lost all the pounds. Her dad was fat, but almost never interested in homelife. She maintained a good relationship with Olive, a plain girl of 150 pounds who shared her mom's blond hair and her sister's appetite, but Olive was a young teenage girl and she was constantly pressured by media to feel bad about her weight, a trait she shared with her flirtatious friend Carrie. Carrie was a brown haired pretty young girl of normal weight: not skinny, not fat, but always was forced into feeling bad about her body by her parents.<br>\r\n<br>\r\nAnd tonight Madaline was staying over, away from her beautiful girlfriend who supported Madaline despite a buff figure. She was in another city for a day, and Madaline didn't feel comfortable sleeping alone, she didn't feel comfortable here either. Although her family were never outright sniffy about her efforts, they never really understood.<br>\r\n<br>\r\nUntil now. Until Ted.<br>\r\n<br>\r\nJust then Madaline was snapped out of her reverie by Heidi calling up the stairs. \"Hey, you two! Shakes are ready!\" Madaline groaned at  the thought if drinking one of those sand-smoothi's, but Ted stopped her. \"Wait, there's no need to feat! This is perfect. This is exactly what we've been looking for! Get me? This is how we make them see the light! Do you understand?\"<br>\r\n<br>\r\nMadaline nodded, this was perfect.  Only how do we go about it<br>\r\n<br>\r\n</span></div></div>",
            "created":1518279720,
            "id":2451353,
            "title":"The Fat Girl's Thin Family"
        },
        "13311111112":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Ted and Madaline greedily drink their shakes due to the liquid's effects",
                "They slip in the liquid and wait."
            ],
            "content":"<div class=\"\"><div> <span>Ted leaned in, a smile spreading across his soft face. \"Everyone present is going to see the light. I'm ready and I know you are too. Who's in the house?\" Madaline thought for a brief moment, but quickly remembered. \"There's us, and mom, but then there's Olive and Carrie. Rachael might be coming over later. Are you really going to make all of us fat?\" Ted smiled and shook the bottle seductively.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\nDownstairs, the blender was grinding away irritably. Heidi was standing over it, proudly pouring out five beige, bland shakes. She was wearing stretchy blue jeans and a t-shirt, with a light cardigan over it, and felt very happy. \"Ted, Maddy! Come down, I have drinks for you!\" Immediately she brought out three drinks to the living room and placed them on a table. Down the stairs came Ted and Madeline very quickly, bellies wobbling and swaying. Heidi did a double take, sure that they were already fatter than they were before. They were going to sit and talk because Heidi wanted to know how Ted was doing at school and how Madaline's new job was going. Heidi turned and headed back into the kitchen to prepare a plate of veggie crackers to go with the shakes. Ted and Madeline sat down next to each other on the sinking, old red couch, close together so their thighs were touching.</span></div></div>",
            "created":1525377780,
            "id":2487766,
            "title":"Everyone gets fat."
        },
        "133111111122":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Everyone gets hungry",
                "Heidi says something.",
                "Carrie and Olive hear something."
            ],
            "content":"<div class=\"\"><div> <span>In the kitchen, Heidi was humming gently. Ted, as soon as she left the room, slipped a capful into each shake, and then squirreled the bottle away. He and Madaline sat quietly, both secretly very excited for what was going to happen. Madaline's belly pushed her shift out significantly, while her arms filled her sleeves and her large boobs had rounded up slightly. Her hips were large and plush, but her face was still mostly thin, but puffier. Ted on the other hand, had the start of a double chin, and his belly strained his button-up shirt, resting on top of his huge, feminine thighs and hips. Madaline turned to Ted. <br>\r\n<br>\r\n\"I want to thank you for introducing me to this tonic. Before I thought plump was just as good as other body types and all bodies are beautiful, but I see now that fat's where it's at.\" Madaline said.<br>\r\n<br>\r\n\"Indeed. Everyone should feel this way,\" said Ted. \"It's really sexy. How much do you think you weigh now?\"<br>\r\n<br>\r\n\"Well before I weighed about 250, so after that then pounds I'm at 260. Wow.\" Madaline lifted up her stomach and let it fall, sending her body jiggling. <br>\r\n<br>\r\n\"I'm at 255 or so now.\" said Ted. \"I just look slightly lighter due to my height.\"<br>\r\n<br>\r\n\"What about your height?\" said Heidi, entering the room with a huge spread of crackers and cheese. <br>\r\n<br>\r\n\"Oh nothing. I've just put on a few pounds is all. Madaline's doing some body positivity help. Wow, that's a lot of crackers!\" Ted said quickly, turning pink and quickly changing the subject.<br>\r\n<br>\r\n\"It is, and if you feel like you're getting too fat, you don't have to eat any.  I also have some nice diet cookbooks I can recommend,\" said Heidi. \"They really helped me slim down.\" She patted her stomach for emphasis. <br>\r\n<br>\r\nThey each grabbed a VegeCleanse shake. <br>\r\n<br>\r\n\"Here's to a nice evening, a fun party, and a great time.\" Heidi toasted. \"You have no idea, mom.\" said Madaline under her breath. <br>\r\n<br>\r\n\"Cheers!\" everyone said, and drank deeply.<br>\r\n<br>\r\nTed and Madeline drained their glasses. Heidi took a moderate sip at first, but was surprised by the improved taste. Normally these cleanse shakes were very flavorless, but this tasted wonderful. She took a long swig. <br>\r\n<br>\r\nAll of a sudden, all three of them felt a shiver go through their bodies, followed by a pleasant war rush. Neurotransmitters flooded their brains and they began to feel a pang of hunger, followed by extremely pleasant relaxing sensations. It was almost akin to an orgasm. <br>\r\n<br>\r\nSoon they began to get fatter, very quickly. Madaline's stomach began to quickly pudge out, forming one large dome, and her breasts grew, going from C-Cup to a D-Cup quickly. Her sweatpants became very tight as her thighs became very thick and large. Her butt and hips swelled up tremendously, now almost visible through the pants. Her face started to form a double chin and her cheeks became puffier. She now weighed about 290 pounds.<br>\r\n<br>\r\nTed's face, on the other hand, finally blossomed into a cute double chin and full cheeks. His big belly bloated outwards, busting off button after button on his shirt as it oozed across his widening lap. He ended up with a very bottom heavy shape, with not much moob action, but a burgeoning lower belly and huge hips and bubble butt, straining his dress pants as they made stretching noises against the vast expanse of his ass and thighs. He was now 275 pounds.<br>\r\n<br>\r\nHeidi, though. Heidi outclassed them all. Not in terms of weight (she only went from 140 to 170), but speed. Starting with her thin waist. she ballooned up, her whole body thickening, as her stomach grew pudgy and turned into a small double roll, her boobs going up a size to C-Cup, and her famous booty getting bigger. Luckily her leggings were more than willing to accommodate it and her new thunder thighs, and her face grew softer and more youthful. Her shirt began to roll up, leaving a ring of pale flesh visible. <br>\r\n<br>\r\nAs the inflation wore off, all three sat there in stunned silence, feeling happy like never before.<br>\r\n<br>\r\n</span></div></div>",
            "created":1525742040,
            "id":2489821,
            "title":"The Weightiest Moment."
        },
        "1331111111221":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "She was attracted to her own mother?!",
                "She was attracted to Ted. She's bi!"
            ],
            "content":"<div class=\"\"><div> <span>Everyone, as one, just looked at each other and then dug in to the crackers and cheese on the table. All manners were forgotten in the mad rush to stuff faces as quickly as possible. Little tiny sprays of crackers and cheese were thrown everywhere as their cheeks bulged.  And of course, the serum did its work well. As they scarfed down the food, fat started steadily to accumulate on their bodies. Stomaches bulged out, butts grew bigger, boobs and moobs inflated, thighs thickened. All slowly but steadily. <br>\r\n<br>\r\nMadaline somehow managed to maintain at least some level of self awareness. Looking up, she noticed that she was sprawled out on the couch, the vast swell of her belly rising above her. Her thighs were so big she saw they were ripping holes in the stitching of her crotch. Looking over with vague interest, she noticed the other two were completely lost to hog heaven. <br>\r\n<br>\r\nHeidi was standing up, cramming handfuls of crackers (one of them had gone to the kitchen and grabbed several more boxes, plus other food) into her face. Her belly was properly huge now, starting to form a little droop. Her face had completely lost definition and was starting to form a second chin. Her leggings were almost sheer against her ghetto booty and her boobs were huge, rivaling Madaline's own. She was looking very wide now, her hips and torso were expanding sideways too. she had to be 190 pounds now.<br>\r\n<br>\r\nTed on the other hand was quickly becoming very large. The 300 pound boy was lost in a fantasy of fat. He was on his hands and knees now, face down in a bowl of grapes, eating like a pig. He belly scraped the ground through his popped, open shirt, and his ripping dress pants highlighted his fat ass stuck high in the air. <br>\r\n<br>\r\nLooking at the two of them, Madaline felt some odd feeling stirring in herself. It was attraction, but why?<br>\r\n<br>\r\nWith great effort she stood up and waddled over to Ted, slipping out the bottle from his pants pocket without him noticing. Looking down at it made her develop her second chin growing larger. A small label on the side of the bottle warned that it was not to be taken with any sort of powdered drink, as it could disrupt the chemicals that made one happy.<br>\r\n<br>\r\nIt was with some horror that she realized the drink had gone wrong and screwed up her sexuality!</span></div></div>",
            "created":1537209540,
            "id":2548973,
            "title":"Hog Heaven"
        },
        "1331111111222":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "\"You're right. We need to get your sister and her friend in on this\"",
                "\"You're right. We need to celebrate our bodies here and now\"",
                "\"I would, but I'm stuck on the couch!\""
            ],
            "content":"<div class=\"\"><div> <span>Heidi was the first to speak. <br>\r\n<br>\r\n\"Oh my god.\" she said quietly. <br>\r\n<br>\r\n\"So, Mom, what do you think?\" Madaline grinned. She began rubbing her prodigious gut, gently and unconsciously. <br>\r\n<br>\r\nHeidi stood up, and began running her hands up and down her body, feeling her new stomach. She reached around and grabbed onto her ass, cupping each plump cheek.  Her mouth fell open with shock. <br>\r\n<br>\r\n\"I'm fat!\"<br>\r\n<br>\r\n\"I know, mom.\"<br>\r\n<br>\r\n\"You look fantastic, Mrs. Baker.\" Ted chimed in.<br>\r\n<br>\r\n\"I haven't been this fat in years! Oh my god!\"<br>\r\n<br>\r\nHeidi started to smile broadly as the mind-altering chemicals kicked in. \"Or felt this good, what did you do to me?\"<br>\r\n<br>\r\nTed held up the bottle. \"I found this at a thrift shop, it's designed to make the drinker gain weight very quickly and feel good about it. I slipped some in our shakes. You like it?\"<br>\r\n<br>\r\nHeidi was smiling broadly. \"I love it so much. I wasn't expecting to love it, but I just feel blissful. Madaline?\"<br>\r\n<br>\r\nShe walked over to where Madaline, who stood up heavily. \"I'm so sorry for being negative about your weight in the past. I understand now why you campaign for this to be the new norm.\" She drew Madaline into a tight hug and their bellies squished together. \"I love you.\" <br>\r\n<br>\r\nShe pulled away and took Madaline's place on the couch next to Ted. Madaline herself sat down and the three of them took up the whole of the couch's space, their thighs touching. <br>\r\n<br>\r\n\"And Ted.\" Ted looked up at her. \"In the past I was worried about your weight. Now I can say you look cute at any weight, but especially with that cute little belly.\" She patted it. <br>\r\n<br>\r\n\"Thank you Heidi, that means a lot.\"<br>\r\n<br>\r\nMadaline piped up. \"We can't just sit here. We need to do something to celebrate.\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1537290480,
            "id":2549547,
            "title":"Heidi the New BBW"
        },
        "14":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Begins to unconsciously overeat",
                "Things get serious with Deavon",
                "Lauren gets jealous, and starts her master plan."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nice! What happens to Justin</span></div></span></div>",
            "created":1513746000,
            "id":2430773,
            "title":"Justin"
        },
        "141":{
            "author_id":"suzukamu",
            "author_name":"SuzuKamu",
            "choices":[
                "One whole week.",
                "Deavon notices. ",
                "The first performance!"
            ],
            "content":"<div class=\"\"><div> <span>Performing in school plays is no easy feat; especially when you're consistently the main character. And when you're Director and Producer procure rights to \"Into The Woods\" and feel the need to keep every song and every scene for integrity, being The Baker may not be the most stress-relieving role. At least Deavon was also cast, and as Jack no less! Too bad they weren't love interests. <br>\r\n<br>\r\nAfter another exhausting day of practice, and several compliments aimed at Justin, everyone begins packing up,ready to leave. Despite the countless compliments he's received, Justin can't help but focus on the couple negative remarks he's gotten. Remarks he's never gotten after his first main role. \"Your pitch is too high, your face isn't convincing, etc.\" Rushing out of the school's theater Justin heads to his car, a blessing and a status of how cool he was. Getting in his car, Justin breathes in and out for several seconds, tired from practicing all day. Justin checks his watch, it's 6:37 PM, his parents are at work and haven't made food, and he's still got homework and classes to study for. Thinking, Justin, sighs before deciding to get fast food, one day can't hurt he reminds himself. Cheat days are natural.<br>\r\n<br>\r\nSadly for Justin, the long hours of practicing don't relent, and the actual play won't be performed until two months from now. <br>\r\n<br>\r\nJustin continues eating out until...</span></div></div>",
            "created":1525800060,
            "id":2490178,
            "title":"Begins to unconsciously overeat"
        },
        "15":{
            "author_id":"stonefission",
            "author_name":"stonefission",
            "choices":[
                "Karina discovers a magical artifact on school grounds that grants wishes",
                "She falls in love with Ted",
                "Mrs. Heyman has a plan to keep her in line",
                "Mary Rosalind and her discovers something strange with Mrs Heyman."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hooray! But what will happen?</span></div></span></div>",
            "created":1513832400,
            "id":2431076,
            "title":"Karina"
        }
    },
    "info":{
        "author_id":"stonefission",
        "author_name":"stonefission",
        "brief_description":"LGBT teens get FAT and stand up for their sexuality in a world wanting thin and straight.",
        "created":1513807200,
        "description":"<td align=\"left\" class=\"norm\">Hey! This is a story about some LGBT teens plumping up and expanding! Thus is also a story about these fatty teens making a change, taking a stand, and fighting to change the world for gays and fat people everywhere! Have fun and try to keep characters consistent. First, some ground rules:<br>\r\n<br>\r\n<b>DO</b><br>\r\n- have weight gain, breast expansion, butt expansion, belly expansion, inflation of all kinds, blueberries, etc.<br>\r\n- have characters fall in love and have sexual feelings<br>\r\n- have characters interact across stories.<br>\r\n- make characters realistic people<br>\r\n- have magical or sci-fi situations as well as real ones.<br>\r\n- have TG for transgender characters or those related.<br>\r\n<br>\r\n<b>DO NOT</b><br>\r\n- have any transformations past those (no tf into animals, etc.)<br>\r\n- have gains past 500 ibs. <br>\r\n- have other fetishes instead of those or in addition. (No AR, AP, body swap, etc) <br>\r\n- No scat or vomit. No disgusting anything. Slob to a degree is fine, like burping and pigging out.<br>\r\n- have stories that are anti-gay in message. Anti-gay characters are fine<br>\r\n<br>\r\nAny violations will be removed.<br>\r\n<br>\r\nAwards 150 GP for good additions! HAVE FUN AND WRITE!</td>",
        "id":2143736,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/102629.jpg",
        "last_full_update":1583977980,
        "modified":1583977980,
        "pretty_title":"LGBT Male & Female Weight Gain/Expansion"
    }
}