{
    "chapters":{
        "1":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "Female",
                "Male",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we begin the story, what Gender do you identify with?</span></div></span></div>",
            "created":1451365200,
            "id":2080960,
            "title":"Welcome!"
        },
        "11":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "5 - 8",
                "9 - 12",
                "13 - 16",
                "17 - 25",
                "26 or older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, you're a Female. Which age group do you belong to?</span></div></span></div>",
            "created":1451365200,
            "id":2080963,
            "title":"Female"
        },
        "111":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "Yes, first time.",
                "No, second time.",
                "No, third time."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay! Is this your first time meeting the Rainbow Magic Fairies?</span></div></span></div>",
            "created":1539997620,
            "id":2565975,
            "title":"First Time As a Fairy?"
        },
        "1111":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "Decide to peer into the looking glass to see if you can spot anything.",
                "Decide to start your search in Fairyland.",
                "Decide to start your search in the human world."
            ],
            "content":"<div class=\"\"><div> <span>It was the start of the weekend and you were in your bedroom, listening to music.<br>\r\n<br>\r\nAs you danced in front of the mirror, something sparkly caught your eye. Fuchsia glitter cascaded to the center of the mirror to reveal a pretty winged girl with shiny brown bunches that was around the same age as you!<br>\r\n<br>\r\n“Hello!” She introduced herself, her voice tinkling like a miniature bell. “My name is Sienna the Saturday Fairy.”<br>\r\n<br>\r\n“You’re a… you’re a Fairy?” You asked innocently.<br>\r\n<br>\r\n“That’s right!” Sienna smiled sweetly. “I’m so glad I found you!”<br>\r\n<br>\r\n“You are? Why’s that?” You gasped as Sienna points her tiny pink wand at the mirror in front of you. Suddenly it transformed into a magic looking glass – it was misty at first but it quickly cleared to reveal the rooftops of a kingdom you had never seen or dreamed before – Fairyland.<br>\r\n<br>\r\n“Why are the rooftops so pale?” You asked, pointing to the faded fairy houses dotted over the hillside.<br>\r\n<br>\r\nAlthough Sienna’s face fell, her voice perked right up. “They used to be bright red, but now they’ve lost their color.”<br>\r\n<br>\r\n“That’s terrible!” You gasped.<br>\r\n<br>\r\nYou led your new friend over to the windowsill, and then took a seat on your bed. “I’m so glad you’re able to see the magic.” Sienna smoothed out her skirt and proceeded to tell you that Jack Frost had kidnapped Ruby the Red Fairy! The mean Ice Lord had apparently been plotting the sceme ever since Ruby forgot to invite him to the Midsummer Ball. The Rainbow Fairies and all their friends had searched Fairyland from top to bottom, but were unable to find even a trace of Ruby. “Ruby must be somewhere in the human world,” Sienna finished. “That’s why I decided to find you.” The little fairy fluttered over to touch your hand. “We know you’ve got a kind heart and that you believe in magic. Can you help find Ruby and bring the red back to Fairyland?” she asked sweetly.<br>\r\n<br>\r\nYou smiled and nodded your head at once.<br>\r\n<br>\r\n“Thank you so much!” Sienna clapped her hands, her little wings trembling with excitement. “There’s not a moment to lose!”<br>\r\n<br>\r\nYou…</span></div></div>",
            "created":1540101480,
            "id":2566602,
            "title":"Your First Fairy Friend!"
        },
        "11112":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "You decide to seek out the Rainbow Fairies in Fairyland.",
                "You think it’s best to visit the King and Queen at the Fairyland Palace.",
                "You decide to head straight for Jack Frost’s castle."
            ],
            "content":"<div class=\"\"><div> <span>You asked Sienna to take you to Fairyland straightaway, figuring that even if Jack Frost and his goblins had smuggled Ruby out of the kingdom, they might have left a clue or two behind!<br>\r\n<br>\r\n“Good idea!” Sienna smiled, spiraling up to the ceiling. Suddenly your hair felt shimmery and tickly. You looked up to see the Fun Day Fairy flying above you, sprinkling a fountain of fairy dust all around.<br>\r\n<br>\r\n“What’s happening?” You asked, as the room around you began to grow bigger and bigger. At first you seemed to shrink at a slow rate, but quickly, you began to shrunk faster and faster, your bed now a landscape before your decreasing size.<br>\r\n<br>\r\n“I’m shrinking you down to fairy-size of course!” Sienna burst into giggles, then pointed at the gauzy pair of wings that had appeared on your back.<br>\r\n<br>\r\nBefore you could say another word the wings began to gently flap. It only took a little wriggle of your shoulders to make them go faster. You walked to the end of your bed and looked down, your bedroom floor looking like it was a million miles away! You wondered to yourself if you could really be only a few centimetres tall?<br>\r\n<br>\r\n“Ready to go?” Asked your new friend, pointing to the bedroom window.<br>\r\n<br>\r\nYou reached for Sienna’s hand and gently fluttered out of the window, looking into the sky.<br>\r\n<br>\r\n“Look!” You shouted, after a little while. “I can see my school!”<br>\r\n<br>\r\nSienna nodded, then led you a little further up, towards a row of white puffy clouds. The two of you flew through the clouds for a long time.<br>\r\n<br>\r\nYou giggled. They felt like big cool pieces of cotton.<br>\r\n<br>\r\n“We’re just above Fairyland now,” Sienna told you. “Where do you want to go first?”<br>\r\n<br>\r\n“Um…”</span></div></div>",
            "created":1540102020,
            "id":2566603,
            "title":"Your Journey Begins"
        },
        "112":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "Nope. This is my first encounter with them.",
                "Yes. I’ve had one previous adventure with them.",
                "Yes. I’ve had many adventures with them."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay. Have you been involved with the Rainbow Magic Faries before?</span></div></span></div>",
            "created":1539997800,
            "id":2565976,
            "title":"First Time As a Fairy?"
        },
        "12":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "5 - 8",
                "9 - 12",
                "13 - 16",
                "17 - 25",
                "26 or older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright. You're a male. What age group do you belong to?</span></div></span></div>",
            "created":1451365200,
            "id":2080961,
            "title":"Male"
        },
        "124":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "First time meeting the Fairies",
                "Second time meeting the Fairies",
                "You're overtly familiar with the Fairies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this your first time meeting the Rainbow Magic Fairies?</span></div></span></div>",
            "created":1539234000,
            "id":2562774,
            "title":"First Time?"
        },
        "1241":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "You close your eyes and attempt to focus.",
                "You wholeheartedly agree to help, beginning your search in Fairyland.",
                "You wholeheartedly agree to help, beginning your search in the Human World."
            ],
            "content":"<div class=\"\"><div> <span>On your bed, you laid, head facing the ceiling, listening to music with your earphones in. It had been quite a stressful time, moving into temporary accommodation with your grandmother, and then into your new house. You still didn't have all of your furniture yet, but you at the very least had your bed, and that was all you needed for now.<br>\r\n<br>\r\nYou sighed, moving from your bed and over to your bedroom mirror. Looking over yourself in the mirror, you smiled. With your mother and brother working, and you having the day off, you had the whole house to yourself. Not that there was really anything to do.<br>\r\n<br>\r\nYou turned away from the mirror, feeling a slight tug on the cord to your earphones. Eventually, the earphones fell out, dropping to your side. \"What the…?\" You muttered.<br>\r\n<br>\r\nTurning back to the mirror in front of you, a wave of fuchsia glossed over the mirror, pooling in the middle as what looked to be a fairy flew down in front of you.<br>\r\n<br>\r\n\"Hello!\" She greeted, her voice ringing like a miniature bell, pure heaven to your ears. \"Sorry about taking out whatever was in your ears. I had to get your attention. My name is Sienna the Saturday Fairy.\"<br>\r\n<br>\r\nYou looked her over. Appearance-wise, she was similar to a young girl, though of course with butterfly wings and a pink wand in her hand. Her light brown hair was tied into two pigtails, and her pink shirt failed to cover her midriff. Despite the fact that she could've been a minor, and was nowhere near your size, you thought she was pretty attractive. \"Uh… hi… Sienna…\" you muttered, lowering your voice, as you weren't sure how sensitive the young fairy's ears were. \"Wh-what do you need my a-attention f-for?\"<br>\r\n<br>\r\n\"I have to show you something, okay?\" Sienna said. You nodded slowly.<br>\r\n<br>\r\nYour eyes widened as Sienna drew her tiny pink wand back before pointing it at your mirror. In an instant, it transformed from a facial mirror, into a sort of looking glass, allowing you to see the rooftops of a mysterious and mystical kingdom.<br>\r\n<br>\r\n\"What am I supposed to be looking at? The houses? The castle?\" You asked.<br>\r\n<br>\r\n\"Then you can see it!?\" She beamed.<br>\r\n<br>\r\n\"Yeah… the middle-age fairy tale kingdom?\"<br>\r\n<br>\r\n\"Oh! I just knew there was something special about you!\" Sienna smiled. \"Jack the Frost Giant has kidnapped Ruby the Red Fairy! I've been searching with my friends in Fairyland but we can't find her, so we figured she must be in the human world! If you can see Fairyland, that means your heart is pure and you believe in magic! Please help me find Ruby!\" Sienna begged, clasping her tiny hands together.<br>\r\n<br>\r\nAlthough you only understood about a third of what Sienna said, you were never one to turn your back on someone in need, even if she was a fairy. \"What can I do to help?\" You asked.<br>\r\n<br>\r\n\"Well, in order for you to help us, you're going to need to be able to fly, so-\" Sienna was cut short as the image in the mirror changed. Instead of the rooftops of Fairyland, you now saw a giant two-horned white beast sitting in what appeared to be a throne room. \"Oh no!\" Sienna cried. \"Jack the Frost Giant is plotting to take over Fairyland!\"</span></div></div>",
            "created":1539234000,
            "id":2562775,
            "title":"Meeting the Fun Day Fairy"
        },
        "12411":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "You follow Sienna's instructions and follow the rainbow.",
                "You decide to stay and survey the area where the necklace was found for clues."
            ],
            "content":"<div class=\"\"><div> <span>You closed your eyes in an attempt to focus. Everything seemed to be happening so fast, it was difficult to keep track. This girl, a fairy you'd only just met, had asked you to help her rescue her friend. Something about a Frost Giant, and a castle in a place called Fairyland, which the Frost Giant wanted to take control of?<br>\r\n<br>\r\nSlowly, you became overwhelmed by a tingling sensation running through your body. Opening your eyes, you watched in confusion as Sienna darted quickly above you, sprinkling strange pink dust onto and around you. Your room glowed with millions of little stars as they touched your skin.<br>\r\n<br>\r\nThe entire room seemed to be growing around you, with Sienna getting further and further away from you. \"Wh-what's happening to me?\" You asked, feeling a little queasy.<br>\r\n<br>\r\n\"I'm shrinking you down to fairy-size,\" Sienna smiled, calling down to you, the fairy slowly getting further and further away from you.<br>\r\n<br>\r\nAs you stopped shrinking, you found yourself standing on the carpet of your bedroom floor, Sienna flying above you. You were about three inches tall, maybe a little bigger than that. Somehow your clothes shrank with you, which you were thankful for.<br>\r\n<br>\r\n\"I'm tiny!\" You gasped, once for size, and again for how high-pitched your voice had become.<br>\r\n<br>\r\nSienna flew down to you, hovering above the carpet. \"Take a look at your back!\" She insisted, laughing prettily.<br>\r\n<br>\r\nYou turned, looking behind you to see a pair of fairy wings had formed from your back, two holes having appeared at the back of your shirt for space. \"Wings?\" You asked softly.<br>\r\n<br>\r\nSienna nodded, looking at you endearingly. \"Give them a go.\"<br>\r\n<br>\r\nIt was strange. Even though you had only just gotten those wings, you could feel them, and it was almost as if you'd always had them. They were true extensions of your body. With just tiny movements with your shoulders, you were able to get both your wings to begin to flap.<br>\r\n<br>\r\nYou gently moved about, flapping your new pair of wings back and forward, as you slowly found yourself ascending into the air. \"I can fly?!\" You shouted, your voice tinkling the same sweet way as Sienna's.<br>\r\n<br>\r\nSienna flew over to you, now the same size as you both hovered in the air. Taking your hands in her's, Sienna smiled. \"Come on! Let's fly around a little!\" She urged.<br>\r\n<br>\r\nYou smiled, pushing yourself further into the air. Flying around your bedroom, yours and Sienna's hands intertwined, you moved around with grace and precision. \"This is so cool!\" You gushed.<br>\r\n<br>\r\nSienna giggled. \"You're a natural!\" She smiled.<br>\r\n<br>\r\n\"It helps that you're by my side, helping me.\" You said. \"I honestly thought I was gonna fall for a few moments at the beginning. I probably would have if it weren't for you, so thanks.\"<br>\r\n<br>\r\n\"You're welcome,\" Sienna smiled, a blush slowly creeping onto her face, which she shook off. \"We can't waste any time, let's go!\"<br>\r\n<br>\r\nOnce again taking Sienna's hand in your own, the two of you left your house and flew high above the sky. Allowing Sienna to lead, the two of you eventually arrived in Fairyland, although the whole place seemed dull and devoid of color.<br>\r\n<br>\r\n\"It's not usually like this,\" Sienna explained. \"Jack's done some really nasty work!\" She said, the two of you flying together.<br>\r\n<br>\r\nYour eyes widened, zeroing in on a neckless that seemed to have been abandoned on the ground. \"Sienna! Over there!\" You shouted.<br>\r\n<br>\r\n\"What is it?\" She asked, before answering her own question with a gasp. \"That's Ruby's rose charm!\"<br>\r\n<br>\r\nThe two of you flew over to the location of the charm, yourself picking it up and holding it reverently in your hands.<br>\r\n<br>\r\n\"So, she was here before…?\"<br>\r\n<br>\r\n\"Yes…\" Sienna said sadly, before turning to you, a determined look in her eyes. \"You've got to find Ruby!\" She shouted.<br>\r\n<br>\r\n\"Aren't you coming with me?\" You asked.<br>\r\n<br>\r\nSienna shook her head. \"I should stay and protect this place from Jack's magic should he return.\"<br>\r\n<br>\r\n\"Ah…\" was all you could say. \"What should I do with Ruby's necklace?\"<br>\r\n<br>\r\n\"Hold onto it and give it back to Ruby when you find her. Will you be okay finding Ruby on your own?\"<br>\r\n<br>\r\n\"I think so…\" you muttered, placing the necklace in your pocket. \"I'm just not sure where to start…\"<br>\r\n<br>\r\nSienna smiled, pointing up at the sky towards a rainbow. \"Why don't you follow the rainbow?\" She suggested.<br>\r\n<br>\r\n\"They lead somewhere?\" You asked.<br>\r\n<br>\r\n\"Of course, they do!\" Sienna chirped. \"And I know you'll be able to find Ruby! Just believe in magic, and believe in yourself, and you'll find Ruby, I'm sure of it!\"<br>\r\n<br>\r\n\"Thanks for instilling all that faith in me.\" You smiled. \"Well, I'd best get started looking for Ruby!\"</span></div></div>",
            "created":1539313980,
            "id":2562776,
            "title":"Sienna's Up-And-Decision"
        },
        "124111":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "You head north of the clearing, to the cottage.",
                "You head south of the clearing, to the harbor."
            ],
            "content":"<div class=\"\"><div> <span>As per Sienna's instructions, you followed the rainbow to see where it led, yourself also hoping that the vantage point you were at could help you find Ruby.<br>\r\n<br>\r\nYou sighed, noticing the absence of red in the rainbow, no doubt due to Ruby's kidnapping. It was just so jarring to you. It couldn't be a rainbow without the colour red.<br>\r\n<br>\r\nAfter a while, the rainbow dipped down through the clouds, through the sky and back down to the ground. You followed, using your wings to land carefully in a forest clearing, where the rainbow had faded.<br>\r\n<br>\r\nAside from the grass in the clearing, there was nothing. Well, aside from a giant black cooking pot. Curiously, you walked up to it. Without even touching it, you could feel the heat from it. It had obviously been sitting in the sun for a long time.<br>\r\n<br>\r\nFrom the angle you were at, the sun's rays felt great against your wings. You closed your eyes, sighing to yourself.<br>\r\n<br>\r\n\"Hello!\" Said a feminine voice. With a fright, you turned around quickly to see two young girls bounding towards you, friendly expressions on their faces.<br>\r\n<br>\r\nIt didn't occur to you to use your wings to attempt to get away. Instead, you just stood wide-eyed in fear. After all, these girls were giants compared to you, and not having any real magic of your own meant you were pretty much defenseless. Either girl could've killed you by stepping on you.<br>\r\n<br>\r\nYou cowered in fear just a little, the shadows from their (to you) giant forms blocking out the sun. Although the two girls had approached you, their smiles didn't fade.<br>\r\n<br>\r\nIt might've been a new fairy instinct you'd obtained, but you knew you could trust these girls, like how Sienna trusted you.<br>\r\n<br>\r\n\"Hi…!\" The two girls greeted together, beaming.<br>\r\n<br>\r\n\"Am I in the human world?\" You asked shyly.<br>\r\n<br>\r\n\"Yes,\" replied the girl with long brown hair. \"This is Rainspell Island. My name's Kirsty Tate, and this is my best friend, Rachel Walker.\" She smiled, motioning to the blonde-haired girl beside her.<br>\r\n<br>\r\n\"H-hi, I-I'm (name)…\" you mumbled, looking away.<br>\r\n<br>\r\n\"No need to be shy!\" Rachel piped up. \"Kirsty and I are old friends of the Rainbow Magic fairies.\" She beamed. \"Though I've never seen a boy fairy, aside from King Oberon.\"<br>\r\n<br>\r\n\"Actually, I'm not really a fairy.\" You said honestly. \"I was turned into a fairy by Sienna. Do you know her?\" You asked.<br>\r\n<br>\r\nKirsty nodded. \"She's the Saturday Fairy.\"<br>\r\n<br>\r\n\"Why, did she come looking for you?\" Rachel asked.<br>\r\n<br>\r\nYou nodded. \"Another fairy named Ruby has apparently been kidnapped by some Frost Giant.\" You explained.<br>\r\n<br>\r\nThe girls turned to each other. \"Jack Frost!\" They shouted.<br>\r\n<br>\r\n\"That's the guy…\" You muttered.<br>\r\n<br>\r\n\"See that black pot?\" Kirsty asked, pointing over at the giant black pot. \"That's where poor Ruby was trapped when we first met her!\"<br>\r\n<br>\r\n\"So, this has happened before?\" You asked.<br>\r\n<br>\r\n\"Jack Frost once took all the Rainbow Magic fairies away, and we saved them! I'm so cross that Jack Frost is up to his old tricks again!\" Rachel shouted, before frowning.<br>\r\n<br>\r\n\"Do either of you know where Jack might've taken Ruby?\" You asked. Unfortunately, both girls shook their heads. \"Darn…\" you muttered.<br>\r\n<br>\r\n\"But,\" Kirsty piped up. \"Keep a look out for goblins.\"<br>\r\n<br>\r\n\"Goblins?\" You asked.<br>\r\n<br>\r\nRachel nodded. \"If you can find the goblins, then chances are Ruby's not too far away!\"<br>\r\n<br>\r\n\"I just wish we could come with you.\" Kirsty said. \"It would be easier to find Ruby with more people looking for her, but we can't become fairies without the magic of a Rainbow Magic fairy.\"<br>\r\n<br>\r\n\"Unfortunately,\" you sighed. \"I can't help you there.\"<br>\r\n<br>\r\n\"Cheer up, Kirsty.\" Rachel cooed. \"I'm sure (name) will be able to find Ruby, and if any of the fairies need our help, they'll come and find us. After all, remember what Queen Titania always says: Don't go looking for magic, let the magic find you!\"<br>\r\n<br>\r\n\"You're right, Rachel.\" Kirsty nodded. \"(name), if you need us, you know where to find us, and we'll help however we can!\"<br>\r\n<br>\r\n\"Thanks.\" You smiled, waving goodbye to the girls as you ascended back into the air, ready to go Hell or high-water in search for some goblins.</span></div></div>",
            "created":1539314280,
            "id":2562778,
            "title":"The End of the Rainbow"
        },
        "1241112":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "It's Sienna!",
                "It's a different Fairy."
            ],
            "content":"<div class=\"\"><div> <span>Rather than head to the cottage north of the clearing, you decided to head south, following a stream down towards the Rainspell Harbor.<br>\r\n<br>\r\nYou flew high above the sailboats sailing around the harbor, desperate to find any trace of Ruby, but unfortunately, there wasn't anything to suggest that magic was nearby.<br>\r\n<br>\r\nYou sighed, heading back from the harbor and out to the beach near some tea-shops to rest your wings, as you'd started feeling a little exhausted from all your flying.<br>\r\n<br>\r\nThere was a commotion going on behind you, and you turned, moving over to one of the tea-shops to see a customer arguing with a waiter about the state of the food. Your eyes widened as you noticed someone's jam scone was a murky dead brown.<br>\r\n<br>\r\n\"The color red is starting to disappear from the human world too…\" you muttered.<br>\r\n<br>\r\nYou were about to turn back to the beach when something, or someone drew your attention. Shaking the sand off of your shorts and with a mighty sigh, you flew closer towards the tea-shop, being careful as to not get spotted.<br>\r\n<br>\r\nOnce again, your eyes went wide, this time as you noticed the waiter's appearance. Big clumpy feet, pointy ears, big green nose. In fact, his whole body was green.<br>\r\n<br>\r\n\"I'm guessing that thing's a goblin…\" you mumbled, moving a little closer, hoping that he might lead you to Ruby. It was after all, strange that a goblin of all things would be working in a tea-shop.<br>\r\n<br>\r\nFollowing the goblin into the kitchen, you flew up to a shelf and hid behind a rolling pin, pressing your ear against the surface to hear better.<br>\r\n<br>\r\nThere was more than one voice, and you realized that he wasn't alone.<br>\r\n<br>\r\n\"Isn't this great?\" One of the goblin's chuckled.<br>\r\n<br>\r\n\"Yeah! We've caused all kinds of trouble since Jack Frost snatched away that horrible fairy!\"<br>\r\n<br>\r\n\"The food's terrible though. This faded jam isn't half as tasty as the real stuff…\"<br>\r\n<br>\r\nYou crept out from behind the rolling pin to get a closer look, but unfortunately lost your footing. The rolling pin moved away from you, falling down from the shelf and hitting one of the goblins in the head.<br>\r\n<br>\r\nOne of the goblins screamed in pain, while the other's eyes zeroed right in on you.<br>\r\n<br>\r\n\"Look! A fairy!\" He cried.<br>\r\n<br>\r\nYour eyes widened as your heart leaped into your throat. You flew as fast as you could out of the backdoor of the kitchen, but both goblins were right on your tail.<br>\r\n<br>\r\n\"Come back here!\" One of them shouted.<br>\r\n<br>\r\nYou'd made it to a vacant yard, with the two goblins unfortunately chasing you. You darted as quick as you could onto a holly tree to use it for shelter, hoping to be able to catch your breath, at least for a second.<br>\r\n<br>\r\nBoth goblins attempted climbing the tree to get you but found the leaves too prickly for their apparently sensitive hands.<br>\r\n<br>\r\nYou sighed with relief, lying back as you attempted to catch your breath.<br>\r\n<br>\r\n\"Thank goodness you've come!\" said a feminine voice, the sudden sound of which gave you a little fright.</span></div></div>",
            "created":1539314580,
            "id":2562779,
            "title":"First Encounter With The Goblins"
        },
        "12411122":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "You somehow, against all odds, manage to find Ruby trapped within a blue rose.",
                "You don't have any luck. Cherry returns with bad news."
            ],
            "content":"<div class=\"\"><div> <span>You turned to see a fairy flutter up next to you, wearing green and grey Christmas-ish clothing. \"Hi…!\" You breathed.<br>\r\n<br>\r\n\"I've been waiting for you. Sienna said you'd come. I'm Holly the Christmas Fairy.\"<br>\r\n<br>\r\n\"(name),\" you greeted. \"Nice to meet you,\" you said, offering a hand to her, which she shook. \"Can I ask, what's green and grey got to do with Christmas?\"<br>\r\n<br>\r\n\"Ruby, she's…\" Holly trailed, tears filling her eyes. \"I know you've been asked to help find her, but if she's not brought back soon, the colors of Christmas will be gone.\"<br>\r\n<br>\r\n\"Don't cry…\" you cooed, wiping away the fairy's tears as you offered her a sympathetic smile. \"I'm going to find Ruby, I promise. I just need to catch my breath.\"<br>\r\n<br>\r\nHolly nodded, taking one of your hands in hers. \"Thank you so much.\" She smiled. \"Why don't you have a look from the top of the tree? You'll have a better view from there.\"<br>\r\n<br>\r\n\"Good idea, thanks.\" You smiled, heading up to the top of the tree. As you looked around, you saw the two goblins scurrying away from the yard, but also a tiny red dot glistening in the distance. \"Ruby!\" You shouted, pushing off from branch and taking to the skies as you flew toward the first red-shaded thing that you'd seen a day.<br>\r\n<br>\r\nOnce you got close enough, you realized that the dot was actually a kite, dipping and circling about in the early afternoon sky.<br>\r\n<br>\r\nThe kite moved closer towards you, it not registering for you to move out of the way. The kite dipped again, and you flew back, barely even able to dodge it.<br>\r\n<br>\r\n\"Climb up next to me!\" A voice shouted. Your eyes widened as you noticed a fairy desperately clinging to the kite's string, her hair blowing in the wind. You pulled yourself up next to the fairy, grabbing onto the string, climbing to meet her face to face. \"Hi, I'm Cherry the Cake Fairy.\" She smiled.<br>\r\n<br>\r\n\"My name's (name),\" you called back. \"I'm looking for Ruby.\"<br>\r\n<br>\r\n\"I am too.\" Cherry started. \"I spotted the red kite and I thought Ruby might be close by.\"<br>\r\n<br>\r\n\"Listen, there are a couple of goblins back there that chased me away. Would you able to figure out what they're up to?\" You asked.<br>\r\n<br>\r\n\"Of course!\" Cherry chirped. \"But we'll need to get off this kite.\"<br>\r\n<br>\r\nYou nodded, the two of you letting go and then coming together, supporting each other as you regained your composure, flapping your wings as quick as you could.<br>\r\n<br>\r\n\"Okay! I'll go and check on those goblins!\" Cherry smiled.<br>\r\n<br>\r\n\"Wait!\" You cautioned, reaching out again for Cherry's hand. \"How smart are these goblins?\" You asked.<br>\r\n<br>\r\n\"They're not.\"<br>\r\n<br>\r\n\"What do you mean?\"<br>\r\n<br>\r\n\"They're not smart. That's how Jack Frost is able to rule over them so easily.\" Cherry explained. \"Why? What are you thinking?\"<br>\r\n<br>\r\n\"Well… maybe we could trick the goblins into telling us where Ruby is. Would that work?\"<br>\r\n<br>\r\n\"They'd never tell us flat-out…\" Cherry mumbled. \"We'd need something they'd want…\"<br>\r\n<br>\r\nDown far below on the ground, your eyes were able to find the goblins, resting in a hedgerow.<br>\r\n<br>\r\n\"What about food?\" You asked. \"They were working at a tea-shop, so maybe if we promised them food, they'd tell us where Jack Frost has hidden Ruby!\"<br>\r\n<br>\r\nCherry's eyes brightened. \"(name)! You're a genius!\" She chirped.<br>\r\n<br>\r\n\"Thanks…\" you mumbled, blushing just a little. \"I'm just not sure where we're gonna get any food from though.\"<br>\r\n<br>\r\n\"Leave that to me.\" Cherry smiled, reaching out and holding your hand in hers. Motioning for you to follow her, the two of you flew down from the sky and over to the hedgerow where the goblins were.<br>\r\n<br>\r\nAlthough part of you thought you were walking, or rather flying, into a deathtrap, you put your faith in Cherry that she had an idea.<br>\r\n<br>\r\nBoth goblins noticed you and Cherry almost immediately, getting up and attempting to reach for you. \"Hey! Fairies!\" they both shouted.<br>\r\n<br>\r\nLuckily, both Cherry and yourself were out of reach. \"Aren't you two hungry?\" She called.<br>\r\n<br>\r\nThe two goblins stopped jumping, instead turning to each other, and then back to Cherry, nodding their heads feverishly.<br>\r\n<br>\r\nCherry smiled, waving her wand as cascades of fairy dust fell from the sky, pooling just out of reach from the goblins as the dust became a giant chocolate cake.<br>\r\n<br>\r\nThe pair of goblins eagerly swiped at the cake, but it was just out of their reach.<br>\r\n<br>\r\n\"You can have this huge chocolate cake,\" Cherry began. \"If you tell us where Jack Frost has taken Ruby.\"<br>\r\n<br>\r\n\"No way!\" One of the goblins shouted. \"You think we're falling for that?!\"<br>\r\n<br>\r\n\"Yeah! There's no way we'd ever tell you where Jack Frost has her hidden!\"<br>\r\n<br>\r\n\"And even if we did, you'd never find the rose bush! Not in a million years!\"<br>\r\n<br>\r\n\"Rose bush?\" You asked.<br>\r\n<br>\r\nBoth the goblin's eyes widened, realizing they'd been tricked. \"Ah, hey!\" They shouted, forgetting about the cake and once again trying to reach for the two of you.<br>\r\n<br>\r\nWith a wave of Cherry's wand, the giant chocolate cake fell from the sky, crashing into the two goblins, covering them in frosting. \"Quickly!\" She urged. \"We've got to look through all the rose bushes on Rainspell Island!\"<br>\r\n<br>\r\n\"We should split up then.\" You suggested. \"We'll cover more ground that way.\"<br>\r\n<br>\r\n\"Good idea,\" Cherry smiled. \"I'll head east, you head west.\"<br>\r\n<br>\r\n\"Okay.\" You nodded, and as you were about to head off, Cherry moved closer to you, giving you a quick hug. \"Be safe.\" She cooed.</span></div></div>",
            "created":1539314880,
            "id":2562781,
            "title":"Meeting Holly and Cherry"
        },
        "124111221":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "\"Well, I mean, if you're offering, I wouldn't mind another kiss...\"",
                "\"Maybe we should focus on bringing the color red back to both our worlds...\""
            ],
            "content":"<div class=\"\"><div> <span>You had been flying for what felt like an eternity, and your wings were starting to ache a little as you searched from the skies for the rose bush that Ruby was apparently trapped in. \"I hope Cherry's having better luck…\" you muttered, coming in to land with a sigh.<br>\r\n<br>\r\nIt seemed like a one-in-a-million chance to find Ruby, but it truly was one-in-a-million.<br>\r\n<br>\r\nJust a little ways away from where you were standing, you saw a faint glint of red, which stood out to you like a needle in a haystack, what with the rose bushes being an unfortunately pallid gray.<br>\r\n<br>\r\nYou took to the skies again, even though your wings were hurting, moving towards the red. <br>\r\n<br>\r\nYour eyes widened when you saw what you had come across. A young, blonde fairy in red, trapped inside a ice sculpture-like rose bush. The poor girl was trapped, entangled by an icy set of thorns.<br>\r\n<br>\r\n\"Ruby!\" You called to her, her eyes meeting yours as her face lit up, yourself flying down to her. \"You're Ruby, aren't you?\" You asked.<br>\r\n<br>\r\nShe nodded. \"And you're (name), aren't you? Our one and only boy fairy.\"<br>\r\n<br>\r\n\"That's right.\" You smiled. \"I want to help free you, but I don't know how.\"<br>\r\n<br>\r\nSuddenly, your pocket glowed with a red energy. Eyes wide, you reached into your pocket, pulling out Ruby's necklace.<br>\r\n<br>\r\n\"That's my necklace!\" She cried. \"Please, place the gemstone in the necklace against the ice.\" She instructed.<br>\r\n<br>\r\nYou nodded, doing exactly as Ruby asked of you. You watched as the icy thorns Ruby that was trapped by began to melt, until eventually becoming nothing but a small puddle of water.<br>\r\n<br>\r\n\"My hero!\" Ruby shouted, fluttering up to you and planting a kiss on your cheek. \"Thank you for freeing me! How can I ever thank you?\" She asked.<br>\r\n<br>\r\nYour hand found its way to your cheek where Ruby kissed you, fighting off the urge to blush. \"Um… uh… you don't need to thank me. I was just doing what anybody would do…\" you said, although you really would've liked another kiss. \"And I think this,\" you smiled, handing Ruby her necklace. \"Belongs to you.\"<br>\r\n<br>\r\nRuby smiled, placing the necklace over her head, her golden hair shimmering brightly. \"Thank you so much…!\" She breathed again. \"But really, I must thank you properly.\"<br>\r\n<br>\r\n\"N-no, you don't have to-\"<br>\r\n<br>\r\n\"Please, (name). I must insist.\" She interrupted, taking your hands in hers. \"Getting shrunk and growing wings, becoming a fairy isn't for everyone. But you saved me, and no good deed should go unrewarded.\"</span></div></div>",
            "created":1539315120,
            "id":2562783,
            "title":"Rescuing Ruby"
        },
        "1241112212":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "content":"<div class=\"\"><div> <span>\"Maybe we should focus on bringing the color red back to both our worlds...\" You suggested.<br>\r\n<br>\r\n\"Wait…\" Ruby pondered. \"Ah! I know! I'll take you to meet King Oberon and Queen Titania! After all, they'll want to thank you!\"<br>\r\n<br>\r\nAnd with that, Ruby raised her wand above her head, showering the both of you in red sparkles. The next thing you knew, you and Ruby were standing in what looked to be royal palace. But the two of you weren't alone. No. Not only were there dozens and dozens of Rainbow Fairies waiting for you, but so were the King and Queen of Fairyland, Oberon and Titania.<br>\r\n<br>\r\nEveryone you had met along the way: Sienna, Holly, Cherry, and a host of other fairies were all there to welcome yours and Ruby's return.<br>\r\n<br>\r\n\"Welcome home, Ruby.\" Queen Titania smiled warmly. Ruby curtseyed and you bowed as, although you really didn't know either the king or queen, it was the right thing to do, out of respect. Titania's eyes moved to yours, her smile never faltering. \"And you, (name)… from the bottom of our hearts, thank you for saving Ruby.\"<br>\r\n<br>\r\nYou cleared your throat, a little nervous. \"I-it was no trouble, y-your majesty.\"<br>\r\n<br>\r\n\"You're very humble, young man.\" King Oberon spoke up. \"Aside from myself, you're the only other male fairy in Fairyland. We apologize for any discomfort or discrepancies you may have experienced while on this journey.\"<br>\r\n<br>\r\n\"Believe me, I'm just happy I was able to help. I'm glad I was able to assist in rescuing Ruby.\" You said honestly.<br>\r\n<br>\r\n\"You did more than that, (name)!\" Sienna spoke up. \"You were the one that <i>rescued</i> Ruby.\"<br>\r\n<br>\r\n\"Yeah, but I couldn't have done it without all of you helping me.\" You replied. \"But now that you mention it… there were two girls I met on my journey. Rachel and Kirsty, they said they were friends of yours.\"<br>\r\n<br>\r\n\"They are! They're the ones that rescued me the first time!\" Ruby said.<br>\r\n<br>\r\n\"Well, um, they were a little hurt that nobody came to them and got them to help.\"<br>\r\n<br>\r\n\"Those girls…\" Titania cooed. \"The truth is, (name), we wanted to go to them, but we've always asked them to help whenever there's been a crisis, and so we thought the two of them might have wanted a break.\"<br>\r\n<br>\r\n\"And so, I looked around for other kind-hearted humans, and I came across you.\" Sienna smiled.<br>\r\n<br>\r\n\"Well I'm sure, with all due respect, that Rachel and Kirsty are more than happy to help with any problems you guys have. But this has been really incredible, so if you guys ever need me for anything either. You know where I am.\" You sighed. \"Speaking of which, would one of you be able to help me get home? It's almost time for my brother to get home, and he'll be awful sore if he finds the house empty and unlocked.\"<br>\r\n<br>\r\n\"Of course, (name). I can take you.\" Ruby smiled, taking one of her hands in yours.<br>\r\n<br>\r\n\"If you're sure, (name), if we ever come across a problem, we'll send someone to you.\" Titania said.<br>\r\n<br>\r\n\"That would be great. Having wings is pretty cool!\" You chuckled. Ruby raised her wand into the air and another shower of sparkles overcame you. \"Bye, everyone!\" You waved.<br>\r\n<br>\r\nWhen the sparkles cleared, you were standing in your room, still at fairy-size, Ruby standing opposite you.<br>\r\n<br>\r\n\"Thanks again,\" she said, moving closer to you and kissing you, this time on the lips. Ruby moved her hands up your shoulders. Her kiss tasted like roses. Literally. And when she pulled away, both your face and hers were as red as roses. \"My hero.\" She smiled, pointing her wand at you.<br>\r\n<br>\r\nIn a few moments, you found yourself growing, until you were back to your normal size, and without wings. Ruby fluttered up to you, and planted one last kiss on your cheek, before she disappeared in a shower of sparkles.<br>\r\n<br>\r\nOnce again, you collapsed onto your bed, trailing one of your fingers to your lips and cheek.<br>\r\n<br>\r\nYou hoped you'd see Ruby and the rest of the Rainbow Magic Fairies again.<br>\r\n<br>\r\nIt truly was a magical adventure.</span></div></div>",
            "created":1539315600,
            "id":2562786,
            "title":"Meeting the King and Queen"
        },
        "1242":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "…kidnapped Shimmer, Katie the Kitten Fairy's missing kitten.\"",
                "…kidnapped Kirsty and Rachel. We need your help to rescue them.\"",
                "…declared war on Fairyland.\""
            ],
            "content":"<div class=\"\"><div> <span>You sighed, turning around in your bed. It had been a rough week a work, but you now had a few days off, which was good. Although you were having difficulty sleeping.<br>\r\n<br>\r\nA strange noise was the thing that got you up out of bed. It seemed to be coming from outside, so you pulled back the blind just slightly to get a look at outside without letting anyone look at you.<br>\r\n<br>\r\nYour eyes widened. Standing in your backyard was a tortoiseshell cat that was meowing softly to itself. You had no idea how the cat got in your backyard, but it looked friendly enough.<br>\r\n<br>\r\nYou opened the window and pulled back the fly-screen door, rearing your head out. Something cold touched the tip of your nose. A snowflake! It was snowing!<br>\r\n<br>\r\nQuite weird, considering it never snowed where you lived, but even weirder was the fact that none of the snow seemed to be melting. You didn't need to have ever seen or felt snow before to know that it should have been melting.<br>\r\n<br>\r\nSuddenly, you caught sight of a faint silvery glow in the distance, one that was getting closer to you. The cat stopped meowing, watching quietly as the shimmer of silver moved past it and towards you.<br>\r\n<br>\r\nNow that it was closer to you, you could tell that it wasn't just bits of dust, or a weird nighttime anomaly, but a fairy!<br>\r\n<br>\r\nThe young blonde-haired fairy was wearing a fur-trimmed blue dress with a tiny pair of matching boots, a silver necklace with a pendant in the shape of a snowflake rested just below her neck. Her outfit was certainly ideal for the sudden cold night.<br>\r\n<br>\r\n\"Hello,\" she smiled sweetly at you.<br>\r\n<br>\r\n\"Hi…\" you greeted back, whispering softly. It had been at least three months since you had become involved with the Rainbow Magic Fairies, what with Sienna the Saturday Fairy coming to request your help to rescue Ruby the Red Fairy from Jack Frost. You'd been shrunken down, grew your own wings, and whisked off all over the world in search for Ruby. Eventually, you were able to rescue her by outsmarting some goblins, and you said that if the fairies ever needed help, that they could come to you.<br>\r\n<br>\r\n\"Sorry to wake you…\" the fairy apologized, walking over to your thumb and giving it a friendly squeeze.<br>\r\n<br>\r\n\"No worries. I was having trouble getting to sleep anyway, and it's great to hear from you fairies again.\" You smiled, once again talking softly to the tiny winged girl. \"What's your name?\" You asked.<br>\r\n<br>\r\n\"I'm Crystal the Snow Fairy.\" She introduced.<br>\r\n<br>\r\n\"Pretty name for a pretty lady.\" You said, causing Crystal to blush. \"Anyway, what brings you here, Crystal?\"<br>\r\n<br>\r\n\"My friends and I are in desperate need of your help. Queen Titania said that if we ever needed assistance that we could call on you.\"<br>\r\n<br>\r\n\"Of course.\" You said gently, watching the fairy continue to stroke your thumb.<br>\r\n<br>\r\nCrystal's expression darkened. \"Well… Jack Frost has…</span></div></div>",
            "created":1539316440,
            "id":2562790,
            "title":"Meeting the Snow Fairy"
        },
        "12421":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "…keep looking around in the Human World, see if we can find any clues here.\"",
                "…go to Fairyland too. I'm sure I'll be able to find a clue there.\""
            ],
            "content":"<div class=\"\"><div> <span>Crystal's expression darkened. \"Well… Jack Frost has kidnapped Shimmer, Katie the Kitten Fairy's missing kitten.\"<br>\r\n<br>\r\n\"Say no more.\" You smiled. \"Kidnapping anything, especially a defenseless little kitten is wrong. Of course, I'll help you.\"<br>\r\n<br>\r\nCrystal beamed at you. \"Thank you so much! Alright, I'm going to turn you into a fairy now, okay? Close your eyes.\"<br>\r\n<br>\r\nYou nodded, following Crystal's instructions as you closed your eyes. High above you, Crystal glided through the air, tiny snowflakes bursting forth from the tip of her wand and showering down onto you. Slowly but surely, you started to shrink.<br>\r\n<br>\r\nThe same soothing feeling worked its way through your body, although this time, since your eyes were closed, you didn't have to experience any of that nasty vertigo.<br>\r\n<br>\r\nOnce you finished shrinking, you opened your eyes to find not only did you now have a pair of fairy wings on your back, but your clothing had changed. Instead of your summertime pajamas, you now wore a baby blue fleeced coat around a snow-white T-shirt, jeans and belt.<br>\r\n<br>\r\n\"What the…?\"<br>\r\n<br>\r\n\"I thought you might like something warmer. After all, it's going to get much colder.\" Crystal smiled.<br>\r\n<br>\r\n\"Thank you.\" You smiled back.<br>\r\n<br>\r\n\"Do you remember how to fly?\" Crystal asked.<br>\r\n<br>\r\n\"I think so…\" you muttered, fluttering your wings as you looked around your now gigantic bedroom. Increasing the speed of your fluttering, you once again found yourself able to ascend off the ground. You flew over towards Crystal, who still stood at the open windowsill and seemed to be blushing. \"Everything okay?\"<br>\r\n<br>\r\n\"Now that you're my size, I'm able to get a better look at you… you're handsome. That's all…\" Crystal mumbled, before she cleared her throat. \"Anyway, we should get moving.\"<br>\r\n<br>\r\nYou nodded, pushing yourself off from the window ledge as you flapped your wings furiously. The silver light from the moon above tickled as it touched your skin.<br>\r\n<br>\r\nBefore you knew it, you and Crystal had been joined by another fairy. This one with pink-tinted wings. \"Hello,\" she greeted. \"I'm Katie the Kitten Fairy.\"<br>\r\n<br>\r\nCrystal and you greeted Katie in return, and then Crystal looked out at the silver light which bathed the sky. \"Now that Katie's here, I must get back to Fairyland. I need to help the Weather Fairies organize the day's weather before all the humans start waking up!\"<br>\r\n<br>\r\nYou and Katie both nodded. \"No worries, Crystal.\" You smiled. \"Be sure to make it back safe.\"<br>\r\n<br>\r\nCrystal nodded, and before you knew it, the Snow Fairy had left your sight. Katie turned to you, taking both of your hands in hers.<br>\r\n<br>\r\n\"I think we should…</span></div></div>",
            "created":1539316680,
            "id":2562791,
            "title":"Quest for a Kitty"
        },
        "124212":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "\"The Pet Keeper Fairies’ Garden.\"",
                "\"The outskirts of Jack Frost's kingdom. I have a feeling Shimmer is close by.\""
            ],
            "content":"<div class=\"\"><div> <span>\"I think we should go to Fairyland too. I'm sure I'll be able to find a clue there.\" Katie told you.<br>\r\n<br>\r\nYou followed Katie through the sky, stretching your wings and fluttering up as fast as you can, being sure to keep hold of one of Katie's hands. Unbeknownst to the two of you, a trail of golden fairy dust secreted from Katie's form behind her.<br>\r\n<br>\r\nUp above, you caught sight of a stunning rainbow stretching out across the sky. \"Hey, what's up with the rainbow?\" You asked. \"Aren't rainbows only supposed to appear when it's daytime and it's sunny?\"<br>\r\n<br>\r\n\"Usually,\" Katie started explaining. \"But this is a Magic Rainbow. Fairies can slide down it.\"<br>\r\n<br>\r\nThe Kitten Fairy led you up through the clouds, which felt so puffy, you were sure you could've jumped on them like trampolines if given the chance. Eventually, you and Katie made it to the top of the magical arch.<br>\r\n<br>\r\n\"This is so cool!\" You gushed.<br>\r\n<br>\r\nKatie giggled. \"Ready?\"<br>\r\n<br>\r\nYou nodded, follow Katie as she pushed herself down the rainbow. It was a crazy, surreal experience, to say the least. As the two of you traveled down the rainbow, you heard voices calling out through the wind.<br>\r\n<br>\r\n\"Katie! Katie! Is that you, Katie?\"<br>\r\n<br>\r\nKatie's eyes widened. \"It's Kirsty and Rachel!\" She shouted. \"Let's make a quick stop. They might have some news about Shimmer.\"<br>\r\n<br>\r\nWithout warning, Katie pulled you off the rainbow so quickly that the two of you got sent tumbling into the sky, before landing with a thump on the beach of Rainspell Island.<br>\r\n<br>\r\n\"Oops, sorry…\" Katie apologised, extending out a hand to help you to your feet.<br>\r\n<br>\r\nLooking around, you were surprised to find that it was daytime. As in, middle of the day daytime, when it had been just past midnight only a few moments ago. Thankfully though, there was no one around. Well, almost no one.<br>\r\n<br>\r\nRachel Walker and Kirsty Tate rushed down the wooden steps to meet you and Katie, the two girls a buzz with questions.<br>\r\n<br>\r\n\"Katie, how are you?\"<br>\r\n<br>\r\n\"Do you know where Shimmer is?\"<br>\r\n<br>\r\n\"Has mean Jack Frost taken her?\"<br>\r\n<br>\r\n\"I'm afraid so, girls…\" Katie said sadly.<br>\r\n<br>\r\nRachel nodded. \"We knew something was up when our pet charm bracelets disappeared.\"<br>\r\n<br>\r\n\"We've been looking for her all day, but we haven't been able to find her.\" Kirsty explained.<br>\r\n<br>\r\n\"That's alright, girls.\" Katie smiled. \"Thank you so much for what you've done already. Don't worry about it anymore. Just leave it to us.\"<br>\r\n<br>\r\nRachel and Kirsty both nodded but were clearly disheartened. They wanted to become fairies and help out, but they appreciated that Katie wanted to let them have some time to themselves without needing to solve another Jack Frost Fairyland crisis.<br>\r\n<br>\r\nKatie turned to you, drawing her wand above her head as sparkles showered down upon yourself and Katie, lights twinkling in the night sky.<br>\r\n<br>\r\nWhen the light faded, you looked around. \"Where are we?\" You asked.<br>\r\n<br>\r\nKatie turned to you with a smile.</span></div></div>",
            "created":1539317340,
            "id":2562796,
            "title":"A Quick Detour"
        },
        "1242121":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "You and Katie head toward Jack Frost's castle.",
                "Crystal the Snow Fairy interjects, wishing to accompany you as well."
            ],
            "content":"<div class=\"\"><div> <span>\"The Pet Keeper Fairies’ Garden.\" Katie told you. \"I thought we might be able to find some clues here.\"<br>\r\n<br>\r\n\"Good idea.\" You smiled.<br>\r\n<br>\r\n* * *<br>\r\n<br>\r\nYou and Katie ended up spending a little over an hour into the garden. Unfortunately, aside from finding some of Shimmer's favorite kitten toys scattered across the grass, the two of you had absolutely no luck in finding anything that might've led you to her.<br>\r\n<br>\r\nThe sound of trotting hooves caused you and Katie to turn, catching sight of another Fairy, this one ridding atop a pony.<br>\r\n<br>\r\n\"Look! It's Penny the Pony Fairy!\" Katie pointed to her, as the pony Penny was riding on trotted over to you.<br>\r\n<br>\r\n\"Katie!\" Penny called. \"I've been out searching for Shimmer, and I've got some news!\"<br>\r\n<br>\r\n\"What is it?\" Katie asked.<br>\r\n<br>\r\n\"Apparently, Jack Frost's pet snow-goose has gone missing. That's why he's taken Shimmer! He's jealous!\" Penny explained.<br>\r\n<br>\r\n\"We've got to tell the king and queen!\" Katie decided.<br>\r\n<br>\r\nAnd so, hand-in-hand, you, Katie and Penny fluttered back up towards the sky, flying over towards the Fairyland Palace.<br>\r\n<br>\r\nAs the three of you landed in front of the royal residence, an anthropomorphic frog that was only a little bit taller than you came out to usher you all inside. It seemed a bit strange to you at first, but you paid it no mind.<br>\r\n<br>\r\nYou chose to walk, Katie and Penny fluttering beside you as the anthropomorphic frog footman stopped at the entrance to the throne room, King Oberon and Queen Titania seated atop thrones of solid gold.<br>\r\n<br>\r\n\"Welcome, friends.\" King Oberon greeted, your fairy friends curtseying.<br>\r\n<br>\r\n\"Welcome back, (name).\" Queen Titania smiled warmly.<br>\r\n<br>\r\n\"Your majesties, Jack Frost's favorite snow goose has gone missing, and we believe this to be the reason why Shimmer has gone missing.\" Penny explained.<br>\r\n<br>\r\nThe king and queen both nodded. \"That so? Then the poor Frost Giant must be consumed with jealousy.\" Queen Titania said sadly.<br>\r\n<br>\r\n\"Can I just ask, your majesties,\" you spoke up. \"Would there be a reason why Jack Frost would target Shimmer specifically?\"<br>\r\n<br>\r\nKing Oberon nodded. \"Katie's kitten Shimmer has the power to help lost cats find their homes, and homeless cats to find homes of their own…\"<br>\r\n<br>\r\n\"Damn…\" you inadvertently let slip an uttering of profanity at just how important Shimmer was. \"Would Shimmer maybe be at Jack's Castle?\"<br>\r\n<br>\r\n\"That's a possibility.\" Queen Titania spoke up. \"But if you're thinking of going there, be careful. Unlike his goblins, Jack Frost isn't above killing. Be weary of him.\"<br>\r\n<br>\r\nYou nodded.<br>\r\n<br>\r\n\"I'll gather up the rest of the Pet Keeper Fairies to look around Fairyland, just in case Shimmer's not at Jack Frost's castle.\" Penny said.<br>\r\n<br>\r\n\"Good idea, Penny. Me and (name) can go to Jack Frost's castle.\"<br>\r\n<br>\r\n\"Be safe,\" Queen Titania smiled. \"And remember to believe in the power of Rainbow Magic…\"</span></div></div>",
            "created":1539317820,
            "id":2562797,
            "title":"Reason Behind the Treason"
        },
        "12421211":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "The two of you head back to Fairyland Palace.",
                "You decide to continue onward to Jack Frost's castle, with an offer."
            ],
            "content":"<div class=\"\"><div> <span>While the Pet Keeper Fairies decided to stay and search for Shimmer in Fairyland, you and Katie said your goodbyes to the king and queen, quickly heading off into the direction of Jack Frost's castle with Katie leading the way.<br>\r\n<br>\r\nWithin minutes, you're soaring across the skies of Fairyland, moving through the royal garden. You watched below as Fairies and frogs played their musical instruments together. You reached for Katie's hand as the two of you flew above the palace swimming pool.<br>\r\n<br>\r\nAs you flew, a terrible wailing sound echoed through your ears, drowning out the beautiful music that the fairies and frogs had been playing. Both you and Katie stop, the Kitten Fairy turning to you. \"We should go and see what's going on here first, I think.\"<br>\r\n<br>\r\nYou nodded, the two of you flying down to the swimming pool, the sound of the wailing getting louder.<br>\r\n<br>\r\n\"I wish that stranger would go away…\" you heard a fairy sigh. \"He doesn't look very friendly…\"<br>\r\n<br>\r\nYou looked around, your eyes meeting that of a hooded figure. You waited for a moment, but the figure didn't move, his face obscured by his hood.<br>\r\n<br>\r\nIn an act of courage (and perhaps a little stupidity as well) you flew over to the hooded figure, quickly throwing his hood off.<br>\r\n<br>\r\n\"Oi!\" The figure cried, now identified to be a goblin, but that wasn't all. The goblin was holding an animal in its clutches.<br>\r\n<br>\r\n\"Hey, Katie!\" You called, Katie quickly fluttering over. \"Is that Shimmer?\" You asked.<br>\r\n<br>\r\n\"Yes!\" Katie shouted, giggling with delight as Shimmer trotted up to her owner, absolutely delighted to be free from the goblin's clutches.<br>\r\n<br>\r\nThe tiny kitten had been caterwauling to the music coming from near the swimming pool, but the goblin's hood had kept her hidden from sight.<br>\r\n<br>\r\nThe goblin growled. \"Darn you! You pesky fairies!\"<br>\r\n<br>\r\n\"I'll teach you for kidnapping a defenceless little kitten!\" Katie shouted, pointing her wand at the goblin. A lone spark shot out from her wand, pushing the goblin into the swimming pool. You and the other fairies laughed a little as the goblin floundered about, before getting out of the pool and scurrying off. Katie turned to you, giving you a big hug. \"Thank you so much, (name)!\" She beamed. \"Say thank you, Shimmer.<br>\r\n<br>\r\nShimmer meowed at you, before giving your face a lick. You laughed as her tongue tickled.<br>\r\n<br>\r\n\"I guess we don't need to go to Jack Frost's castle after all.\" You said.<br>\r\n<br>\r\nKatie nodded. \"All's well that ends well. But we should go back to the palace and tell everyone Shimmer's been found.\"<br>\r\n<br>\r\n\"Good idea.\" You said, following Katie as she took off into the air, Shimmer content within Katie's grip.</span></div></div>",
            "created":1539318660,
            "id":2562800,
            "title":"When you're walking, er, flying alone..."
        },
        "13":{
            "author_id":"bikaloer",
            "author_name":"Bikalœr Efedrikós",
            "choices":[
                "5 - 8",
                "9 - 12",
                "13 - 16",
                "17 - 25",
                "26 or older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright then. What age group do you belong to?</span></div></span></div>",
            "created":1451365200,
            "id":2080964,
            "title":"Other"
        }
    },
    "info":{
        "author_id":"bikaloer",
        "author_name":"Bikalœr Efedrikós",
        "brief_description":"Help the Rainbow Magic Fairies defeat Jack Frost. Original story by \"Wayward Lassy\".",
        "created":1451396340,
        "description":"<td align=\"left\" class=\"norm\">Story concept, outline and contents property of former Writing.Com member \"Wayward Lassy\". I claim no ownership of submitted content. Minor alterations to dialog and such have been made to improve the flow of the story and more options have been created to allow for a more inclusive story. Other users are free to add their own chapters as they see fit.<br>\r\n<br>\r\nIn a world where magic exists within the hearts of true believers and the peace of fairies is threatened by an evil Frost Giant, it’s up to you to help your new fairy friends to defeat the evil Jack Frost. Heavily based on the \"Choose Your Own Magic – Rainbow Magic\" series by Daisy Meadows.<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1. Please write in 2nd Person P.O.V.<br>\r\n2. Ages of all characters aside from the main character are reflective of the original source material.<br>\r\n3. Shrinking, as it is part of the original concept, is allowed and encouraged. However, other content which breaks from either reality (Body Inflation, Transformation, Transgender, Vore, Unbirth etc.) or the original source material is unacceptable.<br>\r\n4. Romance is allowed, but again keep in mind the ages relevant to the source material.<br>\r\n5. Feel free to introduce your own Fairies and backstories for said Fairies<br>\r\n6. Any chapters I find with spelling mistakes or grammatical errors will be corrected.<br>\r\n<br>\r\nEnjoy!</td>",
        "id":2069966,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1540102020,
        "modified":1540102020,
        "pretty_title":"Journey to Fairyland (Reboot)"
    }
}