{
    "chapters":{
        "1":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Elementary",
                "Middle school",
                "High school",
                "Visiting Parent",
                "Visiting Brother"
            ],
            "content":"<div class=\"\"><div> <span>You are sitting on a bench at the local mixed-grade, all boys school, minding your own business when you felt a small prick on the back of your neck. You ignore it at first but you begin to feel a bit dizzy and you hear the bell ring to signal the beginning of classes again. You go to stand up and you fall down and feel yourself shrinking.<br>\r\n<br>\r\nWhat school grade are you in?</span></div></div>",
            "created":1426827600,
            "id":1950685,
            "title":"Shrunk at School"
        },
        "11":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "JK, SK, or 1",
                "2",
                "3",
                "4",
                "5"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What grades?</span></div></span></div>",
            "created":1434258000,
            "id":1992779,
            "title":"Elementary"
        },
        "115":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Your Best Friend, named Lewis!",
                "The Fat Kid, named Nick!",
                "The Bully, named Damien!",
                "The Bookworm, named Michael!"
            ],
            "content":"<div class=\"\"><div> <span>You was completely blacked out at that moment and it took a couple of minutes later to have your eyes opened.  You may be blurring at this stage whilst you seemed to be lying on the ground, which feels rougher than it supposed to be.  Plus, it was covered in blue, rather than grey-ish colour the school had in common.  The room seemed to be much bigger than an actual-sized room you’ve sat on the bench before.<br>\r\n<br>\r\n“W...W...Where am I?  And why’s everything looks so huge?”<br>\r\n<br>\r\nObviously there’s been some kind of amiss, and rather strange as to where you were, and how did you end up on top of a rather plastic floor you’re feeling at this point.  That’s when you had your eyes fully fixed, and can finally see why it looked so different.  You can see the classroom that belonged to 5th grade, are so humongous like a sky, and you even got up and walk over before realising in shear panic when the floor is so steep from your point of view.<br>\r\n<br>\r\n“No!  This can’t be happening!”  You’re panicking so hard, you had to get back in the middle, before knowing what he’s standing.  “I...I think I’ve just shrunk down to size!”<br>\r\n<br>\r\nIndeed you are, standing at a couple of inches, and currently standing on a huge, blue chair!  That’s the reason why it felt so rough and plastic in the first place.  You’re in a utter shock and fear, knowing you’re just nothing more but either a bug or a doll, and feeling so helpless, you wouldn’t know what to do now.<br>\r\n<br>\r\nThe question you’ve kinda remember is where was that stinging to the neck came from, and who was responsible to make you shrink instantly?  You may have answers to try and solve this issue when you could feel the chair shaking and loud booms, knowing that the boys, aged between 10-11, are heading to the classroom, but you’ve got nowhere to go and you’re in someone’s seat, instead of yours.<br>\r\n<br>\r\nWhen that huge shadow came and saw someone came over, you would then realised in utter fear, that seat belongs to who?</span></div></div>",
            "created":1549669800,
            "id":2614620,
            "title":"Shrunk at 5th Grade"
        },
        "1152":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Follow your point of view ",
                "Follow Nick’s point of view "
            ],
            "content":"<div class=\"\"><div> <span>Now that you’ve shrunk down to size, you’re completely helpless and knowing you’ll be getting a receiving end more than once.  This may be the case when a huge shadow looms over you and realised that chair you’re standing on, belongs to Nick the fattest kid in school.  He’s certainly big, compare to other boys in this elementary, and even more so when he wins wrestling competitions, where you’ve took part in.<br>\r\n<br>\r\nYou knew this first hand, when Nick took you down so easily during training, and you just knew how heavy and strong he really his.  You’ve like that though and thus, the two of you started to get along each other, coming over it’s house, going out to restaurants, or other stuff for their fun.<br>\r\n<br>\r\nBut it may be no fun, now that you’re a couple of inches tall, and saw Nick waddling towards the chair, looking gigantically huge from your point of view.  You’re so afraid of this, you decided to yell as much as you can, hopefully Nick can hear from that low volume sound of yours.<br>\r\n<br>\r\n“Nick!  Nick!  Down here!”  You tried as much as you can.<br>\r\n<br>\r\nBut as you can tell the expression on Nick’s fat face, he doesn’t seem to notice or listen to you, and he turns around to take a seat on the chair.  You’re fear the worst since Nick has a pear-shaped body, meaning his butt and thighs are much bigger and fatter than the rest of his obese body.  There was nowhere to go from you, and the only chance he you to take is scream through your lungs and tries to convince Nick otherwise.<br>\r\n<br>\r\n“Nick!  Don’t sit on me!  Nick?  Nick!”  You screamed!<br>\r\n<br>\r\nBut it was too late as Nick had already sat on the chair, squashing you in the process underneath his giant fat butt.</span></div></div>",
            "created":1549932000,
            "id":2616344,
            "title":"The Fat Kid, named Nick!"
        },
        "11522":{
            "author_id":"anthonyiscool1",
            "author_name":"anthony",
            "choices":[
                "Nothing. Ur stuck to his ass",
                "He sees you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I feel something squirm as I sit down and stand up to see\"</span></div></span></div>",
            "created":1556319660,
            "id":2650790,
            "title":"Follow Nick’s point of view "
        },
        "12":{
            "choices":[
                "Mikey (13)",
                "Josh (14)",
                "Justin (15)",
                "Other Choices",
                "Other Choices"
            ],
            "content":"<div class=\"\"><div> <span>As you wake up you realize you are in the gym and surrounded by the squeakings of the gym floor and shouts of various sweaty young men playing basketball.<br>\r\n<br>\r\nThe smell in the air is that of the B.O. of several boys who are recently hitting puberty. As you lay there on the wooden bench you witness a terrifying sight to behold. <br>\r\n<br>\r\nThe giant sweaty boys are all ENORMOUS to you, as you squeakily scream, one of the boys in the typical pair of gym shorts and sleeveless basketball shirt and gym shoes (All of which are visibly soaked along with his young body), is benched. He approaches you with a scowl on his face.<br>\r\n<br>\r\nIt is unclear as of yet whether he sees you or not. But the boy is most definitely...<br>\r\n<br>\r\n<br>\r\nMikey (13) - A young shaggy haired blond boy with a taste for causing mischief. While not necessarily a bad kid, he does find himself the victim of a no nonsense principal who sends him to detention from time to time. Is known for having very bad foot odor, and during gym is normally teased  (of course from a distance) about his B.O. which permeates from his underarms most powerfully during P.E.<br>\r\n<br>\r\nJosh (14) - A spikey haired brunette who is Mikey's best pal, and often joins him in his antics. This boy is known to have even worse foot odor and B.O. than Mikey, due to him being older and in the tight grips of puberty. He is fond of using his various smells to his advantage to get what he wants. He often kicks his shoes off during class and resting them on the back of the poor sap in front of him's chair. Scratching his itchy feet with their desk.<br>\r\n<br>\r\n<br>\r\nJustin (15) - A rather chubby boy with black hair in a cowlick style. A bully in every definition of the word. Being an older boy just on the cusp of reaching sixteen, he feels a sense of dominance over the young middle schoolers, and instead of using that authority to encourage them and guide them. He uses it to boss them around and bully them. Is known for his large appetite and poor manners.</span></div></div>",
            "created":1428296400,
            "id":1959994,
            "title":"Sweaty Smelling P.E."
        },
        "121":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Worship his feet",
                "Lick his pits",
                "Get in his mouth"
            ],
            "content":"<div class=\"\"><div> <span>You screamed out in horror was you saw the giant, smiling face of Mikey, a boy you had seen doing a lot of bad things and being really mischievous. The grin on his massive young face sent chills running down your tiny spine, fearing the worst as he gingerly reached down, his clammy, teenage fingers slowly wrapped around your body.<br>\r\n<br>\r\nIt felt so wrong as you felt his fingers holding you, lifting you into the air and his confidence as he glanced around and saw no one else around, it made you tremble with fear for what this boy could do to you. He slowly licked his lips as he grinned down at you in his hand, looking like a new toy rather than a man, it scared you and chilled you to the bone.<br>\r\n<br>\r\n\"Hey little man, how did you get so small?' He asked, his voice thundered down at you and you covered your ears with how loud he was. You trembling in fear as you tried to get back to normal and looked up at him \"I came in, felt dizzy and woke up like this, please take me to an adult, o someone who can help me, please i;m begging you?'<br>\r\n<br>\r\nHis grin only grew wider as you said that and he knew he was in control as he rubbed his chin and licked his lips eagerly at his power and position. \"I could, but you have to d something for me first\".<br>\r\n<br>\r\nWhat does he choose?</span></div></div>",
            "created":1431234000,
            "id":1976028,
            "title":"Mikey's in control"
        },
        "1211":{
            "choices":[
                "[Timeskip] Mikey is in a history class, and forces you to lick his feet!",
                "Mikey nearly drowns you in sweat during basketball!",
                "After school, you're all Mikey's for the weekend!"
            ],
            "content":"<div class=\"\"><div> <span>Casting a quick glance down at his gym shoes, Mikey licked his lips once more and sat down on the bench, keeping you in hand, as he reached down with his other and undid the grimy laces on his shoe. Once they were undone, he lifted out a very wet, stinky, yellow stained socked foot. He wiggled his toes a bit as he crossed them over his knee and smirked down at you, and began inching your tiny body closer and closer to the funky smelling (and looking) bottom of his sock.<br>\r\n<br>\r\nYou kicked and punched at Mikey's fingers, the stench of an active, spunky young teen's smelly foot odor overwhelming you, and Mikey's neglect to change his socks for days on end, certainly didn't help! Mikey licked his lips with a slurp as he pressed your head into the part of the sock where his toes met his sole, really grinding your nose into the wet patch of fabric.<br>\r\n<br>\r\n\"Sniff it.\" Mikey ordered. <br>\r\n<br>\r\nYou cough and recoil as best you can, after taking your first breath from Mikey's sock fabric.<br>\r\n<br>\r\nMikey chuckled childishly, and finally brought you away from his socked foot, rolling the sock up to his toes, so the funky looking cotton inside was folded back. <br>\r\n<br>\r\nAnd that was when the young mischief maker placed you, facing his stinky foot skin, against his clammy and soft sole.<br>\r\n<br>\r\nHe scooted you up a bit, so your head was held by the sock and pressed against the underside of his toes, and quickly rolled the sock back down so it was covering his foot once more.<br>\r\n<br>\r\nHis best buddy and fellow mischief maker Josh called over to him from the court: \"Hey Mikey! Quit sampling your foot stink and come play basketball!\" Josh joked with a grin.<br>\r\n<br>\r\nMikey smiled, \"You got it!\" And slid his foot back into his damp shoe, tying it up and going to join his pals.</span></div></div>",
            "created":1431234000,
            "id":1976031,
            "title":"Worship Mikey's Feet"
        },
        "12112":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "At his house",
                "At school"
            ],
            "content":"<div class=\"\"><div> <span>You were experiencing a twisted form of a wet and smelly hell inside Mikey's shoe. As Mikey played basketball his toes pressed roughly into your body and his sweat flooded your senses as you swallowed the salty bitter liquid on accident but the worse part of this hell was part of you were enjoying it every time one of his toes slammed into your gut your crotch tighten. When his sole landed on your insignificant body your member pushed into the rubbery skin in contrast. You didn't understand how you could enjoy such a controlling prison of pain and pleasure.<br>\r\n<br>\r\n Luckily you had time to recuperate from the manhandling when Mikey stopped moving you were spared from the violating rubbing but you would have little rest as your captor continued playing and your cock would once again be rubbed into the 13 year old's soft toes.<br>\r\n<br>\r\nJust when you couldn't think you could take anymore the torture suddenly stopped and you let out a sigh of relief. The cloth wall that trapped you was peeled of off the massive foot. You were blinded by the sunlight. <br>\r\n<br>\r\nMikey grabbed you and brought you to his face. “Hey little buggy enjoyed your time in my shoe?” As he heckled at his statement he began to look upon your naked body and saw your tiny but noticeable erection. “You like feet?” Mikey question. You were awestruck by the question. “No!” you quickly stammered turning red. , “don't worry bug I can help you.” He then sets you on the ground and his foot is brought on top of you casting a shadow over you.<br>\r\n<br>\r\n“Stay still bug.” Mikey uncaringly said. He then brought his toes to your crotch. You did not fight back at all. His sweaty and soft toes began to pull and push your cock causing you to wince in pleasure. You began to pound on his toe nails in a glimpse of a thought that you could make him stop,but your vain attempt at control only makes Mikey go faster. <br>\r\n<br>\r\nYou eventually feel your balls tighten as your cock releases it's white bliss all over Mikey's toes. You are left panting on the ground. Mikey then picks you up with his toes and drops you into his shoe. When does he take you out again?<br>\r\n</span></div></div>",
            "created":1461042000,
            "id":2136160,
            "title":"Pleasureble torture"
        },
        "121121":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "His mom does the laundry ",
                "His older brother wears his underwear"
            ],
            "content":"<div class=\"\"><div> <span>Mikey after the basketball game got on the bus to go home while riding the bus and he was on cloud nine. He had it all, he had a slave that he could control with a flick of his finger, he had a amazing game of basketball and now he was going home to play with his slave more.And the fact that he made his little bug cum on his toes was extremely arousing to him as his member harden as he remembered you thrusting against his toes. <br>\r\n<br>\r\nMeanwhile you were having the worst day of your life. You were a wreck, after mikey had molested you. He had left you a sniffling ball of resentment in the toe section of his shoe. Every time he curled his toes you died a little bit inside. As You reflected on your current predicament you realized that your life was over and the only thing keeping you alive was the fact that mikey found you interesting. You were nothing you weren't a bug, you weren't slave you. You definitely were not mikey’s lover. You were lint, toe lint to be exact. A thing to be played with by gods like Mikey. The only thing you could do was hope that mikey was a merciful god.<br>\r\n<br>\r\nAfter this self reflection Mikey's toes stopped groping you and the murky walls slid by you and two massive fingers peeled you off the toes that manhandled you. “Hi slave boy.” Mikey said in a cheerful voice. “Ready to have some fun”. You didn't respond to him. “I'm taking that as a yes” Mikey then picked you up pulled open his waistband and dropped you in a dark and musty cave. It was sweaty and dark in mikeys underwear as you held on to his huge organ it must've been only 5 ½ inches large and it could fit five of you on it you must be a inch tall.<br>\r\n<br>\r\n“Rub slave.” Mikey growled. And with all your might you began to rub against the already hard dick and precum seeped out of it. “Good job slave I'll take it from here. He picked you up and stuffed you into his slit. “You can stay in here.” He said with a pleasured grin. Mikey began to furiously masterbate to the thought of having another person in his dick he quickly jizz into his underwear. He tried looking  for you but couldn't find you in the cum thinking you were still in his dick. He took off his underwear and went to sleep pantless.<br>\r\nWhat happen next as you lay in the cum of your god.<br>\r\n</span></div></div>",
            "created":1461992400,
            "id":2141309,
            "title":"At his house"
        },
        "1211211":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "Her slippers",
                "Her robes"
            ],
            "content":"<div class=\"\"><div> <span>As You llooked around you  observed that Mikey's seman cemented your naked body to the underwear’s fabric that you laid your back in. <br>\r\nYou had no idea what to do you were trapped in a 13 year old's underwear who raped you twice in one day. You were powerless you might as well wait for something to happen. As if on cue a booming feminine voice entered your existence.<br>\r\n<br>\r\n “Mikey are you awake?” The voice boomed. It must be his mother. Suddenly the massive door that trapped you in this dungeon like room opened to introduce the most beautiful woman you have ever seen she was a towering blonde with piercing blue eyes and she was wearing a pink robe that barely contained her body and large pink slippers.<br>\r\n<br>\r\nAs she walks into the room she begins picking up dirty clothes like dirty socks and sweaty t-shirts. She eventually picks up the underwear you were trapped in and brings it to her face.“Awww my little boys becoming a man.” She looked like she just saw a baby bunny. You were disturbed by her reaction of her sons seman soaked boxers you decide it's a better move not to attract her attention, seeing were Mikey gets his perverted mindset.<br>\r\n<br>\r\n Mikey's mom with a grin brings down her giant finger and scrapes off some freshly dried cum and brings it to her her bright red lips unfortunately for you you were on that finger.  She opens her mouth and its size is like a cave. She then proceeded to stick you and her finger into her gaping mouth “Mmmm.” She says in murmured voice. <br>\r\n<br>\r\nYou were swished around her mouth as she tried to get every last taste out of her sons cum. Her tongue rubbed your body and when she sucked you cock was flicked roughly around causing you to gasp and get her spit into your mouth. Fearing for your life you make a last ditch effort and throw yourself through her teeth and out of her lips. You were free you and now you were falling. Where do you land?<br>\r\n</span></div></div>",
            "created":1463263140,
            "id":2148069,
            "title":"Your gods milf mom"
        },
        "12112111":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "Have some fun.",
                "Try to wake the giantess"
            ],
            "content":"<div class=\"\"><div> <span>You saw your life flash in front of your eyes as you were free falling at a dangerous speed. As you fell you quickly take a look at where you’re heading, Mikey's moms slipper her heel to be specific.<br>\r\n<br>\r\n “Oh fuck!” You yell as you close your eyes and flip over and cover your head with your hands. You land on your back and you feel a painful crack reverberate through as you hit the fluffy sole of Mikey's moms slipper knocking the air out of you. In a a screaming coughing fit you check for any damage, And the only damage you can observe is that your arm was pretty much destroyed making you wince when you moved it, but while you were licking your wounds Mickey's mom foot reentered her slipper.<br>\r\n<br>\r\n“Well I better finish the laundry.” You hear Mikey's mom bellow above. You look out of the maw of the slipper to see Mikey's mom foot with her pink painted toe nails began to slide into the slippers you were occupying, and you see her toes pass over you as well as her arch until her heel is directly above you. Her heel drops and you are directly crush underneath her. You scream in pain, this was a full grown woman stepping on an inch tall boy with her full weight. You feel like you're about to burst until you pass out from the pain.<br>\r\n<br>\r\nYou awaken to a stare down with Mikey's moms heel you were stuck to her heel you push yourself off with both arms. Apparently it's healed so you must be able to heal injuries you may get being shrunken. You fall onto a polished cold table. She had her feet on top of a table. You hear a buzz of noise behind you, she was watching tv. The tv to you was huge many times your size. You peer past the heel to see Mikey's mom passed out. Deciding what to do now You look up at Mikey's moms foot as it towered above you. It was the closest you ever been to a female's foot. a strong smelly smell entered your nostril. You feel a familiar stir in your crotch, but you need help. What do you do?<br>\r\n</span></div></div>",
            "created":1467220440,
            "id":2172618,
            "title":"Her slippers"
        },
        "1211212":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "Fast food restaurant ",
                "Something more active"
            ],
            "content":"<div class=\"\"><div> <span>You were completely powerless Mikey had raped you twice and you enjoyed it, but you still want to be free but you are trapped. You're stuck in Mikey's cum soaked underwear. Even if you could escape the underwear you would have to open his door which is an impossibility at your current size. You decide to rest your tired body and sleep in his underwear.<br>\r\n<br>\r\n...A few hours pass as you are jolted awake you are face to face with a massive size cock. Even if Mikey's cock was normal size and still was many times your size this dick must've been huge. You are pressed into the massive cock having no room inside the underwear.<br>\r\n<br>\r\nYou hear a booming masculine voice say “goddamn fag busted a nut in his underwear, the fag is lucky I have a night shift or I would beat his ass.” As the person wearing the underwear walked the massive cock rubbed you off the semen incased front of the underwear. You were now forced to hang on the massive cock. <br>\r\n<br>\r\nIt swung from side to side until it suddenly sprang forward forcing your dick to be rubbed under the goliath sized cock. He must be sitting down. You get erect by the massive cock that was rubbing the top of your dick “Why am I getting turned on by this?” You say to yourself.<br>\r\n<br>\r\nYou hear a car engine start and you hear the older brother make a phone call. “Hey Mrs.Whiz this is your new employee Derek I'm going to be a few minutes late sorry.” Where does Derek work?<br>\r\n</span></div></div>",
            "created":1463264820,
            "id":2148104,
            "title":"Your gods bigger brother"
        },
        "12112121":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "Aroused by it",
                "Not surprised "
            ],
            "content":"<div class=\"\"><div> <span>“Can't believe I'm almost 18 and I am working at a fucking Arby's.” Derek says to himself. Your current predicament was much worse off than Derek's position life. You were trapped under his massive cock and your own penis was pulsating in response to being rubbed into the bottom of the colossal member that was on top of you. “Hmm a itch.” You hear Derek murmur. You take a second to realize that he's talking about you, but you are powerless as derek pushes his fingers under his member. You are rubbed roughly into the cock you scream out in pain but only succeed in having derek salty skin enter your mouth making your crotch tighten even more into Derek’s penis.<br>\r\n<br>\r\nYou hear the car stop and derek cock is lifted off of you but you are now stuck with his balls. His balls were about the size of 3 of you stacked on top of eachother. You decide to climb up them there was shaven pubic hair which made it a little easier to climb up the massive balls. <br>\r\n<br>\r\nYou reach the top of derek cock when you hear a feminine voice say “Mr.Derek you are ten minutes late.”, “It's a night shift not like there's going to be crowds of people coming in.” Derek responds quickly. “Since when did arby's have night shifts?” you wonder. “Whatever make sure you on time or you will be fired.” The woman responded. You hear footsteps and a door close, she must have left. “Sure bitch whatever.” you hear david retort. “Well it's just me, burgers and a bunch of porn.” Derek quietly says to himself. Your heart drops as you hear the last part of his statement. <br>\r\n<br>\r\nYou began to hear loud moaning noises, and Derek’s already large cock proceeded to get even larger. He must be getting a erection. As his cock grew it made what you little breathing space as you had and made the cock into your entire world. Everything at that moment for you was Derek's cock. Your body was roughly pressed into the cock until suddenly light pierces through your prison as you are pushed onto a cold counter by Derek's cock. <br>\r\n<br>\r\nAs Derek dick lands on top of you You are greeted to a older looking Mikey who is pretty built. “What the fuck!” Derek yells. Immediately pulling his dick off of you. “Who are you, and why were you in my little brother's underwear?” You explain your entire adventure leaving out the part where you unwillingly came on his little brothers toes to be spared of your embarrassment. But as you tell your story you feel your crotch tighten from remembering the events that lead up to this, worried that he sees you erect member sticking out at him but he doesn't seem to notice it. How does he react to your story?<br>\r\n</span></div></div>",
            "created":1463366580,
            "id":2148632,
            "title":"Put a smile on that face for Arbys"
        },
        "121121212":{
            "author_id":"nope666",
            "author_name":"Nope",
            "choices":[
                "Have some fun with the shoes.",
                "Get something to eat."
            ],
            "content":"<div class=\"\"><div> <span>As Derek towers above you he rolls his eyes in an exaggerated show. “Of course that fag would kidnap someone whose shrunk.”, “ you're welcome to stay here and wait until my shift done.” You think about it and you realize you're fucked if you leave Derek. So you decide to stay. “Sure.” You say cheerfully , “well I was about to do something if you don't mind I'll be in the bathroom.” Derek then walks off. <br>\r\n“Also I won't mention the boner you have right now.” Derek says, he snickers at his statement. <br>\r\n<br>\r\n3 hours pass as you and Derek fucked about you guys told jokes, played pranks on each other and talked until his shift was over. “Well little fella it's time for us to go home. Derek then puts his hand out for you to step on. The skin feels soft to step on with your bare feet. Derek then walks out to his car,it's a red trashy looking car but it's better to be looking at it then having a massive dick crushing you. Derek sets you on the seat next to him. “hold on tight.” Derek says with a cheesy grin. It's a short ride to his house the house itself is a average looking house nothing too special. Derek picks you up and carries you to the front door. Derek walks in kicks his shoes off and set you on the ground. “I'm going to bed try not to get killed.” As he walks away you get a whiff of his socked feet making your crotch tighten. You look at the shoes next to the door and a dirty plan comes to mind , but your stomach growls you realize how hungry you are. what do you do?<br>\r\n</span></div></div>",
            "created":1466959620,
            "id":2171127,
            "title":"Not surprised "
        },
        "12113":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Make a run for it",
                "Bow to your Master"
            ],
            "content":"<div class=\"\"><div> <span>Trapped, imprisoned inside the rank, musky gym shoes of a teenage boy, it was the worst hell you could imagine. Each step he took, or slight movement of his slimy, sweaty young toes caused pain and humiliation for you, since you couldn't even move one of his toes. You could hear the muffed sounds of Mikey living a normal schoolboy life, hanging out with his friends, getting bored as hell during class.<br>\r\n<br>\r\nYou could tell when he was in class because his toes became more active, playing with your tiny naked body a little more as he casually coated you in a thick, gooey layer of his funky foot sweat and toejam. This hell only seemed to end when you heard the faint sound of the school bell ringing and your giant controller going to collect his stuff from his locker.<br>\r\n<br>\r\n\"Hey see you on Monday Josh\", you heard the young titan say and it suddenly dawned on you what day it was, it was Friday and that meant you would be with Mikey the whole weekend. This sent you into a panic as you thrashed around with the little room you had and all Mikey did was giggle as he walked off home, pounding you into his sweat soaked insole with each step.<br>\r\n<br>\r\nMikey soon got home and he ran upstairs to his bedroom, eagerly locking the door behind him as he threw his bag down on the floor and sat down on his bed, and kicked his sneakers off. His childish giggle sent a shiver of fear down your spine as you landed on the cold floor and looked up at the giant boy from the floor. <br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1431406800,
            "id":1977418,
            "title":"Weekend hell"
        },
        "121131":{
            "choices":[
                "Give in and begin your smelling session!",
                "Put up a fight"
            ],
            "content":"<div class=\"\"><div> <span>You stand up and weakly make a mad dash in the opposite direction of Mikey's giant form, of course you don't get far before Mikey's gigantic sole presses on your back and you find yourself pinned to the shaggy carpet of Mikey's messy bedroom. You can hear Mikey from up above humming a tune and pretending like you aren't there as he wiggles and flexes his toes into the carpet, gently grinding his soft young sole into your back.<br>\r\n<br>\r\nYou scream and beg, smelling nothing but the scent of Mikey's foot which is threatening to snap your spine in two. Mikey finally lifts his foot off of you, and laughs obnoxiously as he sees you glued to his stinky sole. <br>\r\n<br>\r\n\"Hehehehehe! Enjoying yourself?\" He peels you off like an old sticker from his vast cute sole, and deposits you on the end of his bed, getting comfortable at the head of his bed, propping himself up with his pillows and relaxing with both titanic feet facing upward, on either side of you.<br>\r\n<br>\r\n\"Get servicing my feet bug! They're tired from my long day at that crappy school! I want you to take BIG whiffs of their smell first though...and tell me how awesome and powerful I am compared to you, I want you to sniff all the way from my sole to the ball of my foot, and climb your little pathetic body up to my toes and sniff between them! NOW!\" <br>\r\n<br>\r\nMikey orders tyrannically as he gives all ten of his toes a powerful flex.</span></div></div>",
            "created":1431406800,
            "id":1977426,
            "title":"Running for your life!"
        },
        "1211311":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "No you get punished",
                "Yes, you get rewarded"
            ],
            "content":"<div class=\"\"><div> <span>His words sent shivers down your spine, and his power and sheer size made you very scared indeed as you listened and did your best to obey your new Master. You fell to your knees and crawled towards his vast soles, towering over you like skyscrapers, huge, smelly skyscrapers. As you crawled, the smell grew stronger, until you were right against his sweaty skin and you had to force down every single instinct you had just to give his slimy soles a big sniff.<br>\r\n<br>\r\nMikey was relaxing, wiggling his toes high above you without a care in the world as he felt your kiss and grinned \"Come on little bug, you better get sniffing and climbing\". He snapped as you got very scared by his words and you stood up and began to take in deep breathes along every inch of his heel and as high as you could reach up his vast sweaty soles.<br>\r\n<br>\r\nThe smell was intense, this boy clearly hardly washed his socks, or his shoes, or even his feet from the state of them. A soft yellow tinge colored his feet, stains from his sweaty gym socks, which made them even more terrifying for you. \"Pl...please Master, i...i.i;m trying\". You stuttered as you reached up and grabbed onto the winkles in his tender young sole and found a few footholds too as you began to climb. <br>\r\n<br>\r\nWith each bit you climbed, you took in a deep breath, feeling his intense foot stench burning the inside of your tiny nose, hoping to please Mikey and have some mercy. <br>\r\n\"I can feel you climbing little bug, you are nothing to me, your life is utterly worthless, tell me how powerful and how much better i am than you\". Mikey thundered down at you as he lay back, enjoying his little foot slave's work.<br>\r\n<br>\r\n\"You are ev..everything M..m..Master you are so powerful, you rule my wor...worthless life Master\". You cried out, hoping he would be pleased as you soon reached  the ball of his foot and the level of thick aroma increased remarkably the closer you got to his funky toes.<br>\r\n<br>\r\n\"Well done you pathetic insect, i should reward you\". This filled you with some hope, but it was suddenly dashed. \"Too bad i don't reward worthless bugs\". He burst out laughing and he loved his little joke as your heart sank and your long climb continued to breath in his thick, powerful aroma, the scent was making you feel slightly light-headed, his power over you was clear.<br>\r\n<br>\r\nYou looked down and saw his vast sole below you and his bed, you looked up and saw only his toes wiggling slightly above you as you made the last effort and reached his toes. They were very soft and impressive as you climbed between the big and second toe and looked back along his vast teenage body, to his smirking face as you completed the task and licked his lips high above.<br>\r\n<br>\r\nIs Mikey impressed? </span></div></div>",
            "created":1431406800,
            "id":1977440,
            "title":"Foot climbing"
        },
        "12113111":{
            "choices":[
                "Mikey taunts and tortures you with his funky pits!",
                "Mikey pushes you into his bellybutton!"
            ],
            "content":"<div class=\"\"><div> <span>Mikey grins diabolically, but leans his head back against his nice soft pillow and sighs, his grin becoming hidden behind a mask of feigned displeasure.<br>\r\n<br>\r\nThough you don't know that its a trick, and find yourself shivering fearfully between Mikey's toes as the teenage titan speaks domineeringly.<br>\r\n<br>\r\n\"You puny insect! I could barely feel your breath on my foot! I think you were holding out on me!\" Mikey leans up, that dominating attitude still present as he glares at you between his funky toes.<br>\r\n<br>\r\nTilting his head to the side, he smirks. \"Whats wrong? Can't handle my...BIG,\" he clenches his toes together, smooshing you into the greasy walls and getting you covered in toe cheese as he rubs you with them. \"STINKY,\" He continues to rub, making his voice go deeper to frighten you more as he leans up towards you and grins evilly down at you. \"FEET?\" He finally finishes his torment of you, spreading his toes and allowing you to feel like you aren't going to pop at any moment, you collapse and dangle with your front hanging over the top of his foot, and your legs dangling down upon his young sole.<br>\r\n<br>\r\nMikey wastes no time and plucks you from his crusty toe crevice, holding you up to his face and licking his lips hungrily.<br>\r\n<br>\r\n\"I bet a toe cheese covered tiny loser would taste great!\" Mikey tosses you onto his tongue and begins sloshing you around his mouth, sucking his own foot fungus off of you and swallowing it down after tasting it for a bit, nearly sucking you down his throat as well.<br>\r\n<br>\r\nHolding you in his mouth, he slips off his sweaty shirt and spits you out onto his open palm.<br>\r\n<br>\r\nHe holds you as he relaxes back on his pillows with a sigh, dropping you onto his young belly, dangerously close to his navel.<br>\r\n<br>\r\nHe relaxes both arms behind his head, revealing his ripe young armpits, just recently sprouting tiny blond hairs. <br>\r\n<br>\r\nHe grins down at you mischievously as he airs out those rank pits of his.<br>\r\n<br>\r\n(What happens next?)</span></div></div>",
            "created":1431493200,
            "id":1977786,
            "title":"No you get punished"
        },
        "121131111":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Yes, lets you back to his feet",
                "No, puts you somewhere worse"
            ],
            "content":"<div class=\"\"><div> <span>Hearing the almost soothing pounding of the young giant's heartbeat under your tiny feet, you knew you were in trouble as his arms were raised and his glistening armpits were revealed to you. The skin was covered in a thick sheen of boy sweat and the smell was horrendous, it made you gag even down on the titan's stomach. As you stood there, in awe of this teenage boy's funky, moist stench, the warmth of his skin underfoot made you begin to sweat as well as his vast hand reached down and wrapped around you.<br>\r\n<br>\r\nYou screamed as you felt the heat from his hand and those long, clammy fingers wrap around you, holding you tight as he lifted you up to his grinning young face, licking his lips slowly as he looked at you. \"I almost feel sorry for you, ALMOST\". He giggled childishly as he brought his face into his armpit and sucked in a huge breath of his own funky armpit stink.<br>\r\n<br>\r\nHis gasp made you shiver as he moaned slightly and grinned down at you. \"Wow i can almost taste it, God i love his my pits smell\". He said, licking his lips eagerly down at you as he lifted his arm up and brought you closer to his armpit. \"Oh you're gonna love this you pathetic insect, you think it was bad for me, well it's gonna be much worse for you\".<br>\r\n<br>\r\nMikey burst out laughing as he pushed your tiny naked body up into the very heart of his armpit and slowly closed his arm around you. You struggled and screamed \"Please Mikey, please let me out of here, i learned my lesson, please?' You begged as the foul smell invaded every sense you had, the sweat covered your skin, the smell was rubbing your nose raw and the pounding of his heart only added to his power.<br>\r\n<br>\r\n\"I can feel you struggling in there, you are so completely pathetic, you'll never escape, unless i can really feel you sniffing my funky pits\". He said, the sound echoing inside his armpit and it was very clear what you needed to do, just to escape this steamy hellhole. It was darkness inside his armpit, but the smell was everywhere, it stung your eyes and burnt your tiny nose as you did your best to obey and took in deep breaths of his thick, funky aroma.<br>\r\n<br>\r\nHis giggling was clear to hear as you breathed in his pit stink, but was he pleased?</span></div></div>",
            "created":1431493200,
            "id":1977798,
            "title":"Mikey's funky pit slave"
        },
        "1212":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Obey and lick",
                "Obey and rub your face in his sweat",
                "Disobey and bite him"
            ],
            "content":"<div class=\"\"><div> <span>\"I could, but you have to do something for me first\". his words rang in your tiny ears as you wondered what he would make you do. Your worst fears were realized when Mikey slowly lifted up his arm, and the thick, putrid stench radiated out almost instantly.He was infamous for his smelly armpits, but this was something new as it burned the inside of your nose as you struggled.<br>\r\n<br>\r\n\"You can fight all you want little runt, but you're gonna lick my pits one way or another\". That sent another cold chill down your spine and you knew better than to mess with a giant boy like Mikey.<br>\r\n<br>\r\nHis boyish grin grew wider as he slowly lifted off his sweaty shirt, already well stained from many days of wear and the smell only got worse. He already had a few hairs sprouting from his glistening skin, but it was the intensity of the thick, palpable stench that amazed you the most.<br>\r\n<br>\r\nYou struggled a little as your eyes were watering and your throat was dry from fear as he slowly brought you up to his sweaty armpit, the hairs dripping with his teenage sweat and the smell got stronger the closer you got.<br>\r\n<br>\r\n\"Now get licking little runt\". he snapped as he pressed your face against his armpit flesh, you face was instantly soaked in his sweat. It was so vile and disgusting you wanting to puke just from touching it.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1431406800,
            "id":1977404,
            "title":"Mikey's funky pits rule"
        },
        "123":{
            "choices":[
                "Jump out of the way - just in time.",
                "Get pinned under his sweaty ass",
                "Get spotted by the black haired bully"
            ],
            "content":"<div class=\"\"><div> <span>Swearing up a storm, Justin makes his way to the bench - you can tell he's in a foul mood. \"F&amp;*ing Mikey's gonna f&amp;*ing pay after class for that foul\" Justin says under his breath. The chubby boy glowers at coach before turning his formidable ass on you and starts to sit down. You feel the heat before you sense the smell. Justin's cushy tush is being lowered slowly over you. As he bends over, his pants slip down a little on his sweaty ass, exposing a hairy, musky ass crack. \"NOOOO\" you scream as you try to dodge the boy's butt. It's coming down right on top of you. You...<br>\r\n<br>\r\n</span></div></div>",
            "created":1428728400,
            "id":1962483,
            "title":"Justin (15)"
        },
        "1232":{
            "choices":[
                "Justin lets one rip - right on top of you",
                "You flail and punch at the clothed flesh around you",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Horror of horrors, Justin's sizeable chunk pins you to the wooden bench. His warm sweaty ass cheeks pour their warmth and odor over your helpless form. You're not sure if you should wiggle to get his attention or if you should zone out and find a happy place. Justin's not a kind kid - least of all to you. There's no telling what he'll do to you - especially if he feels you squirming under his ass. On the other hand, you're not sure if you can live much longer pressed down in the rank, humid heat of a boy's ass. Gasping for breath, the color drains out of your face as you see and feel Justin rocking to one side. You hear a gurgling roar emanating from directly above. No!  Please no! Anything but that!!!</span></div></div>",
            "created":1428728400,
            "id":1962488,
            "title":"Get pinned under his sweaty ass"
        },
        "12321":{
            "author_id":"njeraldson2",
            "author_name":"njeraldson",
            "choices":[
                "\"You're right, I do!\"",
                "\"No, that's gross.\""
            ],
            "content":"<div class=\"\"><div> <span>Brrrrrrpft! <br>\r\n<br>\r\nThe fart is mercilessly released on you and Justin softly places his leg back down, leaving you to suffer. <br>\r\nYou cough, your frequent movement suddenly alerting Justin of your presence. <br>\r\n<br>\r\n\"What the fuck? What is that...\" He stands back up and inspects his seat. He finds you, of course. He picks up your weakened body with a deadly smirk. <br>\r\n\"Oh, it's you. Whaddaya think you were doing down there, you little bug?\" He asks.<br>\r\n<br>\r\nYou swallow nervously. \"I was there before .... you were.\" You say, trying to sound casual. He laughs, the sound waves nearly shattering your body. \"You're at a real disadvantage here. You sure you wanna make comments like that? Just admit it, you like my ass, you little queer.\"</span></div></div>",
            "created":1437627600,
            "id":2011673,
            "title":"Justin lets one rip - right on top of you"
        },
        "123211":{
            "author_id":"njeraldson2",
            "author_name":"njeraldson",
            "choices":[
                "...you feel inside my belly.\"",
                "...much you like my butt.\""
            ],
            "content":"<div class=\"\"><div> <span>\"You're right, I do!\" you chirp. You figure if you're gonna die may as well go out with a bang and mess with him a little.<br>\r\n<br>\r\nJustin gaped at you in disbelief, and laughed. \"What the fuck? That's so creepy, you freak.\"<br>\r\n<br>\r\nSilence. So. He wasn't going to lash out and kill you right there? <br>\r\n<br>\r\n\"Yeah, I guess so. What're you gonna do about it?\" you ask.<br>\r\n<br>\r\nJustin seemed to be having a hard time thinking. \"What am I....what...\" He said, looking at you. <br>\r\n<br>\r\nJustin suddenly grinned, and snuck away with you into the part of the locker room meant for the older kids. They were on a field trip, so they weren't here. \"I'm actually curious, It's not every day you find some little wimp shruken down like this. Haha, when I called you pea-sized a few days ago, I didn't mean this!\" he laughed.<br>\r\n<br>\r\nCurious. He was curious? About what? <br>\r\n<br>\r\n\"What do you mean....curious?\" you ask. <br>\r\n<br>\r\nJustin set you down on a bench and sat facing you. <br>\r\n<br>\r\n\"I'm curious about how...</span></div></div>",
            "created":1437627600,
            "id":2011695,
            "title":"\"You're right, I do!\""
        },
        "1232112":{
            "author_id":"njeraldson2",
            "author_name":"njeraldson",
            "content":"<div class=\"\"><div> <span>His words froze your whole body. He wouldn't...he wasn't going to...?!<br>\r\n<br>\r\nSnickering, Justin turned around and pulled down his pants, and underwear.<br>\r\n<br>\r\n\"Heheh, how's your view of the moon, shrimp?\" He taunted, wiggling his cheeks.<br>\r\n<br>\r\nYou were too humiliated to speak.<br>\r\n<br>\r\n\"Hope you want to be an astronaut. Or should I say, \"asstronaut\"?\" He chuckled at his own joke, patting his ass, but you remained quiet.<br>\r\n<br>\r\n\"Aww, whats'a matter? Suddenly you don't like it? Start begging, or I'll make you a crater.\" He threatened.<br>\r\n<br>\r\n\"O-oh Justin, please let me handle your rear.\" You stammer out. <br>\r\n<br>\r\n\"Since you asked so nicely.\" He teased, lowering his gargantuan ass to your head. \"Why don't you kiss it? Right in the hole. Since you <i>loooove</i> it so much.\"<br>\r\n<br>\r\nYou would rather die, so you make your hand mouth like, and peck at his butthole.<br>\r\n<br>\r\nYou were rewarded with a deafeningly loud fart that made you fall over. He cackled insanely.<br>\r\n<br>\r\n\"Alright, enough messing around. I think it's about time to wrap this up.\" He declared.<br>\r\n<br>\r\n\"What do you m--\" You were cut off by the sight of his titanic buttocks falling right on top of you. You wheezed, your organs threatening to shoot out of your mouth.<br>\r\n<br>\r\nHe ground you into the bench, hips swirling in a circular motion and side to side. \"You like that? Survive this, and I've got a special treat for you.\" He bargained.<br>\r\n<br>\r\nWhen he found you were barely alive, he picked you up. \"P.U.! What happened to you?\" He said, aghast, then burst into laughter.<br>\r\n<br>\r\n\"OK, a promise is a promise. I know you'll love this. But before I do it, I just want you to know, this is what happens when you get ballsy.\" He said, snarkily.<br>\r\n<br>\r\nYou were barely able to see, your arm felt limp. You never would have expected he'd do this...<br>\r\n<br>\r\nHe picked you up, and stuck his bottom out. \"Are you ready for your new home? You might have to clean up a bit in there, though.\" He joked.<br>\r\n<br>\r\nWith sudden horror you realize he's--!<br>\r\n<br>\r\nBefore you could react, he violently shoved you against his asshole, then mercilessly began forcing you in with his finger.<br>\r\n<br>\r\n\"Jus--\" Was all you could say before the light of day vanished from your sight. You were sucked into his body, never to be seen again.<br>\r\n<br>\r\nOutside, Justin smirked, rolled his hips, and pulled up his pants.<br>\r\n<br>\r\n\"Hope you're comfortable~\" He sung, smacking his butt, then exiting the locker room.</span></div></div>",
            "created":1507892700,
            "id":2400573,
            "title":"...much you like my butt.\""
        },
        "12322":{
            "choices":[
                "holds you in his palm to get a better look at you",
                "puts you somewhere stinky for safe keeping"
            ],
            "content":"<div class=\"\"><div> <span>\"WHAT THE...\"<br>\r\n<br>\r\nJustin stops what he's about to do - to your immediate relief. Still, was it wise to poke a farting giant? He stands up and regards the bench, a sweaty imprint of his ass left on the spot. You're in the relatively dry space between two soaked circular shapes. Not to say that you're not soaked with a fine layer of HIS sweat. <br>\r\n<br>\r\n\"You f*&amp;ing perv!\"<br>\r\n<br>\r\n\"Wait, Justin! I have no idea what happened here! I woke up shrunk on the bench ... there was nothing I could do - you sat down on me!!! PLEASE HELP!\"<br>\r\n<br>\r\nA smirk alights on Justin's round face. He bends over to get a better look at you. \"I don't care what you did, how you got here, or what your plans are, little runt! The It's your lucky day...\"<br>\r\n<br>\r\nYou feel a weight lifted off your shoulders - and not just from the stinky massive weight of the chubby bully's body no longer sitting on you. Relaxing you start to say \"Thank you.\" But the cowlicked boy's eyes gleam with sadistic pleasure.<br>\r\n<br>\r\n\"... Because you're mine now!\"<br>\r\n<br>\r\nJustin roughly picks you up and</span></div></div>",
            "created":1428728400,
            "id":1962492,
            "title":"You flail and punch at the clothed flesh around..."
        },
        "123221":{
            "choices":[
                "stash you in his sock",
                "pop you in his mouth"
            ],
            "content":"<div class=\"\"><div> <span>All kinds of terrifying thoughts pass through your mind. What are his plans? Will you survive his ownership? He holds his palm up - slightly shaky from his physical exertion earlier and so excited for his lucky find. \"So... What to do with you...\" He thinks aloud, enjoying your shakes of terror.<br>\r\n<br>\r\n\"Please, man! I don't want anything from you - just give me to the teacher - we can sort everything out. I'd be happy to uh... reward you for your kindness...\" You offer to the bully.<br>\r\n<br>\r\nIgnoring your pleas, the brown haired bully strokes his chubby chin. His lips curl in an evil sneer. \"Let's see... you'd make a nice little personal sex slave...\" You gulp -you know for sure you would NOT love that job. Justin's body wasn't exactly beautiful, plus, you weren't exactly INTO, well... boys.<br>\r\n<br>\r\n\"Or...\" He winks at you and licks his lips - his slimy tongue impossibly big compared to you. He opens his mouth to taunt you and snaps his jaws shut. He makes a large gulp to taunt you, tracing his esophagus down to his ample belly, which he pats. All the while, his steely eyes have locked onto yours - daring you to say something. Instead, you stare apoplectic at the giant boy, shaking in his palm.<br>\r\n<br>\r\nYour staring contest is interrupted by a call. \"Justin- back in the game!\" Coach roars over at the bench. Caught off guard, Justin has to hide you. Looking around for somewhere secure, he decides to</span></div></div>",
            "created":1428728400,
            "id":1962500,
            "title":"holds you in his palm to get a better look at you"
        },
        "1232212":{
            "choices":[
                "start eating you",
                "trap you inside while he plays"
            ],
            "content":"<div class=\"\"><div> <span>His lips part, you feel your world accelerate toward certain doom. The dark cavern opens before you. You barely dodge his teeth as he guides you quickly up to his chubby face. You scream as loud as possible:  \"NOOOOOOOOO\" until your cries are cut off. Your head passes between his lips - a little hair on his upper one. As his palm slaps against his lips, your intertia propels you along his slimy tongue. You coast to a stop on the hot, slimy muscle. Wrenching your body around, you look desperately at the outside world. You reach your arm out trying to grab onto hope. The light of the outside world illuminates the inside of the bully's wet mouth. Unbrushed teeth line the entrance you just passed through. Humid heat washes over you as his saliva drips on your body. You scream once more as Justin's lips seal shut in order to</span></div></div>",
            "created":1428728400,
            "id":1962501,
            "title":"pop you in his mouth"
        },
        "12322121":{
            "choices":[
                "between his molars",
                "at the back of his throat"
            ],
            "content":"<div class=\"\"><div> <span>Panic and fear pour out of you like your cries and tears. You wonder if Justin can taste them. This is so unfair! You did nothing wrong and ended up on the menu of the chubby bully who's made your life a living hell for the last couple of year. Only now, he's introducing you to the hell of his mouth. \"You can't do this!\" you wail. \"PLEASE DON'T DO THIS TO ME!\"<br>\r\n<br>\r\nJustin ignores you, or rather doesn't respond. He's actually enjoying your begging. Often lashing you with his tongue to elicit more of a response from you as he plays. Thoroughly slathering you with goopy strands of thick smelly saliva, Justin realizes it's time to enjoy his little snack. You scream as you feel his tongue move you with purpose. Despite your struggles, the chunky bully positions you</span></div></div>",
            "created":1428728400,
            "id":1962504,
            "title":"start eating you"
        },
        "123221212":{
            "choices":[
                "burps out your air and moves on with his life",
                "gulps down some more air so he can taunt you"
            ],
            "content":"<div class=\"\"><div> <span>\"NO!!\" \"JUSTIN!\" \"PLEA--<br>\r\n<br>\r\n<span style=\"line-height:3;\">GULP</span><br>\r\n<br>\r\nHeedless to your desperate cries, the cruel bully swallows you whole. You silently thank god that Justin didn't chew you up - you're still alive. But, knowing what awaits, you continue to scream and flail as you realize your new cruel god - Justin - has just banished you to the hell of digestion in his stomach. Is that any better?<br>\r\n<br>\r\nPeristaltic waves drag you down, synchronized to your wails. <br>\r\n\"NO<br>\r\n<br>\r\nNO<br>\r\n<br>\r\nNO<br>\r\n<br>\r\nNO<br>\r\n<br>\r\nNO!!!!!\"<br>\r\n<br>\r\nYou scream as the muscles crush and grind you - guiding you to your doom. How humiliating - being handled so roughly by a big boy, and he's not even working at it anymore. His mind is on the game; it's certainly not off you just yet - he relishes your squiggling and squirming. He might tell one of his friends about it later. But he's turned you over to his autonomous nervous system. No voluntary control over you anymore. At least not until...<br>\r\n<br>\r\nYour head crests a tight sphincter which gladly opens like it does for any other food. Except you aren't just any other food! You're a living human being trapped inside a chubby boy about your age! His stomach doesn't care - it accepts you. For a terrifying second, you free fall into the sweltering slime. Jostled about inside the giant boy, you cry as you realize you're going to die here - in the stomach of a 15 year old boy. The smell and heat make you woozy and sick - you vomit, adding to the horrid mixture you're practically swimming in. <br>\r\n<br>\r\nJustin smiles as he feels your desperate thrumming against his stomach walls. He rubs his stomach as you scream. The bell rings - time to go shower and change! What was that? A pang of guilt? Nope! Just you - throwing your weight into his stomach walls. Justin steps into the cool locker room, the cool air tingling his skin. You slip into the slurry, half-buried by half-digested breakfast mush, the glop tingling your skin. Instead of showering or changing, Justin looks at his naked body in the mirror - chunky and large, big-bellied, he wishes he could see your struggling form through his skin. The boys file out - one-by-one - all sidestepping the voluminous bully carefully. A foul-tempered, bad-mannered powder keg, they knew better than to invite unholy hell upon them. You, however, are experiencing a new definition of pain and suffering - Justin's own personal gastric hell.<br>\r\n<br>\r\nThe room goes quiet. Justin</span></div></div>",
            "created":1428728400,
            "id":1962515,
            "title":"at the back of his throat"
        },
        "1232212122":{
            "choices":[
                "He thinks of something dirty",
                "He thinks of something violent"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You feel a refreshing wind come from above. Surprised, you renew your screams and struggles. Justin smirks, surprised that he can hear you. He decides to get the most out of this situation by taunting you, but how to do it best?...</span></div></span></div>",
            "created":1428728400,
            "id":1962517,
            "title":"gulps down some more air so he can taunt you"
        },
        "12322121221":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>As Justin's bare feet plod along the cold tile floor of the locker room, you slosh around dangerously in his stomach. You frequently lose your footing in the mushy grime that squishes between your toes and splash into it yourself. The feeling is beyond intense, beyond gross, beyond embarrassing; the stinging on your skin makes you whimper in pain, the stink of the stomach makes you lightheaded and woozy, and the humiliation of being nothing more than a morsel of digesting food makes you angry. \"Let me out of here, you nasty $hit!\" you thunder as you pound against his stomach wall.<br>\r\n<br>\r\n\"That's some pretty f*&amp;in' ironic language, little snack,\" taunts the bully with a playful belly slap. \"Hey - try and guess what I'm doing!\"<br>\r\n<br>\r\nYou feel Justin drop his ample figure down to a seated position. This causes an avalanche of chewed Cheerios to cascade onto you - temporarily pinning you to the rugged slimy walls of your eater's stomach. Not only are the flowing juices and enzymes filled with the painfully tingly acid, the masticated mush also coats you with a warm burn. You shriek in disgust. You hear all sorts of nasty sounds - of course the gurgling borborygmus in the stomach and the intestines below - slime coated walls of muscly tissue massaging the air bubbles out of digesting goop. Added to the symphony of secretions are Justin's grunts. You feel his stomach pressing tightly in on you as the pressure in his rounded abdomen doubles - triples! Added to this chaos is a new sound - a slippery series of slimy pops. Suddenly, Justin sighs and a reasonably loud PLOP sound comes from directly below.<br>\r\n<br>\r\n\"EWWW!\" You scream. Justin smiles at your revelation. He rubs his jiggly belly vigorously. \"Haha - no use getting grossed out or offended, snack, that's in your immediate future. Better get used to the idea. 24 hours from now, it'll be your turn to...\" You feel the stomach shift to its side as Justin looks between his legs... \"WOW! to fill the bowl, apparently! HAHA.\" Your cheeks burn with shame - or is it with digestion? No... with shame. Justin continues. \"I know I'm not some tiny little fairy - I'm big boned and I eat a lot - which makes for some impressively sized craps.<br>\r\n<br>\r\n\"STOP!\"  You shriek, mortified. \"I DON'T WANT TO HEAR THIS!\"<br>\r\n<br>\r\nJustin's lips crack into a victorious smirk. He's found a new button to push. \"Well, too f*&amp;king bad, Snack - you need to accept the idea that you're gonna be a <br>\r\nBIG<br>\r\nBROWN<br>\r\nSMELLY<br>\r\nSLIMY<br>\r\nSTEAMING<br>\r\nload of boy poop!\" This elicits a fit of giggles from Justin who's cut off by a series of his own rancid farts. \"Go ahead and imagine it now - you were so interested in meeting my ass on the bench - you'll just have to wait a day, snack! Wait... Haha! I guess I can't call you 'Snack' forever. Sometime tomorrow, you're name's gonna be 'Turd,' won't it?\"<br>\r\n<br>\r\n\"PLEASE... STOP...\" you scream.<br>\r\n<br>\r\nJustin's smirk becomes a cruel chuckle. \"Oh, it's gonna happen, Snack. You can count on that. You get the distinguished honor of adding to my belly and ass.\" He gives his belly and affectionate rub. \"And then you get the dirty duty of giving me the pleasure of a sloppy dump. Don't you just love the feeling?\"<br>\r\n<br>\r\n\"I never noticed.\" you mumble under your breath. Surprisingly Justin hears this. <br>\r\n<br>\r\n\"Don't kid yourself. Everyone secretly loves the feeling of dropping a deuce. And when you're taking the slow ride out my ass tomorrow on the sewer express, you'll give me that feeling. I bet you feel awesome coming out!\" <br>\r\n<br>\r\n\"YOU ARE SO GROSS\" You moan, turning violet - embarrassed beyond belief, indignant that he's stooping so low and talking so dirty to put you down.<br>\r\n<br>\r\n\"Nah, snack, YOU are. You're the one that's gonna be the $hit of a 15 year old boy.\" He chortles with laughter as you imagine yourself as a turd. This is freaky. \"I take it back. I guess you're gonna make a mess of my butthole!\" More snickers as you hear the telltale roar of the toilet paper dispenser making its rounds. A quick snap sound, another lean to the side, and then a raking noise. \"Whew! You're gonna stink - you hear him report. Kinda crazy how something cute and tasty like you is gonna turn into something so horrifying, smelly, and mushy!\"<br>\r\n<br>\r\n\"PLEASE!\" You wail. Your skin is on fire and you're deeply humiliated. \"I DON'T WANT TO BE YOUR SHIT!\"<br>\r\n<br>\r\n\"You will,\" he taunts. \"After hours of suffering in there, you'll be begging to be a new brown color. Being smeared off my asshole on to some folded up TP won't hurt you. You'll wish to fast-forward to the flushable end result. But you won't be so lucky. Being shit is easy - BECOMING shit is the scary part.\"<br>\r\n<br>\r\nThis can't be happening. But it is. As if the agony weren't enough... He's rubbing it in worse than his stomach muscles - the ones designed to rub in the digestive enzymes!<br>\r\n<br>\r\nAnnoyed at your silence Josh continues as he wipes. \"What? No response to that? Fine - I'll give you a choice. Ask me for the honor of being my shit, and I'll burp out your air - you'll suffocate, but it'll be quicker. Play the martyr and give me the silent treatment, I'll make you suffer and burn all day. I can keep gulping down air for you, and you won't be able to end it any quicker. So - whadd'ya say? Ready to get turned into Middle-Schooler shit?\"</span></div></div>",
            "created":1428814800,
            "id":1963165,
            "title":"He thinks of something dirty"
        },
        "123222":{
            "choices":[
                "His shorts",
                "His shoe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The bully chuckles with glee at his good luck. You shudder wondering what he has in store for you. Can you fight? Can you run? Can you reason with him? Probably not.<br>\r\nYou gasp as Justin pinches your tiny body and slowly lowers you to</span></div></span></div>",
            "created":1428728400,
            "id":1962494,
            "title":"puts you somewhere stinky for safe keeping"
        },
        "12323":{
            "author_id":"zantox100",
            "author_name":"zantox100",
            "choices":[
                "You begin to sink into the shit ",
                "Justin notice something up his butt "
            ],
            "content":"<div class=\"\"><div> <span>The gurgling from Justin's guts gets more intense and you decide to try to wiggle yourself out of his crack before it's filled with even more of that humid stench you been forced to smell, but as you begin to wiggle forward you notice that you slowly slide backwards because of the angle of the ass-crack, Justin must have slumped down against the wall behind him, putting pressure on the back of his butt.<br>\r\n<br>\r\nAs you continue to slide backwards you suddenly find your face pressed up against a tighten hole that you realize must be Justin's sphincter, your face is forced up against it, and the smell and taste is horrid, then you hear the gurgling one last time right above you, when suddenly the sphincter relaxes a bit and spews out the most foul air you could ever imagine, but as the gas flow slows down the sphincter is still relaxed for a moment and that's enough for your greased up head to slide into the sphincter and begin being sucked upwards, you feel the cold world outside for the last time as your feet gets engulfed by Justin's powerful sphincter, you realize why the gas have had such a potent smell to it as you are forced up against some huge logs of shit, that's taking up most of the space in Justin's bowels.<br>\r\n<br>\r\nYou begin to panic as...   </span></div></div>",
            "created":1595935200,
            "id":2876856,
            "title":"Something else happens"
        },
        "123231":{
            "author_id":"zantox100",
            "author_name":"zantox100",
            "content":"<div class=\"\"><div> <span>The walls of Justin's bowels begin to compress around you, forcing you up against the huge smelly shit log, but to your horror you realize that the log begin to engulf you.<br>\r\n<br>\r\n\"what have i done to deserve this fate, humiliated and farted on by the person that had made my life hell since the first day of middle school, and now i'm about to drown in his shit inside of his ass hole\" <br>\r\n<br>\r\nYou think to yourself, as your body sink deeper and deeper into the squishy log of shit, you feel it's heat radiating all around your body, soon your face sink into the log and then there's nothing left of you, just because of a simple mishap you are now part of a pile of poop inside of your bully, and no one would ever find out what happen to you.<br>\r\n<br>\r\nOn the outside, Justin is still resting on the bench, feeling some more pressure from his bowels he leans to one side and lets one rip,<br>\r\ngees, better hit the toilet before next period, Justin mutters wile fanning his hand in front of his nose. </span></div></div>",
            "created":1595935980,
            "id":2876869,
            "title":"You begin to sink into the shit "
        },
        "124":{
            "author_id":"chido3000",
            "author_name":"BeningZeus343",
            "choices":[
                "Yes",
                "No "
            ],
            "content":"<div class=\"\"><div> <span>Gerardo (14) - A dedicated and attentive young man, he has perfect behavior in school and in his family, always gets good grades and congratulations from his parents, he is a boy with black hair, big eyebrows and a very marked abdomen, he is light brown skin , But what makes him bad is because he secretly wants to have the mastery of a little man, another horrible thing is that he has some huge feet for his age and the worst thing is that he has the reputation of having the most foul-smelling feet Never found.</span></div></div>",
            "created":1495355580,
            "id":2323038,
            "title":"Other Choices"
        },
        "125":{
            "author_id":"jkios",
            "author_name":"jkios",
            "choices":[
                "Darius",
                "Luke",
                "More Choices"
            ],
            "content":"<div class=\"\"><div> <span>Darius (13) - A short handsome boy with curly hair and medium brown skin. He is a great athlete and has a slender yet very toned physique. He has very big hands and feet for his size, and because of his constant exercise he sweats a lot. He is somewhat arrogant and would definitely choose to dominate anyone who is inferior to him.<br>\r\n<br>\r\nLuke (14) - A tall redhead who is one of your close friends. He has just hit puberty and as a result he already has a very strong body odor. He has always been nice to you but you have a feeling that he would be willing to mess with you to an extent. </span></div></div>",
            "created":1573610040,
            "id":2745934,
            "title":"Other Choices"
        },
        "1251":{
            "author_id":"jkios",
            "author_name":"jkios",
            "choices":[
                "Puts you in his shoe",
                "Puts you in his armpit",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>You look up and see the usually short body of Darius towering over you. As you begin to scurry away, he picks you up effortlessly with his enormous hand and brings you up to his face. “How’d you get so tiny, man?” he asked you. “I don’t know, but please help me!” you begged him. <br>\r\n<br>\r\nYou have always secretly had a crush on Darius, but you knew he did not feel the same way at all. Your fears only increased as you saw him grin smugly. “I think a pathetic little bug like you would serve best as my personal slave,” he said cruelly. “Don’t worry, man. You’ll love it.” <br>\r\n<br>\r\nHe then decides to....</span></div></div>",
            "created":1574046240,
            "id":2748087,
            "title":"Darius"
        },
        "13":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "9",
                "10",
                "11",
                "12"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What grade?</span></div></span></div>",
            "created":1543255920,
            "id":2582363,
            "title":"High school"
        }
    },
    "info":{
        "author_id":"jgp149",
        "author_name":"Jack Grey",
        "brief_description":"Shrunk in school, how will you survive?",
        "created":1309265160,
        "description":"<td align=\"left\" class=\"norm\">You are a student at Hillside School, which teaches students from elementary all the way up to high school level.<br>\r\n<br>\r\nKey locations:<br>\r\n<br>\r\nClass rooms<br>\r\nSchool Gym<br>\r\nLocker Room<br>\r\nAssembly Hall<br>\r\n<br>\r\nThis is an all boys school, but if a male character takes you home, you can interact with any female characters you wish, but try and stick to the males as much as possible.<br>\r\n<br>\r\nAbove all have fun.<br>\r\nNo one line chapters, expect set-up chapters.</td>",
        "id":1789204,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595935980,
        "modified":1595935980,
        "pretty_title":"School Shrink"
    }
}