{
    "chapters":{
        "1":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "Childhood",
                "Teens",
                "Adulthood",
                "Senior Years"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which stage in your life do you want to recall?</span></div></span></div>",
            "created":1582866000,
            "id":2794436,
            "title":"Always lower"
        },
        "11":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "A day at the kindergarten",
                "Back home"
            ],
            "content":"<div class=\"\"><div> <span>You still remember this day clearly. You were woken up by your mom's big feet crushing the wind out of your 2 yr old body. As she didn't see why she would buy a crib, she just laid a matress on the ground next to her bed, and made you sleep there. She stepped off, and ordered you to start getting ready, as it was your first day at the kindergarten. And you were quite aware for a 2 yr old. So you went and brushed your teeth, washed your face, and wore the clothes she laid out for you, while she got dressed, and off you guys went. You arrived, and you hopped out of the car, and followed your mom in. She stopped suddenly, and you bumped into her huge ass and fell backwards. You knew you had to apologize for this, so you kissed both her butt cheeks, while she looked down on you, and scolded you to watch out. <br>\r\nOnce you entered the place, you saw the pretty drawings on the wall, the other kids playing with the cool toys, the mistresses walking around, and your eyes fixed on your favorite plushie, a teddybear on the  ground in front of you.<br>\r\nThe teddy's face, and whole body, was soon covered by 2 huge bare white feet, with purple painted toe nails. <br>\r\n\" Hi! I'm Carol. And you must be Miss Brenda. And this little cutie must be Bobby.\" the woman who flattened the teddy said, as she pinched your cheek.<br>\r\n\" We don't always get this kind of requests from parents, miss Brenda, but as promised, we will return Bobby to you basically worshipping the ground you walk on.<br>\r\n- Exactly what I wanted to hear.\" said your mom<br>\r\n\" Now little Bobby, as your entrance exam, I want you to show obedience to your Mom and I, by kissing the lowest part of our bodies, our feet. If you do so, you can save this teddybear from being mangled under my feet, hihi, now go ahead. \"<br>\r\nYou didn't really have a say, you barely were up to her and your mom's knee level, and what choice did you have, you can't stay out in the streets while your mom goes to work. So you bent down, and first kissed your mom's feet through her thong sandal, and then your new teacher's , miss Carol.<br>\r\nCarol then pinned you down with one foot on your head, while she negotiated something with your mother, who didn't seem concerned at all that her only son was being stomped under the feet of another woman in front of her. <br>\r\nShe took her foot off your head, and walked in, telling you to pick up the teddy bear, which was now half an inch thick, and looked kinda soggy and sad. <br>\r\n</span></div></div>",
            "created":1582952400,
            "id":2794799,
            "title":"Childhood"
        },
        "111":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "Continue the day",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You walked behind your mistress Carol, who was wearing 3/4 jeans, a tank top, and bare footed as you saw, while holding the lovely teddy that just was squished under said feet. You passed all the kids playing with all sorts of toys, until you reached a pile of flipflops and sandals.<br>\r\n\"Ok Bobby, as per your mother's request, you're to be trained to obey, that's why you're not gonna be playing with the other kids, instead, you will be doing a series of tasks and chores designed to make you submissive.<br>\r\nFirst, you will use your teddy bear to clean up the soles of our shoes, and as a reward, you will get these cute little chicks to take home and raise. Be very careful and thorough with your cleaning, as if you fail...\"<br>\r\nShe took one foot, and rested it on top of one of the chicks, and make a squelch sounds with her mouth. This made you tremble with fear. So you began right away, using the poor teddy bear to scrub the filthy soles of the sandals.<br>\r\n\" Good boy. Oh and one more thing, whenever one of the mistresses approaches you, you must drop everything you're doing, bow down and kiss her feet, then await her orders with your forehead pressed to the ground, got it?<br>\r\n- Yes miss.\" <br>\r\nAnd not 5 seconds later, a tanned latina mistress came by to greet you, so you wasted no time in bowing down, planting a kiss on the tanned feet with red toes, and pressing your forehead to the ground.<br>\r\n\"Wow her learns quick! The latina mistress said as she pets your head with her foot.<br>\r\n\"Now get back to work.<br>\r\n- Yes miss.\"<br>\r\nYou spent about half an hour scrubbing the soles of each sandal and flip flop, and by the time you were finished, the teddy bear was now black with dirt, with stuffing pouring out.<br>\r\nCarol came back, and you did the ritual of kissing her feet.<br>\r\nShe stood full weight on your back, and you though you were gonna die right here. You heard a rib crack, but you couldn't move, as you didn't want one of the chicks squished under her feet.<br>\r\nStill standing on your back, she crouched down, and inspected all the shoes, and she seemed impressed.<br>\r\nShe stepped off of you, and you felt the breath come back to you.<br>\r\n\"Great job, Bobby! Now come, time for some milk.\"</span></div></div>",
            "created":1582952400,
            "id":2794906,
            "title":"A day at the kindergarten"
        },
        "1111":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "You fail (WARNING: Extreme path)",
                "You pass"
            ],
            "content":"<div class=\"\"><div> <span>You followed Carol the short distance to a private teacher's sitting place, as you weren't to eat with the other kids.<br>\r\nYou watched her pour some milk in a bowl, then casually put her dirty foot in it and start mixing it, dirtying the milk.<br>\r\nYou watched in horror as many mistresses also did the same, the latina miss and a big ebony mistress.<br>\r\n<br>\r\nYou were then ordered to lick the milk off their feet, as they sat cross legged.<br>\r\nYou were afraid for your chicks, so you lapped away at their feet, thanking them after finishing.<br>\r\nSome pinched your cheeks with their toes, others put their feet on the back of your head while you were licking another miss' feet.<br>\r\n<br>\r\nOnce done, Farah (the ebony mistress) dropped a croissant on the floor, and stomped on it, flattening it completely under her feet, then walked off.<br>\r\nThe other mistresses followed her, making sure to step on the croissant on their way out.<br>\r\nYou were then told to eat this.<br>\r\nYou found it hard to actually peel this croissant off the ground, since they flattened it so thoroughly, but eventually you finished it, tasting the feet and dirt on it.<br>\r\n<br>\r\nLinda (The latina) called you over, as it was time for your other task.<br>\r\n<br>\r\nSince it was nap time, your mistresses also napped with the kids, so your task was to be a cushion and a foot massager.<br>\r\n<br>\r\nYour mistresses would sleep in an arc, with their feet converging, and lay their feet on you, and you had to alternate massaging them while they slept.<br>\r\nCarol had her feet on your face, Farah had her feet on your neck, and Linda had her feet on your chest.<br>\r\nAnd these were hefty women, not fat by any mean, but very filled, and somewhat muscular, and their feet and legs were pretty thick and heavy, which made it very hard to breath for you.</span></div></div>",
            "created":1583211600,
            "id":2796187,
            "title":"Continue the day"
        },
        "12":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "Recovering at home",
                "Summer jobs"
            ],
            "content":"<div class=\"\"><div> <span>You were walking down the school hallway, and as usual, someone bumped into you.<br>\r\n\" Oops\", the girl said, without turning back to check, as she stepped on one of your notebooks that she made you drop.<br>\r\nYou sighed, dejected at the fact that nobody in this school even acknowledged that you existed.<br>\r\nWell, except one.<br>\r\nYour cute little girlfriend Tammy.<br>\r\nYou both were 13, you about 4ft 8, she about 4ft 5, so both very short, and both very shy and submissive in nature. <br>\r\nYou guys found solace in each other, and became boyfriend girlfriend pretty quickly.<br>\r\n<br>\r\nYou gathered your books, and hurried to your Math class, as Tammy was taking it with you, so the prospect of seeing her giving a pep to your step.<br>\r\n<br>\r\nAs you were entering the classroom, you saw a group of the older kids that were taking this class huddled around where your girlfriend usually sits.<br>\r\nYou pushed your way in, and you saw a shocking sight.<br>\r\nOne of the most popular kids at school, a certain Kyle, sitting on your girlfriends desk, under his shorts one of her books, and to your dismay, he had taken his flip flops off, and put his bare feet on each side of your girlfriend's small face, and he was smushing it, and moving it around somewhat violently, as he and the other kids were laughing their asses off. Your gf, obviously hurt and humiliated, was crying, and trying with her small hands to move his big strong feet off, but to no avail.<br>\r\nYou couldn't control yourself.<br>\r\nYou smacked Kyle in the back of the head as hard as you could, which to be honest wasn't very hard, but it still surprised him.<br>\r\nHe turned to see that it was you who hit him, so he pushed your gf's face to the floor, and she fell out of her chair, as he stepped down on her head, before stepping to you.<br>\r\nNext thing you know, he had punched you in the stomach so hard, that you felt you were gonna throw up.<br>\r\nKyle was huge. He was 17 years old, 6'2 and 220lbs, and he was on the wrestling team.<br>\r\nYou doubled over in pain, and he tripped you so that you fell on your back.<br>\r\nThen, you saw his huge foot rise up above your face, then stomp down hard, flattening your nose, and smashing your head against the floor hard, and you were knocked out.<br>\r\n<br>\r\nHe kept his foot on your face, as he turns to your gf.<br>\r\n\" Come here and kiss my feet, before I stomp this insect to death.\"<br>\r\nYour gf, scared for you, kneelt down and kissed his big sweaty feet still resting above your face.<br>\r\n\" Say that you'd rather kiss my feet than kiss this wimp.<br>\r\n- I-I can't do that to h-him\", your gf said, whimpering.<br>\r\nSo Kyle just raised his foot up again, and stomped it back down on your face, which made your gf flinch.<br>\r\n\" I'D RATHER KISS YOUR FEET THAN KISS BOBBY's FACE, NOW PLEASE STOP\"<br>\r\nShe was crying her eyes out, so he put his foot back on your face, and ordered your gf to kiss it again, and she did out of her fear for you.<br>\r\nHe took his foot off, and your gf cried harder at the sight of your broken nose and smushed face, as he and a bunch of his friends, boys and girls, spat on your bloody face.<br>\r\n<br>\r\nAll of this was recorded by one of the bullies, and sent to everyone at school, even the teachers.<br>\r\nYou would think this would get the bullies in trouble, but the truth is, even your teachers saw you two as wimps, and deserving of getting bullied, sometimes even bullying you themselves!<br>\r\n<br>\r\nTammy brought you to the nurse's office, and you were sent home to rest, the nurse still laughing at the video of you getting stomped out.<br>\r\n</span></div></div>",
            "created":1583557200,
            "id":2798022,
            "title":"Teens"
        },
        "121":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "Sleepover!",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>Your mom drove you home, then picked you up like a baby and dropped you on the couch.<br>\r\nA notification rang from her phone, and she came and sat on your chest with her huge ass, crushing you.<br>\r\n\"M-mom, p-please, I'm really hurt.<br>\r\n- I'm not sitting on your face, now shut up!\", you didn't dare say anything after she yelled like this, so you resigned to try and keep breathing under this immense weight on you.<br>\r\nYou then hear familiar voices, and turn to your mom's phone.<br>\r\nShe was watching the video of you getting stomped!<br>\r\nNot only that, she was laughing!<br>\r\nYou couldn't handle it anymore, and started crying silently.<br>\r\nYour own mother! Laughing at you getting hurt!<br>\r\n<br>\r\nShe then let out a fart while still sitting on you, which made not smelling it almost impossible.<br>\r\nThe smell made you cough, and your mother started bouncing on your chest for no reason other than to hurt you.<br>\r\n<br>\r\nYou saw her text a bit on her phone, and look back at you, grinning from ear to ear.<br>\r\n<br>\r\nShe got off you, and you inhaled, relieved of the weight on your chest.<br>\r\nYou then drifted off to sleep.<br>\r\n<br>\r\nDing dong!<br>\r\n<br>\r\nThe house bell rang, and your mom, now dressed up in a short dress and some high heeled sandals, went to answer the door.<br>\r\nYou checked the clock, and you must have been out for 5 hours at least.<br>\r\n<br>\r\nThen, you hear a familiar voice: Kyle.<br>\r\n<br>\r\nYour mother greets him so kindly, like she knows him very well, and you sit up to see that they're hugging tightly, with Kyle's hands a bit lower than you would've liked.<br>\r\n<br>\r\nThen behind Kyle, enters 2 girls and 2 boys from the bullying group. They were a bit smaller than Kyle, but still a lot bigger than yourself.<br>\r\n<br>\r\nYour mom guides them to where you were resting, and you immediately cower in fear.<br>\r\n<br>\r\n\"Relax man, I just came to say sorry. I didn't mean to hurt you as much. Your mother invited us over so that we can all talk it out, and your gf is arriving soon, so that we can apologize to her as well.<br>\r\n<br>\r\nYou lied back down, and smiled, a bit at ease knowing this.<br>\r\nYour mom started making some snacks, as your friends started chatting between themselves, kinda leaving you out of the conversation. You felt this was normal, as they know each other more than you, but you still tried to laugh along at their jokes, even if some of them were at your expense.<br>\r\n<br>\r\nSuddenly, a familiar sight replays: Kyle takes off his flip flops, and rests them in front of your face.<br>\r\n\"You don't mind, do you?<br>\r\n- N-no, not at all.<br>\r\n- Good boy.\"<br>\r\nAnd they continue their conversation, with Kyle's big smelly feet right in front of your face.<br>\r\nHis friends were spurred into action by that, and they all took their sandals and shoes off, and rested them near you, or even on you!<br>\r\nYour mother came back with the snacks, and laughed when she saw their feet on you.<br>\r\nKyle had now put his feet on your face, and was smushing you to the couch.<br>\r\nThe bell rang.<br>\r\nYour mother went to answer it, and sure enough, it was your gf Tammy.<br>\r\n\" Oh, it's you\", your mother said condescendingly, as she walked away while Tammy was trying to greet her. <br>\r\n\" You can sit here on the floor in front of me, face to face with your bf\", said Kyle, removing his feet from your face.<br>\r\nTammy sat down, and looked you in the eye. Then Tammy head started getting lower and lower, until you saw that it was Kyle again, with his feet resting on top of her head.<br>\r\n\" Ah, much better. You guys can keep talking, don't mind me. Oh and Bobby, my feet are kinda dirty, can you lick them clean for me please? Or would you prefer Tammy to taste them?<br>\r\n- NO, I'll do it\", you screamed, not wanting to subject your gf to that torture again.<br>\r\nOne of the girls saw this, and came and sat on your chest, and put her feet in Tammy's face, and ordered her to lick it.</span></div></div>",
            "created":1583557200,
            "id":2798030,
            "title":"Recovering at home"
        },
        "1211":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "content":"<div class=\"\"><div> <span>They all cheered when your mom offered them to stay the night, and as it was Friday, school wasn't an issue.<br>\r\nKyle got up and thanked your mother a bit too \"vigorously\", as he hugged and lifted her in the air, something you never saw your dad do, as he wasn't able to physically lift your mother.<br>\r\nYou see you took after your dad, another wimp, he was 4ft 10, a shrimp of a man, weighing in at about 115lbs, while your mom was an amazon, 5ft 11, and 200lbs of fat and muscle.<br>\r\n<br>\r\nThe group had now taken off their clothes and were only in their very tight underwear, and bras for the girls.<br>\r\nYou noticed Kyle's and the other boys' bulges, and they weren't even hard.<br>\r\n<br>\r\n\"Let's play twister!<br>\r\n- But we need a mat for that!<br>\r\n- I know just the thing.\", Kyle said as he laid you and Tammy down next to each other, and ordered you not to move.<br>\r\nBoth of you were scared to death of him, so you froze.<br>\r\n\"I wanna play too!\", your mother said.<br>\r\n\" Well hop in! You go first. spin spin spin, foot to Bobby's face!\"<br>\r\nKyle didn't spin anything, he just said the words, and told your mom where to put her foot, and she did, almost crushing your head, and flattening your broken nose even further.<br>\r\nThe game continued, with you and Tammy equally getting trampled and crushed, until one of them slipped, and the heavy pile of bodies came crashing down on you.<br>\r\nYou got a face full of your mother's ass, and Tammy's face was pushed into Kyle's bulge, and he started rubbing it up and down on her.<br>\r\nThey slowly got up, making sure to use your bodies for balance, and crushing you even further. Next, they ordered you two to massage their feet.<br>\r\nYou didn't really have a choice, as the other's used both of your heads as footstools, and rubbed their feet on your face and hair.<br>\r\n<br>\r\nSuddenly, the door opens.<br>\r\nYour father just came back from his hospital checkup, and to his horror, he saw his wife in her bra and panties, sitting in another man's lap who's also in a skimpy underwear, while his son and his girlfriend were being used as foot wipes.<br>\r\nHe stormed in, well walked in as fast as he could, since he was still very weak, and started trying to yell.<br>\r\n<br>\r\n\"Hey old man, relax, we're just having fun\", Kyle said, as he grabbed your mother's ass.<br>\r\n\"That's it you little runt. Get out of my house!\"<br>\r\nYour mom got up from his lap, as Kyle stepped on your shoulder and pushed you to the floor, and he got close to your dad, who seemed shocked, as he didn't really realize how big this kid was.<br>\r\nKyle then slapped your dad hard in the face, almost knocking him out, and making him topple over.<br>\r\nWe called your mom over, and told her to stand on his face, and she did, finally having a real man telling her what to do.<br>\r\nThey then started making out, your dad's body begging for air under your mother's feet, until he was out.<br>\r\n<br>\r\nYour mom stepped off, and Kyle dragged your dad's body to the master bedroom, and ordered his friends to \"take care of you both\".<br>\r\n<br>\r\nHe liad your dad on the bed horizontally, and sat on your dad's face after taking off his underwear, stuffing his nose in his crack, while your mom sat in his lap and wrapped her legs around Kyle, and the weight further crushing your dad's face down.<br>\r\nDuring the make-out session, Kyle and your mom let out some farts, going directly into your dad's weak lungs.<br>\r\nHe was deprived of oxygen for too long, and he was now brain dead.<br>\r\n<br>\r\nThey got off, Kyle then laid your dad on the floor, and he stepped on his face, while he started ramming his huge cock into your mom.<br>\r\n(to be continued...)</span></div></div>",
            "created":1583643600,
            "id":2798166,
            "title":"Sleepover!"
        },
        "13":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "Your wife and her ex catch up",
                "You try to stand up for yourself"
            ],
            "content":"<div class=\"\"><div> <span>\" Did you get the food?<br>\r\n- Yes dear.<br>\r\n- And the wine?<br>\r\n- Yes dear.<br>\r\n- Good boy.\", your wife says as she pets your head. <br>\r\nOoh your wife. A stunning 6ft tall beauty. A golden tan skin, long chestnut hair, and green eyes.<br>\r\nAll that on top of a smoking toned body. You always wondered how you ended up with her. <br>\r\nMoney was your first answer, as with your 5ft tall pale scrawny stature, it sure as hell wasn't your looks!<br>\r\nYou had landed a high earning job straight out of Uni, and then she actually proposed to marry you.<br>\r\nYou couldn't believe your ears, so you immediately accepted!<br>\r\nOf course, she wasn't gonna work, and everything was on her terms, but for you, it was worth it.<br>\r\nYou wanted people to finally see that you're worth something, and you though being married to a bombshell would surely help you with that.<br>\r\nBut anyway, back to the present. <br>\r\n<br>\r\n\" How do I look?<br>\r\n- Stunning! As always!<br>\r\n- Thanks! I wanna look good for Chad.\"<br>\r\nYou can't deny that this hurt you a bit, but anything for your wifey.<br>\r\n<br>\r\nChad is her ex. He's a 6'7ft tall brown Adonis: Broad shouldered, muscular, and a handsome face. Unfortunately, he couldn't provide for her, so she had to break up with him, for YOU!<br>\r\n<br>\r\n\"Hey honey, I made a bet with Chad. And knowing that you're my husband, you'll definitely help me win, right?<br>\r\n- Yes dear, of course. What was the bet.<br>\r\n- You'll see, just making sure that you ain't backing out.<br>\r\n- Haha no certainly not.<br>\r\n- Good, now go prepare the food, he'll be here in half an hour.<br>\r\n- Yes dear.\"<br>\r\nYour wife went to watch TV while you slaved away at the cooking and preparation.<br>\r\nHalf an hour went by, and you had everything set up.<br>\r\nYour wife called you, and you ran to her like a puppy.<br>\r\n\" Yes dear.<br>\r\n- Ok it's time for the bet. I told Chad that you're the perfect husband, that will obey me no matter what.<br>\r\n- Well of course!\" feeling proud that she's bragging to other people about you.<br>\r\nThis didn't last long as she suddenly spat in your face, once, twice, three times...<br>\r\nYou were in shock, not knowing how to react.<br>\r\nThe doorbell rang.<br>\r\n\" Ok perfect, don't wipe the spit.\" She ordered you as she opened the door, and the humongous Chad appeared, wearing a very frilly tank top that didn't hide his massive muscles, a pair of shorts, and some massive flipflops.<br>\r\n\" HEEYY JESS\", he said with a booming voice, as you watched your wife leap into his arms.<br>\r\n\" Heyy YOUUU.\"<br>\r\n\" And this must be little Bobby, Oh HAHAHA, he really is your bitch isn't he, is that your spit on his face?! HAHAHAHA.<br>\r\n- Hahahaha, yes, as promised. <br>\r\n- Well he's your husband, of course he'll say yes to that, but I bet you can't make him take my spit.<br>\r\n- Bet! Come here Bobby, let Chad spit in your face, and show him how much you obey me!\"<br>\r\nYou really were in shock. This massive mountain didn't let go of your girl, he just slid his big hand to her waist, and now she wants him to spit in your face, and for you to be ok with it?<br>\r\nWell... You never really knew how to stand up for yourself, so without a word, you just stood in front of him, looking like a kid in front of this man, and you watched helplessly as he gobbled up a huge amount of saliva and spat them in your face, almost covering it.<br>\r\n\" HAHAHA damn!! You win Jess!<br>\r\n- Haha see!<br>\r\n- What else. I really wanna get out of these flipflops, but I don't wanna bend down, you think you can take care of that for me little buddy?<br>\r\n- U--u-u-h s-s-ure.\"You said, not wanting to upset him or your wife, as she was staring intently at you as he said that.<br>\r\nYou knelt down, and he lifted one massive foot, and you slid the big flipflop off it, and placed it down on the ground.<br>\r\n\"Here let me help you with that spit\", he said, as he wiped his now bare foot on your face, covering it easily, and making you smell the hot masculine smell as he slowly dragged the meaty sole on you.<br>\r\nYou couldn't really compute what happened. This man just walked into your house, spat in your face, and now just wiped his foot on you, and you were powerless to stop him, unless you wanted to end up in a hospital or something.<br>\r\nYou evaluated correctly that the only thing you can do is to go with it.<br>\r\nHe did the same with his other foot, using your face as his personal foot wipe, and then walked in your house with your wife by his side, leaving big sweaty footprints on the floor you just spend the whole day cleaning.<br>\r\n</span></div></div>",
            "created":1582866000,
            "id":2794454,
            "title":"Adulthood"
        },
        "131":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "\"Let's watch a scary movie!\"",
                "\"Let's wrestle!\""
            ],
            "content":"<div class=\"\"><div> <span>Chad and Jessica went and sat on the couch, a bit too close to each other. They started recalling the good old times, how Chad used to beat up little nerds, and make them do humiliating tasks, and how that turned Jessica on.<br>\r\nThen Chad started taking selfies with her, snuggled up against him.<br>\r\n\" Hey Bobby, my feet are kinda sore, come rub them for me\" said Jessica.<br>\r\nYou went ahead and knelt in front of the dominant couple, and took her left foot in your hand, and she found it fitting to put her other foot on your head, as to remind you of your place.<br>\r\nChad found this funny, and took it further by resting both his legs on your shoulder, weighing you down.<br>\r\n\" My turn now\", he ordered, and placed one big foot on your face like it was the most natural thing in the world, and put his other foot in your arms, so that you start massaging.<br>\r\n\" Two for one!<br>\r\n- Hahaha yeah!\" Jessica laughed at his lame ass joke.<br>\r\nAfter a while, the cooker alarm rang.<br>\r\n<br>\r\n\"Lunch is ready! You're gonna love this, Bobby is a great cook.\"<br>\r\nThis brought a smile to your face, still covered by Chad's foot, as your wife was happy with you.<br>\r\nChad then pushed your face down to the ground, until the back of your head touched the floor, and then stepped off.<br>\r\nYou shook your head as to dismiss this act, and went and set up 3 plates on the table.<br>\r\nThe happy couple started eating, and as you tried to sit down, Jessica asked you to get her a drink.<br>\r\nSo you obeyed.<br>\r\nWhen you returned, Chad now asked you for a drink himself. Not wanting to upset your guest, you went back to the kitchen and got him one.<br>\r\nThe requests kept piling on, and you felt like a butler to them. You didn't get to eat a thing yet.<br>\r\nOnce they finished eating, your food had gone cold.<br>\r\nThey went back to the couch, and told you to bring your plate of mashed potatoes, steak and veggies to them.<br>\r\n\" I know just the thing to warm it up.\" Chad put the plate on the couch, unashamedly lowered his shorts, which revealed he wasn't wearing any underwear, and his massive cock sprung out.<br>\r\nThen, he plopped down in your plate, and started grinding around, before releasing a trumpeting fart in your food.<br>\r\nJessica was laughing her ass off at this scene. You honestly didn't know how to react.<br>\r\nOnce he was done, your food had indeed warmed up, but it was also smelling like ass and farts.<br>\r\nHe presented his butt cheeks to you, and told you to eat up.<br>\r\n\" WHAT?! HELL NO!<br>\r\n- Now, now, Chad's our guest, and we don't say no to guests.\" Jessica said as she pushed you down, wrapped her strong legs around your arms and squished them to your chest.<br>\r\nNext thing you know, Chad is sitting down on your face, and telling you that he isn't getting up before your finish your food.<br>\r\nYou were running out of breath, so you frantically licked away at the huge ass, while they were laughing at your predicament.<br>\r\nAs she was laughing, Jessica was squeezing you tightly without noticing, so that didn't help with the breath issue.<br>\r\nOnce Chad's ass was licked clean by you, Jessica let you go, and you collapsed to the floor, as Chad rested a foot on the side of your face, still recovering from his laughter.<br>\r\nJessica got up, dropped the remainder of the plate on the floor, and squished everything under her feet, and ordered you to lick.<br>\r\nYou slowly moved your head, with Chad's heavy foot still on it, and started licking your wife's feet, with tears welling up in your eyes.<br>\r\nChad got up and went to use the bathroom, as you finished up licking the crushed food from your wife's feet.<br>\r\nThen you sat up, and started crying to her:<br>\r\n- Why?! Just why?<br>\r\n- Because you're just inferior to me and to Chad. If he decides to step on your head, his foot will just go right through your skull, and land flat on the ground, and you would be left lying there like an insect. So I suggest that you obey us, and thank me for not leaving you.\"<br>\r\nShe then slapped your face hard with her foot, then presented it to you, so you can kiss it, and you did.<br>\r\nShe was right after all, you were thankful that she didn't leave you yet, as you couldn't imagine what would you do, and how would you go about finding another girl.<br>\r\n<br>\r\n\" WOooooooo, Much better\", Chad stated after going stepping out of the bathroom.<br>\r\nHe then slipped out of his shorts and tank top, and just stood naked.<br>\r\n\" I'm more comfortable this way. You should try it Jessica!<br>\r\n- Sure, why not!\" your wife said, as she took everything off, and stood confidently, showing her amazing body, tanned skin and toned curves.<br>\r\n\" Hey Bobby, go wear that onesie I got you as a joke, it would be fun!<br>\r\n- Y-yes dear...\", you obeyed, as you certainly didn't want to get naked with these two incredible specimens.<br>\r\nYou came back wearing a light blue onesie with a hoodie which had long bunny ears, and they laughed again when they saw you.<br>\r\n</span></div></div>",
            "created":1582952400,
            "id":2794902,
            "title":"Your wife and her ex catch up"
        },
        "1311":{
            "author_id":"t3ddy1335",
            "author_name":"T3ddy1335",
            "choices":[
                "Remembering your wedding night",
                "Chad stays the night.",
                "Chad leaves."
            ],
            "content":"<div class=\"\"><div> <span>You sat down on the couch, not really excited for this prospect, as you knew you were easily scared.<br>\r\nThen, the now naked Chad came by and sat very close to you, and your also naked wife came and sat right to your other side, smushing her boobs against you, which felt extremely good on you.<br>\r\n<br>\r\nThe movie started, and at the first jumpscare, you covered your eyes after shrieking like a little girl.<br>\r\nThis made the couple laugh, and Jess just sat in your lap, and pushed her naked back on your face, to \"hide away the scary movie\".<br>\r\nChad then wrapped his arm around her, now making his armpit directly above your face, and it didn't take much to notice how sweaty it was.<br>\r\n<br>\r\nThe movie continued, you crushed under your wife, and your face being pushed into the sweaty armpit of the man who humiliated you in your own house, and then, you heard smooching and slurping sounds.<br>\r\nThey were making out on you!<br>\r\n<br>\r\n\" Umm, Jeshhh...\" you barely muttered out as your face was contorted by the heavy bodies on you.<br>\r\nJess didn't answer, instead, she got up, slapped you in the face, and you watched in horror as Chad took his huge hand and pushed your face down on the couch, and sat on it sideways, his huge cock engulfing your view.<br>\r\n<br>\r\nYou wished it blocked out everything, since the very next second, you saw your wife's beautiful face lower behind the cock, and her starting to lick it's length, and make it hard and even bigger than it already was.<br>\r\n<br>\r\nYou started crying when she took the head in her mouth, and started slowly pushing it into her throat. She continued for a bit, then, lifting the cock, she spat in your face, which made Chad roar in laughter, and he started bouncing on your head.<br>\r\nIt's a good thing you were on a couch, or else, you felt your head was gonna be splattered under his huge muscular ass, and how humiliating would that end be.<br>\r\n<br>\r\nChad then got off, and turned to face you, then, your wife's sexy but also big feet covered your vision, and smushed your face into the couch. She stood on your head with Chad supporting her from behind, before he started ramming his cock into her, making her go up and down, and her feet come crushing down on your head.<br>\r\n<br>\r\nThis fuck session continued, with Chad making you kneel on the floor, your wife resting a foot on your face while he continued to fuck her.<br>\r\nShe then switched to sitting on your face while Chad never stopped his ramming, making your wife's butt punch effectively punch you in the face with each thrust.<br>\r\nHow could he last this long?!<br>\r\n<br>\r\nYour neck was searing with pain.<br>\r\nYour wife getting off brought you relief, as you collapsed on the floor at their feet.<br>\r\nChad then casually placed his big foot on your back, and used you as leverage to fuck your wife, crushing the air out of your lungs. Your wife found this funny, so she stepped on your neck as she was getting fucked, and brought you to the limit of passing out on more than one occasion.<br>\r\n<br>\r\nShe then stepped off, and ordered you to get your photo albums.<br>\r\nYou didn't like where this was going, but then again, you were just used as a rug while your wife was being fucked, so you didn't really have a leg to stand on.<br>\r\n<br>\r\nYou went and fetched them, and your wife ordered you to lay down some of your best pictures on the ground.<br>\r\nYou picked out a couple portraits from when you were a kid and a teen, and a picture of you at your wedding, alone at a table, but with a tux atleast!<br>\r\nYou laid them down, and you watched in agony as Chad just casually stepped on them, covering your baby face with his huge feet, while your wife picked up the tux picture, and wiped her ass with it, before dropping it and stepping on it.<br>\r\nChad then took the wedding from your wife and just squeezed it with 2 fingers and broke it, and threw it on the ground, and spat on it.<br>\r\n<br>\r\nHe then finally came.<br>\r\nAnd he came...<br>\r\nand came...<br>\r\nand came...<br>\r\nHe filled your wife with his cum so much that she started leaking, so she grabbed your onesie's bunny ears, and pulled you closed, and started wiping her pussy on your face, until your whole face was covered, and she was satisfied.<br>\r\n<br>\r\nYou were utterly broken.<br>\r\nYou didn't keep crying.<br>\r\nYou just knelt there, with a blank expression on your face, like you finally understood your place in this life.<br>\r\n<br>\r\nChad and your wife went and crashed on the couch, and your wife started showing him some of your wedding pics that she directed.<br>\r\n<br>\r\nOne where you were kneeling in front of her and looking up as she ignored you.<br>\r\nAnother where she was stepping on your head as you were kissing her other foot.<br>\r\nOne with your head between her calves, and you obviously in pain, because she wanted the pics to be \"authentic\".<br>\r\nAnd a plethora of other humiliating pics.<br>\r\nMeanwhile, you did the most natural thing for you, you knelt besides them, and started licking their feet, and they, being the alpha humans that they were, didn't question this, instead acting as if this is what naturally should happen, and kept looking at pics.</span></div></div>",
            "created":1583211600,
            "id":2796181,
            "title":"\"Let's watch a scary movie!\""
        }
    },
    "info":{
        "author_id":"t3ddy1335",
        "author_name":"T3ddy1335",
        "brief_description":"You are an inferior human in every way, and deserve to be humiliated.",
        "created":1582930140,
        "description":"<td align=\"left\" class=\"norm\">All your life, you have been inferior to your peers, and other people in general.<br>\r\nFrom your childhood, to your senior years, you can't catch a break, as you constantly get humiliated and hurt by superior people, and you can't deny that you deserve it.</td>",
        "id":2214359,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1583658660,
        "pretty_title":"Inferior"
    }
}