{
    "chapters":{
        "1":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "And that thought is....",
                "And that thought is....",
                "And that thought is....",
                "And that thought is....",
                "And that thought is...."
            ],
            "content":"<div class=\"\"><div> <span>Everything was white, you couldn't even say for sure if you were standing on anything or if you were floating. The Dream Colosseum a place of endless battles for you to hone skills and challenge the greatest. The way to describe the feeling was having control but not being in control. Just a thought was all the Colosseum needed to begin. Just a thought.....  </span></div></div>",
            "created":1324098000,
            "id":1241259,
            "title":"The Dream begins"
        }
    },
    "info":{
        "author_id":"firefly32",
        "author_name":"crazyhood",
        "brief_description":"Battles against all fictional people big and or small. GPs for adds.",
        "created":1324128240,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\n1. Story does not end<br>\r\n2. Write a self contained battle in a chapter if you want or your fight can go for several chapters<br>\r\n3. This is you fighting anybody or thing you want. <br>\r\n4. Second person \"you\"<br>\r\n5. \"You\" are defaulted as male please mention it if \"you\" is female. \"You\" can be either gender just don't switch mid story, unless, whatever.<br>\r\n6. I have gift points for people who add to my story and would love people to add. <br>\r\n7. All sexual orientations welcomed!<br>\r\n<br>\r\n<br>\r\nWelcome to the Dream Colosseum, the place were you playing yourself can battle anybody you want.<br>\r\n<br>\r\nYou have entered the Dream Colosseum a place that can take you anywhere that has ever existed and fight anyone who has ever existed. The Colosseum also can alter the size and abilities of you and or the person you are fighting. A common choice is to gain extra strength or become invincible.<br>\r\nBe prepared for anything superheros, video game characters, actors, giants and giantesses whoever you fell like battling against. The Dream does not end, death is nothing you can just move onto the next opponent.<br>\r\nThis is what you will see before each battle:<br>\r\n<br>\r\nOpponent: *******<br>\r\nMovie/Game/Cartoon ect: *******<br>\r\nBattle Field (e.g kitchen, forest, castle): *******<br>\r\nYour extra powers: *******<br>\r\nHigh changes not mentioned but often occur.<br>\r\n<br>\r\nEnter the Dream Colosseum.<br>\r\n</td>",
        "id":1833534,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1324128660,
        "modified":1324128660,
        "pretty_title":"The Dream Colosseum"
    }
}