{
    "chapters":{
        "1":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "The United States",
                "Europe.",
                "South/Central America.",
                "The Middle East.",
                "Asia."
            ],
            "content":"<div class=\"\"><div> <span>Every story needs a place to begin, and in this one...there are no named protagonists. Characters can be created by those wishing to add chapters. So where is this story going to begin? Where will the 'darkness' first rear its ugly head?<br>\r\n</span></div></div>",
            "created":1342933200,
            "id":1385887,
            "title":"And so it begins."
        },
        "11":{
            "author_id":"theburger",
            "author_name":"ClockWerk",
            "choices":[
                "Flashback",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Attention men, we got ourselves a drug seller!\" An agent responded to his colleagues, they were tracking down a young man by the name of Carlos Saligrito who contained a rather illegal chemical inside of his home. They had originally tried to be gentle and kind to the young man, but it forced them to add legal force as he wouldn't leave his private home in California. After knocking down the door, the men searching the enviroment to find any victims that they could use to make the man guilty. They soon found a young woman with bark wood colored hair feeding a young baby. Moving in closer, the men snatched the baby from the young woman. \"Hey, what the hell do you think you're doing!? That's my baby!\" She yelled as she tried to run after the men but the men soon forced her onto the bed. The head officer observed the woman, she was very tender woman with a lovely rack and supple breasts. The men came over as one of them kept the baby.<br>\r\n<br>\r\n\"What the hell do you think you're doing!?\" She yelled as the officer began to stroke her supple breasts, the men came over. \"What the hell do you think you're doing Frank!?\" Frank cracked a smile as he brought up his shot gun and pointed it at the age. \"What the fuck did you do that for!? Bill was Innocent!\" The man said, as he held the baby steady in his arms. \"You're going to get your officer license revoked you know!\" The agent continued as Frank moved from the woman's supple breasts down to her thighs, now the woman was asking for the pleasure. \"You've gone to far!\" The man said as he gently put the baby on the floor and rushed to his traitor agent. Frank simply grabbed his knife and put it right through the man's chest, watching the blood pour out of the large wound, \"You accomplished nothing, Dave\" Frank said as he pushed Dave aside, then he grabbed the baby.<br>\r\n<br>\r\nThe woman now got up with her underwear wet exposing the large clunks of hair that were now waiting for a dick to be shoved in, \"What the hell?\" She said out loud as she begins to charge at Frank, \"Uh uh ah\" He said pointing to the baby with his knife, \"How could you do this? You're a law enforcer, not a criminal!\" \"Baby, once a criminal. Always a criminal\" He said as he sliced the baby's head off, then letting the whole body fall to the floor. The woman came running to Frank, although she stopped when Frank grabbed her. \"You know, you women exist for one reason, and one reason only. To sexually satisfy the dominant species, and I will be the one using your lovely skin!\" It seemed she was helpless, nothing but a sex toy to Frank, but then she felt something, a connection trying to override her body while Frank stood there raping her.<br>\r\n<br>\r\nIn a few mere moments, she slumped on the ground.<br>\r\n</span></div></div>",
            "created":1343278800,
            "id":1390151,
            "title":"The United States"
        },
        "111":{
            "choices":[
                "Sample the new stuff.",
                "Someone borrows Mr. Worthmore's body.",
                "Brenda hears of some very strange crimes."
            ],
            "content":"<div class=\"\"><div> <span>A few months earlier…<br>\r\n<br>\r\nThomas Worthmore, a recent college graduate, pulled into a large warehouse in the center of the city darkened under the thick curtain of night.  He opened the door to his brand new Porsche and calmly and coolly stepped out into a deserted gravel lot.  He then began to make his way in the direction of the warehouse where a couple of semi trucks were unloading their cargo.  See, Thomas worked for a big-time drug company that his father—William Worthmore—had built and run from a fairly young age.  Thomas had gone off to college and gotten a degree in business logistics and finance, which put him in a position to run the drug company’s ordering of ingredients.  Put simply, Thomas was the guy responsible for making sure all the proverbial trains ran on time, as well as for buying the stuff they carried. <br>\r\n<br>\r\nThomas was quite made for such work.  His mother had died when he was only eight years old, and the memory of that traumatic experience—all the countless doctors and specialists who could not save her—had left Thomas cynical and jaded…borderline sociopathic, in fact.  He didn’t like people much, and his wealth (more accurately, his father’s) had tragically not activated any sort of philanthropic instinct.  Rather, it had left him unable to empathize with the pain of others, their sorrows, their hopes and dreams, and so forth.  With that in mind, a job that required him to sit in front of a computer and crunch numbers all day made sense for him.<br>\r\n<br>\r\nPhysically, Thomas was a small man, only about five feet six inches tall and about 130 pounds.  He had slicked back black hair and a pleasant enough face.  His small stature had also reinforced his personality; it helped him learn that one needs sometimes to be ruthless to survive, be cunning, and so forth.  <br>\r\n<br>\r\nThomas walked slate-faced into the bustling warehouse, past forklift operators and guys in blue work-suits going about their businesses.  He spoke to no one on the way in, but he did give the occasional slight smile as he went about his destination.  Everybody was nice to him; after all, Thomas was the boss’s kid.  He made his way to the back of the warehouse, to the cargo that most concerned him.  Turns out, a couple of the semis carried an ingredient a cold drug.  Neither the drug nor the ingredient for it was particularly special, but it was still Thomas’s job to make sure everything showed up.  As Thomas approached, a portly older man in a well-worn outfit saw him coming and smiled.  “Good evening, Mr. Worthmore,” the man said pleasantly.  Thomas smiled a little bit and responded, “How’s it going, Bill?” as he walked by the man and took a clipboard from his hands and walked with him into the semi.  “Oh it’s going well sir,” Bill declared, “if I could just get the wife to leave me alone about loosing some pounds, I’d be even better,” he said as he patted his pot belly.  Thomas gave no response and only looked into a couple of the boxes.  He took out a small package of the ingredient to make sure it was what had been ordered.  Confirming that it was, he simply signed a piece of paper on the clipboard and handed it back to Bill.<br>\r\n<br>\r\n“Good,” Bill said, “everything’s in order then.  Anything else I can do for you sir?”  Thomas paused.  “Yes, Bill,” he began, “if you could excuse me for a minute or so, that’d be great.”  Bill looked confused for a moment, then nodded obediently and pleasantly, “Um, yes sir, sure, sure thing,” he said as he backed out of the semi trailer and left Thomas by himself.  Alone, Thomas walked to the very back corner of the trailer and picked up two full black briefcases.  Both were not huge, but they were filled to the brim with the substance Thomas had actually come for.  Thomas, it turns out, had a bit of a liking for drugs—illegal ones.  One of the guys at the company that supplied ingredients was Thomas’s dealer…just a couple short texts and another few thousand dollars added to an order price, and this man (name unknown) would toss some illegal drugs in with the shipment of legitimate stuff needed for the company.  The trucks cam and went as always, and who would notice a couple small briefcases?  No one.  <br>\r\n<br>\r\nCarrying his precious contraband, Thomas emerged from the truck and smiled at Bill as he made his way out of the warehouse and back to the car.  He placed the briefcases in the trunk and got in to drive home.  Thomas traveled once again along the darkened streets toward his big, luxurious apartment building.  Suddenly, there appeared behind him an unsettling sight.  “Dammit!” Thomas spat out as he saw the lights of a police car flash behind him.  Irritated, he slowly pulled his car to the shoulder and turned the engine off.  <br>\r\n<br>\r\nHe glanced in the side mirror as someone emerged from the police car…a woman, actually.  She walked up to Thomas’s rolled down window, at which point he instinctively held up his license and registration.  The officer shone her flashlight upon Thomas, and the lights from passing cars illuminated her own features a bit.  “Mr. Worthmore,” she said, as she took his license, “you again.”  Thomas looked up to see the officer.  Turns out she’d stopped him before.  This figure was that of Officer Brenda Nelson, and what a wonderful figure it was.  Nelson had long blonde hair and a wonderfully curvy body—complete with nice wide hips and a beautifully round ass.  The spectacular globes that hung from her chest were a source of ever-lasting joy for the men on the police force.  At 45 years old, her body had begun to show signs of wear—a line or two appeared on her face, and her figure was a big heftier than it used to be.  There was a little pouch forming just above her belt, for example.  Still, for the most part, her age just added to her sex appeal, adding to curves in all the right places.  It was almost worth it to speed just to have the woman pull one over.<br>\r\n<br>\r\n“Do you know how fast you were going?” she asked.  “Fifty-five I think,” Thomas lied.  “Seventy-one,” Brenda answered, pulling out her writing pad and handing out a ticket.  She handed it to Thomas and declared, “We’ve got to stop meeting like this.”  Thomas chuckled, “Well we could meet some other way.  You could let me take you to dinner and…well…we could find a new use for those handcuffs of yours.”  Without a smile, Nelson answered, “Just pay the damn ticket and be glad I don’t bust you for sexual harassment.”  Another chuckle from Thomas.  He pointed to Nelson’s bulging chest and began, “Speaking of bust…”  She shook her head in disgust and turned to walk away.  “Good night, Mr. Worthmore.”  “It certainly is,” Thomas declared as he watched the woman’s shapely rear sway and jiggle with her steps.  He started up the car again and returned home.<br>\r\n<br>\r\n1)\tMr. Worthmore goes to his apartment and samples his new product.<br>\r\n2)\tSuddenly, Worthmore’s body begins to spasm (someone has possessed him).<br>\r\n3)\tBrenda Nelson returns to the station and hears about a couple crimes that are…odd.  People with no criminal history whatsoever have begun to kill, to steal, and so forth.  It’s almost as if these people were not themselves when they committed the crimes.  <br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1343365200,
            "id":1390907,
            "title":"Flashback"
        },
        "1111":{
            "choices":[
                "He begins to lose control of Nelson's body.",
                "Continue.",
                "The chief calls him back in."
            ],
            "content":"<div class=\"\"><div> <span>Thomas walks through the lobby of his apartment building, nodding politely, with briefcases in hand, to the guard at the desk.  He quietly took the elevator to the top floor, all of which was his…he basically had an apartment the size of a house.  Stepping into his domicile, Thomas loosened up his tie, walked over to a big chair by the window, and sat down.  He opened a briefcase in front of him, revealing the contents to be a number of good-sized bags of white powder.  He took some out and spread it along his glass table, forming a long straight line as always.  “For what I paid for this shit, the dealer better not have been lying about how good it is,” Thomas declared as he took a snort.<br>\r\n<br>\r\nSuddenly, his senses went haywire!!!  Whatever this stuff was, no other drug came close.  It was as though the happiness and dreams and sensations of the entire city were flowing into Thomas at that very moment.  Colors and smells and feelings he had never known before—tastes, thoughts, everything!  Having had no more than a little bit of the drug, Thomas slumped smiling back into his chair.  “Oh my god,” he said, dazed.  His final thought before he passed out was, “Thank god Officer Nelson didn’t find this stuff…I want it all to myself.”  With that, his hazy vision went black.<br>\r\n<br>\r\nThen, something strange happened.  Thomas awoke again…his eyes fluttered open, as if from a daze.  Things were…off.  Thomas looked about; he was in a room filled with light.  As his vision became clearer, he noticed the rather unusual vision of…well…toilets everywhere.  He was in a restroom.  What the hell?  Thomas shook his head, only to feel something else strange.  Hair…more of it than he was used to…fluttered around his head.  He reached his hand up and, rather confused, pulled the hair out of his field of view.  The hair was blonde, even though his hair was black, or at least it had been this morning.  His hand was different too—dainty and with long finger nails, even a couple rings on.  Something else was unusual—he was sitting on the floor.  <br>\r\n<br>\r\nSomething was definitely off.  Thomas dropped the thing that could not possibly have been his hand.  He looked down at himself, only to behold the absolutely greatest shock of his existence.  He wore what appeared to be a policeman’s uniform.  Well…policeman maybe wasn’t the best way to describe it, because his chest gave no indication whatsoever of manhood.  Instead, hanging from his chest were two of the largest, most beautiful breasts he had ever seen.  The fabric of the uniform was stretched tightly over them, but it could barely contain them.  The beautiful and full globes peaked out from the top of the uniform.  “Oh my go…” Thomas began, only to put his hand to his mouth to silence a voice that was most certainly not his own.  Thomas was worried now, and his heavy breathing brought a wonderful heaving to his chest.  He very slowly got to his knees and stood up, feeling his chest jiggle a bit and throw off his sense of balance.  He walked very slowly to a nearby mirror and beheld his new reflection—Brenda Nelson stared back at him!  <br>\r\n<br>\r\n“Holy shit…” Thomas whispered to himself, apparently inside Officer Nelson’s body, as he steadied his new form against the sink.  He blinked a couple times and…sure enough…her face still stared back at him with same dumfounded look he must be wearing.  He brought manicured hands up to her face and poked and prodded at it, contorting it into strange expressions. His hands then moved farther down to the jello-like globes on his chest, as he cupped and massaged them.  “Oh my god,” he mused, amazed by the sensation.  He then felt farther down to his (slightly pudgy) belly and Nelson’s wonderfully full, bubbly ass and her wide hips.  <br>\r\n<br>\r\nThomas stepped back and tried to think.  “Ok…ok so just before I passed out…just before I passed out I thought about her and…and…poof!  Here I am!” he said as he motioned to his current meat suit.  A great big smile spread across his face as he looked himself over in the mirror.  Suddenly, the door behind him opened, and in strolled another officer.  Thomas tensed up…he knew he thought he was inside Nelson’s body…but was this all real?  Would other people buy it?  Thomas stood straight-faced and looked forward like an army recruit, his mind racing about what would happen if he fucked this up.<br>\r\n<br>\r\n“Oh, Brenda, there you are,” the woman behind him said, “I wondered where you went…chief’s lookin’ for you over the PA….did you hear it?” she asked.  This was a heavyset sixty-something woman who probably worked a desk job.  Thomas shook Brenda’s head, “PA…ah….me…hear….um…..no…no I don’t think I heard it…um….sorry…what?” he said, nervous as hell.  The woman cocked her head, wondering why Brenda was acting so strangely.  She smiled oddly, “Brenda, I said the chief’s lookin’ for you babe; better go see him.”<br>\r\n<br>\r\nThomas was relieved; they really thought he was Brenda Nelson!  “Oh..um…sure…yeah I’ll go do that now,” he said as he turned around awkwardly, the added weight in his chest and hips throwing off his center of gravity.  Thomas slowly and gingerly maneuvered Brenda’s body out the door of the restroom and looked about at the station as it hummed with activity.  He slowly made his way to a set of offices in the back of the building, presumably where the administrators were.  Upon reaching the one that said “Chief” on the door, Thomas knocked.  <br>\r\n<br>\r\n“Come in!” came the call from the other side of the door.  Thomas opened it slowly and beheld the Chief.  The chief was a heavy-set slob by the name of Nick Trask.  He was a really smart and effective officer despite the limiting effects of his sloppy physical condition, and it was his effectiveness that helped him rise through the ranks so damn fast.  He was bout 30 or so, but his instincts made him an old pro.  <br>\r\n<br>\r\nThomas stepped slowly into the room, smiling meekly at Trask.  “Yo…you called chief?” he asked.  “I did…take a seat, Brenda,” Trask instructed.  On legs like jelly and in a body not his own, Thomas walked slowly to a chair in front of Trask’s big desk and sat down.  The extra padding in his hind quarters made the feeling of sitting a bit odd.<br>\r\n<br>\r\n“I’ve been calling you awhile Brenda,” Trask said good-naturedly, “where you been?”  “W…well see I was on patrol earlier then I got back and…and I didn’t feel good so I had to use the…ahh…you know…the little girls’ room to compose myself…and….I lost track of time.  I….I don’t know what got into me,” Thomas concluded, finding that last bit a particularly apt turn of phrase.  <br>\r\n<br>\r\n“No matter,” Trask said, “the reason I called you in is that I’ve got some new information for you.  That anti-drug task force you agreed to head up last week?  I’ve got a lead for you to follow.  We got a tip that the drugs might be coming in through a legit company…one that acts as a supplier to drug-makers.  They just put shipments of the drug in with the legit stuff…then somebody separates out the contraband for use on the street.”<br>\r\n<br>\r\nThomas was flabbergasted.  That had to be the same organization that supplied him!  Holy hell!  He tried to maintain his composure.  “Oh…” he said, “you..you think it’s coming from a legit company?”  “Yup,” Trask responded, “and as the head of the task force I though you should know.  I’ll keep looking into it and we can hopefully we can find out which company is the supplier. I’ll get back to you when I have more info…dismissed.”<br>\r\n<br>\r\nThomas quickly stood, eliciting a delightful jiggle from his chest.  “Thank you, sir,” he said, and turned around and left the office.  With the door closed, he exhaled a sigh of relief.  He had pulled off the illusion and successfully impersonated Nelson.  As he walked back to where all the officers had their desks and found the one to which his current body was assigned, a million thoughts raced through his head.  This drug was amazing!  He could literally jump into the bodies of others!  But what would happen if the cops took down his supplier?  How would he get more?  Would they identify him as a buyer?  Would they bring his company down?<br>\r\n<br>\r\n</span></div></div>",
            "created":1343365200,
            "id":1391031,
            "title":"Sample the new stuff."
        },
        "11111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Early next morning.",
                "A vivid dream."
            ],
            "content":"<div class=\"\"><div> <span>As he stood there gazing down at his host's wonderous cleavage, Thomas suddenly began feeling a little dizzy. He leaned forward and supported himself on Officer Nelson's desk with her hands...and then he sat down when the dizziness increased. The whole room began to spin and he started getting a little scared. Then...after taking a deep breath of air into Brenda's lungs...Thomas suddenly found himself 'shifting'. It was like being pulled backwards through a badly-lit tunnel at high speed, and all Thomas could think to himself was...<i>\"Oh fuck!\"</i> Then just like that...he was back in his own body...and he jolted awake. His right leg jerked upwards and his foot kicked straight through his glass table...sending shards everywhere. <br>\r\n<br>\r\n\"Holy mother of....\" Thomas groaned as he put his hands to his head. His head was pounding, a direct result of the drug. After a few minutes he opened his eyes, still massaging his temples with his fingers and thinking back to what had just transpired. He looked down at his chest, as though expecting to see Officer Nelson's huge breasts still sitting there, but they were not. And a reach between his legs confirmed he was very much 'male' again. He couldn't quite believe that he had just been possessing someone else's body, Officer Nelson's no less. He wondered whether he had to be thinking of a person before he could 'transfer' into their body, or whether he could just enter a person at random after taking the drug. Thomas wasn't too concerned, he would answer these questions in time...hopefully.<br>\r\n<br>\r\nFeeling groggy, Thomas looked at the broken table in front of him and the bags of 'Dust' scattered around. \"Fucking amazing!\" he mumbled, shaking his throbbing head. He then unsteadily got to his feet and set about cleaning up the mess.<br>\r\n<br>\r\nWhen that was done he sat back down and looked at the bags of drugs laid out in front of him on a small coffee table he had dragged over. He wondered why he had lost control of Brenda's body after so short a time, eventually pinning it down to the relatively small amount of Dust he had snorted. He was tempted to take some more, but the migraine he now had was telling him that maybe that wasn't such a good idea. Thomas hid the Dust and then stood up again, he got a couple of painkillers and a glass of water and made his way to bed. He would deal with his problems tomorrow when he was feeling more clear-headed.<br>\r\n<br>\r\nIt didn't take him long to fall asleep.<br>\r\n</span></div></div>",
            "created":1343365200,
            "id":1391136,
            "title":"He begins to lose control of Nelson's body."
        },
        "111111":{
            "choices":[
                "Follow Thomas's schedule",
                "Meanwhile, somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Thomas writhed and cursed, the beginning of a long and painful withdrawal, the symptoms had showed their ugly head, waking Thomas up very early in the morning. He staggered to his medicine cabinet and took another painkiller, the pain subsided for a bit, but his mood was getting more and more depressed as the time went by. Thomas walked back, he knew this would happen and as he had done many times before, he would eventually defeat the withdrawal. Taking a seat by the coffee table, he switched on the television, trying to keep the pain and his mood swings away.<br>\r\n<br>\r\nAn hour quickly went, and Thomas felt marginally better off. ''It's good.'', he winced as another shot of pain rocked through his body. The painkiller was losing its effectiveness. Thomas knew the procedure, he had tried to come clean before and there were some occasions that the stuff sold to him was a dud. Tears formed in the corner of his eyes as he doubled in pain. ''Fuck, just kill me now...'', Thomas shouted in pain, this too, was another stage.<br>\r\n<br>\r\nThomas knew that he could be spotted entering a rehab camp or to let his darker side to be discovered by the press. He took a deep breath, sweat drops rolled down his face. ''Fuck.'', he muttered. But the pain was barely there. He had won, again. Although for how long he could not say. At 8 o'clock precisely, Thomas took a long bath, before he started his work for the day. He can only count on himself and he never let himself down.<br>\r\n<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\n''Miss Rice, schedule?'', Thomas asked his personal assistant as she turned up with the company's chaffeur, ready to whisk him away.<br>\r\n<br>\r\nCamille Rice looked at her boss with her beautiful hazel eyes for a moment, studying two black briefcases he had brought from the rear-view mirror. It was very rare for her boss to bring anything to the head office, save for his tablet PC, his mobile phone and 3 16 gigabytes flashdisks. ''Sent.'', she said. An American with Eastern European descent, she had a very pleasing face, her long hair always tied in a bun whenever she went for work. At the tender age of 25, she was William Worthmore's third personal assistant, before getting re-assigned as Thomas's personal assistant, partly for her to gain more experience and partly to keep check of Thomas. A fact that everyone knew, although never said.<br>\r\n<br>\r\nThomas smiled a little as he read through his proposed schedule. A meeting with the a top scientist would be what he needed right now. He glanced at his two briefcases packed full with small packages of 'Dust', he glanced as well at the rear view mirror to feast on Camille's features, although she was not gifted with abundant assets like officer Brenda Nelson, she was young and curvy, not to mention very pleasing to look at. Thomas kept emulating in his mind what he would do once he slipped inside that tight body, but he needed to know more about 'Dust'.<br>\r\n<br>\r\nMeanwhile, Camille knew that she was being ogled but did not flinch. She always found Thomas as a quirky and rather weird fellow, not to the extent of sexual harassment, but definitely somewhat of a creep and lacking social skills. Luckily for her, it was not long before they arrived at Worthmore's Pharmaceutical Corp's head office building, located near the outer ring of the busy town.<br>\r\n</span></div></div>",
            "created":1343538000,
            "id":1392879,
            "title":"Early next morning."
        },
        "1111111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "...tell Gabriella everything.",
                "...keep some secrets."
            ],
            "content":"<div class=\"\"><div> <span>It was Camille who was first out of the vehicle when the chaffeur pulled up outside the office building. She was about to just head on into the building, when Thomas called her back. \"Excuse me Ms Rice, can you carry my PC tablet and flashdisks to my office?\" he said, phrasing his order as a question in order to be polite. He then handed the items to his personal assistant and then watched as she walked into the buidling, attired in her usual black skirt suit and white blouse and black heels. He did love watching her ass wiggling away.<br>\r\n<br>\r\nThomas briefly arched both eyebrows in approval and then he retrieved the two briefcases that contained his precious 'merchandise'. \"Thanks!\" he said to the driver before heading into the building, knowing Ms Rice probably wouldn't hold the elevator for him. Which she hadn't.<br>\r\n<br>\r\n\"Ahh, playing hard to get as always\" Thomas chuckled to himself as he headed up the stairs with his briefcases.<br>\r\n<br>\r\nOnce outside his office, he briefly smirked at Camille sat behind her desk. \"Your tablet and flashdisks are in your office Mr Worthmore\" she said, feigning a smile, \"And there's also a cup of coffee ready for you sir\" she added.<br>\r\n<br>\r\n\"Thank you!\" Thomas replied, before heading into his office and closing the door behind him. He closed the shutters to prevent his assistant from seeing in and then placed both briefcases carefully on his desk. He was going to open one but then he pressed the button on the intercom. \"Ms Rice, will you please have Miss Shemer come up to my office\" he said, referring to the company's top scientist, Gabriella Shemer, a 29-year old dark-haired Israeli-born woman.<br>\r\n<br>\r\n\"Yes Mr Worthmore!\" came Camille's droll reply. Camille didn't like Gabriella, but the main reason was simple jealousy, since Gabriella also had good looks, and just to rub it in...she was extremely intelligent.<br>\r\n<br>\r\nThomas just sat down behind his desk and waited for Gabriella to arrive from the lab. He knew he would have to share with the secret of the drug...maybe. Or he could lie to her and just ask her to analyze the drug's properties.<br>\r\n<br>\r\nHe decided to...<br>\r\n</span></div></div>",
            "created":1343710800,
            "id":1394377,
            "title":"Follow Thomas's schedule"
        },
        "11111111":{
            "choices":[
                "Gabriella uses it.",
                "Thomas uses it."
            ],
            "content":"<div class=\"\"><div> <span>''Hello Ms. Shemer.'', Thomas stood up as the top scientist made her way in, closing the door behind her. ''Please take a seat.''<br>\r\n<br>\r\n''Now, I believe I have something for that brilliant mind of yours to feast on.'', Thomas smiled as Gabriella took her seat in front of him. Thomas opened a briefcase and spun it around to let Gabriella in to the secret. Gabriella's eyes widened as she looked at little packets of white powder, she glanced at the other unopened suitcase as if guessing that it held similar consignment, before she stared at Thomas in disbelief.<br>\r\n<br>\r\n''Now I know what you are thinking, and the answer is no.'', Thomas said calmly as he took out two small packets and closed the suitcases, he fiddled with the safety pins and put both briefcases on the floor. ''It's not crack, I'm clean this week, at least because of this stuff.''<br>\r\n<br>\r\nThe puzzled look on Gabriella's face was enough to make Thomas carry on. Thomas took a deep breath and sighed, as he prepared himself to be laughed at or at least ridiculed, by the top scientist. ''This stuff made me able to possess a chick cop.'', Thomas said with a flat voice, trying to make it as believeable as possible. A little smile from Gabriella, showed that she did not believe him. Thomas found the sly smile very sexy. As a man who admired intelligence and cunning highly, Thomas was very attracted to Gabriella, to be exact, to her brilliant mind. Graduated from Worthmore University, which was founded by his father, William Worthmore, Gabriella showed lots of promise, having attained her Ph.D at the age of 26. Thomas spotted her talents when he did a year of work placement inside his father's own company. Thomas realized how much an asset she could be and after a bit of banter which they both enjoyed immensely, which was very unusual for Thomas, Gabriella promised to work for Worthmore Pharmaceutical in exchange for support and an almost free reign.<br>\r\n<br>\r\nThomas smiled back, he knew that Gabriella would not believe him and he did expect the reaction. ''I brought this.'', Gabriella smiled as she produced a small tube filled with capsules. ''New batch, better than the one I made two years ago.'', she put the tube near the packets. Thomas did not fail her, upon Gabriella's arrival to the company, she was given an almost free reign and support, something which she was very grateful of and which also caused great jealousy by other scientists, those who worked there and those lecturing in the University. Within a year, Gabriella pursued her Ph.D research and came up with a medicine to help drug addicts overcome their addiction. Other scientists then began to acknowledge her. Thomas beamed with pride and satisfaction, as the drug's discovery meant that he would be able to continue his addiction.<br>\r\n<br>\r\n''Looks like you need a demonstration huh?'', Thomas grinned. He gazed at Gabriella, her wavy dark hair looked extremely well suited to her face and the glasses she wore just enhanced her intelligent look. She was definitely not as sexy as Camille, her curves was not as prominent but her face was okay, it was the intelligence that Thomas found very alluring, a feeling that Gabriella shared as well on her boss's son.<br>\r\n<br>\r\nThomas opened a packet and put it between them, much to Gabriella's horror. She tried to swipe it away, but Thomas held her hand and assured her. ''Do you want me to show you? or would you like to try it out yourself?'', Thomas smiled.</span></div></div>",
            "created":1343710800,
            "id":1394648,
            "title":"...tell Gabriella everything."
        },
        "111111111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "...Thomas' body.",
                "...Camille's body."
            ],
            "content":"<div class=\"\"><div> <span>\"I don't take crack Thomas, you know that!\" Gabriella informed her boss, as she crossed her shapely legs in a provocative manner. She knew it was always a good move to show a flash fo thigh to your boss. \"And...thank you for this...<i>antidote</i>!\" Thomas lazily thanked Gabriella as he held the tube she had passed him. Though he really did not seem interested in being cured of drug addiction at the moment.<br>\r\n<br>\r\n\"Its not cocaine I promise, its something...new\" Thomas smirked.<br>\r\n<br>\r\n\"All drugs have the same basic effect, to get you high\" Gabriella argued. \"And since I'm naturally happy...and content...I don't really need it now do I?\" she said, even as she watched her boss empty a little of the Dust out onto the desk and form it into a line.<br>\r\n<br>\r\n\"This drug does give you a bad headache afterwards, but it has a very 'special' effect on those who use it\" Thomas said, as he kept trying to persuade his top scientist to sample the drug for herself. He had heard rumors about the drug being fatal for some people, but that it was dependent on how much they took. He was sure only to lay a small amount out on the desk in front of a watching Gabriella.<br>\r\n<br>\r\nThen...in an instant, the pretty, Israeli-born woman threw caution to the wind and took the 'straw' from Thomas and used it to snort up the drug. She then sat there for a second, waiting for it to take effect. Her vision started to blur and the room began to spin, then suddenly there was momentary blackness. The next thing Gabriella knew...she seemed to be 'floating', and she was shocked when she looked down and saw her own body slumped unconscious in the chair. <i>\"Oh my god!\"</i> she thought, as panic set in. But she managed to keep calm enough to focus on what to do next. She saw a grinning Thomas sat looking up around himself as though expecting to see her, and she moved down closer to him.<br>\r\n<br>\r\n\"I told you it had 'special' properties didn't I?\" Thomas chuckled. \"You can possess other people's bodies in your current state, why not try it out?\" he then suggested. And it was hard for Gabriella to be skeptical considering what was happening to her right now.<br>\r\n<br>\r\nAfter another minute of thought, Gabriella decided to try possessing...<br>\r\n</span></div></div>",
            "created":1343797200,
            "id":1395177,
            "title":"Gabriella uses it."
        },
        "1111111112":{
            "choices":[
                "Further Explored Camille's body",
                "Lost control of Camille"
            ],
            "content":"<div class=\"\"><div> <span>Gabriella found herself floating in the air and strangely enough through the walls of the room.  It was an interesting feeling and soon became more interesting as she found herself hovering over Camille in the next room.  She looked down at her and found it odd that she had some ability to float, all of this soon came to a blacked out stage because she found her self being pulled to Camille.<br>\r\n<br>\r\nGabriella opened her eyes.  Things were different.  Instead of standing like she remembered she was sitting at a desk.  the first thing she noticed was instead of the usual flats she wore in the lab her feet were elevated in tall high heels, the second thing she noticed was her hair, which was pulled back tightly.  She blinked and looked down the hands in front of her, they were not hers.  She saw her reflection on the mirrored part of the back of Camille's name tag.  She was in Camille the receptionist's body.  <br>\r\n<br>\r\nThere was a sense of panic, she was unable to say anything. Her shock was interrupted by the face of Thomas waving in front of her. <br>\r\n<br>\r\n\"Gabriella! Is that you in there!?\"  A curious Thomas said.<br>\r\n<br>\r\nIt took Gabriella a second to speak.  In a voice that was not hers she managed to mumble...\"I think so..how did you know it was me...?\"<br>\r\n<br>\r\nThomas smiled and responded \"You had a look on your face, well Camille's face\"<br>\r\n<br>\r\nGabriella looked down and saw Camille's body, she could not believe that the drug Thomas had said had worked.  She cautiously stood up, awkwardly adjusting to the change of gravity of Camille's body.  Being cautious she slipped off Camille's navy high heeled stiletto shoes.  She curled her stocking-clad feet on the cool tiles of the office space.  She slid her hands down the thighs of her new body.  <br>\r\n<br>\r\nThomas, allowing Gabriella to have her space remarked, \"Told you it was amazing\" <br>\r\n<br>\r\nGabriella turned and smiled.  \"It is something else!\"  And in the excitement of the drug she...<br>\r\n</span></div></div>",
            "created":1385269200,
            "id":1698688,
            "title":"...Camille's body."
        },
        "11111111122":{
            "choices":[
                "Gabriella accepts.",
                "Gabriella rejects."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella looked over herself in the executive office bathroom.  She made a face with her new face and smiled seeing Camille's face looking back at her.  <br>\r\n<br>\r\nThomas sat in a couch outside enjoying the fact that Gabriella threw caution to the wind and tried it.  It was part of a nasty plan.  Gabriella was a brilliant scientist and Thomas hoped she would have the technical know how to create more of the drug or even improve it.  He wondered however on the side if he could get Gabriella to lower her inhibitions sexually because of the new body she possessed.  He would love to have his way with her, the thought however of having his way with her in Camille's body truly excited him.  However like his possession of the police officer he knew Gabriella had limited time.  <br>\r\n<br>\r\nGabriella smiled and posed for a second in Camille's body.  She felt a bit hazy unsure of what had just happened.  She still had focus and looked down at Camille's pert breasts.  She wanted to see them.  She decided she wanted to see all of Camille and proceeded to unbutton her blouse.  She saw the pink of Camille's bra when something fuzzy again happened.  Things went black.<br>\r\n<br>\r\nShe woke up in her own body slumped over in a lab chair.  Gone were the feeling of a skirt and Gabriella looked down at the table of the lab.  The dust was cleaned up from before and she shook her head.  She had quite the headache.  Thomas walked in, smiling. <br>\r\n<br>\r\nGabriella scared of her drug use asked  \"Camille?\"<br>\r\n<br>\r\nThomas replied coolly, \" She knows nothing, she just awkwardly walked out of the executive washroom looking for her shoes, shes none the wiser\"<br>\r\n<br>\r\nGabriella smiled and wiped the drool off her face and put on her glasses.  \"Wow that was something else\"  Thomas nodded and set the rest of the dust packet in front of her.  <br>\r\n<br>\r\nGabriella was quiet,  The scientist that she was was had already gone to work.  What ever that stuff was she needed to know more about it.  She had questions lots of them.  Thomas told her everything, about his suppliers about his experience with the cop.  Thomas had for years worked with a distributor that had sold methamphetamine and cocaine.  However a supplier stole this from a government lab and nobody knew what it was, the supplier wanted to know if could be reproduced.<br>\r\n<br>\r\nGabriella knew what Thomas wanted, he wanted her to analyze the drug and reverse engineer it. She knew that Thomas was not going to take no for an answer, but at the same time she always had a choice.  The scientist with the curiosity for knowledge wanted to know more.  But she had spent most of her life finding antidotes for drugs.  <br>\r\n<br>\r\nThomas knew what was going through Gabriella's mind.  He knew that the choice would not be easy for her with the drug.  Thomas put on the desk a duffell bag that was partially opened.  There was $150,000 dollars in cash in there.  He knew that would be a start.<br>\r\n</span></div></div>",
            "created":1385269200,
            "id":1698711,
            "title":"Lost control of Camille"
        },
        "111111111221":{
            "choices":[
                "A little hit of dust",
                "She decided against it."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella had been hard at work.  Her feet hurt.  She had been working for 15 hours.  She waved hello to Camille as she stepped out of the lab clean rooms and into the main lobby she was going to drive out to the local burger shack.  She ate horrible when she got obsessed.  She thought about Camille's breasts, and how strange it had been to feel them.<br>\r\n<br>\r\nThe sample drug of \"Dust\" was amazing.  The arrangement with Thomas was simple, reverse engineer the drug and make it last longer.  She would be paid handsomely and one caveat, Thomas wouldn't possess her with the drug.<br>\r\n<br>\r\nShe drove her car a compact import out to the burger shack and ordered.  She sat in the parking lot thinking.  The drug was similar to a lot of chemical compounds like methamphetamine and cocaine yet different.  It had something different that she couldn't figure out.  She stared out night sky confused, she hated that. She had a small packet of dust in her lab coat.  Out of the two vials that Thomas had she had been given one.  The other Thomas kept.  <br>\r\n<br>\r\nShe fondled the packet of dust in her hand.  It seemed like it didn't have the longest hold on humans and it faded away after a certain amount of time. If there was a way to extend it, it could be very useful.  She saw a couple exciting the burger shack.  It was obvious they were dating and were into each other.  The woman wore tight black leather pants and a loose hanging halter top.  She had an a exotic look to her that was maybe middle eastern, the guy was thin and well dressed and wore a sharp pair of business pants, a sweater with a shirt and tie underneath.  She thought about using the drug.  She licked her lips.</span></div></div>",
            "created":1385269200,
            "id":1698734,
            "title":"Gabriella accepts."
        },
        "1111111112211":{
            "choices":[
                "The tightness of her pants",
                "Her hair was short, and the wind on the back of her neck."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella hesitated for a second but wanted the experience, She took a small finger nail of dust and found the same floating phase that she had felt in the past.  She found herself traveling and then something happened,  She found herself moving to the couple.  She wanted to find herself in the girls body but was open to any experience, she drifted and then the gray wash of taking over happened. She took a deep breath and licked her lips.  She smelled in the air perfume.  She was a little bit dizzy but felt the familiar sensations of the world coming back.  She could start to see but it was hazy.  The first thing she felt was.</span></div></div>",
            "created":1388898000,
            "id":1722419,
            "title":"A little hit of dust"
        },
        "11111111122112":{
            "choices":[
                "Gabriella looses control",
                "The woman suggests continuing their evening."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella felt her feet in a pair of dress shoes and the tightness of a tie around her neck.  It was unfamiliar as was the bulging weight in her pants.  She had taken over the guys body.  She felt the arm of the girl locked in hers.  <br>\r\n<br>\r\n\"Are you ok? Blake?\"  A voice said...<br>\r\n<br>\r\nShe looked around and saw the girl that she had only though about earlier still talking, it was obvious she landed in the wrong body.  Not the end of the world but not her plans.  She focused for a second, and realized Blake must be the name of the guy she was in.  She shook her head and smiled at the woman, she smiled and said.<br>\r\n<br>\r\n\"Yeah I just got dizzy for a second, Sorry\"  She was surprised about the deepness of her own voice.  <br>\r\n<br>\r\nThe woman looked back and smiled.  \"You don't have to apologize to me Blake, I just got worried.\"  Gabriella realized she had no idea what the girls name was, although she was very pretty, She had a olive skin and dark curly hair that went to her shoulders.  Her breasts were pert and young and she was dressed very sexy.  Gabriella found herself jealous of her taut body.  As she stared down at at the gap between her thighs she felt her new body's member stiffen.  It was an odd feeling that was magnified by the woman kissing Gabriella.<br>\r\n<br>\r\nJust then </span></div></div>",
            "created":1388898000,
            "id":1722430,
            "title":"Her hair was short, and the wind on the back of..."
        },
        "111111111221122":{
            "choices":[
                "\"I could use some help with it\"",
                "\"where were we planning on doing tonight?\""
            ],
            "content":"<div class=\"\"><div> <span>The pecks of kisses Gabrellia felt on her shaven face were different yet enjoyable.  She made an excuse and asked to sit down to witch the mystery woman obliged. <br>\r\n<br>\r\nGabriella wanted to keep thing going with the woman who was obviously interested in her possessed body,  Gabriella felt the warmth of her new found member pressing into her pant leg.  It was a strange new sensation.  The olive skin woman looked down and saw small tent in Grabriellas leg and smiled, <br>\r\n<br>\r\n\"Is that why your so light headed Blake?  I have heard of that... \"<br>\r\n<br>\r\nGrabriella still unsure of her own voice \"Um no,  but....\" And responded</span></div></div>",
            "created":1389502800,
            "id":1726077,
            "title":"The woman suggests continuing their evening."
        },
        "1111111112211221":{
            "choices":[
                "Passed out and found herself back at the burger shack.",
                "Fell back into the bed in pure enjoyment."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella found herself at an apartment downtown on the receiving end of a blowjob.  She was enjoying her new male body.  The woman who she now found out was named Olivia was Blake's new girlfriend.  She had Blake's strong hands in Olivia's hair as she continued to work over her new member.  Gabriella figured out though some careful questions that Blake was a really successful project manager for a tech company and was defiantly good looking.  <br>\r\n<br>\r\nShe had positioned Olivia so that she could see Blake's face enjoying the blowjob through the bathroom mirror.  It was quite a trip seeing the new face looking back at her.  Lydia was on her knees continuing to work Gabriellas stolen body over.   She moved her hands down and pushed into the back of Olivia's leather pants and rubbed the softness of her ass.  This was incredible to her.  She found herself jealous of Olivas tight younger body.  She thought about stealing her life for a while at at later time.  <br>\r\n<br>\r\nGabriella had little to know control over her new body's member and found herself coming to an orgasm.  The thrill was incredible and as she was about to cum she. <br>\r\n<br>\r\n</span></div></div>",
            "created":1389502800,
            "id":1726380,
            "title":"\"I could use some help with it\""
        },
        "11111111122112211":{
            "choices":[
                "And decided another hit of dust might be the help she needs",
                "a breakthrough."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella found herself with a horrible headache.  Things were familiar and unfamiliar at the same time.  As she came too she realized she was in her car.  It was cold and the engine was off. What had happened.  She wiped her nose and found blood on it, her eyes were dilated.  <br>\r\n<br>\r\n\"Holy shit\" was muttered as she remembered the feel of Blakes underwear, Olivia and her high heels. The blowjob, her face in the mirror, Blake's cologne.  <br>\r\n<br>\r\nShe couldn't tell how long it had been, She looked at her car clock.  It was 1:30 AM.  She had been out for at least 3 hours.  She went home driving slow.  She took a shower when she got home and had a hard time not comparing her body to Oliva's.  She wanted more.  While she showered she threw up.  One thing was for sure as the vomit washed down the drain.  Dust had to last longer and be safer.<br>\r\n<br>\r\nThe next few days Gabriella worked in the lab nonstop.  Working on dust.  Often times she thought to try again but she realized it could kill her.  She had synthesized variants of the drug and each one showed in her tests to be just as lethal.  There was one night however when she was looking over her research and ready to give up.</span></div></div>",
            "created":1389502800,
            "id":1726387,
            "title":"Passed out and found herself back at the burger..."
        },
        "111111111221122112":{
            "choices":[
                "Stupid enough to work",
                "There had to be another way."
            ],
            "content":"<div class=\"\"><div> <span>Gabriella looked up at the moon on her way home.  She was at a stoplight looking at the sky from her open sunroof, it was actually nice tonight.  Something clicked.  She realized dust was originally made using most likely using chemical techniques from the 1960's but couldn't figure out what the missing puzzle piece was.<br>\r\n<br>\r\n\"No fucking way\" She said to herself.  That's where this stuff originally came from.  Gabriella drove back to the lab that night.  After hours of research and tests she had come the conclusion.  The key ingredient to making dust safer was something that was vary hard to get.<br>\r\n<br>\r\n\"Lunar soil! Are you fucking serious!\"  Thomas said the next morning.  \"That't not even feasible!\"  <br>\r\n<br>\r\nGabriella knew she was right and showed Thomas several charts graphs and figures.  Whoever had originally made dust had access to Lunar soil, the problem was they made it in a hurry and didn't use enough of it to make it safe and used a synthetic substitute of it.  <br>\r\n<br>\r\n\"If we get the real thing, I can make a longer lasting better product\"  Gabriella said confidently.  <br>\r\n<br>\r\n\"Where the fuck do you think we are going to get any of it!  Its not like you can walk to the store and buy it!\"  Thomas snapped irritated. He felt Gabriella had failed him, this was a ridiculous claim.  Surely there was a better way to do this other than Gabriella's claims.<br>\r\n<br>\r\nGabriella was quiet for a second.  She had thought this through, although she was not a criminal she was starting to think like one.  lunar dust was rare but not impossible to get.  one just had to think outside the box, besides it wasn't like she needed tons of it, according to her calculations she only needed a very small amount but enough to change the balance of the chemical makeup of the drug.  <br>\r\n<br>\r\nGabriella confidently said \"Here.\" And put down a printed page from Wikipedia of lunar rocks.  She explained to Thomas after the Apollo 11 and 17 moon missions the US Government had sent goodwill plaques to all 50 of the United States and several countries.  They just had to find one that they could steal.<br>\r\n<br>\r\nThomas looked at the pages, Gabriella had thought this through.  Moon rocks?  This was stupid..really stupid.  </span></div></div>",
            "created":1389502800,
            "id":1726401,
            "title":"a breakthrough."
        },
        "1111111112211221121":{
            "choices":[
                "hire a thief to steal the plaque.",
                "steal the plaque themselves."
            ],
            "content":"<div class=\"\"><div> <span>It might be stupid, but it could possible work. Thomas knew Gabriella, she wouldn't just speculate about this sort of things. The graphs and charts confirmed her story. But then there was one tiny problem.<br>\r\n<br>\r\n\"How do we acquire one of those goodwill plaques? I don't think you can find one easy.\"<br>\r\n<br>\r\nGabriella shook her head. \"Nope, those plaques aren't on the black market, or at least what I know of them. But we are in luck, or what you could call luck. There's a plaque right here in the city.\" Gabriella pointed out. <br>\r\n<br>\r\n\"No, you don't mean.\" Thomas said.<br>\r\n<br>\r\n\"Yes, the museum of history has the privilege of borrowing one of the plaques.\"<br>\r\n<br>\r\n\"And I guess they mind lending it to other people.\" When Gabriella nod her head Thomas thought about it. They needed one of those plaques, otherwise the current state of the dust was too unpredictable for them to use. <br>\r\n<br>\r\n\"I guess we have to steal one of those then.\" Thomas grinned. <br>\r\n<br>\r\n\"I thought about it too, I guess there's no other way.\" Gabriella said stern.<br>\r\n<br>\r\n\"The way I see it there are two ways we can solve the problem. The first is hiring a thief to steal the plaque for us. Problem is that we need to find the money and the second problem is he could ask odd questions. Nobody would suddenly want to have these plaques, I don't think they would be much worth.\" Gabriella shook her head. \"The second way is to break in ourselves. Oh come on Gabriella you don't think we could have a shot at this?\" Thomas asked seeing Gabriella's confused expression. \"With the dust we have we could take our chances and do it ourselves.\"<br>\r\n<br>\r\nThomas and Gabriella talked about it long and in the end they decided to...</span></div></div>",
            "created":1419656400,
            "id":1907990,
            "title":"Stupid enough to work"
        },
        "11111111122112211212":{
            "choices":[
                "Thomas",
                "Gabriella"
            ],
            "content":"<div class=\"\"><div> <span>A few days later Thomas and Gabriella were finished with their tenth cup that evening. After long deliberation they decided to break into the museum by themselves. It was a risky operation, but not as risky as hiring a thief to do it for them. Too many possibilities for leaks. The next day they scouted the museum pretending to be a couple visiting the museum. Thomas found it enjoyable spending the day with Gabriella. For once in his live he actually had \"fun\". In the evening they watched the results of their work on Gabriella's computer. The signal the bugs send out was good. It was not difficult to identify which way the guards would go during their walk.<br>\r\n<br>\r\nThe plan was simple. One of them (they still hadn't decided who) would use the dust to take over the guard sitting near the entrance. Once the guard was taken over the other person would take the possessor's body with them to the back of the museum. The possessor meanwhile would need to go to the security station and distract the guard in there. Once the guard would be away, the possessor could turn off the camera and deactivate the security protections around the plaques. The possessor would take the plaques with them and join the other one at the back of the museum where he or she would hand them over. Then the possessor would put the fake plaques inside the case. Then the security would need to be turned on again and the possessor would return to the guard's original post and de-possess him there. None would be the wiser. This would all need to happen in twenty minutes or thirty tops. A challenge but a reasonable one.<br>\r\n<br>\r\nThe problem was that they were still arguing about who should take the dust. While they both were up to it, they had different talents they could use. Thomas understood human emotions better than anyone else, it didn't take much effort for him to persuade someone to change his mind. Gabriella was more like a technician, she would be faster in hacking the security station and using it to her advantage.<br>\r\n<br>\r\nBoth were up to the job, but one of them eventually gave in. Who would use the dust?</span></div></div>",
            "created":1420261200,
            "id":1911972,
            "title":"steal the plaque themselves."
        },
        "111111111221122112121":{
            "choices":[
                "Go for subtelty, find the laxative and pour it into the guard's coffee cup.",
                "Make commotion, tell the security guard what his co-worker thinks about him.",
                "Try wreck some of the security camera's. "
            ],
            "content":"<div class=\"\"><div> <span>\"Are you ready?\" Gabriella asked Thomas through his earpiece. <br>\r\n<br>\r\n\"I was born ready, let's do this.\" Thomas said. He was standing now in front of the museum with the stars shining in the heaven. Thomas felt he was ready, he was born to do this. And besides a career choice as a criminal always attracted him somewhat, if not for those movies they made about the biggest heists. Today his name would be added to the list. <br>\r\n<br>\r\nThomas took a bit more than a fingertip and soon he was having the same floating experience as before. He tried to move his spiritual shape straight to the security guard standing on watch. The man was huge, bald and looked strong enough to take on five guys at the same time. Thomas felt him slipping inside the body in no time. He touched his bald head for a second and then his crotch for a second before entering the museum using the guard's key. Thomas felt the excitement going through his (temporary) body, he could feel his hart pounding in his chest, his hands getting slightly sweaty. Thomas took a quick look at the guard's ID. Rick Jones. Rick, Rick, Ricky. Thomas was smiling thinking Ricky sounded better than just Rick. Thomas knew he needed to take a right turn here and would be facing the security office. <br>\r\n<br>\r\nBut before Thomas took the turn he waited for a second. He needed to have something to tell the security guard inside the office to lure him away, but what? Thomas knew the man could be no fool, he needed to think of something.<br>\r\n<br>\r\nThomas cooked up three plans to get the security guard away, but which one to choose from?<br>\r\n<br>\r\nThe first plan would take Thomas to the Egyptian exhibit, from his trip there he remembered a bottle of Castor oil on display at the gift shop there. Castor oil would be perfect, it's a natural laxative, and pouring it into the guard's coffee cup should give Thomas the time he would need  to hack the security. The only downside of it was that it took time to get to the gift shop at the Egyptian exhibit and back again. <br>\r\n<br>\r\nThe second plan was to distract the guard using lies. Thomas remembered the guy patrolling the Roman exhibit, Norman. Perhaps a few well placed lies could make the security guard leave his post and confront his co-worker about it. But it could make him suspicious and Thomas wasn't sure how much time it would take for them to find out about it. <br>\r\n<br>\r\nThe third plan would use a little more force. Thomas remembered the locations of the security camera's, he thought. If he would find some of the black spots, perhaps he could \"adjust\" some of them to make the security guard check them out. This could take some time before the security guard would find it out. </span></div></div>",
            "created":1427950800,
            "id":1957784,
            "title":"Thomas"
        },
        "1111111112211221121212":{
            "choices":[
                "the pair celebrates their success.",
                "Gabriella immediately gets to work on enhancing the dust. "
            ],
            "content":"<div class=\"\"><div> <span>Thomas was confident about his abilities to fool the guard, after all this was one of the few pleasures he had in life. Thomas walked up to the guard post looking a bit hesitating, looking around his shoulder to see if anyone was noticing him. Inside the guard post he saw the guard in charge, Thomas could see the name of his badge, Frank it said. That was all he needed. <br>\r\n<br>\r\n\"Hey Frank.\" Thomas said as he closed the door behind him walking up to the other guard.<br>\r\n<br>\r\n\"Rick, what are you up here? Get back to your post before someone else sees you.\" Frank says shooing you away.<br>\r\n<br>\r\n\"I know, I know, but I need to talk you about something.\" Thomas said hesitant. <br>\r\n<br>\r\n\"What about? You know I can't let you go home already.\" Frank said already shaking his head. <br>\r\n<br>\r\n\"No, no, that's not it. It's something about what Norman said to me.\" Thomas said like he was going to share Frank his greatest secret with.<br>\r\n<br>\r\n\"What did that guy say now?\" Frank asked. Thomas noticed Frank's shoulder twitched little, an indication that Frank and Norman weren't on the best of terms.<br>\r\n<br>\r\n\"It's just that...I don't know.\" Thomas said a little weak. <br>\r\n<br>\r\n\"What, what did that clown say about me?\" Frank said standing up from his chair.<br>\r\n<br>\r\n\"No nothing he probably didn't mean it like that, it's nothing, I'll just go back to my post.\" Thomas said turning his back and walking to the door. But just before he could open the door he felt Frank's hand on his shoulder.<br>\r\n<br>\r\n\"Listen Rick, if that guy said something about me again, I ask you as my best pal to tell me what it is.\" Frank could barely hold his anger inside.<br>\r\n<br>\r\n\"It's just that. You know, Norman says you've been sleeping on the job.\" Thomas told Frank disappointed. <br>\r\n<br>\r\n\"What?! How, how...\" Frank was still holding his shoulder and Thomas could feel even with Rick's muscles that the guy was squeezing him tighter.<br>\r\n<br>\r\n\"Yeah, I couldn't believe it either. I mean we're talking about you, employee of the month.\" Thomas said remembering the photo's he saw on his way in. \"But Norman says he has photos to proof it. He's just waiting until you get your employee of the month trophy again, and then he's going to show the photo's.<br>\r\n<br>\r\n\"What! That little bastard. Wait until I get my hands on him.\" Frank said holding out his fist. <br>\r\n<br>\r\n\"I think he deserves a little punishment, I mean if that's not enough, he has been snickering the whole day about it.\" Thomas said adding  a little more oil on the fire. <br>\r\n<br>\r\nFrank seemed unsure for a moment what to do, but then he made a decision. \"Rick, would you mind watching the camera's? I think I got to have a little chat with Norm. And don't bother looking at camera C-4. That one won't show a thing.\" Frank muttered as he slammed the door behind him with such a force that the photo's of Frank with his employee of the month trophy fell on the ground. <br>\r\n<br>\r\nThomas meanwhile smiled wide. He still got that special talent for setting people up. Now all he needed to do was to deactivate security and switch off the camera's at the plaques site. Thomas got to work immediately, knowing that he needed the time to hack through. While Thomas was busy, he took several glances at camera C4. He saw Frank walking up to Norman with his fingers on Norman's chest. Thomas found it sad that he didn't have more time to have a chat with Norman as well. He knew that if both people were prepped things would explode even further. Thomas saw the pair arguing and after a while, Frank grabbed Norman and looked at the security camera. Thomas quickly set it off and knew Frank could do his \"thing\" then. <br>\r\n<br>\r\nAfter five minutes Thomas thought he had deactivated every security measure and switched off all the camera's. Now all he needed to do was to go and grab the plaques. Frank left the security post and took a sprint to the plaques site. He didn't see anyone and quickly pulled up the glass cabinet. There they lay the plaques which they needed for the dust. Thomas grabbed them and ran to the back of the museum remembering the layout of the museum as he had studied them. At the back of the museum he saw Gabriella already waiting for him. She was surprised a little as his appearance, but when she saw the plaques he was carrying, she quickly handed him the fake ones. With barely a goodbye Thomas ran back to the exhibit putting the plaques back. Nobody would be the wiser, at least if they weren't taken from underneath the glass cabinet. Thomas then ran to the security post and activated the security measures and camera's. And as he just put the last one on, the door opened and Frank stepped inside. <br>\r\n<br>\r\n\"That little weasel, tried to deny everything. Well I taught him a lesson, he will well remember. Say what are you doing there?\" Frank asked.<br>\r\n<br>\r\n\"I was just putting the camera on, you know where you taught him a lesson, you know to make sure nobody notices it. I thought you would be back around now.<br>\r\n<br>\r\n\"Well I'm glad. I didn't even knew you were that handy with computers, Rick.\" Frank said happy as he sat down on his chair.<br>\r\n<br>\r\n<i>Even an idiot would know that. </i> Thomas thought. \"Well I picked up something here and there.\" He explained. \"I think it's best if I'm on my way. Don't want anyone entering the museum.\" Thomas told Frank. He had to hurry up, the drug would surely work off any moment now.<br>\r\n<br>\r\n\"Alright, I'll see you at coffee time.\" Frank said waving his hand. Thomas ran back to the place Rick was guarding, as fast as he could. But just before he reached the door, Thomas suddenly awoke inside the car.<br>\r\n<br>\r\n\"Glad you're awake. I wasn't sure whether to leave you in that state.\" Gabriella said with a coy smile.<br>\r\n<br>\r\n\"Haha, now drive us away will you? I'm glad to leave this place.\" Thomas said as he stretched his body. And with a push on the gas pedal the car sped away from the parking lot of the museum. <br>\r\n<br>\r\nThat evening...</span></div></div>",
            "created":1434862800,
            "id":1996693,
            "title":"Make commotion, tell the security guard what hi..."
        },
        "11111111122112211212122":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "Gabriella would use the improved dust first",
                "Thomas would use the improved dust first "
            ],
            "content":"<div class=\"\"><div> <span>Gabriella spent several days working on Thomas' new drug. It became an obsession of hers. In that time, Thomas continued to run business as normal despite his mind constantly wandering back to that drug, that dust.<br>\r\n<br>\r\nAlmost a week later, a tired Gabriella finally paged Thomas to come to her lab. Thomas told his receptionist Camille to cancel all his appointments for the afternoon and asked that he not be disturbed. Thomas quickly got onto the elevator and headed towards Gabriella's lab. Once in her lab, he saw a very tired Gabriella pouring a light blue powder into some vials.<br>\r\n<br>\r\n\"I think it's done Tom. The moon dust was able to stabilize the chemical properties of the powder. The problem is I don't know how long the possession will last nor have I figured out a way to control the duration.\" Gabriella said<br>\r\n<br>\r\n\"We'll have to experiment and tweak the formula to make it a decent duration. I think it's time to celebrate and try this out.\" Thomas said smugly.<br>\r\n<br>\r\nGabriella despite being tired seemed fine idea and picked up one of the vials and looked at it for a moment. \"I think only one of us should use it at a time while we're using this stuff right now. Since I don't know how long the duration will last, imagine if this stuff put both us inside someone for a week. People would start asking questions and we wouldn't be able to access the lab or the rest of the dust.\"<br>\r\n<br>\r\nThomas agreed. They both decided that...</span></div></div>",
            "created":1498366800,
            "id":2342801,
            "title":"Gabriella immediately gets to work on enhancing..."
        },
        "111111111221122112121221":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "She saw her body slouched over in her car",
                "Her body convulsing with blood coming from her nose and mouth"
            ],
            "content":"<div class=\"\"><div> <span>It made sense that Gabriella would use the drug first after being altered. If the drug made the possession last too long, Thomas could let her in whatever body back into the lab for changes. Also he could still keep positive control of all the dust and their research. Gabriella took a small amount of the prototype dust and put it in her purse and left the lab. As she waited in the Sterilizing chamber, she thought about who would she become. She needed to be someone who wouldn't bring up too much attention if they were missing for a while. She also thought about when she had accidentally became a man at the burger joint, she really didn't fancy being a man and definitely didn't want to be one if she might be stuck for an extended period of time. <br>\r\n<br>\r\nGabriella got in her car a drove off. It was a Thursday afternoon and plenty of people should be at the park enjoying the nice weather. After going through the drive thru of her usual burger joint, she parked her car at the park. She didn't eat her burger though. It would be part of her cover story if or when the somebody found her unconscious. She brought just enough dust for one use so nobody could find or steal it. After putting the dust on the tip of her index finger she thought \"here goes nothing\" as she snorted it into her nose.<br>\r\n<br>\r\nGabriella immediately felt the familiar floating sensation as she was above her body. When she looked down she saw...</span></div></div>",
            "created":1498453200,
            "id":2342806,
            "title":"Gabriella would use the improved dust first"
        },
        "1111111112211221121212212":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "She possesses one of the people nearby",
                "Another candidate comes along at the last second"
            ],
            "content":"<div class=\"\"><div> <span>Gabriella freaked out. There was something wrong with her body and nobody was nearby to see her and call 911. By the time anyone noticed, her body would be dead. Gabriella needed to find a body and call 911 herself.<br>\r\n<br>\r\nShe floated towards the grass at the edge of the park where people would be found. Gabriella felt as if she couldn't move fast enough and was even further disappointed at the people that were there. Most of them were younger kids playing frisbee or soccer. She saw an old couple walking their dog and nerdy looking teenager reading his book on a bench. There also was an overweight mother pushing a stroller along the sidewalk. <br>\r\n<br>\r\nThe choices looked bleak. Gabriella didn't want to be any of these people, but she had to choose someone if she wanted to get help for her body.</span></div></div>",
            "created":1498453200,
            "id":2342811,
            "title":"Her body convulsing with blood coming from her ..."
        },
        "11111111122112211212122122":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "Perky dark breasts covered a tan sports bra",
                "Chubby hands holding a pink stroller"
            ],
            "content":"<div class=\"\"><div> <span>Luck finally was on Gabriella's side. Before she was forced to possess a dreadful form, a young jogger was seen running by on the sidewalk. She had a dark complexion and wore purple spandex running shorts and a grey sports bra with her black hair in a ponytail. Gabriella could only see her from behind, but she had nice curves and a tight ass. Gabriella couldn't admire all of her if she wanted to take her body. From what from what she saw, this looked like a body she wanted to have for her 'trials'.<br>\r\n<br>\r\nShe quickly floated towards the jogger, trying to get close enough to let herself be absorbed into the body she wanted.<br>\r\n<br>\r\nGabriella continued to get closer and closer until she believed she won. She immediately felt dizzy and world faded out.<br>\r\n<br>\r\nWhen Gabriella regained her senses she noticed she was standing on the sidewalk as she looked down she saw...<br>\r\n<br>\r\n</span></div></div>",
            "created":1498453200,
            "id":2342815,
            "title":"Another candidate comes along at the last second"
        },
        "111111111221122112121221221":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "A Palestinian flag was hanging on the wall",
                "Posters of nude women were on the walls"
            ],
            "content":"<div class=\"\"><div> <span>She did it. Gabriella got the body of the exotic beauty she wanted. She felt somewhat tired and out of breath, but had no time. She ran over to her car and saw her body. Her clothes were covered in blood and she was no longer spasming or moving. Gabriella immediately starting yelling for help and calling for the police. People started looking at her. A few people in the parking lot that just arrived gathered around. Once Gabriella saw one of them call 911 on their phone, she partially pretended to freak out and ran off.<br>\r\n<br>\r\nAfter running away from the park, she finally stopped. There was nothing more she could do for her body. For the first time in a long while, Gabriella was scared. What would happen if her body died? Would she be stuck in the body she currently occupied? What if the drug wore off and she had no body to go to? As much as she fancied the thought of being in a different body, she also didn't want to lose what she worked for.<br>\r\n<br>\r\nGabriella noticed a black vinyl wallet strapped on her left arm. She opened it up and found an ID, a bus pass and a key that presumably went to this woman's house or apartment. After making sure she was in a safe enough place to stop for a minute, she looked at the ID long enough to find her temporary address. As luck had been with Gabriella, the direction she ran off in was towards this woman's apartment. She still couldn't believe it though, after running away from her car, she managed to run 20 blocks in this body and not get tired. \"This body is really fit, I can't wait to explore it more\" Gabriella thought as she headed the last couple blocks to the new place she would call home.<br>\r\n<br>\r\nAfter going up a few flights of stairs Gabriella opened the door to this woman's place. She walked around and noticed it was a clean and very sparsely furnished one bedroom apartment. Gabriella thought this was perfect as a roommate might notice her body acting out of character. When she went into the bedroom she was caught off completely guard.</span></div></div>",
            "created":1498453200,
            "id":2342835,
            "title":"Perky dark breasts covered a tan sports bra"
        },
        "1111111112211221121212212211":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "Find out more information about Amenah",
                "Take a much needed bath"
            ],
            "content":"<div class=\"\"><div> <span>Gabriella stared daggers at that flag. She thought it was a symbol of true evil to her. Once again, Gabriella looked at the ID she inherited more closely and saw the name. Based on the ID she held, Gabriella now was Amenah Haddad, she was 20 years old, was 63 inches tall and weighed 122 pounds.<br>\r\n<br>\r\nNow she was upset. Gabriella was proud of her Israeli heritage. During her teen years, her father moved them to the United States when her mother was killed by those murderous Palestinian terrorists. Now she stuck in the body of what she hated. Spotting a cheap wall mirror mounted on the inside of a open closet door, Gabriella decided to look at her new reflection. <br>\r\n<br>\r\nAmenah was quite a fit woman. She was obviously very much into fitness, as her body was quite toned. This however didn't take away from her beauty as Amenah had an amazing waist with perfectly sculpted thighs and tight ass. But what really made Amenah popular to look at were her breasts. For a small woman, her natural 38D breasts really made her stand out. As Gabriella looked towards her face she saw a sharp jaw line, a thin chin with large cheekbones and somewhat oversized nose. Amenah definitely didn't have the prettiest face. It was average at best.<br>\r\n<br>\r\nGabriella found Amenah's cell phone and called Thomas' private line. After dialing his number several times, he finally picked up the phone and answered \"Who is this!?This is an unlisted number.\"<br>\r\n<br>\r\nNever in her life Gabriella thought she would be so glad to hear Thomas' voice. She had personally never been fond enough of him to talk to him outside or work until he brought her the dust. \"Thomas its Gabriella. I'm stuck inside this body and I don't know for how long.\"<br>\r\n<br>\r\nThomas sighed in what sounded like frustration over the phone and then paused. \"Gabby, I just received a call that you were declared dead. The first responders couldn't do anything for you. Your body is currently at the hospital waiting on an autopsy. Hopefully by tomorrow morning we'll know what happened to your body.\" Thomas could hear Gabriella crying over the phone. \"Gabby, give me your address and I'll come by and pick you up first thing in the morning.\"<br>\r\n<br>\r\nGabriella read off her new address between sobs to Thomas. After a long pause of nothing but crying, Thomas did his best to say goodbye before hanging up. After a couple hours Gabriella eventually stopped crying and got a hold of herself. It was already somewhat late at night and she was wearing Amenah's dirty jogging outfit that smelled of body odor. The very first thing she did was take down that horrid Palestinian flag and throw it into the trashcan. She then decided to first...<br>\r\n</span></div></div>",
            "created":1498463040,
            "id":2342847,
            "title":"A Palestinian flag was hanging on the wall"
        },
        "11111111122112211212122122112":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "Get some rest after a stressful day",
                "Search the apartment and find out more about Amenah"
            ],
            "content":"<div class=\"\"><div> <span>Gabriella needed to take a bath. She felt dirty and it would affect her subconsciously until she got cleaned. The bathroom in the apartment was tiny, but still had an old beat up bathtub with a shower and shower curtain. Despite being worn and aged, the whole bathroom seemed reasonably clean. Gabriella put the rubber plug on the drain and turned on the water on. As the water warmed and the tub filled, she began taking off clothes she never put on. The sports bra came off first and her new tits hung free. She then took off her spandex running shorts until she was only wearing a thong. After she stepped climbed into the bath tub and relaxed in the warm water. <br>\r\n<br>\r\nCuriosity got the better of Gabriella as her new hand began exploring her body. Despite still being female, it still felt different. While Gabriella was considered pretty in a business suit or wearing a lab coat, she had a bit of a pooch around her belly and some cellulite on her thighs. She may have been successful, but while working she did a poor job of taking care of her body. The last guy she slept with thought she looked like she was in her late thirties. This body was the opposite. Her abs were rock solid and nothing else jiggled aside from her tits. Her new thighs were smooth and strong. Having already felt her ass, she knew she had an ass that even Camille would be jealous of. As Gabriella was admiring her new body, she ran her hands over her thighs and belly and began to feel aroused. Her large nipples became erect and stood out on areolas that her hands could barely cover. She continued to sit back while one hand played with her left breasts and the other explored her unfamiliar labia in search of her clit. Since Amenah shaved her pussy, Gabriella found her new clit easily and began rubbing it. Moaning with and unfamiliar voice, Gabriella was in drowning in pleasure. It didn't take long to orgasm. But it wasn't enough, with Amenah's body, Gabriella was able to get 3 orgasms before the water started to get cold. She was a little disappointed that she didn't get to wash her hair, but was greatly satisfied in the pleasure her new body could give.<br>\r\n<br>\r\nAfter drying off, Gabriella looked at the clock on Amenah's bed and saw that it was almost 10:30 pm. She needed to rest before Thomas picks her up but also find out more about Amenah if she was stuck in her body for the time being. She decided to...<br>\r\n</span></div></div>",
            "created":1498467060,
            "id":2342873,
            "title":"Take a much needed bath"
        },
        "111111111221122112121221221122":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "Thomas downstairs waiting",
                "The gym called asking if she could work early"
            ],
            "content":"<div class=\"\"><div> <span>Gabriella was quite tired. Her mind hasn't rested in several days and her new body clearly was tried from the long run today. But Gabriella couldn't just start tomorrow blind. She had to have an idea about who Amenah was if she was going to navigate her life without raising too much suspicion with her friends and family. Going through drawers and searching her un-passworded laptop, Gabriella spent almost 3 hours learning about Amenah. For starters, she was a Palestinian refugee who moved to the United States when she was young. Her father's name was Fizel and mother's name was Fatima. She spoke fluent Arabic, which Gabriella didn't. For the most part, Amenah wasn't a practicing Muslim but still had strong feelings for Palestinian independence. She worked as a barista at a local Starbucks part time and worked at a local gym as a personal trainer. She had a bachelors degree in physical training and was currently single. She loved pop music and volunteered at a nonprofit palastinian aid foundation. \"If this is going to be my new body, most of this is going to change. Perhaps a new name and identity are in order\" Gabriella thought. <br>\r\n<br>\r\nDozing off to sleep, Gabriella was woken up by her phone ringing in the morning...</span></div></div>",
            "created":1498594980,
            "id":2343597,
            "title":"Search the apartment and find out more about Am..."
        },
        "1111111112211221121212212211221":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "Carry on",
                "some thing else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gabriella Woke up  to the sound of amenah's phone ringing <br>\r\n<br>\r\nshe picked it up and it was thomas on the other end. he was downstairs and didnt know which flat gabriella was in so she decided to get up and lead him in.......</span></div></span></div>",
            "created":1500123720,
            "id":2353696,
            "title":"Thomas downstairs waiting"
        },
        "111111111221122112121221222":{
            "author_id":"wolfer084",
            "author_name":"Wolfer",
            "choices":[
                "Was greeted by Tammy's husband",
                "Put the kid into the play pen with a bottle"
            ],
            "content":"<div class=\"\"><div> <span>When Gabriella looked down, she saw that she holding a stroller. Letting go of the stroller she looked at her hands. They were a bit chubby but still feminine and a wedding band adorned her left hand. Continuing down her new body she saw decent sized breasts underneath a red sweater. Gabriella grabbed the stroller and pushed it toward the parking lot. Once she got close enough, she left the stroller with whatever hold in it behind as her car was only 20 feet away. Gabriella felt exhausted, her body jiggled with every step and was clearly not in shape. When she got to her car, she saw her body covered in blood slouched over in the drivers seat unconscious. Gasping for air, Gabriella began crying for help. A nearby bicycle policeman heard Gabriella and came to aid. He saw what Gabriella saw and radioed for an ambulance. <br>\r\n<br>\r\nAfter the ambulance left with Gabriella's body and answering some simple questions for the police, she was free to leave. While everyone was distracted with her body, Gabriella was able to go through her body's purse to find out enough to not raise any suspicions with the police. Once she was far enough away from the police, she looked at her ID in her purse again. Tammy Daniels, 26 years old, 66 inches tall and says 132 lbs. Gabriella knew that was outdated. Extremely fortuitously, the 1 year old girl she inherited in the stroller stay asleep the entire time so far. There was nothing else she could do for her body. Hopefully doctors at the hospital can stabilize her body and keep it alive. Gabriella was a genius scientist, not a some frumpy mother. <br>\r\n<br>\r\nSpeaking of frumpy, she wanted to quickly examine her borrowed body to get an idea of what it was like. Using her hands, she began feeling up her body. Her boobs felt tiny compared to the frame she felt he had. Her stomach jutted out a bit and pooch hung over her mom jeans that she was wearing. Her thighs were fat enough to rub together when she walked and her right ankle seemed to ache quite a bit. Gabriella decided that was enough for now. She now had a kid to bring home, a further inspection can wait when she wasn't in public.<br>\r\n<br>\r\nGabriella had no issues finding Tammy's home as it was only a block away from the park. Gabriella opened the door and...<br>\r\n</span></div></div>",
            "created":1498469400,
            "id":2342882,
            "title":"Chubby hands holding a pink stroller"
        },
        "111111111221122112121222":{
            "author_id":"adianjayz",
            "author_name":"adianjayz",
            "choices":[
                "Thomas took a break.",
                "Something came up."
            ],
            "content":"<div class=\"\"><div> <span>“As much as I wanted to try this firsthand, I think you should use it first. It’s best if I stay to observe and tweak the formula as you do your test run,” Gabriella proclaimed, followed by a brief sigh. <br>\r\n<br>\r\n“Are you sure?” Thomas asked, although it was clear that he was extremely excited by this opportunity.<br>\r\n<br>\r\n“Yes. But before I allow you to test…” Gabriella started.<br>\r\n<br>\r\nBefore she could finish her sentence, Thomas picked up one of the vials, unscrewed the cork, and took a large waft of the light blue powder. Unlike his first attempt at inhaling Dust, this version was much stronger. Thomas was immediately knocked out with no blissful feeling. When Thomas regained his bearings, he was back in his ethereal form. He felt that he has more control over this form now, as he was able to prevent himself from possessing Gabriella. <br>\r\n<br>\r\nSpeaking of her, she was clearly annoyed by Thomas’s hastiness as she caught Thomas’s limp body and laid it on a nearby chair. “Why must you be in a rush? I haven’t even finish explaining our plan!” she exclaimed. Thomas had to admit that she was right, but he just got so excited at the chance to use Dust again. Despite holding a generous amount in the briefcases, he resisted the urge to try it until Gabriella’s report. It was a lapse in judgment from the normally composed executive in the company due to his personal interests. “Sorry, Gabriella,” Thomas whispered as he surveyed around for a potential target.<br>\r\n<br>\r\nAs Gabriella was an independent researcher, there was no one else in the lab besides her. Feeling a chill from being in his ethereal form for an extended amount of time, Thomas quickly moved towards the door, hoping to catch someone within the office building. But as soon as he slipped past the door, his vision blacked out. When it was restored, Thomas realized that he was now leaning against the wall close to the entrance of the lab. <br>\r\n<br>\r\n“Well, I certainly didn’t expect myself to be in a body immediately after leaving the lab,” Thomas remarked, while taking a couple deep breaths to get accustomed to his new vocal chords. However, this voice was familiar to Thomas, as it was one he would hear daily. Looking down to inspect his new body, his suspicions were confirmed. His body was now adorned in Camille’s black skirt suit with a white button-up blouse and black stilettos. Certainly, Camille’s features were not as impressive as Officer Nelson’s, but they also conferred their own advantages. Compared to his previous female host, Thomas’s new body felt lighter and perkier, definitely less weighty and sluggish. His dainty hands, now embellished with light pink painted nails, went to his chest as Thomas appreciated that his chest wasn’t weighing down on his back like Officer Nelson’s. His palm slowly caressed those small but soft globes. <br>\r\n<br>\r\n“Eh hm!” came a voice beside him. Turning towards the lab, Thomas saw Gabriella giving a sly smile as she propped open the lab door. “What are you doing, Camille, or should I say, Thomas?” <br>\r\n<br>\r\n“Nothing,” Thomas quickly retreated his arms to his side. “Just fixing my blazer. I do apologize, but I am not Thomas. I’m only his secretary.” Thomas attempted to joke a little.<br>\r\n<br>\r\nGabriella chuckled before replying, “Hehe. Nice try, mister. I actually saw what you were trying to do, and it wasn’t something Camille would even consider doing in the office.”<br>\r\n<br>\r\n“I see. Can’t get anything past <i>Doctor</i> Shemer, now can I?” Thomas answered with the most devious tone he could muster with Camille’s sweet timbre.<br>\r\n<br>\r\n“Yeah yeah. Get back in the lab. I didn’t finish my explanation from before,” Gabriella said annoyingly, pulling Thomas into the lab space they were in. <br>\r\n<br>\r\n“So Thomas, I actually wanted to discuss with you about the specifics of our next step, but you just jumped ahead without me. When your body went limp, you could have injured yourself! Who knows what would happen to your consciousness if your original body fell over and died? Consider yourself lucky that I caught your body in time and hauled it over to that chair over there unscathed,” Gabriella reprimanded Thomas while gesturing towards Thomas’s comatose body. “Although…” Gabriella eyed Thomas’s new form closely, “I suppose that it could have been worse. You are at least in a suitable host for the next week or so.”<br>\r\n<br>\r\n“For the next week?!” Thomas exclaimed, but immediately replying, “Oh right,” when he recalled Gabriella’s previous explanation. While Thomas was certainly of his opposite gender and had a taste of it back with Officer Nelson, it was only a momentary experience with relatively little consequence. Now fully comprehending the extended duration away from his own body, Thomas became slightly apprehensive, even if he was currently in Camille’s body, a body he wanted to try since he obtained Dust. “Sorry, Gabriella. I got too excited when you asked me to test your new prototype. I’ve been holding back on using Dust until you discovered more information on it.”<br>\r\n<br>\r\n“Really? You didn’t try it out in the past week, despite the many appealing targets surrounding you that you could have chosen?!” Gabriella answered incredulously. But seeing that Thomas was serious, her tone shifted back to a more professional setting, and she replied, “Well, like I said before, this is certainly not the worst situation. Camille’s body might be the prime target for you. She works closely with you in both location and task. You could easily monitor your own work during this time with minimal disruption while checking in on the drug’s status. Also… it might eliminate a potential onlooker to our secret project. I suspect that Camille was spying on your movements, since she most likely followed you down here.”<br>\r\n<br>\r\nStroking Camille’s smooth chin, Thomas agreed, “Yes, Gabriella. You may be right. After all, she was just standing near the lab right before I possessed her. At least this will keep her quiet for a while.” Thomas brushed some regular dust off his clothing as he gestured at his body. “Also, it’s good that she is single and lives alone. I shouldn’t have to worry too much about her personal life as long as I keep my work in the office.”<br>\r\n<br>\r\n“And I assume that you will uphold your integrity and keep all exploration to a minimum?” Gabriella added with a playful tone. Despite all her seriousness during work, she does add a few amusing moments once in a while.<br>\r\n<br>\r\n“Well yes, certainly. As much as it is reasonable to do so. You have my word,” Thomas said, as he held his right hand up like he was about to testify in court. Noticing Camille’s long pink press-on nails, Thomas whispered under his breath, “That would be something I’ve to get used to this following week.”<br>\r\n<br>\r\n“Alright. I trust you. I don’t really talk with Camille, so I don’t know much about her personal life. Sorry, I can’t help you with that, but I trust that you will navigate those aspects to your best judgment. You could ask me if you have questions about certain matters. In the meantime, I will maintain your original body in a stasis chamber here in lab, where it will provide the necessary life support until you return.  Also, we should set up a code phrase for when you switch back just in case it happens out of office hours. How about ‘Dust in time.’?”<br>\r\n<br>\r\n“I see, that could work,” Thomas replied with a slight chuckle at the pun. <br>\r\n<br>\r\n“Well, if you don’t have any more comments, you could head back to whether you are doing. I’m going to play around with the Dust composition to see if I develop something new.”<br>\r\n<br>\r\n“Alright. Good work so far, Gabriella. Let me know if you find something.” Thomas waved before he headed out the lab. <br>\r\n<br>\r\nAs he made his way towards the elevator, he briefly stumbled a bit before holding himself along the railing on the wall. He was certainly not used to walking in Camille’s stilettos, but it was another thing he had to get used to. After returning upright, he let out a deep breath. “This might be harder than I thought.”<br>\r\nReturning to his floor, he was about to step into his own office when he briefly pondered where he should work. It would make sense to work in Camille’s desk with his current body, but at the same time, his own desk would provide the privacy and space he had always enjoyed. “Eh. It’s not like I would get visitors often on this floor. Usually, Camille would be the one to address those visitors in another area. Nobody would suspect anything as long as I do both my job and Camille’s job.” Thomas carried some of Camille’s files and personal belongings from her desk and walked into his office. Sitting down in his leather chair, he enjoyed the familiar setting of his workplace, one where he spent a majority of his time during work. He did realize that he had to adjust the chair slightly to fit his somewhat shorter stature. As Thomas was about to begin working on his normal work on ingredient hunting, he did notice that he was somewhat distracted by certain nuances, namely the thicker cushion around his rump, long strands of light brown hair flowing across the side of his face, his legs constrained by the skirt around his thighs, and his body perfume clashing with the normal odor of his office. As much as Thomas wanted to explore right now, he knew that he should complete the day’s work just to keep anyone from bugging him. Luckily, he had a light workload due to his cancelled appointments, so he was able to finish the work within a couple of hours. Glancing at the clock on his desk, it was already 2:30 pm when he finished. </span></div></div>",
            "created":1592022540,
            "id":2850468,
            "title":"Thomas would use the improved dust first "
        },
        "1111111112211221121212221":{
            "author_id":"adianjayz",
            "author_name":"adianjayz",
            "choices":[
                "Thomas calls Gabriella.",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>After uploading all of the necessary ingredients to order and transactions in the database, Thomas thought he should take a break as he stretched his arms toward the ceiling, feeling the blouse and blazer straining against his chest. As if on cue, he could hear his stomach growl, and he instinctively moved a hand over it, remarking, “I must be famished. I wonder when Camille last ate. I wonder when I last ate.” Standing up, Thomas felt a slight chill across his legs. Looking down, he saw that his skirt had rode up beyond mid-thigh and proceeded to pull it down slightly below mid-thigh. “I’m pretty sure this is shorter than what most girls wear, but I suppose Camille was able to get away with it because she works here.” Thomas also caught a brief glimpse of the black polka-dot pantyhose he was now wearing, surely another fashion choice peculiar to Camille. Patting down his skirt, he realized that he didn’t have his wallet, which was probably left behind on his own body. At first, he was hesitant on using Camille’s money in her purse, but Thomas later reasoned that he was filling Camille’s body, so it was ultimately to her benefit. Seeing that it was also more convenient, he grabbed Camille’s small black leather purse and headed to the small café near the lobby. <br>\r\n<br>\r\nThe small restaurant around the corner, frequented by Thomas, served the best mac-and-cheese in town. It was reminiscent of his mother’s signature dish back in his childhood days. The perfect soft buttery texture combined with a side of rich coleslaw were enough to remind him to those simpler times, before his mom passed away and he lived a life of perpetual loneliness, corporate work, and drugs. Stepping into the small parlor, the young lady noticed Thomas and immediately remarked, “The usual, right miss? Although you definitely came later than usual…”<br>\r\n<br>\r\n“Yes, please. I suppose it is pretty late.” Thomas instinctively replied. Initially surprised, Thomas remembered that Camille tended to run these errands for him. And he did agree that it was pretty late. After all, he was fully concentrated on his work as usual. Normally, Camille would automatically prepare and call him for lunch, which was obviously not possible today. He wanted to feel annoyed, but this trip was a good excuse for a brief excursion. Now that he thought about it, perhaps it’s good to take a step out of his office once in a while to enjoy the outside atmosphere, such as the warm smell of this restaurant. <br>\r\n<br>\r\nGrabbing the order and paying for it, Thomas headed back into the company building and waited for the elevator. There, he encountered another male employee of tall stature that he did not recognize. The company had many employees for sure, but this guy seemed to be an executive based on his attire. When the elevator opened, the man gestured for Thomas to enter first.<br>\r\n<br>\r\nWhen Thomas pressed the button for his floor, the man commented, “Oh, are you working with one of the higher-ups? I swore you looked like one of our recent interns.”<br>\r\n<br>\r\n“Of course, my father… I mean, I work as the assistant for the CEO’s son.” Thomas was able to catch himself in time. Despite of the perceptions reminding him that he was not himself, he had to be consciously aware in conversations such as these. Luckily, the man didn’t catch his mistake.<br>\r\n<br>\r\n“Wow, what a prestigious position. And you look so young too…” For a second, Thomas thought the man was leering at his curves. It made him somewhat uncomfortable, like he was visually raped. <br>\r\n<br>\r\nThe elevator door opened, and Thomas quickly waved to the man before getting off on his floor. As he walked back into his office, he breathed a sigh of relief. He thought that if he stayed in that elevator a while longer, he might have been sexually harassed. “I guess it’s certainly hard to work in a corporate world as a woman. Although, Camille’s attire certainly leaves little to imagination,” Thomas said, glancing down at his tight blazer accentuating his curves and the short skirt. Ironically enough, this attire would have been something Thomas would enjoy staring if he was in his own body.<br>\r\n<br>\r\nHis stomach growled again, which prompted Thomas to plop down the purse and sit down in his chair to eat. As he was eating, he noticed that the taste was somewhat different from before. Initially suspecting that the restaurant made a mistake, he wanted to give a call before he stopped himself. The mac and cheese looked the same as before, and the fluffy texture was familiar, although the buttery taste felt…off. “Interesting, so maybe Camille’s tastes are different from mine.” Thomas opened the coleslaw to test, and the taste also felt different there. Oh well, Thomas was fairly hungry anyways, so he decided to just eat for the time being. He only managed to finish half the portion before feeling full.<br>\r\n<br>\r\nWhile he couldn’t really reminiscence on his past with his changed taste, he was pondering on something else. Working in a pharmaceutical company, Thomas familiarized himself with drugs, their mechanisms, and side effects. Safe to say, Dust was very unique, since it went beyond changing just one molecular component in the body. It must be very complex to transfer a whole consciousness into another body. Thomas imagined that his consciousness is currently stored in a portion of Camille’s brain, and he was experiencing all of the sensations, such as taste, from the rest of her body by electrical and chemical relays. Surely, the drug couldn’t just recreate all of these relays and perceptions in his own body. Plus, a change of this magnitude would incur numerous detrimental side effects, right?<br>\r\n<br>\r\nBut then Thomas didn’t realize any major detrimental side effects. In fact, he felt livelier and happier while in Camille’s body. Glancing at his medication capsules, he noticed that he wasn’t suffering headaches or depression from before, which was a great relief. It was like a new start in life, or almost a new start, given that this wasn’t really his reality. If there were any detriments, it would most likely be the social and physical status of a female, such as being leered at by the man in the elevator. But Thomas would take that over his constant pain and depression.<br>\r\n<br>\r\nHis office phone rang to break his chain of thought, and he promptly answered, “Hello, this is Thomas…Mr. Worthmore’s assistant speaking. How may I help you?”<br>\r\n<br>\r\n“Oh! Sorry, I was expecting Mr. Worthmore, but it is ok. I just wanted to let him know that the HR office wants to meet with him briefly.”<br>\r\n<br>\r\n“Sure, may I ask why?” Thomas replied, feigning indifference but ultimately curious why he would be called into the HR again.<br>\r\n<br>\r\n“Oh. We just got some reports that he might be soliciting illegal drugs. We just want to verify the information with him.”<br>\r\n<br>\r\nA brief pause, as Thomas gave a quick thought. Did someone catch him with Dust? He did get in trouble in previous cases, so he took better precautions this time, but he wouldn’t believe he would be caught this easily. The other end of the call gave a quick “Hello?” before Thomas responded, “Yes, I will be sure to let Mr. Worthmore know. Thank you and have a nice afternoon.” Thomas hanged up and leaned back in his chair to think. Was he really caught, and who would have caught on? Aside from him, only Gabriella knows of Dust. He only mentioned it in this office and nowhere else. Camille might have suspected something, as she tailed him to the lab, but it seemed too soon for her to say anything, and she was obviously silenced now. <br>\r\n<br>\r\nThomas felt that his throat was dry, so he scoured around his desk for something to drink. He realized he forgot to buy something to drink at the café, but he luckily had his own mug of coffee from this morning. Seeing no other option, Thomas opened the mug and chugged the coffee. As his lips left the rim of the mug, he chuckled, “This is sort of like an indirect kiss to me. I wonder if Camille would be willing to do the same thing.” He smacked his lips, which had a hint of strawberry scent to it. Glancing at the clock, it was 10 minutes before 4. Gabriella might still be in lab, so consulting her about the HR call might be a good option. Or perhaps there was a better course of action.</span></div></div>",
            "created":1592071800,
            "id":2850706,
            "title":"Thomas took a break."
        },
        "112":{
            "author_id":"nirxor",
            "author_name":"Nirro",
            "choices":[
                "No, research comes first",
                "A little divergent of the plan",
                "Taking Alyssa to the lab."
            ],
            "content":"<div class=\"\"><div> <span>You wake up turning restlessly, your phone going off with a notification.<br>\r\n<br>\r\n\"Have you tried this?\" Another ad to wake you up. Checking the time you realize it's already three in the morning. You get off the sofa, stretching your body, before checking your wallet, only to find about fifteen dollars and eighty-two cents total.<br>\r\n<br>\r\n\"Fuck.\" You mutter in defeat. You had graduated five years ago, being one the best in the class, had a chance to go anywhere, yet blew it. Bad. You were kicked out of the university, you destroyed your work, so nobody could claim it in a very intense argument. To add injury to insult, you did  a year of hard time. You got sent to prison in under two days. It was originally supposed to be a 15 year lock up. The case was  basically done and you got lucky. It was dropped after About a year and  was over, the people pressing the legal talons into you had assumed you learned your lesson, they let you walked free in 3. Your parents disowned  you in a letter a week into prison, with a letter from each parent and siblings telling you how \"bad\" you were, detailing your failures, and, how their expectations were betrayed. Ultimately issuing a restraining order on you and making it very well known that you were not accepted or even spoke about anymore to anyone in front of your parents. Your case never made headlines or shook the world. You just got swept under the rug, all hush-hush. After it all settled down and the dust was clearing: you ended up in a very distance city across the country, or rather the halfway house kicked you out in under a day, with little to no money so you had to get a job asap. Luckily, mechanics were still paid okay. After months of people giving you crap, you escaped to a very hidden away town, with a sizable population. You owned a small dinky repair shop now. Ac units, cars, appliances, computers, you did it all, alone. You also lived in the upper half, having recently bought a sofa and stove for under a hundred dollars, it was a great buy for you. You has gas, electricity, running water, and, a roof over your head. All in all your alive, your okay, and, there tomorrow.<br>\r\n<br>\r\n\"I guess am living the quiet life now.\" You thought, happy you had the essentials and some pocket money for food at the 24-hour mart. As you looked to the table. Out of habit you still continued your work, the intellectual in you wanted to see how far you could take this expirmental idea that you ended in the university. Expanding the mind, connecting people on different level, these were your goals. After a year of getting back on track, you think you might have done it. Unfortunately, the truck and food payments come first. It's late but, there's an all night Walmart opened here, it's still pretty new and has a sizable selection. You thinking about going out and trying to get some food when you realize you need to save up. Begrudgingly you pull out a can of crackers and sausages. For a dollar a pack it will hold you over till the morning and then you can go the bank. You need to check your balance and take care of the front business anyways. <br>\r\n<br>\r\n**********************\"****\"**************************<br>\r\n<br>\r\nIn the past few hours you have been working in a secret laboratory on the third floor. Having begun making preparations for another test of your drug. The dust expirmental substance you named projection powered. You made and used once a long time ago in the university. You learned how some of your colleagues were attempting to sell it for money on the campus and how some of them were trying to paten it under their name before it's completion. But none of them were successful, you may have been exiled forever, but you felt like it was a hard won victory. \"Hell none of them even knew what it did anyways.\" You say aloud.<br>\r\n<br>\r\nYou pressed the recorder beging it's job. \"All right, begining test. Session number 14, with new subject: Alyssa Dunie. Subject is 17 years of age, has both living parents, Zack Dunie and Marie Dunie. One older sister, Racheal Dunie age 24. I will assume the identity of one subject and act their life until I can make it back here. Unless I can make it back here in their body.\" You end it writing down the time, date, small notes, and ingest the white powder.<br>\r\n<br>\r\nIt's like being shocked with a high voltage of electricity, yet it's cold like diving into ice. Soon you feel warm, your hands are moving. And your eyes open. <br>\r\n<br>\r\n\"It worked.\" You say in your new feminine voice. Alyssa Dunie, was now being driven by you: the expirment was a success so far, but you had improved the formula and had to check if it worked as intended. As you rose from the borrowed bed and placed your new legs on the floor, you realized she was nude. It was captivating, her body. She was not a cheerleader, but she danced quite a bit in  her free time. She went to the city every chance she got it may be an long drive damn near two hours on all sides, but she loved going and dancing. <br>\r\n<br>\r\n\"Well, what can I say? I want to dance on Broadway.\" Alyssa says, with the exact same tone and singing voice she told her parents last night before bed. <br>\r\n<br>\r\n\"Increadble, simply increadble.\" You say now, realizing how much power your new formula had. You wanted to test it out, to see how far you could go.in her today. You had her memories and her body. Nobody would miss her. You begin her morning rituals of stretching before a run, her parents already gone for errands, and, the house absolutely empty. You could take her to the lab, she still has 2 hours before school.<br>\r\n<br>\r\n\"Hmmm.\"</span></div></div>",
            "created":1580306400,
            "id":2780020,
            "title":"Continue"
        },
        "12":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "...a bound male captive.",
                "...an unconscious woman.",
                "...a frightened child.",
                "...a suitcase.",
                "...a video camera."
            ],
            "content":"<div class=\"\"><div> <span>On a mountainous peak in the Italian Alps, there sat a small log and stone cabin, not much different than any other cabins and huts that dotted all the mountain ranges in the world. But on this day...this particular cabin was playing host to a meeting, a cladestine meeting of underworld figures. Criminals if you like. Inside the small building, a fire was crackling and several men were sat around a table, a small plastic bag containing a white substance on the table between them. \"This is the product I mentioned in our last discussion my friend, its called 'Dust' and it can be quite lethal if not used in moderation, and...by the right people\" one of the men, 52-year old Viktor explained.<br>\r\n<br>\r\nViktor was a Russian citizen by birth, but he had been raised in Romania. At the age of 22 he had fallen in with criminal elements and was introduced to the organized crime ring that operated in Bucharest. He spoke perfect English, with only a slight accent. Feared among Europe's other crime figures, Viktor was always dressed in the best, tailored suits that money could buy. He looked very much like the crime lord he was.<br>\r\n<br>\r\n\"Consider that a free sample\" Viktor smiled, pushing the bag in front of the two other men sat at the table.<br>\r\n<br>\r\n\"How do we know it does what you say it does?\" one of the men, Marcus asked, before glancing to his friend Michel.<br>\r\n<br>\r\nMarcus and Michel were both French nationals, the former was from Marseille and the latter had been born and raised in Toulon. And both had risen quickly through southern France's own criminal underworld, killing any who opposed them and bribing law enforcement officials with hundreds of thousands of Euros. Both in their early 30's, the men were eager to get their hands on the new drug called 'Dust'. Dressed in 'normal' winter clothes, they didn't look as 'dapper' as Viktor did.<br>\r\n<br>\r\n\"I anticipated this question my friends, and have arranged a little something\" Viktor smirked, clicking his fingers as he raise his hand. One of the two bodyguards stood behind Viktor then exited the cabin and went out to a big black 4x4 vehicle. He came back moments later with...<br>\r\n</span></div></div>",
            "created":1352264400,
            "id":1463130,
            "title":"Europe."
        },
        "123":{
            "choices":[
                "Move to one of the cops on Victor's trail.",
                "Once the men are gone, Victor has his own plan for the dust...",
                "One of the men has a question."
            ],
            "content":"<div class=\"\"><div> <span>The man returned within just a couple moments with an unwilling companion.  The burly bodyguard carried in his arms a boy, a young boy in fact.  He seemed to be about six years old.  He had shaggy dark hair that hung down in a fairly unkempt fashion so that it almost obstructed his vision.  He was only about 4 feet tall and was quite skinny, having likely come from one of the economically depressed regions among the mountains and probably not having had much in the way of proper nourishment.  The boy was not even a little bit happy about being where he was, as he was kicking and screaming at his large captor.<br>\r\n<br>\r\n <br>\r\n“Put me down you meanie!” the boy screamed, apparently not having learned how to swear effectively.  A heavy Italian accent was evident in his speech.  The boy struggled and kicked and even tried to bite a couple times, but the bodyguard simply slapped him roughly across the face, causing the little boy to recoil as his eyes welled up in tears.  The boy’s captor tossed him roughly to the ground and he slid across the dirty floor, quickly picking himself up and limping over into a corner where he felt safe, at least comparatively so.  <br>\r\n<br>\r\n<br>\r\n“What is your name, boy?” Victor demanded of him.  “Antonio!” the boy spat back in a tone calculated to threaten those around him.  Victor smiled and chuckled, “Well, Antonio,” he began, “would you like to see your mother?”  Antonio’s eyes softened, and his rage seemed to slacken.  He hadn’t seen his mother in a couple days…not since he was kidnapped to be used in this demonstration.  He feared he might never see her again, but now was his chance!  He quickly and vigorously shook his head, and Victor motioned to another of the guards, who calmly went into one of the back rooms, into a darkened room into which attendees at the meeting had been instructed not to go.<br>\r\n<br>\r\n<br>\r\nThere, the guard untied a dark figure from a chair and removed a gag inserted to keep the figure quiet.  The guard stepped back into the room first, pulling the groggy woman behind him.  Once to two were in the light, Antonio’s eyes went wide open!  So did those of everybody else in the room, as Antonio’s mother was, to put it mildly, worth looking at.  Her name was Renee, and she was about 35 years old.  She had raised Antonio by herself and worked as a maid to earn some meager cash to send her boy to school and buy him new clothes once in a while.  This had not dulled her beauty, as Renee was simply stunning.  She was about five feet six inches tall, and she had beautiful olive skin.  She had curly black hair pulled back in a pony tail, and she wore a beautiful red dress with a wonderful, plunging neckline that revealed a spectacular spread of cleavage.  Her breasts were gorgeous, and he dress didn’t go very low, so her legs and wide, motherly hips were on display for all to see. <br>\r\n<br>\r\nThis beautiful yet enraged mother was also about to become a mother again; she was roughly six months pregnant, and he wonderfully full and taut belly protruded mightily from her, and the added weight of carrying a child brought a wonderful jiggle from her belly, her hips, her ass, and her wonderful chest with every step.   <br>\r\n<br>\r\nRenee was ecstatic to see her son, and her eyes widened as she saw him and began to rush to him.  Suddenly, both bodyguards stepped in and restrained to the two, one holding each back from the other.  “So you see your boy is healthy, Renee,” Victor said, and Renee looked at him, rage flashing in her eyes.  “You bastard!” she said, “you hurt my boy, and I’ll kill you!  All this ‘cause I wouldn’t have sex with you!”<br>\r\n<br>\r\n<br>\r\nVictor merely chuckled.  “Renee, I won’t hurt your boy,” he declared good-naturedly as he slowly stood and walked over to the end of the table where his companions sat, the dust in tiny packets before them.  “May I?  Just a pinch?” he said, and the man to whom he spoke nodded in the affirmative.  Victor, sitting on the table, bent down and removed a tiny bit of the powder from its package…just enough to fit on the ends of a couple fingers. “Prepare yourselves gentlemen,” he said with a smile as he snorted the powder up his knows with a good strong sniff.  Victor seemed to become disoriented, and he shook his head as if dizzy for a couple seconds.  The other men were perplexed.  Suddenly, Victor grunted and fell roughly upon his back, his eyes closed and his body spread out roughly on the table.  He hit its surface with quite a thud.  <br>\r\n<br>\r\n<br>\r\nWorried murmurs spread among the few men there.  All were worried.  “What has happened?!”  one of the demanded, standing in confusion and alarm.  One of the body guards calmly motioned for the man to return to his seat.  “Your product killed the man; why would we want something like that?!”  The others seemed to nod in agreement.  Renee and Antonio looked on in confusion and a small degree of cautious optimism at what seemed to be the death of a captor.<br>\r\n<br>\r\n<br>\r\nThe room was still for a few seconds, and no one said a word.  Suddenly, Renee seemed to lose her balance for a minute.  She staggered momentarily as if she were about to faint, but then she recovered.  Seemingly disoriented, she put one hand on her bloated belly and another on her head as if she had a headache.  A strange smile crept across her lips.  <br>\r\n<br>\r\nRenee walked silently, her hips swinging and breasts bouncing, toward one of the bodyguards who earlier had protected the now-unconscious Victor.  Without hesitating, she grabbed the gun out of its holster on the bodyguard’s hip.  Renee then pointed the gun at Antonio, and the little boy’s eyes widened and filled with tears.  He slinked back into the corner as a look of horror filled his eyes and he put his arms up to protect himself.  “Ma….mama?  Mama what are you doing?”  <br>\r\n<br>\r\n<br>\r\nRenee smiled a little and said, “Mama isn’t home right now,” and then she pulled the trigger.  The shot rang out through the tiny house as the boy slumped lifelessly to the floor.  A look of cold nothingness filled Renee’s face as she dropped the gun to the floor without so much as a second thought about what had just happened.  <br>\r\n<br>\r\n<br>\r\nThe men assembled in the room gasped at the scene.  Renee, or her body at least, walked sexily up to the table and leaned over on it, smushing her breasts about as she looked around the room.  “If you haven’t figured it out by now, I’m Victor,” Renee’s body declared, “and this is the dust in action,” he declared as he ran his soft hands over the body he now wore.  “The great thing about the dust is that you can take more if you need to stay in control longer; I took only enough to borrow Renee here for a few short minutes, but don’t let that fool you!  Think of what you could do in just a few minutes….given the right body, you could do anything!” Victor said to the aghast men, Renee’s body jumping with the excitement of its occupant.  <br>\r\n<br>\r\n<br>\r\nTo drive home the point, Victor continued.  “Imagine what you could do inside the body of a political opponent….some uncooperative legislator who’s being a little too noble.  You could posses his own wife and dig up all the dirt you wanted inside her body.  Maybe a rival businessman is getting a little too close to your own business contacts, so you use the dust to hop into his trusted confidant and kill him when he never expects it.”  The men at the table gawk in amazement as they realize the utility of something like this.  <br>\r\n<br>\r\n<br>\r\n“What will they remember?” one of the men chimed in.  “Nothing,” Victor replied, “so Renee here will end up back in control of her body, and her son will be dead, and she’ll have to raise this one all alone,” he said as he motioned to her pregnant belly, “but of course I’ll tell her I used her body to kill him,” he declared with a slight chuckle.  <br>\r\n<br>\r\nVictor made his way into the back room accompanied by a couple bodyguards.  “Now if you pardon me gentlemen,” Victor began, “the dust will soon wear off, and Renee will be back in the driver’s seat, and I don’t want her body causing any trouble for lack of proper restraints,” he declared, and then he stopped for a moment.  He turned back to the onlookers, “and in case you’re wondering…..a woman’s body can be truly….intoxicating,” he said as he inhaled deeply and fondled his host’s breasts, “worth the cost of the dust by itself,” he said with a devious smile as he returned to the dark room.<br>\r\n<br>\r\n<br>\r\nA few minutes went by, the men’s heads spinning with all they could do with the dust.  They were suddenly interrupted as Victor’s unconscious body, spread out on the table before them, began to spasm and jerk and he drew air into his lungs again.  Victor sat up slowly and shook the cobwebs out of his head.  He looked around expectantly.  “Any questions?” he asked.       <br>\r\n</span></div></div>",
            "created":1352350800,
            "id":1463624,
            "title":"...a frightened child."
        },
        "1233":{
            "choices":[
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Marcus and Michel looked at each other before they broke to laughter, while in the background, Renee's sobs could be heard faintly. ''What's the matter darling?'', Viktor cooed, mocking the dishevelled woman, kneeling beside her son's dead body.<br>\r\n<br>\r\n''Viktor'', Michel called out.''You mind if we try these out?''<br>\r\n<br>\r\nViktor was pleased to see that the two men had willingly accepted his offer. For a moment there, he was thinking about disposing them in the case that they choose not to believe. There're countless others anyway that would be interested in his drug. <br>\r\n<br>\r\n''I don't bring her here for nothing!'', Viktor nodded. ''Go on. Careful you might just die though.'', he grinned widely, as though taunting the French to chicken out.<br>\r\n<br>\r\nMichel hesitated for a second, but Marcus glowered at him. The Russian clearly mocked them. Michel sighed, he did the same thing Viktor did and the same strange smile appeared on Renee's face. Renee stood up, then, wiping the tears from her face hastily, she began to laugh.<br>\r\n<br>\r\n''Marcus! It worked!'', she yelled on top of her lungs.<br>\r\n<br>\r\n''Oh? It gets better.'', Viktor smiled. He grabbed a gun from a bodyguard and shot Michel's unconscious body twice. ''I hope that didn't cause an avalanche.'', while Marcus looked aghast at the two neat holes that went through his countryman's head and chest, ''What the fuck did you do?!'', Marcus jumped towards Viktor, only to get swatted back by the two bodyguards.<br>\r\n<br>\r\n''What?!'', Renee ran over to inspect her former body to see it riddled with holes. <br>\r\n<br>\r\nViktor went to explain more information about the drug. ''When you're inhabiting another body, and your real body dies, the body you're inhabiting becomes your new permanent body.'', he continued while Marcus and Renee tried to get their head around the fact. ''My friends, I'm afraid that the drug is not and never will be perfect. You see, most people will die when they use the drug for the first time and there are people immune to possession as well as a certain type of drug that can make people immune for a set of time.'', he stopped for a while, ''you need to be in close proximity to the person you want to possess.''<br>\r\n<br>\r\n''So you mean, I'm stuck in this pregnant body forever?!'', Renee exclaimed. <br>\r\n<br>\r\n''Nope. You can use 'Dust' again.'', Viktor eyed the packets. ''But you'll have fifty-fifty chance of dying again.'', he sneered at the last comment. ''In any case, it's better for you to be inside that delicious body and without the pesky agents on your back. Who'd suspect that a soon to be mum is a criminal that controls some parts of southern France?''<br>\r\n<br>\r\nMarcus and Renee talked in French about various things, while Viktor waited, he was happy enough to wait for the conversation to end. The two bodyguards carelessly pick up Antonio's and Michel's inanimate bodies and tossed them inside the room where Renee was kept earlier.<br>\r\n<br>\r\n''What do you want from us?'', Marcus asked plainly. He knew that Viktor was not looking for a financial compensation.<br>\r\n<br>\r\n''Now you're talking.''<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nA Jeep made their way down from the mountain. Viktor, the dapper-looking Russian. Marcus, the crew-cutted Frenchman. Renee, the sexy voluptuous Italian woman, the baby bump conveniently hidden under 'her' thick clothing. And two thuggish bodyguards on the front seat. Something that resembled the cast of an overly stereotypical Hollywood movie about mafia. ''I feel like the Godfather.'', Viktor mused.<br>\r\n<br>\r\nThe Jeep drove through the dead of the night, snaking its way on the streets of the town of Bolzano. It went past the still bustling town centre into a more quiet rural area, headlights now turned on, the Jeep picked up the speed. Marcus and Renee dared not to sleep a wink, while beside them, Viktor felt contented enough to fall into a deep slumber. Their destination was a house where Renee and Antonio used to live in.<br>\r\n<br>\r\n''I hope you don't forget our deal.'', Viktor beamed from inside the car. Marcus and Renee stood outside an unlit house, in a hand, a set of keys and a kilogram of 'Dust' in the other. ''And man up will you.'', Viktor looked at Marcus.''Try it, I'm sure you'll love it.'', and with that the Jeep drove away.<br>\r\n<br>\r\nThe new Renee scanned the inside of the house. It was warm and comforting, typical of a family house. She scanned the surrounding and saw numerous pictures of Renee - the old Renee- and Antonio, spanning several years. The absence of a man in any of them drew an obvious conclusion. Renee swore as she felt the baby inside her although she was aroused by the whole thing.<br>\r\n<br>\r\nThe next morning...<br>\r\n</span></div></div>",
            "created":1352350800,
            "id":1463897,
            "title":"One of the men has a question."
        },
        "12331":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Staying with Michel/Renee.",
                "Marcus' antics."
            ],
            "content":"<div class=\"\"><div> <span>\"I can't believe this shit!\" 'Renee' exclaimed in annoyance as she cupped her swollen breasts in her hands. \"This wasn't part of our plan Marcus, I told you we shouldn't deal with a fucking Russian!\" she then cursed, almost grinding her teeth in anger. \"And now I'm stuck in this body!\" she sighed.<br>\r\n<br>\r\n\"You can use the Dust again\" Marcus suggested, as he watched the pregnant woman in front of him park her wide, feminine ass on the couch. It was hard to believe that inside that voluptuous body was his friend Michel.<br>\r\n<br>\r\n\"Yeah, and I'd probably end up dying this time. No thanks!\" 'Renee' grumbled, feigning a smirk as she folded her arms under her boobs.<br>\r\n<br>\r\n\"Look,\" Marcus said as he sat down in a chair, \"we got off lightly, you stuck in a woman's body and us having to allow that Russian asshole to operate in our country whenever he wants\" he explained to Michel/Renee.<br>\r\n<br>\r\n\"Easy for you to say, you won't be popping a kid out in several months\" the grouchy woman responded.<br>\r\n<br>\r\nNot knowing what else to say, Marcus fell quiet, and instead just decided to watch 'Renee's' movements. He found himself turned on as she prodded her breasts and ran her feminine hands over her tummy. Then her hands found their way below her 'bump' and began to caress her vagina through her red dress. But as soon as 'Renee' saw Marcus leering at her, she abruptly stopped her 'exploration'. \"Don't stop on my account!\" Marcus smirked.<br>\r\n<br>\r\n\"Fuck you!\" 'Renee' snapped angrily.<br>\r\n<br>\r\n\"Yes please!\" Marcus nodded, eliciting an annoyed groan from his criminal partner.<br>\r\n<br>\r\n'Renee' then managed to get to her feet and glared at Marcus sat content in his chair, with an obvious 'bulge' in his pants. \"I'm going to the bathroom...alone. You can use the Dust if you like, but I'm not using it again, at least not yet\" she told him.<br>\r\n<br>\r\nAs his partner disappeared into the bathroom, Marcus picked up a bag of Dust...and smiled.<br>\r\n</span></div></div>",
            "created":1352437200,
            "id":1464327,
            "title":"Reader's Choice"
        },
        "123312":{
            "choices":[
                "Chickens out",
                "Taking over a local"
            ],
            "content":"<div class=\"\"><div> <span>Being honest with himself, Marcus was a little intimidated at the prospect of using 'Dust'. His thought went back to Viktor's description of a horrible and gruesome death if his body 'rejects' the drug. He put the bag of Dust back where it was. He had a perfectly good reasoning to not use it. Someone needs to keep an eye on their French operations and in his current shape, pun intended, Michel was nowhere close to be able to fulfill that. No one would recognize him. <br>\r\n<br>\r\nSighing, Marcus walked to Renee's bedroom, on top of a lamp desk, he found a newly minted debit card in the name of Renee Di Francescantonio, just like Viktor said. If what he said was true, then this will contain exactly one million Euro as his gesture of goodwill. Marcus laughed, there was no way his operations in France worth only that much, but on the other hand, it was a good deal for them. Viktor's henchmen could've taken over their bodies or they could've been shot like Antonio, which then will leave Viktor free to take their operations anyway. Marcus smirked, pocketing the card, he wondered how lucky they might be. They get to keep their French operations, Michel in his new body will give them a lot of cover to keep the operations running and they now own supplies of Dust that allow them to take over almost anyone they wanted. Marcus thought, if only he would be brave enough to use it.<br>\r\n<br>\r\n''So.. how is it?'', Marcus smirked playfully, just as Renee walked out from the bathroom. She shot him a 'fuck off' look.<br>\r\n<br>\r\n''You might want to keep those female hormones in check.'', Marcus tossed her the debit card. ''Remember the PIN?'', Renee just nodded. ''Good. I'm going out to get some air.''<br>\r\n<br>\r\nSlamming the door shut behind him, habits forced Marcus to look around. Only when he realized that the only person in proximity was a grandma riding a motorscooter, he laughed nervously. He could felt the two sample packets of Dust settling on his pocket, squashed flat. He got in his hand, a map, conveniently purchased from a local shop, along with a can of Root Beer. ''Thank God for the Euro.'', he muttered in French when the cashier processed his payment.<br>\r\n<br>\r\nAn hour and a half later, he finally made his way to the city center, glancing around at the locals, he felt tempted to use the 'Dust'...<br>\r\n</span></div></div>",
            "created":1352437200,
            "id":1464406,
            "title":"Marcus' antics."
        },
        "1233121":{
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Marcus thought about his chances. 50-50 was not good enough for him. He would never admit it, but he was scared at the prospect of dying when using drugs. Although his 'job' did involve a high risk, but he always manage the risk and he also was a strategic man. Using a drug that is based on luck was definitely not to his liking. Beside, Michel's already in that pregnant body. Biting into his croissant, Marcus smirked at the thought of Michel carrying a baby inside him. Maybe he need to accompany the labour as well.<br>\r\n<br>\r\nMeanwhile, back in the house, Renee felt ill. Michel inside was not distracted anymore by his new body, but grew more and more annoyed by the sickness. Pregnancy sickness, he read on one of the book randomly lying around. Carrying the baby and feeling the bump bounced definitely made him even more sick. That bastard Marcus, where could he be. Renee decided to retire on the couch, breath wheezing as her bumps heaved up and down with each breath taken. Her eyes went to the sack of 'Dust' on the table. Any body would be better than this. She thought again on the prospect of giving birth in three months time. Dying seemed to be a better prospect than that.<br>\r\n<br>\r\n</span></div></div>",
            "created":1352696400,
            "id":1466503,
            "title":"Chickens out"
        },
        "12331211":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Marcus goes for it.",
                "Renee finds him first."
            ],
            "content":"<div class=\"\"><div> <span>But suddenly, the humanity in Michel, which had been absent throughout most of his adult life, reared its head. \"I can't steal someone else's body!\" 'Renee' mumbled to herself, even as she rubbed her delicate tummy bump. Such evil action is what had got 'her' stuck in this body in the first place. Perhaps it was the mothering instinct inside her that made her a more caring person that the man she used to be. As uncomfortable as she felt being pregnant...she felt it was now her problem to deal with. It wasn't as though she was the first woman who disliked being pregnant after all.<br>\r\n<br>\r\nInstead she got to her feet and grabbed her coat, intent on going out and finding Marcus, who was now sat outside a small cafe, watching the local residents walk by him, oblivious to who he actually was...or what he had at his disposal. He had to admire nearly every young Italian girl who walked past, they all seemed to have curves and ample breasts, and Marcus felt his dick straining against his underwear as he watched them all.<br>\r\n<br>\r\nNeedless to say, Marcus felt like a kid in a candy store. He was always wanting to get into a girl's panties, and now he could...literally. But to do so he would have to use the Dust, which could be lethal to him, and he was still wary about using it. And of course he had to find a place to hide so his own body wouldn't be discovered while he out having his 'joyride'.<br>\r\n<br>\r\nFortunately, the cafe he was at had a bathroom with several stalls with doors that locked.<br>\r\n<br>\r\nHe was sorely tempted to give 'Dust' a go himself.<br>\r\n</span></div></div>",
            "created":1352782800,
            "id":1466860,
            "title":"Reader's Choice"
        },
        "123312112":{
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>''You!'', Renee exclaimed as she saw Marcus ogling the people around. She quickly walked across to where he sat, feeling her tummy jiggle with each step she took. By the time, she reached her friend, she was puffing.<br>\r\n<br>\r\n''Hey there.'', Marcus smirked casually, eyeing the woman in the red dress. ''Decided to work out?''<br>\r\n<br>\r\nRenee just ignored the comment and sat down across of him. ''Una birra.'', she said to a waitress. ''Va bene.'', came the reply.<br>\r\n<br>\r\n''I've decided...'', Renee paused as if she wanted to believe what she was saying herself. ''To keep the baby, so I'm out.''<br>\r\n<br>\r\n''What?!'', Marcus exclaimed. A few onlooker turned their eyes. ''What about our operations?'', he said through gritted teeth. ''Our partnership!''<br>\r\n<br>\r\nTheir argument was briefly interrupted by a pint of beer brought by the waitress. ''Grazie.'', Renee spoke without even a glance at the waitress.<br>\r\n<br>\r\n''It's dead.'', Renee stated flatly. ''Just as Michel's dead in the mountain cabin.''<br>\r\n<br>\r\n''You're crazy! Your woman hormones must be messing with your head!''<br>\r\n<br>\r\nThere was a still silence. Renee looked at her baby bump, while Marcus stared at his former partner in crime. Renee chugged down the beer in seconds.<br>\r\n<br>\r\n''You can take my share.'', Renee referred as the share of their French profit. She still had a million Euro in a deposit anyway. She figured that if she put that money in a saving account, she and the baby would be able to live in relative ease. ''And you can have this.'', she put her cloth shopping bag on the table, inside it was the huge package of Dust.<br>\r\n<br>\r\n''Fine.'', Marcus said in exasperation. ''But if you decide to come to your senses, you know where I am.'', he swiped the cloth bag off the table. Before he stormed off, he took out the two sample packets of Dust, flattened from being in his pocket for hours. <br>\r\n<br>\r\nRenee sighed as she saw Marcus's figure vanish into a bend. Having paid her bill, she rubbed her tummy, before getting up and walk back to the bus stop. Her hands grasping the two small packets of Dust tightly.<br>\r\n</span></div></div>",
            "created":1352782800,
            "id":1467018,
            "title":"Renee finds him first."
        },
        "1233121121":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "His plan progresses.",
                "Second thoughts."
            ],
            "content":"<div class=\"\"><div> <span>Marcus was angry as he made his way back to his rented apartment, he couldn't believe his partner had abandoned him, willing to remain in a pregnant woman's body and give birth rather than continue their operations together. He assumed the drug had messed with his head in some way, or maybe the new Renee felt bad for what had happened to her son up in the cabin. Once indoors, Marcus threw his bag down and slumped on the couch, slowing running his hands down his face as he let out a long, deep sigh. He then shook his head in annoyance. He was on his own now.<br>\r\n<br>\r\nHe glanced at the shopping bag and at the package of Dust that had partly spilled out. \"Fuck!\" he grumbled, getting to his feet and going over to the fridge to retrieve a beer to drink. He downed it in three gulps then tossed the bottle to one side, smashing it.<br>\r\n<br>\r\nA few minutes later, while he was pondering his next move, there was a knock on the door, and he hesitated before answering it. He was surprised to see one of his neighbors standing there, 21-year old Francesca Firenze, a University student. \"Is everything alright? I heard a smashing sound!\" the concerned girl mumbled. Marcus took a moment to admire the girl's appearance. She was slender, had small, B-cup breasts and her long, straight black hair framed her pretty face. She stood 5' 5\" tall and was wearing a pink t-shirt, a pair of jeans and sensible beige shoes with laces.<br>\r\n<br>\r\n\"Ah... everything's fine, I just... dropped something\" Marcus responded. \"Thanks for checking up on me\" he then smiled.<br>\r\n<br>\r\n\"Oh, no worries. That's what neighbors are for right?\" Francesca smiled warmly. \"Okay, I'm sorry for interrupting you, I'll leave you in peace now\" she said, hardly a hint of an Italian accent present due to her being educated in England up until six months ago.<br>\r\n<br>\r\n\"Er... you can... you know... come in if you want, for a coffee?\" Marcus offerered, as he started wondering what it would feel like in the girl's skin.<br>\r\n<br>\r\n\"Oh, okay... yeah thanks\" Francesca nodded, stepping gingerly inside, Marcus closing the door behind her. His heart rate began increasing as he picked up the shopping bag and put it in a closet. But before leaving the bag there, he got a small packet of Dust out and pocketed it.<br>\r\n<br>\r\nFrancesca took a seat on the couch while Marcus then fixed them some coffee.<br>\r\n</span></div></div>",
            "created":1381726800,
            "id":1678943,
            "title":"Reader's Choice"
        },
        "12331211211":{
            "author_id":"uncynical",
            "author_name":"Uncynical",
            "choices":[
                "Francesca, the 21 year old college student",
                "The hot model in her mid-30's"
            ],
            "content":"<div class=\"\"><div> <span>\"This is great!\" she says, while taking another sip of the coffee you prepared. \"No problem\" you reply, while you try to get on her good side. You stare at her face and think to yourself, \"I won't be regretting this!\"<br>\r\n<br>\r\nShe finishes the cup and prepares to return to her apartment, but before she does, she gives you a kiss on the cheek. As this happens, your member pitches a tent in your pants and you lie down on your couch, as if you're ready to fall asleep on it.<br>\r\n<br>\r\nYou pull out the small packet of Dust from your pocket. You take a straw and put it in the bag and begin to sniff from the straw. \"Here goes nothing!\" you think, and sniff the whole packet.<br>\r\n<br>\r\nYou feel higher than the Empire State building and pass out. You find yourself hovering above your unconscious body. \"It worked!\" You thought, while you flew around your living room. You headed to Francesca's room across from yours, but before you went into your room, someone caught the corner of your eye. An Italian woman was walking down the hall. She looked in her mid 30's, and looked the supermodel type. She had blonde hair and a nice ass. She looked about 6', due to her high heels, so she was probably 5'7. Her breasts were probably a 36D, which complimented her cute face. \"Maybe the college girl wasn't fit for me\" you think to yourself. You begin to have second thoughts.<br>\r\n<br>\r\nDo you possess...</span></div></div>",
            "created":1389675600,
            "id":1727694,
            "title":"It worked!"
        },
        "1233121122":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "she was horny",
                "Continue with mishel's(renee's) thoughts"
            ],
            "content":"<div class=\"\"><div> <span>Renee decided to head back to the house with the small packets of dust with her. <br>\r\n<br>\r\nOn her way back she started thinking , why had i just made that decision, why would i give up everyting i worked for my entire life. Michel didnt knoow why but for a while now he had been thinking about the baby and antonio she had killed lots of people her whole life while still in her own body and never had she felt remorse in any of those deeds, all those assholes were in her way and they needed to die, that was how she believed it and but now she feels  different , infact everything feels different , oooohhhhh what the hell is happening to my mind she thought<br>\r\n<br>\r\nJust then the bus reached her stop and she got off . she walked back in to the house and locked the door behind her, she went up to the master bedroom and took off her coat . she sat on the bed opposite to which was a full size mirror, she looked at it to see renee's gorgeous and vulptous form looking back at her <br>\r\n<br>\r\nThis....... this is me now, this is my face, mi...    michel , my old body my old life all of it died in that cabin, This....  all of this is mine now she said as she cupped her breasts through her dress, This is my body , the one i get to to live in for the rest of my life.    This face she said as she rubbed her cheeks , these boobs she said as she cupped her breast and this pussy and ass she said as she stood up , i am a whole woman now , i am renee and this she said as she put her hands on her bulging belly , for some reason all of a sudden she felt a wave of emotions swept over her as she started thinking of her pregnant belly aand her baby<br>\r\n<br>\r\nWait a minute , my baby . she paused. This wasn't my baby. This was renee's she was the one got fucked by some guy and got her pussy creamed . Michel didnt even know the baby's father but for some reason she felt a sense of care for this helpless life growing inside of her. This baby was now her's also it was her blood she thought , Damn michel didnt know why he was thinking like this just because he was in a pregnant vulptous woman's body but he couldnt help it he was tempted to feel this way . He took a look at the mirror and saw renee looking back , i..... i guess this is who i am now and this is the new me thinking he thought <br>\r\n<br>\r\nrenee's looked on at the mirror taking in the image of the beautiful woman looking back at her, she was drinking in every aspect of her new image, despitee the sickness and the uncomfortability of being in a pregnant woman's body she started feeling very much turned on by the fact that she was a beautiful woman <br>\r\n<br>\r\nI am such a gorgeous woman she thought, men dream of having there way with women like me she thought even i was stunned and intoxicated by renee's beauty and now i get to have all this for my self she thought, All this she said as she slid her dress down and looked at the image of renee in her undergarments <br>\r\n<br>\r\nall though she took a peek while in the bathroom earlier she never really got fully acquainted with her new body .renee was still wearing the clothes from the cabin and this was the first time he properly got to take them off . she removed her bra and panties and looked on at the naked woman she has now become . michel was stunned by how beautiful renee's body was her pregnance only made her all the more eye candy to people who see her <br>\r\n<br>\r\ni.....i.... this is me now she said as she pinched one of her nipples. she felt a jolt of electricity run through, she was very much intoxicated by the beauty she had become, her thoughts went drifting back to the cabin and thats when she thought about antonio, for some reason she felt reemorse and a sudden depression took hold of her as soon as she thought of the little boy's face, she didnt know why but it just all of a sudden came upon her , she felt rage at victor  that bastard had killed poor antonio she thought<br>\r\n<br>\r\nwait, why was she angry, mishel thought , antonio wasnt her son he was renee's son he thought , Guess it must be bacause an innocent little boy was shot and he felt ad for the child he thought <br>\r\n<br>\r\nbut little did mishel knew</span></div></div>",
            "created":1427000400,
            "id":1951817,
            "title":"Reader's Choice"
        },
        "12331211222":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "renee's influence",
                "mishel's thoughts"
            ],
            "content":"<div class=\"\"><div> <span>ok here are two ways this can go<br>\r\n<br>\r\nrenee's mind and soul is merging with mishel's and this is what's bringing about this change in mishel<br>\r\n<br>\r\nor<br>\r\n<br>\r\nmishel's mind is free and these thoughts are his ow</span></div></div>",
            "created":1427000400,
            "id":1951818,
            "title":"Continue with mishel's(renee's) thoughts"
        },
        "123312112221":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "continue in this story line",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Mishel rationalised that it was the hormones and instincts of a woman's body that was impacting him in this way <br>\r\n<br>\r\nBut little did mishel knew that it was much more than that , what mishel and victor didnt knew was the fact that once a user of dust become's traapped in another body, certain changes take place that no one knew, a certain merger of the two souls and personalities take place to come up with a newly molded individual personaliy that will be a combination of mishel and renee only with mishel in control but not being the same person he used to be <br>\r\n<br>\r\nSince mishel had now become a permanent occupant of renee's body and renee's own mind and soul was still inside that body , the body was taking steps to merge renee in too mishel as one soul and mind annd the changes mishel was experiencing was part of it <br>\r\n<br>\r\nmishel's motherly instincts , her love of her unborn child and to antonio was now being felt by mishel but he couldnt realise it and was beccoming a part of him, renee's desire to build a happy life for her son antonio and her unborn baby free of any hardships or trouble was what forced michel to decide to leave the business and live a happy life with her baby using the money mishel got, renee's love of her dead son antonio was also taking an effect on mishel's mind. <br>\r\n<br>\r\nMishel as renee was starting to feel sad and she really wished antonio wasnnt killed , well she had renee's body and the required money she could have done something for him considering now shee was in his mother's body. mishel thought . maybe what happened was for the best maybe now with out her crime filled background now mishel as renee can live a happy life she thought but the thought oof aantonio's dead body brought tears in to her eyes and she started crryiiig uncontrollably , mishel thought it was the female hormones but in reality it was the old renee's love of her child that was becoming part of the new renee . she put her hand on her belly and started lovingly patting her stomach it was the love for her unborn child and with no third person to see and figure out the difference mishel was well on her way to becoming the new renee<br>\r\n<br>\r\nMishel's own characterstics were there as well but they will be transformed to match the female perspective, Mishel as a man was always tempted to have his way with women, he looked at women as a predator looking at its prey, the thought he had upon seeing a woman was how good she will be in bed with him, woman were objects to satisfy men's sexual needs and they are built for that purpose according to him. <br>\r\n<br>\r\nbut now that he was renee with her womanhood and mind becoming a part of him, soon he urge to fuk women will be transformed in to an urge to be fucked by men, he will want to feel needed and loved by men, renee's own sexual desires will infuence him as well, he will become the prey in need of a strong man, his womanhood will transform him in to a renee with an high level of sexual needs while still trying to maintain the needs and principles of both mishel and renee</span></div></div>",
            "created":1427000400,
            "id":1951835,
            "title":"renee's influence"
        },
        "1233121122211":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "give in",
                "resist"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>instinctively with out even noticing it , renee's left hand had found its way to her nether regions and was already at work. Mishel felt his new body's hormones starting to kick in , <br>\r\n<br>\r\ndoes he</span></div></span></div>",
            "created":1476075600,
            "id":2221540,
            "title":"continue in this story line"
        },
        "1233122":{
            "author_id":"drake010",
            "author_name":"penpal",
            "choices":[
                "Reader's Choice",
                "Reader's  Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marcus knew that if he was to use the drug in public he first needed to place his body in a position safe enough but before that he needed to scope out potential candidates<br>\r\n<br>\r\n<br>\r\nso who will i switch with</span></div></span></div>",
            "created":1383022800,
            "id":1685893,
            "title":"Taking over a local"
        },
        "13":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "The Second Purge in Brazil.",
                "Anarchy in Venezuela.",
                "'Game of Dust' in Mexico.",
                "Honduras Joker.",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>In South and Central America. The 'Dust' is introduced by the drug dealer in Mexico and Brazil who have this stuff from USA. And then, It spreading all of the continent.<br>\r\n<br>\r\nThe most dangerous 'Dust invasion' countries is Brazil. 'The Second Purge' is begin. After 'The Purge Brazil' events in February. Most of the drug dealer turn into 'Dust dealer' and introduced 'Dust' to other criminal. And then, All of civilian is suspect to be criminal by government.<br>\r\n<br>\r\nIn Venezuela. 'Dust' is coming by the black market merchant. Because of the Shortage in 2010, Some civilian turn into protester and thief. 'Dust' is the chance of blogger and criminal to control famous people or celebrities for support the protest, stole something or turn beauty pageant into the strip club or prostitute.<br>\r\n<br>\r\n'Game of Dust' is coming in Mexico. Because Mexico is the first 'Dust invasion' countries. All of police and criminal will used the 'Dust' for arrested and destroy each other. And nightmare begin.<br>\r\n<br>\r\nMeanwhile in Honduras, The former Mayan country is the latest 'Dust invasion'  countries. After political crisis in 2nd December, The 'Dust' is coming by some criminal who want to extended the time of anarchy in Honduras.<br>\r\n<br>\r\nAnd the other country. Dust is invasion too.</span></div></div>",
            "created":1512953700,
            "id":2426471,
            "title":"South/Central America."
        },
        "14":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "The Baghdad suburbs.",
                "Across the border, in Jordan.",
                "A clandestine meeting in Beirut.",
                "Tehran is listening in.",
                "A secret meeting in Israel."
            ],
            "content":"<div class=\"\"><div> <span>It was Thursday afternoon on another scorching Summer day in the Middle East, and a heavily armored convoy had just entered Baghdad's 'Green Zone'. After passing through the main checkpoint, which was heavily fortified against VBIEDs, the convoy of two armored cars and three black, bullet-resistant 4x4s pulled up outside the French embassy building. After a few seconds, several European men stepped out of the 4x4s brandishing FAMAS assault rifles. All the men who exited the car were 'casually' dressed, wearing light body armor, except for a man of short stature dressed in a beige suit, he was Denys Gauer, the French ambassador.<br>\r\n<br>\r\n<i>\"Vous procurer un peu de repos!\"</i> the ambassador told his men in French, telling them to get some rest. He then walked into the building, followed by his personal assistant Leila<br>\r\nBlanchard, a 34-year old French national who was half Arab (on her mother's side).<br>\r\n<br>\r\nSuddenly...one of the French Marines up in a watchtower began to spasm, but nobody noticed him. And the spasming stopped as quickly as it had begun and the Marine held his hands up in front of him for a moment...before peering down into the embassy grounds. \"ALLAH-U-AKBAR!\" the Marine suddenly shouted at the top of his lungs...as he aimed his assault rifle at Gauer's bodyguards and opened fire, hitting several of them. The bodyguards started to return fire...and after 30 seconds the assailant took a bullet to the head, slumping down dead in the tower.<br>\r\n<br>\r\nBy this time, pandamonium had set in, and other French Marines were rushing to help the wounded guards. Just to the right of the wounded men, another French serviceman suddenly stopped in his tracks and backstepped, holding his head. Then he too started shooting at his fellow countrymen, killing a number at point blank range before he was also gunned down by other frightened and confused soldiers. <br>\r\n<br>\r\nA minute then passed without incident, and a couple of other embassy guards began to emerge from the building to help the casualties. The Iraqi soldiers stationed outside the compound were also allowed into the grounds to provide support, as the French soldiers inside the embassy secured the entrance and the ambassador. Just when it seemed the situation was being brought under control, one of the Iraqi soldiers pulled the pins on two grenades...held them to his chest and charged into the midst of the French service personnel. When the smoke had cleared, body parts and blood were everywhere, and several Iraqi soldiers had also become casualties.<br>\r\n<br>\r\nBy now bewildered, the raw Iraqi recruits were looking around, trying to make sense of what had happened. A half hour passed without any further incident, and more Iraqi soldiers soon arrived on the scene to secure the outside of the embassy. Inside the building, a distraught and worried Gauer was sat with a glass of whiskey. He had been told of how many casualties there were, and he was thinking what he could possibly tell to his superiors in Paris.<br>\r\n<br>\r\n<i>\"Do you think you're safe infidel? None of you are safe from us now!\"</i> his red-headed assistant Leila suddenly said in Arabic, as she approached him behind. Gauer looked up...just in time to see a knife plunging downwards. The glass of spirits dropped from Gauer's hand as he jerked a little, the paper knife buried up to its handle in the top of his skull. As the ambassador silently fell dead, Leila's face contorted into a wicked smile. \"Allah-u-akbar!\" she muttered, her eyes then rolled up into the back of her head for a moment before returning back to normal. Then suddenly...Leila looked down and let out an earsplitting scream when she saw the body in front of her and the blood on her hands.<br>\r\n<br>\r\n                                                                                                                        ****<br>\r\n<br>\r\n<i>\"Terror and bloodshed again returned to Baghdad today, when several gunmen, including at least two enlisted members of the French military, opened fire outside the French embassy. According to reports, 14 French nationals, including 8 soldiers, were killed in the brazen attack, and Paris has confirmed that their ambassador to Iraq, Denys Gauer is among the fatalities. At least two Iraqi soldiers were also reported killed and several wounded. The Iraqi President has sent his condolences to the people of France and has promised to cooperate fully with any investigation. CNN sources have already found out that one arrest has been made, and that person is believed to be the ambassador's personal assistant....</i><br>\r\n<br>\r\n<i>This is Lara Logan, CNN, Bagdad..</i>.<br>\r\n<br>\r\n                                                                                                                        ****<br>\r\n<br>\r\nMeanwhile, in one of the suburbs of the Iraqi capital, a lone individual was watching the breaking news...and smiling. He was known simply as Abu Sida, a mid-level operative of an active militant group, the <i>Al-Faruq Brigades</i>. Abu Sida seemed a little dazed, and beside him on a small table in his little apartment...was en empty plastic bag with traces of a certain drug inside.<br>\r\n<br>\r\nAnd 547 miles away in the Israeli capital Jerusalem, others eyes were also watching the news. Several veteran members of Mossad were those watching the TV, and discussing what had happened in Iraq. \"You think they used it?\" Isaac asked his colleagues, who just looked at him and remained silent. Isaac then just nodded and his eyes drifted to the television once more. The Israelis knew how the attack had taken place, and just why two ordinary French soldiers, from quiet towns of no consequence...had suddenly turned into terrorists and opened fire on their own compatriots.<br>\r\n<br>\r\nAll they could do for the moment was wait until the next incident, which they knew would happen soon.<br>\r\n</span></div></div>",
            "created":1343019600,
            "id":1386799,
            "title":"The Middle East."
        },
        "143":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Back in Beirut.",
                "On the Syrian/Israeli border.",
                "Meanwhile, in Africa."
            ],
            "content":"<div class=\"\"><div> <span>In an apartment building in Beirut's southern Dahieh suburb, there was a meeting taking place of two mid-level commanders within the Hezbollah terrorist group. Known only by their first names, Zhulfiqar and Ali, they were well known to the intelligence communities in Israel and the U.S. \"This is all I could get hold of.\" Ali said in Arabic, as he placed three small plastic bags on the table in front of him, causing Zhulfiqar to look down, \"This should be enough for now.\" he added.<br>\r\n<br>\r\n\"Good work!\" Zhulfiqar muttered, as he picked up one of the bags and inspected the 'product' inside. \"We need to get this down to Udaysah.\" he said, looking at Ali, referring to a small town in the south of Lebanon, close to the Israeli border.<br>\r\n<br>\r\n\"I've got men outside waiting to head south.\" Ali responded.<br>\r\n<br>\r\n\"Good! Time to make the Zionists bleed, insha'Allah!\" Zhulfiqar nodded.<br>\r\n<br>\r\nGathering up the bags of 'Dust' again, Ali slipped them into his coat and proceeded to head out of the door, followed by his 'friend'. The two of them made their way outside the apartment building and into the deserted street, where a pick-up truck with four heavily armed terrorists was waiting. Zhulfiqar glanced at his watch, it was 3:20am, he then got into the vehicle alongside Ali and their journey south commenced.<br>\r\n<br>\r\nWhen the vehicle was just past the town of Kfar Faqud, a well-placed bullet suddenly smashed through the windshield of the car and killed the terrorist who was driving. As the lifeless body slumped over the steering wheel, the truck veered off the road and into a ditch. The two terrorists in the back of the pick-up truck had little time to react, and they too were suddenly dropped by precise shots from suppressed weapons. Ali frantically reached for the bags in his pocket as Zhulfiqar drew his pistol and exited the truck, taking cover in the ditch along with the gunman who had been in the passenger seat of the truck.<br>\r\n<br>\r\nAli was in the process of opening one of the bags containing the powerful drug when another bullet came in through his window and blew away the back of his skull. Ali's body slumped in the back seat of the vehicle, as Zhulfiqar wondered what he could possibly do to get out of this situation. As it turned out...he could do nothing. Two masked figures dressed in black combat fatigues suddenly appeared from behind the crashed truck and both Zhulfiqar and the last gunman died in a hail of bullets.<br>\r\n<br>\r\nAs six more masked figures approached, guns at the ready, the two already at the truck signaled the 'all clear'. After a quick search of the truck, the three bags of Dust were retrieved and the men immediately left the scene before anyone arrived. Once a safe distance away, the men took cover and one of them broke radio silence. \"Jericho, this is Solomon 2-9, mission accomplished. Suspects liquidated and we have the merchandise\" the man said in Hebrew.<br>\r\n<br>\r\n<i>\"Solomon 2-9, this is Jericho, message received. Proceed to extract point for pick up.\"</i> came the reply over the radio.<br>\r\n<br>\r\n\"Confirmed Jericho!\" the black-clad, lead figure said, before turning his radio off again.<br>\r\n<br>\r\nThe eight men, members of Israel's elite <i>Sayeret Matkal</i> unit, then started off towards the rendezvous point, two miles northwest of the town of Ayn Wzayn.  And in Jerusalem, news of the mission's success was greeted with relief rather than jubilation. One...or perhaps several atrocities had been thwarted with the seizure of this small amount of 'Dust', but the Israelis knew that they could not let their guard down for a minute. They were already planning their next pre-emptive strike.<br>\r\n<br>\r\nThe Sayeret Matkal unit that had infiltrated deep inside Lebanon returned back their base in Haifa following its safe extract.<br>\r\n</span></div></div>",
            "created":1343192400,
            "id":1388841,
            "title":"A clandestine meeting in Beirut."
        },
        "145":{
            "choices":[
                "Abu's arrival in France",
                "Isaac made his move",
                "In the Al-Faruq Brigade"
            ],
            "content":"<div class=\"\"><div> <span>Somewhere in a bunker known only by Isaac and a dozen other operatives from Mossad, things were getting busy as a classified meeting was being conducted.<br>\r\n<br>\r\n''It's definitely 'Dust'.'', Isaac said as a matter of factly to the other members as soon as they were ready, some of them part of the tactical team and others are spies who also used 'Dust' on a continuing basis. He looked around as if soliciting agreement from the people assembled to him. His stares however were met with silence.<br>\r\n<br>\r\n''How could the French let something like that happen?'', a colleague asked. ''Wasn't she checked and issued with anti Dust pills?''<br>\r\n<br>\r\nKnowledge of 'Dust' was still largely secret albeit the first known prototype of the drug was discovered 10 years ago. It was estimated that no more than a thousand people in a country know about Dust and fewer than hundreds worldwide had in-depth knowledge about it. After several experiments, anti-Dust pills were manufactured to counter the drug. Powerful people such as international businessmen, ambassadors, head of states were told to consume it from time to time. <br>\r\n<br>\r\n''Ms. Blanchard there, should have her pills.'', Isaac said again. ''Unless....'', he stopped in mid sentence and opened a file in front of him and opened a page and showed the other members. In her record, Leila Blanchard was married twice but currently divorced. Both to men with Iraqi descent. Both of her ex husbands were brought to France and had obtained French citizenship. <br>\r\n<br>\r\n''Unless she had been hijacked long enough....'', Isaac's voice trailed off. ''We got ourselves a real situation here.'' <br>\r\n<br>\r\n''Get me Jacques!'', Isaac barked an order. ''The rest of you, stay on guard and don't forget your pills unless you want what happened to Ms. Blanchard to happen to you as well!''<br>\r\n<br>\r\n****<br>\r\n<br>\r\nAbu Sida smirked as he watch another report from CNN, detailing the arrest of Leila Blanchard and her subsequent deportation back to her country. It would cause an uproar for quite some time. But he couldn't stay for long he had a ship to catch heading for France, where his two subordinates would have been waiting in bodies of locals. He put the ticket into his pocket and studied the photograph of the person unfortunate enough to be taken over by members of a terrorist group, in this case, it was Claire Durand. Abu Sida tucked the photograph in his pocket, along with other essentials. He contacted the HQ of Al-Faruq Brigades, leaving a simple message and then left from his hiding place, carrying a backpack and a 1.5L bottle of murky, cloudy coloured water. Abu Sida had crammed as much Dust as he could before mixing it with water, he could always vaporize the water later, leaving the Dust behind. Although Dust was not like any other drugs in the sense that sniffer dogs would be unable to detect it, the Dust in its white crystalline form may attract unneeded attention. The journey itself would take some time, but Abu had all the entertainment he needed on the ship.<br>\r\n</span></div></div>",
            "created":1346302800,
            "id":1417004,
            "title":"A secret meeting in Israel."
        },
        "1451":{
            "choices":[
                "Abu in France",
                "Somewhere else",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>10 days later, a cruise ship arrived in France, carrying with it shipments of wealthy Iraqis on holiday, tourists returning back from their vacation in Iraq also a smug and clean shaven Abu Sida. Clearing the immigration was a walk in the park. Abu had been issued with fake IDs and passport, courtesy of the supporters of Al Faruq Brigades within the Iraqi government, something that the government and the western nations were trying to get rid of. <br>\r\n<br>\r\nAbu waited outside the quay, watching the people of France walking around minding their own business. Some of them were having a leisurely lunch in the cafe. Abu was sure that some of them would not mind to part with their money. A light tap on Abu's shoulder caused him to turn around abruptly face to face with a female which he easily identified from the photograph he had. <br>\r\n<br>\r\n''Brother?'', the female asked in Arabic as she took off her sunglasses.<br>\r\n<br>\r\nAbu smiled. He had made it.<br>\r\n<br>\r\n****<br>\r\n<br>\r\nJacques was not an actual person. It was merely an avatar used by France's anti Dust operatives to communicate with similar units worldwide. It was intended to reduce the exposure of French operatives and as a strategy in the case of a terrorist using Dust infiltrated the tightly guarded unit. Gerard Richmond, a retired DST operative was in charge of the avatar when Isaac contacted.<br>\r\n<br>\r\n''We need to find them both.'', the retired DST operative took out two A4 sized photograph from his folder and spread them on the table, the photographs of Ali and Ahmed, both Leila's ex husbands. ''Remember their faces well! We'll start early morning.'', he calmly gave out his order. Gerard sighed as he imagined the sheer scale of this operation. He needed all the luck he can get. Their first target was to be the Arab community in Paris and then spreading out to smaller cities, finely combing the population.</span></div></div>",
            "created":1346389200,
            "id":1417521,
            "title":"Abu's arrival in France"
        },
        "14511":{
            "choices":[
                "A little fun and pleasure is in order.",
                "Straight to business."
            ],
            "content":"<div class=\"\"><div> <span>Abu walked alongside his companion, making small chat and smoothly blending with the general population as they walked to the carpark. Abu also took the time to look at his surrounding, enjoying the change of scenery and the weather. Aside from being illegally smuggled to Lebanon, Iran and Kuwait for a brief period to carry out missions, Abu had never been commisioned to a European country, but it did not hinder him from mastering English and French. <br>\r\n<br>\r\n''Too bad about Leila.'', Abu's companion remarked in fluent French.<br>\r\n<br>\r\nAbu scrutinized his companion's look. Sporting a shoulder length cropped blonde hair, she dressed rather conservatively with a bright colored tunic blouse, which hugged her slim frame rather loosely, complimented with flat shoes. Her chosen outfit showed her shapely legs, but such sights were common in the country. Instead Abu's eyes went up to size her bosom, they were ordinary B cup. She looked rather different than in the photograph that Abu owned.<br>\r\n<br>\r\n''She outlived her usefulness, sooner or later, they would discover what we were doing.'', Abu's hand went into his pocket and took out Claire's photo, in swift motion, he tore it to small pieces before discarding it on the road. ''Serves him right as well.'', Abu finished, referring to the dead ambassador.<br>\r\n<br>\r\n''Where's... hmmm...'', Abu's voice trailed off, unsure whether it was Ali or Ahmed residing within the body of Claire Durand.<br>\r\n<br>\r\n''Ali? He was out somewhere.'', Claire smiled knowingly. ''Getting some money from someone.''<br>\r\n<br>\r\nAbu Sida chuckled. The plan he devised years ago went as smooth as he had hoped for and somewhat even better than what he had expected. His grip on the water bottle tightened, inside it, were more of the key of his plans' success, waiting to be evaporated to leave behind a kilogram of Dust, a synthesis as to make more Dust. There were many sacrifices, he had seen younger militants meet their gruesome ends, vomiting to their death after they tried the Dust. Ahmed and Ali were two of the handful of survivors that survived the ordeal and gained the power upon consuming the substance.<br>\r\n<br>\r\n''There's no need for ID falsification and petty crimes anymore.'', Claire smirked as she went round a bend. ''Some people were just eager to contribute to our just cause, brother.'' <br>\r\n<br>\r\n''I'm sure you can get money through other means as well.'', Abu gave a small chuckle as he mentally undressed his companion. Claire just chuckled in agreement.<br>\r\n<br>\r\nIt turned out that Ahmed had planned to show the city to Abu and did it with pride. Driving by schools, universities, and office complexes, letting Abu to see his potential body or bodies. <br>\r\n<br>\r\n''So, how did you come by this fine specimen again?'', Abu asked.<br>\r\n<br>\r\n''Ali said he spied her in a high school, an only child apparently.'', Claire said. ''He took over her life when she was 19 and made her move away to here and take a degree in Arabic.''<br>\r\n<br>\r\n''Ah yes, after he split with Leila.'', Abu interjected. Claire nodded. The car passed by a high school, the street littered with teenagers in uniform, going home. <br>\r\n<br>\r\n''Then I came here.'', Claire continued. ''We took turns taking control of her, and when we're busy we took sleeping pills before exiting her body.''<br>\r\n<br>\r\nAbu looked like he was going to ask something. ''And she's 25 this year.'', Claire grinned, as though Ahmed knew what Abu was about to ask. ''And working as a French-Arabic interpreter in a defence company.''<br>\r\n<br>\r\nThe car this time went around an office complex, with men and women in business suits walking quickly as if every second counted.<br>\r\n<br>\r\n''Brother, you should get something more suited for this place.'', Claire said in Arabic, twinged with a French accent as the tour concluded. <br>\r\n</span></div></div>",
            "created":1346734800,
            "id":1420658,
            "title":"Abu in France"
        },
        "145112":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Abu awakens.",
                "Ahmed's 'antics'."
            ],
            "content":"<div class=\"\"><div> <span>\"I take it you have a hotel room permanently booked?\" Abu asked Ahmed, who turned Claire's head and smirked wickedly.<br>\r\n<br>\r\n\"Better than that, I have this woman's apartment and all of her belongings...as well as her body\" Ahmed responded to his 'brother's question as he continued driving around the streets of Marseille, the port where Abu had docked in the cruise ship. \"I have been here a long time remember\" he chuckled in his host's sweet voice.<br>\r\n<br>\r\n\"Of course, forgive me! Take me to your new home my friend.\" Abu nodded, as he rubbed his eyes.<br>\r\n<br>\r\nAhmed glanced at Abu again, while his eyes were closed, he looked exhausted. \"As I said brother, these infidels are wary and aggressive whenever they see an Arab...or an Iranian, you will need to find a local 'disguise' if you wish to move unobserved.\" he continued.<br>\r\n<br>\r\n\"Even we get aggressive at the sight of an Iranian pig, my brother\" Abu growled in response, showing his hatred for Tehran. \"The Shi'ite regime in Baghdad does whatever those Persian bastards tell them\" he said, before calming himself down a little.<br>\r\n<br>\r\n\"You need sleep!\" 'Claire' muttered quietly in Arabic.<br>\r\n<br>\r\n\"Yes, I do, before we do anything\" Abu agreed, as he closed his eyes again and rested his head back.<br>\r\n<br>\r\nAhmed drove the car back to 'his' apartment and pulled up outside. \"Here we are brother!\" Ahmed stated as he exited the car, Abu followed suit and took a moment to study the outer facade of Ahmed current home. \"This is perfect!\" he muttered, showing his approval.<br>\r\n<br>\r\n\"Simple apartment for a 'girl' my age\" Ahmed chuckled. \"And there are several other residents who would make suitable hosts\" he told Abu.<br>\r\n<br>\r\n\"All in good time my friend. I'll sleep first, then when I wake, we continue making our plans\" Abu said, raising a hand towards the possessed woman in front of him. \"And maybe I'll get that 'disguise' you mentioned\" he grinned. The two of them quickly disappeared into the apartment building, Abu acting as 'Claire's' boyfriend for now, just incase any of the locals asked any unwanted questions. The first thing Abu did once inside was go to sleep for a few hours.<br>\r\n</span></div></div>",
            "created":1346734800,
            "id":1420680,
            "title":"Straight to business."
        },
        "1451121":{
            "choices":[
                "The next morning",
                "Meanwhile in the DST HQ"
            ],
            "content":"<div class=\"\"><div> <span>Abu woke up from what he felt was his best sleep in years after joining the Al Faruq Brigade to find the sky outside was dark as rain pelted against the glass sliding door that lead to a sizeable balcony overlooking the main street outside and a sight of Claire in her nightgown and lingerie. Taking in the full view, Abu felt a tent rising in his pants. He had been inside several females before for his mission and his latest host was the convicted Leila Blanchard but he could not suppress the hormonal induced behaviour.<br>\r\n<br>\r\n''I'm sorry brother, I didn't mean to wake you up.'', Claire glanced at Abu.<br>\r\n<br>\r\n''It's alright.'', Abu sat himself upright, with his gaze still fixated on Claire's figure, the silk attire looked tempting. It seemed that Ahmed knew this too.<br>\r\n<br>\r\n'Back in a moment.'', Claire cooed knowingly as Ahmed put forward a French girl persona gained from years of watching and doing, both on the giving and receiving side as well as spectating.<br>\r\n<br>\r\n****<br>\r\n<br>\r\nAbu grunted and unloaded his cum inside Claire's pussy. She let out a moan of satisfaction, before Abu took out his dick. There was a bit of silence as they normalized their breathing, but a contented look on their faces was clearly visible.<br>\r\n<br>\r\n''She's tight, and you're good.'', Abu spoke in French. He smiled in satisfaction as he put on some spare clothes.<br>\r\n<br>\r\nClaire chuckled at the comment. ''Countless times since I got here brother. Seems you also know the 'in and outs' of female pleasure.''<br>\r\n<br>\r\n''Maheer Anwar's daughter helped me.''<br>\r\n<br>\r\nClaire cooed. Abu was referring to the daughter of Iraq's ex-minister of commerce. The Al Faruq's Brigade deemed him as being too western and decided to make him resign. The militant decided that making his daughter to use some narcotics and whore herself in the country would be the best way to do it. Abu himself executed the plan.<br>\r\n<br>\r\n''Too bad she needs some sleep.'', Claire said, referring to her body. ''And I need to exercise my body as well as to not get athropied.''<br>\r\n<br>\r\n''What about Ali?''<br>\r\n<br>\r\n''He'll be back in the morning to take over, so I can show you around brother.'', Claire concluded the conversation. ''Meanwhile, you should get some sleep.''<br>\r\n<br>\r\nAbu decided to do just as his subordinate suggested and drifted back to sleep peacefully.<br>\r\n</span></div></div>",
            "created":1346821200,
            "id":1421317,
            "title":"Abu awakens."
        },
        "14511212":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Back in Marseille.",
                "The DST formulate a plan."
            ],
            "content":"<div class=\"\"><div> <span>\"We are not sat here for our own amusement everyone, this is a priority alert. At least two...possible three Iraqi-born terrorists are at large in our country, and they are known to have a sizeable quanity of Dust on them.\" Gerard told his few associates as they sat around the table viewing surveillance footage from airports around the country and glancing at dossiers of known terrorists. Abu Sida was among the worst of them, ruthless...but intelligent, as were his 'associates'. \"Now, the Israelis and Americans have given us all they have on Abu Sida's movements, and they have also updated us on their own anti-Dust operations.\" Gerard continued, in English...but with a heavy French accent.<br>\r\n<br>\r\n\"Hard to find a suspect who can be hiding inside anyone sir!\" one of his associates, a young female DST operative named Colette, suddenly spoke up. Colette had only been with the organization for two years, but had already proven herself. She was a slender woman, 22 years old, she had a nice figure and shoulder-length blonde hair.<br>\r\n<br>\r\n\"Very true!\" Gerard nodded, which is why we need to be focused, before these animals strike\" he said.<br>\r\n<br>\r\n\"How long as Sida been in the country sir?\" another operative, Leon, 34, asked Gerard. Leon was British-born but had been forced to resign from the anti-Dust organization in London following several allegations of corruption and of using Dust himself on one occasion.<br>\r\n<br>\r\n\"Not long according to our intelligence, but his associates have been in the country for quite some time\" Gerard answered. \"I'm afraid all we can do is continue investigating where they have been, and see if they've left any clues. The Americans have several of their own agents present in Baghdad already, they are running the show and we are providing assistance\"<br>\r\n<br>\r\n\"What about the Israelis?\" Colette inquired.<br>\r\n<br>\r\nGerard just smirked a little. \"Jerusalem's first priority is to keep their own borders secure. However they have promised to pass along any relevant information pertinant to our investigations should they find it\" he said.<br>\r\n<br>\r\n\"Understood sir!\" Colette nodded.<br>\r\n</span></div></div>",
            "created":1346821200,
            "id":1421384,
            "title":"Meanwhile in the DST HQ"
        },
        "145112121":{
            "choices":[
                "Fun in Marseille",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>''It's nice to see you again brother.'', Claire gave a small smile before she exited the apartment.<br>\r\n<br>\r\n''That was quick.'', Abu said to Ahmed now in his own body as Ali took over the charade of becoming Claire Durand. The three spent sometime discussing the next course of action. Now that now they had replenished stock of Dust and with three Al Faruq's Brigades in one vicinity there would be bound to be more action they could take.<br>\r\n<br>\r\n''What do you want to do now brother?'', Ahmed wiped off sweat from his brow after using the treadmill. <br>\r\n<br>\r\n''Help me to dry this off.'', Abu said. Unscrewing the water bottle he had brought from Iraq, he poured some of the content onto a baking tray. ''Oh, get me some of this stuff as well.'', Abu handed Ahmed a paper. <br>\r\n<br>\r\n''No worries brother.'', Ahmed smiled as he memorized the content. ''Just let me get changed into something more suitable.''<br>\r\n<br>\r\n****<br>\r\n<br>\r\nMeanwhile in London, there was another meeting being conducted.<br>\r\n<br>\r\n''Hello Mr. Bond.'', a female voice sounded through the intercom.</span></div></div>",
            "created":1346994000,
            "id":1422688,
            "title":"Back in Marseille."
        },
        "1451121212":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "007's next mission.",
                "Meanwhile, outside MI6 HQ."
            ],
            "content":"<div class=\"\"><div> <span>MI6's star agent walked through into the reception area of M's sprawling office, and he saw Miss Moneypenny sat there looking as ravishing as ever. The young woman had her permed auburn hair up in a ponytail and she was sporting a light grey trouser suit, a white blouse and a pair of black patent, 3-inch heel pumps. \"Hello James!\" she greeted 007 as she saw the usual, smug, conceited smirk appear on his face.<br>\r\n<br>\r\n\"Miss Moneypenny!\" 007 nodded in acknowledgement, as he swaggered over to her desk.<br>\r\n<br>\r\n\"'M' would like to see you right away James, no time for our usual playful banter I'm afraid\" Miss Moneypenny smiled as she got to her feet. Her heels clicked rhythmically on the floor as she then escorted 007 to the door that led through to M's main office.<br>\r\n<br>\r\n\"Oh, what a shame, I do so look forward to our little chats\" 007 muttered, a slight smirk still evident on his face.<br>\r\n<br>\r\n\"Well that makes one of us James!\" was Miss Moneypenny's quirky reply.<br>\r\n<br>\r\nHaving been shot down in flames once again by one of the many objects of his affection, James fell silent and followed Miss Moneypenny through to where M was sat behind her own desk, going through some reports. 'M' was in her late fifties and was an experienced inteligence official, also very strict and authoritative. She kept her grey hair cut very short and always dressed conservatively, much like her more glamorous receptionist, Jane Moneypenny.<br>\r\n<br>\r\n\"Ma'am, 007 is here!\" Miss Moneypenny said, getting M's attention.<br>\r\n<br>\r\n\"Thank you Jane!\" M responded.<br>\r\n<br>\r\nMiss Moneypenny then exited the office, but not before 007 had given her another admiring glance.<br>\r\n</span></div></div>",
            "created":1346994000,
            "id":1422717,
            "title":"Somewhere else"
        },
        "14511212122":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "...a  random male agent.",
                "...'M'.",
                "...Miss Moneypenny."
            ],
            "content":"<div class=\"\"><div> <span>\"We don't have much time, are you ready?\" Tarek, 37, muttered to his 'associate' Ibrahim, 41, as they stood on the far back of the River Thames, across from the MI6 headquarters. The two Libyan terrorists had infiltrated into England using Dust, having hijacked the bodies of a married couple returning from vacation in Tunisia. They had ditched the couple, who were in their fifties, a while ago and were now themselves again. It was a risk, but they could only use the Dust while they were not possessing someone else's body.<br>\r\n<br>\r\n\"Almost, it took a while to dry it all out.\" Ibrahim replied quietly, as he got out as bag of the drug. \"Maybe we should wait until its dried out completely, you know how dangerous the drug...<br>\r\n<br>\r\n\"No time!\" Tarek cut off his fellow terrorist. \"Now you're the computer expert, you need to get in there, hack their systems and download any relevant files pertaining to  their involvement in our country, and elsewhere. You can send them to me once you're done.\" Tarek explained to his 'friend'.<br>\r\n<br>\r\n\"Understood. I will retrieve the information we need, Insh'allah!\" Ibrahim nodded, preparing to inhale the Dust.<br>\r\n<br>\r\n\"I'll hide and look after your body until you return my brother.\" Tarek reassured him.<br>\r\n<br>\r\nIbrahim grunted a 'thanks' and then made sure nobody could see them in the bushes. Then he took a long snort of the drug... inhaling it all. His body instantly started convulsing and his eyes rolled up into his head. He then slumped back unconscious, and Tarek knew Ibrahim was on his way into the MI6 HQ.<br>\r\n<br>\r\nIbrahim proceeded to possess...<br>\r\n</span></div></div>",
            "created":1408424400,
            "id":1843952,
            "title":"Meanwhile, outside MI6 HQ."
        },
        "15":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Staying with Wei.",
                "Following Hans.",
                "Elsewhere in China.",
                "Meanwhile, in Japan.",
                "In another part of the world."
            ],
            "content":"<div class=\"\"><div> <span>The location was the city of Guangzhou in southern China, and it was 2:23am. A black Mercedes pulled up outside a large warehouse, and out stepped three Caucasian men dressed in tailored dark grey suits. The first man was tall and in his mid 40's, his blonde hair and goatee were neatly trimmed, he was known only as 'Hans'. His two associates, Yevgeny and Mikhail, were both Russian, of stocky build and were obviously his bodyguards.<br>\r\n<br>\r\n\"Eyes open at all times!\" the blonde man told his two 'colleagues' in fluent Russian. Both Mikhail and Yevgeny nodded, but remained silent, and then the three men made their way into the warehouse and the door was closed behind them. They were met by two Chinese man dressed in black suits and white shirts, but no ties. \"We're here to see Mr. Ling\" Hans said, as he held the handle of his briefcase with both hands.<br>\r\n<br>\r\n\"We know who you are!\" one of the men said back in broken English, his face expressionless. \"This way!\" he then mumbled, gesturing past him.<br>\r\n<br>\r\n\"So much for pleasantries!\" Hans quipped to his two bodyguards, who smirked a little.<br>\r\n<br>\r\nAs they walked deeper into the warehouse, the three men saw several more Triad members, all dressed in 'casual' suits and all armed with Scorpion sub-machine guns. A number of them were up on the second floor of the building, looking down. Hans and his associates soon saw a pristine office desk, which looked out of place in a warehouse, and behind the desk was sat a senior Triad member, 58-year old Wei Ling. It took a moment for Wei to acknowledge Han's arrival, and when he finally did...he looked at his watch, it was now 2:30am exactly. \"Excellent timing Mr...?\" Wei then said, pausing...<br>\r\n<br>\r\n\"Call me Hans!\" the tall German smiled, as he glanced at his own watch. \"I pride myself in arriving on schedule, otherwise what's the point of arranging a time?\" he said.<br>\r\n<br>\r\n\"Very true my friend, very true!\" Wei nodded, as he got to his feet, his English was perfect. \"Please, take a seat!\" he then offered, gesturing to a simple looking chair placed on the other side of the desk.<br>\r\n<br>\r\n\"I prefer to stand, thank you!\" Hans responded politely.<br>\r\n<br>\r\n\"As you wish!\" Wei sighed, as he glanced at one of his own, trusted bodyguards. \"I take it you do have the 'merchandise'?\" Wei then inquired, seeming a little eager to get his hands on whatever Hans was carrying.<br>\r\n<br>\r\nA little smirk appeared on Han's face. \"Of course!\" he said, holding up his briefcase. \"But I don't see the money!\" Hans noted, as he purposely looked around. It was then that Wei clicked his fingers, and one of his men walked forward with a briefcase full of money, \"$2 million as agreed!\" Wei stated firmly, as the briefcase was placed on the desk and opened. Hans smiled again and then walked forward, somewhat cautiously. He placed his own briefcase on the desk and released the catches, opening it up and then turning it to face Wei. \"Here's the merchandise, as agreed\" Hans said, as he gestured to the 200 small plastic bags containing a white crystalline substance.<br>\r\n<br>\r\n\"So...this is the drug I've heard so much about?\" Wei then mumbled, as he stepped forward and picked up one of the bags, holding it up to the light.<br>\r\n<br>\r\n\"Yes! A drug like no other\" Hans smirked. \"Also highly dangerous for first time users, roughly 50% of them die after taking the drug\" he warned. \"But I doubt that will influence your decisions very much\" Hans then continued, knowing full well the Triads' reputation.<br>\r\n<br>\r\n\"Not really. You see all my men are absolutely loyal and willing to die for me anyway\" Wei said, drawing Hans' attention to the armed men all around him.<br>\r\n<br>\r\n\"I'm sure they are!\" Hans nodded, seemingly not impressed much. \"And that concludes our deal\" he stated, causing Wei to look up at him. He should have known that leaving the warehouse wouldn't be as easy as entering.<br>\r\n<br>\r\n\"One moment please. How do I know that this is actually the drug I want?\" Wei asked, as he waved the little bag in the air. \"It could be salt, or...simple cocaine! I know just how 'tricky' you Westerners can be\" he then smirked. \"I require a demonstration!\"<br>\r\n<br>\r\nHans started chuckling, and turned back to look at his two bodyguards. \"Yes I suspected you might\" he then said, looking at Wei again, who wasn't laughing. Hans then slowly opened his jacket and got out his cell phone. \"Luckily I have one all arranged\" he grinned. He then dialed a number on the phone and starting speaking in Russian, obviously to more of his associates or bodyguards who were nearby. \"This shouldn't take long!\" Hans then addressed a nervous Wei, who was looking around. Suddenly, Wei's two most trusted bodyguards opened fire with their sub-machine guns, shooting the other Triad members. Caught by surprise...and utterly confused...the Triad gangsters were ripped apart by bullets, as Hans and his two bodyguards ducked out of sight.<br>\r\n<br>\r\nWith their sub-machine guns empty, the two Triad bodyguards then approached their 'master' and put their pistols to his head. Wei was shocked when one of them said something to him in Russian. <br>\r\n<br>\r\n\"I trust this was a good enough demonstration Mr. Ling?\" Hans chuckled, as he stepped back into view, a little upset at having a few spots of blood on his suit. \"Like I said, this concludes our deal\" he said. After Hans then gave another order in Russian, the two Triad bodyguards put their pistols to each others' heads and killed each other.<br>\r\n<br>\r\nMikhail then grabbed the suitcase full of money off the desk, and the trio left the warehouse, leaving the bodies of ten Triad members littered throughout, and an angry...but unharmed Wei standing alone with his new stash of drugs. Once outside, Hans got on his phone again and congratulated his other two 'associates', Andrei and Vitaly, who had used the drug to possess the bodies of the two 'rogue' Triad bodyguards.<br>\r\n<br>\r\n\"That didn't take long at all\" an 'amused' Hans remarked, as he got back into his Mercedes with his men and went off to rendezvous with Andrei and Vitaly, who by now would have returned to their own bodies in another car parked nearby.<br>\r\n</span></div></div>",
            "created":1342933200,
            "id":1386015,
            "title":"Asia."
        },
        "152":{
            "choices":[
                "Follow Charles and his two associates.",
                "Wei hears of Hans' untimely demise.",
                "An international investigator notices the apparent suicide and takes notice."
            ],
            "content":"<div class=\"\"><div> <span>As Yevgeny drove back to the rendezvous point, a silent Hans in the backseat checked his watch again.  2:39AM.  He breathed a sigh of relief that the ordeal was over with so quickly, and for once without a hitch.  He had until the hour, perhaps he could have some fun before getting back to work.  But even while Hans daydreamed about what to do after his success, one of his bodyguards was not so calm.  Mikhail turned to look Hans levelly in the eyes, and clearly the man was surprised by the serene smile on Hans' face.  In Russian, once again, Mikhail began: \"Were you not worried that Wei would simply order you shot?  I would like to think of myself as a skilled bodyguard, but when outnumbered 5 to 1 even I will doubt surviving.  But you never even flinched once.\"  <br>\r\n<br>\r\nThis broke Hans from his contemplative state, and the man slowly turned to look out the window.  \"I was never in any danger, Mikhail.  Dust makes me invincible.  There's no need to fear those who can't hurt you.\"  Hans' deflection of the potential danger did nothing to sate Mikhail's curiosity, though.  \"But even with Andrei and Vitaly standing by with the drug, they could have killed you instantly before you could even signal them.  I can't think of being more vulnerable than surrounded by an armed enemy.\"  Hans turned to Mikhail and smirked, but said nothing.  \"This is not the first time you've tempted fate either.  There's rumors that you've dealt with the Red Mafia.\"  Hans simply kept smiling.  \"Oh really?\"  \"Oh Yes.  Said that you were selling the same drug to them as well.\"  The grin on Hans' face only got wider.  \"And yet here I am, unharmed.  A testament to my invincibility.\"  Mikhail's face took on a hard look as he said the damming bit: \"Those 'rumors' go on to say that they killed you once your business was done.\"<br>\r\n<br>\r\nAt that the smile on Hans' face melted away.  A tense moment of silence passed between the two, and for a moment it look as if they were going to pull their guns on each other.  But Hans simply began to speak, saying, \"You're very well informed, Mikhail.  I'll give you that.  Tell me, do you have any regrets?\"  This clearly caught Mikhail off guard, as the man was silent for a few moments as Hans simply fiddled with his cigarette lighter.  \"No?  None at all?  Or simply not willing to tell me.  That's practical, I suppose, but sadly it does mean that you go without a last request.\"  A surprised look crossed Mikhail's face for but an instant before slight spasms rocked his body.  Though the car began to swerve gently, Hans calmly put the lighter away and waited for the spasms to end.<br>\r\n<br>\r\nA moment later, Mikhail regained his composure and looked straight at Hans.   In perfect English this time, the man spoke, \"So tell me, why did you hit the panic button <i>this</i> time Charles?\"  Briefly a look of annoyance crossed Hans' face, but he settled into a cool stare.  \"Hans has gotten too famous.  Mikhail had figured out that he had died once before.  Couldn't risk him putting the pieces together; we'll have to dispose of him.\"  'Mikhail' groaned a little and slumped back into the seat.  \"Damn it.  It took weeks to find these two, you can't just keep killing off anyone who happens to stumble upon us.\"  \"No, we <b>will</b> do so.  I'll not have this operation exposed because of  little mercy for those caught in the crossfire.  If they pose a threat, we eliminate it.\"<br>\r\n<br>\r\n'Mikhail' said nothing, but simply glared at Hans as the car continued to drive along.  From the front seat, Yevgeny turned his head slightly to address Hans, \"What about the driver?\"  A moment of silence, then Hans responded.  \"He technically hasn't done anything, but he might have been listening to our conversation.  We can't risk it, the lot of them will have to go.  Might I suggest the nearby river?\"  'Yevgeny simply nodded and made a sharp right at the next intersection, but instead of leading down a road it led off the bank and into the river.  As the car sank beneath the water, the three of them simply sat still as darkness enveloped them.  The three bodies weren't fished out for hours.</span></div></div>",
            "created":1343365200,
            "id":1391401,
            "title":"Following 'Hans'"
        },
        "1523":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "On a flight to China.",
                "Further investigating.",
                "Back with 'Hans'."
            ],
            "content":"<div class=\"\"><div> <span>Back at his desk in London, Interpol agent Ryan Smith, 36, was sat doodling on the piece of paper sat in front of him. He was normally busy but today was a slow day, everyone hunted by the organization was doing a good job of staying hidden from them. \"Working hard as always?\" one of Ryan's female colleagues smirked as she threw a newspaper on the desk. <br>\r\n<br>\r\nRebecca Knowles, 28, was a junior agent at Interpol, a bright young woman with wavy, shoulder-length black hair. Professionally attired in a dark grey trouser suit, white blouse and a pair of black high heels. What she lacked in experience she made up for with determination, and Ryan knew this. \"Hey, doodling takes a lot of concentration\" Ryan mumbled in response to Rebecca's acerbic statement, as he sat up straight.<br>\r\n<br>\r\n\"Hm, I bet it does!\" Rebecca smirked. \"Any news on Fredrico?\" she then asked, referring to an international fraudster the two had been after catching for the last year or so. She seemed disappointed but not surprised when Ryan just shook his head. \"Oh well, I'm sure he'll rear his ugly head some time\" Rebecca said, trying to stay positive, then she walked off, her heels clicking on the floor as she went. Ryan watched his colleague walk away, cursing the fact that she was already engaged to her long-time boyfriend Chris. He liked Rebecca a lot, but he'd kept his feelings for her a secret. He sighed as he picked up the paper and glanced at the front page, then he started flicking through it. He stopped when he saw the article on Page 3: <i>Bodies pulled from China river.</i> The bodies of a German man and two Russians had been discovered in a car at the bottom of a river in Guangzhou, China. After reading the article, Ryan recognized the description of the German, tall, blonde, neatly groomed, immaculately dressed.<br>\r\n<br>\r\n\"Hey Becky, come over here a minute!\" Ryan called out to his colleague.<br>\r\n<br>\r\n\"What now?\" Rebecca answered as she sashayed over to Ryan's desk. Leaning over, a frown suddenly appeared on her face when she started reading the article. \"You think its Hans Greschler?\" she inquired.<br>\r\n<br>\r\n\"I'd say that's a good guess\" Ryan nodded.<br>\r\n<br>\r\nHans Greschler was a known drug smuggler and murderer who was also on Interpol's list of wanted criminals. He was also very careful and good at what he did, which puzzled Ryan as to why he had died in a simple 'car accident' with two other men. \"Contact Beijing, ask them for all the information they've got on this\" Ryan politely 'instructed' Rebecca, who just nodded and picked up the phone.<br>\r\n<br>\r\nRyan just sat there, staring at the grainy picture of the car being dragged from the river. There was something 'wrong' about all this, and he was determined to find out what it was.<br>\r\n</span></div></div>",
            "created":1343451600,
            "id":1391717,
            "title":"An international investigator notices the appar..."
        },
        "15233":{
            "choices":[
                "The three reach the border.",
                "Ryan Smith catches a glimpse of the bigger picture."
            ],
            "content":"<div class=\"\"><div> <span>On a small, dusty dirt road in suburban China a small dated truck hurtled down the road.  By all appearances, the rickety pickup truck was a piece of junk.  Its red paint had faded away years ago, and the rust that now took its place made it look more brown than anything.  Coupled with the sputtering engine and the plume of black smoke that trailed it, and you would think that its owner would have sold it for scrap years ago.  Judging from the look on its three passengers in the cab, they most likely were contemplating such a move right now.<br>\r\n<br>\r\nThe driver was a man in his late 50s, and his salt and pepper hair was accented by the simple black baseball cap that sat upon it.  While his button down shirt and chinos gave the impression of a traveling tourist, his cold demeanor seemed to suggest otherwise.  \"And you had the nerve to use my real name back in the car.  What if there was a bug in there?  Whatever happened to using our cover names, 'Vitaly'?\"  The driver cast a hard glare at the passenger sitting next to him.  She was a woman in her late 30s, but if you were to simply look at her you would had never guessed.  With her tight frame, youthful face, and long auburn hair, she looked to be a young beauty out for a little international fun.  It certainly didn't hurt that her casual roll neck blouse accentuated some of her best features.  \"Well what can I say 'Hans', perhaps I was aggravated that our supposed expert negotiator had come close to blowing his cover.  <b>Again</b>.  At this rate, 'Andrei' might be better suited for this than you.\"  She forked a finger at the passenger who occupied the window seat to her right.<br>\r\n<br>\r\n'Hans' exuded an aged yet calculated intelligence, and 'Vitaly' carried herself with an apparent grace and finesse, but 'Andrei' just looked intimidating.  The man was only in his early 30s, but with his large frame, shaved head, and hard facial features he looked like the kind of guy who had ended more lives than he could count.  Even though he was dressed in a light flannel shirt and shorts, it did little to diminish the effect.  \"Will you two just stop bickering over this already?  We completed the job, and no one is the wiser.  Yeah, Charles fucked up.  Who gives a shit, we still covered for him.  Just drop it already Vanessa.\"  At this, Vanessa threw her hands up in the air and turned her glare to him.  \"I'm sorry Tybalt, but I didn't join up to murder anyone who looked at me funny.  I mean, gunning down Triad members is one thing, but murdering some mercenaries simply because you were sloppy?  That's low, even by my standards.\"<br>\r\n<br>\r\nAt this Hans turned back to face her.  \"Enough!  It's hard enough to drive this piece of junk without you preaching to us!\"  Vanessa returned a glare to Charles, but she remained a silent for a moment before continuing.  \"Fine.  I won't preach.  But on that note, why <b>are</b> we riding in this... thing?  The Mercedes was much nicer than this.\"  The engine stalled for a brief second before starting up again, as if to affirm Vanessa's statement.  \"Because that was tied to Hans Greschler, and with him dead we can't risk using any of his possessions.  The last thing we need is some stupid beat cop to notice that we're driving the car of a dead man.\"  Vanessa simply rolled her eyes and began muttering to herself, but she was denied even privately venting her muted apprehensions.  Tybalt gently shoved her in the shoulder, saying, \"If you have something to say, just say it.  Don't bottle it up; it's unhealthy.\"<br>\r\n<br>\r\nHer eyes gently drifted to Tybalt and a small smile crossed her face.  \"You know, sometimes I forget that there's a man buried under all that brawn.  Fine.  I'm just... oh, what's the word... aggravated that we have to keep literally killing most of our progress.  I mean, back in St. Petersburg we took over that other weapons dealer... Grigori was his name, right?  Small player, but he was a dead ringer look alike for Hans and it was easy to pass him off as the real Hans to the Red Mafia.  Then when our 'expert' negotiator flubbed a few key facts during the deal, kill happy Charles here made us kill off all of Grigori's henchmen and the Red Mafia contact which, I don't need to remind you, lead to the death of Grigori.  All in the name of 'no loose ends'.  Then we had to spend <i>weeks</i> tracking down the real Hans so that the plan can continue.  Now he's dead too, and we still have one more piece to complete.  If we had just accepted that nothing goes according to plan, we could have been done with the entire op and be lounging on some Caribbean beach right now!\"<br>\r\n<br>\r\nTybalt arched an eyebrow at Vanessa after her tirade, and simply inquired, \"Done?\"  Vanessa took a few breaths, then broke into a full smile before responding.  \"Yes.  And thank you, I <b>do</b> feel much better now.\"  Tybalt simply shrugged returned to looking out the window while Charles responded to Vanessa's concerns.  \"You know that Grigori's death was not part of the plan.  But when a plan revolves around secrecy, even the slightest ounce of truth can tear it asunder.  We couldn't risk word of a fake Hans getting out, especially not to Wei or Myon, or else we'd be even worse off than we are now.  The Red Mafia has the dust now, as does the Triad; who cares if some nobodies had to die along the way.  Besides, we're only a few days drive from the border.  One more job, then a quick trip back to China and we're home free.  This will be simple, Hans or no Hans, fake or otherwise.\"</span></div></div>",
            "created":1343538000,
            "id":1392510,
            "title":"Back with 'Hans'."
        },
        "152332":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Back with Charles & Co.",
                "The flight to Beijing."
            ],
            "content":"<div class=\"\"><div> <span>After hours of reading through case files and going through an entire pack of cigarettes, Ryan eventually began to piece things up, or...so he hoped. He had spent all night in the office and was a little worse for wear. He held up two pictures, one of Grigori and one of Hans, and a wry smirk appeared on Ryan's face. The resemblence between them was stunning and Ryan now knew he had to be on the right path. \"<i>Who's ballsy enough to screw with the Red Mafia?</i>\" he thought to himself. His train of concentration was then broke when the door to the office opened and in walked two of his colleagues, including Rebecca.<br>\r\n<br>\r\n\"Ryan?\" she muttered in a concerned tone. \"You said you were going to get some sleep. Have you been here all night?\" she asked.<br>\r\n<br>\r\n\"Yep, but it hasn't been in vain, I'm making slow progress here\" Ryan nodded in response.<br>\r\n<br>\r\n\"Christ, it smells like a pub in here!\" Rebecca then complained as she wafter her hand through the haze of cigarette smoke in front of her. As she put her handbag down and grabbed a nearby air freshener, Ryan continued explaining to her what he had found. \"Well...I'm glad my phone call to Beijing yesterday wasn't in vain, you any idea how hard it is trying to converse with a local who doesn't speak good English?\" she chuckled.<br>\r\n<br>\r\n\"Yes I have!\" Ryan mumbled, throwing Rebecca a glance.<br>\r\n<br>\r\n\"Of course you have, sorry!\" Rebecca laughed.<br>\r\n<br>\r\n\"Look, we've got deceased members of the Red Mafia and a prominent mercenary...also dead. Either we've got a superhero crimefighter out there, or...there's some people who have their own agenda. Either way we've got to get out to China and follow up on this. I've already alerted the Chinese authorities that we'll be arriving soon. They've promised to cooperate fully with our investigation\" Ryan explained, as Rebecca stood there, arms folded, and dressed in a light grey trouser suit, a white blouse and a pair of white heels.<br>\r\n<br>\r\n\"We?\" Rebecca muttered.<br>\r\n<br>\r\n\"Yes...we! I need someone to carry my stuff\" Ryan smiled.<br>\r\n<br>\r\n\"Oh...so I'm a personal assistant?\" Rebecca said in her posh accent, arching an eyebrow in disapproval.<br>\r\n<br>\r\nRyan stood up and gave her another smile. \"No, you're an intelligent, valued colleague...who could use a few more hours of experience under her belt\" he told Rebecca, deciding to flatter her a little.<br>\r\n<br>\r\n\"Well...when you put it that way!\" she smirked, pushing her hair behind her ears.<br>\r\n<br>\r\nRyan nodded, and after patting Rebecca on the shoulder, he started putting all the evidence into a single briefcase. \"Now...I'm going to get a couple of hours sleep, then we're heading out, I'll meet you at Heathrow okay, I already booked us on a British Airways flight to Beijing\" he said while yawning. \"Oh...and don't forget your sidearm and your ID\" Ryan said, as he set off towards the door.<br>\r\n<br>\r\n\"Oh...thanks for reminding me!\" was Rebecca's acerbic response as Ryan disappeared out the door. \"About time I got out of this dump\" Rebecca said to herself, as she looked around the office. She then began to prepare for her trip to China.<br>\r\n</span></div></div>",
            "created":1343538000,
            "id":1392569,
            "title":"Ryan Smith catches a glimpse of the bigger pict..."
        },
        "1523321":{
            "choices":[
                "The trio continues their trip into North Korea.",
                "Meanwhile, back in China..."
            ],
            "content":"<div class=\"\"><div> <span>Taking a trip across China in a cramped truck was not exactly a pleasant experience.  Having to ditch Hans meant having to ditch his resources as well, which meant that Charles, Vanessa, and Tybalt were left only what they could carry.  While they were hardly without resources of their own, the People's Liberation Army's constant surveillance of all forms of communication meant that they were left no way to access them.  Even without access to their funds they were far from unarmed though, as the constant rattle of four briefcases of dust in the back reminded them.  It had taken them a little over a week, as they had to not only cross the country but also stick to the back roads to avoid prying eyes, but after many painful nights they had made it.  The North Korean border was only a few miles away.<br>\r\n<br>\r\nTybalt was currently driving, and Vanessa was keeping him company while Charles was passed out between them.  \"So you really think that this will work?\"  Vanessa inquired to Tybalt.  \"I mean, I know that Charles said that arrangements had been made, but this plan seems to be full of holes.\"  Tybalt in a quick low voice simply intoned: \"Quiet, we're in view.  Act the part.\"  At this Vanessa's normally alert and spry demeanor settled in a suitably more lethargic one, and a sloppy smile crossed her face while her eyes unfocused.  While Tybalt could not quite mimic the caliber of Vanessa's performance, to his credit his face was now colored a light red and he let out a rebel yell at the top of his lungs.  They came to a quick stop in front of the border fence, and instantly a dozen rifles were trained on them.<br>\r\n<br>\r\nA thin wiry man dressed in the North Korean military uniform approached the vehicle at a quick pace, shouting something in Korean in a loud but shrill voice.  However, no indication of understanding crossed Tybalt's face as he simply continued to loosely smile and observe the guards.  \"I think we're, um... lost?  Yeah, yeah, lost.\"  He laughed a little at his comment, but the soldier did not seem amused.  After shouting a few things to his men, he continued to talk in that irritably sharp voice, but this time in English.  \"I am Jungwi Du-Ho of the Korean People's Army!  You are trespassing upon our sovereign soil!  Identify yourself or we will treat you as foreign invaders!\"  At this Vanessa's head drooped slightly before bolting up again, and she slowly inquired in a low voice, \"Hey Bradley, got anymore of that booze from the Chinese dude?\"  In kind, Tybalt responded: \"No, no, we drank all of it, last night, at the furry bar... no... wait, it had tigers, not furries... golden tiger lounge, yeah yeah!\"<br>\r\n<br>\r\nWith no indication, Du-Ho swung his rifle around and immediately slammed Tybalt in the head with the butt of it.  A brief look of shock crossed Tybalt's face before he slumped over the driver's wheel with his eyes closed and did not stir again.  Vanessa's head whirled as a terrified look of surprise crossed her face and she let out a scream that rivaled Du-Ho's own screeching.  \"As invaders of our sovereign territory, we now take you as prisoners of war!\"  He then shouted something to the other guards, and they immediately moved in to secure the truck and its cargo.  While they moved the motionless forms of Charles and Tybalt across the border along with their possessions, a weakly struggling Vanessa shouted at the man.  \"No... no!  We're... we're Americans, you can't do this shit to us!  We'll SUE!\"  At this, Du-Ho simply slapped Vanessa in the face and locked the canister doors, leaving Vanessa alone in the dark compartment as the engine sputtered to life and started to move.<br>\r\n<br>\r\nVanessa had only the hum of the engine's motor to accompany her as she neatly organized herself from the entire affair.  A triple knock from the driver's compartment stirred her from her busy work as she immediately went over to Tybalt and nudged him in the ribs.  \"Nice acting there.  If I hadn't known any better, I'd have thought you actually went down.\"  Tybalt simply grunted in response as he got off the ground and quickly took charge of the four briefcases.  \"Bastard.\"  She started.  \"He's brilliant, but still a bastard.\"  She lightly kicked Charles' unconscious form as if to drive the point home.  \"I understand Charles hitting you, but slapping <i>me</i>?  Power tripping prick.\"</span></div></div>",
            "created":1343624400,
            "id":1394014,
            "title":"Back with Charles & Co."
        },
        "15233212":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "The investigation is 'interrupted'.",
                "A North Korean journey."
            ],
            "content":"<div class=\"\"><div> <span>As Charles and his two 'colleagues' continued making their way through dangerous territory, Ryan and Rebecca were arriving in China after a very long flight. Once the plane had touched down, the two of them made their way off and were immediately confronted by a very strict Chinese customs official (a young woman) who lacked any kind of politeness. \"ID!\" the young woman demanded of Ryan...while at the same time scowling a little at Rebecca.<br>\r\n<br>\r\n\"Is this how you welcome all visitors?\" Ryan grumbled, as he got his passport out, allowing it to be checked. Rebecca did the same and hers was snatched from her by the official, something that made her get angry.<br>\r\n<br>\r\nRyan could tell Rebecca was going to say something...so he got her attention and shook his head. \"No!\" he mimed at her.<br>\r\n<br>\r\n\"Agent Smith?\" a man's voice suddenly said in broken english, causing the two Interpol agents to turn around. Before them stood two plain-clothed Chinese detectives, one was in his 40s and obviously a veteran, his name was Feng Yi. And beside him was a younger detective, also male, who was also taller, he was called Chuanli Po. \"Yes?\" Ryan responded, as the older man stepped forward to shake his hand. \"I am Detective Yi, we have been assigned to assist you in your investigation into the deaths of the three foreigners\" Yi said, remaining stone-faced much like the customs official.<br>\r\n<br>\r\nRyan knew full well that 'assist' actually meant 'being watched'. \"Er...okay, that's fine! This is my colleague Agent Knowles!\" he introduced Rebecca, but Yi did not shake her hand, instead he just nodded at her. \"A pleasure!\" Yi mumbled.<br>\r\n<br>\r\n\"If you'll follow us please, we will take you to the site of the accident\" Yi said, as he and Detecive Po started walking off.<br>\r\n<br>\r\n\"Wait...what about the bodies?\" Ryan questioned him.<br>\r\n<br>\r\n\"All in good time. They're being kept at the morgue in Guangzhou under police guard\" Yi replied coldly.<br>\r\n<br>\r\nRebecca just frowned at the customs official as she returned her passport to her, then she rushed to catch up with Ryan, her high heels clicking rather clumsily on the floor as she went. \"Why are these people so...rude?\" she asked him, clearly annoyed.<br>\r\n<br>\r\n\"Communist state.\" Ryan shrugged. \"Go figure!\"<br>\r\n<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\nAfter a long drive to the sight of the 'car accident', they finally arrived. By this time the effects of the plane ride and and the road trip had taken its toll on the two British agents, they were really tired. \"If you are too exhausted, we can do this tomorrow Mr Smith?\" Yi suggested, for a moment seeming a tad concerned.<br>\r\n<br>\r\n\"No...no we might as well just have a quick look around, probably nothing to see here anyway since you've taken the car and the bodies away\" Ryan replied, as he found himself unable to prvent a yawn exiting his mouth. He and Rebecca then stepped out of the vehicle and noticed the two armed police officers who were standing guard over the accident site. They began having a poke around, and the first thing Ryan noticed was how remote the area was, no witnesses to the crash. It was Rebecca however who noticed tire tracks quite some distance away, having wandered away from the others. \"Hey Ryan, over here!\" she shouted in her Kensington accent.<br>\r\n<br>\r\nRyan and the two Chinese detectives all walked over after locating her, and Rebecca pointed out the tracks. \"Someone was here! Maybe they were waiting for our friends.\" she said, just poking around in the dark.<br>\r\n<br>\r\n\"Maybe!\" Ryan mumbled, as he squatted down. \"The tires must be worn, the treads aren't very deep\" he then said.<br>\r\n<br>\r\n\"Whoever it is, they are probably out of the country already\" Detective Yi suddenly interrupted, throwing a dampner on things. \"Now...if you are ready to see the bodies?\" he asked Ryan and Rebecca.<br>\r\n<br>\r\n\"Are there any buildings around here?\" Rebecca asked the detective, who paused before replying. \"Only an old warehouse, several miles down the road, not many people have a reason to come out here\" he answered.<br>\r\n<br>\r\n\"Perfect place for criminal activities then I'd say\" Rebecca smirked.<br>\r\n<br>\r\nDetective Yi did not smile...<br>\r\n</span></div></div>",
            "created":1343710800,
            "id":1394263,
            "title":"Meanwhile, back in China..."
        },
        "154":{
            "author_id":"rugal",
            "author_name":"rugal b.",
            "choices":[
                "Follow Daniel",
                "Follow Shingo",
                "Follow Amelie and Craig"
            ],
            "content":"<div class=\"\"><div> <span>\"Is it done Ishikawa?\" Masateru Sawamura, head of the Ando clan's Sawamura family, asked to the pretty young woman standing in front of him.<br>\r\n<br>\r\n\"It is.\" she stated simply, \"Matsuyama will no longer be a problem.\"<br>\r\n<br>\r\n\"Hey, uh, so what's Rie doing here?\" asked Daniel Martin. He wasn't fluent enough in Japanese to pick up on all of what was being said.<br>\r\n<br>\r\n\"I would like to know that myself.\" Masateru said before turning back to the woman. \"Ishikawa, why did you bring Umeda here?\" he asked speaking Japanese once more.<br>\r\n<br>\r\n\"I used the drug to hop into Matsuyama's body. Just a small amount, enough to get him situated by an open window. Once I started losing control of his body, I fell out the window. Luckily I ended up back in my own body before he hit the ground.\" the supposed Rie Umeda explained, \"Umeda was in there as a witness. I took her in order to give a favorable story to the police and I'm stuck here for another few hours.\"<br>\r\n<br>\r\nMasateru leaned back in his chair and groand, \"And you thought bringing a hugely popular idol to a building housing the head of the Sawamura family was a good idea?\" he asked.<br>\r\n<br>\r\n\"Umeda lives here as well in another apartment remember.\" she explained, \"It won't raise any suspicions of ties to the Sawamura family and the Ando clan.\"<br>\r\n<br>\r\nMasateru sat in thought for a moment. \"You best hope it doesn't. That is not the kind of scandal she, and thus we, needs. Dismissed.\"<br>\r\n<br>\r\nDaniel watched as the pretty pop star walked out of the penthouse apartment. \"So, uh, what's going on here?\" he asked trying to process everything.<br>\r\n<br>\r\nMasateru turned back to him. \"A bit of business.\" he said speaking in English, \"You're aware of Shintaro Matsuyama, correct?\" Daniel nodded; Shintaro was a well known producer for lots of big idol singers. \"Matsuyama got into a bit of bad business with the Sawamura family. Gambling debts. We offered him a way to pay and he wouldn't play ball so now he's been eliminated.\" Daniel gulped. He'd heard stories that even if they were more \"legitimate\" the yakuza were still as ruthless as any mobster. \"Then that is where you come in, Mr. Martin. You ran up a large amount of debt at hostess clubs run either by the Sawamura family or by... let's call them affiliates. Debt that you didn't have the money to pay.\" Daniel was starting to feel very uneasy. \"Well we intend to have you pay, Mr. Martin.\" Masateru stated. He reached into a briefcase sitting on the table, pulled out a bag containing a white substance and slid it across to Daniel.<br>\r\n<br>\r\n\"Holy shit, you want me to deal coke?!\" Daniel asked in astonishment. \"I--I can't do this. If I'm caught... oh man. Oh god.\"<br>\r\n<br>\r\nMasateru smiled. \"No, you won't be a drug dealer but a drug USER.\" he stated. \"That drug is a very underground one called dust. When taken, the user experiences a temporary loss of consciousness however they can then project that conscience into the body of another person assuming complete control over them. The time you control a person depends on how much you ingest. Minimum the effect is for around two hours though if the more you ingest the longer you'll stay in a body.\"<br>\r\n<br>\r\nDaniel eyed the leader of this yakuza family warily but didn't dare speak up about not believing him. \"And what does this have to do with me?\" he asked.<br>\r\n<br>\r\n\"To repay your debts to both the Sawamura family and the Ando clan of which we are a branch of, you shall work for us.\" Masateru stated. \"Take the drug. Have fun with it. But when we call on you, you WILL respond and do as we ask. If you are in a body that is not your own, we will give you about a day to respond. Failure to do so will cause you to end up like Matsuyama.\" Sawamura flashed a chilling smile at Daniel, \"Welcome to the Sawamura family, gaijin.\"<br>\r\n<br>\r\n<div align=\"center\">* * * * *</div><br>\r\nDaniel sat in his apartment the next morning as he stared at the drug. What had he gotten himself into? Where had his life gone? He was a guy into games and anime, not a mobster. He had come to Japan to teach English not play lackey for the yakuza. He was only 22 and yet he could see his life flashing before his eyes. He had no choice though, right? He called in sick to the school; he'd need to test this drug out. See if Masateru was on the up and up with him. He'd never done drugs before beyond drinking so his best bet was to imitate the way he saw it in the movies. He laid out a line of the dust, put a straw into his nose and down towards one end of the line, then snorted...<br>\r\n<br>\r\nHe blacked out but then he could see everything... including himself! He was floating! He could move through the air, through walls! He decided to take a trip down to the high school where he taught English and floated into the hallways. There he saw two students of his, both 15-year-old first years: Eri Kawagiri and Ayako Nishimura. The pair stood around in the classroom waiting for class to begin when suddenly Eri's head drooped and she began to spasm a bit. \"Eri! Eri! Are you alright?!\" she asked in concern.<br>\r\n<br>\r\nEri looked around, then at her. \"I'm Eri...\" she said softly.<br>\r\n<br>\r\n\"You're what?\" asked Ayako still showing concern.<br>\r\n<br>\r\n\"I... I'm fine.\" Eri stated. She pulled out a compact out of her schoolbag and opened it up. Eri's features, the two long bangs framing her face and her black hair tied back in a ponytail, looked back at her. Or rather him. That old yakuza boss was telling the truth! Daniel Martin was now Eri Kawagiri!<br>\r\n<br>\r\n<div align=\"center\">* * * * *</div><br>\r\nShingo Ishikawa awoke in his apartment. HIS apartment, not Rie Umeda's which he had gone to sleep in. He was back to being himself and while there was a sense of relief there was also a pang of longing. Longing for the next use, the next body. Shingo acted as something of an enforcer for the Sawamura family with a bit of espionage on the side. He had no qualms about using the bodies of others to carry out acts, usually staging suicides of people on the wrong side of the Sawamuras or Ando clan. And he liked the thrill of being them, especially girls and women. Rie wasn't the first idol singer he'd been and she wouldn't be the last. Ayaka Kato's sex scandal last year was due to Shingo's manipulations and he'd enjoyed every minute of wearing her body.<br>\r\n<br>\r\nHe looked at the bag of dust sitting on his desk. Who would he be today, he wondered?<br>\r\n<br>\r\n<div align=\"center\">* * * * *</div><br>\r\nAt the headquarters of the United States Forces Japan at Yokota Air Base, Amelie Owens, a CIA agent, handed a document to her superior Craig Robertson. \"Another high profile suicide.\" she said as he opened it up. \"Shintaro Matsuyama, producer for the record label Idotrax. Jumped out a window right in front of Rie Umeda.\"<br>\r\n<br>\r\nCraig looked up at her, her pretty features tried to remain hidden under an air of professionalism. \"Think it's connected to the others? The bank exec, the baseball player, the... what do the Japanese call 'em, tarento?\"<br>\r\n<br>\r\n\"Four big deaths in a month, all of them with some kind of debt to organizations we think have yakuza ties? Yeah I'd say that's suspicious.\" Amelie replies.<br>\r\n<br>\r\n\"Think it could be dust related?\" asked Craig.<br>\r\n<br>\r\n\"I don't know, sir. But we can't deny the possibility. This definitely requires further investigation.\" Amelie answered. For his part Craig Robertson gave another look at the document, grunted an approval and walked out of his office.</span></div></div>",
            "created":1346907600,
            "id":1421952,
            "title":"A \"Dust\" Storm in Tokyo"
        },
        "1543":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Crime Scene Investigation.",
                "Daniel's antics.",
                "Back with Shingo Ishikawa."
            ],
            "content":"<div class=\"\"><div> <span>Oblivious to the actions of Shingo Ishikawa and the goings on at the high school where Daniel was now taking a \"joyride\" inside a female student, the two CIA agents made their way to the scene of the latest \"suicide\", that of Shintaro Matsuyama. They had with them two other CIA agents of Japanese descent, Neil Tamada, a 40-year old veteran and father of three daughters, and Aiko Hayashi, a 27-year old female agent.<br>\r\n<br>\r\n\"So there were no witnesses to the suicide?\" Craig asked during the ride to the scene, which was still cordoned off by the police because of the high profile status of the victim. Craig then turned the pages of the report in his lap and waited for a response while Aiko drove the car.<br>\r\n<br>\r\n\"There was one, a pop singer, um...Rie Umeda, she confirmed that it was a suicide, she apparently saw the victim jump\" Amelie eventually responded.<br>\r\n<br>\r\n\"Yes well, it might not have been her, remember that\" Craig said cautiously.<br>\r\n<br>\r\n\"I don't need reminding sir,\" a nervous Amelie muttered, \"I have to say, this new drug scares the hell outta me\" she admitted. \"The very idea that someone can steal your body and use it to commit a crime or cover one up, its the stuff of nightmares\" she continued. She then fell silent as she swept her shoulder-length blonde hair behind her ears.<br>\r\n<br>\r\n\"Yes, and that's why we have to bring these bastards down\" Craig nodded, though clearly not overreacting. Craig hadn't told any of his team about the incident with Dust a year or so ago, when one of his best friends, Curt Wilson, had become of the many victims of Dust. A common bank robber had used the drug to take over Curt's body, which was subsequently killed in a shoot-out with police. The robber's own body was found in an alley a couple of blocks away from the bank, having succumbed to the effects of the drug. Craig had requested an overseas assignment after Curt's death, which was what got him posted to Japan, where the issue of Dust had once again reared its ugly head.<br>\r\n<br>\r\n\"You okay sir?\" Aiko asked from the driver's seat as she glanced in the rearview mirror.<br>\r\n<br>\r\n\"I'm fine!\" Craig replied bluntly. \"Thank you!\" he then smiled at Aiko, showing the warmth he still had in abundance.<br>\r\n<br>\r\n\"We're almost there sir\" Amelie then stated, as she gestured to the building a short distance away, which Shintaro Matsuyama had fallen to his death from. When the car pulled up, the four agents stepped out and began inspecting the scene.<br>\r\n</span></div></div>",
            "created":1346907600,
            "id":1422060,
            "title":"Follow Amelie and Craig"
        },
        "15431":{
            "author_id":"rugal",
            "author_name":"rugal b.",
            "choices":[
                "Keep up with \"Amelie\", \"Aiko\" and \"Rie\"",
                "Check in on Daniel"
            ],
            "content":"<div class=\"\"><div> <span>The quartet began looking around the room for any clues they could find to wrongdoing. It was a strange bunch to be sure, the two CIA agents, the Interpol officer Neil and the Tokyo Metropolitan Police detective Aiko. However given the possibility of Dust (which all but Aiko were aware of) and the possible yakuza connections Matsuyama may have had (which is what brought Aiko) the ragtag group was definitely required. They could, however, not find any evidence to support their suspicions of foul play. At that moment someone entered the room.<br>\r\n<br>\r\n\"Who...?\" Craig asked turning to see Rie. \"What's she doing here, this is a crime scene?\" he grumbled.<br>\r\n<br>\r\n\"I'll ask her.\" Aiko stated before speaking to the idol in Japanese, \"What are you doing? This is a crime scene, you shouldn't be here.\"<br>\r\n<br>\r\n\"I... I wanted to come back to pay my respects.\" she replied, \"The officers outside told me it would be a good idea to come up here and talk to you people so you could go over my story personally.\"<br>\r\n<br>\r\nAiko relayed the information back to Craig who merely looked irritated, \"Is she stupid?\" he growled, \"We don't need her fooling around up here. We have her story and we can check its veracity without her.\"<br>\r\n<br>\r\n\"But Mr. Robertson...\" Aiko started.<br>\r\n<br>\r\n\"No buts. She goes.\" he ordered.<br>\r\n<br>\r\nAiko shot him a glare, \"Then I'll go with her back to her apartment.\" she stated.<br>\r\n<br>\r\n\"Are you fucking kidding me, Hayashi? I need you here!\" he exclaimed.<br>\r\n<br>\r\n\"Maybe in America you're taught to do things half-way but here in Japan we're thorough.\" she replied, \"I can interview her there to make sure her story is consistent, then check her apartment for anything out of sorts. The leader of the largest family for the Ando Clan lives in the penthouse of the complex. That doesn't mean Umeda herself has yakuza connections but as the lead detective for Division 4 I will NOT let this opportunity pass me up to do a bit of investigating into that complex.\"<br>\r\n<br>\r\nCraig stared at her but knew that he wasn't going to win. She had the same strong-willed look he'd seen from many other foreign officers who some times resented American agents attempting to bully them. \"Fine, go.\" he replied, \"But report back to me with any findings ASAP.\"<br>\r\n<br>\r\n\"Robertson, sir, I'd like to go with them if that's alright.\" Amelie stated walking up besides Craig.<br>\r\n<br>\r\n\"Fuck, you too?\" he asked in annoyance.<br>\r\n<br>\r\n\"Sir, I'm fluent in five languages: English, Spanish, Japanese, Chinese and Korean so I won't have any problems communicating with Miss Umeda.\" she stated plainly, \"Likewise it would allow us to cover more ground and have access to the same information on the off chance the TMPD isn't willing to play ball.\"<br>\r\n<br>\r\n\"You raise a good point, Owens. I can see why you're so well regarded around here.\" Craig stated. Amelie was 29 but was treated with the respect of someone with two decades of superiority and seniority seen as being all-business and always getting results. \"Alright, go with them.\"<br>\r\n<br>\r\n\"Thank you, sir.\" she stated as she left with Aiko and Rie.<br>\r\n<br>\r\n<div align=\"center\">* * * * *</div><br>\r\n<br>\r\nAs the three women got into Rie's car and started driving Aiko smiled at the singer. \"Good acting job back there Ishikawa. That idiot really thought you were some bumbling girl.\" she stated.<br>\r\n<br>\r\n\"Kondo, you idiot, what are you doing?! Talking so openly in front of the American woman like that!\" Rie, really Shingo Ishikawa once more, exclaimed.<br>\r\n<br>\r\n\"Don't worry, I'm on your side.\" Amelie stated with a smirk. \"We're a lot like you, Ishikawa, playing these roles. In fact, why don't we clear things up about who everyone is.\" She pointed at Rie, \"You're really Shingo Ishikawa, member of the Sawamura family branch of the Ando Clan. You used Dust to kill Matsuyama and have been Rie Umeda, a popular singer, ever since.\"<br>\r\n<br>\r\nShe then pointed towards Aiko, \"You're Masahiro Kondo, a lieutenant for another Ando Clan branch, the Sayama family. For the past six months you've been Aiko Hayashi after she was promoted to lead detective of the organized crime division and promised to crack down on yakuza. Your 'position' allows you to help keep the police off the backs of the Ando clan while continuing to crack down on other yakuza clans.\" she explaiend.<br>\r\n<br>\r\nFinally she pointed to herself. \"I'm William Royce, an American. I was part of the CIA-Mossad joint group that helped to create Dust to make intelligence work much easier. However I saw an opportunity for profit. I took the notes and some of the Dust and smuggled it into Japan three years ago by taking over a rookie agent, Amelie. There I looked up an old contact of mine, a man named Wataru Arai who had been leader of the of Arai family. By the time I got in contact with him again he had become head of the the entire Ando Clan. I offered him the Dust and ensured a constant supply of drugs and weapons for the Ando Clan so long as he would give me a cut of total money from Dust.\" Amelie smiled, \"Obviously he accepted and it didn't take long for Dust to make its way into hands around the world.\"<br>\r\n<br>\r\nIshikawa looked at the agent and detective in astonishment, \"But then how have you been these people for so long? Three years and six months? There would still be gaps when the drug wears off.\"<br>\r\n<br>\r\n\"Ha!\" Royce laughed, \"They tell you that, right? That you only stay in a body for a set time? That if your body dies so do you?\" he asked. \"When your body dies, you 'die' in the sense that the body you're inhabiting becomes your new body. When you take a body, their consciousness is booted into your body which is out of comission due to the effects of the Dust. If your 'real' body dies, that person is the one killed. For all intents and purposes, Amelie Owens and Aiko Hayashi died three years and six months ago respectively.\"</span></div></div>",
            "created":1346994000,
            "id":1422947,
            "title":"Crime Scene Investigation."
        },
        "154311":{
            "choices":[
                "Follow Aiko and Amelia",
                "Follow Shingo"
            ],
            "content":"<div class=\"\"><div> <span>Aiko nodded as she calmly navigated the TMPD car around the office complexes, which seemed to get bigger and more crowded as decades pass by. ''How much did you take?'', she glanced at Rie Umeda's figure reflected on the rear view mirror. <br>\r\n<br>\r\n''Enough for another hour.'', came the reply. ''Why? What are you going to do?'', there was a hint of worry in her words.<br>\r\n<br>\r\n''Ah.'', the car swerved sharply.''Let's stop by my place.''<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nLike any other Japanese living in the overly crowded metropolitan area like Tokyo, Aiko occupied a decent sized room just outside the city centre.<br>\r\n<br>\r\n''Smaller than the last time I went in.'', Amelia chuckled. She ran her hands over the rather plain beige colored wall. There was a small lounge, and even smaller dining area with kitchen combined. The bedroom was barely enough to fit two futons side by side.<br>\r\n<br>\r\n''One of these days...'', Aiko muttered. For Masahiro, slipping into Aiko Hayashi's shoes meant a full time job and the death of his body. Amelia gave her a pat on the back, Rie closing the door behind her.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\n''Shingo, this is what we want you to do.'', Amelia stated. ''You're good, very good, but you still need some more experience.''<br>\r\n<br>\r\n''What? Why?'', Rie protested.<br>\r\n<br>\r\n''You shouldn't have taken Rie. Arai wants her for other things.''<br>\r\n<br>\r\n''Other things?''<br>\r\n<br>\r\n''Put simply, Matsuyama's debt isn't going to pay itself. Rie's under Matsuyama's agency, but after his death, she was planned to slowly switch over to our agency and will be managed by us. But because of what you had done, we need to speed up things and it caused lots of stress for the higher ups, so they decided to send one of the 'goddess'.'', Aiko interjected<br>\r\n<br>\r\n''Sawamura said it was okay!'', Rie exclaimed as she tried to reason.<br>\r\n<br>\r\n''Sawamura knew nothing about the entertainment industry.'', Amelia snorted. Aiko gave a half smile at the remark. ''Look, soon one of the professionals will come, think about what you are going to do with this body and compare it with what will be written in tomorrow's paper.''<br>\r\n<br>\r\n''Fine.'', Rie said, Shingo definitely dejected to lose his fine vessel. But it was only a matter of time before Rie slumped unconcious.<br>\r\n<br>\r\nAmelia walked over to where Rie was seated and caressed her sleeping face. ''Maybe it's about time.'', she cooed. <br>\r\n<br>\r\n''New body?'', Aiko smirked. ''Yeah, I need a holiday too.''</span></div></div>",
            "created":1349154000,
            "id":1439040,
            "title":"Working an idol"
        },
        "154312":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Sticking with Daniel.",
                "Back with \"Amelie\", \"Aiko\" an \"Rie\"."
            ],
            "content":"<div class=\"\"><div> <span>\"Eri, you're acting weird!\" Ayako muttered in a concerned tone as she walked alongside her friend Eri Kawagiri, currently possessed by Daniel Martin. \"Are you okay?\" she then inquired, causing \"Eri\" to look up at her.<br>\r\n<br>\r\n\"I said I'm fine, don't worry!\" Daniel replied in his new voice.<br>\r\n<br>\r\nAnd he wasn't lying, he was reveling being in the 15-year old girl's body, and he apparently didn't have any guilt about taking over Eri's body either. He gazed down at himself again, Eri's body dressed in her school uniform was a pleasing sight, and it was more of a turn-on that he was the one wearing both. When Ayako looked away for a moment to wave at another friend, Daniel reached up and felt his small but perky breasts. \"Oooh!\" he gasped in delight, before dropping his hands back to his sides.<br>\r\n<br>\r\n\"What?\" Ayako asked, making Daniel frown at her.<br>\r\n<br>\r\n\"I didn't say anything!\" he muttered.<br>\r\n<br>\r\n<i>\"This is amazing!\"</i> Daniel thought, experiencing the effects of the drug...and being in control of another's body for the first time. One of his students had been the perfect test subject, and Eri was prettier than most. <i>\"But what are they going to get me to do?\"</i> Daniel then thought, a worried expression appearing on Eri's face.<br>\r\n<br>\r\n\"Eri...?\" Ayako suddenly spoke up again, getting Daniel's attention.<br>\r\n<br>\r\nHe could tell that it was going to be hard getting some time alone with his host body.<br>\r\n</span></div></div>",
            "created":1346994000,
            "id":1423049,
            "title":"Check in on Daniel"
        },
        "1543122":{
            "choices":[
                "Daniel read the newspaper",
                "Follow the Ando clan"
            ],
            "content":"<div class=\"\"><div> <span>A phone call to Aiko interrupted their drive.The detective nodded and said a few words before turning around to face Rie Umeda, holding out the phone for her.<br>\r\n<br>\r\n''What's this?'', Rie frantically whispered as she accepted the phone call.<br>\r\n<br>\r\n''Rie speaking.''<br>\r\n<br>\r\n''Are you retarded?!'', came a female voice from the other end. The tone was serious and chilling, the words reverbrated with supressed anger.<br>\r\n<br>\r\n''It's the boss.'', Aiko mouthed quietly to Rie.<br>\r\n<br>\r\n''B-Boss.'', Rie said nervously, Amelia however chuckled as she continued her drive.<br>\r\n<br>\r\n''Matsuyama had to go, but his debt still needs to be repaid! Why did you even think about taking over Rie?'', the voice was seething with anger.<br>\r\n<br>\r\n''I-I don't know boss.'', Rie stuttered, but realizing it was not the correct answer, she added, ''Sawamura did not say anything against it.''<br>\r\n<br>\r\n''Sawamura?! Sawamura?! He is a fucking idiot! He knows shit about entertainment industry!''<br>\r\n<br>\r\nAmelia watched the scene from the rear view mirror, knowing it would probably take a bit more time, she purposely went around the block for the second time.<br>\r\n<br>\r\n''The next morning, every newspaper in Japan will have the scandal and her name printed on the front page! We can't use her anymore!''<br>\r\n<br>\r\nThe conversation then became a one sided, with the woman on the other end barking and the popstar quietly listening like a scared puppy. It was revealed that Matsuyama scouted Rie Umeda as a last attempt to save him from his increasing debt, gambling on the newly minted idol's popularity. Instead, Matsuyama got overly optimistic and racked more debt to the clan, then Rie Umeda unexpectedly came down with throat infection. Another family within the clan suggested of getting rid of Matsuyama and then sign the healed popstar to an agency owned by the clan.<br>\r\n<br>\r\n''Maybe we could recycle her into a gravure idol.'', Amelia smirked, pulling over. ''Maybe yours too.'', she groped Aiko's boobs with her hands. The TMP detective flinched, but did not say anything.<br>\r\n<br>\r\n''We're not ungrateful however, now as soon as the drug wears off, return to the HQ, we need to talk.'', with that, the conversation ended.<br>\r\n<br>\r\n''How long?'', Aiko asked about when Shingo's Dust would wear off.<br>\r\n<br>\r\n''Four hours.'', Rie said.<br>\r\n<br>\r\nAmelia snorted, ''We can't wait that long! Did you have other plans perhaps for her?'', she threw a container of pills. ''Take one of those, it will forcefully eject you from Rie's body so we can take the princess in for 'questioning'.''<br>\r\n<br>\r\nRie timidly took one of the pill and swallowed, she shuddered for a moment but the went limp.<br>\r\n<br>\r\n''Poor girl, she seemed to be 'tired'.'', Aiko smiled.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nThe next morning, every newspaper printed in Japan featured the article about the popstar who witnessed her producer's death. She claimed to not remember a lot of things, but authorities had dismissed it as signs of stress.</span></div></div>",
            "created":1347512400,
            "id":1426509,
            "title":"The Idol"
        },
        "15433":{
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Shingo got up lazily. The pounding in his head, the all too familiar sensation as if someone was tapping the side of his head with a baton stopped him from doing anything abrupt. It was the after effect of using 'Dust', although lately the pain seemed to last a bit shorter. Still, it was too annoying that he decided to smother the sensation with a couple of generic painkiller. He already missed being in control of another body.<br>\r\n<br>\r\nShingo walked to the front door, glancing at the ripe orange orb rising in the horizon, he decided to get a bite. In this case, two packets of instant noodles and with eggs. The pounding in his head certainly made him in no mood to taste something gourmet, besides, if he wanted to, he could do it later. He went to eat outside on his balcony, gazing at the street of Tokyo below which rapidly getting jam packed with vehicles of various make and color. People earning their daily bread. <br>\r\n<br>\r\nShingo was drawn inside again from the barely discernible sound coming from his TV set. <br>\r\n<br>\r\n''Today the police is continuing the investigation into the death of Matsuyama Shintaro.'', a professionally dressed male anchor said.''The rising popstar Umeda Rie was taken into questioning as witness, although she claimed to not remember many things.''<br>\r\n<br>\r\n''It's clear that Umeda might be suffering from a traumatic experience.'', suddenly the picture went to a bespectacled expert.<br>\r\n<br>\r\n''So far the cause was suicide. Idoltrax had not issued an official statement yet'', the anchor concluded before he moved to another similarly more interesting topic. The weather.<br>\r\n<br>\r\nShingo chuckled, ''Of course it was!''<br>\r\n<br>\r\nSwitching to another channel, he saw Rie Umeda going out from the police station, many fans were there as well, some holding words of encouragement for her. Shingo gazed at her intently and remembered how yesterday he had seen her assets thoroughly. He had made a very interesting video that he sure would enjoy sometime later in the evening.<br>\r\n<br>\r\nFinished eating, he dumped his plate in the sink, as he get ready to do another job. He took another look at the bag of white powder in front of him. <br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nThat night, Craig Robertson looked at several packets of dust secretly stashed away under a secret compartment. He was issued to deal with 'Dust' users in Japan, as CIA began a series of campaign to make the usage of 'Dust' exclusively for themselves again. That story about Curt was definitely a story well spun.<br>\r\n<br>\r\n''How can something like this cause so much trouble.'', Craig sighed. He knew the limitation of the drug. Approximately 50% died from first time use, a reason which until this day was undiscovered. Also, not everyone is susceptible to be possessed by the drug users. He knew by first hand experience when he tried to use the body of a Tokyo Metropolitan Police Department officer to gain access to several files he suspected the Japanese was trying to keep hidden from CIA. Although he did succeed to get the files after using another officer. Craig knew he had to be careful, people who cannot be possessed may also already being possessed by someone else. <br>\r\n<br>\r\nHis thoughts went to his pretty underling, Amelie Owens. She was the one that he needed to keep in check. Or to be exact, he had to appear as a bumbling agent, someone that wouldn't be thought of getting in their way as there is no way he can be sure of everyone being 'clean'. It was hard to appear to be dumb, but not too much, although he had done it succesfully for the last 2 months in Japan. Turning to his file, he ruled out several small clans, they wouldn't have the resources and contact to use the 'Dust' and he suspected whoever was using it, wouldn't freely give it away. They would use it to their advantage. A clan might use it to advance their own business or to get rid of competitor. The problem was, unlike American company, it was hard to see who really owned a business in Japan, due to cross holding and complicated Company Law in the country.<br>\r\n<br>\r\nCraig put back the packets. He had no need of it. Yet.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nAmelie hummed a tune, as she stepped into the shower. Letting the warm water pelted against her whole body, her dainty hands traced her figure, starting from her hip, up to her bosom. She felt how smooth, round and soft they are. Her fingers cupped the two jiggling orbs. Her fingers brushed against her erect nipples. And perky. She then proceeded to masturbate, before it was cut short as she could made out the sound of her doorbell ringing repeatedly.<br>\r\n<br>\r\n''Who is that? At this hour?!'', Amelie cursed, but she quickly wrap herself in a bathrobe. She looked through the eye hole mirror thing to see a smiling Aiko Hayashi in front of her door.<br>\r\n<br>\r\nAmelie let the door open so Aiko can invite herself in.</span></div></div>",
            "created":1352178000,
            "id":1462299,
            "title":"Back with Shingo Ishikawa."
        },
        "154331":{
            "choices":[
                "Another high profile death",
                "Investigations have finally yield a lead"
            ],
            "content":"<div class=\"\"><div> <span>''I hope I didn't intrude.'', Aiko gave her host a meaningful look. She made herself comfortable on a couch, once or twice adjusting her bra straps.<br>\r\n<br>\r\n''You should know to call first.'', Amelie glowered, apparently still pissed about the interruption of her earlier 'session'. ''There's hardly enough quality time for myself.'', she sauntered over to the kitchen, still in her bathrobe. ''What do you want?''<br>\r\n<br>\r\n''Straight to business eh? That's why I like Americans.'', Aiko raised her voice so Amelie could hear her.<br>\r\n<br>\r\n''To drink.'', came the reply. ''Coffee, tea, orange juice, water?''<br>\r\n<br>\r\n''No thanks.''<br>\r\n<br>\r\nMoments later, Amelie came out in her hand, a half full glass of Bordeaux. She took a seat directly across her guest, legs crossed, her thighs exposed. She took a sip from the glass and put it on the coffee table between them. ''So, now, what are you here for?''<br>\r\n<br>\r\n''Sawamura wants to know how things are going in your camp.''<br>\r\n<br>\r\n''My camp? You mean the CIA?''<br>\r\n<br>\r\nAiko nodded. Due to the high profile case, Masateru Sawamura was concerned that it might attract a lot of unwanted attention. Hardly anything can top up the death of a big record producer and having an up and rising pop star as a witness.<br>\r\n<br>\r\n''Well, so far, there isn't much.'', Amelie took another sip from the glass.<br>\r\n<br>\r\n''We're keeping an eye on Tamada.''<br>\r\n<br>\r\n''That guy from Interpol? Why don't you just put your guy in instead?''<br>\r\n<br>\r\n''He got natural immunity.'', Aiko stated, ''But don't worry, we regularly put an agent inside his 12 year old son. If we need to, we can also takeover the wife and his older daughter.''<br>\r\n<br>\r\n''Good job.'', Amelie's face showing a half smile.<br>\r\n<br>\r\nSeveral days later...</span></div></div>",
            "created":1352437200,
            "id":1464269,
            "title":"Reader's Choice"
        },
        "1543311":{
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Shingo rythmitically thrust his pelvis, feeling his member scrape the inside of his female companion's pussy. Beads of sweat trickled down from his temples, trickling down his cheek before they accumulate on his chin with another forceful pounding the drop of sweat landed on the blond's shapely stomach. Shingo shot his load, but he kept pushing, his hands violating the two full mounds attached to the curvacious body. The woman finally reached her orgasm and with a grunt, Shingo shot another load inside. <br>\r\n<br>\r\n''You're being rough tonight.'', the woman spoke in English, she chuckled as she caressed Shingo's chest..<br>\r\n<br>\r\n''Hmmm?'', Shingo gummawed. He looked at his companion. Aside from the blond hair color, she was not much of a looker. Her facial features were more pleasant than that of an idol or celebrity. A smile crept up on Shingo's face, as his gaze went down to the shapely orbs. On the whole, this woman was much better than ones he can find in Kabukichō or other red light district. <br>\r\n<br>\r\nMasateru had given him the contact detail of an expatriat from the United States working for one of the company controlled by the clan as his bonus for the latest job. He tipped that this particular expatriat was young and newly wedded, he added that Shingo would enjoy possessing him, full knowing Shingo's affection for sizable and taut bosom.<br>\r\n<br>\r\nShingo pulled the female close to him and kissed her full of lust. His hand fondled her bosom and he felt his flaccid member beginning to rise again.<br>\r\n<br>\r\n<div align=\"center\">*****</div><br>\r\n<br>\r\nWhile Shingo was enjoying his night, Craig was walking through the pouring rain. His destination was a massive corporate building, known to all in the area as the HQ of Yamamura clan. Formerly the most affluent of its kind, the clan was reduced into a shadow of its former self when some members were caught with copious amount of crack cocaine, although the members later denied to remember anything about it. Some others went on rampage, killing civilians and police and some turned to their own boss and clan brothers before killing themselves off after the deed. At first, the police was pleased to see what they thought of a crumbling yakuza clan. One less to deal with. It was short-lived however, as other clan enroached on business formerly owned by the Yamamura.<br>\r\n<br>\r\nThe building was cordoned off, flashing his ID to a policeman, Craig bypass the security to arrive at the topmost floor. He smiled as he saw Amelia, Aiko and Neil already standing among other police forces present. <br>\r\n<br>\r\nIt was a grand room, a testament of the clan's former glory. Right in the middle of the room was a massive oak table and chairs around it. It was a place where the most important meetings take place, but that day, it was filled with police and forensic examining the death of an aged man slumped on the table. Craig looked around to see index cards on the floor desribing the gun that blew a neat hole across the man's skull. Some steps away, a bullet projectile was found.<br>\r\n<br>\r\nCraig observed the facial expression of the people he knew. Amelie was mostly concerned. Neil looked at the figure grimly. Aiko just looked at the whole scene coolly. The CIA agent put on his rain soaked jacket and exited the building. Several meters down the road, he stopped at a Starbuck to meet a smartly dressed salaryman.</span></div></div>",
            "created":1352610000,
            "id":1465635,
            "title":"Another high profile death"
        },
        "154332":{
            "author_id":"rugal",
            "author_name":"rugal b.",
            "choices":[
                "With Amelie and Aiko",
                "With Daniel and Shingo"
            ],
            "content":"<div class=\"\"><div> <span>''I hope I didn't intrude.'', Aiko gave her host a meaningful look. She made herself comfortable on a couch, once or twice adjusting her bra straps.<br>\r\n<br>\r\n''You should know to call first.'', Amelie glowered, apparently still pissed about the interruption of her earlier 'session'. ''There's hardly enough quality time for myself.'', she sauntered over to the kitchen, still in her bathrobe. ''What do you want?''<br>\r\n<br>\r\n''Straight to business eh? That's why I like Americans.'', Aiko raised her voice so Amelie could hear her.<br>\r\n<br>\r\n''To drink.'', came the reply. ''Coffee, tea, orange juice, water?''<br>\r\n<br>\r\n''No thanks.''<br>\r\n<br>\r\nMoments later, Amelie came out in her hand, a half full glass of Bordeaux. She took a seat directly across her guest, legs crossed, her thighs exposed. She took a sip from the glass and put it on the coffee table between them. ''So, now, what are you here for?''<br>\r\n<br>\r\n''Sawamura wants to know how things are going in your camp.''<br>\r\n<br>\r\n''My camp? You mean the CIA?''<br>\r\n<br>\r\nAiko nodded. Due to the high profile case, Masateru Sawamura was concerned that it might attract a lot of unwanted attention. Hardly anything can top the death of a big record producer and having an up and rising pop star as a witness.<br>\r\n<br>\r\n''Well, so far, there isn't much.'', Amelie took another sip from the glass.<br>\r\n<br>\r\n''We're keeping an eye on Tamada.''<br>\r\n<br>\r\n''That guy from Interpol? Why don't you just put your guy in instead?''<br>\r\n<br>\r\n''He's got natural immunity.'', Aiko stated, ''But don't worry, we regularly put an agent inside his 12 year old son. If we need to, we can also takeover the wife and his older daughter.''<br>\r\n<br>\r\n''Good job.'' Amelie replied, her face showing a half smile. \"And a good job deserves a good reward, don't you agree?\" With that she moved around the coffee table and onto Aiko's lap straddling her. She looked down at Aiko's face and smiled. \"You look so beautiful, dear, you know that?\"<br>\r\n<br>\r\n\"And you are an exquisite example of Western beauty Amelie.\" Aiko replied as she placed her hands on Amelie's hips.<br>\r\n<br>\r\n\"Well, I suppose our bodies are anyway...\" Amelie muttered, \"Hmm, but I'm glad you came. I was starting to feel a little... lonely.\"<br>\r\n<br>\r\nAiko smirked, \"That <i>is</i> a shame. Well then perhaps I could help you with that.\" she said as Amelie brought her head down and their lips met.<br>\r\n<br>\r\nAmelie Owens and Aiko Hayashi, or rather William Royce and Masahiro Kondo, had met when brought together by Masateru Sawamura to keep an eye on the newly arrived Craig Robertson after he had come to Japan to investigate a potential connection between Dust, the yakuza, and the apparent suicide of a local politician five months ago. It had been love at first sight for the two, even after learning one another's true identities.<br>\r\n<br>\r\n<div align=\"center\">* * * * *</div><br>\r\n\"Come on Ayako-chan, there's a love hotel a few blocks down. We can go in and enjoy ourselves the way we both want to.\" The older salaryman stated<br>\r\n<br>\r\n\"But I don't want to enjoy myself that way!\" Ayako protested.<br>\r\n<br>\r\n\"A pretty girl like you surely has enjoyed herself that way many times in the past.\" the man smiled as he grabbed her wrist.<br>\r\n<br>\r\nAyako tried to push him away however he was too strong and besides his grip on her wrist was inhibiting things. He leaned in to kiss her but very suddenly his body jerked and spasmed a bit before settling back to normal. He leered down at her. \"You really are a pretty girl... right Daniel-san?\" the man smiled.<br>\r\n<br>\r\n\"D-Daniel...?!\" Ayako exclaimed in shock, \"I... I don't know what you're talking about!\"<br>\r\n<br>\r\n\"Please, you couldn't have made yourself any more obvious.\" the man stated with a grin, \"When Eri Kawagiri went on a date with an older man and then left money at your apartment we found that a bit strange. When Ayako Nishimura did it, well that was certainly suspicious. And then Kawagiri did it once more yesterday. And then one of our men saw Nishimura with an older man again tonight.\" As he released Ayako's wrist he added, \"Enjo kosai isn't for good girls like them, you know?\"<br>\r\n<br>\r\nAyako brushed a bit of dyed light brown hair out of her face and crossed her arms. \"So who are you and what do you want?\" she asked incredulously.<br>\r\n<br>\r\n\"My name is Ishikawa, Shingo Ishikawa.\" the man stated.<br>\r\n<br>\r\n\"Ishikawa? The person that was inside Rie Umeda?\" Daniel asked.<br>\r\n<br>\r\n\"The same.\" the man nodded, \"And if I'm here you know that means that you're going to pay back a bit of your debt.\"<br>\r\n<br>\r\n\"H-How?\" Ayako asked suddenly nervous.<br>\r\n<br>\r\n\"Something simple: a man named Isamu Kojima runs the STARLIGHT club in Roppongi has stopped paying his protection money. So we go, pay him a visit, and put a bit of a hurting on him until he agrees to pay and likewise make sure another clan isn't trying to muscle in our turf.\" Ishikawa stated. \"We'll do it tomorrow and since the man is known to be a bit of pervert with a taste for younger girls we'll take Nishimura here and Kawagiri, go on a little date to get him alone, and then...\"<br>\r\n<br>\r\nAyako gulped. Daniel had known this time would come sooner or later.</span></div></div>",
            "created":1362805200,
            "id":1546917,
            "title":"Reader's Choice"
        },
        "1543322":{
            "author_id":"rugal",
            "author_name":"rugal b.",
            "choices":[
                "Talk",
                "Run for it"
            ],
            "content":"<div class=\"\"><div> <span>\"So, are you ready for a little bit of fun?\" Eri asks as she places a hand gently onto Isamu Kojima's stomach with a smile.<br>\r\n<br>\r\n\"Haha! Direct! Much different from what I'd expect from a cute girl like you but it's a pleasant surprise.\" Isamu states with a grin before looking over to Eri's partner, \"Ah but you, you're much more quiet.\"<br>\r\n<br>\r\n\"I... don't have much experience with this.\" Ayako says glancing off to the side uncomfortably. Daniel had been to love hotels before but never from the opposite side... though that's not what he was referring to.<br>\r\n<br>\r\nIsamu just laughed, \"It's quite a sight. You look more like the type of girl who would know a thing or two about this, eh? But it turns out you're more innocent while your innocent looking friend...\" he turns to leer at Eri.<br>\r\n<br>\r\n\"Oh Kojima-san, I know so much you'd be surprised.\" Eri states with a smile before shoving a surprised Isamu onto the bed. \"So why have you stopped paying your protection money?\" she asks.<br>\r\n<br>\r\n\"My... my what?\" Isamu asks confused.<br>\r\n<br>\r\nEri sighs before placing a foot onto his testicles and pushing down. Hard. \"The month of protection money you owe to the Ando Clan.\" she presses down a little harder causing him to yelp in pain.<br>\r\n<br>\r\n\"I don't... I don't know what you're...\" Isamu starts but he's cut off by Eri punching him in the jaw with one hand. \"I'm telling you I don't...\" another scratches across his cheek leaving red gashes that start to bleed.<br>\r\n<br>\r\n\"Are you ready to fess up?\" Eri asks once more. \"If not... well, you've got a daughter in university right? Very pretty girl if I'm not mistaken. We could always... get her into AV...\"<br>\r\n<br>\r\nIsamu's eyes go wide at that. \"D-Dust...\" he mutters to himself. \"Please! Please leave my family alone! I'll... I'll pay! With interest even!\"<br>\r\n<br>\r\n\"That's a good start.\" Eri says with a smirk, \"So why'd you stop paying? Someone wouldn't happen to be trying to cut in on our turf would they?\"<br>\r\n<br>\r\n\"You... your clan seemed occupied so I thought I could get out of it.\" Isamu strains.<br>\r\n<br>\r\n\"What's that?\" Eri asks pressing down even harder with her foot, \"You tryin' to bullshit me you old pervert?\"<br>\r\n<br>\r\n\"I'm telling the truth...!\" Isamu exclaims, \"I promise!\"<br>\r\n<br>\r\nWith that Eri hesitates for a moment before removing her foot. \"I'll take your word for it but you better be telling the truth old man. Otherwise your girl's going to become the next big AV star. And maybe we'll get her sister in on it. There'd be good money in having an ACTUAL schoolgirl.\"<br>\r\n<br>\r\n\"You bastards.\" Isamu mutters as Eri walks out the room grabbing Ayako and laughing.<br>\r\n<br>\r\n\"I told you, Daniel, it would be easy.\" Eri grins, \"As long as I did the work of course. Consider that part of your training.\"<br>\r\n<br>\r\n\"You weren't going to really take over his daughter were you? And make her a porn star?\" Ayako asked unnerved by everything, \"How did you even know he had a daughter?\"<br>\r\n<br>\r\n\"Please, he's one of the biggest nightclub owners in the biggest nightclub district around. Everyone knows about him.\" Eri stated before grinning once more, \"As much of a dirty old man as he is, he treats his daughter like a princess. Who do you think talked him into going to the Ando Clan after a week of punks trying to rough up his patrons and club, huh?\"<br>\r\n<br>\r\nAyako, or rather Daniel, shuddered. This Shingo Ishikawa was incredibly good at his job as the clan's top enforcer. However moreso than that something else was starting to get his attention, \"Shouldn't we have gone back to our bodies by now?\"<br>\r\n<br>\r\nEri shrugged, \"Some times how long you stay varies. Some times it's a few hours, some times a night, some times 24 hours. Depends on how much you took and as you use it more you build up a tolerance letting it wear off slower.\"<br>\r\n<br>\r\nHowever things became grim as they got back to Daniel's apartment and noticed it was cordoned off. They ran over to a crowd that had gathered. \"What's going on?!\" Ayako asked worried.<br>\r\n<br>\r\n\"It's terrible.\" Jun Ozaki, a single mother in her early 30s who lived in the apartment next to Daniel said. \"My neighbor and a friend of his were found dead in his apartment. I went to take something to him and noticed the door was open a bit so I let myself in and then... then...\" she gets distant, \"It was... it was drugs. And they think the other man was yakuza. He was a foreigner but he always seemed so nice and quiet so how did...\"<br>\r\n<br>\r\nAyako and Eri both look at each other mortified and go in to try and get a better look. As they do a young girl, no older than 12, walks over to Jun. \"Who were they?\" she asks.<br>\r\n<br>\r\nJun just shrugs, \"Fuck, Sam, it's still weird being in this chick's body.\" she says.<br>\r\n<br>\r\n\"No shit Marcus but at fuck at least you got tits.\" the girl, Ayumi Yamada, states.<br>\r\n<br>\r\nJun laughs, \"Don't give me that shit Sam. You're the one who exclusivesly takes over those, what do you call 'em, lolis?\"<br>\r\n<br>\r\n\"If we're gonna push this shit it helps to have an advantage.\" Ayumi states, \"You ever seen a grade schooler or middle school girl push drugs on some junkie or some low-level yakuza guys? It unneves them and shows them just what you can do with this shit.\" She then smirks, \"And what can I say, I like these bodies.\"<br>\r\n<br>\r\nJun just shakes her head, \"I knew this asshole. We crossed paths a few times. I'm surprised you didn't, most of us English teachers know each other.\" she laughs, \"Still, it'll teach him for holding out on us and trying to cut in on our turf.\"<br>\r\n<br>\r\nMeanwhile as Ayako and Eri push their way through the crowd they bump into two women and two men, all law enforcement of some sort it seems. \"Let us through!\" Ayako exclaims, \"That man was... he was a teacher of mine and my friend's and...\"<br>\r\n<br>\r\nThe four turn to look at the two (now) girls. Then the two women nod as the two men step inside the apartment. \"I'm Detective Aiko Hayashi, TMPD. This is Amelie Owens, works for the American government, assisting on this.\" states Aiko with a smile, \"We think it may have some connection with some other strange deaths and if you're his students, well, we'd like to talk to you. Just me and Amelie-san.\"<br>\r\n<br>\r\nAyako and Eri, Daniel and Shingo, looked at the cops and then at one another, before deciding to...</span></div></div>",
            "created":1365570000,
            "id":1569174,
            "title":"With Daniel and Shingo"
        },
        "155":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "South Korea",
                "Indonesia",
                "other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And then, Dust is introduced in the other country.</span></div></span></div>",
            "created":1512164760,
            "id":2422662,
            "title":"In another part of the world."
        },
        "1551":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "'Dust' flow into the North.",
                "Chimera in Policewoman body.",
                "Dust invasion in airplane."
            ],
            "content":"<div class=\"\"><div> <span>\"Seo-jun, I have a new stuff for you.\" The young man in the dirty outfit said to other one who wear like a rapper. \"This is the 'Dust',a new drugs from America. Wanna try it for free, Chimera?\"<br>\r\n<br>\r\nThe rapper one is Kim Seo-jun, an infamous  black hat hactivist in South Korea who everyone known as 'Chimera'. and the dirty one is an ordinary drug dealer  who Kim known and usually by his drugs.<br>\r\n<br>\r\n\"OK, Give me a stuff.\" After Kim answer him. Drug dealer send a bag of white powder to him. \"Take it and told me about your fun.\"<br>\r\n<br>\r\nKim inhaled a white powder through an iron straw. But before the drug activated. They will be interrupted by policewoman who passed by.<br>\r\n<br>\r\n\"Freeze!!! Police. Raise your hand, You are arrested.\" She came to Kim and drug dealer to arrested them. The drug dealer raise his hand but said pervertly \"Oh!! Fuck, She is Kim Miso, Former miss maxim. If i survived, I will fuck her.\"<br>\r\n<br>\r\n\"Silent!!!\" Policewoman said and take a handcuffs to him. But before arrest Kim, He began a spasm and knocked unconscious.<br>\r\n<br>\r\n\"Hey, Wha-\" Policewoman shocked about his act. But before she do anything, She began a spasm. Her eyes roll back into her head. And then, Kim is coming to control her body confusedly.</span></div></div>",
            "created":1512894600,
            "id":2426174,
            "title":"Kim Seo-jun, 'The Chimera of Seoul.'"
        },
        "15512":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "MAXIM DDos.",
                "Chaebol Strip club."
            ],
            "content":"<div class=\"\"><div> <span>Kim feel heavier on his upper body more than usual because 'his' new breast. And his hair longer than before. When he saw his body. He shocked immediately.<br>\r\n<br>\r\n\"What the fuck is this? Why i turn into this policewoman?\" Kim said through her lips. And then, He talk with the drug dealer about this change. \"Min-ho, What is this stuff? What happened to me huh!!!\"<br>\r\n<br>\r\n\"Hey, Girl. You're acting strange. Why you said like you are not yourself?\" The Drug dealer confusedly asked 'policewoman' but he continued pervert to 'her'.<br>\r\n<br>\r\n\"I'm Kim Seo-jun.\" And then, Kim said through policewoman body. and the drug dealer refused it. \"No, You are Kim miso. Kim Seo-jun is my friend who laid here.\"<br>\r\n<br>\r\n\"Eh?\" Policewoman body walk to 'his former body' with confusion. \"This is my body. What happened? Why i am inside her body like this?\"<br>\r\n<br>\r\n\"Oh!!! Seo-jun, I just thought of it.\" The drug dealer answer Kim in policewoman body. \"I heard about the mind transfer drugs in America, When you inhaled or ingested that drug, You can project your mind into other people's bodies and take control of them for a period of time. Maybe the 'Dust' is that drug.\"<br>\r\n<br>\r\n\"Holy shit!\" Kim said through Kim's lips again and facepalm. \"Because of you Min-ho, I become this woman because of you.\"<br>\r\n<br>\r\n\"Don't feel bad Seo-jun. Please help me.\" The drug dealer beg for his help. Kim will come to unlock his handcuff and listen him. \"like your hacker life Seo-jun. But you hack her body, not ID.\"<br>\r\n<br>\r\n\"Okay.\" Kim Calm down. But He think about her and his body again. \"When the dust wear off. What's happened on her body?\"<br>\r\n<br>\r\n\"No, I don't know about that.\" Drug dealer said. \"But I heard some information about this drugs. It said 'When they regain control, They will not remember about the time their possessed.'\"<br>\r\n<br>\r\n\"Why you worry about it, Seo-jun? You are in the cyber war with Chaebol. You are the assassin who declared the war to the templar. You don't care about her.\"<br>\r\n<br>\r\n\"Because she is civilian, not Chaebol member. I don't wanna harm an innocent.\" Kim answered him and walking to far away from his own body. And then, She will began a spasm again and Kim depossessed her.<br>\r\n<br>\r\n\"Min-ho, Please search about this drug and take it to me.\" Kim said to drug dealer. and open the smartphone. \"I will hack this monopoly templars. People will be equal in economic.\"</span></div></div>",
            "created":1512925080,
            "id":2426298,
            "title":"Chimera in Policewoman body."
        },
        "1553":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "Philippines Second war on 'Dust'.",
                "Silent protest in Malaysia.",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>'Dust' invasion report in other asian country : <br>\r\n<br>\r\n1.Philippines - This is the revenge of the drug dealer and rebels. 'Dust' introduced in Philippines after 'War on drugs'. Because of this, The drug dealers who survived the war inhaled the 'Dust' themselve and declared the war to government alongside rebels.<br>\r\n<br>\r\n2.Malaysia - Silent Wars has begun. The 'Dust' introduced by some of the protester in 2016 protest. They use it to counterattack the government, control the celebrities for use his or her popularity in the future protest, or make a scandal of the cabinet.<br>\r\n<br>\r\nReport finished.</span></div></div>",
            "created":1512999540,
            "id":2426705,
            "title":"other."
        },
        "15533":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "Vietnam come to the war.",
                "Singapore protest or other."
            ],
            "content":"<div class=\"\"><div> <span>'Dust' report in Asia : Part 2.<br>\r\n<br>\r\nVietnam - South China Sea's Curse, Vietnamese warship open fire at chinese ship because of 'Dust'. Make a tension in ongoing territorial disputed.<br>\r\n<br>\r\nSingapore - Paradise Lost, The new 'Tiananmen event' is begin!!! Singaporean soldier who controlled by 'Dust'  driving a tank to trampled on the civilian. And then, the People began a protest.<br>\r\n<br>\r\nReport finished. </span></div></div>",
            "created":1513033680,
            "id":2426838,
            "title":"other."
        },
        "155332":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "Singapore protest.",
                "Central Asia"
            ],
            "content":"<div class=\"\"><div> <span>'Dust' invasion report in Asia : Part 3<br>\r\n<br>\r\nCentral Asia - 'Stan spring' begin, Uzbekistan is the first 'Dust Invasion' countries in Central Asia. Uprising of islamist, democracy movement and hactivist is the majority of 'Dust rebellion'. And the war is  coming to all hermit state in this region.<br>\r\n<br>\r\nReport Finished.</span></div></div>",
            "created":1513066080,
            "id":2426992,
            "title":"Singapore protest or other."
        }
    },
    "info":{
        "author_id":"seuzz",
        "author_name":"Seuzz",
        "brief_description":"The creation of a powerful drug heralds a whole new era of terror.",
        "created":1342988820,
        "description":"<td align=\"left\" class=\"norm\"><span class=\"cred\"><b>Liara T'Soni is the original author of this story, and asked me to take it over. I will host it for as long as necessary, but if anyone else would like to take it over from me, send me an email here at WdC. --Seuzz<br>\r\n<br>\r\nLiara T'Soni's original \"About this Story\":</b></span> It's simply called 'Dust', a new drug that resembles salt but is much more potent than any other illegal substance. Once inhaled/ingested, the person can project their mind into other people's bodies and take control of them for a period of time. The length of time depends on the amount of Dust that is used. First time users have a 50% chance of dying after taking the drug, and if their body dies...they will too. The body they are inhabiting at the time will remain unharmed, circumstances permitting, and that person will regain control of their body with no memory of anything once the 'intruder' has 'faded' away.<br>\r\n<br>\r\nOnly a small (unknown) government agency in the United States and Israeli intelligence are aware of the existence of the drug, with knowledge of it being kept from the normal authorities and the worldwide public to avoid a mass panic. However, the drug is now falling into the hands of drug cartels in Central and South America, criminal gangs in North America and Europe, the Chinese Triads and terrorist groups across the globe.<br>\r\n<br>\r\nHow do you fight an enemy you can't see? An enemy who can be anyone? An enemy without morals willing to use innocents to achieve their goals...<br>\r\n<br>\r\n<span class=\"cred\"><b>Rules:</b></span><br>\r\n<br>\r\n<b>There are none...<br>\r\n<br>\r\n...The enemy don't play by rules.</b><br>\r\n<br>\r\n<b><span class=\"cred\">That said, I do not want this story to be just mindless violence and sexual acts. A plot would be nice.</span></b></td>",
        "id":1881196,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1592068226/item_id/1881196.jpeg",
        "last_full_update":1592071800,
        "modified":1592071800,
        "pretty_title":"Dust To Dust"
    }
}