{
    "chapters":{
        "1":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Chad's principle asks him to see him in his office after PE",
                "Chad's whole PE class follow suit and stay barefoot after class",
                "The PE coaches take Chad's simplicity and go barefoot too",
                "Chad gets teased in the shower by his teammates...tickling him all over",
                "Jackson secretly tells Chad that he has a foot fetish and loves Chad's bare feet"
            ],
            "content":"<div class=\"\"><div> <span>On the morning of his 13th birthday, Chad wakes up late from a deep sleep. He jumps barefoot out of his top bunk and heads to the bathroom to take a shower. He returns to his bedroom with a towel around his waist. Water is still dripping from his buzzed blonde hair and onto his semi-tan, hairless, pre adolescent physique body. Chad quickly dresses in a polo shirt, khaki shorts and walks barefoot out to the kitchen.<br>\r\nHe sits down still barefoot at the kitchen table as his mom serves him his breakfast.<br>\r\nHis mom says \"Happy Birthday Chad...the big thirteen today. What a handsome young man!\" Chad blushes and says \"Thanks Mom. Is this my birthday breakfast?\"<br>\r\nChad's mom replies \"Yes, but we'll go out to dinner tonight after you get home from school. Are you going like that or at least put some flops on your bare feet?\"<br>\r\nChad replies \"Come on mom, it's my birthday. You know I love to go barefoot everywhere.\"<br>\r\nChad'l mom says back to him \"But it's snowing outside. Do what you want, but at least put some flops on, so your bare soles won't freeze!\"<br>\r\nChad looks outside and says \"O--kay...but I'm taking them off at school.\"<br>\r\nLater at school, Chad enters the hallway barefoot, carrying his backpack with his flops hanging off the side. His friends Jackson and George are standing by their lockers and spot their friend Chad. <br>\r\nAs Chad trots up, they both say \"Happy Birthday dude!\" They both look down at his bare feet. Chad wiggles his toes.<br>\r\nJackson says \"Aren't your feet cold Chad?\" George pipes in saying \"Yeah, it's freezing outside...why aren't you wearing shoes?\"<br>\r\nChad replies \"Come on guys, you know I like to go barefoot all the time. My mom made me wear flops to school, but I took them off when I got inside. My toes get cramped in shoes and I get blisters easy, so I decided to go barefoot everywhere.\"<br>\r\nJust then the bell rings and everyone races to their classrooms. Chad runs barefoot to his class down the hall.<br>\r\nA moment later, Chad enters and sits in the front row of desks in the middle. His fellow classmates file in and some notice Chad's bare feet sticking out in front of his desk. <br>\r\nThe teacher walks in and puts his belongings down on his desk. The teacher says \"Good morning class.\" The class responds \"Good Morning Mr. Hopkins.\" Mr. Hopkins smiles and looks around the class and then spots Chad's bare feet in the front row. <br>\r\nMr. Hopkins says \"Uh Chad, are we playing Huckleberry Finn today?\" Chad looks at him funny, then looks down at his bare feet. As Chad splays his pedicured, slender toes, he replies \"Mr. Hopkins, today is my birthday and I wanted to go barefoot today, in fact, everyday. Wearing shoes gives me blisters and wearing socks make my feet sweat.\" Mr. Hopkins looks closer at Chad's bare feet and toes then says \"Well, you do have nice looking bare feet Chad, but it's in the middle of winter outside. I'll let you go barefoot today since it's your birthday, but after today, it's shoes until spring...okay?\" Chad nods his head and wiggles his toes. A girl smiles at Chad making him blush.<br>\r\nLater during PE, Jackson and Chad are playing basketball. Both boys are in the PE uniform, but Chad is barefoot. He says to Jackson \"Uh do you mind taking your shoes off so you won't step on my bare feet?\" Jackson looks down at Chad's bare feet and replies \"Sure, why not, maybe I can shoot better without shoes on anyways.\" Jackson kicks off his shoes and tosses them against the wall. He is wearing some calk high dark socks on his feet. Jackson continues \"Ahh, much better. My toes love to be free of shoes too.\"<br>\r\nChad replies \"Your feet would feel better bare. Go ahead Jackson lose the socks too!\"  Chad smiles as Jackson quickly peels off his dark socks and throws them by his shoes. He splays his lightly tan, pedicured, long slender toes on his smooth, hairless bare feet.<br>\r\nChad says \"Now isn't that better?\" Jackson looks down at his bare beauties and replies \"My gosh Chad, your right. I love walking barefoot especially on this wooden gym floor.\"<br>\r\nBoth boys continue their game of basketball in their bare feet. Their classmates see them both barefoot and decide to shed their shoes and socks and play basketball in their bare feet. Soon, the whole gym floor is covered by hundreds of bare feet of different shapes, colors and sizes.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1518451020,
            "id":2452106,
            "title":"Chad wakes up from a deep sleep"
        },
        "11":{
            "choices":[
                "Chad gives Principal Kyle a foot job.",
                "Chad reaches for Principal Kyles pants and scoots down on the floor.",
                "More choices at what happens next .",
                "There was a knock at the door."
            ],
            "content":"<div class=\"\"><div> <span>As gym class was about over, coach got a text telling you to stop by the principals office directly after class.<br>\r\n<br>\r\nAfter you got the message the bell rand ending the class, as you walk down the halls towards the principals office, you look down at your feet and notice how cute they are, kind of getting turned on by your own sweet feet.<br>\r\n<br>\r\nBefore you knew it you are at the principals office and tell his secretary he was sent for, his secretary calls him and sends you in......... opening the big wooden door you see Principal Kyle sitting behind a huge desk \" Please come in Chad and close the door\" you walk into the room and close the door but before you took a seat in front of his desk Principal Kyle said \" Uh Chad would you mind doing me a favor and go ahead and lock the door, we don't want anyone barging in as we talk.... thank you Chad\" <br>\r\nYou take the few steps back towards the door and lock it as you turn and say \" No problem Principal Kyle, sooooo  what was it you wanted to see me about ? \"<br>\r\n<br>\r\n\" Well you know Chad that here in school no one gets special treatment and for you to go barefoot all day at school when nobody else can just doesn't work \"<br>\r\nChad sits down across from Principal Kyle and brings up his small soft feet and said \" I understand Principal Kyle but I just cant stand putting my feet in socks or shoes, look how soft and smooth they are \" <br>\r\n<br>\r\nPrincipal Kyle leans over his desk and examines Chads soft feet and says he needs a better look as he stands up and walks over to stand in front of Chad .<br>\r\nPrincipal Kyle then reaches out and grabs Chads soft feet in his hands and that's when Chad sees that Principal Kyles cock is straining inside his pants......<br>\r\n<br>\r\nAs Principal Kyle is holding Chads feet he looks over into Chads eyes and tells him \" You know you really do have beautiful feet Chad, I bet you could do a LOT of things with such pretty feet, as he looks at Chads feet, then up into Chads eyes and then down to his bulge and again back into Chads eyes ... \" You know I think that we could work something out and be able to let you go barefoot today but you will have to do me a favor as well .....<br>\r\n<br>\r\n...........And that favor was ..........</span></div></div>",
            "created":1519641840,
            "id":2457871,
            "title":"Chad's principle asks him to see him in his..."
        },
        "14":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "content":"<div class=\"\"><div> <span>After PE, Chad and Jackson and his classmates head to the locker to shower and change. Chad quickly strips off his uniform and wraps a towel around his waist and heads toward the showers. Just then, his fellow classmates and friends begin to mock him and singing happy birthday to him. They jab, poke and prod him as he walks into the shower area. As he takes off his towel and turns on the shower, a couple of nearby buddies begin to tickle his tan chest, arms and rib cage. Chad squirms and tries to block their hands. More hands come in and begin to tickle his bare legs and bare feet. Soon he's on the ground in a fetal stage trying to protect himself. His unprotected bare feet are being unmercifully tickled and rubbed. Chad is laughing but also moaning at the same time. His classmates pick him up and carry him over their heads buck naked and parade him around the locker room for all to see. <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1518533580,
            "id":2452429,
            "title":"Chad gets teased in the shower by his teammates..."
        },
        "15":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Jackson has his way with Chad's bare feet",
                "Chad makes Jackson hard and explode",
                "After satisfying each other, they leave and grab lunch",
                "Chad's next class is swimming which bare feet are welcome"
            ],
            "content":"<div class=\"\"><div> <span>As they both get dressed in the locker room, Jackson can't help but stare at Chad's bare feet. Chad wiggles his toes as he buttons his shirt which makes Jackson even more antsy. Jackson puts his shoes and socks on as he continues to admire Chad's feet.<br>\r\nChad says \"Jackson, did I tell you what my uncle gave me for an early birthday present?\" Jackson shakes his head, but doesn't move his eyes off Chad's bare beauties. <br>\r\nChad continues and says \"I was visiting him before Christmas and he asked if I had gotten a body massage. I said no...but maybe just my back a few times and my mom rubs my feet from time to time. He says if I was game, he could have me experience a genuine massage. I told him I was a little nervous, but I'd go through with it. We drive over to the other end of town to this nice looking building with greenery all over the outside. I follow my uncle inside and am introduced to his personal masseur named Pedro. <br>\r\nPedro leads me back thru a elegant, dimly-lit hall to a room and we both go inside. He turns on the low-lighting and adjusts the temperature and then tells me to get undressed. I gulped and sat down on the padded table with a sheet. Pedro said there was nothing to worry about. He said my uncle enjoys his nude massages, but said that I could dress down to my comfort level, so I took off my windbreaker jacket and slipped off my shoes. He chuckled and said I needed to take off more than that. Pedro handed me a towel and told me my waist would be covered with it. I gingerly smile at Pedro and slip off my shirt exposing my tan, hairless chest, then took my shorts off leaving me clad in my boxers and socks. I hop myself up onto the table and lay on my stomach and sigh. Pedro covers my waist with the towel, then lifts my ankles and rests them on a pad underneath the sheet. He asks me if he could take off my boxers and socks, so the oil wouldn't stain them. I'll be naked I exclaimed to him. Pedro smiled and said he has seen hundreds of naked bodies and mine would be no different. He reaches underneath the towel and pulls down my boxers off my legs. My penis was little stiff, but at least I was face down. Pedro lifted each of my legs and peeled off my two socks exposing my tan bare feet. I splayed my toes as he lightly massaged them and my bare soles. He complimented the smooth texture and color of my feet along with my slender, pedicured toes. <br>\r\nPedro begins by spreading warm oil all over my backside removing the towel and applying some to my buttocks which felt good. His tough hands worked it all in from my shoulders to my soles. I groan and moan as my muscles are worked on. As Pedro massages my legs and bare feet, I begin to feel strange in my penis region. I try to think of something sad, but it doesn't help. Just then he asked me to turn over onto my back. He places the towel over my waist, but my erection sticks out like a sore thumb. I apologized to Pedro and he did something I couldn't believe he did.\" Jackson is now giving Chad's feet a light massage and says \"What did he do?\" Chad splays his toes and says \"He took the towel off exposing my erection and began to stroke it. I began to really moan and thrash around, feeling like I would burst. At the point I exploded, I splayed my toes and sent several gushers into the air that landed on my stomach and chest. I just laid there in complete exhaustion as Pedro cleaned me. He explained that several points in the foot, upper legs and other areas stimulate the penis of most men. He said I had my first ejaculation.\" Chad looks over at Jackson who is now caressing his bare soles and sucking on his toes. Chad takes off Jackson's shoes and socks and tantalizes his friend's bare feet.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1518579960,
            "id":2452594,
            "title":"Jackson secretly tells Chad that he has a foot ..."
        },
        "152":{
            "choices":[
                "Jackson picks his house after school.",
                "Chad offers his house after school.",
                "More Ideas where to get his massage ......"
            ],
            "content":"<div class=\"\"><div> <span>Chad looks directly into Jackson's eyes and asked him \" Jackson... would you like me to give you a massage like Pedro did to me ? \" <br>\r\n<br>\r\nJackson's mouth was hanging open and he could not speak, here was his best friend actually asking him if he wanted to get naked and receive a massage after telling me what happened with his massage ... Jackson just nodded his head yes .<br>\r\n<br>\r\n\" Ok then great, why don't you lay down on the bench there and we will begin \"  Jackson's penis was already hard and he nervously looked around as the other boys were still in the shower.<br>\r\n<br>\r\n\" Ahh I get it Jackson, you want to be somewhere more private\"  as Chad looks towards the showers,  \" well yes Chad, I cant let you give me a \"massage\" ( as he looks down at his penis) here with all the other boys ...<br>\r\n<br>\r\n\"Ok I got it, well then where and when would you like my massage? \" </span></div></div>",
            "created":1519606320,
            "id":2457710,
            "title":"Chad makes Jackson hard and explode"
        },
        "1521":{
            "choices":[
                "Go to after school now.",
                "Something happens in school first.",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Jackson suggests you both go to his house after school and you could give him the massage in his bedroom.<br>\r\n<br>\r\nChad and Jackson like this idea very much but before they left the locker room  Jackson looks into Chad eyes and asked \" Chad, are you sure you want to give me the same kind of 'massage' that you spoke of ?\"<br>\r\nChad just looks at him and shakes his head with a huge grin Yes....<br>\r\n<br>\r\nJackson is feeling very excited now but tells Chad \" we will have to be careful at home because my young brother will be home and he always wants to hang around me \".<br>\r\n<br>\r\nChase just responded, \" no worry Jackson ...we Will make it work\".</span></div></div>",
            "created":1519919100,
            "id":2459265,
            "title":"Jackson picks his house after school."
        },
        "15211":{
            "author_id":"demonchicken69",
            "author_name":"DEMONCHICKEN69",
            "choices":[
                "Continue ",
                "Change it up a bit ",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>After a fun day at school Jackson and Chad make it to Jackson's house where they walk inside to find his little brother Matt sitting in the floor in front of the TV immersed in the video game he currently is playing. The loudness of everything in the game must be to loud and doesn't even look in Jackson direction, \"good, lets get up to my room as quickly as possible.\" <br>\r\n<br>\r\n\"Race you there.\" Chad says taking off up the stairs to Jackson room since he has been here before and in his room many times, \"oh no you don't.\" Jackson replies as he takes long strides running up the stairs passing right by Chad. Jackson continues on running past Chad and into his room where he yells out, \"ha, I win.\" <br>\r\n<br>\r\n\"No fair, you run faster than me.\" Chad says just stepping into his room. <br>\r\n<br>\r\n\"You know I'm much taller and fit than you Chad.\" <br>\r\n<br>\r\n\"I know, but one day I might be able to be faster than you.\" <br>\r\n<br>\r\n\"Maybe one day, but you wanna get started with that massage or what.\" Jackson says getting a little excited to experience this. <br>\r\n<br>\r\n\"You know it, but how are we going to do this.\" Chad asks <br>\r\n<br>\r\n\"I thought you knew how.\" Jackson questioned.<br>\r\n<br>\r\n\"I meant what are you going to lay on.\" <br>\r\n<br>\r\n\"Oh right, ummm...wait my mom has a massage table in her room.\" Jackson remembers <br>\r\n<br>\r\n\"Yes, go get it.\" <br>\r\n<br>\r\nBeing excited as he could be Jackson quickly runs out of his room and into his mom's room and grabs the somewhat bulky massage table where he runs back into his room, \"do you know how to set these up Chad?\" <br>\r\n<br>\r\n\"Actually I do.\" Chad answers as he grabs the table form Jackson and begins unfolding the table until it's all set. Adjusting the head rest a little, \"there, that should do it.\" <br>\r\n<br>\r\n\"Cool, so do I have to get naked as well?\" Jackson says grabbing the seem of his shirt ready to pull it over his head, \"hmmm....only if you want to.\" Chad says fully knowing he wants Jackson to be naked. <br>\r\n<br>\r\n\"Hmm...why not.\" Jackson answers making Chad very excited that his dick starts to become hard. Jackson pulls his shirt off and tosses on the floor followed by his jeans. Pulling one leg out at a time and tosses it next to his shirt leaving him in his boxers and socks. Meanwhile Chad just watches his friend get naked in front of him as Jackson starts to pull his socks off, but then remembers what Chad told him, \"on second thought why don't take the rest of my clothes off during the massage.\" Jackson says.<br>\r\n<br>\r\n\"Will be my pleasure.\" Chad answers<br>\r\n<br>\r\nAfter that Jackson lays on the massage table laying on his stomach while Chad takes a bottle of lavender scented massage oil from his backpack and pours some in his hands. Chad begins to rub the oil on to Jackson's back gently rubbing over his shoulder, his neck and down his spine making Jackson let out soft moans and feeling his own dick start to become erect which is tucked between his stomach and the table. Chad then move onto his arms rubbing the oil into them making his own dick become so erect that it hurts, so he slowly unzips his jeans letting his dick have some relief. Once must of the oil has absorbed into Jackson's skin and Chad's hands Chad leans over next to Jackson's ear and whispers, \"maybe we should take off the rest of your clothes.\" <br>\r\n<br>\r\nJackson is so relaxed that all he says in reply is, \"mmm...hmmm.\" <br>\r\n<br>\r\nChad then moves behind Jackson at his feet and bends over reaching for Jackson's boxers grabbing the waist band. Slowly Chad pulls them down his legs revealing Jackson's slightly hairy butt and his slightly hairy balls, but not his erect dick. Chad just smiles as he sees his friends butt this close as he pulls his boxers off completely. Before Chad tosses them he gives them one big sniff taking in his friends scent, \"mmmmm.\" Chad moans and then takes off Jackson's socks one at a time until he can see his bare feet. This makes Chad's dick so hard that he takes it out of his boxers letting it breath, \"wow what nice feet.\" Chad says as begins massage them. <br>\r\n <br>\r\nChad decided to put Jackson's soft bare feet together and slides his dick in between them making Chad moan as he slides his dick between his friends soft warm feet. While Jackson smiles, knowing that it is Chads dick between his feet which makes his own so erect that it starts to hurt. As Chad slides his dick between Jackson's feet he puts some more oil on his hands and reaches for Jackson slightly hairy butt and begins rub the oil in gently. Lightly squeezing and stroking his soft hairy rear end occasionally spreading it to see Jackson's brown butthole. After a few more minutes Jackson can't take it anymore and rolls over onto his back letting his erect dick free and Chad to see. <br>\r\n<br>\r\nChad looks down and sees Jackson's big erect dick pointing straight up from his crotch, \"how about you give me a happy ending.\" Jackson says looking between his dick and Chad's smiling face, \"it will be my pleasure Jackson.\" As Chad makes his way to Jackson's head stepping behind him. Chad gets closer to him and bends over to reach his erect dick with his oily hands and making sure that his own dick will be resting above Jackson's face. It takes a moment for Jackson to notice Chad's dick above him and sticks his tongue out to give it a lick causing Chad to moan as he begins to stroke Jackson's dick. <br>\r\n<br>\r\nChad continues stroking his friends dick while he feels the warm breath on his own from Jackson and begins to wonder if the should try something different from what he said earlier. After a few more minutes Chad decides to.....</span></div></div>",
            "created":1521469020,
            "id":2466380,
            "title":"Go to after school now."
        }
    },
    "info":{
        "author_id":"socal2017",
        "author_name":"beachboy",
        "brief_description":"Chad, a recent young boy who just turned 13 years old, loves to go barefoot. ",
        "created":1518447540,
        "description":"<td align=\"left\" class=\"norm\">Chad is young youth of 13 years old. He's handsome, polite, courteous and has a nice, slender built body with short blonde hair. The unusual thing about Chad is that he loves to go barefoot wherever he goes...to school, to sport events, to church, on vacation, to the mall...everywhere. However, you wouldn't know this because whenever he is at home barefoot, his bare feet are clean, smooth and refreshed.</td>",
        "id":2148923,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1521469020,
        "modified":1521469020,
        "pretty_title":"The Adventures of Barefoot Boy"
    }
}