{
    "chapters":{
        "1":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Stairway",
                "Corridor"
            ],
            "content":"<div class=\"\"><div> <span>You wake up feeling groggy, thinking you may have been drugged.\r<br>\n \r<br>\n“Where am I? What the hell happened?” you think to yourself. “The last thing I remember\r<br>\nwas buying a pack of Mentos from the newsstand on my way to work this morning!”\r<br>\nYou manage to get to your feet and look around. You are standing on a platform at an\r<br>\nunfamiliar subway station. There isn’t a soul in sight. The station looks like a crumbling\r<br>\nrelic of a time gone by, like something out of a post-nuclear sci-fi movie. The only signs of\r<br>\ncivilization are a couple of rats gnawing at the contents of an overturned trash bin. \r<br>\n\r<br>\nAfter the initial shock of unfamiliarity, you begin to calm down. You revel in the quiet and\r<br>\nsolitude, you always were a loner, even as a child. After your father walked out when you\r<br>\nwere only ten, your mother routinely left you home alone at night while she went out to\r<br>\nearn enough money to pay the rent on your roach infested apartment. Being too poor to\r<br>\nhave a television, you often fell asleep with the music of the local progressive jazz station\r<br>\nand monotone droning of their announcer for company... \r<br>\n\r<br>\nYou decide to end your daydream and start walking. You have two options: at one end of the platform is a narrow dimly lit corridor, at the other a wide staircase leading downward. The faint sound of a saxophone drifts up from the stairwell. \r<br>\n\r<br>\n\"Right or wrong, boy, make a decision!\" Your father's words echo in your head. He’d always made his choices on the spur of the moment, probably including the day he'd\r<br>\nabandoned his family. \r<br>\n</span></div></div>",
            "created":994395600,
            "id":61931,
            "title":"Only the Lonely"
        },
        "11":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Turn Back",
                "Continue the Descent"
            ],
            "content":"<div class=\"\"><div> <span>You approach the stairwell and descend, lead onward by the strains of the saxophone.\r<br>\n\"Coltrane,\" you say to yourself. \"Dad used to play that song.\"\r<br>\n\r<br>\nYou hear a scrabbling noise and turn around, notice that the rats from the trash bin are\r<br>\nfollowing you. \"And what am I, the goddam pied piper?\" you say. \"Eat up boys, put some\r<br>\nmeat on your bones.\" you say, tossing them a half eaten candy bar you had stuffed into\r<br>\nyour jacket pocket earlier. Rats are no strangers to you, having fed one that lived under your kitchen sink table scraps as a boy, being careful not to let your mother catch you at it. \r<br>\n\r<br>\n\"Rats are filthy beasts!\" she had said, but she wouldn't allow you to have any other pets.\r<br>\nShe’d  even refused to let you keep a poor starving mongrel pup you had once found.\r<br>\n\"Just what we need around here, another mouth to feed. Get rid of it right now, or you\r<br>\nwon't be having any supper!\" She had said. You still remember putting the puppy out on\r<br>\nthe sidewalk, how it had whined pitifully and scratched at the door as you walked\r<br>\ndejectedly back up the stairs. \r<br>\n\r<br>\nYou sat at the table that night twiddling a fork through a plate of half congealed macaroni\r<br>\nand cheese. \"Eat up, boy, put some meat on your bones!\" your mother had said, lighting\r<br>\nanother Lucky off the butt of her previous one. \"Got to grow up big and strong so you\r<br>\ncan get a job, I’m  not gonna be here to feed you forever!\" \r<br>\nAfter supper that night you went back downstairs to check, but the puppy had wandered\r<br>\noff in search of better prospects. \r<br>\n\r<br>\n\"See! You didn't feed that dog, so he left,\" your mother said. \"Dogs are the same as\r<br>\npeople, they all want something. You might think they're your friends, but if you don't give\r<br>\nthem what they want they'll leave you.\" \r<br>\n\"Is that what happened with daddy?\" you asked. You can still feel the sting of the back of\r<br>\nher hand across your face in reply. You realize now that she thought you were being\r<br>\nsarcastic, but at the time it was only a child's innocent question.\r<br>\nThe stairs seem to be endless, and it is getting colder as you descend. “Maybe I should\r<br>\nturn back?” you think. \r<br>\n</span></div></div>",
            "created":994395600,
            "id":61933,
            "title":"Descending Into the Past"
        },
        "111":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Break through the barrier.",
                "Give up and go back down the stairs."
            ],
            "content":"<div class=\"\"><div> <span>Turning back, you climb the stairs to the next landing. You find your way blocked by an\r<br>\ninvisible barrier. You extend your arms, pushing, feeling for a break. You laugh, realizing\r<br>\nthat you probably look like a common street mime doing this. You recall a joke about a\r<br>\nmime who was murdered by being placed in a glass box in a park. The passerbys thought\r<br>\nhe was only acting as he suffocated. You laugh as you remember this.\r<br>\n\r<br>\n\"Yes, it's a sick world, and I'm a part of it.\" you say to yourself. You pull a cigarette out\r<br>\nof a crumbled Lucky Strike packet and flick the lighter you stole from your father as a kid,\r<br>\nthe only thing you have to remember him by.\r<br>\n</span></div></div>",
            "created":994395600,
            "id":61934,
            "title":"Marcel Marceau"
        },
        "1112":{
            "author_name":"kurt",
            "choices":[
                "Let  her follow you.",
                "Tell her your better alone."
            ],
            "content":"<div class=\"\"><div> <span>As you descend further you start to notice the formation of ice on the walls and the roof.\r<br>\n\"Where the fuck am I heading.\" you think as you snuggle deeper into your coat.\r<br>\nA wind starts to pick up and whistle around your ears, bringing with it the strains of the saxaphone music you heard earlier.  The music is strange yet somehow familiar.  Your not to sure if it's some old tune that you have heard before.\r<br>\nThe wind picks up and as it does the saxaphone gets louder.  The stairwell is still descending downwards with no sign of ending.\r<br>\n\"This is getting just a bit to crazy.\"  you mutter to yourself.\r<br>\n\"Oh.  You get used to it.\"\r<br>\nSpinning around you stare at a small girl who has appeared behind you apparently out of nowhere.  In her hand is a small beat up rag doll, its left arm missing.\r<br>\n\"Can I come to mister, I've lost my mum and I can't find my way home.\"</span></div></div>",
            "created":994404240,
            "id":61955,
            "title":"A New Face"
        },
        "112":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Engage him in battle with your light-saber.",
                "Sing while he plays the sax."
            ],
            "content":"<div class=\"\"><div> <span>“No, I’m not gonna give up that easily, gotta see who’s at the bottom of these steps.” you\r<br>\nthink. You turn up the frayed collar of your denim jacket and continue down the stairs.\r<br>\nThe saxophone is getting louder, the Coltrane tune wailing into the lonely night. \r<br>\n\r<br>\nYou finally reach the bottom of the stairs and look out onto the platform. Ahead of you,\r<br>\nplaying the sax, is an old man wearing an umpire suit and a cheap plastic Darth Vader\r<br>\nmask. \r<br>\n\r<br>\nAs you approach the man stops playing. \"Where am I?\" you ask. \r<br>\n\r<br>\n\"The Cleveland Underground.\" he replies tersely. \r<br>\n\r<br>\n\"And who are you?\" you ask. \r<br>\n\r<br>\n\"Isn't it obvious? ... I'm your father, Luke!\" He responds, removing the mask. \r<br>\n</span></div></div>",
            "created":994395600,
            "id":61936,
            "title":"The Umpire Strikes Back"
        },
        "1121":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "You burn the side of his face.",
                "He grabs the lighter and pins your arms to your side."
            ],
            "content":"<div class=\"\"><div> <span>His response brings back memories of your childhood and enrages you... \r<br>\n\r<br>\nAfter seeing \"Star Wars\" you used to have light-saber battles with your younger\r<br>\nbrother in your room at night in the dark using stolen cigarette lighters. One night\r<br>\nyou got too close and burned your brother's arm and he started crying. Your dad\r<br>\ncame stumbling into the room, drunk as usual, and your brother told on you:\r<br>\n\r<br>\n\"You wanna play with fire, boy? Here!\" Dad grabbed onto your fingers and seared\r<br>\nyour hand with his lighter. \"Surrender to the Dark Force! Heh-heh.” \r<br>\n“This hurts me more then it does you.\" he said, as you cried in agony... \r<br>\n\r<br>\nAlthough it was long ago, you still carry the scar from that night on the back of\r<br>\nyour hand. You see it every time you look at your watch.\r<br>\n\r<br>\nNow you pull your lighter from your pocket, determined to pay him back for the\r<br>\ninjuries of your childhood. You turn the flame up all the way and flash it in his\r<br>\nface: \"This'll hurt ME more than it does YOU, Dad!\" \r<br>\n</span></div></div>",
            "created":994395600,
            "id":61937,
            "title":"Surrender to the Dark Force?"
        },
        "1122":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Your father offers you a drink."
            ],
            "content":"<div class=\"\"><div> <span>You're speechless, you don't know what to say to him. You haven't seen him since\r<br>\nhe walked out on you and your mom years ago. \r<br>\n\r<br>\nSaying nothing further, your father dons the mask again and resumes playing the\r<br>\nsaxophone, a perfect rendition of Coltrane's take of the old song \"Favorite\r<br>\nThings\". \r<br>\n\r<br>\nImpulsively, you start singing. Not the original words of the song, but cynical\r<br>\nlyrics of your own, inspired by remembrances of your childhood: \r<br>\n\"Raindrops on beer cans and roaches in kitchens, \r<br>\nHalf empty rum bottles, drunk in one sitting, \r<br>\nBroken toys fixed up with duct tape and string, \r<br>\nThese are a few of my favorite things...\" \r<br>\n</span></div></div>",
            "created":994401840,
            "id":61939,
            "title":"Favorite Things"
        },
        "11221":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "You are crushed to death under the rubble.",
                "You are trapped in the underground."
            ],
            "content":"<div class=\"\"><div> <span>He stops playing the sax and removes a half empty pint of Jim Beam from his jacket\r<br>\npocket. \"Here you go son, a sip of this'll cheer you up.\" he says, holding it out. \r<br>\n\r<br>\nAlthough you know you shouldn't, you grab the bottle from him and greedily drink it all\r<br>\ndown. The harshness of the whiskey makes you start to cough, but you stifle it and wipe\r<br>\nyour mouth with the back of your sleeve, then unthinkingly hand the empty bottle back to\r<br>\nhim. \r<br>\n\r<br>\n\"Heh-heh, didn't leave any for me? Guess I was right in figuring you'd have a taste for the\r<br>\nstuff too by now. The apple doesn't fall far from the tree, does it son.\" \r<br>\n\r<br>\nYou don't know what to say to him so you remain silent. You are content just to feel the\r<br>\nwarmth of the alcohol flowing from your gut into your bloodstream. It's been such a long\r<br>\ntime since you'd fallen off the wagon, you'd almost forgotten how good that buzz could\r<br>\nfeel. \r<br>\n\r<br>\nSuddenly a loud rumbling sound begins to build behind you and the ground starts to shake\r<br>\nviolently. Pieces of the ceiling begin falling , you run down the platform trying to escape\r<br>\nthe falling brickwork and concrete. </span></div></div>",
            "created":994401960,
            "id":61941,
            "title":"Message in a Bottle."
        },
        "112211":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "content":"<div class=\"\"><div> <span>I guess you just had to click on this link to see if I really meant it, didn't you? Well I did,\r<br>\nso here's how it goes: \r<br>\n\r<br>\nYou try your best to escape but there is nowhere safe to run. You are buried under tons of\r<br>\nconcrete and brick rubble as the subway tunnel collapses on top of you. The last thing you\r<br>\nare thinking before your life essence dissipates is \"Did I remember to feed the dog?\" Funny\r<br>\nthe mundane things people think of in their last moments on earth... \r<br>\n\r<br>\nIn this thread there is no afterlife, no \"Stairway to Heaven\" (or Hell) waiting for you.\r<br>\nYou're just dead, that's it. If this ending is too dark for you, you can always go back to the\r<br>\nprevious chapter and try your luck with the other link... If only it were that easy in real\r<br>\nlife.\r<br>\n</span></div></div>",
            "created":994402260,
            "id":61943,
            "title":"No Surprises Here"
        },
        "112212":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Panic and start digging madly at the rubble."
            ],
            "content":"<div class=\"\"><div> <span>As suddenly as it started, the shaking stops. You look around in panic and see that the\r<br>\nexits have all been buried in rubble. You are now trapped deep under ground, with no\r<br>\nvisible means of escape. \r<br>\n\r<br>\nYou no longer feel the glow of the whiskey, nor can you even taste it. Your father is\r<br>\nnowhere in sight, and you begin to wonder if he was ever there at all. \"Was It all a\r<br>\nDream?\" \"Am I Crazy?!, Going Mad?!\" ...the lights on the subway platform begin to\r<br>\nflicker and fade... \"Is Anyone Out There?\" \"HELP MEEEE!!!\" \r<br>\n</span></div></div>",
            "created":994402440,
            "id":61945,
            "title":"The Edge of Sanity"
        },
        "1122121":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Back out of the tunnel before it caves in.",
                "Dig fast and try to get through before it caves in."
            ],
            "content":"<div class=\"\"><div> <span>Although somewhere in the back of your disturbed mind you realize it is probably\r<br>\nfutile, you claw insanely at the massive pile of debris, screaming: \"HELP! SAVE\r<br>\nME! I DON'T WANNA DIE! GET ME OUTA HERE!\" \r<br>\n\r<br>\nEventually your voice is too raspy to scream and you find yourself muttering\r<br>\nhoarsely as you dig, over and over, \"I-Think-I-Can I-Think-I-Can I-Think-I-Can\",\r<br>\nremembering \"The Little Engine That Could\". It was a favorite bedtime story of\r<br>\nyours, your father used to read to you often, at least when he was sober enough to\r<br>\ndo so. \r<br>\n\r<br>\nYour fingers are bleeding and raw and you have torn off two of the nails on your\r<br>\nright hand, but the pain no longer even registers. You keep on digging, as the light\r<br>\ncontinues to fade. \r<br>\n\r<br>\nAfter what seems like eons you realize that somehow you have managed to dig a\r<br>\ntunnel several feet deep into the rubble, and can see a glimmer of light shining\r<br>\nthrough a small space ahead. The debris above your head is beginning to shift and\r<br>\nrumble though, and you fear that it may cave in on you at any moment. \r<br>\n</span></div></div>",
            "created":994402620,
            "id":61946,
            "title":"I-Think-I-Can..."
        },
        "11221211":{
            "author_id":"intuey",
            "author_name":"Intuey",
            "choices":[
                "He's Hallucinating ",
                "He Finds Another Way Out"
            ],
            "content":"<div class=\"\"><div> <span>I know the tunnel is going to cave at any moment, so I back out just in time to hear it come crashing down. The white and gray dust cover me in a plume of smoke. Wiping away at my clothes, I cough the miniscule particles out of my lungs. That's when I hear the sax again. I spin around and see my dad standing there with a stupid grin on his face.<br>\r\n<br>\r\n\"You were here? Why didn't you help?\" <br>\r\n<br>\r\n\"I did help you, Boy. Are you lying crushed beneath the rubble?\" He replied with a chuckle.<br>\r\n<br>\r\nNot understanding what was so damn funny, I turn to try and find another way out.<br>\r\n<br>\r\n\"Well, how do we get out of here?\" I ask, no longer hiding my anger or fear.<br>\r\n<br>\r\n\"Son, let me tell you. There are a few ways out, but none of those ways are better than where you're at right now. One way leads to flames licking your face, another to hungry rats wanting to feed off your flesh.\"<br>\r\n<br>\r\n\"What? What the hell are you talking about? No wonder Mom didn't care that you left. You're crazier than she is!\"<br>\r\n<br>\r\n\"HA! Left? Yea, Son. I left alright. But it damn sure wasn't from choice. Why do you think you sing that little diddly that you made up? Where do you think it came from?\"<br>\r\n<br>\r\n\"Maybe, from the times you tied Mom up and duct taped her mouth.\"<br>\r\n<br>\r\n\"You better rethink that, Son. I never tied your mom up. You're remembering when she tied me to a chair. I was drugged--couldn't fight back. Son, your mom didn't just tie me up that night, she tied me up and killed me. She buried me under the shed, beneath the concrete floor. Why do you think she won't let you have a dog? She don't want it scratching up things better left buried.\"<br>\r\n<br>\r\n\"What the hell are you talking about old man? If you were dead, how am I talking to you?\"<br>\r\n<br>\r\n\"Son, haven't you wondered how you just magically found me? I'm sorry to be the one to tell you this, but you've joined me. Son, you're dead.\"<br>\r\n<br>\r\n\"I don't have time for this bullshit!\" But even saying that I knew something ringed true in his words. I can't be dead, can I? I try to think what happened to me before I was on the subway, but for the life of me, I can't remember.  Why didn't I stay on the subway and get off somewhere I was familiar with? And why in the hell did I go down the stairwell?<br>\r\n<br>\r\nI bury my face in my hands. Nothing makes sense. I look up and to ask dad if we are dead, then why can't we just walk through the damn walls! \"Dad, if we're... Dad? Dad? Where the hell did you go?\" I jump up and run all through the little area he just was. There' no one, nothing.<br>\r\n<br>\r\nI'm losing my mind. I must not be getting oxygen. I'm having freaking hallucinations!<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1472309340,
            "id":2202231,
            "title":"Back out of the tunnel before it caves in."
        },
        "11221212":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Go through the door,"
            ],
            "content":"<div class=\"\"><div> <span>Although you realize it is risky and you should probably turn back you continue to\r<br>\ndig, trying desperately to break through before the tunnel collapses. You manage\r<br>\nto open a hole about a foot across, almost wide enough to squeeze through, and\r<br>\nyou see an open passageway ahead. \r<br>\n\r<br>\n\"I-Know-I-Can I-Know-I-Can!\" you begin to shout as you dig, invigorated by the\r<br>\nprospect of freedom... \r<br>\n\r<br>\nBut in this story, as in Life, there is a price to be paid for impatience... \r<br>\n\r<br>\nWith a loud roar the tunnel collapses above you as the icy hand of fear grips your\r<br>\nchest... It seems as if it's happening in slow motion as the tons of rock and broken\r<br>\nconcrete begin to squeeze the air of life from your lungs. \r<br>\n\r<br>\nBut just as suddenly as it started, it stops. Although you are trapped in the rubble,\r<br>\nthe space in front of you is now cleared into the passageway. Somehow, you think,\r<br>\nmiraculously you have been spared. \r<br>\n\r<br>\nAs the dust settles you see a short middle-aged guy wearing faded jeans and a\r<br>\n\"Hooters\" t-shirt approaching. \"Here, let me give you a hand!\" he says, as he\r<br>\nbegins to work at the rubble. A younger, thin, black man joins him and soon they\r<br>\nhave you untrapped and pull you to your feet. You notice that amazingly, you feel\r<br>\nno pain as you turn to thank them. \r<br>\n\r<br>\nYou recognize them, a couple of guys from work you haven't seen around in a\r<br>\nwhile. \"Bill? Darrel? What are you guys doing here?\" you ask.\r<br>\n\"The question is, my man, what are YOU doing here?\" Darrel quips. \r<br>\n You feel a chill as you remember. The reason you haven't seen them around  lately\r<br>\nis they are both dead. Bill from a heart attack last July, Darrel from cancer a year\r<br>\nearlier. \r<br>\n\r<br>\n\"Then I guess I didn't make it through the tunnel after all, did I?\" you ask, as\r<br>\nreality sinks in. \r<br>\n\r<br>\n\"It all depends on how you look at it.\" Bill replies. \r<br>\n\r<br>\n\"So, what do I do next?\" you ask. \r<br>\n\r<br>\n\"Go through the door straight ahead. And good luck, my man!\" Darrel says.\r<br>\n\r<br>\n“Thanks.” you reply.\r<br>\n</span></div></div>",
            "created":994402860,
            "id":61947,
            "title":"With a Little Help From My Friends"
        },
        "112212121":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Sing along with Jerry.",
                "Try your luck with the tunnel."
            ],
            "content":"<div class=\"\"><div> <span>You walk through and the door slams ominously behind you, there’s no turning\r<br>\nback. Ahead you see an overweight bearded man with bright red skin, sitting on a\r<br>\nrock playing an acoustic guitar, with flames and smoke behind him. \r<br>\n\r<br>\n\"...if I get home before daylight, just might get some sleep tonighhht.\" he finishes\r<br>\nplaying, and leans the guitar against the rock. \r<br>\n\"Uhhh, Satan?\" you inquire? \r<br>\n\"No, just another “friend of the devil”, so to speak.\" He chuckles. \"The red skin\r<br>\nfools people, just a side effect of the heat and flames down here.\" \r<br>\n\r<br>\n\"This has got to be a mistake, I really don’t belong in Hell. Isn’t there some kind of\r<br>\nway to get out of here?\" you ask him. \r<br>\n\r<br>\n\"Well, on your right there's a small tunnel that is supposed to be a way to escape.\r<br>\nI've been told it's infested with rats and poisonous spiders, though. The last guy\r<br>\nthat went in didn't come back, so I guess he might have made it out, although I did\r<br>\nhear some screaming. I haven't had the balls to try it myself. Figured I'd just kick\r<br>\nback, smoke my pipe, play a few tunes, and see what happens next. We've got all\r<br>\nof eternity, you're welcome to join me, sing along a little if you want to.\" \r<br>\n</span></div></div>",
            "created":994403160,
            "id":61948,
            "title":"Friend of the Devil"
        },
        "1122121211":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Allow yourself to be led away by Satan."
            ],
            "content":"<div class=\"\"><div> <span>“You who choose to lead must follow, but if you fall, you fall alone\r<br>\nIf you should stand, then who’s to guide you. If I knew a way, I would take you\r<br>\nhome...\" \r<br>\n\r<br>\nYou realize the lines of the song are more meaningful now, in light of your present\r<br>\npredicament. \r<br>\n\r<br>\nSuddenly Satan appears in all his glory, with a goofy demonic sidekick who looks \r<br>\nlike Danny DeVito. \r<br>\n\r<br>\n\"You're just having waaay to much fun!\" the devil roars. \"Come here guys, I've got\r<br>\na job for you to do!\" \r<br>\n</span></div></div>",
            "created":994403520,
            "id":61950,
            "title":"Ripple"
        },
        "11221212111":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Pick up your brush and get to work.",
                "Hit Danny DeVito with the brush and run away"
            ],
            "content":"<div class=\"\"><div> <span>Satan leads you down a long dimly lit corridor, walking mile after mile, past locked\r<br>\nchambers filled with wailing souls being tormented in God knows what kind of horrible\r<br>\nways. Jerry starts lagging behind and complaining : \"Hey, I'm not in shape for all this\r<br>\nwalking, man! Couldn't we take a break and get something to eat?\" \r<br>\n\r<br>\nBut there is no rest for the wicked in this story. Danny DeVito circles around behind him\r<br>\nand jabs him in the ass with his pitchfork: \"Stop your griping and get moving, lard butt!\r<br>\nWe're almost there!\" \r<br>\n\r<br>\nYou turn a corner and the corridor opens up and ends on top of a cliff overlooking a huge\r<br>\ndeserted beach beneath a star filled alien sky. There is this beautiful huge\r<br>\noval-shaped-swirly-galaxy-thing visible overhead, kind of like what Jodie Foster saw in the\r<br>\nmovie \"Contact\". It would almost be a perfect vision of cosmic awareness and beauty, if\r<br>\nonly it weren't for the disgusting smell of excrement emanating from it. \r<br>\n\r<br>\n\"My God! stench is horrible!\" you exclaim. \"What the hell is it?\" \r<br>\n\r<br>\n\"That's God's Toilet Bowl, and you two guys are gonna clean it!\" Satan replies, handing\r<br>\nyou and Jerry a couple of absolutely huge impossibly long-handled toilet brushes and a 55\r<br>\ngallon drum filled with Lysol. \r<br>\n\r<br>\n\"No way! That would take an eternity!\" you respond. \r<br>\n\r<br>\n\"Like you don't have the time?\" Satan quips. \"I'll leave Danny here to supervise. Now\r<br>\nGET TO WORK!\" he commands, as he lifts his wings and vanishes into a cloud of\r<br>\nsulphurous smoke. \r<br>\n</span></div></div>",
            "created":994403640,
            "id":61951,
            "title":"Tidy Bowl Blues"
        },
        "1122121212":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Get hit with a lightning bolt,"
            ],
            "content":"<div class=\"\"><div> <span>Deciding to take your chances, you crawl into the tunnel. \r<br>\n“Good luck, man!” Jerry calls to you.\r<br>\n“Thanks... AAAAIIEEE!!” You scream as the bottom of the tunnel suddenly\r<br>\ndrops away, sending you falling, literally, into the pits of Hell. You land in a heap\r<br>\non the ground  in front of Satan.\r<br>\n\"Ahhh, I’ve been waiting for you.” Satan says. “You know not many people\r<br>\nrealize this, but I'm a Zen master.\" \r<br>\nHe quickly pulls a large machete from his belt and lops off your right hand. You\r<br>\nstand there shocked, as the hand floats above you. The hand begins opening and\r<br>\nclosing rythmically, fingers making a repeated clopping sound as they meet the\r<br>\npalm. \r<br>\n\"That is the sound of one hand clapping.\" the devil says, chuckling. He reaches up,\r<br>\ngrabs the hand and pushes it back onto your forearm, where it reattaches\r<br>\nseamlessly.\r<br>\n \"Can't have my right hand man walking around without his right hand, can I?\" he\r<br>\nsays \" I have important work for you to do.\" \r<br>\n\r<br>\nThe devil hands you a garden rake and a hefty bag and points at the ground. \"See\r<br>\nall of these demon turds lying around? I need you to bag these and put them out by\r<br>\nthe curb for trash pick up.\" \r<br>\n\"But I’m your right hand man! I thought I'd get to do some fun type evil and sin\r<br>\nstuff!\" you complain. \r<br>\n\"Yeah, maybe later, but for now there's work to be done, and if you don't get\r<br>\nraking I'm gonna fry your ass with a lightning bolt!\" \r<br>\n</span></div></div>",
            "created":994403820,
            "id":61952,
            "title":"A Hell of a Job"
        },
        "11221212121":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Finish raking and go eat dinner,"
            ],
            "content":"<div class=\"\"><div> <span>ZZZAP !!!! \"Ow, hey, that hurts! I didn't think you'd really do it, I thought you\r<br>\nwere kidding!\" \r<br>\n\r<br>\n\"Satan never kids!\" the devil replies. \"Now get to work, or the next bolt will get\r<br>\nyou in the balls!\" \r<br>\n\r<br>\nYou pick up the rake and dejectedly begin the task. \"Boy it must be nice, being the\r<br>\nboss and getting others to do all of your dirty work.\" you comment.\r<br>\n\r<br>\n\"Are you kidding? I promised the wife I'd fix the leak in the bathroom plumbing\r<br>\nand paint the kitchen by the end of this weekend. Her mother's coming to stay with\r<br>\nus for a while, she'll be here on Monday. and you're complaining about having to\r<br>\nrake up the yard!\" the devil says.\r<br>\n\r<br>\n\"Why don't you get some of your demons to do the plumbing for you?\" you ask.\r<br>\n\r<br>\n\"They haven't got the brains God promised a retarded piss ant! You can't teach\r<br>\nthem to use indoor plumbing, let alone fix it! Hell, about all they're good for is\r<br>\npoking the poor damned souls with pitchforks, and some of them can't even figure\r<br>\nwhich side of the fork to use! Well, I'd better get to work on that plumbing, no rest\r<br>\nfor the wicked. Come on up the house for dinner after you finish here, my wife\r<br>\nmakes a hell of a tuna casserole.\" The devil says, as he walks away. \r<br>\n</span></div></div>",
            "created":994404000,
            "id":61953,
            "title":"Antwerp's Placebo"
        },
        "112212121211":{
            "author_id":"cyam_01",
            "author_name":"RatDog",
            "choices":[
                "Sneak back in to visit Satan's daughter.",
                "Go to sleep."
            ],
            "content":"<div class=\"\"><div> <span>You bag up the last of the turds, set them by the curb, and go clean yourself up using the\r<br>\ngarden hose on the side of the house. You go in through the back door and sit down to\r<br>\ndinner with Satan, his wife, and their teenage daughter. \r<br>\n\r<br>\nThe casserole isn't bad, just kind of bland. \"Got any salt?\" you ask. \"No, this is Hell, you\r<br>\ncan't have any salt!\" Satan replies. The daughter giggles at this, but later slips a paper\r<br>\nMcDonald's salt packet to you under the table and eyes you somewhat seductively. You\r<br>\nsmile and give her a look of thanks, and pour the salt on your food when the devil and his\r<br>\nwife aren't looking.\r<br>\n\r<br>\nAfter dinner, Satan hands you an old horse blanket and walks you outside. \"You can sleep\r<br>\nin the barn with the demons tonight. And don't get any ideas about messing around with\r<br>\nmy daughter or there'll be hell to pay!\" he exclaims. \r<br>\n\r<br>\n\"OK, sure.\" you reply, as you trudge off  to the barn. </span></div></div>",
            "created":994404240,
            "id":61954,
            "title":"Have You Heard the one about..."
        },
        "12":{
            "choices":[
                "A  bent man comes out of hiding to greet you",
                "You pass by a mirror, that causes you to stop",
                "You hear a noise that is unfamiliar",
                "You decide what happens next"
            ],
            "content":"<div class=\"\"><div> <span>You step gingerly in the direction of the corridor. As you near it you can see glimpses of rats in between the walls as they scatter by quickly. A smell of rot drifts into you nostrils making your stomach feel queasy. You have seen friendlier places.</span></div></div>",
            "created":1118611620,
            "id":256166,
            "title":"The corridor"
        }
    },
    "info":{
        "author_id":"cyam_01",
        "author_name":"RatDog",
        "brief_description":"...The last thing you remember was buying a pack of Mentos your way to work.",
        "created":994400040,
        "description":"<td align=\"left\" class=\"norm\">You find yourself at an unfamiliar subway station, a victim of amnesia. This story starts out on the dark side, but it lightens up later, on some of the threads. It's an emotional tragedy/fantasy/comedy kinda tale. You're welcome to follow along and add chapters. Enjoy!\r<br>\n</td>",
        "id":186373,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1472309340,
        "modified":1472309340,
        "pretty_title":"Awakenings: Stairway to Hell"
    }
}