{
    "chapters":{
        "1":{
            "author_id":"deasly",
            "author_name":"Deasly",
            "choices":[
                "Bart",
                "Lisa",
                "Marge",
                "Homer",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A strange vial ends up on the table, who finds it?</span></div></span></div>",
            "created":1187931600,
            "id":438767,
            "title":"Choice"
        },
        "11":{
            "author_id":"deasly",
            "author_name":"Deasly",
            "choices":[
                "Bart tries the drink",
                "Bart gives someone else the drink",
                "Bart accidentally spills the drink"
            ],
            "content":"<div class=\"\"><div> <span>Bart walks into the kitchen to get a drink, he looks through the fridge but sees nothing of interest, then he notices a vial on the table, he picks it up and looked it over, it was unmarked.<br>\r\nBart took off the lid and smelled the liquid inside, it smelled quite good \"hmmm\" he said.</span></div></div>",
            "created":1187931600,
            "id":438769,
            "title":"strange drink"
        },
        "111":{
            "author_id":"deasly",
            "author_name":"Deasly",
            "choices":[
                "Follow Lisa",
                "find Marge"
            ],
            "content":"<div class=\"\"><div> <span>You shrug and drink the liquid, it tastes sweet, you lick your lips and head back upstairs towards your room, you make it into the hall when all of a sudden you feel a sinking sensation, it looks as if you are slowly falling but you are still standing on solid ground, then you notice your not falling, your shrinking, you see the world get bigger and bigger until you finally stop, you look next to you and see a huge red pacifier, its larger than you are.<br>\r\n\"cool\" you say, but then you feel the ground shake, then again, it keeps shaking until in front of you you see a huge pair of legs with big red shoes under them, you upwards to see your 8 year old sister, Lisa walking towards you.<br>\r\nthe tremors get larger and larger until you are knocked off of your feet, then you see Lisa looming over you, she looks like a giant, you see her white underwear hovering above you, underneath her orange crimp cut dress, but that view is suddenly obstructed by a large red shoe descending upon you, you yell in surprise, and try getting up, but before you can move Lisa's foot slams down on you, you feel a huge amount of pressure on you, but miraculously, you don't feel any pain,  you wonder if this is something to do with the drink, after getting pushed into the ground for a second you feel Lisa's shoe lift off of you, you are dazed but unharmed, you hear Lisa's thumping footsteps move away, you pull yourself up and look behind you to see Lisa turn into her room.</span></div></div>",
            "created":1187931600,
            "id":438776,
            "title":"Barts pov"
        },
        "1111":{
            "choices":[
                "Lisa feels you",
                "She doesn't know you're there",
                "She investigates but doesn't find you"
            ],
            "content":"<div class=\"\"><div> <span>Bart decides that, seeing as he is so small and helpless, someone should know where he is to avoid stepping on him. Seeing Lisa, he dicided to follow her (as his small legs wouldn't be able to carry him further)<br>\r\n<br>\r\nHe walked what seemed like miles to Lisa's room and let her know you're there.<br>\r\n<br>\r\n<br>\r\n\"LISA\" he shouted, but she didn't seem to be able to hear him. She is seated at her desk, writing her diary. He begins to climb her leg but she suddenly turns her leg and, as he reaches the top, is completely smothered by her white panties. She gets up and begins to walk and Bart has to cling on for dear life.<br>\r\n<br>\r\nLisa suddenly feels a twitch between her legs and.....</span></div></div>",
            "created":1195102800,
            "id":464622,
            "title":"Follow Lisa"
        },
        "11112":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "butt",
                "vagina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa starts to walk and bart climbs into lisa panties bart trys again but lisa dosn't hear him lisa sits on her bed and then barts face is pushed aganest lisas</span></div></span></div>",
            "created":1229835600,
            "id":622877,
            "title":"She doesn't know you're there"
        },
        "111121":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Grows to 75ft",
                "Srinks to the size of an ant"
            ],
            "content":"<div class=\"\"><div> <span>bart is looking right at lisa butt then lisa feels bart and tells bart to kiss her butt then bart leans in and kisses her butt then lisa pushes bart into her butt his head is fully in her butt then she pushes the rest of bart into her butt then he disapears and lisa feels bart in her butt she farts and looks in the mirror and opens her butt she sees bart head poke out and lisa pushed bart right in then lisa moves bart futher and futher into her butt then she gose to the kitchen and see a green looking vile she drinks it and she?</span></div></div>",
            "created":1229835600,
            "id":622946,
            "title":"butt"
        },
        "1111211":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "grows bigger then lisa",
                "grows the same size as lisa"
            ],
            "content":"<div class=\"\"><div> <span>lisa starts to grow 75ft she is bigger then the tallest tree she finds everybody at town hall. She is completly naked and she picks up a gaint jar and walks towards town and she grabs a big shovel and puts everybody in the jar she takes them to the woods then she shows everybody her gigantic butt and pushes bart into the jar with everybody else then she opens her butt and everybody enter her butt she hears them yelling then she sees her famliy and puts them in another jar then she feels everybody else in her she has to poop she pushes out the poop and some people come out that she ties them to a tree and rubs her butt on them then she stands over the tree with people tied to it then she lowers and her butt touches the tree top and she lowers more then the top of the tree disapears into her butt then her butt touches the peoples head then she sits and the tree disapears she hears the peoples screams and she farts and the tree disapeared into her butt when she stood up then she felt the tree in her butt then she walks twoards a mountain then she opens the jar and holds on to the lid she farts into the lid that her famliy inside is asleep then she grabs bart and puts him on her brest and then she dumps them into her vagina then she gives bart the drink he drinks it and</span></div></div>",
            "created":1229922000,
            "id":623497,
            "title":"Grows to 75ft"
        },
        "11112111":{
            "author_id":"zaul",
            "author_name":"hhggh",
            "choices":[
                "100ft",
                "another size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how much bigger?</span></div></span></div>",
            "created":1307854800,
            "id":1124465,
            "title":"grows bigger then lisa"
        },
        "11112112":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "penis",
                "butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>bart tells lisa to lay down he sits on her face and lisa is looking at barts</span></div></span></div>",
            "created":1229922000,
            "id":623499,
            "title":"grows the same size as lisa"
        },
        "111121121":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Mouth",
                "Lower!"
            ],
            "content":"<div class=\"\"><div> <span>Lisa opens her eyes and see's barts penis on her then she stands up she has an idea. She pushes everybody in her butt and vagina out then she puts them in a Jar then she grabs some people and gives them to bart then Bart has a evil grin then he places the people in his</span></div></div>",
            "created":1230958800,
            "id":628858,
            "title":"penis"
        },
        "1111211212":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Butt",
                "penis"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>he starts to move them futher down to where?</span></div></span></div>",
            "created":1231131600,
            "id":629519,
            "title":"Lower!"
        },
        "11112112122":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "underwear",
                "diaper"
            ],
            "content":"<div class=\"\"><div> <span>he puts all but one person he puts the rest under his foot then he tells the one that he is going into a speical place then he pushes him into his penis bart feels the person struggle in bart penis then he disapears then bart looks at the jar it is full and bart see's a gaint underwear and a diaper which one dose he go for?</span></div></div>",
            "created":1231218000,
            "id":629911,
            "title":"penis"
        },
        "111121121221":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "vagina",
                "butt"
            ],
            "content":"<div class=\"\"><div> <span>he walks towards the gaint underwear then he puts them on they fit then lisa tells bart to open his underwear then lisa dumps them in the underwear is deep so all the towns people fit. Then bart pulls the underwear towards his butt then he turns to lisa she says \"hey what about the people under your feet\" then bart picks them up and lisa is still naked then bart picks then and tells lisa to turn around then bart puts them in lisa</span></div></div>",
            "created":1231218000,
            "id":629937,
            "title":"underwear"
        },
        "1111211212212":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Lisa catches bart and \"plays\" with him",
                "Lisa's butt falls on him!"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh hold on\" liza says then Lisa gunts and Bart looks at lisa butt then the tree lisa tied the people too came out of her butt. then lisa says \"ok lets do it!\" then bart scoops up the people in his underwear and pushes everybody into her butt. then bart says Finialy I can take the underwear off. Then bart starts to shrink \"What the?\" bart shrinks to 1 inch again And is looking at A giant naked lisa. Lisa!!!! Bart yells... Lisa looks at bart and then she says Hold on agian!\" then lisa pushes everybody out of her butt and into a Jar. She then tightens the jar so no one can get out then she gose back to bart Then bart starts to run... but Then!.............</span></div></div>",
            "created":1243746000,
            "id":700396,
            "title":"butt"
        },
        "111122":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "she feels him",
                " she doesnt fell him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>bart tried to struggle but realised he was trapped his face was right in between lisas pusy lips and his arms and legs were tangled in his sisters hair</span></div></span></div>",
            "created":1286427600,
            "id":970569,
            "title":"vagina"
        },
        "1111221":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Bart was swallowed up by Lisa's Pussy",
                "She wondered what was making her so very horny"
            ],
            "content":"<div class=\"\"><div> <span>Lisa felt a tickle against her pussy and she moaned and enjoyed the feeling against her pussy and also her clit. Lisa then became very turned on by the feeling and then went to her bedroom door and quickly locked it. Lisa then slowly started to slide down her panties and rubbed a finger against her pussy and managed to feel Bart. She kept rubbing her pussy and Bart as well till.</span></div></div>",
            "created":1515387600,
            "id":2438224,
            "title":"she feels him"
        },
        "11112212":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Might As Well Suck Him Up My Pussy",
                "Since he's been so good for my pussy I wonder what he'd do for my asshole"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa started to wonder what was close by her pussy and right by her clit. She found a mirror and was able to view what it was. She got a closer look and once she knew it was Bart what does Lisa do?</span></div></span></div>",
            "created":1515387600,
            "id":2438225,
            "title":"She wondered what was making her so very horny"
        },
        "111122121":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Marge (Maybe She wants him)",
                "Homer Or Maggie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa managed to swallow Bart up her pussy and she became so horny. I gotta show Bart off to someone. I wonder who. I know! </span></div></span></div>",
            "created":1515387600,
            "id":2438226,
            "title":"Might As Well Suck Him Up My Pussy"
        },
        "1111221211":{
            "author_id":"xponent2000",
            "author_name":"Xponent",
            "choices":[
                "Puts him in her mouth ",
                "Put Bart on her giant toe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa picked up tiny Bart and carried him in her giant hand and showed Marge.Lisa Explained that Bart is shrunk but doesn't know how he got so tiny.Marge picks him up and</span></div></span></div>",
            "created":1538271840,
            "id":2556721,
            "title":"Marge (Maybe She wants him)"
        },
        "112":{
            "choices":[
                "Picks up Homer and decides to have some fun.",
                "Puts Homer in his room.",
                "Gives Homer to Lisa, telling her it's  a doll."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Unsure about the drink, Bart gives it to Homer. \"Hey Homer, try this.\" He says. Homer drinks it and he shrinks. Amused, Bart...</span></div></span></div>",
            "created":1343797200,
            "id":1395383,
            "title":"Bart gives someone else the drink"
        },
        "1121":{
            "choices":[
                "Lisa's dollhouse.",
                "Toilet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\" D'oh!\" Homer yells as Bart begins to head to...</span></div></span></div>",
            "created":1343797200,
            "id":1395522,
            "title":"Picks up Homer and decides to have some fun."
        },
        "1123":{
            "author_id":"simpfan",
            "author_name":"Simpfan",
            "choices":[
                "In the dollhouse swimming pool",
                "Lisa gives Little Homer to Maggie ",
                "Lisa makes Homer the dollhouse gardener"
            ],
            "content":"<div class=\"\"><div> <span>Aware of what he was holding and imagining the newfound power that might come with it, Bart stuffed his now miniature father into a pocket of his shorts, before rushing upstairs to show Lisa. Upon reaching her bedroom, he paused before rushing in. Tentatively knocking -- he usually barged right in on her, irregardless of whatever she was doing -- he announced his arrival when Lisa asked who it was. \"I've got something really cool to show you!\" Knowing that she and Bart often differed in their opinions on what was considered \"cool,\" Lisa decided to grant him entrance into her sanctuary. After all, he had shown the rare courtesy to knock. Lisa saved her homework to the hard drive on her laptop and got up to open her door. Bart stood there, not even trying to mask his excitement. \"Lisa, have you ever wanted to have a voodoo doll?\" \"Oh, Bart, those are just superstitions. They aren't real.\" \"Well, just to pretend, have you ever wanted to switch places with one of our parents?\" \"Well...I don't know about that. I mean, Mom has a lot of responsibilities. And Dad...\" \"Could be replaced by a talking monkey,\" Bart finished the sentence, which made both kids laugh. \"Well, Lis....you're not going to believe this one, but here goes...!\" Bart reached into his shorts pocket aHnd pulled out a tiny Homer Simpson. He still had the beer gut and the same amount of hair. In fact, he was Homer in every way, now screaming, \"Why you little.....D'oh!\" at the monkey comment, while suddenly realizing he couldn't choke Bart this time! \"Bart!\" screamed Lisa. What happened to him?\" \"All I know is, there was a small bottle on the kitchen countertop. I went to ask Dad what he thought it was, and before I knew it, Hom had drank its contents and shrunk down to this size!\" \"Wow, Bart! What should we do first?\" \"I figured you'd want him to chill out for awhile. We don't know what chemicals were in that bottle or if its effects are long-lasting. I know I'd  like his anger to subside before he grows back to his regular size. So....do you think Malibu Stacey wou.....ld like some company at her place?\" \"I know of the perfect spot for little Homer,\" Lisa replied, placing him.......</span></div></div>",
            "created":1392440400,
            "id":1745890,
            "title":"Gives Homer to Lisa, telling her it's  a doll."
        },
        "11232":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Yes",
                "Maybe something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure?</span></div></span></div>",
            "created":1562730840,
            "id":2684626,
            "title":"Lisa gives Little Homer to Maggie "
        },
        "112322":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Continue",
                "The End!"
            ],
            "content":"<div class=\"\"><div> <span>*NOTE THE FOLLOWING STARTS A TIME SKIP TO AGE UP THE KIDS TO OVER THE AGE OF 21*<br>\r\n<br>\r\nLisa: Well we are over 21 Bart, so wanna help me get Homer into his new home?<br>\r\n<br>\r\nBart: Sure, but where is it?<br>\r\n<br>\r\nLisa: You will see Bart! <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"></span></div></div>",
            "created":1562731740,
            "id":2684633,
            "title":"Maybe something else."
        },
        "1123222":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The End. Go back and continue or start from begining.</span></div></span></div>",
            "created":1562732460,
            "id":2684637,
            "title":"The End!"
        },
        "12":{
            "author_id":"myrtlefrost",
            "author_name":"Myrtle Frost",
            "choices":[
                "Take the vial, see what happens next",
                "Leave the vial "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should Lisa eat the vial or not?</span></div></span></div>",
            "created":1244264400,
            "id":703171,
            "title":"Lisa"
        },
        "121":{
            "author_id":"beanos",
            "author_name":"Joe Wharton",
            "choices":[
                "Bart",
                "Marge",
                "Homer"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You (Lisa) drink the vial and begin to shrink. Your clothes stay the same size so you are completely naked. You are found by...</span></div></span></div>",
            "created":1570403340,
            "id":2729132,
            "title":"Take the vial, see what happens next"
        },
        "13":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Try it",
                "Dont drink it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marge sees a vile on the table, she decides to...</span></div></span></div>",
            "created":1304744400,
            "id":1101972,
            "title":"Marge"
        },
        "131":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Bart walks in",
                "Lisa walks in",
                "Maggie crawls in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She drinks the vile and suddenly shrinks to 2 inches of size, then suddenly....</span></div></span></div>",
            "created":1304830800,
            "id":1102506,
            "title":"Try it"
        },
        "1312":{
            "author_id":"beanos",
            "author_name":"Joe Wharton",
            "choices":[
                "Unbirths Marge ",
                "Vores Marge ",
                "Anal vores Marge "
            ],
            "content":"<div class=\"\"><div> <span>Marge hears someone walking into the room and finds her daughter, Lisa, stopping just over her. Marge can see up Lisa’s skirt and she isn’t wearing any panties. “Ugh, I bet Bart is the one who drank my secret formula. I meant to use it on mom so I could use her!” Marge wondered what that meant. Suddenly, Lisa looks down and sees Marge. “Oh! So it did end up being used on you mom? Good, now we can have fun!” She takes you to her room where she...</span></div></div>",
            "created":1570399980,
            "id":2729114,
            "title":"Lisa walks in"
        },
        "13123":{
            "author_id":"beanos",
            "author_name":"Joe Wharton",
            "choices":[
                "Shit you out",
                "Keep you inside"
            ],
            "content":"<div class=\"\"><div> <span>As Lisa lays on her bed you can’t help but feel aroused. The look she has in her eye makes her seem so trustworthy, but at the same time , so dangerous and filled with lust. “I hope your ready mom!” Lisa pulls up her red dress to show her now dripping wet pussy and her giant (to you) asshole. She lower you towards it so you can have a taste. You are about to when you suddenly remember that this is your daughter. You pull back, disgusted, and Lisa sees this. She pushes you against her asshole and moans in pleasure. The smell is awful but the feel of her skin around the hole is so inviting. You are entranced by it. You debate whether or not to climb inside, but Lisa makes that deduction for you and pushes you deep inside her smelly hole. You can just make out Lisa’s muffled voice as she says “I’ve gat a BIG surprise for you mom!” Does she...</span></div></div>",
            "created":1570400880,
            "id":2729120,
            "title":"Anal vores Marge "
        },
        "131232":{
            "author_id":"beanos",
            "author_name":"Joe Wharton",
            "choices":[
                "Eats you",
                "Keeps you in her ass"
            ],
            "content":"<div class=\"\"><div> <span>“I think I’ll deliver it to you INSIDE my butthole.” You think about what she means, when you feel her hole tightening around you. Unable to get out, you start moving forward until your head hits something soft and warm. You only have to put 2 and 2 together to realise that you are pushed up against a giant turd. It keeps pushing against you but you can’t move anywhere. Lisa finally speaks up and says “just take the hint bitch and eat my dirty log!”. You tearfully obey as heaps of shit are forced down you. It tastes sort of sweet but there is too much of it. Eventually Lisa lets you punt and you sit up. “Don’t think your done just yet!”. Lisa then...</span></div></div>",
            "created":1570401600,
            "id":2729125,
            "title":"Keep you inside"
        },
        "1313":{
            "author_id":"simpfan",
            "author_name":"Simpfan",
            "choices":[
                "Maggie saw Marge and recognized her",
                "Maggie saw Marge but didn't know it was her mother",
                "Maggie stopped to soil and wet her diaper"
            ],
            "content":"<div class=\"\"><div> <span>\"Aaaaaaaaahhhhh!\" Marge screamed as she dropped the empty vial. This definitely wasn't the new energy drink Lisa had created with her eco-chemistry lab. Marge fell to the floor, as did her now humongous green shift. Thankfully, the ample fabric cushioned her fall. Marge surely hadn't anticipated this. She looked way up to the tall kitchen counter, where a bottle of juice sat. \"ENERGY DRINK,\" announced its label. All Marge could emit was a Homeric \"D'oh!\"  as she realized her error. The next thing she realized was that Maggie was crawling toward her -- a giant version (to Marge) of her infant daughter. Maggie got to about a foot away from Marge and then suddenly stopped. Why did Maggie decide to stop crawling?</span></div></div>",
            "created":1378011600,
            "id":1655657,
            "title":"Maggie crawls in"
        },
        "13133":{
            "author_id":"simpfan",
            "author_name":"Simpfan",
            "choices":[
                "Crawled inside Maggie's diaper!",
                "Screamed at the top of her tiny lungs!"
            ],
            "content":"<div class=\"\"><div> <span>Marge was momentarily glad that Maggie stopped mid-crawl, instead of trampling her. She wondered what had motivated that. Marge watched Maggie's facial expression turn from determination, grimace, and then relief. A strong fecal odor filled Marge's diminished lung capacity and she involuntarily wretched. While contemplating her next course of action, Snowball and Santa's Little Helper both bounded into the kitchen suddenly. Marge, in complete and sudden terror......</span></div></div>",
            "created":1381381200,
            "id":1676809,
            "title":"Maggie stopped to soil and wet her diaper"
        },
        "131331":{
            "author_id":"simpfan",
            "author_name":"Simpfan",
            "choices":[
                "The diaper ripped open",
                "Maggie let go"
            ],
            "content":"<div class=\"\"><div> <span>Marge shreaked on impulse and ran towards a now-seated giant (to Marge's point of view) Maggie. Momentarily forgetting what awaited her inside, Marge pulled with all her might to loosen one of the elastic leg cuffs and slipped herself into the warm diaper. As soon as she did, Marge realized her faux pas. She covered her nose and mouth with one hand. With the other, Marge held the elastic open far enough that she could catch  some fresher air. From inside the fetid shelter, Marge could hear the pets running through the house. She realized it could be awhile  before they tired of this activity. She just hoped she could wait that long. Maggie was happy right now and hadn't realized her mother's predicament yet. But she was aware of something different in the way her diaper felt. It wasn't the poo; she was quite accustomed to that sensation. But now there was something else that slightly irritated, but mostly tickled her. It had begun near her leg, but now she could feel something moving in there. Maggie knew that sometimes her body waste spread throughout her entire diaper. It often even soiled her front. But this was different. Her poo had been mostly solid this time. Had a bug gotten into her diaper when she had played in her sandbox? While Maggie was pondering this, she realized she needed to pee. If there was some type of insect in her diaper, maybe she could wash it out. Marge was attempting to maneuver away from the waste inside the diaper but every time she touched the baby's skin, it tickled Maggie. The toddler began to squirm now and rock back and forth. Marge was now wedged against Maggie's frontal parts. Then suddenly it happened......</span></div></div>",
            "created":1381381200,
            "id":1676818,
            "title":"Crawled inside Maggie's diaper!"
        },
        "1313312":{
            "author_id":"simpfan",
            "author_name":"Simpfan",
            "choices":[
                "She attempts to reach the kitchen sink",
                "She tries to get to the phone "
            ],
            "content":"<div class=\"\"><div> <span>Maggie was a toddler now and was learning more everyday, but she was not potty trained and wore diapers regularly. She was walking now, but rarely spoke. Along with the rest of her body, Maggie's bladder had increased its capacity. Nobody but she knew this, but Maggie could hold her pee until she was completely full. For some  reason, she derived pleasure from this. But once she was completely full, she had no control over when or where she released. So when Marge reached up to pull her blue hair down, the next thing she felt was a very warm, torrential shower. Maggie's bladder erupted all over Marge, who would have screamed but didn't want to swallow any of the copious fluid. Marge was completely drenched when she wrestled her way out of the soggy and soiled diaper. She figured that wherever she next ventured to would be a much better place. Where does Marge go now?</span></div></div>",
            "created":1381381200,
            "id":1676826,
            "title":"Maggie let go"
        },
        "14":{
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Who else but Homer?  Homer picks it up thinking it is a tasty beer and begins to shrink!  He shrinks down to 3 inches! Suddenly he feels the ground rumbling, he turns around and is met with quite a sight! Two yellow bare feet are right in front of him, the toes wiggling and giving off a foul odor which makes Homer's nostrils burn. He looks up to see Bart grinning evilly down at him.  \"Hey Homer, is that you? AWESOME! This is gonna be fun..\" Bart says as he picks Homer up and carries him to his room. He tosses Homer onto his bed and sets his two barefeet infront of him \"The first thing I want you to do is to lick my feet.\"</span></div></div>",
            "created":1201755600,
            "id":492967,
            "title":"Homer"
        },
        "141":{
            "author_id":"myrtlefrost",
            "author_name":"Myrtle Frost",
            "choices":[
                "Lick his feet",
                "Run away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Homer is confused whether he should lick his son's feet or not. If he does not, Bart might subject him to more torture, and if he will do it, he would suffer the taste of Bart's foot, which would he choose?</span></div></span></div>",
            "created":1244264400,
            "id":703169,
            "title":"Lick his feet or not?"
        },
        "1411":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Into His Underwear",
                "Into His Mouth",
                "Up His Hole"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Homer started to lick his son's feet then after a while Bart then put his Dad.</span></div></span></div>",
            "created":1515387600,
            "id":2438230,
            "title":"Lick his feet"
        },
        "14111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bart picked up Homer, and said \"okay, front or back of my undies?</span></div></span></div>",
            "created":1523854800,
            "id":2480504,
            "title":"Into His Underwear"
        },
        "141111":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "On Bart's Penis",
                "Pressed Against Bart's Penis"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bart pulled the front of his underwear and dropped homer inside and closed it once he dropped Homer inside. Homer was...</span></div></span></div>",
            "created":1525167060,
            "id":2486644,
            "title":"front"
        },
        "1412":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Tape him to his foot",
                "play w/ him in his mouth",
                "Make him go in his ass"
            ],
            "content":"<div class=\"\"><div> <span>Homer decides he didn't want to lick Bart's disgusting feet, so he ran away. Unfortunately for him, though, Bart slammed his foot down in front of Homer. Bart chuckled at Homer's futile attempt to get away.<br>\r\n<br>\r\n\"Oh, Homer,\" Bart said while laughing, why do you insist on making it worse for yourself!\"<br>\r\n<br>\r\nHow will Bart make it worse?</span></div></div>",
            "created":1286514000,
            "id":971394,
            "title":"Run away"
        },
        "14121":{
            "author_id":"yolomaster89",
            "author_name":"King of all",
            "choices":[
                "He puts on socks ",
                "He walks around with his pathetic dad stuck to his feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Don't wanna pick? Fine!\" He tapes homer to the bottom of his stinky foot sole</span></div></span></div>",
            "created":1499749200,
            "id":2351320,
            "title":"Tape him to his foot"
        },
        "14122":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "Swallowed Homer",
                "Spat Him Out For Other Ideas"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bart reached down and picked up the tiny Homer and first started licking him all over then slowly put Homer onto his tongue and began sloshing Homer around. Bart you let me out of here right now! Bart smiled as he then...</span></div></span></div>",
            "created":1500526800,
            "id":2356513,
            "title":"Playing With His Dad In His Mouth"
        },
        "141222":{
            "author_id":"mckeandragon",
            "author_name":"dragondude",
            "choices":[
                "His Underwear",
                "His Nose"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bart sloshed his dad around in his mouth with his tounge till Bart then spat out homer into his hand. Bart then put the tiny Homer into...</span></div></span></div>",
            "created":1525166760,
            "id":2486641,
            "title":"Spat Him Out For Other Ideas"
        },
        "15":{
            "author_id":"brony89",
            "author_name":"brony89",
            "choices":[
                "You(male)",
                "You(female)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who finds the strange vial?</span></div></span></div>",
            "created":1381726800,
            "id":1679096,
            "title":"other"
        },
        "151":{
            "author_id":"revoremonster",
            "author_name":"honeypaws",
            "choices":[
                "bart",
                "lisa",
                "homer"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>when you were walking by the simpson household, you find a small vile filled with an orange liquid. you drink it and pass out. when you wake up, who finds you?</span></div></span></div>",
            "created":1415422800,
            "id":1883012,
            "title":"You(male)"
        },
        "1511":{
            "author_id":"leebeckers",
            "author_name":"leebeckers",
            "choices":[
                "Takes you to his room",
                "Lays on the couch and demands you to rub his feet",
                "Give you away"
            ],
            "content":"<div class=\"\"><div> <span>You wake up on the floor of the Simpson's living room. As you rub your eyes, you hear the sound of footsteps and the ground starts to shake as they come ever closer. A dark shadow, will spiky hair engulfs your tiny body along with a bellowing voice, \"ai caramba! A tiny dude!\"<br>\r\n<br>\r\nYou look up to see a giant, yellow hand reaching down. Bart's giant fingers spread out as they seize your tiny body and he grips you tight in his fist before bringing you up to his face. Your tiny head pokes out the top of his fist whilst you tremble in fear.<br>\r\n<br>\r\nBart grins down at you, \"now what can I do with a tiny dude in my house?\" You face turns pale white as you imagine all the cruel things he has in store for you.<br>\r\n<br>\r\nWhat does he do?</span></div></div>",
            "created":1476680400,
            "id":2224695,
            "title":"Bart"
        },
        "15111":{
            "author_id":"leebeckers",
            "author_name":"leebeckers",
            "choices":[
                "\"I should eat this dude!\"",
                "\"He'll make a good pet!\""
            ],
            "content":"<div class=\"\"><div> <span>\"We're going to my room little guy!\" Bart chuckles as he runs up the stairs, down the hall, and into his room. You gulp as you look around, seeing all the things you expect to see in a 10-year old's bedroom. He sets you down on his desk and places a drinking glass over you to prevent you from escaping. He looks at you and all you see is pure evil in his eyes.<br>\r\n<br>\r\n\"I've never had a tiny man before as a pet, but I'm not sure if I want you as a pet yet.\" Bart rubs his chin as he puts his feet up on the desk in front of you.<br>\r\n<br>\r\nWhat is he thinking?</span></div></div>",
            "created":1476680400,
            "id":2224701,
            "title":"Takes you to his room"
        },
        "151111":{
            "author_id":"leebeckers",
            "author_name":"leebeckers",
            "content":"<div class=\"\"><div> <span>As Bart sits at his desk thinking, a large growl erupts from the depths of his stomach. From that moment on, you knew what he planned to do with you. He removes the glass and quickly grabs you before you can get away. \"You know, I've always wondered what it would be like to swallow something alive. How it would feel to have some squirming down your throat or how long it can survive in your stomach.\" You gulp, knowing where this was heading. \"How do you feel about being my little test dummy?\" You respond by squirming around in his tight grip, but all Bart does is laugh at your pathetic attempts of escape.<br>\r\n<br>\r\n\"Don't worry, I won't chew you up, I'm not that cruel.\" Bart grins as he grabs hold of your left between his thumb and index fingers before pulling you up, leaving you dangling upside in front of his face. He tilts his head back and opens his mouth as wide as possible, before moving you directly over the gaping hole.<br>\r\n<br>\r\nAfter what feels like an eternity, he drops you into the warm cave. You desperately try to climb up his tongue, but his jaw snaps shut, leaving you in complete darkness. You can hear his breathing as his tongue runs over your tiny body, tasting every last bit of it. You get covered in his saliva, from head to toe in the sticky residue.<br>\r\n<br>\r\nAfter a few minuted of tasting, he tilts his back once again and you fall to the back of his mouth. Eventually, Bart gulps and his throat engulfs your tiny body with his powerful throat muscles pulling you down his gullet towards his stomach. You soon drop into a pool of partially digested food, with an awful smell emitting from it.<br>\r\n<br>\r\nBack on the outside, Bart burps and pats his stomach leaving you to digest away within the walls of his body.</span></div></div>",
            "created":1476680400,
            "id":2224719,
            "title":"\"I should eat this dude!\""
        },
        "151112":{
            "author_id":"oliverhatt",
            "author_name":"Oliverhatt",
            "choices":[
                "Rub my feet",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm...\" Bart said as you sat under the glass, staring up at the yellow boy. He looked absolutely ginormous from where you were, and you were at his disposal. \"I think I'll keep you as a pet.\" Bart said finally. You breathed a sigh of relief at this, but what would being Barts pet entail? <br>\r\n<br>\r\nYou didn't have to wonder for long before Bart spoke again. \"You'll actually be more of a slave, but that's fine. Besides, if you ever disobey I could just eat you and no one would know.\" The giant kid laughed evilly as he considered what to do first.</span></div></div>",
            "created":1561440600,
            "id":2678216,
            "title":"\"He'll make a good pet!\""
        },
        "1511122":{
            "author_id":"oliverhatt",
            "author_name":"Oliverhatt",
            "choices":[
                "Smell my farts",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Bart choose?</span></div></span></div>",
            "created":1561440660,
            "id":2678218,
            "title":"Other"
        },
        "15111221":{
            "author_id":"oliverhatt",
            "author_name":"Oliverhatt",
            "choices":[
                "In the jar (Barts asleep)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Before Bart says anymore there was a grumble in his lower gut as an idea struck him. He ran out of the room and returned a few minutes later with a Mason jar, a piece of cloth, and half a lid. He set the stuff down before removing the glass from above your head. <br>\r\n<br>\r\nImmediately you tried to bolt away but you were caught by a giant yellow hand. \"Haha! That's just made your first duty worse!\" Bart chuckled and dropped you in the jar, you watched as he put the cloth on followed by the lid. Essentially he made you a jar that could filter air in.<br>\r\n<br>\r\nNext Bart pulled his pants down slightly, showing off his ass before picking the jar up and putting the top by his asshole. You knew what was next as a loud fart sounded out, it was very loud and smelt horrible. Like rotten eggs! \"Hahaha!\" Bart laughed. \"Theres more than that for you!\" The boy laughed as he farted again.<br>\r\n<br>\r\nA few more farts later the jar reeked of rotten eggs and you were feeling woozy, before eventually passing out. You fell on the ground of the jar, where do you wake up?</span></div></div>",
            "created":1561441440,
            "id":2678220,
            "title":"Smell my farts"
        },
        "151112212":{
            "author_id":"oliverhatt",
            "author_name":"Oliverhatt",
            "choices":[
                "In his pants (by his asshole)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you wake up?</span></div></span></div>",
            "created":1561441560,
            "id":2678222,
            "title":"Other"
        },
        "1512":{
            "author_id":"brony89",
            "author_name":"brony89",
            "choices":[
                "Lisa",
                "Maggie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who finds you?</span></div></span></div>",
            "created":1415422800,
            "id":1883367,
            "title":"lisa"
        },
        "152":{
            "author_id":"swankyhoodrat",
            "author_name":"MrMaggot",
            "choices":[
                "Lisa",
                "Bart, but he doesn't see you "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You happened to be walking by the Simpson house, and noticed a strange glass vial filled with some liquid. You drink, and find yourself shrinking to only an inch tall! You see someone walking towards you and it's... </span></div></span></div>",
            "created":1525064400,
            "id":2486541,
            "title":"You(female)"
        },
        "1521":{
            "author_id":"swankyhoodrat",
            "author_name":"MrMaggot",
            "choices":[
                "To her room",
                "To the kitchen",
                "To the living room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa walks over to you. You yell as loud as you can at her. She looks down and sees you, then picks you up. She takes you... </span></div></span></div>",
            "created":1525139520,
            "id":2486547,
            "title":"Lisa"
        },
        "1522":{
            "author_id":"swankyhoodrat",
            "author_name":"MrMaggot",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bart walks towards you, but doesn't see you. You try to get his attention but it's no use. He gets closer to you, and almost steps on you! You run away, but find yourself directly below his shoe. He takes a step and crushes you. </span></div></span></div>",
            "created":1525064400,
            "id":2486545,
            "title":"Bart, but he doesn't see you "
        }
    },
    "info":{
        "author_id":"deasly",
        "author_name":"Deasly",
        "brief_description":"One of the Simpson's characters gets shrunk in the Simpson's house.\r\n\r\n",
        "created":1187969580,
        "description":"<td align=\"left\" class=\"norm\">a formula ends up in the Simpson's house, one that can shrink organisms down to 1 inch tall.<br>\r\nany Simpson's characters allowed (including animals) try keeping the story second person, but you can change POV.<br>\r\n<br>\r\nkeep content 13+</td>",
        "id":1310118,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1570403340,
        "modified":1570403340,
        "pretty_title":"Shrunk in the Simpson household"
    }
}