{
    "chapters":{
        "1":{
            "author_id":"merry511",
            "author_name":"suuuu",
            "choices":[
                "Your sister Becca",
                "The popular girl Alexa",
                "The school athletic star Grace ",
                "The now attractive Hope ",
                "More "
            ],
            "content":"<div class=\"\"><div> <span>It is September, Sho just got home from a day at school, he plops himself on the couch, feeling exhausted, his sister Becca walking down from her room wearing her pajamas<br>\r\n<br>\r\n\"Go shower you smell like shit\" she says with some obvious disgust in her voice, you slump up and head upstairs to wash off, taking off your clothes and jumping into the shower, it feels nice after a long day of school. You thinks \"It's the same thing everyday, repeated over and over, never anything interesting\" as you stands contemplating how boring your life is you notice that the water is cold, you've been showering for a very long time.<br>\r\n<br>\r\nYou step out shivering, grabbing your towel and tying it around your waist, you walk into your room and get dressed with your towel still on the top of your head you rub it gently drying your hair. Sitting down on the bed you check your phone for messages but to no avail.<br>\r\n<br>\r\nYou head down the stairs to the kitchen, you notice on the kitchen counter there is a solid-colored bottle, looking close to that of a meal supplement but with no label. You hear a door open from upstairs and angry steps towards the stair banner <br>\r\n<br>\r\n\"Sho why'd you shower for so long! There's no hot water left! You knew I was going out today!\" says Becca angrily<br>\r\nYou cringe after hearing her yell, and quietly mutter a \"Sorry\" as she angrily walks back to her room, closing the door behind her. <br>\r\n<br>\r\nYou walk up to the bottle, noticing a note under it that reads \"This'll help break up some of the monotony :)\" <br>\r\n<br>\r\n\"This doesn't look like Becca's handrwiting\" you think to yourself <br>\r\n <br>\r\nInspecting the bottle further as you look for clues you find nothing, as you hear your stomache growl<br>\r\n<br>\r\nYou sit in the couch and shake the bottle well, cracking the top open and taking a sip, it tastes like a vanilla shake but with an off putting aftertaste but before you realize it you drank the whole thing and instantly you feel sick, trying to stand up you realize you can't move. But instead of feeling fear, you feel oddly relaxed, as if there is no danger at all<br>\r\n<br>\r\nIn this moment of relaxation you can only think of one thing...... <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1482037200,
            "id":2251417,
            "title":"The beginning "
        },
        "12":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Stay inside Alexa and have some fun",
                "Possess Ruby",
                "Possess Sarah",
                "Go possess someone else",
                "(Readers Choice)"
            ],
            "content":"<div class=\"\"><div> <span>In this moment of relaxation you can only think of one thing... Alexa. You remember her from school as being one of those typical popular kids who just think their above it all. For some reason you just can’t get her out of your head. You then feel yourself grow dizzier and dizzier until you pass out.<br>\r\n<br>\r\nWhen you come to you notice are laying on the floor in a completely different room. As you get up you notice your sense of balance has been shifted and long black strands of hair cover your face. You look around the room only to notice a full body mirror with a reflection of Alexa staring back at you. She was wearing a white button up blouse which showed a little cleavage, an unzipped black leather jacket, a black pleated mini skirt, grey fleece tights, and brown riding boots. You quickly looked down to discover you were in Alexa’s body.<br>\r\n<br>\r\nNeedless to say you quickly panic wondering how this happened until it hits you. “The Bottle”. Somehow, drinking from that bottle has made you possess Alexa. “If I can somehow enter her I wonder if I can leave her.” You wonder. You then try to concentrate on leaving her and after a little while you succeed and your spirit flies out of her body as her body falls to the floor unconscious. “Wow, this is pretty cool!” You say as you fly around the room. You then look down as you see Alexa get up off the floor.<br>\r\n<br>\r\n“Ugh. What happened?” She says rubbing her head. “Well, whatever happened I need to hurry up and get ready to go to the mall.” She says as she heads over to her mirror and starts putting on makeup.<br>\r\n<br>\r\n“Hmm. That sounds like it would be fun but there’s no way she would let someone like me join her unless...” You say as you fly over to her. She is finishing up her makeup and is now tying her hair into a ponytail. “Well, here goes nothing.” You say as you fly straight into her back, repossessing her.<br>\r\n<br>\r\n“I have to admit Alexa, you can make yourself look really good.” You say as you look yourself over. You then proceed to leave house and are on your way to the mall when you are stopped by two girls. You immediately recognize them to be Ruby and Sarah. You remember them to be Alexa’s underlings who always piggybacked off of Alexa so they could fit in with the popular kids. <br>\r\n<br>\r\n( Ruby is white girl with long blonde hair and blue eyes. Currently she is wearing a black T-shirt, a grey zip up hoodie, a pair of denim jeans, and black riding boots.)<br>\r\n<br>\r\n(Sarah is an asian girl with short black hair and green eyes. Currently she is wearing a pink long sleeved shirt, a black skirt, and wedge sandals. )<br>\r\n<br>\r\n“Hey Alexa. Ready to go to the mall?” Sarah asks.<br>\r\n<br>\r\n“Yeah, I’m ready.” You say back to Sarah trying your best to imitate the real Alexa. After a short drive later you finally arrive at the mall. You now ponder what to do.</span></div></div>",
            "created":1541048400,
            "id":2571478,
            "title":"The popular girl Alexa"
        },
        "15":{
            "author_id":"merry511",
            "author_name":"suuuu",
            "choices":[
                "Your English teacher Janna Ivy",
                "Ms. Serena Crawford - the principal ",
                "Someone you saw on TV",
                "The quiet girl Faith ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You continue thinking and more thoughts fill your mind... </span></div></span></div>",
            "created":1501304400,
            "id":2361298,
            "title":"More thoughts "
        },
        "151":{
            "author_id":"merry511",
            "author_name":"suuuu",
            "choices":[
                "Go back to your home to see how you can fix this",
                "go to \"your\" home",
                "Attempt to figure out how you got the drink in the first place "
            ],
            "content":"<div class=\"\"><div> <span>Thoughts of your English teacher Ms.Janna Ivy, fill your mind, despite this only being the first month of school with her as your teacher you can already tell she truly enjoys teaching, always trying to make lessons interesting and engaging. Every time you ask a question you can't help but get lost in her soft-spoken words that demands just enough attention that you can still understand and take in the material she is helping you with. Always greeting you with a kind smile.<br>\r\n<br>\r\nAs your eyelids close you pass out. When you wake up you see a strangely familiar place, \"This is my English classroom\" you think to yourself, \"but the perspective is different, I'm in the top right corner of the room..in the teachers seat..?\" You feel uneasy, turning to the computer monitor you notice that there is the layout for a lesson plan, with a sudden string of the \"I\" key trailing off the page, in the top right corner it says \"Janna Ivy\" a chill runs down your spine as you raise a hand towards a small mirror placed on the desk, turning it towards yourself \"...I became Janna Ivy?!\" you say as you nearly drop the mirror, as you feel your face you think \"it must be that drink i drank earlier, even my voice is the same as hers!\", working your way down the body, noticing the immediate difference, breasts. \"This is the outfit she wore to class today, a black pencil skirt and white blouse with black heels, her light makeup is the same too. \"Teachers do tend to stay later than students\" you think to yourself.<br>\r\n<br>\r\nAs you contemplate and finally get a grip of the situation you can't help but feel kind of  nagging feeling, as if your wasting your time, facing towards the monitor you delete the string of \"I\"s that were left. Laying your hands on the keyboard, looking at them, their so different from your or rather Sho's hands, well-manicured and soft compared to your rough-looking hands. But strangely you notice you had begun typing the lesson plan, idea after idea, flowing out of your mind, it feels....fufilling and kind of fun. Before too long you are completely engrossed in creating this lesson plan, and notice you are already finished typing it out.<br>\r\n<br>\r\nSitting back into your chair, it's strange, you feel a kind of excitement doing this, could it be that after I became Ms.Ivy, I also adopted her traits, mannerism, and truly became her..?<br>\r\nNo, that's not right, I still know I'm Sho and that i'm in someone elses body. Picking up 'your' phone you look at the time, \"6:00 already?, time really flies\" Turning off the computer, you stand up and stretch, looking down at your blouse, you prop up your breasts with your forearms, saying in your newfound, soft voice \"maybe this isn't too bad\" but the thought crosses your mind when you think that maybe someone wanted you to become Janna <br>\r\n<br>\r\nGrabbing your phone and placing it into your handbag you exit the classroom, the building is so quiet after hours, all you can hear is the clicking of your heels against the floor as you walk down the halls, making your way down the main stairway. You see the principal waving towards you<br>\r\n<br>\r\n\"Good work today Janna, have a safe trip home\" with her words your mind goes blank, unable to remember the principals first name, \"I-i'll see you tomorrow u-Serena!\" you blurt out just in time as you wave back to her, walking through the main exit, and towards your car, it seems you inherit Janna's memories as well. \"Regular me wouldn't know where the car is let alone how to drive well\"<br>\r\n<br>\r\nWell, what should I do now?<br>\r\n</span></div></div>",
            "created":1503637200,
            "id":2374673,
            "title":"Your English teacher Janna Ivy"
        },
        "154":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Go home to see if you can fix this",
                "Embrace the change and have some fun with your new body",
                "Someone comes in "
            ],
            "content":"<div class=\"\"><div> <span>As you were sitting on the couch, you strangly could only think of one thing: Faith. You have class with her and you talked with her time to time and from that you both seem to have some stuff in common although you also have noticed she is pretty dang shy. As you were think about her you feel your eyelids grow heavy then you pass out. When you wake up you see you were standing in someone else's room and when you feel a chill run down your spine you look down to see that you had breasts. You stagger from the shock and start to take a better look at the room your in you notice it is a girl's room stocked full of anime . You then see a full body mirror so you walk up to it and are shocked to see a naked Faith with her glasses staring right back at you. \"I... I turned into Faith?!\" you say out of shock as you continue to prod your new body to see if you're dreaming to no avail. After you are able to calm down you realize it must because of that drink you drank earlier. You decide to try to head home to see if you can find a way to undo all this. \"Well I can't just go outside in Faith naked.\" you say so, you go to her closet and pick out so clothes to wear. First put on a front hook bra you found since you were having trouble with the normal ones, next you put on some pink panties on which had cute kittens on them. Then you put on some white ankle high socks, then a over sized grey hoodie that felt immensely comfy to wear then you put on a piar of dark blue sweatpants that felt just as comfy to wear. Finally you put on some knee high black boots and zip them up then tuck them under your sweatpants. After all that you turn to see what you look like and blush at the sight. \"I don't know why but these clothes feel so good to wear, more than they should and I can't help but blush at myself in the mirror it's almost as something WANTS me to become Faith but I'm probably just imagining things.\" you say a bit worried. \"Probably. Now what should I do...\"</span></div></div>",
            "created":1503291600,
            "id":2372636,
            "title":"The quiet girl Faith "
        },
        "1543":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "go out and pretend to be Jenny",
                "Have some fun with the cosplay",
                "Find someone else to possess"
            ],
            "content":"<div class=\"\"><div> <span>As you were still checking yourself out you hear your door open and in comes a little girl. \"Hey big sis ready to go yet?\" she says. All of a sudden a rush of memories come to you and you realize who she is. She is your 10 year old little sister named Jennifer but most people call her Jenny for short. She had straight brown hair unlike her sister with a bright red highlight on one of her leftward bangs. She also had her hair tied in a ponytail and she a black long sleeved shirt with a red dress over it some white tights and black knee high boots with a black leather bow on each ankle. You also remember she loves the color red, she loves anime and manga just like her big sis whom she greatly adores, the only person Faith can talk somewhat freely to, is pretty playful, and Faith asked Jenny to remind her to get going to a nearby store that was having a sale on some stuff she wanted. \"Th... Thanks Jenny.\" you say feeling oddly shy around her. \"You're welcome Big sis!\" she says happy to get your appraisal. \"Well come on if you don't hurry you might be too late!\" she says as she grabs your hand as you wonder what it's like to be a happy little girl like her when all of a sudden you start to feel dizzy and pass out. When you wake up you notice your body feels different then usual well... even more different. As you get up you realize you are now Jenny. You look around for Faith but she wasn't in the room so you figure she ran off to the store without trying to disturb you. You then walk up to the mirror and check out your new form. Once again the clothes you're wearing feel like heaven but, instead of of blushing at the your sight you smile contently. When you think about stripping down to check your whole body out something in you doesn't want to do it then, when you think about Faith's body for some odd reason you don't feel turned on you then think about other girls' bodies you even think about dicks but you still don't feel the least bit turned on. \"I guess whom ever I am in I seem to get their mannerisms, personality, memories, and habits. It really is like SOMETHING wants me to become whoever I possess.\" you say. you then proceed to head to Jenny's room. As you enter you see the wall was painted red and in the pretty damn big closet you notice a lot of pretty well made cosplay costumes. </span></div></div>",
            "created":1503378000,
            "id":2372790,
            "title":"Someone comes in "
        },
        "15431":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Go back 'home' and go to sleep",
                "Some kid comes up to you"
            ],
            "content":"<div class=\"\"><div> <span>You decide it might be fun to go out and pretend to be Jenny for a while so you grab her phone and leave your room and head downstairs. After you head downstairs you look around to see if anyone is home but you can't find anybody so you continue on your way and leave the house. As you were walking around you happen to notice a playground. You try to just walk past it but something in your mind just wants to go to the playground and play so you turn around and enter. You look around you notice alot of different things but you see a swing and decide that it mught be fun so you get on the swing and start swinging. As you were swinging you notice a lot of other kids some of which were with their parents so as you keep swinging you ponder what to do next.</span></div></div>",
            "created":1503378000,
            "id":2373043,
            "title":"go out and pretend to be Jenny"
        },
        "155":{
            "author_id":"merry511",
            "author_name":"suuuu",
            "choices":[
                "The reserved but smart Brooke",
                "The proactive gym teacher Ms.Charlotte Dawson",
                "The Bubbly art teacher Ms. Claire Stevens"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more fill your mind</span></div></span></div>",
            "created":1512622800,
            "id":2425274,
            "title":"More"
        }
    },
    "info":{
        "author_id":"merry511",
        "author_name":"suuuu",
        "brief_description":"A boy can possess people but he can't tell anyone. 1000 GP for for substantial chapters ",
        "created":1482044400,
        "description":"<td align=\"left\" class=\"norm\">A story about a boy named Sho who gains the ability to possess people freely <br>\r\n<br>\r\nI want to keep this story as open as possible - but with some focus on how Sho acts after possessing another person. Impersonating them<br>\r\n<br>\r\nSho's possession power are simple:<br>\r\n- Can possess other people <br>\r\n- He can also possess others while his own body goes on unaware that Sho himself is not inside<br>\r\n-Those he possesses have no memory of what happens during the possession<br>\r\n- <b>He also needs to see someone at least once to possess them, this means he can also possess people he sees in pictures(ex. a model on a magazine</b><br>\r\n- After he unpossesses someone he can linger around as a ghost for a while until you sees someone he wants to possess, or he returns to his body<br>\r\n<br>\r\n<b>Characters</b><br>\r\n<br>\r\nSho- 18, an average high school boy, who you play as, does not stand out particularly, with long puffy hair <br>\r\n<b>Refer to yourself as you or Sho - try to keep it consistent</b><br>\r\n<br>\r\nYour older sister Becca - 21 she's in college and an honor student, she teases you a lot as your older sister, but it would be a lie to say she's not sexy, with a very womanly figure under her usual sweats, with shoulder length wavy brown hair, D-cup boobs and a great ass<br>\r\n<br>\r\nAlexa - 18 the popular girl at school, she is asked out a lot but always turns people down, she acts as if she's superior to everyone else, though she is a grade under you, she's a white girl,with long black hair and C-cup boobs with an average ass<br>\r\n<br>\r\nBrooke - 18 a very smart white girl, always at the top of the honor role, because of this she is fairly well known throughout school but not particularly popular, she spends most of her time studying, with C-cup boobs and a tight ass, she is dating a basketball player named Kevin<br>\r\n<br>\r\nKevin - 18 a very athletic short guy, with a buzzed haircut. He's on the basketball team playing Shooting Guard<br>\r\n<br>\r\nFaith - 18 the opposite of Alexa, a quiet and reserved girl in the same grade as Alexa, she's a brown girl with thick framed glasses and curly brown hair, usually wearing sweats, but maybe she has a good figure under :D she has C-cup boobs and a fine ass<br>\r\n<br>\r\nGrace - 18 the school's athletic star, she is very competitive and works very hard to try to be the best at her sport, volleyball. She is fairly short with B-cup breasts and a tight ass, Ms. Charlotte Dawson is also the coach and manager of her volleyball team<br>\r\n<br>\r\nHope - 18 the dark horse of the school, Sho remembers her to be nothing special in middle school, but as she entered high-school she started to care about how she looks, and now looks stunning always, she retains her kind personality from before but has a slight resentment since people only now started to take note of her, she has C-cup boobs and a average ass<br>\r\n<br>\r\nMs. Janna Ivy - your English teacher, a brilliant woman who seems to enjoy her job immensely, and the students enjoy her immensely, she's a beautiful woman, with light brown hair just past her shoulders, usually wearing a pencil skirt, hugging her figure, she has C-cup boobs and a great ass<br>\r\n<br>\r\nMs. Charlotte Dawson - Girls gym teacher, a hardworking and proactive woman who also teaches kinesiology, she's very exercise oriented but not too muscular; she tries to keep her body in top shape with various workout routines and also tries to encourage others to exercise as well. She is gorgeous, with long blonde hair usually in a ponytail and soft blue eyes with D-cup breasts, usually seen wearing a runners sweater over her sports bra, with jogging pants.<br>\r\n<br>\r\nMrs. Serena Crawford - The school principal and a perfect Milf, she is a very by-the-books lady with fairly strict rules she enforces, very kind to whoever follows them but cruel to those who do not. She is usually seen wearing a stereotypical office uniform, dress shirt, pencil skirt and a coat, her brown hair is long but usually put up into a bun, she has piercing blue eyes, wide hips and D-cup breasts. She is also Kevin's mother<br>\r\n<br>\r\nMs. Claire Stevens - The bubbly art teacher, very fun-loving and supportive with a cute smile, she's very friendly, well-known and loved among the student body. She has long wavy brown hair, usually wearing slacks and comfortable clothes. She has D-cup breasts and a nice ass.<br>\r\n<br>\r\n<b>Not limited to these characters - I will add more when someone adds another to the story</b><br>\r\n<br>\r\n<b>rules</b><br>\r\nSho cannot die<br>\r\nNo abrupt endings <br>\r\nNo Gore or violence<br>\r\nSex is allowed<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2105886,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1586908020,
        "pretty_title":"Possession Process "
    }
}