{
    "chapters":{
        "1":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "Friends",
                "Enemies",
                "They at least know each other",
                "They know of each other",
                "They have no idea the other exists"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, before the story beings: Are the girl and her clone friends, enemies, or what?</span></div></span></div>",
            "created":1249621200,
            "id":740632,
            "title":"Before we begin..."
        },
        "11":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "After the battle",
                "More of the battle"
            ],
            "content":"<div class=\"\"><div> <span>Zelav knew the enemy attack was coming soon. But unlike the other times, she wasn’t worried. Because of her bravery and strength in the previous battles she had been chosen as a subject in the military’s new cloning project. With even one more soldier like her victory over the invaders was that much closer and easier to reach. But when Zelav’s clone emerged from the chamber some accidents happened. Fortunately the clone, whom was now called Valez, was still sound in body and mind and still on their side.<br>\r\n<br>\r\nAnd soon enough the attack came. Round after round of laser blasts soared past Zelav’s head as she sent blast after blast at the advancing hoard. “Damn! There’s too many!” A male soldier beside her swore. “Stay strong corporal. We haven’t lost yet.” Zelav shouted. She knew he was right, there were too many enemy troopers for them to force back, but she also knew someone who could force the enemy to retreat. “General! It’s Zelav, we need our special backup and we need it now.” Zelav shouted into her communicator over the blasts and explosions. “She’s on her way.” The general replied.<br>\r\n<br>\r\nZelav smiled to herself as she resumed shooting, the enemy wouldn’t know what hit them. <br>\r\n<br>\r\n<br>\r\nSoon over the noise of the battle Zelav heard the sound of approaching footsteps, and as loud as they were she knew the enemy would hear them too. And it seemed they did as all the shooting stopped as every soldier on both sides, except for Zelav, tried to figure out what the sound was coming from. <br>\r\n<br>\r\nSoon they discovered the source of the noise, or rather it found them. A giantess that looked exactly like Zelav appeared. Zelav smiled as she heard the screams from the enemy, but she heard plenty from her fellow soldiers since none of them knew that Valez was on their side.<br>\r\n<br>\r\nValez’s armor was quite different from Zelav’s and that of regulations. Valez was mostly covered with spare parts from old tanks and aircraft, but plenty of skin still showed; unlike Zelav’s armor which was well streamlined and covered everything but her face, and that was protected by a mask and clear plastic eyewear. Valez kept an expression of calm concentration as she drew her weapon; a giant-sized pistol once again made from parts of an old tank, and opened fire on the enemy militia. <br>\r\n<br>\r\n“C’mon men! Victory is ours!” Zelav shouted as she resumed firing.<br>\r\n</span></div></div>",
            "created":1249621200,
            "id":740633,
            "title":"United they stand"
        },
        "111":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "The next day is peaceful",
                "Another attack"
            ],
            "content":"<div class=\"\"><div> <span>The battle was over soon. There were more casualties than Zelav would have liked, but she knew without Valez there would have been more. Since Valez was so big she had to use an old warehouse for a bunker, and she still had to crawl into it. Zelav volunteered to sleep with Valez in the warehouse, originally as a show of good faith, but that soon changed. Zelav felt an odd yet non-frightening connection with her giant clone, one that was like the connection between sisters and that between a mother and her daughter. <br>\r\n<br>\r\n“Hey Valez, you were great. You did quite well for your first time in combat.” Zelav said as she started undressing for bed.<br>\r\n<br>\r\n“Thanks, I just wish our guys didn’t scream when they saw me…” Valez said as she removed the pieces of her ‘armor’, “I guess I should be thankful that this was in the countryside and not a city. Those that wouldn’t run and scream as I came would probably be staring at me as their noses bleed.”<br>\r\n<br>\r\n“Just give ‘em time to get used to you. General Macintyre set them all straight so you shouldn’t need to worry about a repeat performance from the guys. Oh, by the way, Doc’s coming soon to make sure nothing happened to your molecular bonds or something like that.” Zelav said as she put on her nightgown.<br>\r\n<br>\r\n<br>\r\nJust then there was a knock on the steel door before it opened. “Hello Father- I mean Doctor Hanson.” Valez said, blushing in embarrassment. It was a subconscious habit of hers to call Doctor Hanson “Father” and occasionally call Zelav “Mother”. Valez then seemed to realize she didn’t have anything on and quickly covered her private parts with her hands and arms. Doctor Jim “Doc” Hanson was the scientist that brought Valez into being, and was a good friend of Zelav’s. <br>\r\n<br>\r\n“Evening ladies. I heard that Valez did excellently at the front today.” Doc said as he adjusted his glasses and strolled on.<br>\r\n<br>\r\n“They said that?” Valez asked.<br>\r\n<br>\r\n“Not exactly, they said you ‘performed’ excellently, like you’re some kind of tool.” Doc said angrily, like Zelav he felt very strongly for Valez, even though she wasn’t born like most humans he still considered her a person. “Anyway, Dr. Burns tired to convince the big wigs to allow him to find the chemical formula that made Valez grow so he could create more giant soldiers.”<br>\r\n<br>\r\nZelav sighed, ever since the accident when Valez emerged from the cloning chamber and knocked some chemicals from some shelves that eventually caused her to grow, Dr. Franklin Burns had been trying to get his hands on the formula. “I hope they shot down his request again.” She said.<br>\r\n<br>\r\n“Like a duck with no wings. Ol’ Mac gave the costs of rations and material stuff the other generals wanted to hear.” Doc replied. Zelav and Valez smiled, when such things came up General Macintyre would prattle on that Valez alone was costing a fortune to feed, and eventually clothe and arm, but all three of them knew he felt for Valez and wanted her to feel secure as an individual.<br>\r\n<br>\r\n<br>\r\n“Well, enough of the news. I need to make sure nothing’s going wrong with Valez. So I’m going to have to ask you to relax and put your arms at your side Valez.” Doc said.<br>\r\n</span></div></div>",
            "created":1249621200,
            "id":741424,
            "title":"After the battle"
        },
        "1111":{
            "author_id":"purplemaster",
            "author_name":"PurplePlanetWriter",
            "choices":[
                "Midnight mission that they easily win",
                "Midnight mission that they barely win",
                "Midnight mission fails and Valez and Zelav are captured"
            ],
            "content":"<div class=\"\"><div> <span>     The next day Zelav got up early just before dawn which she was always accustomed to doing.  She looked out the scenic area past their military compound and she could she the remnant of the beauty of this alien planet.  She began thinking about the peaceful times of her growing up on Beta 6 a beautiful planet similar to Alpha Prime but 2.5 larger and a 37 hour day and 4 time longer year.  \"Hey this is the first quiet morning in months!  I bet those fagots were shitting in their pants when they saw Valez!\" she amusingly thought to herself.  \"Let get sleeping beauty up!  Valez up and Adam!\" Zelav yelled but Valez was dead to the world snoring so loud that she made steel door to warehouse rattle.  \"What the hell?  How am I suppose to wake the bitch up?  I know what will do the treat!\" Zelav said with a bit of playful malevolence in her voice.  She got the water hose that would have normally been used to extinguish a fire or hose the floor of the warehouse down but Valez had been using to drink water from and pointed her huge groin and shot the water full force.  For a normal sized person the water pressure would have sent a her sliding down the floor for several meters but for Valez with felt like someone turned on a faucet of cold water on her sensitive coddy.  \"Shit!  Have you lost your mind?!\" Valez yelled after being so rudely awakened.  \"Ha ha ha ha!  You stupid shithead its time to wake up.\"  \"Mother...I mean Zelav can't you be a little more subtle?\"  \"Valez you are a MEC [a name the marines called themselves taken from the M.E.S.C. Marine Extraterrestrial Space Core] there is no sweet good mornings bitch!\"  \"Whatever...and I was having a good dream too...\"  \"About a man? ha ha ha or are you into girls? Ha ha ha!\"  \"Well...not exactly...\"  \"Come on Valez give me all the details,\" Zelav said with great anticipation on hearing really juicy story.  \"Not until I have some breakfast I'm starving!\"  \"Okay don't be such a tight ass or 'mommie' will have to spank you ha ha ha!\"  \"Mother you are so crazy ha ha ha!\"  For some reason when Valez called her mother she felt something different, was it the way she said that was different she thought or was it because of this peaceful moment in this God forsaken war that she allowed herself to be human for a moment.  \"I'm right on it....hello mess unit?  This is staff sargeant Zelav I need you guys to send down Valez's liquid food supplement in the tanker right away...what you mean another hour?  Either you guys get off your lazy asses and get that tanker down here in the next 5 minutes or I can let Valez go and get the tanker herself...I thought you would see the light!\"  \"I have to go through this everyday.  Just because I'm big I still have to eat I like everyone else.\"  \"Don't let them get to you\"  \"I know mother...I know...Thanks for caring...\" for the first time Valez started to get choked up and a single tear formed in her eye and fell to the ground almost hitting Zelav.  \"Hey...that's what I'm here for..\" Zelav said as she patted shoulder.<br>\r\n     They both had their morning field rations which had not improved much down through the centuries.  \"I need to wash! I know I must smell God awful Z!\"  \"Yes you do ha ha..\"  \"Z can you do me a big favorite?\"  \"A girl your size can only get big favors ha ha!\"  \"Seriously mother, normally  they spray some sterilizing chemicals and they smell terrible I almost lost my lunch after one treatment!\"  \"That would have been a mess!\"  \"Ha ha ha Z you're too much ha ha!\"  \"I always aim to please, now what can I do for my big girl?\"  \"Can you hose me down with the water hose.  I would do it myself but my fingers are too big to work the controls.\"  \"I understand Boo.  I know General Macintyre will have a royal conniption for me using that much water but this planet has plenty of water.  Are you ready?\"  \"Yes mother.\"<br>\r\n     Zelav began hosing down Valez with the cold water.  She fussed and complained at first but her body got use to it.  Zelav began washing her face and her hair and rest of her body.  It took her almost 4 hours to completely wash Valez down.  \"Girl that is the last favorite I do for you! I am exhausted...I am going to get a shower....\"  \"The hell is going on here!\" Dr. Franklin Burns yelled!  \"Well it is so good to see you too Dr. Burns!\"  Dr. Burns had pulled strings to get aboard a star cruiser to come there.  Zelav had gotten a heads up from both General Macintyre &amp; \"Doc” Hanson that the viper was on his way and they also came in the warehouse along with him.  Zelav felt for Valez who was embarrassed with them walking in on her like that unannounced and she wearing only the water that Zelav had dosed with earlier and trying to cover her breast and her groin and not doing a a success job at it to be assured.  \"Valez my deepest apology for this intrusion on your privacy but I would have allowed this civilian into this military unit unless it was crucial to this war,\" General Macintyre said with such tenderness that it was like he was talking to his own daughter.  \"This information which I am about to tell you is limited to we that are in this room, the secretary of Interstellar Defense and the United Federation of Planets President.  We have just deciphered a coded message from the enemy that have send for a secret weapon to neutral our secret weapon, being you Ms. Valez..  We have reconnaissance information to confirm that several heavy military cargo freighter have landed on the far side of the planet.  We don't know what they have in mind but it will not be good for you Valez or the troops. We cannot permit them to assemble whatever machine is.  Zelav you are to take Valez and a limited number of your best soldiers to go into their territory and destroy that thing.  I will leave it up to your discretion as to what equipment you will need to get that job done.  I suggest you get moving after twilight.  Any questions?  Gentlemen we will leave the women to prepare themselves for the mission,\" General Macintyre concluded.  \"But I was promised by the council that I would have full access to the test subject!\" Dr. Burns demanded.  \"All in good time after they complete their mission,\" \"Doc\" Hanson said as he &amp; the general escorted him out of the warehouse.  \"Can you believe that nerve of the guy?\" Zelav said.  \"I hate the way he looks at me. He gives me the creeks.  I bet you any amount of credits that he wouldn't twice about dissecting me to suit his purposes!\" Valez said with absolute disgust.  \"I would have to agree with you on that one.  We better get ourselves and the gang ready for this mission tonight.\"</span></div></div>",
            "created":1267857060,
            "id":846605,
            "title":"A rare peaceful moment."
        },
        "11113":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "Dr. Burns!",
                "The Zex Queen"
            ],
            "content":"<div class=\"\"><div> <span>Zelav adjusted the view of her night-vision goggles, focusing in on the enemy camp. “Yep those are military grade cargo ships.” She muttered before turning to look at the task force. The dozen being gathered behind and beside her were some of the best units in the United Federation of Planets military, though only three of them, besides Zelav and Valez, really stood out. First off there was Yivra, a Tiragg, a red skinned black haired near-human species. Though Tiraggs were by nature pack beings, Yivra had stayed to herself occasionally speaking to others in a generally downward tone; at least until Zelav saved her life during the Naiga Campaign. After that she and Zelav became quite good friends. Then there was Vassk, a seven foot tall bipedal lizard-like Drashian. Vassk was one of the UFP’s best units, his ability to see in the infra-red spectrum and discern an enemy’s species by their scent, as well as being a cunning and ruthless warrior, made him an invaluable asset to the war effort. And lastly there was Nera; the only other clone besides Valez, except Nera wasn’t fortunate, or unfortunate, to have a similar accident. And unlike Valez, Nera’s template, another human woman named Aren, wasn’t alive anymore. Such brought some sadness to Zelav; Aren had been her mentor through her years of training before becoming a field soldier.<br>\r\n<br>\r\n“Vassk, what’ve you got?” Zelav asked looking to her left.<br>\r\n<br>\r\n“[It is difficult,]” Vassk replied in his growling dialect, his vocal chords unable to make the right sounds for Universal, “[I smell the natives, like the ones in the attack yesterday, but the other scent… Wait, by the nearest transport. It is a Zex.]”<br>\r\n<br>\r\n“What?” Zelav said refocusing her goggles to the spot Vassk mentioned. To her deepest fears, it was indeed a Zex.<br>\r\n<br>\r\nThe Zexs were considered the stuff of nightmares. No one could tell what kind of being they were, whether mammal, crustacean, insect, plant, or whatever; in fact they seemed to be a bit of all. They looked like humans, except for their green skin, armor-like shells growing over their lower arms and legs, insect-like wings, and their tendril-like hair that some could move and grow at will. But the real thing that made the Zexs the terror of the galaxy was that they would assimilate “worthy” beings and brainwash or enslave, or simply kill the rest. The Zexs were infamous for their merciless advance from a secret and mysterious homeworld, and their hive-mind efficiency and behavior while still able to think and act as individuals.<br>\r\n<br>\r\n{Author’s note: Zex appearance based on this picture, it is not mine: <a rel=\"nofollow\" href=\"http://fc05.deviantart.net/fs71/f/2010/084/c/d/Starcraft_evolution_by_Karbo.jpg\" target=\"_blank\">http://fc05.deviantart.net/fs71/f/2010/0...</a> }<br>\r\n<br>\r\n“Well, if the Zexs are here, that means we’ve got to win this planet all the faster.” Yivra said from Zelav’s right. Zelav knew why Yivra was so eager: long before joining the UFP’s military Yivra’s homeworld of Tinagg, a Tiragg colony, had been overrun and assimilated by the Zexs in a few short days. Leaving Yivra an orphan as she escaped with other survivors.<br>\r\n<br>\r\n“Well then, let’s go.” Valez whispered behind the group.<br>\r\n<br>\r\n“[Wait. I smell…]” Vassk started to say before Valez suddenly screamed in pain.<br>\r\n<br>\r\nZelav saw a few sparks from a powerful stunner-shock arcing across Valez’s skin before Nera cried out “Ambush!” and the squad opened fire.<br>\r\n<br>\r\n“Damn! It’s a trap!” Zelav heard Yivra shout before another stunner-shock rendered her unconscious.<br>\r\n<br>\r\n<br>\r\nZelav moaned as she awoke, the lingering tingle of the stun-shock still coursing through her body.<br>\r\n<br>\r\n“Morning sunshine.” Yivra said from Zelav’s right. <br>\r\n<br>\r\nZelav slowly turned to look. She and Yivra were bound by their wrists and ankles in an old stone cell by heavy iron chains. <i>The Zexs are quite nostalgic</i> Zelav thought before asking aloud, “What happened?”<br>\r\n<br>\r\n“Well, as you can guess the transports were fakes. The whole thing was a trap to lure some of our best soldiers into this trap the Zexs set up. I hate to admit it, but it worked quite well.” Yivra replied, bitterly thinking of her failure and that of the squad.<br>\r\n<br>\r\n“Where are the others?” Zelav asked, realizing as the stunner’s effects wore off that it was only her and Yivra in the cell.<br>\r\n<br>\r\n“Vassk and the others were taken for “re-education”. I even saw them putting a brain-worm in Noven, not a pretty sight. But I think they may have decided to assimilate Nera. Which is likely…” Yivra answered.<br>\r\n<br>\r\n“Which is likely why we’re here.” Zelav finished. Unbidden, memories of stories of Zex assimilation from her childhood forced their way into her mind; none of the stories were pleasant.<br>\r\n<br>\r\n<br>\r\nIt was almost an hour later when a Zex guard entered the cell. “You have a visitor.” It purred before steeping to the side. Two more Zex guards stepped forward, dressed in finer armor than the first, then they too stepped aside. From between the pair of guards in stepped…<br>\r\n</span></div></div>",
            "created":1273672920,
            "id":881963,
            "title":"Midnight mission fails and Valez and Zelav are ..."
        },
        "111132":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "“…The assimilation ritual”",
                "“…study” The Zexs want the growth formula"
            ],
            "content":"<div class=\"\"><div> <span>From between the pair of guards in stepped a tall, and surprisingly beautiful, Zex female dressed in exquisite garments, signifying her as-<br>\r\n<br>\r\n<i>The Zex Queen!</i> Zelav thought in terrified shock, <i>Whatever’s going on here is more important to the Zexs than I thought.</i><br>\r\n<br>\r\n“My apologies for your current lodgings ladies, but I’m sure in time we can fix that.” The queen purred, stopping just before the two prisoners.<br>\r\n<br>\r\n“Where’s Valez.” Zelav demanded, remembering that Yivra hadn’t mentioned her earlier.<br>\r\n<br>\r\n“The giantess? You need not worry about her; she is no more harmed than you are.” The queen replied.<br>\r\n<br>\r\n“You didn’t answer the question: where is Valez?” Yivra said unable to hide the hatred and bitterness in her voice.<br>\r\n<br>\r\n“Temper my dear, temper.” The queen admonished, “But if you insist on knowing, the giantess is in the Grand Chamber of our base here. She is being prepared.”<br>\r\n<br>\r\n“Prepared for what?” Zelav demanded.<br>\r\n<br>\r\nThe queen smiled almost evilly before saying, “She is being prepared for…<br>\r\n</span></div></div>",
            "created":1273684680,
            "id":882014,
            "title":"The Zex Queen"
        },
        "1111321":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "The ritual worked",
                "The ritual failed"
            ],
            "content":"<div class=\"\"><div> <span>“She is being prepared for the assimilation ritual” the Zex queen said with her smile, “With the giantess in my forces, they will be all but invincible.”<br>\r\n<br>\r\nZelav nearly gasped, if Valez was assimilated into the Zexs, there was no telling how far the Zex Empire would stretch. <br>\r\n<br>\r\nA snorting laugh escaped through Yivra’s lips, “You’re blinded by your ambition. Valez is too big for your methods, there’s no way for you to assimilate her.”<br>\r\n<br>\r\nThe Zex queen turned to Yivra, outrage blazing in her eyes, “We shall see. Bring the human. She will be a fine test of the giantess’s loyalty.”<br>\r\n<br>\r\nThe two guards the escorted the queen stepped forward and jolted Zelav with another stunner-shock, this one on lower power simply to paralyze her, and then they unshackled her and dragged her away.<br>\r\n<br>\r\n<br>\r\nThe Grand Chamber was well named. Underground and seeming carved from the rock, the chamber was cylindrical, about 200 feet in diameter then rising 100 feet before a dome ceiling started. In the center of the chamber floor held down by several large and heavy chains was Valez, still unconscious from the ambush earlier and striped of all armor and clothing. Zelav was unable to call to Valez as the two guards chained her to the wall. Zelav was facing Valez’s right side and saw the queen move to stand by Valez’s slightly agape mouth as other Zexs started entering the chamber.<br>\r\n<br>\r\nWhen the Zexs were seated the ritual began. The audience chanted in the alien Zex language, the queen would occasionally shout out a short phrase before going silent again. Zelav soon saw a wicked looking knife in the queens had. The queen turned to face Valez’s mouth, and brought the knife down on the unarmored palm of her other hand. Metallic-blue blood burst out of the wound and leaked into Valez’s mouth. Zelav guessed that similar rituals were done for assimilating regular size beings, but rarely was the blood sacrifice done by the Zex queen. <i>Their blood must be a mutagenic.</i> Zelav realized in horrified awe. The queen stepped back, accepting a purple colored cloth from an underling to bandage her wound.<br>\r\n<br>\r\nThe ritual was over, now all there was to do was wait, and in Zelav’s case hope that it didn’t work on Valez.<br>\r\n</span></div></div>",
            "created":1273694760,
            "id":882085,
            "title":"The assimilation ritual"
        },
        "11113211":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "Licking her lips",
                "Smiling playfully"
            ],
            "content":"<div class=\"\"><div> <span>Without warning, or even opening her eyes, Valez let out a shriek of unfathomable pain. Zelav never would have guessed she, or anything, could sound like that. Zelav could only watch as Valez’s skin slowly grew green, as shell-like armor grew from her lower arms and legs. The ritual had worked.<br>\r\n<br>\r\nOnly when the transformation stopped did Valez stop screaming, and her eyes finally opened.<br>\r\n<br>\r\nAt a word from the queen, eight Zexs went to Valez and removed the chains that bound her to the floor. Valez carefully stood up to her full height, and then turned to the Zex queen. She then lowered herself to one knee, bowed her head, and then said, “What is thy bidding my queen?”<br>\r\n<br>\r\nThe Zex queen smiled triumphantly, then motioned with her hand. The audience parted giving Valez a clear view of Zelav, and vice versa. With a strange smile on her face, four of Valez’s new hair tendrils snaked towards Zelav. With minimal effort they broke her restraints and each one wrapped around an arm or leg. Zelav could do nothing as the tendrils snaked back, dragging her towards Valez who was…<br>\r\n</span></div></div>",
            "created":1273694940,
            "id":882087,
            "title":"The ritual worked"
        },
        "12":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "Zelav sneezes and Valez discovers her",
                "Zelav holds it in until Valez is gone",
                "Zelav sneezes and Valez doesn't notice"
            ],
            "content":"<div class=\"\"><div> <span>Zelav ran quickly through the city streets as she heard more and more people screaming in fear and/or pain in the distance. She hadn’t been able to rest for days since everything went wrong.<br>\r\n<br>\r\nMonths ago she volunteered herself as a test subject for a new cloning technology and everything went as the scientists expected. The clone was named Valez and thought that she was Zelav’s twin sister. But when Valez discovered she was a clone, nothing more than a copy, she went mad with rage. She tore up the lab, throwing beakers of chemicals out windows, expensive equipment through walls. But in her anger fueled riot some chemicals on a high shelf fell on her, mixing in a strange way that caused her to grow into a giantess. She then ripped her way through the facility searching for Zelav, who wisely left when she heard Valez discovered she was a clone.<br>\r\n<br>\r\nNow over a month later Zelav had been on the run, endlessly being hunted by her giant clone. One of the scientists called her with a warning weeks ago that Valez wanted to do something to Zelav, something about “becoming the original”.<br>\r\n<br>\r\nJust today Valez caught up with Zelav, who was now running for her life. She ducked into an alley and hid in a small hole in one of the buildings as she heard Valez’s gigantic footsteps growing closer and louder. Zelav huddled as deep as she could into her hiding place as one of Valez’s giant bare feet appeared. “Where is she?” Zelav heard Valez’s thundering voice ask, “All these tiny weaklings and she isn’t here…”<br>\r\n<br>\r\nJust then a cloud of dust wafted into Zelav’s nose and she felt a sneeze coming. “Oh please, not now!” She thought.<br>\r\n</span></div></div>",
            "created":1249621200,
            "id":740638,
            "title":"Not so happy family"
        },
        "122":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "Zelav makes it to the station",
                "Valez is waiting at the station",
                "Valez has an evil plan"
            ],
            "content":"<div class=\"\"><div> <span>Valez looked on for another couple of seconds for her original and then the bare feet stomped off angrily saying something Zelav could not understand. she just heard shrads of words about tactic and fed up. Of course the urge too sneeze was gone now but she didnt dare to take a breath until she was on the verge of collapsing. She had escaped again but Valez would find her soon. Their identic DNA and their similar character and memories drew them together. <br>\r\n<br>\r\nZelav had to get to the trainstation to get as far away as possible - again. She crawled out of her hole after another 15 minutes and then made her way to the station as careful and at fast as possible. It wasn't the first time Valez was waiting on her at the station or tried to ambush her near it. </span></div></div>",
            "created":1329148980,
            "id":1276386,
            "title":"Zelav holds it in until Valez is gone"
        },
        "1223":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "Go to the police",
                "The police is at the hotel already",
                "She hides"
            ],
            "content":"<div class=\"\"><div> <span>Zelav was sitting in the train and relaxed for a while. Something she hasn't done for days. Then it went silent around Valez. <br>\r\n<br>\r\n3 months later Zelav just came out of the shower of an hotelroom in the small town of Tinachia. Just with a tower around her body and one on her hair she walked into the room and sat on the bed to apply some creme on her body. Taking the pot and switching on the T.V. The news started. A war in Chibekistan and an economic explosion in a country she probably never will see - far away. The next one was video about a hostage taking of high ranked people in the society. An armed mob has assaulted a Party and now they wanted to pronounce their claims. Zelav was not really listening as she was busy with her own body but a sudden scream and a familar voice mixed with something she could not quite identify made her take a look at the screen. The cream landed on the bed and slowly rolled to the edge until it fell. Zelav was solidified as she saw the twisting black boot which now lifted the sole while the heel still stood on the ground. She could just get a short glimpse of what it revealed before the Screen went black with a beep. Two seconds later it showed the newsspeaker completly in shock. \"S-Sorry for this... Oh my god. That is just...\" He was speechless for seconds and was visibly fighting to calm down a little. Then he tried again. \"If you see this - please Zelav. Go to the local authorities or she will kill more - in similar ways.\" Then he got up and left. Zelav could not believe what she had heard and saw. She was still staring at her picture which had been faded in. <br>\r\n<br>\r\nWhat had happened to Valez? She was not naked anymore and it seems that she had ganged people around her. It was obviouse that she wanted to kill her since she had dodged deliberate stomps more than once and had luck to still be alive but she had never killed a zivilian on purpose. Zelav was sure that the red mess beneath her boot was one of the hostages. She had to act.<br>\r\n<br>\r\n</span></div></div>",
            "created":1329150420,
            "id":1276393,
            "title":"Valez has an evil plan"
        },
        "13":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Can you make more clones of yourself? I would like to have some friends my size.",
                "If you don't mind, I'd like to spend some time getting to know you... er, me...",
                "Can I have something to eat? That stupid growth spurt made me really hungry!",
                "I think that I'll go out and have some fun in the tiny town!",
                "I think that I would like you to give me a foot massage... SLAVE!"
            ],
            "content":"<div class=\"\"><div> <span>It all started one day in a lab. A woman named Valez was working on an experimental cloning ray. She had just put the finishing touches on it, and decided that she should try it out. She aimed the ray at herself and pulled the trigger. A red beam surrounded her body, and moments later, the glow vanished and there was a second Valez standing next to the original! The clone seemed confused.<br>\r\n<br>\r\n\"Where am I? Who are you? Actually, who am I? I can't remember anything...\"<br>\r\n<br>\r\n\"Allow me to answer your questions in order. This is my lab. I am Valez, an aspiring inventor who just perfected a new cloning ray. That's where you come in; you are my clone.\"<br>\r\n<br>\r\n\"So, I'm just a clone of you? But does that mean that I'm not a real person?\"<br>\r\n<br>\r\n\"On the contrary; you have all of my physical traits, and a mind all your own. You may be just another me physically, but you are your own person mentally.\"<br>\r\n<br>\r\n\"Well... I guess that's a relief... For a second there, I thought that-\"<br>\r\n<br>\r\nJust then, Valez's clone doubled over in pain. Grasping her stomach with one hand, she fell to her knees groaning in pain.<br>\r\n<br>\r\n\"Oh my gosh! What's wrong!\"<br>\r\n<br>\r\n\"I don't know... I feel like I'm burning up!\"<br>\r\n<br>\r\nJust then, Clone Valez started growing. Her body kept expanding until she stood at an amazing 50 feet tall! The majority of the lab was in ruins, but somehow the cloning ray was unharmed.<br>\r\n<br>\r\n\"Holy crap! Okay me, stay calm...\"<br>\r\n<br>\r\n\"How can I stay calm! I'm huge! Well... At least that pain is gone now...\"<br>\r\n<br>\r\n\"See, it's not all bad. Anyway, I think that we should give you a separate name to help tell us apart.\"<br>\r\n<br>\r\n\"And being 10 times bigger than you isn't enough?!\"<br>\r\n<br>\r\n\"Well, it's easy to tell us apart visibly... But it's still hard to have conversations with someone who doesn't even have a name...\"<br>\r\n<br>\r\n\"Okay then, how about Zelav?\"<br>\r\n<br>\r\n\"Take my name and put it backwards... Simple, but I guess that it will have to do for now... So, what do you want to do now?\"<br>\r\n<br>\r\n<br>\r\nWhat does Zelav say? <br>\r\n<br>\r\n</span></div></div>",
            "created":1297038900,
            "id":1048947,
            "title":"A clone with great power"
        },
        "131":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "One more clone appears",
                "More than one clone apppears",
                "Nothing happens"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n“I not so sure that’d be wise Zelav. It’s not that I don’t trust you, but just one giant clone would be dangerous. Not to mention the costs of feeding you would be huge.” Valez said, pacing as she thought about what more clones like Zelav could do.<br>\r\n<br>\r\nEven though her template, at least so to speak, had basically said no, Zelav just didn’t want to be the only one like her in the world. So she took matters into her own hands. While Valez was caught up in her thoughts, Zelav carefully reached into the remains of the lab and flicked the firing trigger on the cloning ray, shooting another red beam at Valez.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1297617180,
            "id":1053197,
            "title":"Giantess cloning"
        },
        "1311":{
            "author_id":"peterdivine",
            "author_name":"Peter the Great",
            "choices":[
                "The two stop listening to Valez and blast her again",
                "The director of the cloning project enters the room",
                "The two giantesses get bored and go elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>Valez didn't know what was happening until she noticed the red glow around her and  the familiar warmth. She turned in alarm, but before she could say anything, the beam had already worked its magic- another Valez clone stood on her left, in the exact same uniform, looking just as confused as the predecessor.<br>\r\n<br>\r\n\"Zavel, I told you no!\" Valez shouted exasperatedly.<br>\r\n<br>\r\n\"But it's just two, it's not much more trouble than one!\" Zelav said, sounding a little hurt.<br>\r\n<br>\r\n\"One WAS enough trouble! Look at my lab, it's in ruins just from making you, and now it could be even more destroyed if she starts growing, too!\" Valez yelled.<br>\r\n<br>\r\nValez expected a rebuttal of some kind, but instead Zelav just stayed quiet with a sorry look on her face. Valez sighed. \"Look, I'm sorry for yelling, but you <i>must</i> be careful, Zelav! This equipment was never meant to grow anyone, and it's now very vulnerable with you in your current state! If you were to break a vital piece of equipment, then we would-\"<br>\r\n<br>\r\nA cry of pain from the side interrupted her safety lecture. Both looked back to the almost forgotten second clone, now doubled over in a crazy deja-vu replay of what Valez had witnessed before; sure enough, the clone grew, clothes and all, and punched another hole in the roof. When she reached the exact same height as her sister duplicate, Zavel clapped her hands and grinned while Valez groaned quietly.<br>\r\n<br>\r\n\"You fill her in, Zavel. I'm going to review what keeps causing this in my work.\" She returned to her desk and tried to ignore the very loud conversation that her two giant clones were having.</span></div></div>",
            "created":1300394880,
            "id":1071771,
            "title":"One more clone appears"
        },
        "13113":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"Fine girls, but you better not break anything or hurt anyone while you're out!\"",
                "\"No girls, I don't think that anything good would happen if people saw you!\""
            ],
            "content":"<div class=\"\"><div> <span>Zelav was beginning to get bored with just standing around with nothing to do, and so was the newly named second clone Zeval. The two identical giantesses soon decided that they would have to do something to relieve their boredom. While Valez was busy going over the information of her experiments, Zelav and Zeval walked up and tapped her lightly on the shoulder. Valez turned around and looked at them as they smiled down at their creator.<br>\r\n<br>\r\n\"I'm a bit busy right now, girls. What do you want? Please don't tell me that you want <i>another</i> new clone!\"<br>\r\n<br>\r\nZelav and Zeval giggled, and Zelav answered the question.<br>\r\n<br>\r\n\"No Valez, I don't think that we need another friend right now. But Zeval and I are getting a bit bored now. Do you think that we could go out and take a tour around the city?\"<br>\r\n<br>\r\n\"What?! But everyone would panic if they saw you two!\"<br>\r\n<br>\r\nThe two giantess clones put on puppy-dog faces as they leaned in toward Valez.<br>\r\n<br>\r\n\"<i>Please </i>Valez? We promise we'll be careful!\" the duo said in unison.<br>\r\n<br>\r\n<br>\r\nHow will Valez respond to this?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1300405080,
            "id":1071826,
            "title":"What to do with a pair of bored giantess clones?"
        },
        "1312":{
            "author_id":"peterdivine",
            "author_name":"Peter the Great",
            "choices":[
                "They all grow to the same size as Zelav.",
                "They grow to all different sizes!",
                "None of them seem to be growing... for now."
            ],
            "content":"<div class=\"\"><div> <span>Zelav waited expectantly for the same red laser to shoot out, but something was wrong. The machine wasn't firing. rather, a light glow, slowly growing brighter, seemed to be building up in the machine. Zelav put her finger on it, as gently as possible. She could hear a rather disturbing vibration. Trying not to panic, she decided to ask her creator for help as innocently as possible.<br>\r\n<br>\r\n\"Um, Valez, ma'am.... how, um, exactly does this machine work?\"<br>\r\n\"It combines quantum theory with genetic engineering to analyze the DNA of an organism and-\"<br>\r\n\"No, I mean how do you use it?\" The glow was getting stronger. Zelav hoped her voice was masking the building worry in her chest. Valez wasn't catching on yet, luckily.<br>\r\n\"First, I need to set the parameters. That's the longest part, and the most annoying, because for some reason are reset to blank after every trial. After that, clear an area, position a subject, flip the switch, wait for the magic.\"<br>\r\n\"Parameters... what do they consist of?\"<br>\r\n\"A lot of things.... cuts down on any chance of deviation in the double.\"<br>\r\n\"What would happen if the machine was used without those.. parameters?\"<br>\r\n\"Don't know. At best, the laser would do nothing, and at worst, it could create a bunch of freaks. Zelav, why are you-\"<br>\r\nShe turned around just in time to see the machine rumbling ominously.<br>\r\n\"NononoNONONO-\"<br>\r\nValez raised up her hands just in time for the machine to erupt in a flash, blinding Valez and causing her to take a few steps back. She covered her face and tried to yell over the device's high-pitched whine.<br>\r\n<br>\r\n\"Turn it off, Zelav, TURN IT OFF!\"<br>\r\n\"I don't know how!\" Zelav shouted back in a clearly frantic tone of voice.<br>\r\n\"The switch, a plug, anything!\"<br>\r\n\"I can't see! It's too bright!\"<br>\r\n\"Do SOMETHING!\"<br>\r\n<br>\r\nSeveral seconds later, a loud crunch pervaded the air, and smoke was blown everywhere. Valez coughed and waved her arms desperately, hoping that the smoke would disappear somehow, hoping that the machine would, in fact, do nothing when it was overloaded and under-directed...<br>\r\nLuckily, the suffocating fumes passed quickly. The holes Zelav had punched in the walls and ceiling to the outside made an easy ventilation path (though Valez heard her cough a few times, too.) She looked upon the further damage already done to her half-laboratory. She immediately arched her eyebrows wide and covered her mouth in shock as the scene revealed itself in a midst of coughs, groans, questions, and gasps.<br>\r\n<br>\r\nThe machine hadn't done nothing. It hadn't even just made a mess, or a mistaken pile of cells, or even just a clone of Valez or two. It had filled the room with Valez's perfect duplicates- a rough count of them showed at least twenty, maybe more, in various states of standing, leaning (Valez saw two resting on Zelav's gigantic, oversized shoe-clad foot and her stomach did a flip-flop,) looking around, coughing, helping each other up, talking to each other, and all of them trying to compose themselves and figure out what had happened to them.<br>\r\n<br>\r\nBehind them all stood her first enormous wide-eyed copy, her shoe's heel stuck squarely on top of the remains of Valez's cloner.<br>\r\n\"Oops.\" Zelav whispered.</span></div></div>",
            "created":1307640720,
            "id":1122570,
            "title":"More than one clone apppears"
        },
        "13121":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Valez finds the solution maybe?",
                "uh-Oh the 50 ft Giantesses Zelav included grow again",
                "Uh-oh Evil problem! 1 not so nice clone and she's growing again!"
            ],
            "content":"<div class=\"\"><div> <span> After the clones were all helped up and outside Valet just finished counting the new batch of clones when they too like Zelav started to grow.<br>\r\n<br>\r\n1 after another in a matter of minutes the Zelav was surrounded by 32 more identical Giantesses <br>\r\n<br>\r\n<br>\r\nValez was worried but 1st decided to have Zelav fill in her fellow Giantess clones and let them choose names.<br>\r\n<br>\r\nNext...</span></div></div>",
            "created":1423199760,
            "id":1928595,
            "title":"They all grow to the same size as Zelav."
        },
        "14":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Steph is picked up by her clone",
                "Steph is eaten by her clone",
                "Steph and clone both go to the shopping centre",
                "Something happens",
                "Other (random option)"
            ],
            "content":"<div class=\"\"><div> <span>Steph Tsunade waves at her newly created clone, which was a giantess who had similar features to her, except that the giantess was completely nude. Clumsy Steph Tsunade had long black hair in a ponytail and brown eyes, with a somewhat pudgy gut, which rumbled occasionally.<br>\r\n<br>\r\n\"Hey, pick me up!\" Steph speaks to the blinking giantess.</span></div></div>",
            "created":1579968720,
            "id":2778212,
            "title":"They know of each other"
        },
        "15":{
            "author_id":"peterdivine",
            "author_name":"Peter the Great",
            "choices":[
                "The girls grow up to be very similar",
                "The girls are complete opposites",
                "The girls meet each other and become rivals",
                "The girls meet each other and become friends"
            ],
            "content":"<div class=\"\"><div> <span>Cloning. The ability to create a copy of oneself. Finally, Aaron had completed the technology and processes necessary to make a perfect clone of an individual, with no side-effects. In a matter of weeks, his idea would be swept up by the company, and his patent would become their patent... well, whatever. At least they would give him a promotion, pay raise, etc. Aaron took a sip of his self-bought wine thoughtfully. The important thing was that he'd make an important contribution to society, and he was now set for life...<br>\r\n<br>\r\n And yet, something was missing. He dwelled on that thought with closed eyes for a minute or two before realizing what it was. Questions. He still had questions he wanted answered, and once the patent was taken, he'd never be able to answer them. For instance: If two different individuals led identical lives, would they have the same reactions to the same problems poised to them? Aaron Gregiro had always wondered that as a child and never found a satisfying conclusion. It was one of the reasons that he became so interested in this field as he grew up. Of course, now, he realized, such an experiment was impossible- to make identical fields for a child to live their lives in, even with cloning, would still take billions of dollars that he didn't- and wouldn't- have, even with his forthcoming raise. He lost most of his interest in that matter anyway. He grew out of it, he supposed. And yet, now, with his work completed, the question nagged at him again...<br>\r\n<br>\r\nPerhaps he was being mischievous, perhaps he was genuinely curious, or perhaps he was just killing time, but Aaron decided to make a real clone with one of the blood samples he'd collected. The machines started up, the capsules buzzed, and Aaron was left with two babies which were perfect clones of each other in a matter of hours. He then took them to similar orphanages on different sides of the city and put them in. Many people would've thought this nothing short of despicable, toying with human life on a whim, but Aaron Gregiro was the kind of person who didn't really have a firm moral structure. It might have even been because of this that he had managed to complete such a project. Well, in any case, the deed was done, Aaron thought while driving. Years from now, in my early retirement, if I should be so inclined, I'll have something to look at. Well, okay, a large deal of this is being left up to random chance, but whatever it's not like there'll be any serious repercussions towards me.<br>\r\n<br>\r\nAll of a sudden, he was fantastically bored; he now had nothing else to do. He brought up the programming code for his machines and ran through them again. Once again, like the many other times he'd done this, Aaron saw no mistakes. Scanning programs were fine, graphic data reconstruction programs were fine, enzyme, protein, and molecular distribution programs were fi-<br>\r\n<br>\r\nWait a sec. This one, the one for the left cloning chamber, had been exponentiated too much.<br>\r\n<br>\r\nAaron looked at the program with a cocked eye. Here, it was meant to be raised to the second; apparently, his finger had slipped, and it had been raised to the twenty-second. He fixed the error, then ran through the software again with his estimation program. Okay, THIS time it checked out. But then what does that mean about the other program?<br>\r\n<br>\r\nAaron make his mistake again, then ran the estimations one more time. His stomach instantly dropped into queasy hell.<br>\r\n<br>\r\nAccording to the program, the cloned girl who came from the left chamber would store and duplicate nutrients and chemicals abnormally well, showing no outward physical changes or health conditions at all until the sixteenth year. At that time, the stored nutrients would release themselves, creating a massive explosion in development and growth far faster than normal speeds, for an unpredictable amount of time.<br>\r\n<br>\r\nAaron had created a time-bomb teenager giantess.<br>\r\n<br>\r\n\"How... what...\" Aaron stuttered, then fell on a chair suddenly. He now understood very well what was meant by karmic retribution.<br>\r\n<br>\r\nIt isn't understood what happened to Aaron, but he was never seen again by his benefactors, who, not knowing how his machines worked or anyone else who could use them, deemed it a failure and closed down the experiment.<br>\r\n<br>\r\nBoth children were soon brought into decent homes, with decent families. If Aaron had cared any more about how his half-hearted experiment, he would've been pleased with the results, and how closely the developments related each other. Against all odds, they ended up going to the same high school. Fifteen years passed, with the girls' sixteenth birthday coming up very close...</span></div></div>",
            "created":1249707600,
            "id":741180,
            "title":"They have no idea the other exists"
        },
        "154":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "More of the school year",
                "The girl's sixteenth birthday",
                "A meeting between the girls outside of school"
            ],
            "content":"<div class=\"\"><div> <span>Carolyn hurried through the halls of Lakeside High School; it was the first day of classes and she didn’t want to be late. She hurried past the classrooms glancing at the numbers looking for the right one when she ran into someone doing the same thing.<br>\r\n<br>\r\n“Oh, geez! I’m sorry! I wasn’t looking where I was going.” Carolyn apologized as she started gathering her books and papers from the floor. <br>\r\n<br>\r\n“It’s okay; I was doing the same thing.” The other girl said.<br>\r\n<br>\r\nCarolyn and the other girl finished gathering their stuff and looked up at the same time. It was like looking into a mirror for both of them; they both had the same long brown hair, the same green eyes, everything was perfectly identical. <br>\r\n<br>\r\nThe other girl broke the awed silence first. “Hi, I’m Laura. Laura Simmons.” She said holding her stuff in one hand and holding out the other.<br>\r\n<br>\r\n“I’m Carolyn Lismore. Nice to meet you.” Carolyn said as she shook Laura’s free hand.<br>\r\n<br>\r\n“Hey, I’d love to stay and shoot the breeze, but we both need to get to class. If you’ve got First Lunch I’d love to get better acquainted.” Laura said before rushing away to her class. As Carolyn went to her class she glanced at her schedule and was pleased to see she did have First Lunch.<br>\r\n<br>\r\n<br>\r\nThey met again during lunch and soon became good friends and learned a lot about each other. They both were adopted, Carolyn from the Happy Camper Orphanage and Laura from the Tiny Tots Orphanage on the other side of town, and they both had similar interests in fantasy and science fiction. <br>\r\n<br>\r\n“Wow, I think the only difference between us is that I never seem to get sick.” Laura said.<br>\r\n<br>\r\n“Really? You never had a cold, the flu, or… the chicken pox?” Carolyn asked.<br>\r\n<br>\r\n“Not even once. The doctor says he’s never seen anything like it. He tried to explain what he knew, but all that medical mumbo-jumbo made me even more confused. All I could get out of it was that I seem to store and use nutrients better than the vast majority of the population.” Laura answered with a shrug.<br>\r\n<br>\r\n“The closest I’ve got to something that most people don’t is a father that knows all the opening scrolls from Star Wars by heart.” Carolyn joked.<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhere does our story go now?<br>\r\n</span></div></div>",
            "created":1249794000,
            "id":741756,
            "title":"Instant friends"
        },
        "1542":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "At a party",
                "With each other",
                "Alone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are the two friends at during this momentous occasion?<br>\r\n</span></div></span></div>",
            "created":1249794000,
            "id":741760,
            "title":"The girl's sixteenth birthday"
        },
        "15421":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "In spurts",
                "Constantly"
            ],
            "content":"<div class=\"\"><div> <span>Carolyn and Laura met on the eve of their birthday, which by great coincidence was the same day and time, at their mutual friend Sandy’s house for the party. Sandy had managed to convince her parents to allow her, the two girls, and a few other friends to have a party late into the night as long as they didn’t break any laws. There was music, beverages, and everything was going great, Carolyn even managed to get some romantic ground with Sandy’s older brother.<br>\r\n<br>\r\n“Hey Sandy, thanks for doing all this for me and Carolyn. We really appreciate it.” Laura said as she refilled her soda on the kitchen counter.<br>\r\n<br>\r\n“No problem Laura. And besides, with both of you born at the same time it’s easy to give you guys a party at the same time.” Sandy said with a smile.<br>\r\n<br>\r\nLaura headed back into the living room where everyone was seated or dancing to the music. She was passing the dancers when she collapsed unexpectedly.<br>\r\n<br>\r\n“Laura! Are you alright?” Carolyn called out as she jumped off the couch and went to Laura’s side.<br>\r\n“I… I think so. I don’t know why I did that. Oh sorry about the rug.” Laura apologized when she realized she spilled her soda.<br>\r\n<br>\r\n“Laura, I think you’re growing.” Carolyn gasped.<br>\r\n<br>\r\n<br>\r\n<br>\r\nHow is she growing?<br>\r\n</span></div></div>",
            "created":1262628660,
            "id":815595,
            "title":"Party of the giantess"
        },
        "15422":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "The next day",
                "That night"
            ],
            "content":"<div class=\"\"><div> <span>Laura and Carolyn chose to go out with each other on the day of their 16th birthday; both were born on the same day around 10 pm according to the orphanages’ records. They spent the birthday money their parents gave them at the mall and ate out.<br>\r\n“I can say that this has been the best birthday I had so far. Hanging out with my best friend on the beach as that special hour approaches. What could be better?” Carolyn asked as she and Laura stood with their sandals off in the surf.<br>\r\n“Maybe if there were a couple of cute boys to enjoy this day with too.” Laura replied.<br>\r\n“I never thought of that. It’s a shame the only guys that were interested in us were those two from that silly cosply club.” Carolyn said shaking her head.<br>\r\n“Yeah, they were nice but-” Laura started to say before she suddenly clutched her chest and collapsed to her knees.<br>\r\n“Laura! What’s wrong?” Carolyn gasped.<br>\r\n“I- I don’t know. Whenever my heart beats… a fresh wave of pain goes through my body.” Laura between gasps of pain.<br>\r\n“Come on, we need to get you to a hospital.” Carolyn said as she helped Laura onto her feet.<br>\r\n<br>\r\nA while later Laura was lying in a hospital bed with Carolyn sitting next to the bed.<br>\r\n“Well, the pain is going away.” Laura said softly before there was a knock at the door.<br>\r\n“Hello ladies, I just came by to check the patient. How’s it going Carolyn?” A red hair female doctor asked.<br>\r\n“Hiya Mrs. - I mean, Doctor, Gallanger. I’ve been alright Is Laura okay?” Carolyn replied.<br>\r\n“Well, I couldn’t find a reason for the pain she experienced. Given her medical history I would never have expected it. When did this happen?” Dr. Gallanger asked.<br>\r\n“It was about twenty minutes ago when it started.” Laura answered.<br>\r\nCarolyn glanced at her watch before saying, “That would have made it 10 o’clock. Right as you turned sixteen.”<br>\r\n“An odd coincidence. Almost as odd as what if found just a few minutes ago.” Dr. Gallanger said.<br>\r\n“What did you find?” Carolyn asked.<br>\r\n“I was looking at the blood samples we took from Laura and I discover that both of your genetic make-ups is exactly the same.” Dr. Gallanger replied.<br>\r\n“You mean like, we’re twins?” Laura asked.<br>\r\n“Even in identical twins this occurrence happens once in millions, and that’s high estimated odds. I would think that one or both of you were clones if cloning wasn’t beyond our capabilities.” Dr. Gallanger said.<br>\r\n“But, wasn’t cloning within humanity’s grasp once?” Carolyn asked.<br>\r\n“Once. But the only man that knew how to work his machine disappeared about sixteen years ago. The project was deemed a failure and no-one’s tried it ever since. Well, Laura can leave in about half-an-hour. I’ll see you around outside a medical setting Carolyn.” Dr. Gallanger said before she left.<br>\r\n<br>\r\n“How’d you know that doctor?” Laura asked.<br>\r\n“Oh, a couple years ago I busted my leg while biking. She was the doctor my parents brought me to. Isn’t it incredible, we may actually be related?” Carolyn replied.<br>\r\n“Yeah… that is way out.” Laura said.<br>\r\n“Hey Laura, is it just me or do you look a little taller?” Carolyn asked looking at Laura with a confused expression.<br>\r\n</span></div></div>",
            "created":1249880400,
            "id":742337,
            "title":"Sweet 16 surprise"
        },
        "154221":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "The beach again",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The next morning was a Saturday, so Laura and Carolyn went out together again.<br>\r\n<br>\r\n<br>\r\nWhere do they go?<br>\r\n</span></div></span></div>",
            "created":1249880400,
            "id":742345,
            "title":"The next day"
        },
        "1542212":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "The mall",
                "More choices again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1249880400,
            "id":742346,
            "title":"More choices"
        },
        "15422122":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "The park",
                "Somewhere else (Reader's choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still more choices (Last time)</span></div></span></div>",
            "created":1249880400,
            "id":742349,
            "title":"More choices again"
        },
        "154221221":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "About 12 feet tall",
                "About 100 feet tall (Max height I’ll allow)"
            ],
            "content":"<div class=\"\"><div> <span>Laura wanted to be closer to home today incase she had the strange pain again, so she and Carolyn went to the park. They mostly sat on one of the benches, talking with each other and watching the boys. When all of a sudden Laura felt something odd. “Huh… that’s weird…’ she said. “What’s the matter?” Carolyn asked. “Well… it’s kinda like what happened last night, but it isn’t painful. In fact, it feels kinda nice.” Laura replied as she stood up at stretched. At that point Carolyn noticed something, “Oh my God! Laura, you’re growing!” Laura looked and saw Carolyn was right. She was so tall that Carolyn’s eyes were the same level as her chest. Laura’s growth continued until she was…</span></div></div>",
            "created":1250917200,
            "id":748573,
            "title":"The park"
        },
        "1542212212":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "Laura’s still the same",
                "Laura’s mindset has changed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Carolyn was completely shocked at Laura’s sudden growth. She was huge! Carolyn only came up to her ankle height-wise. It was intimidating being next to her. Carolyn nervously wondered if Laura’s mind and attitude changed with the sudden growth.</span></div></span></div>",
            "created":1252040400,
            "id":755509,
            "title":"About 100 feet tall (Max height I’ll allow)"
        }
    },
    "info":{
        "author_id":"therandom",
        "author_name":"The Random",
        "brief_description":"A young woman's clone becomes a giantess. Please add",
        "created":1249687320,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\nKeep consistent. <br>\r\nTry for longer additions if possible. <br>\r\nFemale nudity allowed.<br>\r\nOnly the clone girl can be a giantess<br>\r\n<br>\r\n<br>\r\nThank you</td>",
        "id":1589120,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579968720,
        "modified":1579968720,
        "pretty_title":"Clone Giantess"
    }
}