{
    "chapters":{
        "1":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Keara",
                "Nikki",
                "Madison",
                "More?",
                "Create your own!"
            ],
            "content":"<div class=\"\"><div> <span>Keara is a Caucasian (American) with long black shoulder length hair and a single blonde streak across the front. She weighs in at 90 pounds and is at the age of 14. Her weakness is fast food such as McDonalads or Burger King etc. She mainly wears super skinny jeans and a tight tank top. She wants to stay skinny but will she lose her will power when a new fast food food place opens up down the street?<br>\r\n<br>\r\nNikki is a Hispanic with short brown hair that falls half way down her neck. She weighs in at 137 pounds and is 22 years old. She loves all pastries even though it's already started to show on her figure. She has a small potbelly no bigger than a quarter of a volley ball. Her butt, hips and thighs fit into size 12 jeans while her breasts are a C-Cup. She likes to wear tight dresses. She's in denial with her gain so far but will that still be the case when her dad decides to buy a bakery and brings her sweets every day?<br>\r\n<br>\r\nMadison is a blonde white girl with hair that drops all the way to the small in her back. She weighs 110 pounds and is 17. She's the perfect stereotype of a blonde. She's an idiot! She is a chearleader at her school and wears her uniform everywhere she goes. (Except in the shower and when she goes to bed of course). She loves all things sweet but has a special spot for chocolate. Will she keep her figure or will a few trips to the candy store give her some unwanted fat?<br>\r\n<br>\r\nP.S Sorry for the change on Keara. She was originally supposed to be Caucasian but auto correct changed it without me knowing. </span></div></div>",
            "created":1344402000,
            "id":1400552,
            "title":"Pick a Girl"
        },
        "11":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Belly and Boobs",
                "Spread evenly",
                "Butt, Hips and Thighs.",
                "Belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will majority of the fat go?</span></div></span></div>",
            "created":1344402000,
            "id":1400596,
            "title":"Keara"
        },
        "111":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "They finish their entire meal",
                "They finish 3 quarters",
                "Keara ends up eating half of Chloes"
            ],
            "content":"<div class=\"\"><div> <span>'Ugh, why does school have to be so boring?' Keara thought to herself. While Mrs. Wiley gave the class a lecture on history. <br>\r\n\"Keara! Stop day dreaming and answer this question!\" Mrs. Wiley yelled. Keara looked up at the board and saw probably one of the stupidest questions in the world. <br>\r\n\"In what year did Abraham Lincoln fight against Vampires?\" Keara read aloud. \"Didn't that happen in a movie? Not real life?\" Keara asked confused.<br>\r\n\"If it was in a movie then it has to be true you stupid girl. Keara is obviously incapable of answering a question so Jamie how about you test your knowledge.\" Mrs. Wiley replied in a mean tone. That was probably the worst thing about history. Mrs. Wiley was probably one of the most brain dead teachers out there. Keara looked up at the clock. 'Yes only five minutes till lunch!' She thought happily.<br>\r\n \"Umm... 1823?\" Jamie guessed. Keara looked at Mrs. Wiley expecting yelling but all she did was sigh calmly and pick up her apple. She stared at it softly like it was a child and back at Jamie. Her calm face turned red with anger and she threw the apple hitting Jamie in the head. The sad thing was that even if the kids tried to report her, the principal wouldn't believe them. She acted like an angel when parents, teachers, the principal or even other kids were around but when it was just this class and her she would start to scream and throw things. Keara sighed happily to herself as the lunch bell finally rang and she could get out of that awful class. <br>\r\n<br>\r\n'Hmm what should I get?' Keara thought to herself along with looking at the menu. 'Maybe I should get the chicken strips. Oh wait I forgot that it isn't actual \"chicken\" it's made out of tofu.' Keara thought to herself annoyed. She looked out through the cafeteria window and saw the Burgers R Us right across the street from them. She had a total of twenty dollars in money so she could easily get a decent meal there. Keara looked at her regular table and saw her friends Darian a nice African American boy and Chloe a beautiful blonde who unlike her older sister Madison was insanely smart. She knew she could probably get them to come with her as long as she paid. Besides who would want to eat alone? She got out of line and walked to her usual table. \"Hey guys, would you want to come to Burgers R Us with me?\" Keara asked happily.<br>\r\n\"We didn't bring any money,\" Chloe replied sadly. <br>\r\n\"Oh that's alright, I'll pay,\" Keara said happily. After some short discussing Chloe and Darian decided to go on the condition that they were allowed to get anything they wanted. <br>\r\n<br>\r\nThe group of friends left the school and went down the street to the fast food restaurant. When they got to the place they noticed stuff being packed up into a truck. \"Do you guys know what's going on here?\" Darian asked. <br>\r\n\"No but I'll ask,\" Chloe replied. \"Hey Kyle (the Burgers R Us manager), what's going on?\". <br>\r\n\"Oh were being relocated so this is our second to last day here. All of our food is free of charge today as a thank you to our customers,\" Kyle replied.<br>\r\n\"Well that's really nice of you guys,\" Keara said thankfully. The trio went into the food place and stood in line. It was really busy in there so they had a long wait. <br>\r\n\"Will this line go any faster?! If I'm late for History again Mrs. Wiley will kill me,\" Chloe stated. After a long wait it was finally their turn to order. Darian started off by getting a small Cheese Burger, Salad and a Diet Coke. <br>\r\n\"That's all your getting?!\" Keara asked surprised. <br>\r\n\"I have to stay in shape for track and field tomorrow,\" Darian replied. <br>\r\nKeara unlike Darian decided to take advantage of the free food and ordered: 3 Double Bacon Cheese Burgers, 2 Large Fries, 3 Large Vanilla Shakes and 4 Banana Nut pies. <br>\r\n\"Enough food Keara?\" Chloe asked surprised. <br>\r\n\"Its free so I might as well take advantage of it,\" Keara replied.<br>\r\n\"Good point!\" Chloe said happily. Keara waited off to the side while Chloe ordered her meal. \"I'll have 4 Triple Patty Chicken Burgers, 3 Large Curly Fries, 4 Large Iced Teas and a Chocolate Sundae on the side,\" She said excitedly. It must have been 10 minutes before the girls food was ready and lunch was almost over. The girls took their trays of food to the table Darian saved for them even though it took 3 trips to get everything there. The girls started to dig in before Darian could've said something. </span></div></div>",
            "created":1344402000,
            "id":1400730,
            "title":"Let's Begin!"
        },
        "1112":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Continue at home..",
                "Continue at school..",
                "Continue at home with her friends.."
            ],
            "content":"<div class=\"\"><div> <span>Chloe and Keara sat at the table moaning and groaning as about a quarter of their food remained on the table. \"I've never been -Urp- in my life,\" Chloe said leaning back rubbing her swollen tummy. Her skin was as tight as a drum.<br>\r\n\"I regret eating so nghhh much,\" Keara said trying to hold in a fart (She's embarrassed of her gas). <br>\r\n\"Maybe you guys shouldn't of eaten twice your weight in food,\" Darian said snickering. <br>\r\n\"Shut up,\" Chloe replied trying to get up. \"And help me up\" Chloe whined.<br>\r\n\"Me too please,\" Keara added. They both scooted out from under the table. Darian grabbed their hands and pulled them up causing Keara to let out a small fart in the process. Keara blushed dark red and hung her head in shame. <br>\r\n\"What are you doing?\" Chloe asked Keara curiously.<br>\r\n\"Yeah, we need to get back,\" Darian added. Keara looked up confused and realized they didn't hear it and put one arm around Darians neck and the other cradling her swollen gut. Chloe did the same. They trudged back to the school making it only minutes before the bell rang. Keara sat down her currently heavy frame in her seat causing her shirt to ride up a bit but she didn't notice. She prepared for her next class math...<br>\r\n</span></div></div>",
            "created":1344402000,
            "id":1400771,
            "title":"They finish 3 quarters"
        },
        "11123":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Yes!",
                "No! This story should be focused on Keara"
            ],
            "content":"<div class=\"\"><div> <span>Keara, Chloe and Darian sat on the couch in Kearas house while watching cartoons. <i><b>Grrnggghh</b></i> Kearas stomach groaned with hunger even though the food she recently ate hadn't even fully digested yet. Luckily for her there was no fat added on her, excluding the semi digested lump of food in her stomach. \"Woah better calm that stomach down before it causes some sort of earthquake,\" Darian said laughing.<br>\r\n\"I have no idea why I'm still hungry after that monstrous lunch,\" Keara replied glumly.<br>\r\n\"Egh, don't get to upset I'm probably just as hungry as you if not more,\" Chloe said to her friend while rubbing her still aching belly. Chloe's wavy blonde hair was behind her shoulders and dangling near her upper back. Her face was just like her sisters. She had a cute button nose sparkling blue eyes and wore pink lip stick every day. She wore different colored tights in which resembled the rainbow. She wore different colored T-Shirts that would compliment her tights. She always bought her shirts and pants two sizes to small for her so she could show off some cleavage and butt even though there wasnt much to show off (excluding her butt). She currently wore Purple tights that might have been to tight and an already to small yellow shirt. Darian had very little hair on his head as he liked to shave it to get rid of an unwanted afro. He wore plain T-Shirts considering he didn't care what others thought of him. He wore track shorts almost everyday just in case someone wanted to challenge him to a race (Nobody usually did).<br>\r\n<br>\r\nAfter some short goodbyes Darian went home and Keara and Chloe continued to sit on the couch with their still grumbling bellies. Except rather than eat , the friends decided to take a nap and home they would digest the food fully by then. Keara went into her room and slept almost as soon as she had gotten into bed. Chloe on the the other hand was having a hard time getting comfortable on the couch. Chloe sat up and walked into Kearas room. Luckily she had a double bed so Chloe could fit in there as well. She climbed in as quietly as possible and drifted off to sleep. Chloe dreamed about the perfect guy running towards her through a flower patch in an open field. It's 'cheesy', right? Suddenly the man stopped running. He turned around and started running away. Chloe looked behind her and saw a giant Hotdog about 30 feet high and 10 feet wide. Chloe started running in the same direction as the man did. She was finally going to get away from the beast when a force erupted and pushed her towards it. The Hotdog held her close to its face and a mouth opened and dropped her in. Chloe had to hang on to the edge of its mouth just so she could make sure she didn't fall in. She pulled herself out and jumped on the monsters bun. Doing this aggravated the monster and it reached desperately to grab her. Chloe used this as an opportunity and bit in to the monster.  Chloe continued to take bites until there was only half of the actual Hotdog left. Chloe sat on the monsters shoulder and rubbed her overstuffed belly resembling an over filled basket ball. She let out a loooonnnnggg fart in relief. The monster then grabbed Chloe and chucked her into the sky. As soon as Chloe was about to hit the ground she woke up and her stomach grumbled in hunger. <br>\r\n<br>\r\nKeara dreamed she was on a cruise ship she was attending a romantic comedy with a cute boy. They were just about to kiss when a loud splash was heard. She turned around and found a sea monster about 50 feet taller then her. It looked almost exactly like Gyrados from Pokemon except this one was made of Jell-O. Keara backed up in disgust when a sudden long wind picked her up and delivered her in the sea monsters mouth. Unlike Chloe, Keara was swallowed and the sea monster went back under water and swam away from the boat. Keara realized the only way out was to eat. She swallowed her saliva and started to attack the monster from the inside. She continued to eat until there was only a severed head left she saved it and used it to float up and above the water. She laid there in satisfaction, rubbing her belly which was the size of a small beach ball. She might of been rubbing her stomach to hard because a sudden loud burp erupted from her mouth causing her to blush sheepishly. Keara closed her eyes happily when the head swiftly turned to the side and Keara toppled over and woke up starving with hunger.<br>\r\n<br>\r\nThanks for reading but before we get to new options I have a quick question. Is Chloe going to be accidentally gaining with Keara?</span></div></div>",
            "created":1344488400,
            "id":1401137,
            "title":"Food Dreams!"
        },
        "111231":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where's majority of the fat going to go?</span></div></span></div>",
            "created":1344488400,
            "id":1401142,
            "title":"Yes!"
        },
        "1112311":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Five days later while getting dressed..",
                "Tomorrow at school.."
            ],
            "content":"<div class=\"\"><div> <span>\"What are you doing in my bed?!\" Keara screamed in surprise. <br>\r\n\"Shut up. I'm trying to sleep,\" Chloe replied groggily. Her chances of sleeping were gone unfortunately because Keara was now awake and splashed water in her face. <br>\r\n\"What was that for?!\" Chloe shrieked. <br>\r\n\"Outta my bed fool,\" Keara said in a ghetto accent causing Chloe to laugh. Chloe got out of bed and the two friends went into the bathroom to brush their hair and then after sit on the couch. <b><i>Grrrnggggghh Grrgghh Grrnnnnnggh</i></b>. The girls stomachs were growling in pain saying <b><i>feed me!</i></b><br>\r\n\"Soo hungry!\" Chloe groaned in agony. <br>\r\n\"Same! Do you <b><i>grrrrnnnrghnnnrghnnnngggh</i></b> want to go to Burgers R Us? They're still serving free food,\" Keara asked.<br>\r\n\"I really don't care. I just want to eat something,\" Chloe replied.<br>\r\n\"Okay but we have to make sure we don't take to much. I felt bad for throwing out the rest of the food earlier,\" Keara stated in pain.<br>\r\n\"Agreed, let's just get there before I eat your couch please!\" Chloe exclaimed. Luckily for the girls Burgers R Us wasn't as busy as it was before (obviously because it was 8pm) so they were able to get food quickly. <br>\r\n\"I'll have two triple patty bacon burgers, two large vanilla milkshakes and a large fries,\" Keara said to the cashier.<br>\r\n\"And I'll have three king sized cheese burgers, two large chocolate milkshakes and an extra large fries,\" Chloe continued. <br>\r\n\"Will that be all for you today?\" the cashier asked.<br>\r\n\"Yes and make it snappy were starving!\" Keara replied impatiently. The cashier rolled her eyes and went into the back to get Keara and Chloe's meals. For acting so rude at the front desk the cashier decided to get a little revenge. She grabbed every single one of the pattys and dunked them in pure grease, she took the bacon and swirled it around in pure lard, she deep fried the buns, spread tons of butter on each bun, put extra salt on the fries and put tons of ice cream and sugar in the milkshake. She handed the girls their trays of food politely. They noticed the buns deep fried but were to hungry to care. They scarfed their food down very quickly for petite girls. Keara finished her first burger and gulped down her first milkshake. Chloe was already starting her second. Chloe finished her second burger and started shoving down her fries. Do to the salt increase she had to take a sip of her drink every few fries. Keara finished her final burger and started to chow down on her fries. She also had to take a sip of milkshake every couple fries. They both finished their fries and Chloe started to eat her last burger but could only finish half which Keara finished. <br>\r\n\"I think we over did it again,\" Chloe groaned.<br>\r\n\"Maybe just a bit,\" Keara replied. \"You have some grease on your cheek,\" Keara said giggling. Chloe wiped the grease of her face with her fingers and licked it off. Unfortunately there was no Darian to help them up so they were forced to stand by themselves. <br>\r\n\"Hnnnngghhhh\" Chloe grunted trying to stand up. Her shirt rolled up to reveal her stuffed belly which resembled a small basketball that kids would use.<br>\r\n\"Okay 3, 2, and 1, mmmmpppphhhhh\" Keara groaned trying to stand up. <b><i>Clink! Bzz</i></b> Keara sat back down in defeat. Her shirt was rolled up which revealed a round tan ball about the same size as Chloes. She felt an odd pressure relief near her midsection though. She looked down and saw her fly unzipped and the button to her pants under the metal table. She blushed in embarrassment while Chloe just sat there jaw dropped and the cashier started laughing. Now with nothing to lose Keara hauled herself off the bench and stood up in victory. Chloe was thinking of trying something like that but she didn't want to risk her tights ripping. Eventually Keara was finally able to get Chloe up and the two waddled out of the restaurant. Keara now to embarrassed to even talk to her friend said good bye and went to sleep as soon as she got home.</span></div></div>",
            "created":1344574800,
            "id":1402073,
            "title":"Being inpatient gets you nowhere!"
        },
        "11123111":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Keara and Chloe just barely make it through tryouts without ripping any thing.",
                "They both rip their skirts."
            ],
            "content":"<div class=\"\"><div> <span>Keara woke up that morning and went to the bathroom. She took a quick shower and went downstairs to eat a larger breakfast then usual having an extra bowl of cereal and 2 more eggs. She inhaled them quickly and chugged down her orange juice. She climbed up the stairs and looked for an outfit to wear to school that day. She stared in disgust at the buttonless jeans hanging on a rack for her mom to sew. She went through her clothing and picked out a pitch black formfitting skirt she had gotten a year ago. She pulled them up slowly having no trouble till she got to her thighs. She started inching the skirt up little by little till it got stuck just under her bum. She heaved but they wouldn't budge. With one last attempt she pulled with all her might and yanked them over her butt. Unfortunately doing this caused her panties to ride up and give her a major wedgie. Before she could take care of that she had to zip and button the skirt. The prongs slowly clipped together till it stopped completely half way. 'That will have to do' she thought. She grabbed the button and other flap and started to slowly pull them together. Little by little they got closer and  in a desperate attempt she forced the button into the hole. Lucky for her they hooked but it was causing her to lose her feeling in her hips. Keara sighed. The only reason she was wearing that stupid skirt was because she wanted to get into cheer leading with Chloe. To do so she had to be able to be three things: Flexible (check), Perky(check), and look good in a skirt(half-check). She tried to reach down and pick at the wedgie but she couldn't even fit her fingers through! The skirt used to be able to touch her knees but was now scrunched up mid thigh. She grabbed a yellow tight tank top. Which showed a little bit of pudge on her belly. She decided to put on a blue Guess hoodie over it to hide her small gain and the straining button. She put on some flats and left for school. <br>\r\n<br>\r\nOn her way there she noticed Burgers R Us completely empty and a moving truck unpacking stuff with the logo Stuffed Sausage onto the patio. \"Hmm wonder if their any good,\" Keara said to herself. She went through the front doors and found the school completely empty. She checked her phone and saw she was ten minutes before the bell. Keara thought hard about what was going on when it hit her. \"Oh shit! It's spirit day!\" She screamed running down the halls as fast as she could in the skin tight skirt (which wasn't very fast). She snuck into the gym and changed into her work out clothes quickly. Her next task was hard she had to sneak through the gym doors without making noise and quietly sneak into her class. Her first task she barely did as the gym teacher looked through his office door and just missed Keara running outside. She tip toed into her class and watched the event going on take place. She sat next to Chloe. \"What event is this?\" Keara asked.<br>\r\n\"Relay race and it's about to start. Hey look it's Darian!\" Chloe shouted excitedly. Keara wanted to cheer and support him but didn't want to throw off his game. The starting bell rang and Darians team mate Matt ran off with the baton. It must have been a minute before Matt showed up. The other team was about to lap him. But he was limping. \"What happened?!\" Chloe shrieked. He handed the baton to Darian who trailed behind the other team. Team A (Unknown people) were on their third lap and Darian handed the baton to Matt who went as fast as he could but you could tell he was still injured. Team A finished 17 seconds ahead of Team B. <br>\r\n\"I hope you guys enjoyed the race. But unfortunately for Team A our security camera picked something up that might be a bit of a downer for your team,\" Principal Pumar said over the microphone. Everyones attention turned to a large screen which showed the guy from Team A kicking out Matts leg and him toppling over in pain. \"Due to physical contact Team B wins by disqualification,\" Majority of the people cheered. Keara picked at her wedgie and stood up to do her event: hurdles. Keara walked down the bleachers and lined up for hurdles. The rules were being explained but Keara already knew everything there was to know. She had to jump over 15 hurdles in a 100 meter distance She got in to ready position but her stomach started gurgling. 'Oh no not now' she thought. The starting bell rang and Keara jumped over the first hurdle and then the second but then on the third as soon as she got over she let out a rather large fart from the pressure. Keara started blushing madly but kept going. The other girl looked back in disgust which caused her to crash into the fourth hurdle. Keara took this as an opportunity and passed the girl. By the 9th hurdle Keara started getting really tired and then when she got to the 14th she couldn't even jump over. She just jumped and tripped right over it. As she tried to get up the other girl passed her and won the event. Instead of trying to finish and be a good sport she just quit. As she walked up the stairs to where her friends were, she collapsed in a heap. <br>\r\n\"What the hell happened?\" Chloe asked surprised.<br>\r\n\"Yeah, you used to be able to run that track in your sleep,\" Darian added.<br>\r\n\"I dont know. I just couldn't go anymore,\" Keara said breathing heavily. The friends talked throughout the rest of the events as they had already done theirs. Darian was the only one to actually qualify for an event out of the friends. The events ended and everyone went back inside to prepare for their different classes. For Keara and Chloe that was cheerleading. <br>\r\n<br>\r\nKeara changed out of her sweaty clothes and put on her super tight skirt, her tank top and hoodie. She met Chloe out side who was wearing the same tight skirt that Keara had except in white and a red tank top that clung to her body like a second skin. Keara stared at Chloe's belly which was bulging out a small bit. It wouldn't of even been noticeable if she wasn't wearing a skin tight shirt! In the middle of a conversation Chloe started to randomly pick at her butt.  <br>\r\n\"Stupid wedgie!\" Chloe muttered. <br>\r\n\"Chloe its fine I've got one to you just have to ignore it,\" Keara said to Chloe sincerely.<br>\r\n\"Fine,\" Chloe groaned. The whistle blew and the girls lined up for cheer leading tryouts. <br>\r\n\"Girls you look great in skirts so the first part is done. Now it's time to show us what you've got. Be perky, flexible and show us how great you are at cheerleading,\" The captain said.<br>\r\n\"Do you want us to go change?\" One girl asked.<br>\r\n\"Nope, you'll be going through this in your clothes,\" the captain replied.<br>\r\nThe girls both silently screamed 'What?!'.</span></div></div>",
            "created":1344661200,
            "id":1402495,
            "title":"A tight skirt and some gas"
        },
        "111231111":{
            "choices":[
                "The girl's make it to Chloe's house, but not without some digestive difficulties",
                "Too stuffed to move, the girls wait it out. "
            ],
            "content":"<div class=\"\"><div> <span>The potential cheerleaders were all lined up, trying to look as perky as they could. Huge smiles were plastered on their faces as the captain set up her clipboard. \"Okay,\" she said, \"I want you all to get in groups of four, we're going to start with some basic cartwheels. Keara was starting to panic, the way her skirt fit, any sort of quick movement was bound to rip it! She turned to Chloe, \"Do you want to be on a team together?\" <br>\r\n<br>\r\n\"Sure!\" Chloe replied. The two girls found some others and got ready. The first round of cartwheels weren't bad, Keara and Chloe made it through without ripping anything, although their wedgies were becoming a real pain. \"Damnit,\" Chloe whispered to Keara, \"my stupid underwear keeps riding up.\" She picked at her panties while the other girls weren't looking, desperate to remove them from their wedge. \"I know,\" said Keara, \"I can barely focus with them like this.\" The two girls waited for their next round, stressing over their underwear.<br>\r\n<br>\r\nBy the time the next round of cartwheels started, Keara and Chloe had mostly dug their underwear out. But just before Keara was going to start, she felt her tummy give a small gurgle. \"Oh shit,\" she thought, but went into her cartwheel. At the end of her last flip, Keara let out a loud fart right in front of Chloe. \"Eww, gross. Who just farted?\" The captain looked around at all the girls, who were looking at each other in confusion. While this was going on, Chloe's stomach gave a soft rumble. <br>\r\n<br>\r\n\"Hey Keara, can we go get some food after this? I'm really hungry.\" Chloe finished her sentence with a soft fart, barely loud enough for a mouse to hear, but still incredibly smelly. \"Yeah sure,\" Keara said, but then she got a whiff of Chloe's gas,\"holy crap girl, you stink!\" <br>\r\n<br>\r\nChloe just looked down at her feet, \"I can't help it, my tummy's been weird this last week.\" <br>\r\n<br>\r\nThe rest of cheer tryouts went out with only occasional flatulence, but by the end of it Keara and Chloe were exhausted. \"Oh man, I haven't done that much in my whole life!\" Keara sat down on a bench, her small, pudgy belly breathing in and out. \"I know,\" said Chloe as she too sat down, sweat pouring down her body. \"So, shower and then Burgers 'R Us?\" \"Okay.\"<br>\r\n<br>\r\nAfter the girls showered, and struggled to get their skirts back on, they went over to Burgers 'R Us, only to find it had been replaced by Stuffed Sausage. \"Oh yeah! This morning I saw a moving van taking here, maybe they switched owners or something?\" Keara said as the two entered. What they were greeted with was a modern, industrial looking building. Metallic booths lined the walls and a long counter stretched across the back. The grills were hidden behind a brick wall. \"Hello! Welcome to Stuffed Sausage, what would you like?\"<br>\r\n<br>\r\nThe girls marveled at the prices. The largest meal on the menu, which contained 4 six-inch hot dogs and 1 foot and a half sausage, was only $6! \"Umm, I'll have two of the Mega-Combo,\" Keara said. \"Me too!\" Echoed Chloe.<br>\r\n<br>\r\n\"Okay, I'll have your orders out right... now!\" Suddenly, a part of the counter moved and a conveyor belt shuffled the meals out. After the girls paid for their meals and their drinks, and loaded their trays with ketchup and mustard, they sat down. \"Wow! These things are massive!\" Chloe said, just as her stomach roared, demanding to be fed. \"I know!\" Said Keara, as her stomach also begged to be filled. The two girls proceeded to eat their meals, savoring the flavors and spilling condiments all over their shirts and skirts as they tore through the sausage.<br>\r\n<br>\r\nWhat the girls didn't know was that behind the brick wall was a large vat, filled with a mixture of \"meat\", lard, salt, and other chemicals that had nine-syllable names. The secret to the low cost of Stuffed Sausage was the low cost of production, and numerous health organizations had condemned the company for almost single-handedly causing massive amounts of obesity. But in the small town that Keara and Chloe lived, no one had heard about this new company, which made it perfect for business. <br>\r\n<br>\r\nAn hour and a half later, Keara and Chloe were filled to the brim. Their skirt buttons had popped off as their bellies had swelled to accommodate all that food. Their stomachs looked like soccer balls, and loud gurgles could be heard as their bodies digested the food. \"Ugh, I don't want to move!\" Chloe said. \"Yeah, let's just wait this one out...\" Keara sucked down the last of her pop, letting out a loud burp. \"Hgnh, oh, that hurt to burp.\"</span></div></div>",
            "created":1429678800,
            "id":1967742,
            "title":"Disaster Averted?"
        },
        "1112311111":{
            "choices":[
                "One week of junk food later at cheer practice...",
                "Keara wakes up for a midnight snack, once again hungry, and binges."
            ],
            "content":"<div class=\"\"><div> <span>Phhhhhrrrrrrttttt. Keara let out another fart and relaxed in her booth. Both her and Chloe had been in Stuffed Sausage for quite some time letting their bellies process the massive amount of junk they had eaten. Chloe had fallen asleep some time ago and was letting out soft, stinky farts while she snored. Keara was even starting to fall asleep when her phone buzzed. Digging into her now tight skirt, she pulled out her phone to see what was up.<br>\r\n<br>\r\n\"For the next twenty minutes only, all milkshakes at Stuffed Sausage are 60% off!!\" Keara's phone said. Despite her belly's protest, Keara found herself oddly hungry at the mention of milkshakes. \"Hey Chloe,\" she got up to wake up her friend, struggling to pull down her skirt while she did so, \"are you still hungry?\" <br>\r\n<br>\r\n\"BRRAAAAPPPPP, ah that hit the spot! What did you say?\" Chloe stretched, revealing her now pudgier tummy for all to see. <br>\r\n<br>\r\n\"Are you still hungry? Because milkshakes are cheap right now.\" Chloe shook her head and got up, also pulling down her skirt, and walked over with Keara to the counter. Already a line was forming, all people wanting to take part in the new deal. Most were in similar states as the two girls: letting out farts while hungering for more junk food. After waiting for their turn, the two girls each ordered two deluxe chocolate milkshakes. The creamy sugar and fat laden drinks came in jumbo cups and the two girls left the restaurant. <br>\r\n<br>\r\n\"Mmm, this is sooooo good!\" Keara said while she downed her shake. Forgetting that drinking so fast would give her a tummy ache and some serious: \"Ah, brain freeze!\" Keara stopped on the road and put her hand to her head, hoping that the pain would subside. <br>\r\n<br>\r\n\"Haha, you big dummy!\" Chloe said while she sipped her shake. \"What did you expect, you were drinking that like it was going out of style!\" <br>\r\n<br>\r\nKeara just glared at her and the two continued on to Chloe's house, slurping down the rest of their drinks. By the time they reached the house both were, once again but not for long, full. The changed into something much more comfortable than their skirts, specifically sweatpants, and settled into the couch to watch a movie. As they leaned back into the cushions, the effects of their junk food binge and shakes clearly showed. Their stomachs stuck out like two slabs of flab. Unfortunately for the two girls, most of the pudge had settled in their bellies and ignored the more womanly parts of their physique. A sever case of lethargy came over the two as they lounged on the couch, and soon they were fast asleep, all the while letting thier bodies turn more of the food into fat. </span></div></div>",
            "created":1458190200,
            "id":2118681,
            "title":"Sugary Pigout"
        },
        "111231112":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Follow Chloe and Keara while at Chloes house.",
                "Follow both girls at lunch trying the new fast food place."
            ],
            "content":"<div class=\"\"><div> <span>Keara and Chloe started to sweat nervously as they were going to have to do flips and the splits in their skin tight skirts. The first thing they had to do was a hand spring. The girls were lucky and made through it without ripping anything. Keara next had to make a pyramid and the girl at the top would have to jump into Chloe and another girls arms. It all went well until Keara kneeled down over top of two girls. Doing this caused the zipper on her skirt to rip entirely off of one side. It didn't seem like anybody noticed but Keara still blushed red. The girl jumped off of the pyramid and Chloe and the other girl caught her. Their second to last task was to hold someone on their shoulders and then the person on top would have to jump off and do a flip. Chloe was unfortunately paired with Keara and she would have to lift a bigger body mass. Keara stood on Chloe's shoulders and Chloe slowly lifted her up. Do to the larger amount of weight and Chloe's lack of upper body strength she only got about half way before letting out a loud fart and then flinging Keara up in surprise. Keara launched forward and did a front flip and landed it but she heard a loud snap. It sounded like her panties snapped. Keara felt something brush her leg and then touch the floor she looked down and found her lime green panties laying in the middle of the gym floor. She quickly snagged them up and shoved them into the waist band of her skirt knowing her chubby belly would keep it from falling down. Chloe was lucky another girl got blamed for passing gas and was kicked out. The last and final activity was for the girls to do a front flip landing in the splits. Keara and Chloe started sweating. There was no way they could get through this without ripping their skirts. As the head cheer leader counted down from three the girls got in ready position. This was it. They both jumped forward and landed in a splits. A soft and loud rip were heard throughout the gym. Chloe felt a cold breeze brushing her rear. She looked back and noticed her butt made a rip right through the middle exposing her baby blue panties and a bit of her bulbous butt. Keara on the other hand made a smaller rip on her right butt cheek and her warm butt fat bulged out of the hole. Chloe couldn't take the embarrassment anymore she leaned forward causing the button on her skirt to pop off and ran out of the gym. Keara quickly leaned forward and ran off to comfort Chloe. Doing this caused the rip on her butt to grow, exposing even more blubber. <br>\r\n<br>\r\nKeara found Chloe at her locker crying and pulling out about five brownies. She saw Keara and put her head on Kearas shoulder and started to cry while munching on her brownies. This continued till Chloe finished her last brownie. She had a chocolate stain on the corner of her mouth. She let out a slight burp and got off of Kearas shoulder. Keara looked down at the packaging on one of the brownies. \"Chloe?! You know these brownies make you gain weight right?!\" Keara exclaimed in surprise.<br>\r\n\"What?!\" Chloe shrieked while holding her bloated belly. <br>\r\n\"They put twelve grams of fat and some chemical in each one and you ate five! So you just consumed forty-eight grams of fat in not even a meal. Your just lucky that the chemical will make you digest the food faster!\" Chloe was ready to die just then. She slapped her bloated belly in anger.<br>\r\n\"My sister said they would make me lose weight!\" Chloe cried.<br>\r\n\"Well your sisters an idiot,\" Keara said calmly.<br>\r\n\"I know,\" Chloe replied in between sobs. Chloe tried to get her panties out of her butt crack. But couldn't manage do to her bloated tummy. She locked her locker and slid down on the ground. Her exposed butt touching the cold school floor. The break bell rang and to avoid people seeing them with their skirt tattered and Chloes shirt rolled up they went home as fast as they could to change and then make it back in time for their next class. </span></div></div>",
            "created":1344747600,
            "id":1403019,
            "title":"The ripping of skirts."
        },
        "1112311121":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Skip to lunch.",
                "Continue in her next subject."
            ],
            "content":"<div class=\"\"><div> <span>Chloe and Keara ran up stairs and tried to find clothes to change. <br>\r\n\"Chloe where's your underwear?\" Keara asked trying to find a replacement for the broken one. <br>\r\n\"Oh my mom had to wash them because according to Madison the Tooth Fairy came in and knocked itching powder into the drawer,\" Chloe replied. \"I have a thong under my mattress though.\"<br>\r\n\"A-a a thong?\" Keara asked frightened.<br>\r\n\"Yeah my mom got it for me last year but I hate it. If you want you can have it,\" Chloe replied. Keara slipped her hand under the mattress and picked up the black thin fabric. She hated thongs. Ever since that one moment in grade six. Keara had just bought a new thong expecting all the boys to have gone crazy. She was in gym class and as she was about to get changed. She noticed her shirt and pants gone. Looking everywhere she eventually had to go outside and face everybody. She was expecting wolf whistling or oohs and aahs. Rather then that everyone started laughing. Calling her different mean names and bullying her. She eventually got kicked out of that school for being nude and transferred to North High. Ever since that event she never wore thongs or dated boys. She walked into Chloes bathroom. She bent down to take off her flats which caused her skirt button to fly off and hit the toilet. She inched the skirt down her thighs and slipped the thong on. She sighed loudly and then walked out of the bathroom to grab some jeans. She then realized that Chloe only had a pair she got a year and a half ago which was before she found out about multi colored tights. She grabbed the jeans and heaved them up her legs. They couldn't fit over her ass and made her thighs look massive. She took them off and grabbed a pair of black tights. Keara slid them up and put on her flats. She walked out the door to see how Chloe was doing. <br>\r\n<br>\r\nChloe would of been fine via getting changed if it wasn't for those brownies she ate. She couldn't fit into some of her clothes. She looked at three articles of clothing she could no longer wear to her left (the skirt, a pair of tights and a shirt that didn't stretch across her belly) in disgust. She now had on a pair of pink tights that didn't completely cover her larger rump and showed about half an inch of crack. You could see her panty lines through the tights. Her thighs grew at least two centimeters in circumference. She now had small love handles and a bulging belly that stuck out two centimeters and while sitting down three centimeters. She had on a red blouse so that her gain wouldn't be showcased as much. She had the beginning of a double chin and her her arms have gotten larger. Even her fingers were starting to get a little pudge on them. Her breasts haven't even grown a bit which aggravated Chloe. She stepped out of the family wash room and ran into Keara. Who was ready to go. They were already late for their next class so they decided to stay home for a bit. Chloe's mom was in the kitchen and there were a pan of brownies on the counter. Obviously Chloe didn't want any but Keara was hungry. \"Is it okay if I have a couple of brownies?\" Keara asked politely.<br>\r\n\"Of course Keara. Oh and by the way Chloe, Madison wanted to tell you something. It was something like \"this pan should make it easier\". Chloe's mom replied. Chloe shrugged and Keara took a row of brownies (six) and put them in a bag. She polished them off by the time they got to school and tried to hold in a burp. <br>\r\n\"Keara I don't care if you fart or burp in front of me. Everyone does it so you don't have to be shy,\" Chloe stated to Keara (she heard her suppress the burp). <br>\r\n\"Are you sure?\" Keara asked embarrassed.<br>\r\n\"Yes I am. Here watch,\" Chloe replied. She pushed into Kearas stomach and Keara let out a very loud and unladylike burp. Keara smiled and the two walked into the school. They had math together so they didn't have to face being late alone. They walked into class and were almost immediately sentenced to detention after school. They we're also partners for the big project due next week so they set up their poster in the corner. It was 15 minutes before they got into class and Kearas bloated belly had already half gone down. She didn't seem to notice yet though. They finished up their poster and got up to write their speech. As they sat at their table Keara let out a small fart. \"When I told you I didn't mind you passing gas around me, I had no idea you would do it so often,\" Chloe joked.<br>\r\n\"You can blame my bloated stomach for that,\" Keara replied smiling and patting her belly which jiggled in the process. Keara froze in shock. She looked down and realized she wasn't bloated any more. It was replaced with fat. She lifted up her shirt (and hoodie) and noticed her belly bulging over her tights. It covered the top half of the lace on her waist band. There we're two small rolls which were located under her bra and a larger one located at the bottom. She poked it and her finger sank into it. She dropped her shirt, stood up and turned around. \"How does my butt look?\" Keara asked her friend who was wide eyed.<br>\r\n\"I-It's slightly see through and you can see the out line of your crack,\" Chloe replied stammering. Keara slapped her tan rump and felt it jiggle for a longer period of time. She sat back down and realized her thighs almost touched while spread on a surface. Her small love handles bulged out ward. Keara felt like crying but they had to get back to their assignment. She leaned forward causing a bit of crack to show and got back to work.</span></div></div>",
            "created":1344834000,
            "id":1403905,
            "title":"Follow Chloe and Keara while at Chloes house."
        },
        "11123111211":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "They wake up on the side walk and school is just about to end.",
                "They wake up on the sidewalk and school has already ended."
            ],
            "content":"<div class=\"\"><div> <span>Keara, Chloe and Darian all made a commitment to go try the new fast food restaurant. They all found a way to get money and met up outside. They walked to the restaurant guessing what it would be like. As soon as they got in they were hit with an aroma of amazing smells. The waiters and cooks all wore nose plugs though. It didn't bother the friends though because it was like they were at an actual restaurant and not just some greasy food place. \"Greetings and welcome to Stúffed Sauságe! (pronounced like St-oof-ed Sauce-au-ge) I will take you to your table,\" a french waiter said. He took them to a booth with two benches, a flower pot in the middle, different seasonings and a microwave/cooler in case you want to cool down or heat up your food/drink. \"Here are your menus and I will be back to take your order soon,\" the waiter said politely. After looking through the menu the friends decided on what they were going to get. \"What will you be having?\" the waiter asked.<br>\r\n\"I'll have a small jalapeno smoky and a raspberry flavored water,\" Keara replied.<br>\r\n\"I'll have the small nachos and cheese with sausage sprinkled on top and a spring water,\" Darian added.<br>\r\n\"I'll have the mini bratwurst and a lemon flavored water to drink,\" Chloe finished. <br>\r\n\"Will that be all for you today?\" the waiter asked. The group nodded their heads and awaited their food. <br>\r\n<br>\r\nTheir food came rather quickly which was surprising for such a nice place. They ate their food slowly and savoury. They left the money for their meal on the table and got up to leave when suddenly the waiter came back and told them to sit. The group sighed loudly and caught a big whiff of the place which caused some odd reactions. Keara started to smile and sway her head, Chloe started to randomly laugh and Darian started to run in spot as if he were in track.<br>\r\n\"Your leaving already? Aren't you guys still hungry?\" the waiter said smirking. <br>\r\n\"Still hungry,\" the trio muttered. <br>\r\n\"But me and her don't want to get fatter. We want to looseee weight,\" Keara said patting her belly. <br>\r\n\"But you two are so skinny,\" the waiter replied.<br>\r\n\"N-no were no-,\" Chloe stopped her sentence after she realized she had her old body back. She looked at Keara who was just as surprised. They rubbed their firm abs happily. <br>\r\n\"Now how about I go get you guys some more food,\" the waiter said politely. <br>\r\n\"Yeah!\" the three friends shouted as they sat back down and got ready for their meals which also arrived very quickly. The friends gulped down their second serving of food which was a full sized plate of ribs, an extra large grilled burger and a t-bone. The waiter then brought a third serving of food which was a massive poutine and a plate of smokies. The friends ate through two more servings of food and were just about to start desert. Their pupils were dilated and focused on their table waiting for more food. Desert finally came and there were three massive gourmet deserts to choose from. Keara took a brownie sundae and shoveled the creamy desert into her mouth. Chloe picked a lemon meringue pie that was bigger then her head. Darian grabbed a chocolate souffle and ate it quickly. The servings ended and the friends layed back happily. Luckily for Chloe she undid the buttons on her blouse so they didnt pop off. Soon enough Darian and Chloe passed out on the table and snored. Kearas last image was a colorful man with two heads taking off Darians wrist watch and twenty bucks from Chloe. Keara stifled a belch and then blacked out.</span></div></div>",
            "created":1344834000,
            "id":1404032,
            "title":"Different aromas"
        },
        "111231112111":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "They finish the entire run as well as shedding off a couple pounds.",
                "They finish half of the run shedding two pounds."
            ],
            "content":"<div class=\"\"><div> <span>Chloe opened her eyes not remembering anything that happened in the last 3 hours. She turned her head to the side seeing Keara sleeping peacefully. She looked down and noticed Kearas orb of a belly that bulged outward about 3 inches. It was only bloated but it was still pretty large. A sudden wind passed by and Chloe felt a breeze on her stomach and glanced at it.<br>\r\n\"Ahhhhhhh!!!!!\" She screamed waking up her two friends. <br>\r\n\"Woah Chloe. Calm down and tell us what happened,\" Darian said moaning. <br>\r\n\"Look at us were huge!\" Chloe cried. Keara and Darian looked at their bloated bellys and screamed for themselves.<br>\r\n\"What did we eat?!\" Keara screamed.<br>\r\n\"I have no idea but as soon as this digests I'm going for a run. You guys can come if you want,\" Darian said as calmly as he could. <br>\r\n\"I'll come. I really don't want to get even fatter,\" Chloe said. <br>\r\n\"I'll come too I guess,\" Keara decided. \"But theres still half an hour before school ends and we can't just lay here.\"<br>\r\n \"Well there's no way I'm facing the track team looking like this,\" Darian said. <br>\r\n\"Yeah, I really don't want to have to go back to school,\" Chloe said cradling her belly. <br>\r\n\"Okay welI then let's just stand up and go home,\" Keara said. It took the group at least fifteen minutes just to stand up. Then another twenty to waddle home. The group dispersed and Keara went over to Chloe's house for a sleep over. As soon as they got home Keara and Chloe went to take a nap. Keara went into the guest room to get ready for her nap. She completely  undressed (other than her bra and thong) and crawled into the guest bed. She was just about to close her eyes when Chloe's mom walked in the room with two pills and a glass of water. <br>\r\n\"I thought you might need these. They're these special pills that make bloating go down,\" Chloes mom said sweetly.<br>\r\n\"Thank you so much,\" Keara said thankfully. Chloes mom just patted her knee and left. Keara popped the pills in her mouth and took a swig of water to help her swallow them. She put the glass on her bedside table and drifted off to sleep. <br>\r\n<br>\r\nKeara yawned and sat up feeling more pudge hang over underwear then usual. She pulled off the blanket and noticed her stomach sticking over her underwear by an inch and a half (while sitting down). Her butt cheeks were now seven inches from crack to hip and six and a half inches from the fold over her thighs to the top of her butt (I know it's really precise. I just didn't know what to compare them to). Her breasts had grown very little but Keara still noticed because of the odd tightness near her bust. She stood up and examined her body in the bathroom mirror. Her double chin had gotten slightly bigger and her arms got fluffier. Her cheeks puffed out more. She walked back into the room and noticed her thighs being very close from touching each other. She grabbed the tights Chloe gave her and heaved them up her legs. She pulled her tank top on and observed her body. Her tank top didn't completely cover her blubber as it stopped at the bottom of her belly button. Her black tights only reached three quarters up her fat bum and showed her crack and her thong. Her thighs stretched the seams of the tights and showed her tan skin through her almost see through pants. She tried to pull up her pants but only got them to move half an inch up her swollen rump. She scratched her bum and walked up stairs to see Chloe. <br>\r\n<br>\r\nChloe woke up to her belly bulging over her tights in two rolls. A small one on top and a large one on the bottom. Her belly spilled over the lace that's used to tighten/loosen the tights. Her butt overflowed her tights and pushed them down a bit which exposed her panties. Her panties were becoming similar to a thong and they were giving Chloe a major wedgie. Chloe noticed a couple of seams in her tights had ripped. Her breasts had still gone unchanged which was starting to make Chloe really mad. Her cheeks puffed out a bit more then Kearas but not by much. Her arms were a tad smaller then Kearas but also not by much. The bottom button on her blouse looked as if it were about to break and the second one from the bottom was starting to get a bit strained as well. There was a knock on the door and shortly after Keara barged in. Keara walked in looking mighty pudgy herself. \"Darian wanted us to grab some water and meet him at the school. We're starting our work out now,\" Keara said looking at her phone. Keara turned around and started to walk out the door giving Chloe a view of her butt. <br>\r\n\"Do you want something to cover up your butt or are you fine like that?\" Chloe said snickering. <br>\r\n\"Yes,\" Keara sighed embarrassed. Chloe went up stairs and got Keara to take off her tights and put on her sisters old long johns. Keara was surprised when they actually fit her fairly well (other then the fact that they hung down past her toes). <br>\r\n\"We should probably weigh are selves so we can find out how much weight we lost,\" Chloe suggested. Keara nodded in agreement and took out the scale. Keara went on first and the digital number stopped at 107. She'd gained seventeen pounds from just six days (she didn't think about how many large meals she had which came to a total of 9). Chloe was shocked and just hoped she didn't weigh that much. Keara got off of the scale and Chloe stepped on. The digital number stopped at 111. She already weighed three pounds more than Keara before they started to gain so that wasn't to big of a shock but still made Chloe want to die. She'd gained eighteen pounds in just six days. Chloe stepped off the scale in shock and walked down the stairs.  The girls got two bottles of water and left the house for their run.<br>\r\n</span></div></div>",
            "created":1345006800,
            "id":1404986,
            "title":"Some unwanted pudge"
        },
        "1112311121111":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Tomorrow during the weigh in.",
                "Keara wakes up in the night to have a \"small\" snack."
            ],
            "content":"<div class=\"\"><div> <span>They met Darian at the school and he explained the route. Darian gained some weight as well but because of the no male weight gain rule I will not describe it. Keara almost fell asleep as the track was so long but was woken up by a slap to the head from Darian. They bent over to make sure their laces were tied which caused another seam to split on Chloe's tights. Kearas large rump was covered by Chloe's sisters long johns but she had a feeling she would trip or something because of how long they were. They started the run and followed the track Darian had told them about. A minute passed and Keara was already starting to sweat. As they passed a picnic area the friends noticed a Hispanic girl bending over to pick some thing up and creating a large rip near the belly of her dress. Chloe giggled not realizing how much stuff she ripped in the past couple days. They got halfway through the run and the girls were huffing and puffing while wiping sweat from their brows. It took an hour but they finally finished their workout. Keara and Chloe were drenched in sweat and were breathing incredulously heavy. There was sweat on their foreheads, under their pits, in their butt crack and under the fold between their cheeks and their thighs. Their pudgy stomachs were pushing up and down. Keara chugged down the rest of her water and let out a loud burp breathlessly. Darian seemed to be the only one unaffected by the workout. It took Keara and Chloe ten minutes before they were actually able to stand again and then another ten minutes to be able to walk back. They said goodbye to Darian and the girls traveled back to Chloes. As soon as they got home they showered and then sat on Chloe's bed to watch a movie. Keara climbed under Chloe's covers while Chloe put on The Grudge. Halfway through the movie Chloes stomach grumbled for food. She texted her sister to bring in popcorn with butter on top and Madison happily obliged. She brought in a huge bowl of popcorn with butter on top. The two friends devoured the popcorn and layed back burping in satisfaction. <br>\r\n\"That was so go -Urp- od,\" Keara said happily. <br>\r\n\"I know. Do you want me to ask her to bring in more?\" Chloe said licking butter from her lips.<br>\r\n\"No. We have to watch our figures remember,\" Keara said moaning. <br>\r\n\"Oh right,\" Chloe replied sadly. They were nearing the part where Takeo drowns Nakagawa in the tub when a sudden <b><i>Frump!</i></b> came from under the blanket. <br>\r\n\"Chloe!\" Keara exclaimed. <br>\r\n\"You know that popcorn ... makes me gassy\" Chloe said letting out another fart. Keara sighed as the gas outbursts continued through out the movie. At the very end the credits started started to roll and another very loud fart was heard from under the covers. Except this time it was from Keara. She blushed in embarrassment while Chloe started to laugh hysterically. This had to have been one of the loudest farts to ever erupt from her rear. She stood up and got out of the bed leaving Chloe alone and went into the guest room to sleep. She shut her eyes and thought of the weigh in tomorrow. </span></div></div>",
            "created":1345006800,
            "id":1405545,
            "title":"A very sweaty workout"
        },
        "11123111211112":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Chloe wakes up for a snack shortly after. ",
                "To the weigh in! "
            ],
            "content":"<div class=\"\"><div> <span><i><b>Grrrrnggghhh!</b></i> Keara's stomach groaned for food. \"Ughhh. I need to feed you again?\" Keara said whilst holding her pudgy stomach in anger. She sat up and stretched. As she groggily got out of bed a small toot escaped her rear. She trudged towards Chloe's kitchen and opened the fridge checking if anything good was inside. Her eyes shot open when she noticed half a box of Fried Chicken from FCO (Fried Chicken and Others). She pulled out the box and put three pieces on a plate and shoved them in the microwave. She poured herself a glass of Orange Juice in the process. She stopped the microwave only a second before going off to prevent Chloe's family from waking up. She pulled the steaming hot chicken from the microwave and dug into it like it was her last meal. She finished her first piece and took a swig of orange juice to add liquid to her dry mouth. After finishing her second piece Keara's belly bulged forward slightly. She slowly finished her third and final piece and when she did she laid back with a bloated belly and intense pain in her stomach. She tilted her glass of Orange Juice back and polished off the glass. She threw her plates in the dishwasher and trudged her way back to her room to get ready for the weigh in tomorrow. </span></div></div>",
            "created":1348981200,
            "id":1438001,
            "title":"Midnight Munching!"
        },
        "111231112111122":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Keara?",
                "Chloe?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who weighs more?</span></div></span></div>",
            "created":1348981200,
            "id":1438004,
            "title":"To the weigh in! "
        },
        "1112311121111221":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "1)",
                "2)"
            ],
            "content":"<div class=\"\"><div> <span>Keara rose out of bed and looked herself in the mirror. Her belly stood out at least an inch and her bum literally swallowed the thong. She grabbed a handful of her belly chub and shook it. It jiggled profoundly. One butt cheek was now as big as her belly if not bigger. Together they were twice the size of her head. Her boobs have still barely grown. Her double chin was now much fuller and her arms carried more flab. Her thighs were only a few millimeters away from touching. She sighed heavily and pulled on her tights. This time they didn't bunch up and they completely covered her monstrous rear. It was extremely uncomfortable though. She bent over to pick up her shirt and felt a release of pressure in her bum. As she turned around she noticed that there was a rip that went straight down the middle of her tights. She sighed heavily. She pulled on her shirt and noticed that it could barely cover half of her stomach. Had she really gotten that big? She trudged off to Chloes bathroom to find out how much they both weighed. Her tights still ripped but she was to depressed to care. <br>\r\n<br>\r\nThey met in the bathroom. Chloe noticed immediately Keara was bigger. Chloe stayed the exact same size as she was the night before. Chloe stepped on first. Her numbers rolled until they met... 109. Yes! I lost two pounds Chloe exclaimed happily. Now if Keara weighed less then her Chloe swore she would eat a tape worm or something. Keara stepped on and the scale rolled until it met... 112. Kearas jaw dropped. \"After all that exercise I gained weight?\" Keara said annoyed. Chloe looked at Kearas large rump and it jiggle furiously as stomped on the floor in anger. Chloe didn't know what to say. She was definitely happier considering that now Keara was larger. Not by much but still. Keara went downstairs to grab breakfast. She was starving and only food could make her feel better. Chloe followed her down and grabbed her self some breakfast as well. They each ate two waffles, three sausages and a few glasses of juice. They laid back slightly stuffed from their meal and burped a few times. Keara knew she had to think of a way to make Chloe fatter and even the scores. Then it hit her. She would have to grab some of that secret stuff that was in the food at Stúffed Sauságe. She just needs to figure out how to get some. Before any of that though she needed to go home and find new clothes. They said their goodbyes and Keara walked home with a large rip in the pants that covered her huge bum. She plotted and then it came to her. She would...<br>\r\n1) Go in and pretend to buy food but while using the restroom sneak into the kitchen and sneak it out<br>\r\n2) Try and crawl through the vents</span></div></div>",
            "created":1350450000,
            "id":1448377,
            "title":"Keara?"
        },
        "11123111211112212":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Let out a loud fart hoping to scare them off",
                "Asked to pull her out"
            ],
            "content":"<div class=\"\"><div> <span>Keara stood in her room trying every single article of clothing on. Her jeans didn't fit, her shirts didn't fit. Nothing fit her! There were maybe 6 articles of clothing left she could wear. 1 pair of pants, 2 blouses and 3 pairs of underwear. She slid the underwear over her thick rump. It was sooo big now! The pair of underwear was now wedged deep between her butt cheeks and giving her a major wedgie. She pulled the sweat pants on and felt her belly spill over the waist band. Her butt squeezed tightly against the seat of her sweats. She buttoned up the shirt and noticed right away the bottom two buttons wouldn't clasp. Her large and flabby belly formed a thick and fleshy muffin top over her sweats. With much sucking in and maneuvering she got the second bottom button to close. She figured this was fine until she could get a new wardrobe. Keara played the waiting game till she could sneak out and steal the ingredient. <br>\r\n<br>\r\nKeara went straight to the back alley as soon as she reached Stúffed Sauságe. Lucky for her the vents were low to the ground so she wouldn't have to climb very high. She used a screw driver and took the grate off. She took a deep breath and shoved herself in. Her belly confined against the cold steel and smushed against the surface. She pulled herself forward and immediately found a problem. Her butt was much to big! She huffed and puffed but couldn't make it through. She sighed heavily again and decided to head back. That was when she realized she was being held from going the other way as well. She couldn't move! Kearas stomach yelped from the increase of pressure which caused a large fart to burst out of her rear. Keara blushed. Her fat ass was hanging out of a hole and she just farted extremely loud! Keara groaned and laid there. She couldn't do anything. She let out another fart. Followed by several more in the past 10 minutes. All rivaling each other in length and sound. Keara heard a noise. There was a group of boys laughing and drinking. She stayed as quiet as possible. But to no avail a boy noticed her butt wiggling around outside the vent. He walked over with the rest of his crew. \"Damn look at dat ass man!\" He said.<br>\r\n\"Can you imagine what size panties she wears!?\" Another one exclaimed. Talk like that continued for a minute before Keara felt hands touching her butt. They were prodding and pinching it. Slapping it and making it jiggle. Keara was so embarrassed. She wanted it to stop. So she...</span></div></div>",
            "created":1352091600,
            "id":1461653,
            "title":"Butt touching!"
        },
        "111231112111122122":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "The Next Day",
                "Chloe's Pov"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey umm. Do you guys think you could like pull me out if the vent? This is really uncomfortable,\" The boys laughed and slapped her rear again. <br>\r\n\"Fine we'll help you. But only if you shake your fat ass afterwards,\" The main guy said laughing. Keara sighed heavily.<br>\r\n\"Fine.\" The boys all laughed and grabbed her legs and tugged. Keara could feel her belly sliding along the steal which was now warm from the immense heat emitting from her stomach. The boys continued to pull and Keara could feel herself sliding out. With one last pull Keara flopped onto her flubber and rolled over on the pavement. She slowly stood up (which was becoming even more difficult) and turned to the boys. \"Thanks Im just gonna go home now,\" Keara said embarrassed.<br>\r\n\"Wait, wait, wait. You still have to shake your booty for us,\" The leader said smiling. Keara sighed and while they expected her to turn around she charged at them knocking them off their balance and ran into the nearest convenient store. She huffed and puffed out of breath and half of her flabby belly hanging out if her shirt,\" She walked the aisles trying to find something and not seem so suspicious. That was when she found them. They were called Anti-Diet Pills. Keara immediately grabbed them and ran to the cashier. She threw them on the counter and purchased them. As she walked home she read the instructions. <i>Use 2 tablets and place in cold water. After they have dissolved. Drink and enjoy added weight. Every 2 tablets will help you gain 5 pounds. Do not exceed 2 tablets in a day. Talk to doctor about medical concerns.</i> Keara smiled to herself and awaited tomorrow. Chloe was gonna get a surprise.</span></div></div>",
            "created":1352178000,
            "id":1461957,
            "title":"Asked to pull her out"
        },
        "1112311121111221221":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "The teacher finds her bloated and suspends her for skipping class",
                "Keara finds her and gets her some more food for later"
            ],
            "content":"<div class=\"\"><div> <span>The next day while at lunch Chloe had gotten a water bottle and salad trying to slim down as much as possible. Keara wanted the both of them to be slim again as well. The hot girls of their grade. They would strut the halls with so much pride. Flaunting their asses and breasts as much as possible. Having so many guys drooling. She missed that. She missed the gossip. The closeness of the bond between her and Chloe. Just the way that Chloe smirked when she found out Keara weighed more then her. Keara needed to get back at her. She felt so embarassed. She just wanted Chloe to know how it feels. As Chloe and Darian were distracted with Chloes phone Keara leaned over (causing her butt crack to be exposed) and dropped 2 tablets in her water. Luckily the tablets dissolved quickly due to their small size and Keara sat back down in satisfaction. Chloe soon being finished with her phone took a swig of her water. Nothing happened. Keara was very upset. Those cheap pills didn't do anything to help. Depressed, Keara finished off her own Salad quickly and went to history class with Chloe. <br>\r\n<br>\r\nIn the middle of the lesson a very loud grumbling sound was heard. Keara looked over at Chloe who was blushing madly. <b>GRRRRRRNGGGGGHHH</b> Chloe continued to blush placing a hand on her pudgy stomach. After the third growl the teacher finally had enough. \"Chloe either stuff some food in your gullet or shut your stomach up. It's disrupting everyone's learning.\" <br>\r\n\"Can I go and grab a snack from my locker?\" Chloe asked.<br>\r\n\"Yes and when you come back I don't want to hear any more noises from your stomach.\" The teacher replied. Chloe quickly nodded and strides out of class to her locker. She opened it and immediately took a bite from her snack. Her mind started to race. She gobbled down her granola bar and ran as fast as she could to the nearest vending machine. She put in a $20 bill and bought 3 packages of brownies, 2 bags of chips, 4 Puffed wheat squares and a Vanilla milk. She laid against the wall and stuffed the food in her mouth. </span></div></div>",
            "created":1360299600,
            "id":1527210,
            "title":"The Next Day"
        },
        "11123111211112212212":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "The Next Day",
                "A Week From Now At The Next Weigh-in"
            ],
            "content":"<div class=\"\"><div> <span>Chloe finished her binge and leaned against the wall in the girls bathroom. She rubbed her stomach before letting out a small belch. She looked at her phone hoping to see something like a text but realized she'd been gone for at least 5 minutes the teacher would probably give her a lecture. She stood up with difficulty and slowly walked towards the bathroom the door. Just as she was about to reach the handle the door swung open and Keara walked inside holding a container of pasta. She quickly draped Chloes arm over her shoulder. As they limped out of the restroom. \"Why are you here?\" Chloe groaned. <br>\r\n\"Mrs. Wiley sent me on a search and rescue,\" Keara joked. Chloe groaned again in response. \"Here have some of this pasta my mom makes me. Its supposed to help relieve a sore stomach,\" Keara lied whilst handing over the container. <br>\r\n\"Gotta fork?\" Chloe grumbled. Keara smiled handing over the plastic fork she was keeping in her locker. Chloe walked into class holding the big container of pasta and eating away causing Mrs. Wiley to roll her eyes. They both sat down over their desks Keara writing down the lesson and Chloe spilling pasta sauce all over her paper.<i>'Today is going to go great.</i> Keara thought to herself. <br>\r\n<br>\r\nAs it did for her at least. She got to watch Chloe's bloated stomach pushing against her jeans for the rest of the day. Even during gym class she could see Chloe could barely do the fitness training. It wasn't saying a lot though as she could not even do it herself. The girls went over to Keara's after school to do some homework. Keara thought about stuffing Chloe silly during the process of it but put her foot down in the end. Chloe was still her friend after all that's happened she didn't want that to change if Chloe were to figure out what was going on. She would just take it slow for now maybe give her just a couple more pills over the next few days and then throw the pills out for good. Keara applauded herself on this act of self control and didn't even notice that she had eaten half a bag of cookies while thinking to herself like that. She looked down noticing the cookie crumbs all over her jeans and black tank top that was outlining the curvature of her muffin top. Keara quickly brushed herself off causing Chloe to giggle slightly. Chloe didn't notice she had eaten the other half of the bag and made her sub conscious think it was all Keara. The girls did their homework for the rest of the night before they said goodbye. Closing the door behind Chloe, Keara immediately undid her jeans revealing the faint stretch mark under her swollen tummy. Chloe did the same except she didn't need to undo it. It had popped off on its own as she bent over to take off her shoes at her own home. Chloe was puzzled. <i>'That hasn't happened in a while'</i>, She thought. She shrugged it off as just a bit of bloating. But deep in her mind she new something was up..</span></div></div>",
            "created":1369026000,
            "id":1593423,
            "title":"An Elaborate Ruse"
        },
        "115":{
            "choices":[
                "Keara comes back the next day",
                "Keara goes back over the weekend when her parents are out of town"
            ],
            "content":"<div class=\"\"><div> <span>One day when she was wandering around town, Keara noticed a new restaurant had opened near the beach. \"Buster's Belly Busting Burger Shank\", read the sign in front. Curiously, she stepped into the new burger joint and was greeted by a delicious smell. Keara was determined to maintain her skinny figure, but she was overcome by the mouth-watering aroma, and almost subconsciously stepped up to the counter. She gave in to her temptations and ordered the restaurant's signature item: The Belly Buster Burger. When her lunch was ready, she could see immediately how it got its name. It was a 1/2 lb patty on a gigantic bun, slathered in all manner of sauces and toppings. When she got to her table, she began to greedily tear into the giant burger. When she was finished with it, she was fuller than she had been in a long time, and a very slight bulge could be seen in her midsection. Keara was about to ignore the heavy feeling in her belly, and go back up to the counter, but she decided against it, and began to walk back home.</span></div></div>",
            "created":1499315340,
            "id":2348043,
            "title":"Belly"
        },
        "1152":{
            "choices":[
                "Keara notices her belly getting softer",
                "She is oblivious to any weight gain"
            ],
            "content":"<div class=\"\"><div> <span>On Saturday morning. Keara woke up, and came downstairs to the kitchen. There, she found a note from her mother on the refrigerator. It read: \"Dear Keara, your father and I are going to visit some old high school friends. We will be back on Sunday night. XOXO - Mom\". All Keara could think of was what we was going to eat while her parents were gone. The most cooking she knew how to do was making a packet of ramen. Thankfully, her mother had left waffles for this morning. After breakfast, Keara was thinking about how she would get lunch and dinner, until she remembered the new burger snack. For lunch, she ordered the same thing as she did the first time she went. At dinner time, however, she decided she wanted more. She ordered the Belly Buster Combo, which consists of a massive burger, an XL order of fries, and a large shake. Keara was thouroughly stuffed after her day of eating large portions of greasy food. On Sunday morning, she walked back to the burger shack, hungry for breakfast. The breakfast menu turned out to be heaven on earth. She ordered the AM Feast, a 1/2 pound burger topped with a fried egg, American cheese, bacon, and sausage. Already a little bloated from the previous day's meals, Keara continued to stuff herself throughout the day, squeezing in an equally large lunch, dinner, and a huge milkshake for dessert before her parents got home. She patted her stomach sipping on a sofa as her father pulled into the driveway, and prepared to suck in her food baby for the rest of the night.</span></div></div>",
            "created":1499316660,
            "id":2348052,
            "title":"Keara goes back over the weekend when her paren..."
        },
        "12":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Belly and Boobs",
                "Spread evenly",
                "Butt, Hips and Thighs ",
                "Boobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will majority of her fat go?</span></div></span></div>",
            "created":1344402000,
            "id":1400600,
            "title":"Nikki"
        },
        "123":{
            "choices":[
                "Nothing, want to hangout",
                "Im kinda busy tonight"
            ],
            "content":"<div class=\"\"><div> <span>Nikki woke up and hit the snooze button on her alarm clock. She gets up out of bed and walks over to her bedroom mirror, she was as sexy as ever. She showered and put on her favorite red dress. The dress was tight in all the right places, it curessed her every curve. She ran downstairs and quickly ate some scrambled eggs with bacon and toast. Then she hoped in her 2002 blue honda civic and drove down to the clothing store where she worked. When she arrived, she clocked in and talked to her coworker Isabella. The two girls had been best friends since second grade and both were beautiful. Isabella stood 5'6 and weighed 129lbs, she had long black hair and was Italian. Her breasts were a C cup and her jean size was a 6, her best feature was her light blue eyes. \"Hey Nikki, whats up babe\" Isabella said jubilantly. \"Not much Bella, how was the sale yesterday?\" The store was called Clarkson's Clothing Store and they were known for there big sales. \"It went well, I was so busy and hungry, what are you doing after work today?\"</span></div></div>",
            "created":1436677200,
            "id":2007035,
            "title":"Spread evenly"
        },
        "1231":{
            "choices":[
                "When they arrive",
                "After dinner"
            ],
            "content":"<div class=\"\"><div> <span>\"Nothing, I was actually looking to make plans\" Nikki said. \"Great there is a new resturant on Proctor Lane I've been dying to try, you down?\" asked Isabella. \"You know I'm down for anything with food involved Bella, what time do you get off?\" Nikki said smiling becsuse she had heard many good reviews of the new eatery. Isabella said \" Well Mr.Morton said I can leave at 3 today because I work a long day yesterday, so what do you say I pick you up here at 6?\" \"Great, I'll see you then\" Nikki said as the girls went to there departments. Isabella worked in the womens gootwear department while Nikki was a salewoman of jeans and tee shirts. Nikki was an average saleswoman, she was good at tell the customers what they wanted to hear. Before she knew it the clock read 530, her shift was over and Isabella was on her way to pick her up for dinner. \" Did you make any sales today Nikki?\" Isabella asked as she pulled out of the store parking lot. \"Well this one guy bought a few tee shirts but other than that it was a slow day\" Nikki said anxious to get to the resturant.</span></div></div>",
            "created":1436677200,
            "id":2007037,
            "title":"Nothing, want to hangout"
        },
        "12311":{
            "choices":[
                "Lets do it ",
                "I dont know"
            ],
            "content":"<div class=\"\"><div> <span>Isabella parks the car and the two girls hop out and walk into the restutant. It was a a Friday night and the place was packed, Nikki looked around and the food looked delicious. Isabella approached the mater de and said \"Hi, we would like a table for two\". The mater de checked the reservations book and brought the girls to an open table. A waiter walked over and said \"Good evening, my name's Frank and I'll be your server tonight, can I start you off with something to drink while you look over the menu?\" Isabella said \"Sure, I would like a diet soda with lemon.\" Nikki said \" I'll have a sprite please, by the way what do you reccomend to eat?\" Frank said \" Well everyone has been raving about our chicken parm which comes with spagethi on the side or we have great seafood options as well.\" Nikki says\" I'll take the chicken parm please with extra cheese.\" Isabella decides to look over the menu more and says \"You know I've been thinking it's really hard trying to stay in shape with all these great places to get food, I really just want to pig out, what do you say Nikki?.....\"</span></div></div>",
            "created":1436677200,
            "id":2007079,
            "title":"When they arrive"
        },
        "123112":{
            "choices":[
                "Saturday morning",
                "sunday morning"
            ],
            "content":"<div class=\"\"><div> <span>\" I dont know Bella, I already put on a few pounds eating my dad's pastries.\" said Nikki hesitantly. Isabella says \"Nikki who cares your dad's pastries are really good and we both deserve to treat ourselves. Besides if we need new clothes we can get a discount at Clarkson's, please Nikki will you do it?\" Nikki thinks it over for a minute and says \" Alright Bella, I'm in but lets start tomorrow because we are both off from work.\" Isabella cheers with glee and hugs Nikki saying\" Don't worry you won't regret this Nikki, this will be great. Now lets enjoy our meals because tomorrow we are gonna eat all junk foods.\" Nikki smiled because shes always had a bit of a sweet tooth and never really ate too healthy so this was right up her alley. The girls ate there meals and paid there bill and drove back to Clarkson's. Nikki hopped in her civic and went home, she looked in her bedroom mirror and to a good long look because she knew she would be in shape much longer. She changed into her night gown went to sleep. </span></div></div>",
            "created":1436677200,
            "id":2007122,
            "title":"I dont know"
        },
        "1231121":{
            "choices":[
                "Later",
                "that night"
            ],
            "content":"<div class=\"\"><div> <span>Nikki woke up as her alarm sounded, Saturday morning she was off from work and going to meet  Isabella for a fun day of eating whatever they wanted. She went to her closet and put on a purple dress with a long zipper running down the back. Nikki then went downstairs grabbed her car keys and drove to Isabellas house. She rang the doorbell, \"Come in Nikki its open\" Isabella hollered from the kitchen. Nikki walked in and sat down on the couch and Isabella brought in some french toast drenched in maple syrup. Nikki was drooling and she grabbed the plate and ate all the french toast as quickly as she could. Isabella said \" Hey I was gonna...\" but before she could finish she thought to herself, \"Wow I've seen Nikki like this, she's always been so worried about her weight, maybe I should help her before I help myself\". Isabella walked into the living room and smilied deviuosly saying \" How was it Nikki, want some more food?\" \"I take all the french toast you've got, it one of my favorite you know.\"  Isabella felt an rush of happiness come over her, she always wanted to she what Nikki would look like a bit chubbier.</span></div></div>",
            "created":1436763600,
            "id":2007495,
            "title":"Saturday morning"
        },
        "12311212":{
            "choices":[
                "Just one pastry cant hurt",
                "I should hive these pastries to Isabella"
            ],
            "content":"<div class=\"\"><div> <span>That night Nikki got home and was still hungry, she had eaten 6 batches of Isabella's french toast. She opened the door to her house and there was a note on the fridge. Nikki tead the note which said \"Hey Nikki, I was running some errands and figured I'd stop by, you weren't home I wrote you this note. P.S. I left a surprise in the fridge, Love Dad.\" Nikki immediately opened the fridge to find 5 boxes of her father's famous pastries. She looked at her dress which was tight just like she liked it but she thought \"I shouldn't have eaten all that french toast, but it was so good. I think tomorrow I should tell Bella that this was a mistake\". Nikki put on the T.V. and began to watch a baseball game. About two hours went by and Nikki's stomach was rumbling to the point where she couldn't hear the T.V. She tried to ignore it but it continued for another half hour. Nikki said \" I'm so hungry but I really don't want to eat anymore food, I dont want to gain weight and have to buy a whole new wardrobe. She walked to the frigde and grabbed a water and thought....</span></div></div>",
            "created":1436763600,
            "id":2007498,
            "title":"that night"
        },
        "123112121":{
            "choices":[
                "Gained a little weight",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh one pastry couldn't hurt, I will start dieting tomorrow.\" Nikki thought to herself. She hrabbed a box of pastries and took a chocolate filled one, she bit into it and it was so good. Then Nikki ate another pastry and before she knew it the box was gone. She sat on the couch with the empty box on her stomach, she went to her room changed into her night gown and went to sleep. The next morning Nikki took the other 4 boxes of pastries over to Isabella's house. She rang the doorbell and Isabela open the door but something was different about her. \"Hey Bella, my Dad brought over some pastries and I wanted to give them to you.\" Isabella took the pastries over to the couch and Nikki noticed something, Isabella...</span></div></div>",
            "created":1436850000,
            "id":2007805,
            "title":"Just one pastry cant hurt"
        },
        "1231121211":{
            "choices":[
                "Nikki leaves",
                "Isabella cooks for Nikki"
            ],
            "content":"<div class=\"\"><div> <span>\"Bella have you been eating alot today?\" asked Nikki noticing Isabella's slightly bigger belly. Isabella who was already digging into the pastries took her face out of the box and said with her mouth full \"No, I guess I just ate a ton yesterday after you left. Man your dad can make some good patries.\" Isabella had chocolate all over her face, she was wearing shorts and a tanktop that was tight around her growing belly. She finished the first box in record time \"buuuuurrrrrrppppp\" Isabella begabrubbing her belly and Nikki was quite surprised. She then said \"Bella, I've been thinking that we've made a mistake, I think I'm gonna go on a diet.\" Isabella turned her attention to Nikki and was stunned by the admission made by her best friend. Nikki never even thought about dieting, she never needed too. Isabella said \" I understand, you can stop if you want but I love it. I should have done this years ago.</span></div></div>",
            "created":1436850000,
            "id":2007892,
            "title":"Gained a little weight"
        },
        "12311212112":{
            "choices":[
                "later",
                "Nikki leaves"
            ],
            "content":"<div class=\"\"><div> <span>(Same author as Sean9718 just made a new account). Nikki was confused and amazed at her friends sudden weight gain, yes she was doing it on purpose but it had pnly been one day.  Isabella says \"Nikki don't leave yet I was gonna make some lunch, won't you stick around?\" Nikki thought to herself \" Whats the worst that can happen\" as she sat down on the couch. \"How's spahgetti and meatballs sound\" hollered Isabella from the kicthen. \"Thats sounds great Bella, how long you think its gonna be\". Isabella answered \" A half hour tops\".</span></div></div>",
            "created":1438470900,
            "id":2015340,
            "title":"Isabella cooks for Nikki"
        },
        "123112121121":{
            "choices":[
                "the next day",
                "later"
            ],
            "content":"<div class=\"\"><div> <span>\"Ahh, that was good Bella, can I have a second bowl?\" Nikki said as she wiped the marinara sauce from her face. She couldn't help it , spahgetti and meatballs was one of her favorite meals and Isabella was a good cook. Isabella went into the kitchen and filled up the bowl a second time, gave  it to Nikki and she devoured it. Nikki sat there on the couch moaning with pleasure, she had never eaten more than one bowl in her life. She got up, grabbed her keys and said \"See you tomorrow Bella, what time should I pick you up? Bella responded \"9:30 is good our shift doesnt start till 10:30 so we can getvsome breakfast on the way.\" Nikki smiled exited out the door and hopped on her car, she drove home and on the counter was another note. This time it was from her mother, it read \"Nikki, going to the store tomorrow, is there anythong you want me to get for you. Let me know, Love Mom\". Her mother knew she could doher own shopping but always offered so she could still help her daughter. Nikki changed into her pajamas and went to bed.</span></div></div>",
            "created":1438777740,
            "id":2017104,
            "title":"later"
        },
        "1231121211211":{
            "choices":[
                "Nikki feeds Bella",
                "Nikki wants to be the same size as Bella"
            ],
            "content":"<div class=\"\"><div> <span>The next morning Nikki wole up and showered, she got dressed and drive to work. When she got there she didnt she Isabella, so she called her. \"Hello\" answered Isabella, Nikki said \" Bella where are you l, your gonna be late for work?\" Isabella chuckled and said \"No I'm not, I called out sick today, I'm gonna stuff myself\". Nikki was confused this whole weight gain thing was going way further than she thought it would. She repiled saying \"Ok I'll see you later, after my shift ends.\" She hung up and thought about her binging best friend, she worked from 9 to 4:30 and drove over to Bella's house. She pulled up and rang the doorbell, Bella answered and Nikki was shocked. Her friend had a belly twice the size of her own, and she was a lot more slobby thrn before. Isabella said \"Hey Nikki, whats up.\" She was eating one of the boxes of pastries. Her belt was reaching its limit, it was wrapped tigthtly around her expanding waistline. In 4 days she had gained 10 pounds. She was burping and farting up a storm and laughed at every one.</span></div></div>",
            "created":1439466600,
            "id":2020433,
            "title":"the next day"
        },
        "12311212112112":{
            "choices":[
                "She is happy",
                "She wants something more"
            ],
            "content":"<div class=\"\"><div> <span>Nikki joined her friend on the couch and dug in, she ate half the box pf patries and took another full box. She had chocolate all over her mouth and cheeks. Isabella continued tobbe slobby but to her surprise Nikki didn't care. They finished 5 boxes between them and Isabella belched \"buuurrrrrpp\" and said \"Oh that felt great, so Nikki what are you doing tomorrow?\" Nikki remebered the reason she cane over. She replied \"Bella if you skip more days of work you'll get fired.\" Belka responded \" So? Nikki we are 22 year old girls we have time to hangout and binge. Most girls our age are still in college, we are ahead of the game. Nikki left shortly after, got home and went to sleep. The next morning Nikki woke up and noticed her pajama bottoms were tighter than they were last night. She walked over to her mirror and took of her close and examined her naked body. Her face was the same but her body had grown. Her breasts were slightly bigger and were straining her bra. Her belly was round like a basketball but soft. Her legs were chunkier but her booty was the noticeable change. She had always had a bigger butt, and she loved it. Her booty was bigger that yesterday, it was swallowing up her thong and joggled with the slightest movement. She went too the scale and it read 155lbs.</span></div></div>",
            "created":1440730980,
            "id":2026536,
            "title":"Nikki wants to be the same size as Bella"
        },
        "123112121121121":{
            "choices":[
                "lets feed eachother",
                "Nikki tells Bella a secret."
            ],
            "content":"<div class=\"\"><div> <span>\" I feel so sexy, look at my huge booty\", Nikki said spanking her butt. She calls Bella and says \"Hey want to meet up today?\" Bella replied \" Sure, can you come by my house?\". Nikki said \"Sure I'll be over soon, we are gonna eat so much food and we will get so fat.\" Nikki drives over to Bella's house and rings the doorbell. Isabella answers and Nikki gets a fuzzy feeling in her stomach. Isabella outgrew the tanktop she was wearing the day before and her breasts were spilling out of the tanktop. Her pajama bottoms were tightly caresses her newly formed curves, her thighs and calves were squeezed into the tight pajama bottoms. Isabella said \" Hey Nikki, whats up... Buuurrrrpppp\". </span></div></div>",
            "created":1442782440,
            "id":2037487,
            "title":"She is happy"
        },
        "1231121211211212":{
            "author_id":"harrythefeeder",
            "author_name":"harrythefeeder",
            "choices":[
                "Wanting to gain to immobility ",
                "Being attracted to isabella "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is the secret?</span></div></span></div>",
            "created":1500498660,
            "id":2356260,
            "title":"Nikki tells Bella a secret."
        },
        "13":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Boobs and Belly",
                "Spread evenly ",
                "Belly",
                "Boobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will majority of her blubber go?</span></div></span></div>",
            "created":1344402000,
            "id":1400601,
            "title":"Madison"
        },
        "131":{
            "choices":[
                "They go to the food court ",
                "They go to a candy store",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>     Madison was sitting in math class bored as bored can be. She had been held back for two years so she is a Sophmore. \"Omg I have got to see Mike when I like get outta here and oh! I have got to go to the mall to get those <br>\r\nshoes.\" Madison thought to herself. Madison then leant over to her friend Tina who was equally intelligent. \"Hey Tina do you have something sweet I'm so hungrryy.\" Madison whispered. \"Sure I got a Kit-Kat.\" Tina giggled. \"Mmm I would like some of your 'Kat' hahaha.\" Madison replied while licking her lips. Tina handed Madison the Chocolate who quickly opened the wrapper and took a bite from it.<br>\r\n<br>\r\n\"Ms Madison perhaps you can answer this question since you are in a talking mood.\" the teacher said irritated. \"Uhh, ok.\" Madison said nervously munching on the Kit-Kat. \"What is two thirds devided by one half?\" He asked. The minute he was done asking the question Madison had zoned out. Her eyes crossed and she was drooling. Luckily for her the bell rang. \"Madison, Madison wake up.\" \"'Snort' oh did I fall asleep again?\" \"Cmon let's go to the mall.\" \" Okay! I'm still so hungry! I have got to eat something.\" the two girls left the classroom and the teacher just shook his head<br>\r\nSo what happens next? </span></div></div>",
            "created":1364446800,
            "id":1559473,
            "title":"Butt, Hips, Thighs and Belly"
        },
        "14":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Beth",
                "Taylor",
                "Anita",
                "Diana",
                "One more set of girls?"
            ],
            "content":"<div class=\"\"><div> <span>Beth is a Caucasian with ginger hair that falls just below her shoulders. She is 110 pounds and 16 years old. She usually wears form fitting blouses and short shorts. She's not the typical ginger though. She doesn't have a freckle on her body. She loves to eat varieties of donuts and strudels. She has a very large addiction to them and her boyfriend doesn't approve. Will she kick the addiction or will she cave in and eat to her hearts content? <br>\r\n<br>\r\nTaylor is a 15 year old Caucasian and has short brown hair that hangs down just above her shoulders and a single blond wave on the left side of her hair. She is skin and bones at the moment weighing in at 90 pounds and being only 5 feet tall. She is in love with dancing whether it be Contemporary or Hip Hop and uses that to keep her in shape. She never over eats and and when she actually does eat she only consumes fruits and vegetables to keep her body in shape. Will Taylor keep her body or will she gain weight after getting suspended from dance? <br>\r\n<br>\r\nAnita is 21 years old and is half Filipino and half Mexican. Her black hair falls down just below her shoulders. She weighs 119 pounds and likes to wear revealing tops and mini skirts. She is a total bitch to basically everyone with the exception to any cute guys and her best friend Kayla. She is in love with Mexican food ranging from Tacos and Quesidillas to Churros. Her favorite hobby is shopping (is that even a hobby?) due to the tons of cash given to her by her dad who invented the new fast food place known as \"Stúffed Sauságe\". Will she be able to keep her slender body after her dad adds in Mexican food to his restaurants menu? <br>\r\n<br>\r\nDiana is a 32 year old single mother with short brown hair falling down to chin height. She currently weighs 130 pounds due to her three children she just gave birth to. At the moment she usually wears baggy shirts and sweats due to the lack of a boyfriend/husband. She has three children in total. Two boys and one girl. She used to play Tennis but now that she's by herself and raising three kids she doesn't have the time. Her favorite food is Ice Cream. She doesn't care which flavor she just loves the texture and feel of it. Will she cave in and gain more weight after a certain dentist takes interest in her?</span></div></div>",
            "created":1348030800,
            "id":1430887,
            "title":"More?"
        },
        "141":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Boobs and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where's majority of her blubber going to go?</span></div></span></div>",
            "created":1348030800,
            "id":1430888,
            "title":"Beth"
        },
        "1411":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Get seconds. It couldn't do that much damage.",
                "Leave. She loves Logan and wouldn't want him upset. ",
                "Grab another Smothie. But something goes wrong while they're making it.."
            ],
            "content":"<div class=\"\"><div> <span>Beth got out of bed and took a quick shower. She got dressed and put on her makeup for school. She walked down the stairs to grab her breakfast. As she stepped into the kitchen she saw the box of Donuts on her counter that haunts her. She absolutely loves Donuts, but her boyfriend Logan doesn't allow her to eat any because of the fear she will gain weight. Her habit couldn't be that bad, could it? She shrugged it off and took a Boston Creme out of the box. She squealed in joy. Logan only let her eat one a week. She was usually quite truthful about it but when she had a big urge she might eat one extra. Maybe even a couple. She walked to her door and grabbed her book bag for school. She licked the thick custard off her lips as the bus approached. The doors opened and she hopped on. Lucky for her she was the last one to be picked up so she didn't have to wait long until she got to her destination. As soon as Beth entered the school she checked what the cafeteria was serving for lunch. She sighed when she saw the words <i>Baked Potatoes and Asparagus</i> on the list. The only thing she liked about potatoes was Chips and French Fries. She didn't like Asparagus in general so she decided to go to the Starbucks when lunch starts. The first half of the day went by quickly. She learned about Elements in Science, Circumference in Math and how to shoot a Basketball \"properly\" in Gym. Next was lunch her favorite part of the day. But there was one thing she dreaded. How Logan followed her around making sure she didn't eat to much. If she was going to make it to Starbucks she was going to have to sneak away while he talked to his football friends. They were talking about the rivalry between Notre Dame and Florida State. \"I have to go the bathroom,\" Beth interrupted obviously bored. She walked out of the cafeteria and out of the school doors to the Starbucks located right next to the school. She walked in and was instantly hit with a delightful smell. Lucky for her, there wasn't a big line up so she got to order quickly. When it was her turn she ordered a BLT Sandwich, a Orange Mango Smoothie and a Long John Donut. She sat down with her meal and chowed down. She finished her meal quickly and felt a slight rumble in her tummy. \"I'm still hungry?\" she thought. She thought about ordering seconds but if Logan found out how much she ate he would freak out. She finally decided to..</span></div></div>",
            "created":1348117200,
            "id":1431887,
            "title":"Mmm, Starbucks."
        },
        "142":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Boobs and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where is most of her fat going?</span></div></span></div>",
            "created":1348030800,
            "id":1430892,
            "title":"Taylor"
        },
        "1421":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Does Taylor get a second chance?",
                "Does Ms. Bolen suspend her for three weeks and ban her from Regionals?",
                "Does Taylor get suspended for three weeks and get to compete at Regionals?"
            ],
            "content":"<div class=\"\"><div> <span>Taylor was in her dance class practicing her big number that would decide who's would compete at Regionals. As she continued to dance the most bitchy girl Taylor knew came up to her to pick shit. \"Nice dance moves are you gonna try out for Americas WORST dancer?\" Amelia said laughing. <br>\r\n\"Haha, great insult. Why don't you come try that again when you learn what Contemporary is,\" Taylor replied annoyed. <br>\r\n\"Actually I know what Contemporary is I just don't want to give it away to some brain dead loser like you,\" Amelia replied smirking. Taylor laughed to herself thinking of how pathetic Amelia was being. She went back to her dance and just a few seconds after Amelia came running up and \"accidentally\" tripped Taylor. Taylor stared at her in rage. She got up and sucker punched Amelia straight in the cheek. Amelia fell down and clenched her face \"crying\" to get the teachers attention. <br>\r\n\"Ms. Bolen, Taylor just punched me in the face for no reason,\" Amelia forced out through her \"real\" tears. An argument broke loose and finally Ms. Bolen stopped all conversations with three words.<br>\r\n\"Taylor your suspended,\" Ms. Bolen yelled in rage. Taylor was heart broken this was her one big chance to impress any talent scouts at Regionals and she might not be even allowed to compete. Taylor looked at Amelia who was grinning so wide that you could probably fit two whole oranges in her mouth. Taylor dropped to the floor and punched her again. This time though Taylor saw a piece of Amelias tooth tumble onto the dance floor. Ms. Bolen then grabbed Taylor's arm and dragged her out of the studio. </span></div></div>",
            "created":1348030800,
            "id":1431377,
            "title":"Dance conflict."
        },
        "14213":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Taylor makes a pig of herself at dinner.",
                "Taylor eats slightly more then usual. "
            ],
            "content":"<div class=\"\"><div> <span>\"That was a terrible thing you did in there,\" Ms. Bolen said ashamed of her student. <br>\r\n\"You don't understand what Amelia does to me in there. She consistently picks fights. She only picks them with me though. It isn't fair because I'm the only one who gets in trouble. It isn't fair,\" Taylor replied sadly. <br>\r\n\"I know it isn't fair. I am going to have to punish you though. If I don't Amelia will get her parents to come talk to me and all hell would break loose. Your a really good dancer. Amelia only does this because she's jealous of you,\" Ms. Bolen replied. Taylor only could sigh in response. She walked out of Ms. Bolens office and noticed Amelia was no where to be seen and a small puddle of blood with a tooth beside it. She smirked and walked out the Dance Studios doors. <br>\r\n<br>\r\nTaylor dropped down on her couch and turned on her T.V. <i>What am I supposed to do for three weeks? Focus on school? Nah that's boring.</i> Taylor thought to herself. She sighed again and grabbed a carton of ice cream and a spoon. She layed back on the couch and shoveled spoonful after spoonful into her mouth. She soon found herself scraping the bottom of the carton with her spoon. <i>It was only like half full when she grabbed it, right?</i> Taylor thought. She placed the carton on the floor and stifled a small belch. She layed her hands on her belly which was now bulging slightly and watched T.V till dinner was ready.</span></div></div>",
            "created":1348894800,
            "id":1437157,
            "title":"Punishment!"
        },
        "143":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips,Thighs and Belly",
                "Boobs and Belly",
                "Spread Evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will majority of her weight go?</span></div></span></div>",
            "created":1348030800,
            "id":1430894,
            "title":"Anita"
        },
        "144":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Boobs and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will most of her blubber go?</span></div></span></div>",
            "created":1348030800,
            "id":1430897,
            "title":"Diana"
        },
        "1443":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Head to the mall?",
                "Go home and stuff herself with ice cream?",
                "Go grocery shopping?"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom! Mom, wake up! You need to take us to school!\" Emily Diana's 8 year old daughter exclaimed quickly. Diana rose with yawn and stretched out her arms. <br>\r\n\"Give the keys to Evan (her 12 year old son) and wait in the car. I'll be down soon,\" Diana replied in her groggy state.<br>\r\n\"Whatever,\" Emily grabbed the keys and sped out of the room. Diana stepped out of her bed and made her way to her closet to throw on the usual gray sweats and blue shirt. She was lucky that when her husband passed away he had life insurance. In a combination of that money, money from friends/neighbours and money both her and her deceased husbands parents provided her with enough to last her 4 years without working. She would have to do some light spending on food and such but for basic necessities she was pretty well off. Her kids were part of a program for struggling parents. It provided tuition for their school careers from Pre-K to Grade 12. She lived in a two story house with each of her kids having their own room. The one surprising thing was she was still fairly skinny even through all the stress. Her breasts were a fairly small B cup. Her arms and face remained thin with only a slight thickness to them both. Only a hint of a double chin appeared in her more unflattering positions. Her stomach had a slight bit of pudge on it just ever so slightly lipping over her tighter pants. Her rear was the  largest portion of her body but not by much. It bulged outward to give any passer by a nice show or a bout of jealousy. She was always oblivious to her stunning good looks she had. Mainly because of the three children inside of her. She felt as though it had left her body disfigured in a way her self confidence had been flushed and it showed in the way she dressed. She wore baggy clothes the majority of the time even when going out. She only dressed up for special occasions with friends/family. As she dressed in her clothes she trudged downstairs and into her car. Two of her children sitting in the back patiently for their mother to arrive. Her third child Casey was 17 years old. She was quite independent and most often slept at her boyfriends house. She shared the same colour of hair as her mother but in a different style. She let hers flow down her shoulders and back. Also like her mother she had stunning good looks and was currently getting a scholarship for cheer leading. <br>\r\n\"Finally mom! We're gonna be late!\" Emily yelled towards her mother.<br>\r\n\"Don't worry we'll make it. Buckle up,\" Diana replied calmly as she began to pull out of her driveway and toward the school. She dropped off the kids and began on her trip home. Does she..</span></div></div>",
            "created":1386738000,
            "id":1706553,
            "title":"Spread evenly"
        },
        "14431":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Eat at the food court and have all she can afford to get all up to ice cream",
                "Eat at the all-you-can-eat buffets from lunch/dinner to desert foods"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When she gets there, what does she do?</span></div></span></div>",
            "created":1437627600,
            "id":2011499,
            "title":"Head to the mall?"
        },
        "144311":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "This is it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To choose this would be to go with this and up to the ice cream. To do so, click here.</span></div></span></div>",
            "created":1437670500,
            "id":2011500,
            "title":"Eat at the food court and have all she can affo..."
        },
        "144312":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "This is it.",
                "Or how about a different direction."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To choose this is to combine both previous options. Click here if it's what you want.</span></div></span></div>",
            "created":1437670560,
            "id":2011501,
            "title":"Eat at the all-you-can-eat buffets from lunch/d..."
        },
        "14433":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "A very stuffed Diana has finished half the food she had bought",
                "Casey comes home to find her mother asleep on the couch"
            ],
            "content":"<div class=\"\"><div> <span>After dropping the kids off Diana began to head off towards the local Target. She had run out of Ice Cream and was also in desperate need of other snack food. As she arrived her stomach growled with sharp pains. It demanded food as she had missed her breakfast in the rush to get her children to school. She first made her way to the Frozen Treats section. She grabbed three tubs of ice cream and tossed them in her cart. She then made her way to the chips section and grabbed a family size bag of original. She also grabbed a 12 pack of Coke in case she became thirsty. Despite her terrible eating habits her high metabolism kept her from gaining to much weight. As she made her way to the cash register to pay for her fatty goods she noticed a sale on exercise  balls. Her hand immediately drifted to her ever so slightly pudgy stomach. She picked one up just in case her weight ever got too out of hand. She then began too pay and made her way back to her car. Driving off back to her home. Her stomach growled once more as she thought of all the delicious snack foods she purchased. She could not wait to dig into her fatty foods. <br>\r\n<br>\r\nAs Diana arrived home she briskly walked into her home and pulled out a spoon as she dug into her first tub of ice cream. She plopped her lithe frame atop of her black leather couch and quickly turned on the TV. <br>\r\n<br>\r\n3 hours later ...</span></div></div>",
            "created":1388293200,
            "id":1716746,
            "title":"Go grocery shopping?"
        },
        "144331":{
            "author_id":"megatron840",
            "author_name":"Megatronus Khan",
            "choices":[
                "Yes",
                "She actually has finished all of the food"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Has she? Or has she eaten it all?</span></div></span></div>",
            "created":1442598540,
            "id":2036240,
            "title":"A very stuffed Diana has finished half the food..."
        },
        "144332":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "1 week later. Lets see how the mother daughter duo is doing",
                "The kids arrive home and Diana wakes up"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom? Mom I'm home!\" Casey yelled to her mother. The only response she got was a loud snoring which came from the living room. Casey entered the living room only to see her mother bloated and fast asleep on the couch. 2 empty tubs of ice cream, 5 empty cans of pop, and a half eaten bag of chips surrounded her. Her stomach bloated up from her shirt and her hand rested lazily atop it. Casey shook her head in disgust. Her mother had become an eating machine. She began to clean up the mess. She vacuumed the crumbs off the floor, wiped down the stains off the table, and put away the remaining food. Casey let out a loud sigh as she remembered when her mother was the definition of fit. Now she had become pudgy and slobbish. Casey could only hope that she would not follow that path. She needed her body to get into a cheerleading college. She was on a strict diet to ensure her fitness. Her B cup breasts were t anything to showboat about but they were decent. Her stomach didn't quite have abs but it was still as flat as it could get. Her rear, just like her mothers, was her best feature. It was quite the sight in her dainty cheerleading skirt. Casey grabbed a blanket and layed it atop her snoozing mother. Casey began to leave until she realized that it was almost time to pick up her younger siblings. With only an hour left and her mom not seeming to be waking up anytime soon. Casey decided to wait at home for an hour and pick up her brother and sister later. Come to think of it those chips sounded really good right about now. <br>\r\n<br>\r\n---- 45 minutes later ----<br>\r\n<br>\r\n<b>\"URRRRRRRRRRRRRP\"</b> Casey began to blush furiously as she let loose a very unladylike belch. \"I really hope this doesn't become a habit,\" Casey said to herself. She pulled out her phone to check the time and realized she should probably go to pick her siblings up. As she heaved herself from the chair she let out a quick fart. Her hands drifted to her bloated belly and rubbed it soothingly.  </span></div></div>",
            "created":1388293200,
            "id":1716793,
            "title":"Enter Casey"
        },
        "145":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Cassie",
                "Samantha",
                "Clara"
            ],
            "content":"<div class=\"\"><div> <span>Cassie is a 17 year old Asian with ginger hair that hangs down past her shoulders. She is captain of the cheer leading team and rival of Madison. She is very slender weighing about 107 pounds. She loves rice and wears only the skankiest clothes there is. Her favorite hobby is (aside from cheerleading) putting Madison down. Will she continue to stay skinny or will she gain enough weight to end her cheerleading career?<br>\r\n<br>\r\nSamantha is a tall 23 year old Caucasian with blonde hair that hangs halfway down her neck. She currently works at Hooters and has very big breasts. Her cup size is DD. She has a trim waist and a firm butt. Her weight is currently 117 pounds. She most often wears her Hooters shirt tied back with an elastic and black short shorts. On the inside she's a kind and good hearted person but on the outside she acts really flirty and bitchy so she's not used by guys. Will she take a new love for the food at Hooters or will she stay the same?<br>\r\n<br>\r\nClara is a 14 year old Irish Caucasian girl with brown just below shoulder length hair. She has the tips of her hair dyed pink and she is about 5'7\" tall. Her best feature is most deffinitely he butt and hips. Her thighs are a little on the thick side as well which she despises. She also has the teensiest bit of pudge on her belly. She currently likes a guy named Matthew. The problem is that Keara also likes this boy. Clara is a very good hearted person and best friends with Keara, Chloe and Darian. Then when she got back from vacation she met Matthew. She most often wears tights or skinny jeans as well as a tank top or blouse.</span></div></div>",
            "created":1348030800,
            "id":1430890,
            "title":"The Last Set"
        },
        "1451":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Breasts and Belly",
                "Spread Evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will majority of her chub go?</span></div></span></div>",
            "created":1350709200,
            "id":1450292,
            "title":"Cassie"
        },
        "1452":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Breasts and Butt",
                "Breasts and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will majority of her fat go?</span></div></span></div>",
            "created":1350709200,
            "id":1450291,
            "title":"Samantha"
        },
        "1453":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Boobs and Belly",
                "Spread Evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will most of her blubber go?</span></div></span></div>",
            "created":1350709200,
            "id":1450293,
            "title":"Clara"
        },
        "14531":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Clara walks up to him and introduces herself",
                "Keara, Clara and Chloe hang out after school. (Commence the first stuffing!)"
            ],
            "content":"<div class=\"\"><div> <span>Clara had just gotten back from her vacation in Maui and stood there looking in her mirror as she checked herself out. She didn't think she was good enough. She looked at her breasts and compared them to her bum. <b><i>Couldn't any of this fat be moved onto something a little more attractive, like my breasts?</i></b> she thought to herself. She lifted up her bum and felt how heavy it was. Nothing abnormal really. It wasn't necessarily massive. Nothing to rival say Kim Kardashian or Jennifer Lopez. Just a bit bigger then the average girls. Some people were just born with a big butt. Unfortunately for her, she was one of them. Well this was her opinion. She placed her hand on her belly and felt something odd. It was slightly soft. Nothing noticeable, it would take a very thorough investigation to even notice the extra pudge. Nonetheless it was still there and Clara was panicking. <b><i>This wasn't here yesterday!</i></b> she screamed in her head. She quickly started trying on her various shirts and realized they all fit fine. She breathed a sigh of relief. Soon enough she looked at the clock and decided to get ready for school. She put on a white and pink T-shirt that was suppose to be tight on her frame. She also threw on a pair of Jeggings and clasped the button together. She turned around and noticed her large rump sticking out behind her. She sighed. Clara then went downstairs picked up her back pack and left towards the bus stop. <br>\r\n<br>\r\nClara arrived at school. She looked around and quickly found her friends Chloe and Darian. She eyed Chloe noticing she was quite chubbier then before. She had much chubbier cheeks and what were becoming quite beefy arms. She now had about golf ball sized love handles and pudgy muffin top to match. Her boobs had grown slightly seeming as if it moved up a cup size. Her butt had grown pretty wide as well. Her belly still bigger but her butt was second via the fattest part of her body. It wasn't exactly starting to rival even Clara's though. Her outfit did nothing to compliment her size either. She wore a blue tank top that seemed she needed to size up and green tights that clung to her thicker hips and thighs. While Darian was as muscular and handsome as ever. Clara gave Chloe and Darian a big hug nonetheless. She then saw Keara walk in the school. She had grown quite chubby as well. Not any fatter then Chloe but about the same. Just the weight was distributed differently. Keara had slightly smaller breasts as well as a smaller face. But she had beefier arms and thicker thighs. Clara couldn't necessarily see her stomach due to Kearas current outfit choice but she assumed that it was quite big as well. Keara also had more blubber placed on her bottom. It was about as big as Clara's if not bigger! She was wearing a pair of skinny jeans and.sweater that hid the bulge that was he stomach but accented her slightly bigger breasts. Clara gave Keara a big hug as well. She really missed her friends. They talked for a while before Darian noticed some of his track friends enter the school and went to join them instead. The remaining girls talked about random stuff whether it be clothes or boys, up until Clara noticed a new boy walk past her. Considering she missed the first two months of school she had no idea who he was. Clara quickly interrupted Chloe's rant about Orlando Bloom and asked \"Whose he?\". Keara and Chloe followed Clara's gaze and saw she was staring at Matthew Morgan. <br>\r\n\"Oh he's new to the school. I'm surprised no ones tried to ask him out yet. He's a bit of hunk if you ask me,\" Chloe replied. Hunk was right in Clara's eyes. He had his brown hair styled in a faux hawk. His muscles weren't as prominent as say Darians but they were definitely there. His white V neck covered them but she assumed he had a six pack of abs and a v line to match. He also had the most loving face she had ever seen. <br>\r\n\"He's gorgeous,\" Clara muttered out love struck. Little did she know Keara was also in awe. How could she have not seen him before. They watched him as he walked up to Darian and his friends. <b>He has to be mine</b> Keara and Clara thought at the same time. <br>\r\n</span></div></div>",
            "created":1372568400,
            "id":1620570,
            "title":"Who dat boy be?"
        },
        "145312":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "The next day Keara helps Clara with Matt but not really!"
            ],
            "content":"<div class=\"\"><div> <span>Clara still not used to her classes was having some trouble remembering where they were. She was lucky to even find her first one which was Chemistry. As she walked in she noticed that the cute boy from before was in her class. She was then pleasantly surprised to find out that she was lab partners with him. She quickly sat down on the stool ignoring how her bottom was overflowing it. Using her phones reflection, Clara quickly fixed her make up, hair and straightened out her clothes. She then saw Matt walk in. <b>God he's perfect</b> Clara thought to herself. She quickly fixed her posture and introduced herself to him. \"Hi, my names Clara. What's yours?\" She said in her adorable accent.<br>\r\n\"My names Matt.\" He responded with a pearly white smile. Clara almost fainted. <br>\r\n\"He even sounds like hunk.\" She said out loud accidentally. <br>\r\n\"Umm, what?\" Matt said laughing. Clara swore at herself in her head. How dare she embarrass herself like that.<br>\r\n\"Nothing,\" She responded blushing like crazy. Chemistry flew by for Clara meaning her time with Matt was up for now. She could only hope he would be in another one of her classes. As she packed up her stuff and left she ran into Chloe on the way back. <br>\r\n\"Hey do you want to come over tonight? Me and Keara are planning on watching Dear John. My dad will be making barbecue.\" Chloe beamed. <br>\r\n\"Sure, I have to talk to you guys about something anyway,\" Clara responded. They hugged before parting ways. <b> Now I just need to figure out where my next class is. </b> Clara said to herself.<br>\r\n<br>\r\nChloe, Keara, and Clara were all sitting on the couch swooning at Channing Tatums gorgeousness (is that a word? I think it is). After the movie ended Chloe's father finished the barbecue. Making a plate of 6 smokies, 6 hamburgers and a plate of fries for the three girls and Madison (Chloe's sister if you didn't know). They quickly dug in, Clara grabbing a smokie to start off, Chloe grabbing a burger and loading it with toppings as well as Keara doing the same. They then saw Madison walk down the stairs clad in jeans that showcased her thick thighs and large bottom which was oozing out of a rip on her left cheek and a pink tank top that looked like it must have been three sizes to small as it exposed her round pale stomach and expanding breasts. As she sat down at the table her belly formed into three fat roles (Large one on bottom followed by two smaller ones on top) and sat over top of her crotch. She quickly grabbed two burgers and a sausage as well as a huge plate of fries while as she devoured them quickly and went back up stairs to her room but not before letting out a rather large belch. \"Geez, Madison's gotten fat huh?\" Keara asked not taking in the weight she had recently gained. <br>\r\n\"Yeah I know she just lays down and eats all day now. It's kind of depressing.\" Chloe responded. The trio then finished their first round of the meal before loading up their plates with more. Clara was already starting to feel the effects of the meal as her lithe stomach was bloating up against the button of her jeggings. She swiftly unbuttoned them before starting her second part of the meal. As she slowly finished her hamburger she knew she couldn't take another bite. She pushed her plate away as she groaned. \"No more. I feel like I'm gonna explode.\" Clara said breathing hard. Chloe and Keara had just finished their third and devoured the fries as they rubbed their own stuffed bellies. <br>\r\n\"Come on Clara. It's just one last smokie.\" Keara said wiping her mouth with her napkin and finishing the rest of her sprite. Chloe laughed as she chanted out \"Eat, eat, eat!\" Clara pulled up the last smokie and slowly finished it. She laid back in defeat whilst letting out a small burp. Chloe and Keara cheered in satisfaction. Chloe then remembered that Clara had something she wanted to talk to them about. <br>\r\n\"So what was it you wanted to tell us Clara?\" Chloe questioned as Keara picked up her last fry. <br>\r\n\"Oh that's right.\" Clara remembered as she sat up with difficulty. \"I wanted you guys to know I'm with Matt in Chemistry, Photography and Phys. Ed.\" Upon hearing this Keara squashed the fry in her hand a jealousy ran through her veins. \"I was also hoping you guys could kinda 'wing girl' me if possible.\" Clara said hopefully.<br>\r\n\"You bet your butt we will.\" Chloe laughed. \"Right Keara?\" Keara could only nod in response as she forced a smile upon her lips. <br>\r\n\"Thanks guys your the best friends ever.\" Clara squealed in delight. \"I'm gonna ask Darian to help me out as well tomorrow.\" <b>I want to send Clara back to Maui right about now.</b> Keara thought. <b>Comes back thinking she owns Matt. If she wants a 'wing girl' then I'll give her a wing girl...</b></span></div></div>",
            "created":1376715600,
            "id":1647680,
            "title":"Clara's first stuffing."
        },
        "1453121":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "After Chemistry Keara Takes Action",
                "During Cemistry Clara Gets To Know Matt"
            ],
            "content":"<div class=\"\"><div> <span>Keara was furious. Clara just had to show up and like the exact same boy as her. They did both fall for him at the same time but still. Why did life have to be so difficult? Keara was now forced to choose between Matt and one of her best friends of almost 4 years now. She couldn't handle that kind of a decision just yet. For now she was just going to have to keep them apart. <br>\r\n<br>\r\nAs the night ended, Keara and Clara waved goodbye to their friend and began to head home. Clara was ecstatic. She couldn't wait for school just to see Matts face again. As she arrived back at her home she quickly waddled, due to her stuffed state, into her rooms do shut the door. As she peeled off her tight clothing she absentmindedly rubbed her stomach. Clara then began to get ready for bed as well as began to think of some cute couple names between her and her crush. Mara? Clatt? She decided to think of that when the time came. Clara then crawled into her bed and hoped for a good day tomorrow.<br>\r\n<br>\r\n\"Okay class we're getting a seating plan so I don't want to hear any complaints,\" Mr. Ackerman called out to the rest of the class. As he rolled through the list he finally came across Clara's name. \"Clara And Matthew you two are sitting here,\" He spoke as he pointed toward a table in the back right corner. Clara almost passed out. She was on Cloud 9. She moved as fast as possible to the table and watched as her partner arrived. Clara quickly fixed her hair just in time for Matt to arrive. <br>\r\n\"Not only are these your seating partners, but they are also your permanent lab partners so you better make sure you get along well with them.\"</span></div></div>",
            "created":1398661200,
            "id":1787994,
            "title":"Luck Is on Clara's side"
        },
        "15":{
            "author_id":"shaky",
            "author_name":"Cato",
            "choices":[
                "Trinity",
                "Layla",
                "Liz",
                "Radika",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span>Trinity is a tall, incredibly thin Asian girl that is pretty much flat everywhere, with no hint of a butt, boobs, or a stomach. She's 5'10\" and only weighs 125 pounds (which is incredibly skinny for that height). She has just-past-the-shoulder length black hair and dark brown eyes, and is a senior in high school at the age of 17. Trinity is the president of Math Club, Model United Nations, and Speech and Debate, and is the treasurer for the Youth Congress club. Trinity is a straight A student, and combining her incredibly busy schedule of studying and extra-curricular activities, is finding less and less time to exercise and prepare her own meals...<br>\r\n<br>\r\nLayla is a short Hispanic girl with black hair kept in a ponytail, and beautiful green eyes. She is only 5'1\", and has a very big butt, and weighs 130. She is going to try out for her high school soccer team, though she isn't sure is she'll make it. She is 15 and is starting off her sophomore year. She just got a new job at a fast food place, but will the restaurant's employees-eat-free policy affect her waistline?<br>\r\n<br>\r\nLiz is a 5'6\", 120 pound white girl with curly brown hair and blue eyes. She is entering her freshmen year of college, and is 19 years old. She was the head editor for her school newspaper back in high school, and wants to be the same for her college newspaper. She is going to major in journalism, and wants to make a name for herself. But will her roommate, a crazy, party loving, Culinary-major Latino girl named Vanessa help Liz reach the Freshmen 15- and beyond?<br>\r\n<br>\r\nRadika is a 25 year old Indian scientist. She is 5'8\" and 125 pounds, with black hair and short hair. She is partnered with Dr. Darryl Smith, last year's Nobel Chemistry prize winner, and they are trying to study the effects of rapid weight gain on a person. However, when no one volunteers to be the test subject, Dr. Smith takes matters into his own hands... with Radika becoming the test subject...</span></div></div>",
            "created":1350709200,
            "id":1450399,
            "title":"Create your own!"
        },
        "151":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Breasts and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will most of her fat go?</span></div></span></div>",
            "created":1350795600,
            "id":1451158,
            "title":"Trinity"
        },
        "1511":{
            "author_id":"shaky",
            "author_name":"Cato",
            "choices":[
                "Trinity lets Lisa order for her, since she's never been her before.",
                "A special promotion leaves Trinity with more food then she planned for...",
                "Lisa isn't hungry, so Trinity eats her meal for her."
            ],
            "content":"<div class=\"\"><div> <span>\"Trinity, we don't have TIME to go home and get your mom to make some stir-fry, I'm starving and the Debate club meeting starts in 20 minutes! Just stop at McDonald's this one time- it won't kill you, promise!\"<br>\r\n<br>\r\nTrinity Chang turned and glared at her best friend, Lisa Connors, the flaming-haired Irish girl with pale skin, blue eyes, and tons of freckles. \"But it's just so bad for you, Lisa... I don't want to get fat, either...\" said Trinity softly.<br>\r\n<br>\r\n\"Aw COME ON!\" bellowed Lisa. \"It's this ONE TIME. ONE fast food meal ain't gonna kill ya, you know. Just this ONCE!\"<br>\r\n<br>\r\nTrinity sighed. \"Fine, Lisa, just this once we can go, simply because I'm kinda hungry too, and we just don't have time...\"<br>\r\n<br>\r\nTrinity pulled off the road and into the McDonalds drive-thru, where...</span></div></div>",
            "created":1364533200,
            "id":1559833,
            "title":"Butt, Hips, Thighs and Belly"
        },
        "152":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Boobs and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will most of her fat go?</span></div></span></div>",
            "created":1350795600,
            "id":1451159,
            "title":"Layla"
        },
        "1522":{
            "author_id":"dr.blonde",
            "author_name":"Blondiehair",
            "choices":[
                "Boobs",
                "Belly",
                "Bothpüpü"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Boobs, belly or both?</span></div></span></div>",
            "created":1474479540,
            "id":2212876,
            "title":"Boobs and/or Belly"
        },
        "153":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Breasts and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will most of her fat go?</span></div></span></div>",
            "created":1350795600,
            "id":1451161,
            "title":"Liz"
        },
        "154":{
            "author_id":"unilimitedline",
            "author_name":"UnlimitedLine",
            "choices":[
                "Butt, Hips, Thighs and Belly",
                "Boobs and Belly",
                "Spread evenly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will most of her fat go?</span></div></span></div>",
            "created":1350795600,
            "id":1451162,
            "title":"Radika"
        },
        "155":{
            "author_id":"doctorsonic",
            "author_name":"DoctorSonic",
            "choices":[
                "Rhianne (16 years old)",
                "Shannon (15 years old)",
                "Create Your Own Girls"
            ],
            "content":"<div class=\"\"><div> <span>Rhianne is a 16 year old girl who is average weight and height. She's got wavy brown hair and has a weakness for marshmallows. She doesn't want to gain, as her boyfriend, Cody doesn't want her to. However after a certain meal, she may have different thoughts about weight. She is also terrible at video games, but has a friend, Adam, who is teaching her to be better.<br>\r\n<br>\r\nShannon is a 15 year old girl is a brunette girl gamer. She's quite thin, but is also has a weakness for chocolates. Her favourite game is Tomb Raider and is average height. She has a very fat friend called Courtney and could tempt her to gain.</span></div></div>",
            "created":1385442000,
            "id":1699379,
            "title":"Other?"
        },
        "1552":{
            "author_id":"doctorsonic",
            "author_name":"DoctorSonic",
            "choices":[
                "Shannon eats 15 large chocolate bars",
                "Shannon only eats 5 chocolate bars"
            ],
            "content":"<div class=\"\"><div> <span>In her Shannon sat on her bed, playing Tomb Raider intensely, with Courtney sitting next to her. Courtney's belly was huge and sat on her giant thighs. Her belly had several rolls on them and jiggled as Courtney got comfy on Shannon's bed, the bed dipping where she was sitting.<br>\r\n<br>\r\nShannon smiled and yelled a triumphant \"YES!\" as she cleared another tomb. \"Just a few more tombs and I'll have 100% completion again.\"<br>\r\n<br>\r\nCourtney munched on some chocolate and said, \"Well done, Shannon. Tomb Raider looks really good. And so is this chocolate. You should try some.\"<br>\r\n<br>\r\nShannon smiled. Courtney was always trying to get her to gain weight, although Shannon always tried to decline. But Shannon thought, just this once, to go along with Courtney's attempts. \"Alright, Courtney. Pass me a few bars,\" Shannon got her shoulder length light brown hair out of her face and grabbed about 3 large bars of chocolate. She bit into the first and felt like she's taken a bite out of heaven. She'd never tasted anything like this chocolate in her life.<br>\r\n<br>\r\n\"Yum,\" Shannon exclaimed and quickly finished her first bar. Shannon forgot about her game and started devouring Courtney's snacks.</span></div></div>",
            "created":1385442000,
            "id":1699394,
            "title":"Shannon: Chocolates and Video games"
        },
        "15521":{
            "author_id":"doctorsonic",
            "author_name":"DoctorSonic",
            "choices":[
                "Continue here (Saturday)",
                "Skip to school/Cadbury's trip (Wednesday)"
            ],
            "content":"<div class=\"\"><div> <span>Shannon lay back on her bed, her stomach aching after the giant bars. \"Ugh. Why did I eat so many? But they were really tasty.\" Shannon's belly was taut and pushed her top up a bit. She rubbed it to ease the aching.<br>\r\n<br>\r\nCourtney smiled and finished her fifth regular chocolate bar. \"They were. Hey, remember we've got that tour at the <i>Cadbury's</i> factory on Wednesday. I'm gonna love it. Imagine all the chocolate we could get.\" She put a hand on her belly and squished it in her hand.<br>\r\n<br>\r\nShannon smiled, finding a new joy in eating however much she wanted, whenever she wanted. She sat back up and grabbed another bar, this time one of Courtney's regular bars.</span></div></div>",
            "created":1385528400,
            "id":1699798,
            "title":"Shannon eats 15 large chocolate bars"
        },
        "155212":{
            "author_id":"doctorsonic",
            "author_name":"DoctorSonic",
            "choices":[
                "Adam mentions her weight gain to Shannon",
                "Adam doesn't mention her weight gain"
            ],
            "content":"<div class=\"\"><div> <span>Adam, waited by the school's main doors for any sign that his friend, and small crush, Shannon, had arrived at school yet. He pulled up the sleeve of his school blazer and checked the time on his watch again. He hadn't seen Shannon since Saturday afternoon when she said she was meeting Courtney for some much needed girl time and had barely heard a word since then apart from Shannon's quick and brief message last night saying: \"Hey Adam. Sorry I haven't been at school, had some stuff I needed to catch up on. I'll meet you outside school tomorrow for the Cadbury's trip. You better not have given my seat up to someone else hahaha.<br>\r\nBtw can you bring some extra food please, cos you love me. Thanx.\"<br>\r\n<br>\r\nObviously she'd meant love me as a joke, but Adam was still perplexed by her strange request of extra food. His question didn't take long to be answered as he stared up from his watch and looked towards the front of the school courtyard.<br>\r\n<br>\r\nShannon walked over to him giving a smile and wave as see walked, acting like everything was the same as usual. This was not the case, however as Adam could see that Shannon had packed on quite a few pounds since Saturday with her school shirt stretch in a bit exposing a bit of her new chubby muffin top. Her thighs were also slightly larger than before and her cheeks had definitely gotten puffier.<br>\r\n<br>\r\n\"Hey Adam, how was your weekend?\" She said, smiling.</span></div></div>",
            "created":1446020820,
            "id":2053741,
            "title":"Skip to school/Cadbury's trip (Wednesday)"
        },
        "1553":{
            "choices":[
                "Tonya",
                "Connie",
                "more girls"
            ],
            "content":"<div class=\"\"><div> <span>Tonya Baker is a 14 year old girl who is african american. Shes very tall for her age and very soft all over. Her weakness is meatloaf and potatoes, cabbages and so on. her stomach looks flat but it is very very soft, she likes to ware shorts to show off her soft fat booty. She isnt very bright, and although she has beautiful brown eyes she has buck teeth. shes very goofy.<br>\r\n<br>\r\n<br>\r\nConnie is 30 years old. shes a hard nose colonial in the army. she very tough, prideful and a bit arrogant. her weakness (she keeps secret) is fast food fetsih and a junk food fetish. Shes curvy and thick all over. Her booty is big soft and round, she hides her belly with a girdle. Her belly is small but pudgy and it protrudes out like a beach ball ( she never could take a belly shot.) she takes no stuff from nobody.</span></div></div>",
            "created":1400648400,
            "id":1799845,
            "title":"Create Your Own Girls"
        },
        "15533":{
            "author_id":"metallicwriter",
            "author_name":"Metallicwriter",
            "choices":[
                "Jessie Williams",
                "Someone Else?"
            ],
            "content":"<div class=\"\"><div> <span>          Jessie Williams: She is 16 years old and has pale skin. She is 5\" 3', weighs 160 pounds, and has dark brown, shoulder length hair. Despite her weight, Jessie is still very confident in herself and her weight, most of which is in her massive hips and butt. She is kind and extroverted. Much of her weight gain is caused by her lack of self-control when it comes to food, and her not caring about her weight. She plays drums in a band with her friends.</span></div></div>",
            "created":1414472400,
            "id":1878850,
            "title":"Jessie Williams"
        },
        "155332":{
            "author_id":"cole9179",
            "author_name":"cole",
            "choices":[
                "Hayley Brooke",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>Hayley Brooke age 34 has been the hottest teacher on campus since she got her job but when she falls for the chef at the new Italian place in town all of the heavy carbs start to take their tole on her body. She has shoulder length red hair, c-cup breasts and just the right amount of curves on her 115 lbs body.</span></div></div>",
            "created":1499321520,
            "id":2348079,
            "title":"Someone Else?"
        }
    },
    "info":{
        "author_id":"unilimitedline",
        "author_name":"UnlimitedLine",
        "brief_description":"Girls ranging from 14-35 gain weight",
        "created":1344455520,
        "description":"<td align=\"left\" class=\"norm\">Rules: <br>\r\n1) Good grammar and spelling please.<br>\r\n2) No sexual orientation.<br>\r\n3) No force feeding or intentional weight gain.<br>\r\n4) Each chapter must be at least 1,000 characters long. (Unless your adding a new option)<br>\r\n5) No pooing or peeing themselves.<br>\r\n6) Keep swearing at a minimum.<br>\r\n7) No Male weight gain.<br>\r\n8) No drastic weight gain.<br>\r\n9) (Not a rule but) Releasing Gas (in either form) is encouraged.<br>\r\nP.S For every valid addition that someone else makes (This could be in the form of a choice) I will add one more on top of that.<br>\r\n<br>\r\nThis is a pretty important update for the Keara option. I recently learned that I've been making the characters gain a bit to much in such a little time so I'm going to be editing some chapters so that it will be clarified that it didn't happen in just two days. (14/12/8)</td>",
        "id":1884281,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1500498660,
        "modified":1500498660,
        "pretty_title":"Girls Gain Weight"
    }
}