{
    "chapters":{
        "1":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Keep walking but with a open eye ",
                "Go after humanoid ",
                "other "
            ],
            "content":"<div class=\"\"><div> <span>I rose out of the water gasping for air. My helmet had cracked and water was rushing in. I had no choice ether die drowning or die from the air. I took off my helmet and took a deep breath expecting to die in seconds. But I didn't I was still alive. Still Breathing. The Air was gas like and stuffy but still breathable. I got up and coffed my way out of the water. I looked around. I was surrounded by thick Forest with alien like plants. It was as if I was in the Amazon. I tried my communicator. Hopefully I can get off this rock. Nothing not even static. With my shuttle nothing but scrap I was stuck here. Forever even. I looked at the ground real hard. \"Well.\" I said. \"Better start walking.\" I saw something human like jump through the trees. what followed was whispers that echoed through out the forest.        </span></div></div>",
            "created":1341474600,
            "id":1372191,
            "title":"Splash "
        },
        "11":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Wake up more transformed.",
                "Wake up surrounded. "
            ],
            "content":"<div class=\"\"><div> <span>The climate was harsh but I adapted smoothly. I kept an eye out for any Humanoids have'nt seen them in a while but the whispers started here and there. My suit was getting baggy which was odd being that it was made just for me. It was slowing me down so I took it off. But my clothes under it were baggy as well. I was able to withstand it for about an hour in til I took off my pants and my jacket. my legs felt so soft and smooth. I had also noticed that my thighs had widened. My butt also felt more.. well just more than usual. I had been walking for Three hours when the storm hit. The rain came pouring down hard. I put my jacket over two tree limbs and used it as shelter. I lied in the black grass and fell fast asleep.       </span></div></div>",
            "created":1341476520,
            "id":1372207,
            "title":"Keep walking but with a open eye "
        },
        "111":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Transform even more.",
                "eat the bear-wolf.",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>I woke up energized. I had never felt so good in my life. I got up and fell back down. My balance was off way off. Had I gotten shorter. my entire body felt soft. My stomach was finely chiselled. My- wait where's my jacket and my shoes! My shelter was gone so was my shoes, socks and pants. i looked around. \"What the?\"<br>\r\nA circle of footprints surrounded me. The humanoids. They must have came over me while I was Sleeping. But How didn't I hear any thing I spent years in the Military they couldn't have just stuck up on me like that. I got up and walked over to a water puddle. \"Where the hell am I in the first place. This planet in'st even in the records. I was about to put my hands in the puddle when I noticed my reflection. My black hair had grown out just past my ears. my face looked like that of a teenage girl with a golden skin complication. My eyes pale blue. \"I-I look like a a.\" My chest slowly started pushing out I looked down. Two mounds were starting to form. <br>\r\nI got up in Fury. \"What the hell did they do to ME!!!\" I went over to a Tree and ripped the branch off with incredible strength and speed. That's when I heard the roar. <br>\r\nI turned around as a big black animal came out of the trees and scratched me across the back. I yelled in agony. I turned and faced my attacker. It looked to be a cross between a bear and wolf. It had purple eyes and black fur. Three rows of teeth shown from inside its mouth as it snarled at me foam racing down it's mouth dying to eat it pray. I yelled and ran toward it as it pounced towards me. its Claws latched onto my back as it tackled me. We went into the brush. I held it off with my new found power. giving it powerful left and right hooks to the face as tried to chomp me down. I kicked it out from on top of me. it rolled further down the hill as I grabbed a sharp stone leaped into the air and shoved it into its skull. The animal panicked as the blood gushed out of its head. It died moments later. I stood triumphantly over it. That's when the pain came.               </span></div></div>",
            "created":1341479100,
            "id":1372220,
            "title":"Wake up more transformed."
        },
        "1111":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "He is staying."
            ],
            "content":"<div class=\"\"><div> <span>I dropped to the floor in pain. \"Whats Happening to me!!\" I felt my hair grow out more to my shoulders. My thighs tightened. I felt my penis being violently sucked inside of me. \"AHHHHHHHHHHHHHHHHHHHH!!!\" My face shifted more, my butt became bigger,  my body more curvy and voluptuous. the two mounds on my chest grew into two large C-sized breast. my face was now that of an young woman in her 20's. I had the body of an Olympic athlete now. I was firm and sexy. What was left of my clothing was shredded. My briefs had survived and my shirt only had enough cloth left to cover my newly formed Breast. I sat by the Wolf-bear wondering why this had happened to me and who had done this. Suddenly The whispers started again but this time I-I could understand them. It was faint and soft. \"it was saying come our sister come. do not be afraid. Let us explain.\"  I followed the Whispers deep into the jungle. In till I reached a city of ruins. Stone structures and buildings all over the place collapsed dead. I heard footsteps From all around. I grabbed my tree branch and stood ready. \"Do not worry sister it is us.\" Beautiful women in loin cloths surrounded Me. They all had the same pale blue eyes and golden skin. \"What is this.\" I asked in my new female voice.  \"What did you do to me.\" A gorgeous red head appoched me. \"We did nothing.You see this planet only supports Lara life not Fig. The planet transformed you not us.  I stood confused. \"Lara? Fig? What is that?\" <br>\r\n\"Lara is us. We are Lara. Fig is what you used to be.\" <br>\r\nLara. Lara must be what they use for female. And fig male.I looked up at the orange sky. The atmosphere. There must be something in the air. Something that transformed me. And maybe even them. <br>\r\n\"You.\" I said. \"You were the whispers.\"  <br>\r\nThe red head smiled. \"Yes we were calling you home to us. To be a part of our family. Your family.\" <br>\r\n\"My family?\" <br>\r\n\"Yes. You are one of us now.\" she said. <br>\r\nI fell to my knees in disbelief. \"I Don't Belong here. I have a home.\" <br>\r\n\"That you will never see again.\" The red head explained. \"You can never go home. This is your planet now.\"<br>\r\nShe was right. My ship had burned up on re-entry. I barley got out alive. This is my home now. I can never leave they don't have the means to. I will never see my family again,My friends, My face I'm stuck in this body. There's no where to escape from this air. There was a hand on my shoulder. \"I know this must be hard but this is a peaceful place. No war, No sickness and you are forever youthful. Please stay with us.\" The red head said. <br>\r\nI looked up at her and smiled. \"I never caught your name?\" <br>\r\n\"Bella. And yours?\"<br>\r\n\"Steve.\" <br>\r\n\"well due to your new look how about Stella.\" <br>\r\n\"Sounds right.\" <br>\r\n\"So will you stay with us Stella.\" <br>\r\n\"Yes. Yes I will.\" I said. <br>\r\n\"Good. Ella. Helen. Show Stella to her hut and get her some New clothes.\" <br>\r\nA two tall black haired walked over to me grabbed my arms and lead me to my hut to begin my new life. <br>\r\nBella watched as I walked away then turned to a woman next to her. \"I'm going to go inform her. She'll be happy to hear this.\" Bella walked off.                       </span></div></div>",
            "created":1341480600,
            "id":1372232,
            "title":"Transform even more."
        },
        "11111":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "content":"<div class=\"\"><div> <span>Bella walked far off from the ruins. She entered a canyon like landscape. There was a hatch door on the ground. She opened it. There was a ladder leading underground. She took it down. Underground lay piles of debris. Metal contraptions with pointed sides. They were ships. Spaceships. It was a spaceship graveyard dozens of them piled one         another.  Bella walked inside of one. She went up to the cockpit. There sat a being in a cloak in front of dozens of mini monitors. Bella kneeled before it.<br>\r\n“He is staying.” Bella said. “We have added another to our ranks.”<br>\r\n“Has he proven well in battle.” The being said.<br>\r\n“Yes. He killed the Cyji with ease. I believe he is the one. We can use him.”<br>\r\nThe being pointed to one of the monitors. “The sky people are coming. I need him ready to do what is necessary.”<br>\r\n“Give it some time well break him. We'll take away what’s left of his humanity. Make him forget he was ever a man to begin with. And turn him into the ultimate weapon.<br>\r\nThis I swear.” Bella said with a smile.<br>\r\n</span></div></div>",
            "created":1344567420,
            "id":1401423,
            "title":"He is staying."
        },
        "1112":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "An Unfortunate Transformation "
            ],
            "content":"<div class=\"\"><div> <span>I fell down to the ground.<br>\r\n\"What's-what's happening.\"<br>\r\nI climbed on top the Bear-wolf in agony. Tears flowing down my face. I didn't know what to do or why this was happening or where the hell was I. I thought of my family. My wife and son. I wanted to see them again but I couldn't get home I could never go home. The pain rippled through my stomach again and the whispers started again. What the Hell is that!! My body slowly started shifting and changing. I stared at the hide of the bear-wolf as my stomach rippled again. <br>\r\n\"Hungry.Yes, Yes!! I must be hungry their telling me to eat my kill yes yes that's it!!!!\" <br>\r\nI wildly plunged my nails into the hide of the Bear-wolf and started ripping away at its flesh. I picked up the still warm pieces put them in mouth. I threw  the piece back up and let out an insane laugh. That's when it all stopped. The changes, the whispers it all stopped. And I had lost it. My face was in the chest of the Bear-wolf devouring it to the bone. I spent hours Ripping away piece by piece of flesh laughing and talking gibberish. At one point I was dancing around it singing Highway to hell. I finally fell in to the grass naked covered from head to toe in black blood and fur. I had grown a little more fit since the last change.I started licking my fingers and laughing more. I felt even more energized but at the same time woozy. Maybe it was something in the meat? I dunno but as long as the whispers no longer bothered me I was fine. I fell fast asleep under the setting sun.   </span></div></div>",
            "created":1348899120,
            "id":1436764,
            "title":"eat the bear-wolf."
        },
        "11121":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "The Lara(women of the planet) make plans on what to do with Steve.   ",
                "Change back "
            ],
            "content":"<div class=\"\"><div> <span>I jumped up with unnatural speed to a sound I had heard in the forest. A yellow moon shined in the sky above and outlined the forest crudely. I was in a spider-like position, my senses oddly heightened. I hadn't felt this way before. What-There was a crackling in the forest. I peered ahead. There was a humanoid figure running west. <br>\r\n\"I got you!!!\" <br>\r\nI jumped off the ground toward the humanoid. With incredible agility I maneuvered through the trees swinging off veins and branches finally catching up to my assailant. I tackled them pinning them down to the ground. Their skin was soft like mine. I looked into their face. It was a woman. A beautiful woman with a golden  skin complexion. Her hair dark brown. She was wearing barley anything but a tightly fitting loin cloth. Her beauty mesmerized me. She looked innocent. But then I remembered the whispers. I pinned her wrist down. <br>\r\n\"What are you!!!!! WHERE I AM!!! WHAT HAVE YOU DONE TO ME!!!!!\" I screamed in a inhuman voice. <br>\r\n\"Lara Fig Ubini Fig Cyji.\" She said. She nodded toward me with a troubling facial expression. \"Cyji num num Fig huji mi huji. Klli Klli!!!\" She punched me through a tree and into another. I slumped to the ground. She got up and pointed at me. \"Fig Cyji jao jao!!\" <br>\r\nShe took off running.<br>\r\nI got up my body pulsating. My heart beating faster than ever. \"COME BACK HERE!!!!!!!\" <br>\r\nMy body started to shake. I let out a growl. I started to grow taller and more masculine. My nails grew out into super sharp points. A black goo started to seep out of my pours and turn into a dark hard sheath over my body. My canines turned into fangs and my eyes glowed yellow. I couldn't think straight, I didn't RRR I didn't...............I couldn't realize what was g-going on. It hurt but at the same RRRR!!!! RRRRRRR!!!!! ROAR!!!!!!!!!!!!!!!!!!!!!!!!!!!!!<br>\r\n<br>\r\nThe girl kept running. She wasn't that far from her village. She was almost there when she heard something land behind her. She stopped in her tracks knowing that their was no use in running he being the close. She slowly turned to see a humanoid monster.It had wild hair on the top of its head,sharp teeth, claws, yellow eyes, a woman's figure and stripes across its thighs and arms.  Its skin dark as the night it slowly walked toward her. \"Fig. Fig num Cyji. Hyju!! Hyju!!!- Dammit Stop Steven stop this isn't you.\" She said in pure english. The monster let out a deep growl. <br>\r\n\"Steven. Steven please think I know you can!!\" It let out another growl coming closer. <br>\r\nThe woman started  the whispers. The animal concealed its ears in agony. It roared and jumped toward the woman. The monster had its hand around the woman's neck. \"Steven DON'T!!\" The monster had strangled her unconscious. She hung in the monsters hand as it howled to the moon. <br>\r\n<br>\r\n                                                  <br>\r\n </span></div></div>",
            "created":1348903440,
            "id":1436788,
            "title":"An Unfortunate Transformation "
        }
    },
    "info":{
        "author_id":"marvelcool",
        "author_name":"D.C. les",
        "brief_description":"You are a astronaut in the future.you have crash landed on a strange planet.....  \r\n ",
        "created":1304883540,
        "description":"<td align=\"left\" class=\"norm\">You are an astronaut in the future. you have crash landed on a strange jungle planet as you slowly begin to transform.<br>\r\nThis is TG transform mainly but you may have other transformations as well just make sure and make story out of it.<br>\r\nThe astronaut can be Male\\female but cannot leave the planet. <br>\r\n<br>\r\nCrash Landing 2 is now up!  </td>",
        "id":1774721,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1354425960,
        "modified":1354425960,
        "pretty_title":"Crash landing"
    }
}