{
    "chapters":{
        "1":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Evan",
                "You are a victim",
                "Matt",
                "Brandon",
                "Kyle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of all:  who are you?</span></div></span></div>",
            "created":1164344400,
            "id":381087,
            "title":"Identity"
        },
        "11":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Your parents",
                "Your cousins",
                "One of your siblings",
                "One of the pets",
                "One of your friends"
            ],
            "content":"<div class=\"\"><div> <span>You're Evan.  You are 14 years old (in 8th grade) and stand 5'11''.  You live with your mom, Daena (5'4''), dad, Frank (5'7''), and your 7-year-old sister, Sussie (4'0'').  You are very athletic, being on the football, basketball, and swimming teams, and have a nicely-toned body to go with it.<br>\r\n<br>\r\nHowever, it's your strange obsession that sets you apart.  You fantasize about shrinking down and swallowing people.  Your dreams can finally come true when you recieve a shrinking machine in the mail.  You test it and it works!  Who should you try it out on?</span></div></div>",
            "created":1170565200,
            "id":439773,
            "title":"Welcome to Evan's life"
        },
        "111":{
            "choices":[
                "Go to your younger sister's room",
                "Go to a friend's house",
                "Shrink your school!"
            ],
            "content":"<div class=\"\"><div> <span>You almost fall down the stairs as you think about the possibilities you could have with this weapon. You notice your parents are in the living room watching the TV, sitting ducks for your first human test. You hide behind the corner and point the gun round, firing at your dad first. A long beam fires out and surrounds him in a blue light. He rapidly diminishes in size, stopping at a couple of inches. From what you could see and hear, his face was in panic and your mum was screaming. As your mum went over to see what had happened, you fired the gun at her and she quickly fell to the ground to the same proportion. You slowly walk in, unable to grasp how amazed you were at their size. You slam your feet down by them, causing shock waves to knock them over.<br>\r\n<br>\r\nYou scoop them both into your hands and examine the screaming morsels.<br>\r\n\"What have you done?!\" your father screams, holding onto his sobbing wife. His voice was barely a squeak, but was understandable.<br>\r\n\"I got delivered a shrink device in the mail. For ages I've fantasized over shrinking people down and eating them. You will be the test to see how good my fantasy is!\"<br>\r\n<br>\r\nYou moved your hysterical parents closer to your mouth, licking your lips, then you flicked your tongue at your dad once he was close enough and knocked him into the back of your mouth. You suck on his defenseless body hard, tearing his clothes to shreds and causing considerable pain for him. You shivered in how delicious he tasted.<br>\r\n\"You're kinda salty,\" you say. Your mother, at any other time, would have told you off for talking with your mouth full, but right now she refrained from doing so.<br>\r\n<br>\r\nEventually, you swallowed your father, tracing his position by running your finger down your chest to follow him. He eventually landed in your stomach, and you could feel his tiny form hammering on the stomach lining. However, all this did was add to the pleasure.<br>\r\n\"Oh, yes! Keep fighting!\" you yell as you throw your mother into the air and suck her clothes away, tasting her a little before letting her follow her husband. You rubbed your slightly shivering stomach and walked out of the room. You had to sate the need to live your fantasy now, and didn't care how many people you had to eat before you were satisfied.</span></div></div>",
            "created":1207285200,
            "id":515953,
            "title":"Your parents"
        },
        "1113":{
            "author_id":"peacefrostwolf",
            "author_name":"frostwolf",
            "choices":[
                "go to a city and do it buffet style",
                "eat a elementary",
                "eat a hpspital"
            ],
            "content":"<div class=\"\"><div> <span>You look at the time, seeing its time for school. you chuckle a little bit, forming a plan in your mind.<br>\r\nyou walk to school with your favorite hoody on, having carefully tucked the ray in its pocket.<br>\r\nYou arrive at your feast, and decide not to eat them all-yet. You form a plan as to where you will sprin your attack, and where your snacks wil be held when you nab them. You walk in, casually so no one notices a slight buldge in your pocket.  You look around, where to start? The office, the annocnments won't go off and no one will leave homeroom. Then the bathrooms, yes the girls too. You sneak into the office, and shrink the secretary, and shove them into your briefs, right against your penis. They squirm, feeling like a massage to you.<br>\r\nYou then hit homerooms, skipping here and there to shrink the people in the bathrooms.  Once the whole school is in your boxers, you go to the nurses and lay on one of the beds. They squirming feels extremley good, so you rub your hand over your pants. A few touch the opening of your cock, feeling the best. You stick your hand in your pants, grabing a handful and swallowing them all at once.  You eat more and more, until one group is left. You leave them there, eventually eating one morsel at a time. Only one person is left, your enemy. You decided not to eat him, but send him to your stomach a different way-your cock. You slide his head near the end, and forcefully start to shove. His head enters fastly, until you are at his stomach. You push harder, and now its up to his hips. You stop pushing, for your penis pulls him in.  Its very slow, but effitiant. You lay down rubbing your stomach, -now full of people, - and stroke your penis- which has two little legs stickin out of it. After about sn hour, you feel your nemesis enter your stomach,  and head out to....</span></div></div>",
            "created":1359090000,
            "id":1516770,
            "title":"Classmates taste deliscious."
        },
        "113":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Your little brother, Johnny",
                "Your little sister, Sussy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who should you try it out on?</span></div></span></div>",
            "created":1170565200,
            "id":439777,
            "title":"Which sibling"
        },
        "12":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Alec",
                "Craig",
                "Matt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is your name?</span></div></span></div>",
            "created":1261890000,
            "id":811605,
            "title":"You are a victim"
        },
        "121":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "The same size and it's a school day",
                "The same size and it's a weekend",
                "Something else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your name is Alec. You are 15 years old and going to be a sophomore in high school. You wake up one morning to discover that you are...</span></div></span></div>",
            "created":1264568400,
            "id":826421,
            "title":"Alec"
        },
        "1213":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Shrunken and it's a school day...",
                "Shrunken and it's the weekend..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices...</span></div></span></div>",
            "created":1303707600,
            "id":1093988,
            "title":"Something else..."
        },
        "12132":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "following your cousin Tom",
                "staying put"
            ],
            "content":"<div class=\"\"><div> <span>The last thing you remember you were sleeping over at your cousins' house.  You'd just fallen asleep in Tom's room.  Tom was the oldest of your cousins, though he was one year younger than you.  In many ways, however, he looked to be older than you.  He was taller, was more muscular, and had more facial hair than you.<br>\r\n<br>\r\nBack to the present.  You look around you to see what in many ways resembles a cloud.  Suddenly, something slams down ahead of you.  After you catch your bearings, you realize, with awe, that the thing is a giant ankle.  You've shrunk!  You gasp, as you realize secondly, that the giant ankle belonged to Tom.  Another deafening boom, and the ankle moves into the distance.  The thuds slowly fade away.<br>\r\n<br>\r\nAfter you gather you bearings, you assess your situation.  You've shrunk onto your pillow.  Your cousin walked out of his room.  You decide your best course of action is:</span></div></div>",
            "created":1333429200,
            "id":1308440,
            "title":"Shrunken and it's the weekend..."
        },
        "121321":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Approach him",
                "Wait"
            ],
            "content":"<div class=\"\"><div> <span>You hike your way over the fluffy mass of your pillow and onto the hardwood floor.  From there you set out towards the door and the hallway beyond.  Passing Sean and Howard's room, you hear a sound.  You stop and listen.<br>\r\n<br>\r\n\"Psssst.  Alec!\"<br>\r\n<br>\r\nYou turn around towards the sound and see, amazingly, Sean and Howard (who are Tom's little brothers) shrunken to your size standing behind you.  You run up and hug them.  \"What happened guys?\"<br>\r\n<br>\r\nSean and Howard take turns elaborating on a story much like yours.  They woke up to find themselves shrunken and made their way to the hallway.  You all decide to band together and continue down the hall.  In the living room, you see Tom sitting on the floor.  He's magnificent in giant form.  Normally he's taller than you (at an even six feet), but this is ridiculous; he's the size of a 10-story-building sitting down.  His allure is only helped by the fact that he is also shirtless.  His pecs glisten, monuments of muscle and his fairly sculpted abs barely conceal a bloated stomach halfway full of breakfast.  What is your plan of action?</span></div></div>",
            "created":1333429200,
            "id":1308457,
            "title":"Rendezvous"
        },
        "1213211":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "swallowing Howard",
                "He's joking"
            ],
            "content":"<div class=\"\"><div> <span>            As you slowly make your way towards Tom.  You notice he has a bowl of cereal a grilled cheese and a pop tart.  Wow did he ever eat a lot thinking of how to get his attention you were distracted by Howard yelling excitedly as he crawled onto the plate with the pop tart.  \"What are you doing\" you asked him? \"What is he doing\" you asked Sean?  \"He loves pop tarts\" he shrugged in answer.  Looking back you saw that Tom had picked up the treat with Howard still on top of it.  Both you and Sean along with Howard screaming caused the giant to look at his food.  Tom smiled as he saw his tiny younger brother \"What are you doing on my breakfast\" he asked?  Howard told the  story pointing down to you and his other brother.  Tom saw you both staring up at him, with a lick of his lips he gently plucked Howard off of the pop tart and quickly inhaled it swallowing it down .  \"Hey that was mine\" Howard complained.  \"Actually it was mine\" Tom said.  \"But I'm willing to share\" he said mysteriously.  \"Yes share share share\" the young boy chanted.  Tom looked at both you on the floor \"well should I.\"  Sean said yes, you just nodded with a bad feeling.  \"OK the thing is that was the last one\" Tom said to Howard.  Howard was mad \"So how do you plan on sharing.\"  \"By placing you in the same spot as the pop tart\" with that his stomach growled.</span></div></div>",
            "created":1370770020,
            "id":1607583,
            "title":"Approach him"
        },
        "12132111":{
            "author_id":"worruuu",
            "author_name":"Worru",
            "choices":[
                "Tom's breakfast isnt over",
                "Tom has other plans"
            ],
            "content":"<div class=\"\"><div> <span>Tom picked up Howard , who was trying to piece together what Tom meant by \"The same spot\" He quickly put two and two together as he was elevated up and dangling above the squelching maw of his Giant Brother. Howard questioned his brother \"You will let me out after I eat some wont you?\" Tom gave a playful smile as his other hand sat on his gurgling gut. \"Sure, sure...\" He dropped Howard into his mouth and began swishing him within the wet confinement.<br>\r\n<br>\r\nYou and Sean quickly realized Tom's intentions and began crying out begging Tom to stop! He responded with a loud 'Glck'. A small lump descended down his throat and out of sight. You and Sean were in shock. You couldn't move...<br>\r\n<br>\r\nHoward landed with a wet slap into a viscous liquid, the pop tart was already being made part of Tom by the stomach as howard looked in disgust at the churning desert. He tasted a chunk that drifted towards him, it was putrid and he coughed it up immediately. \"Ugh ok Tom, can you let me out now?\" There was nothing but a response of gurgling and wet dripping. Howard quickly felt a tingling feeling on his legs. He was being digested... He ran towards the stomach wall in the smelly slopand pounded on the gelatinous walls screaming loudly to let him out. He was only speeding up his downfall. He collapsed after a few seconds as the heat became too much...<br>\r\n<br>\r\nTom rubbed his abs licking his lips with pleasure. He then let out a wet belch and patted his stomach. The little ripples on his gut concluded. He had eaten one of his younger siblings... You and Sean looked up in horror as Tom wiggles his toes and smiled at you.. \"ahh that was so good... You guys still want some of it dont you?\"... You stumbled at his question...</span></div></div>",
            "created":1569147000,
            "id":2721875,
            "title":"swallowing Howard"
        },
        "121321111":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Tom decides to get more food",
                "Tom eats you",
                "Tom eats Sean"
            ],
            "content":"<div class=\"\"><div> <span>“You just ate and digested your brother! You’re a monster!” You couldn’t stop yourself from screaming at Tom, even though you knew it probably wasn’t helping the situation.<br>\r\n<br>\r\nTom laughed heartily. His mouth, ringed by straight, white teeth, opened wide for you both to see - the same mouth had just gulped down his brother. “I knew you’d say something like that, Alec. But you see, you’re mistaken. Howard used to be my little brother. But now he’s food in my stomach - fuel to make me stronger.”<br>\r\n<br>\r\nWith that Tom curled his biceps, his arms rippling with beautiful muscles. He licked his lips again and flexed his abs. As if on cue, Tom’s stomach growled again. “I’m still hungry...”</span></div></div>",
            "created":1569777060,
            "id":2725283,
            "title":"Tom's breakfast isnt over"
        },
        "1213211111":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Tom  returns with a homemade breakfast ",
                "Tom returns with McDonald’s",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>“I would gulp you both down right now, but I need more than two little morsels to keep my belly happy,” Tom says nonchalantly while rubbing his abs. His stomach growls again menacingly.<br>\r\n<br>\r\nBefore you and Sean can react, Tom grabs both of you by your shirt collars and lifts you onto his desk. He gets up from his seated position on the floor and stands before you in all his shirtless glory, muscles rippling in the morning light.<br>\r\n<br>\r\n“Stay here. I’ll be right back.” Tom doesn’t give you and Sean much choice, as he places a shot glass over your two miniaturized forms. You watch from your glass prison as he walks out of his room towards the kitchen.<br>\r\n<br>\r\nWith Tom gone, you turn to check on Sean. “How are you holding up?” you ask the 12-year-old.<br>\r\n<br>\r\nSean looks at you with tears in his eyes. “Why would Tom do that? And why was I too scared to say anything? I keep replaying the image of his Adam’s apple bobbing and squelching as he gulped Howard down.”<br>\r\n<br>\r\nYou give Sean a hug. “I don’t know... but I’m gonna do my best to keep you safe.” You hear footsteps in the hallway.</span></div></div>",
            "created":1569787620,
            "id":2725347,
            "title":"Trapped"
        },
        "1213211113":{
            "author_id":"worruuu",
            "author_name":"Worru",
            "choices":[
                "Tom eats Alec",
                "Tom plays with Alec"
            ],
            "content":"<div class=\"\"><div> <span>Sean was filled to the brim with disgust and fear. He heard the wet squelches emitting from the gurgling stomach as he looked up at his consumer now flexing with the energy provided by their little brother, his little snack. He didn't want to be next and took flight across the expansive surface. Alec stood still turned as he saw sean bail \"SEAN NO! WAIT.\" The looming shadow of Tom grew over sean as he easily caught up to his fleeing brother and lightly stepped on him to keep him alive and detained. \"Where you going? Food doesn't run away y'know.\" He cheesly remarked as he lifted his slightly sweaty foot of his brother who was stook to his sole. He picked him off with ease and licked away the salty tears of despair and muffled the cries as his viscous saliva filled up Sean's mouth. Sean gagged and flailed to no avail as his brother slowly sucked him into his mouth. The sound was deafening, making Alec shiver hopelessly as he watched Tom's tounge slide his brother into his mouth entirely. Sean was smashed about playfully before Tom tilted and concluded the fun with a loud Glck!<br>\r\n<br>\r\nHe sat down on the sofa resting alec on his bumpy abdomen. Alec knelt in pure desperation as he saw little ripples of Sean's frail fists bumping against the groaning gut. \"How could you be so cruel. He's going to die!\" You cried out whilst deterring eye contact with the satisfied giant. Who rubbed his hand over his stomach without knocking you away. \"How could I not!? Its so satisfying. Feeling their little annoying bodies struggling in their older brother's own is mesmerising!\" He sickly said as he let out little burps and sighs of relief. Meanwhile...<br>\r\n<br>\r\nSean was instantly greeted with a wet splash into a mixture of food and acid complimented by the squelches of the stomach. His eyes adjusted to the dark as he saw a half digested body of his younger brother submerged and being moulded by the stomach surface. He almost threw up and began frantically fighting for his life. His cries muffled by the thick stomach and loud giggles drowning them out. His fists cushioned by the organ as he punched endlessly. He couldn't comprehend why his brother ate him, they got on so well he contemplated whilst breaking down into tears. Suddenly air rushed out several times indicating he was burping. Oxygen was leaving the stomach and survival was not a guarantee. Sean began to feel faint and collapsed onto a chunk of digested food...<br>\r\n<br>\r\n*BUUUURP!* Tom bellowed across the room patting his stomach and smirking at Alec who he now rested on the table in front of him. \"Now, what to do with you....\" </span></div></div>",
            "created":1570391580,
            "id":2729017,
            "title":"Tom eats Sean"
        },
        "122":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Jerome's",
                "Collin's"
            ],
            "content":"<div class=\"\"><div> <span>You are Craig Bright, a high school math teacher.  Though you are relatively short in stature (at only 5' 6''), you have an attitude that dominates the room--not in a good way.  Truth be told, most of your students despise you.  You knew yourself to be strict, but would never have guessed at the intense animosity harbored by your students towards you.  So naturally, you had no idea of student-lead plot to dispose of you once and for all.  Whose idea was it?</span></div></div>",
            "created":1289106000,
            "id":989412,
            "title":"Craig"
        },
        "1221":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "You wake up during the school day",
                "You wake up at Jerome's house"
            ],
            "content":"<div class=\"\"><div> <span>Jerome is a football player in your math class.  He is taller than you (at 6') like most of your students.  Recently, you had failed him on one of your tests and then spoken to him about the dangers of laziness, as you felt that he could do much better.  Jerome, who was actually trying in your class, was understandably angered by your assertion.  He decided that it was time for his revenge.  Unbeknownst to you, Jerome slipped a strange powder he got from one of his friends into your morning coffee.  The powder had two effects:  it shrank its victim and put them to sleep.  Jerome stepped into your office conveniently after you drank your coffee.  You were out cold minutes after your first sip and shrank to four-inch size shortly after that.  Jerome pocketed your small body, planning on taking you home after the school day was finished.</span></div></div>",
            "created":1289106000,
            "id":989421,
            "title":"Jerome's Story"
        },
        "12212":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Jerome eats you as a part of his meal",
                "Jerome eats you after his meal--as dessert"
            ],
            "content":"<div class=\"\"><div> <span>Your head throbs and your vision is blurred as you come around.  As your eyes clear, you examine your surroundings.  At first you can't make sense of where you are.  But as time passes, you come to realize, with dawning horror, that you have been shrunk and placed in a pet cage of some sort.  The cage is on a desk in what looks to be a teen bedroom (which you don't know yet is Jerome's).<br>\r\n<br>\r\nSuddenly, the door opens.  In walks a monolithic Jerome, wearing nothing but board shorts.  In his right hand he holds what looks to be a jack-in-the-box bag.  He sits down on his desk chair in front of you, his bulky, bare torso taking up your vision.  \"Hey Mr. Bright, how do you like your new home?\" Jerome asks with a smirk.  You can't even say anything; you're simply dumbfounded at your situation.  \"Well, don't get too comfortable.  You won't be there for long.\"  The ominous comment is enhanced by a low growling noise.  Jerome places his hand on his firm, substantial belly and you discern that he is hungry.  His next statement confirms this.  \"Boy, this stomach could sure use a couple of burgers!\"</span></div></div>",
            "created":1289106000,
            "id":989465,
            "title":"You wake up at Jerome's house"
        },
        "13":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "A School",
                "Random Person off the Street"
            ],
            "content":"<div class=\"\"><div> <span>You're Matt.  At 6'4'', you're taller than most people on the street.  You're 17-years-old and a swimmer.  You have an athletic build and a large appetite.  You also have a strange obsession:  you fantasize about swallowing people.  Your dream comes true the day you recieve a shrink gun in the mail.  You ordered it off the internet out of pure desperation.  You didn't think it would actually work, but it does!  Finally, your dreams can come true.  What should you shrink first?</span></div></div>",
            "created":1164430800,
            "id":366999,
            "title":"A Fateful Package"
        },
        "131":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "FEAST!!!",
                "You wait"
            ],
            "content":"<div class=\"\"><div> <span>A school it shall be!  You head over to your local elementary school.  It's not a big school, but it will do for now.  You sneak up to a fourth grade classroom.  Each class is in a separate building.  You'll start with just this fourth grade classroom.  Quickly, so that you're unnoticed, you shrink the classroom to dollhouse size.  You hear tiny gasps of surprise as you stuff the miniturized building into your bag.  You race home.  The lack of a fourth grade classroom is unnoticed for now.</span></div></div>",
            "created":1164430800,
            "id":367194,
            "title":"First Miniturization"
        },
        "1311":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>Carefully you set the \"dollhouse\" on the kitchen table.  You prepare two burgers for lunch.  After sitting down at the table, you remove your shirt, showing off your well-toned body.  You quickly wolf down the burgers and gulp down a can of cola.  By now, you can hear soft whimpers and screams from the schoolhouse.  They're scared of you!  It's then that a blonde-haired boy speaks up.<br>\r\n<br>\r\n\"E-excuse m-me,\" he stutters.  \"But, what do you plan to do with us?\"<br>\r\n<br>\r\n\"Why don't I show you,\" you answer in a huge booming voice.  You scoot the classroom over, open the door, and pull out the boy.  He shivers slightly in the palm of your hand.  The students in the classroom peer out of the window.<br>\r\n<br>\r\n\"What's your name?\" you ask him as you hold him up to your face.<br>\r\n<br>\r\n\"J-John.  My name's John,\" he says.</span></div></div>",
            "created":1169096400,
            "id":374710,
            "title":"John"
        },
        "13111":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>\"Well John, nice to meet you.\"  You lower him down, setting him on your bare stomach.<br>\r\n<br>\r\n\"Why'd you set me here?\" he asks.<br>\r\n<br>\r\n\"So you get to know your new home.\"  He gazes up at you, puzzled.  \"I'm hungry--and you and your classmates are going to fill my belly!\"  John tries to run, but doesn't make it past your belly-button.<br>\r\n<br>\r\nQuickly, you lift him by his shirt collar.  \"You're a monster!\" he screams.  You lick your lips and your stomach growls in anticipation.  You drop him into your mouth, letting his classmates see him in there.  He struggles and tries to run out, but you flip him back with your tounge.  You swallow him slowly, showing his classmates everything.  You feel him squirm down your throat and then drop into your belly.<br>\r\n<br>\r\nYou let out a huge belch, and then get up to rub your belly.  John is a feisty little morsel.</span></div></div>",
            "created":1169096400,
            "id":374716,
            "title":"Swallowed"
        },
        "131111":{
            "choices":[
                "Continue with the rest of the school",
                "Good neighbors become good food"
            ],
            "content":"<div class=\"\"><div> <span>The continuing events are a blur to you. You just begin to feed, fast, grabbing the tiny vermin and swallowing them without a second thought, but not before playing with them in your mouth a little first. You can feel your stomach get fuller and the tiny humans crawling around in it helplessly, all the while getting you more and more aroused. By the end of your feast, only six of the class remains, including the teacher who had been so fearless that he'd ran into his storeroom and locked the door.<br>\r\n<br>\r\n\"It seems as though I just can't fit any more of you in,\" You say, smiling warmly down at them, \"hey, teacher, come on out, I've stopped eating people now.\"<br>\r\nNo reply.<br>\r\n\"Come on, don't make me force you.\"<br>\r\nYou could hear a tiny shuffling from the closet door but no sign of the teacher emerging. You pinch the roof part of the storage room and tear it off, revealing the teacher in all her beauty. She was very young, only about twenty three years old, and had a body of a supermodel. You plucked her from her hiding place and seated her on your lap. Your erection was clearly visible to her through your trousers.<br>\r\n<br>\r\n\"W-what are you... Why are you d-doing all this?\" She asks, absolutely terrified and unable to bring herself to running. She knew what would probably happen if she tries to run.<br>\r\n\"I'm just hungry miss...\" you reply, gesturing her to give you her name.<br>\r\n\"Emily,\" she says, \"Emily Matthews.\"<br>\r\n\"That's amusing, my first name is Matthew,\" you say as you cup your hands around the woman's body and lift her to your face. The shrunken beauty starts to scream as your finger slowly makes its way towards her and forces itself into her clothes. With a quick flick of the wrist, her clothes tear off, leaving her stunning naked body behind. You goggle over the sight for a while, then begin to lick her body, enjoying the feel of her once D cup breast running over your taste buds.<br>\r\n\"You taste delicious,\" you say, her taste causing the hunger to return, \"And listen.\"<br>\r\nYou bring her down to stomach level and let her here the growling stomach.<br>\r\n\"I'm all ready to start eating again!\"<br>\r\n\"You only devoured most of my class ten minutes ago!\" she screams, now punching uselessly at your fingers, trying to break free. You decide to humour her, yelling \"Ow!\" and dropping her. You watch as she slides down your pecs and six pack. You suddenly feel glad that you were wearing loose fitting jeans as she continued to slid and stop right above your penis, sending shivers of pleasure through your body. You take her a step further and shove her into your underwear.<br>\r\n<br>\r\n\"You can stay there for now,\" you say as you continue to play with the rest of the class, throwing them in the air and catching them in your mouth. At the end you pat your stomach, frightening the children inside into a state of frenzy. They go berserk on your stomach lining, punching and kicking away, but like the others they do not realise how much pleasure you were getting from their movements. Even you do not know how much they were pleasing you until you pull the teacher out from your underwear, soaked in semen. She looks up at your grinning face helplessly, submitting to the fact you were going to eat her too. You take her to the sink and wash her off before placing her gently inside your mouth. You open it wide and she walks in, rubbing herself against your tongue. You close your mouth and begin to play with her sexy, naked body, rubbing her all around your mouth, before swallowing her. You could still feel her large breasts rub down your throat as she fell to her doom.<br>\r\n<br>\r\nThis is when you realise that your dreams of shrinking down people and eating them is more than just a reality now. It is an obsession. You feel compelled to continue your dirty work, grabbing the shrink gun and going out, thinking about what to do next.</span></div></div>",
            "created":1207026000,
            "id":515039,
            "title":"Continue..."
        },
        "1311111":{
            "choices":[
                "OM NOM NOM!",
                "CHOMP!"
            ],
            "content":"<div class=\"\"><div> <span>You step out of your house after putting on a shirt and grabbing your empty back pack. You slip the toy-like shrink ray into your pocket and hop on your bike. It should take you 15 minutes to reach the local elementary school and maybe 5 minutes to shrink the entire school if you're quick enough. By the time you get home I should be around six o clock. Your parents should be coming home by 9 pm so you should have enough time to enjoy a little dinner.<br>\r\n<br>\r\nYou arrive at Davidson Elementary. Memories of your old elementary school flood into your mind, but you aren't using those memories to reminisce. You're using those memories to figure out how many classes there are. The school goes from kindergarten to fifth grade and there are two classes for each grade with 25 kids in each class. So there are 300 kids for you to feast on! Plus 12 teachers, but you already ate one of the 4th grade classes so now there are only 275 students and 11 teachers. Oh well.<br>\r\n<br>\r\nYou walk around the premises, no one taking notice to an 18 year old boy in an elementary school. It also seems no one has noticed that one if the 4th grade classrooms was missing. Terrible faculty.<br>\r\n<br>\r\nYou take note of your stomach growling. It seems most of the fourth graders you ate have already digested, but you can barely feel the weakened punches of the remaining fourth graders moving into your intestines. There must be at least a couple kids in there that are alive.<br>\r\n<br>\r\nYou go around the premise shrinking all of the buildings to a more manageable size. They look like small cubes by the time you're done. As you walk around collecting the classroom buildings you hear screams of terrified young children and teachers who have no clue what's going on. You stack them into your back pack and put the shrink ray back  in your pocket. You hop on your bike and head home.<br>\r\n<br>\r\nYou look back at where most of the school used to be. You decided to leave the main building untouched. It only had the principal and secretary in there, so you weren't missing out on much. If only you could see their faces when they notice that the whole school is missing.<br>\r\n<br>\r\nYou make it home and it's only about 6:15. You park your bike and get into the house. No one's home. Your stomach growls viciously. It seems it's time for dinner. First you pull out all the classrooms, taping up all possible exits. You stack them neatly in the fridge. They look almost like boxes, so one should really be able to tell he difference. After putting them away you look amongst all the possible classrooms you can choose from. There are two of each classrooms!!! Two kindergarten classrooms, two first grade classrooms, two second grade, two third grade, only one fourth grade since you ate the other class, and two fifth grade! You're like a kid in a candy store.<br>\r\n<br>\r\nYou reach into the fridge for the on to the far left; one of the kindergarten classes. You walk over to the counter and set the classroom down. By now, all the little kids are at the window staring at the giant boy and wondering what he's going to do, including the teacher! You reach into the cabinets and pull out a plate that is curved up at the top, so if any naughty children fall on the plate they won't be able to escape.<br>\r\n<br>\r\nYou get two slices of bread and the mayonnaise. You spread the mayo over the slices of bread and put it away. You reach for the classroom and rip off the roof, dumping the screaming kids onto the mayo covered bread. You put the other slice on top and have officially made your first kindergartener sandwich. You take your sandwich and sit at the table. You pick the squirming mass up in your hands and prepare for your first bite.</span></div></div>",
            "created":1315198800,
            "id":1182009,
            "title":"Continue with the rest of the school"
        },
        "14":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "One of your children",
                "Your wife",
                "A co-worker",
                "A random person"
            ],
            "content":"<div class=\"\"><div> <span>You're Brandon.  You're 32 years old and 6'5''.  You have a wife and three children.<br>\r\n<br>\r\nYou also have a large appetite.  You've entered and won many food competitions.  But, it's your strange obsession that sets you apart.  You enjoy swallowing living things.  It is with the arrival of a shrink gun one day in the mail that all your dreams can come true.<br>\r\n<br>\r\nYou decide to test it out on someone.  Who will it be?</span></div></div>",
            "created":1169355600,
            "id":375734,
            "title":"Intoduction"
        },
        "141":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Matt",
                "One of your daughters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which child do you test it out on?</span></div></span></div>",
            "created":1169355600,
            "id":390743,
            "title":"Choosing The Child"
        },
        "1411":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "He shrinks to 6 inch tall",
                "He shrinks to 1 inches tall"
            ],
            "content":"<div class=\"\"><div> <span>You come home from work with your 3-year-old son, Matt. He goes off to his room to play with his toys. You go to yours and get undressed. You come out shirtless, in only a pair of boardshorts. You ask Matt if he's hungry for dinner, but he says he's not. You're starving so you heat up the leftover steak in the fridge. When the microwave beeps, a wild idea pops into your head.<br>\r\n<br>\r\n\"Matt, there's something cool I have to show you!\" He enters the kitchen, his tiny feet pit-pattering over to you. He looks up at you brightly.<br>\r\n<br>\r\n\"Show me!\" he says jumping up and down.<br>\r\n<br>\r\nYou point the shrink gun at him. ZAP!</span></div></div>",
            "created":1169442000,
            "id":390747,
            "title":"Shrunk"
        },
        "14112":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Matt listens to you",
                "He's mischevious"
            ],
            "content":"<div class=\"\"><div> <span>The smoke clears and your formerly three-foot son is now only one inch tall.  You reach down and place him in the palm palm of your hand.  Gently, you raise him to your eye-level.<br>\r\n<br>\r\n\"Daddy, what happened?\" he asks.<br>\r\n<br>\r\n\"I shrunk you with this machine,\" you reply.<br>\r\n<br>\r\n\"Oh...\" he sounds a bit frightend.<br>\r\n<br>\r\nYour stomach rumbles and you remember how hungry you are.  \"C'mon son, let's go sit down.\"  You reach into the microwave and pull out your steak dinner.  You walk over to the couch with Matt in hand, sit down, and turn on the T.V.<br>\r\n<br>\r\n\"Son, I don't want you fooling around.  Stay right here.\"  You set him into a saucer on your lap, next to your dinner.</span></div></div>",
            "created":1174280400,
            "id":390762,
            "title":"Shrunk"
        },
        "141121":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Giant with an Eating emphasis",
                "Giant with a Crushing emphasis"
            ],
            "content":"<div class=\"\"><div> <span>You rip the steak into strips and gluttonously gulp them down.  You're starved.  You're wife calls you a pig, but you don't care.  When your hungry anything goes, just as long as you get the food into your stomach.  In a matter of minutes, all that's left of the steak is the T-bone.  You glance down at your hunky six-pack.  You could fit another meal in there if you wanted too.  There's a letdown to high metabolizm, you're never satisfied.<br>\r\n<br>\r\nYour thoughts drift back to Matt.  He's safe in his little saucer.  His little face is filled with awe.<br>\r\n<br>\r\n\"Dad,\" he starts.  \"Could we maybe play... giant?!\"  His voice is filled with excitment.<br>\r\n<br>\r\n\"Sure kiddo,\" you respond.  \"See, being small can be fun.\"</span></div></div>",
            "created":1174280400,
            "id":390763,
            "title":"Dinner"
        },
        "1411211":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "You stop playing",
                "You take the game a step further..."
            ],
            "content":"<div class=\"\"><div> <span>You pick Matt up and gently set his tiny form on the coffe table.  \"I'll give you 20 seconds to hide, okay?\"  Matt excitedly nods his head.  You begin counting.  \"1-2-3-4.... 19-20!  Ready or not, here I come!\"<br>\r\n<br>\r\nYou stomp around the coffe table.  Then, you say in your best giant voice \"FI FIE FO FUM.  I'M SERCHING FOR A LITTLE BOY TO FILL MY TUMMY-TUM-TUM!!!\"  You spot Matt easily, pressed against one of the coffee mugs with his hands pressed over his eyes.  You make a grand swooping gesture towards him, and he begins to run, but you catch him anyway.  He screams with delight as you lift him up into the air and playfully gnash your teeth at him.<br>\r\n<br>\r\nWhat do you do next?</span></div></div>",
            "created":1174280400,
            "id":390764,
            "title":"Playing Giant"
        },
        "14112112":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Continue...",
                "Switch to Matt's POV"
            ],
            "content":"<div class=\"\"><div> <span>You walk over to the couch and sit down, setting your son down on your shirtless stomach.  \"Get used to your new home,\" you tell Matt while patting your belly.  Matt just laughs.  Your stomach growls.  You're hungry again.  \"I'll give you a demonstration on what I do to snacks like you.\"  Matt claps his hands at the change in the game.<br>\r\n<br>\r\nYou reach behind the couch and grab a goldfish out of the aquarium.  You hold it by the tail and show it to Matt.  It's about his same size.  Tiny drops of water splash your bare chest as the goldfish struggles to break free of your grasp.  You slowly lower it down into your open mouth.  You make a big show of slurping the fish between your lips.  You open your mouth to show Matt the flapping fish at the back of your throat.  Then, you gulp.  You feel the fish wiggle down your throat.  Matt stares at you wide-eyed.<br>\r\n<br>\r\n\"Daddy, I don't really want to play this game anymore.\"</span></div></div>",
            "created":1174626000,
            "id":392305,
            "title":"Goldfish Swallow"
        },
        "141121121":{
            "choices":[
                "Go and find your daughters",
                "Go outside and find someone else to eat"
            ],
            "content":"<div class=\"\"><div> <span>\"That's tough I'm afraid son.\" you say to the little boy in your hand. \"I'm very hungry and you're very small. Time for us to carry on playing giants. This is the part where you go into my belly!\"<br>\r\n<br>\r\nLicking your lips, you raise Matt up to your mouth and slowly open it. Without hesitating you place his tiny body inside your mouth and seal him inside. You take a second to savour him, rolling him around on your tongue and releasing a loud \"Mmmm\". All the while you can feel him struggling and hear him shouting at you to stop.<br>\r\n<br>\r\nYour stomach growls and you realise you're too hungry to wait for him any longer. You need him inside you now. You use your tongue to move Matt towards the back of your mouth and swallow hard. You feel him slowly move down your throat and eventually plop into your enormous belly.<br>\r\n<br>\r\nYou belch loudly and rub your tummy. You can still feel Matt and the goldfish wiggle and struggle inside you and the feeling makes you smile.<br>\r\n<br>\r\n\"You were just as yummy as I'd hoped, Matt,\" you say to your stomach. \"But I'm still quite hungry. You rub your belly again, thoughtfully. Who can you have for desert?</span></div></div>",
            "created":1263877200,
            "id":822583,
            "title":"Swallowing Matt"
        },
        "1411211211":{
            "author_id":"phoxyphat",
            "author_name":"PhoxyPhat",
            "choices":[
                "Eat both now. They were nice enough to get out some fixings...",
                "Eat one, and save the other for a snack later..."
            ],
            "content":"<div class=\"\"><div> <span>You hear your daughters come home in from outside through the backdoor in the kitchen, and your stomach growls again. You grab your ray, stick it behind your back, and head into the kitchen where you find 12 year old Lilly and 8 year old Amber searching the cabinets for a snack. <br>\r\n<br>\r\n\"Hi Daddy!\" Amber chirps as you come in. Lilly, a moody little preteen, ignores your presence as she pulls out a jar of peanut butter. You just smile as both girls rummage through the fridge. Lilly pulls out a stalk of celery and Amber grabs chocolate syrup and whipped cream. You knew your daughter's favorite snacks well. Lilly was going to slather that peanut butter on a piece of celery, and Amber was partial to ice cream, which she was now pulling out of the fridge.<br>\r\n<br>\r\n\"Hey girls, guess what?\" you say, reaching into a cabinet and pulling out two tall glasses, setting them on the counter.<br>\r\n<br>\r\n\"What?\" Lilly said, finally looking at you. Your stomach growls again, and you step closer to your daughters.<br>\r\n<br>\r\n\"I got something today that I want to show you,\" you answer. Both girls look at you, wondering what you could possibly have. You grin, and quick as a flash, whip out the gun, and use it on the two. The smoke clears, and your now two inch tall daughters look up at you in horror. You reach down, and both scream as you gently scoop them into your hand. You gently set one in each glass.<br>\r\n<br>\r\n\"Dad, what happened!?\" Lilly screeches. Amber just looks as though she's going to burst into tears.<br>\r\n<br>\r\n\"I got this shrink ray today! Isn't it cool?\" you say, almost giddy.<br>\r\n<br>\r\n\"Why did you shrink <i>us</i>?\" Lilly demanded.<br>\r\n<br>\r\n\"Because I want to play a game with you girls. It's a lot of fun, me and Matt played this afternoon.\"<br>\r\n<br>\r\n\"What kind of game?\" Lilly asks suspiciously.<br>\r\n<br>\r\n\"Matt named it 'Giant'. You see, these kids wander into the castle of a giant, and if he catches them, then he gobbles them up. And I've just caught two tasty looking little girls!\"<br>\r\n<br>\r\nLilly's eyes grow wide, and Amber huddles herself on the bottom of her glass. You just grin. What to do with your tiny captives?<br>\r\n<br>\r\n</span></div></div>",
            "created":1353560400,
            "id":1472828,
            "title":"Go and find your daughters"
        },
        "14112112111":{
            "author_id":"phoxyphat",
            "author_name":"PhoxyPhat",
            "choices":[
                "Make an Root Beer/Amber float...",
                "Make an Amber sundae..."
            ],
            "content":"<div class=\"\"><div> <span>\"Now let's see, which tasty little morsel should I eat first?\" You say, in the same deep voice you used while playing with Matt. Lilly looks up at you, then over to her terrified little sister, then back to you.<br>\r\n<br>\r\n\"It's just a game, right Dad?\" she asks.<br>\r\n<br>\r\n\"Of course, sweetie. Just like a fairy tale, you don't need to be scared.\"<br>\r\n<br>\r\n\"Then you can eat me first.\"<br>\r\n<br>\r\nYou grab her glass and dump her into the palm of your hand. You raise her to your face, and playfully gnash your teeth at her. She nervously laughs a little as you tilt your head back, and dangle her over your open mouth. You're about to drop her into your gaping maw, when a better idea hits you. You lower her down to the counter, and grab the jar of peanut butter Lilly had left out.<br>\r\n<br>\r\n\"See, it's okay, Amber. He's just playing a game!\" Lilly assures her sister, not noticing what you are doing. You open up the jar, and reach down and pick her up again. <br>\r\n<br>\r\n\"Wait Dad, what are you doing?\" she asks, right before you dunk her into the jar. You pull her out, flailing as she tries to remove the sticky, sweet goo from herself.<br>\r\n<br>\r\n\"Just preparing my dessert. A sweet, peanut butter Lilly sounds pretty tasty,\" you say.<br>\r\n<br>\r\n\"Dad, you said it was a game!\" She cried.<br>\r\n<br>\r\n\"It is a game, silly! This is the part of the game where the little girl goes into the hungry giant's belly!\" you exclaim, raising her over your mouth again. He dropped her in, and moaned loudly as you licked the peanut butter off of her. She tasted even better than Matt had, mixing pleasantly with the peanut butter. You move her to the back of your throat, and you hear her give one last terrified squeal as you swallow her. She's slow going down your throat, but you eventually feel her land in your stomach. Newer, stronger struggles join your son's struggles, as you turn to your younger daughter. <br>\r\n<br>\r\nAmber has started crying now, scared by watching you devour your sister.<br>\r\n<br>\r\n\"It's okay, baby girl. Lilly's with Matt now, right inside here,\" you say, patting your stomach. \"I can feel them moving inside me.\" Amber cries harder, as you contemplate how to eat your last little girl. Lilly had been so tasty, and Amber was a much sweeter girl, so you were sure she would taste even better. You briefly consider dipping her in peanut butter like Lilly, but then you notice the ice cream, chocolate syrup, and whipped cream still sitting on the counter.<br>\r\n<br>\r\n\"Mmmm, I think I'll make my Amber into an ice cream treat!\" you say cheerfully. You get into a cabinet and pull out a bowl for your ice cream. You're about to dump Amber into the bowl, when you look at her in the glass. You rather like the way she looks in there, not to mention you are a bit thirsty...<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1353560400,
            "id":1472848,
            "title":"Eat both now. They were nice enough to get out ..."
        },
        "141121121111":{
            "author_id":"phoxyphat",
            "author_name":"PhoxyPhat",
            "choices":[
                "Go outside. Some of the neighbors look pretty good...",
                "Wait for your wife to come home..."
            ],
            "content":"<div class=\"\"><div> <span>You set the glass back down, Amber still inside. You open up the container of ice cream, and put three scoops into the glass. You go to the fridge, and grab the bottle of root beer that your wife had bought yesterday. You open it up, and pour it into the glass. It fizzes up, and Amber, who had managed to climb to the top of the ice cream, cried out as she was pulled under by the liquid.<br>\r\n<br>\r\nYou grab a crazy straw from a drawer, and carry your treat into the living room. You watch as Amber resurfaces, trying desperately to grab on to something. She tried to latch on to one of the floating pieces of ice cream, but they just kept melting under her warm little body. You stick the straw into the glass, and she latches onto it.<br>\r\n<br>\r\n\"Daddy, please don't eat me!\" Amber cried as you took a drink.<br>\r\n<br>\r\n\"I'm not going to eat you, silly! I'm going to drink you up!\" you tease, taking another sip.<br>\r\n<br>\r\n\"Daddy, please!\" she begs. You just smile, and stick your finger in the glass. You gently pat her on the head, and then scoop some ice cream up on your finger and lick it off.<br>\r\n<br>\r\n\"Don't worry, honey! You'll have fun in my tummy!\" you assure her before taking another sip. \"You'll have your brother and sister to play with. And with all of this root beer, it'll be like a giant pool inside Daddy.\"<br>\r\n<br>\r\nYou abandon the straw, and raise the glass to your mouth. You take a big gulp, and send about half of the glass's content down your throat. Amber is still left inside, treading frantically, trying to stay afloat. <br>\r\n<br>\r\n\"Yummy, yummy, yummy! Gonna have an Amber in my tummy!\" you tease, taking the straw and poking her round little belly. She squeals in terror as you lift the glass towards your mouth. \"Time to be inside Daddy now, sweetie pie!\" You say, before gulping the rest of the contents down.<br>\r\n<br>\r\nAmber went down much easier than the other two, aided by the beverage accompanying her. You gave a loud belch, as you rubbed you now full stomach. You had to admit, your kids were the best meal you ever had. He couldn't believe he hadn't thought of eating them before the shrink ray. You bet they would have been delicious stuffed and roasted or barbecued. Of course, then you wouldn't be able to enjoy the feeling of them struggling inside you. <br>\r\n<br>\r\nSoon, far to soon, the struggles have stopped, and you're stomach is growling again. You decide to go looking for more people to eat.<br>\r\n<br>\r\nWhere do you decide to look?</span></div></div>",
            "created":1353560400,
            "id":1472869,
            "title":"Make an Root Beer/Amber float..."
        },
        "1411211211112":{
            "author_id":"phoxyphat",
            "author_name":"PhoxyPhat",
            "choices":[
                "Shrink her to 3 inches",
                "Start eating your mice"
            ],
            "content":"<div class=\"\"><div> <span>Several hours later, your wife Ellen comes home from work.<br>\r\n<br>\r\n\"Honey, are you still up?\" she calls out. You go into the front hall to greet her. She is setting her purse down on the table in the hall, and you give her a little kiss on the cheek.<br>\r\n<br>\r\n\"How was work?\" you ask, noticing that she seems to be hiding something behind her back.<br>\r\n<br>\r\n\"Long. Are the kids all in bed?\" she asks. You chuckle and nod.<br>\r\n<br>\r\n\"I tucked them in a while ago.\" She smiles coyly. <br>\r\n<br>\r\n\"Good, cause I brought a little present for you...\" she says, and from behind her back, she pulls out a small grey box. You get excited, because you know exactly what it is. Ellen knows all about your love of swallowing live things, and sometimes brings you home little critters from the pet store. You take the box from her, and sure enough, inside are four tiny white mice, squeaking and sniffing around.<br>\r\n<br>\r\n\"Mmmm, sounds good sweetheart. Why don't you take these little guys upstairs, and I'll be up in a minute?\"<br>\r\n<br>\r\nShe smirks, and takes the box back from you. You know she isn't a big fan of your swallowing habit, but she's supportive, and seeing you so happy makes her horny. You almost always wind up having sex afterwards. As soon as she starts upstairs, you dash back into the living room and grab your ray. You dash up the stairs, and enter your bedroom. Ellen has already stripped into her underwear, and is looking at you with pure lust. You slowly close the door behind you.<br>\r\n<br>\r\nTonight, things are going to be interesting...</span></div></div>",
            "created":1361078220,
            "id":1533729,
            "title":"Ellen comes home"
        },
        "14112112111121":{
            "author_id":"phoxyphat",
            "author_name":"PhoxyPhat",
            "choices":[
                "You reach in to the box and grab a mouse",
                "Ellen giggles and says \"maybe you should just eat me!\""
            ],
            "content":"<div class=\"\"><div> <span>Before she could realize what was happening, you turned the ray on her, and shrunk her to three inches. You eagerly dive forward and grab her off of the bed. She stares up at you in utter confusion.<br>\r\n<br>\r\n\"What the HELL was that?\" she screeched. You couldn't help but be amused by how utterly adorable her efforts to act tough were when she was this tiny.<br>\r\n<br>\r\n\"I got this shrink ray today? Neat, huh?\" She just blinks up at you.<br>\r\n<br>\r\n\"Shrink ray?\" she repeats, looking dumbfounded. <br>\r\n<br>\r\n\"I thought it might make for some fun games tonight,\" you explain, taking a finger and fondling her tiny breasts. Her minuscule nipples perk up, and she smiles up at you. <br>\r\n<br>\r\n\"And what kind of games did you have in mind?\" she asks.<br>\r\n<br>\r\n\"I don't know... we'll come up with something. But right now, I'm hungry. We'll play later.\" You carefully sit her on the nightstand, and lay on your back on the bed, propped up on the pillows. You scoop her back into your hand and set her on your bare stomach. You then grab the grey box, and set it beside her on you stomach. Usually when you do this, you make her lay her head on your belly, and have her listen for the little animal inside. She didn't usually her anything, but with her at this size, every sound will be amplified, and she should be able to hear something.<br>\r\n<br>\r\n\"All righty then!\" you say, rubbing your hands together in excitement. \"Which of these tasty little morsels is the first to get eaten?\"</span></div></div>",
            "created":1361079780,
            "id":1533755,
            "title":"Shrink her to 3 inches"
        },
        "141121121111211":{
            "author_id":"phoxyphat",
            "author_name":"PhoxyPhat",
            "choices":[
                "You catch her",
                "She manages to win"
            ],
            "content":"<div class=\"\"><div> <span>You reach into the box, and pull a little white mouse out by his tail. The animal began to squeal and try frantically to get away. You bring it to your mouth, open wide, and drop it in. You swallow immediately, and the wiggling lump slowly travels down you throat, and lands in you eager stomach. You look down at Ellen, who is staring at you nervously, much like Matt had when you swallowed the goldfish earlier. You suppose it must be a bit scary to see something about your size being swallowed by something over 150 times your size. <br>\r\n<br>\r\nYou decide then that tomorrow morning, after the mice have digested, Ellen will make a great breakfast in bed. Smirking at her, you reach down and gently push her into a laying position on your stomach. <br>\r\n<br>\r\n\"Might as well get comfy, sweetie. You've had a long day,\" you say as you reach into the box and grab another mouse. Ellen rolls on to her side and watches as you down this one as well. God, the feeling of the mice in your gut and her tiny form laying on you are making you unbelievably hard!<br>\r\n<br>\r\nYou grab another mouse, this one fights even harder then the first two, but you manage to get it down all right. <br>\r\n<br>\r\n\"Honey, I'm getting bored. Can't we do something else?\" She groans. You pat her tiny head.<br>\r\n<br>\r\n\"I'm almost done, babe. Then we can play.\" You've been saving this mouse for last. The little animal was very plump, and looked especially tasty. Ellen moans, and stretches out. As she does, she accidentally bumps the box, and it falls to the floor. You quickly set her down on the bed, and dive for the escaping mouse. It's quick, too quick for you, and soon vanishes into a tiny crack in the wall behind the dresser. <br>\r\n<br>\r\nFantastic, it will probably get into the insulation, or worse, the wiring. <br>\r\n<br>\r\n\"Sweetie, I'm so sorry!\" She exclaims as you sit down on the bed beside her. She lays her little head on your hand. \"I promise, I'll get you another one tomorrow,\"<br>\r\n<br>\r\nYou look down at her, and an idea crosses your mind.<br>\r\n<br>\r\n\"Its alright. I just thought of something else we can do...\"<br>\r\n<br>\r\n\"Does it involve you turning me back to normal? It's very boring at this size...\" she asks with a pout.<br>\r\n<br>\r\n\"Well how about we make it a bit more interesting? Chasing that mouse gave me an idea for a game!\"<br>\r\n<br>\r\n\"What kind of game?\" <br>\r\n<br>\r\n\"You'll be the mouse, and I'll be the big, scary, hungry cat,\" You explain, scooping her into your hand. \"If you can escape me for five minutes, you get to do whatever you want to me tonight, and if I win, I get to do whatever I want to you.\" She grins, and nods her head.<br>\r\n<br>\r\n\"Okay, but you better be ready for me, stud, cause I'm gonna win!\"<br>\r\n<br>\r\nYou set her on the floor, and reach for the alarm clock. You begin setting it to go off in five minutes. \"One rule:\" you say as you punch the buttons. \"You have to stay in this room. No crawling into cracks or under the door.\"<br>\r\n<br>\r\n\"No problem!\" she says confidently. <br>\r\n<br>\r\n\"Ready... Set... GO!\" You hit the alarm button and dive to the ground.<br>\r\n</span></div></div>",
            "created":1361083260,
            "id":1533790,
            "title":"You reach in to the box and grab a mouse"
        },
        "1411211211112111":{
            "author_id":"phoxyphat",
            "author_name":"PhoxyPhat",
            "choices":[
                "The next morning, you go next door in search of breakfast...",
                "After a few days, people start coming to look for your family..."
            ],
            "content":"<div class=\"\"><div> <span>She manages to evade you for a while, but you eventually manage to corner her. You snatch her up just as the alarm goes off.<br>\r\n<br>\r\n\"Good job, sweetie!\" she says, panting from exhaustion. You sit on the bed, and lay back down. You set her back on your stomach, and let her catch her breath. <br>\r\n<br>\r\n\"So what are you going to do with me?\" She asks. You smile.<br>\r\n<br>\r\n\"Well, what do cats usually do with the mice they catch?\" You ask. She looks confused.<br>\r\n<br>\r\n\"I don't...\"<br>\r\n<br>\r\n\"They eat them up, don't they? And you're such a yummy looking mousy...\" you explain. She still doesn't seem to understand.<br>\r\n<br>\r\n\"You mean that you want to... EAT me?\" she asks.<br>\r\n<br>\r\n\"That's right. You're so perfect, and you always taste so good...\"<br>\r\n<br>\r\n\"You can't be serious? You just mean you want to eat me out, right?\"<br>\r\n<br>\r\n\"No, silly,\" you say, grabbing her under her arms and bringing her closer to your face. \"I'm going to eat you UP. You're going to spend tonight all snug and warm in my stomach.\" You raise her up, and open your mouth wide...<br>\r\n<br>\r\n\"NO! You can't do this!\" she screams, kicking her tiny legs in the air.<br>\r\n<br>\r\n\"Why not? I said if I won the game, I got to do whatever I wanted to you. You agreed, remember?\"<br>\r\n<br>\r\n\"I didn't know that you were going to EAT ME!\"<br>\r\n<br>\r\n\"You didn't ask. That's not my fault. And besides, since you're the one who let that mouse get away, I think it's only fair for you to replace it.\"<br>\r\n<br>\r\n\"NO! NO!\" she screeched. \"Please, I'll buy you a new one tomorrow! I'll buy you a whole cage of them!\"<br>\r\n<br>\r\n\"But I'm hungry now. I need another mouse in my belly!\" And with that, you open your mouth wide, and drop your screaming wife inside.<br>\r\n<br>\r\nYou suck on her for a while, tossing her about with your tongue. You thought your children tasted good, but they were nothing compared to her! You gently roll her around your mouth, savoring the sweet taste. After a few minutes of bliss, you carefully move her into position and swallow her down. She slowly makes her way to your eager stomach, her brand new home, and you fall asleep with the thought of her curling up safe and warm inside you as she awaited her fate, and her sweet taste still in your mouth.<br>\r\n</span></div></div>",
            "created":1361085480,
            "id":1533809,
            "title":"Down the Hatch"
        },
        "1411211212":{
            "choices":[
                "eat people",
                "swallow the whole town"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You walked outside adn found something shinny, you picjed ut up and found out that it was a growing gun. You zapped yourself with it and you started to grow. You then...</span></div></span></div>",
            "created":1276232400,
            "id":898091,
            "title":"Go outside and find someone else to eat"
        },
        "141121122":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Eaten as part of a sandwich",
                "Swallowed directly"
            ],
            "content":"<div class=\"\"><div> <span>Your dad responds, \"don't worry Matt, I've only gotten started.\"  You don't like the sound of that, but before you can do anything, your dad picks you up, sets you on the table, and traps you with a shot glass.  \"I'll be right back.\"  You curl up and sob quietly, scared of what's to come.  Your dad emerges ten minutes later with a plate of three ham sandwiches.  \"So son, I think you've figured out that I'm serious about eating you.\"  You gasp at this revelation.  \"But, I'll give you a choice.  You can be eaten as part of one of these sandwiches, or you can be swallowed directly.\"</span></div></div>",
            "created":1225083600,
            "id":600327,
            "title":"Your dad is for real"
        },
        "15":{
            "choices":[
                "\"Show\" it to your big brother and sister.",
                "Pay back some old bullies.",
                "Test it out on a neighbors house.",
                "Devour your entire class.",
                "Zap everyone on the street!"
            ],
            "content":"<div class=\"\"><div> <span>For your entire life your appetite has been a thing of amazement to your peers. While you are rather light in build, and stand a mere 5'0, your hunger seems to know no bounds. At first normal food was enough, but slowly new thoughts began to come to you. When you were eight years old you came to realize how much you loved the slight shifting of food within your belly, and you only wished it could be stronger. For a time you began experimenting with pop-rocks and fizz candies, trying to find the perfect way of amusing your stomach. However none of them lived up to expectations. This led you to simply eat bugs. At first the thought was a bit gross, and the taste wasn't so great, but it was rather satisfying. This kept you interesting until a year ago, shortly after your tenth birthday. The tiny bugs just weren't doing it for you anymore, you needed something bigger. From the start you had at times dreamed about eating people whom you did not like, but it slowly became an obsession. As you reached the deepest parts of your longing you recieved the offer. The letter came in a simple envelope with no return address. It contained a schematic for a strange weapon which, it claimed, could shrink anything. With your mouth practically watering you began to put the device together. Fortunatly you were naturally adept with machinery and it did not take long. While still skeptical, you tested the ray on a chair. Sure enough it shrank to a virtually unnoticible size! It felt like a dream, your head spun from anticipation, but you fully intended to indulge your hunger.</span></div></div>",
            "created":1167541200,
            "id":369755,
            "title":"Dream come true"
        },
        "151":{
            "choices":[
                "Save Charlotte for dessert - Mark's first",
                "You've got more in store for Mark later - Charlotte's first",
                "Eat both simultaneously"
            ],
            "content":"<div class=\"\"><div> <span>Downstairs you could hear the TV, and your older siblings laughing at what it was showing. Your brother, Mark, and sister, Charlotte, treated you like dirt. Glancing at the weapon in your hands, you decided they would be perfect targets to properly test it out.<br>\r\n<br>\r\nYou slid down the banister of the stairs and landed with a light thud. Mark instantly shouted, \"Keep it down squirt!\" You hated being called that. You walked into the living room and stood in front of the TV, instantly causing Mark and Charlotte to protest.<br>\r\n\"Move it pipsqueak!\" Charlotte yelled.<br>\r\n\"Yeah, before I force you to move,\" Mark warned.<br>\r\n\"Oh,\" you say, \"I don't think you're in a position to do anything to me.\" You point your shrink gun at your brother.<br>\r\n\"You think your little toy gun can hurt me? I'll show you how to hurt someone.\" Mark jumped off the chair and dived for you, but you were too quick. You fire the gun, hitting him in the head which meant the ray did not affect his clothing. He went from being six foot two to only one inch tall in seconds, and landed in a pile of his own clothes. Charlotte screamed and tried to run out the door, but you fired the gun and hit her back. Her clothes shrunk along with her since the ray hit them, and you were careful not to shrink her as small, stopping once she reached about three inches.<br>\r\n<br>\r\nYou stepped over to her and picked her up, then retrieved your tiny brother. Taking a seat on the settee, you sat quite low so you could put your siblings on your stomach. Charlotte looked quite odd with clothes on, so you grab the top of her shirt and pull forward, tearing it right off, and proceeded to do the same with her skirt and underwear. You rubbed your growling stomach and licked your lips with anticipation. Even though they knew what was going to happen, Mark asked, \"What are you going to do with us?\"<br>\r\n<br>\r\n\"I feel very hungry right now... You would both make perfect meals. But who should I eat first?\" You say with a playful laugh. They cower as your hand moves slowly towards them.</span></div></div>",
            "created":1206939600,
            "id":514921,
            "title":"\"Show\" it to your big brother and sister."
        },
        "1513":{
            "choices":[
                "Door opens - Parents and younger brother return home",
                "Friends knock at the door",
                "Wait until the party tonight..."
            ],
            "content":"<div class=\"\"><div> <span>You sit up and grab one of your siblings in each hand. You throw Mark up in the air first and catch him in your mouth, shortly followed by Charlotte. You squeal in delight just from the feel of them wriggling in your mouth, and cannot wait to finish them off. With one good gulp, both press together hard as they slide down your throat and land softly in your stomach. Nothing happens for a few minutes, until you begin to feel the light patter of a fist against your stomach.<br>\r\n<br>\r\nYou bend over, trying to get your ear as close to your stomach as you can, and grin as you hear the tiny squeaks from your sister. You go back to a lying position and fall asleep to the feeling, smiling all throughout. You wake up a good few hours later, clutching your aching stomach. It's empty and needs refilling.</span></div></div>",
            "created":1207026000,
            "id":515028,
            "title":"Eat both simultaneously"
        },
        "15131":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "Follow Jeff",
                "Stay with parents"
            ],
            "content":"<div class=\"\"><div> <span>                    The front door opens and you hear you're parents and six your old brother come in.  Getting up from the couch you sauntered into the kitchen <br>\r\n\"Hey kiddo\" your dad greeted as he was putting away some groceries.  You just smiled and grabbed a bag of chips and started eating.  \"Don't spoil your appetite dinner will be ready in an hour\" your mom said.<br>\r\nYour dad playfully tousled your hair \"Kyle is a eating machine nothing can spoil his appetite\".  <br>\r\nYour younger brother Jeff giggled at this as your stomach growled.  \" See he's hungry\" your dad stated.<br>\r\n\"Fine he can have the bag of chips\" your mother relented.  \"Now go get Mark and Charlotte\"<br>\r\n\"uh I was so hungry I ate them \" you told your family.  At first all three stared at you in shock then both your parents burst into laughter.  Only Jeff eyed your belly even though he was six he could always tell when you were lying or not.\"OK boys we should get out of the kitchen so mom can start dinner\" your dad shooed the two of you out as he went to the living room.  Jeff went to the room you and he shared to play.</span></div></div>",
            "created":1356066000,
            "id":1492015,
            "title":"Door opens - Parents and younger brother return..."
        },
        "151311":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "Kenny comes over",
                "Suppers ready no guests"
            ],
            "content":"<div class=\"\"><div> <span>                You followed the younger boy to your shared bedroom.  Jeff started to play with some toys as you laid down on your bed.  \"Did you really eat Mark and Charlotte\" Jeff asked?<br>\r\n\" Yep\" rubbing your belly \" I digested them both\".  He looked at you with awe \" Can I see you eat someone\" he pleaded?  Staring at your younger brother you smiled at his request.  \"sure who should I eat\".  Jeff scrunched up his face as he thought of his answer.  \"I know how about Kenny\".  \" whose Kenny\" you asked?  \"He's my sometimes friend, when he let's me play with his toys he's my friend \"  Jeff said.  \"And he's not your friend right now\" You interrupted knowing Jeff could talk in circles if giving the chance.  \" Yes so you should eat him\"  \"Ok let's invite him over\"</span></div></div>",
            "created":1359694800,
            "id":1521756,
            "title":"evil little brother"
        },
        "1513111":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "shrink Kenny",
                "shrink both boys"
            ],
            "content":"<div class=\"\"><div> <span>                         Jeff ran to use the phone to call his friend to come over.  You eagerly stroked the shrinking gun anticipating your next meal.  Your brother came back with a smile on his face \" He's coming over\" he jumped up excitedly.  \" Whoa simmer down \"  You pushed him down on his bed.  Jeff just looked at you ready to burst with excitement.  You laugh inside your head when the door opened.  Seeing a blonde green eyed boy who was slightly chubby.  \" You must be Kenny\" you greeted him .  \"What do you want\" he snapped.  Turning to look at Jeff you and him had a silent conversation about the fact that Kenny was a jerk.  No wonder Jeff wanted you to swallow him.  Well time to get to business.</span></div></div>",
            "created":1359781200,
            "id":1522325,
            "title":"kenny"
        },
        "15131111":{
            "author_id":"peacefrostwolf",
            "author_name":"frostwolf",
            "choices":[
                "can you eat the school?",
                "can i eat someone?"
            ],
            "content":"<div class=\"\"><div> <span>you decide that you should listen to your little brother. You pull out the shrink gun and blast him. He swaers at you but it gets harders to hear as he gets smaller. You pick him up and shove down your throat gulping hungrly. Kenny burts something out so fast you can barely hear him. You slap your stomach and he shuts up. Then Jeff tells you something that you make out as</span></div></div>",
            "created":1360189620,
            "id":1526029,
            "title":"shrink Kenny"
        },
        "151311112":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "a friend",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>                           Jeff watched in rapt amazement as you swallowed his former so called friend.  \" Could I eat someone\" he asked?<br>\r\n\" sure, who do you have in mind\"  \" How about  one of your friends\"    Thinking it was fair as you had eaten one of his.  \" Do you have a preference\"</span></div></div>",
            "created":1360480260,
            "id":1528797,
            "title":"can i eat someone?"
        },
        "1513111122":{
            "author_id":"peacefrostwolf",
            "author_name":"frostwolf",
            "choices":[
                "You set up a chain reaction and shrink him",
                "Your plan for revenge first begins"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I have this one friend named Kev. You could eat him.\" You think excidetly, seeming as he was a bully. You call him over and hurringly make it sound like a good deal to him. He says he will crush you in an hour, plenty of time for you.</span></div></span></div>",
            "created":1360619220,
            "id":1530047,
            "title":"someone else-enemy"
        },
        "15131111222":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "Little brother's meal",
                "second thoughts"
            ],
            "content":"<div class=\"\"><div> <span>       Kev came over ready to pound you.  \"Hey stupid ready to be beaten\" he sneered.  \" Ready to be eaten you told him\" With that you shrunk him down to an inch quickly grabbing him you handed the shrunken bully to your brother.  \"Enjoy your meal\"</span></div></div>",
            "created":1364634540,
            "id":1560553,
            "title":"Revenge"
        },
        "151311112221":{
            "content":"<div class=\"\"><div> <span>Your cute kid brother held the tiny screaming Kev by the shoulders up over his head. The six year old licked his lips, giggling at the red-in-the-face bully swearing up a storm. You can't help but get in one last jab at the bully who made your life miserable for the past few years. \"So long, Kev - you always were a piece of shit! Now you're just lucky my kid brother's got the stomach to turn you into one!\"<br>\r\n<br>\r\nJeff looks at you accusingly. \"You're not supposed to swear, Kyle!\"<br>\r\n<br>\r\nYou hold your hands up in defeat. \"Okay - whatever - sorry. Just go ahead and do it.\"<br>\r\n<br>\r\nJeff glances up at his struggling meal. \"But he's right, you know. You're gonna be my poop. Hold your nose - you're gonna be real stinky!\"<br>\r\n<br>\r\nKev doesn't get a chance to answer; he just screams as he plummets into your brother's open slimy mouth. \"Don't forget - you have to swallow him whole, Jeff.\" You remind him before he has a chance to crunch down and end the fun. He dutifully flashes you and okay sign with his fingers as he slurps and sucks on his sweaty shrunken treat. Finally, he tilts his head back and with a comical GULP rids the world of another bully. Smacking his lips, he sighs in contentment as his morsel splashes down to his doom. \"Man, Kyle - he was a real potty mouth - it's a good thing he's headed for the potty!\" <br>\r\n<br>\r\nHehe - sure thing, bud. You say, rubbing your own belly as it goes to work on your shrunken siblings and the very unfortunate Kenny - all of whom stopped moving a few minutes ago. Speaking of which...<br>\r\n<br>\r\n\"You still feel Kev moving around in there? That's why I told you to swallow him alive.\" You tousle your brother's hair. He burps in your face. \"You gross weirdo!\" You say laughing and playfully socking him in the arm.<br>\r\n<br>\r\n\"Hey - Kyle - how long will I feel him in my tummy?\" Jeff asks. <br>\r\n<br>\r\n\"Well...\" you calculate mentally. \"If you keep gulping down air like you're going to make yourself burp... which I KNOW you can do...\" you roll you eyes to Jeff's giggles. \"Then... I guess for a couple more hours until he's so digested and melted he can't do much else... Oh, and...\" you lean in and whisper for effect, \"you'll get a kick out of this... keep an eye out for bones.\"<br>\r\n<br>\r\nJeff's eyes go wide and he pulls his shirt up to examine his slightly paunchy belly. \"No - not through your skin, you doof! In the toilet tomorrow.!\" <br>\r\n<br>\r\nChristmas has come early for your younger brother - the idea is at once so disgusting and so pleasing to him, that he falls into a fit of giggles. He saunters off, still rubbing his belly. \"Come on, Kev - you and I have a long night to do...\"<br>\r\n<br>\r\n----------------<br>\r\nThe next afternoon, your parents are still worried about your missing siblings - but you don't miss them - having sent them off that morning along with Kenny. All it took was a flush. First, you snapped a pic to show to Jeff, who was so pleased to be rid of his worthless friend and mean brother and sister, he decided to repay the favor. Texting on your bed, you're interrupted by Jeff who grabs your arm excitedly and drags you to the bathroom. The smell hits you right away. He giggles as you reel from the reeking fumes. \"hehe- I told 'im he'd be stinky - look at all those bones!\" Sure enough, floating in the toilet are the remains of Kev the bully - entombed in a couple of your kid brother's slimy brown turds.<br>\r\n<br>\r\n\"Adios, Kev, you piece of shit.\" You say spitefully.<br>\r\n<br>\r\n\"Ooh! I'm telling!\" Jeff says racing out of the bathroom without flushing.<br>\r\n</span></div></div>",
            "created":1511587800,
            "id":2419916,
            "title":"Little brother's meal"
        },
        "15133":{
            "choices":[
                "You can't help yourself - Shrink dad now",
                "Fun times at the party..."
            ],
            "content":"<div class=\"\"><div> <span>You remember that tonight your parents are hosting a party at a nearby place in town, and they were out setting it up. It's a good job they did not have to come home for anything, you think. You think of all the people that are going to be their. All those wriggling bodies in your stomach... The thought of it made you shiver. You patted your empty stomach and occupied yourself with other things until 7 o'clock, when your dad briefly returned home to pick you and your brother and sister up.<br>\r\n<br>\r\n\"Kids! Come on, party starts in half an hour!\" He shouted, and was annoyed when he only saw you ready. \"Kyle, where's Mark and Charlotte?\"<br>\r\n\"They told me they were going out to meet some friends,\" you lied, \"They didn't want to go to the party anymore.\"<br>\r\n\"Stupid pothead teenagers of mine,\" your dad sighs, \"Well, you still want to go, right?\"<br>\r\nYou nod your head.<br>\r\n\"Excellent! Come on, I'll get you an ice cream.\"<br>\r\n<br>\r\nPerfect, you think. An ice cream would go well with some human sprinkles.</span></div></div>",
            "created":1207026000,
            "id":515032,
            "title":"Wait until the party tonight..."
        },
        "151331":{
            "choices":[
                "Wait around - Mum returns wondering where everyone is",
                "A whole street in your room"
            ],
            "content":"<div class=\"\"><div> <span>Come to think of it, why mask the delicious taste of people with ice cream, you think as your dad leads you out of the door. He gets in the car.<br>\r\n\"Come on, we'll be late!\"<br>\r\nYou fire the gun at the car and stare in wonder as the car and its contents decrease in size. Your dad looks out in terror as he watches everything around him get bigger, and screams when he sees you licking your giant lips right outside the car window. Lying flat on your stomach, you place your finger on the roof of the car and giggle, thoroughly enjoying your dad's terrified screams and expressions as the roof easily crumples. You push in the back side first then slide your finger across the roof towards your dad's seat, pushing him as far forward as you could without injuring him too badly. You still want him alive enough to wriggle in your stomach.<br>\r\n<br>\r\nOnce he appears completely stuck, you pinch the roof together and peel it away, revealing your tasty frightened morsel. You pluck him from his seat, hurting him slightly as you tear him away from his seatbelt. However unknown to you your dad currently holds a large shard of glass he managed to grab before you lifted him, and as you hold him over your mouth he throws in the shard. It slices through your tongue quite deep, making you scream in pain and in turn you drop your dad.<br>\r\n<br>\r\nYou pull the glass out and grab a small amount of your tshirt and shove it into your mouth, applying a lot of pressure onto the wound. Your dad tries to make a run for it, but your free hand is too quick for him, and you slam down upon his fragile body hard, although just soft enough so he was still alive.<br>\r\n\"Mow 'oo 'istem 'ere,\" your voice is incredibly muffled through the t-shirt, and the dark tone your voice has is visibly distressing your father, \"'o amyfin' 'ike fat again an' 'our 'ast memory will be of flyimg fas' an' far through the air!\"<br>\r\n<br>\r\nYou wait until the bleeding slows to a trickle before placing your father above your mouth again. You dropped him in and closed your mouth around his two inch tall body. Not taking too long to play with him in your mouth, since your tongue was still bleeding slightly, you swallow him and sigh as he falls down your gullet. You bend down to face your stomach.<br>\r\n\"Say hello to Mark and Charlotte for me!\" You say and giggle.</span></div></div>",
            "created":1207026000,
            "id":515126,
            "title":"You can't help yourself - Shrink dad now"
        },
        "1513312":{
            "choices":[
                "Continue uninterupted",
                "Mum comes home, looking for your missing dad"
            ],
            "content":"<div class=\"\"><div> <span>You had a crazy idea, one which you just had to live out. You fired the gun at every building on your street. You jumped up and down clapping your hands at your handy work, unable to contain your excitement. You run around collecting the houses, having to make multiple trips to get them all into your house. Eventually you have filled your living room with your entire street.<br>\r\n<br>\r\n\"Hello!\" You bellow, sending everyone into panic, \"I am Kyle, your new master! Firstly, let me tell you the rules. If you disobey a command, you will die. If you true to escape, you will die. If you resist against me making physical contact with you, you will die.\"<br>\r\nAlready two people, two teenagers who were friends of your sister, started running across the carpet. You easily snatched them up without leaving your eye from the little street you had stolen.<br>\r\n<br>\r\n\"Apparently, you need a demonstration. If you abide by my rules, this won't happen to you.\"<br>\r\nYou lift the first teen up, a girl about the age of 16, and place her waist high in your mouth. You suddenly begin to suck, hard, causing first her clothes to fall off, then her legs to tear right from their sockets. You spit the girl out, allowing the remaining half of her body to land and roll across the carpet, through your little street.<br>\r\n\"That could be your fate... Or this could be.\"<br>\r\nYou take off your sock, which you've been wearing for over a week now. You weren't overly fussed if your feet smelled. You take the second teen, a boy of age 17, and put him in, then your foot quickly follows.<br>\r\n\"He will spend the day in here while I play with you all. Remember, there are many other places I can put you too. I suggest you don't test me to find them out.\"<br>\r\nTo show your strength, you lift up the building the two teens ran out of and crush it between each hand, allowing the debris to fall into your street. You also notice two now dead bodies of a middle aged couple fall too.<br>\r\n\"That was just bad luck for them. Right. Okay everyone, get into your houses.\"<br>\r\n<br>\r\nThe rest of the street, probably around fifty people living in twenty houses, reluctantly entered their houses by your command. The power you had over them felt incredible. You pick up the other half of the girl whose legs you tore off, and decided to finish her off. She was barely moving, but just the thought of her being in your stomach was enough.</span></div></div>",
            "created":1207371600,
            "id":516531,
            "title":"A whole street in your room"
        },
        "151332":{
            "choices":[
                "Tomorrow...",
                "On the way home..."
            ],
            "content":"<div class=\"\"><div> <span>You sit in the corner of the hall, licking away happily at your ice cream. The music is incredibly loud, but you don't mind. You've always loved loud thumping music, since the bass sent vibrations through your stomach. In your pocket you feel the shrink device, and you are ready to whip it out and begin shrinking people, but you need to wait for an opportunity when everyone is in the room.<br>\r\n<br>\r\nYou think back to shrinking your brother and sister. Hitting the clothes made them shrink with them, but hitting skin left the clothes alone. You wonder if shooting the building outside would affect everything inside it too. Strolling outside, you experiment and shoot the building briefly, reducing it to three quarters its normal size. Peering through the window, you laughed as you watch the midgets dancing around, all of them completely oblivious to their reduced size. You step back and continued to fire the gun, your laughs getting louder and louder to them until it was a huge rumble. The electrics of the building quickly stopped working as electrical wires were being shrunk and pulled away.<br>\r\n<br>\r\nThe sounds of panic that filled the building fill you with joy, and you take a step toward the shrunken building, slamming your foot down as hard as you can. Everyone inside toppled from the shock, and began to scream hysterically as you crouch down to peer through the windows. You slowly lick your lips as you lift the building with ease. You remove your parents from the building and place them in your ice cream, then fire the gun at the building again, reducing it further. Once it was the size of a large bottle, you tear one side off and pour the many party goers into your mouth like a drink. They feel weird as they slid down your throat, being no where near as difficult to swallow as your siblings. The eighth of an inch tall people's screams went unheard, and their tiny size only made it a filling meal. The real pleasure would be from your currently four inch tall parents.<br>\r\n<br>\r\nYou reduce the building even further so you can fit it in your mouth, and chew on it. Anyone left inside exploded in tiny dots of blood which you can just about taste as you swallow. Once you finish the building, you grin at your shivering, ice cream covered parents. You lift your ice cream and walk away, licking them while happily humming.<br>\r\n<br>\r\n\"Son, what have you done!?\" Your father screams furiously. You just look at him in awe. How can someone so small still fight, you think.<br>\r\n\"What I have done is shrunk you down, along with your friends, and eaten them. Now I get the pleasure of eating you too!\"<br>\r\n\"Kyle, please! Don't! Why would you eat your own parents?\" your mum asks, a lot calmer than your dad.<br>\r\n\"I've always loved the wriggly feeling food gives me. Unfortunately, as I grew older, satisfying that need for the feeling got harder because my stomach got increasingly larger. So I started eating bugs, but even they got too small for me. Now, with this device,\" he showed his parents the control, \"I can satisfy it as long as people and animals inhabit this planet.\"<br>\r\n\"You can't do this Kyle, it's wrong!\"<br>\r\n\"Then why do I feel so good when I do it? If it's wrong, I love being bad!\" You then grab your mother from the ice cream and lick her clean, ignoring her protests. Once you got all the ice cream off, you finished her off.<br>\r\n\"Son, Kyle, please, don't eat me!\" your father pleaded.<br>\r\n\"But I'm still hungry! I didn't eat any lunch so I would have room to eat everyone here!\" You chomp down on the ice cream around your dad, lifting him up in your mouth. You hold him in your mouth as the ice cream melts and dribbles down your throat. Upon swallowing you get a horrible feeling in the back of your mouth.<br>\r\n<br>\r\nYour dad had grabbed hold of your uvula and was using it to prevent him from being eaten. The resulting tugs caused you to throw up, releasing your mother from her prison. At least the other people you ate had already dissolved because they were too small to survive your stomach acids. You picked up the sick soaked man sprawled over the floor.<br>\r\n\"My food is only allowed to fight once it gets to the stomach!\" you scream, causing you dad to clutch at his now ringing ears. In anger, you tighten your grip and wind your arm back, flick your entire body around and release your dad, sending him flying incredibly far through the air. He landed about fifty metres in front of you with a tiny squelch. You snatched your mother up and swallowed her again, and now her struggling inside your stomach felt even better as there was no acid left to suppress the tiny movement of her feet.<br>\r\n<br>\r\nYou walk away, rubbing your stomach, and return home. It was getting late anyway, and tomorrow would be a whole new feast.</span></div></div>",
            "created":1207026000,
            "id":515046,
            "title":"Fun times at the party..."
        },
        "1513322":{
            "choices":[
                "Let her leave... Tomorrow the fun continues...",
                "Give in to your lust - Shrink her now"
            ],
            "content":"<div class=\"\"><div> <span>You can not help yourself. You could not go a whole night without feeling something wriggling around. As you reach your home, you notice someone was at the door. It was Alice, the daughter of the people next door. Your brother Mark had been going out with her for a while, and his hatred of you had rubbed off on Alice.<br>\r\n<br>\r\n\"Hey, brat!\" She calls across the road at you, \"where's your brother at? We were supposed to be going to see a film while the folks were partying.\"<br>\r\nYou chuckle, remembering you thought you had lied to your parents, telling them that Mark did not want to go to the party.<br>\r\n\"I guess I should tell you the truth. I ate him,\" You reply, grinning as you close in on Alice.<br>\r\n\"Don't joke about that, you sick brat!\"<br>\r\n\"Who's joking?\" You ask as you point the gun at her, aiming for her face.<br>\r\n\"Uh... What's that?\" She asks nervously.<br>\r\n\"It's a shrink ray. I am going to shoot you with it and you will shrink to about three or four inches tall. I will then swallow you, as I am quite hungry thanks to my dad.\"<br>\r\n\"You ate your parents!?\" She asked, sweating and shaking.<br>\r\n\"Only my mother. My dad decided to grab onto the dangly thing at the back of my mouth and made me throw up, so I threw him as far as I could. He smashed across the pavement with a nice small squelch.\"<br>\r\n\"Kyle, you're really freaking me out, let me go home, please,\" she pleaded as she started to move away from the door.<br>\r\n\"I can't let you do that, you know too much.\"<br>\r\n\"I don't even know if that gun of yours works, but please, let me go home, I promise you I won't say anything to anyone.\"<br>\r\nYou think this over... Maybe you should wait until tomorrow. The wait might make her feel better in your stomach.</span></div></div>",
            "created":1207112400,
            "id":515342,
            "title":"On the way home..."
        },
        "15133221":{
            "choices":[
                "Rudely woken by the doorbell",
                "You wake up peacefully normally"
            ],
            "content":"<div class=\"\"><div> <span>You answer her, your tone and facial expression incredibly low and dark, scaring even yourself, \"Fine, go. But if I find out you've mentioned a word of this to anyone, I will do things to you that not even your worst nightmares can live up to.\"<br>\r\nShe did not say anything, but Alice nods slightly as if to say thank you. You turn your head to follow her movements all the way to her house. You stare through the windows and just about see that she goes straight to her bedroom. You walk into your house and head up to your brother's room whose window faces Alice's.<br>\r\n<br>\r\nAfter struggling to pull Mark's large bed towards the window so you can keep an eye on Alice, you lie down and watch her climb in to bed. She notices you watching and goes to close the curtains, but a simple shake of the head makes her turn back to bed.<br>\r\n<br>\r\nAfter a few hours your young brain switches itself off and you fall fast asleep, however Alice stays awake in fear of what you have in store for her tomorrow.</span></div></div>",
            "created":1207112400,
            "id":515419,
            "title":"Let her leave... Tomorrow the fun continues..."
        },
        "151332211":{
            "choices":[
                "Alice",
                "Alice's parents"
            ],
            "content":"<div class=\"\"><div> <span>You jerk awake when the doorbell rings loudly, it's horrible noise passing through the entire house. Mark's room was the furthest away from it too. You angrily slide your feet along the floor and make your way slowly downstairs, shrink gun in hand, not caring who it was who rang. As you open the door, you reveal...</span></div></div>",
            "created":1207198800,
            "id":515589,
            "title":"Rudely woken by the doorbell"
        },
        "1513322112":{
            "choices":[
                "Alice is unaware of what her actions made you do",
                "Alice had prepared for your arrival"
            ],
            "content":"<div class=\"\"><div> <span>...Alice's parents!? \"That bitch!\" you mutter.<br>\r\n\"Excuse me, but where are your parents? We want to talk to them about your, quite frankly, rude and inadequate behaviour.\"<br>\r\n\"I'm sorry, they're not available.\"<br>\r\n\"Well then, we'll just talk to you. We do not accept little kids scaring our daughter with your stupid fantasy ideas of shrink guns. She's a teenager for crying out loud! She shouldn't be coming to us at three in the morning, waking us up, explaining how her ten year old-\"<br>\r\n\"Eleven year old,\" You correct them.<br>\r\n\"-Eleven year old neighbor is going to shrink and eat her. Explain yourself!\"<br>\r\n\"Well... If you insist.\" You pull the shrink gun out and shoot them both, giving neither a chance to react. Instinctively you place your bear foot on them, knocking both onto their backs and trapping them under your huge toes.<br>\r\n<br>\r\n\"That idiot daughter of yours is going to get it. I warned her, very specifically, that if I found out she told anyone, I would destroy her. I'm not giving her any chances. She blew her only chance. You two will be the first part of her punishment.\" You pick up your tiny neighbors and bring them with you to their home. The door was slightly open, so you barged through it.</span></div></div>",
            "created":1207198800,
            "id":515592,
            "title":"Alice's parents"
        },
        "15133221122":{
            "choices":[
                "Alice lets you live",
                "Alice feels it's too dangerous to keep you alive"
            ],
            "content":"<div class=\"\"><div> <span>\"ALI-oof\" You started to scream angrily, but as you push through the slightly ajar door, a brick falls from it's place on top of it and hits you square in the head, knocking you unconscious.<br>\r\n<br>\r\nAbout an hour later, you slowly wake up, hoisted very high up above the ground. Your hands were tied to a sheet of cardboard with string and paper clips to hold your naked form there, and a small amount of blutack attaching you to the ceiling. You could already feel the cardboard beginning to slip, so you refrained from struggling, it wouldn't matter if you broke free anyway. It was a clear hundred foot drop to the carpet below, and you didn't want to risk how soft the landing might, or might not, be.<br>\r\n<br>\r\nLooking around, you could tell that the bed in the corner of the room was Alice's, so you guessed you were in her room. At that moment the door swings open, and Alice and her regrown parents enter the room through it.<br>\r\n\"How did you get them back to normal?\" you ask.<br>\r\n\"It's not difficult to reverse a circuit. Luckily the design allowed me to simply put the batteries in the wrong way and it worked. Now,\" she throws the device across the room, smashing it into many pieces across the wall.<br>\r\n\"NO!\" You scream.<br>\r\n\"You were stupid to come here. You think I would not have prepared for your arrival? Stupid brat.\" She slams her fist into your stomach. You were about six inches tall, so the punch wasn't too damaging, however the way she kept her fist there and ground you into the ceiling did hurt. Apparently it was just to fix the blutack a bit better.<br>\r\n<br>\r\n\"Alice,\" her parents said simultaneously, \"We're sorry.\"<br>\r\n\"For not believing you about that freak,\" her dad continus, pointing at you.<br>\r\n\"It's alright, I could barely believe it myself. But now, we get to decide how we will punish him.\"<br>\r\nAlice reaches up and curls her fingers around your back and tugs, releasing the grip of the paperclips on the cardboard. As she holds you, the paperclips pull heavily on your arms, but she only smiles at your cries of pain.<br>\r\n\"You, little boy, need to learn that being small isn't a good thing.\"<br>\r\n\"What... What are you going to do with me?\" You ask nervously.</span></div></div>",
            "created":1207198800,
            "id":515593,
            "title":"Alice had prepared for your arrival"
        },
        "151332211221":{
            "content":"<div class=\"\"><div> <span>\"Hmm... You know, I've always wanted a new pet. Can I keep him mum?\"<br>\r\n\"That brat deserves it! Of course you can dear.\"<br>\r\nAlice squeals and pulls out her old hamster cage. It was covered in dust but mostly clean.<br>\r\n\"What happened to the hamster!?\" you squeak. You're ignored as you are lifted and placed roughly into the top hatch of the cage. You land in a heap on the floor, rolling around randomly as Alice dumps the cage on her bedside table. The dust jumps into the air, making it hard for you to breath for a while.<br>\r\n<br>\r\n\"Just remember to take good care of him. Wait... What am I saying? Treat him like the pile of dirt he is,\" her mother says before she leaves with Alice's father. Alice lies on her bed and looks into the cage.<br>\r\n\"You look incredibly cute at that size. All small and helpless. Think, if I, say, forget to refill your water bottle or neglect to feed you, you'll pass away slowly and horribly. With just water, you'll last about a week without proper nourishment. That would make up for all the people you've eaten.\"<br>\r\n<br>\r\nDespite her warnings, Alice grew quite attached to you, fed you regularly and properly and took care of you like a proper pet. Unfortunately, that's exactly how she treated you for many of the early years, as a pet. She would rarely say anything to you, anything she did say would be incredibly patronising, and she would stroke and play with you like a pet. It wasn't until a few years later that she started properly talking to you again, during your mid teenage years, however the conversations were often short and normally ended in Alice using your small body for her own personal pleasures. These were often the only times you felt were worth it, but the novelty of being used to pleasure a giantess wore off as she got more vigorous with you. Apparently the reduced size also increased your metabolism, although you were careful about asking for more food when you finished off a bowl. The few times you ever did, or anything that angered Alice including one attempted escape, involved a harsh punishment, ones which left you an almost immobile cripple for days on end.<br>\r\n<br>\r\nDue to your metabolism increase, you eventually started to die at about 22 years old, when Alice was 28.<br>\r\n\"I hope you enjoyed your life, my little pet. I hope you enjoyed having it taken from you. And I sure as hell hope you enjoyed having to live without that life.\"<br>\r\nThose are the last words you hear from her. The last thing you see is a large hand pulling you out of your cage and dangling you over a giant mouth. Feeling old and tired, and knowing she was right, that your life had been wasted, you don't bother fighting.<br>\r\n<br>\r\nYou don't even make a peep as Alice's stomach slowly digests you, despite the horrible pain.<br>\r\n<br>\r\n\"Sorry,\" you whisper, as if talking to all the people you ate all those years ago, \"Sorry for taking your lives.\"<br>\r\n<br>\r\nYour vision goes black as guilt overwhelms you and your pathetic life ends.</span></div></div>",
            "created":1207198800,
            "id":515596,
            "title":"Alice lets you live"
        },
        "15133222":{
            "choices":[
                "Eat her",
                "Keep her as a pet"
            ],
            "content":"<div class=\"\"><div> <span>Your stomach was leading your actions, and makes your finger pull the trigger. She shrinks out of her clothes and lay trapped under a small t-shirt and once skin tight trousers. You fish through them and found her cowering naked body, staring in awe at her beauty. Even at only eleven years old you could see she was stunning, and could see why your brother liked her so much. You chew your bottom lip while licking across the back of it as you probe her body with your finger, wondering if you should sate your hunger, or perhaps do something different with her.</span></div></div>",
            "created":1207112400,
            "id":515343,
            "title":"Give in to your lust - Shrink her now"
        },
        "151332221":{
            "author_id":"worruuu",
            "author_name":"Worru",
            "choices":[
                "You hear knocking at the door.",
                "You wake up even hungrier."
            ],
            "content":"<div class=\"\"><div> <span>\"Say... you were looking for my brother weren't you. Well, you two can be reunited in my stomach. Kinda.\"  You 'reassured' your brothers girlfriend. You lifted her above your mouth and slathered your tounge across your bottom lip once more, she frantically contested against your powerful fingers and screamed. \"NO PLEASE. DON'T DO IT. IF-IF YOU EAT ME MY PARENTS WILL GET YOU!!\" <br>\r\n\"Fine by me, I'll eat them too!\" You released the tension after that cold statement. She tried pleading for more time but her pleas were silenced as soon as you snapped your mouth shut with a 'click' she was roughed about in your mouth as your tounge got to work on absorbing her flavour. You were aroused by her sweet taste, your brothers girlfriend was now yours to take. You tilted back and swallowed. She was swiftly sucked down your throat- which you traced with your index finger in pleasure down to your stomach which gurgled in response of receiving it's new snack. She patted against your guy but it was meaningless. She'd be a tasty soup in a few minutes. You let out a few burps satisfied by your efforts throughout the day and went to your room to sleep. Inside your gut she screamed as the liquids began to degrade he beauty and make it yours... *BUUUURP* you bellowed her last breaths into he night...</span></div></div>",
            "created":1571425800,
            "id":2734915,
            "title":"Eat her"
        },
        "153":{
            "choices":[
                "Your family returns home",
                "Your friends are at the door... Perfect!",
                "Rampage - Shrink everyone in town!"
            ],
            "content":"<div class=\"\"><div> <span>You paced around your room, head still spinning. You had a working shrink gun! All the possibilities went through your head, however your thoughts kept turning to your next door neighbors. They had never been particularly nice to you or your family. A grin spread across your face as you thought of the gruesome revenge you could get on them if they were only a few inches tall.<br>\r\n<br>\r\nLuckily your house was detached and had a side window which faced your neighbor's house, meaning you did not have to go outside and possibly reveal your new weapon to anyone. Not entirely certain if it would work, you fired the gun at the bricks of the house. A thin blue beam shot out and began to spread, covering the entire house. Once the house was glowing in a thin blue light, it rapidly diminished in size. You didn't want to shrink it too much, as devouring your neighbors wouldn't be much fun if they were too small.<br>\r\n<br>\r\nYou let go of the gun and looked down at the house. It was barely two feet tall. You quickly run out and pick the house up, being careful not to damage your meal inside. Surprised at how light weight and fragile it is, considering your grip was cracking the walls quite easily, you gently place it down on your bedroom floor. No one else was in the house, meaning you could have a lot of fun without interuptions.<br>\r\n<br>\r\nYour stomach began to rumble and your mouth began to water in anticipation of what was to come. You slowly peeled away the roof of the house which many would mistake to be a dolls house now, and looked inside. You lick your lips at the many tasty meals, thoroughly enjoying the fact your neighbors decided to have a few friends round. Already your neighbors were screaming and quickly fled downstairs, but you knew that wouldn't be enough to save themselves. You tore away the second story, revealing around ten people, all huddled together in a corner. The man of the house, Eric, stood up having realised who you were.<br>\r\n<br>\r\n\"You're that kid from next door! Kyle! What are you doing!?\" Eric was in obvious panic, but you did not care. All you could think about was the emptiness of your stomach and how these tasty people were going to fill it. You plucked the frightened man between your thumb and forefinger and slowly brought him up to your mouth. Opening wide, you tilted your head and hung him over it, hesitating for a few seconds before dropping him in. His screams quickly quietened as you started playing about with him with your tongue. It ran over his tiny, wriggling body, each time giving you a slight shiver of pleasure. Not being able to wait any longer, you sealed the man's fate and swallowed Eric, gasping in happiness as you feel the man's fighting body creep down your throat. He landed in your stomach with a tiny plop and began thrashing around, trying to punch his way through your stomach walls, trying to cause some form of pain, unknown to him that this was exactly what you wanted.<br>\r\n<br>\r\nYou lower your eyes down to the remains of the house, scanning across the small selection of three inch tall snacks. You began to feast, picking them up one by one, playing with them in your mouth for a bit before swallowing. The last thing you ate was Alice, the girl you knew your older brother had a great crush on. She was sixteen and if you were a bit older, you would probably find incredibly attractive. However right now she was just a very good looking wriggling meat stick. You did however take more time on her, half as a way of getting back at her for being horrible to you whenever she visited to see your brother, and as a way for getting back at him for displaying the same attitude all the time. You stripped her of her clothes and began playing with her body like a toy, moving her limbs into different positions. When you brought her up to eat her, you licked her entire front body slowly, allowing her tiny breasts to rub against your taste buds. The feeling was good, but you knew there was a much nicer feeling, and you proceeded to finish her off by throwing her into the air and catching her in your mouth, and swallowing her quickly.<br>\r\n<br>\r\nYou picked up the broken house and hid it under your bed so anyone who comes into your room won't get suspicious. It was already bad enough that an entire house had disappeared from the street. You pick the gun up and smile, wondering what you should do next with such power.</span></div></div>",
            "created":1206939600,
            "id":514913,
            "title":"Test it out on a neighbors house."
        },
        "154":{
            "choices":[
                "Keep him big, shrink the next person who comes in for him",
                "To hell with this, shrink him",
                "Unexpected - Oliver steals the gun off you"
            ],
            "content":"<div class=\"\"><div> <span>You decide that it would be fun to wait until tomorrow, when school starts. Finally, a Monday that isn't so boring!<br>\r\n<br>\r\nYou sleep incredibly peacefully through the night, and are the first to be ready tomorrow morning. Your older brother and sister look at you with disgust, while your younger brother just makes spit bubbles at you. The older ones start to mock you for being a nerd, but you don't care. The funny thing is that both your older siblings went to your school albeit in the last year group while you only just started high school a month ago. The new kids were always treated badly by the older kids. Today you were going to show them who's boss.<br>\r\n<br>\r\nAs your parents drop you and your older siblings off you smile and walk with a proud stride in your step. Your best friend sees you and questions your happiness, so you get him to follow you to the toilets. Oliver, your friend, is a short, skinny, stereotypical nerd, minus the glasses. He has very short blonde hair and green eyes and he currently wore a pair of thin army camo shorts and a dull green t-shirt.<br>\r\n<br>\r\n\"Why did you bring me in here?\" he asks.<br>\r\n\"You wanted to know why I was so happy, and this is why,\" you reply as you rummage through your bag and pull out the shrink device.<br>\r\n\"Whoa, that's a cool toy. It's like a phaser gun!\" Oli said.<br>\r\n\"It's better than that. Watch what happens when I shoot something.\" You see one boy just finishing up on the toilet. He is a few years older and shoves past both of you. You shoot him in the back just before he gets out the door and Oli gasps as the boy suddenly dropped to a couple of inches tall. You go over and pick the screaming boy up as he furiously but uselessly punches at your fingers.<br>\r\n\"A shrink ray!?\" Oli yells as you place the boy in his palm, \"Well aren't you the cutest little thing,\" he says as he starts to stroke and prod the boy.<br>\r\n\"Watch this,\" you say as you take the boy back and dangle him over your mouth. He screams harder than ever before in his life as he falls. You don't even bother playing with him, you swallow him the moment he hits the back of your throat. Oliver just stares in wonder, until you point the gun at him.<br>\r\n\"W-what are you doing!?\" Oli squeals.<br>\r\n\"You've been such a good friend to me over the last month. However, with this new found power, my almost never ending hunger and your fighting, wriggling body, our friendship must end.\"<br>\r\n\"Please, wait! I... Must confess. I've also had thoughts of eating tiny people.\" You began to lower the device. \"Ever since I watched the Borrowers, I've thought about it a lot. Please, let me fulfill my fantasy first, while I can.\"<br>\r\n<br>\r\nYou think if this is a good idea.</span></div></div>",
            "created":1207285200,
            "id":516020,
            "title":"Devour your entire class."
        },
        "1541":{
            "choices":[
                "\"...continue eating!\"",
                "\"...have fun with another class!\"",
                "\"...play monster!\""
            ],
            "content":"<div class=\"\"><div> <span>In your lust for wriggly food, you nearly forgot that Oliver is your friend, but now you just couldn't do this to him, and point the gun away from your friend.<br>\r\n\"Thank you...\" he sighs.<br>\r\n\"It's funny, I've had the same fantasies. That jock I just ate is banging his fists on my stomach, trying to get out. It's pathetic,\" you say, directing your voice to your stomach for the last two words.<br>\r\n<br>\r\nJust then, two boys come in.<br>\r\n\"Move it brat,\" your brother says and shoves you out the way, while his friend does the same to Oliver.<br>\r\n\"Ready for your first meal?\" you ask. Oliver nods enthusiastically and you shoot your brother. His friend yells in shock and looks at you, but you fire the gun at him before he has time to run. You pick up your brother and tell Oli to grab his friend.<br>\r\n\"Hello there little one,\" you mock, holding your frightened brother up high. You quickly drop him in your mouth and suck on his body, reveling in how delightful he tastes. Oli follows suit, and soon you are both making sounds of satisfaction as your gulp them down. Oliver lifts his shirt, revealing his incredibly skinny body, and you can see tiny bumps forming on his abdomen as your brother's friend pounds on his stomach wall.<br>\r\n\"Aw man that feels so good! More!\" Oli begs. You too want more, and are delighted when you hear the bell ring. You have an idea and bring Oli outside once everyone else was in the building. Aiming at the school's wall, you fire, and a huge blue light covers the entire school. In seconds, the school reduces in size, ending up where the school's roof only came up to Oliver's waste. Unable to contain himself, Oliver tears into the building, revealing a large group of seniors. He licked his lips and started shoveling the tiny, screeching people into his mouth, tasting each one a little before swallowing. He leaves you with half of the class, and you look at his now bulging, moving stomach.<br>\r\n\"You have a lot of people in there,\" you say.<br>\r\n<br>\r\nYou do the same and eat the rest of the class, including the teacher, however they weren't nearly as visible through your skin. You ask Oliver what he wants to do now.<br>\r\n\"I think we should...\"</span></div></div>",
            "created":1207285200,
            "id":516034,
            "title":"Keep him big, shrink the next person who comes..."
        }
    },
    "info":{
        "author_id":"windrider4000",
        "author_name":"Anonymous",
        "brief_description":"You shrink and swallow your victims",
        "created":1164424380,
        "description":"<td align=\"left\" class=\"norm\">You posess a shrink gun that allows you to shrink people down to a given size.  You use this machine to shrink and swallow your victims.<br>\r\n<br>\r\nHere are the rules:<br>\r\n*Victims may be male or female<br>\r\n*Predators must ALWAYS be male<br>\r\n*No overly gross sex scenes<br>\r\n<br>\r\nOther than that, HAVE FUN!</td>",
        "id":1182690,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1571425800,
        "modified":1571425800,
        "pretty_title":"Serial Swallower"
    }
}