{
    "chapters":{
        "1":{
            "author_id":"dawnbringer",
            "author_name":"Dawnbringer",
            "choices":[
                "Morticia",
                "Gomez",
                "Wednesday",
                "Pugsley",
                "a victim"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, who are you????????????</span></div></span></div>",
            "created":1079931600,
            "id":192662,
            "title":"Starting Off"
        },
        "11":{
            "author_name":"Louisa Nardone",
            "choices":[
                "Assist Pugsly and Wednesday in their lemonade stand.",
                "Visit Fester."
            ],
            "content":"<div class=\"\"><div> <span>Morticia Addams woke up in the dark bedroom of the dark mansion of her family's. She woke up to see her new pet spider on her pillow. <br>\r\n<br>\r\n\"Oh, Fluffy, my baby hairy little one,\" Morticia said in a sweet voice, \"Why did you have to go escape your cage...\"<br>\r\n<br>\r\n\"MMOOOOOOOOOOTTTTTTTTTHHHHHHHHHHEEEEEEEERRRRRRR.\"<br>\r\n<br>\r\nMorticia knew who belted that out, her daughter, Wednesday.<br>\r\n<br>\r\nMorticia ran down the big stairs and greeted her daughter.<br>\r\n<br>\r\n\"Mother, Pugsly won't stop bothering me and he keeps getting in my way!\"<br>\r\n<br>\r\n\"Oh my, Pugsly, how awful of you to do that to your sister..Why don't you play with her..instead of bothering her?\"<br>\r\n<br>\r\n\"C'mon pugsly, let's go and make a lemonade stand... that will have the powerful ingredient in the lemonade...acid, arsenic acid.\" Wednesday chuckles to herself. <br>\r\n<br>\r\nPuglsy and her run off to the kitchen. <br>\r\n<br>\r\nMorticia says to Lurch who was standing near by...\"How cute.\"</span></div></div>",
            "created":1080363600,
            "id":193085,
            "title":"The Deadly Lemonade stand"
        },
        "111":{
            "author_id":"dawnbringer",
            "author_name":"Dawnbringer",
            "choices":[
                "shrink",
                "morph"
            ],
            "content":"<div class=\"\"><div> <span>“Wednesday!” Her daughter appeared in her room. She pulled out a small vial. “When you go back to your lemonade selling, use this. You’ll get a nice surprise! Wednesday merely nodded. “Come Pugsly,” Wednesday called, “where selling lemonade!” Pugsly simply stared at her. “Why would we want that? What do we even need the money for? I got a new mace just last night!” Wednesday gave her brother a venomous stare. Almost unnoticeable, a smile formed on the edge of her lips. “That’s a shame dear brother, you see I just recently took a look at our parent’s will.” Pugsly didn’t seem phased in the slightest, “So?” “So,” Wednesday snarled in aggravation, “They planned to be buried with all their possessions, including the house. They’re planning on bringing in some heavy construction equipment.  With what we’ll get, will probably end up with just enough for a sunny penthouse in the heart of Miami.” Wednesday lied. Pugsly’s eyes grew as big as saucers. “OH NO! We need to get some money!” He responded, fearfully<br>\r\n<br>\r\n<br>\r\nPugsly and Wednesday and Lurch walked to the main highway in a matter of minutes. “Put it down here Lurch,” Wednesday called “this will do.” Their titanic butler merely moaned, and set down the fully stocked, black wooden structure. Wednesday and Pugsly began sepped behind the counter of there lemonade stand, and whipped out a pitcher of some toxic, unknown drink. Eventually a teenager came sauntering buy. He walked up to the Adams, “Whoa, lemonade for a dollar, huh? Sure, I’ll take one today’s a scorcher man!” He deposited 4 quarters into Pugsly’s chubby hand. The usually emotionless boy cackled madly for no reason at all, and ran of in the opposite direction. “Uh…… Yeah.” The boy responded. Wednesday merely rolled her eyes and handed him his cup. He downed the concoction in less than a second. “Yuck!!!!!!!!! What is this stuff!!!!!??? I can’t…” He clutched his stomach in pain. All of a sudden he began to<br>\r\n</span></div></div>",
            "created":1080622800,
            "id":193358,
            "title":"Fresh Lemonade"
        },
        "1111":{
            "choices":[
                "She picks you up",
                "She crushes you"
            ],
            "content":"<div class=\"\"><div> <span>He began to shrink, the Addam's girl just continued to smirk. Soon he was just an inch tall. \"You drank your lemonade, now I think I'll recieve my payment!\" She snapped.<br>\r\n<br>\r\n\"Are you kidding? I gave you a dollar already!\" You scream up, terrified.</span></div></div>",
            "created":1096002000,
            "id":217756,
            "title":"Reasoning with Wednesday"
        },
        "11111":{
            "author_name":"Pgessmer",
            "choices":[
                "Play with you in her hands some more",
                "Decide you need company, shrink Pugsly as well"
            ],
            "content":"<div class=\"\"><div> <span>Wednsday looks at you with an evil smile and starts to reach for you.  Her giant hand stops nearly two inches in front of you and hits the ground with a large thump, causing you to fall backwards.  This makes her giggle the most sinister laugh as she picks your pathetic body off of the ground.  She holds you in her hands and laughs as you struggle between her massive fingers.  \"awww, look at my new little toy squirming around.  Well, you'd better not tire yourself out because i have a lot of fun planned for you, tiny man.\"  She brings you to her billboard sized face and says in the most malicious voice \"now what should i do with my new little man?\"</span></div></div>",
            "created":1135400400,
            "id":291512,
            "title":"A new pet for Wednsday"
        },
        "111111":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "hands or feet",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>doe she use her hands or her feet or something else</span></div></span></div>",
            "created":1455599520,
            "id":2104905,
            "title":"Play with you in her hands some more"
        },
        "1111111":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "armpits",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(hands and feet have been accidentally placed under something else so ive moved something else here) what other part does she use</span></div></span></div>",
            "created":1455600120,
            "id":2104913,
            "title":"something else"
        },
        "11111111":{
            "author_id":"squirtlewombat",
            "author_name":"SquirtleWombat",
            "choices":[
                "She rubs you up and down her armpit",
                "She traps you in her armpit"
            ],
            "content":"<div class=\"\"><div> <span>\"I've got the perfect place to put a little man like you.\" Wednesday said. Holding you up straight, with her thumb and index finger gripping you by the chest, she used her free hand to unbutton her dress buttons. She then proceeded to put you into her dress, and you were immediately faced with the sight of her armpit. \"Let's see how you handle this, shall we?\" Wednesday said with a small smirk, pressing you into her soft armpit. And though it was soft, the smell was not pleasant at all. Her bodily sweat, mixed with an absence of deodorant, created an overpowering odor that made you recoil in disgust. The more you tried to struggle out, the harder she pressed you into her pit.</span></div></div>",
            "created":1482810780,
            "id":2254781,
            "title":"Armpits"
        },
        "11111112":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "butt",
                "mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where else?</span></div></span></div>",
            "created":1455600120,
            "id":2104916,
            "title":"other"
        },
        "111111121":{
            "author_id":"squirtlewombat",
            "author_name":"SquirtleWombat",
            "choices":[
                "You survive, trapped in her crack",
                "You are crushed by one of her buttcheeks"
            ],
            "content":"<div class=\"\"><div> <span>Wednesday dropped you onto her chair, knocking the wind out of you. You struggled to regain your breathing, when Wednesday's head blocked out the sun from your view, towering over you with menacing eyes. \"You better be comfy.\" <br>\r\n<br>\r\nThat's all she said as she turned around presenting her ass to you. You were so shocked at the sight of the girl's rear, that it took you about a second to realize in horror what was about to happen.</span></div></div>",
            "created":1482813060,
            "id":2254812,
            "title":"Butt"
        },
        "1111111211":{
            "author_id":"squirtlewombat",
            "author_name":"SquirtleWombat",
            "choices":[
                "She gives you mercy and gets off of you",
                "She ignores and farts on you"
            ],
            "content":"<div class=\"\"><div> <span>Wednesday suddenly sat down full force, almost flattening you under her butt. Instead, you were trapped between her giant asscheeks, pinned down by the girl's weight.<br>\r\n<br>\r\n\"Urrgh! Please, just let me go! Turn me normal again, I won't tell anyone!\" You yelled and pleaded from under the girl. \"Why should I? You're mine now, little man. I can do whatever I want with you.\" She said. \"You cold bitch!\" You started screaming and punching with all your strength. It only felt like little pokes to her.<br>\r\n<br>\r\n\"I would advise you to stop.\" Wednesday's voice calmly thundered. You were confused on what she meant. Until you went silence and heard something.<br>\r\n<br>\r\nHer stomach growling...<br>\r\n<br>\r\n\"NO! PLEASE NO, I'll DO ANYTHING YOU SAY! JUST DON'T DO IT GODDAMNIT!\" You screamed, begging the girl.</span></div></div>",
            "created":1482885300,
            "id":2255217,
            "title":"You survive, trapped in her crack"
        },
        "11111112112":{
            "author_id":"squirtlewombat",
            "author_name":"SquirtleWombat",
            "choices":[
                "You start punching at her butt",
                "You lie and face your torture"
            ],
            "content":"<div class=\"\"><div> <span>PPRRUMMBB! A fart erupts from Wednesday’s ass, hitting you at point blank range. The smell was indescribable! Whatever this girl had been eating, it probably twisted her guts and turned them into an unforgiving gassy hell. You struggled with your might, bound between this goth’s cheeks until she felt like getting up off of you.<br>\r\n<br>\r\n“I bet the smell must be horrific. Grandmama made Komodo Dragon Cassarole last night, and I had seconds.” Wednesday said.<br>\r\n<br>\r\nYou didn’t how to respond other than to put squirm and scream under this girl’s bottom. You had to get out, or you feel you might die under her.</span></div></div>",
            "created":1539011340,
            "id":2560997,
            "title":"She ignores and farts on you"
        },
        "1111111212":{
            "author_id":"squirtlewombat",
            "author_name":"SquirtleWombat",
            "content":"<div class=\"\"><div> <span>Wednesday slowly started to sit down, taking her sweet time. Looking up, your vision was filled with only the sight of her beautiful ass. Finally, her right buttcheek made contact with you.<br>\r\n<br>\r\nFor a moment, there was no pain, and it was incredibly soft. Then, she started pushing down on you harder. You screamed in pain as her butt put loads of pressure on you.<br>\r\n<br>\r\nYou could hear and feel you skull slowly being crushed and flattened, and your arm and leg bones snapping into pieces. She rose up, taking a look at your mangled form below her. All you could do was stare up at her, trying to beg for mercy through your gargling throat.<br>\r\n<br>\r\nAnd then she gave you a terrifying giggle before slamming her ass down again.<br>\r\n<br>\r\nYou pratically exploded under her, your body turned into nothing more than a red stain on the gothic girl's dress. She got up again, looking at the red painted all over her asscheek with a disturbing little grin.<br>\r\n<br>\r\n\"What a shame.\" Wednesday said sarcastically, rubbing her butt in satisfaction.</span></div></div>",
            "created":1482846540,
            "id":2254979,
            "title":"You are crushed by one of her buttcheeks"
        },
        "1111112":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "hands",
                "feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>hands or feet</span></div></span></div>",
            "created":1455599580,
            "id":2104906,
            "title":"something else"
        },
        "11112":{
            "author_id":"briguy",
            "author_name":"patriot",
            "choices":[
                "The End",
                "continue as sss"
            ],
            "content":"<div class=\"\"><div> <span>Wednesday picks you up and smiles evilly at you she really enjoys watching people suffer.  She likes to pull the wings off flies, there is no telling what she has in store for you.  You don't have long to wait. while holding you in the palm of her left hand she takes her right thumb and puts pressure on you leggs bellow the knees.  Without warning you legs explode into a bloody mess.  you scream as loud as you can in severe pain, but at your size who is going to hear you?  Only Wednesday can barely hear you squeak.  She does the same thing to your right  arm and then your left.  At this time you are barely alive.  <br>\r\n     \"Oh look my hand are a mess.  Here Fido!\"  You see a large rotwiller come over.  He sniffs at her hands and in one big  slurp licks her hands clean.  You are gone in less than a second soon to reapear on the neighbor's lawn.</span></div></div>",
            "created":1345784400,
            "id":1412075,
            "title":"She crushes you"
        },
        "111122":{
            "author_id":"briguy",
            "author_name":"patriot",
            "choices":[
                "torture the taggers",
                "eat some Ice cream with some special toppings."
            ],
            "content":"<div class=\"\"><div> <span>Wednesday watches as the last of your remains slide down the dog's throat she pats it on the head and says, \"Good dog\"<br>\r\n  Wednesday looks around to see if there is anyone else around.  she can hear children playing a game of tag in the distance that could keep her entertained for a while, She starts to follow the sound of the noise when all of a sudden she hears the sound of the ice cream truck So many choices.  Wednesday decides to </span></div></div>",
            "created":1350190800,
            "id":1446898,
            "title":"continue as Wednesday "
        },
        "1112":{
            "author_id":"saix6",
            "author_name":"Axel",
            "choices":[
                "Another Person",
                "An animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>  His face begins changing into that of .....</span></div></span></div>",
            "created":1135573200,
            "id":291969,
            "title":"Which one"
        },
        "11121":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it someone from the family?</span></div></span></div>",
            "created":1454475180,
            "id":2098567,
            "title":"Another Person"
        },
        "111211":{
            "choices":[
                "Morticia ",
                "Wednesday "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does that guy turn into is?</span></div></span></div>",
            "created":1454475240,
            "id":2098570,
            "title":"Yes"
        },
        "12":{
            "author_id":"dawnbringer",
            "author_name":"Dawnbringer",
            "choices":[
                "Fight to the death",
                "Try to disarm him"
            ],
            "content":"<div class=\"\"><div> <span>Gomez looked in the mirror and sighed. It had been so long since he last had and adventure. Perhaps he would go see what Fester was up to? Suddenly, out of know where, a sword came swishing past his head. He ducked out of the way as the mirror behind him exploded. A black knight in sinister armor stood before him. “Ahhhh Gomez…………. It has been to long. How is dear Morticia?” “She’s doing just awful.” Gomez replied, cheerfully. The demon knight took another slash at his head. “You don’t remember me do you old man?” Gomez backflipped out of the way and snatched a fencing sword from the wall. “Can’t say that I do my friend, shall we duel?” “I thought you would never ask!”</span></div></div>",
            "created":1079931600,
            "id":192663,
            "title":"Gomez meets the Black Night"
        },
        "121":{
            "author_id":"blackafter",
            "author_name":"Black After",
            "choices":[
                "Restore your honor by investigating alone!",
                "Invite the family to help out in your investigation!"
            ],
            "content":"<div class=\"\"><div> <span>“The poor man,” Gomez said as he shook his head in self-depreciation. “I should have seen that he was no match for me.”<br>\r\n<br>\r\n          “Gomez, Darling, you mustn’t blame yourself. Just look at this armor,” she said, gesturing to the heavy plating that still hid the mysterious knight's face and body. It was dark, menacing and made the knight look like some sort of demon. “Really, he should have known better. Misrepresentation can be a very dangerous thing.”<br>\r\n<br>\r\n          Gomez sighed. “That’s true... but I should have controlled myself. It’s just...” His brows furrowed as he spoke. “To hear your name on another man’s lips... Oh, Querida Mia!”<br>\r\n<br>\r\n          “Querido,” Morticia answered as Gomez began trailing kisses up her arm.<br>\r\n<br>\r\n          “It made me lose control.”<br>\r\n<br>\r\n           Fester, who had been checking the vital signs of the fallen knight, cut into the embracing couple’s  exchange. “Well, he’s dead, alright,” he said with a half-smile. “You got him right through the heart!”<br>\r\n<br>\r\n          The pride in Fester’s voice was not so subtle, and Gomez was quick to correct. “Really, Old Man,  he practically <i>leapt onto my blade</i>... I can hardly take the credit.”<br>\r\n<br>\r\n          Morticia smiled. “Oh, Gomez. You’re so modest.”<br>\r\n<br>\r\n          “Well,” Gomez’s sullen look was quickly replaced by an enormous smile. “I <i>had</i> been hoping that something exciting would happen today. And there aren’t many things that can top a funeral!”<br>\r\n<br>\r\n          “A funeral!” Fester echoed in delight.<br>\r\n<br>\r\n          “Now, Fester...” Morticia began.<br>\r\n<br>\r\n          “Did somebody say ‘a funeral’?!” Wednesday and Pugsley chirped in unison as they stumbled into the room in excitement.<br>\r\n<br>\r\n          “Children...” continued Morticia.<br>\r\n<br>\r\n          Gomez was about to reiterate his enthusiasm when he noticed Morticia was trying to speak. “What is it, Cara Mia?”<br>\r\n<br>\r\n          “Before we have <i>another</i> unmarked grave in our lovely cemetery, I want to be sure that this man actually <i>is</i> a stranger.”<br>\r\n<br>\r\n          “Ah, I agree completely!” said Gomez, already reaching for his sleuth hat. “We’ll have a full investigation into the identity of our... guest... <i>Then</i> we’ll have the funeral!”<br>\r\n<br>\r\n          Morticia nodded. “As it should be.”<br>\r\n</span></div></div>",
            "created":1162184400,
            "id":356001,
            "title":"A Funeral?"
        },
        "1211":{
            "author_id":"blackafter",
            "author_name":"Black After",
            "choices":[
                "Black is always best. Take the black.",
                "Pink is... different. Take the pink."
            ],
            "content":"<div class=\"\"><div> <span>“Leave it to me, Cara Mia! I’ll get to the bottom of this in no time! “ With enthusiastic strides, Gomez began to pace back and forth through the room. “Where should I begin... I could get a fingerprint analysis! Or maybe there’s some clue to be found in that armor. The helmet looks like Prussian cavalry armor -except that it has a bellows visor, of course- but then there’s that cuirass..”<br>\r\n<br>\r\n“I have an idea,” Fester cut in. Gomez stopped in his tracks, interrupted, to hear the suggestion. “Why don’t we take off his helmet and see if any of us recognize him!”<br>\r\n<br>\r\n“Brilliant idea, Old Man!”<br>\r\n<br>\r\nThe doorbell rang.<br>\r\n<br>\r\n“Who could that be?” Morticia wondered, taking a step toward the window.<br>\r\n<br>\r\n“Perhaps another piece of the puzzle!” Gomez replied, already heading out of the room. He ran down the stairs just in time to see Lurch open the door.<br>\r\n<br>\r\n“Ah!” came a woman’s surprised voice. “<i>Please</i> tell me <i>you’re</i> not Gomez Addams!”<br>\r\n<br>\r\nLurch groaned and then motioned for the woman to enter.<br>\r\n<br>\r\n“Now, Lurch, old man,” Gomez laughed. “Is it really <i> that</i> bad to be mistaken for me?”<br>\r\n<br>\r\nLurch turned to Gomez and let out a long, low groan before turning back to close the door. Gomez frowned at the response: apparently it <i>was</i> that bad.<br>\r\n<br>\r\n“’Mistaken for you’? Then you must be Mr. Addams!” The young woman was tall and shapely. Her tanned skin contrasted with her long, blond hair and the pearly white teeth of her broad smile.<br>\r\n<br>\r\n“At your service.” Gomez bowed his head in a polite greeting. For Addams men, chivalry wasn’t dead - even in times when an ugly duckling came knocking at their doors. “And you are?”<br>\r\n<br>\r\n“I’m... Oh! I’m sorry.  My name is Glenda Goodman. I sell perfumes and colognes... But I... That’s not why I’m here today. You see, I’m having some car problems and was hoping I could use your phone...” The poor girl seemed very nervous. Gomez sympathised for her; she had probably led a very hard life, being as unsightly as she was. It had clearly damaged her confidence.<br>\r\n<br>\r\n“Why certainly, Ms. Goodman. Just follow me.” After leading his visitor to the phone, Gomez spotted Morticia and Fester, both quietly observing the young women from the top of the stairs. He scaled the steps and began explaining the situation.<br>\r\n<br>\r\n“I don’t like the look of her, Gomez. You’d better keep an eye one her.”<br>\r\n<br>\r\n“Now, Fester,” Morticia scolded. “You can’t judge a book by its cover.”<br>\r\n<br>\r\n“Sure you can,” Fester insisted. “Remember that book I bought about the black plague? The reason I picked it out in the first place was the picture of the big rat on the cover!”<br>\r\n<br>\r\nMorticia considered Fester’s comment. He did have a point.<br>\r\n<br>\r\n“Don’t worry, Fester,” Gomez assured. He looked down the stairwell at his visitor. “She won’t be here long.”<br>\r\n<br>\r\nMorticia sighed. “Very well, Darling. I think I’ll go help the children. They’re talking about stating a lemonade stand. Apparently they’ve been experimenting with ingredients.” She turned and, with her normal grace, headed down the hallway. Fester sent a sneer down the stairs at the young women, before following after Mortica.<br>\r\n<br>\r\n“Mr. Addams?” Ms. Goodman called.  Gomez heard the sound of the phone receiver being put down and decided it was time to return downstairs.<br>\r\n<br>\r\n“Did you have any luck?” He asked in his usual, charming manner. He certainly hoped she had had luck. She didn’t seem to hold any clues for his investigation and the sooner she left, the sooner he'd be able to get back to solving the mystery. Not to mention the prospect of finally beginning funeral arrangements!<br>\r\n<br>\r\n“Yes. AAA is sending someone to help me right away.” She smiled and stepped in closer to Gomez. “...I don’t know how to repay you.”<br>\r\n<br>\r\n“For the use of my phone?” He frowned and leaned back. With the young lady drawing nearer, he couldn’t help but notice how rosy and pink her cheeks were... The poor girl was truly hideous. It took all of his willpower to hold back a cringe.<br>\r\n <br>\r\n“For that and... other things,” she said in a deep voice, still drawing closer. “Oh, I know how I can repay you!” She was now only inches away.<br>\r\n<br>\r\n“You do?” asked Gomez in a hoarse voice. He was beginning to wish he’d heeded Fester’s warnings.<br>\r\n<br>\r\n“Uh-hu.” Suddenly, she lifted a large briefcase up in front of Gomez’s face. “Perfume!” She shifted to rest her case on a nearby table and popped open the case’s top. “I’ll let you pick out a bottle - for free. It would make a great gift for your wife!”<br>\r\n<br>\r\nGomez smiled, glad to once again have some distance between himself and the young woman. “That’s very kind of you but...”<br>\r\n<br>\r\n“Now I won’t take 'no' for an answer! Here, come try a sample of a few of our most popular fragrances.” She quickly picked out two decorative bottles. One was a lush deep color that resembled black but was actually a subtle lace of reds and purples. The second bottle was very different: a bright, cheery pink color that closely resembled at the same time both cotton candy and Ms. Goodman’s rosy cheeks. “Which one would you like to try?” she asked.</span></div></div>",
            "created":1162616400,
            "id":356936,
            "title":"A Stranger in Need is a Danger Indeed"
        },
        "122":{
            "author_id":"blackafter",
            "author_name":"Black After",
            "choices":[
                "That knight is still around here! Search for him before he gets away!",
                "That knight mentioned Morticia's name... Go check on her!"
            ],
            "content":"<div class=\"\"><div> <span>Gomez’s grin stretched from ear to ear. It looked as though adventure had found him!<br>\r\n<br>\r\n                       “Ha, ha! You couldn’t <i>have </i>better timing,” he said in mid-leap, avoiding a sweep of the knight’s sword. “I was just trying to think of a way to liven up my day!”<br>\r\n<br>\r\n                        He dodged a second attack, and a third. And on the fourth of the knight’s heavy swings, Gomez brought up his sword to parry. The grin vanished from his face.<br>\r\n<br>\r\n                        “What’s the matter, <i>Gomez? </i>Not so happy to be fighting me<i> anymore?</i>” The black knight laughed a hearty, confident laugh.<br>\r\n<br>\r\n                        Gomez eyed his opponent in disbelief. That mysterious man with his dark, menacing armor, that underhanded, unannounced first attack.. It had all seemed so promising! How could such a fierce looking opponent turn out to be such an amateur with a sword? The stance, the the trust, the footwork... none of it could be sloppier!<br>\r\n<br>\r\n                        Gomez tried to hide his disappointment. “No at all. I enjoy a good challenge,” he replied, half-heartedly trying to sound enthusiastic. He took on a defensive stance and parried for a few moments--it wouldn’t do to embarrass his guest by disarming the stranger too quickly--before executing a simple maneuver that sent the knight’s sword clanging to the ground.<br>\r\n<br>\r\n                        “Ah, too bad,” Gomez consoled, shaking his head sympathetically. “Maybe you’ll have better luck in a second match. Best two out of three?”<br>\r\n<br>\r\n                       The dark armored demon stood silent, unreadable for a moment. He then let out a deep, seething growl. “Gomez Addams, you may be able to best me with a sword, but I <i>will</i> have my revenge!” In a swift movement, the knight threw something to the ground and disappeared in  a puff of smoke. He was gone.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1162011600,
            "id":355465,
            "title":"Swordplay"
        },
        "13":{
            "author_name":"Gretchen Spire",
            "choices":[
                "To The Swamp",
                "The Book Hunt"
            ],
            "content":"<div class=\"\"><div> <span>“It’s quite a bleak morning, mother.” Wednesday commented as she sat by the window, staring out towards the family cemetery.<br>\r\nThis was her favorite place to sit on such days. The cemetery looked so desolate and depressing in the rain and dim fog which was this Saturday morning. Wednesday was very fond of the Addams cemetery. She usually made time each day, at dusk, to take a leisurely stroll through it and contemplate the likelihood of adding fifteen unmarked graves before her fourteenth birthday.<br>\r\nWednesday’s mind drifted to the swamp and suddenly she remembered the noise she had heard the night before. A loud gurgling, moaning sound had come from the direction of the swamp. Curiosity usually got the better of Wednesday when faced with situations such as this.<br>\r\n<br>\r\nMorticia looked up from her sewing. “Isn’t it grim, my dear?” She smiled back towards her daughter from an antique winged armchair.<br>\r\n<br>\r\nWednesday nodded slightly. What to do? Pugsley had already been tied up in the basement, so she could do her experiments at her leisure. The anatomy and phrenology books were nowhere to be found however. Wednesday couldn’t understand it; she had purposely put the books on her workbench last night in preparation for today. Who could have taken them, or what?<br>\r\nWednesday stood and, straight backed, walked out of the sitting room and into the hallway.<br>\r\nTo her left was the door leading outside to the cemetery, to her right, the basement door.<br>\r\n<br>\r\n“You should make the most of the day, you know.” Morticia called after her as she looked out the window, in the tone of a mother who wants her children to get as much sun as they can.<br>\r\n<br>\r\n“I will, mother.” Wednesday called back she made her way purposefully toward the door.<br>\r\n</span></div></div>",
            "created":1162962000,
            "id":357851,
            "title":"A Grim Morning"
        },
        "131":{
            "author_id":"breakdramon",
            "author_name":"Web Wrecker",
            "choices":[
                "she gets away",
                "Feed the crocodile!"
            ],
            "content":"<div class=\"\"><div> <span>Wendsday decided to head out to the swamp, to play one of her favorite games.<br>\r\n<br>\r\nFeed snappy.<br>\r\n<br>\r\nit was fairly simple, either she managed to get away from the massive crocodile in their swamp, or she got eaten. so far, every time she had played she had gotten away, but she was an Addams. death was always hovering over their shoulder.<br>\r\n<br>\r\nshe knew that if she ever got caught by snappy, she would die, Addams or not.<br>\r\n<br>\r\nand she relished the thought. it made her all tingly.<br>\r\n<br>\r\nshe walked deeper into the swamp, looking around before finding her target. the massive 12 foot long alligator near the shore.<br>\r\n<br>\r\n\"oh sna-apy~! she cooed, making the massive gator look at her. \"its time to play again!\" she finished, making the gator grin as it stood up.<br>\r\n<br>\r\nWednesday turned and ran, she had 5 seconds to get a head start.<br>\r\n<br>\r\nand then, snappy was after her.</span></div></div>",
            "created":1403931600,
            "id":1819438,
            "title":"To The Swamp"
        },
        "14":{
            "author_id":"001a",
            "author_name":"0001",
            "choices":[
                "Oh, no, you won't!",
                "I want to play as Pugsley, anyway!",
                "Another member of the Addams clan.",
                "A guest or visitor. Basically just not an Addams. Not yet, anyway!",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Actually, there was no option for 'Other' so I'll add one.</span></div></span></div>",
            "created":1251781200,
            "id":753836,
            "title":"Pugsley"
        },
        "142":{
            "author_id":"expireat456782",
            "author_name":"Yolo2",
            "choices":[
                "My sweaty butt",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Pugsly woke up in his bed shrunk what am I going to do when he sees his mom come in outlay she calls. Mom he screams which she heard pugsly?. Yes mom I am down here oh there you are she says I can't let the rest of the family see you so I will hide you in</span></div></div>",
            "created":1602659580,
            "id":2921035,
            "title":"I want to play as Pugsley, anyway!"
        },
        "144":{
            "author_id":"001a",
            "author_name":"0001",
            "choices":[
                "Alexander Fenderson.",
                "Alexandra Fenderson.",
                "Someone Else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>1.) Alexander Fenderson, dating Wednesday.<br>\r\n2.) Alexandra Fenderson, dating Wednesday.<br>\r\n3.) Someone Else.</span></div></span></div>",
            "created":1251781200,
            "id":753840,
            "title":"A guest or visitor. Basically just not an Addam..."
        },
        "1442":{
            "author_id":"001a",
            "author_name":"0001",
            "choices":[
                "Yes",
                "No",
                "More Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, Alexandra, huh? Is that your name because you're a woman, or not?</span></div></span></div>",
            "created":1265086800,
            "id":829585,
            "title":"Alexandra Fenderson."
        },
        "14421":{
            "author_id":"001a",
            "author_name":"0001",
            "choices":[
                "Keep going, this is just getting interesting...",
                "Bah, humbug. I want something else."
            ],
            "content":"<div class=\"\"><div> <span>So you are Alexandra Fenderson, sweet young goth who was raised by a relatively normal family and therefore moved out as soon as you could, when you graduated high school, going to college in Salem. There you met the love of your life, Wednesday Addams, the black hole of your heart. She was the first person you ever felt drawn to. You were neither gay nor straight before now, being simply uninterested in anyone in your dull, sunny town. When you saw that vision of radiant darkness giving a report on the joys of poison in literature, you just had to have her. It was like a lightning bolt to the head, and almost as much fun.</span></div></div>",
            "created":1265086800,
            "id":829590,
            "title":"Yes"
        },
        "15":{
            "author_id":"dawnbringer",
            "author_name":"Dawnbringer",
            "choices":[
                "the paperboy",
                "the mailman",
                "some kid",
                "a 'dinner guest'",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uh-oh, this is how it starts! Who are you?</span></div></span></div>",
            "created":1079931600,
            "id":192664,
            "title":"UH-OH"
        },
        "151":{
            "choices":[
                "Grandmama",
                "Cousin It"
            ],
            "content":"<div class=\"\"><div> <span>\"These darn Addams' haven't paid their paper bill in over a month,\" you say, walking up to the spooky mansion. \"The boss say's I have to collect today or I'm fired. They really give me the creeps, though.\"<br>\r\n<br>\r\nYou walk up to the house and spot Uncle Fester eyeing you out the window. As soon as you notice him, he quickly shuts the curtain and dissapears.<br>\r\n<br>\r\n\"Man, this is a creepy family,\" you think to yourself.<br>\r\n<br>\r\nYou begin to ring the doorbell, but Uncle Fester has the strange idea that you are really a double agent spy sent to steal the family's fortune, so he pulls a trap door lever that sends you crashing into the family dungeon.<br>\r\n<br>\r\nWhen you come too, you find yourself stretched on an old midevil rack only to be faced with:</span></div></div>",
            "created":1135573200,
            "id":291897,
            "title":"Paper boy troubles"
        },
        "1511":{
            "choices":[
                "Very large vulture feather",
                "a spell book"
            ],
            "content":"<div class=\"\"><div> <span>\"Fester told my you are here to steal the family fortune,\" replied Grandmama. \"Who sent you?\"<br>\r\n<br>\r\n\"The Town Tribune Newspaper,\" you say in a shaky voice.<br>\r\n<br>\r\n\"The newspaper wants to steal our fortune? Hmmm, they must be a national spy headquaters in disguise.\"<br>\r\n<br>\r\n\"No, ma'am. I'm just the paper boy. I don't want any fortune, just the five dollars you own on your bill. could you please let me go?\" You say strugging against the ropes on your ankles and wrist.<br>\r\n<br>\r\n\"No chance! you are going to tell us who the head spy leader is or you're not going anywhere.\"<br>\r\n<br>\r\n\"But I tell you, Ma'am, there is no spy headquarters or any leader.\"<br>\r\n<br>\r\n\"We'll see about that,\" says grandmama walking over and picking up a:</span></div></div>",
            "created":1135573200,
            "id":291899,
            "title":"Torture."
        },
        "15111":{
            "choices":[
                "Insist you know nothing",
                "Squeal like a little girl and make something up."
            ],
            "content":"<div class=\"\"><div> <span>You watch in horror as Grandmama Addams walks over and pics up a very large black feather.<br>\r\n<br>\r\n\"You see this,\" she says waving it in the air. \"I picked this little thing up in Africa from a Voodo witchdoctor. It's an African Vulture feather and it has been known to make even the toughest of spys submit information.\"<br>\r\n<br>\r\n\"I'm telling you, I'm no spy! I'm just a lousy paperboy. I'll tell you what if you let me go I'll even pay the five dollars for you out of my salary.\"<br>\r\n<br>\r\n\"Still sticking to that story huh?\" says Grandmama. \"Well let me tell you a little about the African vulture feather. It holds thousands and thousands of quills that cling to each and every nerve ending as it swishes and swishes across each foot. It can turn a strong man into a quivering pile of yack jelly.\"<br>\r\n<br>\r\n\"But I'm no spy!\" You plead. \"Please let me go!\"<br>\r\n<br>\r\nGrandmama holds the feather high in the air and waves it around. \"So spy, I must know, do you have ticklish feet?\"<br>\r\n<br>\r\nYOu tuck your feet and curl your toes the best you can and with a tearful look nod your head \"Yes.\"<br>\r\n<br>\r\n\"That's all I needed to know,\" she said with a wicked smile.</span></div></div>",
            "created":1135573200,
            "id":291966,
            "title":"African Vulture Feather"
        },
        "151111":{
            "choices":[
                "wednesday",
                "fester"
            ],
            "content":"<div class=\"\"><div> <span>You watch in horrorr as grandmama removes youre shoes,exposing youre bare soles.\"last chance,spy\"she quips.And then she begins.She slides the feather on youre soles in a figure eight.you feel every bit of the feather on youre twitching feet.\"im just 15!\" you shout to no avail.After 2 hours,it finally stops.\"hmmm,stronger than i thought\"she directs at youre quivering frame.\"lets see what the rest of the family makes of you.she forces you up,but no sooner have youre still bare feet touched the cold stone floor,than she says\"not until youre properly dressed!\"without a word, every scrap of clothing you have on dissapaers.shivering,you are marched of to see.....</span></div></div>",
            "created":1235019600,
            "id":649547,
            "title":"interrogation"
        },
        "1511111":{
            "choices":[
                "Wednesday's",
                "Morticia "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You turn a corner and see Wednesday there, holding an outfit in her hands for you to wear<br>\r\nWho's outfit it is?</span></div></span></div>",
            "created":1454476560,
            "id":2098581,
            "title":"wednesday"
        },
        "1511112":{
            "choices":[
                "electo shock torture",
                "more tickling"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"so,this is the spy\".before you  can answer,you are restrained and fester begins placing electrodes on your nipples and soles of your feet.\"this is a new technique.thanks for the opportunity to try it\".you brace yourself for.....</span></div></span></div>",
            "created":1235106000,
            "id":649852,
            "title":"fester"
        },
        "15111122":{
            "author_id":"frekles90",
            "author_name":"frekles",
            "choices":[
                "Fester joins his electrodes in your torture ",
                "Grandmama comes back to make sure you learn your lesson"
            ],
            "content":"<div class=\"\"><div> <span>        ’oh god what now?’ you thought to yourself, concerned, as you were forced into what looked like an electric chair. It was slightly different though arm restraints that held them upwards, exposing your underarms and any other part of your body you want to hide. Not to mention you were already stripped of all your clothing prior to meeting Uncle Fester. <br>\r\n          Completely vulnerable, you sat there with Fester’s electrodes attacked to your soft, pink nipples, and to the smooth, creamy soles of your feet. You had no idea what was in store for you but you were certain you weren’t going to like it.<br>\r\n<br>\r\n”Soooo you thought you could spy on us huh?” Questioned fester. <br>\r\nBefore you could even try to plead your innocence again, Fester cut you off, “Thought you could fool us and gain our trust, only to betray us and take everything from us?”<br>\r\nYou were frightened and confused. ‘Why didn’t I work a different block’ you thought to yourself with remorse.<br>\r\n<br>\r\n“Actually my dear spy, that was a GREAT plan, I quite like it.” Uncle Fester said, with seemingly genuine glee. “But you, my dear spy, messed with the WRONG family.” Said Fester, making a complete 180 in tone from his prior statement. <br>\r\n        You began to worry even more, from his now grim and irritated visage. What was he going to do to you?? Were you going to be hurt?? Or even worse DIE?!?!? <br>\r\n          You didn’t have to question much longer for Uncle Fester was preparing for you. He looked you up and down, admiring your young, muscular physic. Luckily for you, very well endowed, although this all began to give you a twinge of embarrassment to go with you anxiety.<br>\r\n<br>\r\n“My dear spy” began Fester. “Did you know that we Addams don’t take too well to spays?” The question was rhetorical for he soon continued his speech to you. Though he had begun circling you bound figure, every now and then getting REAL familiar with his enemy. <br>\r\n<br>\r\n        You were quite muscular for just a newspaper boy. You had well defined pecs, nice toned arms, and even a SHREDDED set of abs. All of this being taken in by Uncle Fester, who seemed almost complete with his examination. He then stopped for a second by your right exposed armpit, he stared at it quite intently for a moment. That was before he dug his finger into slightly sweaty hallow. You INSTANTLY reacted, trying to, futilely, squirm away from his thick probing fingers. Uncle Fester had gotten exactly what he was hoping for out of you, it even fueled his flames and put him in a playful mood. <br>\r\n<br>\r\n          He went behind you once more, not once stopping his wiggling fingers, he then proceeded to open his mouth into a big goofy smile, lowering his tongue towards you. While this distracted you he readied his other hand near your left side. IN AN INSTANT, without warning, Fester dove his second hand into your exposed left arm pit, doubling what you were already feeling. Uncle was not done with his “examination” tho as he proceeded to continue his tongues trajectory and RAVISHED your right ear, slobbering all over it just to make you even more uncomfortable than you already were, all while his fingers reached a new speed and force in your armpits.<br>\r\n<br>\r\n          This went on for another minute— or ten, before he let up and went back to he was saying.<br>\r\n“Well my dear spy, now that we’ve had our fun I can continue to how you must be dealt with,” Fester now back to his menacing form. “As I was saying we Addams don’t like spies very much,” he picked up a small grey apparatus with a lever that jutted out from it. “And do you know what we do to spies?”  Asked Uncle Fester as he made eye contact with you again. This time you split eye contact to follow the wires that were attached apparatus lead. Up they trailed, coming in closer and closer in your direction, when you finally connected the wires with the same as those of the electrodes attached to your body.<br>\r\n<br>\r\n            You gulped, now understanding what was about to happen. You pleaded in your head but sadly all you could whimper our was, “....please not again....”  <br>\r\n             Uncle Fester replied to you begging face and anxious tone with a BIG GOOFY GRIN again as he flipped the lever to ON.<br>\r\n</span></div></div>",
            "created":1566460920,
            "id":2706052,
            "title":"more tickling"
        },
        "152":{
            "choices":[
                "You dive out and escape in time.",
                "Bang!  Zoom!"
            ],
            "content":"<div class=\"\"><div> <span>  You have a situation you had hoped to avoid. You have to deliver a package to the strange little house. You ring the door bell and it sounds like a fog horn . The door is opened by a man who looks like something out of a horror movie.<br>\r\n    You need a signature and this is only the butler. Reluctantly you enter the house at the butler's invitation. The house seems strange but when you are introduced to Gomez Adams he seems o.k . He notices you have been sweating and offers you a drink. You accept and pass out right after drinking . You wake up very small Gomez is holding you . <br>\r\n   He puts you down in the front car of his electric train . You notice to your horror he has another train on the same track set to go in the opposite direction! Gomez starts both trains.</span></div></div>",
            "created":1080363600,
            "id":193082,
            "title":"Train Wreck?"
        },
        "1521":{
            "choices":[
                "A Bedroom",
                "The Kitchen"
            ],
            "content":"<div class=\"\"><div> <span> You manage to dive out of the train .You land on the floor. After you recover your wits you notice you have shrunk even  more you are now less then an inch. Addams seems so intent on his train wreck he does not seem to notice you are gone. Still you want to get as far from the maniac as possible. Trouble is you don't know your way around the house .You head for the nearest door .You are so small you can get under the closed door .You find yourself in.</span></div></div>",
            "created":1081227600,
            "id":194230,
            "title":"Escape From Crazy Gomez"
        },
        "15212":{
            "choices":[
                "Wednesday Addams",
                "Morticia Addams"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself in a huge kitchen a huge frankenstien looking monster is at the other end, groaning. He seems to be beating a squid to death on the kitched counter. Must be preparing the Addam's dinner, yuck. As soon as he exits the <br>\r\nyou decide to make a run for it. Your about halfway across the kitchen floor when a giant shadow looms over you. Turning around you gasp. Staring down at you is</span></div></div>",
            "created":1096002000,
            "id":217755,
            "title":"Running across the kitchen floor"
        },
        "152122":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "shes lifting her foot over you",
                "picks you up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you doing in my house this house has a hight requirement now what should I do with you.</span></div></span></div>",
            "created":1276232400,
            "id":898048,
            "title":"Morticia Addams"
        },
        "1521221":{
            "author_id":"gerardreins",
            "author_name":"gerard",
            "choices":[
                "get steped on.",
                "Morticia picks you up with her toes."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>then she removed her heel and was about to step on you your frozen with fear.</span></div></span></div>",
            "created":1381035600,
            "id":1675366,
            "title":"shes lifting her foot over you"
        },
        "15212211":{
            "author_id":"gerardreins",
            "author_name":"gerard",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you end up being stuck on the arch of her foot and she sits on a chair looks at you and smirks you enjoy the rest of you life as my new tattoo and puts her heel back on and leaves and adds a lot of pressure on your body.<br>\r\n<br>\r\nthe end</span></div></span></div>",
            "created":1381035600,
            "id":1675368,
            "title":"get steped on!"
        },
        "15212212":{
            "author_id":"gerardreins",
            "author_name":"gerard",
            "choices":[
                "her bedroom",
                "to see her daughter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe if you don't tickle me I wont crush you then slips you and her foot into her heel and you are under all of her toes then she goes to.</span></div></span></div>",
            "created":1381035600,
            "id":1675370,
            "title":"Morticia picks you up with her toes."
        },
        "152122122":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "share",
                "give"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does she share you with her daughter or give you to her</span></div></span></div>",
            "created":1455600540,
            "id":2104920,
            "title":"to see her daughter"
        },
        "1521222":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "\"We are in the kitchen, aren't we?\"",
                "\"Let's have some fun \""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She reaches down and grabs your tiny body with her black painted fingernails and lifts you onto the kitchen counter. </span></div></span></div>",
            "created":1427518800,
            "id":1955361,
            "title":"picks you up"
        },
        "15212222":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "She straps you together",
                "She wraps you in dough"
            ],
            "content":"<div class=\"\"><div> <span>She brings you to a room hidden behind a bookshelf and you see rows and rows of jars packed with all sorts of shrunken people. She then places you in a package with a thrity year old woman and seals the can. You scream for help as she makes her way out of the closet.<br>\r\n<br>\r\n The woman you are with is a brunette woman with about DD breasts, and a nice ass. Shes very much active in showing her opinions for you as she keeps seductively touching herself and licking her lips. <br>\r\n<br>\r\n The day passed and eventually you both fell asleep on the bottom of the glass container. The cold of the room left chills through your body constantly all night, and you hardly got any sleep.<br>\r\n<br>\r\nThe next morning Morticia walked into the room and pulled out you and your partner and set you on the counter </span></div></div>",
            "created":1428642000,
            "id":1962079,
            "title":"\"Let's have some fun \""
        },
        "153":{
            "choices":[
                "She paints you, and others, to look like food.",
                "She actually prepares you to be eaten."
            ],
            "content":"<div class=\"\"><div> <span>You've sort been a friend of Wednesday for a while now. You're older than her by a few years but you always liked her even if she was weird and creepy. One day she asked you for help. Her family often entered into a yearly contest, it was a competition for witches, monsters and renouned dark families. She lost every year but this year she wanted to win. Her exhibit would be of humans being presented as food. Being somewhat close to Wednesday, but not so close that you'd realize the danger, you agree.</span></div></div>",
            "created":1107666000,
            "id":235399,
            "title":"Wednesday needs help"
        },
        "1531":{
            "choices":[
                "Morning comes and Wednesday gets you guys.",
                "Morning comes, Wednesday eats on of the capturees (not you) for breakfast."
            ],
            "content":"<div class=\"\"><div> <span>So I went to the 'artists' studio, as she liked to call it, and she explained that she was doing an exhibition about food. she had painted several and shrunk people already and put them to dry in a different room. I got to look at the shrunked little guys and they looked fantastic. One guy was painted to look like a banana and he actually did. Another kind of chubby guy actually had been changed into a tomato, one into a baked and served turkey and so on. They all looked terrified. Wednesday explained how they hadn't exactly volunteered. <br>\r\n<br>\r\nShe asked me to get undressed so she could start shaving me. I didn't want to be shaved, but she was one of my best friends and good actor would do almost everything for his part, so I got undressed in front Wednesday. You're underwear too, Wednesday blushed. My god, was this going to be a totally nude one? She said that after she painted me I would get to wear a string, but she had to paint me first. So I undressed and then she took me to a shower. She shaved me from top to bottom and not one hair was left on my body. Not a single one. I was smooth all over and actually getting quite excited because of it. Wednesday saw my nude and blushed, smiling she looked away but didn't say a thing. I had to shower but she only had cold water,  after I dried myself I went back into her studio.<br>\r\n<br>\r\nShe finally told me her plan. She was going to paint me into a hotdog. I have seen some things like that before so I guessed I had to curl up and Wednesday would paint the bread and the sausage on my back, but that was not his plan. She told me I would be painted like a sausage and put in a bread that would fit a sausage my size. I was amazed that she would make bread that big just for this occasion, especially if she was going to shrink me, but I guess I was wrong there. So she put me in place and started painting.Wednesday's strong yet soft hands were all over me, while she painted me all over. her brush went over over and over again and making me hotdog-brown all over. It took her quite a while to cover my entire body, but then finally she said she was finished and put me in the room with the other art subjects to dry. I was her last piece and tomorrow the exhibition would start. Tomorrow? I asked, but then I discovered that I couldn't move my body anymore. Hey Wednesday, what has happened to me? I can't move. <br>\r\n<br>\r\nThat's normal, she said. She needed the time and that's why she put something in the paint to make me and the others incapable of moving, because she couldn't do it just in the morning and have us on display in the evening. She than sprinkled some sort of dust on me and I started to shrink. Pretty soon I was staring up at my giant friend. She than smiled, turned and left<br>\r\n<br>\r\nSo I just stood there in a dark corner, watching all the other boys.</span></div></div>",
            "created":1107666000,
            "id":235401,
            "title":"part of her 'art' YUM"
        },
        "15311":{
            "choices":[
                "Wednesday wins the competition and forgets your friends.",
                "Some hungry individuals would like to eat you and the others."
            ],
            "content":"<div class=\"\"><div> <span>The night went by slowly and early in the morning Wednesday came into the room and took me from my place. She sprayed something on me and with that I could move again. It was just for a little while, she said, because she had to make sure I could get in my right position just before the exhibition would start. <br>\r\n<br>\r\nAs soon as the spray would dry I would be frozen again. I just let her carry and she brought me to a table on which was a huge silver plate with an even bigger bun on it. She asked me to lay down on it and so I did. I lay on my side with my back on the outside, cause people weren't supposed to see my face, arms and other bodyfeatures, I had to look like a real hotdog. At least as much as a human like me could look like one. Just when I found the right position the spray started to dry and I couldn't move again. She told me that I looked perfect and then she put the upperpart of the bread on top of me, after she added real ketchup and mustard so I would look right to the visitors. She then moved away from me and placed all the others in the room for display. With that we headed off to the contest. It was crammed to the brim with freaky looking people. I was scared as giant faces leered down at me. Was this a mistake coming here? Guests were amazed about the work Wednesday had done. Ah's and Oh's were all around me and I could even feel people touch me to see if I was real. They said I even felt like a sausage, which was kind of weird cause I just was human with a little paint and I didn't know they were alowed to touch me. But I could't move or speak anymore, so even the coldest hands didn't get a reaction from me. </span></div></div>",
            "created":1107666000,
            "id":235403,
            "title":"Ready to be eaten"
        },
        "153112":{
            "choices":[
                "Hermione Granger (wearing a long robe and has brown hair)",
                "Annabelle Deville  (wearing a green dress and has blonde pigtails)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Unfortunately for you some of the people attending the compitition came on empty stomachs. A giant hand reaches for you. It happens to belong to</span></div></span></div>",
            "created":1107666000,
            "id":235404,
            "title":"Hungry Witches"
        },
        "1531122":{
            "choices":[
                "and lightly licks her lips",
                "and says, \"One of my friends is hungry\""
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nAnnabelle<br>\r\n<a rel=\"nofollow\" href=\"http://www.sue-chan.com/art2/witchgirls.jpg\" target=\"_blank\">http://www.sue-chan.com/art2/witchgirls....</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.borderwalker.com/watkins/folio/illo_wgt1.jpg\" target=\"_blank\">http://www.borderwalker.com/watkins/foli...</a><br>\r\n<br>\r\nThe young green dressed witch snatches you up. Her hair is actually in blonde locks that bounce as she walks. She holds you very daintily in a gloved hand. You're really not sure what the young witch has in store for you.<br>\r\n<br>\r\nLooking down at your hotdog form she sneers. <br>\r\n<br>\r\n\"What are you going to do to me?!!!\" You cry.<br>\r\n<br>\r\nShe opens her mouth</span></div></div>",
            "created":1108789200,
            "id":236859,
            "title":"Annabelle snatches you"
        },
        "15311221":{
            "choices":[
                "\"It was a pleasure meeting you\"  CHOW DOWN!!!",
                "\"I think one of my friends might like you more.\""
            ],
            "content":"<div class=\"\"><div> <span>She licks her lips causing you to squrim in fear. She started to carry you to her art exhibit. <br>\r\n<br>\r\n\"My cousin Janette has been telling me how I should really try mortal food, that I would enjoy it. Well you're a mortal and food are you not?\"<br>\r\n<br>\r\nShe smiled down at you.<br>\r\n<br>\r\n\"NOOOOOOOO, I'm a human being!!!!!!\"<br>\r\n<br>\r\nShe glares at you, \"Now don't cause a scene or I'll have to do something positively horrific to you!\"<br>\r\n<br>\r\nyou don't anything that could be worse than being eaten alive but you don't want to find out. You wisely shut up.<br>\r\n<br>\r\n\"So what are you dressed up as again?\"<br>\r\n<br>\r\nYou roll your eyes, \"A hotdog.\"<br>\r\n<br>\r\n\"Ahh yes, strange name.\" she giggled</span></div></div>",
            "created":1111381200,
            "id":240809,
            "title":"Annabelle gets to know her food"
        },
        "153112211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "I'll become an Addams.",
                "No, thank you."
            ],
            "content":"<div class=\"\"><div> <span>Annabelle grinned. \"It was a pleasure meeting you.\" she said.<br>\r\n<br>\r\nWith that said, she opened her mouth and took a bite, taking your legs with it, just below the knees! You screamed in agony but your pride would not allow you to go down without a fight, even a vain one.<br>\r\n<br>\r\n\"I hope I give you indigestion!\" you screamed as Annabelle took another bite.<br>\r\n<br>\r\nAnnabelle sent her front teeth into your stomach and a spray of your stomach acid struck the roof of her mouth. \"Oh!, you are spicy in the center!\" she said, after swallowing that part of you. \"Thank you for that wonderful blessing!\"<br>\r\n<br>\r\n\"Is she serious!?!\" you thought, now more dull to the pain. \"Wait, I should be deep in shock by now... what's going on!?!\"<br>\r\n<br>\r\nThen, Annabelle took another bite, this time, puncturing both of your lungs as you screamed every curse word instead of begging for mercy as the other boys in Wednesday's food display. You did not see any sense in begging when you were already mostly eaten and soon to be dead anyway.<br>\r\n<br>\r\n\"I'll give you stomach cramps that'll make PMS feel like a gentle massage!\" you screamed, as she placed the last little bit of you in her mouth. \"Mark my words, I'll make you suffer all the way to the toilet!\"<br>\r\n<br>\r\nFinally, your words were silenced as Annabelle swallowed your head and she smiled, feeling very satisfied as she turned to a grinning Wednesday. \"Your food display was excellent!\" she said. \"Your center piece hot dog was complimenting, spicy in the center, and a fighter all the way to the end!\" she paused, thinking of you. \"I vote that Wednesday Addams be  declared the winner of this year's display and her hot dog be given first prize!\"<br>\r\n<br>\r\nThe other members of the party agreed and applauded Wednesday who blushed brightly, happy that she had won.<br>\r\n<br>\r\nHours later, you woke up, lying on Wednesday's bed with her sitting at the bedside, you were still naked, with the exception of a string. You tried to sit up but  a sharp pain throughout your body forced you to lay back down. You were alive and whole again but still at the mercy of Wednesday, who you were beginning to fear greatly.<br>\r\n<br>\r\n\"Welcome back, beloved friend.\" said Wednesday, gently. \"I am most grateful that you have returned to the world of the living and that you have won first prize.\" she gave you a courtesy. \"Thank you for helping me win the competition this year, I am very grateful to you.\"<br>\r\n<br>\r\nYou merely glared at her, annoyed that she had done this to you, despite the  fact that you survived to tell the tale of your experience. Wednesday noticed your expression and frowned. \"I can only imagine what you must be feeling right now, my angered friend.\" she said, raising a dramatic hand to her forehead. \"Betrayed by your best friend, painted to look like a hot dog, made unable to move, placed in a bun and coved with condiments only to be served as a snack at a family party and eaten alive!\" she let out a longing sigh, lowering her hand. \"How I envy you!\"<br>\r\n<br>\r\nFor some strange reason, all of your anger melted and you laughed out loud until the sharp pains inside of you from being chewed up forced you to stop. \"I... It was a unique experience.\" you said painfully. \"Um... I'm not used to such pains, though, can you...\"<br>\r\n<br>\r\nWednesday eyes suddenly widened as she realized that you were not actually enjoying your pain and sprinkled some powder onto you, causing the pain to cease. \"Please forgive me, my mortal friend.\" she said. \"I momentarily forgot that you are not an Addams.\" she paused, grinning. \"However, as you had won first prize, I have been given permission to give you a one time offer to become a member of the Addams family clan.\"<br>\r\n<br>\r\n\"Wait a minute, you want to 'adopt' me?\" you asked.<br>\r\n<br>\r\nWednesday nodded, her eyes widening more with excitement. \"It's very rare that a person as young as you is given this most generous offer.\" she said. \"Also, this is the first time I had been given the honor of making a person a member of the family.\" she hugged you to the point you swore you heard a few ribs crack. \"Oh, please say yes, my beloved friend and hopeful sibling! It would mean the world to me!\"<br>\r\n<br>\r\n\"What of my original family?\" you asked, worried. \"They might fight you, knowing that you are taking me away.<br>\r\n<br>\r\nWednesday smiled. \"They already think you are dead and buried.\" she replied. \"If you agree to become one of us, you will live on as a new family member of my choice, including a family pet or a new favorite living doll.\" she then shrugged. \"If you refuse, well, it was nice knowing you.\"<br>\r\n<br>\r\nThere was not much of a choice, unless Wednesday was bluffing. How do you respond.<br>\r\n<br>\r\n</span></div></div>",
            "created":1285477200,
            "id":963771,
            "title":"You win first prize?"
        },
        "1531122111":{
            "author_id":"transylvania",
            "author_name":"Transylvanian vampire",
            "choices":[
                "I know you like me and I like you to so you can marry your way in.",
                "Well have to kill your family so we can adopt you legally."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Very well I'll become an Addams. Oh thank you dear friend I am most pleased that you agreed Wednesday said looking down at you. Now their are two ways we can do this.</span></div></span></div>",
            "created":1285736400,
            "id":965425,
            "title":"Decisions"
        },
        "154":{
            "author_id":"dawnbringer",
            "author_name":"Dawnbringer",
            "choices":[
                "on the kitchen counter",
                "some place dark"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oh really? That could be trouble, where are you?</span></div></span></div>",
            "created":1079931600,
            "id":192665,
            "title":"A 'Dinner Guest'"
        },
        "1541":{
            "author_id":"aaronscales",
            "author_name":"Aaron Scales",
            "choices":[
                "Roast him alive",
                "Swallow him raw",
                "alternate choice (Hard vore)"
            ],
            "content":"<div class=\"\"><div> <span>You wake up groggy and shivering on the hard stone counter top. As you come to you quickly realize you're completely naked, bent over on your knees with your arms behind your back, and tied tightly into position with what feels like cooking twine. You barely have time to question it before you hear the familiar voice of the Addam's oldest child Pugsley talking to his father.<br>\r\n\"Wow, pops, we're really gonna eat somebody?\"<br>\r\n\"Not we, my boy, you.\" Gomez says proudly as he leads his son into the kitchen \"It's an Addams tradition for a boy your age. You need to get a taste for blood like the rest of the Addam's men\"<br>\r\n\"Yeah, and it'll put some meat on your bones!\" Uncle Fester chimes in as the men turn the corner to where you can see them, and they can see you.<br>\r\n\"WOW, I know him from school, he's always fallowing me home and stuff.\"Pugsley says with a sinister smile that scares you, your young bare body shivering more from fear than coldness now.<br>\r\n\"Had Lurch grab him before he took your mother and Wednesday out to the shopping mall for their girl time. What better first meal,\" Gomez explains, walking over and giving you a swat on the butt that makes you whimper \"But he's not ready yet, first he needs to be prepared. Fester, you get started on the stuffing, I'll do the garnish\"<br>\r\n\"Sure thing, Gomez.\" Uncle Fester replies before going over and starting to mix together an odd mush in a large bowl. Pugsley walks over and runs a hand over your butt cheek and up your back, making you shudder and cry out for help before an arm reaches out of a nearby box and shoves an apple in your mouth<br>\r\n\"Thanks Thing.\" Pugsley chuckles as the hand motions in response before slipping back into the box and closing the hinged lid.<br>\r\n<br>\r\nWithout further adieu, Pugsley pulls a stool over and hits to watch his father start slicing onions potatoes and veggies into a large roasting pan. He then lifts you and sets you into it on your knees and chest. You cry muffledly through the apple, but they ignore it. Gomez opens the box the hand reached out of before and drops in a pineapple. there's a moment wet cutting sound before several large pineapple slices flew out of the box and landed in a line down your back, which forks to the last two land on head butt cheek.<br>\r\n\"Good show, Thing old man!\" Gomez calls, looking into the box before being squirted in the face with pineapple juice and pulp, which he just wipes away with a chuckle as the box's lid closes \"That sneaky little scamp.\"<br>\r\n\"So, is he ready yet, Pop?\" Pugsley asks with a tone of excitement that makes you whimper<br>\r\n\"Not yet! We still gotta stuff 'em\" Fester replies as he walks up behind you and pulls up his sleeve before burying a handful of the warm much he'd made into your exposed rear. You cry out into the apple gagging you as he pulls his hand out and stuffs in another handful. and another, packing it in good and tight and till Gomez stops him.<br>\r\n\"Whoa, Fester, slow down. You don't want to poor lad. Not yet anyway.\"<br>\r\n\"Oh, sorry. I got a little caught up in the moment\" Fest says with a cheeky grin before stuffing a large root vegetable into your hole, keeping the stuffing from being pushed out. You look around nervously before notice Pugsley drooling over your naked form \"Is he ready now?\"<br>\r\n<br>\r\n\"Not quite, son. We've still gotta roast him in the oven.\" Gomez says, reaching up and turning the dial of the large appliance to Preheat.<br>\r\n\"Aw, come on Gomez, let the kid have a little fun.\" Fester eggs him on a bit \"nothin tastes better than a boy swallowed whole.\"<br>\r\n</span></div></div>",
            "created":1360904400,
            "id":1532583,
            "title":"Having a school chum for lunch"
        },
        "15411":{
            "author_id":"aaronscales",
            "author_name":"Aaron Scales",
            "choices":[
                "Swallows you whole",
                "Carves you up and eats you"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, I disagree\" Gomez says, a stern air of debate in his voice \"Roasting the boy alive will enhance his flavor greatly\"<br>\r\n\"And I'll get to watch him squirm and suffer as he cooks, I'm in!\" Pugsley concludes before hopping off his stool and picking you up off the counter, roasting pan and all. Gomez smiles and offers a cheery \"Atta boy\" as his son opens the oven door and slides his male classmate inside. It was easily big enough, you didn't even touch the sides. You barely have time to adjust to the heat beginning to prickly your skin before Pugsley slams the door on you, smirking as he watches you through the window, illuminated only by the burning hot coils roasting your flesh.<br>\r\n<br>\r\nYou groan and writhe as the heat washes over you, making you sweat all over, which mixes with the pineapple juice and starts to sizzle. You can feel your skin tighten and darken, the stuffing in your butt expanding and making you feel even fuller as you roast alive. All the while, the Addams boy you thought was sorta cool watched you with a sadistic glee as you browned like a thanksgiving turkey. The minute feel like hours, but after about an hour, you're still conscious enough to see Gomez open the oven door to squirt a brown sauce over you from a turkey baster. He wets your entire body before closing the door again. The sauce sizzles on your skin just like your sweat and the pineapples, but you can barely feel it. This process would repeat every hour until you were fully roasted and all but numb. You questioned how you were alive and conscious at this point, but you don't have much time before Uncle Fester pulls your golden brown body out of the oven and scoops you out onto a silver platter. <br>\r\n\"One last thing\" The mischievous bald man says in an almost sing-song tone as he slips a pair of paper turkey frills onto your ankles before serving you to his nephew.<br>\r\n\"Are the booties really necessary, Fester?\" Gomez asks, tapping his chin as he looked over the roast boy.<br>\r\n\"Of course!\" He replies, before popping an extra one in his mouth and munching on it \"plus they taste pretty good too.\"<br>\r\n<br>\r\nYou once again find yourself staring down a ravenous Pugsley and it looks like you're lunch. You only wonder how he's going to eat you...<br>\r\n</span></div></div>",
            "created":1360904400,
            "id":1532588,
            "title":"Nothin says lovin like shovin in the oven"
        },
        "1542":{
            "author_id":"dawnbringer",
            "author_name":"Dawnbringer",
            "choices":[
                "\"Please, don't eat me!\"",
                "\"I hope you choke on me!\""
            ],
            "content":"<div class=\"\"><div> <span>You can’t believe this is happening to you! You and your friends had lost a baseball to the Adam’s creepy looking yard. At the time you didn’t know why everyone was so scared of the place. The rumors about the house being haunted were just that, rumors. You had shimmied over the fence and snatched the ball only to be knocked unconsious by who knows what. “Man, this is so uncool!” All of a sudden your dark prison seems to rise into the air. All of a sudden you’re moving! After a minute of this your prison seems to lower and stop. All of a sudden the metal covering surrounding you disappears. Lurch, the Adams unsavory butler, trudged off back to the kitchen. “Oh no,” you scream in terror, “I’ve shrunk!” You’re on a giant plate with a piece of lemon in the corner. Sitting before you is a gigantic pale faced girl with black hair, pulled back into pigtails, and clothed all in black. You can’t help but cringe as Wednesday Adams leers down at you.</span></div></div>",
            "created":1079931600,
            "id":215054,
            "title":"You, mmmm, its whats for dinner!"
        },
        "15421":{
            "author_id":"hauthor",
            "author_name":"Hidden Author",
            "choices":[
                "Wednesday keeps you hidden.",
                "Wednesday shows you off to her mom"
            ],
            "content":"<div class=\"\"><div> <span>\"Please, please don't eat me,\" you beg the giantess leering down at you.<br>\r\n<br>\r\n\"Why shouldn't I eat you?\" asks Wednesday tauntingly.<br>\r\n<br>\r\n\"I can h-help you with those kids who tease you at school,\" you whimper.<br>\r\n<br>\r\nWednesday just grins. Clearly you are just amusing her.<br>\r\n<br>\r\n\"I'm serious!\" you say indignantly. \"Could you imagine how scared they'll be if you have me crawl down their backs?\"<br>\r\n<br>\r\nWednesday was getting curious now. \"But how you would any more useful than any insect I could pick off the ground?\" she asks you in a sweet-sounding voice.<br>\r\n<br>\r\n\"Loads of ways. Number one, you've already got me. Number two, I can take orders. For instance, if you <i>order</i> me to jump at a girl you hate, I'll do that. And if you <i>order</i> me to come back to you at the end of the school day, I'll come back to you.\"<br>\r\n<br>\r\nWednesday pets you with a stroke of her gigantic hand.<br>\r\n<br>\r\n\"You're so cute,\" she coos. \"I love the way your mind works. You'll be a perfect little pet.\"<br>\r\n<br>\r\nThe two of you hear footsteps approaching.<br>\r\n<br>\r\nWednesday whispers, \"I'll have to hide you for your own good,\" before stuffing you into the pocket of her dress.<br>\r\n<br>\r\nThen Wednesday's mom, Morticia, opens the door and walks into the room.</span></div></div>",
            "created":1094619600,
            "id":215794,
            "title":"Offering Your Services"
        },
        "154211":{
            "choices":[
                "\"Okay, we're headed for my room.\"",
                "(Wednesday licking her lips) \"You know, I've changed my mind\""
            ],
            "content":"<div class=\"\"><div> <span>She hides you quickly under the table. \"Hello mother.\" <br>\r\n<br>\r\n\"Ahhhhhhhhh Wednesday, I'm glad to see your finished eating. You should get packing for our trip to Transylvania.\"<br>\r\n<br>\r\nWednesday rolled her eyes, \"Yes mother, of course.\" <br>\r\n<br>\r\n\"Well get packing soon Wednesday, its sure to be a perfectly horrific trip. Be sure to get up as early as you can tomorrow. If we can hurry we might be in time for the earth quake. I've heard tremors have been shaking it for the past month. The sooner we get there, the better our chances of getting caught in the middle of it.\"<br>\r\n<br>\r\n\"Of course mother,\" Wednesday responded absent mindedly.<br>\r\n<br>\r\nShe took her little victim out from under the table. \"Stop squirming about!!!!\" </span></div></div>",
            "created":1095570000,
            "id":217184,
            "title":"Wednesday's Descission"
        },
        "1542112":{
            "choices":[
                "Dips you in  sauce.",
                "Throws you in a lunchbag for school tomorrow."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You know I've changed my mind.\" Wednesday licked her lips and set you back down on her plate.<br>\r\n<br>\r\nYou can't help but gulp, \"Wh What do you mean by that?\"<br>\r\n<br>\r\nIn reply Wednesday</span></div></span></div>",
            "created":1107061200,
            "id":234569,
            "title":"Wednesday changes her mind"
        },
        "154212":{
            "author_id":"krocket",
            "author_name":"Krocket",
            "choices":[
                "\"Wouldn't you'd rather be with me?\"",
                "\"What a cute pet. Where did you find him?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You back up slowly as Wednesday pulls you out of her pocket and shows you to her mother.<br>\r\n<br>\r\n\"Mother, this is my pet. Pet, I expect you to be nice to her.\"<br>\r\n<br>\r\nMortica says:</span></div></span></div>",
            "created":1101445200,
            "id":227009,
            "title":"Mrs. Addams"
        },
        "1542121":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "The Kitchen",
                "Her Bedroom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Morticia snatched you out of her daughters hand and said \"I bel he prefers to be with me.\" And waked off with you in her palm. She glanced at you as she walked down the hall and made her way to</span></div></span></div>",
            "created":1427346000,
            "id":1954345,
            "title":"\"Wouldn't you'd rather be with me?&..."
        },
        "15422":{
            "author_id":"kidclefspeare",
            "author_name":"kidclef",
            "choices":[
                "Gulp!",
                "Crunch!"
            ],
            "content":"<div class=\"\"><div> <span>Obviously, that was the wrong thing to say. Shortly after hearing that, Wednesday eyes narrrow. She definitely is mad now. \"Oooooookay\" you say, \"maybe we got off on the wrong foot here.\" But she's not listening. Without another word she picks you up and dangles you over her mouth. \"Don't worry,\" she leers \"I won't!\" Then she.....<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat does she do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1229922000,
            "id":623336,
            "title":"\"I hope you choke on me!\""
        },
        "154221":{
            "author_id":"kidclefspeare",
            "author_name":"kidclef",
            "content":"<div class=\"\"><div> <span>Without wasting anymore time, she drops you. You tumble for a moment, then land in her mouth. She sucks on you a moment, tasting you a moment. She hesitates, debating whether or not to chew, then just swallows. Muscles constrict you, forcing you down your esophagus and coating you in slime. You then plop into her stomach. You scream and pound but she just enjoys it. Digestive enzymes coat you tearing you apart and you black out.  </span></div></div>",
            "created":1229922000,
            "id":623349,
            "title":"Gulp!"
        },
        "155":{
            "choices":[
                "You try to escape",
                "You hear someone else enter the room"
            ],
            "content":"<div class=\"\"><div> <span>   You are simply walking by a strange looking house .Suddenly you feel very funny .Then the world looks different to you .Everything is gigantic! Then you realize that you have shrunk ! You are trying to figure out what to do when a gigantic hand grabs you . You are lifted to the face of a chubby little boy .Put me down you say trying to sound as firm as possible. The boy ignores you but carries you into the house .The house seems even stranger on the inside then the outside. The boy carries you into his room and puts you in a box with some toy <br>\r\nsoldiers. You will be my new toy soldier he says.<br>\r\nI am leaving for now but don't try to escape .There are other people in my family that might eat you. He leaves you in the box with the toys and walks out .You think you can get out of the box.  </span></div></div>",
            "created":1080018000,
            "id":192739,
            "title":"Toy Soldier"
        },
        "1551":{
            "author_id":"dawnbringer",
            "author_name":"Dawnbringer",
            "choices":[
                "is the chubby boy again, Pugsley.",
                "is a pale, demonic looking girl, Wendesday"
            ],
            "content":"<div class=\"\"><div> <span> The box isn't that big, and the giant boy left the lid off. Jumping in the air,your actually able to get a good grip on the top of of the box! Falling out, you crash into the floor with a thud.Shaking you head, you get up and survey the room. The room he left you in is very morbid looking. You can only be forced to imagine what type of people live here. Not wanting to confront the giant boy again, you decide that your best bet would be to make a run for it. Dashing across the room, you head for the open door. Flying through the doorway you turn the corner, only to fly into a gigantic shoe. Dazed you drop to the ground, in horror. Staring down at you </span></div></div>",
            "created":1080277200,
            "id":192926,
            "title":"The Great Escape!"
        },
        "15512":{
            "author_id":"pikman35",
            "author_name":"pikman34",
            "choices":[
                "To worship your feet forever and to be your toy"
            ],
            "content":"<div class=\"\"><div> <span>She takes you ought of the shoe and says your cute you will be my pet and you will do what i tell you to do. She brings you to her room she removes her socks revealing her pale blank toe nail painted foot. Start kissing. you kiss and lick in between her toes for your life.she sits you on the bed and sets you in front of her feet rub them and clean them and i might do something helpful in return. you start rubbing and picking the toejam in between her toes. Her feet don't smell bad at al the actually smell great! She grabs you and kisses you. then says what would you like besides given restore to your normal size. you say...............</span></div></div>",
            "created":1280120400,
            "id":925017,
            "title":"is a pale, demonic looking girl, Wendesday"
        }
    },
    "info":{
        "author_id":"dawnbringer",
        "author_name":"Dawnbringer",
        "brief_description":"Addams family member? if your not, try not to be shrunk, squashed, enslaved or eaten!",
        "created":1080010860,
        "description":"<td align=\"left\" class=\"norm\">Addams family member or victim? Go about your day to day life as a member of the family, and if your not, try not to be shrunk, squashed, enslaved or eaten!</td>",
        "id":831215,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602659580,
        "modified":1602659580,
        "pretty_title":"Tales of Addams Family"
    }
}