{
    "chapters":{
        "1":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Human",
                "Mobian"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Right... Let us begin. I'll start you off.<br>\r\n<br>\r\nWhat species are you?</span></div></span></div>",
            "created":1262408400,
            "id":814448,
            "title":"Beginning"
        },
        "11":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright then...<br>\r\n<br>\r\nNow what gender are you?</span></div></span></div>",
            "created":1262408400,
            "id":814450,
            "title":"Human"
        },
        "111":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sounds good.<br>\r\n<br>\r\nSo, shall we get this started? I shall start you off once again.</span></div></span></div>",
            "created":1262408400,
            "id":814451,
            "title":"Male"
        },
        "1111":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Oh, Shit! *run*",
                "You got me... I submit."
            ],
            "content":"<div class=\"\"><div> <span>    WHAM! You hit the ground exceptionally hard... getting up slowly, you rub your head, trying to remember what happened. Ah, it comes back to you... You were taking a walk, and suddenly a portal was ripped open in front of you and sucked you in. Returning your mind to the present, you notice a castle in front of you, and your curiosity is peaked. You walk up to the door, cautiously opening it and stepping inside. As soon as you close the door, you feel a strange tingling sensation, and suddenly things seem bigger to you.<br>\r\n<br>\r\n    Wait... no, you're just smaller! How the hell did that happen? Well, at least your clothes shrank with you. Swearing in confusion, you try to find a place to calm down and get your bearings when the door opens again, and in walks that sexy lavender cat that you've masturbated over for 3 years... oh wait, that's just me. Blaze closes the door, and stretches some, when she stops... and sniffs the air. Then, she slowly turns her head... and stares right at you.</span></div></div>",
            "created":1262408400,
            "id":814457,
            "title":"Continue."
        },
        "11111":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you make it?</span></div></span></div>",
            "created":1472619600,
            "id":2204448,
            "title":"Oh, Shit! *run*"
        },
        "11112":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Slave? No way!",
                "Sounds fine... she is Blaze, after all"
            ],
            "content":"<div class=\"\"><div> <span>\"<i>Hmm... the only reason someone else would be in here is... ahhh.</i>\" She thinks, slowly making her way over to you, her footsteps shaking the ground. \"Come out, little one... I won't hurt you. I just called you here to help me, that's all...\" You shake your head, wondering what you were thinking. She's BLAZE, dammit!<br>\r\n<br>\r\n\"Okay, fine...\" As soon as you come out, WHAM, one of her boots slams down right in front of you... taking the chance, you look up, and holy crap is she big! To you, she's maybe as big as a five story building. \"Ahhh... my slave reveals himself...\" She purrs, grinning down at you...</span></div></div>",
            "created":1280811600,
            "id":929195,
            "title":"You got me... I submit."
        },
        "111122":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "foot worship",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>She slowly reaches down and picks you up to eye level. You stare at her huge face. She then says \"I have brought you here for you to help me with something.\" You feel scared, not knowing what she means. She walks over to a large chair (it looks exceptionally large to you) and she sits down. She then says \"You can either worship my feet, be a pleasure toy or a snack.\" You don't like any of then. \"Choose quickly or I'll choose for you.\" The giant sexy purple cat says. You think of the choices not liking any of them. You ponder this for a moment then come to a conclusion.</span></div></div>",
            "created":1306904400,
            "id":1117912,
            "title":"Sounds fine... she is Blaze, after all"
        },
        "1111221":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "\"You're done?!\" (bad)",
                "\"Nice job.\" (good)"
            ],
            "content":"<div class=\"\"><div> <span>You think that foot worship is better than the other options she gave you. <br>\r\n<br>\r\n\"Well? What is your answer?\" the giantess says to you. Not wanting her to choose for you, you exclaim \"Foot worship!\" The cat lets out a small chuckle.<br>\r\n<br>\r\n\"What a wise choice.\" the sexy purple cat says with a grin across her face. She places you on a stool, then removes her shoes and socks. After that she puts her feet up on the stool. Her feet, to you, were the size of a 2 story building. Then you notice a stench like a skunk. She says \"Admire them when you're done. Now get started with your tongue.\" You dare not argue and start to lick. As you lick you look at her toes and notice they are human like with five toes with padding on the bottom of each. You then look at the part you are licking and notice that you are licking the padding on the sole of the foot. You finish both feet in about 2 hours. You lay down exhausted. Blaze then sees you and says...</span></div></div>",
            "created":1306904400,
            "id":1117946,
            "title":"foot worship"
        },
        "11112211":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "content":"<div class=\"\"><div> <span>The purple cat looks down at you and says with a questioning look \"You're done!?\" You don't like the way she said it. Blaze puts you on the ground and steps on you, like an ant. She lifts he foot up. You realize you are stuck to her foot. She doesn't seem to notice or care. You live out the rest of your life stuck to the sole of Blaze's foot.</span></div></div>",
            "created":1306904400,
            "id":1118112,
            "title":"\"You're done?!\" (bad)"
        },
        "11112212":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "Drops you in",
                "Moves you away"
            ],
            "content":"<div class=\"\"><div> <span>She tells you that you did a good job. You ask if you can take a rest. \"Rest, we just started.\" She places you into one of her shoes as she goes for a walk. You are in her sock along with her foot. You are up against the sole of her foot. With each step she took her foot pressed down on you. Strangely you were ok. After a minute or two she takes he shoes of and begins to walk bare foot. The foot presses you between the floor and her foot. The padding must be what is protecting you. After  two minutes she takes you out of her sock and says \"Ok that's done.\" You hear a growl from her stomach. She lifts you over her mouth and opens up wide. You can see her white teeth, the black hole that was her throat, and the muscle that is her tongue. She then....</span></div></div>",
            "created":1306904400,
            "id":1118088,
            "title":"\"Nice job.\" (good)"
        },
        "111122121":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "Digest while sleeping",
                "Live"
            ],
            "content":"<div class=\"\"><div> <span>She drops you in her mouth. After closing her mouth she swishes you around her mouth. she occasionally pauses to suck on you. After this she decides to swallow. She tilts her head back and you slide down into her throat. Your head just disappeared down her throat. After a few minutes of swallowing and gulping sounds you plop into her stomach. You think your ok an fall asleep.</span></div></div>",
            "created":1306904400,
            "id":1118115,
            "title":"Drops you in"
        },
        "1111221211":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "content":"<div class=\"\"><div> <span>Blaze pats her belly. \"I should have told you that you would be digested.\" the purple cat says. After a few minutes her stomach growls. This tells her that you have been digested. The purple cat gets up to look for food to eat. She says to herself \"At least you'll become part of me.\" and with that the purple she cat had found some meat in her fridge and begane to eat it.</span></div></div>",
            "created":1306904400,
            "id":1118119,
            "title":"Digest while sleeping"
        },
        "1111221212":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "Stay",
                "Orgasm"
            ],
            "content":"<div class=\"\"><div> <span>You wake up still in the stomach. You notice you have not been digested. You are happy for this. Suddenly you hear the purple cat speak \"I wouldn't harm someone who did a good job on my feet. You'll have to go through the rest of my digestive track if you want to get out.\" You listen and then look around the stomach. You see an exit and go through. It only takes you stew minutes till you reach the big intestine. From there you walk to the end. You arrive at the end of the big intestine but don't see an exit. You start to walk but your feet feel like they are anchored down. You look down to see the ground absorbing you. After a few seconds you fall into Blaze's panties. \"You have a choice either stay in there a while ot enter my orgasm.\" you hear the giant purple she cat say. You decide to go with....</span></div></div>",
            "created":1306990800,
            "id":1118655,
            "title":"Live"
        },
        "111122122":{
            "choices":[
                "Paws",
                "Butt",
                "Belly"
            ],
            "content":"<div class=\"\"><div> <span>You were scared for your life as you looked at the abyss below. Suddenly you were pulled away and greeted by a smug grin from your feline goddess. \"You don't think I'd do that, do you? You still have a whole lifetime of servitude to dedicate to your wonderful goddess.\"<br>\r\n<br>\r\nHer lips puckered and blew a powerful gust of wind which made you flutter back and forth between her fingers like a shred of paper in the wind. She giggled at how helpless you were just to her breath. \"Though if you disappoint me, I might make you wish I'd just eat you.\" She added with a wink before lowering you towards her-</span></div></div>",
            "created":1464066000,
            "id":2153196,
            "title":"Moves you away"
        },
        "1111221221":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "She wants you to lick her paws more",
                "She wants to teach you your place beneath them"
            ],
            "content":"<div class=\"\"><div> <span>Placing you back at her paws, the royal purple feline smirked and sat back, wriggling her toes. <br>\r\n<br>\r\n\"I'm quite fond of them, you know...\" She chuckles, lowering her eyelids a bit as she gazed down at you and began to lower both paws atop you, sealing you in a dark, warm, lightly scented cave of paw, pressing you down... The pressure is slight, but you can feel the sheer overwhelming power of this massive cat.<br>\r\n<br>\r\n\"I hope you are as accommodating.\" Blaze's tone turns cold and you perhaps get the feeling she wants something of you...</span></div></div>",
            "created":1464066000,
            "id":2153208,
            "title":"Paws"
        },
        "11112212212":{
            "choices":[
                "Submit ",
                "Fight back"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly the massive purple soles pressed down on your insignificant form. It wasn't enough to kill you, but you were completely immobilized and felt their weight bearing down on you, some light flowed in as she stretched and splayed her toes. Blaze was mostly silent. Her paw pressed down even more bringing some discomfort, but still not enough to kill you. \"Incredible. Isn't it?\" She asked aloud in a distant voice. Your form was changed to the point where you fit perfectly beneath my paws. Perfectly between my toes, and perfectly under the merciful grip of my heel. Fate has decided your new place in life. And while I'll be more lenient at first, I expect you to accept your place as dirt under my feet. I expect you to beg for your rightful position when you're not serving me in other ways. I expect you to thank me for allowing you the honor to fulfill your natural purpose in life.\"<br>\r\n<br>\r\nHer tone seemed powerful and commanding. Fitting for her royal position. \"Now prove to me that you acknowledge and accept your role in life.</span></div></div>",
            "created":1464066000,
            "id":2153349,
            "title":"She wants to teach you your place beneath them"
        },
        "111122122121":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "She accepts your worship",
                "She wants more from you"
            ],
            "content":"<div class=\"\"><div> <span>Blinking as her soft voice, even as loud as it was to you, filtered down through her paws and into your ears, you thought over what she had said. Perhaps... perhaps she was right. You did fit perfectly under her foot, and, as commanding as she was... You were starting to enjoy it just a little. <br>\r\n<br>\r\n\"My Goddess... I... I do acknowledge my place and my role in life... And I thank you from the bottom of my heart, Goddess!\" Unbidden, maybe acting on a desire from earlier, you leaned up to kiss the paw as it pinned you down, marking your complete servitude. \"I beg you, allow me to worship you from now until the day I die... or... am no longer useful.\" You gulped as those words passed your lips, knowing there was absolutely no turning back now.<br>\r\n<br>\r\nThe royal cat smiled predatorily... and opened her mouth to give the verdict...</span></div></div>",
            "created":1464066000,
            "id":2153500,
            "title":"Submit "
        },
        "1111221221211":{
            "choices":[
                "She orders you to worship her.",
                "She has you tend to her paws.",
                "She makes you feed her."
            ],
            "content":"<div class=\"\"><div> <span>Everything went silent for a moment. You started to fear that Blaze was going to end you. But instead the paw began to lift off of you. Light flashes in, blinding you briefly until your eyes readjusted. You now had a perfect view of the feline Titan, towering over you at her full height. The sight was truly intimidating, and her predatory smile made her appear even more powerful. \"Very well. From this day forward, you are officially my servant and property. As I mentioned earlier, I shall show some leniency early on as you adjust to your new role, but by the end of the week I expect you to obey the sound of my voice without question or hesitation.\" Her authoritative tone made her seem like a god, echoing from the heavens. She then leaned closer to you, licking her lips as she appeared to think of something. \"Unless I personally grant you permission to rebel or resist. In those instances, feel free to put up a little fight. It may amuse me.\"<br>\r\n<br>\r\nA loud thud rumbled to your left as she lowered her paw back near you</span></div></div>",
            "created":1464152400,
            "id":2153583,
            "title":"She accepts your worship"
        },
        "11112212212111":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Set her foot down atop you and give you a bit of a scare",
                "Begin to play with you with her paws, teasing you as she did so"
            ],
            "content":"<div class=\"\"><div> <span>\"Now... Worship me.\"<br>\r\n<br>\r\nThe words entered your brain and seemed to almost take control of you. They repeated in your mind, over and over again... '<i>Worship me... worship me...</i>' What choice did you have but to obey? You crawled to your Goddess' footpaw, pressing yourself to the sole of her foot, kissing the sole of her foot over and over while thanking your Goddess for allowing you the honor of contact with her holy feet. The taste itself was divine, lightly musked with a hint of some fruity lotion... As a royal, she must take very good care of her feet!<br>\r\n<br>\r\nSeeing your devoted worship, Goddess Blaze leans back and sighs a bit happily, wiggling her sexy purple toes. With such a little slave at her feet, it was impossible for her not to...</span></div></div>",
            "created":1464152400,
            "id":2153747,
            "title":"She orders you to worship her."
        },
        "111122122121112":{
            "choices":[
                "She \"punishes\" you with her paws",
                "She wants to play a game",
                "She orders you to clean her"
            ],
            "content":"<div class=\"\"><div> <span>You continued to press you body tightly against her sole, kissing, smelling, rubbing. Blaze purred quietly overhead as her slave kept up the royal treatment. Suddenly you felt something press behind you, pinning you into the sole. Blaze had sandwiched you between both footpaws and gently squeezed and rubbed you. \"What's wrong? Why did you stop?\" Blaze taunted. \"Did I give you permission to stop. Get back to work or there <i>WILL</i> be punishment.\" Blaze said in a stern tone. Though she seemed to purr a little as she said 'will' with such certainty. Try as you might, you were completely immobilized as her feet pressed harder. Their sweet scent filled your senses while you felt some sweat, maybe from her paws, maybe from you. Whatever the origin, it wasn't enough for you to slide your limbs and get back to work. Finally the feet separated and you fell to the floor. Before you could move, both feet came down, pinning your legs with one and your arms above your head with the other. <br>\r\n<br>\r\n\"Well? What are you doing just laying there? I didn't give you permission to take a break. Now get to work. Final warning.\" She leaned in with a taunting smirk across her face. \"Come on, is my worthless little slave too week to move my foot away. That's a shame.\"<br>\r\n<br>\r\nThe foot above you moved, freeing your arms, but leaving your legs trapped.</span></div></div>",
            "created":1464152400,
            "id":2153907,
            "title":"Begin to play with you with her paws"
        },
        "1111221221211121":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Playful (Non-lethal)",
                "Mean (Possibly lethal)"
            ],
            "content":"<div class=\"\"><div> <span>No sooner were your arms freed than the paw came down again, pressing against your head and surrounding you in the darkness under the luscious, royal paw. A light giggle clued you in... she was playing with you. Stepping on you as soon as she freed your arms made it impossible to move, and thus, impossible to fulfill her demands.<br>\r\n<br>\r\n\"No? Still going to slack off? Heh... very well...\" Her paw came up, forcing all of her weight onto your lower half as you blinked in the sudden sunlight. Somehow though, nothing snapped or broke underfoot... as a royal, she must have had perfect posture and weight control. You caught a glimpse of Goddess Blaze's little smirk, and she wiggled her toes down at you as she lowered the foot with a soft slap onto your top half again, blanketing you in darkness... But with a sudden updraft, you felt the foot on your bottom half lift!<br>\r\n<br>\r\nShe was going to trample you as your punishment... And she was feeling...</span></div></div>",
            "created":1464152400,
            "id":2154085,
            "title":"She \"punishes\" you with her paws"
        },
        "11112212212111211":{
            "choices":[
                "Blaze decided to take a bath (with you)",
                "Blaze drops you in her sock and goes to sleep",
                "Blaze decides to tease and humiliate you some more"
            ],
            "content":"<div class=\"\"><div> <span>At first there was nothing. Then a gigantic fuzzy toe pressed down against your face. Everything about the toe was your world and reality right now. It's sight, smell, taste, and touch were all that you could sense as it pressed against your face. Then it began to lift. Perhaps the punishment was over. But then it pounded back down on you. This gentle (to her) tapping continued to batter and slap your face for about five minutes until she held the toe back down and rubbed it along you. <br>\r\n<br>\r\nBlaze's grin only grew larger as she felt your helpless form trapped under a single toe. She truly felt like a goddess as she continued to punish her slave. At last the toe lifted away. You took some deep breaths as you finally got a taste of fresh air. But as your eyes readjusted to the light, you saw her smirking face behind a raised bare paw, positioning itself over you. Before you could act, she pressed it down, pinning you under the middle of her sole. It wasn't lethal, but it was still heavy. \"SQUIRM, RUNT!\" She said in her usual commanding tone. You didn't hesitate to move your body the best it could under her impossible figure. It was hard to move and sometimes it hurt to shift under her tight press on you, but yous squirmed  and thrashed beneath her foot as ordered like a helpless little mouse. Blaze only smiled more. Your actions pleased her and seemingly guaranteed your future under her paws and under her complete control.</span></div></div>",
            "created":1464325200,
            "id":2154887,
            "title":"Playful (Non-lethal)"
        },
        "111122122121112113":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Orders you between her toes",
                "Orders you under her heel"
            ],
            "content":"<div class=\"\"><div> <span>Licking her muzzle, Blaze closed her eyes and purred as she imagined you, thrashing about beneath her foot like an insect rightfully should... You tickled and massaged nicely as she slowly ground her foot into you. \"So pathetic~\" Blaze purred, twisting her foot atop you and finally stepping off of your body. You panicked as, for a second, you instinctively groped for her foot... it was warmth, it was(Relative) safety... you caught yourself loving her foot. Everything about it appealed to you, knowing it belonged to a Goddess who, if you pleased her, would protect you.<br>\r\n<br>\r\nThe movement was not lost on the cat, who smiled and strode away from you, her thundering footsteps getting softer and softer as she turned and sat in a throne a few feet away... or at least, it was to her. to you it was a colossal seat fit for a goddess, and it was about a football field away. \"Come forward, foot slave... Crawl to my feet.\" She purred, beckoning you forward. Unable to resist, you got on your hands and knees and began to crawl. The mere sight of you made her laugh.<br>\r\n<br>\r\n\"You little, pathetic weakling... So desperate for the love and protection of your goddess that you signed yourself into my feet's servitude.\" Blaze rested her head on a hand, smiling lightly as you crawled. \"Pathetic dirt... no... no you're not even dirt. What is lower than dirt...?\" She thought to herself... then grinned. \"Worms. A worm crawls under dirt, below dirt... You are a worm, understand?\" Her humiliation made you lower your head and nod, a movement that brought much satisfaction.<br>\r\n<br>\r\n\"Very well, foot worm...\" Noticing you've almost made it to her, she smirks and...</span></div></div>",
            "created":1464325200,
            "id":2155046,
            "title":"Blaze decides to tease and humiliate you some more"
        },
        "1111221221211121131":{
            "choices":[
                "Blaze decides to go for a run",
                "She wants to play something else",
                "You suddenly snap out of it and try to resist her"
            ],
            "content":"<div class=\"\"><div> <span>\"Now, squirm into the space between my toes. No using your arms or legs. I want you to move like the little worm that you are.\" She shifted her foot slightly back. You lay on your belly and shift and grind your body across the floor. Blaze only watched in amusement. As you finally reached the toes, she lifted her foot away. \"On second thought. I am a perfect goddess whose very form is sacred. A lowly worm like you isn't worthy of touching my sacred flesh and fur. Or even the dirt and grime under it.\" You shifted your body up, still not using your limbs to do so, seemingly trying to follow the foot. In such a short time, she seems to have completely tamed you with just her sole. As humiliating as that thought might be, you still desperately tried to reach up for the paw that was just out of reach. Blaze struggled to stifle her laughter at your display.<br>\r\n\"Very well. In a show of generosity, I shall allow you contact with the sacred soles and toes of my holy paws. And if you please me,I might even promote you up to the level of dirt. Quite the jump in status for such an insignificant thing like yourself.\" You nodded in response and with that, her foot started to lower. She did so at an extremely slow pace to further taunt you. Finally the toe touched your head. Slowly they slid down around you and gave you a gentle squeeze as they reached the floor. You squirmed between them and planted a small kiss on her biggest toe.</span></div></div>",
            "created":1464411600,
            "id":2155242,
            "title":"Orders you between her toes"
        },
        "11112212212111211312":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Blaze makes you slightly bigger to trample you properly",
                "Blaze crushes you underfoot to demonstrate the reviving"
            ],
            "content":"<div class=\"\"><div> <span>As you wormed between her toes, Blaze chuckled softly. Tormenting you was such fun! And now you were right where she wanted you... Her toes closed together, trapping you between them. As you squirmed the hardest you could, she sighed, squeezing you between her toes almost in pulses.<br>\r\n<br>\r\nSqueeze... squeeze... squeeze... She felt the stress of being a ruler melt away as she crushed you between her toes. With such actions, her mind turned to other things she could do with you... some darker than others. A toothy grin appeared on her muzzle as she freed you from her toes.<br>\r\n<br>\r\n\"Do you remember when you got here, worm?\" Blaze asked. \"I brought you here using the power of my dimension's gems, the Sol Emeralds... You are mine. And as such, I do have control over you, to a degree... I can change your size, revive you from death... I am quite literally your goddess, worm.\" She chuckles darkly as she stands, looming over you.<br>\r\n<br>\r\n\"And I am about to prove it...\"</span></div></div>",
            "created":1464498000,
            "id":2155746,
            "title":"Stress toy? Stress toy."
        },
        "111122122121112113121":{
            "choices":[
                "Reward you",
                "Punish you"
            ],
            "content":"<div class=\"\"><div> <span>Though she could do it without consequence, she chose to hold off on killing you until you did something deserving of punishment. So with a small gesture, you felt yourself expand until you were maybe a little over half the size of her paw. Blaze was still monolithic, but at least you were now bigger. Blaze's toes seemed to be gently holding your neck. \"Lay down.\" She ordered, \"this little promotion in size does not make you above the level of dirt. Lay down nicely so that I can trample you properly.\" You obeyed Blaze's other commands without question up to this point. This was no exception. You laid down flat and awaited the sweet touch of your owner. Soon you felt your whole body being enveloped by her hot, and nice smelling paw. Her foot pressed down much Harder than before. The weight was incredible, yet it wasn't fatal still. Blaze still holding off on you. As the sole pressed down, you instinctively started to kiss and lick it, causing blaze to jump on surprise at first. However once she realized what your were doing, blaze decided to</span></div></div>",
            "created":1464584400,
            "id":2155942,
            "title":"another stomp"
        },
        "1111221221211121131212":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Now the true trampling pain begins",
                "Suffering in her stomach for a while"
            ],
            "content":"<div class=\"\"><div> <span>Blaze, upon feeling your tongue lap along her foot, flushed with anger. \"How... how dare you. I grew you in order to step on you, worm... and you respond by pathetically licking my foot, without being ordered? You are a worm! Worms do not lick the feet of their gods and goddesses!\" She bit her lip, her anger receding. now she simply had to punish you, and for real this time. <br>\r\n<br>\r\nYou must suffer... but how?</span></div></div>",
            "created":1464584400,
            "id":2156301,
            "title":"Worms don't lick the paws of their betters"
        },
        "11112212212111211312121":{
            "choices":[
                "She has forgiven you",
                "Your punishment is far from over"
            ],
            "content":"<div class=\"\"><div> <span>With a frown she lifted her foot away. \"BL- Goddess I was just T-\" You were silenced as Blaze slammed her gigantic paw inches (to you) away from you. The slam was deafening and the impact caused you to chill in fear. \"SILENCE!\" She shouted in her commanding tone. \"First you act out of line and now you speak without permission. You clearly need to be punished before our training can resume properly!\" Her big toe shifted and pressed down hard on your chest,crushing down on your ribs and  forcing the air out of your lungs. You tried your best to breathe but Blaze made sure such efforts would be fruitless. Finally after a minute she lifted her toe allowing you to breath again. Dispite the intense pressure your ribs weren't broken. Perhaps the emerald magic she mentioned earlier. \"Thank you.\" You quietly whimpered. Blaze growled again at the sound of your voice and raised her paw above you. <br>\r\n<br>\r\nGiving you no time to react, she slammed her paw down on the lower half of your body at full force. You screamed in agony, feeling like your lower half was exploding in a mass of blood and entrails. The paw grinded eliciting more screams from you before lifting back up. Much to your shock you were still in one piece. A bit cut up and very bruised and battered and very much in pain, but for the most part you were fine. Before you could marvel or question this again, she stomped on you again. And again. Over and over she stomped down hard on her unruly property's pathetic form before one final stomp, resting the paw on your tortured form. Blaze kept her stern expression, but inside she was enjoying every second and every stomp on the lesser creature. To think she could have so much power over a human. It was euphoric for the cat princess.</span></div></div>",
            "created":1468904400,
            "id":2183095,
            "title":"Now the true trampling pain begins"
        },
        "111122122121112113121211":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "To surrender completely",
                "To refuse the terms"
            ],
            "content":"<div class=\"\"><div> <span>Your breath had left you. Your vision was dark, unable to see past the giant foot paw that now rested atop your beaten, battered body. You dared not speak, you dared not breathe or move, even twitch. <br>\r\n<br>\r\n\"Ahhh... now that feels much better, worm.\" Her foot slowly slid down your body, stroking it and aggravating your wounds. Biting your lip, you manage to hold in most of the scream, though a little bit of a whimper does slip out. Blaze chuckles at that, knowing you were in pain... pain caused by her divine feet. Stomping the foot before your body, she spoke a single order. <br>\r\n<br>\r\n\"Get up, worm.\" <br>\r\n<br>\r\nYou had to try, or risk further punishment... it took a lot of doing, but you seemed to be healing at an accelerated rate... probably, again, the magic that brought you here. One thought led to another, if these... Emeralds, could both bring something to different worlds, AND change it's size... Blaze's smile only grows as you get to your feet, your face turning pale.<br>\r\n<br>\r\n\"You know... you are technically the only human worm in my world. An ambassador, almost, for humanity.\" She tilts her head, lifting a foot off the ground and resting it before you. \"I will cease my punishment and forgive you... if, speaking on behalf of your species, you kneel down before me right now, kiss my holy toes, and surrender, unequivocally, <i>as a species</i> to me and my feet.\" Given how she was smiling, you weren't even sure what to do!<br>\r\n<br>\r\nEventually though, you decided... \"...Goddess Blaze, under your divine feet... I choose...\"</span></div></div>",
            "created":1468904400,
            "id":2183111,
            "title":"To err is human, to forgive divine"
        },
        "111122122121112113121212":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "You are going to be her insole",
                "You're getting stepped on by those boots."
            ],
            "content":"<div class=\"\"><div> <span>Blaze's eyes were wide with lust. She wanted more from you. you were going to suffer for her if it was the very last thing you did. <br>\r\n<br>\r\nFirst, removing her paw from your body, she let the sudden light blind you as she trapped your arm beneath her foot. She began to laugh softly, fangs bared as she grinned. There was no further reason to keep stern. This insect was going to pay. \"I never... ever... thought simple little things like my feet could be so Devastating~!\" She put emphasis on the word as her pressure increased and you could FEEL the pressure and the pain was so intense and you screamed...! But even your screams were drowned out by the massive cat's lustful sighs and moans as she felt the arm flatten beneath her.<br>\r\n<br>\r\n\"...No.\" Blaze lifted off of your arm, giving you time to inspect the damage... same as before, cut, bruised, battered, but whole. Looking up to her, she scoffed and rolled her eyes. \"A worm like you... Does not deserve my bare feet any more.\" With those words, she turned on her heel and stalked off, tail lashing behind her.<br>\r\n<br>\r\nWhat did that mean? Was she going to leave you here? How much was she going to hurt you before she was satisfied? And... why did you enjoy the thought so much?!<br>\r\n<br>\r\nYou heard heavy footsteps, but this time they sounded... different. Clacking. You heard clacking. The color drained from your face as you realized she had come back with her high heeled boots.<br>\r\n<br>\r\nBlaze rounds the corner and starts walking towards you.</span></div></div>",
            "created":1468904400,
            "id":2183112,
            "title":"Your punishment is far from over"
        },
        "1111221221211123":{
            "author_id":"metamin",
            "author_name":"MetaMin",
            "choices":[
                "She offers you a rag or sponge",
                "She makes you lick them clean",
                "She uses you as a rag and scrubs you against them"
            ],
            "content":"<div class=\"\"><div> <span>The paw behind you finally backs away, causing you to fall to the floor below. You weren't hurt, but you were surprised as her feet placed themselves on either side of you, on their sides so the soles faced you. <br>\r\n\"It's time to acquaint you with more of your sacred duties. Count yourself lucky I deem you worthy enough to even scrape the dirt off my divine foot. Now, you're going to wash and clean off my soles to a state more fitting of my holy status.\" The paws move a little closer as she says this giving you a better view of each bit of dirt, grime, and sweat underneath from moving around earlier.<br>\r\n\"I want them clean enough to eat off of when you're done!\" She says in an authoritative tone. She smirks a little as she considers actually having you eat off them later on, but for now, the current task.</span></div></div>",
            "created":1491973200,
            "id":2303941,
            "title":"She orders you to clean her"
        },
        "11112212212111232":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "You were a good slave and licked it clean!",
                "You were a bad slave and need punishment."
            ],
            "content":"<div class=\"\"><div> <span>The clawed toes wiggled slowly as Blaze relished what she was going to say next.<br>\r\n<br>\r\n\"Go on, slave... clean them. In fact... <i>Lick</i> them clean\"<br>\r\n<br>\r\nHadn't... Hadn't you just been doing that? You looked closer at her paws and realized for all your loving worship, there was still so much to be done! The thought made your heart beat faster as you nodded slowly and clung to one of the paws.<br>\r\n<br>\r\nYou began to lick.<br>\r\n<br>\r\nNot any normal licking though... this was love. Your tongue pressed against the dirty sole hard, traveled slowly upward, being thorough enough to catch everything along the way, and anything that came off the paw's sole, you swallowed. The process repeated over and over... press, lick, swallow, moan, press.... You felt yourself growing oh so hard, making it a little hard to move, but you managed. <br>\r\n<br>\r\nYou loved your goddess, and her paws... her feet... her divine instruments of pain and pleasure for littles like you... your heart beat even harder as you realized just how MUCH you loved her.<br>\r\n<br>\r\nWhen you got to her toes, you clung to them, hugging them tight as you licked your thorough licks, practically begging your goddess to notice and be happy with you. You even kissed her royal toeclaws, carefully of course.<br>\r\n<br>\r\nSoon, Blaze pulled away her paw, to inspect your work. Keeping the idea of you eating from her paws in mind, she ran over her paw with a finger and a critical eye...</span></div></div>",
            "created":1492880280,
            "id":2308967,
            "title":"She makes you lick them clean"
        },
        "111122122121112321":{
            "author_id":"metamin",
            "author_name":"MetaMin",
            "choices":[
                "You earned a very special meal (under her paws)",
                "Now I get to clean you ",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Time seemed to freeze as Your new goddess inspected your handiwork.<br>\r\nHer expression remained constant giving you no indication of her thoughts. Suddenly, a tiny smile cracked. <br>\r\n\"Not bad.\" She muttered quietly before standing to her full height. Seeing her standing over you like a colossus was a humbling reminder of your current state. Not that you needed one given her general attitude towards you. <br>\r\n\"Your goddess declares your work satisfactory. For that you shall receive two rewards.\" She boomed. \"First, you now have the honor of being my official permanent sole cleaner. Consider yourself lucky. Many would kill for such a sacred and important duty.\" <br>\r\nYou could have sworn you saw he trying to stifle a giggle as she said that, but you knew better than to press her on that.<br>\r\nAnd second...</span></div></div>",
            "created":1493708700,
            "id":2313869,
            "title":"You were a good slave and licked it clean!"
        },
        "1111221221211123211":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Blaze takes her time smashing your food",
                "Blaze stomps down, splashing it everywhere"
            ],
            "content":"<div class=\"\"><div> <span>Blaze smirked down at you and slowly stepped over you, the sole of her royal foot passing over head and slammed down behind you, making you fall down. \"Second... why don't you stay there, sole cleaner~?\" She teases, leaving the room.<br>\r\n<br>\r\nYou waited, as per her orders, while various noises came from some room in this massive palace... they almost sounded like cooking...? Wait... she was serious?!<br>\r\n<br>\r\nYour stomach growled. BAD. <br>\r\n<br>\r\nAbout an hour passed and the massive lilac colossus returned with a tray of... it seemed all of your favorite foods, in tiny little you sized portions. Setting it down on the floor, she smiled at you, then, her smile turning mischievous, she slowly raised a foot over the food...</span></div></div>",
            "created":1498440120,
            "id":2342587,
            "title":"You earned a very special meal (under her paws)"
        },
        "11112212212111232111":{
            "author_id":"metamin",
            "author_name":"MetaMin",
            "choices":[
                "You heard her. Dig in",
                "Stay put and face her 'wrath'"
            ],
            "content":"<div class=\"\"><div> <span>You watched as the massive lilac colored sole descended on the meal. A small part of you was horrified by her taunting you like this while you were so hungry. And yet, for the most part you were completely enamoured by your goddess' actions. As her foot made contact with the originally pristine meal she prepared, your heart rate started to spike. You quietly prayed to whichever diety would listen that she was going to allow you eat the remains. Blaze continued to taunt her slave some more as the foot pressed down and slowly grinded and twisted from left to right. The foot soon paused and the toes wiggled to tease you some more. You spotted bits of the meal she cooked trapped between each toe just as your stomach growled even louder.<br>\r\n<br>\r\nFinally she stopped and grinned down at you. \"Well dig in. After all, your goddess spent so long preparing this wonderful reward for your service to her. You wouldn't want to offend her and evoke her wrath.\" She grinned and winked as she said that last bit which tempted you to see just what her 'wrath' was. Still you might just be reading too much into that gesture. Besides you actually were hungry. You looked back to her foot just as she lifted it to reveal the crushed and mashed remains of your meal clinging to her feet and toes.<br>\r\n\"Dig in, slave.\" She said in a cheerful tone</span></div></div>",
            "created":1502035920,
            "id":2365704,
            "title":"Blaze takes her time smashing your food"
        },
        "111122122121112321111":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Your life revolves around her feet now",
                "This... might be a bit too far"
            ],
            "content":"<div class=\"\"><div> <span>You stumbled forward, in a daze. \"Y-yes... my Goddess...\" You whimpered as you clung to her soles, lapping and licking away, swallowing the oh so delicious meal~! somehow, being crushed beneath the sole of your goddess made it all taste... oh... SOOOOO much better than you'd ever have thought possible! Maybe it was being combined with the slight salt of her sweat, maybe it was the humiliation of literally eating food from her foot, but who cared?<br>\r\n<br>\r\nA chuckle escaped her upon hearing your response, and she couldn't help but smile as you straight up dove into her feet and started licking absolutely every single square inch of them clean of the meal she'd made then crushed beneath her... \"Well well~! Seems like not only will you be my sole cleaner, but it's starting to look like perhaps your life may revolve around my feet...!\" She said with a giggle. Blaze smirked... then raised her feet up, balancing on her heels, after you'd eaten about half of what was there.<br>\r\n<br>\r\n\"I want you to pledge yourself, little one... to hear you say that you devote yourself, completely and utterly, to me and my royal, divine feet.\" She ordered. </span></div></div>",
            "created":1502092260,
            "id":2366073,
            "title":"You heard her. Dig in"
        },
        "1111221221211123211111":{
            "author_id":"metamin",
            "author_name":"MetaMin",
            "choices":[
                "The foot worship continues",
                "She wants you to serve something else"
            ],
            "content":"<div class=\"\"><div> <span>What little reason might have been telling you to hold back was completely drowned out by the full trance that the cat princess' soles had over your mind and body. To you they were perfection in all aspects, looks, smell, touch, taste. Without even a second of hesitation you brought yourself to your knees before her foot and bowed before her.<br>\r\n\"I vow to dedicate every second of my life to your royal soles. To worship and serve your sacred feet at all times unless you order me to do otherwise. And pray that you consider me worthy to even occupy the floor that they once graced.\"<br>\r\nYou bowed your head as you said this causing Blaze to smirk. \"Good boy!\" She said in her authoritative tone. \"I can tell you intend to put everything your insignificant form can muster into pleasing your twin goddesses. However, you best maintain this vow. After all, there are consequences to breaking a sacred oath.\" Her tone was grim as she said this. You didn't dare to look up. You kept facing the ground in reverence awaiting her order or permission to view her. You seemed to register Blaze as an actual goddess by this point. The sight pleased the lilac colored cat as she placed her big toe gently on your back, rubbing the sweat and grime onto you.</span></div></div>",
            "created":1503335160,
            "id":2372440,
            "title":"Serving the Divine"
        },
        "11112212212111232111111":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Ask about what punishments she has in mind if you fail",
                "Begin your servitude "
            ],
            "content":"<div class=\"\"><div> <span>After thoroughly rubbing her big toe on your back, pressing it into you until she planted you face down on the floor, she grinned and lifted off. Ideas raced in her head as to how she could humiliate you, play with you... even darker thoughts also came to mind, but she wasn't quite ready to entertain them... yet. The Sol emeralds were wondrous things after all. But no, now it was time to lay down the law.<br>\r\n<br>\r\n\"Starting today, you will eat all of your meals directly from my soles. It does not matter how hungry you are, you will wait until I have crushed your food to eat. You will be at my feet's beck and call, all day every day, until it is time to sleep.\"<br>\r\n<br>\r\nShe stomped on the ground three times, smirking. \"That is the call. Learn it and come running when I do it. Now. I will lift my foot, and I expect you to kiss my foot print as I do so, to show you understand.\"<br>\r\n<br>\r\nShe lifts her foot, and you dive for her print. She was in full control of you now. She laughed as you kissed her foot print. <br>\r\n<br>\r\n\"Good little slave...\" She purred. \"Do you have any questions...? Or... shall we begin your servitude proper~?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1548825900,
            "id":2609672,
            "title":"The foot worship continues"
        },
        "111122122121112321111111":{
            "author_id":"metamin",
            "author_name":"MetaMin",
            "choices":[
                "She stomps down on you",
                "She traps you in a sock",
                "She moves you somewhere else",
                "She keeps her soles out of reach, denying you of them"
            ],
            "content":"<div class=\"\"><div> <span>This massive purple cat had you under her complete control. The simple sight of her toes hovering near you was enough to keep you mesmerized. But of course you was smart enough to listen to your new goddess’ words. But as she mentioned your duties and what your life had become, a thought lingered in your mind. Since she asked if you had any questions, you figured you might as well get this out of the way now. <br>\r\n<br>\r\n“Goddess Blaze?” You asked up to the massive lilac colored being. Blaze grinned as you addressed her as such. It brought her immense pleasure jsut how quickly she managed to break you in. “Forgive my curiosity but... what happens if I do fail to serve you properly?” Blaze’s grin grows larger. “Well. Questions like that make me sound like you’re expecting to fail the perfect being’s commands.” You quickly got worried and tried to explain yourself, But blaze’s mind was made up. “For such a mindset it seems you’ll be finding out firsthand what happens when you disobey or disappoint me.”<br>\r\n<br>\r\nYou stared up in a mix of fear and intrigue, curious what she planned.</span></div></div>",
            "created":1549046040,
            "id":2611076,
            "title":"Ask and you shall receive "
        },
        "1111221221211123211111111":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Beg for forgiveness before she has a chance to stomp you again!",
                "Beg her to continue... that pleasure was just too much to pass up"
            ],
            "content":"<div class=\"\"><div> <span>That massive purple foot lifted into the air, hovering over your body. The realization of what was about to happen hit your mind and froze you in place, as the foot itself dropped atop you.<br>\r\n<br>\r\nAgony exploded throughout your body, along with a not wholly unignorable burst of pleasure. Whatever magic surrounded you seemed to at least convert some pain to pleasure, as well as keeping you relatively safe... you hurt, you were ruffled, beaten, bruised, but no bones were broken and you were alive.<br>\r\n<br>\r\nYour Goddess readies for another stomp, and words tear from your throat...</span></div></div>",
            "created":1549086900,
            "id":2611333,
            "title":"She stomps down on you"
        },
        "11112212212111232111111111":{
            "author_id":"metamin",
            "author_name":"MetaMin",
            "choices":[
                "She gives you a chance to redeem yourself",
                "She slams her foot down",
                "She gives you a lighter punishment "
            ],
            "content":"<div class=\"\"><div> <span>As arousing as the cat goddess stomping on your pathetic form was, the unrelenting pain of her sole pressing down on you with immeasurable force all at once was too much for you to bear, even with the Magic’s protection. As youweakly tried to move your body you called up to your new goddess as she readied her foot for another attack.<br>\r\n“Goddess please forgive me for putting curiosity ahead of dedicating my entire mind and being to your perfect and divine will. Please see it in you to spare me and give me the chance to make it up to you!” <br>\r\n<br>\r\nYou did your best to butter her up without coming off as overdramatic.  Laze simply held her sole overhead, amused with your groveling and pondering your request. Should she allow mercy and a chance at redemption, or must you learn your lesson so that she doesn’t appear soft on your sins against your goddess?</span></div></div>",
            "created":1550180820,
            "id":2617719,
            "title":"Beg for forgiveness "
        },
        "111122122121112321111111113":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "\"It feels wonderful, Goddess!\"",
                "\"It... it hurts so much...\""
            ],
            "content":"<div class=\"\"><div> <span>The corners of her muzzle quirked upward and she gave a grin that you honestly couldn't place as forgiving or malevolent... slowly flexing her toes overhead, she contemplated whether or not to crush or to forgive, crush or forgive... <br>\r\n<br>\r\n\"I... will forgive your curiosity, mortal. Indeed perhaps I myself have, jumped the gun, so to say. I should not have stomped you so suddenly.\" <br>\r\n<br>\r\nYou blinked. Hearing your goddess regretting her actions was... well, you wouldn't have expected it, certainly. However her muzzle opened again and her next words made your blood go cold.<br>\r\n<br>\r\n\"I should have pressed you properly instead~\" <br>\r\n<br>\r\nBlaze stepped down back on the floor with her raised foot, then lifted the other one. It settled directly on your lower half and started to press, adding more and more weight. It wasn't as explosive as the previous agonies, but now the pain and pleasure were building slowly, in equal measures. <br>\r\n<br>\r\nEventually the pressure mounted to its peak and her other foot lifted, toes curling and flexing over your head, waving down to you as it dropped, softly pressing you into its sole. The pressure surrounded you as her feet covered you entirely<br>\r\n<br>\r\nYour bottom half was suddenly exposed to the air of the throne room as the foot lifted, then with a soft <i>pap</i> it dropped back onto your body. The darkness and scent of your goddess' foot left as the foot on your upper half also lifted, toes flexing again as the sole dropped with another <i>pap</i>!<br>\r\n<br>\r\nYour Goddess, as her punishment, was trampling you into the floor underfoot! And doing it slowly and carefully enough that the bliss was rising...<br>\r\n<br>\r\nHigh above, she gave another smirk.<br>\r\n<br>\r\n\"Do your Goddess' feet punishing you feel good, little slave~?\"<br>\r\n<br>\r\nOh Goddess. Does she know...? How can you answer?</span></div></div>",
            "created":1550192280,
            "id":2617802,
            "title":"She gives you a lighter punishment "
        },
        "1111222":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "my snack.\"",
                "used for my pleasure.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She Gets tired of waiting for you to choose and chooses for you. \"I've decided that you should be..</span></div></span></div>",
            "created":1306904400,
            "id":1117914,
            "title":"other"
        },
        "11112221":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "lets you out",
                "swallows you whole"
            ],
            "content":"<div class=\"\"><div> <span>My snack.\" You are scared of what she has chosen for you. Before you can say anything she tosses you into her mouth. You land on her tongue and you immeditly get up and try to escape. She closes her mouth and you hit her teeth. She begins to tosses you around her mouth occasionally sucking on you to get some of your flavor. She continuse for what seems like forever. When she stops she...</span></div></div>",
            "created":1306904400,
            "id":1117923,
            "title":"my snack.\""
        },
        "111122212":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "you survive",
                "you are digested"
            ],
            "content":"<div class=\"\"><div> <span>You notice she stopped you are relieved hoping that she will let you out. Instead she tilts her head back to swallow you. You try to hold on to her tongue except it seems impossible while your covered in saliva. You look back to see her through muscles open up to except you. You try your best to escape and plead with the giant purple cat. She either doesn't hear your pleas or ignores them. Your leg enter the throat. When this happens you put your arms on each side of the throat and try to pull yourself out. This fails in the end when your arms slip into the slimy tunnel. Your head is all that remains and the with one gulp like sound you are traveling down the giantess's throat. On the outside blaze picks up a mirror to watch you go down her throat. She watches until the bulge in hr neck that it you disappears into her chest. On the inside you fell your legs are able to move more freely. You then fall into her stomach. You bang on the walls and plead Blaze to let you out. On the outside the purple cat pats her belly in satisfaction. You then sit down in her stomach and get ready to be digested.</span></div></div>",
            "created":1306904400,
            "id":1117931,
            "title":"swallows you whole"
        },
        "1111222121":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "Still in the tight tunnel",
                "Outside on blaze's palm"
            ],
            "content":"<div class=\"\"><div> <span>You feel the tickle of the acids in the stomach. You notice you are not being digested. You are happy to see this. A voice speaks from outside the stomach \"When I shrunk you I made you immune to acid invade I wanted to eat you.\" You are not really happy to hear this but you are happy you won't die. At least not yet. You look for an escape route and then see a hole at the other end of the stomach. You walk over to the hole and push through. You notice that the tunnel is tight. You start to pull out when you feel something pull you all the way in. The tunnel pushes you through itself. The smooth feeling of the tunnel was like a bed. You fell asleep.</span></div></div>",
            "created":1306904400,
            "id":1118102,
            "title":"you survive"
        },
        "11112221211":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                " Feet",
                "Orgasm"
            ],
            "content":"<div class=\"\"><div> <span>You wake up still in the tunnel. Almost after you wake up you are pushed into a slightly wider tunnel. This tunnel still pushes you through. You reach the end when you start to get absorbed be the ground you can't tell what's happening until you fall from Blaze's butt. Blaze kws this and pulls you out of her pants. She puts you on her lap. You look around the you look up At the giant cat. She looks down at you and says \"Well you escaped my digestive tract what's next. Shall we do feet or should you explore my orgasms.\" You choose...</span></div></div>",
            "created":1306904400,
            "id":1118105,
            "title":"Still in the tight tunnel"
        },
        "1111222122":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "content":"<div class=\"\"><div> <span>You sit in her stomach holding back tears. You hear a voice from outside \"You were a good meal and I wish that I could taste you again. Oh well.\" You aren't pleased to hear this. You feel the sting of the stomach acids digesting you. You think to yourself \"At least I'll be part of someone who is beautiful.\" You sit in wait of your death while on the outside Blaze pats her digesting belly. She sits in her chair licking her lips. </span></div></div>",
            "created":1306904400,
            "id":1118098,
            "title":"you are digested"
        },
        "11112222":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "butt",
                "orgasm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'll use you for my own pleasure.\" You hope that this is a good thing. She stands up and lowers you to her... </span></div></span></div>",
            "created":1306904400,
            "id":1117947,
            "title":"used for my pleasure.\""
        },
        "111122221":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "poops you out",
                "ignore you"
            ],
            "content":"<div class=\"\"><div> <span>She pulls down her panties and then She lowers you toward her butt. You look up at the giant butt in fear of what you think she will do. She does what you fear and rams you up he butt. Your legs hang out and your arms are pinned to your side by her cheeks. You hope she will pull you out but instead you feel a sucking feeling. You are being sucked into the giantess's butt. You are fully in in a matter of seconds. On the outside she pulls her pants back up and sits down. You try to escape the way you came in but Blaze won't let you. You think your only choice is to go up. You follow the tunnel until you see a hole. You poke your head in to see where it goes. On the outside Blaze enjoys feeling you move around in her. She then feels you where you are looking to see if the whole is a way out. On the inside you suddenly feel your head get locked in. You are then pulled into that hole you were looking through. You enter a tighter tube where you have to crawl to move. You yell out \"Stop messing around and please let me out. She considers this.</span></div></div>",
            "created":1306904400,
            "id":1117951,
            "title":"butt"
        },
        "111122222":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "wake up as a mobian",
                "wake up normal"
            ],
            "content":"<div class=\"\"><div> <span>The giantess pulls her panties down and lowers you in between her legs. You don't see anything until she moves you closer. Then you see a hole. She pushes you through the hole and into her vagina. She pulls up her panties and pulls you in. You feel her doing this. You plead to her to let you out. She only enjoys the sensation. You are fully pulled in when you see a room with more space. You don't know where you are. You feel blaze  sit down and then hear a voice say \"You are in my uterus.\" You look for an escape route but your entrance has closed up behind you. You feel a weird sensation and then fall asleep.</span></div></div>",
            "created":1306904400,
            "id":1117957,
            "title":"orgasm"
        },
        "1111222222":{
            "author_id":"mehzer",
            "author_name":"Mehz",
            "choices":[
                "I'm not letting you out~",
                "What you'll be doing for me next..."
            ],
            "content":"<div class=\"\"><div> <span>          You slowly started to wake up, realising your still inside her. Luckily nothing happened to you while you were sleeping, well, nothing physical anyway. Despite what you feared she kept her word from earlier, she didn't hurt you, not even a scratch. You felt around and confirmed you were still inside her womb, feeling the familiar soft and squishy walls. As soon as you did this you heard your new master pur, she obviously felt you even in there. <br>\r\n<br>\r\n          You stopped for a bit to see what she would do, after her purring ceased she talked down to you; ' oh, your finally awake, I take it you enjoyed your rest? Well now that your awake I might as well tell you...</span></div></div>",
            "created":1553318340,
            "id":2633572,
            "title":"Still human, still inside"
        },
        "11112222221":{
            "author_id":"mehzer",
            "author_name":"Mehz",
            "choices":[
                "An umbilical cord!",
                "A weird glow surrounding your chest..."
            ],
            "content":"<div class=\"\"><div> <span>          Your mind quickly filled with panic after hearing that. Despite how warm and oddly comfortable her womb was, you still felt a primal fear of being confined inside a small space, and a drive for survival. You frantically felt the walls around you in a futile attempt to find an exit; causing your new master to giggle. Of course the cervix was one, but Blaze had no intention of letting you back out through there. Your distressed psyche fumbled around for a cohesive thought eventually falling on a rather pressing question; \"how am I still breathing?\". <br>\r\n<br>\r\n          You felt yours eyes widen as you asked yourself this. The immediate answer was an umbilical cord, but you prayed it wasn't. The thought of having your stomach and lungs connected to hers both disgusted you and brought even more dread as you realized that if this thought was true, you would either be unborn, or fully dependent on her for the rest of your life. You shuddered a little at the though before looking down and seeing...</span></div></div>",
            "created":1556777400,
            "id":2653656,
            "title":"Comfortable place, uncomfortable realization"
        },
        "112":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sounds good.<br>\r\n<br>\r\nSo, shall we get this started? I shall start you off once again.</span></div></span></div>",
            "created":1262408400,
            "id":814452,
            "title":"Female"
        },
        "12":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oh really? Nice...<br>\r\n<br>\r\nNow, what gender are you?</span></div></span></div>",
            "created":1262408400,
            "id":814449,
            "title":"Mobian"
        },
        "121":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Wolf",
                "Hedgehog"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, now what kind?</span></div></span></div>",
            "created":1262408400,
            "id":814455,
            "title":"Male"
        },
        "1211":{
            "author_id":"franger49968",
            "author_name":"Franger",
            "choices":[
                "Dominate",
                "Gental ",
                "Playful "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you want blaze's attitude toward you to be like</span></div></span></div>",
            "created":1492901640,
            "id":2309095,
            "title":"Wolf"
        },
        "1212":{
            "author_id":"the_1st_wing",
            "author_name":"the lightning walker",
            "choices":[
                "Fox",
                "Remain Hedgehog"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just thought I'd tack this on (trying to give more variety for those who want more options, no offense to the creator or anything):</span></div></span></div>",
            "created":1548910260,
            "id":2610242,
            "title":"Missing choice"
        },
        "122":{
            "author_id":"invincible",
            "author_name":"Twilightcannon",
            "choices":[
                "Fox",
                "Cat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, now what kind?</span></div></span></div>",
            "created":1262408400,
            "id":814454,
            "title":"Female"
        }
    },
    "info":{
        "author_id":"invincible",
        "author_name":"Twilightcannon",
        "brief_description":"Blaze comes home in a particularly dominating mood... and sizewise, you are an ant to her.",
        "created":1262433060,
        "description":"<td align=\"left\" class=\"norm\">Well... this is the first time I've written something like this. I've noticed... actually, no stories I've read that have dominating Sonic characters have had Blaze in them, so I'm drawing one up, with your guys' help. Note: I will provide the first chapter of the Male Human Path... read that, then use that as a template for the rest of the paths.<br>\r\n<br>\r\nGuidelines (These are important!)<br>\r\n<br>\r\n1. It's only the main character, and Blaze the Cat. Don't have anyone else in... it's called 'Blaze's Slave' for a reason.<br>\r\n<br>\r\n2. No transformations, and no scat, please? Other than that, hey, I don't mind what is added. Paws are encouraged, and I'd like this story to go that direction, but I can't control that.<br>\r\n<br>\r\n3. If we go toward paws, then I'd like them to be bare, if at all possible. EDIT: Shoes and stuff are fine now. What was I on when I wrote these?<br>\r\n<br>\r\n4. The main character can be a human or a Mobian. I'll provide that choice first page, yeah? Cool<br>\r\n<br>\r\n5. Obviously no size altering, except for the Main character getting smaller at the beginning, but other than that... no.<br>\r\nEDIT: I'm actually now very fine with perhaps Blaze getting bigger... Gotta assert her reign, after all.<br>\r\n<br>\r\n6.Spell check is mandatory. One or two misspelled words is fine, but no chapters written in barely readable text, please? Oh, and if you do want to write a chapter, make it longer than one paragraph, unless it's a choice chapter. If it's a choice execution chapter, then try to detail it<br>\r\n<br>\r\n7. Swearing is fine, just don't go overboard.<br>\r\n<br>\r\n8. No bullshit endings. Pardon my language, but I have seen too many of them. A bullshit ending is defined as (using this as an example), Blaze suddenly decides to kill the Main character, or something like that, and the story just ends there. Please, none of that. EDIT: I'm allowing killing the main character, just make it good and not a sudden thing. Preferably at the end of a chapter chain, the option will become available. After all, one can only displease their goddess for so long...<br>\r\n<br>\r\n9. I am a fan of interspecies relations, so if the main character is a human, and Blaze wants to do something sexual with him, I am all for it. If the main character is a Mobian, I'm still for it, but I'd prefer the sexual stuff to stay with the human path.<br>\r\n<br>\r\nPardon me if the guidelines seem to be a bit harsh, but I like fair to high quality stuff.<br>\r\n<br>\r\nEnjoy!</td>",
        "id":1632048,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556777400,
        "modified":1556777400,
        "pretty_title":"Blaze's Slave"
    }
}