{
    "chapters":{
        "1":{
            "author_id":"ogostys",
            "author_name":"Huggo Hunter",
            "choices":[
                "Vero encuentra un cuaderno con dibujos en tinta morada (realista)...",
                "Antonio invita a Aldo a comer (realista)...",
                "Otra cosa (realista)...",
                "Otra cosa (no realista)..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\"><font class=\"size4\" style=\"\">El calor del verano se dejaba sentir mientras los alumnos de la preparatoria acudían a sus últimas semanas de clases, en el viejo edificio se concentraba el calor como nunca, y en los jardines la sombra de los árboles contiguos a las rejas era el refugio de todos los que se encontraban ya fuera de clases, solo una escuela más, de una pequeña ciudad como cualquier otra, llena de gente ordinaria en la rutina de siempre. Entre toda la cotidianidad Aldo era solo uno más de esos adolescentes que estaban por terminar su ciclo escolar: distraído y afable, sin encontrar nada que le molestara como si fuera flotando entre la vida y el tiempo, siempre fue difícil llegar a perturbarlo, después de todo sin mayor esfuerzo podía obtener buenos resultados en sus clases, amistoso con todos pero aún así con pocos amigos íntimos Aldo nunca fue esa clase de chico que disfruta el salir por la noche a la ciudad, o profundizar en la vida social de su pueblo... y de las citas ni hablar, parecía no tener en lo absoluto intereses amorosos hacia nadie, lo que es más siempre calificó de ridículas las relaciones amorosas. Inmerso en su propio mundo Aldo pasaba las tardes en casa con sus videojuegos, o en el recién instalado internet descubriendo cosas de lo más curiosas, al menos para el. Algunas compañeras de Aldo habían mostrado cierto interés en él, pero siempre era el mismo el encargado de desencantarlas haciéndolas quedar como “una amiga especial”, amigas con las que habría tenido una o dos citas, un beso quizás, sin llegar nunca a nada más relevante, y es que no erá un muchacho mal parecido a pesar de su sobrepeso; alto, simpático, inteligente y divertido, pero siempre solitario, al menos fuera de la escuela.<br>\r\n<br>\r\nEran ya los últimos días de clases, y Aldo no podía evitar el recargarse sobre el pupitre mientras soñaba despierto dejando atrás la clase de física... de pronto un repentino golpecito evitó que su mente se perdiera en la fantasía, volteó buscando la fuente de tal interrupción; era un papelito doblando y arrugado en el que se podía leer la palabra “ábreme” escrita con tinta morada, sin mayor preocupación lo abrió para leer su contenido, “Aldo estás bien bueno”, lo que hizo que sonriera levemente mientras desde la parte trasera llegaba volando otro papel hasta la paleta de su pupitre. Con curiosidad Aldo busco entre sus compañeras a la responsable, pero ninguna daba ni la más mínima pista de haberse distraído del complicado problema de física en el pizarrón, solo uno de sus compañeros, Antonio, estaba distraído haciendo dibujos en su cuaderno, y cuando con una seña Aldo le enseñó el papelíto él solo sonrío y le dijo que no sabía de quién era, luego bajó la cabeza y siguió dibujando apresuradamente. Paso el resto de la clase sin ningún otro acontecimiento y Aldo se seguía preguntado quién sería la dueña del recado, la letra no parecía ser de ninguna de sus  compañeras, extrañado volvió a su posición para abrir el segundo recado... pero en ese momento sonó el timbre de salida –¡Por fín!– exclamó Aldo mientras leía el otro papel que decía: “pero para las carnitas panzón”. Se sonrojó al leerlo pero disimuló no haberle tomado importancia, una de sus amigas le gritaba desde la puerta ya lista para partir –Aldo vámonos, quiero comprar algo frío antes de subir al autobús– Él insistió en que la alcanzaría afuera, guardo sus cosas y escribió sobre la tinta morada del papel “gracias” con letra grande y lo dejó en la paleta del pupitre. Al tiempo que se levantaba sintió una mano sobre su hombro, era Antonio –¿Qué haces?– le pregunto, y Aldo solo dijo sin mucha emoción –Nada, !Vámonos que nos dejan!– ambos salieron para encontrarse con Verónica en la puerta, que al notar que ambos salían efusivamente los llamó –¡Aldo, Antonio acá estoy!, ¿van a tomar el segundo autobús?, el primero está por salir pero ya esta muy lleno, y con este calor no quiero irme de pie todo el camino– Verónica era muy bajita pero poseía una figura excepcional, aún con ese toque de inocencia de una joven que parece no estar del todo desarrollada, su cara tierna y redondeada con tez blanca y su cabello claro hacían resaltar a sus grandes ojos negros, Aldo había pensado alguna vez en decirle lo linda que pensaba que era, sin embargo, no estaba seguro de lo que sentía por ella, no era lo que todos hablaban del amor, más bien era como una muy buena amiga,  aún que además había algo... algo que no se podía explicar, pero como de cualquier modo a Verónica le gustaba alguien más Aldo nunca se esforzó mucho en eso. Antonio finalmente fue quien le respondió a Verónica –Si, hay que esperar yo tampoco me quiero ir de pie, el segundo autobús siempre está menos congestionado aún que salga 10 minutos más tarde, así aprovecho para ir a la tienda... ¿oye Aldo no tienes hambre?, !te invito unos churros!– dijo a Antonio –Está bien, ¿Vienes Vero?– Ella solo movió la cabeza mostrando su negación –Hace mucho calor, mejor los espero abajo del árbol, vallan ustedes y si pueden traigan una paleta de hielo– Los chicos cruzaron la calle para llegar a la pequeña tienda al otro lado, Aldo seguía pensando en el papel, lo curioso es que no le había molestado en lo más mínimo, al contrario, se sentía halagado, pensando en eso se miro y pensó en que quizás si estaba muy gordo, 1.80m y 95kg, pero no le molestaba en lo más mínimo, podría ser como Antonio y no habría mucha diferencia, pensó. Antonio era mas bajo que Aldo, de cuerpo delgado pero con una pequeña barriga, nada fuera de lo común.<br>\r\n<br>\r\nTras comprar todo se retiraron a la barda, y mientras se comían las frituras bajo el árbol Aldo no podía evitar seguir pensando en eso que sentía respecto a Vero y lo que le había pasado con el resto de sus compañeras, llego a una conclusión por sí mismo que le dejo aún con más dudas, y es que lo que ocurría es que dudaba si es que le gustaban las mujeres en realidad, un par de veces había sentido atracción hacia alguno de sus compañeros, aún que nunca nada serio, pero como no le gustaba detenerse a pensar mucho al respecto supuso que sería cuestión de tiempo para descubrirlo, por más que llegara a sentirse tonto al preguntarse cosas como esas a sus 18 años, después de todo lo que pasara estaría bien para él; pronto tendría que salir a la universidad y ya nada ni nadie sería lo mismo, aún que le gustaba su vida, le gustaba como iban las cosas. Dentro del autobús Aldo se sentó junto a Verónica como siempre; le contó de la nota, omitiendo la segunda en realidad, y le pidió investigar de quien podría tratarse, después de todo sería más fácil para ella reconocer la letra de alguna de sus compañeras –¡Dalo por hecho, soy una súper detective!– fue lo que dijo Verónica guiñándole el ojo, Antonio Regreso entonces diciendo que ya no había mas asientos libres en la parte trasera, los chicos se sentaron todos juntos y continuaron hablando de una cosa y de otra hasta llegar a sus destinos. Antonio siempre era el primero en bajar, casi media hora después bajaba Verónica, y Aldo bajaba justamente 5 minutos después de que ella. Esta ves el viaje le había parecido más largo de lo normal, en el camino había estado pensando en lo diferente que sería la vida terminando la preparatoria, después de todo en un pueblo pequeño como el suyo no había universidades y todos los que querían ser profesionales tenían que viajar a otro lugar, dejar de ver a todos los conocidos, dejar de vivir en casa... si que sería algo nuevo. Aldo se sentía listo para cualquier reto, estaba positivo y ansioso por empezar esa nueva etapa, después de todo siempre había estado solo en casa con sus dos padres trabajando todo el tiempo, sabía lo que era ocuparse de un hogar, o al menos eso creía, al final no podía más que esperar para ver que pasaría después de todo.<br>\r\n<br>\r\nAl llegar a casa de Aldo el silencio era abrumador como siempre no había nadie, él entró directo a su cuarto dispuesto a cambiarse, y estando desnudo frente al espejo se miro curioso, sin decir nada y mirándose atentamente su reflejo deslizó sus manos con suavidad por todo su cuerpo deteniéndose sobre su barriga, con suavidad la presiono y la cargo mientras veía como se movía y como rebotaba un poco luego de soltarla, el contenido de aquella nota daba vueltas en su cabeza y sin darse cuenta comenzó a excitarse al tiempo que continuaba jugando con su barriga, moviéndola, sintiéndola, mirándola... Se detuvo súbitamente, -¡esto no está bien!- se dijo y procedió a vestirse, -¿Cómo puedo estar haciendo esto?, esa nota de seguro es una broma- Luego de preparar algo y comer Aldo regresó a su habitación, jugó videojuegos un rato, y se conecto en la vieja computadora; el sonido del módem telefónico era el preludio de lo que estaba por venir, había recordado de nuevo lo de aquella nota... lo de su panza en el espejo -¿Habrá por ahí alguien que piense así?- Pasó la tarde navegando, y entre las páginas leyó “Gordo Show” una galería dónde hombres obesos posaban desnudos, al principio se resistió, pero finalmente las abrió, en su interior podía sentir con gran intensidad una excitación que no había tenido nunca antes viendo esos hombres enormes con panzas colgantes, lonjas desbordantes y senos inmensos, su mano derecha lentamente encontró a su pene erecto y mojado y comenzó a frotarlo y acariciarlo, su mano izquierda suavemente tomó el pliegue de su barriga y lo sacudió con fuerza haciendo temblar todo su abdomen, ahora no podía detenerse su excitación aumentaba viendo aquellas imágenes, su corazón latía cada vez más fuerte, más intenso, su respiración se entrecortaba y podía sentir ese cosquilleo interno viajar por detrás de su espalda y hasta su miembro erecto... -Aldo, ¿Estás en casa?- Dijo la voz de su madre desde la puerta principal y rápidamente Aldo cerró todas las ventanas, bajo su playera y se abrochó los pantalones... su madre ya tocaba en su puerta, el abrió lentamente, se encontraba aún bañado en sudor y sintiendo su corazón latir rápido y con fuerza -¿Hijo que haces que no me contestas?- dijo su madre mirándolo algo extrañada -Nada, tratando de soportar este calor- Dijo mientras ella se retiraba a su habitación. Luego solo se recostó en la cama cerrando los ojos, recordando las imágenes que acaba de ver, de nuevo su mano encontró el camino hasta su pene erecto...</font></div><br>\r\n<br>\r\nEsta historia continuará...<br>\r\n</span></div></div>",
            "created":1372192440,
            "id":1617578,
            "title":"Otro día de verano (Inicio)"
        },
        "11":{
            "author_id":"hunter2gainer",
            "author_name":"Huggo Hunter",
            "choices":[
                "Aldo recibe una respuesta a su mensaje en gainer web...",
                "Aldo confronta por messenger a quien cree que escribió la nota....",
                " Alguien busca un cuaderno perdido en la escuela...",
                "Otra cosa"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Domingo por la noche, y como de costumbre, Aldo había dejado sus deberes de ultimo minuto, después de todo el domingo era el único día en la semana que sus padres estaban en casa todo el día y prefería estar con ellos a. hacer sus tareas, pero a pesar de que desde que era niño lo esperaba ansiosamente ya no le parecía tan extraordinario. De cualquier forma los fines de semana se habían convertido en una rutina muy típica; ir con mama al mercado por la mañana,  regresar a casa y escombrar el taller de papa, por la tarde todos juntos al cine o a algún restaurante... y a dos semanas de terminar el semestre Aldo no se sentina motivado a siquiera a empezar sus tareas, prácticamente era imposible que le afectar en algo.<br>\r\n<br>\r\nEl día había pasado como cualquier otro, y antes de dormir a Aldo solo le quedaba terminar un informe de la segunda guerra mundial, encendió su vieja computadora y se puso a escribir, pero al cabo de unos minutos recordó su encuentro con \"gordo show\" -Que pasa conmigo?, no es suficiente con que me sienta raro con que me gusten los hombres? encima de todo me prenden los gordos... hasta para ser homosexual soy extraño!, concéntrate... concéntrate!- se repetía a si mismo Aldo mientras terminaba el informe. Paso cerca de una hora y el contenido de aquella pagina seguía dando vueltas en su cabeza, cada enorme panza, cada gordo desnudo.... todo giraba en torno a eso, su mente estaba perdida entre la grasa de aquellos obesos, con gran esfuerzo por concentrarse Aldo finalmente termino su informe en medio de aquella tormenta de pensamientos, y mientras la matriz de puntos imprimía lentamente el se dispuso a conectarse a la linea telefónica y abrir el explorador, -no va a pasar nada si los veo de nuevo antes de dormir, es que son tan... tan atractivos?- y un esbozo de lágrimas se formo en sus ojos mientras veía una fotografía que poco a poco se descargaba -es que... ellos si son atractivos, no como yo- dijo pasando la mano sobre su barriga y acomodándola debajo del pliegue que formaba mientras seguía sentado frente a la pc -quiero ser como ellos- dijo penosamente para si mismo, y casi al instante se dibujo un gesto de miedo e incertidumbre en su rostro, cerro el navegador y se dispuso a apagar el sistema, después de todo ya había terminado de imprimir... pero cambio de opinión justa antes de presionar el botón, y lentamente ,como si se tratara de algo peligroso, abrió de nuevo el navegador y escribió \"i love fat guys\"... la búsqueda tardo unos segundos, no había alguna razón por la que se halla decidido a escribirlo en ingles, desde pequeño siempre lo había hablado perfectamente pues vivió hasta los 4 anos en California, solo le había parecido gracioso el escribirlo en el navegador pero a pesar de que lo hizo de la manera menos seria se topo con resultados que no estaba esperando y hubo uno en especial que simplemente no pudo ignorar: \"a real man has gut! bigger is better, enter the gainer web\" y es que un logotipo con la imagen de una panza gorda en el fondo le era difícil de ignorar, envío un mensaje publico \"creo que me gustaría estar gordo, pero siento que esta mal\" luego apago todo y se retiro a la cama con una sensación entremezclada de miedo y excitación -¿qué estoy haciendo?, ¡estoy loco de verdad!- susurró ya en medio de la ensoñación.<br>\r\n<br>\r\nA la mañana siguiente todo parecía haber salido de su cabeza, Aldo se levanto como todos los días, tomo el desayuno y su padre lo dejo en la parada del autobús donde se encontró con Vero -Aldo, buenos días! te tengo noticias de la notita amigo!- exclamo gustosa, Aldo ya se había olvidado por completo de ella pero al recordar se sitio curioso y quiso saber mas al respecto -mira; a Mari, le encargaron recogerles a todos los trabajos finales de español, así que antes de que los llevemos a la profesora voy a revisar para descubrir quien pudo haber hecho la nota, que tal?- le contó Vero jactanciosamente -si que eres lista Vero! son trabajos hechos a mano a si que de seguro se distingue la letra o hasta la tinta, y absolutamente todos lo tiene que entregar sin excepción no? muy bien!- Aldo se emociono de momento, el autobús llegaba y todos comenzaban a subir, ya que no compartía todas las clases con Vero quedaron de verse durante el receso en la biblioteca para revisar los trabajos que tendrían que entregarse a la siguiente hora, para su suerte todos llevaban la clase, así que la dueña del recado saldría a la luz, o al menos era lo que Aldo suponía, no era la gran cosa, una broma merece otra y Aldo tenia la intención de regresarle la broma a la responsable.<br>\r\n<br>\r\nAldo paso la primeras horas de clase de forma distraída, sus pensamientos lo llevaban de vuelta a lo que había visto la noche anterior en internet, pero finalmente llego el receso y por fin podría descubrir quien fue la graciosa de la nota, lo que le saco de sus agobiantes recuerdos, por supuesto antes compro una torta doble y un jugo grande para almorzar, no se puede pensar con el estomago vacío después de todo. Ya  en la biblioteca estaban Vero y Mari, Mari era especialmente curiosa para estas cosas y estaba emocionada buscando, casi se sentía forense -Aldo, esto es mejor que las series de televisión!- dijo Mari riéndose escandalosamente -Mari silencio que nos van a sacar de aquí!- le susurro Vero muy seria -donde atabas amigo? ya se va a acabar el receso! lo bueno es que Mari resulto ser muy buena para esto- Aldo solo movió la cabeza al decir -bueno, tenia que comer no?, se sospechan algo?- Mari tomo 5 de los trabajos y explico: -ninguna letra es exactamente igual a la de la nota, pero estas se parecen mas, además de que dos usan en algunas partes tinta morada que se parece mucho a la de la nota- Mari abrió los trabajos sobre la mesa mientras ordenaba el resto, a lo que Vero dijo -no creo que halla sido otro chico, así que seguro queda entre tres, cuando sepas quien fue nos avisas eh-  encargó Vero guiñando el ojo al tiempo que se llevaba todos los trabajos con Mari, al parecer ya debían entregarlos, ambas chicas se despidieron y fueron a la sala de maestros dejando a Aldo en la biblioteca... Martha, Fany, Chayo y Toño, ellos eran los dueños de los trabajos, todas las letras se parecían un poco, y tanto Fany como Toño usaron tinta morada en los títulos, seria complicado saber quien había sido pues seguramente habría intentado cambiar un poco la letra para que no pudiera identificarse, como bien le había comentado Mari a Aldo, así que su venganza se veía poco probable, además de que ninguno de los sospechosos solían hacer bromas de ese tipo a nadie, -bien, si luego descubro quien fue le regresare la broma, si no, tendré que vivir con la duda- se dijo pensativo.<br>\r\n<br>\r\nDurante la ultima hora de clase Aldo observo a Chayo, y la descarto por completo su letra se parecía un poco, pero la forma en la que escribía dejaba siempre un surco pesado en el papel y la nota daba la impresión de haber sido escrita muy rápida y ligeramente... respecto a los demás nada. Sonó el timbre y todos salieron muy apresurados, la clase de ética no era la favorita del alumnado precisamente, y mucho menos a esa hora del día, como siempre que tenían clases juntos Aldo espero a Vero al lado de la puerta, esta ves ella fue de la ultimas en salir. -que hacías Vero, se te perdió algo?- le pregunto Aldo al ver que parecía buscar con la mirada entre los compañeros del pasillo, ella le respondió indiferente -no, lo que pasa es que alguien dejo este cuaderno olvidado, estaba en la rejilla de uno de los pupitres de la parte de atrás, y ya no vi de quien podría ser- Aldo lo tomo, pero no lo meconio tampoco así que lo abrió para inspeccionarlo un poco -tampoco tienen nombre ni nada por dentro, además son puros dibujos así va a ser complicado reconocer algo- Vero hojeo un poco el cuaderno y encontró varias hojas con dibujos en tinta morada -este tono de morado es el mismo que el de la nota que te enviaron, tu crees que sea de la misma persona?- le pregunto vero enseñándole la pagina de los dibujos -puede ser, pero se ve son diferente, como que varias personas han dibujado aquí, pero puede ser, me puedo quedar con el?- Vero puso una cara seria y le respondió -si, pero tienes que buscar al dueño-, -no te preocupes ya sabes que si- le respondió Aldo con una gran sonrisa.<br>\r\n<br>\r\nSolo en casa Aldo reviso el cuaderno, parecía que al menos dos personas habían hecho los dibujos, algunos parecían mucho mas femeninos sobre todo los de flores o hadas, pero otros eran muy masculinos para pensar que fueran de una mujer, además se encontró con que algunos estaban firmados con una letra casi idéntica a la de la nota, tanto de flores o bailarinas como de dragones y demonios en armadura... -a lo mejor este si es el bueno, si resulta ser uno de los 3 sospechosos entonces claro que debe de ser quien escribió la nota- se dijo Aldo orgulloso de su descubrimiento, el módem telefónico seguía haciendo ruidos mientras Aldo abría el navegador, otra ves el \"gordo show\" otra ves le invadía ese cosquilleo mientras su erección crecía y se preguntaba \"realmente quiero ser así?\"<br>\r\n<br>\r\nEsta historia continuará...</font></span></div></div>",
            "created":1372283460,
            "id":1618148,
            "title":"En tinta morada (realista)"
        },
        "111":{
            "author_id":"ogostys",
            "author_name":"Huggo Hunter",
            "choices":[
                "Inmediatamente Aldo recibe una respuesta...",
                "Aldo tiene un sueño muy extraño...",
                "A la mañana siguiente..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Aldo despertó repentinamente, se había quedado dormido con el cuaderno sobre la barriga, al ver el reloj se dio cuenta que eran las cinco de la tarde, habían pasado ya dos horas desde su llegada... apresuradamente se cambió y salió del cuarto para encontrarse a su padre en la sala; el padre de Aldo era dueño de un taller mecánico, de hecho el único con buenas refacciones en toda la ciudad, viajaba mucho y cuando estaba en el pueblo pasaba todo el tiempo en el taller solo salia con su familia los domingos, con el paso del tiempo Aldo se acostumbró tanto a su ausencia que el verlo en casa en las tardes o un día que no fuera fin de semana le causaba cierta incomodidad. -Hola hijo, pensé que si no estaba tu madre al menos tu estarías para comer algo, pero estaba dormido y no te quise despertar, de cualquier forma solo vine a recoger unas facturas... nos vemos luego- dijo el padre de Aldo y se marcho sin decir más, inmediatamente Aldo corrió a la cocina y se dio cuenta que su padre había llevado una gran caja de comida china -!Que suerte!, le había dicho a mamá que iba a cocinar hoy y me quedé dormido, ¡que bueno que papá trajo esto!- se dijo a sí mismo mientras se servía una gran porción de la caja, luego se sentó a la mesa y empezó a comer utilizando los palillos muy solemnemente, pero por más que intento no pudo siquiera llevarse el bocado a la boca y terminó tirándoselo encima, el pedazo de carne cayó sobre su barriga dejando una mancha sobre su playera, él lo tomo con la mano y se lo llevo a la boca al tiempo que mantenía su mirada fija en la mancha que había dejado la pequeña porción al caer -Estoy... estoy gordo-, dijo levantando la mirada y tomando con los palillos otra porción que esta ves si llego hasta su boca, el hecho de pensar en que estaba gordo había tomado un nuevo significado últimamente, lejos de cohibirse lo hacia sentir más atractivo, pero al mismo tiempo le hacia sentir una culpa que jamás había sentido antes; todo se estaba convirtiendo en un verdadero torbellino dentro de su cabeza -¡creo que no se ni lo que quiero!, además no estoy tan gordo como los hombres que he podido ver por internet- dijo sintiendo ese extraño cosquilleo recorriendolo -¡No que va! me gustan ellos, pero yo no voy a ponerme así- exclamó tomando su pequeña barriga entre la manos, luego se levantó, hizo un gesto desdeñoso y se retiró de nuevo a su habitación.<br>\r\n<br>\r\n\"Gordo Show\", Aldo solo la había visitado un par de veces, pero ya estaba claro que no podía hacer más que una cosa al visitar esa página; masturbarse. No sabía de donde o como es que alguien publicaba tantas fotos en una página web, no sabía de dónde habían podido salir tantos gordos, lo único que sabía era que verlos le despertaba un calor y una excitación que nunca antes había sentido de forma tan intensa, una emoción que le obligaba jugar con su miembro erecto y que se convertía en culpa y vergüenza tras la eyaculación, culpa y vergüenza que tampoco podía entender, pero lo cierto es que le dejaba sudando frío contemplando la pantalla de su monitor con la respiración entrecortada. Tras su éxtasis continuó con sus demás actividades y revisando su bandeja de entrada se topó con un correo que no esperaba, provenía de \"Gainer Web\", le indicaba que alguien había respondido a su publicación, quizás si no la hubiera escrito en español no le hubiera parecido tan extraño recibir una respuesta en tan poco tiempo, pero a pesar de eso se emocionó en pensar que al menos había podido encontrar a una persona que se había interesado en su publicación. Al abrir el vínculo del correo se encontró con una respuesta también en español; bajo el nick de \"Big Rob\" alguien le decía que entendía sus sentimientos, que había pasado por lo mismo y que le gustaría ayudarle, por último le preguntaba si utilizaba el messenger y le dejaba su correo para que le respondiera, Aldo se quedó crispado, ahora ya se había encontrado con alguien a quién al parecer le había sucedido lo mismo, ¿sería una buena idea contactarlo?, después de todo él sentía que lo que hacía y sentía no era del todo correcto y además no sabía nada a cerca del tal \"Big Rob\", decidió que no era una buena idea contestar con su correo de siempre, por eso abrió una nueva cuenta con la que envió un correo a Big Rob:<br>\r\n<br>\r\n<i>          \"Hola, soy Aldo de GainrWeb<br>\r\n<br>\r\n          Leí la respuesta que me enviaste, ¿de verdad pasaste por algo parecido? yo me siento raro y anormal por todo esto, y la verdad ni siquiera estoy seguro de porque estoy en esta página, estaba leyendo lo que escribieron los demás en otros temas a cerca de lo que significa eso de ser gainer y no me deja nada claro, pero la verdad me da mucha curiosidad ¿tu haz intentado algo?, a mi me gustan los gordos, pero no se si quiero ser uno aún que la verdad es que no soy delgado de todas formas, espero no molestarte con mis preguntas tontas, además me sorprende que alguien me halla respondido en español porque todo lo que he encontrado al respecto siempre está en ingles y todos los sitios son de EUA o eso creo.<br>\r\n<br>\r\n          Bueno espero saber pronto de ti amigo, por cierto muchas gracias.\"</i><br>\r\n<br>\r\nDudoso Aldo envió el correo, sin estar seguro si estaba listo para leer una respuesta -¡No puedo creer que halla por ahí otro loco igual que yo!- dijo subiendo su playera y dando una suave caricia a su barriga.<br>\r\n<br>\r\nEsta historia continuará...</font></span></div></div>",
            "created":1372493460,
            "id":1619689,
            "title":"Un correo de \"Big Rob\" (Realista)"
        },
        "12":{
            "author_id":"lass",
            "author_name":"E",
            "choices":[
                "Antonio secuestra a Aldo y lo engorda (Fantasía)",
                "Antonio sigue invitando a Aldo a comer todos los días (Realista)",
                "Antonio se confiensa (Realista)",
                "Aldo decide engordar por su cuenta (Realista)",
                "Otro (Fantasía/Realista)"
            ],
            "content":"<div class=\"\"><div> <span>Sin embargo otra interrupción se atravesó entre sus fantasías, ésta vez era su celular que sonó con un tono muy pegajoso, Aldo lo sacó de su bolsillo y vio que era Antonio, quien lo invitaba a comer a un restaurante de hamburguesas local, como si su subconsciente lo dominara, Aldo aceptó la invitación, olvidando que su madre probablemente ya estaba sirviéndole comida en sala, sin embargo, Antonio colgó rápidamente por lo que no le dio tiempo de cancelar la salida y no tenía otra más que ir.<br>\r\n<br>\r\nSe relajó un poco y bajó las escaleras, se comió gustoso las enchiladas de que había preparado su madre, incluso pidiendo doble ración olvidando completamente que aún tenía que ir a comer con Antonio, nuevamente mientras terminaba vibró su celular ésta vez con un mensaje por parte de Antonio, quien ya lo esperaba en el restaurante, por lo que agradeció la comida a su madre y salió rápidamente sin notar que su playera se notaba algo apretada por la cantidad de comida que había ingerido.<br>\r\n<br>\r\nDespués de 10 minutos, Aldo por fin llegó con Antonio, quien no pudo evitar notar lo apretada que se veía la ropa de su amigo, lo cual, lo excito un poco y a la vez lo puso algo nervioso.<br>\r\n<br>\r\nAmbos entraron al restaurante e inmediatamente ordenaron, un paquete grande para cada quién, Aldo a pesar de que ya había comido bastante fue el primero que terminó, mientras Antonio se preocupaba más por mantener a su amigo comiendo, llegando al grado de pedir una segunda orden para Aldo, al salir de allí Antonio noto que la playera de Aldo estaba bastante más pegada que cuando llegó e incluso dejaba ver una pequeñísima parte de su panza.<br>\r\n<br>\r\nEsto provocó los deseos de Antonio quien se despidio rapidamente para ir a su casa a masturbarse pensando lo gordo que se estaba poniendo su amigo, y a su vez a pensar en la nota que le envió en clase...<br>\r\n<br>\r\nA su vez Aldo fué a casa y nuevamente se miró en el espejo provocando una erección más....<br>\r\n<br>\r\n</span></div></div>",
            "created":1377682200,
            "id":1652915,
            "title":"Antonio invita a Aldo a comer (realista)..."
        },
        "121":{
            "content":"<div class=\"\"><div> <span>antonino no pudo resistirse de ver comer de esta manera a aldo  y quiere repetir esta experiencia una y otra vez, al principio crello que seria muy obvio  y levantaría sospechas en aldo pero después pensó somos amigos que puede tener de raro y de esta forma decide invitar a aldo a comer hasta el punto de volverse casi una rutina aldo comía en casa hasta que su camisa quedar un poco apretada para después ir a comer con antonino y atascarse hasta el punto que su barriga comenzaba a verse después los dos se despedían, y siempre antonino se encerraba en su cuarto y comenzaba a masturbarse teniendo fantasías con aldo y recordando como su pansa crecía y crecía cada vez mas  un día temeroso antonino le propuso a aldo ir a su casa después de comer aprovechando que su casa estaría sola con el pretexto de ir a jugar videojuegos aldo acepto y comenzaron a comer  como siempre aldo llenaba su boca con grandes bocados de comida uno tras otro hasta no poder mas su pansa comenzaba a asomarse una vez que terminaron fueron a casa de antonio  al llegar con la excitación encima de ver que después de todos esos dias de comer insaciablemente la pansa de aldo era cada vez mas grande ya había aumentado un par de kilos que hacían que su ropa se viera mas apretada y eso le excitaba demasiado le ofreció algo de comer y beber al principio aldo se negó  pero después acepto llenando cada  vez mas su pansa con comida hasta el punto donde su pantalones le apretaban y su camisa dejaba ver mas su crecido abdomen estando en confianza desabrocho su pantalón aldo coloco su mano en la parte mas alta de su abdomen dejándola caer hasta llegar a su pene el cual ya esta erecto antonino al ver esto se éxito tanto que el tambien tubo una erección, los dos muy excitados se dejaron llevar por el momento y uno al otro se masturbaban aldo se dejaba acariciar por antonio el cual no tardo en venirse siguiéndole aldo terminado esto los dos un poco apenados y si saber exactamente como fue que ocurrió se despidieron aldo se fue a su casa con la pansa muy llena y muchas cosas que pensar en su cabeza  mientras que antonio seguía teniendo fantasiosas con aldo como la que hoy se habia vuelto realidad </span></div></div>",
            "created":1385251320,
            "id":1698238,
            "title":"Antonio secuestra a Aldo y lo engorda (Fantasía)"
        },
        "13":{
            "author_id":"hunter2gainer",
            "author_name":"Huggo Hunter",
            "choices":[
                "Continuar la historia..."
            ],
            "content":"<div class=\"\"><div> <span>Resulta que ya se hizo de paga poder hacer historias interactivas, pero no continuarlas así que aquí empiezo la que vamos a hacer entre todos.<br>\r\n<br>\r\nRestaurante a medio día (por Hugo)<br>\r\n<br>\r\nEra medio día de domingo, el calor era insoportable y en la mesa del abandonado restaurante todo se sentía pegajoso, no habría esperado tanto tiempo si no fuera porque ya había quedado de verme con un viejo amigo que tenía mucho que no veía, sin embargo su impuntualidad ya empezaba a desesperarme; había pedido ya tres bebidas y luego de tomarlas con tanta avidez me encontraba ya un poco mareado así que pensé que lo mejor sería esperar un poco más, después de todo no había mucho más que hacer un domingo al medio día… mientras pensaba en eso mi amigo finalmente apareció, de reojo pude verlo en la puerta de entrada preguntando por mí, estaba agitado y lleno de sudor,( y quién no lo estaría luego de andar por las calles con semejante clima), levanté las manos para que pudiera verme y se acercó a mi mesa, se sentó pesadamente sobre la silla, me saludo mientras se abanicaba con el menú que tomó de la mesa y sin que yo siquiera pudiera regresar el saludo me dijó con aires de desición “he tomado una determinación importante, voy a ser libre…”<br>\r\n<br>\r\nAnterior: Nadie<br>\r\nSigue: Iván</span></div></div>",
            "created":1429242120,
            "id":1965390,
            "title":"Aquí empieza el cadaver exquisito"
        },
        "131":{
            "choices":[
                "Mi nombre será, mi vida será..."
            ],
            "content":"<div class=\"\"><div> <span>Lo último que me dijo, luego de una larga charla plena de humedad dominical, fue que mantendría contacto conmigo, pero que fuera borrándolo de mi mente, como si nunca hubiera existido él. De todo lo dicho, su decisión iba más allá de lo pensado: algo así como resetear su vida, quise entender, pero era tan inimaginable que no me creía ni comprendía bien a bien sus motivos. ¿Por qué querría dejar de ser él mismo, cuando todo en su vida pareciera estar resuelto, cuando era un sujeto agradable, buena persona, querido por muchos, con pocos enemigos? Más bien, ¿qué clase de vacío no podía ser llenado (y no hablo de su voracidad) que tenía que re-constuirse a sí mismo? Pareciera ser que iba a atentar contra su propio destino: dejar de ser quien se le dijo que era -comenzando por el nombre-, para hacerse él mismo como le plazca ser. ¡¿Pero qué enfermo puede renunciar a ser quien es para engañarse quiméricamente con llegar-a-ser a voluntad?! Si la Virgen lo oyera, lo condenaría por no seguir el <i>fiat </i>de la Voluntad (¿divina?) del destino. <br>\r\nEs que todo esto me dejó mosqueado, aturdido. Perdí el apetito aquella tarde de reflexiones. ¡Perdí el apetito! Ese desgraciado de Alex piensa salirse con la suya contra el sino que a todos nos marca desde antes de nacer. ¿Seré capaz yo de renunciar a dicha seguridad o de execrar tal irreverencia? No lo sé. Mucho he pensado desde la visita de él, repasando las imágenes, los sonidos de las palabras que de su boca emanaban cuales dardos sedantes a mi oído y a mi cerebro pinchaban, que hasta mareado salí de nuestro encuentro de tanto ambage que se resume en no-ser-él; muy poco he concluido, sin embargo.<br>\r\nTal vez debiera pensar en lo que le gustaría hacer para borrar sus huellas de la tierra y para olvidar su identidad más que en la vergüenza o la envidia que me pudieran provocar. ¿Cómo dijo que quería llamarse a voluntad?</span></div></div>",
            "created":1429247460,
            "id":1965419,
            "title":"¿Qué fue lo que pasó ahí?"
        },
        "1311":{
            "author_id":"pytiflix",
            "author_name":"Pablo_Gainer",
            "choices":[
                "En la casa de Alex"
            ],
            "content":"<div class=\"\"><div> <span>Supongo que solo vino a despedirse, no vino para otra cosa, otro nombre, otra identidad, otra vida.<br>\r\n<br>\r\nNo había entendido nada de lo que había dicho, entre la humedad, el calor, el alcohol y las frases crípticas que parecían salir de un libro de acertijos; mi mente quedó sobrecogida con ideas absurdas:<br>\r\n<br>\r\n\"¿Estará metido con alguna mafia? ¿Tendrá problemas de dinero? ¿Por qué querría esconderse del mundo, y peor aún; alejarse de sus amigos? ¿Vale acaso esta \"libertad\" de la que habla tanto como para cambiar sus amistades y su vida entera?\"- Me pregunté.<br>\r\n<br>\r\nDespués de pensar un rato sin encontrar sentido alguno de lo que había escuchado esa tarde pedí la cuenta y salí a caminar. Encuentro que caminar me ayuda a aclarar mi mente y lo encuentro relajante.<br>\r\n<br>\r\nPaseando por el camellón de una gran avenida, sintiendo el aire fresco de la tarde, me encontré con Pedro, un compañero de la universidad. Intercambiamos algunas palabras hasta que llegó el tema.<br>\r\n<br>\r\n\"Oye, ¿qué has sabido de...\" <br>\r\n\"¿Alex?\"- Me interrumpió -\"Bueno, si es que aún conserva ese nombre. Justo estaba por preguntarte la misma cosa Lo ví antier y me hablo de una gran revolución y un gran parteaguas en su vida, la verdad es que no comprendí muy bien de lo que hablaba, sólo que dejó muy claro que no será el mismo de antes y que tal vez no volveré a verlo\".<br>\r\n<br>\r\nLe expliqué lo que acababa de decirme y nos dispusimos a averiguar qué era lo que pasaba por su cabeza.<br>\r\n<br>\r\nQuedamos de vernos al día siguiente en casa de sus padres para ver cual era el secreto que lo hizo cambiar.<br>\r\n<br>\r\nDespués de una larga noche de sueños placenteros, me arreglé para encontrarme con Pedro. Al llegar a casa de los papás de Alex dimos un profundo respiro y tocamos el timbre.<br>\r\n<br>\r\nSu madre abrió la puerta despues de unos 30 segundos, que parecieron horas por el nerviosismo. Nos invitó a pasar muy amablemente y nos ofreció una bebida. Ella era una persona bajita, con cabello rizado muy esbelta y siempre se arreglaba muy bien. Despues de un rato, nos dijo que Alex actuaba raro la última vez que lo vio, ël se había ido hacía tiempo de la casa de sus padres. Le pregunté si había dejado algo que pudiera tener algo que ver con lo que estaba pasando. y ella contestó: \"Pues si quieres puedes pasar a revisar...\"</span></div></div>",
            "created":1429249200,
            "id":1965431,
            "title":"Mi nombre será, mi vida será..."
        },
        "13111":{
            "author_id":"ogostys",
            "author_name":"Huggo Hunter",
            "choices":[
                "La muerte de Alex"
            ],
            "content":"<div class=\"\"><div> <span>\"¿No crees que ya es demasiado mujer?, ya suficiente tuve con tener a estos dos metidos en casa los últimos 10 años\" dijo el padre de Alex saliendo desde el fondo de la casa \"Solo son amigos suyos, seguro que quieren pasar un rato agradable nada más, si ellos piensan que Alex tiene algo yo les creo, luego de tantos años algo deben saber de él, ¿no?\" respondió su madre algo angustiada por la repentina interrupción. Hacía años que no pasábamos por esa casa o que veíamos a los padres de Alex, ahora que ha pasado el tiempo me pude dar cuenta lo que él se parece a su padre; alto, de piel blanca, cabello oscuro y rizado, obeso, con una de esas barrigas que parecen ser siempre el primer punto de atención al verlo... \"Deberían hablar con Alex muchachos, no con nosotros, esos trotes ya se acabaron\", dijo mientras se despedía de nosotros con una sonrisa forzada y le hacía una señal a sus esposa para que cerrara la puerta, \"que mal que las cosas no sean como antes, ¿verdad?, cuídense mucho niños\" dijo y cerró la puerta. Que su padre nos hubiera pateado de su casa no me sorprendió en lo absoluto, de niños nos la pasábamos ahí y muy frecuentemente hacía lo mismo, era todo un cascarrabias y pareció que el que hallamos crecido no ha hecho ninguna diferencia.<br>\r\n<br>\r\nYa que ir a casa de los padres de Alex no había resultado como planeábamos Pedro y yo pasamos el resto de la tarde intentando localizar a Alex pero nos fue imposible. Pedro pudo comunicarse con amigos cercanos y gente del trabajo de Alex pero nada parecía estar mal, en cuanto a Alex; el teléfono fuera de servicio, la casa sola, desconectado de cualquier medio de comunicación... toparnos con esas dificultades para encontrarlo solo nos hacían pensar más en lo que nos había dicho ¿realmente estaba desconectándose de todos y de todo para tener una nueva vida?, me parecía difícil de creer, sin embargo, a Pedro le llamaba más la atención el hecho de que nos lo hubiera dicho a nosotros \"piénsalo\" dijo en tono meditabundo \"He hablado con todas las amistades que tengo en común con él y nadie dice haber notado nada, es más, muchos dicen haberlo visto justo ayer como todos los días o tener una cita de trabajo u otra cosa con él para la próxima semana, y parece que sus padres no saben nada al respecto por más que su mamá lo haya podido notar algo extraño... a mí me parece que los únicos a los que les ha dicho algo respecto a toda esta loca idea de una nueva vida es a nosotros dos\", miré a Pedro un tanto extrañado, pero al pensar un poco sus palabras me parecieron muy sensatas, además parece ser que nos citó a ambos el mismo día en lugares cercanos; por lo que pudimos deducir llegó tarde a verme porque se había reunido primero con Pedro, no tenía sentido porque los tres somos buenos amigos desde que eramos niños y no habría habido mayor problema si nos hubiera visto a los dos al mismo tiempo... algo no encajaba bien, pero era difícil adivinar qué. \"Tengo trabajo mañana: hay que hacer una campaña publicitaria importante y no puedo faltar, la verdad no sé que decir de esto pero conociendo a Alex solo está con alguna de sus payasadas filosóficas o sus experimentos sociales, esperemos que no pase a mayores. En fin, tengo que irme\" me dijo y sacó su teléfono para llamar un taxi, o eso creí \"¿quieres que te lleve a casa?\" él se negó, en realidad llamaba a su novia para que pasara por él así que no necesitaba el aventón, nos despedimos y salió.<br>\r\n<br>\r\nPasó una semana desde que me había visto con Pedro, yo había sido asignado por la televisora para grabar un evento fuera del país; partí y me olvide del asunto de la nueva vida de Alex por un par de días, al mi regreso la madrugada se sintió fresca al salir del avión lo cual era un cambio agradable en una ciudad tan caliente como lo es la nuestra pero lo que me dejó helado fue lo que pasó cuando quité el modo avión a mi teléfono; se reportaron de inmediato docenas de llamadas perdidas, la mayoría de Pedro, marqué con un mal presentimiento: \"¿Bueno?\" le pregunté con algo de nerviosismo \"¡Pense que no ibas a llamar nunca!, no sé como decirte esto pero hay muy malas noticias... es sobre Alex\" de pronto recordé el misterio \"¿que pasa con él, no me digas que ahora si se fue a hacer su nueva vida?, la verdad yo pensaba que se le habría pasado para cundo yo regresara...\" Pedro me interrumpió muy serio \"No amigo, Alex está muerto\", me quedé atónito ante tales palabras, no pude articular más nada y solo le colgué sin más... sus palabras hacían eco en mi cabeza: \"Alex esta muerto\"</span></div></div>",
            "created":1429253400,
            "id":1965449,
            "title":"En casa de Alex"
        },
        "131111":{
            "choices":[
                "La carta"
            ],
            "content":"<div class=\"\"><div> <span>El verde reinaba sobre la pradera soleada. En lo alto de una colina, calle arriba, estaba el parque en el que unos niños se divertían. Eran tres y de distinto tamaño: uno alto y delgado, otro rechoncho y algo bajo, y un último ni robusto ni flaco. El primero parecía más serio o pensativo, el segundo tenía una mirada de ingenio inocultable y el tercero parecía más afable, naturalmente más divertido. Sin duda parecían buenos amigos. Sin duda se perseguían con esas ramas sucias en sus manitas, tal vez imaginando que son armas de fuego y ellos son policías y ladrones. El ladrón era aquél redondo listo. O eso podría pensarse.<br>\r\n<br>\r\n-Yo tengo robada una piedra- decía el de rostro rosado y cabello castaño, -y tiene escrito un secreto que me da poderes, me hace invisible y no pueden atraparme así.<br>\r\n-Cállate gordo- replicaba el que parecía más apuesto, -eso lo estás inventando.<br>\r\n-Si quieres tener mis poderes, ¡quítamela!-, le respondía su rechoncho amigo.<br>\r\n-No es cierto, no la tienes- dijo, por fin, aquel silencioso y delgado muchacho, luego de considerar profundamente las palabras de su ingenioso compañerito.<br>\r\n-¿Cómo sabes que no la tengo, popotes?-, contestó furibundo el más redondo.<br>\r\n-Lo estás inventando.<br>\r\n-¡Y tú que me haces caso!-, resongó divertidamente y todos rieron.<br>\r\nSiguieron persiguiéndose un buen rato al rededor de los juegos en el primaveral parque.<br>\r\n<br>\r\nPero la primavera pareció durar poco. Miré hacia el cielo y como caballos apocalípticos acechaban amenazadoramente cumulonimbus tan negras como el humo de una locomotora al viento. La pradera se oscurecía en cuestión de segundos mientras los niños se divertían sin sospechar de la tormenta en ciernes.<br>\r\n<br>\r\nAl primer estruendo del rayo, la tierra se sacudió violentamente y yo caí junto al pasamanos y mis compañeros de juego se perdieron de mi vista tras la rueda giratoria. Un grito al otro lado de la rueda cimbró el suelo y al incorporarme sólo pude ver cómo, sin temblor alguno, Alex, mi amigo gordito, caía en un pozo recién abierto en la tierra. Sin darme cuenta estaba abrazando a Pedro, que chillaba de terror: el otro desaparecía en lo oscuro y profundo.<br>\r\n<br>\r\nEl trueno de la tormenta me despertó de este terrible sueño. Eran casi las seis de la mañana cuando en un grito ahogado me incorporé en automático, sintiendo el frío de mi sudor, pensando en primera instancia que debí de haberme mojado con el agua que caía afuera. \"Tonterías\" me respondí para calmarme, he estado guarecido en mi habitación toda la noche; \"fue ese maldito sueño de nuevo\".<br>\r\n<br>\r\nA la mañana siguiente, sabía que se oficiaría misa, por la muerte de mi querido amigo Alex. Habían pasado dos días desde la alarmante llamada que hice a Pedro y hoy serían los servicios fúnebres para despedirnos de aquel a quien la sospecha cubrió sus últimas horas. <br>\r\n<br>\r\nNo pude recuperar el sueño así que dirigí mis fuerzas a secarme el sudor en el baño y tratar de asosegar el miedo y la tristeza que bullían en mi pecho y mi estómago. Sin lograr cambio alguno, desistí de los intentos racionalizantes por recobrar la calma y me quedé meditando en automático en el sueño y mi gordito amigo. Mi cuerpo se volvió como un robot al que sólo le dejan las funciones mecánicas para cumplir su propósito: mantenerme con vida.<br>\r\nNada pareció distraerme de mi ensimismamiento hasta que fijé la mirada en el color blanco que se escurría lentamente como leche por la alargada y estrecha ventana del mi estudio. Me recordaba la soledad que sentía por la pérdida y una casa tan vacía como mi interior en esos momentos. Fue como si de golpe, limpiando al sueño de sus elementos fantasiosos, se liberara un recuerdo. Pedro, Alex y yo jugando en el parque comunitario, persiguiéndonos, y Alex hablando de su piedra mágica. Sí, esa era la clave. Una piedra.<br>\r\n<br>\r\nMe vestí para salir al jardín delantero de la casa y decidí dirigir mis pasos a ese viejo parque... Tal vez ya no exista (la ciudad pudo habérselo tragado y rellenado de concreto), pero qué más da. Ese bribón no se saldrá con la suya. Me pregunto si valdrá la pena el viaje; ¿qué encontraré en ese parque?</span></div></div>",
            "created":1429259460,
            "id":1965477,
            "title":"La muerte de Alex"
        },
        "14":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "ganar aun mas peso (fantasia)",
                "esperar a mañana en la escuela (fantasia)",
                "gordo show (fantasia)",
                "otra cosa (fantasia)",
                "otra cosa (realista)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Es la salida de otro día común en la escuela y soy el ultimo en salir nuevamente del salón, veo que un compañero dejo su cuaderno pero no dice nombre y esta en blanco, solo con un sobre dentro. Lo meto en la maleta y voy a casa.<br>\r\n<br>\r\nEn el camino no dejo de pensar en el sobre y el cuaderno, cuando entro a casa voy a mi cuarto y saco el cuaderno, miro nuevamente; sin rastro del nombre del dueño, luego veo el sobre que no dice nada tampoco, así que decido abrirlo para descubrir de quien es, lo abro y leo una nota que dice: \"Este cuaderno hará tus sueños mas profundos y deseos ocultos realidad, disfrútalo ALDO\".<br>\r\n<br>\r\nQuede anonadado cuando leí que era para mi el cuaderno, y que haría mis deseos mas ocultos realidad, me preguntaba a que se referirá así que agarré un bolígrafo y escribí \"Tengo una nueva Computadora\" y nada ocurre, solo se borra lo que acabe de escribir, y pienso, tal vez debe ser algo mas personal o que haga que mis deseos se cumplan, entonces me acuerdo del \"gordo show\", \"puedo escribir algo de eso aquí\", me acaricio el abdomen y ya se que escribir \"en este mismo momento gano 10 libras\"... y veo que no desaparece lo que escribí, siento un cosquilleo en mi cuerpo y mi ropa mas apretada, me miro al espejo y estoy mas relleno.<br>\r\n<br>\r\n¿Qué más podré hacer con el?....</font></span></div></div>",
            "created":1372391760,
            "id":1618993,
            "title":"Un cuaderno nada comun (fantasia)"
        },
        "141":{
            "choices":[
                "Aldo se enamora de Antonio(realidad)",
                "Aldo solamente se desmaya(realidad)",
                " "
            ],
            "content":"<div class=\"\"><div> <span>No puede ser estoy mas relleno,voy a escribir mas \"en este momento gano 10 libras mas\". De repente siente de  nuevo un cosquilleo y se vuelve a mirar en el espejo esta mas gordo.<br>\r\nNo puede ser este cuaderno es increible me pregunto si puedo escribir esto en este momento no me van a gustar mas los hombres.de repente se borra,y salen las palabras \"buen intento\".<br>\r\nde repente su celular suena,es Antonio.<br>\r\nHola Antonio.<br>\r\nHola te gusto el cuaderno.<br>\r\nComo sabes del cuaderno.<br>\r\nes un regalo de mi parte.<br>\r\nAh ven a mi casa.<br>\r\nOk voy para haya.<br>\r\n<br>\r\nQue  como pudo ser Antonio el que me dio es cuaderno.<br>\r\nbueno esperare a Antonio a que me diga como lo hizo.<br>\r\n<br>\r\n15 Minutos despues.<br>\r\n<br>\r\nHola Aldo como estas.<br>\r\nBien y tu.<br>\r\nbien que quieres hacer.<br>\r\nsigueme.<br>\r\nAldo y Antonio fueron al cuarto de Aldo.<br>\r\nAldo pone el seguro a la puerta.<br>\r\nComo hicistes ese cuaderno.<br>\r\nno lo se solo escribes y pasa eso por esp te lo di.<br>\r\nmira prestamelo.<br>\r\ntoma.<br>\r\nDe repente Antonio escribe: en este momento yo voy a poder escuchar los pensamientos de los demas a voluntad<br>\r\nAldo te gustan los hombres.<br>\r\nCreo que si.<br>\r\nBueno......yo soy un hombre Aldo<br>\r\nPero.........<br>\r\nAh te gustan los gordos..<br>\r\n(Aldo se sonroja)<br>\r\n Antonio agarra el cuaderno y escribe :En este momento yo pesare lo mismo que Aldo.De repente siente un cosquilleo.<br>\r\nListo.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1386521760,
            "id":1704934,
            "title":"ganar aun mas peso (fantasia)"
        }
    },
    "info":{
        "author_id":"ogostys",
        "author_name":"Huggo Hunter",
        "brief_description":"Historia para la comunidad de \"El gainer\"",
        "created":1372192020,
        "description":"<td align=\"left\" class=\"norm\">La historia se centra en Aldo como personaje principal, él es amable y apacible, algo sarcástico y muy despreocupado, algo impetuoso cuando se molesta, pero en general muy tolerante, sabe de muchas cosas relacionadas a mantener una casa funcionando ya que siempre ha estado solo en casa y le toca hacer todo a el solo, se muestra amistoso pero tiende a hacer pocas amistades, muy profundas y fieles.  Es muy sedentario y no le gustan los deportes, le gusta leer, el internet y quiere estudiar algo relacionado con las computadoras, le encanta comer y prácticamente todo le gusta, se muestra en general poco interesado en popularidad o los temas comunes para el resto de la gente de su edad. Al comenzar la historia es un adolescente gay de 18 años, mide 1.80m y pesa 95kg, (no es delgado) y poco a poco descubre el mundo del feederism y se convierte en feeder y gainer, puedes dar a la historia el giro que desees; introducir personajes, situaciones o lugares. Básicamente se comienza con dos lineas, una realista y otra más fantasiosa, ¡por favor no las mezcles!, las reglas serán las siguientes:<br>\r\n<br>\r\nEn la línea de fantasía:<br>\r\n1. Indica claramente que se trata de la línea de fantasia y al final de la historia da al menos dos opciones para continuarla, (o al menos una con título y otra que diga “otra cosa”)<br>\r\n2. Si mezclas personajes o mundos diferentes déjalo bien claro para que todos entiendan, todo se permite.<br>\r\n3. Evita las faltas de ortografía y gramática, cuida tu redacción para que todos comprendan la historia.<br>\r\n<br>\r\nEn la línea realista:<br>\r\n1. Indica claramente que se trata de la línea realista y conserva el flujo natural; nadie engorda 100kg en una semana, no hay un feeder en cada esquina, la gente no solo vive para engordar... bueno creo que queda bien claro el punto.<br>\r\n2. Al final de la historia da al menos dos opciones para continuarla, (o al menos una con título y otra que diga “otra cosa”)<br>\r\n3. Se trata de una historia que gira en torno al feederism y lo que significa ser feeder o gainer, se puede subir de tono y tener muchas referencias sexuales, no importa si llega a ser muy explícita, pero por favor que no se trate solo de eso, una buena historia tiene trama y trasfondo (eso es la diferencia entre algo erótico y algo pornográfico)<br>\r\n4. Si introduces personajes que serán importantes descríbelos bien para que la historia pueda continuarse bien, de igual modo evita las apariciones y situaciones tipo “Deus ex machina”.<br>\r\n5. Escribe capítulos de al menos unos tres o cuatro párrafos y a los que se le pueda dar continuidad, no es divertido toparse con una historia que termina luego de tres capítulos de 1 párrafo de 5 líneas cada uno.<br>\r\n6. Evita las faltas de ortografía y gramática, cuida tu redacción para que todos comprendan la historia.</td>",
        "id":1940169,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1429259460,
        "modified":1429259460,
        "pretty_title":"Historia de gaining"
    }
}