{
    "chapters":{
        "1":{
            "author_id":"amadaeus100",
            "author_name":"scritorio",
            "choices":[
                "It's the guy from Grindr!",
                "It's the guy from Grindr... I think?",
                "It's the guys and their apps -- they saw me staring.",
                "It's a guy who wants to know if the stool next to me is open."
            ],
            "content":"<div class=\"\"><div> <span>I don’t normally visit family restaurants for eye candy -- though tonight could change my mind. But I’ve really been here 20 minutes waiting for an unusual date. At a place he picked, too.<br>\r\n<br>\r\nMore than a few of my ex-boyfriends would describe the wood panelling in this Applebee’s as hideous (and be right about it) but from my vantage point at the central bar, the view is fantastic. At my 3 o’clock is a booth with two extra frat guys stuffed in. They might have fit comfortably, 30 lbs ago, but that only applies to the skinny redhead, wedged between two chubby blondes. <br>\r\n<br>\r\nA table in the back has just two guys -- and 20 plates. The endless app special is truly a magical thing.<br>\r\n<br>\r\nThe bartender brings me my second drink -- a shot of scotch on the rocks -- and I start to wonder why I’m still here. <br>\r\n<br>\r\nI keep my Grindr account active out of… I don’t know, social obligation? Gun to my head, I honestly couldn’t put a reason to it. I’m a Grommr guy when I can, Growlr when I have to. I love guys who love carbs. I love to cook a man steak and watch him savor it. To cook a man a stack of pancakes in the morning and have him eat faster than I can get them off the griddle is my idea of an ultimate breakfast. I can NOT get enough of a good belly.<br>\r\n<br>\r\nBut I got the telltale ding of a Grindr message one day and opened it up. The profile pic was a cute enough guy, WAY too skinny for me, but his opening message was the ultimate bait. Like many a nerd, I had an obscure quote begging to be decoded in my headline, and he responded with a call and response joke -- from another of my favorite shows. So I messaged back, and we got to chatting, and we hit it off. We like all the same shows. He gets my dry sense of humor (even through texting, which is tricky) and he’s nice -- like he actually wants to know how my day went the next time we talked.<br>\r\n<br>\r\nSo I’m trying not to be shallow, because here real boyfriend material just drops into my lap and I’m cautious because he’s 60 lbs and 5 years shy of anything I would have searched for. And that’s why I’m still here, even though he’s now 25 minutes late.<br>\r\n<br>\r\nThat’s when I feel a tap on my shoulder.</span></div></div>",
            "created":1452826020,
            "id":2089369,
            "title":"Waiting at Applebee's"
        },
        "12":{
            "author_id":"amadaeus100",
            "author_name":"scritorio",
            "choices":[
                "play footsie under the table.",
                "take it slow, let him order and relax a bit.",
                "order some endless apps for the table."
            ],
            "content":"<div class=\"\"><div> <span>Has anybody ever walked up to you, and waved, and you know <i>for sure</i> that you know them, but for the first minute you're not 100% sure why? That was this Grindr date. I'm waiting for him, specifically, and it still takes me a minute to recognize him.<br>\r\n<br>\r\nI mean, I think it's good etiquette to have a photo less than a month old on there; at the least it should match your current hair style. This guys profile pic was at least a year old, and it had been a heck of a year.<br>\r\n<br>\r\nThe look on his face as he quietly says \"hi\"is a sheepish grin, the only thing in common with his profile pic. The look on mine, I'm sure, is shock, which I try to hide because it's immediately clear why he hasn't updated his pic in a year. He's put on 60 lbs since it was taken.<br>\r\n<br>\r\nMy fantasies have come to life. Sometimes I'll get onto Grindr and Scruff and imagine what all those headless torsos and skinny boys would like like with some extra meat. In front of me is a Grindr boy that did just that. His face is round, his belly sticks out even though he clearly intentionally wore his loosest clothing; his untucked button down shirt hangs an inch or two in front of his pants, and I just want to reach up underneath to touch the belly supporting it. His pants are too tight in so many of the right places. His chestnut brown hair is a little longer, cuter and mussed up clearly from recent fidgeting.<br>\r\n<br>\r\nToo much time passes without me saying anything. My heart's beating wildly, my blood is all headed south, and the scotch and my impossible fantasies having come true have left me speechless; but that's clearly not what he's reading from my expression. His grin is fading and the fear it was covering up are showing themselves. He doesn't apologize for the lateness; a growing quiver in his lip makes me think he's not sure what would come out if he opened his mouth. I manage a \"Hey\" but it doesn't stop the turning tide. He's clearly been working up the courage to come in and say hi, and it occurs to me that's probably why he was so late. As he takes a step back, almost trembling, I put a hand on his shoulder gently and say \"I think we can still get a table.\"<br>\r\n<br>\r\nHis fear recedes, at least a little, and I wave to the hostess. There was a lull earlier, and she and I had a 5 minute conversation when he was 10 minutes late, and she actually persuaded me to wait for him. She led us to a booth in the corner, normally meant for 4. She sat us down, gave us menus and the usual speeches, and as she walked away, she mouthed \"told ya.\"<br>\r\n<br>\r\nHe still looks flustered, and buries his head in his menu. I decide to...</span></div></div>",
            "created":1488700860,
            "id":2285203,
            "title":"It's the guy from Grindr... I think?"
        },
        "122":{
            "author_id":"amadaeus100",
            "author_name":"scritorio",
            "choices":[
                "something reassuring.",
                "something sexy.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>As he's scanning the menu, still blushing, all I can think to myself is 'he can't possibly know how many of my buttons he's pushing right now.'To the point where, when the waitress comes, I'm the one who's flustered. When she asks if we're ready to order, I stammer a bit and ask about the specials to stall for time. Her answer literally makes me pinch myself under the table to make sure I'm not dreaming.<br>\r\n<br>\r\n\"We're actually all out of the entree special for the day. So instead we're offering the endless apps special all night instead of just for happy hour. Any appetizer you want, just keep ordering until you're full! The only catch is, you have to order it for the table.\"<br>\r\n<br>\r\nI look across. \"What do you think?\"<br>\r\n<br>\r\n\"Um... I was actually looking at a house salad, I'm not that hungry.\"<br>\r\n<br>\r\nHis stomach chooses that moment to growl, loud and long. He looked absolutely mortified.<br>\r\n<br>\r\n\"Why don't we do endless apps for the table, and I'll have another scotch.\"<br>\r\n<br>\r\nI put my hands on his, trying to be a comfort.<br>\r\n<br>\r\n\"What would you like to drink?\"<br>\r\n<br>\r\n\"Can I get a strawberry daiquiri?\"<br>\r\n<br>\r\nThe sheepish grin re-emerges.<br>\r\n<br>\r\n\"I really like them.\"<br>\r\n<br>\r\nThe waitress nods kindly and goes to place our orders. Faced with the prospect of conversation again, he gets nervous and withdraws his hands. Before I let them go, I look him in the eyes and say...</span></div></div>",
            "created":1488719880,
            "id":2285264,
            "title":"take it slow, let him order and relax a bit."
        },
        "1221":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Five apps in",
                "The second daiquiri",
                "My new friend bolts"
            ],
            "content":"<div class=\"\"><div> <span>Bring my friend here a strawberry daiquiri.\" I tell the waitress.<br>\r\nI smile my best smile and pat his pudgy hand.  Soon the drinks arrive and gradually my new friend relaxes.  He helps himself to the first app- I picked nachos.  I can tell he wants to eat but he plays coy so I help myself.</span></div></div>",
            "created":1566414240,
            "id":2705780,
            "title":"something reassuring."
        },
        "12211":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Desert?",
                "Nightcap?"
            ],
            "content":"<div class=\"\"><div> <span>Paul, my new friend had shared his name and the info that he was new in town and didn't know anyone, grinned again.  I liked his goofy grin- much better than the uptight nervous look he had first shown.  <br>\r\n\"This is good.\" he said.  I waited for him to continue,  :\"The appetizers, I mean.  Much better than a full meal.  I'm just starting a new job in a new town because I couldn't take the pressure at the last one.  Never enough time to get the job done right, constant pressure.  Too much overtime and not enough leisure.  I used to run marathons. He patted his ample gut.  Anyway new job and time to get back to mu old habits.  Eating less these days and getting back to running.  So I appreciate small plates.\"<br>\r\nI looked at his cute dimpled face with such an appealing double chin and nodded encouragingly.<br>\r\n\"So you run daily?\" I asked in what I hoped was a disarming way while gesturing to the waitress for another round of appetizers.<br>\r\n\"Working on it.\" he said.  \"You never think when you weigh 140 pounds, run 6 miles a day and eat whatever you like without gaining an ounce that you will gain 40 pounds and get winded climbing stairs.  I thought that it would be a breeze and I'd just start running again but I'll get it back,</span></div></div>",
            "created":1574811060,
            "id":2752183,
            "title":"Five apps in"
        },
        "1223":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "After four dacqueries My companion becomes loquatious",
                "Holding hands under the table",
                "Getting a hotel room"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't be nervous. I don't bite...……  At least not on the first date.\"  <br>\r\nHe laughs- seeming a bit more relaxed.  I make some small talk until the drinks arrive and we toast.  <br>\r\n\"To first dates,\"  I announce and we click glasses. I take one of the first batch of appetizers and ask him what he does for fun.  <br>\r\n\"Stamp collection.\" he says hesitantly.  \"But I like baseball too.\"<br>\r\n\"Never did understand the fascination about stamps.\" I say.  But I do like baseball.  I'm embarrassed to admit that my team is the Marlins.\"<br>\r\n\"No need for embarrassment.\" he replied loosening up a bit.  \"My team is the backs.\"<br>\r\nBaseball kept the conversation going and I signaled the waitress to bring more appetizers.  <br>\r\n\"Looks like you could use another daiquiri?\"  He grinned and said sure.  I sent the waitress on her way and sipped my Scotch<br>\r\n</span></div></div>",
            "created":1575057000,
            "id":2753449,
            "title":"something else."
        },
        "14":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Not any more.",
                "My friend is running late.",
                "Naw! Just hanging out."
            ],
            "content":"<div class=\"\"><div> <span>\"Is this seat open?\"<br>\r\nThis from a handsome man with sparkling blue eyes, shaggy blond hair.  I pause.  My date may have stood me up but should I give him a few more minutes.  I nod.  What have I got to loose?<br>\r\nMy new friend maneuvered what must have been over six feet of bulk into the seat.  He was taking up a lot of space but at close range it was hard to tell if it was muscle or fat.  <br>\r\n\"Bourbon rocks.\" he commanded, \"and a round for my friend.\"<br>\r\n\"Buck.\" he announced sticking out a hefty paw and we shock hands.  \"Peter.\" I replied.  I never liked Pete.<br>\r\nWe clicked glasses.<br>\r\n\"Waiting for someone?\" he asked.  </span></div></div>",
            "created":1566415200,
            "id":2705787,
            "title":"It's a guy who wants to know if the stool n..."
        },
        "142":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "We get some dinner",
                "Going someplace more interesting",
                "Coming to my place"
            ],
            "content":"<div class=\"\"><div> <span>Buck appraised Peter and seemed to like what he saw.  Peter generally expected that he was pleasing when he met people.  Buck was pleasing to Peter as well.  Not too young.  Not too built but still looking more like a jock than an exjock with a bit of a bulge where there might have been a sixpack at one time.  <br>\r\n\"Mind if I keep you company?\" he smiled showing bright, white teeth.<br>\r\nBuck turned out to be quite the story teller, Peter couldn't tell if he really was a semi-pro football player or just spinning a tale.  Anyway an hour later Buck was into how he had moved from sports to accounting and the damage it was causing to his body.  Peter had never been given an opportunity to tell his story.<br>\r\n\"SO,\" Buck continued. \"Your friend seems to have gotten diverted.  How about</span></div></div>",
            "created":1566840720,
            "id":2708118,
            "title":"My friend is running late."
        },
        "1421":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "two steaks",
                "All you can eat pasta"
            ],
            "content":"<div class=\"\"><div> <span>Inertia prevailed and Buck and Peter ordered appetizers and another drink while considering next steps.  Peter ordered some onion rings (double ranch on the side please) and nachos ( guacamole added).  \"We can share.\" he said.  Buck had requested shrimp.  Peter was sure that he could charm Buck into eating his fair share of the order.  His usual method was to dig in himself and then slack off once his friend had overcome his constraint.  Buck was such a charmer, however that when the last onion ring was gone and the nacho plate clean, Buck smiled at Peter and offered him some of his shrimp.  Peter realized that he had eaten most of the appetizers .  <br>\r\nNot easily discouraged, Peter waved the waiter over. \"Another round,\" he said.  \"And  Bring us</span></div></div>",
            "created":1567112340,
            "id":2709893,
            "title":"We get some dinner"
        },
        "14211":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Peter and Buck become frequent dinner companions",
                "Peter asks Buck to a home cooked dinner",
                "Buck asks Peter to a home cooked dinner"
            ],
            "content":"<div class=\"\"><div> <span>As the waiter cleaned the table Peter let out a belch.  He was dying to loosen his belt but his mission was to stuff Buck.  He had ordered a 16 0z steak for Buck and a small 8 oz for himself but over the course of the meal Peter had quickly dispatched the small steak and Buck began sharing his.  Both plates were clean but Peter was aware that he might have lost the control over this meal.  While encouraging Buck, Peter might have actually gone way over his normal encourage participation and out eaten his companion.<br>\r\nBuck managed a soft belch and struggled to loosen his belt.  \"Whoa!.\" he sighed, pushing out his belly and patting it..  \"Over did it.\"<br>\r\nPeter was reassured.  Mission accomplished.  <br>\r\nOver an after dinner drink, the two men continued to chat.  They agreed to meet up again for drinks. </span></div></div>",
            "created":1568134260,
            "id":2716174,
            "title":"two steaks"
        },
        "142113":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Cake and Ice Cream",
                "Cookies",
                "Cheesecake"
            ],
            "content":"<div class=\"\"><div> <span>Drinks and snacks became a frequent pastime for Buck and Peter.  They had a lot in common both in job (bookkeepers) and hobbies (baseball and stamps).  It turned out that they really enjoyed each other's company.  Peter also kept working on encouraging buck to overeat.  It was tricky but so far he convinced that Buck was getting more into eating.  He had to admit that while encouraging buck Peter had found that he was eating more too.  He would love to host Buck in an orgy of gluttony but afraid to expose himself as a feeder.  Then Buck took their relationship to the next level.  He invited Peter over to his house for a Saturday game and cookout.  <br>\r\n\"What can I bring?\" Peter asked.<br>\r\n\"Bring some beer.\"  Buck grinned.  \"I'll take care of the rest.\"<br>\r\nPeter brings the beer but, just for good measure, picks up..</span></div></div>",
            "created":1575054600,
            "id":2753438,
            "title":"Buck asks Peter to a home cooked dinner"
        },
        "1421131":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Lasagna",
                "Mac and cheese"
            ],
            "content":"<div class=\"\"><div> <span>\"Thanks for the cake.\"  Buck told Peter, \"But I have it all covered.\"<br>\r\nAnd, indeed Buck had prepared a nice spread for the two men.  Buck opened up two bottles of the been Peter had brought and got his settled in the living room, put on some music and left Peter alone for a minute.  Soon he was back with chips and dip.  \"Dinner is all fixed.\" he said.  \"I just need to keep an eye on the oven but meanwhile tell me what's going on with you.\"<br>\r\nPeter was charmed by Buck's hospitality and interest in him and over the next hour or so, this chips and dip disappeared, along with a dozen hot wings.  Peter without thinking managed to eat most of them.  Then Buck excused himself and soon called Peter into the dining room for</span></div></div>",
            "created":1575585000,
            "id":2755932,
            "title":"Cake and Ice Cream"
        },
        "14211311":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Peter is encouraged",
                "Buck is encouraged"
            ],
            "content":"<div class=\"\"><div> <span>\"That was fantastic. \"   Peter leaned back in his chair and let his belly settle.  He'd indulged himself a bit because it turned out that Buck had put together a killer lasagna along with buttery garlic bread and salad.  Peters plan was to go for the salad and just have a small slab of lasagna but Buck served him a large slab and Peter didn't want to offend his host.  They chatted and ate.  And when Peter's plate was clean, Buck served him more.<br>\r\n\"I'm not much of a cook,\"  Buck commented, \"But I do make a killer lasagna.  And I don't do it often because I just can't stop eating. I make it for myself, thinking I'll have food for a week and I end up eating it all.\"<br>\r\nPeter smiled.  \"I agree.  But sometimes you just have to go for it.  Live a little. Why don't we just finish this big boy off right now.  I've had more than my share so let me divide the rest between the two of us.\"<br>\r\nAnd before Buck could reply, Peter served him the lion's share of the lasagna, taking a much smaller share for himself.<br>\r\n\"No.\"  Buck protested.  \"I don't want any more.  I'm full.\"<br>\r\n\"I insist,\" Peter asserted.  \"You've earned it and I won't feel so bad about overeating when I finish my share.\"<br>\r\nPeter dug into his serving and Buck reluctantly dug in as well.<br>\r\n\"It is so good,\"  Peter said. Buck smiled at the praise and ate it all. </span></div></div>",
            "created":1580148000,
            "id":2779218,
            "title":"Lasagna"
        },
        "142113111":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Buck's turn to host.",
                "Peter weighs himself."
            ],
            "content":"<div class=\"\"><div> <span>After desert, Buck felt victorious.  Peter, despite having home turf advantage had succumbed to out eating Buck.  Buck had ended eating more than he intended and surreptitiously had to loosen his belt a notch but he was sure that Peter had eaten much more than he.  And in the desert round while Buck remained focused and disciplined, Peter seemed to lose control and eat the majority of the cheesecake.<br>\r\n\"I insist.\" Buck urged as he moved slice after slice to Peter's plate.  Still when Peter got woosy from the eating and there was still a quarter of the cheesecake left.  Buck took a celebratory slice and before the finish, atel the rest of it.<br>\r\nBuck helped Peter over to the easy chair where he snored softly while he cleaned up the dishes.<br>\r\n</span></div></div>",
            "created":1580682840,
            "id":2781710,
            "title":"Peter is encouraged"
        }
    },
    "info":{
        "author_id":"amadaeus100",
        "author_name":"scritorio",
        "brief_description":"You get asked to a date by an unexpected guy, and it's not the only surprise of the night.",
        "created":1452824940,
        "description":"<td align=\"left\" class=\"norm\">This is a story about a gay encourager guy who falls for somebody online that turns out not to be what he expected.<br>\r\n<br>\r\nAdd as you wish, gaining encouraged, mostly I'm just trying to have fun.<br>\r\n<br>\r\nOh, and it'll have taut, sexy bits. Won't be the whole thing, but they'll be there.</td>",
        "id":2071885,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1580682840,
        "modified":1580682840,
        "pretty_title":"Fatfish"
    }
}