{
    "chapters":{
        "1":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "shoots a big gusher all over his chest and stomach",
                "Marty bites Michael's toes more",
                "faints",
                "Marty strokes Michael's penis",
                "Michael falls off the table"
            ],
            "content":"<div class=\"\"><div> <span>After a while of swimming in the pool, Michael jumps into the adjacent jacuzzi still in the buff. Pat and Marty meanwhile, have changed into their swimsuits. Marty had and extra one for Pat to wear. They join Michael in the hot tub and the jets are turned onto full. Marty sits across from Michael and next to Pat. He uses his phone to call his servant who comes out and serves everyone a snack and drinks. <br>\r\nMarty asks Michael \"Where'd you get a body like that and nice looking bare feet?\". <br>\r\nMichael replies \"Partly inheritance from my dad and I work out since I'm on the football team a school. I'm a running back and sometimes a field goal kicker\". Michael lifts his right bare foot and shows Marty his bruised toes and top. Marty takes a hold of Michael's foot and rubs it including his toes. <br>\r\n\"Don't worry Michael, I'm a physical therapist and chiropractor\" Marty says back to Michael. He continues the foot rub which Michael moans.<br>\r\n\"That feels really good. Do you think you can do my other foot as well?\". Michael lifts his other foot over to Marty and gets both feet massaged.<br>\r\nPat meanwhile is busy studying a text message from his work. <br>\r\n\"Michael, I need to attend to some important business for an hour or so...Marty do you mind watching my son for bit longer? You two seemed to hit it off\" Pat says to both of them. <br>\r\n\"No problem Pat, I'll give Michael here a comp back massage when we're done here\". Marty replies to Pat. Michael smiles and closes his eyes.<br>\r\nPat gets out, grabs a towel and changes quickly in the outside shower and cabana room. <br>\r\n\"I'll text you when I'm coming back...thanks Marty\" say Pat and leaves still barefoot. <br>\r\nMarty continues the foot massage on Michael's bare feet for a while before the jets stop. Marty gets out first and grabs a towel for Michael to dry off. Michael gets out and dries off and asks if can take a shower before the back massage. Marty points to where his father changed and then goes into the house to set up the room. <br>\r\nA few moments later, Michael comes in the house from the outside, dressed again including his socks and meets Marty in the back room. Marty seemed disappointed that Michael dressed again, but he'd be naked again soon. He has Michael lay face down on the padded table in the room after helping him off with his shirt. <br>\r\n\"I use some oil and I don't want your shirt to get stained\" Marty exclaims. <br>\r\n\"Did you want me to stay naked for this massage because I don't mind...\" Michael replies.<br>\r\n\"It's okay, never mind now\" Marty says to Michael as he applies oil to Michael's back and rubs it in and adjusts his back and neck.<br>\r\n\"That feels good, my back and neck are so loose now\" Michael says. Marty smiles and walks down to the end of the table where Michael's stocking feet are slightly hanging off and grabs them. He pulls on each leg sharply, then bends each one at the knee and adjusts each ankle by a sharp twist sideways and up and down. He instructs Michael to turn over onto his back, then presses on the tops of Michael's feet.<br>\r\nMarty slips off Michael's two socks and pops and twists each toe, then massages the base of each of the bare toes. Michael wiggles and splays his toes and softly says that it feels good. <br>\r\nAs Marty finishes Michael's bare feet, he lifts up his two big toes and kisses each one and gives them a little nibble. Michael looks up and down at him. <br>\r\n\"Why did you kiss and nibble on my big toes? Michael asks.<br>\r\n\"I'm sorry Michael, your bare feet are absolutely perfect and beautiful and I knew when I first saw you without shoes, I needed to see your bare feet. That's why I said that you could take your socks off too.\" Marty replies.<br>\r\n\"Actually, it felt good...could you do it again only this time suck on my toes. My friend a while back once woke me up that way by tickling and sucking on my toes. It felt sensational and woke me up immediately\" Michael replies back.<br>\r\nMarty smiles and lifts both of Michael's bare feet and engulfs Michael's big toes into his mouth and swirls his tongue around them. Michael goes ballistic and lays back down in ecstasy. Marty notices Michael's shorts have tented out and reaches up to tug down his shorts, then his boxers releasing Michael's erect penis. It's at least 9 to 10 inches and ready to explode which Marty knew happened when some people's toes are tickled or sucked on.<br>\r\nMichael groans loudly \"I'm going to explode...ahhhhh\" Michael exclaims. Michael's toes splay and<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1511572500,
            "id":2419817,
            "title":"Michael gets a foot rub my accident"
        },
        "11":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Tomorrow is another day for Michael"
            ],
            "content":"<div class=\"\"><div> <span>Marty is in awe of what Michael just did. His splayed toes needed some attention, but he needed to clean up Michael before his dad came back. Michael was such in a state of relaxation, that he zoned out and fell asleep. Marty washed his stomach and chest area before continuing his feast on Michael' toes and soles. He began to lightly tickle Michael's body all over which made Michael feel even more relaxed. He laid there completely naked and Marty was about the have his way with him when he heard a knock at the door. He covered Michael with a short blanket that kept his bare feet exposed along with head and went to answer the door. A moment later, Marty enters with a barefoot Pat who shakes his son to wake up. Michael still groggy slowly wakes up.<br>\r\n\"Man that really wiped me out...you sure do a great back massage Marty\" Michael exclaims. He sits up and pushes the blanket back. Upon seeing himself naked, he remembers what Marty did extra for him. He puts his boxers and shorts back on along with his polo shirt. He picks up his black socks and carries them in his hands while still in bare feet. <br>\r\n\"Thanks for the hospitality and the massage Marty\" Michael says to Marty.<br>\r\n\"No problem, come back anytime and soon Michael...you too Pat\" Marty replies winking at Michael.<br>\r\nPat and Michael gather up their footwear with Pat putting on his flops, but Michael staying barefoot and carrying his shoes and socks to the car. Marty blows a kiss toward Michael's bare feet as they leave. He notices Michael placing his bare beauties up on the dashboard as the car drives away.</span></div></div>",
            "created":1511579100,
            "id":2419858,
            "title":"shoots a big gusher all over his chest and stomach"
        },
        "111":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "They enjoy each other's company in bed",
                "Michael stays naked and sunbathes by the pool",
                "Michael stays barefoot and his bare feet and toes are worshipped."
            ],
            "content":"<div class=\"\"><div> <span>Michael reads a text from Marty saying he needs him to come over tomorrow and get another adjustment. Marty didn't quite finish and wanted to complete his back massage. Pat says no problem because he has to work in the area all day tomorrow. <br>\r\n\"Why though were you naked on the massage table? I thought is was just a back massage.\" Pat asks Michael.<br>\r\n\"It was, but he tweaked my legs and my bare feet and toes as well. He used oil and didn't want any of it to get on my clothes\" Michael replies. <br>\r\nThe next morning, Pat drops off Michael at Marty's house and tells him he'd be back in the evening to pick him up. Michael is dressed similar as he was the previous day except he wears a baseball hat on his head. Marty has written a note on the front door saying to go around to the backyard and to make himself comfortable. He had to run an errand and be back soon. Michael walks around to the back yard and sits down in a lounge chair. After a moment or so, he kicks off his shoes and peels off his socks and shirt to get some sun. He wiggles his toes and decides to go for a dip in the cool pool. Michael looks around and strips down naked and jumps in. He swims around for a while, then gets out and sunbathes naked on the lounge chair with his semi-erect penis in full view. <br>\r\nA while later, as a sleeping Michael sunbathes, Marty comes home. He sees a naked Michael thru the kitchen window and can't believe it. He admires and stares at the small Adonis for a moment before going out back to welcome him. <br>\r\nMarty remember what Michael had told him about kissing and sucking on his toes, so he sneaks up on Michael and does just that. Michael splays his toes and his penis starts to enlarge. He begins to wake up and notices Marty sucking his toes and smiles.<br>\r\n\"You sure know how to wake up a guy...that feels so good!\"<br>\r\n\"Michael, I just love your bare feet and well the rest of your body\" Marty replies to Michael. Michael looks at him strangely.<br>\r\nMarty leans up and begins to suck on Michael's penis. Michael can't believe it, but enjoys it. A moment later, Michael explodes into Marty's mouth. <br>\r\n\"What a rush\"<br>\r\nMarty not wanting to waste anytime, strips off his own clothes and then flips Michael over and mounts him. Michael again can't believe what's happening to him. After a while, he's turned back over with his legs resting on Marty's shoulders and screwed up the ass. Marty pumps away and kisses Michael's bare feet and toes in the process. Michael groans and moans as he's seduced and screwed. <br>\r\nA few moments later, they walk naked to the outdoor shower where they begin to wash each other all over. <br>\r\nFor the rest of the day...</span></div></div>",
            "created":1511662140,
            "id":2420367,
            "title":"Tomorrow is another day for Michael"
        },
        "1113":{
            "choices":[
                "Marty, Michael and Asher have a threesome in the pool",
                "Asher faints and wakes up in a lounge chair fully dressed",
                "Michael feasts on Asher's toes and soles after Asher's orgasim "
            ],
            "content":"<div class=\"\"><div> <span>Michael's bare feet and toes are worshiped by Marty's tongue and mouth. Marty even puts different types of food and sauces on Michael's bare feet and licks it off. Michael loves it and wants more. Marty strips Michael's clothes off and puts food and sauces all over his naked body and then nibbles and licks them off. Michael's manhood gets erect again and shoots a geyser all over his stomach; his toes splay in ecstasy. Marty escorts him to the shower and washes him thoroughly. As Michael gets dressed, Marty answers the video door bell at the front gate.<br>\r\nOn the monitor is a young kid about 15 years old. Marty says \"Yes, may I help you?\". The young kid answers \"Yes, my name is Asher Angel. I'm here for the photo shoot you had advertised in the newspaper. Marty replies \"Oh yes Mr. Asher, I've been expecting you\". Marty pushes a button and a buzzer is heard opening the front gate. <br>\r\nAsher, a dark-haired, lightly tan teen, comes walking up the driveway carrying a backpack and wearing a polo shirt with a windbreaker jacket, jeans and white sport shoes.<br>\r\nThe front door opens and Marty greets Asher with a handshake. \"Nice wardrobe Asher. It's perfect for the shoot. Did by bring a swimsuit?\". Asher answers \"Yeah, I think so, it's in my pack. It's kind of small.\" <br>\r\nMarty laughs and walks outside saying \"Let's walk around the side of the house to the backyard. My house is a mess from a party I had last night.\" Asher smiles and walks behind him. They get to the backyard and discover Michael sitting in a lounge chair clothed, but still barefoot. Marty introduces Asher to Michael and they exchange hellos.<br>\r\nMarty says to Asher \"Now the first shot I need is for you to sit on the diving board with your legs hanging down.\" Asher replies \"Okay, can I take my shoes and socks off and let my bare feet wade in the water?\". Marty looks down at Asher's shoes for a moment then says \"Not just yet, but that's a good idea.\" <br>\r\nAsher climbs up on the diving board and hangs his legs over the front. The soles of his shoes touch the water. Marty takes some photo shots as Michael helps him by holding a reflector screen to bounce some light onto Asher. \"Hey Asher, roll up your pant legs and lose your shoes and socks. Are your bare feet photo friendly?\". <br>\r\nAsher smiles saying \"I think they are; I get regular pedicures and don't walk around barefoot except at the beach.\" He swings his body to the right and begins to untie his shoes. Marty and Michael walk over toward the diving board as Asher pulls his shoes off and rolls up his pant legs. Marty smiles saying \"Well, let's see those bare beauties Asher!\" Asher grins and peels off his right sock revealing a golden tan barefoot with slender, pedicured toes. He wiggles his toes that are delighted to be bare and free.<br>\r\nMarty is awestruck saying \"Beautiful Asher! And the other one?\" Asher peels off his other sock revealing another replica barefoot. He splays his toes this time and moves back around to the front of the board and dips his bare feet and toes into the water. Marty quickly snaps up a few dozen pictures of Asher's bare feet in the water.<br>\r\nAfter a few more poses, Asher gets off the diving board and walks over to Marty and Michael. \"Great job Asher, can you put your swimsuit on and we'll do some swim shots right now as the light is perfect.\" Marty says to Asher. Asher looks into his backpack and panics when he can't find his swimsuit. \"I can't find it\" says Asher.<br>\r\nMichael kiddingly says \"Why don't you just in your birthday suit Asher?\". Asher looks at Michael with a stare. \"I'm just kidding man\" says Michael. <br>\r\nMarty ponders then says \"Well, that's not a bad idea. Asher do you mind being naked for some of these shots? I promise not to shoot your penis. You look like you have a nice looking body. How about trying it?\" <br>\r\nAsher looks at the both of them and contemplates for a while. He then says \"Heck, why not...promise not to laugh or judge?\" Marty and Michael nod as Asher strips off his jacket and polo shirt revealing a tan, yet hairless chest. He has six-pack abs that stand out. Asher turns slightly and unsnaps his jeans and pulls them off. He is wearing speedo-type underwear which are small and define his manhood underneath. \"Hear goes nothing\" Asher says as he pulls his underwear down and off and stands there naked for Marty and Michael to admire.<br>\r\nBoth of them do a head to toe look at Asher's naked body and smile. Asher's penis is semi-erect and hangs about six inches in length. Marty steps back and takes some full length shots of Asher's adonis-naked body. Michael begins to touch Asher's bare shoulders and chest with his hands admiring him. After a few more shots, Michael secretly strips naked and joins Asher by the pool. Michael stoops down and begins to massage Asher's bare feet with his hands as Asher, sitting on the pool deck leans back splaying his toes. Michael lays down opposite Asher and begins to feast on Asher's golden soles and toes. Asher is beyond excitement and becomes fully erect.<br>\r\nHe grabs hold of Michael's right foot and sticks his big toe into his mouth and begins to suck on it. Just then he shoots a big load, hitting Michael's face and his own feet. <br>\r\nMeanwhile, Marty is getting some great shots especially the toe sucking and sole licking.</span></div></div>",
            "created":1554738300,
            "id":2642039,
            "title":"Michael stays barefoot and his bare feet and to..."
        },
        "11132":{
            "choices":[
                "Asher is stripped naked once more by Michael who rams him in the ass ",
                "Marty strips Asher's clothes off, turns him over and rams him in the ass"
            ],
            "content":"<div class=\"\"><div> <span>After what seems like a long time, Asher slowly wakes up laying in a lounge chair. He's dressed in his casual clothes including his shoes and socks. He looks around and sees Marty and Michael looking at some photos. <br>\r\nMarty notices Asher awake and says \"Asher, glad you're back with us. You dozed off after swimming in the pool. Are you ready for some more modeling?\"<br>\r\n\"What happened to me?, why am I...how did I get dressed?...(looks down at his shoed feet)...I thought I was barefoot\" asks a bewildered Asher. Marty and Michael laugh.<br>\r\nMichael says \"You blacked out after we were uh wrestling in the pool. You don't remember anything?\" Asher responds \"The last thing I really remember is taking off my shoes and socks and stretching out my bare feet. I do remember Marty asking me to change into my swimsuit and I couldn't find it...so I stripped naked?\"<br>\r\nMarty chuckles saying \"You stumbled as you took your speedos and fell naked into the pool and hit your head on the bottom. Michael dove in and rescued you and brought you to the surface. You were out cold, so we carried you to this lounge chair, dried you off and dressed you\". <br>\r\nAsher sits up saying \"I had the weirdest and strangest dream though. Michael, you were uh, uh kissing and sucking on my toes which caused me to explode. Marty, you were caressing my body from head to toe and I uh, uh even dreamed that I stuck Michael's big toe into my own mouth\". He looks down at Michael's bare feet as Michael splays his toes. Asher continues \"tell me that didn't happen...I used to suck on my own toes when I was young, but never another guy's toes\".  Asher quickly takes his right shoe and sock off and looks closely at his bare toes and sole. He notices that his toes are wrinkled and red. He leans back and covers his face with his hands and begins to cry.<br>\r\nMarty comforts him saying \"It was just a dream Asher. Michael would never tantalize your feet like you say he did\". Michael comes over and kneels down next to Asher and begins to massage his right leg and bare foot. Asher stops crying momentarily and moans. Marty carefully unties Asher's left shoe and pulls it and his sock off at the same time. Asher's bare toes splay as Marty begins to massage them. \"Your bare feet Asher, are memorizing\" says Michael and Asher. Asher moans some more as Marty and Michael lift up each of Asher's bare feet and stick his big toes into their mouths. Asher flinches and moans loudly splaying his other toes. </span></div></div>",
            "created":1554819600,
            "id":2642527,
            "title":"Asher faints and wakes up in a lounge chair ful..."
        }
    },
    "info":{
        "author_id":"socal2017",
        "author_name":"beachboy",
        "brief_description":"25 years have passed since the cul-de-sac was last visited; Michael Fairgate returns",
        "created":1511547660,
        "description":"<td align=\"left\" class=\"norm\">Pat Petersen who played the youngest Fairgate child, Michael returns to Knot's Landing's famous cul-de-sac after a long absence. He brings along his 15-year old son who is a splitting image of Pat when he was 15 years old. It is not by coincidence that his name is Michael. Both dad and son are dressed in a polo shirt, khaki shorts and Pat wears flops on his bare feet while Michael wears black sport shoes with black socks. They drive into the cul-de-sac and park right in front of his TV house of nearly 15 seasons. They get out and Pat begins to explain to Michael the layout of the show. Just then, Marty, the owner of the house comes out and introduces himself and tells Pat he was a big fan of the show. Marty say that Pat still looks good and looks down at his bare feet and admires them. Pat blushes and introduces his son Michael to Marty. <br>\r\nMarty invites them inside his house which looks quite different then the sound stage mock up of the inside years earlier. Marty asks both of them to remove their footwear since he just had the carpets clean. Pat kicks off his flops and walks barefoot inside. Michael unties his shoes and pulls them off his socked feet and sets them next to his dad's flops.<br>\r\nMarty says to Michael \"You can take off your socks too if you wish. I always go barefoot inside and hardly wear shoes\" while smiling. <br>\r\nMichael replies \"My dad says my feet stink, so I'll keep them on for now\" smiling at Marty and walks inside. <br>\r\nA while later after taking a tour of the house, they all emerge in the backyard. There is beautiful pool and hot tub shaded by a gazebo. Michael smiles and asks if he could take a dip. Marty says okay, but warns him that the chlorine might stain his shorts. Michael quickly peels off his black socks, polo shirt and shorts and dives in the pool wearing his speedos. In the process, his boxers slide off leaving Michael naked. Pat and Marty laugh as Michael swims back and retrieves them. Marty tells them that he skinny dips all the time; we're all guys here, so don't worry about it. Michael throws his boxers on a nearby chair and swims in his birthday suit to the deep end. He gets out and climbs onto the diving board. He does a pose and for a moment Pat and Marty are awe struck how gorgeous he looks and how well hung Michael is. His golden tan bare feet with pedicured slender toes glisten in the sunlight. He dives in again as Pat and Marty look on.</td>",
        "id":2141597,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1554819600,
        "modified":1554819600,
        "pretty_title":"Knot's Landing revisted"
    }
}