{
    "chapters":{
        "1":{
            "author_id":"yewyw",
            "author_name":"LiAm",
            "choices":[
                "shrink",
                "giantess grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what happens?</span></div></span></div>",
            "created":1256965200,
            "id":784434,
            "title":"what?"
        },
        "11":{
            "author_id":"yewyw",
            "author_name":"LiAm",
            "choices":[
                "Justin ",
                "Max",
                "Dad"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who shrinks?</span></div></span></div>",
            "created":1256965200,
            "id":784435,
            "title":"shrink"
        },
        "111":{
            "author_id":"yewyw",
            "author_name":"LiAm",
            "choices":[
                "Alex",
                "Mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One day you wake up and see that you've shrunk to the size of an ant! \"JUSTIN IT'S TIME TO EAT\" he hears his mom yell at him.<br>\r\nSomeone opens his room door. Who is it?</span></div></span></div>",
            "created":1256965200,
            "id":784437,
            "title":"Ant boy"
        },
        "1111":{
            "author_id":"yewyw",
            "author_name":"LiAm",
            "choices":[
                "See Justin",
                "See a \"bug\""
            ],
            "content":"<div class=\"\"><div> <span>Justin looks up to see his sister the size of a giant. \"JUSTIN, COME ON IT'S NOT TIME FOR HIDE AND SEEK\" She starts walking in his direction. BOOM BOOM BOOM! Every footstep she makes is like an earthquake to him. \"Alex! down here! by your feet!\"<br>\r\nshe looks down and what does she do?</span></div></div>",
            "created":1256965200,
            "id":784438,
            "title":"Alex"
        },
        "11111":{
            "choices":[
                "Keep Justin a secret.",
                "Tell Harper!"
            ],
            "content":"<div class=\"\"><div> <span>By some miracle, Alex looked down and saw a 1 inch tall Justin on the floor. She quickly bent down and snatched him up by instinct. Even when he was in the palm of her hand she couldn't believe it was him.<br>\r\n\"Justin! What happened?\"<br>\r\nHe gave her a summary of what happened, and asked for her to help him.<br>\r\n\"Sure thing,\" and she set about trying to figure out to reverse it. Not that long after, she discovered the potential of Justin being tiny. He could be a pet, or maybe a slave, to her! That was too good to resist. She tucked him into her coat pocket and went to her room despite his protests. <br>\r\n<br>\r\nShe could do 2 things:</span></div></div>",
            "created":1266901200,
            "id":841499,
            "title":"See Justin"
        },
        "111112":{
            "choices":[
                "Alex puts Justin in a drink and gives it to Harper.",
                "She just shows her in her hand."
            ],
            "content":"<div class=\"\"><div> <span>Alex immediately picked up the telephone in her room to call her best friend Harper. \"Hey Harper, come over to my house right now,\" she said in a hurried tone.<br>\r\n\"I'm pretty busy, Alex,\" she answered on the other line. \"Is it very important?\"<br>\r\n\"Yes,\" Alex answered back. \"You <i>have</i> to see this.\"<br>\r\n\"Well, what is it?\" <br>\r\n\"I can't tell you, it would ruin the surprise.\"<br>\r\n\"Then I'm not coming.\"<br>\r\n\"Please, Harp?\"<br>\r\n\"Oh, all right. Here, let me put on my boots. I'll be over soon.\" The phone went off and Alex anticipated Harper's arrival.<br>\r\n<br>\r\nHow would she surprise her?</span></div></div>",
            "created":1266987600,
            "id":841960,
            "title":"Tell Harper!"
        },
        "1111121":{
            "choices":[
                "Harper starts drinking",
                "Alex is thirsty"
            ],
            "content":"<div class=\"\"><div> <span> Alex takes justin into the kitchen. She takes out a glass and fills it with water. She grabs Justin and drops him in the glass of water.<br>\r\n<br>\r\n\"Alex what are you doing.\" asked Justin.<br>\r\n\"Giving Harper a suprise.\" said Alex.<br>\r\n Harper walks in and asks what is the big suprise.<br>\r\n<br>\r\nAlex gives Harper the glass. Harper starts lifting it to her mouth when.....</span></div></div>",
            "created":1272235200,
            "id":873316,
            "title":"The Justin Drink"
        },
        "11111211":{
            "author_id":"jordanalexwill",
            "author_name":"Jordan15000000",
            "choices":[
                "gets digested and becomes fat on her body",
                "go's right through and makes his way out of Harper's body through her..."
            ],
            "content":"<div class=\"\"><div> <span>Harper lifts the glass of water to her mouth and chugs all the water in the glass in one go, thanks Alex that glass of water really quenched my thirst, no problem Harper little did Harper know though was that her former crush Justin was shrunk and in her glass of water and was now on a one way trip to her stomach. Once Justin was finally in Harper's stomach he...</span></div></div>",
            "created":1409801640,
            "id":1852134,
            "title":"Harper starts drinking"
        },
        "11111212":{
            "author_id":"trogdorshot",
            "author_name":"lewis123",
            "choices":[
                "Digests him",
                "Lets him out after tormenting him..."
            ],
            "content":"<div class=\"\"><div> <span>\"Wait Harper can I have a drink of that?\" She smirks and takes the drink from Harper before licking her lips and begins to drink loudly and quickly. <br>\r\n<br>\r\n\"No Alex you can't!\" Justin screams as he is taken into Alex's mouth and down her long throat towards her hungry stomach.<br>\r\n<br>\r\n\"Mmmmm that was so good!\" Alex burps and pats her belly knowing she has her brother inside.</span></div></div>",
            "created":1404553920,
            "id":1822971,
            "title":"Alex is thirsty"
        },
        "11112":{
            "author_id":"yewyw",
            "author_name":"LiAm",
            "choices":[
                "Mom enters the room ",
                "she kills the bug"
            ],
            "content":"<div class=\"\"><div> <span>\"EWW A BUG!\" with that she raises her bare foot, and slams it down. luckily it missed but justin wasn't about to take another chance. He ran away. \"DIE YOU STUPID BUG!\" she kept stomping untill justin was against the wall.<br>\r\nwhat happens next?</span></div></div>",
            "created":1256965200,
            "id":784442,
            "title":"Sees a \"bug\""
        },
        "111121":{
            "author_id":"yewyw",
            "author_name":"LiAm",
            "content":"<div class=\"\"><div> <span>\"ALEX STOP STOMPING\" His mother said with a booming voice. \"BUT MOM THERE'S A BUG HERE\" \"I DON'T CARE GO DOWN STAIRS AND FINSH EATING\" \"FINE!\"Alex left the room. His mother did care there was a bug and couldn't stand seeing it alive. \"YUCK! THERE IS A BUG\" now justins mom raises her foot and slams down on justin! </span></div></div>",
            "created":1256965200,
            "id":784444,
            "title":"Mom enters the room "
        },
        "111122":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Torture This Pitiful Insect With Her Smelly Feet",
                "End Its Life Under Her Stinky Foot"
            ],
            "content":"<div class=\"\"><div> <span>Justin was pressed up against the wall, looking up in fear at his huge sister who is holwing her bare foot over him.Justin can actually smell her foot from where he is, which is 4 feet beneath her sole (his scale). It smells really bad, and gets worse when she wiggles her toes above him, causing him to gag a little. \"Alright you little pest, ready to die beneath a girl's stinky foot?\" She taunts the bug which she plans to kill. \"But wait...maybe it would be more fun to torture and dominate you with my smelly feet. Hmmm...\" She says thinking aloud. </span></div></div>",
            "created":1287347520,
            "id":976683,
            "title":"Alex Kills The Bug"
        },
        "1111221":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Yes, Alex's feet smell that strong",
                "No, he just barely holds on"
            ],
            "content":"<div class=\"\"><div> <span>Alex plants her stinky foot onto Justin, with his head sticking out from between her two largest toes. \"I can probably get a lot of fun out of torturing you.\" Alex says down to the \"bug.\" She then grabs his head between her toes and scrunches them, feeling his head. \"Oh yeah, this'll be fun.\" She says, enjoying Justin's head between her toes. Justin however, hated this. Alex had grabbed his head with her smelly and sweaty toes, then scrunched his face into her toe flesh. Alex looks for a pair of socks. She can't find any, so she decides to use a pair she wore all last week. \"Wow, life will suck for this bug.\" She says, giggling. She puts on her super smelly white sock and scrunches her toes again. Justin's face turns white when he sees Alex grab the pair of socks she wore all last week. She then puts them on, Justin still under her foot, his head still between her toes. The smell intensifies, and Justin starts to feel a little woozy. It gets worse when she once again scrunches her toes shoving his face in her toe flesh...again. She then grabs her favorite (which also means most used) pair of boots. She slides her socked feet in, completely trapping Justin. Justin can't see outside Alex's socks, so only begins to freak when it gets dark, and somehow, it gets smellier. The smell is so bad, that Justin begins to faint, right after Alex scrunches her toes again.<br>\r\n<br>\r\nDoes he actually faint?</span></div></div>",
            "created":1287350700,
            "id":976717,
            "title":"Torture This Pitiful Insect With Her Smelly Feet"
        },
        "1111222":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "content":"<div class=\"\"><div> <span>\"Nah, you're not worth my feet. You're lower than the toe jam between my toes...so in that case...bye!\" Alex says to Justin, still under the impression that he is a bug. She lowers her foot on top of him, slowly. He's trapped under the ball of her foot, with his head poking out from between her largest toes. The smell is ten times worse when his face is between her toes. \"Take a whiff little bug. That is the last thing you will smell. Bet you never thought there was something that smelled so bad, especially that it would wind up dominating you and ending your life. But that's the way life works. I kill bugs with my feminine feet, even though they don't smell very feminine, and you die under a teenage girl's incredibly smelly foot. Oh well.\" Alex says to the bug beneath her foot. She then proceeds to press down harder and harder. Justin is in hell. He never, not once in his life, looked at his sister and imagined that she would unintentionally degrade and destroy him under her stinky foot. Then the pressure increased, and he took one last breath of air, filled with her foot stench. Justin then squished under Alex's smelly foot.</span></div></div>",
            "created":1287348660,
            "id":976697,
            "title":"End Its Life Under Her Stinky Foot"
        },
        "1112":{
            "author_id":"andy1229",
            "author_name":"andy",
            "choices":[
                "see him",
                "thinks his a bug",
                "didn't see him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>his mom enters. he starts screaming and jumping. the his mom.........</span></div></span></div>",
            "created":1329011280,
            "id":1275452,
            "title":"Mom"
        },
        "112":{
            "choices":[
                "Alex was testing a spell, accidentaly hitting him ",
                "He is alone, spilling a potion on himself "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how does he shrink? </span></div></span></div>",
            "created":1452555360,
            "id":2087893,
            "title":"Max"
        },
        "113":{
            "choices":[
                "slow",
                "fast",
                "he shrinks instantly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jerry shrinks!<br>\r\n<br>\r\nHow quickly?</span></div></span></div>",
            "created":1418138040,
            "id":1899855,
            "title":"Dad"
        },
        "1132":{
            "choices":[
                "doll size",
                "half his size",
                "smaller than those two sizes"
            ],
            "content":"<div class=\"\"><div> <span>Jerry prepares his own coffee before spell class.<br>\r\nUnfortunately, he inadvertently pours a shrinking potion into his coffee.<br>\r\nHe drunk it and...<br>\r\n<br>\r\nSuddenly, he began feeling funny. then... he began to shrink! quickly.<br>\r\n<br>\r\nalso, his clothes didn't shrink with him.<br>\r\n<br>\r\nhe soon shrank to...</span></div></div>",
            "created":1420539840,
            "id":1913768,
            "title":"22nd chapter: fast shrink"
        },
        "1133":{
            "choices":[
                "doll size",
                "ant size",
                "microscopic size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jerry prepares his own coffee before spell class.<br>\r\nUnfortunately, he inadvertently pours a shrinking potion into his coffee.<br>\r\nHe drunk it and...<br>\r\nPoof!<br>\r\nHe'd shrunk!<br>\r\nHow small was he?!</span></div></span></div>",
            "created":1418143620,
            "id":1899876,
            "title":"he shrinks instantly"
        },
        "11333":{
            "choices":[
                "Jerry decides to get someone's attention",
                "reader's choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jerry found that he was now so tiny, the only way you could see him was with a microscope.<br>\r\n<br>\r\nalso, his clothes didn't shrink with him.</span></div></span></div>",
            "created":1420539660,
            "id":1913767,
            "title":"microscopic size Dad"
        },
        "12":{
            "choices":[
                "Alex Russo",
                "Her mother",
                "Harper",
                "Juliet, justin's Vampire girlfriend",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>Which lady from the Tv show, Wizards of Waverly place, will start to grow into a giantess?<br>\r\nWill it be;<br>\r\nAlex? She will be a fun one to see grow into a giantess.<br>\r\nHer mother? This one would be interesting.<br>\r\nHarper? Another girl that may make a fun giantess.<br>\r\nJuliet, Justin's vampire girlfriend? Another interesting one to become a giantess.<br>\r\nor<br>\r\nsomeone else?</span></div></div>",
            "created":1276747620,
            "id":900921,
            "title":"giantess grow"
        },
        "121":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "150 ft tall",
                "1000 ft tall",
                "Bigger!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's time for Alex to get HUGE! <br>\r\n<br>\r\n<br>\r\nHow big will Alex start out at?</span></div></span></div>",
            "created":1279611120,
            "id":921110,
            "title":"Alex Russo's Size Choices"
        },
        "1211":{
            "author_id":"gunner111",
            "author_name":"Gunner11",
            "choices":[
                "spell",
                "potion",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why will she grow</span></div></span></div>",
            "created":1284899280,
            "id":959649,
            "title":"150 ft tall"
        }
    },
    "info":{
        "author_id":"yewyw",
        "author_name":"LiAm",
        "brief_description":"male shrinking aloud\r\nno male giants\r\n",
        "created":1257006240,
        "description":"<td align=\"left\" class=\"norm\">someone shrinks or grows from the tv show wizards of waverly place</td>",
        "id":1613791,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1452555360,
        "modified":1452555360,
        "pretty_title":"Wizards of waverly place shrink/gts"
    }
}