{
    "chapters":{
        "1":{
            "author_id":"ianc",
            "author_name":"littleguy",
            "choices":[
                "He feels me and we have some fun.",
                "He feels me but has some chores to do i go along for the ride.",
                "He doesn't feel me and has some fun."
            ],
            "content":"<div class=\"\"><div> <span>I look up at Eric and shout him but the radio is drowning is louder. He strips off his underwear and i'm greeted with the largest cock i have ever seen he leans forward and his cock comes down to the bed in front of me i walk over to it the head must be at least three time bigger than me i climb up onto it as he stands back up.<br>\r\n<br>\r\nWhat happens next</span></div></div>",
            "created":1603131360,
            "id":2924808,
            "title":"In his bedroom"
        },
        "12":{
            "author_id":"ianc",
            "author_name":"littleguy",
            "choices":[
                "Goes and takes a bath he forgot about me ",
                "Remembers i'm there and has some fun ",
                "Goes upstairs and gets himself off oblivious to me"
            ],
            "content":"<div class=\"\"><div> <span>Eric looks down and sees me on his cock head \" your're here \" he says with a big smile \" yep here i am \" i say \" i just have a few chores first then we can have some fun okay \" i look up and nod he then looks around his room and begin climbing my inch tall body up his 8 cock when i get about halfway he starts to walk i hang on as his cock swings with each step he takes as he goes downstairs to the kitchen to clean the appliances. As he goes about the kitchen cleaning i hang on with my face buried in his skin and licking his cock when he's done he walks down into the basement and says to himself i'll go and workout before little Matt gets here i shout him but he doesn't hear me as he is lifting his weights i male my way up to the base of his cock. After a few hours working out Eric is really sweaty now.and a bead of sweat drops down onto me and washes me down his cock i manage to hang on as we get to the head. <br>\r\n<br>\r\nWhat happen next? </span></div></div>",
            "created":1603387440,
            "id":2926917,
            "title":"He feels me but has some chores to do i go alon..."
        },
        "121":{
            "author_id":"akatheguy",
            "author_name":"akatheguy",
            "choices":[
                "Eric notices you",
                "Eric doesn't notice you, but your movements are arousing him so he deals with it",
                "Eric begins to wash his body"
            ],
            "content":"<div class=\"\"><div> <span>Clinging on to Eric's enormous cock head I continued to take in the scent, rubbing and pleasuring myself against it. I licked up the salty sweat and enjoyed the vague taste of precum generated. What a great place to be!<br>\r\n<br>\r\nRolling half-over, I looked up and saw Eric...not looking down at me. No, he was moving up to the bathroom without acknowledging me even remotely. Before long he'd started to run the bath and the roar of the water drowned out my shouts.<br>\r\n<br>\r\nThen he stepped into the bath itself, enormously muscular thighs stepping up and landing in the water, which to me was ocean-deep. Eric gave an enormous sigh of relief as his tired muscles were able to relax in the water, but it was the opposite for me; I was completely submerged for a few seconds before the semi-hard dick popped just about out of the water. Now lying horizontal, I stayed on the side of the dick that was still above water and redoubled my efforts to stimulate him. The bigger and harder the dick got, the more it'd stay out of the water. Plus he might remember I was there that way.</span></div></div>",
            "created":1603471920,
            "id":2927533,
            "title":"Goes and takes a bath he forgot about me "
        },
        "122":{
            "author_id":"ianc",
            "author_name":"littleguy",
            "choices":[
                "I fall in the water unknowingly to Eric.",
                "Eric pushes me in.",
                "Eric picks me up placing me on his chest."
            ],
            "content":"<div class=\"\"><div> <span>I look up at Eric all his muscles glistening in sweat he looks around the basement he starts moving to put his weights away not even looking down i roll over onto my stomach to hang on as he walks round cleaning up he just gets to the bottom step when he looks down at me i wave to him he picks me up gives me a little kiss and heads over to his workout bench he places me down then crouches down and puts his cock in front of me i look up at the sweat soaked muscle god \" you know what to do little Matt \" he says i just look at the enormous cock head which to me has be at least twice as big as me i climb up and about halfway my cock enters his piss slit i begin getting hard as Eric's giant cock pulsating his hips starting moving back and forth taking me for a ride. Eric's load shoots out along the bench taking me along with it i lay there saying to myself wow that was amazing as i lay in Eric's cum i try to get his attention as he looks for me but he looks over me as he inspects his cum more closely his cock comes down near me and i break free from the cum and climb hoping it gets his attention he stands up and goes to get some tissue to wipe the bench down he doesn't find me and heads upstairs to his bedroom and into his bathroom he turns on the water to fill the bathtub up as the water fills up he stands there he looks down and sees me on his cock he picks me off and brings me up to his lips and gives me a kiss before placing me on the side of the tub he turns the water off and gets in laying down with a sigh his hand is right in front of me.<br>\r\n<br>\r\nWhat happens next</span></div></div>",
            "created":1603487280,
            "id":2927619,
            "title":"Remembers i'm there and has some fun "
        }
    },
    "info":{
        "author_id":"ianc",
        "author_name":"littleguy",
        "brief_description":"I get stuck in a new world with giants",
        "created":1603130760,
        "description":"<td align=\"left\" class=\"norm\">Hi there i'm Matt and i'm 18 years old from New Jersey. I wake up after four months in a coma from my attack i look around my hospital room taking in my surroundings noticing the giant room until a giant male nurse walks in and begins to check something i shout up to him why am i so small he looks down and smiles you've always been this small my parents walk and speak to Marty then the Doctor walks in and checks over me he then turns to my parents and says i can go home but need to take it slow on my way home in the car the radio is playing Mr. Sandman by The Chordettes i ask why the radio is playing this song dad says it's the most popular song right now. i get home to my room and look around to see a room that looks like something from the 1950s i look to the calendar and see December 1954. After about 2 weeks i feel fine my mum walks in on Friday evening and asks if i'm going to Eric's this weekend who's Eric my mum just laughs and says he's my boyfriend she also says that everyone in the town loves me for everything that I've done for him and his confidence. I get to Eric's house his parents are about to leave for the weekend i say hi to them before making my way to his room i hear the radio on. Just a little about Eric after his accident he was left with partial hearing and sight which knocked his confidence. I get to his room as his parents shout goodbye to him for the weekend. Eric steps out his room and nearly on me as he walks to the stairs and shouts goodbye to his parents as he makes his way back i look up at him in amazement as he looks like a Greek God from down here he walks into his room again nearly stepping on me i follow him in and climb up onto his bed. I'm at the foot of his bed and Eric is standing there. <br>\r\n<br>\r\n</td>",
        "id":2235686,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603487280,
        "modified":1603487280,
        "pretty_title":"The unexpected new giant boyfriend"
    }
}