{
    "chapters":{
        "1":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You awaken in the arms of another shrunken person",
                "You awaken in the hand of Cassandra",
                "You awaken in the hand of Amy",
                "You awaken in the hand of Melanie",
                "You awaken in the hand of Jen"
            ],
            "content":"<div class=\"\"><div> <span>You are Jason Marksman, an average 17 year old. You layed on your bed tossing a small hackysack to yourself as you lay on your bed. You suddenly heard noise coming from the downstairs but chose to ignore it. Soon tongues of flame licked the bottom of your door as your house quickly started to burn to the ground. You became unconsiuos and where asleep for several hours. Suddenly you awoke, one inch tall moving while being held tightly.</span></div></div>",
            "created":1211346000,
            "id":534623,
            "title":"Fire!!! Fire!!!"
        },
        "11":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You try and find more shrunken people to plot a small rebelion",
                "A hungry giantess spots you",
                "You go back to the ash of your house to find out why you where shrunken",
                "You head down to your girlfriend Jen's house"
            ],
            "content":"<div class=\"\"><div> <span>You are on the move with drips of rain falling down your face, being gripped tightly. You pretend to stay asleep, thinking you where dead and you didnt want to know what was going to happen next. You where soon set down on a damp smooth surface. A slap brought you from your fake sleep. \"Hey kid, I know yur fakin' a death\" said a voice. You slowly opened your crystal blue eyes and you looked into the face of a large man, followed by a group of other people. \"See, heh, he came too,\" he said. \"W-where am I\" you asked. <br>\r\n<br>\r\n\"Yur, currently layin' atop a leaf and me and my troop just saved your ass from the cult.\"<br>\r\n\"What cult, and did you say leaf? arent leaves small?\" you made a puzzled face. \"Well yeah, but you are too son, the cult shrunk you down to the size of an acorn. \"Well I can see that!! Why?!\" <br>\r\n<br>\r\nThere was a long pause<br>\r\n<br>\r\n\"I dunno, but for some reason they shrunk all of us, with the intent to swallow us, I myself had to battle the leaders belly, and I came out the other end alive.\"<br>\r\n<br>\r\n\"You should be thankful I saved you, they where lookin' for you real hard, I guess the queen wants to get you for some reason.\"</span></div></div>",
            "created":1212469200,
            "id":539809,
            "title":"You awaken in the arms of another shrunken person"
        },
        "112":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Lauren(not in title) ",
                "Rachel(not in title)",
                "Miranda(not in title)"
            ],
            "content":"<div class=\"\"><div> <span>The blades of grass above you shifted as a huge hand with painted red nails came down upon you, grabbing you and the troop. She brought you up and zipped you in her backpack, then took off for her home. You and the troop heard a defeaning sound of a door slam, which meant you must have been brought to this girls house. <br>\r\n<br>\r\nYou looked in the eyes of the man, \"I'm sorry, if we are going to be swallowed by this stranger some time in this horrible night I would like to know your name.\"<br>\r\n<br>\r\nHe was silent for a while<br>\r\n<br>\r\n\"My name is Barry,\" he said. <br>\r\n<br>\r\nSuddenly the backpack zipped open and you where dumped onto the cloth of a bed.<br>\r\nWho was your captor?</span></div></div>",
            "created":1212555600,
            "id":540062,
            "title":"A hungry giantess spots you"
        },
        "1122":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You looked into the eyes of your captor, she had dark brown hair and coffee brown eyes. <br>\r\nShe was wearing an extremely tight light blue tanktop that went down just above her bellybutton. She had a nice D-Cup and her smile was pearly white. She had a small bit of tummy fat that bulged her belly out a little. She smiled, \"I'm Rachel\" she said. <br>\r\n<br>\r\nBarry nudged you, \"dont believe what she says, I bets shes a cult member.\"<br>\r\nShe smiled again, \"So who are you guys?\"<br>\r\n<br>\r\n\"I'm Jason Marksman\" you said. Everyone stared at you, even Rachel<br>\r\n\"You mean that you are the guy that the cult is looking for?\" she said. <br>\r\n\"Uhhh, I guess so.\" Barry had an intensified fear in his face. <br>\r\n\"Wait, so Rachel, are you part of the cult?\"</span></div></div>",
            "created":1212555600,
            "id":540079,
            "title":"Rachel(not in title)"
        },
        "11222":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You run for her body, to have some fun",
                "You stay put"
            ],
            "content":"<div class=\"\"><div> <span>\"No, Im currently hiding in my house from them so they wouldn't hunt me down. I have been trying to find shrunken people to save for a while now, and you boys are my first bunch.\" <br>\r\n<br>\r\nBarry looked up and down her body and whispered in your ear, \"I don't think shes lying, the cult members have an emblem that signifies they are a member on their boobs. <br>\r\n<br>\r\nYou smiled, wishing that you could be the emblem giver. \"I guess we can get comfortable with this girl for now.\"<br>\r\nYou looked at Rachel, she was the most beautiful girl you had ever seen, besides Jen, your girlfriend. Her breasts where the perfect size in contrast with her sexy stomach. <br>\r\n<br>\r\n\"Well, you guys make yourselves at home, I'll go get us some food.\" she walked out of the room. \"Okay troop!\" yelled Barry, \"We are going to lay low here for a while until we can find an antidote for the shrinkage, so please behave and dont be the little perverts that most of you are!\" The troops laughed, whispering plans to explore Rachel. <br>\r\n<br>\r\nShe soon returned with a plate of snacks, tiny food in the outer ridge and big food for her belly.</span></div></div>",
            "created":1212642000,
            "id":540530,
            "title":"No"
        },
        "112221":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "She sees you in the dip",
                "She doesnt see you in the dip"
            ],
            "content":"<div class=\"\"><div> <span>Your hormones where accelerated out of control, when Barry didnt look as he mingled with his team you made a sprint for Rachel's breasts, which where on the bed as she leaned over and ate. You dove into the soft pillows and stopped your exploration, she didnt seem to notice and you climbed in deeper.<br>\r\n<br>\r\nYour body was brushed against the soft skin as it got tighter and tighter. Soon you where immobilized, stuck in her deep cleavage. Your hand reached out and felt the cool air. <br>\r\n<br>\r\nRachel suddenly stood up! <br>\r\n\"CRAP!\" you yelled as you started to slip out. You slid down the soft skin of her tummy and suddenly she leaned forward. You couldnt get to her navel, which would have stopped you. You slipped out of her shirt and landed in her nacho chips. \"Ugh, I felt a bug!\" she said. She sat back down and leaned over the bed. You could not move in the thick yellow cheese, which was surrounded in greatly sized chips.<br>\r\n<br>\r\n</span></div></div>",
            "created":1212728400,
            "id":541056,
            "title":"Hello Cheese!"
        },
        "1122212":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Rachel feels you in her tummy",
                "Rachel gets pizza"
            ],
            "content":"<div class=\"\"><div> <span>Rachel took a chip, and with it a great scoop of nacho cheese. She brought the chip to her mouth and opened, crunching her incisors on it. The chip was then tossed in her mouth and she continued chewing. She swallowed down the remains to her hungry belly.<br>\r\n<br>\r\nYou where luckily still in the dip, but you couldnt move from your cheesy prison. Rachel lifted up another chip, this time with you on it!<br>\r\n<br>\r\n\"HELP, RACHEL STOP!\" you screamed. She didnt even notice and crunched the front of her chip. She then tossed you inside her mouth. You dodged her molars and other teeth she was using. Suddenly, her tongue pushed everything into her throat, including you!<br>\r\n<br>\r\nThe contractions got your leg and swallowed you into her esophogus. You slid down her throat with the nachos that her belly was hungry for. The saliva was hot and sticky, as it helped Rachels throat push you down. Your journey down her throat ended and you plopped into Rachels belly, in a pile of digesting chips.</span></div></div>",
            "created":1212814800,
            "id":542588,
            "title":"Down to her belly"
        },
        "11222122":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Pizza comes down the esophogus",
                "You make it successfully"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Rachel stood up, you bounced and hit the top of her tummy, and fell back down into the digesting chips. She walked over to her fridge and got a out a box of pizza with a few slices remaining. She brought it back to the room, plopping it onto the bed. <br>\r\n<br>\r\nHer stomach churned and the chips where starting to soften. You felt another plop, and you flowed down to the side wall of Rachel's stomach. She must have turned over. <br>\r\nYour main objective was to get the hell out, and you could easily climb through the esophogus, since Rachel was laying on her back. Her belly churned and knocked you into the acids. You started to run away as it claimed the chips, and nacho cheese. The esophogus muscle was harder to get up then you thought.</span></div></div>",
            "created":1213074000,
            "id":542590,
            "title":"Rachel gets pizza"
        },
        "112221221":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "content":"<div class=\"\"><div> <span>You ran into the hole that led to Rachel's esophogus. Suddenly a great big glob of mushy chewed, cheese pizza pushed you back down and into the acids of Rachels tummy. Her belly growled and more bites of pizza slid down her throat and shot into her stomach, smacking and sticking to you. \"Gaahh! I cant move my arms and legs.\" you said, but the helpless struggle was to no avail and more pizza toppled onto you. The acids ate away at you as more pizza came down. The stomach acid was rising and quickly submerged your tiny body and the pizza. <br>\r\n<br>\r\n\"Damn, If I have another life, I need to control my hormones.\" <br>\r\nYou gave in to the acids and where soon digested, and reduced to a blob with the pizza. Rachel's tummy jiggled as it churned to digest its meal. \"Ohh, I finished the whole few slices that where left\" she said. Rachel put her hand on her stomach, to feel the pizza sloshing inside it. \"Burrrpp!!!\" Her face went red as her shrunken refugees stared at her.<br>\r\n\"Sorry this pizza, and whatever else I ate made my tummy all tingly and gassy.\" <br>\r\n</span></div></div>",
            "created":1213246800,
            "id":543404,
            "title":"Digested by Rachel"
        },
        "114":{
            "author_id":"pokemon4169",
            "author_name":"Pikachu22",
            "choices":[
                "Be Her Pet",
                "Get Out Of There And Jump In Her Panties",
                "Jump Out Into Her Bra And Go Where She Goes"
            ],
            "content":"<div class=\"\"><div> <span>When You Arrived At Jens House She Looks Down At You When She Is Walking Out Of The Door Too Her Car About Too Go To A Pet Store To Get A Pet Hampster And She Picks You Up And Says Hi Cutie And You Say Hi Giant Hottie And She Asks You Too Stay The Night At Her House And You Have No Choice Becuse She Puts You In Her Bra And You Fall Asleep Being Smashed Between Her Boob's And You Wake Up A Hour Later In A Hampster Cage On Jen's Night Stand By Her Bed Your Trapped As You See Her Asleep You Have To Make A Escape Plan Or Live As Her Pet Or...</span></div></div>",
            "created":1252763400,
            "id":759328,
            "title":"You head down to your girlfriend Jen's house"
        },
        "1143":{
            "choices":[
                "Hide in her nose",
                "Hide in her bra",
                "Hide in her panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Crawl up her left nostril and tickle it</span></div></span></div>",
            "created":1350543180,
            "id":1448999,
            "title":"Jump Out Into Her Bra And Go Where She Goes"
        },
        "11431":{
            "choices":[
                "Wait to be sneezed ",
                "Jump into her butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hide in her nose and wait to be sneezed out<br>\r\n</span></div></span></div>",
            "created":1350543240,
            "id":1449001,
            "title":"Hide in her nose"
        },
        "14":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Melanie reaches in for a toy to play with.",
                "She drops the rucksack"
            ],
            "content":"<div class=\"\"><div> <span>You fluttered your eyes open, looking around, you where moving fast, held in a giant hand with pink painted nails. Realizing the situation your heart began to pound, you looked up to see the face of your kidnapper.<br>\r\n<br>\r\nIt was a young high school student, with very light brown, almost orange looking eyes and dark brown hair, that was in a ponytail. She was running across the street at the moment. You yelled to get her attention, at no use, She was running to fast. <br>\r\n<br>\r\nAfter a while of running you realized she had a rucksack, bouncing around as she ran. Suddenly, hands began to come out, grabbing at air, then falling in again, this girl was not friendly, she was some sort of gatherer. She stopped for a minute, and through you in the bag.<br>\r\n<br>\r\nAs you fell, you hit something, hard, and knocked it over. Looking around in the bag with the small bit of daylight creeping in through the open crack you saw it was a man. Actually alot of people, the bag was filled with 50 occupants, struggling to get out.</span></div></div>",
            "created":1222146000,
            "id":586352,
            "title":"Melanie Smalls"
        },
        "141":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Her caboose",
                "Her pussy",
                "In her bra"
            ],
            "content":"<div class=\"\"><div> <span>Melanie, began to slow down, she was getting tired. She began to twiddle her thumbs and sat down on the curb of the sidewalk. Putting the bag aside everyone noticed they had a chance to escape, but Melanie knew what she was doing and quickly clenched her hand over the strap of the bag, causing sevaral people to slip and fall off.<br>\r\n<br>\r\n\"Don't try to escape, little ones,\" she said playfully. \"I suppose I can enter tain myself with one of you until my ride gets here.\"<br>\r\nSuddenly Melanie's gigantic hand entered the bag and felt around, she looked into the bag, Melanie was a cute girl. Being only 2 years younger than you, she would be an adequate girlfriend. Her face had a few small freckles on it, and brown hair tyed in a ponytail. These factors didn't matter now as her hand headed straight for you!<br>\r\n<br>\r\n\"How about you, little guy, I think you should be my toy.\" She smiled and looked at you, gripping you tightly, licking her lips. \"So where do you want to go hon?\"</span></div></div>",
            "created":1222491600,
            "id":587527,
            "title":"Her toy"
        },
        "142":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "She takes you all to her house",
                "She takes you to the All Girls School"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly the rucksack started to drop, hitting the ground with a thud. People trying to get out, fell face first into the rest of the people in the bag. You heard the sprinting footsteps of Melanie running away, guessing she had dropped the bag. <br>\r\n<br>\r\nAfter a little while the ground began to shake, and the flap of the bag opened, people scurrying on top of each other to see. The face of a cute blonde girl appeared, she started to giggle, \"Okay Melanie I think this will do!\" she yelled. She then lifted up the bag, and through the flap you could see Melanie smiling at her blonde friend. She zipped the bag shut, and you heard her say goodbye. <br>\r\n<br>\r\nYou were now in the hands of the cute blonde girl, what is she going to do. </span></div></div>",
            "created":1229230800,
            "id":619765,
            "title":"Your new owner"
        },
        "1422":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Melanie and the cute blonde girl",
                "Some unfamiliar girls"
            ],
            "content":"<div class=\"\"><div> <span>The bouncing of the bag was unbearable, many people threw up only to meet a rumble and the loud slam of a door shutting. Apparently this girl was part of the cult too, and you guessed she was where Melanie gave her captors to. With another loud slam of a door, you heard the foot steps walking on hard tiling and then silence. After a quick moment the bag dropped on something hard, and then you heard the footsteps of a few other girls coming closer. The bag began to unzip, who was at the other side?</span></div></div>",
            "created":1229391780,
            "id":620351,
            "title":"She takes you to the All Girls School"
        },
        "14222":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Continued"
            ],
            "content":"<div class=\"\"><div> <span>You rubbed your eyes at the site of 3 extremely attractive high school students, they began to remove everyone from the bag and put them in jars. Without sealing the tops yet they all filled the jar with sleeping gas, and then tightly sealed on the tops. The girls were enjoying this all, and each took a little snack from the jars before they filled it up with gas, laughing evilly. As your jar was filled, you felt an insane grip on your lungs, as your eyes teared and began to close, you heard the giggle of the giantess who tranquilized your jar, and the scream of the one unlucky man who ended up as her snack. Before you were knocked out you wondered what they were going to do to you, what would happen next.</span></div></div>",
            "created":1229456400,
            "id":620606,
            "title":"Tranquilized"
        },
        "142221":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "The cashier gets to have the slushy, because she wants to eat the principle",
                "The girl had won the two slushies for one price contest"
            ],
            "content":"<div class=\"\"><div> <span>As your eyes opened, you began to look around, but you were stuck inside of a glass chamber, and stuck in a thick green liquid, was almost below freezing, and you saw that there were others inside too. You realized you were in a giant Slushy Machine! Luckily this one was ready made so there was no need for an ice grinder at the bottom. You looked down, seeing the girls at your high school all ordering food, moving food. A sickening sight, because some people you knew were grilled on hamburgers under patties, and others were ordered alive, about to meet their fate crunched in half by a girls teeth. Others were frozen solid in ice pops, or used for a topping in the ice cream, the smaller people were used as sprinkles and the larger ones were trapped on top as cherries. Some others were ordered whole and alive trapped in jars like you saw before, to be shared with the rest of the girls at the table, or to be eaten by one, she would be awfully stuffed though.<br>\r\n<br>\r\nWhen a girl took a soda from the freezer, it had a logo saying, \"SHRUNKEN MAN INSIDE.\"<br>\r\n<br>\r\nIt was horrible being treated like toys, and most of all food. <br>\r\nThe very students and faculty of the school were now used as food for its willing female students, and they didn't mind one bit. As a group of girls approached the cashier, one of them ordered a slushy, you were praying she didn't pick green. <br>\r\n<br>\r\n\"Your going to die here kid,\" said the principle, who was in the red slushy next to you.<br>\r\n<br>\r\nThe girl ordered the red, luckily for you the principle squirted out of the container next to you and you laughed at him. He gave the finger, and as the girl was about to pay the cashier had a second idea.</span></div></div>",
            "created":1229457300,
            "id":620614,
            "title":"Cooked and grilled but you were cooled"
        },
        "1422211":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "She wants another drink",
                "She goes on break and you slip out of the machine"
            ],
            "content":"<div class=\"\"><div> <span>The cashier at the counter, halted the girls before they left the lunch area, they were headed outside, because of the hot humid summer, a slushy with a shrunken principal would do fine to satisfy their hungry tummies. \"Wait girls! That's the principal, or should I say ex-principal!\" she said. \"Please give me that slushy, I want to drink him, you girls can have another one for free.\" The girls looked at each other and nodded, and handed the slushy to the cashier, who was a beautiful Hispanic girl, at the age of about 20, she brushed back her black hair and licked her lips. \"Please girls, pick any flavor you want, and go, I want to end his life in privacy. The girls then looked at the slushy machine, pressing blue flavored, which contained the junior math teacher, he was a bastard, so you were glad that he would meet his fate in the belly of a teenage girl. The cashier then pulled the steel door over the buying window, locking herself in, but to your luck, you were locked in too, so that meant you could not be bought, or eaten unless this girl wanted another snack. <br>\r\n<br>\r\nShe began to slurp on her drink, the cherry, smothering her lips, and the principal inching closer. \"This is what you get for giving me such a low pay! Now you are the one who will pay!\"<br>\r\n<br>\r\nShe finished the slushie, and the principal was inside of her cold mouth, she began to swish her snack around in her mouth, she began to tilt her head back, and with a large bulge descending down her throat, you knew the principal was history, or soon to be as he will be digested in the stomach of his own cashier.<br>\r\n</span></div></div>",
            "created":1229826180,
            "id":622580,
            "title":"The principal diet"
        },
        "14222112":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "The metal counter",
                "Into the new cashiers cup"
            ],
            "content":"<div class=\"\"><div> <span>She began to pat her belly, it gave a small rumble and left through the back door to digest in peace. The iron door was locked but you could see a small crack in the bottom, small enough for a mouse to squeeze through. But the slush you were in was getting colder by the minute, so this was your only chance to slip through before the new cashier came in. <br>\r\n<br>\r\nYou heard footsteps of high heel shoes, and you could tell she was approaching, you dunked you head under the freezing liquid and began to pull yourself through, still hearing the sounds of gigantic footsteps. Your arm had reached freedom, but there was only a small hole through the bottom, so the slushie would stay inside the machine. <br>\r\n<br>\r\nYou were running out of breath and felt around outside with your hand for where the release button was. Squeezing your entire arm and shoulder through the hole you felt the button, and started pounding on it, and you were about to suffocate from the lack of oxygen. Suddenly, it was a miracle, you fell with a great big glop out of the machine.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nBut onto what?</span></div></div>",
            "created":1229873220,
            "id":622831,
            "title":"Escape the sweet slushie machine"
        },
        "142221121":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Some girls pass by and see you",
                "You make for the door, but cannot get through because it is gaurded"
            ],
            "content":"<div class=\"\"><div> <span>Landing on the counter in the huge glop, you quickly freed yourself and climbed down onto the floor by a wire. Slipping through a tiny hole in the door, you entered the eating area where all the hungry girls enjoyed their shrunken themed meals. The dress code of the school had gone down, since the faculty was now below 30 years old and loved to have the ability to dress freely. Girls walked around in bikini's and barefoot, hoping to catch an unsuspecting escapee with their big toe.<br>\r\n<br>\r\nMany girls as you saw just toyed with their food, dangling the helpless victims above their mouths and licked them, some were having competitions of who could catch the most, and what would happen if a girl missed. The one who missed the catch would have to take off her pants, down to her undies and sit on the victim. Other girls didn't even eat their food, some crushed them between their breasts, or tortured their prey. <br>\r\n<br>\r\nIt was a horror zone, and at the same time, seeing a whole school of hot teens in bikini's wasn't so bad. But you needed to focus on the goal here, get the hell out of this cafeteria!</span></div></div>",
            "created":1231284060,
            "id":629945,
            "title":"cafeteria"
        },
        "1422211211":{
            "choices":[
                "The girls open the door and catch you",
                "You hide under a janitors mop bucket"
            ],
            "content":"<div class=\"\"><div> <span>A Group of 4 attractive girls pass by and happen to see you on the floor.Your instant reaction is you have no time to stick around so you run.They make a competition to see who can crush you first.The girls take off after you, pushing eachother out of the way to get to there prize.The ground rumbles and shakes which makes it difficult to keep your balance. One foot comes down on the right of you.Then another on the left.You slip and lose momentum,but you get right back up and run.Then,you come to a door and perform a baseball slide under the door.You get up and look at what appears to be a janitors closet.<br>\r\n<br>\r\n<br>\r\nWhat Next?</span></div></div>",
            "created":1246349340,
            "id":716521,
            "title":"Game On"
        },
        "14222112112":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Flip a coin to see who'll eat you",
                "Keep you as a spy for other little people ",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>One of the girls opened the door, and after looking around said \"I guess he's not in here!\"<br>\r\n<br>\r\nYou had been holding your muscles tight in fear before she said that, so now you relax your legs, and your foot makes a little splish in the small puddle, which was a deathly error.<br>\r\n<br>\r\nOne of the girls nudged the others and said \"wait, what was that?\" She moved over the bucket, and saw you. \"Ah, there you are! Hey, girls, I found him!\"<br>\r\n<br>\r\nThe other girls crowded around it, and clapping their hands together excitedly. \"Welcome to your doom! We will...</span></div></div>",
            "created":1529800740,
            "id":2511229,
            "title":"You hide under a janitors mop bucket"
        },
        "142221121123":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Play cruel games with you",
                "Flip a coin to see who'll eat will get to step on you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?  </span></div></span></div>",
            "created":1529801040,
            "id":2511231,
            "title":"Other "
        },
        "15":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Amy changes her mind and inspects the inside of Jen's belly with an X-Ray",
                "Amy goes off to her house and Jen sprints back home"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god sweetie are you okay?\" yelled the huffing and puffing voice of your girlfriend Jen. You quckly flitted your eyes and scanned the area, you where inside of Jen's soft hand and being held tightly as Jen ran, water seeped through her fingers from the rainy skies as she opened her hand. \"Uggghh, where am I.... Wait why am I so small!?\"<br>\r\nYou started shivering out of fear in your new vulnerable size. \"Aww, honey come here\" said Jen as she shoved you to her lips and gave you a kiss. \"Im sorry you are shrunk, but I did all I could to save you,\" \"From what?\" you said. \"From the new all girl cult, your sister went to join but the evil leader, Cassandra didnt let her in unless she offered a sacrifice, which in turn was you. Cassandra is the evil queen of this cult and she became the queen after finding this new power,\" \"What power?\" you asked. \"The shrink ray gun that she found, laying in an asteroid, she uses it to shrink people and make them her slaves. \"Okay, so who are we running from now?\" you asked. \"Amy Giant, she is the cults searcher and she helped your sister in shrinking you down, if I didnt come in when I did you would be in Cassandra's belly right now with thousands of other shrunken people from microscopic size to 3 inches tall.\" \"How do you know this much?\" you asked, \"I had to join the cult because my sister wanted to break us up, but I stole you on our mission to shrink you so I could keep you safe.\" Before you could speak again Jen hopped into an alleyway and pressed you against her body to hide you from Amy. Amy quickly ran by, her highlights staining the dark night. \"Okay, good shes gone\" Jen said, \"Im gonna take you home so you can stay with everyone else I rescued.\" Jen slipped you down her tanktop and you slid inti her bellybutton. She patted her stomach \"Stay there and dont move, try and get in as deep as you can.\" You climbed down to the end, it was really cramped and warm. Jen casually walked out of the alleyway into the wet streets. \"Hey You!\" you suddenly heard a muffled gasp coming from Jen as she saw that she was caught. The clip clop of boots walked over and the giant Amy towered over Jen at 6'5. \"Where is that shrunken man that you took,\" said Amy. \"Honestly, I'm sorry\" said Jen. \"I didnt have lunch so I was hungry and swallowed him, I thought you would get mad at me.\" Amy made a concerned face, \"Well you could have asked, as long as he is dead. I mean the queens belly or your belly it doesnt really make a difference, I'll let this one slide.\" Amy slowly walked away putting her shrink ray gun in the pocket of her jeans. </span></div></div>",
            "created":1211432400,
            "id":534887,
            "title":"You awaken in the hand of Jen"
        },
        "151":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Amy is bad and has a snack",
                "Amy takes you back to Cassandra"
            ],
            "content":"<div class=\"\"><div> <span>Jen wiped the sweat off her forehead. \"Wait,\" yelled a voice in the distance. Amy sprinted back to Jen and you trembled at what she was about to do. Amy took out a pair of X ray gogges and strapped them to her face. \"Just to be sure hes in your belly, I mean the guy is your boyfriend,\" Amy said. Jen shivered and Amy pushed her down to the wet side walk. She examined her abdomen with different expressions on her face. \"Well, I do see a skeleton, in your belly area, but I cannot figure out if he's being digested or not. Sorry about this but I need to do it just to be sure,\" Amy lifted up Jen's shirt and examined her bare belly. \"Do I see hair?\" she said with a smirk. \"You little theif! you lied!\" said Amy. She quickly injected Jen with a sleep potion and plucked you out of her bellybutton.</span></div></div>",
            "created":1211691600,
            "id":535838,
            "title":"Amy changes her mind and inspects the inside of..."
        },
        "1511":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You escape",
                "You do not escape"
            ],
            "content":"<div class=\"\"><div> <span>Amy held you out in her open hand, inspecting you. \"Hmm, you really are Jason arent you? I guess your sister led me to the final member of the Marksman family.\" You looked at Amy, confused and dazzled. \"What do you mean final member, where is my family?\" \"Lets just say, they are with me now, and ive been a bad girl.\" Amy put her finger to her lips, slowly tracing a path down her neck and over her boobs and down to her belly. Slowly licking her lips. \"I bet you guessed where they are, after all your sister said that you where at the top of your class, and had a bad temper. Thats why she is the only member of your family that isnt in my belly right now.\" Amy licked her salivating red lips, \"I think I can be a bad girl one more time, and have another member in my stomach.\" Amy's stomach growled loudly, tears came to your eyes. \"My family is dead, You killed them! You damn heartless bitch! What did they ever do to You!\" You punched Amy's hand. \"Ow that hurt! Watch that temper! How dare you kick me!\" Before you could speak and regret your mistake Amy shoved you into her mouth and swished you around in her saliva. \"MMM soo deliscious, ive really been a bad girl.\" Amy moaned at your flavorful taste, \"Yumm, well Jason, time for you to visit your family in my belly.\" and with that she swallowed you down. Amy stroked her long neck and layed down in the alleyway. You where soon excreted into Amy's stomach where you lay in a pool of acid. </span></div></div>",
            "created":1211864400,
            "id":536672,
            "title":"Amy is bad and has a snack"
        },
        "15112":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "content":"<div class=\"\"><div> <span>You treaded in the acid, feeling for a spot to rest. Your fingers touched a body, which floated away. You knew right off the bat that it was one of your family members that was swallowed by Amy. Your body went into shock as you wept over the corpses of your family. Amy was on her back laying against a brick wall in the alley way. She started to slowly stroke her stomach and she clenched the lower end of her shirt and lifted it up until it was right below her boobs, exposing her tan belly. You felt various pats from above you and the stomach reacted accordingly, releasing more acid. You screamed as the bodies of your family slowly sunk to the body of Amy's tummy. \"Yummy in my sexy tummy\" said Amy, taunting you. Amy patted her grumbling belly as a bubble of gas rose up her esophogus expelling out her mouth. \"Buurrrrppp!! hehe, that was a good one.\" More burps arose from her belly and she let out a series of small ones and a big one at the end. After her fun she patted her more lean stomach after the gas was expelled. She traced her finger all around the soft skin of her tummy as it grumbled. She made circles around her navel, feeling for movement inside her belly. You werent having as much fun as Amy, you where dying. The acid rose higher and submerged you in it, as the stomach contracted you swallowed gulps of acid that started digesting your insides. You where doomed and just gave in, \"My family is gone, and I'm gone\" Amy realized the lack of movement inside her belly. \"Hmm, dead already? Oh well, I need the energy to run back to head quarters.\" She patted her soft stomach and pulled down her shirt, beginning her jog to work, using you for energy for her legs, feet, arms and muscles.</span></div></div>",
            "created":1211950800,
            "id":536997,
            "title":"You do not escape"
        },
        "1512":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Cassandra wants to eat you",
                "Cassandra wants to use you for pleasure"
            ],
            "content":"<div class=\"\"><div> <span>\"Haha, Cassandra will be proud to have you in her belly, you where so difficult to catch and are the brother of her star member.\" You gritted your teeth at the thought of your sister, what a bitch, turning on your family. Amy put you in a jar and closed the lid, stuffing you into a ruffsack. She pulled the strap over her shoulder and started to run to the coffee shop. The ride was long, since Amy fed her driving instructor to Cassandra, she had no liscense and even though the cops where either, crushed, shrunken, being digested, being eaten, or in the sewers in various urinal excretions, there where still cult cops who checked for liscenses. You fell asleep from the long ride to your fate, not even attempting to get out of the tiny air holes in the jar. Before you knew it Amy slammed her sack onto a table, she took out your jar and emptied you onto a plate. The light from the lamps hurt your eyes from being in total darkness for so long. When they adjusted you looked up to see the collasal body of Cassandra.</span></div></div>",
            "created":1211950800,
            "id":537089,
            "title":"Amy takes you back to Cassandra"
        },
        "15121":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You use the dead bodies as sheilds to protect you from the stronger acid",
                "You take your chances and tried to go down as fast as you could"
            ],
            "content":"<div class=\"\"><div> <span>\"Good job Amy,\" said Cassandra while lifting you off the plate. \"Another person to fill up my belly, too bad you couldnt go in with your family if it wasnt for your girlfriend.\" Cassandra was very lean, but her belly bulged with the occupance of hundreds of shrunken people. Her belly was the loudest thing you had ever heard, and you could almost see the imprints of the people as they where sloshed around and compressed. \"OOhhh I cant take this anticipation anymore, I need you!\" She quickly shoved you in her mouth and started to slosh you around in her spit. She moaned satisfyingly at your taste as she sucked on your body. Your clothes where sucked off, and you where in only your boxers. She spat your clothes out onto the plate. \"Well, I hope its not too cramped!\" she said and used her tongue to tilt your head to her throat. \"Your going down headfirst my little snack.\" GULP!<br>\r\n<br>\r\nYour face was smooshed in a small pocket of skin and the esophogus sucked you inside. It was almost impossible to breath, but in biology you had learned the ride down the esophogus is 10 seconds. Cassandra rubbed her throat and brushed back her sandy blonde hair. \"OOoohh god I'm full, I'm going to go take a nap. She walked over to her bed and stopped at the mirror, showing off her belly to herself. \"Well nighty night,\" she said as she collapsed onto her bed and fell asleep. By this time you where at the bottom of her esophogus<br>\r\n<br>\r\nThe muscle opened up and you where shot in like a bullet into about thirty screaming people. \"No Not another one! God damn! cant this pig ever stop eating!?\" said one of them. Dozens of people all shapes and shrunken sizes climbed over you dunking you in the acid trying to reach the ring muscle. The stomach was extremely cramped, hot, acidic and smelly. About 50 people where dead and the other fifty where eather in a fist fight or trying to get out.You where trampled and your face was on the bottom of the stomach. Suddenly her stomach growled loudly and more corrosive acid started squirting from the walls. You got up and climbed for dear life. The unfortunate people on the ground where being boiled alive and drowning in the stronger digestive juice. Dozens of people swallowed it, while drowning and their bodies started to become digested on the inside. In another hour almost every one of them was dead, except a few of them and you. The acid died down and the husks of the digested bodies floated in the acid. You and the survivors where sitting on a dry spot in the stomach. \"Are you guys alright?\" you asked. \"Well yeah, just a little burned\" one of them said checking the other guys. Suddenly if anything could not get worse the intesine opened and the bodies where being sucked in. \"Well man, the only way for us to get the hell outta here is through the back door,\" said one of them. You and the others jumped into the acid that was being sucked in and where dumped into the small intestine.</span></div></div>",
            "created":1212210000,
            "id":538057,
            "title":"Inside cassandra"
        },
        "151211":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "content":"<div class=\"\"><div> <span>\"Quick everyone, I know this will be gross but its our only hope to stay alive in this hell tube, jump into the husks.\" Everyone made a face but shrugged their shoulders. \"He is right, its our only chance of defending ourselves from the corrosive acid. Everyone piled jumped into the husk ball and you where sucked in to the small intestine. There where only about ten survivors left, and you where hiding in a cramped, hard ball of bones and solid waste. The villi safely passed you along the bottom while acid squirted on the outer shell of bone. You slowly passed along, as your stomachs growled. \"Ugh we need to eat something, we are going to be in here for hours,\" you said. Suddenly a loud Squelch from the out side made you jump. Another repeated by another, \"John are you alright?\" said one of the guys to a motionless man. \"Hello John!\" the man stayed motionless. \"JON! GOD DAMN ANSWER ME!!!\" Suddenly after the screaming riot his body fell to the floor and a river of bile squirted in to the husk pile. \"Oh my god Its leaking in, the acid must be extremely strong, in order to digest bone!\" you screamed. Five guys where melting away with the river of acid eating at their skin. You tried to climb out but the thick walls of the husk where too strong.<br>\r\n<br>\r\nThe acid took the other four people that where left and in minutes they where reduced to bone. You where the only one left, and the acid was rising. \"Thats it I give, even if I do escape, I have nowhere to go, Cassandra will probbably eat Jen next.\" you said with tears gathering in your blue eyes. You dove into the bile, and within seconds it boiled your skin and you where drowning, swallowing it. You went black<br>\r\n<br>\r\nThe next morning Cassandra awoke opening her eyes. \"Ooohh, my belly shrunk, it looks like you are all part of me now\" she said. She stretched her body and rubbed her stomach. She stood up looking into the mirror, she was surprised to see...<br>\r\n<br>\r\nHer breasts where more gigantic<br>\r\nHer stomach had just the right amount of fat on it, to make it sexy<br>\r\nHer legs looked more sexy<br>\r\nHer arms where stronger<br>\r\nMost of all, she had to take a dump, A big dump!</span></div></div>",
            "created":1212210000,
            "id":538213,
            "title":"Cassandra's digestive tract"
        },
        "151212":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Some one sees you and picks you up",
                "You successfully escape "
            ],
            "content":"<div class=\"\"><div> <span>You and the ten remaining guys where standing frightened on the villi of Cassandra's small intestine. The acids where starting to spurt out of the glands in the walls. \"Okay, lets speed up this digestion!\" you yelled, as some sort of stupid battle cry. All ten of you took off and sprinted as fast as your legs could go. The acids quickly flowed down behind you. \"Alright. twenty-eight feet to go!\" Suddenly a spray of acid spurted out and claimed a guy on the right. \"Keep Going! Dont Stop!\" you yelled in a hopeless situation. The acid claimed two others and you still didnt give up running as fast as you could. Soon you reached the end of the small intestine with only 3 guys left. \"Those poor guys, they are probbably nothing but bone by now, their skin and nourishment getting sucked into this bitch's blood stream. Expectingly, the intestine opened up, sucking all of you inside the large intestine. \"Okay everyone hold their breath, this organ is filled with water.\" said one of the guys<br>\r\n<br>\r\nYou slowly moved through the completly dark large intestine, it was extremely smelly, and filled with water. There was a few bubbles of air on the top, but they where green and brownish color so it would not be wise to breath them in. \"The other two, tried to take in the bubbles, and quickly threw up and coughed. They where suffocating!!! \"Its a fart! said one of them under water. He took in the dirty water and soon drowned. \"Shit! No!\" you screamed in your head. \"If there was one fart, there must be others! Crap I gotta get out of here!\" you thought. You started swimming faster as you could see a massive bubble taking in the other guy. You soon arrived at the rectum where there was air. The gas bubble popped in her intestine and emmited a long gurgle inside her abdomen. <br>\r\n<br>\r\nThe turds where on their way! You where never so glad to hear this news, because once they arrived, you would be pooped out. Suddenly a myriad of logs entered the rectum. You where trapped between a giant turd, of bone and skull and another turd of various undigestable materials. <br>\r\n<br>\r\nCassandra woke up, stretching her belly. \"Ooohh, I gotta poo! bad!\" She quickly got out of bed and ran to the bathroom. She locked the door, remover her shorts and sat down on the toilet. A few plootches signalled she was done and she wiped off her butt. \"The stench was terrible, but it was better than dying, you thought. A whirlpool flushed you down into the sewers below your small town. You climbed out of the smelly water and brushed yourself off, \"I really feel bad for food.\" The sounds of footsteps on the occupied streets above, mixed with the screams of various unshrunken anti-cult members was defeaning. You climbed onto the steel ladder and out of a grate into the crowded streets. <br>\r\n</span></div></div>",
            "created":1212210000,
            "id":538222,
            "title":"You take your chances and tried to go down as f..."
        },
        "1512122":{
            "choices":[
                "Go look for Jen and stay with her,Fuck you guys",
                "Stay with the group,theres no sense in going out there."
            ],
            "content":"<div class=\"\"><div> <span>       Once out on the streets,you look around to a horrifying scene of crushed bodys and pools of blood.You can see cult members in the distance capturing little men, and hearing screams of the little men.The scene brings you to your knees trying to figure all this out.<br>\r\n        <br>\r\n      \"Hey you over there on your knees\",a mysterious person says.You look over and see a little man standing by a tree waving to you to come over there.You agree and run over there as quick as you can.\"Follow me\",the man says.You are taken down to a secret hide out in a tree trunk.You enter a room with a whole lot of other people in a circle all looking confused and scared.The Man enters the middle of the circle.<br>\r\n<br>\r\n       \"Alright i gathered you here because you are the only people that i could find close to here.I am just as scared and confused as all of you.But we need to stay away from that cult out there.If we dont,we could become there personal slaves,kissing there feet or getting them food or we could become the food.This place here is big enough to hold all of us to make a living untill we find a way to get back to our normal size and get payback for what they have done to this town.Now you guys can stay here and be safe from those Fuckin sexist pigs,or you can go out there and become one of those bodys out in the street.I dont about you,but im with plan A.Who's with me!\"Everyone says I except you.\"What about you over there\".<br>\r\n<br>\r\nYou hesitate and decide to<br>\r\n<br>\r\n        <br>\r\n<br>\r\n        <br>\r\n<br>\r\n</span></div></div>",
            "created":1246353660,
            "id":716572,
            "title":"An oppurtunity for a new life"
        },
        "152":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "She stops at a local store for a snack",
                "She runs home"
            ],
            "content":"<div class=\"\"><div> <span>Amy turned a corner and Jen wiped the sweat off her eyebrows. She lifted up her shirt and put her hand in front of her bellybutton. \"Come on out this coast is clear sweetie.\" You loved the comforting voice of Jen, she loved you beyond reason, and you knew that she was the only girl you could trust right now. You crawled out of her bellybutton and on to her open palm where she brought you to her face and gave you a soft kiss. The rain had stopped and the skies where clear and the stars where showing beautiful constelations<br>\r\n<br>\r\n\"Well, back in you go,\" said Jen as she put you back in her bellybutton. \"Sorry, but you will need to stay in there until I get home.\" Jen started to run, her shapely legs where trained with all sorts of sports. Her sandals slowed her down just a bit but she was sprinting her heart out. You heard very loud gurgles and groans coming from her stomach, which must have been hungry. </span></div></div>",
            "created":1211950800,
            "id":537002,
            "title":"The escape"
        },
        "1522":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Explore her body with a few of your friends",
                "Some one is home!"
            ],
            "content":"<div class=\"\"><div> <span>Despite the hunger of her poor belly she took the sprint back home. As Jen ran you bounced against the squishy comfortable walls of her bellybutton. After your entire life taken away from you, your family probbably in the diabolical queen's belly right now and your sister betraying you, you just needed a few moments to rest and let it all out. You fell into drowsyness and eventually sleep. She tore on running in the night like an escaped fugitive. The cult was aware that she had supposedly swallowed you but if one of the members was walking around in the street and Jen was sweaty and nervous, they might get suspisious. You soon awoke to the feeling of cloth on your back and deep warm breath on your face. \"Wakey Wakey sleepy head!\" yelled Jen, nudging you with her finger. Your eyes slowly opened and you where staring at her gigantic crystal blue eyes. \"hehe, i have something to show you!\" she said smiling with pearly white teeth. She lifted you up and set you on her lap. You could not believe your eyes! Your entire collection of shrunken classmates where freely roaming the floors around Jen's room. Climbing in her shoes, eating gigantic bags of snacks and running around with normal daily activities. \"The whole school was shrunken by the cult?\" you asked. \"Yeah, I saved every one of them, they are free to roam my room.\" Jen let out a sigh and she layed back on her bed. Her tummy grumbled loudly and she put her hand on it. \"OOhhh I'm so tired,\" she groaned. Jen quickly fell asleep.</span></div></div>",
            "created":1212123600,
            "id":537842,
            "title":"Shrunken school"
        },
        "15222":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Melanie, Jessica, Amy",
                "Cassandra, Marrisa, Jessica"
            ],
            "content":"<div class=\"\"><div> <span>A slam of Jen's front door made your heart drop. \"Jennifer! I'm HOME!!\" yelled a farmiliar voice. You where frozen, very well aware of the voice's owner. It was Jen's sister, Samantha Marshall, she hated you and joined the cult for the sole purpose of killing you.<br>\r\n<br>\r\nThe door to Jen's room opened and Samantha stepped in the room, her face turned pale. <br>\r\n\"WHAT THE HELL ARE THESE GUYS DOING IN YOUR ROOM!?!?\" she looked at Jen who was asleep, unable to protect you. \"Well, if your not going to kill these people, I'm going to have to.\" She scanned the floor and saw you, standing right next to Jen's feet. \"So, I guess you are a little foot pervert, huh?\" she said while picking you up and putting you in her pocket. \"I'll take care of you later.\" Sam grabbed a few jars and started collecting the shrunken students on the floor. \"I dont want to have to kill you all with the risk of my sister waking up, so you are all going into my room.\" <br>\r\n<br>\r\nThe collected all two-hundred students of your school in her jars and brought them to her room, locking the door. She layed them all on her bed and opened the door to leave, \"Hehe, dont go anywhere, I hope you like girls my age, because you are all going to be shared.\" <br>\r\n<br>\r\nYou where in Sam's pocket so you over heard the phone conversation.<br>\r\n<br>\r\n\"Hehe, yeah my sister is hiding them in her room, I finnaly found the school.\"<br>\r\n\"Yeah, I have him too, and I plan to eat him instead of you, even though he is your brother.\"<br>\r\n<br>\r\nThis word brought your spine to a shatter, \"Brother,\" your own sister must have intended to kill you. Sam pushed you deeper in her pocket and was on the phone for several minutes so you couldnt hear who else she called<br>\r\n<br>\r\nWho else did she call?<br>\r\n</span></div></div>",
            "created":1212296400,
            "id":538913,
            "title":"Home sweet Home"
        },
        "152221":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You formulate a plan to escape",
                "You cannot escape"
            ],
            "content":"<div class=\"\"><div> <span>Sam hung up the phone and walked to her room, opening the door. She layed on her bed, playing with the jars. She opened one up and grabbed a handfull of people and  tossed them in the air. She happily caught them in her mouth and quickly swallowed them down.<br>\r\nYou where still deep in the pocket of her denim shorts, unable to hear a word she has said. \"Oh! I almost forgot about you Jason!\" she said while reaching in to her pocket. She pulled you out and rested you on her belly. \"So, look at you now! I guess you wont be dating my sister anymore. You will be in either one of our three bellies or be dead some how or other by the end of the night.\" \"How could you do this to me?!\" you screamed, \"What did I ever do to you!?\" You where about to cry. \"Oh, I dont know, I just hate you and dont take it personally. I just dont like you for dating my sister, I want her to join the cult and swallow men, not date them.\"<br>\r\n<br>\r\nBefore another word could come out of your mouth, your blood turned pale when the doorbell rang. \"Yay, the dinner guests are here!\" she screamed. Sam dropped you in a jar and sealed the lid tight. She then ran out the door jumping for joy. There where about 50 people in the jar, ranging from 2 to a quarter inch, which was perfect swallowing size for the girls.</span></div></div>",
            "created":1212382800,
            "id":539309,
            "title":"Melanie, Jessica, Amy"
        },
        "1522212":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Jen comes to the rescue",
                "The girls begin their meal"
            ],
            "content":"<div class=\"\"><div> <span>The jar was sealed tight, and climbing up to the lid was difficult, since you where trapped in the center of 50 screaming people. You gave in as many of the screaming people commited suicide by sticking their faces to the glass of the jar, not wanting to die in the depths of a giantesses belly. Others praised the fact of being eaten, at least five students where cheering happily, apparently they liked the fact of being eaten. To you it was not so bad, you would rather die like this than grow old and die in a retirement home, but the problem was it was not your girlfriend swallowing you, it was her evil sister, or any of the dinner guests who came along. The jars consisted of mostly boys, and men but there where women too. Young girls under the age of 15 where not swallowed, but held in a training camp at the coffee shop. Older women where swallowed or killed unless allowed special circumstances.  You where terrified, Jen was asleep and as you knew she was a heavy sleeper. <br>\r\n<br>\r\nYour final moments flashed before your eyes as Sam and her friends came in.<br>\r\n<br>\r\nMelanie Smalls, a 15 year old girl who you babysat for, Jessica Marshall, your sister and Amy, the girl who was the searcher for the group and finally Sam walked into the room smiling and giggling. They where eager to have all of you in their bellies.</span></div></div>",
            "created":1212382800,
            "id":539352,
            "title":"No escape"
        },
        "15222122":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Each girl gets their own jar",
                "They all split the jars and swallow whoever they grab"
            ],
            "content":"<div class=\"\"><div> <span>The girls quickly opened the first jar, which contained 50 people in it. There where four jars in total with 200 people in total. \"Wait Sam, before we start, should each of us get our own individual jars, or should we evenly split up the people?\" asked Melanie</span></div></div>",
            "created":1212469200,
            "id":539740,
            "title":"The girls begin their meal"
        },
        "152221221":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Amy is next",
                "Sam is next"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets all have our own jars\" said Sam. The room rumbled with the sounds of the girls bellies preparing for heavy digestion. \"Me first please!\" yelled Melanie. She hastily grabbed her jar and layed on Sam's bed. Luckily you wherent in it. She put the jar on her belly and opened the lid. The other three girls watched and gathered around in amazement. Melanie grabbed a boy out of the jar. He kicked and screamed, cursing off Melanie in a high pitched squeaky voice. She tossed him in the air and Melanie opened her salivating maw, just waiting to greet him. He quickly landed on her tongue and she swallowed him down. The girls clapped and smiled. \"I hope he's happy in there, my belly just chose to keep him.\" Her stomach groaned from the entrance of its first occupant. The girls giggled, \"Melanie pull your shirt up so we can see how much it grows,\" said Amy. Melanie pulled her shirt over her grumbling belly just below her breasts. \"Alright, now with that small snack in my tummy, I will hastilly gobble the rest down!\" she said. Melanie touched the jars lip to hers and tilted it forward. The occupants slid down the glass, touching Melanies lips. She opened her mouth a tiny bit and a shrunken boy got his foot caught.  She then opened her mouth as wide as she could, tilting the jar upside down, and her head completely back. Dozens where swallowed in a single gulp, heading straight to Melanie's exposed belly. The other girls cheered \"GO, GO, GO!\" they screamed as many occupants slithered down Melanies esophogus at a single moment. <br>\r\n<br>\r\nSoon the jar was empty and 50 shrunken people where inside Melanie's full, groaning belly. \"Ooooohh,\" she moaned, rubbing her stomach. The girls patted her back, excited for their turns.</span></div></div>",
            "created":1212469200,
            "id":539752,
            "title":"Each girl gets their own jar"
        },
        "1522212211":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Cassandra",
                "Sam"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay\", said Melanie, \"you next, Amy!\"<br>\r\n<br>\r\nAmy cooed. She wanted to enjoy this, which meant making sure the people in the jar knew what a helpless situation they were in! \"I wonder about the differences in taste between you guys!\"<br>\r\n<br>\r\nMeanwhile, the doomed in the jars kept trying to climb up the side, but to no avail.<br>\r\n<br>\r\nAll the girls laughed at their pitiful attempts to escape!<br>\r\n<br>\r\n\"Honestly\", said Amy, \"What are you guys hoping to accomplish? I mean, we're in a small room, and there are numerous giantesses in here, each fully capable of finding, catching and disposing of you in horrible ways! You know, I wonder if I'll be able to see any of your bones when I shit you out!\"<br>\r\n<br>\r\n Amy was satisfied with the taunting. She tilted the jar up, and could see them trying to run up the raised part. They were doing good job, so Amy tapped the bottom of the jar, and this did it! All the people fell into her mouth. She closed it, swallowed, and begun laughing. \"Haha, oh man, they tried so hard! They DID NOT want to die! They're tickling me, squirming around like this!\" Amy felt a pressure rising in her stomach. BURRAP! She let out a huge burp. \"Oops, I just removed a little bit of whatever air is down there!\" She laughed again, then said \"okay, who's next?</span></div></div>",
            "created":1512334920,
            "id":2423527,
            "title":"Amy is next"
        },
        "1522212212":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Your sister",
                "Sam"
            ],
            "content":"<div class=\"\"><div> <span>Sam's turn was next, she searched the jars, looking for one that would adequitely fill her tummy. She spotted yours and licked her lips. \"Hey Jess, I found your brother\" she said, \"and I get to eat him!\" Your sister spotted you in the jar, \"Oh no you dont, I want my brother,\" she said.<br>\r\n<br>\r\nWho gets your jar?</span></div></div>",
            "created":1212469200,
            "id":539761,
            "title":"Sam is next"
        },
        "15222122121":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "She goes later",
                "She goes now"
            ],
            "content":"<div class=\"\"><div> <span>\"I guess its fair, he is your brother,\" said Sam. She handed your sister the jar and she looked over it, smiling at you from outside the glass. \"Aren't you happy, that you are going to be swallowed by me?\" she asked. \"NO! I dont wan to be swallowed at all!\" <br>\r\n<br>\r\n\"Well thats too bad, because you belong to my stomach!\"<br>\r\n\"Hey Jess, are you going to go now or later? Because I am really hungry,\" said Amy. </span></div></div>",
            "created":1212469200,
            "id":539764,
            "title":"Your sister"
        },
        "152221221211":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Amy goes next",
                "Amy has to leave and one of the girls gets her jar"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'll go later, I want to watch your full bellies digest and slosh these guys before mine.\" Amy and Sam smiled, \"Alright then, its my turn,\" said Sam. Melanie fell asleep, her full belly growling hypnotically and the squirming of her tiny occupants lulled her to sleep.<br>\r\n<br>\r\nSam grabbed a jar for herself and layed down on her couch, \"So, I hope you guys like it in my tummy,\" she said. She shook the jar and lifted up her shirt over her bellybutton, pressing the glass onto her lean stomach. \"See this, you are about to be in it.\" Sam rubbed her belly and opened the lid of the jar slowly. She touched it to her lips, giggling. The final sight of the poor students before they where sucked into Sam's mouth was the inside of a hot glass jar. Sam had a large mouthful of about 10 stuffed in her mouth, she giggled while smushing them against her cheeks. Gulp, Gulp Gulp in 3 gulps they where on their way to her tummy, kicking and screaming. Sam's belly grew slightly and it growled as the occupants fell in.<br>\r\n<br>\r\nShe touched the jar to her lips a second time to quickly gulp down the other fourty people in the jar. She started chugging them like a drink, large mouthfuls slithered down her throat and they where clearly visible. Soon the jar had only one man in it, Sam took him out and lifted him over her mouth. He screamed as he dangled, \"Sorry its cramped, theres a party in my tummy!\" She let him go and he fell straight into her throat. Sam patted her belly and let out a large belch. \"Excuse me, that party is going crazy down there.\" But you knew there was no party, 100 students where being mercilessly digested by two girls bellies, soon to become part of them. <br>\r\n<br>\r\nThe girls where so innocent, but they where guilty for 100 murders happening right inside their stomachs.</span></div></div>",
            "created":1212469200,
            "id":539853,
            "title":"Sams turn"
        },
        "1522212212111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Jessica's turn"
            ],
            "content":"<div class=\"\"><div> <span>\"My Turn!\" screamed Amy, as she happily bounced around. She grabbed her jar and eagerly lifted off the lid, lifting the glass lips and touching them to hers. \"Wait Amy!\" said Sam. She staggered to stand up, because of her full stomach. \"Arent you thirsty too?\" Amy smiled at Sam's idea and grabbed a few water bottles. She poured them into the jar and shook it up a bit, just to stir up the cramped aquarium. \"Time for a drink!\" yelled Sam. She grabbed the jar and touched it to Amy's wide open mouth. \"I think this is going to be a wild water slide for you guys,\" she said, \"But you wont be exiting this water slide for a while.\" Sam tipped the jar and a waterfall of people flowed right in with no chance of escape. You could not imaging the horror they must all be going through, half drowned and going down Amy's throat in bundles.<br>\r\n<br>\r\nSoon the jar was empty, Amy patted her extremely full belly in triumph, and each pat echoed with a scream, a gurgle and a splooch of water. <br>\r\n<br>\r\nHer belly was more full than everyone elses, because Amy had 3 water bottles in her tummy too. She layed back and put a hand on her stomach. It let out a squelch and began digestion. Amy soon fell asleep.</span></div></div>",
            "created":1213765200,
            "id":545852,
            "title":"Amy goes next"
        },
        "15222122121111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Jessica knew it was her turn next, the other girls where half asleep, hypnotized into drowziness by the sound of their own bellies churning and digesting the squirming masses that where inside them. Her eyes spotted you, it felt like a knife puncturing you in the gut. <br>\r\n<br>\r\n\"Come on Jessy!\" said Sam, \"Gulp down your jar so I will feel comfy falling asleep knowing you are full like me and the others.\"<br>\r\n<br>\r\nJessica removed the lid from the jar and reached in, her finger dug into the squirming mass of people and she felt around for you. Dozens of shrinkies grabbed onto her fingers and started climbing, only to slip off as she shook her hand. You tried running but where so cramped that you couldnt even see your hand in front of your face. Jessica grabbed your arm with the tips of her fingers and lifted you out of the jar, with two other shunken men clinging to her index finger.<br>\r\n<br>\r\nShe let you out on the bed and held the two unlucky victims over her mouth. Dangling over her hot pink tongue Jessica's hot breath flew over them. You could see the sheer terror in their faces regretting grabbing onto Jessica.<br>\r\n<br>\r\nSoon they where in the air, falling straight into Jessica's throat. A wet slurp showed that they where goners and Jessica shut her mouth immediately. Sliding down her throat the two squirming victim's fates where sealed.</span></div></div>",
            "created":1216011600,
            "id":556083,
            "title":"Jessica"
        },
        "152221221211111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Start your long, sexy journey"
            ],
            "content":"<div class=\"\"><div> <span>\"Haha the first two little guys to meet your belly, I love it Jessy!\" said Sam.<br>\r\nJessica looked over to you, and lifted you up to her face, \"Hey little bro\" she said.<br>\r\n\"How could you do this!\" you screamed, \"Feeding mom to your cult queen! Swallowing two innocent people! How could you do this!?\"<br>\r\n<br>\r\nJessica's face did not change, she looked around the room, all the other girls had fallen asleep, due to the hypnotic sounds of their own bellies digesting their latest meal.<br>\r\n<br>\r\n\"Look hon, I didn't let the girls find you, I wanted you to escape. I didnt know you where in the safe care of your girlfriend and that Sam was to find you. I joined the cult because I wanted to be respected, but I wanted to give you to Jen when I found you.\"<br>\r\n<br>\r\nYou where beggining to understand, \"And the rest of the people in the jar?\" you asked.<br>\r\n\"I'm sorry, I want to save you, but I like swallowing these people as food so they will meet a cruel fate inside my belly too.\" <br>\r\n<br>\r\nYou sighed, thinking that there was no better solution. Jessica got up, with you in hand walking over to Jen's bedroom. She let you down on Jen's bare foot, she was still sleeping. Jessica waved goodbye and left, to go swallow her jar of shrunken people. <br>\r\n<br>\r\nYour only job now, was to walk across your giant girlfriend.<br>\r\n</span></div></div>",
            "created":1216270800,
            "id":556819,
            "title":"Semi-Traitor"
        },
        "1522212212111111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Continue on",
                "Go inside your girlfriends giant pussy"
            ],
            "content":"<div class=\"\"><div> <span>You slid down Jen's foot onto her ankle, Jen giggled in her sleep, probbably dreaming that some one just tickled her foot. Your journey began across Jen's hot legs, you couldnt help but get aroused at your girlfriends perfect figure. Suddenly Jen wiggled again, but this time much harder, you where on top of one of her legs, which was crossed on top of the other, so at your size a fall to the bed could injure you.<br>\r\n<br>\r\nTrying to maintain balance and not trigger Jen's tickle nerves again you walked very slowly. After a while you made it to Jen's knee cap, you wiped the nervous sweat from your forehead. Jen lifted up her legs so now her knees where up and her legs where an upside down V shape from the side. <br>\r\n<br>\r\n\"Hey this saves me a trip down the rest of the way,\" you said. Looking down, you noticed if you slid down Jen's leg you would end up in her shorts. Completely aroused by this you slid down Jen's leg happily and slipped right into her denim shorts. The shorts where small and tight so the only way you could move around was to crawl. Reaching the bottom of her panties, you where thinking of a decision. If you went in, Jen could get aroused and drown you in her liquids, if you didnt, you would miss a one in a lifetime chance. Suddenly the angel and devil of your consience appeared. \"C'mon man go in, its your one and only chance to be inside your girlfriends pussy at this size\" said the Devil. Waiting for the angels reply he stood motionless staring at Jen's panties. \"Damn I agree with the Devil, get inside her panties!\"<br>\r\n<br>\r\nWhat did you do?</span></div></div>",
            "created":1216270800,
            "id":557030,
            "title":"Yum, yum"
        },
        "15222122121111111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You figure out how to climb out",
                "Jen is tickled and turns over onto her belly"
            ],
            "content":"<div class=\"\"><div> <span>Resisting your natural urges to get deep inside your sexy girlfriend, you climbed out of the waist of her shorts. It was now pitch black, except the blue cover of Jen's tank top that was over you. Feeling for surroundings, there was nothing ahead, except for more crawlspace under Jen's tanktop. You figured you where on her belly, which was comforting since you knew that you couldn't get hurt here. You felt around more, like a blind man, touching Jen's soft belly skin. Calmly crawling, not expecting anything an extreme problem that you hadn't expected happened. <br>\r\n<br>\r\nYour feeling had ceased to what was in front of you and without recognizing you slipped, falling down into a deep ditch, your head was slammed onto the smooth surface at the bottom. You recovered and rubbed the aching bump on your head. Your fingers felt around the ditch, sensing that the walls where soft and warm, the place seemed familiar to you. <br>\r\n<br>\r\nThen it dawned upon you that you where in DEEP trouble. You had stumbled into Jen's belly button, which you where very aware was deep. Searching for a surface to grab on, your hands only met smooth walls, that went straight upward.</span></div></div>",
            "created":1216357200,
            "id":557862,
            "title":"Jen's belly"
        },
        "152221221211111111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Continue on"
            ],
            "content":"<div class=\"\"><div> <span>You realized that Jen's bellybutton was deep, but it was only an inch in width, which was your size. Forgetting you where Jason Marksman, star skater and you had a nice pair of skating shoes with grip on them, you should be able to balance your weight and climb with your legs gripping one side and your arms gripping the other.<br>\r\n<br>\r\nUsing sliding motion, your legs stuck to the walls like glue, with the grip. You slowly climbed up, one limb at a time. It was tiresome work, but the only way to get out was using your legs to attach to the walls of your girlfriend's bellybutton. Soon, you gripped the edge and pulled yourself out, wiping the sweat off your face.<br>\r\n<br>\r\nYou had a long journey to go.</span></div></div>",
            "created":1216875600,
            "id":559939,
            "title":"You figure out how to climb out"
        },
        "1522212212111111111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "You continue on",
                "Jen is dreaming of a snack on her stomach"
            ],
            "content":"<div class=\"\"><div> <span>It was still pitch black under Jen's tanktop, there where only a few small squares of lit moonlight showing through the gaps in the sewing. You stood up and began to manuever forward, towards Jen's face. Suddenly, you lost your balance when a large earthquake emitted from beneath you. <br>\r\n<br>\r\nYou recognized it as Jen's belly, and remembered that she had not eaten today when she rescued you. Feeling sympathetic you rubbed her stomach for a few minutes, Jen let out a smile and put her hand on it, next to you. Continuing on, your journey was first priority, but you couldn't stand the fact that Jen was starving herself today.</span></div></div>",
            "created":1216962000,
            "id":560394,
            "title":"Jen's hunger pains"
        },
        "15222122121111111111":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Climb over",
                "Climb through"
            ],
            "content":"<div class=\"\"><div> <span>Still feeling bad for your girlfriend you forged on, to get to her face and wake her up. Suddenly a gurgling noise came from behind and a gas bubble sped up under you, to Jen's mouth. It knocked you over, since you where directly above Jen's sphincter, which separates the esophogus from the stomach. BURRRRRPPP!!!!!!! came from ahead, you couldn't help but giggle that Jen burped in her sleep. <br>\r\n<br>\r\nAfter crawling for a few minutes your head hit something large, and soft. Only guessing and hoping, they where Jen's boobs.<br>\r\n<br>\r\nNow you had a decision, climb over, or through.</span></div></div>",
            "created":1217998800,
            "id":566199,
            "title":"You continue on"
        },
        "152221221211111112":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "content":"<div class=\"\"><div> <span>You layed down, awaiting for Jen to wake up and find you in her belly button. To live happily ever-after with her, in safety. You knew you would never be safe, being less than inch tall was a constant fight for survival, even if you are protected.<br>\r\n<br>\r\nSuddenly your girlfriend started to squirm, giggling in her sleep. You knew this meant that she was dreaming, and also had to be careful if she turned over. Scrambling up the walls your tiny feet barely gripped onto the smooth skin cage. Jen moaned again, and you knew it was only a matter of time before she turned.<br>\r\n<br>\r\nMaking another attempt to climb up, you hit a tickle nerve inside of Jen's bellybutton with your hand. Giggling again she turned onto her side, you slipped out of her bellybutton.<br>\r\n<br>\r\n\"I'm free!!\" you screamed, only to meet the underside of Jen's stomach as she turned again on top of your tiny body, crunching your spine.<br>\r\n<br>\r\nYou where dead</span></div></div>",
            "created":1216530000,
            "id":558291,
            "title":"Giggly girl"
        },
        "15222122121111112":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Go in deeper",
                "Climb out"
            ],
            "content":"<div class=\"\"><div> <span>Her panties where tight, a nice J strap but you could manage to squeeze inside. You rubbed her magnificent pussy lips, they where so soft, warm and moist with sweat. Jen began to moan, wiggling around in her sleep with a smile on her face. <br>\r\n<br>\r\nNow to get a little deeper. You squeezed into the strap of the panties and where now face to pussy with Jens huge vagina. There was warm air coming from it and you could here Jen's juices beginning to brew. There was nothing to stop you from going in, preparing to have the most wild night of your life. You pulled apart the pussy lips, spotting Jen's clit, you gave it a little rub and climbed in. The pussy was tight and Jen's muscles where getting tighter on you as she was more and more pleasured. </span></div></div>",
            "created":1222491600,
            "id":587674,
            "title":"Pussy"
        },
        "152221221211111121":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Stay in the womb until tomorrow",
                "Wait until Jen's juices flow and slide down her pussy"
            ],
            "content":"<div class=\"\"><div> <span>As you climbed in deeper, her pussy began to get tighter. Jen began to moan and rub her clit as her juices began to flow. Her muscles flexed and you where stuck, in your girlfriends delicous pussy. <br>\r\n<br>\r\nAfter waiting for a while for the muscles to tighten up you began to lose air. Quickly thinking that the only place inside Jen's body with air in it, besides her stomach, until she burps, was the womb. You began to climb deeper inside, ignoring the fact that the sticky walls where ripping off your clothes. Jen began to quietly scream and finger herself. Doing this, her finger pushed you inside of her birth chamber.</span></div></div>",
            "created":1222578000,
            "id":588119,
            "title":"Deeper"
        },
        "152221221212":{
            "author_id":"mr.x",
            "author_name":"Mr. E",
            "choices":[
                "She plays with you more",
                "She pops you into her mouth"
            ],
            "content":"<div class=\"\"><div> <span>Jessica says \" I want to eat him now, i want to feel him squirming inside of me before hes digested and has to come out my ass.\"  as your being picked up by her fingers you scream and yell not for your sister to eat you. but all Jessica does is bring you to her lips and say \"Its too bad Jason you really should have hid better if you didnt want end up in your older sisters belly, let me show you whats going to happen to you.\"<br>\r\n<br>\r\nYou look at her blonde hair and into her blue eyes and then her red lips to see her pink toungue come out of her mouth and wrap itself around you and bring you beyond her white teeth and lick your body all around until she spits your body back into her hand.  she says \"thats the first part of your journey heres the more fun part.\"  she then pulls up her shirt and shoves you into her belly button and twists your body back and forth until she leans forward and takes you out again.<br>\r\n<br>\r\nJessica says \"Heres the final part of your journey and my favorite part for you.\"  Jessica smiles even more than before and brings you around back to her tight red shorts and opens it up so that your staring into your sisters gigantic asscrack she shoves your whole body into the center of her buttcheeks and grinds her butt into the chair while the other girls laugh hysterically and she enjoys your body squirming in her butt crack.  after about ten minutes she takes you out of her butt right before you thought you were heading towards her dark brown hole and then she...</span></div></div>",
            "created":1216616400,
            "id":558526,
            "title":"Jessica Wants You Now"
        },
        "1522212212122":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You enter her Salivating mouth and she savours you for a whIle before she decides to swallow you whole and alive to be digested into mush inside of her gorgeous teenage belly.</span></div></span></div>",
            "created":1429898340,
            "id":1968750,
            "title":"She pops you into her mouth"
        }
    },
    "info":{
        "author_id":"gunsblazin88",
        "author_name":"gunsblazin88",
        "brief_description":"A cult of  women have taken over the planet when one of them finds a shrink ray gun",
        "created":1211411940,
        "description":"<td align=\"left\" class=\"norm\">Our world has been taken over by a gigantic cult of girls(ages 15-25) Girls volunteer to join but must be between these ages. <br>\r\n<br>\r\nJason Marksman- You are an average 17 year old guy, with brown hair and blue eyes, simply living in your families house worrying about college and a job. Your world goes black one day as you are knocked out in a terrible fire. You awaken to see that you are 1 inch tall in the burning ashes of your room.<br>\r\n<br>\r\nJessica Marksman- She is your 21 year old preachy and bossy sister, she has blue eyes and bleach blonde hair, also having a slight caring side. After the fire you saw that she had joined the cult. <br>\r\n<br>\r\nJen Marshall- Jen is your obsessive and loving girlfriend who was forced to join the cult by her sister. She is 17 and has bright blue eyes with very dark brown hair. She has chosen to be a against the cult since she loves you so much. <br>\r\n<br>\r\nSam Marshall- Jen's older sister, she is 23 and is very bossy, cruel and selfish. She hates you beyond reason for dating her sister and joined the cult for the only purpose of squishing, chewing, smashing or swallowing you alive. She looks identical to Jen except her hair has dyed blonde streaks in it and she is older<br>\r\n<br>\r\nMarissa Sandars- She is one of your classmates in school, she has chosen to join the cult due to her low self asteem after she asked you  out. Marissa is mad at you for saying no and going out with Jen so she will do anything to break you up. She has brown, almost blonde hair with dark brown eyes. She has a tiny bit of weight on her hips and belly. <br>\r\n<br>\r\nCassandra Gerson- She is the queen of the cult, being 23 years old, she discovered the shrink ray guns formula when she found a sample of a strange rock and mixed it with electricity. Cassandra sits on her throne at the hideout the cult made in a nearby coffee shop. She constantly swallows shrunken men that the other girls have captured and uses the rest when her belly is filled for pleasure. Cassandra has sandy blonde hair and crystal blue eyes.<br>\r\n<br>\r\nMelanie Smalls- Melanie is a 15 year old girl, being the youngest in the group, she is always active and searching for shrunken men to feed to Cassandra. She has dark brown hair and light brown eyes, being the co-searcher for the group.<br>\r\n<br>\r\nAmy Giant- She is the searcher of the group and leads all investigations to find shrunken people herself with Melanie tagging along. She is really a giant, being the tallest in the group, she is asian with long red streaks going down her brown hair and is 20 years old. She is prohibited from eating or killing shrunken men on trips, but she may tend to bend the rules<br>\r\n<br>\r\nOkay so now thats over with let me go over a few rules<br>\r\nNo character adding unless you ask me<br>\r\nOnly humans<br>\r\nOnly Giant women, not giant men<br>\r\nNo gay stuff<br>\r\nPlease try and be descriptive<br>\r\nOnly ages 15-25 girls allowed in the cult<br>\r\nThis is a fetish story, but please try and make it exciting, it has a plot too<br>\r\nHave Fun!<br>\r\n<br>\r\nAlso Please readers become writers because I have written all chapters so far. Please if you can make a contribution to the story</td>",
        "id":1428684,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1529801040,
        "modified":1529801040,
        "pretty_title":"Shrunken earth"
    }
}