{
    "chapters":{
        "1":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "A human!",
                "A furry!",
                "A pony! (Anthro)",
                "A Pokemon! (Anthro)",
                "Something else!"
            ],
            "content":"<div class=\"\"><div> <span>Here's how we're going to do things: After the initial selection of exactly what you're babysitting, you'll be given a series of storyline 'slots' for you to use. For instance, you choose human, and then you use one of the free choices there to start your story off. This way, the need for choice chapters will be eased.<br>\r\n<br>\r\nSo, let's not waste any more time - what exactly do you want to babysit?</span></div></div>",
            "created":1489208400,
            "id":2288044,
            "title":"Start"
        },
        "11":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Slot 1",
                "Slot 2",
                "Slot 3",
                "Slot 4",
                "More slots!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keeping things simple, hm? Well, here are your story slots. Try not to use them up too quickly~</span></div></span></div>",
            "created":1489208400,
            "id":2288046,
            "title":"A human!"
        },
        "111":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "An eight year old boy, named Lewis",
                "An nine year old girl, named Emily"
            ],
            "content":"<div class=\"\"><div> <span>This is Jenny, she's nineteen years of age, and is about to babysit someone for the first time.  She loved looking after kids when her mother had done the same before her.  A blonde headed girl had to go through some advice, just as her mother wanted to make sure she had to look after someone well and all it is needed.<br>\r\n<br>\r\nOf course it can be hard to deal with these at first, but once she would greet a kid, she'll be fine and get along with it for the rest of her life, just as her mother had that same feeling before.  Of course, they're getting paid too, and usually, they looked at the newspapers and more to see if there's anyone wanted some help, whilst the parents are away.<br>\r\n<br>\r\nIt didn't hesitate her to make that choosing, and with that, she had dialed the number from the paper, hoping to see if these are available still?  It took a couple of minutes and hanged up the phone, just by the look of that smile to her face, as if she's about to get experience for the first time, and see how it goes from there.<br>\r\n<br>\r\nIt was Friday night, and Jenny's mother is dropping her off to the address she's supposed to go.  They've reached to the point, which the house is like a bungalow with no stairs, and surely enough, Jenny thinks handling one kid would do for her to start with.<br>\r\n<br>\r\n\"Now don't forget to phone me when you're done honey.  Just enjoy yourself, okay?\"  Jenny's mother giving some encouraging words to her only daughter.<br>\r\n<br>\r\n\"Don't worry, Mom!  I will!\"   Jenny replied, and gets out of the car, before she waves and seeing her mother driving away from its distance, leaving just her and a kid to look after.<br>\r\n<br>\r\nSo, she takes her deep breath and walked towards the doorstep and ring the doorbell, hoping for the best that is for a matter.  She can hear someone coming towards it, and opened the door to see it was a kid she's about to babysit.  That kid in question is who?</span></div></div>",
            "created":1505365200,
            "id":2385560,
            "title":"This is Jenny's story"
        },
        "12":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Slot 1",
                "Slot 2",
                "Slot 3",
                "Slot 4",
                "More slots!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In the mood for something a little more exotic?</span></div></span></div>",
            "created":1489208400,
            "id":2288047,
            "title":"A furry!"
        },
        "121":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Grover Groundhog ",
                "Hippety Hopper the kangaroo.",
                "Viewer's choice."
            ],
            "content":"<div class=\"\"><div> <span>Before this story starts you the viewer get to choose from 2 out of 3 characters that will become humongous gigantic gargantuan as in big. And here are 2 of those 3 characters that you the viewer get to choose from.<br>\r\n<br>\r\nFirst up is Grover Groundhog from Warner Bros. Animation as this little baby groundhog soon enough grows into a gentle giant of a baby groundhog that goes on an adventure or two.<br>\r\n<br>\r\nNext up is Hippety Hopper the kangaroo from Warner Bros. Animation as this little baby kangaroo ends up becoming a giant sized baby kangaroo that just wants to have fun while trying not to terrorize anyone he tries to befriend.<br>\r\n<br>\r\nViewer's choice: You the viewer get to come up with your own little furry character that eventually grows into a giant furry of some sort.<br>\r\n<br>\r\n</span></div></div>",
            "created":1489467600,
            "id":2289723,
            "title":"Slot 1"
        },
        "122":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "Fur (mammal)",
                "Feathers (avian)",
                "Scales (reptile)"
            ],
            "content":"<div class=\"\"><div> <span>You pull up to the Farrington's driveway on your bike and take a moment to stare. The neighborhood around it isn't excessively wealthy, but after checking the address to confirm, it's clear that the house you're searching for is the largest one on the block. Rising up at least a story above the neighbors and taking up a lot wide enough to hold any two of the other homes without either of them touching the other, it looms intimidatingly above you.<br>\r\n<br>\r\nThough surprised that anyone living in such a house would need to post an ad for babysitters instead of hiring their own nanny, the fact that they don't means you should be well compensated for your services. You get off and walk your bike up the driveway to the front of the house.<br>\r\n<br>\r\nIn so doing, you find that, if anything, your initial impressions of the place were underestimating its stature! Preconceptions and optical illusions tricked you into thinking that the house itself was merely one of ordinary design, just with more rooms. As you get closer, though, you realize that every feature of the house itself is built to a larger scale than any you've seen before. Your throat dries a bit as you park your bike and walk up to the door, which is at least two feet taller than what you're used to. <br>\r\n<br>\r\nYou have to reach up in order to hit the doorbell. Once you do, a deep voice rumbles from inside, \"One moment! I'm coming!\" You recognize the voice from the telephone when you first responded to the ad. At the time, you'd been taken off guard by the deep, booming tone. Hearing it directly, though, you can feel the bass in your bones, even through the closed door. Big, plodding footsteps approach from inside, and when it opens you are greeted by the sight of a huge man covered in...</span></div></div>",
            "created":1550898000,
            "id":2621710,
            "title":"Approaching the house"
        },
        "1221":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "Canine",
                "Feline",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Even though you had reflexively looked up when you heard him approach, it still wasn't high enough. He might not quite need to duck his head to get out through the already-huge doorway, but he's so imposingly massive that he LOOKS too large to be contained from your puny perspective. The way that muscles on top of muscles seem to be barely contained by the suit he's wearing only adds to this impression, as does the bulge that look like he's smuggling soccer balls in his trousers.<br>\r\n<br>\r\nYou hadn't known many anthros in your life, and the few you did were nothing like this, but everyone knew that there were \"special\" cases. Some anthros (and it was ALWAYS anthros) were just naturally bigger and stronger than anyone else could ever hope to be. Often, these special cases, dubbed \"macros\", \"hypers\" or \"alphas\" by various people had some sort of special ability as well. But no matter how many pictures or videos you had seen in the media, it wasn't enough to prepare you for the overwhelming presence of being next to one!<br>\r\n<br>\r\nFortunately for you, Mr. Farrington sounds more amused than insulted by the fact that you've been staring in shock this entire time, but haven't even looked up to meet his eyes yet. With a deep, rumbling chuckle, he asks, \"Yes, can I help you?\"<br>\r\n<br>\r\n\"Oh! S-sorry, I'm--\" you start to stammer once you realize how rude you've been.<br>\r\n<br>\r\n\"Ah, the babysitter,\" he interrupts upon recognizing your voice. Stepping aside, he gestures for you to enter. You do so, being careful not to brush against anything inappropriately, only to nearly walk into a veritable wall of soft, bouncy curves.<br>\r\n<br>\r\nThe mistress of the house is about half a head shorter than her husband, which still makes her tower over you, and the vast expanse of bosom spilling out of her evening dress would make it difficult for her to see you from such a height. \"Oh, the babysitter's here?\" she asks while putting on some earrings. \"Thank goodness they're more punctual than the last one. I just need to put on a few finishing touches, dear, so why don't you introduce them to our little bundle of joy?\"<br>\r\n<br>\r\n\"Of course, sweetness,\" Mr. Farrington replies, shutting the door behind you. You feel like a child yourself, with the interior of this house scaled to fit these furry titans who manage to make even that feel cramped just by virtue of their incredible proportions. You can't even form words; all you can think to do is step back far enough to get a look at their faces and determine that they are...<br>\r\n</span></div></div>",
            "created":1550898000,
            "id":2621711,
            "title":"Mammal"
        },
        "12212":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "Domesticated breed",
                "Mid-sized feral cats",
                "Large cats"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of felines are they?</span></div></span></div>",
            "created":1550898000,
            "id":2621714,
            "title":"Feline"
        },
        "122121":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "Calico",
                "Siamese",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Any specific breed?</span></div></span></div>",
            "created":1550898000,
            "id":2621715,
            "title":"What breed?"
        },
        "1221212":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "...son.\"",
                "...daughter.\"",
                "...child.\" (herm option)"
            ],
            "content":"<div class=\"\"><div> <span>The giant siamese cat grins knowingly down at you as he guides you to the living room. \"This is your first time meeting people like us,\" he says. It isn't a question, just an observation of a blatantly obvious fact. Nevertheless, you nod your head, feeling your body shiver from some primal reaction to being in the presence of such massive anthros. In an understanding tone, he rumbles, \"It's alright, you'll get used to it. Besides, you'll be babysitting someone who's a more manageable size.\"<br>\r\n<br>\r\nHe chuckles to himself, mischief in his almond-shaped eyes. When you reach the living room, you find a single feline figure watching cartoons on a television with a screen the size of your own house's big picture window. Their relatively little legs dangle over the front of a couch bigger than your parents' car without touching the ground as they sit and stare transfixed by the program.<br>\r\n<br>\r\nMr. Farrington clears his throat. \"Hey kiddo, come meet your babysitter.\" The siamese kitten reluctantly turns and stands on the couch in order to peer over the back at you as Mr. Farrington says to you, \"This is our...</span></div></div>",
            "created":1550898000,
            "id":2621717,
            "title":"Siamese"
        },
        "12212121":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "1-5 years old",
                "6-10 years old",
                "11-13 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age is he?</span></div></span></div>",
            "created":1550898000,
            "id":2621718,
            "title":"Age"
        },
        "122121212":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "...other boys.\"",
                "...girls.\"",
                "...herms, for some reason.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Hullo,\" the boy says, his high, youthful voice a sharp contrast to the booming bass of his father. You wave back to him, and he shyly ducks back out of view to resume watching cartoons.<br>\r\n<br>\r\nMr. Farrington chuckles and pats you on the shoulder. \"Thanks for answering our ad,\" he says quietly so as not to interrupt the show. \"We had a few other applicants, but little Sammy can be a handful sometimes, and he's always more friendly around...</span></div></div>",
            "created":1550898000,
            "id":2621719,
            "title":"6-10 years old"
        },
        "1221212121":{
            "author_id":"haohan",
            "author_name":"Haohan",
            "choices":[
                "\"play a game\" (or others)",
                "\"watch a movie\""
            ],
            "content":"<div class=\"\"><div> <span>\"He just feels more at ease around other boys, so you should get along pretty well. Now, we pre-made some meals, so all you have to do is heat them up...\"<br>\r\n<br>\r\nYou nod, feeling a little more confident to know that Sammy isn't a behemoth like his parents, even though a small part of you deep down is as awed by the titanic cats as you are intimidated. The initial shock has started to pass, but as Mr. Farrington guides you around the house, showing you the kitchen and dining room, you find it hard to focus on what he is saying. His sheer size and strength and overwhelming manliness has your heart pounding. As soon as those thoughts start to manifest, though, you try to push them away.<br>\r\n<br>\r\nAfter all, you didn't arrive with any plans to play out some trashy story about a babysitter getting seduced by an older man... and even if you did, the one look you got at Mrs. Farrington told you that Mr. Farrington doesn't have any need to play the field. The huge siamese woman was a mountain range of feminine curves, and while you've never thought of yourself as 'too small' before, by comparison your slightly-above-average length and height that barely reached to her waist.<br>\r\n<br>\r\nTo say nothing of the fact that, while you might be entertaining some curiosity toward the massive bulge in Mr. Farrington's pants, it wouldn't be the cat that got killed if you actually tried to fit that beast inside you. God, why does the thought of attempting it have to be so enticing, though? You're so caught up in thought that you get startled when he suddenly places a small spray bottle on the table beside you.<br>\r\n<br>\r\n\"--spritz on the nose will get him to stop if you need him to. He doesn't really mean anything by it, but he's at that age where he's going to test his boundaries while we're away. Fortunately, that's the only thing you really need to watch out for. If he acts out in any other way, you actually don't want to use this, but whatever you do, don't lose track of it. Easy, right?\"<br>\r\n<br>\r\n\"Oh, r-right!\" you exclaim, scrambling to look like you were actually paying attention and not having wildly inappropriate daydreams the whole time he was talking. Plastering a fake smile on your face, you say, \"Don't worry about a thing, Mr. Farrington, you just have a good time.\" Anything to try and keep the topic away from how distracted you were, let alone why.<br>\r\n<br>\r\nWhatever the giant siamese thinks, he looks down at you with an enigmatic grin and a glint in his almond-shaped eyes. \"Alright then,\" he rumbles before his ears perk and Mrs. Farrington comes into view. \"Just in time, dear. I just finished giving Cassie here the run-down,\" he says, referring to you by name. He walks over to give a kiss to his ravishing wife, who looks like she's one deep breath away from exploding out of the dress she's squeezed into. The two of them go say good night to their son before driving away in a car the size of a small bus, and as you watch the headlights fade into the distance, you feel like you finally have room to breathe as it's just you and young Sammy in the oversized house for the next several hours.<br>\r\n<br>\r\nYou go into the living room where Sammy is still watching his cartoon, hugging a pillow while he does so. You decide to sit down and watch with him for the time being. You aren't that interested in the cartoon itself, but it gives you a chance to relax, even as your legs dangle off the floor from where you sit in a way that they haven't since you were around Sammy's age.<br>\r\nOccasionally you catch him looking your way, and you smile reassuringly back at him until he turns his attention back to the show.<br>\r\n<br>\r\nEventually, the cartoon ends. While the credits roll, you ask, \"So, Sammy, what do you want to do next?\"<br>\r\n<br>\r\nThe siamese kitten-boy looks over to you and replies, \"I wanna...</span></div></div>",
            "created":1590844620,
            "id":2843148,
            "title":"...other boys.\""
        },
        "12212121212":{
            "author_id":"haohan",
            "author_name":"Haohan",
            "choices":[
                "A romance film with some very steamy parts",
                "An odd cartoon that is you aren't sure is okay for kids"
            ],
            "content":"<div class=\"\"><div> <span>You smirk a bit as the kitten excitedly asks to watch a movie. The kid sure likes his TV, you think to yourself, though you don't have any complaints about it. It just makes your job easier if he spends the whole time watching the screen, so you get up and walk over to the shelves of DVDs set up next to the television.<br>\r\n<br>\r\n\"Whoa, your parents have a huge as library here,\" you muse as you glance over the oversized shelves, the highest of which you can just barely reach. They even have their collection sorted by genre like a real video store, so you peruse the children's movies arranged down low. \"So bud, what are you in the mood for, Sammy? LEGO Movie? Spiderman?\"<br>\r\n<br>\r\n\"Nuh-uh,\" he says, shaking his head while he hugs his pillow. He tells you what he wants to see, and it's...<br>\r\n</span></div></div>",
            "created":1590844980,
            "id":2843153,
            "title":"\"watch a movie\""
        },
        "1221212122":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "...have dinner!\"",
                "...watch a movie!\"",
                "...play a game!\""
            ],
            "content":"<div class=\"\"><div> <span>\"He just feels more at ease around girls, so you should get along pretty well. Now, we pre-made some meals, so all you have to do is heat them up...\"<br>\r\n<br>\r\nYou nod, feeling a little more confident to know that Sammy isn't a behemoth like his parents, even though a small part of you deep down is as awed by the titanic cats as you are intimidated. The initial shock has started to pass, but as Mr. Farrington guides you around the house, showing you the kitchen and dining room, you find it hard to focus on what he is saying. His sheer size and strength and overwhelming manliness has your heart pounding. As soon as those thoughts start to manifest, though, you try to push them away.<br>\r\n<br>\r\nAfter all, you didn't arrive with any plans to play out some trashy story about a babysitter getting seduced by an older man... and even if you did, the one look you got at Mrs. Farrington told you that Mr. Farrington doesn't have any need to play the field. The huge siamese woman was a mountain range of feminine curves, and while you've never thought of yourself as 'too small' before, by comparison your slightly-above-average bust and hips barely count as foothills.<br>\r\n<br>\r\nTo say nothing of the fact that, while you might be entertaining some curiosity toward the massive bulge in Mr. Farrington's pants, it wouldn't be the cat that got killed if you actually tried to fit that beast inside you. God, why does the thought of attempting it have to be so enticing, though? You're so caught up in thought that you get startled when he suddenly places a small spray bottle on the table beside you.<br>\r\n<br>\r\n\"--spritz on the nose will get him to stop if you need him to. He doesn't really mean anything by it, but he's at that age where he's going to test his boundaries while we're away. Fortunately, that's the only thing you really need to watch out for. If he acts out in any other way, you actually don't want to use this, but whatever you do, don't lose track of it. Easy, right?\"<br>\r\n<br>\r\n\"Oh, r-right!\" you exclaim, scrambling to look like you were actually paying attention and not having wildly inappropriate daydreams the whole time he was talking. Plastering a fake smile on your face, you say, \"Don't worry about a thing, Mr. Farrington, you just have a good time.\" Anything to try and keep the topic away from how distracted you were, let alone why.<br>\r\n<br>\r\nWhatever the giant siamese thinks, he looks down at you with an enigmatic grin and a glint in his almond-shaped eyes. \"Alright then,\" he rumbles before his ears perk and Mrs. Farrington comes into view. \"Just in time, dear. I just finished giving Cassie here the run-down,\" he says, referring to you by name. He walks over to give a kiss to his ravishing wife, who looks like she's one deep breath away from exploding out of the dress she's squeezed into. The two of them go say good night to their son before driving away in a car the size of a small bus, and as you watch the headlights fade into the distance, you feel like you finally have room to breathe as it's just you and young Sammy in the oversized house for the next several hours.<br>\r\n<br>\r\nYou go into the living room where Sammy is still watching his cartoon, hugging a pillow while he does so. You decide to sit down and watch with him for the time being. You aren't that interested in the cartoon itself, but it gives you a chance to relax, even as your legs dangle off the floor from where you sit in a way that they haven't since you were around Sammy's age.<br>\r\nOccasionally you catch him looking your way, and you smile reassuringly back at him until he turns his attention back to the show.<br>\r\n<br>\r\nEventually, the cartoon ends. While the credits roll, you ask, \"So, Sammy, what do you want to do next?\"<br>\r\n<br>\r\nThe siamese kitten-boy looks over to you and replies, \"I wanna...</span></div></div>",
            "created":1550898000,
            "id":2621720,
            "title":"Special instructions"
        },
        "12212121222":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "...a weird old animated movie that you're not sure was made for kids.",
                "...a monster movie!",
                "...a romance movie with a steamy love scene?"
            ],
            "content":"<div class=\"\"><div> <span>You smirk a bit as the kitten excitedly asks to watch a movie. <i>The kid sure likes his TV,</i> you think to yourself, though you don't have any complaints. It just makes your job easier if he spends the whole time watching the screen, so you get up and walk over to the shelves of DVDs set up next to the television.<br>\r\n<br>\r\n\"Man, your parents have a real library here,\" you muse as you glance over the oversized shelves, the highest of which you can just barely reach. They even have their collection sorted by genre like a real video store, so you peruse the children's movies arranged down low. \"So, what are you in the mood for, Sammy? <i>LEGO Movie</i>? <i>Frozen</i>?\"<br>\r\n<br>\r\n\"Nuh-uh,\" he says, shaking his head while he hugs his pillow. He tells you what he wants to see, and it's...</span></div></div>",
            "created":1552107600,
            "id":2628051,
            "title":"Movie Night"
        },
        "122121212221":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "... grab the remote and shut it off immediately!",
                "... look to Sammy, only to get another shock!",
                "... let the movie play, trying to pretend nothing's wrong."
            ],
            "content":"<div class=\"\"><div> <span>\"Blimpy the Frog!\" Sammy exclaims with a wide grin on his kittenish face. \"That one's my favorite!\"<br>\r\n<br>\r\nHuh, you've never heard of that one. But of course it's been several years since you really paid attention to kids' movies. You bend over and get on all fours so you can check out the bottom shelf more closely. After several seconds with no luck, Sammy stammers, \"U-um... it's not down there...\" You look back over your shoulder, and see the little guy is blushing for no reason.<br>\r\n<br>\r\nThen you realize you'd been sticking your butt out toward him, and feel yourself getting... well, a little annoyed, but also amused. You've seen it in other kids around his age where they start getting pervy without really knowing why they're doing it. And as a babysitter, you've had to deal with much worse examples of it from kids much more rambunctious than Sammy.<br>\r\n<br>\r\nStill, you're not in the mood to give the kid a show, so you roll your eyes and stand up again. \"Okay, where is it, then?\"<br>\r\n<br>\r\nThe kitten raises a hand and points up toward the top shelf. \"Up there, in the black box.\" Sure enough, when you look up you see a plain black DVD case among the other movies. You have to stretch up on your tip-toes to get it, but you manage to pry it away from the others and see that instead of a proper label, it simply has some masking tape over the front with \"Blimpy the Frog\" written in marker. Likewise, when you open it up, the disc itself is a simple, generic DVD.<br>\r\n<br>\r\n<i>Huh, must be a bootleg,</i> you muse to yourself as you pop it into the player without thinking too much about it. Sure enough, there's no menu. It simply starts the movie right from the beginning, and based on the look and the sound quality, it was obviously ripped from an old VHS tape or something. And while you still can't place it, it looks like something made way back in the 60s or 70s. As far as you know, it could be older than Sammy's parents!<br>\r\n<br>\r\nWhile there's a lot you don't know about this movie, though, you soon come to the conclusion that it doesn't really matter, and you dim the lights to see the picture better before hefting yourself up onto the sofa a few feet away from Sammy.<br>\r\n<br>\r\nThe movie starts out innocently enough. The main character, Blimpy, is a small and timid frog anthro in high school. He seems to be the typical \"loser\" protagonist, getting overlooked by girls he's attracted to and bullied by the jocks led by an alpha ox anthro. It doesn't take long before you notice that a lot of these characters have a very sexualized look to them. The smallest of the popular girl clique Blimpy has his eye on has proportions much like yours, the others having exaggerated curves that make their clothes look painted on (beyond being cartoons, that is). And the ox... absolutely NO effort has been made to hide the massive bulge in his pants, along with the detail put on his huge, muscular body.<br>\r\n<br>\r\nYou're glad that you decided to turn the lights low, because if Sammy looked over right now with full light, he'd easily see you blushing at the sight on the screen. You almost make a grab for the remote to stop it right there for the sake of Sammy's innocence (and to hide your own embarrassment) but hold yourself back. After all, Sammy's parents are alphas who are even more sexualized than the cartoon just by standing around! It's probably just a case of being from an earlier generation or an attempt to depict an alpha without the 'whitewashing' of reduced proportions that's so common these days. That's what you tell yourself as you let the movie play.<br>\r\n<br>\r\nA while later, though, you find your doubts returning.<br>\r\n<br>\r\nAs the story progresses, it's established that Blimpy has a unique quirk. Whenever he gets nervous or afraid, he starts to hyperventilate. This causes him to inflate like a balloon, usually in some way that corresponds to the situation he's in. Getting called on to answer a teacher's question while he's distracted from daydreaming about one of the sexy girls from before, he has a panic attack that makes his head swell up while he tries to stammer out an answer. Getting yelled at by the gym teacher while running laps in PE makes him start panting extra hard, and he blows up into a bottom-heavy state that can barely waddle along. All of it's pretty goofy cartoon antics, though there's something about it that makes you nervous. Something about the tone of it all that you just can't quite place.<br>\r\n<br>\r\nThat nervousness comes to a head about halfway through the film when the ox bully catches Blimpy talking to the jock's girlfriend. The captain of the cheerleading team, of course, because cliches are timeless. So, in retribution, the ox grabs Blimpy and stuffs him into one of the lockers in the women's changing room.<br>\r\n<br>\r\nWhat follows is a scene clearly NOT intended for children as Blimpy and the viewers are both shown a prolonged scene of Blimpy's female classmates coming in and stripping down to their underwear! Your jaw drops right in time with Blimpy's as the scene turns into some kind of softcore porno of exceptionally well-endowed teenage girls cavorting around in bras and panties, and some even less than that!<br>\r\n<br>\r\nWhat's more, the sight has Blimpy panting rapidly like a dog on a hot Summer day. The little frog's eyes are right up against the locker door's ventilation slits, pervertedly soaking in all the naked flesh (and fur in the case of the anthro girls) on display. And of course, along with his panting there's a sound like a balloon stretching as it inflates, and you start to see a round shape rising up and filling the space below his chin. At first, you think it's his stomach bloating up, flooding the cramped locker and threatening to smother him.<br>\r\n<br>\r\nThat's almost immediately disproven, though, because just when it seems like he's going to suffocate, the internal pressure causes the locker door to explode off its hinges, and not one but TWO massive, pale green orbs burst out into the locker room! The girls scream in shock while you simply stare, needing a moment to put together that what you're staring at are a pair of giant frog testicles, and that he's started panicking again, inflating them bigger and bigger with each breath!<br>\r\n<br>\r\nAs the twin spheres keep Blimpy himself hidden, the ballooning frog balls catch a couple of the near-naked girls by surprise and end up pinning them against the lockers on the other side. Their arms flail around, futilely beating against Blimpy's sac, and the view cuts to Blimpy's face as his panting is made all the more perverted by the look of blissful lewdness plastered all over his face!<br>\r\n<br>\r\nAs the other girls in the room either run away screaming or rush in to try to manhandle the frog balls off of the two who are trapped, you feel like you should probably do something, yourself. Your own breath is short, your heart pounding in your chest at the sight in front of you, and you...</span></div></div>",
            "created":1554526800,
            "id":2640760,
            "title":"What kind of cartoon IS this?"
        },
        "1221212122212":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "He asks \"Do you want to play with them?\"",
                "He points at your chest and giggles. \"You're like Blimpy!\"",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You look over toward Sammy, wondering if he really understands what's shown on the screen, and how inappropriate it is for a kid his age. A look at his smiling face tells you that he doesn't. He seems like he's just laughing and having a good time watching the silly faces Blimpy makes while the frog's ballooning testicles fill up the locker room. While the cartoon women try to punch back the growing orbs, Sammy playfully mimics them by slapping the pillow he'd been hugging this whole time like a pair of bongos.<br>\r\n<br>\r\nIt's right at that moment when you realize, (wait, 'pair'?) You take another look and gasp when you see that what you had mistaken for a pillow was, in fact, an extension of Sammy's pajamas. A necessary alteration to fit around and clothe an absolutely unreal crotch bulge!<br>\r\n<br>\r\nNo, calling it a bulge doesn't even do it justice. The scrotum and sheathed penis that are contained in his pajamas look like they could weigh as much as the rest of his entire body. If what you're seeing is real, he could be even more endowed than his hyper stud father!<br>\r\n<br>\r\nThe shock is such that you start hyperventilating. Your mind reels and you feel dizzy, even as you try to comprehend what you're seeing. All the while, Sammy keeps thumping his little hands against his gargantuan sac, which only seems to be swelling larger in response to the abuse, pulling the fabric of his pajamas taut around the mass inside.<br>\r\n<br>\r\nAnd then Sammy looks back at you. He sees you hyperventilating and grins with an equal measure of angelic innocence and devilish mischief.</span></div></div>",
            "created":1586131860,
            "id":2813901,
            "title":"Those aren't pillows!"
        },
        "122121212222":{
            "author_id":"knoxfan1316",
            "author_name":"knoxfan1316",
            "choices":[
                "The old fashioned kaiju monster movie",
                "The 50-foot man/woman/anthro",
                "The strange, different movie..."
            ],
            "content":"<div class=\"\"><div> <span>A monster movie was a little different but nothing you would object you personally. You browse around the collection and come across a small set of monster movies, each was more unique but somewhat similar.<br>\r\n<br>\r\nThe first was an old fashioned kaiju monster movie; a giant radioactive monster that would rampage in the streets as they destroyed buildings and fought other monsters that would try and fight for the destructive conquest that only kaiju monsters are known for.<br>\r\n<br>\r\nThe second was the 50-foot monster movie. But the difference was that the monster was once a person or anthro, who had grown to enormous size and uses his or her new height to get an upper hand against those that wronged him or her. The potential for growing bigger could happen, according to the description on the back.<br>\r\n<br>\r\nThe third movie was something that was literally hard to describe. Not much was known about it, but it seems like something or someone becoming a giant rampaging beast. There's very little information about it and not much to be shown in the images aside from the poster hinting something dangerous, but it seemed relatively harmless to watch.<br>\r\n<br>\r\nYou take the three films and lay them on the table for Sammy to look at, giving him an idea of what he wants to watch.<br>\r\n<br>\r\n\"Well kiddo,\" you say as you present him with the films, \"what do you wanna watch?\"<br>\r\n<br>\r\nSammy looks over the three and begins to think it over a little bit. As he makes his decision, he pulls the movie up in the air with a big smile. What did he choose?</span></div></div>",
            "created":1570338000,
            "id":2728956,
            "title":"...a monster movie!"
        },
        "12212122":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "1 - 5 years old",
                "6 - 10 years old",
                "11 - 13 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is she?</span></div></span></div>",
            "created":1582508940,
            "id":2791907,
            "title":"Age?"
        },
        "122121222":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "young man",
                "young woman",
                "human (if you don't feel like being gender specific just yet)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"Hewlllo\" the young female feline say's with a high pitch voice that had a slight booming to it. You gave a wave to her, In which she returns that response with a shy duck down to return to her TV program. And seeing only the huge couch you think to yourself that she must be about your height or slightly shorter. which also makes you think on what the father say's about how she would be a more manageable size. Which your not that much sure about now. But you did already commit to this you accept as you look up at the father and see him chuckling out loud.<br>\r\n<br>\r\n\"*laughter* yea she can be quite a shy kid at first. But don't worry about it to much, she will warm up to you quickly\" Mr.Farrington say's to you through chuckles. Which are stopped as you get startled by a BOOMING voice that appears behind you that Mr.Farrington gives no such reaction to. Turning around you also hear the stomping of boot's and then your given the full view of the tall Mrs.Ferrington. Who seeing her husband chuckle with you at is side say's \"Oh I hope your not giving this. ...... a to hard of a time\".</font><br>\r\n<br>\r\n<br>\r\n(Fill in the ......)</span></div></div>",
            "created":1582510500,
            "id":2791920,
            "title":"A daughter around 6-10 years old"
        },
        "1221212221":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "wow your short",
                "let's play a game",
                "now can we eat"
            ],
            "content":"<div class=\"\"><div> <span>The husband who has began to stop his chuckling look's over at his beautiful wife and say's in his booming voice \"Oh no dear, just chatting is all. But you looking like your all ready\". Mr.Farrington say's to his wife as he gets up and strolls over to her. He grab's her by the waist and give's her a big kiss. In which she responds with \"oooo baby stop we gotta save for tonight *giggles*\". And then after a slight bit of laughter between the two of them. Mrs.Farrington turn her attention towards you after telling Mr.Farrington to go start the car. She walk's with you to her front door and then bend's over to get to eye level which gives you a good view at her cleavage that you do your best not to stare at. <br>\r\n<br>\r\nShe say's to you \"All the emergency phone numbers and descriptions with them are attached to the fridge. And we left TV dinners in there for you guys so help yourself.  And here is a list of our daughter Naomi's needs and what she can't have and such. If anything goes a stray just revert to the list, okay. But I'm sure you two will just have fun. So don't worry yourself to much. We should be back within 5 hour's or so\". She then embraces you with a massive hug that allows to feel just how much stronger she is compared to you. And be faced into her cleavage. Then pulling away she head's out closing the front door behind her with a wave good bye.<br>\r\n<br>\r\nSeeing that they left you fold up the paper list into your pocket. You then turn to go head over to the little girl. Looking around as you made your way towards the living you were amazed at how big everything was. You felt like a child, always seeing things as bigger then they actually are. And you felt even stranger as you entered the living room that you were in a few minutes ago, looking around  you felt like something is different. The couch and other thing's in the room somehow seemed bigger, but since they already felt huge before you really couldn't tell. You begin to think that everything in the room somehow grew and then you get another crazy thought of maybe you somehow shrunk. But both seem like irrational ways of thinking, you must just not have noticed before just how big all the furniture really was you laughed off the thought's. As you go to say hi to Naomi.<br>\r\n<br>\r\nNaomi who has noticed you coming in and just decided to get over her shyness get's off the couch to greet you. Seeing her get up you say \"Hey Naomi is there something you want to....\" you stop in mid sentence as you see Naomi approaching you. In front of you see Naomi a ten year old feline girl wearing a short sleeve white blouse and pink skirt. And as she puts a big smile on her face to greet you with saying \"Hey...\". You are shocked at just how tall she really is compared to you. Knowing full well that before she felt around your height but now you are looking up at her coming up to her chest.<br>\r\n<br>\r\nYou notice just how much taller and stronger her body features are to you. You are not really sure on what's going on, did you shrink, no that is crazy you say to yourself. As Naomi who has just been waiting for you to answer her say's \"Hewo mr. you okay?\". Which shakes you out of it as you respond with \"Yea, sorry it's nothing\". Naomi then smiles again and say's \"Good, ...\"<br>\r\n<br>\r\n(what does she say next)</span></div></div>",
            "created":1582519080,
            "id":2791973,
            "title":"young man"
        },
        "12212122212":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "play house",
                "play hide and seek",
                "just watch a movie instead"
            ],
            "content":"<div class=\"\"><div> <span>\"...Let's play a game!!\" She says to you with a big smile. With you still astonished about how much bigger she is to you just try to play natural. And you nervously say \"...Okay.... What game..... do you have in mind?\". In which the Naomi thinks to herself for a moment of what could be a fun game to play. <br>\r\n<br>\r\nAll the while she towers over you with your eye level at this point being at Naomi's belly button. You just look up and watch as the Naomi slightly thinks to herself and then she finally comes up with an idea of what to do \"Let's...\"</span></div></div>",
            "created":1582562580,
            "id":2792217,
            "title":"let's play a game"
        },
        "122121222122":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "she finds you right away",
                "she takes about 10 to 20min's",
                "she ends up not being able to find you and goes off to eat"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">\"...play hide and seek. I'll hide first and you count then seek me. Okay?\" Naomi say's to you in a cute Booming tone. You consider how big the house is and how much you don't want to be running around it all night. But seeing that you want to try to allow her to have fun. You say \"Sure you go hide, just be careful not to break anything\" In which she nods her head yes and motions you to close your eyes which you do.<br>\r\n<br>\r\nAnd as soon as you do you hear loud stomping as Naomi leaves the living room to find a place to hide. And after giving a good count and not being to hear the stomping anymore you reopen your eye's to the living room. You then begin your search, having a good idea of where she went based on the stomping you heard. Heading down a huge hallway you see a door to your right, a door in front of you, and a longer hallway to the left that lead to an open door revealing the master bedroom. Since the door was opened you assumed that she went in there, but felt strange about entering the parents bedroom. But hearing something hit the ground from that direction you knew you had no other choice but to enter.<br>\r\n<br>\r\nSo entering the huge bedroom you notice the mess of scatter clothing that clearly told you that they did not expect you to enter this room. Which made this worse for you. But you know to get this over with you need to just find Naomi. And with that thought you begin looking around the mess. Noticing something about about an object that is right next to you. Touching it you notice that it is Mrs.Farringon's knee high boot's which made you wearied out to see as they were the exact same height as you were. Thinking that when you saw her before you came up to a little more then her belly button. And that thought was interrupted as you heard the sound of giggling behind you.<br>\r\n<br>\r\nTurning you see Naomi ducked down behind a suitcase. She notices that you found her and stood up to her full height to say \"Aw darn... Well you found me, now it's your turn to hide\". Naomi announces to you as she approaches you are around face to face with being at crotch level. Which you being already small before Naomi really notices no difference with you and starts rushing you to go hide as she begins to count. You wanted to talk to her about the strange things you noticed but with her shoving you out the bedroom to go hide and then closing the door. You go to find an easy place to hide, to get this game over with. And upon seeing long curtain covering a window picture in the living room. You go and make that your hiding place.<br>\r\n</font><br>\r\n<br>\r\n(how long did it take for her to find you?)</span></div></div>",
            "created":1582566840,
            "id":2792231,
            "title":"Hide and Seek, Giant feline style"
        },
        "1221212221222":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "she does not notice a difference, you were small before and are small now",
                "She has noticed and points it out",
                "She noticed and doesn't point any out. instead saying \"What do you need?\""
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">And even with such an obvious hiding spot Naomi still takes about 10 to 20 mins to find you.But she is over joyed when she reveals and see's where you are. You are just glad the game is over and forgetting about everything from before you feel a bit hungry and hear her tummy rumbling as well. In which you say \"Okay lets go eat dinner\". Which as a sort of humiliating process as you weren't able to reach the freezer and had Naomi microwave you guys meals up. You felt very strange after eating the food and so you motioned Naomi to get ready for bed.<br>\r\n<br>\r\nAnd after 30 mins of her getting all ready for bed she comes out into the living room to watch some more TV. Noticing this from the kitchen you make your way over to the living room to tell her it's bed time.  Standing in the living room doorway you say \"Naomi come over here\" and you watch the girl stand up and head over to you. But you are in a shocked state as you see Naomi from a new perspective. Your head is just below her knee. You look up to see her underwear and instantly feel embarrassed as you look back down.<br>\r\n<br>\r\nNaomi who has just been starring at you...</font><br>\r\n<br>\r\n(Does Naomi' notice the size difference?)</span></div></div>",
            "created":1582568760,
            "id":2792242,
            "title":"A new perspective"
        },
        "12212122212223":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "Accept saying that one more hour won't hurt",
                "Refuse Telling her it's time for bed",
                "*Front Door opens* The parents have come home early"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">In a sweet and  booming tone Naomi says asks you \"Yes what do you need?\". Hearing this snapped you out of whatever daze you were in. You think that you need to regain your authority and whatever has happen to you can be put to the side till the parents get home. So angling your head back up, you begin your look up of the tower of feline little girl that is in front of you. Seeing above you her thigh muscles that even at her age could crush you and past that seeing the Naomi's white underwear from under the big shirt that must belong to her mom or dad. But she must sleep in it. You do your best to just look past that and towards Naomi's face that is a good distance above you smiling at you.<br>\r\n<br>\r\nNaomi while starring down at you was lost in thought as she waited for you to answer. She had noticed that you had gotten a lot smaller. And to her you look absolutely adorable. She was thinking that she wanted to pick you up and throw you up and down playfully. But then she had a better idea of a game that she really wanted to play with you.<br>\r\n<br>\r\nYou felt a bit nervous but you know you were like half her height before so this should make no difference as you say \"Listen Naomi it's time for bed. Now come on lets shut of the TV\". After saying that you knew it wasn't going to be that easy as you have babysat before and typically when you say Bed time you get a response just Like Naomi gives as she shows a puppy dog or in this case kitten eye's to come off as very adorable and say \"But I'm not tired, we were having a lot of fun before with hide and seek. Plus it's a Friday and there's still one more game that I want to play with you. Pwease can I just stay up with you for one more hour so we can play one more game\". She then gives you a cute pouty face.<br>\r\n<br>\r\nYou have heard it all before and you already knew that the parent's set bed time is typically a must. But you do think about how Mr.Farrington and Mrs.Farrington should be still out for a couple more hours. And even with all this strangeness happening, you do want Naomi to say that she liked you so her parents would hire you again since the cash was good. Plus when you were a kid these are the type's of things you typically remember most about your childhood babysitters. So, you decide to...</font></span></div></div>",
            "created":1582682400,
            "id":2792927,
            "title":"Show your authority"
        },
        "122121222122231":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "The pet",
                "The baby",
                "The daddy"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Taking a -sigh- you say \"Okay you wore me down. I'll let you stay up for one more hour. Okay but after that hour you have to promise to go to bed with no But's, Okay?\". Naomi who face lit up as soon as you said okay was jumping for joy as she said back to you \"Okay I promise\". As she jumps and accidentally hit's you, which causes you to lose your balance with being so close to her and fall on your back. As soon as this happens Naomi stops and start to feel bad as she goes in to help you up and saying \"Oh no, I' really sorry I didn't mean to that\". In which you realizing it was a mistake say to her \"Oh no, your fine *rubbing the pain your butt*. I know it was just an accident\". Naomi at this point as grabbed you to help you up. But to your surprise your brought all the way up and become face to face with her. Seeing your legs dangle, you would have never thought that you would have this kind of feeling again as if you were a small child or baby it was humiliating.<br>\r\n<br>\r\nShe smiles and says \"Good I'm glad your okay and wow your really light *giggles*. Now I hope you don' mind but I'm going to take you to my room for our game\". And that wasn't really a choice you realize quickly as she just head's towards her room, with you in her furry hand paws being rested against her chest that you do your best to not notice is maturing and actually has something soft to it.<br>\r\n<br>\r\nWith ease you are brought into Naomi's room and set on her massive bed that felt bigger then the living room couch. And at this point you just really wanted to know what game she had in mind so you can just get this whole thing over with and so you ask \"Naomi can you tell me what are we going to play?\". Naomi who at this point seemed to be in her closet looking for something turned to look at you to say \"Oh I really wanted to play house with you. So that's what were going to play\" she then went back to looking through stuff in her closet.<br>\r\n<br>\r\nYou thought that didn't sound to bad and say \"Okay we can play that. So you probably want me to play the dad?\". I mean you have played house with other kid's you have babysat so this shouldn't be to different (forgetting your current size of course). You were very use to playing as a dad or few times an over-sized kid so you were hoping that Naomi would just get the game started so to get this over with quickly. You then watch as it seem's Naomi has found what she was looking for and turns to you to answer your last question about your role and say's \"You will be....\"<br>\r\n</font><br>\r\n(What is your role?)</span></div></div>",
            "created":1582685160,
            "id":2792952,
            "title":"One more hour couldn't hurt or could it?"
        },
        "1221212221222311":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "you get left in there for a couple of min's and then she comes to let you out",
                "continue with you inside the crate",
                "forget's to let you out and leaves you in there till her parents get home"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">...the pet\" You are shocked what heard and have no desire to play that role especially after seeing what she is carrying. Which is a small dog crate to her, To you it might as well be like one of those tiny one room homes that you see on TV that real people actually live in. She notices that you are starring at the crate and with out giving you a chance to speak on your role she say's \"Oh and this use to belong to my old puppy. We had her for a little more then a month and we loved her so much. But unfortunately my mom found out that she is allergic to dog's and we had to get rid of her. I was really sad about it and just always kept her crate. And so for this game of house this will be the place where bad pet's go. But don' worry it will probably not even play a part\". Naomi say's this all to you in such a child like way. You knew it was all just a game but had to say \"I don't think I want to be the pet, can I just be something else\".<br>\r\n<br>\r\nAnd just like the happy little child she is Naomi gets on the bed with you and says \"Oh come on it will be fun I promise and there's no role changes that's the number one rule silly! Now I will of course be your owner. *GAME START* Now come here boy, come sit on my lap like a good boy\" She says in a commanding/baby talk kind of way. You seeing the 10 year old's that is just fur since she is only wearing a big shirt and underwear. You felt a little strange bout this but you did agree so you play along and get on her lap. Naomi then takes her paw/hand and vigorously starts petting you and saying \"Oh what a good boy\" over and over again. It didn't feel good but it also didn't feel bad. But boy did you hate the humiliation that you felt.<br>\r\n<br>\r\nNaomi seeing that you aren't getting into it says \"You know my old puppy use to let me do this to her all the time and she loved it. But maybe you just need something else to get you into the puppy spirit\". You hate to break it to her but there was no way that you could get into any kind of \"puppy-spirit\". But you listen as Naomi talked \" Oh I know...\" She said this to you as you were easily picked up and placed at her cat like feet that smelled awful and having to be placed in front of them you saw different dusts and crushed bugs that she has stepped in, it is real nasty. <br>\r\n<br>\r\nNaomi then talked again \"My puppy use to love when I came home and let her lick my feet. And it felt so good when she did it. So I am letting you. So lick my feet\". Hearing this you knew this is going too far. There is no way that your going to do this. So you say \"No way\". Naomi who doesn't expect this says back to you \"Yes way or you can be in the crate. Hearing this you knew that you were the one in charge here so you jump off the bed and say \"No, now it's time for bed, for that deep threat\" nothing was worth this you thought as you began to walk towards the door. But you weren't walking as instead you were lifted up and without saying a word to you Naomi opens the crate door, puts you inside, and say's \"You need a time out *still in game mode*. Bad pet\". She says placing the crate on her floor and walks out of the room.</font><br>\r\n<br>\r\n(What happens next?)<br>\r\n</span></div></div>",
            "created":1582687740,
            "id":2792974,
            "title":"A Crate Time"
        },
        "12213":{
            "author_id":"tomsketchit",
            "author_name":"TomSketchit",
            "choices":[
                "Equine",
                "Bovine",
                "Rabbits",
                "Ursine",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options</span></div></span></div>",
            "created":1601044020,
            "id":2909738,
            "title":"Other"
        },
        "123":{
            "author_id":"meisterli",
            "author_name":"brizzlefizz",
            "choices":[
                "Debbie, a plucky, excited and loud fox girl",
                "Chris, a shy, quiet and hesitant fox boy",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>You are a human male of 22 years old and you're about to head to the babysitting appointment you made. This was going to be a tough one, seeing as foxes were always handful, but you really needed the money. Sighing, you knocked on the door of the Weidner family, which was opened pretty quickly by the large farther of the household.<br>\r\n<br>\r\n\"Ah, Peter! Nice that you could make it! It's not easy finding a babysitter on such short notice! I assume you already know...\"</span></div></div>",
            "created":1550898000,
            "id":2621788,
            "title":"A foxy babysitting gig!"
        },
        "124":{
            "author_id":"sli201",
            "author_name":"SLI201",
            "choices":[
                "Katie shakes it off, drinks and a movie!",
                "Wilson and Tamara go through a BIG spurt!",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Katie stepped out of her car that she had just pulled into an expansive drive and gazed up at the impressive two-storey mansion in front of her. The young 21-year old had never babysat for anyone so wealthy before and certainly not for a family of anthropomorphised horses. Anthromorphs were pretty much fully accepted into society these days though they remained quite rare and tended to live within their own communities. Katie had been thrilled to be accepted for the job and couldn't wait to meet the reclusive family. She double-checked her reflection in her car window, her curly blonde hair bobbing around her face and bright green eyes staring back at her. She was wearing a simple loose-fitting red top and a pair of tight-fitting jeans that outlined her generous curves. Katie took a deep breath to try and dispel some butterflies in her stomach and adjusted the satchel on her shoulder to a more comfortable position before making her way to the ornate front double-doors. She didn't have a chance to press the doorbell before one of the doors swung open.<br>\r\n<br>\r\n\"Very prompt, excellent! I appreciate that.\"<br>\r\n<br>\r\nThe warm, friendly voiced belong to one of the most beautiful individuals Katie had ever seen. An incredibly tall, lithe horse-woman stood before her, one arm casually draped over the top of the door with the other resting on a very prominent hip. She had to be over seven-feet tall, with a body that oozed raw power and magnetism. She wore a deep red dress that hung elegantly over her muscular body, accentuating her broad shoulders, generous breasts, powerful mid-section and incredible hips. Her lower body was her most striking feature, the full width of which looked to be twice as wide as Katie herself. The young woman caught herself gaping and coughed sheepishly.<br>\r\n<br>\r\n\"Thank you! I always do my best to be on time. I just want to say thank you so much for giving me this job! I really appreciate it and you have no idea how much it helps and how excited I am to-\"<br>\r\n<br>\r\n\"That's quite alright, quite alright,\" laughed the horse-woman bending down slightly to offer her hand. \"You had excellent references and to be honest I really liked the sound of your profile! Welcome, I am Cassandra Gallop.\"<br>\r\n<br>\r\nKatie blushed as she realised she hadn't introduced herself and took Cassandra's hand, shaking it confidently. She marvelled at the sensation of the short dark brown fur that covered the anthro horse from head to toe. Cassandra's head was shorter and smaller than that of a \"feral\" horse, as was common amongst anthros, in proportion with her humanoid body. <br>\r\n<br>\r\n\"I'm Katie Williams, I'm so pleased to meet you,\" the human woman gushed, drawing another grin from the horse-woman. <br>\r\n<br>\r\n\"Likewise! Come in, come in, I'll show you around the house before introducing you to my lovely little monsters that you'll be looking after this weekend!\"<br>\r\n<br>\r\nAs Katie followed Cassandra into the house, closing the front door behind her, she was again left stunned at the sight of the back of the horse-woman. Her huge hips flared out around obviously huge buttocks, a common attribute for horse anthros. Each cheek  was twice the size of a large melon and bunched and flexed with obvious power as they walked. Her thighs were equally impressive, about as wide as Katie's own generous backside, and tapered down into a pair of solid hooves. Cassandra had an incredibly gorgous gold-brown mane and matching tail, both of which had been plaitted and braided with beads and other jewellery. Katie was finding herself infatuated with the incredible woman.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"...and last but not least, the living room,\" Cassandra said as they descended back down the stairs into the main hall. \"This is where you'll meet my children as well.\"<br>\r\n<br>\r\nKatie panted as she kept pace with the horse-woman. The whole tour had left her slightly winded due to the huge strides Cassandra was able to take. The pair entered the spacious living room and Katie immediately spotted the children standing in the middle as if waiting for them to arrive. Cassandra had a son and daughter, fraternal twins. The son was clear in view standing proudly with his chest puffed out and his arms folded, the spitting image of his mother with the same dark brown fur and golden mane and tail. Behind him stood his sister a little more timidly, her short fur a mix of chestnut brown and white with a deep black mane and tail. Katie knew they were both 10 years old but they were nearly as tall as she was and both seemed to be powerfully built. <br>\r\n<br>\r\n\"This is Wilson and Tamara,\" Cassandra said with some pride, embracing both her children in a tight hug before nudging them forward to greet Katie.<br>\r\n<br>\r\n\"Hey guys!\" Katie said a little nervously as the children eyed her up and down. \"I hope we'll be friends! I've heard a lot about you, I can't wait for us to have some fun!\"<br>\r\n<br>\r\nTamara giggled a little at Katie's enthusiastic delivery and Wilson softened his stance. The boy wore a pair of loose, baggy shorts and a matching polo shirt. Katie's eyes were inevitably drawn to the crotch, where there was an unmistakeable bulge despite the looseness of the clothing. Tamara was wearing a black, buttoned-up skirt over a pair of bright pink leggings, stretched tight over her lower body that she had unmistakeably inherited from her mother. Even at this age she had strong, thick thighs and wide hips that fed into a strong, broad mid-section. Both children were showing the signs of a powerful musculature likely to bless them later in life.<br>\r\n<br>\r\n\"You're both so gorgeous!\" Katie exclaimed honestly, drawing a laugh from both children. <br>\r\n<br>\r\n\"Well, then I'm off! Katie, don't forget, I've left a list of details in the kitchen for various things but if you have any questions don't hesitate to call. Be good, my lovelies!\"<br>\r\n<br>\r\nCassandra knelt down and embraced her children again, kissing both on their foreheads, before making her way to the front door. Katie and the children waved as she walked to the end of the driveway before breaking into a sprint down the road, her powerful legs propelling her incredibly fast. Katie sighed as she watched her leave before closing the door and focusing on the kids.<br>\r\n<br>\r\n\"First thing first, your mother said you both need a protein drink?\"<br>\r\n<br>\r\nThe kids nodded enthusiastically.<br>\r\n<br>\r\n\"It's what we drink to make us bigger and stronger,\" Wilson said with a grin. \"Mum said it'll make us bigger than her when we're grown up!\"<br>\r\n<br>\r\nKatie felt light-headed at the image, sexy, towering horse-people filling her mind before she cleared her thoughts.<br>\r\n<br>\r\n\"Well then,\" she started with an embarrassed cough. \"I think I saw the glasses filled up in the kitchen.\"<br>\r\n<br>\r\nThey made their way to the expansive kitchen, Katie smiling at the sound of two pairs of hooves clopping across the floor, and two tall glasses stood on the counter, filled to the brim with a viscous brown fluid. The kids drank them down eagerly and in one go, both smacking their lips as they finished. <br>\r\n<br>\r\n\"You have one once a day?\" She asked as she rinsed the glasses and left them to dry next to the sink.<br>\r\n<br>\r\n\"Yep! For the past five years!\" Wilson replied. \"It's awesome, I swear I feel myself get bigger after each one. I wanna be as big as I can.\"<br>\r\n<br>\r\n\"Me too!\" Chimed in Tamara, standing quite close to Katie. The girl seemed as infatuated with Katie as the human woman was with the horse family. <br>\r\n<br>\r\nKatie smiled as she tried to ignore how excited the thought of these gorgeous horse-children growing bigger made her.<br>\r\n<br>\r\n\"Well, it definitely seems to be working. You guys look amazingly big!\"<br>\r\n<br>\r\nWilson grinned and flexed an arm while Tamara's eyes sparkled and she lunged forward to give Katie a tight hug. Katie, initially shocked, returned it gratefully before they pulled away, locking eyes for a while.<br>\r\n<br>\r\n\"Okay, you guys want to play a game?\"<br>\r\n<br>\r\n\"SNAKES AND LADDERS!\" Tamara yelled as she sprinted from the kitchen. Wilson shrugged as Katie looked at him in surprise.<br>\r\n<br>\r\n\"It's her favourite.\"<br>\r\n<br>\r\n\"Not yours?\"<br>\r\n<br>\r\nWilson shrugged again.<br>\r\n<br>\r\n\"I don't mind, it's pretty fun. My favourite is mouse trap, though.\"<br>\r\n<br>\r\nKatie smiled.<br>\r\n<br>\r\n\"Well, how about we play a couple of games of snakes and ladders and then we break out mouse trap? Sound fair?\"<br>\r\n<br>\r\nWilson smiled back at her, perking up.<br>\r\n<br>\r\n\"Sure!\"<br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"Yes! I win!\" Tamara whooped triumphantly as she won the second game of snakes &amp; ladders, grinning at both Katie and Wilson.<br>\r\n<br>\r\n\"Well, that makes it one each between you two,\" Katie said, returning Tamara's grin before focusing on Wilson. \"What do you think? One more game to settle it?\"<br>\r\n<br>\r\n\"Definitely!\" Both kids answered, glaring at each other with fake anger, smirks threatening to break out at any moment.<br>\r\n<br>\r\nKatie admired the strong bond the pair shared. They were definitely going to grow up attached at the hip. As they all worked to reset the board the babysitter noticed mottle dark patches on the kids' fur where they seemed to be sweating. She paused, looking at them each in turn.<br>\r\n<br>\r\n\"Are you guys feeling okay? You look a bit warm.\"<br>\r\n<br>\r\n\"Yeah, just a bit hot,\" Wilson answered, before he rested back in the chair and briefly tensed with a grunt. <br>\r\n<br>\r\nAs he relaxed with a sigh she heard Tamara grunting quietly on her side and when she looked at her she had gripped the table, her head bowed. Katie's eyes flicked down to the front of her skirt where Tamara's buttons seemed to be straining more than before. As the horse girl sat back too she could see the buttons being pulled tight and releasing with her heavy breathing, the grooves of her upper body pressing a little bit harder against the material.<br>\r\n<br>\r\n\"I...I think we should all get a drink,\" Katie suggested, looking away and shaking her head.<br>\r\n<br>\r\nThey couldn't be growing bigger, that wasn't possible. Was it? <br>\r\n</span></div></div>",
            "created":1582493760,
            "id":2791805,
            "title":"Babysitting Horses"
        },
        "13":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Slot 1",
                "Slot 2",
                "Slot 3",
                "Slot 4",
                "More slots!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In the mood to babysit a not-so-little pony, then?<br>\r\n(To make things a little simpler, non-ponies from MLP such as gryphons and dragons are also allowed.)</span></div></span></div>",
            "created":1489208400,
            "id":2288050,
            "title":"A pony! (Anthro)"
        },
        "131":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "It was almost time for her to be fed.",
                "Her parents had requested that you measure and weigh her while they were out.",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Quietly as you can, you creep into the room, making sure to avoid treading on any of the toys strewn across the beige-coloured carpet. The room was a little small, but packed to the brim with colour - the walls were a bright cyan, and the roof a brilliant white, and paintings and pictures of a happy, childish nature were all over the place. There was so much colour that it was almost a little too much to process from sheer overload, but you kept your mind on what you were in the room to do, rather than the room itself.<br>\r\n<br>\r\nIn the far corner of the room lies a cot. A little large,but more than adequate for its single inhabitant - a small, baby pony, with cyan fur that matched the colour of the room's walls, and a messy mane of rainbow-coloured hair. You smile as you draw near to her - or hir, as it was, for the little pony was apparently a hermaphrodite - and spend a moment to two watching as she slowly turns over in her sleep, diaper crinkling slightly, the fabric of her child-sized t-shirt rustling a little.<br>\r\n<br>\r\nYou reach into the cot, gently scooping Dash up into your arms and nestling her against your chest as you begin to walk, the filly's eyes opening with a quiet, nonsensicle babble. You soothingly rub the back of her head, gently bouncing her as you move. Though the filly couldn't possibly understand what you were about to do, the truth of it was that...</span></div></div>",
            "created":1490331600,
            "id":2294327,
            "title":"Dashing"
        },
        "14":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Slot 1",
                "Slot 2",
                "Slot 3",
                "Slot 4",
                "More slots!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>These 'little' monsters definitely aren't small enough to fit in your pocket!</span></div></span></div>",
            "created":1489208400,
            "id":2288052,
            "title":"A Pokemon! (Anthro)"
        },
        "141":{
            "author_id":"shayminlover",
            "author_name":"Galio",
            "choices":[
                "Male!",
                "Female!",
                "Neither!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You know, there is just never any good Arceus macro material. Let's make one here, but first: Male, female, or neither?</span></div></span></div>",
            "created":1489208400,
            "id":2288131,
            "title":"Arceus"
        },
        "1412":{
            "author_id":"shayminlover",
            "author_name":"Galio",
            "choices":[
                "Play with her!",
                "Get her some food!",
                "Take her out of the room and see what happens!"
            ],
            "content":"<div class=\"\"><div> <span>You were driving down the street, looking around for the house you were supposed to babysit at. This is far from your first experience with this sort of job, but the job poster warned of it being possibly dangerous. Though the pay was amazing, 100 bucks an hour, you can't help but wonder why they said it was dangerous. Eventually, they arrive at the address and look shocked to see it was a small mansion there. Ornate and grand, yet somewhat small in scale. You pull up into the driveway and knock on the door.<br>\r\n<br>\r\nIt's answered by a man who looks exhausted. \"Oh thank goodness you're here!\" He says relieved.<br>\r\n<br>\r\n\"Umm...Are you alright? You look awful.\" You say. You start to have a bad feeling about all this.<br>\r\n<br>\r\n\"I'm fine. It's just been harder taking care of her then I thought. I just need a break badly.\" He says.<br>\r\n<br>\r\n\"Oh, okay. Can I come in and see her?\" You ask.<br>\r\n<br>\r\n\"Well, I gotta go right now, but she should be in her room upstairs. Oh, and one more thing: Don't let her out of her room!\" He says and heads into his own car and drives away.<br>\r\n<br>\r\n\"Umm...Okay.\" You say, not sure why he said that and head upstairs. You are shocked to see yourself find an Arceus baby girl in a crib. She was adorable, but...she was Arceus! The most powerful Pokemon ever! Why was she a baby? She was adorable though.<br>\r\n<br>\r\nBut...what should you first do with her?</span></div></div>",
            "created":1489381200,
            "id":2289060,
            "title":"The baby Arceus Goddess"
        },
        "15":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Scenario one - role reversal",
                "Scenario two - daycare",
                "Scenario three - apotheosis",
                "Custom scenarios",
                "Use this slot to have characters from any type of media you want grow~"
            ],
            "content":"<div class=\"\"><div> <span>If those choices aren't quite what you want, perhaps some scenarios would be better?<br>\r\n<br>\r\nScenario one:<br>\r\nIn this scenario, you take on the role of the growing child, rather than the hapless babysitter. Be nice or mean, grow at any pace you want - it's all up to you!<br>\r\n<br>\r\nScenario two:<br>\r\nIn this scenario, rather than a babysitter, you're trying to manage a class of children at a daycare, nursery or somethign similar - perhaps even a school. One child could grow, or two - or maybe even the entire class! The composition of the class, in terms of sex and species, is entirely up to you.<br>\r\n<br>\r\nScenario three:<br>\r\nIt's said in the field of psychology that before a child matures past a certain point, they see themselves as a god-like entity that the entire world exists to service. What if, on some level, this was true for one child - a growing, increasingly godlike child, worshipped and attended to by an increasing segment of the population?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1490331600,
            "id":2294342,
            "title":"Something else!"
        },
        "151":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "A human",
                "A furry",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now then before this scenario starts what kind of growing child are you exactly?</span></div></span></div>",
            "created":1490331600,
            "id":2294352,
            "title":"Scenario one - role reversal"
        },
        "1511":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Chihiro",
                "Your own character",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>Name: Chihiro<br>\r\nAge: 10<br>\r\nAppearance: <a rel=\"nofollow\" href=\"https://vignette2.wikia.nocookie.net/studio-ghibli/images/7/71/Chihirorun.jpg/revision/latest?cb=20170111072733\" target=\"_blank\">https://vignette2.wikia.nocookie.net/stu...</a> (using the character's name and appearance)<br>\r\n<br>\r\nChihiro is easily one of the most mature girls of her age. Not just in her mentality, being responsible for chores around the place and such, but being able to take care of herself effectively. Even sore, her parents feel that she still needs a babysister thanks to her age, and while she understands that, she really isn't interested in it. She is a bit oversexualized for her age, having C-Cup breasts and a sharp butt. Imagine how she could be as a giant?<br>\r\n<br>\r\nWanna use her?</span></div></div>",
            "created":1500181200,
            "id":2354130,
            "title":"First option"
        },
        "1512":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Spunky the lion cub",
                "Free Choice",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>Name: Spunky the lion cub<br>\r\nAge: 1 <br>\r\nSpecies: Anthropomorphic animated lion cub<br>\r\nPersonality: Friendly and smart.<br>\r\nBio: Spunky the lion cub is a 1 year old anthropomorphic animated lion cub who happens to be the same size as Baby Huey himself was, but of course he doesn't wear any clothes or diapers because after all big babies like him prefer to waddle around bare butt naked as he's growing bigger in size day to day.</span></div></div>",
            "created":1520830800,
            "id":2463648,
            "title":"A furry"
        },
        "152":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Human",
                "Giants",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, before we go to the daycare, what will the children be? Will they be human? Giant? More options can include furries and what not.</span></div></span></div>",
            "created":1496293200,
            "id":2329425,
            "title":"Scenario two - Daycare"
        },
        "1521":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Watcher",
                "Child",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will you be? A watcher, or a child? Maybe a Reader's Choice story?</span></div></span></div>",
            "created":1496293200,
            "id":2329426,
            "title":"Who?"
        },
        "1522":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Watcher",
                "Giant Child",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now if you want, we can do giant watchers as well, but most will be human. So what options will it be? Human watcher or giant child? Maybe Reader's Choice?</span></div></span></div>",
            "created":1496293200,
            "id":2329427,
            "title":"Giants"
        },
        "153":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Human male",
                "Human female",
                "More species"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, so a child is about to become a godlike child, and perhaps they also grow big as well. So what gender will the child be&gt;</span></div></span></div>",
            "created":1500181200,
            "id":2354126,
            "title":"Scenario three - apotheosis"
        },
        "154":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Giants Role Reversal",
                "Adopted in the Family",
                "More scenarios"
            ],
            "content":"<div class=\"\"><div> <span>Okay, here is another two scenarios that could possibly work.<br>\r\n<br>\r\nGiants Role Reversal: Instead of the kid becoming a giant (or already as a giant), the babysitter would become a giant and watches the kid(s). Imagine all the possibilities that can come out of this.<br>\r\n<br>\r\nBeing adopted in the giants family: Not really a new scenario, but what if you already got to knew the child and he or she became giant, but you then become the babysitter. Kinda of an nice play on it.</span></div></div>",
            "created":1490504400,
            "id":2295061,
            "title":"Custom scenarios"
        },
        "1541":{
            "author_id":"roman921",
            "author_name":"roman921",
            "choices":[
                "Male",
                "Female",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, so is the babysitter male or female?</span></div></span></div>",
            "created":1501650000,
            "id":2363581,
            "title":"Giants Role Reversal"
        },
        "15412":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Yes, let's do Tron",
                "Let's go with a different story"
            ],
            "content":"<div class=\"\"><div> <span>Okay, here is our first giant babysitter.<br>\r\n<br>\r\nTron Mendline is a 14 year old girl who has a great bond with her younger siblings and has dreams of not only being a school teacher, but also a child psychologist as well. She has worked in a daycare as a volunteer, and also did some babysitting jobs from time to time to make some money. But there is one thing that makes her stand out and best at her job. She is freaking huge, like at least over 100ft huge. She is a pretty kind person and is helpful and understanding, but don't threaten a child while she is watching or make her mad, as then her monster side will come out. How she became gigantic, no one knows... but certainly she must be a star if she is gigantic and such.<br>\r\n<br>\r\nShe currently is going to be doing a job for a very rich family for some kids, and we can get into that into the next chapter of this story, but all we know that they are in for one big babysitter.<br>\r\n<br>\r\nTron' appearance: <a rel=\"nofollow\" href=\"https://vignette2.wikia.nocookie.net/megaman/images/3/37/Tronhappy.jpg/revision/latest?cb=20110220182612\" target=\"_blank\">https://vignette2.wikia.nocookie.net/meg...</a> (I know she kinda looks like Tron from Megaman, but I am using this as a reference)<br>\r\n<br>\r\nSo, want to use Tron as the first giant babysitter?</span></div></div>",
            "created":1505451600,
            "id":2386029,
            "title":"Tron"
        },
        "1542":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Male",
                "Female",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, now what gender will we be using for the giant kid who is adopted into a family?</span></div></span></div>",
            "created":1501736400,
            "id":2363706,
            "title":"Adopted in the Family"
        },
        "1543":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Giant adopted in a normal family",
                "Giant babysister and kids",
                "More scenarios"
            ],
            "content":"<div class=\"\"><div> <span>Here is a couple more giant like scenarios for everyone.<br>\r\n<br>\r\nGiant adopted in the normal family: Okay, this might be retreading the idea I had with a normal kid being in a family of giants, but here it is a role reversal, a giant becomes adopted in a normal family. Hope that family is rich enough to pay for the kid's care and such.<br>\r\n<br>\r\nGiant Babysiter and Kids: This one, all the characters essentially are giants, and a giant babysister is to watch them. Perhaps they rampage, I don't know.</span></div></div>",
            "created":1496293200,
            "id":2329420,
            "title":"Few more giant scenarios"
        },
        "15431":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Yes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Okay, here is our first child.<br>\r\n<br>\r\nSoya<br>\r\nAge: 7<br>\r\nAppearance: The child has short brown hair and has a good tan skin and brown eyes. Now thanks to her body chemistry of that being a giant, she is a bit oversexualized with B-Cup breasts and smooth butt. Will usually wear bikinis.<br>\r\nPersonality: Kind, cheerful, playful, a bit curious, but loves acting like a Japanese giant monster every chance she can. She can be a handful.<br>\r\nBio: She was actually a girl who was taken by a military force to be experimented on. THey were developing a serum to where they can make super soldiers out of kids, and they used it on her. Well it did more than made her a soldier, she became a giant, and they were teaching her how to be their weapon, but then soon the government intervene and shutdown the program. Regarding their experiments, they were then sold to various parts of the world, and she ends up with a rich family with some older brothers and sisters, and even one her age as well. This should be fun.<br>\r\n<br>\r\nWanna use her?</span></div></div>",
            "created":1499922000,
            "id":2352379,
            "title":"Soya"
        },
        "15433":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Robot-like children as servants",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>What if the child was a robot-like person to be brainwashed into being the servant? Maybe he or she can be like a robot and does exactly what the person ask them to do, and imagine all the fetishes that can be applied here. maybe the child is even a giant as well?<br>\r\n<br>\r\nWant robot-like children as servants?</span></div></div>",
            "created":1497330000,
            "id":2335013,
            "title":"Robot-like child servant"
        },
        "154332":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Yes",
                "Nope"
            ],
            "content":"<div class=\"\"><div> <span>Okay, maybe somehow you are the only adult in the world of giant kids. For some reason all the kids in the world are giants, and they rule over the adults. This can only lead to some very interesting possibilities as the Giant Kids has enslaved all the teenagers and adults into worshipping them as gods and goddesses. Wanna use this scenario?</span></div></div>",
            "created":1501304400,
            "id":2361244,
            "title":"World of the Giant Kids?"
        },
        "1543322":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Yes",
                "Nope"
            ],
            "content":"<div class=\"\"><div> <span>Okay, here is another good story route. What if instead of a planet, the kids that grew giant are being held on an island controlled by the world's government and is used for some purposes. Apprently they help all of those who are giants and what not, and now you as a new employee have been assigned to a giant kid that you will watch over and what not. Are you up for this monster-sized job?</span></div></div>",
            "created":1502082000,
            "id":2366027,
            "title":"Island of Giant Kids?"
        },
        "155":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Anine/cartoons",
                "Video Games",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, now what type of media do you want to do this story one? Adventures in Babysitting in media.</span></div></span></div>",
            "created":1501304400,
            "id":2361239,
            "title":"Use this slot to have characters from any type ..."
        },
        "1551":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Anime",
                "Cartoons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now then which path will you choose?</span></div></span></div>",
            "created":1570395180,
            "id":2729067,
            "title":"Anine/cartoons"
        }
    },
    "info":{
        "author_id":"infinity421",
        "author_name":"infinity421",
        "brief_description":"What you thought to be an easy babysitting job becomes anything but when the baby grows!",
        "created":1489233180,
        "description":"<td align=\"left\" class=\"norm\">As you can probably guess from both the name and the description, this interactive will be focused on you, a babysitter, having to deal with all of the problems associated with the child under your care beginning to inexplicably grow in more ways than one. Before we get into the interactive, however, let's lay some rules down.<br>\r\n<br>\r\n1. Please try to keep your writing at an acceptable standard. If you make any typos or mistakes I'd be more than happy to correct them for you.<br>\r\n<br>\r\n2. Choice chapters are more or less required due to the way that Writing.com's interactives work, but try not to use them when unnecessary.<br>\r\n<br>\r\n3. There is no minimum age for the growing character; the maximum age is thirteen, though age progression taking them beyond this is allowed - Though I'd like to request that no characters are aged beyond twenty-five or so, as a matter of personal preference.<br>\r\n<br>\r\n4. Take the time tocheck the list of accepted and unaccepted fetishes, just to make sure that what you're writing won't be edited/deleted.<br>\r\n<br>\r\n5. Growing children can be human, furries, and even ponies and Pokemon. Original characters are more than welcome.<br>\r\n<br>\r\n6. Though this isn't really a rule so much as a personal preference, I really like power-hungry and greedy giants/giantesses. Anything involving those is encouraged as much as is possible!<br>\r\n<br>\r\n7. In addition to the above, I favour gentle giants/giantesses - especially if they're also power-hungry - but have nothing against violent macro. Other personalities are more than acceptable, as well.<br>\r\n<br>\r\n8. There is no size limit, at all. Go as big as you can or want, but remember - bigger is always better!<br>\r\n<br>\r\nAccepted/encouraged fetishes:<br>\r\nGrowth, male and female<br>\r\nHyper (Disproportionately huge genitals/sexual characteristics)<br>\r\nHermaphrodites<br>\r\nMuscle growth<br>\r\nAge progression<br>\r\nReality warping<br>\r\nDivinity<br>\r\nGrowing little sisters/brothers<br>\r\nPower-hungry macros<br>\r\nMultiple heads/cocks/etc<br>\r\nInflatable characters<br>\r\nShota/loli<br>\r\n<br>\r\nUnallowed fetishes:<br>\r\nBelly growth/fat<br>\r\nWatersports<br>\r\nScat<br>\r\nVomit<br>\r\nGore<br>\r\n<br>\r\nIf I've missed out any fetishes, be sure to send me a messages and I'll put them in the appropriate category. With all that said, let's begin!</td>",
        "id":2114843,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601044020,
        "modified":1601044020,
        "pretty_title":"Adventures in Babysitting"
    }
}