{
    "chapters":{
        "1":{
            "author_id":"aeden1189",
            "author_name":"EdenRose",
            "choices":[
                "Take Cliff to bed!",
                "Find someone new!",
                "Give it some time. "
            ],
            "content":"<div class=\"\"><div> <span>I had just taken the cornbread out of the oven when I felt his arms snake around my waist and his face nuzzle against my neck. He obviously had not shaved in a few days. His stubbly beard rubbed against my throat, igniting a trail of white hot fire all the way from my neck down to the apex of my thighs. Part of me wanted him. Another part of me remembered the pain and humiliation of knowing he had been with another woman when engaged to me. </span></div></div>",
            "created":1394599320,
            "id":1759150,
            "title":"He Did Cheat..."
        },
        "12":{
            "author_id":"aeden1189",
            "author_name":"EdenRose",
            "choices":[
                "Answer the door",
                "Ignore the door"
            ],
            "content":"<div class=\"\"><div> <span>I fought against the urge to turn around and let go. Warm wet kisses trailed down my neck and his hand gently massaged my breast. My already loose grip on self control slipped further away. His hand shifted from my breast down towards the the waist band of my daisy dukes. Just as he maneuvered the button loose I felt his body go rigid. His warm lips were no longer on my neck, leaving me wet and cold.<br>\r\n\"What is it?\" I asked, breathless and more than a little flustered.<br>\r\n\"The door. Did you not hear that? Someone knocked.\"</span></div></div>",
            "created":1429999980,
            "id":1969340,
            "title":"Find someone new!"
        }
    },
    "info":{
        "author_id":"aeden1189",
        "author_name":"EdenRose",
        "brief_description":"Sadie Stirling is at a cross roads. Will she look back to love lost or find someone new?",
        "created":1394598540,
        "description":"<td align=\"left\" class=\"norm\"><span style=\"line-height:2.0;\">It was just for one night. That’s what I told myself, anyway. He would come over, fix the water heater, I would make him dinner as thanks, then he would go. Not a big deal. Definitely not a date. I picked up my cell and dialed those familiar numbers. He picked up.<br>\r\n\t“Hey babe.” <br>\r\n\t“Cliff, don’t call me that.” <br>\r\n\t“Don’t be like that, babe.” he said. I wanted to argue but picking a fight with him was not going to get me hot water anytime soon. <br>\r\n\t“I don’t have any hot water. The heater must be on the fritz again. Could you come over and look at it?” I asked. While Cliff was a lying, cheating, SOB, he was also a master plumber. <br>\r\n\t“You really need a new one, Sadie, I told you that the last time I fixed it. It might just be the pilot light but it could be a heating element. Either way the thing is old as the hills. I could probably get you one. Just say the word.” As tempting as a free hot water heater was, I knew the magic “word” and I didn’t think putting that unfaithful ass’ diamond back on my finger was worth reliable hot showers. <br>\r\n\t“Will you just come look at it? I’ll fix you supper. I have some peach cobbler too.” I couldn’t help the knowing grin that spread across my face.<br>\r\n\t“Your Mamaw’s recipe?” He sounded like a little boy on Christmas morning.<br>\r\n\t“Do you have to ask?” I said. He laughed. <br>\r\n\t“Touche. I’ll be there in 10.”<br>\r\n\t“Thanks, Cliff.” <br>\r\nWith a sigh I walked down the hall to my bedroom and sat down heavily on the bed. It felt nice to lie there on my soft down comforter for a minute and rest my aching back. It had been a long day at work. As the Chief Concierge at Blackberry Farms, one of the nicest mountain resorts in the country, I had 51 rooms worth of obscenely wealthy guests to please. Not exactly the easiest task. The last thing I wanted to do was make supper for Cliff, but I badly needed a hot shower. <br>\r\n\tI forced myself up off the bed, kicked off my shoes, and opened the closet in search of something a little more practical than a ruffled blouse and a pencil skirt. I managed to change into a  pair of cut off’s and an old Brave’s t-shirt and carefully brush out my long chestnut hair before the doorbell rang. Before I could even make it out of my bedroom it rang again. I could already feel my patience running short. I grabbed the door knob and took a deep, calming breath before opening it. <br>\r\n\tThere he stood, a truly beautiful man in tight jeans and a clean white t-shirt. He had his hair messed up in that way that really took effort and he smelled of Old Spice. Well, someone viewed this as a date.  He stood there, leaning against the door frame as a lopsided grin spread across his face.<br>\r\n\t“You gonna invite me in?” He said with a deep chuckle that broke the spell. I closed my eyes briefly and backed away from the door. The ache was back. I missed him. There was no denying it but I hated myself for it.<br>\r\n\t“Of course, come on in.” I said, turning my back to him and taking a few steps away. <br>\r\n\t“You know, not that long ago I didn’t have to knock or wait for you to invite me in.” he said. I turned towards him, my throat tight.<br>\r\n\t“Don’t do this, Cliff. What’s done is done. You can’t take it back.” I refused to cry. He didn’t deserve my tears. He rushed forward and took my hands in his before I had time to react. My tiny hands fit perfectly in his larger grasp. His hands were warm and rough and so familiar. I could feel his eyes on me, searching my face, but I refused to meet his gaze. He dropped my hands and gently lifted my chin so I was forced to look into his wide hazel eyes. <br>\r\n\t“What can I do? Tell me and I’ll do it. I wanna come home for good.” he said and I knew he meant it. He would do anything to fix this but how long would it last? This wasn’t the first time he’d wandered but I had promised myself it was the last. I opened my mouth to reply, to tell him to go to hell, to tell him to get out of my house and out of my life and let me move on, let me get over him and find someone who wouldn’t lie to me, cheat on me, and humiliate me. But I didn’t.<br>\r\n\t“I better check on the cornbread. You mind seeing what you can do about the hot water? I am desperately in need of a hot shower.” I moved away from him and headed into the kitchen. He must have headed to the laundry room, where the hot water heater was because when I turned back around he was gone. <br>\r\n\tI set to work on dinner, boiling the beans and dicing the ham and soon I lost myself in the mindless labor and the pain eased a bit. </span><br>\r\n</td>",
        "id":1981387,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1429999980,
        "modified":1429999980,
        "pretty_title":"Sadie's Choice"
    }
}