{
    "chapters":{
        "1":{
            "author_id":"p89p",
            "author_name":"Nemesis T-Type",
            "choices":[
                "Nightfall Part II"
            ],
            "content":"<div class=\"\"><div> <span>          You yawn as you take the whistling pot of hot water off the stove top and carry it over to the mug that sits on the counter top. Being careful not to spill any, you slowly pour the water into the medium-sized mug, setting the pot down on the granite as you grab the teabag to toss it in. You steep the herbal tea bag slowly as you walk over to the living room couch and sit down next to your best friend Emily. You notice her shivering slightly in the t shirt and pj bottoms you lent her as you set down the mug on the coffee table in front of her.<br>\r\n\"Thank you,\" she says softly, almost a whisper.<br>\r\n\"Sure sweetie,\" you say to her as you pick the mug up and hand it to her.<br>\r\nShe sips at the tea slowly as she sits up and crosses her legs.<br>\r\n\"You still chilly?\"<br>\r\n\"A little,\" she says again, her voice soft as can be.<br>\r\nYou reach for the arm of the couch and grab the neatly folded blanket resting on it. You spread the blanket in the air before draping it over her shoulders.<br>\r\n\"Thank you,\" she repeats and then surprises you by leaning into you and resting her cheek on your shoulder.<br>\r\nYou put your arm around her and rub the length of her back in an effort to console her. She holds the mug up to her lips and takes another sip. She puts the mug back down and as if to let you down, she pulls away from you. You breath a silent sigh of relief to yourself as you realize the separation is only momentary. Emily hooks the blanket around you so that you both are covered.<br>\r\n\"I ain't rude,\" she says and you both muster a giggle.<br>\r\nShe returns her original resting position against your side while you simultaneously return your hand to her back. You notice her eyelids loosing their strength.<br>\r\n\"You look exhausted hun... Why don't we get you to your room so you can wind down and get some sleep?\" you suggest.<br>\r\n\"Okay,\" she says softly.<br>\r\n          You gently nudge her up off the couch and stand up yourself. You step out of the blanket and wrap it firmly around her before beginning to guide her to the guest bedroom. You reach the door, open it and turn the light on. The both of you walk in and sit on the large mattress in the center of the room.<br>\r\n\"Okay so you said you brought some stuff with you right? Do you want to bring it in so you can settled?\"<br>\r\n\"Maybe tomorrow or something... I'm so tired.\"<br>\r\n\"Sure. So we'll just get you settled in sometime tomorrow. Okay so the remote for the TV is on the nightstand, there's food and plenty of stuff to drink in the fridge and if you need anything just let me know okay?\" you say, putting your hand on her back again.<br>\r\n\"Uhuh.\"<br>\r\n\"Okay. I'll see you in the morning then,\" you say before standing up and taking your leave. As you reach the door...<br>\r\n\"Ryan?\" Emily says standing up and rushing over to you.<br>\r\n\"Yea-\"<br>\r\nBefore you can answer, Emily's arms are around you and she's hugging you tightly. You hands make contact with her waist and slide around to meet each other in the back. The warmth of her body spreads through you as you savor the embrace.<br>\r\n\"Thank you,\" she says softly in your ear.<br>\r\n\"Em.... I'm always here for you hon... You say rubbing her lower back. You wait for her to pull away but she doesn't. The both of you embrace for what seems like an eternity before you finally feel her arms loosen and pull away. As her arms leave you, her face rises to meet yours and to your shock, her lips meet your and Emily gives you a shy and swift kiss. Before you can gauge your feelings, her lips are pulled from yours.<br>\r\n\"Goodnight,\" she says with a smile of embarrassment and you respond in kind.<br>\r\nYou walk to the hall and enter your room, a pep in your step as you close your bedroom door behind you.<br>\r\n<br>\r\n<div align=\"center\"><b>1:00 am</b></div><br>\r\n<br>\r\n          You yawn groggily as you reach for the doorknob. You enter the hallway and begin making your way to the bathroom at the end of the hall when you hear something. You reach the living to see that Emily is sitting on the crouch with her knees up tightly in the fetal position. As you get closer, it becomes clear that you were hearing the sounds of her weeping.<br>\r\n\"Em... Hon?\" you say as you walk to the couch and sit down next her. Her breathing sounds stressed and you notice that her body is shaking slightly. <i>Poor Em... She's having a panic attack.</i> You put your hand on her back again and as it makes contact, she lifts her head, looks at you and begins to sob.<br>\r\n\"Come here sweetie.\"<br>\r\nYou sweep your arm around her back and spread your legs as she turns in slides in between the. You cradle her back and put your other hand on her thigh as she sits sideways in front of you. You grab the throw blanket from the side of the couch spread it on her as she buries her face into you chest. You feel the moisture of her tears dampen through your shirt as you hold her gently while she cries. <br>\r\n\"It's okay Em... Just breath, you're gunna be okay,\" you say as you plant several innocents kisses on her head. As her sobbing intensifies, she turns into you and puts her arms around your shoulders. You wraps yours around her and pull her into you tightly. You hope that the pressure will ease her anxiety, something you read somewhere. As you constrict and tighten your embrace, you feel her breathing slowly start to normalize. Her shaking eventually draws to a close and now she simply rests in your arms sobbing, her pain flowing from her at the seams. <br>\r\n          All you can think to do is just hold her and stroke her back and arms soothingly.<br>\r\n\"You're okay sweetie... You're okay.\"<br>\r\nYou wait patiently for her crying to subside and continue trying to soothe her. After several minutes, it does, and she lifts her face from your now soaked shirt.<br>\r\n\"Oop, hold on one sec,\" you say pinching your shirt and pulling it up to her eye. \"You missed that,\" you say wiping her eye.<br>\r\nA giggle forces its way out of her as her lips crack a slight smile.<br>\r\nI'm assuming you couldn't sleep?\"<br>\r\nShe shakes her head.<br>\r\n\"I feel asleep for like an hour but I woke up in a panic and I couldn't fall back to sleep,\" she says softly. \"That thing you did... when you squeezed me... What was that?\"<br>\r\n\"Oh, I read that somewhere. Supposed to help with panic attacks and anxiety.\"<br>\r\n\"Yeah it was... it helped,\" says shyly.<br>\r\n\"Good,\" you say patting her shoulder. \"You wanna try and see if you can sleep now?\"<br>\r\n\"Okay. But could you maybe just stay out her with me for a little while until i get sleepy again?\"<br>\r\n\"Sure.\"<br>\r\nYou reach for the remote and turn the TV on.<br>\r\n\"A little background noise might help,\" you suggest to which she nods.<br>\r\nShe begins to turn and instinctively you turn with her. As if naturally, She turns away from you and the two of you, in sync, lie down on the couch. Without words or thoughts, you pull the blanket over the both of you and then wrap your arms around her, resting one hand on her stomach and the other on her hip. You feel her hand slide over yours as she scoots back against you, your bodies' align, and.... You spoon. light airy scent of her hair wafts through your nostrils, relaxing you and soon, the two of you drift off to a deep sleep.<br>\r\n<br>\r\n<b><div align=\"center\">9:00 am<br>\r\nDay 1</div></b><br>\r\n<br>\r\n          You awake from your slumber and yawn as you look over at the digital clock on the cable box display. You yawn again and smile to yourself before you notice that your hands did some moving over their own in the night. You look over to see that your top hand somehow made its way to Emily's breast at some point during your slumber. As you slide it away in embarrassment, you feel the stiff bump of her nipple through the t shirt and you can't help but feel slight excitement. Emily stirs slowly as your hand reaches it's origin point and she yawns. She turns onto her back and looks at you.<br>\r\n\"Mornin,\" she says flashing you a sweet smile.<br>\r\n\"Hey there,\" you say smiling back.<br>\r\nThe two of you sit up and take the blanket off.<br>\r\n\"Coffee?\" you ask as the two of you stand up and stretch.<br>\r\n\"Coffee.\" She says.<br>\r\nYou grin and walk over to the coffee maker in the kitchen. As you begin making the pot, Emily stretches again and walks over.<br>\r\n\"You take anything in yours?\"<br>\r\n\"Uh.... I don't know, do you have any creamers?\"<br>\r\n\"I think I have one or two in the fridge,\" you say pointing over to it.<br>\r\n\"Okay,\" she says in her cute squeaky voice.<br>\r\nShe walks over to the fridge and opens it, pulling out a green tub. The coffee maker brewing comes to a stop and you pull the carafe out and pour the coffee into to identical mugs. Emily comes up on your side.<br>\r\n\"You want some?\"<br>\r\n\"Nah I'm good thanks,\" you say picking your mug up as she opens the bottle and pours some of the creamer into her mug. The two of you walk back to the couch and you sit down comfortably.<br>\r\n          Emily follows suit and sits down and curls up next to you. The two of you sit and relax in the early morning as the sun slowly begins to shine through the three ground level windows of your basement apartment. In a moment of spontaneity, Emily looks at you, smiles, and rest her cheek on your shoulder.<br>\r\n\"Thanks for keeping me grounded last night,\"<br>\r\n\"Em... you don't have to keep thanking me, you're my best friend and I love you,\" you say as you put your arm around her again and your arm feels familiar territory. You eye her forehead cautiously to which she notices.<br>\r\n\"It's okay, I kinda like it.\"<br>\r\nYou plant another soft kiss on her dainty little brow. She smiles and takes another sip of her coffee.<br>\r\n\"So I figured we'll get your stuff in, get you settled and then maybe go to some stores, get anything else you might need.\"<br>\r\n\"Well... that might be a problem...\" She says.<br>\r\nYou flash her a look of confusion.<br>\r\n\"I left my cards and everything because I was in such a rush and forgot. I canceled them and ordered new ones but they won't be here for a couple days... so I kinda have no money,\" she says looking down at her feet in embarrassment.<br>\r\n\"Like I said, we'll get you unpacked, go and get some essentials for you for here and then maybe order some takeout or something,\" you say and rub her shoulder again to get the point across.<br>\r\n<br>\r\n  <br>\r\n</span></div></div>",
            "created":1593770340,
            "id":2860764,
            "title":"Nightfall"
        },
        "11":{
            "author_id":"p89p",
            "author_name":"Nemesis T-Type",
            "choices":[
                "A Week Passes"
            ],
            "content":"<div class=\"\"><div> <span>Emily smiles at you.<br>\r\n\"Okay.\"<br>\r\nShe returns her head to your shoulder and the two of you relax in the early morning light.<br>\r\n<br>\r\n<b><div align=\"center\">Evening</div></b><br>\r\n<br>\r\n          You fumble for the keys as you reach your door at the bottom of the stairs. You get the door open and the two of you enter. It was an eventful day. It took you guys a couple of hours to get Emily settled in then the shopping was another 2 and now you are starving.<br>\r\n\"Okay I'll get the plates and stuff, can you get out the food?\" you ask.<br>\r\n\"Uhuh,\" Emily says as she walks over to the couch and puts the bags of chinese takeout on the coffee table. She begins taking the contents out of the bag while you grab plates and utensils from the kitchen. You grab two glasses and a bottle of wine and run back to the couch. You join Emily on the floor as she opens two of the containers. You serve yourselves and as you eat you make chit chat.<br>\r\n<br>\r\n<div align=\"center\"><b>After Dinner</b></div><br>\r\n<br>\r\n          The two of you sit on the floor with the TV on in the background. You fill your glass one last time before emptying the last of the wine into Emily's glass and placing the empty bottle on the table.<br>\r\n\"Thank you good sir,\" she says in a feigned masculine tone before giggling.<br>\r\n\"You're quite welcome,\" you say in an equally proper tone and sharing in her laughter.<br>\r\nAfter the laughter subsides you take your knife from the table and mockingly tap your glass several times with it.<br>\r\n\"Attention, attention,\" you say as Emily turns to face your side, stretches her legs and rests them down on yours.<br>\r\n\"Here's to a new chapter in your life,\" you say seriously.<br>\r\nEmily smiles at you and holds her glass up close to yours. You you rest your free hand on her bare thigh, noting how smooth her skin is in the back of your head. You clink your glasses together and take sips from them respectively. Emily puts her glass down on the table and puts her hand over yours on her thigh.<br>\r\n\"Ryan... Thank you... for last night... for today... for letting me stay here... for everything... I-\" you stop her.<br>\r\n\"You're one of my best friends and... I love you. I'm happy that you here and this is your home, for as long as you want it to be.\"<br>\r\nShe smiles at you again.<br>\r\n\"I love you too,\" she says sweetly.<br>\r\n          She leans forward and pecks your cheek playfully and as you look at her, for the first time you notice how beautiful she is. Her sun-kissed brown hair, pulled neatly back in a ponytail, hangs down her left shoulder. Her cap sleeved blue tee shirt fits perfectly, creating what you now notice to be a very attractive silhouette, which leads down to her cute black track shorts. At the same time that you notice her beauty for the first time, you experience the first pang of desire. Suddenly, you feel yourself drawn to her lips. As you look at her, she notices the change in your expression. You feel your skin become hot as your place your free hand on her opposite leg and slide your other hand from her thigh up to her side. You pull her in slightly, noticing that she moves slowly with you, making you breath an internal sigh of relief. Your hand advances further, reaching her back as her face meets yours. She puts one hand on the floor and the other on your chest as you slide her onto her lap. You bring your lips dangerously close to hers. You whole body feels afire, every muscle tense with nerve and suddenly you feel as if you can't, you want to kiss her more than anything ever but your nervousness stops you just inches from her lips.<br>\r\n          <i>I'm gunna blow this... I'm gunna ruin the only moment-</i> To your shock, your thought is interrupted by Emily. She pulls you in slightly, closing the distance and your mouths make contact. Her lips send tingles through your skin as the two of you kiss. She pulls away with smile, teasing you. You give chase and make contact again, tasting the the last remnants of wine on her lips as you hungrily grip them with yours. You pull her body back in from her playful retreat and a kiss quickly becomes a heated make-out session. Emily stands up on her knee and pivots over you, resting her knees on the floor on both sides of you and sits in your lap. Her soft bottom presses down on you, enticing your already budding erection as you slide your arms around her back and rest your hands just above her ass. You slide your hands under her shirt and up her bare back and as the soft touch of her silky skin tantalizes your fingertips, you pull her tighter into your embrace. She puts her hands on your shoulders as your lips move down to the side of her neck, and begins to straddle you slowly and playfully.<br>\r\n\"Em...\" you whisper in a pant as she rubs her bottom against you, stimulating your now, full blown hard-on.<br>\r\n          You continue to kiss her neck. Your hands, acting of their own accord, slide up and around to her front to meet her breasts. She leans back against the coffee table with a gasp as you follow her, leaning toward her. She unfolds her legs and wraps them around your waist as you kiss the base of her neck and explore her breasts with your fingers. The soft, plump flesh sends waves of excitement through your body as rub and caress them under her shirt. You lean back against the sofa as Emily straddles you harder, grinding and rubbing you with her crotch and bottom and making you squirm. You feel a hard knob and realize it's her nipple. You knead it with your thumb as you slide your other hand back down her side and rest it on her upper hamstring just below the hemline of her track shorts. She starts moving her waist in a circular motion, massaging your crotch and making you feel incredible with each gyration of her hips. <i>Fuck... She's gunna make me cum...</i> You think to yourself as you grip her butt. Her body hits a sensitive spot, making you cringe with ecstasy and your hand reflexively squeezes her breast.<br>\r\n\"Uhh,\" Emily moans softly as a wince flashes her face.<br>\r\nIn response to this, she pushes down on you and straddles you harder.<br>\r\n          You can't hold on much longer. Even between fabrics of your clothes, her body stimulates you with each wayward motion, bringing you closer to a tremendous orgasm.<br>\r\n\"Em.... I'm gunna cum,\" you moan.<br>\r\nEmily place her hand on your cheek and strokes it with her thumb. You grip her butt tightly and grind it into you while simultaneously thrusting your crotch forward into her. You feel the physical pleasure build to a climax as your cock reaches it's stimulation threshold and your whole body tenses up.... You reach glorious orgasm as waves of physical bliss surge through your groin. You wrap your arms around Emily and pull her close so that your bodies hug tightly. Your crotch throbs against her as you hug her tightly. You feel the warmth of her hand cup the back of your head as your stiff posture slowly relaxes and you slump into the wall of the couch with her. As your ecstasy slowly subsides, you hold Emily tightly, pawing lovingly at her cotton covered back. You slowly loose your hold of her and hold your head back up from your exhausted slump. Emily looks at you, her face inches away, and smiles. She stretches her jaw out and lets you kiss her again before rising up on her knees and out of your lap. <br>\r\n          \"Em... That was amazing... I don't- I don't know what to say,\" you stammer.<br>\r\n\"It was just a one time thank you thing okay?\" she says in a friendly but firm tone. \"Ya got me tipsy and i wanted to give you a little something for being so amazing but nothing like this is gunna happen between us again... okay?\"<br>\r\n\"Ye-yeah... I understand,\" you say, as you slide up and back onto the couch. \"Can I- Can I still hug you and stuff?\" you ask solemnly.<br>\r\n\"Yeah,\" she says giggling. \"I mean nothing were anything gets hard or wet-\" she grimaces \"is gunna happen again.\"<br>\r\n\"Okay.\"<br>\r\nShe sits down on the couch next to you.<br>\r\n\"I think I'm gunna head inside, it's been a long day and I'm pooped.\"<br>\r\n\"Okay, have a good night.\"<br>\r\n\"You too and...\" She leans in and gives you one last peck on the cheek before gently gripping your hand. \"Thank you again, for everything. I'm so thankful that I have a place to live where I can be myself. Goodnight,\" she says sweetly as she gets up and walks to her bedroom door.<br>\r\n\"Night Em,\" you respond as she she disappears behind the closing bedroom door.<br>\r\n</span></div></div>",
            "created":1594026840,
            "id":2862405,
            "title":"Nightfall Part II"
        },
        "111":{
            "author_id":"p89p",
            "author_name":"Nemesis T-Type",
            "choices":[
                "Take Her to Her Favorite Restaraunt (Erotic)",
                "Cook and Have a Quiet Dinner at Home With Emily and Her Sister (Romantic)"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Things in the apartment proceeded quite nicely the week following Emily's first two days in your apartment. Although she was adamant that nothing physical would happen between the two of you again, she did open up slightly with each passing day. She allowed you to cuddle with her once again and there were a few extra kisses here and there. And now the 7th day comes... Emily's birthday is tomorrow and you devised the perfect way to celebrate. </i></div></span></div></div>",
            "created":1594027920,
            "id":2862413,
            "title":"A Week Passes"
        },
        "1111":{
            "author_id":"p89p",
            "author_name":"Nemesis T-Type",
            "choices":[
                "Emily Shows Her Apprecation With Her Feet",
                "Emily Shows Her Appreciation With Her Hands... and Mouth"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><b>You decided to take Emily to her favorite restaurant for her birthday. You made the reservations four days before and everything went great. Emily was flirtatious at the table and even held your hand as you waited for dessert. Things were on a good path until the two of you made your exit. As you both made your way to the car, a rowdy drunkard outside the restaurant and catcalled at Emily. When she ignored his inappropriate calls, he proceeded to call her a slut. This was too much for you and you turned around to defend your friend. Things got heated and you threw a punch which didn't land quite well. You received a punch to the gut which knocked you to the floor. With the wind knocked out of you, the drunkard landed a stomp to your thigh and a kick to your face before Emily screamed out for him to stop. While he was distracted, you retaliated with a swipe at his leg which stumbled him. You got up on your feet and connected with a powerful strike to his jaw, successfully disabling him from further confrontation. Emily proceeded to help you into the car and you drove back to your apartment. The two of you have just gotten back.</b></div><br>\r\n<br>\r\n          \"Come on hon, let's get you to your room,\" Emily says as she closes the door to the apartment. <br>\r\nWith your arm around her shoulder, she helps walk you to your bedroom. She lies you down on the bed and you wince in pain as your stomach straightens out.<br>\r\n\"I'm gunna go get some ice,\" she says and runs out of the room. <br>\r\nShe returns shortly after with two ice packs. She walks over to the bed and lies down beside you, putting one ice pack on your stomach and holding the other gently to your face.<br>\r\n\"How do you feel sweetie?\" she asks pulling the ice pack away. She strokes you cheek with her fingertips.<br>\r\n\"I'll be okay Em, relax.\"<br>\r\n\"Yeah but you're stomach turning black and blue and your cheek, it looks so painful,\" she says worriedly.<br>\r\n\"I mean yeah, I'm in pain but it will pass hon, don't worry,\"<br>\r\n\"Okay...\" she says stroking your cheek again. \"I'm just gunna go get changed and then I'll bring you some aspirin and a glass of water,\" she says as she pats your thigh.<br>\r\n\"Okay.\"<br>\r\nEmily quickly bounces off the bed and strolls out of the room. You lie back and rest your head on the bed. You look down at the neck of your shirt and see small bloodstains.<br>\r\n\"Shit,\" you mutter to yourself as you sit up. You wince and groan as you feel the surge of pain in your abdomen. You reach a sitting position and pull off your shirt. You toss it into the corner of the room and it lands square on the floor next to your laundry hamper. You reach down and unbutton your dress pants, sliding them off and tossing them over to your shirt before reaching down to your dresser drawer and pulling out a pair of gym shorts. You Slide them on, wincing again from the pain in your leg and stomach. You prepare to get up and get an undershirt from your far dresser when Emily returns.<br>\r\n          \"What do you think you're doing mister?\" She asks you as she walks over to the bed and sits down with her legs crossed facing you at the foot of the bed.<br>\r\n\"I was just gunna go get a-\"<br>\r\n\"Nu-uh, lie down she says leaning forward and handing the glass and pills to you. <br>\r\nShe leans back and puts her hands on the edge of the bed, using them to hold her upper body up. <i>God she's so damn cute,</i> you think to yourself as you take her in. Emily uncrosses her bare legs and straightens her legs half way, resting her feet on the mattress next to your waist. You eye her fluffy fuzzy socks as she looks at her phone. You diverts your eyes up her bare, trim calves to her thick, toned thighs. She crosses her feet and continues to look at her screen. You continue eyeing up, taking in the view of her thankfully very short, blush-pink waist ringer shorts. You continue further, past her shorts, and pause at her tight, revealing baby blue tank top. It's high cut, leaving her flat tummy bare for you to see. You resume and stop at her average sized breasts. What they lack in size, they more than make up for in stature. As you eye the perfectly shaped, vivacious bust that encompasses her chest, she turns her attention away from her phone.<br>\r\n          \"Lie down!\" she says firmly, following with an exasperated smile before placing her foot on your chest and gently prodding you down with her toes. You laugh and wince as you feel the pain from your stomach muscles.<br>\r\n\"What?\" she asks in an adorably defensive tone.<br>\r\n\"Nothing... It's just... you're cute when your bossy,\" you say laughing.<br>\r\nEmily flashes you a facetious frown of sadness.<br>\r\n\"You're lucky you got hurt for me, otherwise i'd-\" she mimes hitting you by sitting up and bawling a fist in the air.<br>\r\nYou laugh again, and she joins in with a small giggle.<br>\r\nEmily keeps her foot pressed on your chest and looks back at her phone.<br>\r\nThank you... by the way... What you did... It was... It was really sweet,\" She says shyly, unable to take her gaze away from her phone....</span></div></div>",
            "created":1594032840,
            "id":2862472,
            "title":"Take Her to Her Favorite Restaraunt (Erotic)"
        },
        "11111":{
            "author_id":"p89p",
            "author_name":"Nemesis T-Type",
            "choices":[
                "Emily Gives You a Heavenly Warm and Fluffy Sockjob (Erotic)",
                "Emily Gives You an Intensly Satisfying and Sensual Footjob"
            ],
            "content":"<div class=\"\"><div> <span>          \"Aye Aye captain,\" you say with your best impersonation of popeye before giving her a mocking salute. She grins and looks at you.<br>\r\n\"You think you're real funny don't you.\"<br>\r\n\"Not as funny as you boss,\" you say with a devious grin as you lift yourself up with your forearms.<br>\r\n\"Stay down, I don't want you to get more hurt,\" she says pressing her toes into your chest again and playfully pushing you down. The warmth of the soft fluffy cotton feels good against the bare skin of your chest.<br>\r\n\"But I don't wanna!\" You say mimicking an unruly toddler.<br>\r\n\"Please,\" she asks, flashing a sad puppy dog face at you that could melt even the coldest heart.<br>\r\n\"Okay....\" you say defeated. \"But only because that actually feels good,\" you finish, eyeing her socked foot pressing into you. She smiles excitedly.<br>\r\n\"I know right?! Feel how soft they,\" she says giddily resting her foot on you and lifting her toes up. <br>\r\nDespite your excitement, you reach for her foot as calmly as you can and grip it softly. You slide your thumbs gently up the arch of her socked sole several times slowly.  The thought of her smooth soft sole under the warm fluffy barrier of her sock sends a twitch to your crotch. <i>Shit... Not now,</i> you think as your thumbs continue to stroke the cotton. You try to push the thoughts away fiercely to avoid getting noticeably \"excited,\" but, as if to poke the fire, Emily takes her other foot and with the weight of a feather, gently traces a circle on your stomach at the sight of your injury. You tense up to avoid becoming erect.<br>\r\n\"Making it feel a little better?\" Emily asks, completely innocent in thought and totally unaware of how \"good\" it actually feels. <i>God... You're torturing me Em...</i> You think to yourself as you answer aloud.<br>\r\n\"Uhuh,\" you say closing your eyes and trying to stop your body at all costs. You slowly gain the upper hand on your baser urges. That is until you feel the same warm and fluffy cotton gently brush against your bruised cheek. <i>Fuck...</i> You open your eyes to see Emily rubbing your stomach with one foot and dabbing your cheek tenderly with the toes of her other foot. There's no use fighting now. Your face becomes warm with embarrassment as the blood races down to your crotch. By the time Emily finishes her fifth circle, you're hard on is already full blown. You look at her face and thank god that she's drawn to her phone screen again. You close your eyes and wince in anticipation of what you know is going to come as soon as she locks that screen and returns her gaze.<br>\r\n          You wait in terrifying horror for the gasp and the \"You fuckin' freak!\" that you know is coming. After several moments, you experience a slight confusion as nothing comes. You slightly creep your eye open to see that she is still using her phone.<br>\r\n\"Sorry just gotta answer this email, I'll be done in a sec,\" she says continuing to type.<br>\r\nYou close your eyes again and try as hard as you can to calm your body. You're frustration builds as you continue your attempts but it's no good. The more you try, the more you feel the arousing soft and fluffy cotton, the more you imagine her cute feet.<br>\r\n\"Okay, done,\" you hear her say and cringe again as the clicking sound of her screen locking resonates in your ear shortly after. You feel her foot lift away from your stomach. <i>Shit... this is it. Get used to living alone again</i> you think to yourself as you wait for it and within a split second, your tension vanishes as you feel a gentle pressure build at the base of your crotch. You open your eyes slightly and are immediately stunned by the sight in front of you. Emily's mouth hangs slightly ajar in interest rather than disdain ash she gently nudges your crotch with her toes curiously.<br>\r\n          \"Are you... hard?\" she asks, again more curiously than disgusted. <br>\r\nYou close your eyes as the red blush of embarrassment fills your cheeks.<br>\r\n\"Yeah... I'm sorry... I kinda have a teensy weensy bit of a fo-foot fetish,\" you nervously stammer and open your eyes again.<br>\r\n\"I didn't know the socks felt that soft,\" she says giggling as she presses her toes down a little more courageously against your shorts. You relax a little as she begins to investigate your crotch with her toes exhibiting a genuinely innocent fascination. You feel the pressure of her foot move up to the base of your erection and your cock twitches slightly from the sensation.<br>\r\nWoah,\" Emily hoots and lifts her toes off in reaction to the unexpected activity.<br>\r\nShe presses her toes back down after waiting a moment and slowly swipes the length of your shaft with them.<br>\r\n\"Wowza, that's hard,\" she says as her mouth drops open in innocent surprise.<br>\r\nShe gently glides them up your crotch again making you shudder.<br>\r\n\"That must feel really good!\" she says letting out a relaxed giggle.<br>\r\n\"Yeah...\" you say with a strain in your voice as she strokes you again.<br>\r\n\"Well... I guess. If it'll make you feel better,\" she says adorably feigning reluctance.<br>\r\nShe slides her foot down your chest and to your crotch to meet the other. She taps her toes together with a giggle and then gently starts to rub your crotch. You let out a blissful sigh as she kneads you tenderly.<br>\r\n\"Good?\" she asks in a bubbly high pitch.<br>\r\n\"Uhuh, you gasp as you watch her investigate playfully.<br>\r\n\"You wannuhhhhhh,\" she says dragging the wanna in a quizzical manner. \"Take your shorts off?\" she finishes.<br>\r\n\"Is that okay?\" you ask nervously.<br>\r\nShe furrows her brow as if deciding.<br>\r\n\"Uhuh,\" she says and nods willingly.<br>\r\nShe slides her feet off your crotch and onto the sheets, allowing you to slide your shorts down. You grip them and cautiously slide the down. Your dick bends against the rim, popping out as you slide them all the way down.<br>\r\n\"Wowza!\" Emily exclaims again.<br>\r\nYou laugh nervously as she eyes it.<br>\r\n\"Okay so... never really done a footjob before so should I keep my socks on you want me to take em off?\" she asks curiously.<br>\r\nJust the earing her talk about it gets you close...  </span></div></div>",
            "created":1594118820,
            "id":2863296,
            "title":"Emily Shows Her Apprecation With Her Feet"
        },
        "111111":{
            "author_id":"p89p",
            "author_name":"Nemesis T-Type",
            "content":"<div class=\"\"><div> <span>          \"Could you keep them on?\" you ask submissively.<br>\r\nEmily giggles.<br>\r\n\"Okay. You want a fluffy footjob?\" she asks playfully.<br>\r\nYou nod eagerly.<br>\r\n\"Okay,\" she says and laughs again.<br>\r\nEmily lifts her foot again and with the weight of feather, gently places her it at the base of your shaft. You gasp as the velvety fluff makes contact with your bare skin and your cock twitches, jerking up briefly from the sensation. You look down and notice for the first time the cat paw design of her fleece sock.<br>\r\n\"Rarrr\" you moan softly making Emily giggle more.<br>\r\n\"Like my kitty cat socks huh?\" She asks sliding her other foot up your stomach and back to your chest.<br>\r\n\"Sexy kitty cat,\" you say petting her warm socked foot.<br>\r\nShe begins to simultaneously knead your chest with the toes of her right foot and caress the length of your cock with the sole of her left. You continue to pet her while she kneads you tenderly.<br>\r\n\"My sexy kitty feet make you feel good?\" she says in a higher register, stirring your lust audibly.<br>\r\n\"So soft,\" you moan.<br>\r\n\"Good, kitty wants to you to feel good,\" she says arching her right foot up so you can feel up the sole of her sock.<br>\r\n\"Well kitty is very succeeding,\" you groan.<br>\r\n\"God Em... You're so fuckin' cute,\"<br>\r\n\"I thought I was sexy?\" She says swirling her lips in a look of innocent confusion.<br>\r\n\"You are!\"<br>\r\n\"Well... Which is it? Cute... or.... Sexy?\" she asks.<br>\r\nShe puts her hand on the center of her stomach and seductively slides it down under her shorts. Her mouth opens seconds later and she exhales closing her eyes, clearly mimicking masturbation.<br>\r\n\"SEXY!\" You yelp. \"Sexy.\" you exclaim again.<br>\r\nShe flashes you another puppy dog look and bites her lower lip, pulling her feet away.<br>\r\n\"Not cute though?\" she whines in a higher pitch then you've ever heard her use before and holds her feet up just above your cock, teasing you cruelly.<br>\r\n\"Of course you are. You are....... A cute, sexy, hot, adorable, pretty, perfect kitty...\" you say slowly and seductively.<br>\r\n\"Raaar\" she meows playfully and pats her feet down on you, making you jump.<br>\r\nSlowly, Emily begins to rub you with the soles of her socks, massaging the tight skin of your shaft with the impossibly soft cotton. You begin to make audible groans of approval.<br>\r\n          \"Okay so, how do I do this?\" she asks curiously.<br>\r\n\"Try holding up.\"<br>\r\n\"Okay,\" she says softly.<br>\r\nShe makes several attempts to stand your cock up. Using her toes, she lifts from under a gets you halfway up before you slip out of her grasp.<br>\r\n\"Woah,\" she says followed by a giggle. <br>\r\nShe grins at you as you bite your lip. She tries again, getting you up all the way before  you slip out again. She tries one last time, getting you all the way up...<br>\r\n\"So good Em... Get it in between your soles,\" you suggest.<br>\r\n\"Like this?\" she asks enthusiastically as she slides it in between her soles and holds it in place.<br>\r\n\"Just like that babe,\" you say in a proud sigh of bliss as you feel the warmth of her socked feet press against you from both sides. Your cock twitches between them.<br>\r\nEmily slowly slides her feet down, pressing them to your groin at the sides. She holds them there for a brief moment before sliding them back up to your tip.<br>\r\n\"Rub it like this?\" she asks.<br>\r\nYou look up away from her feet and at her face. The expression of yearning approval is enough to make you melt away into orgasm here and now, but you focus on keeping yourself in control.<br>\r\n\"Just like that Em,\" you say.<br>\r\n          With an eager smile on her face, she begins to jerk you off, playfully sliding her socked feet, up and down the length of your shaft, giving you sensations you never imagined.<br>\r\n\"Fuck Em\" you groan.<br>\r\nShe giggles and keeps stroking. The soft tufts of cotton massage and stimulate you, building your satisfaction and pushing you towards orgasm with each tender stroke.<br>\r\n\"Feels good?\" she asks.<br>\r\n\"Uhuh,\" you say, your voice cracking from the pleasure.<br>\r\nSuddenly, Emily presses her feet together tighter and starts to stroke you fast and hard. <i>Em.... Oh god,</i> you think as you're mind struggles to catch up pace with her feet.<br>\r\n\"How bout now?\" she says giggling playfully.<br>\r\n\"Em... Slow down... You're gunna make...\" You pant as your senses flood with ecstasy.<br>\r\nBefore you can get out the rest of the sentence, the intense pleasure builds out of your control and you feel that build of pressure in the length of your cock that comes just seconds before. You fling your head back into the pillow and with Emily's warm, soft socked soles stroking you hard, you let go and cum harder than you've ever cum before.  <br>\r\n          You moan loudly as the bliss drives you insane and your cock erupts, shooting loads of your sperm out into the air. The first thick burst, shoots out high before falling back and spraying the top of her foot. A second shot streams out and splashes against the bare skin of her calf. The warm sticky juice begins to flow out, rushing out of the tip and running down your cock to her socked soles which eagerly soak it up. Your cock throbs in between her feet as the last of your cum drips out and dribbles down to her socks. Your panting and moaning slowly subside as Emily pulls her feet away and lets your cock fall Against your stomach.<br>\r\n\"Woah,\" you he Emily squeak in her trademark high pitch as she slowly rubs her feet together, spreading the thick goo and dampening her socks.<br>\r\nShe holds her feet up. The both of you look at the matted cotton of her socks, little tufts of soaked white fuzz.<br>\r\n\"Sticky socks.\" She says giggling as she rubs the cum-soaked cotton around with her toes. You look at her before resting your head back against the pillow. Today was a good day...<br>\r\n<br>\r\n<b><div align=\"center\">End</div></b><br>\r\n</span></div></div>",
            "created":1594716720,
            "id":2868259,
            "title":"Emily Gives You a Heavenly Warm and Fluffy Sockjob"
        }
    },
    "info":{
        "author_id":"p89p",
        "author_name":"Nemesis T-Type",
        "brief_description":"An XGC original erotic anthology.",
        "created":1593668580,
        "description":"<td align=\"left\" class=\"norm\"> You are Ryan, A 18-year old boy who's just reached sexual maturity. This series follows your exploits into the sexual universe.<br>\r\n<br>\r\nThis story is the second episode of the anthology. Emily is your best friend and your coworker. You find yourself relaxing one night in your living room when a knock comes at your apartment door. You open the door to find Emily, sopping wet and crying. She asks if she can stay with you for a couple of days as she can't stay in her home a minute longer. Despite your feelings for her (which she knows about) you let her in without a second thought.<br>\r\n<br>\r\nRules:<br>\r\n1. Fetishes are welcome; The only ones I would ask to leave out are defacation and urination fetishes<br>\r\n2. No torture (Sorry for any BDSM fans, not that I don't approve just not something I want to read)<br>\r\n3. ABSOLUTELY NO RAPE!!!<br>\r\n4. Being graphic is encouraged but be descriptive. (i.e. He jizzed on her face = *X* With a moan, he came, splashing his sperm on her forehead = *Check* )<br>\r\n5. Please keep the story in first person<br>\r\n<br>\r\nSo please, don't be shy, have fun, and help build a great interactive!</td>",
        "id":2225823,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1594713162/item_id/2225823.jpeg",
        "last_full_update":1594716720,
        "modified":1594716720,
        "pretty_title":"The Forbidden Worlds II - Emily"
    }
}