{
    "chapters":{
        "1":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "PC Master Race",
                "One Shirt at a Time",
                "The secret Game of Life"
            ],
            "content":"<div class=\"\"><div> <span>Just in case you skipped the intro, this is a story I will try to add a new set to each day depending on what route is the most popular so to start the question becomes what way should we go.<br>\r\n<br>\r\nMaster PC- Reality Altering Program use able on anyone Anywhere<br>\r\n<br>\r\nClothing Swap- the ability to swap parts with people by wearing their clothes<br>\r\n<br>\r\nGame- A magical game with magical effects </span></div></div>",
            "created":1595912400,
            "id":2876734,
            "title":"Which way to go"
        },
        "11":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Enter 'David Tompson'",
                "Enter 'Ellie Tompson'",
                "Enter 'Jessica Tompson'",
                "Leave the computer alone and go back to bead (the buzzing is gone)"
            ],
            "content":"<div class=\"\"><div> <span>You wake up in the middle of the night to a buzzing noise from down the hall from your room, normally it's either Alexander doing some late-night gaming or your mother asleep 'watching' infomercials. yet the sound was different, you turn to look at your alarm clock which reads <span class=\"clred\">3:34am</span> <br>\r\n<br>\r\n\"who could be up this late, or early?\" you say groggily to yourself. you try to go back to sleep but, it seems like the buzzing noise is only getting louder. at this point, you decide to get out of bed and investigate the noise so you can turn it off. as you open your bedroom door you see a flashing of blue to white light down the hall, coming from the office room your mother had set up for her arts and crafts.<br>\r\n<br>\r\nAs you approach the room you open the door, and sitting on the craft table is a laptop, your mother wasn't the most intelligent when it came to computers and besides your family's phones the only computer in the house was the one in the main room. <br>\r\n<br>\r\nThe screen stops flashing and goes full blue, confused you walk towards the laptop to turn off the irritating noise coming from it. as you reach for the power button the computer stops shrieking and starts to type<br>\r\n<br>\r\n<span class=\"clkhaki\">Hello new owner of the state of the art, reality changing, dream granting, <span class=\"cmaroon\">MASTER PC© </span>Please enter your name to gain ownership</span><br>\r\n<br>\r\n\"What the hell is this?\" you respond \"reality changing? must be a joke\"<br>\r\n<br>\r\nThe computer Flashes again <span class=\"clkhaki\">Please enter your name.</span><br>\r\n</span></div></div>",
            "created":1596430800,
            "id":2879957,
            "title":"An Unusual Startup Screen"
        },
        "111":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Change your Abs/Stomach from a 2 to 8",
                "Click on your Hips/Pelvis ",
                "try typing in someone else's name"
            ],
            "content":"<div class=\"\"><div> <span>As you finish typing your name the screen changes showing a full body of you, naked.<br>\r\n<br>\r\n<span class=\"clkhaki\">Hello <span class=\"cblack\">DAVID TOMPSON</span> Welcome to your very own reality changing device, we hope you enjoy your use out of our marvelous machine. when you are finished or, have any technical issues with the device please call us toll-free at 1-800-555-MSPC</span> <br>\r\n<br>\r\nThe picture of your self looks so lifelike, it's unsettling teetering on creepy. you take the mouse and click ou your self<br>\r\n<br>\r\n<span class=\"clkhaki\">You have selected the Torso region you may modify any attribute of your torso specifically here, don't worry all other attributes charged in other areas will not be affected.</span><br>\r\n<br>\r\nA list appeared next to your torso<br>\r\n<span class=\"corange\">Neck/Shoulder<br>\r\nChest<br>\r\nAbs/Stomach<br>\r\nHips/Pelvis</span><br>\r\n<br>\r\nnext to them is a text box and sliders 1-10<br>\r\n<br>\r\n<span class=\"clkhaki\">If you ever would like to change something but not sure how, just type it into the text box and the program will interpret the text into a change</span></span></div></div>",
            "created":1596430800,
            "id":2879958,
            "title":"Enter 'David Tompson'"
        },
        "1111":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "One last change ",
                "Take the laptop to your room",
                "Leave the laptop"
            ],
            "content":"<div class=\"\"><div> <span>Deciding to test the sliders you move the one labeled Abs/Stomach to 8 when you let go of the slider you feel your stomach growing. when you look down you see that you must have put on at least 60lbs. you grad the slider and move it back down to the 2 it was at originally. when you let go text appears<br>\r\n<br>\r\n<span class=\"clkhaki\">You are attempting to reset a change due to company policy all resets must be done at once, would you like to reset to original format.</span> <br>\r\n<span class=\"cgreen\">Yes</span> <br>\r\n<span class=\"clred\">No</span><br>\r\n<br>\r\nAs you click yes you feel your stomach melt away, \"Well it's real.\" you say in shock. glancing at the screen clock you realize its already 4:50 am. your mother is going to start her morning routine soon. </span></div></div>",
            "created":1596430800,
            "id":2879961,
            "title":"Flabs without Abs"
        },
        "1112":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Set it to 1",
                "Set it to 10",
                "Go big or go home"
            ],
            "content":"<div class=\"\"><div> <span>when you click on the tab a note pops up<br>\r\n<br>\r\n<span class=\"clkhaki\">Due to corporate policy genital elongation is only available on penises. </span> <br>\r\n<br>\r\nYou take the hint from the computer and click on your dicks slider, unlike the others it goes from 1 to 36 yours is set at a 4.</span></div></div>",
            "created":1596430800,
            "id":2879964,
            "title":"Click on your Hips/Pelvis "
        },
        "1113":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Change her Chest from 2 to 5",
                "lengthen her hair",
                "make her shorter"
            ],
            "content":"<div class=\"\"><div> <span>With slight fear of it actually working you decide to type in your sister's name <br>\r\n<br>\r\n<span class=\"clkhaki\">Subject <span class=\"cblack\">Ellie Tompson</span> Will not be aware of any changes made, only the owner of the machine and typer are made aware of the changes</span><br>\r\n<br>\r\nin front of you is a full-body 3d model of your naked sister. even though you know you shouldn't look at it you are still intrigued by the possible effects of the machine. and what's the harm she won't notice any difference<br>\r\n<br>\r\n</span></div></div>",
            "created":1596430800,
            "id":2879966,
            "title":"I need a lab rat"
        },
        "112":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Is only 14 years old",
                "has extremely sensitive nerves",
                "is submissive to David Tompson"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"clkhaki\">Welcome <span class=\"cblack\">ELLIE TOMPSON</span> welcome to your new reality-altering device. if you have any questions please contact us at 1-800-555-MSPC </span><br>\r\n<br>\r\nA list of options appears with a text box and various sliders. \"no time like the present to try it out\" you say to yourself, clicking on the text box you wright 'the most unliked child'<br>\r\n<br>\r\n<span class=\"clkhaki\">The command entered contains a mental change to the typer, is that acceptable?</span><br>\r\n<span class=\"cgreen\">Yes</span><br>\r\n<span class=\"clred\">No</span><br>\r\n<br>\r\nwhen you click yes your head gets loaded with various memories of your sister attacking and harassing you and your siblings. \"she is such an asshole maybe I should make her pay with this.<br>\r\n<br>\r\n\"in the text box, you add... </span></div></div>",
            "created":1596430800,
            "id":2879970,
            "title":"Enter 'Ellie Tompson'"
        },
        "113":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "\"What honey, need some room?\"",
                "\"Why am I here?"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"clkhaki\">Hello <span class=\"cblack\">JESSICA TOMPSON</span> Welcome to your very own reality changing device, we hope you enjoy your use out of our marvelous machine. when you are finished or, have any technical issues with the device please call us toll-free at 1-800-555-MSPC</span> <br>\r\n<br>\r\non the screen is a full 3d model of your mother naked. Even though she is your mother she is still surprisingly hot to you.<br>\r\n<br>\r\na text box appears next to her model with a simple command<br>\r\n<span class=\"clkhaki\">type change here</span><br>\r\n<br>\r\n\"Might as well try it out, no harm in a little fun.\" you think<br>\r\n<br>\r\n'Jessica Tompson is married to David Tompson'<br>\r\n\"nothing happened,\" you say, \"so it is a joke\". <br>\r\n<br>\r\nyou decide to turn off the computer and go back to bed, as you enter your room you see your mother lying asleep on it, confused you head over to her and try to wake her up<br>\r\n<br>\r\nstill somewhat asleep she says</span></div></div>",
            "created":1596430800,
            "id":2879972,
            "title":"Enter 'Jessica Tompson'"
        },
        "114":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "She used the computer on me",
                "She's been snooping threw my laundry again"
            ],
            "content":"<div class=\"\"><div> <span>As you head back to bed you can't stop thinking about what the computer said, \"reality changing\" funny, must be some sort of joke. <br>\r\n<br>\r\nAs you wake up you can smell coffee from downstairs you always loved the way it smells fresh in the morning, you get up and look at your clock <span class=\"clred\">7:46am</span> you hurl yourself out of bed, throw on a pair of sweatpants and an over-sized t-shirt to hide your body, and head downstairs.<br>\r\n<br>\r\nin the kitchen, you meet your mother preparing breakfast. \"hey sweety dear, promise me you will put on more than just that for school\" your mother asks.<br>\r\n\"of course I just put these on so I could come to get coffee,\" you reply<br>\r\n<br>\r\nYou hear a loud shriek from the door frame as your sister Ellie enters \"David, you, you have breast?!?\"<br>\r\n<br>\r\n\"For the last time Ellie the doctors said it's unusual but possible\" you reply haphazardly<br>\r\n<br>\r\n\"No I mean you didn't yesterday, I changed you!\" she shouts<br>\r\n\"What do you mean changed me?\" <br>\r\n\"I made you into a guy with 40FF breast, I did this. wait, I did this. holy shit it is real. I, I, uh, I got to go.\"<br>\r\n<br>\r\nConfused you look at her as she runs back upstairs. then it finally hits you</span></div></div>",
            "created":1596430800,
            "id":2879973,
            "title":"Not my problem"
        },
        "12":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Play around with Jessica's bra",
                "Try on one of Ellie's headbands",
                "Ask Ellie for your missing shirt"
            ],
            "content":"<div class=\"\"><div> <span>While out shopping for some groceries at your local K-Wall, you see a bottle of detergent titled \"What's yours is mine\" the price was only 1.99 for such big bottle of soap. curious you take it to by.<br>\r\n<br>\r\nat the register, you start placing everything on the belt, fruit, meat, detergent, crackers. then the clear looks at you \"Sir I'm not sure where you got this but it's not one of our products and hands you the detergent bottle.\"<br>\r\n<br>\r\nconfused you place it back into your cart, pay for everything else, and head out of the store. as you get home you call out \"Hey Ellie wanna help me with these, moms still out of town\", there is no reply \"Ellie?\" it's weird she is usually back from her runs by now. <br>\r\n<br>\r\nUsually, your house is so active with everyone in it but since your mom took Sammy to his summer camp trip its been quiet. \"hey Alex, you around?\" you say as you put the final groceries on the table. <br>\r\n\"What do you want?\" he calls out from the living room <br>\r\n\"Nothing now, hey do you know if mom ever got more Fabric softener?\"<br>\r\n\"Why does that matter, You needed to jack off again,\" he says sarcastically<br>\r\n\"Whatever,\" you say heading upstairs, <br>\r\n<br>\r\ndeciding you might as well do laundry you toss some shirts in with what's there and put some of the new detergent in it for a spin. while moving all the clothing into a hamper you hear your sister get back \"Hey David, you're parked in my spot\" she yells up the stairs as she comes up. \"oh hey thanks for doing my laundry for me, I could use some fresh clothes. she digs threw and takes out a pair of her panties that were there and one of your shirts by mistake.<br>\r\n<br>\r\nAs you carry the basket to the guest room to sort out your clothes from your sisters, you feel the basket get slightly heavier once you put it down you start to separate the clothes, surprisingly there was one of your mother's bras inside the hamper, you never understood how a woman her age looked so good. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1596430800,
            "id":2879988,
            "title":"One Shirt at a Time"
        },
        "121":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "one of Ellie's Bras",
                "a T-Shirt of yours"
            ],
            "content":"<div class=\"\"><div> <span>Deciding to mess around with your mom's bra you decide to try it on, it felt snug all around you but it seemed bigger than the other bras she had in the room. as you click the back you feel the heat in your chest as you see it swell. <br>\r\n<br>\r\n\"What the hell is going on?\" you say as you feel the heat stop, you look at yourself in the mirror. you feel weird and a shift of your center of gravity as you look at the large DD cups you have, \"Hey Ellie can you come in here for a minute?\" you yell out to her.<br>\r\n\"What's wrong got stuck in one of my bra's again?\" she replies opening the door, you see her standing there but her arms and shoulders seem more muscular. <br>\r\n\"What do you mean, Look at me I have breast!\" you shout at her<br>\r\n\"And I have excessive back hair, your point? mom knows were a little odd.<br>\r\n<br>\r\nyou are baffled by her comment, you take the bra off to see if that undoes it. <br>\r\n\"Hey bro, calm down, I don't need to see your breast,\" she says covering her eyes. <br>\r\n<br>\r\nyou turn around and put on</span></div></div>",
            "created":1596430800,
            "id":2879995,
            "title":"Whats the Bra-blem"
        },
        "122":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Your sisters Panties",
                "Your own shirt"
            ],
            "content":"<div class=\"\"><div> <span>As you put on Ellie's headband you feel your face tightening and your hair growing. as you turn to the mirror you are shocked in horror as you see your sisters head on your body, or at least most of your body, your shoulders look a little lower than normal. <br>\r\n<br>\r\nher Auburn hair cascading down your shoulders, her settle nose now yours, you stand in shock \"Hey David, have you seen my acne cream, I think my face is acting up again?\" you hear Ellie ask from outside, you're confused by her question. surly she would be in such a state of shock much like you are right now, but she seems fine about it. you decide to test a theory about it and try on</span></div></div>",
            "created":1596430800,
            "id":2879999,
            "title":"Try on one of Ellie's headbands"
        },
        "123":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Because their really yours!",
                "What do you mean? "
            ],
            "content":"<div class=\"\"><div> <span>you shout out to your sister \"Hey Ellie have you seen my 'Pistol &amp; Violets' shirt.\" she walks threw the door angrily<br>\r\n<br>\r\n\"How many times do I have to tell you where your own tank-tops and not my t-shirts.\" she barks at you, taking the rest of the basket with her. you are confused, why would you were her tank-tops. you turn to look in the mirror and realize that you have your sister's torso, well sort of, it definitely her shoulders and toned stomach, but still your body? it seemed weird at the moment, you decide to head back to your room for some game time.<br>\r\n<br>\r\nWhen you open your door your greater by your clothes on the floor like normal but they aren't your shirts. they are all of your sister's tops scattered around the room. \"Why were so many of your shirts in my closet, David?\" your sister asks your from behind</span></div></div>",
            "created":1596430800,
            "id":2880005,
            "title":"Ask Ellie for your missing shirt"
        },
        "13":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Red Space (Intrest)",
                "Green Space (Physical)",
                "Purple Space (Swap)"
            ],
            "content":"<div class=\"\"><div> <span>Your in your room watching TV when your mother calls everyone for dinner. as you head downstairs you see that instead of dinner your mother set up a board game on the table. <br>\r\n\"<span class=\"cgrape\">Come on guys and Play this with me we haven't had much bonding time since your Dad shipped out</span>\" Your mother says<br>\r\n\"<span class=\"cyellow\">Fine but, just one game then I need actual dinner before the track meet in the morning</span>\" Ellie replies<br>\r\nyou decide to sit down with the two of them. <br>\r\n\"<span class=\"cgrape\">Alex get down her</span>\" your mother yells<br>\r\n\"<span class=\"cteal\">What's the point of being 20 if I still have to play shitty family board games?</span>\" Alex yells<br>\r\n\"<span class=\"cgrape\">Fine then it'll just be me, Ellie and David,</span>\" <br>\r\n<br>\r\nYou look at the board it seems pretty normal seven circles interlocked by the edges <a rel=\"nofollow\" href=\"https://www.tokenrock.com/stock/floweroflife4.gif\" target=\"_blank\">https://www.tokenrock.com/stock/flowerof...</a><br>\r\n<br>\r\nYou decide to pick up the die<br>\r\n\"<span class=\"cgrape\"> wait you need to know the rules first. okay so we're going to roll a die, then move that many spaces around the outside and pick up a corresponding card to the color of the spaces either Red, Orange, Yellow, Green, Blue, Or Purple. depending on the color depends on a different thing about you. I don't quite understand what the cards mean, but, in each pile, there is a Life card, that ends the game and crowns you the winner. </span><br>\r\n<br>\r\nYou decide to roll the dice landing on a 4</span></div></div>",
            "created":1596430800,
            "id":2880016,
            "title":"Wanna Play a Game?"
        },
        "131":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Green (Physical)",
                "Blue (Choice)",
                "Purple (Swap)"
            ],
            "content":"<div class=\"\"><div> <span>Landing on a Red space you draw a card from the deck, \"<span class=\"cbgreen\">Pick a player, that player then draws a red card. you will both gain that interest or hobby</span>.\" you read \"<span class=\"cgreen\">Okay, I pick Ellie</span>\" you say.<br>\r\n<br>\r\nEllie picks up a card and is shocked at what it says \"<span class=\"cyellow\">Family intimate relationships are a crucial piece of a happy family</span>\" She looks at you with shock as you see it slowly turn to her normal resting bitch face \"<span class=\"cyellow\">This can't be serious I will <span style=\"text-decoration:line-through\">never</span> Support having sex with my brother</span>\" she gasps and holds her mouth. <span class=\"cyellow\">Did I just say, No , I <span style=\"text-decoration:line-through\">don't</span> <u> desperately</u> want to sleep with David</span>.<br>\r\n<br>\r\nAs you look at her you try to understand what is going on. it's confusing but you think the game has something to do with it.<br>\r\n<br>\r\nEllie picks up the dice \"<span class=\"cyellow\">this needs to end now, <u>So i can blow David.</u> What is wrong with me</span>\"<br>\r\n<br>\r\nshe throws the dice and rolls</span></div></div>",
            "created":1596430800,
            "id":2880023,
            "title":"Interest in who"
        },
        "132":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Green (Phsyical)",
                "Yellow (Time)",
                "Orange (Worldly)"
            ],
            "content":"<div class=\"\"><div> <span>Landing on a green space you pick up a card and read it aloud \"<span class=\"cgreen\">Congrats on the upgrade, Breast size goes up two</span>\" you ponder what it means as you feel the heat rise in your chest blossoms out into B cups much like your sisters. \"<span class=\"cgreen\">What the hell mom, what even is this game. I'm pulling a new card.</span>\" <br>\r\n<br>\r\nAs you pick up the green card it turns a white shade, it reads 'it seems someone doesn't like their change, how about another upgrade?' <br>\r\n<br>\r\nyou ponder what it means as you feel the heat between your legs. you feel your dick start to grow from just a simple 5 inches to what looks like a foot threw your pants, the card text changes 'enjoy the extra bonus. don't cheat.'<br>\r\n<br>\r\nyou look at your mother who's eyes are locked on the big chunk of meat bulging against your leg. \"<span class=\"cgrape\">well, um, sweety, just, a, don't cheat okay?</span>\" she says to you barely taking her eyes off it.<br>\r\n<br>\r\n\"<span class=\"cyellow\">You look rediculous, my turn!</span>\" your sister grabs the die to roll<br>\r\n<br>\r\nDoes no one else see how insane and crazy this game is? you think to yourself<br>\r\n<br>\r\nEllie rolls a...</span></div></div>",
            "created":1596430800,
            "id":2880027,
            "title":"Green Space (Physical)"
        },
        "133":{
            "author_id":"lucydps",
            "author_name":"Lucy&Dan",
            "choices":[
                "Orange (Worldly)",
                "Blue (Choice)",
                "Purple (Swap)"
            ],
            "content":"<div class=\"\"><div> <span>Landing on a Purple space you grab a card \"<span class=\"cgreen\">Swap underwear with the player to your right</span>\" \"<span class=\"cgreen\">Mom what is this game? it's a little bit more than just weird</span>\" as you say that you see her breast just plop down as if there was no support for them under her shirt, on the other hand, you feel tightness around your penis as you see a pair of your moms panties sticking out the top of your pants.<br>\r\n<br>\r\n\"<span class=\"cgreen\">what the fuck why am I wearing panties, and a bra? what is going on</span>\" you ask<br>\r\n\"<span class=\"cgrape\">Calm down David this is only the beginning!</span>\" your mom says \"<span class=\"cgrape\">Ellie honey go and roll the die.</span>\"<br>\r\n<br>\r\nEllie picks up the dice and rolls</span></div></div>",
            "created":1596430800,
            "id":2880029,
            "title":"Purple Space (Swap)"
        }
    },
    "info":{
        "author_id":"lucydps",
        "author_name":"Lucy&Dan",
        "brief_description":"My first story, most popular chapter will be continued each day!",
        "created":1595917620,
        "description":"<td align=\"left\" class=\"norm\">This is my first attempt at an interactive story, so be gentle and patient with me.<br>\r\n<br>\r\nThis is a story about a man and his ability to change/transform. I will be following my 3 favorite types of \"Changes\" when it comes to TF/TG.<br>\r\n<br>\r\nMaster PC<br>\r\nClothing Swap<br>\r\nMagic Game<br>\r\n<br>\r\nI will be writing new chapters for whatever choice has the most views, so if your someone, like me, who likes to take every path possible then makes sure to look at the route you like an extra time to better tell me your choice.<br>\r\n<br>\r\nThis will Follow the Story Of David Tompson and his family<br>\r\n<br>\r\nDavid- 19M 5'11\", Brown hair, Blue eyes, Average build<br>\r\nEllie(Sister)- 22F 5'2\", Auburn hair, 30B, Athletic<br>\r\nJessica(Mother)- 43F 5'7\", Brown Hair, 32DD, Stay at home mother<br>\r\nSammy(Brother)- 8M 4'3\", Ginger<br>\r\nAlexander(Brother)- 20 6'4\", Brown hair, Slim, Enjoys messing with Siblings.<br>\r\n<br>\r\nIf you want to add chapters please let me know so that I am aware of it, my email is lucydps2014@gmail.com<br>\r\n-Please only use this if you're sending me stuff related to this story, i.e. Ideas, images, or notifications of new chapters<br>\r\n<br>\r\nI don't think i need to list this but,<br>\r\nNo diaper, or shit related stuff<br>\r\n<br>\r\nI don't mind a lot of other things I understand people have niches.<br>\r\n<br>\r\nEdited Notes:---------------------------------------------------------------------</td>",
        "id":2228000,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596447540,
        "modified":1596447540,
        "pretty_title":"Lost in Transformation"
    }
}