{
    "chapters":{
        "1":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "A 17 year old with a younger brother",
                "An undersized 8 year old",
                "A little league team",
                "A group of kids at camp",
                "More Choices"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to Pearson Town, a small little city with a \"growing\" population. They have everything you can ask for: shopping malls, super markets, parks and sporting arenas, and several schools.<br>\r\n<br>\r\nThings were always pretty quiet in the town, but that was all about to change...<br>\r\n<br>\r\nLet us follow the story of one of these individuals as these changes happen!</span></div></div>",
            "created":1350018000,
            "id":1445068,
            "title":"Welcome to Pearson Town"
        },
        "11":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "Cooper and Julian, sitting on the couch, almost as tall as Blake.",
                "Cooper and Julian, sitting on the couch, nearly seven feet tall.",
                "Cooper and Julian, sitting on the floor, their heads reaching the ceiling.",
                "Cooper and Julian, normal size -- for now.",
                "an empty couch. Where did they go?"
            ],
            "content":"<div class=\"\"><div> <span>Senior year. Time for Blake to finally be the big man on campus, and around the house for that matter, right? Time for him to be the star of the football team, and have one last year of fun with his friends before heading off to college away from his parents and his eleven-year-old kid brother Cooper, right?<br>\r\n<br>\r\nWell, that's how it was supposed to work. But that wasn't in the cards this year for Blake, as he would have to deal with Cooper and all the other boys his age becoming bigger and dominating over the town. Stuff like that has a habit of overshadowing anything (and anyone) else.<br>\r\n<br>\r\nBut I'm getting ahead of myself.<br>\r\n<br>\r\nLet's start on Day One of Pearson Town's Growth Event. A Wednesday in August, the week before school started. Blake was coming home from football practice, pumped from having been named this year's starting quarterback for Pearson High's Fighting JungleCats. Cooper and his friend Julian were downstairs playing video games in the basement. <br>\r\n<br>\r\nAs he walked in the door, Blake called down the stairs to his brother. \"Hey, dweeb, I'm home. Get ready to give up the TV.\" He didn't mean anything hurtful by his remarks, but after all, Cooper was his dorky little brother, and it was his right as oldest to have the TV to himself when he got home.<br>\r\n<br>\r\nWhen the only response he heard was the sound of the video games getting louder, Blake shook his head and started downstairs. \"Did you hear me? It's my turn. Save your game or whatever and scram.\"<br>\r\n<br>\r\nAs he got to the bottom step, however, he stopped dead in his tracks, staring at...</span></div></div>",
            "created":1351832400,
            "id":1459084,
            "title":"A 17 year old with a younger brother"
        },
        "111":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "They wrestle each other and Cooper has another growth spurt",
                "Cooper starts exercising and grows muscles",
                "The next day Cooper and his friends have grown even more!"
            ],
            "content":"<div class=\"\"><div> <span>His brother Cooper and his friend Julian were sitting on the couch, but Blake could immediately tell something was off. No, he didn't want to admit it, he wanted to believe that his eyes were playing tricks on him or something.<br>\r\n<br>\r\n\"Hey Blake, didn't hear you come home.\" Cooper grinned, even though they both knew that there was no possible way he didn't hear him yelling down the stairs earlier. As Blake watched Cooper stood up and walked up to him, and only then was Blake dead sure that he was really seeing what his eyes were telling him.<br>\r\n<br>\r\nCooper was as tall as he was.<br>\r\n<br>\r\n\"C-Cooper, how did you two grow so big!?\" Blake asked, staring wide eyed at his former little brother. Looking over at Julian sitting on the couch, he saw that he too had grown bigger as well. <br>\r\n<br>\r\n\"I don't know, we just did!\" He shrugged.<br>\r\n<br>\r\n\"We were just sitting here and then all of a sudden we started growing bigger!\" Julian said.<br>\r\n<br>\r\nBlake rubbed his eyes and looked his brother over. It was as if someone had taken Cooper's head and placed it on another body. Cooper's clothes, which had been baggy on him before, were now skin tight and ill fitting. The bottom of his pants now hugged the middle of his calves, and the shirt was tight everywhere.<br>\r\n<br>\r\n\"Now then, you said you were going to take the TV, but me and Julian aren't done with it yet.\" Cooper crossed his arms over his chest.<br>\r\n<br>\r\nThat statement snapped Blake out of his stunned state. \"What, you think that now that you're as tall as me you can boss me around? I can still whoop your skinny little butt!\"<br>\r\n<br>\r\n\"Really?\" Cooper grinned. \"We'll just have to see about that...\"</span></div></div>",
            "created":1352005200,
            "id":1460068,
            "title":"Big Dweeb"
        },
        "1113":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "\"Take me on in a wrestling match.\"",
                "\"Beat me in a footrace to the end of the block and back.\"",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Seeing Cooper's mischievous grin caused Blake to think twice about taking on Cooper, especially since he was feeling rather fatigued from practice. \"Listen,\" he said, hoping he looked and sounded more confident than he felt, \"I'm gonna go over to Alex's house right now, so you two can keep the TV for all I care. But, tomorrow, when I get home, that couch is mine.\"<br>\r\n<br>\r\nCooper's smile just widened as he chuckled. \"Sure, whatever you say, Blake.\"<br>\r\n<br>\r\nBlake didn't actually have plans to go to his friend's house, but he didn't want to lose face in front of his little dweeb of a brother (although the term \"little\" wasn't exactly appropriate anymore). So he headed out for a light jog around the neighborhood, reasoning that it was a good way to keep his conditioning up for football.<br>\r\n<br>\r\nAfter a few minutes, he turned down a side street and passed by a small park with a playground, where many of the neighborhood kids would come and play. It was a place that he usually paid little notice too, but as he passed, he thought for sure that he saw something peculiar out of the corner of his eye. Turning his head, he saw what he thought were five or six teenaged boys running around, with several girls much younger than them on the playground with them. As he looked closer, however, he realized that these boys' faces looked much younger than their bodies. Just like Cooper and Julian, they were all between five and a half and six and a half feet tall, with clothes clinging skin-tight to their bodies, but they couldn't have been any older than twelve. It was a bizarre sight, and Blake couldn't help but stop and gawk for a moment.<br>\r\n<br>\r\nWhen Blake got home, he went directly to his room and made sure he avoided Cooper for the rest of the night. In the morning, he woke up and left the house before Cooper even got out of bed, as his high school started nearly two hours earlier than the middle school. <br>\r\n<br>\r\nAt school, he noticed that a few of the freshmen boys appeared to be a few inches taller than they had been the previous day, but nothing as dramatic as what Blake had witnessed yesterday, and none of the upperclassmen seemed to have changed one bit. By the end of the day, Blake had nearly forgotten about the changes Cooper and his friend had gone through. <br>\r\n<br>\r\nThat is, until he arrived back home.<br>\r\n<br>\r\nHe didn't even have to go inside, as Cooper and two of his friends were hanging out in the front yard -- and they were huge! Julian was there, nearly eight feet tall, still wearing a school uniform that had been stretched and ripped beyond any reasonable use. Another friend the same size, whom Blake didn't recognize, was also there, shirtless but still wearing the remains of the school shorts that barely extended a third of the way down his thigh.<br>\r\n<br>\r\nBut the biggest of all was definitely Cooper. The other two boys didn't even come up to his shoulders! And Blake, poor Blake -- as he slowly made his way up to his beaming brother, he realized that he was eye level with Cooper's belly button. Cooper had by far outgrown his school uniform, only having what looked to be a half-ripped beach towel wrapped around his waist like a loincloth that was failing at its primary purpose. The site of his brother being so big was almost too much for Blake, and he was speechless.<br>\r\n<br>\r\nCooper, however, could barely contain his glee. \"Don't worry, Blake,\" he said, \"the couch and the TV are too small for us now, so they're are all yours. That is, if you can get past us into the house.\"<br>\r\n<br>\r\nIt took a moment before Blake could respond. \"W-what?! You're not going to let me into the house?\"<br>\r\n<br>\r\nCooper shrugged. \"Maybe, but you'll have to do something first:\"</span></div></div>",
            "created":1352091600,
            "id":1461649,
            "title":"Worse Than He Could've Dreamed"
        },
        "11131":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Blake won somehow!",
                "Cooper dominates Blake!"
            ],
            "content":"<div class=\"\"><div> <span>\"Take me on in a wrestling match.\" Cooper said with a grin.<br>\r\n<br>\r\n\"Say what?\" Blake stared at him bug eyed. \"You want me to wrestle with you?\"<br>\r\n<br>\r\n\"I think he's afraid of you.\" Julian snickered as he watched Blake's reaction.<br>\r\n<br>\r\n\"What are you afraid of? We used to do it all the time when I was still half your size. It'll be exactly the same, except this time, YOU'RE the one who will be half MY size!\" Cooper grinned down at his former big brother, obviously enjoying this moment of payback. Before Blake could react, Cooper suddenly charged at him and tackled him to the ground!<br>\r\n<br>\r\n\"Oof!\" Blake felt the wind knocked out of him as his now larger brother landed on top of him. He could feel Cooper's arms try to wrap around him to pin him, but his countless wrestling experience helped him to somehow break free for the moment. The two of them wrestled around on the grass in a jumble of arms and legs. Cooper had a definite size and weight advantage, but Blake had much more experience than Cooper did. Finally, one of them gained the upper hand!<br>\r\n<br>\r\n</span></div></div>",
            "created":1353992400,
            "id":1476372,
            "title":"\"Take me on in a wrestling match.\""
        },
        "113":{
            "author_id":"giantryan",
            "author_name":"GiantRyan",
            "choices":[
                "Cooper decided to show off outside.",
                "Cooper and Julian decided to mess with Blake."
            ],
            "content":"<div class=\"\"><div> <span>Blake stopped dead in his tracks. In front of him, sitting on the couch with the TV blaring, was his little brother Cooper sitting his next to his school friend Julian. Blake was completely bamboozled because, even though they were only eleven years old, Cooper and Julian's heads were grazing the cieling.<br>\r\n<br>\r\n\"I'm still using the TV,\" Cooper said, completely non-plussed by his massive change.<br>\r\n<br>\r\nBlake couldn't keep his jaw off the floor. There was little Cooper, at least 15 feet tall, without a care in the world. Blake attempted to say something when...</span></div></div>",
            "created":1358053200,
            "id":1507947,
            "title":"Cooper and Julian, sitting on the floor, their ..."
        },
        "114":{
            "author_id":"jxm3s",
            "author_name":"Jxmes",
            "choices":[
                "Blake hears a strange stretching noise",
                "His parents come home.",
                "The power goes out."
            ],
            "content":"<div class=\"\"><div> <span>They sat there, watching TV, like usual, almost hypnotized by their show. \"Hey! Dweebs! Go do something else, would ya?!\" , Blake shouted. To his surprise, Cooper responded, \"How about you go away while we watch our show?\" . Blake was furious. Before he could say anything, he...</span></div></div>",
            "created":1589075160,
            "id":2833277,
            "title":"Cooper and Julian, normal size -- for now."
        },
        "1141":{
            "author_id":"jxm3s",
            "author_name":"Jxmes",
            "choices":[
                "Puts Blake in his pocket",
                "Throws Blake far away",
                "He keeps Blake as a prisoner"
            ],
            "content":"<div class=\"\"><div> <span>Blake stops, and suddenly a rubbery stretching noise fills the room. Before long, Cooper gasped, as his fingers started oddly throbbing. \"What the hell?\" , Blake thinks. Then, out of nowhere, his fingers start to get longer, becoming the length of a toilet paper roll. The same thing started happening to Julian, too! Cooper stands up to rub his eyes, and he was now about 5' 3\" ! Blake steps back, and Cooper's shoelaces start to pop, his feet being fifteen inches long! Blake tries to run, but trips over the remote. Cooper's legs start to stretch, almost as in invisible forces were pulling him, making him grow, and grow, and grow! Cooper was now about 6' 11\" , and Julian tried to run, but he was now getting too big for the room. Tch! Cooper's  baggy, loose long sleeved shirt was now to his Upper arms, and his  sweatpants were to his thighs. Cooper grew another foot, and he was so shocked at his sudden transformation. He was starting to feel cramped, and then his head crashed through the ceiling. His shoulders broadened, destroying the sleeves, making the shirt look like a tank top. Then, Cooper was at least 17 feet tall. Blake was pushed to the wall by Cooper's now enormous hands, spanning at least 36 inches. Cooper crushed through the house, and footprints getting increasingly bigger were running towards Julian's street. Probably left by Julian during the pursuit. Cooper picked up Blake, and..</span></div></div>",
            "created":1589076000,
            "id":2833286,
            "title":"Blake hears a strange stretching noise"
        },
        "115":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...starts running back to the house.",
                "...starts running away from the two giants.",
                "...starts running towards the car and drive away."
            ],
            "content":"<div class=\"\"><div> <span>As he got to the bottom step, however, Blake stopped dead in his tracks, staring at an empty couch with the game still being on.  This was strange since normally Cooper would play this most of the time.  Blake wasn’t sure what to think of it, and he had to wonder where his dorky little brother went?  But he looked around and shrugged it off, as if he might’ve scared him.<br>\r\n<br>\r\n“Oh well!  I’ve must’ve thought that dork knew I was coming and ran off, I guess?”  Blake shrugged again.<br>\r\n<br>\r\nThat’s when he would approach the TV, and switches off the games console.  He turns on his favourite channel and sits back down on the couch to have some rest for a bit.  It’s his time since he’s the oldest of the two, and gets some kind of a VIP treatment whenever he wants to.<br>\r\n<br>\r\n“Ah, nothing more than just sitting there, without having that little shrimp to fight me over the TV.”<br>\r\n Blake says in a happy expression and sighs of relief.<br>\r\n<br>\r\nThat maybe for the moment since Blake was getting too comfortable and too cocky in his regard, but it would only take some moments later, when he can feel the ground had shook slightly, followed by those loud booms from further away.  Blake seems to be more alert and felt shaken as it happens again.  There were only a small window which is higher than the other ones, since it is the basement, and so he takes a look and see what’s going on.<br>\r\n<br>\r\n“What’s going on?  I don’t believe any earthquakes at all, bur where did it came from?”  Blake asked in great concern.<br>\r\n<br>\r\nThose quakes and booms came closer and it wouldn’t take long until Blake had found the answers he was looking for, but in a surprisingly shocking way.  He can see giant sneakers slamming onto the streets, two pairs in fact!  Blake’s heartbeat came running and had to get up the stairs and take a look outside from this commotion.<br>\r\n<br>\r\nOnce he reached outside, he was in deep shock and dropped dead at this point, when he see’s two giants standing right in front of him, and he can hear those giggles from those high pitched voices echoing the entire streets.  Blake knee it sounded like kids and he looks up realising who they were, and that’s when his jaw dropped and couldn’t believe what he just saw.<br>\r\n<br>\r\n“C...C...Cooper....J...J...Julian?  I...I...Is that you?”  Blake asked in a very shaken tone.<br>\r\n<br>\r\nAnd they surely are!  It was two 11 year old boys who have suddenly grown into giants, standing like 50 feet tall in the process.  This is very much surprising and Blake had absolute no idea how did these two boys had gotten so huge, and still shaken at the prospect.<br>\r\n<br>\r\n“Oh, Hello little tweeb!  I guess being this big is kinda cool!  Maybe we should take care of you while we’ll love being so big.”  That was Cooper, looking down to his now ‘little’ brother and crouches down to try and pick Blake up from the ground.<br>\r\n<br>\r\nSeeing that giant hand coming down to grab him, Blake looked so frightened and isn’t sure what to do with these two giant boys.  He knew he’s gonna get caught by any means, but he would be destined to run as much as he can, if that’s the only way forward.  Once the hand was getting closer, Blake let’s out with a sigh and...</span></div></div>",
            "created":1547040180,
            "id":2601073,
            "title":"Earthquakes? What’s Going On?"
        },
        "12":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Fight crime all over pearson town",
                "Have lunch somewhere."
            ],
            "content":"<div class=\"\"><div> <span>Small fry. That's what Cooler was called when he was 8 years old. After all Cooler wasn't the biggest or strongest in pearson town yet but he would soon get his chance. For awhile he had always fantasized about himself being a monster sized superhero who while battling the bad guys always crooned like a professional named captain cooler.<br>\r\n<br>\r\nWell that was the way it was supposed to be. But after all it was a fantasy situation for Cooler as he was still small and puny of course. Stuff like that has a habit of overshadowing anyone anything anytime.<br>\r\n<br>\r\nBut of course i'm getting ahead of myself.<br>\r\n<br>\r\nOne summer day cooler was fantasizing about himself as a fat giant  who supposedly looked like captain cookbook from the muppet babies episode good clean fun. During one of his fantasy situations captain cooler was battlling his arch nemesis the amazing colossal blob cat who unfortunately was like duck kong from the tiny toon adventures episode you asked for it's segment duck out of luck.<br>\r\n<br>\r\nAt that moment captain cooler had managed to defeat his arch nemesis and save the day as well. <br>\r\n<br>\r\nThat's when cooler finally came back to reality and realized that if he was a fat giant nobody would dare call him small fry anymore. That's when it finally happened as cooler had his wish come true as he immediately started getting bigger and heavier until it finally stopped and right after that he was dressed up like he was in his fantasy situations of course and then he began to speak a few words with his new thunderous sounding voice.<br>\r\n<br>\r\nCaptain cooler: so i've finally become a fat giant of course. After all it isn't everyday that pearson town has a fat giant superhero to defend them at all. Now what can i do as a fat giant superhero? I know i'll... </span></div></div>",
            "created":1358053200,
            "id":1508088,
            "title":"An undersized 8 year old"
        },
        "121":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...some theives robbing the bank.",
                "...some bullies targeting a poor kid.",
                "...a normal-sized supervilain attacking the city."
            ],
            "content":"<div class=\"\"><div> <span>Now that Cooler has just become a fat giant superhero, an eight year old boy had got all the things in his mind, and he couldn’t wait to get started.  His height looks much taller than the entire town by any means, but it is his weight that he always fantasied about being a monstrous superhero.  He now has a pear-shaped body, which meant his butt and thighs are much bigger in weight, though his fat belly in very noticeable as well.<br>\r\n<br>\r\n“I know!  I’ll fight crime all over Pearson Town, and hopefully this place will be safe in no time.”  That was Captain Cooler as he is now called by his superhero ego, spoke variantly with his high pitched voice boomed all over.<br>\r\n<br>\r\nSo he wasted no time at all, and starts waddling away from his house and heads through the streets to get to the city.  Cooler was blushed with astonishment as every step he takes, causes the ground to shake and loud booms in all.  Not only that, but his obese body had caused to wobble heavily, everytime he moves so much.<br>\r\n<br>\r\nThat smile to his chunky face says it all!  He seems to be enjoying this new reality, which he never thought this could happen until he grew so large.  Now, he’s heading over to the city where everything he encounters are real, and so does the people when he arrived there moments later.  The view he’s seeing is so beautiful, he didn’t realised how magnificent sight the city is until he’s massively huge to see it for himself.  He can see the tiny people as well as the vehicles all over, and they can express in shock, and then the screams went out as they all ran away from a fat giant coming their way.<br>\r\n<br>\r\n“Hey, don’t be afraid!  I’m Captain Cooler, and I’m a fat giant superhero!  “Cooler tried to convince the people otherwise, but the screams continued on, as they’re frightened by the look of this kid.  “I can mean no harm, but I can save the this city, no matter how big and fat am I.”<br>\r\n<br>\r\nWith that still ongoing, all that Cooler needed to do is to find some suspicious activity, so he can try and stop this all on his own.  It wouldn’t take long until he may have his first superhero mission, as a obese giant boy looked down and spotted...</span></div></div>",
            "created":1539194040,
            "id":2562190,
            "title":"Fat Giant Superhero Heads To The City"
        },
        "122":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "The Food Factory",
                "The Fast Food Restaurant ",
                "The Shopping Mall"
            ],
            "content":"<div class=\"\"><div> <span>The dream became a reality, and Cooler has now become Captain Cooler... for real, now that he’s grown into a fat giant he never thought this would happen until now.  Now he’s about to experience what it’s like to become a fat giant superhero, when he’s perfectly taller than the entire buildings of Pearson Town, and his obese body looks pear-shaped, meant that his butt and thighs are much bigger and fatter, though his belly is noticeable fatter too.<br>\r\n<br>\r\nHe looks very impressed and stands with his hands on his widened hips, looking like an actual superhero by any accounts.  But even more so when he can hear and feel his stomach started to growl in hunger.  That could hear a thundering sound if it was a normal-sized person’s point of view.  Cooler looked down and gives his fat belly a slap, causing it to wobble like a jelly.<br>\r\n<br>\r\n“Boy, I never think I can get that hungry when I’m this big.  Now I need to go and find somewhere to eat.  I’m starving!”<br>\r\n<br>\r\nCooler says to himself with that thundering booming voice, and which at point, he would makes his first steps and slammed onto the ground, causing it to shake rapidly and loud booms that echoes all around the town.  That’s when he starts to waddle and headed through the streets from his house.  The scenery he looked from his point of view is so real, even the people are so smaller than him, that they looked in shock and screams as they ran away from a fat giant superhero when headed through.<br>\r\n<br>\r\nDespite he really wants no harm to the people, he wouldn’t realised that he just stomped onto the vehicles, lamp posts or anything he waddled back with his huge feet.  He’ll may had to get used to it, if he would stay this big longer though.  But a giant fat kid is getting hungry and continued headed down until he reached towards where?</span></div></div>",
            "created":1539259560,
            "id":2562512,
            "title":"Fat Giant Superhero Needs Lunch"
        },
        "13":{
            "author_id":"blinkereye123",
            "author_name":"silverquill",
            "choices":[
                "A new kind of 'energy drink' is passed around",
                "A strange light is seen over the ball field",
                "Someone brings a 'good luck charm' to the game"
            ],
            "content":"<div class=\"\"><div> <span>The Pearson City Giants weren't what you'd call the winningest team in the league, but they still managed to hold their own against some of the tougher clubs in the state. Given the fact that the boys on the team were still only 12 years old and from different backgrounds, it was amazing to see them work together to play the best game they could. Since the average height of each boy on the team was only about 5' even meant that they had to run a little faster, jumping a little higher, and swing a little harder to score in an average game. However, today everyone would find out - teammates and parents included - that this would be no 'average' game.<br>\r\n<br>\r\nAs the boys took the field and the umpire called out \"Play Ball\", everyone from team catcher Joey, to pitcher Ryan and all of the outfielders expected this game to be just another shut-out going up against their cross-town rivals the Hampton Hooligans. While each member of the opposing team was around the same age as the Giants, they were actually about 4 to 5\" taller than them, and a lot more muscular. This always seemed to guarantee the Giants would get the short end of the stick as they were outrun, outhit, and generally outmatched by their bigger opponents. That is until a strange phenomenon began to occur in the dugout. </span></div></div>",
            "created":1410817080,
            "id":1857295,
            "title":"A little league team"
        },
        "131":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...started to grow rapidly.",
                "...grew a little bit taller",
                "...either gotten taller, or just his imagination?"
            ],
            "content":"<div class=\"\"><div> <span>The Giants knew it was going to be a tough test against a strong ensemble team of The Hooligans, and thus going to this game as the underdogs.  The first Innings is always going to be crucial as they would want to keep the scoreline equal as possible, before they can take the bat.  Their fear is to be outdone, and they would think because of the size of The Hooligans’ players, The Giants would think it will be straight forward of humiliation.<br>\r\n<br>\r\nBut before beginning with the first inning though, the boys receive the energy drinks from the coach.  But for some reason, it looked quite new and they’ve all never seen such a brand quite like this before.  They all looked around and talk about this type of drink they’ve been given.<br>\r\n<br>\r\n“Hmm... That’s new!  I’ve never seen this kind of drink before.” Joey first spoke out, whilst taking a curious look at this new energy drink.<br>\r\n<br>\r\n“Me either!”  Ryan replied in response.  “But I guess we’ll get used to this if we’ll be able to beat those tough boys over there.”<br>\r\n<br>\r\n“Maybe you’re right... I hope!”  Joey shrugged and hoping for the best.<br>\r\n<br>\r\nKnowing it could be used from now on, both Joey, Ryan, and the rest of the boys drank their energy juice, before it was time to start the game.  As they’re the home side, The Hooligans will take the bat first at the start of the innings.  The Giants get into position and Ryan will make the first pitch.  <br>\r\n<br>\r\nThe opposition were looking confident in all, but something’s a bit off as the first batter takes the home plate.  He wasn’t sure if it just him or did The Giants...</span></div></div>",
            "created":1539395400,
            "id":2563024,
            "title":"A new kind of 'energy drink' is given"
        },
        "132":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "suddenly found themselves as literal giants!",
                "grew slowly through the game",
                "played their best game ever!"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly a strange silver/blue light appeared over the field. The moment the light appeared, everyone suddenly stopped moving.In fact, it was as if time had froze completely; no one was blinking, no one was breathing, and even a pigeon that had taken off was suspended in the air. The strange light grew brighter and brighter until suddenly it split into two shining humanoid shapes.<br>\r\n<br>\r\n\"Interesting. It would appear we have here a game between two teams of prepubescent earthlings Axon.\" One of them remarked.<br>\r\n<br>\r\n\"I concur with your observation Zenon.\" The other one said.<br>\r\n<br>\r\n\"Shall we use these boys for our experiment?\" Zenon proposed.<br>\r\n<br>\r\n\"I don't see why not.\" Axon said. \"I propose we only enhance one team of boys and use the other as a control group.\"<br>\r\n<br>\r\n\"Agreed.\" Zenon nodded. \"Judging from the general difference in size and muscularity, it would appear that the team known as the Hampton Holligans have a clear advantage, while the Pearson City Giants is much less developed. I suggest we use the Giants for our experiment.\"<br>\r\n<br>\r\n\"Second.\" Axon nodded, and waved his hand. Rays of silver/blue light shot out and struck each boy from the Pearson Giants. \"We shall now proceed with the experiment.\" He said, then with a flash both figures vanished, and time seemed to resume once again.<br>\r\n<br>\r\nIn the dugout, the Giants...</span></div></div>",
            "created":1413736860,
            "id":1874123,
            "title":"Aliens on the Field"
        },
        "1322":{
            "author_id":"blinkereye123",
            "author_name":"silverquill",
            "choices":[
                "Jeremy stands up.. WAY up!"
            ],
            "content":"<div class=\"\"><div> <span>Began to feel a little restless as they took to the field. As they took their positions, Some began to notice their equipment feeling a little tighter on them , especially catcher Jeremy. As he squatted down behind the Hooligans' batter, the umpire seemed to notice that Jeremy was almost even with him even though he was standing up! \"Must be a growth spurt\", he said to himself, although it seemed to be happening to the other players as well.<br>\r\n<br>\r\nDuring the first few innings, things seemed to be going along as usual as the Hooligans dominated the game - that is until their 'heavy hitter' Bo struck a line drive towards the back wall. Charlie, the Giants' outfielder went deep to try and catch it. Even though the ball looked to be too high, Charlie made one deperate leap for it and to his surprise, caught it!  \"Yer out!\", shouted the umpire, as Bo turned to give him and Jeremy a mean look.<br>\r\n<br>\r\nHowever, when he turned around what Bo saw was even more unbelievable...</span></div></div>",
            "created":1413843900,
            "id":1874908,
            "title":"Grew slowly through the game"
        },
        "13221":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "The First Bottom Inning Begin",
                "See The Alien’s Points Of View",
                "Skip To The End Of The Game"
            ],
            "content":"<div class=\"\"><div> <span>Bo seems to look confident and wanted to make The Giants know it was gonna be a long game to take a beating.  But that’s when he turned around, and saw a very tall figure standing in front of him, wearing the catchers gear with the opposition’s uniform.  He looked up and saw it was Jeremy, who was smaller than him to begin.  Now he’s gotten taller than Bo, and it was his turn to make a mean look as a return favour.<br>\r\n<br>\r\nThis was much a surprise by any means, and Bo looked surprised and shocked to see this.  However, he wasn’t the only one.  The rest of The Hooligans we’re taking the field, when seeing only Jeremy, but the entire Giants squad, looking much taller they were just before the game started.  Something’s doesn’t seem to be right there, and questions had to be asked, sooner rather than later.<br>\r\n<br>\r\nMeanwhile from the other side of the dugout, The Giants are both very surprised and confused of what just happened.  Again like the opposition, they had no idea what caused them to grow a foot or so taller, but regardless, they hope it might be good luck when they take the bat in the first bottom inning.<br>\r\n<br>\r\n“Hmm... This is getting interesting!”’ Ryan says in his thoughts, as the pitcher takes the batting first at the home plate.<br>\r\n<br>\r\nThe Giants were looking nervous and looking to get beaten by the mighty Hooligans.  But now with their size increased, it’s seems to be role reversed, and it is the Giants are going to be more confident than the opposition in hand.  It’s certainly gonna be a long game when this is going.</span></div></div>",
            "created":1539473700,
            "id":2563482,
            "title":"Did The Giants Grew Taller?"
        },
        "14":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Cabin 4, mixed aged group of boys",
                "Cabin 5, 8 year old boys",
                "Cabin 6, 10 year old boys",
                "Cabin 7, 12 year old boys",
                "A 17 year old volunteer camp leader"
            ],
            "content":"<div class=\"\"><div> <span>Lake Gonagro was a very popular summer camp location. So popular, that it wouldn't be too far off to say that every 8-12 year old boy in the entire town would be there when July came around, and this year was no different.<br>\r\n<br>\r\nUnknown to everyone, however, that the lake, though looking as pristine and clear as always, was contaminated. An old laboratory several miles away had shut down some time ago, and chemicals from their experiments to create bigger, stronger plants and livestock had leaked out into the ground, finding it's way into an underground channel that fed into the lake. Now, although the chemical was not harmful to adults and older teens, they had quite a startling reaction to anyone who had not yet or just started to experience puberty, causing them to grow at a rapid rate!<br>\r\n<br>\r\nLet us follow the story of a group of boys in one of the cabins who will experience the best summer of their life!</span></div></div>",
            "created":1350277200,
            "id":1447505,
            "title":"Lake Gonagro"
        },
        "142":{
            "author_id":"joerod1720",
            "author_name":"Joerod17",
            "choices":[
                "Timmy’s change",
                "Gabe’s change",
                "Carl’s change "
            ],
            "content":"<div class=\"\"><div> <span>With that being in mind, the 4 boys in cabin 5 got all their gear to get ready for their trip down to the lake. Anthony, the “leader”, was hurrying the boys to get their stuff as he was anxious to get to the lake. He was 4’6’ with a built of a normal boy at his age as he charmed the pants offf off of any second grade girl. Timmy was taking his time as he wanted to make sure he had everything before they left. He was 4’6’ and sort of scrawny but had a tough spirit. Carl was sort of nervous to actually get in the lake as he considered himself weak and puny to all the other boys. He was 4’2’, a late bloomer, as his voice was very faint and soft as he is always scared to take risks. Gabe was telling all the boys all the crazy stuff he is going to do at the lake while he was packing as he is the “daredevil” of the group. He was 4’6’ with a sort of athletic built as he is involved In numerous sports like baseball, basketball, and soccer. So after the long preparation, the boys are off. “The lake is that way” says Anthony as the boys follow the point of their leader. “Damn this is going to be fun” says Gabe, “don’t say damn, the counselors will hear you” says Carl, “Shut up Carl, geez” says Timmy. “We’re here” as the boys look around to see the glistening lake reflect the sun beams to captivate what camp can’t truly offer. The boys all take of their shirts, excluding Carl, as Anthony and Timmy run to the edge while Gabe goes straight to the tire swing. Anthony and Timmy pause at the edge touching the water with their toes to check the temperature as Anthony declares “I can’t get my hair wet”. Then, Timmy just pushes him in as he goes in the cold but amazing water as all the boys follow suit. They went in as young boys as when they will get out; it would be a whole new life. “ I’m staying out here guys I need to read this amazing book”, “Come on Carl!” The boys in the water say as Carl puts down his book and says “ Do you know how contaminated lake water is, Huh?!, it has greywater and you know what that is! POOP!”, the boys in the water just look at each other while they continue to play. Once out after a couple of minutes, they all dry off as Carl packs up reading and his towel. “Why didn’t you get into the water, PANZIE!” Gabe asks Carl, “ I’m not a pansie, I just don’t want to get hepatitis A at the age of 8” “ Well if you’re not a pansie; prove it!” Gabe points to the tire swing as Carl takes off his shirt to reveal his very scrawny/bones body as he goes to the tire swing but chickens out when the pressure of the boys gets to him. “I can’t do it” he exclaims “ YES YOU CAN” says Anthony, Gabe, and Timmy collectively. Carl looks at the height he will get if he does actually do it but for the sake of his reputation he gets in, takes a deep breath, and gets forcefully pushed by Gabe into the water as he comes up from it saying “GABE YOU JERK” but they just laugh as Carl laughs too because of the adrenaline pumped in him. That night after s’mores and a campfire hangout, the boys get to bed with stomachs full of Hershey goodness. “Today was the best” exclaims Anthony as the boys agree, “I bet tomorrow will be even better” says Timmy, and Gabe budges in by saying “let’s go catch frogs and put in counselor’s Jim’s office” “ewww” follows Carl as they all laugh and rest the starry night away. While in bed, Anthony starts to toss and turn as he feels as if he’s burning up, the molecules in his body start to multiply as he’s starting to change. His legs start to grow longer and longer as his pjs strat to get shorter on him revealing lengthy legs with hair starting to show. Then, his feet spurt out of his sock showing that they are strong and being with hair coming out of the toes. The legs start to build muscle as they begin contracting showing and impressive form as you can see every msucke start to rip through the pj pants. Anthony continues to groan as the growth moves up to his body as his flat stomach start to move around his white t-shirt due to his waistline contracting a v shape to start showing a thick v-line on his bottom abs as those begin to contract. It starts off in the lower portion as his flat body starts to rise with mounds of abs that start to show through his shirt revealing a very muscular body as his pecs start to inflate with muscle as it starts to shadow his abs. They continue to rise as it starts to tear through his shirt, considering it’s made for an 8 year old boy, as the pecs start to shove through the shirt and rips it to reveal beads of sweat trailing down Anthony’s body  as it starts to drip down to his lower region as a happy trail starts to form at Anthony’s belly button. His arms were inflating as well his triceps and biceps start to form huge round mounds oh his arms as the vein that links the hand to his arms starts to get thicker to reveal a glossy and perfect muscular arm that it round and firm. The growth comes to its last part as his neck start to get thicker with veins surrounding it as hair starts to grow on his chin as the baby fat begins to get sucked up to show an impressive jawline that is sharper than a knife which complements his beard very nice. Anthony wakes up and starts to moan even louder as his voice drops down an octave as his voice doesn’t sound like an 8 year old boy, but a sexy male adult. Anthony wakes up with no rememberance of last night, he feels really cold so he opens his eyes to get a blanket but he sees his shirt  and socks are gone traveling his impressive abs. He runs to the bathroom as he is scared and when he looks in the mirror he’s shocked but amazed. He starts to touch his arms confirming the firmness and how hard they are as he flexes them to show of the veins running down his biceps which then he starts to look at his 8 pack as he traversed his fingers down every ab all the way down to touch his v line as it seemed to amuse him with beads of sweat starting to cool off on his abdomen. He then touches his chin feeling how sharp it is and how his stubble really completes it  in which he follows his eyes down to his shoulders which also packed in some muscle as they broaden to make room for his arms. Anthony was impressed as he looked like a Greek god and he couldn’t wait to show his friends as he ran back to the cabin as his muscles were jumping with him as he had no shirt on while running back. “Guys I’m so hot!!! Like sexy hot! And....” he couldn’t believe his eyes </span></div></div>",
            "created":1546142640,
            "id":2595859,
            "title":"Cabin 5, 8 year old boys"
        },
        "1422":{
            "author_id":"omiohara",
            "author_name":"OmiOHara",
            "choices":[
                "Timmy",
                "Carl",
                "Anthony or Gabe"
            ],
            "content":"<div class=\"\"><div> <span>While Anthony was in the bathroom Gabe had started to grow. All ready more muscular then the boys his growth seemed to be more radical. As he slept the burning would start. Gabe groaned as his legs grew larger and stronger. His legs started to become covered in dark hair, soon his things would grow large in his shorts making them very tight. Next he feet popped out of his socks. Once a size nines now a size 14. He groaned as the growth had hit his upper body expanded, before the growth he already had the starts of pecs and even abs. He groaned again as his pecs grew to monstrous portions, they looked like two watermelons. His shirt would tear up now exposing his growing abs. 6 of them the grew larger and larger until hard and perfect. Hair sprouted on his chest and a happy trail appeared from around his belly button. Finally his arms inflicted to match his body he flexed while sleeping, they were huge. His veins were large and all over. His shirt finally ripped to reveal a dark jungle in his armpits. His neck swelled and his jawline grew larger. A beard started to form on his face. He had awaken when Anthony walked his. <br>\r\n  Anthony walked in shock as he noticed the larger man. Gabe didn’t realize he grown yet, “ Anthony! What happens to you. “ he said softly. His voice was much lower now. He stood up, Anthony could see how much larger we was then himself. Gage had grown to be Around 6’4. His body was covered in hair. Gage noticed how much he had grown, a smile appeared on his face, “ Hell yes! “ he started to flex his muscles were huge and perfect. Anthony looked at him, “ What happened to us- “ He paused as he heard something. Someone started to grow...</span></div></div>",
            "created":1589229240,
            "id":2834008,
            "title":"Gabe’s change"
        },
        "15":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "A pair of eleven year old twin brothers",
                "A fourteen year-old who is going through a late puberty",
                "A thirteen-year-old foreign exchange student",
                "A seven-year-old hyper boy",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these choices?</span></div></span></div>",
            "created":1355202000,
            "id":1486316,
            "title":"More Choices"
        },
        "151":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Both brothers grow bigger and stronger",
                "Only Matt grows bigger and stronger",
                "Only Mike grows bigger and stronger"
            ],
            "content":"<div class=\"\"><div> <span>Matthew and Michael were as close as two twin brothers could be. They were both 11 year old boys who were born identical with dirty blond hair and blue eyes. However, as the years went by, the differences between the two changed them. Mike was an athletic boy, who loved to play outside and participate in sports, developing a strong body. Matt on the other hand was lazier, preffering to spend his time playing video games and watching TV. Their parents mistakenly tried to treat the boys the same way, so they fed them both the same amount of food and snacks and so on. However, where Mike easily burned it off every day, the extra calories began to build up in poor little Matt, giving him a slightly chubby appearence.<br>\r\n<br>\r\nDespite knowing it was his own fault, Matt was slightly jealous of Mike. Mike was always stronger and better and more popular than him, even though they were the same height, yet different weight. Sometimes, Matt wished he could know what it was like to be strong like his brother...</span></div></div>",
            "created":1359522000,
            "id":1520382,
            "title":"A pair of eleven year old twin brothers"
        },
        "155":{
            "author_id":"olacomotastu",
            "author_name":"holacomotastu",
            "choices":[
                "Three brothers of 18, 13 and 9 years old.",
                "An eighteen-year-old bodybuilder with a chubby little brother.",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these choices?</span></div></span></div>",
            "created":1355374800,
            "id":1487294,
            "title":"Others"
        },
        "1551":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "several loud crashing sounds -- and is that wood splintering?",
                "Jason and Sean calling him down - they have something to show him.",
                "Nothing. Complete Silence."
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, Ben, you're the man of the house now. Make sure you take care of your brothers while we're gone for the weekend, okay?\"<br>\r\n<br>\r\nBen looked up at his dad, fought the urge to roll his eyes, and nodded. \"Yes, Dad, I will.\"<br>\r\n<br>\r\n\"And remember, there's no cellular service up in the mountains, so make sure to call the lodge if you need anything. We'll be in room 206.\"<br>\r\n<br>\r\n\"Got it.\" Ben waved goodbye to his parents, and as they got in the car, he slammed the door and turned around. Being eighteen wasn't all it was cracked up to be. Sure he had the house parents-free for three whole days, but what he also had was his two younger brothers to watch out for. He desperately wanted to have a party on Saturday night and invite half of the senior class, but he wasn't quite sure what to do with the two little dweebs. <br>\r\n<br>\r\nHe walked into the living room, where Dweeb 1, Jason, and Dweeb 2, Sean, were watching TV. They weren't so bad, he realized, as far as younger brothers go, but he just wish he could have some time alone from them, some time to be an adult. He'd get that in a few months when he went of to college, but for now, it drove him a little crazy. Sighing, he ran his hands through his medium-length blonde hair.<br>\r\n<br>\r\n\"Hey, Ben,\" Jason, the nine-year-old, asked, \"did Mom and Dad just leave?\"<br>\r\n<br>\r\n\"Yes, they did,\" Ben said. \"They were just in here a few minutes ago saying good-bye, remember?\"<br>\r\n<br>\r\n\"Oh…\" Jason shrugged, his big blue eyes beaming from below his short-cut blonde hair. \"I guess I was too absorbed in this show.\"<br>\r\n<br>\r\n\"Turn the TV off, anyways,\" Ben ordered. \"You guys need to finish up your homework.\"<br>\r\n<br>\r\n\"But it's Friday!\" Sean, the 13-year-old, protested. \"We got all weekend!\" Turning back to the TV, the shaggy-haired brunette flipped the channel to something else.<br>\r\n<br>\r\n\"Hey, I was watching that!\" Jason protested.<br>\r\n<br>\r\n\"It's a commercial, I'll flip it back in a minute,\" Sean countered.<br>\r\n<br>\r\n\"No, you don't have all weekend,\" Ben shook his head, stepping over to the TV and hitting the power button. \"I've got plans for tomorrow, and you guys are going to need to be out of the house. So that means you need to do your homework tonight!\"<br>\r\n<br>\r\n\"Plans?\" Jason asked, a curious look on his face. \"What plans?\"<br>\r\n<br>\r\nSean snorted, \"He's probably gonna sit alone waiting for nobody to call and invite him out.\" Sticking out the remote, he hit the button and turned the TV back on.<br>\r\n<br>\r\nBen glared at Sean, walking up and grabbing the remote out of his hands. \"Look, Mom and Dad left me in charge while they were gone, which means you two have to do what I say. And I say you're doing homework. Now, I'm going to go upstairs to change; when I'm back down here in ten minutes, you two better have your books open and your pencils and paper out, understand?\"<br>\r\n<br>\r\nJason slowly nodded, while Sean just rolled his eyes. Taking this in as much of an affirmation as he could get, Ben headed upstairs, leaving the two younger brothers behind for the moment.<br>\r\n<br>\r\n\"What a dick,\" Sean muttered.<br>\r\n<br>\r\n\"Well,\" Jason shrugged, \"at least if we get it done tonight, we'll have all day tomorrow and Sunday to do something fun!\"<br>\r\n<br>\r\n\"Didn't you hear him, Jason?\" Sean sat up, turning to his brother. \"He's planning on having some sort of party tomorrow night here. Which means <i>we</i> will be the ones cleaning up all day Sunday. It's not going to be a fun weekend.\"<br>\r\n<br>\r\n\"Oh.\" Jason's smile faded, and he slouched back down on the couch.<br>\r\n<br>\r\nAfter a few moments of silence, the TV flipped back on, although the only thing that it displayed was a static background.<br>\r\n<br>\r\n\"Hey, I thought Ben took the remote!\" Jason exclaimed.<br>\r\n<br>\r\n\"He did!\" Sean sat up, looking at the TV. \"He must've turned it back on accidentally.\"<br>\r\n<br>\r\n\"From upstairs?\" Jason asked doubtfully. \"I don't think the remote travels that--\"<br>\r\n<br>\r\n\"Jason! Sean! Can you hear me?\"<br>\r\n<br>\r\nBoth boys' ears perked up at this, and they looked around. \"Was that coming from--\"<br>\r\n<br>\r\n\"Yes, yes, I'm inside the TV. Listen, do you two have a minute?\"<br>\r\n<br>\r\nSean stood up, walking closer to the set. \"W-who are you?\"<br>\r\n<br>\r\n\"Don't worry about my name; that's not important right now. I'm what you humans call a 'demigod', specifically, a demigod of size. And I'm using your town as a little, shall we say, experiment of sorts.\"<br>\r\n<br>\r\nJason now stood up, looking between the TV and his brother with a confused stare. \"A Demigod? What's that?\"<br>\r\n<br>\r\n\"Basically, I can use my powers to do pretty much anything I want. And right now, I'm going to use them to let all the boys in your town have some fun. For the next three days, all the boys between seven and fourteen in your town can cause themselves to grow anytime they want! I just got here, and I'm going to let everyone else know, but you two are the first on my list. Does that sound like fun?\"<br>\r\n<br>\r\n\"Fun? Grow?\" Sean's mouth had dropped open in disbelief.<br>\r\n<br>\r\nJason, however, was much more enthusiastic. \"Wow, really? Yeah, that sounds like a lot of fun!\"<br>\r\n<br>\r\n\"Great! Then listen closely, and I'll tell you what you need to do in order to grow. The first thing is…\"<br>\r\n<br>\r\n-------------------------------<br>\r\n<br>\r\nUp in his bedroom, Ben had just changed out of his school polo and khakis and into a much more comfortable set of jeans. Standing shirtless before his full-length mirror, he flexed a little, impressed with how good his body looked right now. He wasn't a muscle-freak, or anything, but he did have a six-pack for abs and two firm and pronounced pecs, along with well-defined biceps and triceps. He had a body that wouldn't have a hard time getting any girl he wanted, and he knew it.<br>\r\n<br>\r\nAs he slipped on his favorite t-shirt, he suddenly heard something from downstairs, what sounded like… the TV being turned on. Ben shook his head in disgust. \"Sean! Jason! You'd better be starting on that homework!\"<br>\r\n<br>\r\nIn response, he heard...<br>\r\n</span></div></div>",
            "created":1371186000,
            "id":1610715,
            "title":"Three brothers of 18, 13 and 9 years old."
        },
        "15511":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "Jason reaching down to pick him up, with a mischievous grin",
                "Jason and Sean hadn't noticed him yet, and were still marveling at their growth"
            ],
            "content":"<div class=\"\"><div> <span>Ben grimaced as he heard the crashing in the floor below him. \"What the hell?\" he muttered, storming out of his bedroom towards the stairs. As he started heading down them, however, he felt the house began to shake. He lost his balance, stumbling to the landing halfway down and hitting his head against the wall.<br>\r\n<br>\r\n\"OW! Son of a b--\" He stopped, the sound of wood splintering growing louder, and as turned his head, he could see debris start to fall into the den area, and a large flesh-toned object seemed to be filling up the entire room. An object that seemed to be getting bigger, and that looked like... a foot...<br>\r\n<br>\r\nBooming laughter suddenly filled the air, and Ben realized it was not just one voice, but two. After a few seconds, he realized that the laughter sounded an awful lot like his brothers' voices, just incredibly magnified and deeper versions of them. He didn't have much time to think about it though, as the foot had finished filling up the den and was now pushing its way towards him. The toes were now taller than he was, and before he knew it, he was being pinned in between them and the wall behind him. The pressure hurt but didn't last long, as the foot still was growing and soon pushed its way through the wall like a bully on the beach knocking down a sand castle. <br>\r\n<br>\r\nMore dust and debris rained down around Ben. He coughed, gasping for breath, and he started to feel a little light-headed. He had no idea what was going on; he began to think that maybe the blow to his head from falling down the stairs had thrown his senses all out of whack. Whatever was happening, it was all beyond belief.<br>\r\n<br>\r\nThe dust settled, and Ben realized that he was no longer moving; the foot had stopped growing, for the moment at least. Maybe now he could get a good sense of what was going on, he thought. But as he looked up from the foot and the leg that rose from it, what he saw only made him more confused. Towering above him was his nine-year-old brother Jason, naked and with some bits of the house still stuck to his skin, and by now over a hundred feet tall. <br>\r\n<br>\r\nBen took a moment to try and comprehend what he was seeing, but before he could even begin to wrap his mind around it, he was stunned to see that standing behind Jason was his other brother Sean, equally as nude and equally as large, if not a bit larger. Both giants had huge smiles on their faces, and seemed to be catching their breath, still caught up in the excitement of what had just happened. <br>\r\n<br>\r\nClosing his eyes, Ben tried his best to wake himself up, praying that this was somehow all a bizarre dream. But nothing he could do worked, and as he opened his eyes again, he looked up and saw...</span></div></div>",
            "created":1380258000,
            "id":1670867,
            "title":"Plans Have Changed"
        },
        "155111":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Look for our friends",
                "Try growing in other ways"
            ],
            "content":"<div class=\"\"><div> <span>Jason's massive hand loomed down, reaching for towards Ben. Ben was completely caught off guard and before he could even think about escaping, Jason grabbed Ben and picked him up. Ben felt himself ascending into the air at a terrifying rate as his brother lifted him up. His little brother's fingers were clamped tightly around his body, preventing him from getting away, even if he wasn't already eighty something feet into the air.<br>\r\n<br>\r\n\"Lookie at what I found!\" Jason said, holding Ben out. Ben found himself staring into the gigantic face of his now much larger little brother Sean, whose wide toothy grin scared the shit out of him. <br>\r\n<br>\r\n\"Well if it isn't our 'big' brother Ben.\" Sean said, smirking at the tiny figure trapped in the palm of the other giant. \"Well it looks like our books aren't open and we're not going to be doing our homework. What are you going to do about it now? Spank us?\"<br>\r\n<br>\r\n\"He can't even reach that high.\" Jason laughed, a loud, deafening boom that made Ben's eardrums feel like they were going to burst.<br>\r\n<br>\r\n\"We're the big brothers now Ben, and you gotta listen to what WE say.\" Sean said. \"Otherwise...\"<br>\r\n<br>\r\nJason tightened his grip slightly, crushing Ben and causing him to cry out. \"OK, OK!\" He screamed, and immediately the pressure slacked off.<br>\r\n<br>\r\n\"Now then, what shall we do now?\" Jason asked Sean.<br>\r\n<br>\r\n\"Well, we can...\"</span></div></div>",
            "created":1381294800,
            "id":1676702,
            "title":"Jason reaching down to pick him up, with a misc..."
        },
        "1551112":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "Jason tests the limits of his growth and tries to get as big as possible",
                "Jason tries to see if he can grow older and become a teenager"
            ],
            "content":"<div class=\"\"><div> <span>\"Other ways?\" Jason asked, blinking. \"What do you mean?\"<br>\r\n<br>\r\n\"Well,\" Sean shrugged, \"the demigod guy said that we could grow ourselves anytime we wanted. He didn't say what types of growth we can do, though. Maybe we can do more than just get taller, you know?\"<br>\r\n<br>\r\n\"Hmmm...\" Jason thought for a moment, wondering just what his brother could mean.<br>\r\n<br>\r\nSean smiled. \"Just watch, and make sure the little pipsqueak can see too!\"<br>\r\n<br>\r\nJason complied, turning his hand over so Ben had a clear view of the giant 13 year old. He watched as Sean closed his eyes and took a deep breath, then suddenly started to appear as if he was intently concentrating on something. It took a moment for both Ben and Jason to realize that he was flexing. And, as he did so, his muscles appeared to be getting larger.<br>\r\n<br>\r\nIt was slight at first, as the skinny teen's pecs and biceps started to push out a little, but as he held the pose, the growth seemed to accelerate. Within forty seconds, Sean had gone from no definition at all to a strong, athletic physique, having a visible six-pack and a pecs that would've taken over a year solid in the gym to obtain. <br>\r\n<br>\r\nOpening his eyes with a shiver of pleasure, Sean grinned at his two brothers. \"...Something like that.\"<br>\r\n<br>\r\n\"Wow, that was cool!\" Jason exclaimed, impressed. <br>\r\n<br>\r\nFrom his hand, Ben watched, both amazed and terrified at the muscular teen his younger brother had just turned into. \"How--what--?\" He could only stutter, still speechless.<br>\r\n<br>\r\n\"Alright, my turn!\" Jason beamed, ready to have some fun,</span></div></div>",
            "created":1388638800,
            "id":1719882,
            "title":"Try growing in other ways"
        },
        "15511121":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Jason shouting, \"Oh no! I lost Ben!\"",
                "A booming crash in the distance, in the city proper."
            ],
            "content":"<div class=\"\"><div> <span>Jason closed his eyes and immediately began to concentrate, his tongue poking out slightly from the corner of his mouth. Sean chuckled, folding his arms across his new, bigger chest, unable to resist giving himself a little grope as he stood there. The feeling made him shiver a little, the power flowing through him incredibly addicting. He was already eager to start growing again, to really give Ben a show, but Jason still hadn't had his fun yet and he had to admit to himself he WAS curious what the little guy would come up with.<br>\r\n<br>\r\nBen, meanwhile, could feel his heart begin to race even faster as he felt Jason's hand heat up, his skin feeling slightly moist as he grunted slightly, focusing even more intensely. Ben had an increasingly bad feeling about this, his mind attempting desperately to process what was going on and failing miserably. It was all just...too much! Too weird! Like something out of a science fiction movie! Before he could dwell on that fact for too long though, Jason started to grow! Within seconds he had reached Sean's height and was quickly surpassing it, his youthful body rising higher and higher, his already enormous feet stretching across the grassy ground. Sean was standing perfectly in front of his little brother, head tilting back as he watched the young colossus swell ever taller, his fit chest passing him by, followed by his flat stomach, a thin layer of baby fat still pinchably visible on him. Sean blushed slightly as he saw his brother's dick rise above him as well, as long as the older brother's arm and still growing, surpassing anything he had ever seen before. He quickly turned his gaze skyward, his arms slowly unfolding and hanging by his sides. Jason was still growing, and growing faster! His eyes were screwed tight with concentration, his fist clenching harder. Ben would have been obliterated, turning into a messy red stain if he hadn't gotten so small in comparison that he was able to squeeze free, sitting on top of Jason's clenched fist, watching in horror as the ground continued to fall away, Sean's shocked face receding into the distance. Jason's grunts became thunderous as he pushed himself harder, his toes sliding off the grass and onto the street, the asphalt immediately cracking as the tremendous weight was forced onto it.<br>\r\n<br>\r\n\"H-Hey! Jason! Slow down! What are you doing?!\" Sean shouted, trying to get his little brother's attention, stumbling back slightly as Jason shifted his position, making the ground quake alarmingly, car alarms suddenly blasting the night air, the side of Jason's pinky toe uprooting a fire hydrant, adding to the chaos.<br>\r\n<br>\r\n\"H-Hold on...\" Jason said with a slight moan, his growth slowing slightly as he lost his concentration. \"I just....I just want to see how BIG I can get!\"<br>\r\n<br>\r\nCRASH! His big toe bulldozed the neighbor's house that lived across the street, water pipes bursting up through the street now, starting to flood the area slightly, people rousing from their slumber at tall the noise and chaos. Jason was swiftly becoming a spectacle that the entire neighborhood was seeing! Onward and upward, his expanded, Sean standing no taller than a toe now, Ben insignificant on his brother's hand! The slightest twitch could send him falling to his doom, a fact that he was painfully aware of and utterly incapable of changing. He was at his brother's mercy entirely now. Jason was starting to sink into the ground slightly, his weight too much for it to handle, cracks radiating out from where he was standing. More crashes were heard as his feet continued to take up and more and more space, obliterating houses left and right. \"OOoooh man...this feels so good!\" Jason's voice boomed from above, childish still but carrying a deeper tone that carried through the entire area.<br>\r\n<br>\r\nFinally, Jason stopped growing, standing at a staggering thousand feet tall, his body visible to most in the city, his eyes slowly opening, then widening. \"Woah...Look at me! I'm HUGE! This is so cool! I'm the biggest kid EVER!\"<br>\r\n<br>\r\nHe giggled as he lifted his foot up, bringing it down with a crash to the ground, watching as it smashed through, ripping up even more pipes, his toes crunching the metal as easily as if they were made of paper! He looked down at the ground, waving at Sean with the hand that wasn't holding Ben. \"Hey LITTLE bro! Guess what? This isn't even as big as I can get! I just decided to stop for now for some fun!\"<br>\r\n<br>\r\nSean was stricken dumb for a moment, just looking up at this young titan. He quickly shook his head and shouted, \"Don't start growing again! Let me catch up first at least!\"<br>\r\n<br>\r\nHe was about to start concentrating when his attention was drawn to something else.</span></div></div>",
            "created":1395723600,
            "id":1767513,
            "title":"Jason tests the limits of his growth and tries ..."
        },
        "155111212":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "He was as big as Jason but super muscular",
                "He was a super giant, twice as tall as Jason and musclebound!"
            ],
            "content":"<div class=\"\"><div> <span>In the distance, they all heard some loud booming noise, followed by the sound of something cheering....very LOUD cheering!<br>\r\n<br>\r\n\"Dude, let's go see what's going on over there!\" Jason said.<br>\r\n<br>\r\n\"Aww, can't I grow first?\" Sean asked.<br>\r\n<br>\r\n\"You can grow as much as you want later Sean, we got all the time in the world now!\" Jason told him.<br>\r\n<br>\r\n\"Fine, but you'll have to let me grow bigger than you to make it up to me!\" Sean told him.<br>\r\n<br>\r\n\"Whatever you say 'little' brother.\" Jason grinned down at his smaller, yet still giant sibling. \"Oh, that reminds me.\" Jason then looked down in his hand, where Ben still clung to. Even though Ben had escaped that crushing palm, he was still several stories high in the air with no way down. \"Enjoying the view 'puny' brother?\"<br>\r\n<br>\r\n\"Let me down!\" Ben yelled.<br>\r\n<br>\r\n\"You didn't say please.\" Jason grinned wickedly. \"And for that, I'll have to hang on to you a little while longer. But because I might need both hands later, you can hang out in my hair until you've learned some manners!\" With that he plucked Ben off his hand like a bug and dropped him into his hair. Ben gave a cry and clung to several armfuls of hair for life.<br>\r\n<br>\r\n\"Alright, let's go!\" Jason and Sean started to move towards the city. Jason's much larger legs allowed him to move through the neighborhood quickly, his giant feet cracking the asphalt. Sean however had to hurry a bit to keep up, his (comparitively) shorter legs not covering as much distance. So, in order to entertain himself while waiting for Sean to catch up, Jason decided to do what giants do best. He went to a car that had been parked out on the street and slowly placed his foot on top of it. Just from resting his foot on top of it caused the roof to cave in, the glass shattering. Then, with deliberate slowness he pressed down, the car screeching and alarm going off as the steel was being compressed under several tons of preteen boy. With a satisfying CRUNCH the alarm cut off as he thoroughly flattened the vehicle.<br>\r\n<br>\r\n\"Shit, that was awesome!\" Jason said as he lifted his foot and surveyed the damage. \"I can't wait to get downtown and see what kind of stuff I can do there!\"<br>\r\n<br>\r\nBen shook violently from the thought. Just what kind of monsters did his two brothers become?<br>\r\n<br>\r\nFinally Jason and Sean reached the city. Although the two boys were much bigger, the buildings still loomed above them. The looks on their faces obviously told Ben that they didn't like that idea, but before they could do anything about it, another booming noise caught their attention. The two giants plus Ben rounded the corner and were surprised to see the boy's 10 year old friend Adrian, only...</span></div></div>",
            "created":1395896400,
            "id":1768667,
            "title":"Little Big City"
        },
        "1553":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "A couple with five sons",
                "A class on a field trip to a medical facility",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more choices for your writing pleasure</span></div></span></div>",
            "created":1395810000,
            "id":1768160,
            "title":"More Choices"
        },
        "15532":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "The bacteria grows them overnight",
                "As time goes by, the boys experience a \"super puberty\""
            ],
            "content":"<div class=\"\"><div> <span>\"And this is on of our many labs, where we create new products!\" The tour guide said as she lead the class into a large room full of science equipment. Most of Mr. Bower's 6th grade class was a little more than just bored at this point, trudging along while pretending to care about the place they were in. Some kids might've saw this field trip as an exciting adventure, but in this small town there wasn't a lot of places to go, and most have already gone to Medi-Labs for a field trip before.<br>\r\n<br>\r\nAs they were walking through, one scientist on the side was working on a male super growth formula that would increase not only muscle mass, but overall height and health as well. However, the formula was somewhat in the unstable so far, and it vexed him. He had been so preoccupied with trying to get this formula to work that he began taking shortcuts, skipping procedures, and so on. He was actually testing it on a weak strain of bacteria in an open lab where he should have been testing it in an enclosed, sterile environment, but he wanted to work on it right away and not go through the tedious procedures. Besides, the bacteria was extremely weak, and any adult immune system would immediately destroy it.<br>\r\n<br>\r\nTaking a few drops of his formula, he dropped it into a beaker full of the bacteria culture. Immediately the culture turned blue, then evaporated into a billow of smoke. The scientist swore under his breath as his work disappeared on him, but little did he know that the bacteria was still there, and now airborne. The bacteria would die within moments without proper hosts with underdeveloped immune system.<br>\r\n<br>\r\nAnd, as fate would have it, it had plenty of host bodies to inhabit. Fourteen of them in fact. The young boys of Mr. Bower's class moved onto the next room, oblivious to what was in store for them...</span></div></div>",
            "created":1395810000,
            "id":1768213,
            "title":"A class on a field trip to a medical facility"
        },
        "155322":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Follow the POV of the kids as they grow",
                "Follow the POV of their teacher Mr. Bower"
            ],
            "content":"<div class=\"\"><div> <span>Thanks to the clumsiness of the scientist, 14 boys were now infected with a mutated strain of bacteria powered by an incredibly powerful growth formula. It had been so subtle that no one noticed it at all, and the source of it would probably never be revealed. However, the fact of the matter was that now all these 10-11 year old boys would now be experiencing extreme growth spurts in the near future.<br>\r\n<br>\r\nOf course, the bacteria didn't cause them to grow right away. For the first few days it was slowly adapting to their new hosts body, multiplying steadily, changing them from the inside out. It wasn't until five days after the field trip that each boy woke up and discovered that something felt amiss, that their clothes were just slightly tighter, that the world looked a centimeter lower. It was so minute and small that they paid it no attention, but that was just the first step to their growing journey.<br>\r\n</span></div></div>",
            "created":1418921700,
            "id":1904319,
            "title":"Super Powered Puberty"
        },
        "1553221":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "During class that day, Kamran suddenly goes through some massive changes",
                "Class goes normally, without any further changes to the boys until the next day",
                "Worried about his class, Mr. Bower brings in a doctor to examine all the boys"
            ],
            "content":"<div class=\"\"><div> <span>While the bacteria was causing all of the boys to grow, each one was affected by it in a slightly different way. While they could all tell something was different as they went through their day on the fifth day after the field trip, the changes began to become noticeable the morning after that when they woke up.<br>\r\n<br>\r\nSam, the most popular boy in the class, woke up first. He was blonde haired with a handsome smile and athletic, already having developed some muscles before the changes had even occurred. When he woke up and went to the bathroom, ready to take his shower, he was stunned to see in his reflection that the t-shirt he slept in was now form-fitting all around his torso, and he was a good three or four inches taller than the day before. “Wow! I must’ve gained forty pounds of muscle overnight!” He took off his shirt and kept checking himself out. “I look like a high schooler!”<br>\r\n<br>\r\nA few streets away, Ian, a lanky, red-haired boy, had woken up to an uncomfortable tightness in his pajama pants. Looking down at himself, his jaw dropped when he saw how big his bulge had become, the outline of his boyhood clearly visible beneath the fabric. As he tried to get ready for the day, he realized that no matter what underwear or pants he put on, his large junk would clearly be noticeable. Not that he minded, of course.<br>\r\n<br>\r\nTwo of the boys in the class, Caleb and Calvin, were twin brothers who shared a bedroom. When the alarm went off, they both sat up, cleared the sleep from their eyes, and looked at each other, as their eyes both lit up. Calvin was the first to speak. “Dude, you’re way taller!” “So are you!” Caleb replied. They both stood up, marveling at how much smaller their room seemed, as each had grown nearly a foot taller in their sleep, their boxers they had slept in both about to rip off.<br>\r\n<br>\r\nAcross the town, the rest of the boys in the class woke up this way: one stunned that his feet were now twice as big as before; another that he had the strength of a bodybuilder, able to lift his older brother without even trying. The boys all excitedly talked to each other on the bus and in the classroom before school started, each comparing themselves and the changes.<br>\r\n<br>\r\nAll except for one. Kamran, a small, dark-skinned boy whose family had moved from India just the year before. He was the shortest, skinniest boy in class before the field trip at just barely over four feet tall and fifty pounds, and this morning he was... just an inch taller and a pound heavier. Already a quiet, shy boy, the fact that he was the only boy in class who hadn’t experienced a significant change made him feel all the more ostracized and embarrassed.<br>\r\n<br>\r\nBut fate is a funny thing, and Kamran’s and the rest of the boy’s changes had barely even begun...</span></div></div>",
            "created":1514090100,
            "id":2431941,
            "title":"Morning of the Sixth Day"
        },
        "15532211":{
            "author_id":"hunky",
            "author_name":"LucasFan17",
            "choices":[
                "He  has grown nearly 8 inches ",
                "His belly was starting to bulge out"
            ],
            "content":"<div class=\"\"><div> <span>While on the bus karman greetted his freinds,still upset that he hadn't grew like the rest of them. But, his freinds told him not to worry and hope that he would grow too. While in math class, Karmans stomach let out a hefty but quiet gurgle. He found it weird since he just ate lunch. He asked to use the bathroom, and he went into the bathroom and When he looked in the bathroom mirror, he realized, </span></div></div>",
            "created":1522790880,
            "id":2474350,
            "title":"During class that day, Kamran suddenly goes thr..."
        }
    },
    "info":{
        "author_id":"reedington",
        "author_name":"Big Boy",
        "brief_description":"An entire generation of boys are about to grow bigger than the last one!",
        "created":1350060420,
        "description":"<td align=\"left\" class=\"norm\">Due to an unknown event, all of the younger boys in a small town are suddenly growing bigger and stronger at a rapid rate!<br>\r\n<br>\r\n<b>General Rules:</b><br>\r\n<br>\r\n1. Only boys ages 15 or under may grow<br>\r\n<br>\r\n2. No toilet stuff.<br>\r\n<br>\r\n3. Try and write as much as possible for each story branch</td>",
        "id":1897391,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589229240,
        "modified":1589229240,
        "pretty_title":"Generation XL"
    }
}