{
    "chapters":{
        "1":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "weight gain by eating",
                "weight gain by hose feeding",
                "weight gain by force feeding",
                "other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are the choices</span></div></span></div>",
            "created":1321419600,
            "id":1224183,
            "title":"the choices"
        },
        "11":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she calls and wins",
                "she calls and loses",
                "she finds out that they closed down years ago"
            ],
            "content":"<div class=\"\"><div> <span>elastigirl had just finished up fighting crime for the day and was ready to head back to the house to her beloved husband when she heard a cry from and ally way \"well i have time for one more good deed\" she said as she ran down the ally way not noticing a mysterious shadow behind her she arrived on site and found not a screaming victim in terror but she found a taperecorder and a pile of cupcakes she stepped towards them heasitently and felt somthing crinkle beneath her foot it was a note which read \"hello there elastigirl we knew tha this was the only way we could get you to try our new brand of cupcakes this is a limited time offer please let us know if you like them we would really like your opinion on our new product thanks and enjoy\" \"hmmm maybe one wouldnt hurt\" elastigirl said as she walked up to the delicious chocolate glazed cupcakes and she picked up one the felt warm and soft in her hand she quickly stuffed one into her mouth and the flavors just bursted out of the cupcakes \"ohhh man these are good\" she said happily enjoying a second cupcake she quickly found herself finishing the whole plate of samples and was licking her lips \"oh man thats the best thing i have tasted in years man i wish i could have just one more\" suddenly the paper flipped over and revealed a phone number and under that it said \"call this toll free number for a chance to win the ultimate prize unlimited free cupcakes for life limited time only \"i am dialing this number right now\" she said what happens next</span></div></div>",
            "created":1325653200,
            "id":1252692,
            "title":"weight gain by eating"
        },
        "111":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she finds a few small packages at the door",
                "she finds on small package at the door"
            ],
            "content":"<div class=\"\"><div> <span>she quicly dialed the phone number and someone picked up \"hello and welcome to the sweepstakes to win the ultimate prize lets se if your the 100th caller she was put on hold fo a minute but they answered back shortly \"i am very glad to inform you tha you are indeed the 100th caller and we will ship you the ultimate prize however you want it shipped to you do you want it in bulk or do you want it in smal packages\" \"small packages please elastigirl\" said happily ok we will ship them to you shortly we have already verified your address thank you for calling and enjoy\" elastigirl jumped for joy then she quickly ran home to see if you order came in what happens next</span></div></div>",
            "created":1325653200,
            "id":1252695,
            "title":"she calls and wins"
        },
        "1111":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she goes to pick her kids up at school",
                "she eats more cupcakes"
            ],
            "content":"<div class=\"\"><div> <span>she arrived at her house to notice that a few boxes of cupcakes had come in she quickly scooped them up and put them on the counter then she noticed a note on the refridgerator which read \"hey honey wont be back for awhile so your going to have pick up the kids from school at 4:30\" elastigirl looked at the clock it read 2:00 \"oh looks like i have enough time to eat some of these delicious cupcakes\" she said as she made her way to the boxes she opened one and it revealed a chocolate sea of chocolate glazed cupcakes \"oh i am going to enjoy this\" she said as she quickly gulped down the first one \"mmmmm\" she exclaimed happily she finished the first box in only five minutes but she didnt notice that her pants wer getting tighter she now had a little bit more fat on her butt but she kept eating finishing the other two boxes in no time flat her butt was now the size of two basketball and her pants were straining at the hips and now she noticed it \"oh my pants are starting to get tight\" she said as she turned around to look at her engorged butt \"man i might have to lay off the cupcakes for awhile\" she said as she shook her butt causing it to jiggle back and forth \"but thier so good\" elastigirl said sadly what happens next</span></div></div>",
            "created":1325912400,
            "id":1254040,
            "title":"she finds a few small packages at the door"
        },
        "11111":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she cant resist eating more cupcakes",
                "she goes on a diet"
            ],
            "content":"<div class=\"\"><div> <span>elastigirl had stopped moping about her butt and decided that she would get to work to fix it later then she remembered that she had to pick up dash and violet she looked at the clock 4:10 \"oh no i need to hurry\" she said as she changed into her everyday clothes which wer tighter in the butt to but still help together then she started for the door and went outside and tripped over something causing her butt to jiggle \"ouch what in the world\" she said as she got up and looked at what he tripped on it was more boxes of cupcakes \"oh yea i won that contest that gets me free cupcakes for life well tha doesnt help my situation\" she said as she looked at her butt again \" well since this is the last time ill be able to have those for awhile i guess one more box couldnt hurt\" she said as she picked up one and put the rest inside the house and headed towards the school she ate the donuts while she was driving and she noticed that her seat felt different it felt as if she was sitting on a soft pillow then she remembered that her butt had grew a little after eating those boxes of cupcakes which got her thinking about her butt again \"man i wonder how long its gonna take to work off these pounds\" she said as she arrived at the school and dash and voilet ran to the car \"hi mom\" they both exclaimed \"hello kids how was your day\" elastigirl said back\" they both replied good and they were off back to the house they arrived and they all got out when the kids noticed something different about their mom \"hey mom are those pants getting tight on you\" dash said elastigirl blushed \"son you should no better than to tell your mom that tell him violet\" \"well mom your butt does look kind of big to me\" violet said shyly \"well if you both think so then your grounded for the rest of the day and maybe tomorrow\" elastigirl said as they entered the house and they both went to their rooms without and arguement \"man i thought i tought them better thatn that making fun of my butt like that\" elastigirl said angrily not realizing that she was eating the cupcakes again to cope with her anger and still not realizing that her butt was growing with each box when she finally realized that her butt was growing it had already grown to the size of two basketballs and had ripped a hole in her pants her panties were now showing through the back of them \"oh my god my butt\" elastigirl said as she stood up and making her butt jiggle like jello what happens next</span></div></div>",
            "created":1325912400,
            "id":1254120,
            "title":"she goes to pick her kids up at school"
        },
        "111111":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she had gained 50 lbs",
                "she had gained 100 lbs"
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl noticed that her pants were straining and the top button on her jeans now was about to pop \"oh no now i am going to have to go clothes shopping to get some new clothes\" she said as she blushed and then realized that when bob got home he would notice her balloon of a butt \"man i am in a real pickle but thier so good\" she said as she reached her hand out and grabbed another cupcake and stuffed it into her mouth \"oh no why cant i stop eating these cupcakes\" she said worriedly as she couldnt stop her hand from brabbing another four cupcakes and put them into her mouth making the top button on her jeans finally pop of and fall to the floor exposing the front of her panties which were also starting to strain \"oh god no please stop\" she exclaimed as her hand took on a mind of its own grabbing cupcakes and stuffing them into her mouth now her jeans had fallen to the floor and her butt and panties wer now exposed she was glad that her kids were in thier rooms because she was so embarrased her butt that jiggled with every step was now the size of two overinflated beach balls and twice as squishy and it was getting heavy but elastigirl made her weigh to the scale to measure her new found butt what happens next</span></div></div>",
            "created":1329627600,
            "id":1280084,
            "title":"she cant resist eating more cupcakes"
        },
        "1111111":{
            "choices":[
                "More",
                "Feeds Helen "
            ],
            "content":"<div class=\"\"><div> <span>As soon as Helen had looked at the scale she knew that her husband would not like her new found heft, but while she tryed to figure out a way to hide her meat mister incredible walked In and his eyes swelled like her new pant melons. With out saying a word he ran over and standing behind her he began to  caress her little belly while he was rubbing uP against her new booty she let out a groan as his hands moved up to her swollen breasts which were stretching her shirt to the extreme</span></div></div>",
            "created":1332651600,
            "id":1302718,
            "title":"she had gained 50 lbs"
        },
        "11111111":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "they got the order wrong and gave then 24 boxes of cupcakes",
                "the new cupcakes they ordered had and extra growth compound in them"
            ],
            "content":"<div class=\"\"><div> <span>\"honey do you like my new body\" helen said to her husband as he rubbed her butt up and down making it jiggle like jello \"oh honey its wonderful how did you do it\" he replied back still rubbing her butt \"with these new cupcakes that i won in a contest we we have a liftime supply so i can keep growing for you\" she said pointing at the boxes which most were half empty \"oh yes we need more much more i want you to be huge honey huge i love your big butt\" he said as he went to the phone and aske for the number to the cupcake company she told him and he ordered another dozen boxes while helen went over the other remaining boxes and started to eat the leftover cupcakes happily enjoying everyone won as each box she finished showed new results on her body her butt now strained her pants almost bursting at the seams and her breast pushing up against her bra and her bell starting to push up her shirt what happens next</span></div></div>",
            "created":1338699600,
            "id":1351177,
            "title":"More"
        },
        "111111112":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she grows larger and larger",
                "she doesnt want to eat anymore"
            ],
            "content":"<div class=\"\"><div> <span>the new boxes arrived quickly as bob grabbed them from the front porch as elastigirl had just finished the last of the old boxes her panties were one cupcake away from ripping of her body and her belly was as big as a couch pillow and her breast were sraining her bra bob quickly ran and read the new boxes and they said our new formula with an extra something in them we hope you enjoy \"oh honey i wonder what that means\" bob said as he started to open the new box \"hmm i dont know honey but were about to find out\" helen said as she grabbed a cupcake from one of the new boxes and ate it suddenly her panties broke off from her new gigantic butt her bra broke from the size of her huge boobs and her stomach ballooned to the size of a beach ball and they all jiggled back and forth with fat \"oh i think they have a growth compund in them bob that means i can grow larger faster\" helen said happily \"oh great honey start eating ill go order more right now\" bob said happily getting up to use the phone as helen finished off the first of the new boxes they showed fantastic results her butt was the size of two couches and twice as jiggly and soft and her boobs were the size of beach balls and her stomach was the size of a couch but she noticed something she couldnt get up all the fat had made her to heavy to stand or even moved every time she tried to move she just jiggled with fat what happens next <br>\r\n</span></div></div>",
            "created":1343365200,
            "id":1390365,
            "title":"the new cupcakes they ordered had and extra gro..."
        },
        "113":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "The factory actually is abandoned, but full of fresh treats!",
                "The factory is still and up running!",
                "She's fallen for a trap!"
            ],
            "content":"<div class=\"\"><div> <span>\"...I'm sorry. The number you have reached is no longer available. Please hang up and dail-\".<br>\r\n<br>\r\nHelen ended the call, \"No longer available?\" Helen pinched the note between her fingers and read it again. Seems like it was written recently, given the lightly smudged ink and the fresh taste of the cupcake. \"I better get to the bottom of this.\" She said, gathering the feeling of suspicion and the need of donning her superhero alter ego. <br>\r\n<br>\r\nBy cross-referencing the phone-number via a simple internet search, Helen found both the name of the manufacturer and the location. <br>\r\n<br>\r\n<i>Joy Confections Bakery. Just on the outskirts of Metroville.</i><br>\r\n<br>\r\nWith that information, Helen grabs her car keys, a duffel bag containing her super suit, and a note on the fridge informing the family that she'll be out for the day. On the road, Helen kept a stern look on her face. Her mind constantly battled agaisnt her consiocs.<br>\r\n<br>\r\n<i>What's really the reason I'm coming here? Is it because I want more cupcakes? Or is it to solve the mystery of the factory? Maybe it's both.</i><br>\r\n<br>\r\nThe thoughts in her mind hadn't subsided by the time the tires stopped in front of the building. Among the outskirts of Metroville, this lone factory was the only landmark for miles. To answer one question, the outside of the building felt quiet and desolate. Indications of life are completely absent save for the trash blowing around the property. The neon sign reading 'Joy Confections Bakery' appeared to have been collecting dust for ages. There's little doubt that it's been years since it was last switched on. <br>\r\n<br>\r\nHowever, the smell of fresh baked sweets remained in the air. Creating a pleasant, mouth watering aroma that clashes with the deserted environment. Either the air is like that from years of baking the factory has done or someone is still in there, crafting confections in secret. Despite the conflicting feelings inside, Helen desperately wanted to explore the factory. <br>\r\n<br>\r\nUp above, a large open window pane became the point of entry. Helen stretched her arms onto the sill and pulled herself up where she vaulted over and landed right onto the factory floor where she discovered...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1509771600,
            "id":2411008,
            "title":"she finds out that they closed down years ago"
        },
        "1133":{
            "author_id":"iwfan53",
            "author_name":"Iwfan",
            "choices":[
                "The factory is set up to make Helen fat.",
                "The factory is set up to bake Helen into a gigantic rubber muffin!",
                "Something else...."
            ],
            "content":"<div class=\"\"><div> <span>Helen looked around the factory, it didn't quite seem to be in production at the moment, but by the same token, it didn't seem to have been shut down for years either.  There was no massive layer of dust to be found for example, even if at the moment all of the lights were off meaning that the stretchy superheroine could only see by the light coming in through the windows.<br>\r\n<br>\r\nNot only was there a lack of dust, but there was one other great big clue that this place had still been in operation recently, it seemed to be stuffed to the gills with the wonderful smell of freshly cooked muffins.  Just breathing in was enough to leave Helen feeling wistful and she couldn't help but wonder if there might be some of them still left laying around.<br>\r\n<br>\r\nThat was a pipe dream of course if the place really had been closed down for years, but by the same token so much seemed to suggest that the factory had been in operation not so long ago, so it couldn't really hurt to take a look.  Besides, given how run down the place was it was unlikely that anyone would be able to properly accuse Helen of trespassing, assuming there was anyone around to accuse her in the first place!<br>\r\n<br>\r\nSo Elastigirl slowly and carefully extended a leg down to the factory floor and then another before retracting her limbs and lowering herself down to the ground level.  She began to poke around inside the factory, wondering what exactly had been going on with this place and why it seemed to have been closed down for so long, and yet still be capable of producing muffins, muffins that someone had made with her especially in mind.<br>\r\n<br>\r\nIf it hadn't been so long since her last major outing as a superheroine Helen might have been more worried and suspicious, well that and the fact that her belly was full of nice warm muffins left her feeling a bit more at ease with the world and a bit less on edge.<br>\r\n<br>\r\nShe extended her neck here and there looking for obvious signs of machines that had been in use recently or anyone else who might have still been working inside the factory, and yet no matter how hard she looked and searched she didn't find anything out of the ordinary.<br>\r\n<br>\r\nHelen was about to consider the entire thing just one great big waste of time (there weren't even any extra muffins to be found!) when all of a sudden a powerful \"WHRRRR\" noise  began to emerge from the machines that surrounded her.<br>\r\n<br>\r\n\"What now?\"  Helen couldn't help but ask even though there clearly wasn't anyone around to answer her.<br>\r\n<br>\r\nTo Elastigirl's surprise and confusion all of a sudden the factory seemed to spring to life as machines turned on, electrical lights began to glow and conveyor belts began to move seemingly of their own will.<br>\r\n<br>\r\n\"The factory must be near entirely automated... though that still doesn't explain how those muffins ended up in a basket with my name on it...\"  Helen pondered as she stood around watching and wondering what would happen next. <br>\r\n<br>\r\nMaybe if she didn't leave just yet she might get a chance to meet whoever it was who collected the muffins once they were done baking, or if no one at all showed up, well then it wouldn't be such a horrible thing to help herself to a few more of the tasty treats would it?<br>\r\n<br>\r\nThe next major event that happened had nothing at all to do with cooking though....<br>\r\n<br>\r\nFrom well concealed hatches in the walls strange gun like devices emerged and since Elastigirl was busy watching the moving conveyor belts she wasn't aware of their presence until it was too late.<br>\r\n<br>\r\nThe guns made a wet goopy sound when they fired and from their barrels emerged blobs of light brown gunk.  Several of them slammed into Elastigirl's back, knocking Helen forward and onto the conveyor belt.  Elastigirl used her rubbery powers to twist her head around so she could see what was going on just in time to watch the guns twist and rotate in order to acquire the correct firing angle to blast her body several more times over.<br>\r\n<br>\r\nWhatever the strange material was, it might at first look like ordinary cooking dough, but it seemed to harden into concrete that was sticky as superglue!  No matter how Helen began to stretch and squeeze her body she wasn't able to slip free, and the conveyor belt she was stuck to was starting to carry her towards one of the factory's many huge machines, Elastigirl had stuck around to try and find out how the factory worked, and now it seemed like she was going to get the ultimate up close and personal experience!</span></div></div>",
            "created":1509771600,
            "id":2411046,
            "title":"She's fallen for a trap!"
        },
        "12":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Hose feeding",
                "hyper inflation",
                "breast/butt inflation",
                "gas inflation",
                "soda inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you sure?</span></div></span></div>",
            "created":1485406800,
            "id":2269299,
            "title":"weight gain by hose feeding"
        },
        "121":{
            "choices":[
                "Force feeding with hose with beans? (Fart include)",
                "Jello",
                "Something more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A classic one heh? Which way our heroine grown?</span></div></span></div>",
            "created":1499144400,
            "id":2347102,
            "title":"Hose feeding"
        },
        "1211":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Syndrome (back from the dead)",
                "Mirage",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl slowly opened up her eyes and tried to figure out what all happened with her a few minutes ago. As she regained consciousness she realized that she wasn't sitting at home on her couch anymore. Instead she was dangling from some hand cuffs in a dim lit room. \"So we meet again, Elastigirl\" came a voice somewhere hidden in the shadows \"I see that you've gotten yourself into a \"tight spot\"\" the voice continued saying. For some reason Elastigirl thought she has heard that voice before as she continued to struggle out of her chains. \"Who are you, what do you want\" Elastigirl asked in a ferocious attitude. \"My my temper temper\" the voice said as a dark figure in the corner slowly started walking up to her. Once the figure got up close to Helen cough cough I'm mean elastigirl, her eyes widened with shock to see who the figure was..............</span></div></div>",
            "created":1499144400,
            "id":2347166,
            "title":"Force feeding with hose with beans? (Fart include)"
        },
        "12112":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "..............",
                ".............",
                ".............."
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl was in shock once she saw that the dark figure turned out to be Mirage slowly walking up to her. \"What the, Mirage what are you doing to MMMPPPHHH!!!!\" She was interrupted by a hose being shoved into her mouth. Once the hose was in her mouth Mirage then took the strap that was on the hose and hooked it behind Elastigirls head to keep it in place so she wasn't able to spit it out. \"MMPPHHH MMPPHH MMMMPPPHHHH\" Elastigirl mumbled out. Mirage then turned around and walked slowly over to the wall where there was a lever. Once she got over to the lever all she said was \"I've been waiting for this for a long time\" as she pulls the lever down. Just then Elastigirl got a sudden mouthful of..............BEANS?????? there were so many beans being forced into her mouth she had to swallow them. So that's what she did.Continue? </span></div></div>",
            "created":1499230800,
            "id":2347959,
            "title":"Mirage"
        },
        "121123":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Elastigirl gets her fill and Mirage shuts the machine off",
                "Elastigirl continues swallowing beans until the machine runs out of beans",
                ".............."
            ],
            "content":"<div class=\"\"><div> <span>Down the beans went as Elastigirl gulped them down even though she wasn't a fan of eating beans, she had no other choice but to swallow them down anyways. MMMMPPPHHHH she tried to muffle out. Whats wrong elastigirl? \"Don't like beans well its too bad, cause I can't take the hose out until you eat every............last...............bean\" Mirage told her. Now you see elastigirl, the reason why I'm doing this to you is because I am getting revenge from you hitting me that day when I released your husband from Syndrome's prison chamber and I will not rest until it happens\" she explained. With that said Mirage then walked back over by the lever and watched Elastigirl grow to size. What happens next?</span></div></div>",
            "created":1502082000,
            "id":2366062,
            "title":".............."
        },
        "1211231":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Helen passes out ",
                "..........................",
                ".............."
            ],
            "content":"<div class=\"\"><div> <span>This process goes on for over half an hour, then Mirage walks back up to Helen and rubs her gigantic overstuffed belly. \"ooooooohhhhhh someones is getting quite stuffed aren't they?\" She asked sarcastically.  Elastigirl was too exhausted to respond from chugging down all the beans. Mirage then walked back over to the wall and flipped the lever off. \"I think we'll call it quits for today don't you think\" Mirage asked again sarcastically. She then went over and took the hose out of Helen's mouth so she could breathe for a while. Then walked back over to the wall and pressed a red button causing the cuffs to release her. You would think she would fall to the floor but her big belly was already touching the floor. \"I hope you learned your lesson in making a fool out of me\" Mirage finished off saying as she walked out the door, but as she did she whispered \"because the fun hasn't even begun yet\" and with that she was gone. What happens next?</span></div></div>",
            "created":1502082000,
            "id":2366065,
            "title":"Elastigirl gets her fill and Mirage shuts the m..."
        },
        "12112311":{
            "choices":[
                "She begin fart loud and expand his butt even more",
                "Her breast and booty begin to inflate with gas inside her belly."
            ],
            "content":"<div class=\"\"><div> <span>Helen pass out after eat so many beans. Some hours later she awake and feel something strange. His belly was not so much big, but all the heigh from his belly go to other direction: His butt. Helen scream and say:<br>\r\n<br>\r\n\"GAAH! WHAT THE HELL HAPPEN TO MY BUTT?!\"<br>\r\n<br>\r\nHelen then try to walk but couldnt walk very well because of the huge heigh in his booty. From the darkness he hear Mirage mock her. \"Not so much heroine now heh? That beans you eat was geneticaly change. They grow the butt of the victim with a huge state, but they have some...side effects\" Elastigirl start to panic. What others side effects?! Then Elastigirl begin to feel a pain in his belly and his butt begin to tremble. What happens next?</span></div></div>",
            "created":1508130000,
            "id":2402313,
            "title":"Helen passes out "
        },
        "121123111":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "She just begins to fart ",
                "her butt expands",
                "yes both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should we do that or something else?</span></div></span></div>",
            "created":1509685200,
            "id":2410359,
            "title":"She begin fart loud and expand his butt even more"
        },
        "1211231111":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "No thanks",
                "alright",
                "lets wait for a while"
            ],
            "content":"<div class=\"\"><div> <span>Helen could feel her stomach gurgle and groan trying to settle from digesting the beans. Then there was an odd pressure building up and then.........fffrrrttt. Helen blushed hard with embarrassment knowing that she just passed gas, but that wasn't all of it. Ffffrrrttt    fffrrrtttt    ffffrrrrrttttttt    With every fart she passed, her booty jiggled from the immense power that shot out of her ass. Mirage like the way that Helen's ass jiggled but definitely didn't like the smell that she was producing. \"Oh man that is gross, I better do something to stop that\" Mirage insisted as she pulled a cork out of her pocket. She walked up behind Helen squatted down and...........\"AAAAAAAAHHHHHHHH\" Helen cried out feeling the cork get shoved up her booty. \"'There, all better\" Mirage said dusting off her hands. \"Oh no\" Helen thought as she could feel the pressure in her stomach build from gas since it had nowhere to go now. The cork was firmly shoved up Helen's hindquarters and had no way of slipping out anytime soon. So gas kept building and building and building in her stomach forcing to make more room by pushing her stomach out some more. \"oooohhhhhh this hurts\" Helen groaned. Her belly grew and grew building up more pressure like a balloon filling with air, but instead of air it was her own gas. Mirage watched as Helen continued to grow right in front of her. It was getting her a bit excited by the sight of it but she needed to control herself and just watch how this situation goes for the inflated heroine. \"Mirage please you gotta pull the cork out\" Helen groaned feeling her stomach was getting tight. What does Mirage say</span></div></div>",
            "created":1509685200,
            "id":2410365,
            "title":"She just begins to fart "
        },
        "12112311111":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Continue",
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"No thanks I'd rather you not stink up the room\" Mirage giggled. Helen just groaned from the buildup of gas inside her that continued to increase. Her stomach continued to gurgle as it digested the beans and as the beans were getting digested they kept producing gas filling Helen's stomach some more. As of right now Elastigirl's stomach has now gotten up to the size of a exercise ball, not from the beans themselves but from the gas the beans were producing as well. </span></div></div>",
            "created":1510894800,
            "id":2416242,
            "title":"No thanks"
        },
        "121123111111":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Helen keeps growing",
                "Helen stops growing",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>As Helen's stomach continued to bloat up from bean gas Mirage walked around behind her and slapped her ass watching it jiggle. She then placed her hand on Helen's ass feeling it absorb as booty flesh sunk in between her fingers. Mirage bit her lower lips closed her eyes and blushed hard as she was doing this \"MMMMMMPPPPHHHHHH\" She moaned. Helen was also blushing hard from the feeling of Mirage's hand on her butt feeling it all over. It was embarrassing for her to be treated this way, but also she was kind of liking it as well. Helen couldn't think about it for long as she could feel her stomach gurgling some more having the beans inside her digest and gas out bloating out her belly even more as her stomach was now pushing her up off the ground. Her butt starting growing out as well as more butt flesh pushed out in Mirage's hand. Having the feeling of it swell in her hand was just amazing for her. Feeling the girth and tension buildup was getting better by the second. More and more gas kept building up inside Elastigirl and pressure kept increasing more and more. With no way for the gas to leave it just kept building up side her stomach causing more pain and discomfort for her. \"Ugh man how much bigger am I gonna get\" Helen grunted. \"What's the matter Elastigirl, are you not enjoying this?\" Mirage asked sarcastically. All Helen could do was grunt from the buildup of gas in her stomach. Mirage was enjoying this so much though that she just wanted to play and fondle with Helen's ass. She groped it, squeezed it, jiggled it, SMACKED it!!! \"OOF HEY\" Helen called out. All Mirage did was laugh. </span></div></div>",
            "created":1511420160,
            "id":2419082,
            "title":"Continue"
        },
        "1211231111112":{
            "author_id":"myfacewhen92",
            "author_name":"Iheartpepsi",
            "choices":[
                "Feed Helen more beans so she could get even more bloated",
                "Continue playing with her body and try putting pressure on to her body"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, the gas had been building up within Elastigirl's stomach had come to a halt. This gave Helen only some relief, though. She was still bloated and possibly would've exploded if she got any bigger. It Mirage only a few seconds to realize that Helen's body had stopped growing. <br>\r\n<br>\r\n\"Well, that's a shame,\" Mirage said while getting from her fondling butt. \"I was really having a lot of fun with that bloated ass yours, \" Mirage then stopped to think for a bit. She was thinking about what to do now with Helen's gas-filled body. Just then, Mirage thought of the idea to...</span></div></div>",
            "created":1566151380,
            "id":2704335,
            "title":"Helen stops growing"
        },
        "123":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Breast",
                "Butt",
                "both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Breast or butt</span></div></span></div>",
            "created":1485406800,
            "id":2269302,
            "title":"breast/butt inflation"
        },
        "1232":{
            "choices":[
                "Air",
                "Water",
                "Gas"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What way Elastigirl will inflate?</span></div></span></div>",
            "created":1486789200,
            "id":2276232,
            "title":"Butt"
        },
        "12321":{
            "choices":[
                "A new power she discover",
                "Someone kidnap her and expand her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What way she get a big juice bottoms.</span></div></span></div>",
            "created":1486789200,
            "id":2276234,
            "title":"Air"
        },
        "123212":{
            "choices":[
                "Syndrome or Mirage",
                "The Inflantina a new villainess who enjoy torture female heroenes though expansi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will kidnap her?</span></div></span></div>",
            "created":1486789200,
            "id":2276235,
            "title":"Someone kidnap her and expand her"
        },
        "1232121":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Syndrome",
                "Mirage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is it?</span></div></span></div>",
            "created":1496379600,
            "id":2329963,
            "title":"Syndrome or Mirage"
        },
        "12321212":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "she stop and plays with Helens ass",
                "she continues to pump her up"
            ],
            "content":"<div class=\"\"><div> <span>Helen slowly opened up her eyes trying to remember of all that happened. She looked around at her surroundings seeing that she was what seemed to be a dark small room with nothing but one light bulb hanging from a cord. \"Ah it seems that you finally have woken up\" said a woman's voice from the shadows. Helen tried to see who it was that was talking but all she could see was a dark figure slowly walking towards her. Once the figure got under the light it turned out to be.............\"Mirage?\" Helen questioned. \"Hello there helen, Ive been wanting you awake for some time now and now that you finally up I can do this\" Mirage says as she shoves a hose into Elastigirl's mouth. Helen could't do anything to remove it because her wrists and ankles were cuffed to the floor. \"I hope your ready for whats about to happen next Helen for I've been wanting to do this to you ever since I first met you\" She said as she brings out a bike pump out from the shadows and places it in front of her. Helen then spits out the hose \" Just what do you think your gonna do to me\" Helen asked. Mirage then walked back up to her and shoved the hose back into her mouth and clamping it in place somehow \"Test your elasticity of course.\" she answered. With that said mirage walked back to the bike pump and pulled the bar up \"Are you ready because I sure am\" she said as she pushed the bar down. Helen felt as air forced its way down her throat. Right when the first pump hit Mirage proceeded on to the next pump and began to count...1.....2.....3.....4.....5.....6.....7.....8.....9.....10.....11.....12.. ...13.....Helen could feel every last push of air get shoved down her throat making it feel like she was almost drinking something. But there was a problem. Helen couldn't feel her stomach tighten at all from the forcing air into her body. Then again she could feel it somewhere else. She turned her head as much as she could (considering that shes Eleastigirl that's no problem) and she noticed that all of the air was going straight to her hips. 21......22.....23.....24.....25.....26.....27 with every pump from the bike pump Helen's ass grew some. Even though it was already big to start with her booty was now getting as big as two beach balls put together. \"You know ever since I have first heard of you I have always wondered just how big you can get, what your limits are, how much can you take before you break, well today we are going to find out\" Mirage says as she keeps pumping. 37......38.......39.......40. Mirage then stopped pumping and walked over to Helen to admire her progress. What happens next?</span></div></div>",
            "created":1496898000,
            "id":2332926,
            "title":"Mirage"
        },
        "123212121":{
            "choices":[
                "In her ass (time to give Elastigirl a ghetto booty)",
                "In her nipples (give some cups in her bra)"
            ],
            "content":"<div class=\"\"><div> <span>Mirage stop a instant and with one one hand, she squeeze Elastigirl ass, making her moan and blush hard. She then lick Helen booty and put her face in the butt cheeks. <br>\r\n<br>\r\n- What a beautiful ass you have. Ah the things you can do. You are the dream inflate woman.<br>\r\n<br>\r\nThen she slapped her ass making jiggle back and forth. Mirage then have a idea. She really wants Elastigirl get REALLY bigger so she returns to the pump and ponders.<br>\r\n<br>\r\n- Now where I should put this naughty thing?</span></div></div>",
            "created":1499144400,
            "id":2347170,
            "title":"she stop and plays with Helens ass"
        },
        "1232121211":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Fondle with Helen's booty again",
                "Take a breather then continue pumping (even faster)",
                "Start pumping air somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what, I don't think you got a big enough booty yet\" Mirage noted. So she walk back over to the pump and continues to pump her up. 41.....42.......43......44.......45.....46......47 As she continues to pump Helen up, Helen herself could feel more air going into her ass getting bigger with every pump. 62.......Helen didn't know why but to her all the air pumping into her inflated ass was feeling good and she blushed a bit from it too. 69......bigger and bigger her ass grew getting up to the size of 5' beach balls. 74...... \"mmmmpppphhhhh\" Helen moaned. Her booty continued to stretch out some more giving Mirage a better view of the two giant globes of flesh behind Helen. Mirage began to blush a little bit too seeing how big that tush was. 94.....95.....96.........97...............98...............99................... .100. Mirage then stopped pumping for a minute so she could do what?</span></div></div>",
            "created":1499144400,
            "id":2347175,
            "title":"In her ass (time to give Elastigirl a ghetto bo..."
        },
        "12321212112":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "She waits it out (she can grow some more)",
                "She breaks free from the chains",
                "somet"
            ],
            "content":"<div class=\"\"><div> <span>As Mirage got to the hundredth pump she stopped to take a breather. She then looked over at Helen who was squirming about trying to get her attention. So she walks up, squats down in front of her and removes the hose out of her mouth letting Helen speak finally. \"Are you done\" she asked looking up at the white haired woman. All Mirage did was smile and giggle a bit. \"Oh trust me honey, we're just getting started\" she answered as she clamps the hose back into Helen's mouth, gets up and walks back over to the bike pump. \"Now lets start over again\" Mirage says as she pushes then handle bar down sending another gush of air into Helen's mouth. Helen's eyes widened from hearing what she just said and began to struggle again. But it was no use. She was  clamped onto the ground tightly. 3.....4......5.....6.....7.....8.....9 Mirage continued on pumping. Helen could feel more air going straight to her hips as they widened some more. 13.....14.....15.....16 Mirage kept counting as she watched Helen's ass grow. Helen didn't know what to do until Mirage stopped pumping again so she decided to just wait it out................or will she?</span></div></div>",
            "created":1499662800,
            "id":2351140,
            "title":"Take a breather then continue pumping (even fas..."
        },
        "123212121121":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "Can't still tied down real good",
                "Actually she's liking this too",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Mirage kept pumping and pumping and pumping 38....39...40....41.....42 Helen's butt was getting huge 47......48......49.....Her butt was already taking up a good quarter of the room they were in 54....with every pump 55.......Her butt filled up 56..... and Mirage 57......was getting 58.......real 59..............excited 60...........\"Huff......Huff......Huff man this pumping is....huff.... exhausting\" Mirage said as she stopped pumping for a moment to catch her breath again. Helen looked up and saw how tired mirage was. Does she make a move now?</span></div></div>",
            "created":1504587600,
            "id":2380922,
            "title":"She waits it out (she can grow some more)"
        },
        "1232121211213":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "A big air pumping machine",
                "an air tank",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Mirage did her best to keep pumping more and more air into that big butt of Helen's, but after another 57 pumps she was worn out as she collapsed to the floor panting \"huff.........huff.........huff.........huff........thats it huff........I'm done huff............onto plan B\" she mutters as she gets up and makes her way out the door. Helen just laid there all alone wondering what Mirage was up to next. She knew that she couldn't escape cause the cuffs on her would not budge. Moments later Mirage returned, but with what though?</span></div></div>",
            "created":1514678340,
            "id":2434588,
            "title":"something else"
        },
        "12321212112131":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "...............",
                "..............",
                ".............."
            ],
            "content":"<div class=\"\"><div> <span>Mirage returned as the door opened she was tugging in a big machine that was foot higher than her. Once she got the machine in place she bent over taking a breather again \"huff.......huff.........huff.........huff man this huff..........exhausting\" she says. When she got her breath back Mirage then walked over to the bike pump, disconnected the hose from it, brought the hose over to the machine and attached it. Mirage then walked over to the side of the big machine and placed her hand on a lever. She took a moment to stare elastigirl in the eye saying\"Are you ready\". Helen quickly shaking her head no hoping she would listen, but she didn't as she flipped the lever up and the machine begins to start up. This machine looked like an old device having to involve what looked like a giant piston and surprisingly she was right as the arm from the piston pushed down Helen got an abrupt gush of air forcing it;s way into her body air only this time it was 10x stronger as her butt ballooned out a good foot already. \"MMMPPPPHHHH\" Helen moaned as she felt her butt stretch more than usual. \"Are you enjoying yourself Elastigirl because this is what you'll be doing fro the rest of the day\" Mirage smirked. </span></div></div>",
            "created":1514696460,
            "id":2434660,
            "title":"A big air pumping machine"
        },
        "123212121123":{
            "author_id":"be3055",
            "author_name":"JackJack",
            "choices":[
                "..............",
                ".............",
                ".............."
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl laid there on the floor waiting for Mirage to stop pumping until......36.......37.........38...............39. Helen then looked up and noticed that Mirage was looking tired and breathing heavily. She stopped the pumping and fell to the ground exhausted landing on her butt.........what happens next?</span></div></div>",
            "created":1499662800,
            "id":2351152,
            "title":"something else...."
        },
        "124":{
            "author_id":"iheartpepsi",
            "author_name":"iheartpepsi",
            "choices":[
                "Someone makes her gassy",
                "She makes herself gassy",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does it happen?</span></div></span></div>",
            "created":1602011820,
            "id":2916194,
            "title":"gas inflation"
        },
        "13":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "Bob. Helen was at home.",
                "Syndrome. He's back.",
                "The Underminer. They're underground.",
                "Mirage. She looks angry.",
                "Edna Mode. Needs to test the suits limit."
            ],
            "content":"<div class=\"\"><div> <span>Elastagirl was on a roll today. She had stopped 8 crimes, crimes the kids off at school, and cooked dinner. All with ease. This has never happened before. Her luck suddenly spiked with great things always happening. Even a little girl offered her a cupcake which had tasted somewhat funny.<br>\r\n<br>\r\nShe didn't mind the taste till after a few minutes later Elastagirl passed out on a roof while trying to stop a robbery in progress. \"Wha-Wha- happened.\" Elastagirl moaned as the world slowly came back into view.<br>\r\n\"Finally your awake.\" said a familiar voice. The source came into view. It was....</span></div></div>",
            "created":1329627600,
            "id":1280203,
            "title":"weight gain by force feeding"
        },
        "135":{
            "author_id":"lerako",
            "author_name":"Lander",
            "choices":[
                "Elastigirl puts on the new costume"
            ],
            "content":"<div class=\"\"><div> <span>Emerging from the darkness, practically hopping on her heels was Edna Mode, costume designer extraordinary. <br>\r\n\"Eugh...\" Helen began, shaking off her daze, \"W-what happened?\" <br>\r\n\"A wardrobe malfunction dahling, nothing to worry about, we just need to take a closer look...\"<br>\r\nEdna withdrew a small remote and pressed it, causing a large circular podium to rise up from under Helen as she was hoisted a few feet into the air.<br>\r\nWithin seconds an autonomous drone had flown around Elastigirl projecting a grid from its camera onto her - it whipped around and continued to scan her, sending refracted lasers around her like a Pink Floyd light show. <br>\r\nWhen it had finished, the large screen behind her had turned on, revealing a digital Helen rotating in 360 degrees. <br>\r\nThe podium beneath Helen slowly descended as she found herself on equal footing with Edna Mode, the designer was squinting at the model, looking for something...<br>\r\n<br>\r\n\"Hmmm... Computer, dahling , zoom in on hem quadrant three dash four...\" <br>\r\nThe model stopped rotating on screen as the view focused on Helens posterior and began to zoom in. <br>\r\n\"Seam six, stitch three...\" <br>\r\nHelen watched the camera continue to zoom in as the view began super-magnified, the fabric of the costume was rendered with just a criss-crossing pattern of stitches. Suddenly, it came into view all at once; in a flawless weaving of thread, one single stitch had become frayed, loosening itself from the collective.<br>\r\n<br>\r\n\"Just as I predicted...\" Edna tutted. \"A wardrobe malfunction.\"<br>\r\n\"A wardrobe mal- but it's just one stitch, how could-\" Helen began, but was soon cut off. <br>\r\n\"Computer! Simulate stretch sequence with current suit condition.\"<br>\r\n<br>\r\nHelen turned her gaze back to the screen to watch as the limbs of her digital counterpart were stretched into opposite directions, only instead of having the fabric follow her flexibly, it became unstable and fell off her body all at once. <br>\r\n<br>\r\n\"Oh.. my...\" Helen stood aghast, watching her now naked body taking up the screen, her suit completely unraveled. <br>\r\n\"Wardrobe malfunction.\" Edna Mode stated matter-o-factly.<br>\r\nHelen turned to the designer with worry in her eyes. \"Well, can that be fixed?\" <br>\r\nEdna simply snorted, \"The composition of your suit is re-flexible and reinforced alloys - you stretch, it stretches. When you return to your normal dimensions, it does too. What we have here, dahling, is your suit is trying to return to a dimension smaller than itself.\"<br>\r\n\"Wait you mean...\"<br>\r\nEdna rolled her eyes, \"The suit is having some difficulty reforming around this...\"<br>\r\nWith one quick snap of her hand, Edna Mode had reached up and slapped Helen's rear causing her to yelp in shock. <br>\r\n\"You've put on some weight dahling, I wasn't going to say anything but now bedside manner is hardly professional.\"<br>\r\n<br>\r\nHelen withdrew with a look of guilt, biting her bottom lip as she looked back towards the screen, her butt still stinging with reminder.<br>\r\n\"Don't worry dahling, I can fix this, in fact, I have been fixing it, and now you will test the \"Helen Super Mk. II\"<br>\r\nWith another press of the remote, a small door opened on the opposite side of the room revealing a new Super Suit.<br>\r\n\"Change into it and meet me next door - I need to test the limits so we don't have a scandal on our hands...\"</span></div></div>",
            "created":1515755940,
            "id":2439778,
            "title":"Edna Mode. Needs to test the suits limit."
        },
        "1351":{
            "author_id":"lerako",
            "author_name":"Lander",
            "choices":[
                "The next day..."
            ],
            "content":"<div class=\"\"><div> <span>Inside the changing room, Helen Parr suited up accordingly - her new costume was very similar to the last one, in fact the only stand-out feature was that the collar seemed to glow a dull green. She glanced into the mirror ahead and took in a moment to take in her figure - her eyes stopped when the reached her behind. <br>\r\nSighing, she turned to get a better view - the situation had not improved. <br>\r\nIt gave her pause, reflecting on her glory days when she was the svelte Elastigirl, she still was, albeit a slightly heavier Elastiwoman in the years gone by. <br>\r\nStill, if anyone could fix a problem with her suit it was Edna Mode.<br>\r\n<br>\r\nElastigirl finished her musing and left the changing room, her footsteps echoing through the massive facility as she made her way next door. <br>\r\nEdna was already waiting for her, a clipboard in hand and the scrutinizing look that was her default gaze. <br>\r\n\"Turn.\" She said, circling her finger in the air. <br>\r\nHelen obliged, spinning slowly to show off the costume from every angle. <br>\r\n\"Good... Edna ticked off a checkbox on the clipboard. <br>\r\nWhat followed next was a series of commands that Helen followed, from touching the ceiling to using her legs to reach the corners of the room - each demonstration was rewarded with its own check from the list until at last the page was finished. <br>\r\n\"Very good dahling, the suit conforms with your present figure.\" <br>\r\nHelen let out a sigh of relief, at least now she wouldn't have to worry about her - <br>\r\n\"But!\" Edna continued, \"We need to see if it can conform to a new default dimension.\"<br>\r\n<br>\r\nWith another press of the button from her remote, a single rectangular panel in the center of the floor had slid out of the way as a table was lifted into the room to take its place. <br>\r\nOn its surface was a literal smörgåsbord of delicious dishes, desserts, main courses, hot and cold servings, all of them prepared to serve. <br>\r\nHelen was lead by the hand to the end of the table where she found a chair waiting for her, she took a seat as Edna turned the page over on her clipboard. <br>\r\n\"You can eat now dahling.\"<br>\r\n<br>\r\nHelen began reluctantly on a spare bit of ribs on her first plate, before finding some waffles and whipped cream to start on next. What began as disinterested nibbles had soon evolved to enjoying the mix of flavors available, a culinary blend that must have been the work of 10 chefs at least. <br>\r\nThe pace quickened and before long, Helen had polished off a true meal - finishing with a bit of lava cake she sat back content, breathing a sigh of relief. <br>\r\n<br>\r\n\"That was good,\" she mused, \"What now?\"<br>\r\nBut Edna was transfixed on the collar around Elastigirls neck, which was now glowing a dull red. Helen caught her gaze and examined it as well.<br>\r\n\"Your collar is fitted with its own neural network designed to detect shapes in its form.\" Edna began, \"It stay red when it is calculating its new form, and it will turn green when it has finished mapping out your new dimensions. You must continue eating until it turns green - it shouldn't be too much longer dahling...\"<br>\r\n<br>\r\n\"Oh,\" Elastigirl returned, \"Well... sure I guess I could have a bit of...\" Helen began picking at the remaining desserts around her plate, she was definitely getting full, but she still had room. Helen continued to eat until at last she breathed a heavy sigh and fell back into her chair. <br>\r\n<br>\r\n\"Oooh... I don't think I could eat another bite...\" <br>\r\n<br>\r\nEdna Mode however seemed to take no notice, and once again narrowed her eyes at the collar, which Helen realized was switching back and forth from green and red like a festive turn signal.<br>\r\n<br>\r\n\"Err... What does that mean?\"<br>\r\n\"It means that the suit is 99% complete, dahling. Just one percent left.\"<br>\r\n\"Oooh... I don't know if I can -\"<br>\r\n\"Not to worry dahling, I've prepared for this too.\"<br>\r\n<br>\r\nAnd with that, Edna Mode had withdrawn the remote once more, pressing a button that caused Helens chair to tilt upwards as a massive device from the ceiling began to lower. It scanned Helens body in similar manner to the drone and in an instant had scanned the food on the table as well, after a quick moment of calculation, a heavy whirring sound could be heard above. <br>\r\n<br>\r\n\"It's blending - all of the required nutrients have been selected as an easy-to-swallow paste.\"<br>\r\n<br>\r\nHelen looked at from the machine to Edna in confusion, and the next second she watched as a autonomous hose descended from the ceiling and plugged itself into her mouth. In one single pump, not dissimilar to a shotgun blast, a thick rich mixture had been thundered through the hose and into Helens mouth which came so quickly that she hadn't even realized she had swallowed.<br>\r\nThe pipe was immediately withdrawn and Helen was left licking her lips.<br>\r\n<br>\r\n\"I hope that wasn't too traumatic dahling...\"<br>\r\n\"Ooh... no, actually... that was *hic* really good...\"<br>\r\nWithin the mixture she could still taste every individual dish, it was a surge of flavor that was experienced in a nano-second, yet still lingered.<br>\r\n\"We are ready to test now,\" Edna remarked, acknowledging the collar, which was now glowing a steady green. <br>\r\n<br>\r\nHelen obliged and got up, one hand resting on her stomach as she thought back on the flavors that had passed her lips in an instant. <br>\r\n\"Reach up to the ceiling with both hands, then return them to your sides.\"<br>\r\nIt was finished in an instant, though when Elastigirl's limbs had returned, the collar was suddenly glowing red.<br>\r\n<br>\r\nEdna Mode tutted as she recorded the results on her clipboard. \"As expected.\" she resigned.<br>\r\n\"Err.. was it supposed to do that?\" <br>\r\n\"No dahling, but I expected that it would - further testing is needed, but not now. Go home and rest, then return tomorrow.\"<br>\r\n<br>\r\nHelen nodded and left Edna's headquarters full and content, she didn't even really mind having to test, so long as she could avoid her suit bearing all in the future...<br>\r\n</span></div></div>",
            "created":1515759600,
            "id":2439782,
            "title":"Elastigirl puts on the new costume"
        },
        "13511":{
            "author_id":"lerako",
            "author_name":"Lander",
            "choices":[
                "A Weeks worth of testing..."
            ],
            "content":"<div class=\"\"><div> <span>Helen had returned to the facility the next day to find Edna Mode waiting for her, she was lead back into the same room as she resumed her post. <br>\r\n<br>\r\n\"The Mk. II is in a constant state of reforming itself,\" Edna explained, \"Once it understands how to correctly determine your new default shape, you will have nothing to fear, dahling.\"<br>\r\n<br>\r\nHelen nodded as she began to dig in, however she noticed that she didn't achieve nearly the same sense of pleasure that she had gotten from the machine at the end of yesterdays session - perhaps it was the immediate release of a mixture of flavors all at the same time...<br>\r\n<br>\r\n\"Something the matter?\" questioned Edna, taking in the look of deep thought that had taken over Elastigirl. <br>\r\n\"Oh, umm...\" Helen began, swallowing the latest bite, \"I was just wondering about the machine.\"<br>\r\n\"Yes?\"<br>\r\n\"Can we, I mean isn't it quicker to...\"<br>\r\nEdna squinted as she tried to read Helen with a bit of skepticism.<br>\r\n\"Your suit is designed to calculate tiny changes over the course of time and adjust itself accordingly.\"<br>\r\n\"Oh.\" Helen couldn't help but sound a little disappointed, which Edna caught immediately with interest.<br>\r\n\"Hold on, dahling, we could override the network to detect immediate changes instead...\"<br>\r\nEdna reflected on her notes as Helen looked up towards the machine, lying in wait.<br>\r\n\"This would mean further testing however,\" Edna posed, \"All innovation does...\"<br>\r\nHelen thought back to the thick mixture she had received yesterday, now craving it. <br>\r\nShe looked hungrily towards Edna, \"I'll do it.\" <br>\r\n\"Very good dahling.\"<br>\r\nPressing the remote button, the machine whirred to life and the hose began to descend towards Helen, she found herself leaning forward to meet it, prepared for its payload. <br>\r\nAfter the mixing had finished, three distinct throbs had echoed through the hose, arriving at Helens mouth which was filled with the thick mixture - she had already swallowed all three before she even realized. <br>\r\nHelen was lost in flavor heaven, desperately tonging around her mouth for a hint of what had just passed by seconds before, ignoring the stuffed sensation that told her that she was painfully full. In response the collar had turned green, but then blinked back into red. Helen hadn't even noticed, but Edna had. <br>\r\n<br>\r\n\"It has skipped over the calibration stage entirely.\" Edna quipped referring to her notes, \"We will need further testing, at least a weeks worth...\"<br>\r\n\"A week?...\" Helen snapped back from the sensation of flavor. <br>\r\n\"Seven days dahling, necessary for a calibration process.\"<br>\r\nHelen scribbled something new in the margin of her notes, then directed her attention back to the collar, still a steady red. <br>\r\n\"We will fix this by then, and I will see you tomorrow...\"<br>\r\n</span></div></div>",
            "created":1515761340,
            "id":2439786,
            "title":"The next day..."
        },
        "135111":{
            "author_id":"lerako",
            "author_name":"Lander",
            "choices":[
                "Mr. Incredible grows concerned for Elastigirl."
            ],
            "content":"<div class=\"\"><div> <span>And so it went. <br>\r\n<br>\r\nEvery morning Helen Parr would wake up, have breakfast, send Dash and Violet to school, eat lunch and take care of Jack-Jack until she left for her appointment with Edna, and then return home, skip dinner and go to bed with Bob.<br>\r\nAt first, the details were only so that a keen fashion eye like Edna's could realize it, but it had started to become obvious; the effects of the machine were starting to have a permanent effect on Helens figure and it had become obvious that Helen was starting to put on quite a bit of weight from the feeding machine.<br>\r\nOn the fifth day, Helen had gone through her routine, returning home for bed when she woke up the next day and everything had changed...<br>\r\n<br>\r\n***<br>\r\n<br>\r\nElastigirl woke on the sixth day of testing in her bedroom, she licked her lips fondly and thought back to the previous session with Edna. She could tell her appetite was improving, it now took her longer to reach the point where she was completely stuffed, too full to eat dinner when she came home even. <br>\r\nIt was all approved by Edna Mode of course, who took to manually recalibrating the suit and provided Helen with words of encouragement through it all. <br>\r\nThe bed audibly creaked and groaned as Helen rose from it, standing at full height she found herself reflected in the mirror across the room - it was a stark contrast to say the least...<br>\r\n<br>\r\nIn the time since testing began Helen had put on close to 40 pounds and it was obvious everywhere you looked - her thighs and hips had both grown wide from her near-constant feeding, her stomach had became rounded in a paunch, and her arms had gotten softer in the interim as well. Her chubby cheeks and chin were also showing her weight gain, with a double chin forming and two dimples revealed when she smiled. <br>\r\n<br>\r\nNone of her developments could hold a candle to Mrs. Parrs \"Incredible\" Ass however. Already big to begin with, it was getting bigger every day, its rounded contour could be easily seen at any angle. <br>\r\n<br>\r\nNormally this sight might shock Helen, but honestly at this point she was too far deep into her routine that it didn't bother her - what mattered was getting everything done around the house so she could re-calibrate her suit, and of course, drink up the thick mixture provided by the machine...<br>\r\n<br>\r\nHelen carried these thoughts with her as she descended to the main floor, and prepared a breakfast for Dash and Violet. <br>\r\nFluffy pancakes drizzled with maple syrup and coated with whipped cream, though they were more for herself than anyone else.<br>\r\nDash only managed to speed eat through two pancakes before he was racing off through the door.<br>\r\nViolet had already eaten a bowl of cereal earlier, her daughters invisible antics had gone on undetected.<br>\r\nHelen was left to finish off the batch herself alone, her stomach nearly filled before she even started the day. <br>\r\nAfter taking the kids to school, Elastigirl returned home to Jack-Jack, taking care of him and waiting until she could sit down to a proper lunch of leftover lasagna dinner. As she chewed her way through the meal, her thoughts again returned to the feeding machine and it's medley of flavors delivered instantly - she ate the rest of her meal longing for something more filling, more substantial. She wanted to be stuffed. <br>\r\nCasting her bowl aside, Helen brought the tray of lasagna towards her, plunging her fork into the dish and eating with gusto. <br>\r\nShe tried her best to fill her cheeks and swallow quickly, just hoping to recreate the sensation from the machine, but it was never close enough. <br>\r\nWith the entire tray polished off, Helen laid back in her chair, taking shallow breaths as she attempted to quell her stomach. <br>\r\n<br>\r\nAfter she picked up the kids from school she continued biding her time, just waiting for the best part of her day. When it finally arrived, Helen got into her car and drove off towards Edna Mode's facility, her stomach growling the entire time. <br>\r\n<br>\r\nIn a matter of minutes, Helen was already hooked up to the machine, fervently gulping down the mixture as Edna reflected on her notes. <br>\r\n\"Your suit should be fully calibrated tomorrow dahling, it should be familiar enough with your form...\"<br>\r\nBut Helen wasn't even listening, she was too focused on the steady mixture of flavors being delivered from the hose, eagerly tonging the mix as it passed down her throat. With a click of the remote the machine was turned off as it ascended back into the ceiling, Helen was left licking her lips and groaning, almost too full to move, but somehow she managed. <br>\r\n<br>\r\nThe drive back home was uneventful, she pulled into the driveway and turned off the engine as she prepared to enter the house...<br>\r\n</span></div></div>",
            "created":1515766740,
            "id":2439799,
            "title":"A Weeks worth of testing..."
        },
        "1351111":{
            "author_id":"lerako",
            "author_name":"Lander",
            "choices":[
                "Bob decides that he has to say something about Helen's weight",
                "Bob decides to save his rant for another night..."
            ],
            "content":"<div class=\"\"><div> <span>The transformation hadn't been lost on the rest of the Incredible family, especially for Bob Parr who had been observing Helen's changes with growing concern.<br>\r\nAt first it was the nightly disappearances that planted the seed of worry, though he knew to keep his distance as he had run a similar gamut himself a few years prior - Bob knew that it would be too forward, and hypocritical, to mention it.<br>\r\nNext was Helen's change in demeanor; it was if her thoughts were clearly elsewhere (perhaps on someone else) but again Bob didn't want to press in part because he didn't want to make his fears a reality - any whisper of an affair had been pushed into the back of his mind - the seeds of doubt had been planted, and the last few weeks had seen them blooming alongside Helen.<br>\r\n<br>\r\nAs the sound of the idling engine gave way to the chirping of crickets, Bob prepared himself for the confrontation that he had played out in his mind for the past several hours. <br>\r\n<br>\r\nThe door swung open with fanfare as Helen Parr carried in a pair of large brown grocery bags that obscured her face, she very nearly teetered off-balance as she stretched out a leg behind to close it behind her,but managed to regain her composure.  <br>\r\nCompletely unaware that Bob was standing by, Helen carried on into the kitchen as she began to stock the refrigerator, stretching her limbs to accommodate the refilling mission as he awkwardly trailed after her.<br>\r\n<br>\r\nMister Incredible had managed to round the corner just as she was bending over to place a large chocolate cake on the bottom shelf, her ample rear end perking up as she looked for more space inside. He could do little more than stare as he took in the sight; her oversized posterior nearly taking up the width of the fridge itself as she shifted ingredients about, balancing its weight between her two thick thighs and grunting as she struggled to fit the similarly-oversized pastry box just above the crisper. <br>\r\n<br>\r\nTrying his best to make his presence known without catching Helen off guard, Bob cleared his throat,<br>\r\n<i> \"Erm... Honey?\"</i><br>\r\nElastigirl could only spin about on the spot and catch his eye, backing out from the refrigerator as a bit of chocolate sponge dotted her lips.<br>\r\n<i> \"Mmm! Bob! I didn't... *chew* know you were still... *chew* up\"</i><br>\r\n<i>\"I uh... couldn't sleep\"</i>, Mister Incredible shrugged as he tried to save face - it was partially true after all.<br>\r\n<i>\"Well...\" </i>began Elastigirl, chewing the last bit of chocolate cake, <i>\"When I can't sleep, I usually get a glass of warm milk. Here.\"</i><br>\r\nHelen reached into the fridge, pulling out a carton from the back before pouring it into a glass a few yards away. In one smooth motion, she managed to lift the drink into the microwave, shut the door and set it on an automatic warming cycle before returning to her own side with the carton in hand. <br>\r\n<i>\"Right. Thanks.\"</i> was all Mister Incredible could muster before a shrill beep sounded behind him. Reaching into the microwave, Bob retrieved the warm milk and noticed its consistency was much too thick to be anything but...<br>\r\n<br>\r\nIt was when Bob spun around that he saw the label in Helens hands - <i>Heavy Whipping Cream</i> - she had already tipped up the carton to her lips and had begun drinking the concentrated mix down. With each gulp, she fell deeper into the familiar feeling that she came to know from Edna Mode's sessions, just pushing herself a little more, a little further...<br>\r\n<br>\r\nBob could only look on conflicted - Helen was his wife, the vows he made to her on their wedding day felt synonymous with any criminal credo he sought to defend, and he would through sickness and in health, for better for worse...<br>\r\nBut...<br>\r\nThis was not the Helen Parr he married - the svelte and pliable Helen whom had only just existed the week prior had been superseded by a much heavier Helen. <br>\r\nA heavier Helen who stood before him now, standing in the glow of the refrigerator as she tiled the nearly empty carton of heavy cream up to keep the steady stream of calories flowing past her lips...<br>\r\nDrops of cream that had missed their mark now traced the contours of her jawline, outlining a very visible double chin. <br>\r\nWhile Helen had grown, her clothes had not, and the brunette's jeans were getting incredibly snug with her new ample assets - faring worse was her shirt, which was forced to stretch nearly as much as Elastigirl herself to remain buttoned up. Its limits were being test however, as it failed to cover at least an inch of exposed flesh just above the belt line.<br>\r\nWith a final swallow, Helen finished with the carton and stretched an arm across the kitchen as she carried it over to the trash. <br>\r\n<i><br>\r\n\"Whew... I need to... *erp* pick up some more...\"</i><br>\r\n<br>\r\nBob watched as Helen turned to leave, her plump rear bobbing and swaying with every step.<br>\r\n</span></div></div>",
            "created":1521832380,
            "id":2468421,
            "title":"Mr. Incredible grows concerned for Elastigirl."
        },
        "14":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "Water inflation",
                "Air inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok here are some more<br>\r\n</span></div></span></div>",
            "created":1321419600,
            "id":1224184,
            "title":"other choices"
        },
        "141":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "syndrome with a water hose",
                "syndrome with a water pump"
            ],
            "content":"<div class=\"\"><div> <span>It had been an hour and elastigirl hadnt been able to penetrate syndromes stronghold and she was almost ready to give up when she noticed a guard that had wondered off of the path away from the other guards \"hmph must be a new guy\" she whispered as she snuck up behind him and swiftly knocking him out he flopped down to the ground out cold she dragging him into a bush and she had an idea the sprung into action putting the guards clothes over hers and slipping into the ranks of the other guards without being noticed and they went into his stronghold when the guards split up into pairs she went with another guard down the hallway they both remained silent and they walked when sydromes voice came on over the megephone \"attention guards we have an intruder in disguise be on the look out for elastigirl in one our your uniforms and please report to me if you find her or have any information that could help thank you\" he stopped elastigirl and guard bothed look at each other and she kicked him in the face and ran off the whole base was in a state of distress guards running around looking for her she was about to make a run for it when someone snuck up behind her and hit her over the head with a pipe she was knocked out quickly and awoke to what</span></div></div>",
            "created":1321419600,
            "id":1224190,
            "title":"sneaking around"
        },
        "1411":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "her butt",
                "both her butt and belly",
                "her belly"
            ],
            "content":"<div class=\"\"><div> <span>she woke up to the sight to syndrome standing their with a smile across his face \"wake up sleepyhead its time to make you a water balloon\" he said as he laughed loudly \"what do you mean a glass of water\" elastigirl replied back puzzled\" \"oh you will see my dear girl\" he said back as he stuck the water hose down her throat and turned it on elastigirl soon felt the cold gush of water swim down her throat she couldnt help but swallow it down and get ready for another gulp she tried to struggle but to no avail she was locked in place by and electical barrier and couldnt move and she couldnt spit out the hose because to mechanical arms were holding the hose in place \"hah at last my plan will unfold i will make you the biggest super hero the world has ever known lets hope you live up too your name because i dont want you to pop my dear\" he said as he circled around her body \"what does he mean the biggest super hero and he doesnt want me to pop\" she thought to herself not noticing that her body was filling up with water where does it fill her up at</span></div></div>",
            "created":1321419600,
            "id":1224193,
            "title":"syndrome with a water hose"
        },
        "14111":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "it grows even larger",
                "she breaks out and runs off"
            ],
            "content":"<div class=\"\"><div> <span>yes what elastigirl didnt notice was that her butt was inflating to the size of a basketballs but elastigirl soon found out what syndrome meant by water balloon as she realized that her butt was getting bigger by the second because of the water her butt had now increased to the size of watermelons and they were sloshing around as she struggled to get the hose out of her mouth only making her butt jiggle like jello she could feel the water in her butt and she could also feel her butt growing larger and larger \"mppphhhmpff\" she tried to scream but it was muzzled by the hose \"what does elastigirl not like have a big bubble butt well to bad in fact i think it is and improvement i mean your butt was already big a little more size wont hurt\" him talking about her butt was making her blush because she had known that she had a big butt before this but what she didint know was that her husband actually liked her butt and did wish it was bigger sometimes what happens next</span></div></div>",
            "created":1321419600,
            "id":1224206,
            "title":"her butt"
        },
        "141111":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she turns up the water pressure to make her inflate faster",
                "she sets elastigirl free"
            ],
            "content":"<div class=\"\"><div> <span>Still struggling to get out of syndromes hands elastigirl was still watching her butt fill up with water they were now the size of couch pillows and just as soft \"well my plan is turning out better than i expected\" syndrome said with a laugh as he felt elastigirls butt \"oohhh that feels just like the waterballoons i used to play with as a kid actually no they feel better than that\" he said as he slapped her butt making it jiggle back and forth elastigirl blushed as she watched it jiggle she couldnt believe she had fallen into his trap and now was his own personal water balloon and all she could do was sit back and watch her butt inflate bigger and bigger what happens next \"well then i better be leaving have to get on with my master plan\" syndrome said as he walked out of the room and mirage was following close behind but she paused and turned toward the hose controls looking at the pressure gauge what happens next</span></div></div>",
            "created":1325134800,
            "id":1248800,
            "title":"it grows even larger"
        },
        "1411111":{
            "author_id":"shaky",
            "author_name":"Cato",
            "choices":[
                "Her bindings break! She's free!",
                "The water starts flowing into a different part..."
            ],
            "content":"<div class=\"\"><div> <span>Mirage let out a small smirk as she turned up the water pressure. \"Bet you like that, don't you, Elastigirl?\" she says smugly, then follows Syndrome out.<br>\r\n<br>\r\nElastigirl went limp as gallons and gallons of water rished straight into her ass, which grew bigger and jigglier by the second. When her ass cheeks were approaching the size of beach balls, suddenly...</span></div></div>",
            "created":1339650000,
            "id":1359801,
            "title":"she turns up the water pressure to make her inf..."
        },
        "14111112":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she keeps growing larger and larger",
                "she starts to like bieng fillled with water"
            ],
            "content":"<div class=\"\"><div> <span>elastigirl was still trying to break free whe she noticed the the water was not going all straight to her butt which was now the size of a counch counting both cheeks and was softer and more jigglier than ever she noticed her chest starting to get bigger she could feel her bra starting to strain at the seems it was going to break soon she was lucky the suit that edna designed could stretch as far a she could but how long would it last everything had its limit her bra broke making her boobs sag and jiggle filling with water what happens next</span></div></div>",
            "created":1341550800,
            "id":1372989,
            "title":"The water starts flowing into a different part..."
        },
        "141111121":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she starts to like getting bigger",
                "she grows larger and larger"
            ],
            "content":"<div class=\"\"><div> <span>elastigirl was still trying to figure out a way to get out of the mess she was in her butt kept growing and her boobs started to catch up to her butt and they were both jiggling like jello then sydrome walked back in \"hello miss water balloon how is the inflation coming oh look at that a pair of big boobs to go along with your giant butt\" he said slapping elastigirls butt making it slosh back and forth she blushed lightly trying not to enjoy the pleasure that she got from that slap on her butt she still didnt like getting bigger but the jiggling started to feel good the way her butt sloshed back and forth what happens next</span></div></div>",
            "created":1343019600,
            "id":1386414,
            "title":"she keeps growing larger and larger"
        },
        "1411111212":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "her suit reaches it limit",
                "her suit hangs in their"
            ],
            "content":"<div class=\"\"><div> <span>elastigirls butt had reached the size of a couch both cheeks were the size of a couch and growing larger and larger by the second but her suit still hung in there showing no sign of straining or tearing but they did hide the fact at how big she was getting her breast had just reached the size of beach balls but a lot more softer and really jiggly as they filled with water trying to catch up to her butt mirage came back in to see sydrome slapping elastigirls butt making it jiggle and making her blush more and she quickly joined in as she went over to elastigirls swelling chest and tried to rip her suit off of her but it was skin tight and she couldnt get a grip on it it just made her jiggle even more so she started squezing both of them together making the slosh back and forth with water it made elastigirl blush even more as they fondeled her body parts making her jiggle and slosh back and forth as she expanded bigger and bigger thats \"oh elastigirl i hope you keep this wonderful hourglass figure you could become the curviest person alive wouldnt that be great\" sydrome said admiring her figure as it grew bigger and bigger her breast now were the size of a couch and her butt and grown the size of two couches each cheek was the size of two couches what happens next</span></div></div>",
            "created":1343365200,
            "id":1390351,
            "title":"she grows larger and larger"
        },
        "14111112122":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "it quickly goes away",
                "she inflates more"
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl hadn't figured out a way to get out of the danger she was in trouble soon she knew that she could stretch more but even she had her limit and when her suit ripped it would just be embarrassing for her she tried to thing hard while she was still being fondeled by syndrome and mirage making her blush with pleasure her butt had grown even wider with each gulp of water she drank it had reached the size of two couches and her breasts weren't far behind but they were both equally jiggly and they didn't show any sign of stopping at all then she noticed a small rip in her suit and she started to panic because she knew her suit wouldn't last much longer and neither would she if she kept growing like this but for now her suit still hung in their but her body did start to creak and moan what happens next?</span></div></div>",
            "created":1370149200,
            "id":1601850,
            "title":"her suit hangs in their"
        },
        "141111121221":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "she breaks free",
                "her husband comes"
            ],
            "content":"<div class=\"\"><div> <span>It quickly goes away and she started to calm down just a little bit but that didn't mean she wasn't growing anymore actually she was growing faster and faster most of the water was going straight into her giant jiggling butt which sloshed back and forth do to sydromes constant groping she was still blushing they were giving her pleasure and she hated it but they finally stopped and left the room that's when she started to think of a way to escape from this inflating prison before she got to big to move what happens next</span></div></div>",
            "created":1373605200,
            "id":1626788,
            "title":"it quickly goes away"
        },
        "1411111212211":{
            "author_id":"outlawz170",
            "author_name":"outlawz17",
            "choices":[
                "drink! girl! drink!",
                "she tries to find another way"
            ],
            "content":"<div class=\"\"><div> <span>No matter how long she thought about it she couldn't find a way out of the situation she was in she was giving up hope fast, almost as fast as she was growing her butt had grown bigger then syndrome himself who was still hugging and squishing her jiggly butt and her boobs had fallen a little behind but not much they were still huge almost human size and as jiggly as her butt she closed her eyes in defeat thinking this was gonna be it for her when she suddenly her a creaking sound, she quickly got nervous because she though it was coming from her but she looked up and saw that the restraints that were holding her captive were starting to crack under her newfound weight she quickly though about what she could do to make them break faster the only thing that she could think of was that she would have to drink more water to break these cuffs what happens next</span></div></div>",
            "created":1386392400,
            "id":1704353,
            "title":"she breaks free"
        },
        "14111112122111":{
            "choices":[
                "Stay to see Mirage inflate?",
                "She run away?"
            ],
            "content":"<div class=\"\"><div> <span>Looking no other choice Elastigirl drink more more water but this time more vigorously. Her ass grew to the size of two huge yoga balls and her breasts to G-cup. Syndrome still behind there squeezing her butt and Mirage playing with Elastigirl breasts. When Elastigirl break the chains she sit her humongous booty in syndrome and hug Mirage Mirage until both was without air.<br>\r\n<br>\r\nShe could feel Syndrome get out but soon stop. Finally free she spit the hose and take a good view of her body, squeezing her butt cheeks and her breasts. She gave a good spank in her left cheek and see the butt wave and jiggle sending waves of pleasure in her spine. Then she see Mirage and take a idea. She flip Mirage skirt and insert the hose in her butt<br>\r\n<br>\r\n- Let's see how much you like it!<br>\r\n<br>\r\nShe...</span></div></div>",
            "created":1499230800,
            "id":2347596,
            "title":"drink! girl! drink!"
        },
        "141111121221111":{
            "author_id":"fiercetooth",
            "author_name":"Fiercetooth",
            "choices":[
                "Mirage's Butt",
                "Mirage's Belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Elastigirl shoved the hose up mirages butt and turned the machine to full blast. Elastigirl knew she needed to escape but she knew it would take some time before the guards noticed what was going on. Suddenly the water started to inflate...</span></div></span></div>",
            "created":1521157320,
            "id":2465026,
            "title":"Stay to see Mirage inflate?"
        },
        "14111112122112":{
            "author_id":"avenunderscore",
            "author_name":"Aven_",
            "choices":[
                "Mirage uses her hands to rip a bigger hole, showing her tight panties",
                "Mirage changes the path of the water to her belly "
            ],
            "content":"<div class=\"\"><div> <span>She struggles with the restraints, the door opens once more, Mirage walks in. \"I see you were trying to escape, oh we won't be letting your voluptuous body out soon\" she said while grinning. She sticks the hose back into her mouth, which she spit out earlier.  Her butt begins to expand again, as do her breasts which are beginning to fill the space in the small box shaped room. Mirage walks being Elastigirl and gropes her couch sized butt cheeks. Mirage let's out a large sigh and lounges on Elastigirls gigantic, and soft rump. She is immediately swallowed by the skin that somewhat folds over her body, like a beanbag chair. Elastigirl moans but her voice is swallowed down with the water that continues to expand her body. Mirage:\" I wish I had a body, or maybe just a Butt like yours~ Your going to thank us later.\" She struggles to get upright on her heels, eventually does but mistakenly rips a hole in Elastigirls suit. \"Oops~\" Elastigirl knows that happened and moans so load that Mirage actually heard her. </span></div></div>",
            "created":1420520400,
            "id":1913932,
            "title":"she tries to find another way"
        },
        "141111121221121":{
            "author_id":"avenunderscore",
            "author_name":"Aven_",
            "choices":[
                "Mirage leaves",
                "Elastigirls nipples expand out more, mirage has a plan"
            ],
            "content":"<div class=\"\"><div> <span>Mirage slowly cut away at the strained elastic while Elastigirl pleaded otherwise. Slowly Elastigirls inflated skin seeped through the holes, exposing her skin tight latex panties. Mirage laughed joyfully and cut away the rest of the folding skintight suit until there was nothing left but skin and latex. Mirage then walked over to a control panel, clicked a few buttons and then walked back. The restraints on Elastigirls legs moved, spreading them apart until she was basically doing the splits, moaning in the process. Mirage then upped the water pressure in the hose, but instead of Elastigirls but expanding more, her thighs inflated out to match the size of her massive rump. But this was not fat, the thighs didn't fold over each other but expanded outward, letting the remaining skintight clothes to hold back the growing skin. Elastigirl moaned while mirage watched, but secretly Elastigirl liked it. Mirage took this further, and moved the pressure again to somewhere else, Elastigirls nipples. By this time, Elastigirls butt has leaked out of the suit, only covered in skin tight panties, her beasts about to explode out of the suit in the front, with large nipples trying to free themselves from the pressure of the suit</span></div></div>",
            "created":1429074000,
            "id":1964943,
            "title":"Mirage uses her hands to rip a bigger hole, sho..."
        },
        "1411111212211211":{
            "author_id":"avenunderscore",
            "author_name":"Aven_",
            "choices":[
                "she escapes",
                "it stops"
            ],
            "content":"<div class=\"\"><div> <span>Elastogirls nipple stopped twitching and expanding.... for now. She needed to find out how to escape while Mirage was gone. She struggled with the restraints but as time passed, there was no budge. Some machine sounds could be heard behind Elastigirl, when suddenly she felt a cold, hose like structure pierce her skin tight panties, which were so stretched they were a thong by now. The hose entered her butt and began pumping gallons of water into her stomach. Elastigirl moaned but that would be nothing to stop the expansion of her belly. Every second, her belly extruded outward, straining the fabric that she wore. She now looked like she was pregnant with twins, but instead of children she bore gallons and gallons of water, sloshing in her belly. Her belly reached the floor by now, a perfect semi circle instead of the skin folding over. She moaned more, and then the hose in her mouth started again. Both hoses were sending fluid into her belly.  She looked like a balloon.</span></div></div>",
            "created":1429160400,
            "id":1965260,
            "title":"Mirage leaves"
        },
        "141111122":{
            "choices":[
                "Put the hose in the butt and grow bigger",
                "Wait Syndrome and Miragem "
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl begin to feel good. The mind control drugs in the water begin to take effect. He jiggle his voleyball breasts with his chain hands and squish then together, feeling the water inside. <br>\r\n<br>\r\n\"Mmm, I feel wonderful. This os not bad at all. Make me bigger, bigger, BIGGER!\"<br>\r\n<br>\r\nWhen she was think this things she look to her huge growing botoms. Its in the size of a water and was growing even more, strenching her uniform to the limit. Elastigirl then was hypnotized to her butt, and hearts apear in her puppils. She put her hands in her booty feeling the water jiggling inside and shout a loud moan about how much sensitive its becomes.<br>\r\n<br>\r\n\"M-my booty is sooo big. I love It. I love you my ever growing booty.\"<br>\r\n<br>\r\nThen she begin to twerk like crazy, his butt jiggle like two pillows with jello inside. What she dont knows its the support who chain her its breaking and she knows, the chain break and shes Free. When hit the ground his body its all jiggle, her breasts and butt to huge to move. Stand up, she begin to play with her curves, to squish and feel her soft meat, and spank herself to the jiggle factor. Then she see another hose in the tank of water.<br>\r\n<br>\r\nWhat she do?</span></div></div>",
            "created":1485752400,
            "id":2271125,
            "title":"she starts to like being fillled with water"
        },
        "1411111221":{
            "author_id":"fiercetooth",
            "author_name":"Fiercetooth",
            "choices":[
                "That there was another tank",
                "That syndrome and mirage had walked back in"
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl crawled over to the hose and grabbed it. She stretched her arm over and grabbed the hose. She shoved the hose as far as it could go. The stretched her arm once again and turned on the other tank and put it on full blast. The rest was erotic. All the water rushing into elastigirl as made her moan and the water tickling her throat and anus felt AMAZING. she was rubbing her and belly and boobs and stomach and everything! It felt great in her ass the water flowing in tickling the insides of her ass and cooling it. Then going into he ass and making it bigger. Her ass grew even larger in size and her stomach was now just a overinflated mega beachballs. Her boobs were the same size as her stomach. The hose was pushing itself out of her ass so she reached over and shoved it in deeper. The water going in both her throat and ass felt great. Then, another hose launched out of nowhere and inserted itself into elastigirl vagina. She never felt so much pleasure! The water rushing in all sides. Elastigirl threw back her head and moaned. She shoved the hose deeper into her clit as her ass stomach and boobs grew larger. She was moaning so loud that she didn't notice...</span></div></div>",
            "created":1518670620,
            "id":2452949,
            "title":"Put the hose in the butt and grow bigger"
        },
        "1411111222":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Elastigirl inflates Mirage",
                "Elsstigirl leaves Mirage alone, abd goes hone to ibflate herself more"
            ],
            "content":"<div class=\"\"><div> <span>Seeing the other tank of water, she snapped to her senses. She needed to work on escaping. But then, she heard footsteps in the hallway outside. Thinking fast, she grabbed tge water tank and, with a huge amount of effort, brought it up with her to the ceiling sbove the door. Just as she cleared the field of view from the door, she heard it click open.<br>\r\n<br>\r\nSyndrome: \"Hello, waterballo- Wait, what?!\"<br>\r\n<br>\r\nElastigirl saw Syndrome and Mirage step into the room, directly underneath her. Sge let go of tge cieling. Syndrome must've heard some small noise, because he turbed, and reacted with zero point energy. Elastigirl felt the blue energy flow over her. but then, it stopped. The shell that had been forming over her cracked, as she landed directly on top of Syndrome. Her huge butt also managed to smack Mirage to the side, away from the door. Mrs. Incredible stood up. Syndrome had been knocked out on impact. She heard a small wimper from the corner of the room. It was Mirage. She seemed terrified.</span></div></div>",
            "created":1573397220,
            "id":2744767,
            "title":"Wait Syndrome and Miragem "
        },
        "14111112221":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Up Mirage's butt (Belly expansion)",
                "In Mirage's mouth (Breast expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Elastigirl stepped forward, off of Syndrome. Mirage kept scooting backwards. Scared for her life. Elastigirl lunged forward and shoved the hose...</span></div></span></div>",
            "created":1573397460,
            "id":2744768,
            "title":"Oasis"
        },
        "141111122211":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Stop inflating her",
                "Keep inflating her much bigger"
            ],
            "content":"<div class=\"\"><div> <span>Mirage frantically stood and and ran away, somehow hoping to escape Mrs Incredible's revenge. However, Mrs. Incredible was fast. She reached forward, and grabbed one of Mirage's legs. This caused her to fall face first into the ground. Her momentum caused her to slide a bit, and left her in quite the compromising position, with her butt raised up into the air. Mrs Incredible struck here. Before Mirage could react, she shoved the tube up Mirage's rear and turned the hose on. Water flowed down, and into Mirage. Mirage felt her belly begin to grow, and freaked out. She began panicing as she sat back on the floor, her legs spread in front of her. Her belly gradually grew. She put both hands on her belly, and felt get pushed away from her, slowly but surely. She looked like she had just indulged on thanksgiving dinner. The button on her suit popped off as her belly surged bigger. Her belly sloshed as it was pumped bigger and bigger.</span></div></div>",
            "created":1573398180,
            "id":2744771,
            "title":"Mirage's belly"
        },
        "1412":{
            "choices":[
                "Mought",
                "Booty",
                "In each niple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Syndrome enter the room with a water pump. He smirk then say \"My my, arent you a naught one?\" He then put one hose in Elastigirl...</span></div></span></div>",
            "created":1480136400,
            "id":2242015,
            "title":"syndrome with a water pump"
        },
        "142":{
            "author_id":"avenunderscore",
            "author_name":"Aven_",
            "choices":[
                "she wakes up",
                "she remains asleep"
            ],
            "content":"<div class=\"\"><div> <span>Elastigirl was finally at the pool. Dressed in a 2 part bikini, she jumped in to the water, she had the entire room to herself. After a hour or so of swimming, she decided it was time to dry off, using the heat coming from the lights. As she rested a unknown figure chained her to a pool float, and then quietly moved her into the water. As she slept the figure moved away her bikini and inserted a small, rivided rube into her womb. Using a air pump her belly slowly inflated out, in a minute she looked to be pregnant. She still remained asleep, even though her womb had been inflated. The bikini stretched out to make room for her giant belly, even moving her breasts out to the sides. With a \"click\" from the pump her butt ballooned out, getting as big as beach balls....</span></div></div>",
            "created":1432530000,
            "id":1982781,
            "title":"Air inflation"
        },
        "1422":{
            "author_id":"avenunderscore",
            "author_name":"Aven_",
            "choices":[
                "She,wakes up",
                "she gets fucked"
            ],
            "content":"<div class=\"\"><div> <span>Her belly had enough air to keep her afloat, with the air in her butt keeping her from going under. Her butt continued to grow while her bikini bottom became a tight thong. Slowly the inflation stopped. The figure hopped onto her belly and started grinding the swollen skin. Back and forth, back and forth. The figure undid her bikini top and inserted a wide object into her nipple, expanding it greatly. Then the figure inserted a flesh rod into her nipple and began fucking it. Her breastfeeding swelled as cum was pumped into it, gallons and gallons of cum expanded her breast in all directions yet she still slept, her breasts were leaking cum, the figure removed the fleshy rod out of her nipple and sealed it shut with suction. The figure then did the same to the other breast...</span></div></div>",
            "created":1436590800,
            "id":2006851,
            "title":"she remains asleep"
        }
    },
    "info":{
        "author_id":"outlawz170",
        "author_name":"outlawz17",
        "brief_description":"elastigirl gets big and can inflate to",
        "created":1321495020,
        "description":"<td align=\"left\" class=\"norm\">elastigirl gets big in this story and can inflate to<br>\r\n<br>\r\nI will not allow<br>\r\ngay <br>\r\nvore<br>\r\nmale weight gain<br>\r\npopping<br>\r\nmale inflation<br>\r\n<br>\r\nthx please add and have fun<br>\r\n<br>\r\nall characters portrayed in this story are not mine and belong to their respected owners</td>",
        "id":1826506,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602011820,
        "modified":1602011820,
        "pretty_title":"Elastigirl Inflation/weight gain"
    }
}