{
    "chapters":{
        "1":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Or so he thought"
            ],
            "content":"<div class=\"\"><div> <span>Tom was not a great student. Which wasn't to say he was stupid, but rather just did not pay attention very often in his classes, and when he did he would often just disrupt the lecture. When Tom went to his classes today, he expected nothing to be different. Tom wasn't a bad looking guy, he was 6'4\", in relatively decent shape, had messy looking brown hair and an above average face, but his lack of seriousness was a huge turn off to most girls. Tom walked into his 9 am lecture, sat in the very back of the large hall, and expected to joke around and cause some problems for his professor. Just another day. Or so he thought.</span></div></div>",
            "created":1413349200,
            "id":1871860,
            "title":"And so it begins...."
        },
        "11":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "You see me walk in"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"chotpink\"></span> I walk in confidently, more sauntering, really.  It was my first day teaching at a university and I know my students will benefit from my \"special\" techniques.  I'm six foot, barefoot, but I wear thigh high boots, with 3 inch heels so I'm typically 6' 3\".  As for today, my outfit is black thigh high boots, of course, patent leather, stiletto heeled, a mauve mini skirt that barely covered my rather massive booty.  As for my top, a taught v neck sweater that reveals my impressive chest.  My hands are covered in mauve silk opera gloves.  And Gucci sun glasses keep my penetrating green eyes from burning into the souls of my students.<br>\r\n<br>\r\nOf course, none of them would know the horrors that awaited them.  My booty needed to unload after all... </span></div></div>",
            "created":1413349200,
            "id":1871865,
            "title":"Or so he thought"
        },
        "111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Time for a lesson?"
            ],
            "content":"<div class=\"\"><div> <span>As the teacher walked in, my jaw dropped. This was by far the most attractive teacher I had ever seen. As she passed by my seat, I leaned into the aisle and openly stared at her mouth watering behind. I let out a low whistle and semi-loudly muttered, \"Wow, I've always been an ass-man, but but this chick takes it to a whole new level!\" I began to doodle obscene pictures of this breath-taking woman. I look to the female student sitting across the aisle from me and obnoxiously and loudly say, \"Man the things I would do for a night alone with her!\" Much to my surprise, the student gave me a disgusted look.</span></div></div>",
            "created":1413349200,
            "id":1871871,
            "title":"You see me walk in"
        },
        "1111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Stopping immediately in my tracks I glare back at you.  Despite my sunglasses being on, you can feel the heat from my gaze.  I smirk at you and part my plump lips unleashing a storm of projectile puke right at you.  For five seconds the puke sprays your face and shirt.  \"Ugh.\"  I say a bit exasperated.  \"Much better.  I was hoping to not have to use one of you until later but no problem.\"</span></div></div>",
            "created":1413349200,
            "id":1871873,
            "title":"Time for a lesson?"
        },
        "11111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>I stare, speechless, as the puke runs down my face. \"What the hell was that?!\" I yell as I wipe my face with my sweater. I look around at the other students, seeing their shocked face match my own. \"You guys all saw that right? This bitch just puked on my!\" A boy sitting in front of me turns and tells me to be quiet, saying that it could be worse. \"Worse?\" I yell as I flick vomit at him. \"How could this be worse?\" I step out into the aisle after you, trying my best to seem intimidating. \"Y'know, I was planning on maybe taking pity on you and giving that big booty some attention. But now that I see how gross and fat it is, and for that matter you are, you couldn't get me near that thing if you paid me.\" I take a deep breath and retch at the awful taste of your puke before continuing my rant, \"I hope you have a good lawyer!\" I finish my tirade by spitting on your shoes and glaring into your sunglasses, feeling cocky and superior.</span></div></div>",
            "created":1413349200,
            "id":1871876,
            "title":"Continue"
        },
        "111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>I can't help but giggle at you.  You really are cute when you're all angry like that.  I simply smile at you as you pathetically attempt to offend me.<br>\r\n<br>\r\nMy smile once again turns into a smirk as I quickly bring my boot up, the one you spit on, into your groin.  The force of which amazes you.  You can't believe I'm that powerful.  I literally lift you off the ground and you crumple into a heap on the ground.  I keel down next to your disgusting face and whisper, \"you're going to wish you hadn't done that sweetie.\"  I say sweetly.  Getting back up, I inhale near your face and my nose twitches and I sneeze largely; blowing a hurricane of snot, phlegm and spit all over your face.  Feeling a bit more, I clear my throat and spray the remaining spit on your face.<br>\r\n<br>\r\nTurning away from you, I address the class.<br>\r\n<br>\r\n\"Sorry about that everyone.  My title is Goddess but you may address me as Rosemary, as that is my given name.  Or, Goddess, if you like.\"</span></div></div>",
            "created":1413349200,
            "id":1871884,
            "title":"Continue"
        },
        "1111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>As I lay in a crumpled ball on the floor, I try to speak. But all the snot, phlegm and spit had filled my mouth. I try to spit it out, but my body feels to weak to eject the disgusting fluids. Filled with shame and anger, I clench my eyes shut and force myself to swallow your gross, slimy emissions. I shed a tear as I feel it work it's way down my throat. I painfully lift myself to my knees, wobbling weakly as I try to balance. As you're addressing the class, I look up at you and once again find myself mesmerized by your gigantic posterior. I shake my head and get back to my senses, just as you finish telling the class about your title. I scoff loudly, but the pain is evident in my voice. \"Goddess of what?\" I say say defiantly, \"Fat ass bitches? I think that's what I'll call you.\" As I stand up, I steady myself against a chair, \"Fat. Ass. Bitch\" The rest of the students look at me as if I'm an idiot, a couple even try to convince me to sit down and shut up.</span></div></div>",
            "created":1413349200,
            "id":1871888,
            "title":"Continue"
        },
        "11111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Uh oh..."
            ],
            "content":"<div class=\"\"><div> <span>I sigh, clearly annoyed, and I turn around to you.  I snap my gloved fingers and your body begins to contort painfully.  Your legs kneel and your arms, face and hands, form a seat for me.  You try to me, only to realize you can't.  I smile down at you cruelly.  I bring my gloved hands to my skirt and pull it down, exposing my bare booty to you.  You don't get to enjoy the sight however, as I plant my booty on your face, using you as a stool.  I continue to speak to the class.<br>\r\n<br>\r\nMy booty rumbles rather loudly.  I grip my taught tummy and rub it roughly.  \"Class, I don't think that Mexican food was a good idea.\"</span></div></div>",
            "created":1413349200,
            "id":1871892,
            "title":"Continue"
        },
        "111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>My heart starts to beat faster and faster as my body seems to be out of my control. I scream and swear in my confusion. \"What the hell is happening?! Someone help me! Please! Why isn't anyon-\" My pleas for help come to an abrupt end as I see you bring your hands to your skirt. As your lift your skirt time seems to slow down. The sight of your bare booty, even for a split second causes blood to shoot to my lower body. As I said, I'm definitely an ass man. But then the reality of the situation dawns on me as you take a seat on my face. Immediately I notice the ungodly stench emanating from the booty ahead of me. My body quivers as your weight pushes down on it, but I have nowhere to go, I can't move. When I hear the rumble escape you body, my eyes go wide with fear. Peering into the darkness above me, I try to see where your dreaded hole is and hope it's nowhere near my mouth or nose. </span></div></div>",
            "created":1413349200,
            "id":1871897,
            "title":"Uh oh..."
        },
        "1111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "The appetizer"
            ],
            "content":"<div class=\"\"><div> <span>Hearing your fearful mind, I feel a bit sympathetic for you; I was still a maternal Goddess, after all.  \"Awww, sweetie, don't worry.  I'm sure my booty isn't that backed up.\"  I say soothingly, motherly.  But my large hole lines up with your mouth.  Once my hole and your mouth are aligned, my hole seizes control of your mouth, my hole stretches as does your mouth.  \"My booty needs room to unload after all.\"  I giggle cutely.  Once more, my booty rumbles, and gurgles.  This time, louder, and deeper.  I strain slightly and a small but foul shart blows into your mouth.  \"Ahhh.\"<br>\r\n<br>\r\n\"Class, who can tell me what year World War II started in?\"<br>\r\n<br>\r\nI am a professor of world history after all.</span></div></div>",
            "created":1413349200,
            "id":1871899,
            "title":"continue"
        },
        "11111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span> \"Awww, sweetie, don't worry. I'm sure my booty isn't that backed up.\" Despite the fact that your seated on my face, bare-assed, this gives me immense comfort. I feel my fear drift away and, strangely enough, I smile. And then I feel something brush against my lips and I realize how idiotic I was being. Just like when my body was under your control, I become terrified as your hole seems to be grabbing my mouth, and then I understand that it is somehow manipulating my mouth! I try to prod your hole away with my tongue only to recoil instantly at the taste of your immense ass. I feel my mouth stretch wider and wider, I hear you speak but the words don't register. I hear you giggle and a rogue thought pops in my mind <i>\"God, what a sexy laugh.\"</i> I hear the gurgle and rumble from deep inside you and my close my watering eyes. And then I hear a sound, and all at once my mouth is filled with the worst taste I've ever experienced. Then I realize my mouth is coated with your shit. I try to shake my tongue, hoping to get the fecal matter off of it, and then I pull my tongue into my mouth, getting it as far away from you as possible. Tears stream down my face, as I realize I actually know the answer to the question you've asked.</span></div></div>",
            "created":1413349200,
            "id":1871901,
            "title":"The appetizer"
        },
        "111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Ready for more?"
            ],
            "content":"<div class=\"\"><div> <span>\"MMMMM\"  I moan sensually, feeling your tongue on my booty.  I smile cruelly, feeling your tears on my booty.  \"No one knows?\"  I demand impatiently.  \"Well then, I might as well tell you--\" I pause, and grunt, forcing a huge brown log into your mouth.  It's size is unbelievable.  It's followed by tow more.  \"Ahhh,\" I sigh somewhat relieved.  \"It's 1939.  Next question: who was Hitler's minister of propaganda?\"  My tummy gurgled again and I blasted a brown storm out of my booty, into your mouth.  \"Oh, wow.  That was a good one.\"  I say sighing loudly.  My booty isn't done though.<br>\r\n<br>\r\n\"How you doing down there toilet?\"</span></div></div>",
            "created":1413349200,
            "id":1871903,
            "title":"Continue"
        },
        "1111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>As you repeat, asking for the answer, I try to yell the question into your cavernous booty. But before I get my chance, I hear you grunt as a monstrous log forces it's way into my mouth. I try to push it back up with my tongue, but as my tongue presses into the dense, terrifying log, it registers the taste. I scream and try to thrash, but you still control my body. As the weight of the log keeps forcing it into my mouth, I realize I have only two choices. Either let it jam in my throat and choke to death, or chew this brick of disgusting shit. For a second, I contemplate letting it kill me then and there, but I reluctantly decide to live. I tentatively bite into the terrifying mass invading my mouth and find that the taste becomes more intense and the big, beefy log crushes between my teeth. It's so bitter, and grossly warm, but I know I have to continue or die. I feel another log force it's way in my mouth and begin to frantically chew, my eyes widening. As a third brick of gross, smelly, slimy, shit worms it's way in my mouth, I begin to practically inhale this woman's shit. All the while, tears stream out my eyes and wash against your big beautiful booty. I think to myself, \"Why does her shit have to be so dry? This is awful!\" And almost as if her body can hear my thoughts, a storm of wetter shit fills my mouth, tasting even worse than the logs. I churn it with my tongue to force it down my throat. I hear you ask how it's going, and I frantically plead \"Stop! Please! Get your big smelly ass off my face!\"</span></div></div>",
            "created":1413349200,
            "id":1871908,
            "title":"Ready for more?"
        },
        "11111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Continue to be a rude toilet"
            ],
            "content":"<div class=\"\"><div> <span>\"MMMMMMM\" I moan out slightly, once more in relief and kinkiness.<br>\r\n<br>\r\nHearing your rude and insolent comment, I drive my booty into your thigh, easily tearing your pants and nearly drawing blood.  My booty rumbles loudly.  \"You know toilet, maybe pissing off Goddess who's demolishing you might not the best idea, huh?\"  I ask condescendingly.  To prove my point I continue to unload brown mush in your mouth, but this time, it overflows, blasting onto your face with force.  As my booty continues to blast the sludge, I lift my booty above your face.<br>\r\n<br>\r\n</span></div></div>",
            "created":1413349200,
            "id":1872093,
            "title":"Continue"
        },
        "111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>As your boot slams into my thigh, I cry out in pain. Who would've thought someone so beautiful could be so destructive? As I hear the leg of my pants tear, I feel a little sad. <i>\"Aw man, those were my favorite pants!\"</i> I think to myself, before realizing just how foolish it is to worry about my clothes when I'm being tortured by the biggest most disgusting ass I had ever witnessed. I sneer at your condescending comment and attempt to give a witty rebuttal, but before I get my chance, you intimidating backside unloads into my mouth again. I become filled with a sense of defiance, and decide I'm not going to give you the satisfaction of humiliating me, instead I'll swallow your feces quickly and then give you a piece of my mind. As the horrid, swampy sludge starts to fill my mouth I swallow it in huge gulps. The texture, taste, smell, really everything about the situation was almost enough to make me faint, but I wouldn't give in! It wasn't until my mouth was filled to the brim with shit that I became worried. My eyes were wide with desperation, I began to pleadingly grunt hoping you'll show me mercy, but knowing deep down how unlikely that is.</span></div></div>",
            "created":1413349200,
            "id":1872130,
            "title":"Continue to be a rude toilet"
        },
        "1111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "???"
            ],
            "content":"<div class=\"\"><div> <span>\"That's not very nice toilet.\"  I slam my boot into your groin this time, much harder than last time.  You slump to the ground, covered in my waste, I gently lift my booty and aim it over your face, and shart for a few seconds.  The shart sprays my remaining fecal matter onto your face and off of my booty.  I bring my gloved hands back and pull my skirt back down.  I take a few steps away from you.  You hear my boots click loudly as I do.  But you also hear my stomach gurgle again; the sound fills you with fear.<br>\r\n<br>\r\nLooking at your disgusting face, well, even more disgusting, I once again, puke all over you.  This time, the puke was a bit thicker, and greenish orange.  \"Ahhh, MUCH better!\"  I say cutely.<br>\r\n<br>\r\nTurning from you , I continue to lecture the class...<br>\r\n<br>\r\nWill my toilet behave now?</span></div></div>",
            "created":1413349200,
            "id":1872178,
            "title":"Continue"
        },
        "11111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Did you hear?"
            ],
            "content":"<div class=\"\"><div> <span>I lay there as a crumpled heap. My body feels dead. The kick you delivered to my groin was so hard, my entire body ached. I silently weep as I look up into your anus as it flings crap to my face, accompanied by a cloud of indescribable fumes that're so thick I can almost see it. I feel immense relief as I see you begin to pull your skirt back down, and despite the awfulness of the situation, I can't help but look lustfully at your posterior. I close my eyes and weep tears of joy as you walk away, only to hear a telltale gurgle followed by being blanketed with warm vomit, so thick it feels like a single solid blob. As you begin to lecture again, I mutter \"I hope you brought some toilet paper to class for that gross ass.\" But I immediately regret it and turn my head hoping you didn't hear me, and if you did, that you might ignore it. </span></div></div>",
            "created":1413349200,
            "id":1872199,
            "title":"???"
        },
        "111111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Of course."
            ],
            "content":"<div class=\"\"><div> <span>My eyes burn with fire as I turn back to you.  \"Yes toilet, you stupid idiot, I heard you!\"  I say angrily.  I stride over to you and once more bring my boot onto your balls multiple times.  \"My gross ass, huh?\"  I spit petulantly, as I continue grinding your balls into paste.  After ten seconds or so, I stop and spit onto your face a few times.<br>\r\n<br>\r\nYou don't realize it for a few seconds but one of your balls has literally turned to mush.  I smirk back at you \"one down, one to go, toilet.\"  My booty vibrates loudly and I get back to the class.</span></div></div>",
            "created":1413349200,
            "id":1872279,
            "title":"Did you hear?"
        },
        "1111111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>As I see you start to walk over to my shit covered body, I feel my heart beat much, much, faster. I breathing increases rapidly. My body fills with intense fear, as you get closer, and closer. When your leg lifts, I instantly slam my eyes shut in horror, I can't stand to see what you're going to do. Then the pain starts. I scream at the top of my lungs as your boot crushes my balls again and again and again. And as I scream, the shit and vomit on my face drips to the back of my mouth, causing me to be mixing pain with utter disgust. With each stomp, the pain intensifies. I would give anything for the pain to stop. But once you cease your stomping, the pain still radiates through my crotch. I don't even notice as you spit on my face, the pain is just too great. Then I realize that my testicle is utterly decimated. \"I'm not a toilet,\" I mutter in between sobs. \"I'm a human being.\"</span></div></div>",
            "created":1413349200,
            "id":1872288,
            "title":"Of course."
        },
        "11111111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Does it?"
            ],
            "content":"<div class=\"\"><div> <span>I sigh again, clearly in irritation.  \"Class, what should I do with an insolent toilet?  Should I continue to unload on him?  Maybe something else?\"<br>\r\n<br>\r\nThe young woman who gave you a disapproving look earlier eagerly raised her hand.  \"Yes hon.\"  I called on her.<br>\r\n<br>\r\n\"Yeah...I think you should keep unloading on him.\"<br>\r\n<br>\r\n\"An excellent idea.  But first, it's time to do something about his annoying voice.  Don't you think so?\"  She nods approvingly.<br>\r\n<br>\r\nI smile back at her.<br>\r\n<br>\r\nLooking back at you, my eyes seem sweet, calm.  But there was a disturbing look to them.  \"Hon, if you promise to be a good toilet, I won't punish you again.  Does that sound fair?\"</span></div></div>",
            "created":1413349200,
            "id":1872313,
            "title":"Continue"
        },
        "111111111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue",
                "New Story"
            ],
            "content":"<div class=\"\"><div> <span>I looked around the room and realized just how many people were against me here. I thought about your proposition for a few seconds. I remembered how awful it was to be your toilet. The awful taste, the blood curdling stench, the horrid texture. The overwhelming feelings of dread as your waste forced its way through my throat. But then, I recollected the pain I was currently experiencing in my groin, and I realized that I should quit while I'm ahead and take my one remaining ball for granted. I look at the ground and cry as I say with a quivering voice \"I....I will be a good toilet,\" I pause as if the next word hurts to say, \"Goddess.\" I lift my head up, with my eyes closed. My mouth wide open and my tongue sticking out far, awaiting your treatment.</span></div></div>",
            "created":1413349200,
            "id":1872363,
            "title":"Does it?"
        },
        "1111111111111111111112":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Spin Out Ride"
            ],
            "content":"<div class=\"\"><div> <span>I smile at you, sweetly, but cruelly.  I snap my fingers and your face is instantly cleared of the mess that was on it.  I look down at you and I bring my gloved hand onto your face and gently caress it.  I smile at you, sweetly, motherly.  \"Good choice sweetie.\"  I say calmly.  I snap my fingers again and a blinding white light surrounds you pulling your soul from your body and into that of another.<br>\r\n<br>\r\nUnfortunately for you, this body was also destined to be a toilet...</span></div></div>",
            "created":1413349200,
            "id":1872397,
            "title":"New Story"
        },
        "11111111111111111111121":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden, Rick felt weird. Almost as if he were a stranger in his own body. But it didn't matter, he was here at the amusement park with his girlfriend. Rick was the typical jock, a big strong man with a tiny little brain. He's lucky that Samantha didn't care about intelligence. She was stunning, a great body, great curves working their way down to her amazing ass. It was the nicest booty Rick had ever seen. Big, round, firm, and as always she was showing it off in tight spandex pants, she liked to make other girls jealous with her ass, nothing made her happier than seeing a girl blush at it's sight. Rick loved the dominant side to Samantha and was not ashamed to let her decide the way things went. <br>\r\n<br>\r\n\"Rick, we're going on the spinning out ride now.\" She said sternly.<br>\r\n<br>\r\n\"Lead the way.\" Rick said smirking as he oogled Samantha's ass.<br>\r\n<br>\r\nWhen they got to the ride, they cut ahead of all the people in line and walked into the fully packed ride and got ready for excitement.</span></div></div>",
            "created":1413349200,
            "id":1872412,
            "title":"Spin Out Ride"
        },
        "111111111111111111111211":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "The toilets get in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I looked down at my toilets as they filed into the spin out ride.  My booty rumbled loudly, waiting to unload on them.</span></div></span></div>",
            "created":1413349200,
            "id":1872417,
            "title":"Continue"
        },
        "1111111111111111111112111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Rick strapped himself into the ride, and got comfortable. But then Samantha walked up and tightened his straps even more, locking his arms to his sides. \"I don't want you getting away.\" She said with a wink. Everyone got all nice and cozy, but as the machinery whirred to life, a boy pointed to the ceiling. \"Hey, is that a butt?\" Rick and Samantha looked up and saw a gigantic backside poking into the ride. \"That can't be an ass,\" Samantha laughed, \"It's way to big. It's even bigger that mine!\" Rick chuckled a little \"Yeah...\" He said absent mindedly. Then he heard a loud rumbling, and for some reason he knew something was off. \"Samantha, unstrap me. Now!\" Rick yelled. Samantha, thinking he was joking, responded with a laugh, \"I don't think I like your tone.\" The ride started moving and Rick started to hyperventilate. Other people started to become concerned about the ass poking in, but some just thought it was a part of the ride.</span></div></div>",
            "created":1413349200,
            "id":1872426,
            "title":"The toilets get in"
        },
        "11111111111111111111121111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "The toilets get blasted"
            ],
            "content":"<div class=\"\"><div> <span>Hearing my toilets below, I knew this was going to be enjoyable.<br>\r\n<br>\r\n\"Oh toilets...\" I moan in pain, \"...my booty is really not feeling too good.  Do you think you could help me with that?\"  I ask giggling.  Not waiting for an answer, my booty hole opens widely and a huge log lands on samantha's face, then rick's.  My booty continues to pump logs out onto the other toilets as the ride continues.</span></div></div>",
            "created":1413349200,
            "id":1872431,
            "title":"Continue"
        },
        "111111111111111111111211111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Rick looked to Samantha, \"Did that ass just speak to us?!\" He yelled with fear evident in his voice. \"Relax you big baby! Theres no way that thing is real! It's way too big! We both know that my ass is the biggest around, and maybe if you quit being such a bitch I'll let you worship my holy booty.\" She jokes to him with a wiggle of her hips. Rick nervously laughs to himself, \"I would like to worship a booty.\" he says with a little smile, completely unaware of the irony. He then hears a sickening smack and looks to see Samantha pelted by a gigantic log of shit. Samantha screamed in horror and, using the limited movement she had in her arms she feebly tried to wipe her face. Rick becomes terrified and looks up to the ass in the ceiling. As it slowly opens up he begins to thrash like mad, hoping to free himself. But it's to late, Rick makes the awful decision to scream at the impending missile of shit. Samantha's log had merely pelted her, but Rick's flew right into his gaping mouth. Due to Samantha's idea of a joke, Rick couldn't move his arms. His only choice was to eat the massive turd lodged in his mouth. The stench of the log wafted into his nostrils and the mixture of the rapidly spinning ride, the ungodly, eyewatering stench, and the horrendous flavour of the shit in his mouth caused Rick to vomit. But sadly, since the log was lodged into his throat, the vomit just shot back down. Rick looked next to him and saw the teen beside him become pelted in the same way he had, and then the man after, and the woman after, he realized he needed to get rid of the shit in his mouth before the next dump reached him. He bit into the dense turd and pressed hard with his teeth to work through the rough shit. And he chewed, the juices from the turd drained onto his tongue and caused him to convulse in disgust. Finally, after what seemed like forever, he forced down the last bit of shit. He began to sob uncontrollably. \"Please! Please stop hurting us all!\"</span></div></div>",
            "created":1413435600,
            "id":1872444,
            "title":"The toilets get blasted"
        },
        "1111111111111111111112111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Toilets get sprayed"
            ],
            "content":"<div class=\"\"><div> <span>My booty vibrated and rumbled.  Clearly, it was enjoying the act of unloading on numerous toilets at once.  My hole expands more, inhumanly wide.  The toilets look up in horror.  They can't believe how big my booty is or how wide my hole is becoming.  \"If you think my rose is big wait till you see my loads.\"  Mushier logs pour from my booty, mashing onto the toilets below.  The ride chugs for a second then stops.  Rick is right under my booty.  \"Oooh, tough luck toilet.\"  I giggle and unload a large spray of diarrhea on his face.  The ride starts up again only for the other toilets to get sprayed as well.</span></div></div>",
            "created":1413435600,
            "id":1872454,
            "title":"Continue"
        },
        "11111111111111111111121111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Rick heard a loud, deep rumbling emanating from the immense rear end hovering above him and his fellow amusement park patrons. It looked as if it was shaking, vibrating even.It was as if it was taking some perverse joy in painting Rick and all these other people in feces.  He looked to his side and saw that Samantha had freed her arms from the straps. Rick looked up in horror as the anus of the monstrous booty was stretching wider and wider. \"Oh my God!\" Rick screamed, \"It's huge!\" Rick heard a female voice talk about the size of her ass, followed by a cute giggle.\"Wait! Someone's there! Stop this!\" He cried out, pleading for mercy. As he screamed, a big mushy turd flung itself right into his face. It stung his his eyes like someone has sprayed mace into his face. It dripped into his nostrils, his mouth, even his ears. The stench alone was enough to make a man faint, but the momentum of the ride kept Rick conscious. He shook his face wildly, enough so he can see again. He sees as person after person was forcefully smacked with the big mushy logs. The ride kept spinning and spinning. Rick lost count of how many logs had been thrown at his face, he just wept. The tears washing some of the crap of his face. A few of the other patrons had been knocked unconscious by the shit, but for the most part, the people were forced to endure the crap. Rick felt the ride come to a halt and thought his salvation had arrived. Then he looked up and saw the gaping, shit dripping anus a top him. <i>\"Oooh, tough luck little toilet\"</i>, he heard the voice giggle. \"Please! I'll do anything you want just please let us go! Plea-\" Rick was interrupted by a flood of diarrhea shooting into his mouth. Rick would've shut his mouth to stop this never ending flow of shit, but the shock of the situation stopped him. Out of the corner of his eye, Rick saw Samantha had gotten out of her binds. He thought he was saved, that she would free him as well. Samantha moved towards him, but she stopped, looked at his current situation of Diarrhea slurping, and sadly said \"I'm sorry baby, I...I just can't\" She turned and ran, and Rick couldn't help but stare at his big booty in her spandex pants. He thought to himself about how he'd love to be kissing her ass right now. But once she escaped,  his sight returned to the source of awful, rancid shit that was coating the inside of his mouth. This was the ass he was worshiping now, whether he liked it or not.Just as he felt his swollen stomach couldn't possibly hold any more, he heard the ride start up again. Now, everyone was subjected to the rain of hot stinking shit. It felt like the apocalypse, they all just wanted it to end.</span></div></div>",
            "created":1413694800,
            "id":1874021,
            "title":"Toilets get sprayed"
        },
        "111111111111111111111211111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "The ride stops"
            ],
            "content":"<div class=\"\"><div> <span>The ride begins to slow down, but as it does, I unload a gigantic log, it basically swallows each of my toilets as they come under my booty.  As the ride stops completely, rick ends up under my booty.  I look down below and see his disgusting face, \"Oooh, tough luck toilet.\"  I giggle sadistically and unload another large log on his face.<br>\r\n<br>\r\nThe restraints pull up and the toilets try to get off, the staff comes on with hoses and blasts the ride somewhat clean and the toilets off.  More toilets get on.  They're horrified by my booty once they see it and I shart a little on, then they have no choice but to strap in; instantly regretting their decision to ride.</span></div></div>",
            "created":1413694800,
            "id":1874152,
            "title":"Continue"
        },
        "1111111111111111111112111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>As the ride begins to lose momentum, Rick begins to weep. He just wants to die, for it all to be over. He watches as the booty lets loose a gigantic log. It seems too big to be real, but it is. He's seeing it with his own eyes. The other people seems to disappear into the mass of shit being released, and all Rick can do is watch. He count's himself lucky, because the log seems to end before it reaches him. But once again, the ride has stopped with poor Rick directly beneath the booty. Staring up at it, Rick can't help but open his mouth in awe. Rick now wishes he could trade places with the other people on the ride, as a large log launches itself right onto his face, burying him in shit. The fastens come off and Rick weeps as he is sprayed down and cleaned. He just wants to go home.<br>\r\n<br>\r\nThe next group of people hurriedly rush onto the ride, excited for the fun of the amusement park. The group is mainly made up of recent high school graduates here for fun. Immediately, they see the booty and are terrified. One man in particular, stand right beneath it and stares. He immediately regrets the decision when the stink reaches his nose, but before he has a chance to move, lets out a shart. The shart sprays them all but the man gets the full force of it. Nearly fainting, all the ride-goers notice the ride begin to move, the swiftly fasten themselves in to keep from being injured by the ride, but knowing they've sealed their fate to be tortured by the booty.</span></div></div>",
            "created":1413694800,
            "id":1874337,
            "title":"The ride stops"
        },
        "11111111111111111111121111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Round 1"
            ],
            "content":"<div class=\"\"><div> <span>I decide to demolish these young toilets early on.  My booty rumbles loudly, and opens and closes widely.  My booty appears to be breathing MMMMM.<br>\r\n<br>\r\nThe toilets look up as my booty unloads a large tidal wave of horse-like diarrhea.  The load is foul and sprays each toilet.<br>\r\n<br>\r\nI giggle cutely.  \"Wow toilets, what ever possessed you get on this ride, I'll never know.\"</span></div></div>",
            "created":1413694800,
            "id":1874354,
            "title":"Continue"
        },
        "111111111111111111111211111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The booty lets out a loud, terrifying rumble. All the people watch in fear as it opens and closes. The hungry booty looks as if its breathing. \"What the hell is happening?\" One man yells out in horror. Out of nowhere, a tsunami of gut wrenching diarrhea shot out and rushed over each and every person. It flows into their mouths and noses, drowning them in shit. A few of the people pass out from the sheer awfulness, many of them puke, and the rest begin to beg and plead for the booty to stop.</span></div></div>",
            "created":1413867600,
            "id":1875389,
            "title":"Round 1"
        },
        "1111111111111111111112111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Brown Storm"
            ],
            "content":"<div class=\"\"><div> <span>Hearing my pathetic toilets plead, I decide to play with them.  \"Hey toilets, did you hear the weather prediction today?\"<br>\r\n<br>\r\n\"...It said there would be brown storms!\"  I laugh cruelly as my booty rumbles and opens with a HUGE blast of horse-like diarrhea, thicker, and splattering each toilet.  My booty doesn't stop there and unload larger logs, horse logs next.<br>\r\n<br>\r\nThe toilets are getting demolished, praying for the ride to be over.</span></div></div>",
            "created":1413867600,
            "id":1875445,
            "title":"Continue"
        },
        "11111111111111111111121111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>When the voice above the booty began to mention the weather, a certain man became confused. He looked up to the booty questioningly. When the voice said it's punchline, the man opened his mouth in shock. Time seemed to slow down as her gigantic flood of thick diarrhea flew towards the man's face. He started a scream, but before it could be heard, all the shit flew into his mouth. He was forced to gargle the booty's rancid feces, afraid to swallow. He forced the awful crap down his throat, crying as he did. Once he had swallowed it all, he looked slack-jawed as everyone else was splattered with shit. The man tried to keep his mouth open to air it out, but unfortunately, his open mouth was an open target for the football sized log that flew into his mouth. The man was forced to chew the log as he stared up painfully at the angry pulsating anus. At this point, a few of the ride-goers felt near death.</span></div></div>",
            "created":1413867600,
            "id":1875708,
            "title":"Brown Storm"
        },
        "111111111111111111111211111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Brown Hurricane"
            ],
            "content":"<div class=\"\"><div> <span>I decide to break up the grind.  I pull a small vial from my impressive cleavage and drink it.  My stomach vibrates for a moment and then my booty follows suit; frightening the toilets below.  I expand my booty a bit, then more to hold back the massive load.  \"toilets!\" I call out \"I don't think that laxative was a good idea.\"  I groan, in pain and my booty opens again.  This time the toilets are blasted, completely drenched, multiple times in thick, huge logs, followed by elephant pies of green and brown.</span></div></div>",
            "created":1413954000,
            "id":1875725,
            "title":"Continue"
        },
        "1111111111111111111112111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The men and women in the ride sit and whimper as it seems the horrible torrent of defecation has come to a close. Little did they know, that this was merely the calm before the storm. A slight rumbling is heard followed by the booty vibrating like mad. All the people weep and wail as the cheeks of the booty jiggle like mad. The already humongous booty grows to even an even larger size. It looks as if the now gargantuan booty is trying to force out another gigantic log, but the shit seems to be entirely too large. The woman underneath the booty cringes and thrashes, but luckily the shit could not be released. The booty then grows even bigger. It is now bigger than any of them thought imaginable. Some of them even begin to think that the booty may be God itself. The men and women scream as the voice taunts them, and all of them clench their eyes shut as the booty opens wide, all of them but one. One young man is so awestruck by this heavenly booty that his mouth is agape and eyes wide. A massive log slams right into his face, filling his nostrils with a stench so bad it could peel paint, his mouth with a taste terrible enough that a starving man would avoid it, and filling both with thick bitter shit. The logs seem never ending, for multiple rotations these house sized dumps crash into the men and women. Many of the people were passed out or dead, but an unlucky few were still conscious. That's when the immense green and brown piles flew down. The completely covered them all in the awfully smelly shit. The conscious ones now counted themselves lucky, as they could clear some of the shit to get to air. Unluckily, the only way to do so was to eat all the disgusting, bitter shit covering their mouths.</span></div></div>",
            "created":1413954000,
            "id":1875734,
            "title":"Brown Hurricane"
        },
        "11111111111111111111121111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "More toilets get on"
            ],
            "content":"<div class=\"\"><div> <span>I look into the ride and see that my toilets have been demolished.  However, my boot is still backed up.  The ride comes to a stop and the old toilets are flushed off.  New toilets come on right after them.  Wondering why there's shit everywhere.  They smell it and want to get off.  Then, they look up and see my booty.  As they look up, my booty unloads a large brown shower on them.  Wanting to get off now, they head for the doors, only to have them shut, and the toilets are trapped.  They strap in as my booty begins to unload green mushy sludge on them.  Each toilet getting sprayed and pelted.</span></div></div>",
            "created":1413954000,
            "id":1875748,
            "title":"Continue"
        },
        "111111111111111111111211111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Once again the ride is over. And once again the people on the ride are washed away with copious amounts of shit. Almost as soon as the one group is gone, a new flood of people enter the ride, joyful and ready to enjoy the ride. Sadly, the Goddess and her majestic booty are going to rain on their parade, and rain in the worst way imaginable. This group was mainly parents and their bratty teenaged children. \"What's with all this shit?\" One girl yells. \"Quiet honey!\" her mother yells, \"It's just decoration!\" A teenaged boy runs in and quickly retches and gags. \"Is the awful stench decoration too?\" A father points up to the booty while covering his nose, and asks if the frighteningly large booty is real. A boy runs over, jumps and slaps one of the large, perfect cheeks, causing some of the shit in the crack to splatter onto his face. Another boy points and laughs \"Kyle! Did you just get shit on?\"Before Kyle can answer, the booty lets loose a massive shitty shower, splattering everyone. And poor Kyle, was right under the booty, so his face got a healthy helping of the booty's juices, all over his tongue causing him to fall on the ground gagging. Everyone screams and runs to the exit, but unfortunately the doors slam shut. The ride hums to a start and everyone realizes they need to strap in or be horribly injured. Most of them strap themselves in, sealing their demise. But one boy sees Kyle on the ground and runs to aid him. As he is strapping Kyle in, the booty unleashes an flow of shit. Each and every person is pelted by the disgusting shit, and the boy helping Kyle begins to rush to get into his own place, but in his rush he puts Kyle in wrong, leaving his head pulled back and his mouth forced open.</span></div></div>",
            "created":1413954000,
            "id":1875756,
            "title":"More toilets get on"
        },
        "1111111111111111111112111111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Toilet torture"
            ],
            "content":"<div class=\"\"><div> <span>\"toilets, I think I should tell you: I took a laxative before you all got on--\" I groan and my booty unloads a few gigantic logs on a few toilets below.  \"Ahhh,\" I sigh.  \"Anyway, I think it's kicking in.\"  I strain as my booty expands, growing, frightening my toilets as they look above.  My booty begins to unload elephant shit pies that size of garbage cans.  Each one blasting a toilet.  However, as my booty hovers above kyle, I blast his face and mouth a green stream of chunky diarrhea.  \"Ahhhh,\" I sigh again.  But my stomach quickly lurches.  \"Sorry toilets...I keep thinking my booty's done--\" my booty rumbles loudly and expands.  \"But it never is!\"  I laugh cruelly as my booty explodes on each toilet with green mushy diarrhea.</span></div></div>",
            "created":1413954000,
            "id":1875838,
            "title":"Continue"
        },
        "11111111111111111111121111111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The men and women scream and cry as the voice behind the booty mentions a laxative. They can't imagine why this Goddess want to shit all over people, or further more why she would take a laxative! They scream in absolute terror as the booty unleashes large turds down upon the poor, unsuspecting victims below. They slap disgustingly against their faces with sickening smacks. One of the turds lands in a woman's mouth and she screams in horror as it squishes against her tongue, filling her mouth with the worst tastes imaginable.She tries to use her tongue to prod the shit out of her mouth but only succeeds in breaking it apart. Realizing she's been beat, the woman hesitantly chews the foul log and forces herself to to swallow it. She thrashes in abject horror as the slimy shit slides down her throat. A man a few spaces down watches this with wide eyes, terrified of what will happen when the logs reach him. He becomes relieved when the big piece of shit landed itself on his forehead. At first, he believes he dodged a bullet, but as the juices of the shit drip down his face he realizes how wrong he was. It drips into his eyes, burning them like acid, then continues down to his upper lip, forming a pool just beneath his nostrils, causing him to inhale the hellish stench, and then the vile liquid flows into his mouth, forcing him to gargle the putrid juices as he yells. And after enduring what seems like an eternity of this torture, the log on his forehead slips down his face, painting it a gross brown, and once the log reaches his mouth he is forced to suffer the same fate as the woman, chewing the bitter, hearty log through pained tears. As the booty hovers over Kyle, he stares straight into the filthy pulsating anus. At this point he wishes he hadn't decided to slap the gigantic beautiful booty, as it led to him getting his tongue splattered with shit and strapped in his current predicament. Time slowed for Kyle as the flow of horrendous green liquid feces flew towards his face. His nostrils and mouth were soon over flowing with the shit. He tried to scream but there was no where for the scream to go. Kyle tried to resist swallowing, but soon realized that all his airways were blocked with thick chunky diarrhea. He gulped down his meal hurriedly, hoping that the speed would reduce the taste, which it didn't. Kyle quickly vomited, but in his predicament, there was nowhere for it to go but back down his throat. All of the people were treated to a similar treatment as gallons of awful liquid shit coated each and every one of them, causing many of them to faint from shock. Kyle yelled up to the booty, \"Why are you doing this? Why punish all of us? None of us have done anything to wrong you!\" Soon after his scream, a small teen girl yelled as well, \"Yeah! Kyle was the one that spanked your ass!\" Kyle then realized just how right she was.</span></div></div>",
            "created":1413954000,
            "id":1876055,
            "title":"Toilet torture"
        },
        "111111111111111111111211111111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "My booty unloads"
            ],
            "content":"<div class=\"\"><div> <span>\"Why toilets?  Because it's SOOO kinky and feels amazing!\"  I moan sensually above.  \"Because, a laxative will make my booty even more backed up.  Duh!\"  I say like a stereotypical blonde.<br>\r\n<br>\r\nMy booty rumbles again, this time aiming at kyle as the ride slows.  \"Well kyle, maybe you shouldn't have touched my divine booty, hmmm.  Ever consider that?\"  My booty expands above him as the ride stops and my booty unloads a mountain of green and brown mushy logs over him, each one explodes over him, hitting other toilets.<br>\r\n<br>\r\nThe staff come on and quickly get the used toilets off.  Only for another round of toilets to be quickly pushed on.  The smell is horrific and they're confused by all the shit everywhere.  Oddly enough, rich and samantha are back on the ride.  She tightens him in again and he tries to warn everyone of my booty but they don't realize it until I shart on them and the doors close.</span></div></div>",
            "created":1413954000,
            "id":1876061,
            "title":"Continue"
        },
        "1111111111111111111112111111111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Kyle doesn't know what to say when the booty speaks to him directly.He had assumed this whole time that the booty was blissfully ignorant to what was happening beneath it. As the ride slowed to a stop, Kyle was terrified to realize he was directly below the booty, and since he was still forced to be looking up, he was forced to gaze upon the immense, gaping anus. The booty rumbled ominously as he stared upon it.\"I'm sorry!\" He yelled, \"I'll never touch your ass aga-\" Before Kyle had the chance to finish his plea, mounds of rancid shit was piled onto him. Log after log after log pounded into him, slowly covering his entire body with the booty emissions.Eventually the shit spilt over and landed on the surrounding people. The whole situation was awful for all involved, besides the Goddess of course. The ride now being over, all the used up, shit covered men and women were ushered out.<br>\r\n<br>\r\nAfter Rick had escaped his own personal hell, he eventually found Samantha as she was washing her face in the bathroom. \"Rick honey, I am so sorry I left you! Please, let me make it up to you!\" She cried to him, \"Why don't we show you how nice a booty can be toy you.\" She turned her big ass towards Rick and he was instantly turned on. He reached to touch it, but before he could she grabbed his hands, \"Uh-uh-uh, close your eyes and follow me, then the fun begins.\" Rick is excited for what is coming, but he is unaware of the fate he is about to face. Little does he know, Samantha was entranced by the power The Goddess's booty had, and she wanted to see it again. She led rick up to the ride, and as an awful stench invaded his nose, he began to fidget. \"Don't worry sweety, it's just the animals.\" Samantha pushes Rick to the wall and straps him in the same way as before, but also straps his head in the way Kyle's was. \"He's all yours,\" Samantha coos to the booty. Rick opens his eyes and sees the booty above him and begins to scream and thrash like mad. \"Everyone get off! She's going to shit!\"The other people laugh, but not long after, the booty lets loose and earth shaking shart that splatters them all with nasty shit. And poor Rick, once again gets to taste it. The others sprint to the door, but they slam in their faces. Samantha wipes the shit off her face, and realizes how big a mistake she made. Samantha and everyone else, strap themselves in as the ride starts, terrified of what is to come.</span></div></div>",
            "created":1413954000,
            "id":1876082,
            "title":"My booty unloads"
        },
        "11111111111111111111121111111111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Another load"
            ],
            "content":"<div class=\"\"><div> <span>I watched my used toilets being removed and my toilets being brought on.  The sight enthralled me and my booty rumbled.<br>\r\n<br>\r\nHearing samantha below, \"How kind of you sweetie.\"  My booty rumbles a bit, agreeing.  \"Oooh, and my booty wants to thank you too.  My booty opens and blasts her thoroughly.  I giggle above.<br>\r\n<br>\r\n\"Yes, sammykins you did.\"  I say cruelly, as my booty unloads a log on her.<br>\r\n<br>\r\nMy booty opens and closes, breathing, until a huge, tube of mushy brown logs begin to unfurl on each toilet as the ride starts up.  The toilets get blasted but samantha gets another log and spray to the face.  My booty rumbles and expands.  \"Ooooh god toilets, my booty.\"  I moan, and my booty stretches again, this time unloading gigantic elephant logs, followed by more greenish-brown slime.</span></div></div>",
            "created":1413954000,
            "id":1876099,
            "title":"Continue"
        },
        "111111111111111111111211111111111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Samantha is shocked and horrified as she gets a face full of the booty's shit. She thought she would have gained the Goddess's favor, but clearly she was more that mistaken. The booty seems to not only be unwilling to spare her for her actions, but rather is actively trying to torture Samantha more than the others. The others watch as Samantha is decimated by the booty, all of them recoil at the stench and sheer disgustingness of the booty's emissions. They all seemed to think that Samantha would be the only one who would be suffering. They were mistaken. They all stared in awe as the booty was opening and closing, again and again. It was breathing like was a being on its own. And after watching this disgusting show for a short while, the ride-goers were treated to a gigantic cylinder of fecal matter that seemed to be never ending. It continued on and on, covering multiple people, forcing them to choke on the foul mass invading their mouths. The log ends just as it gets to Samantha, at which point she's subjected to a spray of liquid shit and another log jammed in her mouth. She cries as she's forced to scarf down the thick log and wash it down with diarrhea. Rick watches as his treacherous girlfriend is forced to endure the nasty torture. And once he hears the voice moan, he is filled with arousal, and stares at magnificent booty. His sexual thought quickly leave as it soon releases logs to big for him to comprehend, followed by a rancid slime that fills his forced open mouth. Samantha cries out as tears stream down her face, \"Why are you punishing me! I brought you him!\"</span></div></div>",
            "created":1414025100,
            "id":1876119,
            "title":"Another load"
        },
        "1111111111111111111112111111111111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Brown Shower Time!"
            ],
            "content":"<div class=\"\"><div> <span>Feeling sympathetic for my toilet, \"Awww, sweetie, I'm sorry, my booty is backed up, was all.\"  I say sweetly, kindly.<br>\r\n<br>\r\nMy booty rumbles loudly and it stretches widely.  \"Here comes toilets!\"<br>\r\n<br>\r\nMy booty begins to decimate each toilet, with green and brown logs, each one gigantic.  The ride begins to slow, to creak under the weight of my logs.  My booty isn't done though, more thick green slime shoots from my booty onto each toilet, blasting them grossly.</span></div></div>",
            "created":1414026600,
            "id":1876137,
            "title":"Continue"
        },
        "11111111111111111111121111111111111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Samantha doesn't know why, but she feels so comforted as the booty soothes her. Here is this gigantic booty, repeatedly attacking her with log after log, blast after blast, of shit. Yet here she is, smiling with her shit caked face, forgiving this torturous booty. Then the booty rumbles. It vibrates and shakes, everyone is terrified because they know what's coming. The booty stretches as a majestically massive log begins to crown out of it. All at once, the men and women scream at the horrific sight, they thrash, trying to free themselves, but their efforts are in vain. They're trapped, and one after another they becomes engulfed by the immensely huge logs. One after the other, the elephant sized shit collides with the people. The men and women at the end of the cycle stare in awe as they watch each of their cohorts drown in the piles and piles of shit. Rick was the lucky one, the log that hit him only hit his body, he only had to endure the stench. The people cheered as the ride creaked and slowed, thinking their torture was over. They couldn't be more wrong. Rick, with his gaping mouth, was just below the booty as it unleashed the most disgusting slime possible unto him. And since the ride as slowed, he was beneath the booty for longer than before. He stood there, the slime drenching every inch of his body. As the ride slowly rotated, each person was treated to a similar fate, a disgusting coating of booty slime.</span></div></div>",
            "created":1414027860,
            "id":1876151,
            "title":"Brown Shower Time!"
        },
        "111111111111111111111211111111111111111111111111":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "My Booty Finishes The Ride!"
            ],
            "content":"<div class=\"\"><div> <span>Seeing that the ride can't take much more, I decide to demolish these toilets.<br>\r\n<br>\r\n\"toilets, my booty can't hold it anymore.  Sorry toilets.\"  I say curtly, not really caring.<br>\r\n<br>\r\nMy booty stretches again, and more brown gooey, thick slime, blasts the toilets, followed by a massive log that swallowed each toilet in it; eating the toilets.  The ride chugged to a halt as it had been literally turned into a shit bowl.<br>\r\n<br>\r\nBut one toilet, emerges from the muck.  I aim my booty at his face and shart a long, huge, and wet shart, cleaning my booty, blasting his face.  He sinks back under.<br>\r\n<br>\r\n\"Ahhhh,\" I sigh contently, as I hop down from the ride and search for another.</span></div></div>",
            "created":1414028820,
            "id":1876159,
            "title":"Continue"
        },
        "1111111111111111111112111111111111111111111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "New ride?",
                "Reverse-Outhouse"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you mean sorry?\" One woman yells \"Does that mean we're free?\"<br>\r\nSamantha cries silently, her tears washing the shit from her cheeks into her mouth, causing her to retch and gag. \"I don't think so.\" She mutters after she gets her composure. \"Shut up Samantha! This is all your fault!\" Rick wails, cursing the fact that she tricked him with her amazing booty to become this booty's slave. Rick stares up at the booty's quivering anus, from the sound of what she had said earlier, it seemed that the booty was not feeling all that loving or caring right now, which terrified poor Rick. Rick had endured so much shit eating, he thought he might have gotten used to the taste of this booty's shit. At that moment, the anus puckered outwards and let loose a tide of diabolically awful shit. The slimy butt juice planted itself right on Rick's face, giving him the appearance of wearing a brown mask. The gooey juice oozed into his mouth, and he realized just how wrong he had been in thinking that he could stand this disgusting flavor. This round of shit was without a doubt the most horrendous flavor he had ever experienced. He could feel the shit sink into his pores. He felt like he was becoming shit. Rick screamed and thrashed with newfound vigor. He looked to the side and saw, as the slimy shit poured onto everyone else, they were having the same experience. The shit tasted and smelt as if someone had thrown a thousand skunks into a sewer and then added rotten milk and eggs. Rick tried to swallow the shitty juice, but his throat just wouldn't let him choke it down. At this point, Rick was basically gargling the most foul substance known to man. At this point, the booty started to let loose an unfathomably humongous log. This ridiculously large log began to surround the people on the ride. It was enveloping all of them like a hungry boa constrictor. Everyone kept fighting their straps as the unimaginably large log began to cover each and every inch of them. Rick watched as one after another, people were snuffed out like lights, becoming food to the log. Just before the shit completely covered Rick, he broke free from his straps. The ride kept getting filled with shit, it was almost impossible just how much crap was coming out of this log. Rick dug through the thick, bitter log, hoping he'd soon reach fresh air. As he reached the top, Rick lurched out of the shit pool, mouth open and greedily sucking for air. Unfortunately, Rick launched himself straight towards the booty, right between its cheeks. His open mouth sealing over its anus and his tongue thrusting straight in. Rick didn't register the situation right away, and he began to poke and prod the inside of the booty with his tongue. Then it all hit him. The stench invading his nostrils and the blood curdling flavor of the booty. Rick was barely conscious, but the Goddess unleashing the longest and wettest shart imaginable straight down his throat. Rick fell back into the shit and began to sink down to his demise.</span></div></div>",
            "created":1414031700,
            "id":1876173,
            "title":"My Booty Finishes The Ride!"
        },
        "11111111111111111111121111111111111111111111111112":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Ivan wandered around the amusement park, and needless to say he was unimpressed. All of the rides were the same ones he'd seen a thousand times. Roller coasters, ferris wheels, bumper cars. the same old shit he'd seen a million times. That is, until , he saw something that caught his eye. It looked like a a simple, small, room with an empty throne atop it. \"What the hell, why not.\" He muttered as he walked over to the strange building. He opened the door and saw a chair in the middle of the otherwise empty room. He sat down and almost immediately got bored. \"C'mon! What the fuck is happening here.\" He yelled, annoyed with the lack of action.</span></div></div>",
            "created":1414036740,
            "id":1876207,
            "title":"Reverse-Outhouse"
        },
        "111111111111111111111211111111111111111111111111121":{
            "author_id":"nune",
            "author_name":"ToiletGoddess",
            "choices":[
                "Toilet 1"
            ],
            "content":"<div class=\"\"><div> <span>I snapped my fingers and was instantly teleported into the Reverse Outhouse.  My toilet, the throne was undisturbed and befitting of a Goddess.  I placed my booty on the toilet and the toilet that was on the ride was moved under my booty.<br>\r\n<br>\r\nThe room was high, about 10 feet up and my toilet is on a ride bench, on a track.  Once I flush the toilet, they are dropped into the tank below, with the other demolished toilets.  Then, the trap door closes, and another load of toilets will ride in.<br>\r\n<br>\r\nThe ride starts up and my toilet is stopped right under me.<br>\r\n<br>\r\nMy booty rumbles, excited, and desperate to unload...</span></div></div>",
            "created":1414037040,
            "id":1876211,
            "title":"Continue"
        },
        "1111111111111111111112111111111111111111111111111211":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Ivan heard a thud on the top of the building he was in. He looked up and tried to figure out what was happening up there. Ivan couldn't figure out what was going on, he was about to get up and leave, but then the single hole in the ceiling, the rooms only source of light, was covered up. Ivan decided he wasn't going to wait any longer, he stood up and made his way for the door. But before he could take two steps, the seat behind him whirred forward and knocked him into it. Fastenings then locked Ivan in place, pulled his head back and forced his mouth open. The seat jerked forward and came to a stop with Ivan directly beneath the hole in the ceiling. After a few seconds of silence, Ivan heard a loud rumbling from the ceiling. Then a very quiet hissing sound started to emanate from the ceiling. \"Hello? Is someone up there?\" Ivan yelled up, and at that moment the worst smell he had ever smelt reached his nostrils. Ivan pushed against the fastenings, trying to escape. And then he heard a cute giggle. Next thing he knew, he felt a hot, sticky liquid dripping on his face. At first it was only on his forehead, but eventually it reached his mouth, and he almost instantly vomited from the awful, rancid taste invading his senses. \"If you think that's bad, just you wait.\" A voice from above laughed. Then a sickening sound was heard, immediately followed by no less than a gallon of thick, chunky, green and brown diarrhea. Ivan's mouth was overflowing with the nastiest substance on the planet. Ivan tried to simply swallow it, but it was too thick and chunky. He was forced to chew, and chew and chew. All the while, the shit was stewing in his mouth. Churning between his cheeks. After what seemed like forever, he had forced down the last drop.</span></div></div>",
            "created":1414039200,
            "id":1876215,
            "title":"Toilet 1"
        },
        "11111111111111111111121111111111111111111111111112111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Did I say you could eat my load?\" The Goddess yelled to Ivan. \"If you want to get out of here alive, you better start obeying.\" The Goddess let out a cute giggle, which quickly turned to immense strain. She was pushing hard, but it was clear what ever was inside her, was way too big. The booty vibrated and rumbles, striking fear into Ivan. After what seemed like an eternity of her straining, with the occasional release of horrifically noxious gas, Ivan heard the Goddess let out a moan. The next thing he knew, a log the size of a football landed right on Ivan's face, covering his eyes, nose and forehead, filling his nostrils with a rancid stench. The slimy log was so dense, it felt as if a brick had been thrown into his head. \"Remember toilet, no eating until I say so.\" The Goddess giggled once again as a stream of mushy, nearly liquid shit, flowed straight into Ivan's mouth. Ivan closed his throat and kept what felt like mashed potatoes but tasted like death firmly in his mouth. Ivan started to convulse slightly, which caused the slimy log on his face to slip into his mouth. \"Oh, poor toilet,\" The Goddess said sweetly. Ivan could do nothing but try to scream, which resulted in him gargleing the mass of feces in his mouth.</span></div></div>",
            "created":1414040640,
            "id":1876222,
            "title":"Continue"
        },
        "111111111111111111111211111111111111111111111111121111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The Goddess laughs sadistically as she hears her toilet suffering beneath her. She strains and grunts as her booty stretches, trying to force a gargantuan log out of anus. The toilet beneath her screams into his mouthful of shit, his eyes going wide as saucers in fear as he hears the effort the booty above him is putting into pushing out this obviously humongous log out. He tries to move his head, which only causes the foulness residing in his mouth to slosh about disgustingly. Ivan winces as his tongue moves through the dank, viscous shit, the taste of which is almost fatal. He hears a sickening crackling sound as the Goddess lets out a long moan of pleasure. The next thing he knows, a massive log, at least two feet long and 6 inches in diameter is lunged into his mouth. As the tube of foulness entered his mouth, the liquid feces already in his mouth splashed into his eyes, stinging them like acid. The Goddess peered down at her toilet and giggled at his brown stained face, his shit filled mouth, and the immense log sticking straight up out of his mouth. \"Feel free to swallow now, Toilet.\" she said soothingly. Ivan opened his throat and let the diarrhea ooze down his throat as he frantically chewed the solid shit, all the while being tormented by its stench and flavour. Just as he finished his awful meal, the Goddess let loose a sigh and a huge pile of mushy green and brown shit. \"Bye toilet.\" She giggled as she pulled the lever and flushed him down. After a few minutes, a small group of four drunk young adults staggered there way into the ride. \"What kind of fucking ride is this? It smells awful!\" One obnoxiously yelled as they all sat down.</span></div></div>",
            "created":1414180980,
            "id":1876866,
            "title":"Continue"
        },
        "1111111111111111111112111111111111111111111111111211111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The Goddess looks down disapprovingly at her new toilets. They're loud, boisterous and obnoxious. And they need to be taught a lesson. \"Oh toilets, if you think it smells bad now, just wait till I get started! MMMM\" The Goddess grunts and lets loose booming fart that causes her cheeks to jiggle and ripple. A cloud of rancid gas causing the toilets to cough and gag, the stench was so thick they could taste it. The immense booty that hung above them unleashed a second explosion of gas, and with it, a unstoppable torrent of thick green booty slime. The slime splattered all over the toilets, coating them in the horrid substance. Instantly, the toilets feel their drunkeness melt away. The unbelievable stench mixed with the inconceivably awful taste caused their minds to become sharp and alert. \"Oh, what's that? No matter funny comments? Aww, I was enjoying your jokes!\" The Goddess says sweetly. The booty rumbles and vibrates loudly, filling the toilets with fear. \"And it looks like he fun is just beginning.\" The Goddess groans and grunts as she begins to push, but the log she produced is far too large to fit. The Goddess strains and strains, her booty stretching to incredible lengths. The toilets scream at the sound of the Goddess working. The Goddess's booty finally opened up and a log the size of a small child fell atop the toilets, followed quickly by a rush of nasty, thick logs which pelted their faces, mixed with a flood of nasty diarrhea that smelt as if it were brewed in the colon of a thousand skunks. The toilets weep as they become smothered by the Goddess's emissions.</span></div></div>",
            "created":1414186800,
            "id":1876901,
            "title":"Continue"
        },
        "11111111111111111111121111111111111111111111111112111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>The Goddess smiles to herself as the toilets plead and cry as they wish they could be anywhere but beneath the Goddess' mighty booty. The Goddess was enjoying using these toilets and covering them with her crap, but all good things must come to an end. She decided it was time to demolish these pathetic little men. \"You're doing very good Toilets but I'm afraid I'm going to have to cut this adventure a little short.\" The Goddess pulls a vial out from between her ample cleavage, and then quickly chugs it. She giggles as the laxative instantly takes effect. The booty begins to rumble. Only slightly at first, but gradually growing in intensity. The toilets becomes terrified the instant the rumbling starts. A smile grows across the Goddess' face as the toilets yelp and plead, knowing what the rumbling precedes. The booty seems to expand as The Goddess becomes more backed up than she had been in weeks, moaning as she feels her colon filling. The toilets thrash wildly, futilely trying to escape, one of them opens his mouth to beg for mercy. Before he has a chance to say a single syllable, a rain of rancid slime splatters all the toilets, splattering the inside of the begging toilets mouth. \"Awwh, I'm sorry toilet. But that should teach you not to speak out of turn.\" The Goddess giggles as the toilet gags on her disgusting booty slime, and then she forces out mounds upon mounds of thick, dense logs which rain down on the toilets, covering almost their entire body except their face. The Goddess then utters a slight groan as her immaculate booty pours out a fountain of horrific smelling diarrhea, which splashes all over their uncovered faces. The booty begins to rumble and vibrate again as it becomes more backed up, \"Now toilets, have you learned anything today?\" She asks in a sing-song voice as she holds back the immense load.</span></div></div>",
            "created":1414192620,
            "id":1877065,
            "title":"Continue"
        },
        "111111111111111111111211111111111111111111111111121111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>All the toilets cry out that they've learned their lesson. \"And What is it that you learned?\" The Goddess giggles as she playfully wiggles her big booty from side to side. There's a moment of silence as none of the toilets know what they were expected to learn. One of the toilets turns to the other and asks what he should say. A litre of sludge drips directly onto the toilets face, splattering him and the toilets around him. \"Now toilets, are you telling me you haven't learned a single thing?\" The Goddess asks as her booty rumbles ominously. The toilets begin to shout out random things hoping to appease the Goddess. Everything from woman are superior, to not to comment on smells. And with each wrong answer the booty drops another litre of sludgy shit down onto the toilets. \"Now, I believe I've given all of you plenty of chances to answer, and it appears that you haven't learnt your lesson at all!\" The Goddess says with a tone of disappointment. \"The lesson is that all of you are are nothing more than my toilets.\" The Goddess then lets loose a moan of pleasure, dropping a gigantic log that completely swallows one of he toilets. She laughs as she lets loose another three logs, each one completely engulfing a toilet. The Goddess giggles cruelly as she flushes the toilets away. The toilets fall into the tank below the ride, which is effectively a septic tank filled with the Goddess' loads. The Goddess sighs as she observes the next toilets enter the reverse-outhouse. Her booty rumbles in anticipation.<br>\r\n<br>\r\nRick woke up in the infirmary of the amusement park, he had no idea how he had gotten there. He had an awful taste in his mouth and a weird stench in his nose. He looked over and saw beautiful Samantha wearing spandex booty shorts and a tank top. He greeted her with a smile, and she returned with a devious smile of her own. Rick may have forgotten what happened, but Samantha remembered every single second of it. Samantha grabbed Rick's hand, \"Let's go ride some rides!\" She says with malicious intent. As Samantha leads Rick, he stares at he ass in her shorts, excited to see it in the flesh later tonight. The two of them follow a couple of guys into a odd ride that appeared to be a room with a throne on the top. Upon entering the ride, all four people were immediately subjected to an awful stench. Rick and the other men were disgusted, but Samantha was excited, knowing her Goddess must be near. One of the men looked up at the hole in the ceiling and asked aloud what this ride was about. The Goddess hears her new toilets beneath her and sits her booty back on the her throne. Down below, the man jumps back as they unbelievably perfect and huge booty pokes in through the ceiling. \"Is that a real ass?\" Rick yells. \"Why don't you feel it and tell me.\" Samantha says maliciously. Rick reaches up and begins to caress the booty's cheeks. \"It feels so real! But its way to huge to be real.\" Rick says, stupified by how attractive it is. \"No booty is bigger or nicer than mine, right Rick? So it must be fake.\" Rick turns to Samantha and goes to grab her big booty. \"Wait,\" Samantha says, hatching a plan. \"If you want to worship my butt, you have to worship that fake butt first. Close your eyes, then kiss each cheek, then french kiss the inside.\" Samantha demands, knowing that since Rick thinks the booty is just plastic he'll have no problem doing so. As Samantha and the other guys sit down,  the Rick closes his eyes, plants a soft kiss on each of the booty's big warm cheeks. Rick spreads the big booty cheeks, if his eyes were open he's see the shit covered anus ahead of him, Rick plants his lips on the anus and inserts his tongue inside. He instantly tastes the awful flavor of the Goddess' ass, but before he can recoil, the Goddess clamps her booty closed, locking his head within her booty. Rick's tongue flails inside the Goddess' anus, but after a few seconds, the booty unleashes a flood of disgusting, chunky diarrhea straight into Rick's mouth. He screams at the intensely awful flavors invading his mouth. \"Oh toilet, what made you think you could touch my booty?\" The Goddess opens her booty, freeing Rick to fall onto the ride's seat, which then locked all four toilets in place. \"Goddess!\" Samantha yells out \"I brought him back to you!\" The Goddess snickers, this toilet thinks that she has earned favor. \"Oh, thank you toilet. Let me reward you all.\" With that, the Goddess lets out a horrid shart that covers all for toilets in green sludge.</span></div></div>",
            "created":1414199460,
            "id":1877122,
            "title":"continue"
        },
        "1111111111111111111112111111111111111111111111111211111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Rick shakes his head, flinging the sludge off his head into the faces of his fellow toilets. \"You know toilet,\" The Goddess says as she lets out a little shart onto Rick's face. \"You not only touched my booty without my permission, but you placed your filthy lips on it and out your tongue inside it. I think it's clear that you're gonna need some punishment.\" With that the booty begins to rumble and stretch, before unloading all over Rick. The large, dense logs pelt Rick's face. Squishing to his skin and soaking into his pores. Samantha laughs devilishly, \"Yes Goddess, destroy him with your ass!\" The Goddess raises an eyebrow as the loyal toilet orders her around. \"You like what I'm doing here?\" The Goddess asks the young woman. \"Of course!\" Samantha enthusiastically replies. A sly smile creeps across The Goddess' face, \"Tell me, do you think I should cover my pathetic little toilet in a blast of thick, chunky diarrhea?\" The Goddess asks seductively. Samantha's eyes go wide as she shakes her head rapidly \"Yes Goddess! Do that!\" Samantha stares straight into the booty, waiting to see Rick's punishment. Unfortunately for her, and much to her surprise, Samantha is the one who's body becomes drenched. The Goddess pours gallons and gallons of semi-liquid shit flows like a fountain onto poor Samantha. She sits in confusion as the thick, chunky diarrhea splashes into her face. Samantha sputters and spits chunks out.\"Get it through your skull toilet. You are not special. Yes, you brought me this toilet, but you're still nothing more than a toilet for me to unload on.\" With that, the booty sharts, splattering every one of the toilets with a think layer of horrid shit and assaulting the senses with a wave of noxious gas. Rick pleads to the booty to stop unloading on Samantha. \"Torture me instead!\" He pleads, \"Leave her be!\" The Goddess then giggles and lets loose a shart, lasting over sixty seconds in length, directly at Rick's mouth. The booty's release of shit and gas fills Rick's lungs, putting him on the verge of passing out. \"Now Toilet,\" The Goddess says in a motherly tone, \"Why don't I just punish you both?\" The booty then begins to rumble so loudly that people all over the amusement park hear it. It vibrates so fiercely that the entire ride begins to shake. \"But since you seem to believe you can order me around, I think I'll start with you.\" The booty begins to stretch and stretch infront of Rick's eyes. \"Oooh toilet, my booty so backed up!\" The Goddess moans while clutching her taught tummy \"Luckily for you, you get to be here when it's cleared.\" And with that, the booty erupts into a torrent of diarrhea, enough shit was being released from the prodigious booty to fill an entire swimming pool. The diarrhea launched straight at Rick, soaking him in fetid shit, and the other toilets were not spared the booty's wrath as they were hit by the splatter of the torrential shitstorm. All of a sudden, Rick's mind is flooded with the memories of being flooded with the Goddess's loads. \"Samantha, this is all your fault! You knew what was happening! You tricked me!\" Samantha scoffs \"It wasn't exactly hard, it's easy to fool men like you when you have a perfect booty like mine.\" She says with no humility. The Goddess becomes filled with rage, \"A perfect booty? That pathetic thing? Let me show you what a perfect booty is really capable off.\" The Goddess booms as she directs her perfect, vibrating, rumbling booty at her poor toilet. The booty belches out a thick layer of gross, wet, green slime. As the slime leaves her booty, the Goddess feels relief, but nothing compared to the belief she will feel when she finishes demolishing Samantha. Samantha foolishly believes the terrible substance coating her flesh is the worst that will happen. The Goddess strains and grunts as she tries to push out the majestic log she's holding back. Samantha watches in awe as the log crowns out of the booty, its easily twice the size of Samantha herself. the Goddess pushes and pushes, her booty rumbling louder and louder and louder before unloading her incredibly large load down onto Samantha, engulfing her entire body in one sickening slurp. \"I feel sooooo  much better.\" The Goddess jokes, \"Now who's next...\"</span></div></div>",
            "created":1414229100,
            "id":1877256,
            "title":"Continue"
        },
        "11111111111111111111121111111111111111111111111112111111111":{
            "author_id":"zivojivo",
            "author_name":"zivojivo",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"...maybe I'll just do the rest of you all at once!\" The Goddess says cruelly as she smiles evilly. The Goddess reaches into her large cleavage and pulls out a glass vial full of laxative. \"I hope you're ready for this, toilets.\" She giggles as she slurps down the concoction. Almost instantly it takes effect.The Goddess groans as her booty rumbles loudly, and her toilets groan as they watch, knowing that they're about to suffer through the Goddess' loads. The booty begins to vibrate as it rumbles, shaking wildly as it clearly becomes backed up. The toilets can do nothing but watch in fear as the jiggling mass of pure perfection clearly strains to hold back what is essentially going to be hell.  The toilets' mouth open in awe as the booty seems to  continue to stretch to unbelievable sizes. \"Oooh, toilets,\" The Goddess moans as she rubs her tummy, \"I really need to unload. Taking that laxative was a bad idea.\" The Goddess giggles to herself as she reaches back into her ample bosom and pulls out another vial of laxative and chugs it all in one gulp. The booty begins to rumble so fiercely that the toilets fear it's going to explode. And in a way, they're correct, just not in the way they'd think. The booty becomes so completely full with the Goddess' awful shit, that it can barely contain it. Liquid shit begins to slips out of the anus, dripping down onto her toilet's faces. They begin to scream and fight against their bonds. Despite all they've been through up until now, the shit dripping down on them now is a hundred times worse than anything they've experienced. After filling and filling, the Goddess' colon can't hold it back much longer. The booty opens for a brief second, belching out a blast of thick green booty slime. Splattering straight onto her toilets' faces and into their mouths. The two toilets next to Rick force the slime down, screaming as it slowly oozes down their throats. Rick on the other hand, spits out the slime in his mouth, Not wanting anymore of the Goddess' waste inside him. \"How rude of you toilet!\" The Goddess says sounding hurt. \"I give you all a tasty little treat, and you spit it out? I think that deserves a little punishment.\" With that, the Goddess bites her plump lower lip and pushes on her belly, causing her booty to shoot out a shotgun blast of a load straight into their faces. The booty seems to let loose a neverending torrent of sludge and slime. Plowing into their faces with enough force to knock them unconscious, but the incredibly awful stench kept them from passing out. The Goddess laugh sadistically as her load splatters all over her toilets. The toilets wish they could die, everything about this was unbearable. The stench, the flavour, the texture, everything was absolutely horrific. The booty let loose gallons and gallons and gallons of sludge, slime and gas. Before long, the ride was so full of the Goddess' sewage that the toilets were literally up to their ears in sludge and slime. As the shit level rose above the toilets heads, their fastenings released and that toilets frantically waded through the crap. The situation was not at all like swimming in water, not only was this substance thick and sticky, but it was also the worst smelling substance in the universe. After what seemed like hours of submersion (but was probably only a couple minutes) the toilets broke the surfacing and began to greedily suck in gulps of stink infused air. The toilets found themselves face to face, or rather face to booty, with The Goddess' divine backside. The Goddess giggles before letting loose an absolutely acrid shart, cleaning her booty and assaulting the toilet's nostrils. And with that, the Goddess flushes her toilets, sending them straight into the septic tank below.<br>\r\n<br>\r\nOnce the Goddess' ocean of slimy sludge drains into the septic tank, the doors open and a group of four men and two women rush inside. \"I could've swore I heard screaming. I guess I was imagining it...\" One man announces as he looks around the small chamber. \"I guess it's just a ride. So I guess we'll just ride it.\" One of the girls jokes and the group straps themselves into the ride. After a few seconds of inactivity, one man comments on the awful stench, and asks if anyone else smells it. Before anyone has a chance to answer, the Goddess' booty pokes into the ride, causing the group to laugh. \"Is that an ass?!\" A girl yells, fearing it may be the cause of the stench. \"No way!\" Says a man, \"That is way too perfect and big to be real. It's just.... I mean look at it!\" He says, slack jawed in awe. The man's girlfriend looks at the booty with jealousy. \"It's not that great.\" She says with a frown. \"Look how gross and fat it is, it'd be impossible to find pants to cover that mountain of cellulite, also anything that comes out of an ass that big would be awful.\" The group laughs at the comment, only to be silenced by the booty rumbling. \"You might be right toilet, tell me, how awful is this?\" The Goddess booms before shooting a blast of thick, green booty slime straight into the jealous girls mouth. The girls tries to scream, but the gross tasting and disgusting smile slime muffles her cries. After the booty unloads, the rest of the group screams in fear, \"This isn't a ride!\" A boy screams \"It's a toilet!\" Then the booty shoots sludge, splattering the rest of the toilets.</span></div></div>",
            "created":1414357560,
            "id":1877959,
            "title":"continue"
        }
    },
    "info":{
        "author_id":"zivojivo",
        "author_name":"zivojivo",
        "brief_description":"Roleplay Story between Zivojivo and ToiletGoddess",
        "created":1413354360,
        "description":"<td align=\"left\" class=\"norm\">A roleplaying story between Zivojivo and ToiletGoddess</td>",
        "id":2014389,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1414357560,
        "modified":1414357560,
        "pretty_title":"The Student and the Professor"
    }
}