{
    "chapters":{
        "1":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Forest",
                "Castle",
                "Desert",
                "House",
                "Surrounded by battered and beaten fellow guards."
            ],
            "content":"<div class=\"\"><div> <span>I slashed, only to strike the empty air where that … monster had once been. Or maybe it was a demon? Hard to tell. It raised it’s left hand and targeted me, which was simply my cue to dodge. That scorching beam of red shot out of it’s fingertips, exploding into the far wall and melting a small section of stones together. No charcoal was left behind, nothing burst into flames, the marks on the wall weren’t even that noticeable. Hard to believe assassination could be so much simpler when a dark wizard is hired for the job.<br>\r\n<br>\r\nHe didn’t seem to care that his shot missed, the dark cloaked figure slowly made it’s way towards the king’s bedchamber. He had a few more hallways to go through and all of them were lined with more guards, the majority more skilled and better armed than myself. Heck, I couldn’t even afford an enchanted blade like half of my squad wielded. But in light of what I could see first hand I didn’t think any of it would matter. I readied my blade, charged the spell caster from behind, and made my best attempt to cheer under the suffocating silence, but nothing seemed to matter. There was no scream in pain, none of his continuous spells relented, he didn’t even slow down.<br>\r\n<br>\r\nAt this point, you might be wondering why I was fighting alone. Why hadn’t I sounded any alarm, or called for the aid of the entire castle staff? The simple answer is, that I did. It’s protocol, you don’t get to play the hero if you want to succeed. But none of them made a sound. The clattering of steel as my sword swiped across his dagger was absent, the warning claxon made not a sound as I smashed metal onto metal. I screamed at the air, shouting to my companions, to no effect. Not even the thundering explosions of the many spells I had to dodge made their usual clatter.<br>\r\n<br>\r\nAll the more reason to hate magic.<br>\r\n<br>\r\nNext you might be wondering just what I look like. To be honest? I don’t actually remember. Mirrors are hard to come by when you spend most of your time training and the rest standing guard, and this was the last night I would ever have the power of a human body. The monster? This frustrating spell caster wasn’t much to look at either, but I least I remember what I could see. Black. That’s about it, black in a dark room on a moonless night. There weren’t any details to his face, just a blob of fog that seemed to slide past his lips and swirl around his head. I couldn’t see any hair past the pitch black hood over his skull, and the black robes he wore covered every part of his form save the hands. And they looked black too … not black as the extremely tan foreigners from the sun baked regions south of the kingdom, black as in pitch-black, blending perfectly with the night sky.<br>\r\n<br>\r\nThat was probably magic too.<br>\r\n<br>\r\nAnnoyed that stabbing through his lungs had no noticeable effect, I gripped the hilt of my blade steadily and twisted, gouging through what I could only hope was flesh and bone, before dazzling light exploded in my eyes and the floor fell out from under me. I was on my knees, my hands cupping my swollen eyes, tears of pain and frustration mixing with charred flesh and made all the more terrible by my inability to scream. But I wasn’t about to give up, ha! Guess I was just too stubborn to let a simple face melting slow me down. I looked across the room to see the black garbed wizard walk calmly through the halls with my sword jutting out between his shoulder blades.<br>\r\n<br>\r\nI smiled when I saw my captain, fallowed closely by four other well armed and well armored knights, charge the beast head on. I guess they must have seen the spell casting, or noticed my battle by now. One heavily enchanted blade raised high and swung down, surely with enough force to cleave a man in two. But the monster blurred and dodged with incredible speed, zipping around and through the other guards as if they were children. Another swing, missed entirely. I saw Charles shouting mutely as he stabbed forward, but his blade only seemed to catch clothing … before it ran through the man next to him.<br>\r\n<br>\r\nIt’s weird, utterly weird, to hear silence when you know a man in screaming at the top of his lungs. If a healer got here in time that wound would be nothing, but otherwise … my fellow guard would not even be allowed the luxury of a dieing breath, any last words he make would fall on deaf ears.<br>\r\n<br>\r\nI hate magic.<br>\r\n<br>\r\nWhat was even more odd, the monster never moved that fast when I was fighting him. Why not? Undeterred by such constant failure against this foe, I rushed forward with my bare hands, I would give my life to stop any attack against the king. The monster turned at the last second, raised a glowing hand aimed towards my chest, just before my world exploded into pain. I felt I was stretched and squeezed, torn from all sides with daggers slicing through my skin and nose from under my flesh. I passed out.<br>\r\n<br>\r\nEven though it didn’t kill me, I had indeed given my life for the king. As I soon found out waking up in a …</span></div></div>",
            "created":1311397200,
            "id":1153008,
            "title":"Last Day"
        },
        "11":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "It was a horse and rider.",
                "It was a horse and carrage.",
                "It was a cat.",
                "It was a wolf.",
                "It was a young girl."
            ],
            "content":"<div class=\"\"><div> <span>Forest. I thought it was a forest at least, that’s what it usually means when there are lots and lots of trees all over the place. I felt odd at first, because they seemed much bigger than trees were supposed to be. Distorted or something. But stupid me, I had the silliest idea that was only because I was laying on my back, that the trees would look normal once I sat up. Nope. I twitched my whiskers as I pondered the matter. The only place in the world with trees that big was Stranothlas, in the elven territories. If one were to include other worlds, this could have been Felarya.<br>\r\n<br>\r\nI shuddered at that thought, my tail curled around my fuzz covered chest in fear. The portals to that ghastly place were long sense closed off by a legendary band of heroes. But any mage with teleportation magics and enough power could conceivably send people there. As a punishment, or as a combat tactic it was even practical. What could be a more frightening spell than sending someone to the second most dangerous place imaginable? Well, Ok there were probably worse spells. I thought I was probably lucky I wasn’t transformed into a piece of woman’s undergarments, or a flower, or a toadstool.<br>\r\n<br>\r\nAnd whatever all I had to face, I was at least still alive? Right? This place didn’t resemble heaven in the slightest, and none of the rings of hell were this pleasant. Unless someone happened to do some remodeling since the last person escaped to tell everyone else what it was like. I could move my arms, I could stand up just fine. My feet felt awkward and my legs were heavy, but I could deal with such minor problems. I was filled with both optimism and curiosity when my slow witted mind finally noticed I was staring at a patch of grass taller than I was. Either it wasn’t just the trees that were so huge, or … heh, I forgot what I was thinking there.<br>\r\n<br>\r\nToo busy noticing I had a tail, a long and stringy one. Too confused to be horrified (not to say the fear wasn’t there) I stepped back to try to look at everything. I saw my nose, a triangular shaped pink thing at the end of my face. I saw my whiskers, long stringy, bouncy little hairs that jutted out the side of my upper jaw. I held shaky, panicky arms up over my head to feel the hair … I wasn’t bald, far from it, but too busy poking and prodding my newfound ears to worry about fuzziness.<br>\r\n<br>\r\nThose things were huge! Huge I tell you! They felt more like sheets of paper than ears, frankly, they were just so thin and flat. And soft. And warm, very warm. By now my breath was rapid, my chest and arms were rigid, stiff … I had faced a good many terrifying things in my day, I wasn’t about to let my own body scare the wits out of me. Even if it wasn’t quite mine. There wasn’t a mirror laying around, story of my life, but the sun was at just the right angle for me to get a look at my shadow. I could see the basic shape, my silhouette portrayed against the ground.<br>\r\n<br>\r\n“I will not scream at the sight of my shadow” I told myself as I examined what had been done. My body, instead of whatever it used to look like, now sported wide hips with short hind legs. A long stringy tail curling around and waving through the air behind me. Flexible ears at the top of my head, a pointed, angular face as opposed the flat face I should have had. My shoulders were thin, but that matched my neck. My arms were skinny, but my paws were about as large as my normal hands would be. Comparatively.<br>\r\n<br>\r\n“I will not scream at the sight of my shadow” I had to remind myself, I simply was not going to scream. I was trained too well for that. I’ve taken broken bones in stride, surely this little spell wasn’t going to mess with me. I was a mouse.<br>\r\n<br>\r\nI tiny one, unless everything around me was just disproportionately huge. And … naked. Apparently. I didn’t notice that part for a while thanks to all this fur, but then unless I could find a teeny tiny merchant it wasn’t going to matter. Er, even if I could it still wasn’t going to matter. Did I have any gold on me? Nope. No pockets, no bags, no place to hold any coin, so I certainly didn’t have any. That wasn’t much different from my usual state of affairs.<br>\r\n<br>\r\nWhat was different was the fact I had neither armor nor sword. Even if mine were cheap, mass produced, and utterly laughable compared to the more successful fighters and bounty hunters, I never went anywhere without one. Man, it would be hard to try and carry a sword fifty times bigger than I was …<br>\r\n<br>\r\n“But can I still speak?” I asked aloud, effectively answering my own question. I didn’t think my voice sounded squeaky or mouse-like, rather normal actually. But that could just be a part of the spell, a perception filter or some mind trick that lets me understand other mice, at the cost of rendering me unintelligible to humans. But even if that were the case, it would still be better having to speak with actual squeaks and chatters. And if I could speak clear and understandable Uema …<br>\r\n<br>\r\n“Ok, so first things first, when I meet anyone I will ask for directions.” I told myself. Mostly just to hear my own voice and take comfort. I sounded like myself. “If I am the proper size for a mouse, then I can assume these trees are their normal height. That’s good, I guess … but I still want to know what forest this is.”<br>\r\n<br>\r\nI took a single step … and fell flat on my face. Chin really.<br>\r\n<br>\r\n“Omph!” I curled onto one side, cupped my furless little mouse paws over my nose, and lamented on the very idea of failure to walk. It did not take long for the pain to die down, and upon standing back to my feet I stubbornly re-attempted that step. I discovered stubbornness is not a virtue when I fell forward for the second time, but now I was ready. I braced myself with my arms … front paws … and landed softly on four legs.<br>\r\n<br>\r\nQuite suddenly this body felt natural, easy and accommodating rather than strange and alien. Curious, I started walking without bothering to get up. I slinked and scurried through the grass, my tail held up off the ground as it trailed soundlessly behind me. I wasn’t able to see over the grass, and I had no idea where I was going, but I felt like I was making good speed. Walking like this was, in a word, easy. I just didn’t like how much it made me feel like a mouse, crawling on all fours with your face just millimeters off the ground just isn’t … human.<br>\r\n<br>\r\nOnce I came to a dirt covered clearing, when I could see the sky past an opening in the trees and green grass no longer closed in around me, I stood up. That part was natural. Turns out mice can stand up easily and readily, their front paws really did double as hands when they needed. My tail propped up against the ground, my spine bent into a relaxed slump. But I didn’t want to just stand there, I had to be able to walk on two legs as well.<br>\r\n<br>\r\nCould mice even do that? Seems like they should be able to. But as soon as I stepped forward, flailing my arms and tail to keep from falling again, I realized it was much harder than it should be. My legs just weren’t shaped for walking as I normally would. The hips were too wide, the legs were too short and bend all the wrong directions, my feet looked huge compared to the rest of me. Not to mention there was all this fatty, loose skin that just made everything feel awkward.<br>\r\n<br>\r\nSighing to myself, I felt my whiskers widen and my right ear perk up, then swivel around at some sound in the distance. I couldn’t tell what it was, and at the moment I was simply too distracted to care. I had to find a way to walk upright, that was my primary goal for the moment. I could even distinguish myself from a normal mouse if I really got the hang of it. That sound seemed to be getting closer, and I wondered with an idle abandon just what it could be.<br>\r\n<br>\r\nI took two steps, making wide and exaggerated movements so that it felt more like wobbling, but I stayed up. My lips curled into a smile, stretching my whiskers at an odd angle in the process.<br>\r\n<br>\r\n“There we go, just need practice.” until the sound that had been mildly annoying became a pressing concern. As I turned to the right and a shadow fell over me, I could feel the unrelenting fear of a mouse surround my consciousness. My large, black eyes looked up in awe and horror. It was in that moment I figured out why this ground was clear, it was a road. A dirt road, and I had been standing right in the middle.<br>\r\n<br>\r\nWith this little fact sinking in, I made out the details of what had snuck up on me … I was determined not to scream, so very determined, despite the terror I felt …<br>\r\n<br>\r\nI squeaked.</span></div></div>",
            "created":1311483600,
            "id":1153876,
            "title":"Forest"
        },
        "111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Rush forward and grab the tail.",
                "Stay on the road and wait for another traveler.",
                "Slow down, stop worrying, and fallow the road."
            ],
            "content":"<div class=\"\"><div> <span>STOMP!<br>\r\n<br>\r\nA horse’s hoof slammed into the ground just inches from my face. I felt my tail go stiff with fear, my whiskers spread out, the fur all across my back stood on end. I was cowardly for but a moment, believing it was the end as dirt was splashed across my chest and legs. But then it lifted up … and up … and up. And the horse stepped over me, stomping noisily and dangerously down that same unpaved road.<br>\r\n<br>\r\nI rushed back towards the grass before facing a similar encounter with it’s hind legs, and no I didn’t care about staying upright during my frantic fleeing. Four legs just made rushing to safety that much faster.<br>\r\n<br>\r\nSTOMP! The tan furred horse just kept walking. I looked up to see it’s black tail flicking the air to deter flies, I could see it’s brown leather saddle, I could see … it’s rider! Now was my chance!<br>\r\n<br>\r\n“H-Hey! Heeello up there!” I called out from the thin but tall grass as the pair passed by. They didn’t respond, but it’s not like I should expect him too. Er, him? Yeah that rider looked human. The horse was clearly male, but from my angle that was a detail I would not have preferred to focus on. I crawled … walked? Ran? Yeah, lets go with ran. It’s so hard to tell with this new body.<br>\r\n<br>\r\nI ran after them squeaking and hollering, but the constant stomping and clattering of a horse’s four hooves proved too much noise for a mouse to overcome. I started leaping into the air, waving my front paws around, screaming at the top of my lungs, nothing seemed to work. The fact I could barely hear myself over that horse probably had something to do with it.<br>\r\n<br>\r\nAnd by the gods, that horse was fast! Barely even trotting, I was exhausting myself trying to keep up with it while simultaneously attempting to draw attention. Made worse by the fact I was failing at both. Something had to give, so I stayed my breath and silently raced after the two. I’d learned long ago that humans are silent fighters, when it comes to matters of life and death we instinctively avoid speaking. The logic is that one should not waste breath when their life is in danger, so all air, all energy is instead focused on the task at hand.<br>\r\n<br>\r\nI wasn’t sure if mice had the same instinct, probably did considering they were almost always quiet, but it was a great relief to my lungs when I stopped shouting. My tiny little mouse feet slapped the road as I sped forward, my head was so low I could feel my whiskers tickling through the loose dirt. But there was no way I could keep up with even a slow horse indefinitely. What if I stopped trying?<br>\r\n<br>\r\nI was on a well used road, it’s certainly plausible to wait for the next traveler to come along. Hopefully either someone on foot, or at least paying more attention to the … “wildlife”<br>\r\n<br>\r\nThen of course, I could just fallow the road to wherever this man is going. What if it leads to a city? Or some small town surrounded by farmland? If I could find a city it would be easy to figure out where that spell-caster sent me. But then, this traveler was on a horse. So what if his destination was some distance away? If the nearest city was days away by horse, it might take me weeks, or even months to reach it on my own. And that is under the assumption I survive the wildlife. Woods can be dangerous enough at night when your six feet tall wielding a longsword. But two inches tall, sporting a tail, and unarmed?<br>\r\n<br>\r\nWolves alone would be impossible to fight. And as a mouse I’d be at risk for other things like cats … or owls … or … snakes maybe. By the gods, there are a lot of animals that eat mice. Was I really willing to risk a long, arduous journey through unknown territory with such a curse?<br>\r\n<br>\r\nMy legs started to grow tired, but I could muscle through for a while longer. If I could manage the jump, I might be able to catch a ride with this fellow. Doing so might even draw his attention. But was it worth the effort? Or the risk? If I got stepped on there would be no survival.<br>\r\n<br>\r\nI looked up to see the horse flicking it’s tail back and forwarth, then drop down … decisions. Decisions.</span></div></div>",
            "created":1311483600,
            "id":1154004,
            "title":"It was a horse and rider."
        },
        "1111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I made it to the top.",
                "I lost my grip and fell.",
                "The horse flicked it's tail, sending me flying."
            ],
            "content":"<div class=\"\"><div> <span>Run! I needed to speed up if I wanted to make the jump. This was more than just keeping up, I had to run much faster than the horse’s slow trot so as to overtake it. Thank whatever god may be listening that it was close enough, and slow enough, for me to accomplish this with a short burst. After I got on and started to ride would be much less tiresome than all this running.<br>\r\n<br>\r\nMy lungs started to burn once more, I was running with such ferocity I could hear the pitter-patter of my feet against the ground even over that horrid clomping noise of the stallion. I could even hear the wind in my ears and feel it across my face.<br>\r\n<br>\r\nRun … LEAP! I coiled my hind legs at the last possible second, kicked the ground with intense force, and held my arms high above my head and in front of my chest as I sailed through the air at two feet off the ground. I’ll say one thing for this new mouse body, it could jump! Inches away from grabbing those long, stringy hairs of the horse’s tail, it swung to the side and flew high above my head. My arms grabbed nothing, I panicked.<br>\r\n<br>\r\nTwisting around in midair, I tried to grab it a second time around, but such miniscule arms could not possibly close that distance. I fell, landed hard on my back, and curled up in both pain and preparation. The momentum was enough to carry me forward after I hit dirt, so rolling was preferable to flailing.<br>\r\n<br>\r\nSMASH! The horse hadn’t even slowed down, the back of it’s hoof swung backward ever so slightly as it was walking. The hard hoof seemed to come out of nowhere, pain simply exploded into the back of my skull, fallowed closely by my nose, my chest, my spine, and my tail as I ricocheted off. The whiplash from switching directions so quickly and smashing into the ground unprepared wasn’t fun either.<br>\r\n<br>\r\nI took a leisurely two seconds to cradle my aching skull. Took another lengthy second to make sure everything was still attached and no broken bones required a splint. Three full seconds, much too long in my opinion, to find the still trotting horse and orient in on it, then finally, finally ran after it to make another leap.<br>\r\n<br>\r\nThis time running was a heck of a lot harder, my legs seemed about ready to give way at any moment. It was hard to focus, hard to keep my eyes open, with such an annoying headache. My spine wasn’t handling the strain of all the flexing, bending, and bouncing that goes on in a mouse’s run as well as it had before. My body was constantly screaming at me to slow down, or stop. It said to pay attention to those wounds and make absolutely sure this sort of damage doesn’t repeat itself.<br>\r\n<br>\r\nI was never very good at listening to things like that.<br>\r\n<br>\r\nI neared the tail again, watched it twitch up high out of my reach to swat a fly, then fall back down … swinging. Dangling. I leapt! My paws outstret- … paws? No, hands! Think of them as hands moron. With my hands outstretched I gripped hair, I felt my full weight slump down as my arms now took the full force of that evil, evil gravity. My momentum carried me forward, the tail yielded, and it was like swinging on a vine.<br>\r\n<br>\r\nI saw legs thicker than trees rushing past on either side of me, I saw the fat, round belly over my head, that light tan colored fur above and around me. Then the tail swung backwards, the warmth of such a large body was noticeably absent. Time seemed to slow as there was no longer constant movement, I saw the mildly unpleasant view of … yeah … this horse didn’t have any more cloths than I did. Not nearly as disgusting when your human sized than it is when your mouse sized. Any foul smelling orifice I can fit inside isn’t something I want to think about.<br>\r\n<br>\r\nAnd then it was past. The tail had reached the end of it’s arch and started to swing back down between the two legs. Assured in the fact I had a firm grip, and a decent feel for the swinging tail, I began to climb. It was like rope climbing, but there was a lot more ropes than usual. And all of them were much thinner and stronger than any rope I’ve ever encountered.<br>\r\n<br>\r\nMy bruises felt as if now was the time to remind me of their existence ...<br>\r\n<br>\r\nand …</span></div></div>",
            "created":1311483600,
            "id":1154121,
            "title":"Rush forward and grab the tail."
        },
        "11111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I fell asleep.",
                "Another traveler crossed our paths."
            ],
            "content":"<div class=\"\"><div> <span>I had to make it to the top, swinging back and forwarth on this “ride” was faster than running, but I knew I’d tire eventually. And there was always that nagging little worry, what if another fly came by and the horse had to flick it’s tail? I started to climb.<br>\r\n<br>\r\nOne arm gripped with all the strength I could muster and tightened to lift me higher, while the other arm spread out as far above my head as it could reach. Then that hand secured a nice firm grip, while the other hand let go and reached up. I was making progress. But after five times, roughly a quarter of the way up, they started to buckle under the strain.<br>\r\n<br>\r\nMy head still wasn’t letting me forget the blunt force trauma I took, and my spine seemed to be competing with the rest of my body to see what could hurt the most. But I couldn’t rest now, so I wasn’t going to. Gritting my teeth, I repeated the process again. And again. And again.<br>\r\n<br>\r\n“Ergn!” I grunted, a little over halfway up the strain was unbearable. The pain spread from my arms to my fingertips, my accent slowed as it became harder and harder to find that next grip. At least the tail wasn’t swinging anymore. I was too far up and too secure to sway back and forwarth. My arms started to shake, I was loosing my grip.<br>\r\n<br>\r\n“NO!” I shouted with determination filling my eyes. My whiskers grew stiff, but I held them tight against my muzzle so they wouldn’t get in the way. No amount of pain was going to slow me down, so long as I had arms I was darn well going to use them.<br>\r\n<br>\r\nI stretched, reached, gripped, and was rewarded with another inch towards my goal. My legs dangling bellow me touched lightly against the tough, yielding flesh of the equine’s rump. The flesh twitched, and that was the moment I realized my mistake. The tail twitched immediately after.<br>\r\n<br>\r\nWoosh! The world rocketed to one side, SLAM!<br>\r\n<br>\r\nI felt my shoulder crash into the horse’s side. Then I felt the tail swinging back. I never let go, certainly wasn’t that stupid, but by the gods this pain on top of my fast growing exhaustion was horrible! My breathing instantly went fast and shallow, my tail waved around franticly as if it were trying to grip something. Out of reflex I could feel my feet grip the horse’s tail just as tightly as my hands.<br>\r\n<br>\r\nWait … my feet? On a moment of reflection I could grip almost as well with my feet as I could with my hands. Oh, yeah. As a mouse there wasn’t a whole lot of distinction between the two. Using both feet, I suddenly had three braces and four firm grips while moving and climbing. This was much, much easier.<br>\r\n<br>\r\nThen I slipped. Well, my left foot did. They could grip better than human feet (a lot better) but they weren’t quite a match for my front paws. Front hands. Hands! Goddammit, think of them as hands!<br>\r\n<br>\r\nAnother two inches up the tail. Another three inches. I was almost there, much to the relief of every aching joint and worn out muscle I had. I detected an utterly horrible smell as I passed directly between the horse’s butt cheeks, but ignored it as best I could while climbing over. I could have held my breath, but momentary displeasure was well worth the price of a steady air supply.<br>\r\n<br>\r\nAnd then I was over. Sitting on the very back of a horse as it trotted lazily through a serene patch of woods. I stared up at the brown, leather saddle of the rider. I saw the strange, patchwork clothing of his pants and shirt, covered by a well worn jacket and a large straw hat. I could not tell what style of clothing this was, but his skin was white and sun baked. A farmer perhaps? Or just a farmhand with some experience.<br>\r\n<br>\r\nThe entire ride jerked and bounced uncontrollably. I gripped the much smaller hairs up here for balance, but as I scurried over towards the saddle I discovered I had no need to find a firm grip. On four legs, this mouse body had wonderful balance. I could easily compensate for the constant motion.<br>\r\n<br>\r\nCurling up underneath the back, squeezing myself in a small crack between the horse’s back and the saddle, I finally began to relax and enjoy the landscape.</span></div></div>",
            "created":1311483600,
            "id":1154194,
            "title":"I made it to the top."
        },
        "111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I woke up in a small, rural town.",
                "I woke up in a stable, surrounded by horses."
            ],
            "content":"<div class=\"\"><div> <span>As a mouse, hiding inside this slim little crack made me feel safe and secure. Warmth and fuzz surrounded me, there was constant, unrelenting movement bellow my feet. The smell wasn’t anything to relish over, too much sweat and dirt and … horse. Sweaty horse. But having spent so much time around sweaty, smelly humans swinging slabs of metal at each other, I felt I could handle worse. <br>\r\n<br>\r\nI yawned, I stretched my arms and my back, I let my tail curl up around my feet. I allowed all my aches and pains to wash over me, as I closed my eyes and rested. My whiskers twitched, my little pink mouse nose fallowing the example. I even went so far as to relax my head, laying down completely.<br>\r\n<br>\r\nThis was a good place to sleep. A very good place.<br>\r\n<br>\r\nI propped one eye open to survey the landscape, taking note of those tall mountains in the distance, the type of trees surrounding this area, how far down the road I could see with no sign of a building or farmland. It wasn’t very far, much to my disappointment. Too many trees, too many turns, even if most were minor.<br>\r\n<br>\r\nI closed my eye once more and thought … just thought. Yesterday morning I woke up, got dressed, ate breakfast, and reported for guard duty. It was a simple job where, for the most part, you just stand there and stay vigilant. If you weren’t a very good guard it could quickly turn boring, but the very moment that changed you suddenly wished you had remained alert.<br>\r\n<br>\r\nI was trained to fight against mystical beasts, massive dragons, armed and armored soldiers from neighboring lands. Before I ever went anywhere near the castle I had gained experience guarding small provinces from roaming thieves, and lived long enough to note the very distinct difference in fighting style they employed.<br>\r\n<br>\r\nI had been trained to recognize magic, to avoid offensive spells, and above all, to never … ever … piss off a powerful wizard if I had some other option. Learning that lesson taught me to hate magic, and I don’t think that’s ever left me.<br>\r\n<br>\r\nBut now? Now I wake up, in the middle of the day, naked, without a weapon, and in a body no longer my own. I was some distance from home, no matter where I happened to be. The castle guard and king Lostral probably thought I was dead. For all I knew, the king himself could be turned into a mouse! The same fate could have befallen the entire guard.<br>\r\n<br>\r\nOr, you know … they could all be dead. I am not sure which I would prefer, the king, and all of my friends being degraded in such a manner? Left to wonder the castle walls and fall prey to much more terrifying creatures, and much worse fates than a spell. Or if they were all killed outright, quickly and silently. <br>\r\n<br>\r\nHmm, no … I would rather they live. No matter how horrible life may be at times, it is always better than not having one. That’s the attitude I needed to have, and that’s the attitude I held onto as my mind drifted into slumber. Fallowed very closely by …<br>\r\n<br>\r\n“God I hate magic”<br>\r\n<br>\r\nAnd I meant every word.</span></div></div>",
            "created":1311570000,
            "id":1154271,
            "title":"I fell asleep."
        },
        "1111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I asked the rider to stop.",
                "I tried to climb down."
            ],
            "content":"<div class=\"\"><div> <span>I awoke to the smell of apple pie, the clop-clopping of a horse on crude pavement, and the empty gurgling of my own stomach begging for food. I yawned. I stretched. I opened my eyes in wonder at just how many humans there were, and how many houses seemed to spring out of nowhere. I was still hidden tightly under that crevice between the horse and the saddle, padded from all sides.<br>\r\n<br>\r\nThe pain in my head and shoulders were gone, but the base of my spine still seemed sore. Oh well. Turning my head from left to right, I scanned what all I could see from behind the horse’s rump. A blue sky, stringy clouds, mountains that seemed to fade into the distance. Crude but well maintained wooded houses decorated in a simple tan paint that chipped off in several areas to reveal the aged wood underneath. The buildings were dry instead of damp, considering how much wood there was that meant this was midlands. I wasn’t anywhere near the water, and rain or fog weren’t persistent.<br>\r\n<br>\r\nIt was some time between spring and summer, so I could count on good weather overall around here. The streets looked clean, none of the villagers seemed to be starving or suffering. I could not see any shops, nor a castle, nor any distinguishing feature, but that might have simply been my angle. I yawned for the second time, then crawled out just enough to look around some more.<br>\r\n<br>\r\nNo trees anywhere nearby, but as I could not see over any of the buildings that was to be expected. My whiskers tasted the air as I took in the scent of … of …<br>\r\n<br>\r\n“Gurgle! Earch!” My stomach quickly reminded me that I hadn’t eaten in over a day, depending on how long I had been out between the spell, the teleportation, and falling asleep. I could smell pie in the air, I could smell soups and pastas, I could smell a meaty, brothy stew somewhere in the area. Was everyone eating dinner right now? Or was there some sort of celebration going on?<br>\r\n<br>\r\nEither way, if I could find some leftovers, some fresh scraps laying around, then this would be an incredible stroke of luck. I didn’t have any cash so paying for a meal was out of the question. Stealing one? No. Just … just no. No matter what my form I refused to even consider degrading myself like that. The begger and the poor street urchin living off of scraps and refuse had a hundred times more honor than the wealthiest thief in the most luxurious house.<br>\r\n<br>\r\nBut by the gods, that food smelled delicious. I walked over to the edge of the horse’s rump, looked down over the edge as best I could, then balked at the prospect of getting down. I could try jumping? No … dumb idea. Climbing down the tail again, and simply leaping off when I was close enough to the ground was an option. Or, wait … considering how much closer I was to the rider, I could just get his attention and ask him to stop so I could get off.<br>\r\n<br>\r\nThat would not seem like an unreasonable demand coming from a mouse, right? I just had to make sure I was polite enough.<br>\r\n<br>\r\nDecisions … decisions.</span></div></div>",
            "created":1311570000,
            "id":1154335,
            "title":"I woke up in a small, rural town."
        },
        "11111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "With a blank stare.",
                "By trying to shake me off."
            ],
            "content":"<div class=\"\"><div> <span>I looked across the large saddle, reached my paws up to grip the nearest end, then hoisted myself over. The horse was still moving, the platform I had to work with was moving slowly, predictably, and constantly … and by the gods, could this mouse body handle it. The level of balance I had was just incredible, on four legs I was as stable here as if I had been on solid ground.<br>\r\n<br>\r\nI took a moment to look around from this new vantage point, though the buttocks and back of the yet unknown rider. I sighed to myself, stretched my tail, then felt the instinctive desire to wash up before speaking to anyone. How did mice wash? No. No time to figure it out now.<br>\r\n<br>\r\n“H-hello good sir! May you be so kind as to stop the horse?” I called out in a clear, polite voice. It wasn’t much of a demand, and it didn’t derive any reaction out of the man. “I would very much like to depart.” I added as a final measure, hoping he would not dismiss me as some random voice off the nearby streets.<br>\r\n<br>\r\nNothing. He didn’t even notice me. What if I could only speak in squeaks, and no matter how loud or clear I sounded to myself I sounded like a mouse to everyone else? If that was the case there would be nothing I could do, but … what if he simply didn’t hear me? Mice aren’t known for being very loud, it makes sense a mouse’s shouting would not go very far. I sighed, climbed forward ever so carefully, then gripped the man’s jacket.<br>\r\n<br>\r\nIf I was talking in squeaks this whole ordeal was an effort in futility. But if I just wasn’t loud enough then I could solve the problem by climbing up to his ear. Even if he doesn’t hear me, I am pretty darned sure he’d feel me and wonder how in the world a mouse managed to get way up there. I started to climb, very reminiscent of my accent up the horse’s tail.<br>\r\n<br>\r\nThe leather was stiff, I found that my fingered struggled to get a grip against the smooth, unyielding surface. But there were seams along the side, and along the man’s extended elbow that I could grip. This was one moment where it really sunk in just how small my fingers were. It was an uneventful climb up towards the armpit, easy clambering over the man’s shoulder, and just astounding when I saw the world from way up high.<br>\r\n<br>\r\nEr …<br>\r\n<br>\r\nWay up … normal. On top of a horse wasn’t very high compared to a castle roof, but from my current size this was just incredible. Looking away from the spectacle I thought about what I could say, what should I say. Well, no matter what manages to come out of my mouth, the reaction any random villager would give upon having a mouse talk to them … or squeak at them … is surprise. And if the man jumps around, or flails, or tries to shake me off, I am sure even my newfound balancing skills would be hard pressed.<br>\r\n<br>\r\nI reached out, slowly, and ever so quietly, to grab the shaggy blond hair for a nice firm grip. I leaned close, my head near the man’s ear, and spoke as clearly as I could.<br>\r\n<br>\r\n“Excuse me good sir, would you be so kind as to help me down?” to which he responded …</span></div></div>",
            "created":1311570000,
            "id":1154347,
            "title":"I asked the rider to stop."
        },
        "111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Fought my way out.",
                "Fled to the nearest cover."
            ],
            "content":"<div class=\"\"><div> <span>The man turned sharply, as if deeply startled by my presence. But upon seeing my grey fur, my thin, whispy little whiskers, my long stringy tail, and the fact I was small enough to sit on his shoulder … he was too stunned to form a proper reaction of any sort.<br>\r\n<br>\r\n“Sir?” I repeated calmly. My hands … paws … no wait, hands! Hands! My hands still gripped a section of his hair just in case, but as his head turned the strand was pulled taunt. “I do not mean to intrude, but could very much use your assistance.”<br>\r\n<br>\r\n“Th- … th-th … Y-y-you’re a …” the man stammered. Barely able to forge a sentence without butchering it with his shaky nerves. At least he could understand me. I felt the need to reassure him.<br>\r\n<br>\r\n“I deeply apologize for this, but I am not having a most favorable day myself. Simply slow your horse so that I may depart and I will trouble you no longer.”<br>\r\n<br>\r\n“M-m- … m-mouse … y-you’re a …” he was getting better.<br>\r\n<br>\r\n“Indeed I am, though not of my own choosing. I would have much rather been a dragon, or an amorak, or perhaps an ogre. But I do apologize for my frightening appearance.” not one word of that statement was a lie. If I were an ogre I’d at least draw attention, and be able to fight. If I were a dragon, disregarding the awesome factor completely, I would have had wings to make finding my way and my king so much easier. And as a mouse I must have been frightening. The sight of my face alone had left this man speechless.<br>\r\n<br>\r\n“Y-yeah. Alright, I’ll bite. Yeah. There’s some magic going on here.”<br>\r\n<br>\r\n“The answer to half of every impossible question. The other half can be answered with ‘A wizard did it’ … by the gods I hate magic.” I responded.<br>\r\n<br>\r\n“Yes. Erm, yes of course.” he seemed nervous all of a sudden. His eyes never left me as he stopped his horse in the middle of the road. I could see sweat forming up in little beads across his eyebrow. That was curious, but the man cupped his hands around me … paused as if afraid of retaliation … then hopped off his saddle and placed me on the nearby sidewalk in haste.<br>\r\n<br>\r\nHis arms shakily withdrew, he paused but a moment to smile nervously towards a passing villager, then leapt onto the saddle. At his insistent direction, that horse was racing down the street long before the shaken traveler had finished seating himself. He wasn’t frightened enough to flick me away on first sighting … or maybe he was too afraid to do anything but fallow orders. Why?<br>\r\n<br>\r\nWell I’ve had some experience with magic and magic users in my time. This most recent curse should be a testament to how much inconvenience the right spell can cause. And the most powerful wizards or sorcerers of all were always the old ones who spoke softly and politely while trying to look as frail and humble as possible. Or insane, as the great Merlin is so very good at fooling others into thinking him a buffoon.<br>\r\n<br>\r\nSo, with that in mind, what would one think of a spellcaster who traveled the world as an inconspicuous mouse? I almost burst into a fit of laughter. The poor man must have thought I were the most powerful magic user this side of the ocean. Perhaps I could bluff other people in such a fashion, if reluctant acceptance and compliance is the usual reaction then figuring out where I am and where to go should be easy.<br>\r\n<br>\r\nBut then, if the traveler hadn’t been so frightened as to run off in such a manor, I could have asked for directions as well. Peering down the street past the milling crowds, I saw no trace of him nor his ride. The smells of delicious, fresh food wafting down and around me drew my attention to more pressing … Step!<br>\r\n<br>\r\n“SQUEAK!”<br>\r\n<br>\r\nI felt something impossibly heavy crunching down my tail and let out a loud squeak in pain, but any noise I made was instantly drowned out by the ear shattering harpy screech from somewhere high above me. The weight flexed for a moment, grinding my tail into the pavement for good measure before kicking off. My spine arched, my hands reached for the base of my tail to try and stave off that dull ache, but that was the only comfort I would indulge myself while under attack.<br>\r\n<br>\r\nI snarled. I curled my little fingers into tiny little mouse fists. I leapt back, noting the damage to my tail was painful but not extensive. I saw small flecks of blood surrounded by a footprint where my tail had just been<br>\r\n<br>\r\n…<br>\r\n<br>\r\nAnd then I looked up to see the foot.<br>\r\n<br>\r\nDuh! I almost slapped myself for such stupidity. How had I missed the danger of standing in the middle of a sidewalk as this size?<br>\r\n<br>\r\n“No harm d- …” I started to reassure my ‘assailant’ before hearing what was probably the most surprising sentence I had ever encountered.<br>\r\n<br>\r\n“IT’S ANOTHER ONE! EVERYBODY, HELP! THE RATS HAVE STARTED ANOTHER WAVE!” she shouted in that shrill, shrieking sound that seemed to pound on my eardrums until I was inclined to beg for eardrums.<br>\r\n<br>\r\n“ANOTHER ONE? Wait, why is there only one?” a man observing from a safe distance. He was not screaming as the woman who’d stepped on me, but his voice still thundered, rattling my bones with every syllable.<br>\r\n<br>\r\n“It must be some super soldier, I heard their allies to the east guard the necronomicon.” yet another speculated. A small crowd formed completely of the curious grew whilst the fearful fled for a mix of help and shelter. <br>\r\n<br>\r\n“HA! So they wish to fight darkly eh?” a proud looking man with a squat face and grizzly beard proclaimed while reaching for a weapon. “Such is the manor of cowardly rodents. I shall dispel any monstrosities they send my way! Be it through faith, or through blade!”<br>\r\n<br>\r\nThat was the moment I had to dodge. No time to think, no time to react, and certainly no time to try and reflect on all of this new information. A heavy sword, it’s blade thicker than I was tall, plummeted towards me. I shot to the left, held a paw up to protect my eyes and whiskers from a shower of sparks as metal ground on concrete, then assumed a defensive, agile fighting stance.<br>\r\n<br>\r\nLooking past the first attacker I could see a row of uniformed and armored city guards marching towards the crowd. The metal of their spears gleamed in the midday sunshine. <br>\r\n<br>\r\nThere was little chance of fighting my way out of this. Well rested, well armed, and in human form I could manage such a challenge with only minor injuries. As a mouse? Unarmed? In a city that could very well have other, hidden defenses, or larger reserve forces waiting for this first wave to fall? This was an impossible fight.<br>\r\n<br>\r\nBut then, so was fleeing. The crowd surrounding me, the road with now halted traffic at my back, the buildings with nothing but solid stone and wood to hide in until I could run the full distance to an alleyway. If any of this crowd decided to simply stomp at random as I rushed through, one lucky shot would cripple me well enough to make the fallowing, finishing blow a simple matter of repeating that first hit. Escape, or hiding was almost as impossible as fighting.<br>\r\n<br>\r\nIf they were all calmer I could just try talking, explain what’s going on and ask what they have mistaken me for. But I can’t do that if I have to dodge spears and swords and feet. No, never mind, it’s too good of an easy card if it works, I’ll try to talk my way out no matter if I try to fight or run. The problem was deciding which course of action was the least impossible.<br>\r\n<br>\r\nBy the gods, I hated magic.</span></div></div>",
            "created":1311742800,
            "id":1155718,
            "title":"With a blank stare."
        },
        "1111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Rush forward, get ahold of the paladin's beard.",
                "Flee to an alleyway."
            ],
            "content":"<div class=\"\"><div> <span>I could never tell if it was fear or pride that made me decide to stand my ground. Escape looked impossible, but bold defiance seemed more natural for a long time guard. Besides, I didn’t have to win. Just survive long enough to make them stop fighting. Defense. I could handle defensive fighting.<br>\r\n<br>\r\n“Please, sir, you are making a mis- …” I started to call out softly, politely, before leaping back as the point of a sword aimed strait for my chest.<br>\r\n<br>\r\n“You think yer quick, aint ya little bugger?” my vulgar opponent accused whilst I tried not to let the small shower of crumbling cement spewing into my whiskers distract me. He lifted up one foot, leapt across the pavement like an overgrown child, and almost landed on my tail. I had to shoot towards my left to dodge the attack, but I always seemed to come within a hair’s breadth of dieing here. He missed only by millimeters, I could feel the gust of wind rush past me as he hit the pavement, my whiskers could touch his boots if I felt inclined to extend them.<br>\r\n<br>\r\n“Stop this! We have no reason to …” his foot lifted up slightly, but aimed towards me once more and slammed down with incredible force before he could lift it up all the way. This blow came from much closer, was that much faster, and subsequently harder to dodge.<br>\r\n<br>\r\nThank whatever god who watches over mice for the fact I avoided that one, for surely I could not have managed on my reflexes alone. I dropped to all fours, figuring I could achieve better movement speed if I didn’t have to struggle for balance, then turned and ran as I saw the other leg shooting forward.<br>\r\n<br>\r\nIt didn’t lift up, nooooo … stomping would have been too easy to predict. This man used other leg to kick where I had dodged to in an attempt at an amusing punt. Yes, I thought it was amusing. I’d be lying if I said the thought of a flying mouse wasn’t a little bit funny. After covering three feet at a full run, I abruptly turned. I didn’t have any particular reason, but sudden and unexpec- …<br>\r\n<br>\r\nCLASH!<br>\r\n<br>\r\nTurns out I did have a reason after all, the man realized he could not reach me from there with his feet so thus used his sword instead. I was far away from the dust he sent flying and the small shower of sparks it summoned forth. It would be interesting if he managed to break that weapon before this fight was over. He clearly wasn’t holding back any force, and swords are not meant to slice through stone.<br>\r\n<br>\r\nUnenchanted ones at least.<br>\r\n<br>\r\n“Look at it go.” one man from the crowd gawked as I deftly avoided lethal blows.<br>\r\n<br>\r\n“I wonder why it hasn’t made an attack yet. I keep hearing how dangerous the rat army is, but this one …” yet another commented.<br>\r\n<br>\r\n“Unless it’s just a distraction, maybe? They do have an ‘Army’ after all, why would they send one rat?”<br>\r\n<br>\r\nBut I had little time to stop and answer such questions, or even figure out what to say. The beard faced man swiped his sword in a low arch this time, rather than slamming or stabbing as with his previous attempts. This not only made it harder to dodge, but more often than not each swipe was a good inch or so off the ground, no cement to slow it down or throw off his movements.<br>\r\n<br>\r\nThe first swing came from the left and carried through, which I dodged by rushing forward and ducking down low as it came over my head. My little mouse ears swiveled back against my skull, a practical gesture of fear that kept them from getting swiped off. The next blow came from the right, but swung upward at a diagonal angle. I had to jump backwards and to the left to avoid damage completely, if I had tried the same dodge I’d done before I would have been sliced in half.<br>\r\n<br>\r\nWas the man smart enough to test me? Studying my moves and adapting his own accordingly? The next swipe came in low and from the left … very low. I jumped backward to avoid the blade itself, then jumped backward again and curled into a tight little ball of sanity as the screeching, scraping noise of metal through stone assaulted my ears. The air grew uncomfortably hot as sparks filled my line of sight. The light was too bright to see past for the brief moment it’s appearance was evidenced, like staring into the sun. His sword had swiped so low it clung to the ground and left a long gash through the sidewalk. The sword would not survive long if it were made of ordinary steel, but the results were worthwhile.<br>\r\n<br>\r\nI uncurled much sooner than I’d wanted to, and rushed diagonally to my right before my vision had even cleared. It was a wise decision, as the chattering clang of metal at my previous location could attest to. No, this man was no amateur with that weapon. He might be severally misusing it, but he’d been trained in both the basics and the abstracts of sword fighting. You just could not get into a comfortable routine, he’d keep trying new things over and over until something catches you off guard. If I’d had a blade myself … and were roughly his size … this would have been an excellent battle.<br>\r\n<br>\r\n“The whole west wing is panicked … over this?” I blinked and turned, looking at a uniformed city guard in a crude, copper helmet and serviceable chest-guard as it commented on the fight. There were five of them, all moving to surround both the street, the crowd, and the swordsman who seemed so enthusiastic about rodent extermination. The spears they wielded looked excellent against large, heavily armored foes, the weapon of choice when fighting a dragon or a troll.<br>\r\n<br>\r\nBut as a human … or, as a mouse … they just looked easy to dodge.<br>\r\n<br>\r\n“Why is there only one?” one guard asked with a puzzled look on his face.<br>\r\n<br>\r\n“Looks a bit scrawny to me. Are you sure that thing is a rat? Could just be a mouse.” every one of them had a voice like nearby thunder rumbling through a dragon’s belly. In other words, loud …<br>\r\n<br>\r\nBut the hairy man who’d been attacking all this time, voicing his outraged at such speculation, went above and beyond the levels of pain inducing volume any casual comment might induce. “ARE YOU ALL BLIND? Aint no ordinary mouse who can stand up to Nickolas Caoral fer more than a few seconds. Now as I hear it the rat army controls the Necronomicon, aint hard to suspect they usin it to boost their soldiers. I’ll bet this nasty bastard is just their trial run, lettim know how many babies they need to sacrifice to get an army of em. No, we kill the thing now and burn it‘s corpse so it can‘t ever come back”<br>\r\n<br>\r\n“Um … sir … I’ll kindly ask you to step down. We will handle the incident from here, zombie rat or not.” one of them commented politely but sternly. Looking to the crowd he shouted. “Step away from the rodent, we don’t know what it can do or what it wants yet.” All of them seemed ready to fight if need be, but only the fuzz covered sword wielder seemed to have the air of homicidal crazy about him.<br>\r\n<br>\r\n“Wha? I AINT Steppin back so long as this evil blights our fair streets, which in other words, means I’ll be steppin back in a second or two.” the fighter … Nickolas, apparently, announced before raising an empty hand to the sky. It glowed a white, flowing energy that seemed to twist and curl in on itself, before exploding across the crowd and radiating outward. Everywhere it hit life seemed to flourish, grass and flowers thirsting at the edges of the street shifted and grew, insects and ME! Seemed to flow with energy as the incarnation of life and goodness washed over us all.<br>\r\n<br>\r\nThat explains such zealousness … this man was a paladin! So long as he thought I was a monster, or even related to one, he’d stop at nothing to make sure my existence terminated. The light started to shine brighter and brighter, everyone cupped hands over their eyes to keep it from blinding them … now was the perfect opportunity.<br>\r\n<br>\r\nI could rush forward, I knew right where my target was, and attack before the light faded. But then, all of the people crowing around were distracted as well, and even further apart. I would never get a better opportunity to run and hide than right now. But of course, by now I wanted answers. Answers I could only get by talking to those guards …<br>\r\n<br>\r\nWhat would be the right thing to do?</span></div></div>",
            "created":1311829200,
            "id":1156322,
            "title":"Fought my way out."
        },
        "11111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Get the cage!",
                "Here, catch."
            ],
            "content":"<div class=\"\"><div> <span>Rushing madly, blindly, I fallowed the sounds of boots grinding into pavement and heavy, labored breathing. My nose almost scraped against the ground, but with this light I could see neither. If I were not facing this paladin directly I doubt I could have ever found my way to … anything. At least for those few moments when the light was at it’s strongest, for now it was starting to fade.<br>\r\n<br>\r\nI saw the outline of massive boots, legs the size of a castle tower, and I leapt. My front paws gripped the loose fabric while my back paws wrapped around for stability, then I bounced upward. Much like climbing a tree, I bounced with my hind legs, got a good grip all around, then immediately abandoned that grip for another few inches. The light was fading fast, my combatant was starting to react to my presence, but I had already made it to his shirt.<br>\r\n<br>\r\n“GYAH!” He bellowed with that same earth shattering voice, like a dragons roar or a giant’s low shout, it rattled my bones as if I had been struck a thousand times over. I plowed through it, using buttons and waving fabric as my handholds now. He twirled and flailed to get me off, his sword dropped to the ground with a massive clatter, all of a sudden it became impossible to advance as my platform shifted in an unpredictable pattern. I held on tightly, I gritted my teeth, and I …<br>\r\n<br>\r\nSMACK!<br>\r\n<br>\r\nI flailed my arms as his hands swept across his chest, smashing into my face, then my neck, before ripping my arms loose and sending me falling towards the ground. My front pa- … hands! My front hands! Curled instinctively around one of his fingers, the only thing close enough to reach, and then the world rushed past as an incomprehensible blur. He panicked, his arm flailed, his hand and me went high over the man’s head and around in circles as he feverishly tried to shake me off.<br>\r\n<br>\r\nDirectly over his head, I let go … his hands continued to flail. I caught a glimpse of the city guards rushing in to offer their help. I saw the crowd of on looking peering as closely as they dared, to see what could have frightened such a boastful fighter. And then I saw the man’s hair rush past me. Then his eyes. Then his nose.<br>\r\n<br>\r\nAs the beard was within reach I gripped hard with one hand, felt a painful jerk as I decelerated, then brought my other hand around to lesson the load of my right one. I saw realization dawn on the man’s face, it was so close I could see the muscles working beneath his skin. Out of the corner of my eye I saw the flash of movement as his hands shot towards me … but they were too slow.<br>\r\n<br>\r\nGripping his beard with one hand, using my hind legs with a solid bracing on his chest, I leapt up as high as I could. Dragging the coarse, curly hair with me, I griped the hair of his head and strained to pull myself over. Thoroughly blinded, the man’s hands cupped and curled and slapped at random, his wailing had stopped now that something was covering his lips.<br>\r\n<br>\r\nI took this opportunity of silence.<br>\r\n<br>\r\n“ENOUGH! This battle is over!” I shouted at the top of my lungs, digging my heals into the smooth, sweaty skin of Nickolas’s forehead. “YIELD!”<br>\r\n<br>\r\nAt which point all commotion stopped. The paladin stood there, stunned. His spell had failed miserably, the law wanted to question me instead of kill me outright, and I had, in this brief moment, managed to overpower him.<br>\r\n<br>\r\nIf he decided to keep reaching for me I would be forced to escape lest I end up crushed between those massive hands, but everyone seemed too stunned by the prospect of a talking mouse to act. The next move anyone made, was by the same guard who realized I was much too small to be a rat.<br>\r\n<br>\r\n“Could you repeat that? A little louder please.” he called politely. Stepping closer to both me and Nick. Probably to hear better. His voice was no less painful than anyone else’s, and it was difficult to maintain my hold when sound blasted at my ears so forcefully I grew dizzy. I shouted back as loud as I was able against at the command, but there was no way I could match that volume.<br>\r\n<br>\r\n“I Said the battle is over! I come peacefully so long as he yields!” my nose pointed towards the paladin, who took this moment to come alive again. His hands smacked me from the side, I tore small tuffs of fur as I fell, but dropped it to grip the floppy sides of his shirt rather than take a bone breaking fall to that hard cement.<br>\r\n<br>\r\nNot that such forceful jerking on my arms didn’t threaten to pull them from the socket.<br>\r\n<br>\r\n“I can’t hear him. I think he said something about peace and … yield maybe? Either that or he wants to be a field.” the guard said, while another moved to restrain Nickolas. Strong hands cupped around me, lifted me up, up and away from that paladin.<br>\r\n<br>\r\n“LET ME GO!” Nickolas bellowed. At that moment I was grateful for how well those thick fingers blocked all that horrible sound.<br>\r\n<br>\r\n“Somebody cuff him, paladin or no when the commanding officer tells you to stand down you are supposed to STAND DOWN.” a voice answered, but I could not see who.<br>\r\n<br>\r\n“On it boss” another responded. I sensed movement, then a few of the hands parted way, forcing me to look directly into an enormous set of dark blue eyes and pale skin. For a moment I could see every wrinkle, every crevice and imperfection, and then it was gone.<br>\r\n<br>\r\nThe man holding me indicated one of the other guards and called out …</span></div></div>",
            "created":1311915600,
            "id":1157498,
            "title":"Rush forward, get ahold of ..."
        },
        "111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "And then Ronald trips.",
                "I'm given a long time to think."
            ],
            "content":"<div class=\"\"><div> <span>“Ronald, run and go get a cage for our captive.” his voice bellowing with the same incredible force as Nickolas. It was beginning to get annoying, these people were loud enough when talking normally, why were so many inclined to shout?<br>\r\n<br>\r\n“Um, sir?” someone questioned from beyond the wall of fingers. Ronald's, presumably.<br>\r\n<br>\r\nSomeone nearby sighed heavily. “It’s in the caravan, top shelf on the left.” as if in answer to the unspoken question.<br>\r\n<br>\r\nThere was the sound of movement, of heavy footsteps on the pavement, fallowed by yet another incomprehensively loud bellowing.<br>\r\n<br>\r\n“Everyone return to your homes, if something comes of this rodent the citizens will be notified. For now, there is nothing more to see.” then the world seemed to shift and shake, there was now a feeling of movement along with the sound.<br>\r\n<br>\r\nSomething nearby screamed in a muted tone, attempting to shout past some sort of muffle. The hands opened, I saw a brief glimpse of light, and then the world once more converged into darkness as the iron of a small cage clamped down around me. No, not complete darkness, I could see small beams of light reaching in through tiny air holes barely big enough to slip even my hands through. There would be no crawling out through there.<br>\r\n<br>\r\nWait, did I want to climb out? I wanted answers more than anything, I wanted to know where I was, what to do from here, and the more recent curiosity of why this town seemed so afraid of mice. Well, rats actually. That was one clue. If I tried to escape custody, I might never know. And, besides the cage, if I could simply sit down and explain what happened to me I might even get help finding my way home.<br>\r\n<br>\r\nSurely this cage is simply a precaution, born from previous dealings with something more insidious than I could possibly be. Right?<br>\r\n<br>\r\nThe cage was tossed, presumably into the unseen caravan, as noted by the accompanying temporary loss of gravity fallowed by a painful crashing into the cage floor. It was not a gentle toss. I squeaked, more out of alarm than pain.<br>\r\n<br>\r\n“Hey, be careful with that thing. Remember, for now its just a curiosity, not a war prisoner.” someone called out.<br>\r\n<br>\r\n“<i>For now</i> being the operative words, mice are but one step removed from rats. It’s not hard to imagine they’d form an alliance.”<br>\r\n<br>\r\n“Until you point out how often rats will eat mice.”<br>\r\n<br>\r\n“Your point? That just gives the little buggers even more incentive to join! What army would eat away it’s own soldiers? I‘m willing to bet any smart mouse would try to join just for the immunity benefits.”<br>\r\n<br>\r\n“Or, you know, flee. Mice are known to do that. Why stick around in a human city that rats seem determined to control?”<br>\r\n<br>\r\n A completely knew voice chimed in, screeching just as loudly as all the others. “Will you two ingrates shut up? This …” I heard someone spit. “<i>Rodent </i>… is able to speak. You’ll all be briefed just as the rest of the populace if anything comes of this. Try not to get too exited, chances are it‘s just going to end up in Melson’s lab, dissected or made into some spell ingredient.”<br>\r\n<br>\r\nIt was at that point, I was sure I wanted out of this cage. I squeaked, I leapt at those little holes, I acted as cowardly as the mouse I looked like.<br>\r\n<br>\r\n“What?!” And apparently I wasn’t alone in that outrage. “What do you mean, dissected? If it’s not any part of the rat army we shouldn’t treat it like an enemy. Especially if it knows how to talk. What if he has friends that are looking for him? What if mistreatment of this one mouse attracts vengeance from the rest of them? Heck, what if we blow the chance to make allies out of whatever species this little guy hails from? It would make the war that much easier if we had something able to find all the little rat holes and cracks in the foundation we would have otherwise missed.”<br>\r\n<br>\r\nSomeone there had big plans. Premature, perhaps, but imaginative. I relaxed a little, deciding to call out:<br>\r\n<br>\r\n“MY NAME IS XANDER!” At the top of my lungs. I wasn’t awarded a response for my efforts.<br>\r\n<br>\r\n“You need to get your head out of the clouds Ronald. I know you’ve got some pet rat, but don’t let the exception to the rule foo- …” the reprimanding was interrupted.<br>\r\n<br>\r\n“My pet is a completely different kind of rat and you know it.”<br>\r\n<br>\r\n“Who cares what kind it is, a rat is a rat.” a new voice joined in.<br>\r\n<br>\r\n“Wait, since when do you keep one of those sewage covered things as a pet? That’s just … that’s just insane.” yet another new voice joined with it’s own comments.<br>\r\n<br>\r\n“A couple weeks now.” the one called ‘Ronald’ defended. “And she does NOT bathe in sewage, contrary to popular belief.” I could hear the venom in this man’s voice, the same one who noticed I was a mouse and who now spoke out against possible injustice towards me.<br>\r\n<br>\r\n“Lets change the subject, will yah? We’ll find out what the fuzzy little grey thing has to say during interrogation later. I for one, am more interested in how Nickolas is going to take imprisonment.”<br>\r\n<br>\r\n“Bah, that’s just cus your new here Sergis. The old fart ends up in jail for minor charges at least once a month! He’ll just rattle the cage and rail on and on about disrespect or the god’s wrath or some other stupid thing.”<br>\r\n<br>\r\n“Hehe! Oh that reminds me, if you really want to make the fat man squirm, ask him ‘which god’ whenever he starts preaching. He always seems to forget that there’s more than one, and around here not all of those gods are nice.”<br>\r\n<br>\r\n“Huh, you know, I’d consider taking you up on that plan but I’d rather have my genitals remain attached, thank you. I heard those rumors about what he did t- …”<br>\r\n<br>\r\n“ENOUGH!” the loud, thundering voice of the commander broke through the conversation like a fireball spell through a house of paper. “Ronald, you go take your mouse friend into the interrogation chamber, explain what you can to Groff when ye get there. The rest of you, help escort ‘sir’ Nickolas to his chambers and then get back out on patrols.”<br>\r\n<br>\r\nI listened closely, unable to see anything outside my cage.<br>\r\n<br>\r\n“Yes sir” answered a chorus of guards, before strong hands lifted my cage up gently and moved me around to … somewhere. The only thing I could make out from these movements were that whoever made them had enough care to keep me from tossing around.<br>\r\n<br>\r\n“Ronald, I want you to stay behind and carry the little pest wherever Warden Groff wants him put. Do you understand soldier?”<br>\r\n<br>\r\n“Sir, yes sir.” Was the answer, spoken in a soft and calm tone.<br>\r\n<br>\r\n“Well get a move on then” the commander’s tone was just as polite. That seemed, odd. “Lets just hope nothing else interesting happens.”<br>\r\n<br>\r\nA distant voice commented on that with a chuckle “A boring day is a safe day”<br>\r\n<br>\r\nFallowed an even more distant “Amen to that”<br>\r\n<br>\r\nAnd then it all went silent, save for Ronald’s breathing and the smashing of heavy boots onto old but sturdy wood.</span></div></div>",
            "created":1312088400,
            "id":1158507,
            "title":"Get the cage!"
        },
        "1111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Don't worry, I'll get back in the cage.",
                "Oh come on, I'm a mouse! I'm not that dangerous."
            ],
            "content":"<div class=\"\"><div> <span>The cage swung, back and forwarth, steadily but slowly as Ronald made his way through hallways I could barely glimpse, past people of whom I could see no more than the sides of their legs. I tried to listen in as closely as possible, even without talking I was getting some rather useful information from the previous conversation. But people don’t generally talk when they are alone, and Ronald seemed to be on his own while carrying the cage.<br>\r\n<br>\r\nThat gave me time to think, but even more time to realize how much pain I was in. My spine still hurt, just not as much as before I took that nap. My skull wasn’t throbbing anymore, but the headache remained. These people were just way too loud. The worst of it was my tail, oh gods my tail hurt. I didn’t have much light to see by, and my eyes weren’t supper impressive that could see through the dark with ease, but I could tell I was bleeding.<br>\r\n<br>\r\nNot bleeding out, there wasn’t even a slight risk of passing out from blood loss, but unless it heals fast or I get some cover there was the mild concern of infection. I rubbed my hands across my haunches, those flabby thigh areas around my butt, and felt for the base of my tail. Once I found that it was easy to feel along the length of it for the battered and crushed area that some passerby had stepped on. It literally was flatter than the rest of the tail. The skin, and parts of the flesh, had been ground off and pulverized by sheer weight.<br>\r\n<br>\r\nNow that I didn’t have the adrenaline needed for a fight, it was harder to suppress the pain. I was going to have to ask for some alcohol, and then a strip of cloth or something. This needed to be treated.<br>\r\n<br>\r\nMy stomach then decided it was time to compete with my tail for attention, I was still starving. Food, good food at least, was no highly unlikely. Who would waste good food on a prisoner? Who would waste good food on a mouse? Yeah, stupid luck on my part. I turn into a rodent and wind up walking through a town literally at war with them.<br>\r\n<br>\r\nAs a human I knew my body could go three days without food before doing anything useful became impossible. But only one day before doing anything useful became really, really hard. As a mouse I had absolutely no idea. Would my training even come into play? Probably, seeing as I still had decent reaction time and knew how to make a fist. Didn’t change the fact I was still hungry.<br>\r\n<br>\r\nI scurried over to the edge of the cage, looking up and out through those tiny little holes. From this angle I could see the roof, and I could see part of the arm that held my cage. The roof looked bleak and dark, propped stone held by a framework of ageing, petrified wood. A sturdy setup for a dungeon, and with enough mortar between each and every peace of material to make crawling through impossible. Was the whole place really set up to be mouse proof? That seemed likely.<br>\r\n<br>\r\nI stood on my hind legs, though quickly realized the gentle swaying cage was impossible to balance in without staying on four legs. So I leaned against the side and dug my little paws into the air holes, using that grip to hold me upright. I sniffed the fresh air with my little mouse nose, I twitched cutely with my little mouse whiskers …<br>\r\n<br>\r\nAnd I squeaked pathetically with my little mouse lungs as gravity seemed to vanish, I found myself propelled up to the roof of the cage, then violently slammed downward. I couldn’t just let me land on the floor, nope, that would have been too simple. As I was falling and bracing for impact, the whole cage twirled around so that the wall smacked me from the side. It landed on the ground with an annoying clatter, I heard a wet “Thud!” as Ronald landed flat on his chest.<br>\r\n<br>\r\nThe joints of the cage creaked and groaned, the whole thing seemed to be on it’s edge and just about to tip over. I rushed towards the other wall, LEAPT! With that awesome mouse leaping abilities I’d experienced with that whole horse tail incident, then held a solid grip with both arms jammed through tiny air holes as the metal box fell over again.<br>\r\n<br>\r\nMetal grinded against metal which in turn, smashed against stone. It was hell on my ears, but I had to stay alert as evidenced by two of the cage’s nails falling off. Or maybe the cracked? Either way nothing was holding up the wall I hung from, leaving me with that eerie feeling of vertigo when it fell off. I pulled my arms out quickly, squinted my eyes against the harsh, but still dark light of the room, and braced my feet as best I could when …<br>\r\n<br>\r\nSLAM!<br>\r\n<br>\r\nThe metal wall smashed into the floor with me riding it like a giant, stiff, magic carpet. Ok, more like a solid wall crashing down with some idiot hanging on the whole time. My feet stung, but everything else was uninjured. Much to my relief. And finally I had a chance to see the hallway I’d been taken to. Not room, hallway. There was a door, much too solid and low to the floor for even a mouse to squeeze under, roughly ten feet in the direction we’d been traveling. The walls were a mix of heavy stones and well placed, four inch thick logs for support. The roof was flat and solid, and about nine feet tall. Way out of my reach.<br>\r\n<br>\r\nLooking around past the now broken and bent mouse cage, I saw an almost identical door ten feet in the opposite direction, also along a flat, boring hallway. Both doors looked sturdy. Thinking about it tactically, even without any magic surprises, this would be a perfect choke point in case of any large scale invasion. Be they prisoners escaping, or an army trying to hold this place as a fort. But it was still boring.<br>\r\n<br>\r\nI saw Ronald starting to get up, I saw the bright red eyes covered in part by muddy blonde hair, and I saw a mixture of curiosity and terror in the man’s face as he spotted me. Free. Out in the open, with no witnesses around and no one to help him fast enough should I have super attack hidden under my fur like they all seemed to think.<br>\r\n<br>\r\nHe scrambled to his knees, grabbed the main portion of the cage with one hand while ignoring the little scraps that had fallen off. I scurried quickly off of the cage wall under my feet, looked towards the door, considered my options …<br>\r\n<br>\r\nI smiled as best I could with my little mouse muzzle, saying …</span></div></div>",
            "created":1312952400,
            "id":1165659,
            "title":"And then Ronald trips."
        },
        "11111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "The sound of a door slamming.",
                "Someone shouting \"Get away from that!\""
            ],
            "content":"<div class=\"\"><div> <span>“Don’t worry about it, I’ll get back in the cage” as loudly, and with as much force as my weak little lungs could manage. The young man blinked, and I swear that was a loud blink, before asking with that same thundering tone as before.<br>\r\n<br>\r\n“What?!”<br>\r\n<br>\r\nI groaned, one hand raised aiming to cover my ears, but I held it off. This time I didn’t bother sounding polite, I just screamed. Full of rage, full of anger, with that shrill vibration you just know you can feel whenever a captain issues a command. I used the sort of voice you have to use on a battlefield to make yourself heard over the clatter and cheering a thousand or more men.<br>\r\n<br>\r\n“I’LL JUST GET BACK IN THE CAGE!” He seemed surprised. Or at least I think he did. He stood up carefully, bending his knees so that he kept at a crouch. Making sure he kept his eyes on me, that I didn’t do anything without him seeing it.<br>\r\n<br>\r\nHe pondered the cage for a moment, looked down to me, then set the broken metal box inches from my face. I felt the wind brush my ears and whiskers back across my head, I felt the rush of air pressure as such a massive object landed so close to me. But nothing hurt, and it didn’t keep moving after he set it down, so I readily climbed in and waited for the man to pick it up.<br>\r\n<br>\r\nHe did so, with just as much care and attention as he’d used before. Balance really wasn’t an issue, up until the guy tripped it was a smooth ride. Holding me up with one hand, he then bent down to reach the rest of the metal scraps and broken wall. He turned his head to give me a sidelong glance, took a few steps carrying everything, then expectedly burst into curiosity.<br>\r\n<br>\r\n“What are you, exactly?” he asked with a voice like distant thunder. <br>\r\n<br>\r\n“A mouse! I think” I was tilting my head to look up towards his face, keeping all four legs braced against the metal ‘floor’ just in case he tripped again. This time there was a giant hole in the cage, meaning it’d be easier to fall out. Looking down, I also got the feeling I could jump out if given half a chance.<br>\r\n<br>\r\n“Um, can you … can you speak up or something? It’s very hard to hear you.” this time he was quieter. Still sounded like someone talking through speakerphone spell, but it didn’t make me long for some form of ear covering.<br>\r\n<br>\r\nI thought for a moment, if he could not hear me from this position no matter how loud I shouted then why waste my breath shouting? Well, he could hear me, just not well enough to understand everything. Why was that? The guy on the horse could speak with me just fine, he didn’t even have that mountain voice everyone else seems to have. Then it hit me, the guy on the horse couldn’t hear me either, I had to climb up to his ear. Smiling, I answered Ronald by standing up on two legs, then tapping my left ear.<br>\r\n<br>\r\n“Wha … oh! Yeah I get it.” a sudden change in momentum and I was knocked flat on my back. Scrambling up to my feet, all fours this time, I looked out the hole right into the man’s face. Weird to look at a man and actually see the layers of sweat and grime that coat his forehead, horrible to see individual pores in his skin that just oose a nasty, salty water like some giant slime monster. The smell, oh gods the smell, it was even worse than the horse. How dragons could stand eating these things I will never understand. But this should be close enough to talk to him.<br>\r\n<br>\r\n“Can you hear me now?” I asked experimentally.<br>\r\n<br>\r\n“Y-yes, I can actually” the man’s eyes widened.<br>\r\n<br>\r\n“Excelent. Now do be careful not to drop the cage again, please. I fear I would not be lucky enough to get off without injury a second time”<br>\r\n<br>\r\nThe man blinked, looked downcast, then immediately shifted to suspicious. “Without injury, what did you not notice your tail or something? We’ve got to get that bandaged.”<br>\r\n<br>\r\nI squeaked … er, laughed! Ok, I tried to laugh, it just came out as a squeak. “I didn’t forget, I just didn’t get that wound from the fall. It is my reminder that standing on a sidewalk is not wise for one’s health.”<br>\r\n<br>\r\n“Oh, so then you got that … what, in the fight with old Nick? That makes sense, the man’s got wicked eyes and killer aim. I haven’t known anyone to spar with him to get off without at least a cut.”<br>\r\n<br>\r\n“No-no, the paladin never touched me despite coming close. This wound is from some woman who stepped on my tail.”<br>\r\n<br>\r\nRonald stared at me. Blinking hard. Was there something about me just that hard to believe? Well, the paladin was a good fighter. Perhaps the thought of a mouse besting him, even in some small way, was just to incredulous to overlook.<br>\r\n<br>\r\nI heard a ripping sound, like someone tearing fabric, which was immediately fallowed by a large, brown strip of cloth thrust into the cage next to me. Apparently changing the subject.<br>\r\n<br>\r\n“There you go, I’ll try to get that tied on as soon as …”<br>\r\n<br>\r\nBut I was already wrapping it tight around my wound, a crude but serviceable tourniquet that should … I sniffed it. That should make me smell like human sweat, because that’s what it was doing. Hard to believe that strip of cloth somehow smelled worse than my exposed butt.<br>\r\n<br>\r\n“I thank you good sir, but there is no need for such.” I think I surprised him. The man sure looked surprised as I heard the soft creaking of a door opening, saw the room widen and flatten into a smaller square as we exited the hallway, and then the loud ‘thud’ of my cage crashing onto a small table. Nothing broken, nothing was dropped, it was just loud.<br>\r\n<br>\r\nI crawled out, looked to see a room that was, save for a table much too high to jump down from, empty. Ok, maybe I could have tried, but it went up to a man’s chest. Ronald could not have sat in a chair and still be able to look at me. Surely I would at least break my legs attempting the jump. I offered a sidelong glance over to the human who carried me in, then scurried over to the edge of the table.<br>\r\n<br>\r\nI looked down at the corners, mice could climb exceptionally well, but they still needed something to hold onto. The table’s legs were smooth, solid metal, shiny from frequent polish, and was smaller towards the floor than at the actual connection. Impossible to climb down without a rope. Was this table specifically designed to hold rodents?<br>\r\n<br>\r\n“Don’t bother trying to get down, this is an interrogation room and we aren’t new to this sort of thing.” Ronald calmly explained.<br>\r\n<br>\r\nI crawled my way over to him, nodded slightly, and responded. “Not trying to escape, just curious. I’ve never seen something like this before, the thought of humans engaging in active war with mice just seems ridiculous.”<br>\r\n<br>\r\n“Not mice, Rats.” He corrected. “Much bigger than you, and perfectly capable of killing a man when you give them a chance to swarm. Never known a mouse to speak Uema either … how exactly did you learn it?”<br>\r\n<br>\r\nHe was busily picking the cage up and placing the scraps of metal inside so the whole of it was easier to carry as I started to answer, only to be interrupted by …</span></div></div>",
            "created":1312952400,
            "id":1165661,
            "title":"Don't worry, I'll get back in the cage."
        },
        "111111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "called out \"Come in\"",
                "shot an arrow at tthe doorknob."
            ],
            "content":"<div class=\"\"><div> <span>SLAM!<br>\r\n<br>\r\nWords on a page cannot possibly describe how loud that sound was. If one were to write in massive letters, with a single letter covering a complete page and a plethora of symbols in the background to indicate displeasure or force, it would still not have been an apt description. My head felt ready to split apart, my bones, my spine especially, gave way so that I fell on my belly. My ears, the soft inner portions that made up the extended fleshy bits vibrated noticeably. Yet for all it’s terror, the sound lasted no longer than a single moment.<br>\r\n<br>\r\nI didn’t even have time to cover my ears.<br>\r\n<br>\r\n“Good morning, s-sir! The p-prisoner … is …” Ronald seemed to stutter, I looked up from my tiny little world of hurt to see him pointing towards me. Evidently the man was shaken up as well, but clearly not as much as me. Finding the energy to talk, or point, while my head throbbed in such a manor was beyond comprehension.<br>\r\n<br>\r\nI decided that so long as I was not doing anything else, I might as well look towards whomever Ronald had addressed. Turning my head I saw a slim, well built man in a green tunic, I could see small slivers of chainmail shining through at the thighs and shoulders. Though the clothing was covering much of it. He had dark hair, pale white skin, and piercing green eyes. The man had eyes that seemed to study you from the moment they saw you, perceptive, scanning for any trace of weakness.<br>\r\n<br>\r\nAnd then his hand reached over to slam the door …<br>\r\n<br>\r\nFor a split second I panicked, having to deal with that sound for a second time was just too much. I scrambled for the nearest cover, which happened to a bent nail sitting on the table, much too small to actually cover anything. My ears swiveled low onto my skull, my arms shot up to hold them down tighter and block the ear-hole directly. I knew it was merely a token gesture when the vibrations were painful even through my fur, but anything that could lessen the pain was worth the effort.<br>\r\n<br>\r\nThe man’s arm pushed gently and quietly, all I heard was a click as the door shut and some lock held it in place. I was relieved. The green clothed man looked curiously at me, then inspected the room. His eyes noticeably aiming towards Ronald, then the table, then the scraps of metal, and finally that broken cage. His face twisted in mild anger, mild comprehension, to which Ronald responded with fear.<br>\r\n<br>\r\n“Oh! Y-yes sir, my apologies about the cage, I w-will go send to have th-this fixed.” my transport stammered. Cradling the whole thing in his arms while pacing towards the door.<br>\r\n<br>\r\n“Bring a working one.” the man said, his voice both monotone and quiet. This was the first time in a long time someone could talk without blasting sound at me. The man sounded normal! “On your way back.”<br>\r\n<br>\r\n“Y-yes, master Felast.” and with that Ronald scurried out the door as fast as his legs could carry him. He’d left a few scraps of metal, that bent nail at my feet and the chunk of a corner that had somehow rusted off. But otherwise I was completely exposed on a wide, barren desk.<br>\r\n<br>\r\nAlone in the room with me, one way out, the human named ‘Felast’ apparently, regarded me calmly while walking towards the table. He placed both his hands behind his back, stood with his chest just inches from the side of the table, and all the while kept his eyes on me. It was very hard to focus on anything except those sharp, green eyes. We stood in silence for a few moments that seemed to drag on in a perverse manner. But I actually shivered when he spoke.<br>\r\n<br>\r\n“I am Felast. The interrogator. Who are you.” the man managed to make a question sound like an order. He was quick, he was quiet, he seemed determined to use as few words and as short a sentence as possible. I just stood there staring at him before realizing I’d need to talk.<br>\r\n<br>\r\n“My name, is Xander!” I shouted at the top of my lungs, knowing from past experience that anything less would be impossible to hear. At this the man glared, fierce and frightening … I thought he was about to attack.<br>\r\n<br>\r\n“Do not shout.” another three word sentence, fallowed by “Who are you aligned with Xander.”<br>\r\n<br>\r\nI blinked, then answered in what felt like a normal voice. Certainly not whispering, but not shouting either. “I have pledged my allegiance to Reginald Finnly, king of the Iron wall regions.”<br>\r\n<br>\r\n“Of what race.” apparently he’d heard me. Was his hearing just that good? Or was some unseen enchantment aiding conversation? Either way I was confused.<br>\r\n<br>\r\n“What do you mean? what race am I allied with? Well I think that’s …”<br>\r\n<br>\r\n“Of what race is your king.” he corrected. A little more forcefully.<br>\r\n<br>\r\n“Human.”<br>\r\n<br>\r\n“Why are you allied with a human king.” his eyes narrowed, he seemed to grow suspicious.<br>\r\n<br>\r\n“Because I am human.”<br>\r\n<br>\r\nFelast’s eyes widened in shock, then narrowed again in disbelief. “You are awfully short for a human.”<br>\r\n<br>\r\nI stood up onto two legs, started to speak, and was immediately stopped by a large finger poking against my chest.<br>\r\n<br>\r\n“And you need a shave.” I blinked … still monotone, it was difficult to decide if he meant that as a joke or actually believed it.<br>\r\n<br>\r\n“Please let me explain.” I squeaked out, though the hand didn’t smell anywhere near as horrible as my previous close up with a human body part, it was still intimidating.<br>\r\n<br>\r\n“Please do.”<br>\r\n<br>\r\n“I was a human guard on a late night watch, protecting the king of the Iron Castle. We were caught unawares by a wizard in dark garbs, me and six others, who tore through our defense as if we were children. He dodged enchanted weapons faster than the eye could fallow, and those attacks which did land he ignored outright. I charged him from behind, attempting to grapple and hold him down … but he cast an offhand spell, leading to my current predicament.”<br>\r\n<br>\r\n“And then what” Felast didn’t bat an eye to my story.<br>\r\n<br>\r\n“I woke up in a wooded area near … wherever this place is, I do not know the names of this area and cannot say. I procured a ride on a horse from a passing traveler, fell asleep for I am not sure how long, and got off for …” my stomach interrupted me with a rather annoying grumbling, I still hadn’t had a bite to eat in roughly a day. “For something to eat. But a passing villager stepped on my tail.” I demonstrated by pointing towards the bandaged area.<br>\r\n<br>\r\n“And then what.”<br>\r\n<br>\r\n“Then the panic that you are no doubt aware of occurred. I was attacked by the paladin Nickolas, and chose to go with the city guards willingly.”<br>\r\n<br>\r\n“Why.” again, simple questions.<br>\r\n<br>\r\n“Because I have great respect for the guards of a city, I had assumed doing so would help me figure out why this town is afraid of rodents. And perhaps seek out much needed aid from sympathetic people.”<br>\r\n<br>\r\n“I see.” the man’s eyes narrowed. I hadn’t learned anything useful so far, I was still starving, and I had no way to tell if this man believed me or not. He raised one hand, glanced over to the door with furious eyes, and then …</span></div></div>",
            "created":1313038800,
            "id":1166302,
            "title":"The sound of a door slamming."
        },
        "1111111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Let me inspect the thing first.",
                "Oh, well right away then."
            ],
            "content":"<div class=\"\"><div> <span>He shouted “Come in” with the same gigantic sonic blast everyone else seemed to apply to their voice. Reminding me once again that while soft spoken and attentive, Felast was still much, much larger than me at the moment.<br>\r\n<br>\r\nThe door opened quietly enough for my poor sensitive ears, and Ronald walked in carrying a duplicate of the cage he’d dropped. <br>\r\n<br>\r\n“I have the ca-\" The man started to mutter <br>\r\n<br>\r\n“I see that.” Felast interrupted. He then turned his attention back to me stating “What sort of aid do you expect? Do you intend to beg us for food or drink?” which was probably the longest sentence I’d heard him say this entire time.<br>\r\n<br>\r\n“While either would be appreciated if offered I would much rather ask for a magician or sorcerer who can return me to normal. I do not have any money at the moment thanks to the fact I can’t carry much of it, but once human again I can work to pay off whatever I owe.” I didn’t bother shouting this one and noticed Ronald struggling to make out my words as a result, but Felast and his sharp senses could understand me perfectly.<br>\r\n<br>\r\n“Ronald.” he directed in a cold tone. “cage Xander once more.”<br>\r\n<br>\r\n“Yes sir.” Ronald blinked, walked over to the table and then set the cage down on it’s side.<br>\r\n<br>\r\n“I know the routine.” I stated before climbing in and hugging the back wall to avoid falling on my side when the cage flipped. As it did so, the wall became the floor, the lid slid in place, and I was once more surrounded by darkness.<br>\r\n<br>\r\n“Take him to Melson.” Felast stated, at which point my cage started to swing and shake before finally stabilizing. This didn't bother me as I could balance just fine.<br>\r\n<br>\r\n“Why would … erm, alright then.” Ronald seemed worried, confused, and just a small bit … sad? Why would there be sadness in his voice. I wasn’t able to see out and the cage didn’t transfer much movement, so when the door swung open with that annoying creaky sound I was surprised. Just as I was starting to wonder about that tone of voice Felast called out to Ronald …<br>\r\n<br>\r\n“Tell him we suspect that mouse is under enchantment. It’s his job to rid the creature of it.”<br>\r\n<br>\r\nRonald blinked, turning sharply enough to make me slide on my feet towards the sides of the cage. “What sort of enchantment?”<br>\r\n<br>\r\n\"Creature?\" I questioned in annoyance.<br>\r\n<br>\r\n“Ask him.” I heard Felast walk through a doorway himself, then saw a bright, annoying light as the cage roof opened up.<br>\r\n<br>\r\n“Is that how you can talk?” Ronald asked, curious.<br>\r\n<br>\r\n“NO!” I shouted back with growing ire, shaking my head vigorously.<br>\r\n<br>\r\n“Ah, so then what sort of enchantment little mouse? No wait, let me guess, your immortal. That’s how you lasted so long against Nick.”<br>\r\n<br>\r\nI shook my head again, my whiskers twitching animatedly.<br>\r\n<br>\r\n“Not immortal? Ok, well it has to be some combat related thing. Super speed perhaps?”<br>\r\n<br>\r\nAgain, I shook my head. If he’d just lean closer and pay attention the conversation would be over a lot faster. But then, if he leaned too close and forgot to watch where he was going he could trip again. Or, you know, crash into a wall. <br>\r\n<br>\r\nRonald sighed “I guess I’ll figure it out when we reach Melson. I really hate being left in the dark here. You and Felast don’t talk very much.” and with that he slid the roof back over my cage, and I was consumed by darkness.<br>\r\n<br>\r\n\"I sort of wish you'd fallow his example.\" I muttered with my ears twitching up and down. I could try to get used to it, but my god were these voices loud.<br>\r\n<br>\r\nI still hadn’t had a meal, and my stomach was complaining avidly, but there was not a lot I could do about that. Not a lot I could look at either from within the dark confines. I could smell just fine, I could tell we were walking through the streets because the smell of people’s dinner drifted lazily through the air. Eliciting just the tiniest bit of drool to slip past my chin … I was so hungry. The smell of fresh air, the moisture of approaching nightfall, and the stench of human sweat didn’t do much to distract me from the thought of food.<br>\r\n<br>\r\nFood … apples. Apple pie. Roast chicken. Steak. Even old, crusty bread with no flavoring seemed appetizing at the moment. I idly wondered how much rum it would take to render me a blathering fool. But then again, at this size, even a small cup of fine wine or sweet Champagne would last me a week!<br>\r\n<br>\r\nI sighed. Thinking about ways to fill my belly or just how much food was available to a small creature could not be the most useful ways to spend one’s time. But what else? Ronald wasn’t the best for conversation considering his difficulty hearing me. I could not see the sights, not that I would have seen anything new or useful. Maybe I could spend this time focusing on my new body? Couldn't hurt to at least make sure it works right.<br>\r\n<br>\r\nI decided to curl my tail around, reaching a hand out to feel across the now blood-soaked bandage. My soft, grey fur needed cleaned … that much was certain. But would I be able to find a bath soon? Er, I’ve never seen mice swimming or bathing in anything. Exactly how did they clean themselves? I know they’d have to at some point, a smelly prey is prey that’s easy to find, surely any mouse would know that.<br>\r\n<br>\r\nMaybe it's supposed to snap off or something? Some lizards have detachable tails, does it work the same way with mice? Experimentally I gripped the very base and gave a light tug. Unsurprisingly my only reward was a sharp pain in the rear. Ok, so it's not supposed to snap off. I could wash it off in a tub or something, perhaps a small cup. I'll need to wash the bandage too, lest diseases begin to fester.<br>\r\n<br>\r\nMy thoughts were then distracted as a door opened, I’m not really sure what door it was or just where we were, but I know some door opened. The miniscule lighting from my air holes shifted, the smells of food faded away under a blanket of herbs, dust, and mold. I stood on two legs, raised my nose to the air, then shivered.<br>\r\n<br>\r\nI could smell death. I could smell horror, and pee, and food going to rot. I could smell the iron scent of blood as it spills out corpses and mats onto the floor, none of which was especially strong. It was … distant. Like the source of the scent was present, but hidden. It sent shivers down my spine.<br>\r\n<br>\r\nI heard a thump as Ronald set the cage down, probably on a table, then covered my ears as he screamed out in that thundering voice of his.<br>\r\n<br>\r\n“Hello! I’ve got a new customer for you Melson!” nothing happened at first, so we both waited. And waited. And waited.<br>\r\n<br>\r\n…<br>\r\n<br>\r\n“Coming!” a grunt sounding, harsh voice called from somewhere bellow. I heard the thumps of a fat man on molding wooden boards, I heard the creaking of stairs threatening to give way, and I heard the same painfully loud voice from Melson as I did from most everyone else. “Who is it th- … OH! Hohoho, another specimen for me to study?”<br>\r\n<br>\r\nI squeaked in freight as the cage shifted under a careless inspection. Light burst into my eyes as the lip opened up, causing me to blink. A fat, pudgy little hand that smelled of blood and death reached down for me, which I deftly avoided.<br>\r\n<br>\r\n“No Bottle-lord Melson, it is a customer. Lord Felast has requested you remove a curse placed upon this mouse.”<br>\r\n<br>\r\nI could see melson’s frustration at his failure to catch me, then he regarded Ronald and said …</span></div></div>",
            "created":1313038800,
            "id":1166520,
            "title":"called out \"Come in\""
        },
        "11111111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Melson decides to keep me.",
                "Ronald decides to hold onto me."
            ],
            "content":"<div class=\"\"><div> <span>“Now hold on a minute, let me study this thing a little while.” Melson growled as his chub filled hand reached for me a second time. I squealed in discomfort at rough fingers curled around my head and spine, there wasn’t a great deal of room to maneuver. It was not pleasant, made in part by the fact he did not seem to care about handling. So far the only time’s I’ve been picked up has been careful and gentle, but this guy squeezed my face into my shoulders while leaving my legs and tail dangling.<br>\r\n<br>\r\nI felt a sharp pinch at the tip of my tail, had but a moment to realize what was coming, then screamed. Melson dropped my head, letting his grip on my tail alone hold me up. My entire body now held by that single, thin appendage, the rapid change in support caused my now free falling head to swing down. All of this added pressure was focused on that wound … it’s not hard to tell why I screamed.<br>\r\n<br>\r\n“ARGH!” blood spurted out as the wound opened much, much wider than it had been originally, even when I was first stepped on. The cloth turned bright red as it absorbed more than it could handle, I felt my own blood trickling down past my thighs and dripping onto my belly. My muscles spasmed as I struggled to stay alert through the pain.<br>\r\n<br>\r\n“Wow! Careful with him, can’t you see he’s hurt?” someone called out, but it was hard to tell who. The voice was just as loud and rumbling as every other time, and it was so hard to focus while upside down and screaming. Immediately after I felt a soft, gentle support at my head, then the pressure at my tail released. I was breathing hard, looking at the two giants with mild distain over that sudden mistreatment …<br>\r\n<br>\r\nThey weren’t giants, they were humans, so I should stop … no! I will not call the fat man human, so far as I’m concerned he didn’t deserve that honor. But I felt curling my tail around to nurse two wounds, both the footprint and where I’d been pinched, was more useful than cursing them out. I carefully removed the bandaged, cringed at the sight of a now exposed scar, much more damaged than it was just a few moments ago. Blood dripped down onto the hand I was held in, Ronald’s, obviously, for it was not covered in fat. I then straitened out the cloth strip, rung it out as best I could …<br>\r\n<br>\r\nAnd was stopped before I could wrap it back on.<br>\r\n<br>\r\n“Remarkable! I’ve never seen a mouse do such a thing, oh but do stop it. That silly strip will just get in the way, and rodents have a tough immune system.” Melson, of course.<br>\r\n<br>\r\n“I erm …” Ronald seemed to think it over. “You’ve got a bottle of whisky right there, at the very least disinfect the wound.” he demanded.<br>\r\n<br>\r\n“Why bother?”<br>\r\n<br>\r\n“Oh come on, it’s not like it’d be out of your way.”<br>\r\n<br>\r\n“Still doesn’t explain why I should …” Melson was cut off as Ronald just grabbed the bottle himself and carefully dripped some onto the tail. It splashed about in his hand, mixed with the very small pool of blood, and lapped over my legs and thighs. I flinched at the pain, tensing up as it seemed like one torture piled on top of another, but this one I saw coming and this one was necessary. I had no complaints.<br>\r\n<br>\r\n“Thank you” I called out as loudly as I could manage through gritted teeth.<br>\r\n<br>\r\n“Hey! What are you …” Melson interrupted.<br>\r\n<br>\r\n“You’re supposed to remove his enchantment, not tear his tail off. <i>Lord </i>Melson. And you are going to do just that.”<br>\r\n<br>\r\nMelson blinked a moment, seemed to ponder his options, then sighed. “Exactly what sort of enchantment does it have then?”<br>\r\n<br>\r\nThis time it was Ronald who blinked. “He, uh … what was it again.” he held me up to his ear and waited for an answer. I was starting to get annoyed by how often I was jerked around.<br>\r\n<br>\r\n“I am actually a …!” but I didn’t get to finish the sentence, let alone make sure anyone could hear it.<br>\r\n<br>\r\nMelson saw this as an opportunity and smiled. “Ohhohoh, don’t bother. I’m a skilled magic user you know, just hand the little guy over and I’ll figure it out myself.”<br>\r\n<br>\r\n“Er, uh …” I was forcibly snatched out of Ronald’s hands. The man, apparently, was not very good at thinking on his feet. The room seemed to shift and swerve, fat enveloped my chest and stomach, and the next thing I could see was Melson’s face. This was the first time I’d actually paid attention to it. He had dark hair, light brown eyes, and very round cheeks that made him look childish. Infantile. Though as I saw him smile, that face took on the overall appearance of evil.<br>\r\n<br>\r\n“Now lets see here … hmmm-OH! This creature is a shape shifter!”<br>\r\n<br>\r\n“What?” Ronald blinked again, considering the blood and alcohol on his hand before wiping them onto his shirt.<br>\r\n<br>\r\n“Or maybe it’s been shape shifted. Much less entertaining than a creature that changes at will. Oh how I’d love to look into such magics! The ability to change sizes or species, even changing appearances in subtle ways to bring out inner beauty. What I wouldn’t give to be able to trim away all this fat and strut through the town young and handsome.” his palms started to sweat, and that sweat soaked into my fur. The smell wasn’t nearly as bad as the salt it dripped into my open wound.<br>\r\n<br>\r\n“Er, Ooook … sure, that sounds useful. But what about the …”<br>\r\n<br>\r\nOnce again melson cut him off. “Right, right. Lets get started then.” he placed me onto the table, shoved aside several papers and at least one empty bottle. He placed both his hands over me in a dramatic pose, presumably calling forwarth whatever magic he’d need to remove this curse and return me to my proper form. Heck, if the fat, unpleasant magician succeeded with this spell I might actually refrain from punching him over what he’d done to my tail.<br>\r\n<br>\r\nHis hands flashed bright blue for a moment, then faded away with the speed of a shooting star. I could feel my fur slip away, I could feel myself growing, I could even feel my whiskers vanish, but then it all came back in a tidal wave of screaming, monstrous agony. Each individual hair was like a dagger sprouting from my skin! It felt just like the initial spell that got me! I collapsed to my side, too much pain, too fast to handle it, on top of the emotional trauma involved with feeling that trace of humanity slip away before my eyes.<br>\r\n<br>\r\nBy the time the pain was gone, I was unchanged. Still a small, grey mouse.<br>\r\n<br>\r\n“Can’t reverse it. Sorry but whoever did this is way stronger than me, it’s not just a single transformation spell. He’s cursed in such a way that every moment of his life the spell that initially transformed him is recasting itself. I’d have to come up with something completely new to battle this kind of creative spell casting. Your talking work for a master!”<br>\r\n<br>\r\nI could not help but mutter “By the gods, I hate magic.”</span></div></div>",
            "created":1313131500,
            "id":1166599,
            "title":"Let me inspect the thing first."
        },
        "111111111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I try to escape.",
                "I never get the chance."
            ],
            "content":"<div class=\"\"><div> <span>“So, wait, you mean you can’t remove this curse then? We have to hire a someone else?” Ronald asked, trying to take everything in. I was too busy trying to stay conscious to pipe in with my own concerns.<br>\r\n<br>\r\n“Hohohoh! You’d have to get a completely different caliber of magician, boy. I’m talking someone with the power to summon meteor storms, enough magic to decimate an entire kingdom! Whoever cast this spell did so at a permanent cost to their total spell pool! In theory one could remove the curse by killing the original caster, but that’d be even harder than creating an anti-spell.”<br>\r\n<br>\r\n“I have no idea what that means.\"<br>\r\n<br>\r\n“Of course not\" Melson sighed, reaching a hand down to pick me up none too gently. “To cure this creature myself, I’d need to cast a spell that constantly reverts him to his natural form just as often as the current curse traps this thing in the body of a mouse. Not only would that be at a permanent cost to my total spell casting abilities, but it’d take more magic than I actually have! If you ever need to repeat that to your superiors, just say it’s long, complicated, and expensive. I’ll work on it.”<br>\r\n<br>\r\n“Ok then.” Ronald balked. Glaring slightly at how I was held. “But what was he before? Do you know what the original form was?”<br>\r\n<br>\r\n“Of course I do, human! Wouldn’t waste this sort of power on a toad now would you?”<br>\r\n<br>\r\n“Wha, human!? Then why are we keeping him in a cage!” Ronald burst.<br>\r\n<br>\r\n“He’s not human now, is he? A cage is probably safer than anything else we can carry him in.”<br>\r\n<br>\r\n“There is such a thing called dignity.”<br>\r\n<br>\r\n“Bah! The man was probably a barbarian savage, or some street urchin who begged the wrong person for food. Don’t worry about it boy, worrying is not going to make things any easier.” Melson stated condescendingly … at the same time carrying me over to the cage I’d come in on. I had barely even gotten to examine the room, and already I was placed back into darkness!<br>\r\n<br>\r\n“I still don-\"<br>\r\n<br>\r\n“You just go on home, I’ll handle things from here on out. These are complex magics, and surely you could not hope to comprehend them well enough to help. Even in the slightest.”<br>\r\n<br>\r\n“My shift isn’t over, I still have to …”<br>\r\n<br>\r\n“Then go report this mouse’s whereabouts, I’ll let the captain know if anything turns up from my research here. So far as it concerns you, this little mouse is, well, no longer a concern.”<br>\r\n<br>\r\n“After how I’ve just seen you handling this ‘mouse’ I’ll think not. I can watch over the little fella better than you can, you have rows upon rows of rodent habitat and hundreds of different subjects to care for. I only have one pet, and as such can focus on him.”<br>\r\n<br>\r\n“What does that have to do with anything? You don’t know how to cast magic and you don’t have the mental capacity to do anything along the lines of scientific inquiry. I doubt you can even read.”<br>\r\n<br>\r\nThere was an odd silence. I could not see any facial expressions, a pattern that was beginning to annoy me, but I could just tell there was severe hostility in the air.<br>\r\n<br>\r\n“Fine” Ronald decided, I heard some rather dainty footsteps as he walked out, fallowed by a muted slam. I covered my ears to guard against that sound, but was immediately shoved back onto four feet as the cage wobbled and swayed.<br>\r\n<br>\r\nI could see through the airholes to tell that I was moving. The walls shifted, the lighting changed to a darker tone, and … and …<br>\r\n<br>\r\nBy the gods! The smell was horrible! As soon as Melson’s overweight body crunched onto a moldy stairway the scent that had only offered a hint of death soon overwhelmed every other detail. It smelled like a morgue. No, it didn’t smell that nice, it smelled more like someone had torn the walls and roof off a morgue, used that place for a battlefield, and then decided to leave the bodies piled up rather than burry anyone.<br>\r\n<br>\r\nIt wasn’t just the smell of people dieing and blood clotting in the dry air, it was all that and more combined with the smell of fresh zombies and necromancer farts. I squeaked in fright as the cage roof opened up and those fat, pudge filled hands came for me. There was no way out and no where to run, my only real option was to let him grab me.<br>\r\n<br>\r\nAs soon as I was out of the cage I looked around in Melson’s hidden laboratory. I was sure it was a hidden, underground laboratory because this room didn’t look anything like the previous one. The lighting was bad in most areas, but shockingly bright in the center of the room thanks to some clearly magical lantern. There was a huge, metal table directly under the light, filled with blades, bottles and various metal wires. There were shelves lining the walls, in which the one in he far back was overflowing with containers of bodily fluids, bright red or glowing liquids, herbs, plants and trinkets of every sort. Every other shelf was filled with clear, glass cages housing hundreds of rodents.<br>\r\n<br>\r\nHundreds.<br>\r\n<br>\r\nOf every size, color and shape imaginable while still mouse like enough to qualify as a mouse. Some were black, some were a pure white, some were grey, and a good portion were brown. Every one of them looked and smelled horrible, miserable, like they’d been living in squalor for the duration of their stay. Worse still, much to the distain of my newly acquired mousey hearing, I could hear every one of them screaming … they sounded exactly like I’d expect a human to sound, no squeaking or little chitter noises, they shouted and I understood it as Uema.<br>\r\n<br>\r\nMost didn’t make any sound.<br>\r\n<br>\r\nHe slid a metal tablet into position with his one free hand, reached for some of the metal wire I’d seen before, and continued talking to himself.<br>\r\n<br>\r\n“You’ll be an entertaining one to study. If someone does manage to cast a specific counter spell you’d have the ability to switch back and forwarth from one to the other at will. You’d literally exist in two separate states at the same time, allowing you to be either or both! It’s the ultimate in instantaneous shape shifting! If I could crack the idea behind it and secure enough energy to cast it, I could … well I could …”<br>\r\n<br>\r\nThe man’s rude, round little face delight as he dreamed up the possibilities, and I shivered. His hand placed me back first onto the tablet. Well, it didn’t so much place me, as slap me down and hold me tight enough that I could not readjust. I felt pain, naturally, and was starting to think I’d be feeling it often from now on. I knew I had mouse teeth, and I knew his hands were just within reach … but then I also knew, full well, that I could not be the first rodent to try and bite him. Save my defiance for a time when it’d actually be useful.<br>\r\n<br>\r\nI glared at the man when his hand slipped away, started to get up onto my feet, and then panicked as something strong and unyielding held my arm down. I blinked, looked over to see the tiny little wire bent around my wrist, and shouted in a mix of rage and terror.<br>\r\n<br>\r\n“The hell is- ACK!” in a flash, another one was placed around my neck, wrapping me to the tablet quite nicely. I reached my free hand up to the metal and started to pull, it wasn’t enough to choke me or even make it hard to breath, but I could not get up with that holding me down. Fat little fingers pinched at my free wrist, but I fought back with halfhearted waveing and slapping. That hand managed to slip free … so Melson ignored it and starting wrapping wires around my tail. One at the base, one in the center, and one at the tip. I could not even twitch it.<br>\r\n<br>\r\nAnother thin wire was wrapped, and neatly tied around my chest. Just where was he tying them? I thought the tablet was flat! Two more wires wound themselves around my legs, and soon, with nowhere else to go, my one free hand was captured and restrained. The only movement I could control were my whiskers, and the rise and fall of my chest. A slave would be grateful for that, I was just frustrated I couldn’t break through the wire.<br>\r\n<br>\r\n“what is going on here!” I shouted, yelling as best I could without the full range of motion in my neck. Melson ignored me. He placed a hand over my form, a brisk glow flashed over my eyes, and then to my complete and utter shock the tablet I’d been tied to shifted and stretched to match my body. I squeaked, I twitched my whiskers furiously, but I could do nothing to escape. Soon I felt my body sinking into the metal, forming a mold around my spine, tail, and arms.<br>\r\n<br>\r\n“Hmm, this one’s tougher than a mouse his size.” Melson said in self reflection. He was studying me. I had no idea how, but he must be getting some sort of information from this. “Better than average strength, impressive agility, flexibility that is simply too much for a mouse”<br>\r\n<br>\r\n“Now for the official records.\" his hands shuffled around the table until he'd procured a sheet of papyrus, a vat of ink, and a quill. \"Lets see, mouse, blah blah blah, health, whatevers, yadda yadda … oh this part is annoying. Recommendations on attempts to remove the curse\" Melson looked to me, smiled wickedly, and wrote down “Subject Ran Dulac has been returned to normal from a simple remove curse spell, and has begun his journey home.”<br>\r\n<br>\r\nIt was at that moment I knew … I had no hope for aid from these people.</span></div></div>",
            "created":1313185440,
            "id":1166974,
            "title":"Melson decides to keep me."
        },
        "1111111111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I ran for the blades.",
                "I ran for the stairs."
            ],
            "content":"<div class=\"\"><div> <span>That bastard! He went ahead to say my problem was solved, meaning no one would have reason to suspect I was here. He’d get an all new lab specimen to experiment on and I’d spend the rest of my short life in his care. I growled at such a prospect, but I’m not sure how well he heard me. That, in itself, was part of the problem. Even if I could talk just fine, I could not talk loud enough to make much of a difference. There was no way anyone would come down into this hellhole, and even if I was lucky enough for some inspector to notice me I’d be hard pressed to make sure whoever it was knew I wasn’t just a mouse.<br>\r\n<br>\r\nThen came the idea that they might not care. I wasn’t from this city, no one knew me and no one has heard of me. Melson just outright assumed I was a lower class citizen and not worth caring about, regardless of actual evidence. Can it be too difficult to believe others would do the same? At the very least, anyone that Melson would work closely with? Other mice and rats might the only company I have for … how long would he keep me alive here?<br>\r\n<br>\r\nI narrowed my eyes as his fat little hands came near me, I wasn’t about to discover the limits of his mercy though personal experience, I was going to get out of here. All I needed was a little leeway, and a way to get up the ladder. Melson’s fingers pinched around the metal wires, slowly undoing the three along my tail. I smiled and held still.<br>\r\n<br>\r\nThis was my chance.<br>\r\n<br>\r\nI waited for him to undo the wires around my chest, waited longer for the one around my neck. My right hand hurt as he wasn’t too careful removing that one, and my left was the last one to go … he never got the chance to undo that one, as I curled around, gripped the wire end myself with both my right hand and my teeth, then pulled on it myself. It loosened just enough to slip my tiny little hand through.<br>\r\n<br>\r\n“Wha, hey!” Melson screamed, his voice thundering and frightening while his hand shot across to press down on my spine. But I was upright now, and I was curled effectively enough to hold him up. My triangular shaped face pressed hard between the man’s fingers, I shoved through them using my nose like a shovel, and felt the eerie twisting as my body squeezed itself through that small crack in his hand.<br>\r\n<br>\r\nIt was like slipping a silk dress underneath a doorway, I went through easily and started running. Melson’s other hand slapped down at my current location, but I was amongst bottles and blades and jagged, sharp things. Not only did he fail to hold me secure enough, he managed to cut his hand open and spray some of his blood across the desk.<br>\r\n<br>\r\nIt smelled just as bad as his skin did, but I smiled as how easily the fool fumbled.<br>\r\n<br>\r\n“GodDammit!” the man cursed, cradling his injured hand as I scampered in and around the messy table, putting as much junk and as much distance between us as possible. Thinking ahead on how I hoped to get down off the table, I grabbed a loose metal wire and dragged it along with me. Melson starting picking up, and removing the various things in his way. Mostly delicate bottles that’d be rather expensive to replace. Not to mention whatever contents they held were probably valueable.<br>\r\n<br>\r\nI smiled, then started to push one of them off. It was a green bottle, glowing, and with some arid smell that I could not place.<br>\r\n<br>\r\n“Noooo!” Melson screamed as it slipped off the table and down to the floor, shattering and splating at the same time. The smell of molten rock soon filled the room, I looked down to see the solid stone floor melting away as whatever that green stuff was ate through it. Melson tried to walk around the table to the side I was on, but he was slow and cautious having to avoid the acid himself. I scampered through the mess until I was once again out of his reach.<br>\r\n<br>\r\nBut he was fallowing … he could not reach across the table or through all of his equipment to reach me, but he could run around faster than I could run through. If I tried to climb down without distracting him first, I’d never mak- …<br>\r\n<br>\r\n“Ouch!” I squeaked myself as I nicked my thigh on one of the sharp blades. It was a surgical scalpel, incredibly sharp, with a long handle providing accuracy. At this size it looked like a decent enough spear. Holding the metal coil in one hand, I drew the scalpel and held it forward like a weapon.<br>\r\n<br>\r\nI clambered up a corked bottle, making good use of this body’s wonderful sense of balance, then oriented on Melson. I have to tell you, he looked confused when he saw a mouse wielding a makeshift spear readying itself to fight him. That should have tipped me off that something was wrong, for wasn’t this whole town supposed to be at war with rats?<br>\r\n<br>\r\nMabye the magician simply hadn’t seen it for himself, I doubt he was the sort to charge into battle.<br>\r\n<br>\r\nHe reached a hand across the table to try and grab me, but I jumped off and ducked out of the way. The bottle toppled over, the cork flew off, and the scent of alcohol soon mixed with smells of death and melting stone. There were too many smells to sort out here, all of them resulting in a horrible combination. Realizing he could not grab quick enough, Melson picked up a small metal tablet, one without any impression in it, and tossed it at me.<br>\r\n<br>\r\nMetal slammed against metal in an awful, earsplitting sound, but I ran forward to get out of it’s way and jumped immediately after it landed. With the wire in one hand, the spear in my other, I threw the scalpel point first towards Melson’s right eye.<br>\r\n<br>\r\nI smiled as it hit, then flinched as his piercing squeal filled the small chamber. My ears twitched as someone started cheering, but I did not long ponder just who that could be. I used this window of opportunity to tie one end of the wire crudely around some bulky piece of metal, gripped the main length of it with my hand, and repelled down the corner of the table using it’s legs as a brace.<br>\r\n<br>\r\nMelson stumbled, falling to his knees as he howled in agony. I could see he’d already pulled the scalpel out by now and was dripping blood all over the floor. This fight suddenly felt like any one of those legendary tales of a single night in armed combat against a massive, terrible dragon. I knew from experience those tales were generally a load of crock.<br>\r\n<br>\r\nYou need a well trained, specifically armed team of, at the very least, five men to take down a dragon. I’ve done it myself with an army of thirty and some well aimed iron bolts. Any fool who did manage to go one on one with a dragon and win was lucky, not skilled.<br>\r\n<br>\r\nIf Melson was the dragon in my story, then I knew I needed luck more than I needed anything else.<br>\r\n<br>\r\nLuck which, apparently, I didn’t have … the wire was too short to reach the ground.<br>\r\n<br>\r\nWith blood dripping from his face and an annoying chanting or cheering filling the room, I squeaked out in desparation as the man stumbled towards me. He aimed with his one good eye, and attacked with one hand while the other tried to stop the bleeding, but I just kicked off with my feet to spin around the table’s leg. I shuddered as his hand smashed into the metal, jerked around the table’s contents, and made a few sharp cutting tools clatter to the alcohol soaked floor bellow.<br>\r\n<br>\r\nFrom this angle I could see his alcohol spilling off the edge like an oddly colored waterfall. I looked across at Melson’s furious expression, looked down to the floor bellow me, and jumped … I had half of the table’s height to fall down.<br>\r\n<br>\r\nLanding was not pleasant.</span></div></div>",
            "created":1313188380,
            "id":1166988,
            "title":"I try to escape."
        },
        "11111111111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I pick the \"sword\".",
                "I pick the star."
            ],
            "content":"<div class=\"\"><div> <span>I fell, it seemed slow at first, but that illusion was shattered the moment I neared the floor.<br>\r\n<br>\r\nSLAM!<br>\r\n<br>\r\nI smashed onto it with my bottom feet first, I felt a sharp sting flow up from my feet and through to my thighs but it faded quickly as I landed onto four feet. Wasting no time I ran forward for no other reason than to put distance between me and Melson, which turned out to be a bright idea as the man swiped and pounded at the ground where I had just been.<br>\r\n<br>\r\nI didn’t have much time to ponder the implications but I was impressed by how well I could shrug off that fall. It still hurt, but had lived through the equivalent of falling off a two story building and still be well enough to fight. Just what were the limits?<br>\r\n<br>\r\nI was now completely unarmed, the wire left were it was tied. The smells of molten stone were still present but the gaping hole in the middle of the floor was no longer steaming or glowing. Presumably that … whatever it was … acid maybe? Had depleted itself. I was several feet away from Melson before I turned, and he started to stand up.<br>\r\n<br>\r\nHe was more than just furious.<br>\r\n<br>\r\nI could see the alcohol puddle, still growing thanks to that small dripping waterfall, and I could see the now soaked weapons in the center of it. I could try to escape up the stairs, get captured, and end up suffering a worse torment than he’d initially planned.<br>\r\n<br>\r\nOr I could go for the surgical cutting instruments and finish the job. He’d have a hard time chasing after me if I chop through his toes.<br>\r\n<br>\r\nMy ears twitched one more time and then I finally noticed the condition of every caged rat or mouse in the entire room. I could hear them, I could understand them, and by the gods I could sympathize with them. They were all cheering. They all wanted to see me win. A few were offering directions or slinging around encouraging words. One of them, a grey furred mouse that looked a lot like a smaller, lither version of me, was issuing a warning.<br>\r\n<br>\r\n“Watch out!” she called in a feminine voice, to which I responded by immediately charging towards the nearest wall.<br>\r\n<br>\r\nMy back feet lifted off the ground in a comical fashion as an explosive and concussive force hit me indirectly from behind. I turned to see a burning scorch mark in the stone at my previous location, not quite as damaging to the floor as that acid had been but more than lethal if it connects with something like me. I spied Melson raising his arms and making obscene gestures as he prepared to cast again.<br>\r\n<br>\r\nHis hand lit up in indication of power, he thrust his palm towards me … and cursed rather loudly as I dodged him yet again. The explosion cracking the glass of one of the bottom cages, to which the large brown rat inside ruthlessly exploited by smashing his shoulders against the weak point.<br>\r\n<br>\r\nI was disappointed to see the glass hold, but I was too busy dodging a second scorching ray to go help him. I could have kept up the false target charade if he’d fought like a clichéd caster, standing still while blasting smoothly and predictably. I could have stood in front of one cage after another and let him weaken them for me, then eventually they’d break and I’d have some backup in this fight. Surely nothing in this room held an allegiance to that man.<br>\r\n<br>\r\nBut Noooo, none of the people I fight could ever settle for being predicable, he had this crazy idea of fallowing me on foot to make sure of his next shot!<br>\r\n<br>\r\nThis was my turn to curse … I ran right between his legs, squeaked and zagged as a sudden stomp threatened to end my life, then shot underneath the table.<br>\r\n<br>\r\nA scorching ray exploded behind my tail, lifting my hind legs off the ground and sending me head over heels across the floor. I rolled and sprawled, gathering a number of small bruises along with minor burn marks on my feet and tail, but no time to worry about them as Melson ducked down to aim his fire attack directly at me.<br>\r\n<br>\r\nHow many more times could he cast it? I heard his spell pool was supposed to be limited, so surely he could not cast indefinitely. Not that he wasn’t big enough to win a fight with his fists if he got close enough. Assuming the glow in his hands meant he could cast well enough, I shot across the floor, circling around the acid hole, and fell head over heals a second time as that ray exploded at my back.<br>\r\n<br>\r\nThis time my fur singed, my tail was actually burnt, and the concussive force made me dizzy. But I had the added advantage of falling into alcohol. A quick lick of which eased some of my pain, while it aided the majority of my cuts. I could feel it splashing up around me, soaking into my fur, mixing with what little blood still dripped from my wounds.<br>\r\n<br>\r\nThen I realized alcohol was flammable, and my opponent was shooting flames out of his hands.<br>\r\n<br>\r\nThere were five weapons to choose from, one was another scalpel like the one I’d just thrown. If I could stab out both Melson’s eyes I’d be a hero among these mice. But otherwise it was too bulky to use. There was a giant saw shaped tool that I might be able to throw if I could spin it, but it was just too big to use effectively. There was an alcohol soaked ninja star with a hole in the center, I could use that like a shield and a cutting tool if need be … which was odd, because I saw no reason for Melson to have one.<br>\r\n<br>\r\nThere was a small screwdriver, like, seriously small. Small enough for me to use. But that wasn’t exactly a weapon. The last object was a strait blade, longer than my tail but thin enough to wield as an oddly shaped sword. The handle was understandably large, but the blade was single edged.<br>\r\n<br>\r\nLogically, I’d want to grab that screwdriver regardless of what weapon I use, but my choices of a weapon were between that cutting tool and what looked like a ninja star. To hell with figuring out why he’d use one.<br>\r\n<br>\r\nLooking back, I saw Melson’s hands glowing again, I saw the rage and furry in his eyes as he prepared to cast … I had only a few seconds to choose then get out of this alcohol.</span></div></div>",
            "created":1313190900,
            "id":1167012,
            "title":"I ran for the blades."
        },
        "111111111111111111111":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I awoke to an empty room.",
                "I awoke to a room filled with rats."
            ],
            "content":"<div class=\"\"><div> <span>My jaws opened and closed around that tiny screwdriver in a flash whilst my paws gripped hard onto the wooden handle of that metal blade. It was awkwardly large for me, something akin to a greatsword of bastard sword. Not bothering with stance or form, I let the thing splash and drag behind me as I dashed out of the foul smelling puddle. My tail and whiskers flailing with droplets of alcohol spilling everywhere. There was a suggestion of sparks as the metal blade scraped against stone at a decent speed.<br>\r\n<br>\r\nI made a hard and sudden turn to my left, away from the stairway and towards the nearest shelf. Not one of the many with glass rodent cages but rather one filled with tomes, bottles, instruments. Things that were surely expensive and difficult to replace. I saw the shadows in front of me dance around, reacting to the light given off by some arcane spell far behind me. I dove into the air and flipped, curling into a tight ball so only my back and tail were exposed, protecting my vulnerable face.<br>\r\n<br>\r\nPain exploded around me as yet another lance of flame ignited on the floor bellow me. The concussive force tossed me higher and further than I could jump, tossing me hard into the random, multicolored beakers and bottles I was running towards. Tightening my teeth around the screwdriver I uncurled, held a tight grip on that “sword” and slunk behind the liquids and paper lining the far wall. I noticed the hair on my right flank was alight with a small blaze and quickly snuffed it out with my paw.<br>\r\n<br>\r\n“Godamn you, foul rodent! Are you a curse in and of yourself!?” The fat mage shouted while crawling out from under the desk. He examined the blood dripping out of his damaged eye and soaking into his robes. Carefully unfolding from within the relative safety of the shelf, I could see him look through his one good eye and take in jut how much damage he’d taken. The sound of anguish and disgust mixed with a healthy dose of anger and vengeance was something I was used to hearing. It had finally sunk in how this battle would cost him.<br>\r\n<br>\r\nBut I had my own injuries and exhaustion to worry about. Breathing rapidly, my heart beating at a furious pace, and my feet stinging from so much running and falling, I had enough in me for perhaps one more run before I collapsed. My tail still stung with that dull throb, I was hot and tired and smelled like so many awful things at once. I carefully slunk onto four legs and slipped farther towards the back. Putting more stuff between me and mister flubby pants.<br>\r\n<br>\r\n“W-wwaaugh” the man wailed, perhaps on the verge of crying.<br>\r\n<br>\r\nWorking to calm myself and get my breathing under control, I stood up to two legs and gripped that weapon I’d chosen experimentally. I held it out as if it were any other blade, then swung it slowly to the right and left. The weight was rather awkward, but there were a number of reasons ranging from the type of metal, the fact my hands were new, and just the shape of the handle behind that. I was thankful I could hold the thing at all, or that I hadn’t made an egregious error when choosing this tool over another one.<br>\r\n<br>\r\nI huffed one last time and closed my eyes in response to that tingle of fear flowing down my spine, only ending at the tip of my tail.<br>\r\n<br>\r\n‘This sword isn’t much, but it will have to do.’ I thought to myself, lips pressed around the screwdriver in my mouth. While I wouldn’t be able to do fancy tricks with it any time soon, to compensate for the alien strangeness of both the body and weapon the actual blade was ridiculously sharp. This wasn’t a weapon so much as a surgical tool, and as such it’s thin edge was designed to slice through flesh with ease. Well, specifically mouse flesh …<br>\r\n<br>\r\nWas human skin a great deal tougher than a rodent’s?<br>\r\n<br>\r\nWith a shiver making my knees twitch, I assumed as close to a formal stance as possible with these humorously wide hips. My knees bent, toes splayed, and tail painfully erect, I tapped one of the nearby bottles to produce a soft clink.<br>\r\n<br>\r\nClink! Clink! Clink!<br>\r\n<br>\r\nAnd then immediately scurried off to the left, avoiding contact with anything but the bottom of the shelf. Through small gaps and distorted images from the occasional half full bottle I saw Melson stagger his way towards the shelf in an angry huff. He furiously pulled ingredients and potions away from where I had lead him too, and appeared all the angrier once he realized I wasn’t there.<br>\r\n<br>\r\n“DO YOU THINK YOU CAN TOY WITH ME?!” his thunderous voice echoed in my skull, yet another pain for me to ignore as I silently scaled an especially tall bottle with some orange liquid inside. “I WILL GUT YOU LIKE A FISH AND TURN YOU INTO A HANDBAG!”<br>\r\n<br>\r\nThe man’s fists started to glow with arcane magic, his lips were already in the motion to cast another spell. Did the man intend to blow up the entire shelf and everything on it just to get rid of a mouse? I wasn’t too keen on figuring out how far he’d go as with but a light kick I was already diving through the air towards his arm. My left hand gripped the cloth along his elbow, my right hand dug the sword deep into his joint. I was honestly surprised by how cleanly it went in, right between the two largest bones and stabbing through the cartilage. I could see the tip protruding from the other side of his arm.<br>\r\n<br>\r\nAnd I could see his rage transform quite utterly into horror as paralysis afflicted his right arm and his hard learned magics faded away. The man seemed too stunned to move. Or perhaps he was just having trouble seeing me with his one eye. An easy thing to fix, I suppose. Pulling the blade out carefully, I gripped cloth with my two feet and my free hand then started to climb. That sure got his attention. He made an odd moaning sound, like a dog sick with a stomach flu, and began to flail about in an effort to get me off. He couldn’t move the hand I’d stabbed so it was rather easy to climb. Didn’t even have to worry about blood making it slippery, for it trailed down the length of his arm. His other hand seemed torn between keeping his eye from bleeding out, addressing this new wound, and staying the hell away from that surgical tool lest it end up useless as well.<br>\r\n<br>\r\nBy the time I was at his shoulders I stated quite boldly “I wonder how big a handbag you’d make” a few inches from his ear. Not up to calling my bluff, though perhaps not smart enough to surrender, or perhaps pass out from blood loss, he swiped at me with his one usable arm. I lay flat on my stomach, letting the palm of his hand crush my soft, squishy body into his shoulder, then I shot forward. His fingers easy to slip out of, the pressing weight that seemed to jam my ribs into my spine didn’t seem to have any lasting effect, and I was right up in his blood covered face.<br>\r\n<br>\r\nHis good eye disappeared under an ever-growing puddle of red in the first swipe, so in retrospect it might have been overkill to continue stabbing and tearing. Pushing the sword in as far as it would go and twisting it around ruthlessly. I stopped soon enough, but that was because I had to.<br>\r\n<br>\r\nHis weight shifted upon his death, and his body fell over backwards with a wet crunch. In the weightlessness of freefall my tail spun around wildly but my arms and legs seemed to instantly brace themselves for that inevitable collision into a pool of red.<br>\r\n<br>\r\nSPLAT!<br>\r\n<br>\r\nMy fur soaked and that awful smell swiftly getting worse, I dragged myself towards the man’s brutalized skull and pulled my blade out of it. Holding it high for all to see, I could not help but look across the room at the rows upon rows of rodents in glass cages, eagerly looking down to see what I do next. Awkward or not, I could get used to this scalpel-esc tool, it had more than proven it’s worth.<br>\r\n<br>\r\nBut now I was tired, the blood was more than uncomfortable, and I just knew I’d pass out and sleep at some point soon. Looking towards the nearest cage on the lowest point, I clambered down off Melson's corpse and took off running. It was slow at first, a soft pitter-patter that splashed through blood and left sloshy stains on the hard floor, but I soon picked up speed for the charge. Hilt of my sword held high, as soon as I was close enough I slammed it hard into the glass with all my might, forming a healthy crack on the wall. I was exhausted, but it wasn't enough ... so I picked the sword up and smashed again. Then again. My arms straining to move at all, I twisted my grip and stabbed the edge through with a last ditch effort ... then fell asleep on the spot.<br>\r\n</span></div></div>",
            "created":1333997340,
            "id":1312274,
            "title":"I pick the \"sword\"."
        },
        "11111111111111111112":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "We both escape into the city.",
                "Melson ... comes back from the dead?"
            ],
            "content":"<div class=\"\"><div> <span>I slammed to the floor, cringed as my front paws buckled under my own weight, and glanced behind me while trying to regain posture. Landing hurt. I could survive that sort of fall, apparently, but it hurt to move, it hurt to breath, it hurt to …<br>\r\n<br>\r\nIt was about to hurt worse, I could see Melson’s bloodstained hands were glowing. He had the hand with a cut pressed against his bleeding eye, and it fell down his cheeks and onto his shirt. Meanwhile his free hand took on an eerie red glow, oriented towards me, and flexed.<br>\r\n<br>\r\nI didn’t waste any time diving behind the table leg, letting it shield me for a second time as heat and flame roared past. I had to curl my tail around my knees to keep it from getting burned, my ears went wide and spread far away from my head. An attempt at cooling maybe? Somehow my ears got warmer and the rest of me felt cooler, even though the heat should have been completely unbearable. When the flame stopped, I tore out from underneath the table immediately.<br>\r\n<br>\r\nWhen I was a good two feet away I turned back in time to see Melson ducking under it, then cursing as I wasn’t there anymore. He aimed for me with his good hand, I tried to swerve to the far right and prop up against the glass outer walls of the nearest cage, but the man was in an awkward position without any hands to prop him up. He quickly toppled over and the scorching ray shot out from his fingertips to smash into a glass cage a few feet off the ground.<br>\r\n<br>\r\nBlinking, I looked up to see the shattered glass, still holding but now significantly weaker, and a tiny, grey mouse backing away from the superheated material. The scorching ray spell dealt damage with the blunt force trauma involved with the explosion as well as heat damage. It didn’t generally melt or catch things on fire, not that it was incapable of either. The tiny little mouse inside, smaller than me even, ruthlessly pounded her tiny little fists into the biggest crack. She was exploiting this sudden weakness for all it was worth.<br>\r\n<br>\r\nLooking back to Melson, I saw him struggling to get up, struggling to stay alert despite his blood loss. He was now mixed with alcohol and his own dark red, gushing, iron scented blood. The mixture of so many smells, from scorching and melting stone, to ridiculously strong acids, the scents of death, decay, rat feces, sweat, fear, strong drinks … there was just too much to sort through. The only thing I could do with my sense of smell was try to ignore it before my eyes could water.<br>\r\n<br>\r\nMy shoulder wasn’t hurting as much as when I’d landed, and I needed that. I took off running for the doorway as Melson aimed his free hand towards me. His head was just barely above the puddle of alcohol and acid formed hole, if he were to fall over again he’d land in all of the sharp pointy objects he’d knocked over earlier. Trying to make sure of his shot as best he could from a horrid angle, the blood from his bad eye would actually dribble down his face to make things difficult for his good eye. I could only imagine what was going through his mind as he suffered such.<br>\r\n<br>\r\nBut, his hands and clothing soaked in alcohol, his fingers glowing in preparation to cast, I could only stand there and smile.<br>\r\n<br>\r\nAs the man burst into flames.<br>\r\n<br>\r\nFire shot out from his fingers as per usual, but rather than blast forward towards the target it ignited, and exploded, directly onto the robes around his hand. He started to scream, and I put my hands over my ears. It didn’t help much but by the gods could this man scream! Sure, he had enough … eeek!<br>\r\n<br>\r\nI squeaked, growing squeamish myself as the flame danced across his clothing and burst across the puddle, Melson lost his balance while trashing and squirming uselessly in the overwhelming heat … and fell over backwards into the spikes and scalpels and other sharp things. This prompted him to squirm around even more, but that only pushed them in farther. Tearing through his swiftly disintegrating cloths and spilling even more blood onto the floor. His skin blackened, turning crispy.<br>\r\n<br>\r\nAs horrible a fate as this was, made even worse by the fact he wasn’t dead yet, I was pleased with how easy the fight turned out. I scampered around the flaming puddles and the screaming, writhing mage. I glanced up to the other mice and rats still locked in their cages … then I considered if I should try to free them or not. Physically, doing so would be a challenge. The only one I might be able to get out was the female mouse and … oh! She was still pounding on the cage. She looked tired, the glass itself looked about ready to crumble.<br>\r\n<br>\r\nEveryone else? I’d need to find the keys. And then I’d need to be able to get the keys over here. Then I’d need to be able to use the keys. Unless I found an easy way to do it quickly and quietly, getting everyone out before anyone else came down here, THEN somehow making it outside the city without getting captured again. I didn’t actually owe these rodents anything. As cowardly as it may seem, I could very easily just escape on my own. I’m not sure what I’d do afterward, but …<br>\r\n<br>\r\nBut no. If any of these rodents had suffered as much as I think they did, as much as it looks like they did, then it was my duty to get them out. If Melson died right here and now, a fool who lit himself on fire trying to shoot flames at a mouse, then no one would feed, water, or clean the cages. Everyone here would likely starve to death before any other human enters this building. I know I would have tried to stay as far away from that mage as I could, what if everyone else here felt the same?<br>\r\n<br>\r\nThere was a cracking sound. I was standing right at the base of the stairs when that female mouse managed to break apart a small chunk of glass, just small enough for her to squeeze through. You know … if didn’t have a problem with loosing weight the easy way. I was about to call something out to her when …<br>\r\n<br>\r\nWOOOSH! BOOOM!<br>\r\n<br>\r\nThe fire trailed up the alcohol, snaked it’s way over the top of the table, and heated all of the bottles that were stored up there. One of them exploded with a firey, twirling ball of sparkles that danced around the room in ever widening circles before crashing into yet another glass cage. This one smashed open in a shower of fine glass, leaving the three rats inside … ouch.<br>\r\n<br>\r\nOne of them was cut badly and could barely walk, another seemed fine, having been shielded by his companions, the third … was dead. A large pane of glass had sliced his head off.<br>\r\n<br>\r\nLooking towards the table I saw another explosion shoot out from some flaming bottle, this time a blue shower of energy trailed out in all directions, smashing into the roof, the walls, and the floor with a shower of green sparks. All the mice in the area were cowering as far away from the cage walls as they could, save the two rats and the grey mouse who’d managed to free themselves.<br>\r\n<br>\r\nSort of. They still needed to get down.<br>\r\n<br>\r\nAnother explosion, fallowed by two others, went strait into the roof and caused an ear shattering, earsplitting crash. I could see dust and a few stones break loose and rain down into the basement as the floor above us weakened. Another bottle started shaking, popped like corn, and spread a gooey red liquid across the room in quant little splashes. I dodged it, not sure what the stuff did.<br>\r\n<br>\r\nThis place was quickly turning into a deathtrap. And … by the gods! There were more bottles over on another shelf? I covered my ears as explosion after explosion rocketed through the room. Realizing just how ridiculously dangerous this was, I hopped up the first stair and then hopped up the other step. I wanted out of here, nothing I could do to protect the other mice, just had to hope the rest of them lived long enough to escape. This place was pure chaos!<br>\r\n<br>\r\nI hopped step after step, trying to ignore the carnage, the screams, the smoke rising to the roof as the fire continued to burn with all the fuel Melson’s fat body provided it. Once I’d gotten to the door at the top … I realized I had no way to open it. No way to slip through, the crack under the door was only as wide as my head, my shoulders and hips could have never fit. The room was harder and harder to see into, it was just black smoke occasionally brightened by puffs of sparkling magic and the dull orange glow of a steadily burning flame. I coughed a little. The smoke must have been getting to me. Then blinked as a grey, fuzzy fluff ball hopped up the steps towards me. That same female mouse? I blinked as she cleared the step to reach me, gave me a brief hug, then shot towards the door.<br>\r\n<br>\r\n“ThankYouSirNowComeOnWeHaveToGetOutOfHere!” she shouted in panicked, rapid, but otherwise normal feminine voice.<br>\r\n<br>\r\n“We can’t, we need the key!” I shouted at the top of my lungs, mostly making sure she could hear me over the explosions.<br>\r\n<br>\r\n“What? No we don’t, there’s a hole right here! Now come on!” she screamed back, grabbing my paw and shoving her head through the crack.<br>\r\n<br>\r\n“Wha …” I almost fainted with surprise as her chest collapsed in on itself and she squeezed her lithe form through with ease. Still pulling on my hand, I was then forced to do the same.</span></div></div>",
            "created":1313811540,
            "id":1171568,
            "title":"I ran for the stairs."
        },
        "1111111111111111112":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I asked if she used to be human.",
                "I asked how she got here."
            ],
            "content":"<div class=\"\"><div> <span>“I can’t believe their’s actually another one like her.” Melson would continue, looking off to another cage. I was slightly relieved that his gaze was no longer on me, but the fact he’d just wrote a ‘report’ saying I was all fine and dandy I wasn’t in the mood to feel good about anything. My name wasn’t even Dulac! It was Xander! The fat little bastard didn’t bother to ask. Not that I really expected him to care, in light of recent developments.<br>\r\n<br>\r\n“Five fingers on one each front paw, and a sturdy heal on each back leg.” he looked back to me with an insatiable lust for knowledge. “I wonder if you two are related by chance. Haha, an entire family turned into mice against their will? A fool who got a little too used to his new body and decided to fool around with the lady mice? Yes, you’ll be an excellent specimen to study.”<br>\r\n<br>\r\nI was quietly twitching my whiskers as I listened. Another mouse … with five fingers instead of the usual four? Could there really be another human trapped in this awful place? Oh gods, if so then for how long? I’d have to find her and rescue her … I’d have to rescue every rodent in this tiny piece of hell, if I ever got the chance. All I needed was to wait for the wires to slip off, wait for some way to move around, then I could slip up the stairs and through the …<br>\r\n<br>\r\nNo, those stairs were pretty hard to climb. I could manage, probably, but not quickly, quietly, or easily. And that door would be a serious obstacle if I can’t figure out a way to open it. I could probably fight Melson head on and … no … no that would just be stupid. This guy knows magic, he’s bound to have at least a low power offensive spell. Given his profession it’s probably some form of paralysis or restraining magic. Not to mention all of his equipment, some of which is bound to be enchanted.<br>\r\n<br>\r\nLike this tablet.<br>\r\n<br>\r\nMelson sighed as well, putting his paper away somewhere I could not see, then cupping his hand over me. I saw nothing but fat fingers, then nothing but a blue glow as it enveloped my face … then I felt something warm and wet creeping up over my shoulders. I blinked, tried to look down, then gasped. It wasn’t the wire keeping my held in place, it was the metal itself slowly molding around my shoulders, my cheeks, my ears. I tried to squirm, but of course that did nothing. I was already held immobile while this metal liquefied and oozed around me.<br>\r\n<br>\r\nMy tail sunk in, fallowed by arms, my legs, and my hips. My belly and face were still sticking out for a while, which I took full advantage of by breathing in as much as possible whilst air was cut off from everywhere else. My fur seemed to clump together, I could feel my own sweat build up as it now had nowhere to go, and the entire thing was warm. Very warm. Not scaling hot, but warm enough to be uncomfortable. Stupid laws of thermodynamics.<br>\r\n<br>\r\nI stared up at the ceiling … or rather that single bright lamp that made seeing the actual roof impossible. My eyes were pleading, my mouth wasn’t able to move anymore, I just sucked in air through my nose and twitching my top two whiskers. It felt extremely unsettling to note that some of my facial whiskers were trapped in the metal tablet.<br>\r\n<br>\r\nThen the entire thing closed around my face.<br>\r\n<br>\r\nI would have screamed if I were able, the air was suddenly cut off completely, it was darker than even a moonless night, it was stiff and muggy and hot with only the scent of my own sweat to fill my senses.<br>\r\n<br>\r\nI heard Melson giggling. This was the moment I swore, to myself, that I would figure out a way to kill that bastard even if I had to be a ghost to do it. I could feel the tablet lifting up, then moving, before sweet, sweet air pushed through a parting metal seal. No light came through, so the metal was still molded around my face, but with my nose sticking out I could breath clean … ok, I could breath <i>air</i>, no matter how distasteful it’s content, and smell something other than myself.<br>\r\n<br>\r\nI heard something sliding open. I heard something squeak, probably another mouse, fallowed by a beautiful sounding feminine voice.<br>\r\n<br>\r\n“Let him go you big s-stupid … stupid <i>HUMAN</i>!” shouting out that last word as if it were a curse. Her voice was pleasing for three reasons, the first being that it sounded … well … normal. It wasn’t loud and thundering, or eerily quiet. She spoke out, which made her sound different than that interrogator who was being deliberately quiet. The second reason was that she hated Melson, meaning that at least for the moment no sort of mind control was going on. No matter how bad the prison is, so long as I can think of an escape and hope for an escape, there is a chance I’ll escape. If I’m somehow convinced that I like imprisonment, getting out is never going to happen.<br>\r\n<br>\r\nThe third reason I found her voice charming, was that it was a ‘voice’ … I wasn’t going to be alone with my thoughts, I’d be talking to other mice. Salving off boredom and terror alike with conversation and emotional support. There were more than one rodent in each of the cages, so even if I couldn’t see anything I was fairly certain I’d be placed in a cage with someone else.<br>\r\n<br>\r\nSomeone with whom I could actually talk to. <i>Without </i>screaming at the top of my lungs. But whilst I was taking keen notes on every aspect of that single spoken sentence, Melson was ignoring her entirely. He probably couldn’t hear her speaking, even if she was speaking actual Umea or it was somehow magically translated for him.<br>\r\n<br>\r\nI heard a metallic ‘click’ as the tablet dropped into something hard, then stretched out my injured, bleeding tail as the metal seemed to slide off of it. It vanished from my legs, my waist, my shoulders … I held my hands up to my neck and tried pulling at the stuff as my head was the last to go. Gasping for breath, so delighted to be able to take an entire lungful and breath in through my mouth, I collapsed to the floor. I took note of a tiny little gray mouse sitting in the corner, then tried to look up at the top of the cage.<br>\r\n<br>\r\nMy head wouldn’t work, so I immediately went for the next best thing and rolled over. Laying on my back, I could see Melson’s hand glowing with a soft blue while shifting, liquid metal floated just underneath his palm. I twitched visibly as he pushed on the glass wall to my left and the entire room began to shift and slide to the right. This wasn’t a cage, it was a glass shelf!<br>\r\n<br>\r\nLazily looking to the left, then to the right, then back to the roof hosting a strange glow from a tiny little lantern … I realized it was a very good way to hold something in place. This thing would be difficult to escape from, and that’s even <i>without</i> taking unknown magical wards into consideration. I groaned, glancing back towards the open glass ‘wall’ that showed out into the actual room. Melson was no longer watching me, nor my cellmate, he was over at the desk looking through papers and bottles.<br>\r\n<br>\r\nI glanced to the other walls and saw that these weren’t clear, either they weren’t glass at all or someone had painted over them. While trying to sit up I wondered if they might be enchanted to dull and clear at Melson’s word. But at least they weren’t one way. It would have been an even more intimidating prison if Melson could see inside, but it was too heavily tinted for us to see out. I was just busy thanking whoever birthed that monster for just how inexperienced he was at the prison warden business … if this qualified … when soft, gentle hands forced me to lay back down.<br>\r\n<br>\r\n“Don’t sit up, you need your rest sir. You’ve lost a lot of blood and … and this must be a hard day for you. Just don’t, I’ll … I’ll try to treat your wound.”<br>\r\n<br>\r\nI blinked, struggling for a moment before realizing I didn’t have the energy. Not being able to breath readily will do that to you. “Thank you mis. My name … is …” it was much harder to talk then I thought it’d be. More draining. She scurried over to my tail, poked it a bit, then pressed her hands around the bleeding area and started to tighten hard … there wasn’t any cloth to wrap around it, so she just kept holding it. Painfully so. Until the last bit of bleeding stopped and all that could seep out was droplets of plasma.<br>\r\n<br>\r\nIt didn’t actually take long, but it was enough time for me to get my energy back.<br>\r\n<br>\r\n“My name is Xander. What’s yours kind mis?” I asked.<br>\r\n<br>\r\nShe turned and smiled, weird seeing a smile on the face of what was clearly a mouse. But even her eyes looked expressive.<br>\r\n<br>\r\n“My name’s Maori. Anything I can do to help, so long as you return the favor once I hatch an escape plan.”<br>\r\n<br>\r\n“Escape … yes, we have to escape.” I nodded in agreement.<br>\r\n<br>\r\n“And kill that …”<br>\r\n“And kill that …”<br>\r\n<br>\r\nWe were both talking in union while glaring towards the fat little wizard mumbling at his desk. We stopped looking at him and started looking at each other … I noticed her five fingers, one too many for a normal mouse. Interesting how many things we had in common.<br>\r\n<br>\r\n“If your escape attempt involves putting a nail through his ear, I’m all for it.”<br>\r\n<br>\r\nMaori smiled.</span></div></div>",
            "created":1314450420,
            "id":1176052,
            "title":"I never get the chance."
        },
        "11111111111111111121":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "“Your not” Maori broke the silence",
                "“Sorry, I ju-” Maori broke the silence"
            ],
            "content":"<div class=\"\"><div> <span>“So you want Melson dead too huh?” Maori giggled. “That sure didn’t take long. How’d he manage to catch you?”<br>\r\n<br>\r\nI started to sit up, propping my arms under my spine and leaning my chest forward. At the moment I was looking at Moari’s face from between my legs, and she was looking at me from … lets say, an interesting angle. But her attention was thankfully focused on my tail and on my answer.<br>\r\n<br>\r\n“I …”<br>\r\n<br>\r\nShe was apparently too focused, for she interrupted me the moment I started to talk.<br>\r\n<br>\r\n“I bet it was the trap cages wasn’t it, they stick giant rectangle traps inside mouse holes so that they snap shut right as your running to safety. That’s how they got me, one of those monsters chased me inside the wall …” her face twisted into a mixture of anger and sorrow. “Then it … then the thing laughed as it caught me.”<br>\r\n<br>\r\nThe fact she kept calling humans ‘monster’ or ‘it’ was concerning, but I decided to shrug it off. This poor girl had been through a lot.<br>\r\n<br>\r\n“Actually I was just walking into the street when some passing lady stepped on my tail. She sc- …”<br>\r\n<br>\r\nBut she cut me off again. “Walking into the street!?” her voice filled with shock and outrage. “How in the nine Litter Boxes did you end up in the streets?”<br>\r\n<br>\r\nI blinked at the rather colorful language. Nine … litter boxes? Well, I guess that’s a close enough parallel to hell. From a mouse’s perspective. Answering the question “I was trying to find someone who could give me a ma- …” but she interrupted me again.<br>\r\n<br>\r\n“Find someone? You mean another mouse? There’s a mapmaker in this city?” she seemed excited.<br>\r\n<br>\r\n“Well, no … I mean I would have if I could find one, but I was searching for a human mapmaker. Anyone who could give me directions.”<br>\r\n<br>\r\nMaori leapt back in complete and utter surprise. “You were actually looking for a <i>human</i>?! Why? What could you possibly be thinking!”<br>\r\n<br>\r\n“I can talk can’t I? I can still speak Umea even with these new vocal cords, and most people you meet are actually nice. At least the one that caught me di- …”<br>\r\n<br>\r\n“Nice?” she screamed, shaking her head in disbelief. “Where the heck have you been? There’s no such thing as a nice human.”<br>\r\n<br>\r\n“There are plenty. The guy who captured me comes to mind. I wish he could see what was going on here.”<br>\r\n<br>\r\n“You were captured by a human and your sitting here telling me, with a completely strait face, that it was a nice one? What did you somehow fail sarcasm school or were you trying to be serious?”<br>\r\n<br>\r\n“There’s more to it than that, I did happen to give myself up. You jus- …”<br>\r\n<br>\r\n“What?! Are you mental? You actually wanted to come here? Oh of all the …”<br>\r\n<br>\r\nI interrupted her this time. “You just never let me finish a sentence.”<br>\r\n<br>\r\nMaori turned her back to me and slumped. “Sure I have, but every sentence out of your mouth is horrible and stupid. Mostly stupid.”<br>\r\n<br>\r\nI slapped a paw to my face, having difficulty accepting what I was hearing. “Can you at least let me finish?”<br>\r\n<br>\r\nHer ears perked, the mouse sighed … then she finally turned around and nodded. “Might as well. Not much else to do while trapped here.”<br>\r\n<br>\r\n“Alright, now first off I’m a royal guard.”<br>\r\n<br>\r\nShe blinked, starting to interrupt me. “You know the king? And your not afraid of Giantkind? Are you from the Infernal Depths.” she actually smiled, her face brightening a bit … before me shaking my head brought her euphoria back down.<br>\r\n<br>\r\n“No, I’m from Iron Wall. Never heard of that place.”<br>\r\n<br>\r\n“Iron … hey wait, that’s a human kingdom, lead by …” she started to piece things together.<br>\r\n<br>\r\n“I am Xander, bound to serve Lord Reginald Finny. It was during my duties when a magic wielding assassin broke into the castle … or maybe he teleported, I didn’t actually see him come in … he tore through other guards and just left them on the floor, but I guess I pissed him off. He cast something at me, and for the past two nights I have been living in the rather disorienting position of a mouse.”<br>\r\n<br>\r\nShe backed away, the female looked … horrified actually. I wasn’t sure how to handle this sort of reaction, but knew that stepping closer would have been a bad idea. “S-so … you’re a … you’re a …”<br>\r\n<br>\r\n“A human?” I finished, nodding. Then I held my right hand up for emphasis. “Five fingers and all. Guess some aspects still shine through even the toughest magic.”<br>\r\n<br>\r\n“A … human.” She almost choked on the words. It was something of an insult for me, were we really that bad? I can’t picture the last time I saw anyone back home mistreat any animal. Hmm … but then Iron Wall had these little magic charms that kept small critters out of the food supply, so we didn’t have to kill any. It got me thinking just how different the dynamic is when each side is fighting for the same food, and each needs it just as desperately as the other. Then of course, there was Melson. Who by all counts of decency should be tried as a criminal.<br>\r\n<br>\r\n“Yes, I’m a human … or I was … the lady who stepped on me screamed, one thing lead to another which lead to a group of city guards hearing me speak. I let myself be captured because I figured that was easier than resisting, then after a short interrogation I was sent here.” I paused a bit, tilting my head. “I am not that gross. I bathe once every month, I keep clean.”<br>\r\n<br>\r\nMoari was pressed against the wall, trying to stay as far away from me as possible. “Only once a month!?” somehow, this outraged even more than Melson had. “EwEwEwEwewewewewew!” she closed her eyes, shook her wrists frantically, and tried to wipe them off on the glass. “I can’t believe I actually touched one! Gah! And there’s even slime on my hands! Ewwww! GetitoffGetitoffGetitoff!”<br>\r\n<br>\r\n“That’s blood, not slime! You were touching an open wound!” shaking my head at her showy display of distaste, I decided to interject. “We aren’t all as creepy or vile as that Melson guy I’ll have you know.”<br>\r\n<br>\r\n“Ewwww … J-just stay um … over there. Waaaaay over there.” she pointed to the far corner of the cage.<br>\r\n<br>\r\nSighing, I obliged. “Well I guess this answers one of my next questions.”<br>\r\n<br>\r\n“W-what question … no! Don’t turn around, just … just sit there.”<br>\r\n<br>\r\n“Well, Melson seemed interested in the fact I had five fingers. That’s not supposed to be normal for mice is it?”<br>\r\n<br>\r\n“N-no …” I turned around to look at her, and she seemed downcast. “I was always considered weird as a child, because of that, but there are worse mutations. Six feet being the prime example. Or giant bat wings. Or being born without fur.”<br>\r\n<br>\r\nSmirking some at the mental image of a naked mouse. “The fat idiot put me and you in the same cage because we both have five fingers.”<br>\r\n<br>\r\n“Why? It’s not that special is it?”<br>\r\n<br>\r\n“I’m pretty sure my hands are weird because I’m a transformed human, not a natural born mouse. I just figured, as I’m sure Melson has …” I stalled.<br>\r\n<br>\r\n“What? You figured what?” Maori leaned forward, eager to hear what I had to say. She didn’t object to the fact I was looking at her, from this distance at least, so I kept staring.<br>\r\n<br>\r\n“I figured I’d ask if you used to be a human as well. Even as a child or something, but I guess that’s stu- …”<br>\r\n<br>\r\n“Stupid!” she shouted. She tried to say something else, but it devolved in incomprehensible ramblings for the most part. The few words I could make out “B-but … no, that’s just stupid, completely stupid … I …” then she got her rage back. “I am a MOUSE! And don’t you EVER forget that you fucking HUMAN! You stay on your side of the cage, I’ll stay on mine, and lets make every effort to keep your air from touching my air.”<br>\r\n<br>\r\nWith that she turned in a circle and slumped into her little corner. I stuck my tiny, triangular shaped nose into my own little corner and curled up as tight as I could. It was surprisingly tight, and surprisingly cozy. This new spine just seemed to bend the right way for sleeping in cramped spaces on a flat floor. At least compared to my old body.<br>\r\n<br>\r\n“My apologies for disturbing you M-mis …”I almost said ‘maori’ but figured ‘mis’ would be less personsl and thus less likely to make her lash out. “I shall do my best to keep my presence from making you ill. I didn’t know I was that disgusting.” then with that, I was quiet.<br>\r\n<br>\r\nShe was quiet.<br>\r\n<br>\r\nEven Melson and the other rats were quiet.<br>\r\n<br>\r\nThere wasn’t any food around, no beds, no water to drink. It wasn’t even dark enough to actually fall asleep. Great if you plan to stay up or want to feel welcomed, but when you don’t have anything to do or anyone to talk to the light just gets annoying.</span></div></div>",
            "created":1314608460,
            "id":1177117,
            "title":"I asked if she used to be human."
        },
        "11111111111111111122":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "Just what is this \"Rat army\"",
                "What do you know about this city?"
            ],
            "content":"<div class=\"\"><div> <span>“You and a dozen others, at least by the looks of things. I haven’t had a chance to talk with anyone sense that monster trapped me in here. No one else ever goes into my cage … I’m glad I finally have a cellmate. It’s an awful feeling, being so lonely for so long.”<br>\r\n<br>\r\n“How long were you in here?” I asked, both worried and concerned. If she was here for very long it meant my chances of escape were low. Likewise, if she was here for very long it meant she had been suffering for that entire length of time. Practicality meets empathy, and the meeting went well.<br>\r\n<br>\r\n“I’ve been here for about a week or two. Too long, far too long, I’m supposed to be looking for the … well.”<br>\r\n<br>\r\nI cocked an eyebrow, slowly sitting so I could nurse my tail’s open wound and sit on my hind legs for once. “Looking for what?”<br>\r\n<br>\r\n“You’ll probably think it’s silly, but I was looking for the Infernal Depth. I found this old map that states it’s somewhere on an Island to the east, buried in a volcano, and surrounded by giant mouse-eaters.”<br>\r\n<br>\r\nBlinking at the description, all I could tell was that it was well defended. Unless the ‘giant mouse eaters’ were just normal sized things that happened to eat mice. “That place sounds … dangerous. So it’s what, a vault or something?”<br>\r\n<br>\r\n“No! It’s a kingdom, the Dragon-riders and the giants made some alliance with the Armor king generations ago.”<br>\r\n<br>\r\n“I think your going to have to start over from the beginning, I haven’t heard of any of this.”<br>\r\n<br>\r\nMaori sighed deeply, glanced towards the grumbling Melson, then nodded. “Probably should. I am Maori Whiteborn. Orphan child thanks to a vicious feline, and tactical scout to the Green Wall Kingdom.”<br>\r\n<br>\r\n“Green Wall? Wasn’t that place destroyed a few decades ago?” my brow furrowed in confusion.<br>\r\n<br>\r\n“Well of course, how else would mice be able to take control of it? If there were still humans living there we’d hardly want the place. But please don’t interrupt if you want to hear the end of this.”<br>\r\n<br>\r\nI repeated the words ‘if there were still humans’ in my head over and over before nodding. “My apologies mis.”<br>\r\n<br>\r\n“Call me Maori.” she winked before continuing. “Anyway, about a month ago this army of Blood Rats calling itself the ‘rat army’ … stupid name in my opinion, it’s too cliché, declared our lands were under their control, and that we’d have to surrender and submit to their slavery if we had any hope of survival …” she blinked, showing the same concern and sadness she’d had when I first saw her. “Those were trying times. We lost many good soldiers trying to defend against them, but th- …” she was now gasping at the words.<br>\r\n<br>\r\n“You don’t have to tell me right now, I’d u-understand.”<br>\r\n<br>\r\n“No! It’s not that it’s just … w-we … their sacrifices gave us enough time to close down the walls and seal all the cracks. They even kept most of the engineers alive so we could repair any damage their rock slingers and heavy bruisers did to the wall. But it’s siege warfare now, it’s not a matter of who wins or not, it’s a matter of who can hold out the longest. From what we’ve seen, and that even some of the Dragonriders are having trouble with them at their home, our little castle isn’t even taking up their full attention. Meanwhile we are scrambling to get by.”<br>\r\n<br>\r\nThinking it over, it sounded like her people were up against superior numbers rather than superior forces. If they didn’t have heavy artillery … wait, what was I thinking? What ‘artillery’ can a rat create that would break through human masonry? But I shook off such thoughts, better not to seem condescending. “So you don’t think you can win.”<br>\r\n<br>\r\n“Not on our own no, not if they can keep us pinned down without the slightest effort. But if we give them the castle, they’d just get even stronger! So we hold out to the last breath. I was … I was sent as a desperation effort, me and … me and five others … snuck past the army and were sent to find the Infernal Depths to seek aid from the Armor king who rules there. Only … only me and two others actually made it into the forest alive. We all had to split up to throw the army off our trail, and … and …” a tear rolled down her nose and splashed onto the white floor.<br>\r\n<br>\r\nI reached an arm out and tried to hug her, which she gratefully accepted. “I’ll do what I can to help Maori, this I swear.”<br>\r\n<br>\r\n“I’m supposed to be strong, but if I can’t get out of this human city and find the Armor king, then all of their deaths will be meaningless. I j-just … I can’t accept that.”<br>\r\n<br>\r\n“Indeed, the first step is to get out of here. Away from that creep Melson, perhaps get to Ronald and tell him what’s going on in here.”<br>\r\n<br>\r\nMaori perked her ears up into my chin, still on the brink of sobbing but restraining the actual tears. “Wh-who … who’s Ronald?”<br>\r\n<br>\r\n“A human I spoke with. If he saw what was going on in this room, and what Melson was lying about on paper, I bet we’d be out of here in no time.”<br>\r\n<br>\r\n“You … wait, you can speak with humans?”<br>\r\n<br>\r\n“Well yeah, I uh …” I started to explain, but gulped when she cut me off.<br>\r\n<br>\r\n“That’s, ugh! That’s disgusting. How could you ever stand staying close to one long enough to learn? How did you keep your eardrums from exploding?”<br>\r\n<br>\r\nFiguring this wasn’t the best time to mention that I wasn’t really a mouse, I went with a half lie. “It’s part of some … magic, thing … yeah. And hey, it will come in handy later on, trust me.”<br>\r\n<br>\r\n“I mean, I know I can understand humans, and that’s not supposed to be normal … but for a mouse who isn’t training with the Armor king to actually speak to them? That’s just … that’s just ludicrous.”<br>\r\n<br>\r\n“Well bathe me in butter and call me ludicrous, because I’m not giving up my only advantage.”<br>\r\n<br>\r\n“Bathe you in …” she seemed stunned for a moment, then hugged me tighter while bursting into giggles. “I’m s-sorry for making fun of you, I’m not trying to honest, I just haven’t had someone to talk to in so long.”<br>\r\n<br>\r\n“It’s fine Maori, I understand completely. I wouldn’t want to spend this much time with Melson either.” I glared through the glass cage, then blinked as the fat man got up and started climbing the stairs. He was too far away for me to hear anything but I could see him stomping his way up and shoving through the door.<br>\r\n<br>\r\n“I just have to save the king, I can’t let everyone down.”<br>\r\n<br>\r\n“That’s another thing I understand completely.” considering how badly my luck went with my rescue attempt, it would be karmic fate Maori was somehow permanently transformed into a human while I spent my days as a mouse. Heck, all Melson would have to do is have a change of heart, try to turn me back, and get which mouse is which a little mixed up. It could happen!<br>\r\n<br>\r\nMoari looked up at me and asked. “Just what has you so worried? You thinking of an escape plan already?”<br>\r\n<br>\r\nSmirking I sat down to four legs so I could see her eye to eye. I was taller while sitting up, but like this our heads were at roughly the same level. Only my spine and rump actually looked big enough to distinguish us too, as hers were unusually slender.<br>\r\n<br>\r\n“Actually I was hoping to clarify a few things …”</span></div></div>",
            "created":1314613860,
            "id":1177145,
            "title":"I asked how she got here."
        },
        "111111111111111112":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "\"Say hello to Joyline for me\"",
                "\"Don't forget your rent is due.\""
            ],
            "content":"<div class=\"\"><div> <span>“So, wait, you mean you can’t remove this curse then? We have to hire a someone else?” Ronald asked, trying to take everything in. I was too busy trying to stay conscious to pipe in with my own concerns.<br>\r\n<br>\r\n“Hohohoh! You’d have to get a completely different caliber of magician, boy. I’m talking someone with the power to summon meteor storms, enough magic to decimate an entire kingdom! Whoever cast this spell did so at a permanent cost to their total spell pool! In theory one could remove the curse by killing the original caster, but that’d be even harder than creating an anti-spell.”<br>\r\n<br>\r\n“I have no idea what that means.\"<br>\r\n<br>\r\n“Of course not\" Melson sighed, reaching a hand down to pick me up none too gently. “To cure this creature myself, I’d need to cast a spell that constantly reverts him to his natural form just as often as the current curse traps this thing in the body of a mouse. Not only would that be at a permanent cost to my total spell casting abilities, but it’d take more magic than I actually have! If you ever need to repeat that to your superiors, just say it’s long, complicated, and expensive. I’ll work on it.”<br>\r\n<br>\r\n“Ok then.” Ronald balked. Glaring slightly at how I was held. “But what was he before? Do you know what the original form was?”<br>\r\n<br>\r\n“Of course I do, human! Wouldn’t waste this sort of power on a toad now would you?”<br>\r\n<br>\r\n“Wha, human!? Then why are we keeping him in a cage!” Ronald burst.<br>\r\n<br>\r\n“He’s not human now, is he? A cage is probably safer than anything else we can carry him in.”<br>\r\n<br>\r\n“There is such a thing called dignity.”<br>\r\n<br>\r\n“Bah! The man was probably a barbarian savage, or some street urchin who begged the wrong person for food. Don’t worry about it boy, worrying is not going to make things any easier.” Melson stated condescendingly … at the same time carrying me over to the cage I’d come in on. I had barely even gotten to examine the room, and already I was placed back into darkness!<br>\r\n<br>\r\n“I still don-\"<br>\r\n<br>\r\n“You just go on home, I’ll handle things from here on out. These are complex magics, and surely you could not hope to comprehend them well enough to help. Even in the slightest.”<br>\r\n<br>\r\n“My shift isn’t over, I still have to …”<br>\r\n<br>\r\n“Then go report this mouse’s whereabouts, I’ll let the captain know if anything turns up from my research here. So far as it concerns you, this little mouse is, well, no longer a concern.”<br>\r\n<br>\r\n“After how I’ve just seen you handling this ‘mouse’ I’ll think not. I can watch over the little fella better than you can, you have rows upon rows of rodent habitat and hundreds of different subjects to care for. I only have one pet, and as such can focus on him.”<br>\r\n<br>\r\n“What does that have to do with anything? You don’t know how to cast magic and you don’t have the mental capacity to do anything along the lines of scientific inquiry. I doubt you can even read.”<br>\r\n<br>\r\n“Say that one more time and I’ll crush your fingers.”<br>\r\n<br>\r\nI could hear Melson snorting. “Hoho! Oh really? I doubt you can eve- … gack!” the man didn’t get to finish his statement before Ronald was on him. I scrambled to look through the tiny air holes and see how the fight was going, but the angle was off. I never got the pleasure of seeing Melson in a chokehold, or slammed against the wall, or whatever it was Ronald was doing to subdue the man. All I could hear was the shuffling as they both struggled for control.<br>\r\n<br>\r\n“I’ve spent years scouring every tome I could find, greedily thirsting after every scrap of knowledge any passing merchant might bring in. I don’t care how well your little lab full of cages works for holding war criminals, but if that’s how you handle an injured mouse then your either too dumb to care for him properly or your too sadistic. Frankly I don’t care which, he’s not staying with you.”<br>\r\n<br>\r\nI heard someone gasping for breath, then I felt my cage jerk suddenly as someone picked it up.<br>\r\n<br>\r\n“I c-could *cough* I could …” Melson was too out of breath to finish a sentence.<br>\r\n<br>\r\n“If you still want to get paid for this then what you can do is work out a possible solution. Otherwise I’ll just go find a better magician to change him back to normal.” after a pause, Ronald added. “Unless you want to go again? Your magic really should give you an edge once you can breath again.”<br>\r\n<br>\r\nMelson seemed to consider this, or at least I interpreted the unseeing silence as deep consideration. I had entirely too much time to think about the smells of death, and rat pee, and decaying bodies that lingered at the edge of my awareness … it made me wonder just what Ronald knew about Melson that I didn’t. The fat mage was supposed to cage war criminals? When waging war against puny rats I guess the magi/scientist who experiments on them would be the ideal choice to hold them.<br>\r\n<br>\r\nSo if Ronald wanted to make sure I wasn’t kept here, it meant he wanted to make absolutely certain there was a distinction between me and the rodents they're fighting.<br>\r\n<br>\r\n“Fine. Come back in a week or so, I’ll send a messenger out for information and have at least a plausible answer by that time.”<br>\r\n<br>\r\n“Thank you, oh wise bottle-lord.” Ronald managed without a trace of sarcasm. “And now how much for that bottle of sleep aid?”<br>\r\n<br>\r\nThe cage shook as Ronald turned and pointed at something, but I couldn’t see much.<br>\r\n<br>\r\n“Hmm? Oh! You mean you’re here as a customer too … thirty silver pieces, but remember to only take a drop. Down the whole bottle in a night and you’d be asleep so long you’d starve to death before you awake.”<br>\r\n<br>\r\n“I’ll take it.” some more shifting, the sound of coins jingling in a bag, then finally footsteps through a doorway. “See you in a week.”<br>\r\n<br>\r\nThe door closed. The scent of death and horror vanished, to be replaced by pie and pasta and cake … such a drastic difference in the two. And then I heard the quiet footsteps of a thousand different people as Ronald made his way through the streets.<br>\r\n<br>\r\n“Okay, I’m taking you to my home for a while. Not sure what all we can do here, but I believe there is such a thing as human decency. I’ve got a pet rat you mig- … oh wait, your not a real rodent. Well I’ve got a pet rat and I’ve studied mice, so I know what will make you feel comfortable until someone can change you back. But I’ll only have time to drop you off before I’ve got to go, my shift isn’t over yet.”<br>\r\n<br>\r\nI nodded … before realizing no one could see inside the cage. So I shouted instead. “THANK YOU!” which was almost as loud as my growling stomach. I still hadn’t eaten yet, and all that food smell around me made my mouth water.<br>\r\n<br>\r\nThe cage shifted and shook, to which Ronald responded by saying “Sorry ma’am, won’t happen again.” to whoever it was he’d bumped in to. <br>\r\n<br>\r\nWas I really going to stay like this for a week? Okay, at the moment it didn’t sound so bad. So long as I got something to eat and drink soon enough I probably wouldn’t even suffer through it. Relaxing in a cage next to another rat sounded far more pleasant than traveling through monster infested jungles on my own, or sliding down the gullet of some starved predator. But then what happens if I never turn back to normal? What if this spell was completely irreversible through conventional means?<br>\r\n<br>\r\nWell, if that were the case I wouldn’t have bothered with a normal, boring life inside a cage. I’d hunt down that black garbed spell caster and kill him, see if that breaks his spell. True I might just end up with an even more horrible curse, like turned into a worm … or a sock … or a toilet. But chances were I’d die a more interesting death long before that could ever happen.<br>\r\n<br>\r\nIt wasn’t hard to make the decision that an interesting death was more fun than a boring life. No way was I going to die of old age munching on cheese.<br>\r\n<br>\r\nI heard a door open, then the sounds of someone stepping on dry wood.<br>\r\n<br>\r\n“Morning Ronald. Took your little pet for a walk I see?”<br>\r\n<br>\r\n“Nope, cought him in the streets a little earlier. This is the mouse that beat up Sir Nickolas.” my cage shifted as he held it up higher.<br>\r\n<br>\r\n“Oh wow.” the feminine voice from somewhere to my left sounded surprised. <br>\r\n<br>\r\n“Talk to you about it later, for now I’ve got to drop him off then get back to work.”<br>\r\n<br>\r\n“Oh, alright then.” the lady muttered as Ronald walked off. Just before she called out …</span></div></div>",
            "created":1314839100,
            "id":1178709,
            "title":"Ronald decides to hold onto me."
        },
        "1111111111111111121":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I fail, and fall back down.",
                "I hit the side of the cage, and it tips over."
            ],
            "content":"<div class=\"\"><div> <span>“Say hello to Joyline for me” <br>\r\n<br>\r\n“Eh? Oh sure, sure.” Ronald responded before walking making his way through dimly lit hallways. I felt a tingling in my spine as the cage went from chest height to the floor in an instant and gravity seemed to vanish, before it came back in stride as I actually landed. “Ack! Sorry little gu- … erm, Xander.”<br>\r\n<br>\r\nI grumbled a half inteligable response, knowing full well he wasn’t going to hear anything I said, while his hand rummaged through his pockets. Keys appeared amidst the clatter of metal on metal, I heard a click as he jammed it into the door, and then a loud creak as the door opened. My cage was hefted up, I was carried into the room and placed on … something. I couldn’t really tell what was in here, the place was so dark.<br>\r\n<br>\r\n“Hello Joyline, Cicily says hello.” Ronald called into the darkness, to which there was no response.<br>\r\n<br>\r\n“Um … who are you talking to?” I started to ask, before the top of my cage of unlocked with a small ‘click’ and the metal portion slid up.<br>\r\n<br>\r\n“Play nice with each other, I’ll be back in three hours if I’m not booked for overtime.” he hurried out the door, and then the entire room got darker as he close it. I heard nothing but his distant footprints as he walked off and left me alone … in a room … with someone called Joyline?<br>\r\n<br>\r\n“Um … hello?” I called out, still sitting in the cage but now able to look up at a roof. “Is anyone … Gah!” I squeaked and fell over backwards as a massive, white, whiskery face peaked over the edge of my metal cage.<br>\r\n<br>\r\n“Hello there, I’m Joyline. Who are you? Are you another rat? No your too small. Need help getting out of the cage? I like cages so long as Alpha Rat leaves the door open, otherwise I don’t like cages, not much room to explore.” staring down at me with soft white fur, silvery whiskers, and bulging red eyes was a rat. A docile looking rat with clean fur and the faint scent of soap, but still a rat.<br>\r\n<br>\r\nThe first thing about her I noted was the fact she was a rat. With a rat smell. Rat smell that smelled suspiciously like rat pee. I wasn’t entirely sure why the fact she was a rat made so many alarm bells go off in my head, but it was hard to focus on anything else. Maybe because rats eat mice? I’d probably focus on a cat the same way if I ever saw one.<br>\r\n<br>\r\nThe second thing I noticed was how feminine she was, eerily attractive in appearance, smell, and sound … but then their’s that whole ‘she’s a rat’ concept which ruins it. Her fur was white, her tail was long and thick, she had these pinkish spots of fur along her back and left cheek. The third thing I noticed as she leapt over the walls and into my cage with a soft <i>Wump</i> was just how <i>BIG</i> she was!<br>\r\n<br>\r\nThis rat was huge! A little under three times my size! Looking at the difference between me and her was like noting the difference between a human and an ogre! She was more muscular too, I could actually see the muscles bulging in her haunches and on her arms. When she opened her mouth to talk I saw razor sharp teeth half the size of my head, and a long pink gullet that I’d probably be sliding into one piece at a time if I pissed her off.<br>\r\n<br>\r\n“Hello? Do you talk? I thought you’d be able to talk, most of the mice I’ve seen could. Until the rat army chased them all away and now I don’t have anyone to talk to. I mean Alpha Rat is nice and all, when he’s around, but he can’t squeak normally and he’s a little loud even when he tries. If you can’t talk that’s okay, I’ll just talk enough for the both of us, do you know what month old peanuts smell like? Apparently they smell just like week old peanuts, that was the biggest disappointment of my life. You see, it has to do with all the salt humans put in their food, makes it last longer than you’d think.” <br>\r\n<br>\r\nThe fourth thing I noticed was just how much she talked. “Um, th-that’s nice.”<br>\r\n<br>\r\n“Yeah, yeah it is. Oh, hey! So you can talk? That’s great!” she charged towards me, too fast to dodge in this poor lighting, and wrapped both arms around my shoulders. It was the strangest hug I’d ever felt. “My name is Joyline, what’s yours?”<br>\r\n<br>\r\n“Um, X-Xander. A pleasure to make your acquaintance Joyline. Can you let go of me now?” I started to push my hands against her, hands half the size of her own, and balked at just how squishy and fluffy the flesh that surrounded me was. Her belly had such loose skin and so much fat she could have probably held me down by just laying there. Probably … it was very soft fur, I might have been able to slide out.<br>\r\n<br>\r\nBut Joyline just hugged tighter, actually curling her thick tail around the both of us. “It’s Joyline, pronounced ‘joy-leen’ you know, because I’m lean and I bring joy? It’s not Joy-line, there is no ‘line’ involved in the pronunciation of my name, my name is completely without lines unless you want to spell it.”<br>\r\n<br>\r\n“Gack! Okay, okay, JoyLeeeen, there. I’ll do whatever you say, just don’t eat me before Ronald gets back!” I pleaded. I probably should have fought, maybe I could have. I’ve taken on ogres and trolls in single, hand to hand combat. I knew how to take down a larger and stronger opponent. Perhaps the same tricks would enable a mouse to overpower a rat? But if I hurt Joyline then I’m pretty darn certain Ronald would have nothing to do with me, so if my pride were to suffer for the sake of survival then by golly my pride was going to suffer.<br>\r\n<br>\r\n“Eat you? Well okay, I’ll wait. I wasn’t planning on eating you to begin with, I’ve got plenty of food around and I’m really full, and someone to talk to is more valuable at the moment than someone to fill my belly. But if you have some sort of sick fascination with it I can eat you after Alpha Rat gets home. But I really wouldn’t want to, and I think you should ask Alpha Rat to eat you instead. He’s got a bigger mouth.”<br>\r\n<br>\r\nI blinked. “Er, no I don’t want to be eaten period, just a little frightened by the massive … squish hug … going on here. Can you please let me go?”<br>\r\n<br>\r\n“Oh, oh sure!” Joyline loosened her grip, dropped me onto two feet, then held out a single paw. I grabbed it, letting her massive hand close around mine like I were a child, and we shook hands. “Nice to meet you too Xander, but are you going to stay in this cage all day? I mean really, it’s a nice place to sleep but it can’t be all that fun.”<br>\r\n<br>\r\n“Sure, I’ll leave … just … just give me a minute to take in what’s happening here.”<br>\r\n<br>\r\n“Okay, a full minute? Lets see, one … two … three … four …”<br>\r\n<br>\r\nI slapped a paw to my face. “That doesn’t mean for you to actually count, I ju- …” but she interrupted me she shoving her massive head over my shoulders and twitching her whiskers across my tail.<br>\r\n<br>\r\n“Hey! Your injured, aren’t you? Why do you have that bandage over it? Did you live with a different Alpha Rat before Ronald?”<br>\r\n<br>\r\nI blinked, realizing just who ‘alpha rat’ was in this girl’s mind. “No, I put that on myself.”<br>\r\n<br>\r\n“Oh neat! That’s just amazing! Can you show me how? I’ll treat the wounds in exchange if you want, I’ve got some nice herbs in a hidy place that’ll clear up any pain you might be feeling. Will have to wait for Alpha Rat to get back if you want to disinfect it though, Ronald hides it from me because he doesn’t like seeing me drunk.”<br>\r\n<br>\r\nI blinked. Squeezed out from under the girl’s chin, then snorted at the mental image of a drunk rat stumbling around.  “N-no, I should imagine not.”<br>\r\n<br>\r\n“No? Awww, but why?!” Joyline pouted, visibly upset.<br>\r\n<br>\r\n“I meant the part about Ronald keeping alcohol away from you, not … I’ll show you how to make a bandage and tie knots, no problem! Don’t worry about that.”<br>\r\n<br>\r\n“Yay! Oh! But how do we make it? I don’t mean physically, well I do want to know how to physically do it, but what I mean is we only have one rag at the moment and it’s holding your tail together.”<br>\r\n<br>\r\n“My tail is not injured that badly” I retorted, only to blink in surprize as the rat stuck her tongue out at me.<br>\r\n<br>\r\n“Doesn’t mean we need to tail your bandage silly. Back to my earlier question, are you coming out or not?” and with that she scurried over to one side of the cage, coiled her hind legs while loosening the pressure on her front legs … then LEAPT!<br>\r\n<br>\r\nShe practically flew the ten inches to the top of the cage and landed daintily on the wall. Apparently her balance was just as good, or better, than my own in this new body.<br>\r\n<br>\r\n“Um, s-sure.” I started towards the wall myself, coiled my legs, and LEAPT! <br>\r\n<br>\r\n…</span></div></div>",
            "created":1314894480,
            "id":1179009,
            "title":"\"Say hello to Joyline for me\""
        },
        "11111111111111111211":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "A good book.",
                "Food."
            ],
            "content":"<div class=\"\"><div> <span>I leapt through the air at impressive speed, my front paws outstretched, my hind paws and tail trailing behind me … wait, paws? No! Think of them as hands, their hands you idiot! Moments before …<br>\r\n<br>\r\nSMACK<br>\r\n<br>\r\nI smashed nose first into the metal wall, then slumped back down. As I was groggily getting back to my feet all I could hear was this laughter in my ears. A real laughter apparently.<br>\r\n<br>\r\n“Hahahaha! Oh wow, that was the funniest thing I’ve ever seen! You’re all like, ‘Wooosh!’ and then wall’s all ‘you shall not pass’ and then your all like, ‘Smack!’ and ‘ahh! I’m falling!’ Hahaha! It j- it just doesn’t get much funnier than that.” Joyline was laughing it up from her perch on the cage wall, cleverly out of my reach. I made a silent wish that she laugh so hard she falls off, but considering a rodent’s balance while on four legs, that was an unlikely scenario.<br>\r\n<br>\r\n“I’m glad one of us enjoyed that ma’am.” I grumbled while rubbing my cheek. My face really, really hurt after ramming it into the wall like that. Looking up, I wondered how I could have missed the jump. What was it too high? I’d jumped higher than that trying to get onto a horse. Er, but then again, while chasing after the horse I had the advantage of a running start, whereas here I had to jump strait up.<br>\r\n<br>\r\n“You are? Really? I would have thought you’d be annoyed by my laughing, that’s why I didn’t jump down to help you.” snickering some more. “But if you enjoy my enjoyment then I’ll just keep on enjoying.” a big smile was plastered to her face.<br>\r\n<br>\r\nI blinked … then slapped a paw to my face. Then decided to ask “Well can you help me up now? I’d rather not do that again.”<br>\r\n<br>\r\nJoyline just giggled. “Oh but I’d rather you did, your so much fun when your smacking into things.” she swiveled around on her hind legs, balanced lengthwise against the cage wall, then hung her long tail down as far as it could reach. “Here you are, just hop up and grab it.”<br>\r\n<br>\r\nI scurried over to the wall, did a short little hop, then gripped onto the rat’s tail with my tiny little paws. It was like holding onto a wriggly two-by-four, the tail was thicker than my hand! But I curled my legs around, griping with my hips as well as my arms, then started to climb up. It was an easy climb, up until I got to her rump … I paused, unsure of how to proceed.<br>\r\n<br>\r\n“Well go on, climb the rest of the way up. Unless you want me to just jump over and we all go flying onto the bed.” she giggled once more, a laugh that I felt would quickly grow tiring.<br>\r\n<br>\r\n“N-no-no, I’ll just …” but she cut me off.<br>\r\n<br>\r\n“No? Your not going to climb? Well alright then, over the wall we go, Weeeeeee!”<br>\r\n<br>\r\n“Wait, what? Gah!” I only had time to hold on tighter before the rat was falling to her side and I was trailing behind her. Her tail and mine intertwining like little streamers. We landed on softness with a ‘thwump’ before bouncing a moment, and then something soft and silky landed on top of me.<br>\r\n<br>\r\nI blinked, then I sniffed. Then I decided I shouldn’t have sniffed, it smelled like rat pee …<br>\r\n<br>\r\n“Now that’s an interesting place for your head to and up.” Joyline stated while lifting her belly off of mine and wriggling the tail my grip was held on. As the white softness moved, I saw two pink holes surrounded by white fur and bulging hips, the private areas of a female rat currently sitting on my head.<br>\r\n<br>\r\n“This was not by design I assure you.”<br>\r\n<br>\r\n“Maybe not your design, but I’ve got no problems with this.” Joyline taunted before sitting back down.<br>\r\n<br>\r\n“Huh-, hey wait!” I scrambled to let go of the tail and move out of the way, but the rat was just as fast as I was and didn’t have as far to go. Her full weight pressed down against me, her belly bulged around either side as her soft gut squished and molded to conform to my shape. Interestingly enough, so was my own belly. Neither of us looked especially fat, but it was clear from how the skin moved that rodents typically had more meat proportional to their bodies than humans did. Heck, by comparison to this rat, the average human was a stick figure and an overweight human was just too short for their belly.<br>\r\n<br>\r\nI pushed up with my hands, but the belly just conformed around them rather than move out of the way. I wriggled back and forwarth, kicking without any purchase and waving my tail around. Then I squeaked as something strong gripped the tip of it.<br>\r\n<br>\r\n“OooOooo … this tail is so soft.” Joyline murmured as her fingers pulled my tail up towards her face and she rubbed her cheeks against it.<br>\r\n<br>\r\n“Plah! Can you please get off of me!” I shouted out from underneath an overly ‘playful’ rodent. My head shifted from left to right, plowing through her and pushing her legs to the side much the same way a shovel goes through dirt, until … I gasped for breath, inhaling deeply the moment my head was out from under her. Okay, it was still between her legs, and she was still on top of me, but now I could breath fresh air.<br>\r\n<br>\r\n“Of course I will, after a quick nap.” she stated in a smug town while making an exaggerated yawn.<br>\r\n<br>\r\n“Joyline!”<br>\r\n<br>\r\n“Ok, fine, I’ll get up …” she rolled off to one side and I bounded onto all four legs, but her paw maintained it’s solid grip on my tail. “Happy now? Ooh! Just how did you get that cut? Were you attacked by a cat?” she asked while pulling me in closer and poking my bandage with her free paw.<br>\r\n<br>\r\n“No, I got that while learning how dangerous a sidewalk can be. Joyline, why are you so grabby?” I demanded. Not quite angry, but her antics were exhausting.<br>\r\n<br>\r\n“You’re the first rodent I’ve seen in months, and even better, you’re the first person I can talk to in so long … well, Alpha Rat and a few others talk to me, but no one understands what I’m saying or answers my questions, so it gets boring.”<br>\r\n<br>\r\nI blinked, starting to get the picture. “Oh.”<br>\r\n<br>\r\n“Worse still is that most of the time I’ve got absolutely no one, so I find entertaining things to do.” she blinked, then dropped my tail before bounding off to the edge of the bed with massive leaps, her run reminding me of a bunny rabbit.<br>\r\n<br>\r\n“Uh …”<br>\r\n<br>\r\n“Wait here a minute, I just remembered something fun we can try!” she called back before dropping to the floor with a half silent thump.<br>\r\n<br>\r\n“Try what?” I called back, scurrying over to the edge of the bed so I could see her. Meanwhile, I also saw the room for the first time, and was overwhelmed by the sheer number of books. There were books everywhere! On the shelves, on the table, a few thick ones were at the head of Ronald’s bed. Joyline had to climb over a few of them in her path to … wherever.<br>\r\n<br>\r\nThe bed was in the very center of the room, with a single table and chair to the left overlooking a window, and shelving that did an adequate job of holding on to each of the tomes. To the left was the doorway we’d entered, a simple, inornate, wooden door. At the foot of the bed, back a few feet, was a separate desk with a large glass cage on it. Looking inside I could see ramps, blocks of wood with holes in them, strips of torn bedding, lots of things a pet rat would love. Looking down the edge of the bed, I saw a single plate of food left out, right next to a full thing of water, but it seemed as if the food dish was there to torture me and nothing more. It was empty …<br>\r\n<br>\r\nMy stomach grumbled.<br>\r\n<br>\r\n“Ah! Here we are.” Joyline called back up merrily, and I looked down to see her idea of a good way to pass the time was …</span></div></div>",
            "created":1314911160,
            "id":1179116,
            "title":"I fail, and fall back down."
        },
        "11111111111111111212":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "\"But only if she can come.\"",
                "\"I'd like that very much.\""
            ],
            "content":"<div class=\"\"><div> <span>SMACK!<br>\r\n<br>\r\nMy head smashed into the side of the cage, halfway up the actual length of the wall, and I was too disoriented to see anything. I fell back down and landed on my side with a ‘thwump’ while the cage swung over to the side.<br>\r\n<br>\r\n“Eep!” Joyline squeaked, flailing her tail for balance as the cage began to tip over. Not wanting to be crushed under it, the rat leapt off her perch and went sailing onto the bed. But the force of her jump and the sudden loss of her weight on that side made the entire thing rock back in the opposite direction. I squeaked out in terror, scrambling back to four legs as the sudden feeling of weightlessness told me the cage was falling off the side of the bed.<br>\r\n<br>\r\n“Ack!” I screamed in pain as I slammed my wrist into one of the tumbling walls, only to scream even louder as the whole world exploded in gut wrenching sounds that vibrated through every fiber of my being. The metal cage had slammed into the wooden floor, and from inside the hallow of it that sound was something dreadful.<br>\r\n<br>\r\n“Xander!” Joyline called out in alarm. I heard the ‘thump’ as she jumped off the bed after me, but all I could see were spinning … blobby … spinny things. Lots and lots of spinning. “Xander, are you … are you ok?”<br>\r\n<br>\r\nI heard her ask the question as a white, adorable little rat face poked into the cage and twitched it’s whiskers over my cheeks. “Y-yeah, I’m …” I started to lie, before I tried to get up. Putting pressure on my wrist I realized something very quickly. “No, no I’m not fine. I think I sprained my wrist in the crash.”<br>\r\n<br>\r\n“Eek! Well don’t worry, I’ll go get sheet of cloth. We move you onto it, then I can drag you through the room to my hidy hole. I’ll be back in a moment, you stay here if you can’t walk.” she pressed her nose against my nose, then vanished in a flurry of scurrying noises.<br>\r\n<br>\r\nI flexed my still injured tail, felt along the crease of my freshly injured hand, then twitched my whiskers to sniff the air better. The whole place smelled like Joyline, and rat pee, and Ronald, and … glue? It smelled like glue and paper and ink, almost like a library. Just not as much dust. To get a better look at those smells, I crawled up to two legs and started to walk out of the cage. Blinking, I saw a simple, unadorned room with a large bed in the center, a wooden door, and two desks.<br>\r\n<br>\r\nOne was way behind me on the other side of the bed, right next to a window … this one was covered in books and paper and had this large quill pen. I could almost see a chair from across the room. The other desk was immediately to my right, very, very high up, and had a giant glass rat cage on it. Filled with all the toys and bedding and soft things a rat would supposedly want. Every other wall was hidden by a shelf, and each of those shelves had books or assorted trinkets on them, but none were completely full.<br>\r\n<br>\r\nI heard some loud thumping sound that repeated itself, over and over in a clear pattern. Curious, I looked towards the direction of the sound to see a large, plain, wooden door … a large wooden door with shadows moving under the crack in it. I only had enough time to squeak and dive for the cage when the door opened and someone stepped inside.<br>\r\n<br>\r\n“Is everything alright in, oh! That must have fallen off.” a female voice boomed across the room, sounding just as massive and earsplitting as every other human I’d encountered. I stood on two legs and propped my back against the wall of the toppled over cage, trying to stay as still and difficult to see as possible. Then I realized my location wasn’t the best of choices.<br>\r\n<br>\r\nHer feet seemed to slam into the floor with every step, crunching into wood as she stomped her way across the room. Okay, maybe she was stepping daintily and not actually stomping, but it was just too loud to think of that sound as anything else. Anyone who’s never been a mouse has no idea just how loud those simple movements are.<br>\r\n<br>\r\nI trembled as she stepped right next to the cage, I could see her feet, pasty white skin slipped into simple wooden sandals with rope straps holding them on. Cheap and easy to make, but not necessarily comfortable. Worse still, they were perfect for crushing something underfoot, which is exactly where my worries were taking my train of thought. All of a sudden the entire cage shook, and the view of this girl’s feet became a view of her legs, then her simple brown skirt, then … the roof.<br>\r\n<br>\r\nI fell backwards as she flipped the cage around, squeaking in pain as the far wall became the floor and I fell a good six feet … okay, maybe it was inches in reality, but the fall was equivalent And it HURT!<br>\r\n<br>\r\n“Ah!” I heard her thundering voice scream out and felt a sudden weightlessness as she dropped the cage. But I didn’t even have enough time to be afraid of falling a second time before the whole thing shuddered and her hands closed around it. “Gotcha. Sorry, didn’t know anyone was in there.”<br>\r\n<br>\r\nI feel to my side as the wall once again became the floor and the roof of the metal box oriented towards the girl’s face. “H-hello ma’am.”<br>\r\n<br>\r\nShe blinked, staring at me wide eyed, before setting the cage back on the bed and laying on it’s side so I could crawl out. “Wow, so you really can talk. Oh! Where’s Joyline?”<br>\r\n<br>\r\nI groaned, shifting on to two legs so my injured paw wouldn’t matter, then carefully walked out. It was so much harder on two legs. Not really impossible, and my balance wasn’t much worse off from when I was human, but compared to the superb balance of a mouse on four legs I was as wobbly as a one legged table.<br>\r\n<br>\r\n“Ack! You not supposed to be here human, why are you in here?” I heard Joyline shouting up at the girl, though as the human bent down I could see neither of them. “Xander? Where did you go! I told you to stay put!”<br>\r\n<br>\r\n“Ah, there you are. You want to come up little rat?” the woman called out.<br>\r\n<br>\r\nI decided, hey with all this yelling going on, why not join in? “I’m up on the bed Joyline! This … whoever this is put me up here.” I screamed at the top of my lungs.<br>\r\n<br>\r\nIn just that moment the woman stood back up and stared at me with Joyline cupped carefully on her palm. She had deep blue eyes, muddy blond hair that would have been luxurious if she could use the same expensive soaps and shampoos the royals enjoy, but instead looked plain and ordinary. Her skin was white, as I’d seen earlier, but from this much better angle I could tell how soft and smooth it looked. There weren’t half as many noticeable pours or beads of sweat oozing out as there had been on Melson or Ronald.<br>\r\n<br>\r\nShe was staring at me with the same intensity I was staring at her. Almost as if she couldn’t believe what just happened.<br>\r\n<br>\r\n“Y-you can talk.” she stated lamely.<br>\r\n<br>\r\n“Well of course he can talk! He’s a mouse, whoever said mice can’t talk?” Joyline shouted out, but her words went ignored.<br>\r\n<br>\r\nI stood there a moment, my injured wrist held against my chest, before stepping back into a solid stance and swinging my nose towards the bed in a low, formal bow. My tail hung out for ballence while my free hand swung behind me. “Yes I can M’lady, I am Xander. Might I ask who you are?” then I stood back up and looked at her. My uninjured hand swung around to nurse my other one.<br>\r\n<br>\r\n“C-ci … Cicily.” she looked to Joyline, then carefully set the rat on the bed next to me.<br>\r\n<br>\r\n“Humph. See what I mean? No one ever understands what I say. How come she responds to you?”<br>\r\n<br>\r\n“A pleasure to meet you Cicily” I stated before turning to Joyline. “Something about the spell perhaps, I can hear you just fine. Sort of which humans could talk as quietly as you.”<br>\r\n<br>\r\nAt that Joyline giggled. “Makes yer ears hurt doesn’t it? Don’t worry, you’ll get used to that.”<br>\r\n<br>\r\n“Spell? But I th- … oh! You were talking to Joyline?” the woman’s face brightened as she pointed to the white rat.<br>\r\n<br>\r\nI held my good ear up to my head to block some of the sound before responding. “Yes ma’am, I can talk to you both apparently. It’s going to become a confusing conversation if …” but I was interrupted by a sharp pain and loud grumbling in my stomach. I bent over and cupped my hand across my belly instead of my head, but struggled to keep from falling on my face. “Er, m-my apologies. I have not eaten in quite some time.”<br>\r\n<br>\r\nBoth Joyline and Cicily looked concerned. “Oh dear … well I’d … I love to talk to you both, if only to hear what you think of me Joyline.” she stated while reaching a hand out to scritch the rat’s ears. “But I’ve got to get back to the counter and watch for customers. I only came up here because I heard the noise, I wanted to check if everything was still in one piece.”<br>\r\n<br>\r\n“I see. Thank you … for your concern ma’am” I struggled back to two feet, trying to hold both my aching hand and my aching stomach at the same time.<br>\r\n<br>\r\n“Oh I’ll get you some food Xander, no problem! I’ve got lots and lots of food stashed up. I think there’s a strawberry around here somewhere from a few weeks ago.”<br>\r\n<br>\r\nThen Cicily stated. “If you’d like I can take you into the other room and get you something to eat.”<br>\r\n<br>\r\nKnowing that Cicily didn’t hear Joyline’s suggestion, I also knew full well I wasn’t planning on eating month old moldy strawberries … or month old peanuts. Though I’m certain she had more stashed around. “I’d like that.” then I looked over to the rat, before glancing back up at Cicily and saying: …</span></div></div>",
            "created":1315007520,
            "id":1179884,
            "title":"I hit the side of the cage, and it tips over."
        },
        "1111111111111111122":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "\"Are you planning to change back?\"",
                "\"Want to go into the kitchen with me?\""
            ],
            "content":"<div class=\"\"><div> <span>“Don’t forget the rent is due, Ronald. You know I can’t afford to give you any leeway when it comes to payment, I have my own bills to make.” the girl stated. Or at least I hoped it was a girl, for her voice was ridiculously feminine.<br>\r\n<br>\r\n“Gah!” Ronald yelped in a comical fashion, making the floor of my cage jump around in response to his startled gesture. Moments later I felt the cage slam noisily onto a wooden desk and Ronald call out “Here, can you hold him for a moment? I’ll be right back”<br>\r\n<br>\r\n“Um, s-sure?” the girl asked tentatively, moments before a door opened and slammed shut.<br>\r\n<br>\r\nI stood there, in almost complete darkness, just waiting for whatever was going to happen next. Then I kept waiting. And I waited some more. How long was Ronald going to be exactly? I scurried over to the side of the cage and relaxed my head against the wall. A short squeak escaped my lips as I closed my eyes and tried not to think about food. Funny thing about not thinking about something? It’s impossible to not think about the thing your trying not to think about because you have to think about it to make the decision to not think about it. Long story short? I thought about food.<br>\r\n<br>\r\n“Grumble!” and my stomach growled loudly in response to that.<br>\r\n<br>\r\n“Eep! Hey, no growling mister. Or I’ll sit on that cage.” the girl threatened.<br>\r\n<br>\r\nI balked at that, cupped my hands around my mouth and then placed it as close to the airholes as I could manage before shouting out my response. “I was not growling ma’am! That was my stomach complaining, for I have not eaten in over a day!” immediately after I coughed. It was hard trying to yell so loudly so often, and the thundering voices of most every human I’d met were giving me a headache. Lovely as this girl’s voice was, she was no exception.<br>\r\n<br>\r\n“Er, oh? S-so your just hungry then?”<br>\r\n<br>\r\nI leapt back as a massive blue eye covered the airhole and peered into the cage at me. Gulping in mild fear, I stood up to two legs and loudly proclaimed “That is correct miss, I shall try to quiet my stomach if the noise displeases you.” then I slumped back to four legs and cupped one arm across my belly. I wasn’t lying, rule number one about surviving near giants is to not make said giants angry with you.<br>\r\n<br>\r\nThe eyeball blinked, then giggled. Her head moving around enough for me to see the white skin and muddy blond hair on the rest of her face. “That sounds … well that sounds silly to me, if your hungry you should ask for something to eat.” her head moved away from the airholes and I could hear her place her hands on the roof of my cage.<br>\r\n<br>\r\n“I have no money to pay for food.” I called out.<br>\r\n<br>\r\n“What? I can’t hear you.”<br>\r\n<br>\r\nSighing, I stood up and shouted out as loudly as my tiny lungs could manage. “I HAVE NO MONEY TO PAY FOR IT!”<br>\r\n<br>\r\nShe apparently heard me this time. “Your worried about money? Why would a mouse worry about paying for the food it takes.” I looked up to see the tiniest crack in my roof. She was trying to peer inside without giving me a means of escape.<br>\r\n<br>\r\n“I am no true mouse, but a royal guard, a soldier, cursed to take this form because I defended my king. I may look like a mouse at the moment, but I am no cowardly thief.” I made sure to yell the entire sentence loudly, it was making my throat sore but then so would repeating myself over and over again.<br>\r\n<br>\r\nThe cage roof slammed shut and that tiny crack of light vanished in an instant. “Really?”<br>\r\n<br>\r\nI nodded … sighed when I realized she couldn’t see it, then shouted out “YES!”<br>\r\n<br>\r\n“Wow, that’s probably the worst fate imaginable around here. This city is loaded with deathtraps for all little rodents sense the rat army started making raids. And you’re a mouse! So even the rats around here would attack and eat you, you’ll be in danger from either side in this war.”<br>\r\n<br>\r\nI blinked at that one, not quite sure how to respond. All of a sudden I felt very glad I chose to let myself be captured and interrogated, rather than run off on my own and fall prey to something more insidious. After a few moments of silence, the girl said something that made me smile brighter than I have all week.<br>\r\n<br>\r\n“Well, my name’s Cicily. I’ve got a few cookies here, would you like to share one?”<br>\r\n<br>\r\nUnable to believe my ears, I leapt up to two feet and called out as loudly as I could in a voice that exuded pure happiness. “Yes! Yes I would ma’am, that would be wonderful!” all the while trying to ignore a little voice in the back of my head saying ‘don’t get too excited Xander, she could just be teasing you with the promise of food without actually planning to give you any.’<br>\r\n<br>\r\n“Okay, but you’ve got to promise to stay absolutely still … I can’t open the cage for you, alright? If you could beat of Nickolas then I don‘t want to know what you‘d do to my tavern.”<br>\r\n<br>\r\nI nodded my head. “Such terms are acceptable ma’am.”<br>\r\n<br>\r\nThen I heard giggling. “You don’t have to call me ma’am all the time, Cicily will do just fine.” just before the cage opened. A pearly white hand surrounded by a halo or lantern light slowly shifted into my dark little metal box, a glorious, delicious smelling cookie gripped tightly between her fingers. The smell was so wonderful, my belly gurgled, demanding I feed it as soon as possible. That girl’s hand might as well have been angels sent by god for all I knew. The moment she set the cookie down next to my head, I gripped part of it in my paws, tore off a piece, then sat on two legs while munching happily.<br>\r\n<br>\r\nShe lifted the rest of the cookie out of my cage and closed the lid back over it … she seemed quick about it, as if expecting me to leap out and tear her face off the moment I had an opening. I thought that was silly. Even if I wanted to (which I most certainly did not!) she was much too big to actually damage. At this size, I doubted even my now sharp teeth could have broken her skin.<br>\r\n<br>\r\n“Are you alright in there? Was that enough?” she asked, sounding like some mix between concerned and curious.<br>\r\n<br>\r\nI mumbled out something unintelligible with my cheeks bulging and my teeth very active, swallowed hard, then tried again. Making sure to shout so she could hear me this time “Yes! Oh yes, thank you milady!! I mean, miss Cicily.”<br>\r\n<br>\r\nShe snorted, then giggled. “Just Cicily is fine, you don’t need to call me miss.”<br>\r\n<br>\r\nI took a few small nibbles then called out “Either way I thank you, I had worried I would never find a meal.” my own little piece was getting smaller and smaller by the moment. Soon it would be gone. “Um, s-speaking of which … can I have some more?” I’d shout before gulping down the last little crumb. Even if she denied me, my belly was sated for the moment. The cookies were bland and simple, but I had simple tastes and everything tastes good if your hungry enough.<br>\r\n<br>\r\n“Hmm … how about we get you out of there. If … if only for a moment.” then before I could answer she opened up the cage and both of her hands shot in after me. I squeaked as one finger closed around my head, two more closed around my waist, and then her pinky stabbed into my injured tail.<br>\r\n<br>\r\n“Ack!” I flinched, arching my head back. To which she responded by dropping me. That wasn’t pleasant either.<br>\r\n<br>\r\n“Eek! I’m sorry, I’m sorry, what happened?!” at least she was genuinely concerned. That had to count for something.<br>\r\n<br>\r\n“It’s, m-my tail.” I stated weakly.<br>\r\n<br>\r\n“What?” apparently I wasn’t loud enough to hear, so I tried again.<br>\r\n<br>\r\n“It’s my tail!”<br>\r\n<br>\r\n“Oh!” she gasped, cupping her hands under me this time. She used one wall of fingers to push me over to her other wall of fingers. I was slowly getting up to all four feet as she lifted me out gently. “I’m sorry little guy, didn’t mean to hurt you. Did you get that cut during the fight with Nick?”<br>\r\n<br>\r\nI shook my head. “No, someone stepped on it. I shall endeavor to watch where I’m going in the near future.”<br>\r\n<br>\r\n“Oh you poor thing … here, have the rest of your cookie.” she lifted it towards me face and watched me hungrily attack the delicious little thing. I sat up on two legs to hold the piece of a cookie and squeaked happily as I gulped it down. Oh yes, this more than made up for accidentally squeezing my tail, this woman was once again an angel in my eyes.<br>\r\n<br>\r\n“Oh! Your soooooo cute!” she squealed, watching me eat for the first time. As I licked the crumbs off my paws … er, no hands! They were hands! The next words out of her mouth startled me.</span></div></div>",
            "created":1315217340,
            "id":1181494,
            "title":"\"Don't forget your rent is due.\""
        },
        "11111111111111112":{
            "author_id":"arbon",
            "author_name":"Arbon",
            "choices":[
                "I nodded \"Fine\"",
                "I told Ronald not to."
            ],
            "content":"<div class=\"\"><div> <span>“Oh right away then” the man grunted, sounding even more annoyed at the situation. His hand grasped for me a second time … or rather slapped. His palm pressing me against the side and floor the cage so I could not run, his thick, pudgy fingers closed around my head and arms. My bandaged tail and injured legs left to dangle bellow me, I was lifted up into the colorful, mold and death smelling room.<br>\r\n<br>\r\nThere were books and bottles and strewn paper all over the place. A thick wooden table with a vat of ink, a pen, and an empty sheet of paper were the most space he had available. Everywhere else was overflowing with some trinket or oddly shaped bottle, to the point if a thief were to pick through and steal half of it you’d still never get to see the shelving underneath. Lots of great looking places to hide …<br>\r\n<br>\r\nI felt that should have been a warning bell.<br>\r\n<br>\r\nHe dropped me unceremoniously onto an empty part of his desk, and I had roughly three seconds to regain my balance and look up at the fat man before both hands cupped over and around me. I squeaked lightly, glancing from one finger to the next as he spread them … I covered my eyes when they emit a soft glow.<br>\r\n<br>\r\n“Ohohoh! This thing is a shapeshifer! Or more accurately, has been polymorphed against it’s will.”<br>\r\n<br>\r\n“Huh, so it used to be something else. That explains why it fights better than a mouse.” I heard Ronald’s muffled voice through fat fingers. “Can you change it back?”<br>\r\n<br>\r\n“Lets find out.” Melson sounded determined, just before the glow intensified. There was this odd tingling sensation that seemed to flow through my skin, my fur, my very bones … I could see my fur disappearing, my tail shrunk and swiveled, my face seemed to crush in on itself as my jaws shortened. Just before my world exploded into pain.<br>\r\n<br>\r\nI felt pain as my face seemed torn between growing and shinking, though to my horror the elongation back into a mouse like jaw structure was winning out. I felt pain as my tail grew and shifted, the bandage growing snug once more as the flesh it covered filled back out. I felt unrelenting, horrible, horrible agony as every single piece of fur coming out of my skin felt like a dagger stabbing through me. It felt exactly like that first time I was transformed.<br>\r\n<br>\r\nI fell to my side as the glow faded. I was breathing hard, my vision was blurry, and worst of all I was still a mouse.<br>\r\n<br>\r\n‘By the gods I hate magic’ I muttered.<br>\r\n<br>\r\n“Odd …” Melson stated while I focused solely on recovery.<br>\r\n<br>\r\n“So, what does that mean … you can’t cure it? We have to go find some other magic user?”<br>\r\n<br>\r\n“Hohohohoho!” Melson burst into a fit of giggles, the fat on his belly and arms jiggling at random. “Not just ‘different’ my boy, you’d need an entirely new caliber of magician here. You probably won’t understand any of this technical stuff but that mouse is con- …” but Melson was interrupted.<br>\r\n<br>\r\n“If I won’t get it then don’t say it, what your saying here is that we need a better magician than you. Right?”<br>\r\n<br>\r\nGroaning and gasping for breath, I almost smiled as I looked up to see an expression of annoyance on Melson’s face. He wasn’t getting much respect here.<br>\r\n<br>\r\n“In a way, yes. Yes … most definitely. You’d probably need one of the greatest magicians of all time to undue this sort of spell. Your talking people who can vaporize a city by waving their arms around and thinking really hard. People who’ve mastered teleportation, or mass/energy manipulation. More power than all the magicians you’ve ever heard of on this side of the planet combined! More power than …” once more he was interrupted.<br>\r\n<br>\r\n“I get it! We need someone with a lot of power.” at which point Ronald extended his hands, cupped one over my back and one under my chest, before carefully lifting up. Once all four feet were under his palm he positioned me so that I’d be more comfortable with his fingers surrounding me while also allowing my head to stick out.<br>\r\n<br>\r\nI looked across at Melson’s workbench, the papers and tomes he had littered all over the place, the various bottles of all different colors and sizes he had lined against the shelves. But that scent of rat pee, death and decay from somewhere in the corner of my senses distracted from all of the more interesting sights … and I tucked my head back between the two human palms. Ronald’s sweat was far more pleasant than that lingering scent in Melson’s house.<br>\r\n<br>\r\n“So now, let me see here …” Melson started sliding a finger against one book after another, searching for one in particular. “I’m supposed to break the enchantment, correct? Given time I could probably craft the specific counter spell I’d need, but I’d also need time to build up physical, raw, power. Time or money, whichever we have more of.”<br>\r\n<br>\r\n“I see … whether I’ll understand it or not, could you explain what you know in a little more detail?”<br>\r\n<br>\r\nMelson frowned and moved past the books, now inspecting one random jewel after another. “Whoever cast that transformation spell didn’t just cast a single, simple spell, they set it up so that a living spell within his body is constantly recasting the transformation every second of every day. My power isn’t just blocked or else he wouldn’t have changed at all, the spell recast itself before I could turn him back to human. Even if we did change him all the way, he’d just turn into a mouse again the moment we stop casting at him.”<br>\r\n<br>\r\nRonald blinked. “H-human?” Looking at me curiously before shaking his head. “ok, so we need … what? A way to get the other spell out of him?”<br>\r\n<br>\r\n“That would require killing the original spell caster, or somehow persuading him to end it. Neither would be any small feat mind you, assuming you can even find the man there’s every possibility he’d just cast an even worse curse against you. Or kill you outright so that he can get the mana back without any of the headache.”<br>\r\n<br>\r\nRonald gulped. “Do you know of anyone we could go to then? The guy’s … this used to be a human and now he’s living out his life as a mouse.”<br>\r\n<br>\r\nI saw Melson glare slightly, but then his face saddened … it seemed slightly out of character to me. “Well I can take care of him no problem, I’ve got the safest little home fo- …”<br>\r\n<br>\r\n“No.” Ronald stated both boldly and flatly.<br>\r\n<br>\r\n“Wh- …”<br>\r\n<br>\r\n“I’ll hold on to him, after seeing how you handle rodents I don’t nearly trust you around one.”<br>\r\n<br>\r\n“I’m the scientist designated to cage and study them! I know a hundred times more about rat care than you’ll ever know!” Melson exploded with anger, apparently upset that Ronald wasn’t even about to fall for any fake nice person act he could put on. Not that he even tried for very long … or put that much effort into it.<br>\r\n<br>\r\n“I’ve been keeping a pet rat for longer than you’ve had this lab ‘bottle-lord’ and seeing as w- … we …” all of a sudden Ronald looked confused. “Why is that bottle ...”<br>\r\n<br>\r\nI turned my weary gaze over towards the section of the wall Ronald pointed to, then looked back to see Melson turn white with fear. That was an odd reaction.<br>\r\n<br>\r\n“Oh! That’s a, uh … a project I’ve been working on. I need privacy to finish that one, lots of toxic fumes and such, so if your going to be such a pain about it.” fat, pudgy hands scooped me up off the table and shoved me into Ronald’s chest. It wasn’t gentle, but I think I was too tired to actually flinch at the pain. Ronald’s grip, while fast, was much more gentle.<br>\r\n<br>\r\n“Uh …”<br>\r\n<br>\r\n“Go, go on now. I’ll handle this from here.” Melson stated frantically while pushing Ronald from behind then scanning through the bottles. His hands shot out to grab a purple and green angular one. “I’m serious, get gone already!”<br>\r\n<br>\r\n“Oook …” Ronald stared blankly, before walking out the door with me cupped in his hands. I took this opportunity to see the section of the village I was in, some distance down the street from where I was captured. Blinking, I realized this was the exact same street.<br>\r\n<br>\r\nMelson’s house and shop looked little different from the rest of the stone and wood buildings in the town. The only way I could tell it was anything more than a classic, old building was the fact there were colorful bottles in the windowsill and a wooden sign declaring ‘Ratary’ hanging from two metal chains. There was a bakery to my right, and a library just beyond that, but the two buildings nearest my left had no sign to indicate some purpose.<br>\r\n<br>\r\nI assumed they were residential.<br>\r\n<br>\r\n“Gah! I, erm …”<br>\r\n<br>\r\nLooking up at Ronald, I poked his finger while asking “What?” as loud as I could shout.<br>\r\n<br>\r\n“I think I forgot your cage. Should probably go back and get it.”</span></div></div>",
            "created":1314859680,
            "id":1178876,
            "title":"Oh, well right away then."
        }
    },
    "info":{
        "author_id":"arbon",
        "author_name":"Arbon",
        "brief_description":"A skilled warrior is transformed into a tiny mouse. But will he give up his sword?",
        "created":1311460440,
        "description":"<td align=\"left\" class=\"norm\">I will edit this some other time. Don't expect much from the story, was written a while ago and I didn't put much thought into it.<br>\r\n<br>\r\nBasic premise, a royal guard in a medieval fantasy world is transformed into a small mouse, and then teleported somewhere far away. He seeks to regain his normal form, and to get back home.<br>\r\n<br>\r\nMain character's name is Xander ... whahaha! finally manged to pick one.</td>",
        "id":1795787,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1462639800,
        "modified":1462639800,
        "pretty_title":"Mouse Warrior"
    }
}