{
    "chapters":{
        "1":{
            "author_id":"jots1106",
            "author_name":"wildcat",
            "choices":[
                "FemShep",
                "Liara T'Soni",
                "Ashley Williams",
                "Miranda Lawson",
                "More characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some characters to choose from</span></div></span></div>",
            "created":1367125200,
            "id":1580516,
            "title":"Choose a character"
        },
        "11":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Breasts",
                "Hourglass",
                "Growth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she grow? <br>\r\n<br>\r\nBreasts: Self explanatory <br>\r\n<br>\r\nHourglass: Both breasts and butt<br>\r\n<br>\r\nGrowth: Height increase (amazon, mini-giantess, giantess), with breast and butt growth</span></div></span></div>",
            "created":1420952400,
            "id":1916405,
            "title":"FemShep"
        },
        "111":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Prothean Beacon",
                "Cerberus Rebuild",
                "Sex"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nProthean Beacon: When Shepard came into contact with the beacon in ME 1 she begins to grow shortly after wards.<br>\r\n<br>\r\nCerberus Rebuild: Something goes wrong when Cerberus rebuilt Shepard and she begins to grow. <br>\r\n<br>\r\nSex: we all know that Shepard does get around a bit, so what would happen if she began to grow every time she had sex?<br>\r\n</span></div></div>",
            "created":1420952400,
            "id":1916410,
            "title":"Breasts"
        },
        "1112":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "1 cm every week",
                "1 cm everyday",
                "1 cm every minute"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How fast does Shepard grow?</span></div></span></div>",
            "created":1572003120,
            "id":2738186,
            "title":"Growth speed"
        },
        "112":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Prothean Beacon",
                "Cerberus Rebuild",
                "Sex"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nProthean Beacon: When Shepard came into contact with the beacon in ME 1 she begins to grow shortly after wards.<br>\r\n<br>\r\nCerberus Rebuild: Something goes wrong when Cerberus rebuilt Shepard and she begins to grow. <br>\r\n<br>\r\nSex: we all know that Shepard does get around a bit, so what would happen if she began to grow every time she had sex?<br>\r\n</span></div></div>",
            "created":1420952400,
            "id":1916412,
            "title":"Hourglass"
        },
        "113":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Prothean Beacon",
                "Cerberus Rebuild",
                "Sex"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nProthean Beacon: When Shepard came into contact with the beacon in ME 1 she begins to grow shortly after wards.<br>\r\n<br>\r\nCerberus Rebuild: Something goes wrong when Cerberus rebuilt Shepard and she begins to grow. <br>\r\n<br>\r\nSex: we all know that Shepard does get around a bit, so what would happen if she began to grow every time she had sex?<br>\r\n</span></div></div>",
            "created":1420952400,
            "id":1916414,
            "title":"Growth"
        },
        "12":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Breasts",
                "Hourglass",
                "Growth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she grow? <br>\r\n<br>\r\nBreasts: Self explanatory <br>\r\n<br>\r\nHourglass: Both breasts and butt<br>\r\n<br>\r\nGrowth: Height increase (amazon, mini-giantess, giantess), with breast and butt growth</span></div></span></div>",
            "created":1420952400,
            "id":1916406,
            "title":"Liara T'Soni"
        },
        "121":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Genetic Defect",
                "Biotic Usage",
                "Prothean Ruin"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nGenetic Defect: A little known fact about Asari is that even after puberty they continue to grow at an astronomically slow pace for the rest of their lives; Liara discovers that she has a rare genetic dieses that is causing the growth to speed up. <br>\r\n<br>\r\nBiotic Usage: Liara stumbles upon an old technique for boosting Biotic powers in a prothean ruin, the side effect is the now whenever she uses her biotic she grows. <br>\r\n<br>\r\nProthean Ruin: In the ME1 the ruins you find Liara in did something to her that causes her to begin to grow. </span></div></div>",
            "created":1421125200,
            "id":1917443,
            "title":"Breasts"
        },
        "1211":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "1 cm every week",
                "1 cm every day",
                "1 cm every minute"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How fast does Liara grow</span></div></span></div>",
            "created":1572002340,
            "id":2738182,
            "title":"Growth speed"
        },
        "122":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Genetic Defect",
                "Biotic Usage",
                "Prothean Ruin"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nGenetic Defect: A little known fact about Asari is that even after puberty they continue to grow at an astronomically slow pace for the rest of their lives; Liara discovers that she has a rare genetic dieses that is causing the growth to speed up. <br>\r\n<br>\r\nBiotic Usage: Liara stumbles upon an old technique for boosting Biotic powers in a prothean ruin, the side effect is the now whenever she uses her biotic she grows. <br>\r\n<br>\r\nProthean Ruin: In the ME1 the ruins you find Liara in did something to her that causes her to begin to grow. </span></div></div>",
            "created":1421125200,
            "id":1917445,
            "title":"Hourglass"
        },
        "123":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Prothean Beacon",
                "Biotic Usage",
                "Prothean Ruin"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nGenetic Defect: A little known fact about Asari is that even after puberty they continue to grow at an astronomically slow pace for the rest of their lives; Liara discovers that she has a rare genetic dieses that is causing the growth to speed up. <br>\r\n<br>\r\nBiotic Usage: Liara stumbles upon an old technique for boosting Biotic powers in a prothean ruin, the side effect is the now whenever she uses her biotic she grows. <br>\r\n<br>\r\nProthean Ruin: In the ME1 the ruins you find Liara in did something to her that causes her to begin to grow. </span></div></div>",
            "created":1421125200,
            "id":1917446,
            "title":"Growth"
        },
        "13":{
            "author_id":"jawsometeeth",
            "author_name":"Goodvibes",
            "choices":[
                "Breast expansion: In title",
                "Ass expansion: In title",
                "Hourglass: Both butt and breast",
                "Height growth: (Amazon, Miji giantess, Giantess), with breast or butt growth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she grow?<br>\r\n</span></div></span></div>",
            "created":1465179120,
            "id":2159486,
            "title":"Ashley Williams"
        },
        "14":{
            "author_id":"shidoy3",
            "author_name":"Shidoy's Originals",
            "choices":[
                "Breasts",
                "Butt",
                "Hourglass",
                "Growth",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she grow?<br>\r\n<br>\r\nBreasts: Self explanatory<br>\r\n<br>\r\nButt: Self explanatory<br>\r\n<br>\r\nHourglass: Both breasts and butt<br>\r\n<br>\r\nGrowth: Height increase (amazon, mini-giantess, giantess), with breast and butt growth</span></div></span></div>",
            "created":1433394000,
            "id":1987631,
            "title":"Miranda Lawson"
        },
        "142":{
            "author_id":"jawsometeeth",
            "author_name":"Goodvibes",
            "choices":[
                "Genetic Defect",
                "Cerberus Revenge",
                "Something before Shepard"
            ],
            "content":"<div class=\"\"><div> <span>How does the perfect woman change?<br>\r\n<br>\r\nGenetic Defect-Could something have gone wrong with her DNA? Maybe when her father was making her, he overlooked something in her development plan. No Miranda has to deal with something embarrassing; mainly her ever expanding buttocks!<br>\r\n<br>\r\nCerberus Revenge- Set after ME 2, Miranda is off scouring the galaxy of Cerberus. However, in one facility Miranda encounters an unknown Bio-agent. Thankfully, her immune system fought it off, but not without some unknown side effects.<br>\r\n<br>\r\nBefore meeting Shepard- Sometime before ME 2, Miranda encounters something that cause her butt to expand.</span></div></div>",
            "created":1544397900,
            "id":2587650,
            "title":"Butt"
        },
        "144":{
            "author_id":"spark12",
            "author_name":"Count Chocula",
            "choices":[
                "The feeling intensifies",
                "The feeling recedes... for now",
                "It spreads elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>    The Normandy had just finished docking at the Citadel after finishing a series of missions. After all the hard work, the entire crew was glad for some free time, being able to relax for a bit and enjoy some down time. Most of the crew left the ship for some leisure time, while others decided to just relax and take it easy.<br>\r\n<br>\r\n    Miranda Lawson walked into her quarters, the door sliding shut behind her as the five foot ten woman headed over to her bed. She felt exhausted, both physically and mentally, as she sat down, her long, black hair bouncing against her shoulders. Ultimately, she was relived that her sister was finally safe from her father. She fell back on the bed, feeling grateful to Commander Shepard, glad that all the decisions she made which not only helped lead to Oriana’s safety, but also the end of her father. <br>\r\n<br>\r\n    Normally she would have left the cramped spaces inside the Normandy so she could enjoy several drinks. But the last mission left her feeling drained, both physically and mentally. So the idea of just lounging around in her quarters just sounded very appealing to her at the moment.<br>\r\n<br>\r\n    As Miranda was staring at the ceiling, still replaying all of the events in her head, she began to feel an odd sensation throughout her entire body. It wasn’t painful, nor was it even uncomfortable. If anything, it felt good to her. Like the first stretch one does in the morning, right after waking up. She sat up, a bit confused about what was going on. She knew that what she was feeling couldn’t be normal. She could actually feel the material of her bodysuit shifting along her skin, especially at her breasts and ass. Not to mention her boots, as her toes were starting to feel a bit cramped for some reason.<br>\r\n<br>\r\n    “I better not be getting sick,” Miranda said as she held her head. She could still feel the odd sensation throughout her body. She tried to shake it off, but the feeling persisted, as though it is trying to make itself known to her.</span></div></div>",
            "created":1489737180,
            "id":2290868,
            "title":"A sick feeling"
        },
        "1441":{
            "author_id":"spark12",
            "author_name":"Count Chocula",
            "choices":[
                "Her boots finally burst open",
                "Just then, the door to her office opens!",
                "Miranda attempts to remedy her condition"
            ],
            "content":"<div class=\"\"><div> <span>    Miranda looked down at her boots as she could feel them becoming tighter by the second. She could see the fronts of her boots starting to bulge a bit, as though they were being pushed from the inside. The oddest part was she could hear the material starting to groan as well, as though it was straining. Her toes were starting to curl as they were running out of room in their confined space, forming ten indents in the material. She tried to spread her toes for relief, but found herself unable to so from the lack of space she had. Her boots were normally very comfortable, being custom made for her size ten feet. So there should be no reason they should be feeling tight on her.<br>\r\n<br>\r\n    Miranda pulled her hand up as she felt her arm length gloves, digging themselves between her fingers, the material being pulled by some unknown force. As she turned her hand over, her eyes caught her breasts. She reached down to feel how swollen they were, as if they had gone up by two full sizes. Sure her breasts may have been a generous size before, but now they looked as though they have been squeezed into her body suit. Not to mention it seemed as though they were being pushed outward, as though she was just inhaling continuously. She could feel the band of her bra getting a bit tighter around her torso, as the underwire was starting to dig into her. Her thighs were starting to swell as her ass followed suit, as she could feel her legs being squeezed by the unforgiving, resilient material.<br>\r\n<br>\r\n    Miranda looked back down as she heard a tearing sound coming from below her, followed by a relief of pressure. Her eyes followed the sound back to her boots, where she could see the fronts starting to tear slightly from her toes pushing outward still, searching for extra space. <br>\r\n<br>\r\n    “What the hell is going on?” Miranda asked herself as she watched the tears widen ever so slightly with every moment that passed. She could see her toes pushing outward, demanding more room as they continued to push against the inside.<br>\r\n<br>\r\n    She became distracted by the sound of more material tearing. She stood upright to get a good look at where the sounds were coming from. The front of her suit was beginning to tear, as her breasts were pushing out. The seams along her pant legs were starting to come undone as flesh was bulging through every new opening that formed. Her underwear started to dig into her as her flesh was starting to overflow. Her legs looked even thicker, as they were already starting to touch each other as her ass is still pushing outward.<br>\r\n<br>\r\n    Then Miranda noticed something else that seemed off to her. Everything looked a bit lower than it should be. Looking straight ahead, her eyes should be level with the picture of her and Oriana that she hung on the wall. It was subtle, but she could tell, she had to turn her gaze a bit downward towards it. If anything, she found herself lowering her gaze even farther with each second that passed. Just as she was trying to figure out what was happening, she heard two audible tearing sounds from below her.<br>\r\n</span></div></div>",
            "created":1489737660,
            "id":2290872,
            "title":"Tight boots..."
        },
        "14411":{
            "author_id":"spark12",
            "author_name":"Count Chocula",
            "choices":[
                "Miranda embraces her growth",
                "She's stops growing"
            ],
            "content":"<div class=\"\"><div> <span>     As Miranda looked down, she could see her long, slender toes sticking out the fronts of her boots by about an inch, and still creeping forward. She couldn’t help but stare as more of her feet were becoming visible. Her gloves finally tore at the seams, as though they were being unzipped, as her hands were pushing at the material. <br>\r\n<br>\r\n    “My clothes are... getting tighter,” Miranda breathed out as her viewpoint continued to rise, the tears in her bodysuit widening as more flesh pushed out. A big smile formed on her face as she finally realized what was happening to her.<br>\r\n<br>\r\n    Her boots were now just above her knees as her toes were sticking out by a good two inches. The sides starting to give way as her feet were pushing outward. Her cleavage was fully visible as her breasts continued to swell, flesh bulging outward as the hole widened. The back of her suit was tearing as her shoulders were pushing outward, revealing her bra clasps which were straining to hold together. The seam along her waist was starting to tear as her growing body was pulling the threads taut. The back of her pants tore open as her ass continued to swell even larger, revealing her underwear, the material stretched thin as her ass continued to fill them out. Her thighs still tearing at the outer seams of her pants as they continued to swell.<br>\r\n<br>\r\n    Already a full foot taller, Miranda can’t help but smile as her father’s idea of perfection was being ruined. Her breasts and ass were still swelling beyond normal proportions, forcing their way through the openings they have made as they continued to bulge through. Her cleavage was fully exposed, as the front and back of her bra finally snapped from the mounting pressure. Her underwear tearing as her ass was becoming too big to contain. The sides of her thighs were fully exposed as her flesh was overflowing from the torn seams.  Her waist band started to tear as her widening hips were threatening to destroy it.<br>\r\n<br>\r\n    The seams of her gloves started to tear all the way up her arms until they fell away, revealing how her sleeves are not faring much better. Her sleeves pulled all the way back to her elbows as they were splitting at the seams.  Her knee high boots just barely reached halfway past her shins. She could actually feel her toes sliding across the floor as the edges of her feet were overflowing out of her undersized shoes.<br>\r\n<br>\r\n    Her areolae were starting to become visible as they were being pushed out, a veritable sea of flesh growing between her and her nipples, creating a canyon of cleavage and plains of white breast flesh between them. Her ass cheeks were following in the same manner, becoming soft, cushion-y pillows, still encased under her remaining bodysuit. She was unable to tell exactly how big they were due to the material compressing them. She smiled as she couldn’t wait to see how much they will swell.<br>\r\n<br>\r\n    Miranda suddenly lost her balance as her ruined boots finally lost their battle against her growing feet. She fell backwards, causing the back of her pants to rip fully, causing her swelling ass to push out completely. Her breasts jiggled as she hit the floor, making short work of the front if her shirt, which was barely hanging on before. The sides of her boots were now split in half freeing her calves. The bottoms of her pants were stuck at her calves, tearing along the seams. She looked down to see how engorged her breasts had become, which were easily double the size of a large watermelon, almost reaching her naval. Her ass was roughly the same size, just a bit larger though. Her thighs were just as large proportionally, her pants now hanging onto her by just the waist band, digging into her as the remains of her underwear fell to the floor.<br>\r\n<br>\r\n    She started to stand up, trying to adjust to her new center of gravity. Her thighs had become so thick that they were rubbing against each other now. The moment she stood up straight, she felt something bump the top of her head. A quick look up as her clothes fell away from her growing frame told her exactly what it was.</span></div></div>",
            "created":1489738020,
            "id":2290874,
            "title":"Bigger everywhere"
        },
        "144111":{
            "author_id":"spark12",
            "author_name":"Count Chocula",
            "choices":[
                "Miranda outgrows the Normandy!",
                "Miranda has a biotic outburst"
            ],
            "content":"<div class=\"\"><div> <span>“I’m taller than the ceiling,” Miranda said with a hint of excitement in her voice. Hunching down farther as her head was starting to press even harder. “I don’t care what anyone says, this is my idea of a perfect body. And it's all me.”<br>\r\n<br>\r\n    As Miranda was leaning forward, she could feel herself being pulled by the increasing weight of her breasts. She knelt down, trying to prevent any unnecessary damage to the Normandy. Her breasts were now covering her lap, as she could still feel them overflowing out of her chest, as well as her hands. Her ass was pressing her bed back as it continued to swell without reason. <br>\r\n<br>\r\n    Already at ten feet tall, she could still feel herself stretching. She reached up, able to touch the ceiling with her middle finger, and she could feel it getting lower by the second. A large smile formed on her face as she could slowly start to place her palm flat as her growth continued unhindered, her arm already started to bend at her elbow. She could’t help but watch in awe as the ceiling was slowly getting closer to her face as her body was still pushing upward.<br>\r\n<br>\r\n    It didn’t take long before Miranda’s head bumped the ceiling and is now pushing up against it. She tried to lean forward, but found herself unable to from how large her breasts had become. She found herself becoming cramped from the lack of space as her breasts and ass were now being pressed up against the walls. She could really feel the pressure now as her expanding form is filling up the relatively small space. She can already hear the walls starting to creak as they are starting to give in to the mounting pressure, warping and bending as they are being pushed outward.<br>\r\n<br>\r\n    Miranda's smile slowly faded as she realized the problem that was now arising. Her quarters were becoming more cramped by the second as her growth continued undeterred, her body being pushed into her own expanding flesh. She instantly regretted not leaving the Normandy earlier when she realized that she was growing. At least she would have had a lot more room on the Citadel.</span></div></div>",
            "created":1489738260,
            "id":2290877,
            "title":"As big as a room"
        },
        "1441111":{
            "author_id":"spark12",
            "author_name":"Count Chocula",
            "choices":[
                "People panic, Miranda grows out of control!",
                "Shepard diffuses the situation"
            ],
            "content":"<div class=\"\"><div> <span>She could now feel her back being pressed up against the ceiling as her expanding frame was pushing out in all directions. Her breasts and ass pushing against the walls, as the creaking intensified as her quarters threaten to give way. She tried to compress herself a bit, but there was too much flesh pushing back against her. The metal started to give way as her burgeoning flesh started to bulge through cracks that were starting to form, the ceiling bending as her back continues to press upwards.<br>\r\n<br>\r\n    The metal ceiling started to give way as the top of her head began to emerge from the Normandy. She raised her head up as she breathed in a sigh of relief, as she did not feel as cramped anymore. Her shoulders were already starting to push through, as the tops of her breasts were already bulging up top.  She could feel the walls give way below as she felt her massive weight shift as her breasts and ass surged outward into their new found freedom. She could hear indistinct exclamations coming from inside the ship, as she felt her flesh filling the inside.<br>\r\n<br>\r\n    Miranda started to smile again, as she could still feel her growth happening at a steady pace. Her shoulders were already fully exposed as she continued to rise up even higher, the stretching sensation still surging through her. Her arms were still trapped by the metallic material of the ship, while the flesh of her breasts were still bulging upward. Just as she began to hear the Normandy starting to creak under her increasing weight, the stretching sensation faded as her growth slowed to a stop. She looked down at herself to confirm that her body was no longer expanding, feeling a bit disappointed that her growth had ended so soon. She looked down and smiled nervously at all the curious onlookers.</span></div></div>",
            "created":1489738620,
            "id":2290879,
            "title":"Miranda: now in Normandy size!"
        },
        "14411112":{
            "author_id":"spark12",
            "author_name":"Count Chocula",
            "choices":[
                "Scientists examine Miranda",
                "Jack finally gets word of what's been happening (or someone else does)"
            ],
            "content":"<div class=\"\"><div> <span>    Commander Shepard arrived back to the docked Normandy after receiving a call from Joker informing her that Miranda was growing out of the Normandy. After asking Joker to repeat that report, as Shepard could hardly believe it herself the first time; the Commander came to a determination to diffuse this situation as peacefully as possible. Before even seeing the damage herself, Shepard saw the enormous Cerberus XO, clutching her breasts, obviously leaving nothing to the imagination besides the hidden areola, smiling awkwardly down at the shocked onlookers.<br>\r\n<br>\r\n   C-Sec couldn't make much of the situation, dumbfounded themselves at what was happening, until one captain, afraid of the giant, busty woman, ordered the rest of C-Sec to prepare to fire their weapons at the intimidating giantess. <br>\r\n<br>\r\n   Concerned for her XO, Shepard rushed to the front of the crowd, placing herself between them and Miranda, still stuck in the hull of what remained of the Normandy. \"STOP!\" Shepard placed her hand before one of C-Sec's rifles. \"I'm Commander Jane Shepard, Spectre of the Citadel Council. This isn't some monster attacking the Citadel. Her name is Miranda and she is with me.\"<br>\r\n<br>\r\n   The Turian captain of C-Sec looked around, still uneasy about the whole situation, but a Spectre's credentials was good enough for him. And after thinking about it, the giantess wasn't exactly rampaging around, destroying or maiming anything else. \"Spectre Shepard\" the captain saluted Shepard, \"I will recall C-Sec, and relinquish authority here to you.\" The Turian blushed, looking back up at Miranda, then back to Shepard before turning around.<br>\r\n<br>\r\n   With a potential violent incident peacefully resolved, Shepard let out a hefty sigh of relief, before turning to face Miranda, still smiling as embarrassed as possible. The Cerberus operative gave only an awkward wave of her enormous hand, \"Hi Shepard, allow me to explain. I started growing, and I don't know why.\"<br>\r\n<br>\r\n   Shepard looked around Miranda, bits and pieces of the Normandy falling off, Miranda ripping a hole as gigantic as she was. Everything was a giant mess. \"I'll have to call in a little help...\" Shepard let out, still weirded out by this entire bizarre event</span></div></div>",
            "created":1489740420,
            "id":2290886,
            "title":"Shepard diffuses the situation"
        },
        "144111121":{
            "author_id":"spark12",
            "author_name":"Count Chocula",
            "choices":[
                "Something triggers Miranda's growth",
                "Somewhere Oriana starts growing too"
            ],
            "content":"<div class=\"\"><div> <span>   After several hours of hard work and heavy machinery to free Miranda from the Normandy, Miranda was sitting in the docking bay. Her breasts and ass swelled to immense proportions. Her breasts covered her thighs as she knelt, and her ass stuck way out. The docking bay was closed down to anyone who did not need to be there, allowing Miranda some privacy as there was nothing big enough to maintain her modesty. <br>\r\n<br>\r\n    Miranda had to endure several hours of testing, as doctors were trying to ascertain the reason for her enormous growth and what triggered it. Being bombarded with questions about her condition as they try to narrow it down.<br>\r\n<br>\r\n    The following day, one of the doctors was talking to Miranda from a platform, so as to talk to her face to face. The five foot six blonde was looking down at the test results from behind her square frame glasses, her thick hair reaching all the way down to her ankles.<br>\r\n<br>\r\n    “Hello Miranda, I am Dr. Selness,” she began. “First of all, I am assuming that you want to know your current size, correct?”<br>\r\n<br>\r\n    “I would like to, yes,” Miranda replied.<br>\r\n<br>\r\n    “Well,” Dr. Selness continued, ”You have grown from a height of five foot ten to an impressive, and unprecedented, height of thirty-six feet and ten inches.” Miranda smiled slightly as she heard the answer. “Which is about a five hundred and thirty-one percent increase in height.”<br>\r\n<br>\r\n    Miranda shifted a bit as she waited to hear the other measurements.<br>\r\n<br>\r\n    “Your breasts now measure thirty-one feet and ten inches. While your, lets just call them hips, are twenty-nine feet and ten inches.”<br>\r\n<br>\r\n    Miranda looked down at herself, enjoying her new figure. “Did you figure out what caused me to grow like this.”<br>\r\n<br>\r\n    “Well,” the doctor started, “We do have a couple working theories on that. You said that you were essentially genetically engineered by your father, correct?”<br>\r\n<br>\r\n    “Yes,” Miranda replied.<br>\r\n<br>\r\n    “From your blood work, it seemed as though your genetic coding had a flaw in it, probably from how your father handled your genetics. So this could have either occurred naturally, or, our alternative theory is that your existing genes were relatively stable, and an environmental trigger was the culprit that interacted with a faulty gene set.”<br>\r\n<br>\r\n    Miranda grinned, finding the irony in the perfection her father had tried to create. But her face suddenly changed drastically as a new realization hit her.<br>\r\n<br>\r\n    “Dr. Selness, could this growth have been prevented if it was known about beforehand?”<br>\r\n<br>\r\n    “I suppose so, why?”<br>\r\n<br>\r\n    Miranda’s mind was racing, thinking about how her sister was trying to lead a normal life. “Go get Commander Shepard, and tell her to find my sister. I think she may suffer the same condition as me.”</span></div></div>",
            "created":1489740720,
            "id":2290888,
            "title":"Genetic testing"
        },
        "15":{
            "choices":[
                "Tali'Zorah",
                "Kasumi Goto",
                "Samara",
                "Morinth",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else is on the Normandy that you can use?</span></div></span></div>",
            "created":1407474000,
            "id":1839123,
            "title":"More characters"
        },
        "151":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Breasts",
                "Hourglass ",
                "Growth "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she grow? <br>\r\n<br>\r\nBreasts: Self explanatory <br>\r\n<br>\r\nHourglass: Both breasts and butt<br>\r\n<br>\r\nGrowth: Height increase (amazon, mini-giantess, giantess), with breast and butt growth</span></div></span></div>",
            "created":1420002000,
            "id":1910146,
            "title":"Tali'Zorah"
        },
        "1511":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Prothean Facility",
                "Faulty nerve-stim",
                "Hormone Imbalance"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nProthean Facility: Going on a mission Tali comes in contact with an artifact that causes her to begin to grow. <br>\r\n<br>\r\nFaulty nerve-stim: An experimental version of the nerve-stim program come out and tali gets a hold of a copy, when ever she uses it though she grows. <br>\r\n<br>\r\nHormone Imbalance: Tali just starts growing and doesn't stop.</span></div></div>",
            "created":1420088400,
            "id":1910345,
            "title":"Breasts"
        },
        "15113":{
            "author_id":"jawsometeeth",
            "author_name":"Goodvibes",
            "choices":[
                "Yes",
                "Hormone Imbalance Go Through"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we head in farther,what about Butt Expansion?</span></div></span></div>",
            "created":1582058220,
            "id":2789269,
            "title":"Wait!"
        },
        "1512":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Prothean Facility",
                "Faulty nerve-stim",
                "Hormone Imbalance"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nProthean Facility: Going on a mission Tali comes in contact with an artifact that causes her to begin to grow. <br>\r\n<br>\r\nFaulty nerve-stim: An experimental version of the nerve-stim program come out and tali gets a hold of a copy, when ever she uses it though she grows. <br>\r\n<br>\r\nHormone Imbalance: Tali just starts growing and doesn't stop.<br>\r\n</span></div></div>",
            "created":1420088400,
            "id":1910346,
            "title":"Hourglass "
        },
        "1513":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Prothean Facility",
                "Faulty nerve-stim",
                "Hormone Imbalance"
            ],
            "content":"<div class=\"\"><div> <span>What is the reason for her growth?<br>\r\n<br>\r\n<br>\r\nProthean Facility: Going on a mission Tali comes in contact with an artifact that causes her to begin to grow. <br>\r\n<br>\r\nFaulty nerve-stim: An experimental version of the nerve-stim program come out and tali gets a hold of a copy, when ever she uses it though she grows. <br>\r\n<br>\r\nHormone Imbalance: Tali just starts growing and doesn't stop.</span></div></div>",
            "created":1420088400,
            "id":1910348,
            "title":"Growth "
        },
        "152":{
            "author_id":"jawsometeeth",
            "author_name":"Goodvibes",
            "choices":[
                "Breasts",
                "Butt",
                "Height"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, how does our high class thief expand?<br>\r\n<br>\r\nBreasts?<br>\r\n<br>\r\nButt?<br>\r\n<br>\r\nHeight?<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1544398200,
            "id":2587651,
            "title":"Kasumi Goto"
        },
        "153":{
            "choices":[
                "Breast Expansion",
                "Giantess",
                "Other (if possible)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, so what kind of expansion does the Asari Justicar go through?</span></div></span></div>",
            "created":1410411600,
            "id":1855727,
            "title":"Samara"
        },
        "1531":{
            "choices":[
                "Biotic Storage",
                "Localized Gain",
                "Viral Infection or Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Finally, what is going to cause this expansion?<br>\r\n<br>\r\nBiotic Storage - Samara's powers begin to increase and her body needs somewhere to store the excess energy, so it chooses her breasts.<br>\r\n<br>\r\nLocalized Gain - Samara finds that all of the fat in her body is going to her breasts and nowhere else.<br>\r\n<br>\r\nViral Infection - Samara gets infected with a non-contagious virus that causes breast growth.<br>\r\n<br>\r\nOr you could make up your own reason.</span></div></div>",
            "created":1420952400,
            "id":1916423,
            "title":"Breast Expansion"
        },
        "1533":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "hourglass",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about some hourglass expansion mkay or something else</span></div></span></div>",
            "created":1446872400,
            "id":2058024,
            "title":"Other (if possible)"
        },
        "15331":{
            "choices":[
                "Yes",
                "No, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do Samara's biotics play a role in causing Horuglass expansion</span></div></span></div>",
            "created":1446947160,
            "id":2058038,
            "title":"hourglass"
        },
        "155":{
            "choices":[
                "Jack",
                "Kelly Chambers",
                "Samantha Traynor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these characters?</span></div></span></div>",
            "created":1442466000,
            "id":2035996,
            "title":"Other"
        },
        "1552":{
            "choices":[
                "Breasts",
                "Hourglass",
                "Female Muscle Growth "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Kelly grow?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1443330000,
            "id":2040565,
            "title":"Kelly Chambers"
        },
        "15523":{
            "choices":[
                "An expriment of Mordin's goes awry?",
                "Finds a strange device on Omega"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Kelly get huge?</span></div></span></div>",
            "created":1467268680,
            "id":2173020,
            "title":"Female Muscle Growth "
        }
    },
    "info":{
        "author_id":"jots1106",
        "author_name":"wildcat",
        "brief_description":"I felt that it was time for a mass effect expansion and growth story",
        "created":1367192040,
        "description":"<td align=\"left\" class=\"norm\">This story is for fans of mass effect who want to see the women grow into giantess's or have their breasts get larger.<br>\r\n<br>\r\nRULES<br>\r\n<br>\r\n1. No male growth<br>\r\n<br>\r\n2.No guy on guy but girl on girl is fine<br>\r\n<br>\r\n3. Ass and belly expansion is fine but stick to growth or breast expansion for most of it<br>\r\n<br>\r\n4. No killing of main characters<br>\r\n<br>\r\nAll female characters from all games can be used.</td>",
        "id":1930974,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582058220,
        "modified":1582058220,
        "pretty_title":"Mass Effect Expansion"
    }
}