{
    "chapters":{
        "1":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "...a lady here for you.\"",
                "...two ladies here for you.\"",
                "...three ladies here for you.\"",
                "...some bad news for you. All them said no.\""
            ],
            "content":"<div class=\"\"><div> <span>You bow, and revel in the cheering of the crows. Several hundred people comprised your audience, and you were no side show. You, Tony Mesmer, were the main attraction that all of these people had paid to see. As such, your ego was justifiably bloated. You dramatically spin the chain of your handy pocketwatch and let go, as it lands in your shirt pocket, chain following suit. You bow again, happy to see the effect you have had on the crowd. You leave the stage and prepare for the next section of the night...<br>\r\n<br>\r\nYou see, you have handpicked three women from the crowd to be approached by the organizers and offered a private show. They would expect it to be similar to what they've seen so far...but how wrong they would be. Every woman chosen was beautiful, and showed up alone. The fun could go on for <i>hours</i> until somebody realized something was up. Hopefully all of them would accept the invitation...and how could they not, after your amazing show? You grin inwardly as you step into your private room and prepare for the \"show\". <br>\r\n<br>\r\nAbout 15 minutes pass, when an organizer knocks on the door, saying, \"Hey boss, I got...</span></div></div>",
            "created":1339131600,
            "id":1355493,
            "title":"The End of the Show"
        },
        "11":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "Sara",
                "Bryanna",
                "Samantha",
                "..a different girl?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Only one? Damn it! Oh well, may as well have fun while you can. You open up the door, and cheerfully say, \"Come in, come in!\", to...</span></div></span></div>",
            "created":1339131600,
            "id":1355499,
            "title":"...a lady here for you.\""
        },
        "111":{
            "author_id":"kuddles",
            "author_name":"Kuddles",
            "choices":[
                "Have her straddle your lap while you strip & grope her",
                "Tell her to bend over your knees for a spanking",
                "Have her lick your balls while you decide what you want her to  do"
            ],
            "content":"<div class=\"\"><div> <span>You escort the sexy little Asian in the short skirt into your private trailer.  After some small talk and a drink together (during which you've already been gently mesmerizing the susceptible girl), you invite her to attempt to hypnotize you, using your gold pocket watch.  Telling her to make sure the watch swings back and forth, and to repeat after you, she is tricked into total hypnosis, and you ascertain that she is now totally under your power of suggestion.  She is now Slave Sara, and she must refer to you as Master.<br>\r\n<br>\r\nYou sit back in your chair and have her crawl to you on her knees.  Once to you, you tell her to bend forward, and you slap your dick back and forth across her pretty face, then tell her to show off her pretty titties for you, which she happily does by raising her tiny top and wiggling side-to-side playfully.</span></div></div>",
            "created":1380776400,
            "id":1673842,
            "title":"Sara"
        },
        "112":{
            "author_id":"howitzer",
            "author_name":"Howitzer",
            "choices":[
                "Play with her age mentally",
                "Change her personality",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Although she was not interested in the show Bryanna all the free stuff she could get from a show she snuck into underage as well as impress her friends with a great story the next day of a private meeting with the hypnotist. Bryanna feeling like quite the rebel believed this was her chance to show her friends she was the best among them. On the other hand Tony was happy this lady showed up there was so much he could do with her play with her age (mentally), play with her personality or simply just show her how interesting hypnosis could be for the both of them. <br>\r\n\"Hello I'm Tony please come in and take a seat.\"<br>\r\n\"Hey I'm Bryanna, thanks.\" she says as she sits down with Tony sitting opposite of her.<br>\r\n\"Thanks for agreeing to come I hope I can make it worth your time. So before we start I just have to ask how old are you?\"<br>\r\n\"I'm...18 my birthday was last month.\" she nervously says<br>\r\n\"Ok just making sure. Now I'm going to hypnotize you using my pocket watch....\" he says removing it from his pocket \"and all I need you to do is fallow it with your eyes.\"<br>\r\n\"sure.\" Bryanna says trying not to anger the hypnotist by telling him about how much of a joke she thought hypnotism was because of course this would make a great story about how she couldn't even be hypnotized by him in a private session.<br>\r\nTony starts swinging the watch back and forth and began with the monologue \"Bryanna fallow the watch as it goes back and forth, back and forth, back...and...forth. You feel yourself becoming increasing interested in this pocket watch and the more effort you put into focusing on it the les effort you will put into everything else. Keep fallowing the watch and as it swings feel your surroundings just melting away as you put no concentration into them but simply focus on the watch and my voice. Now all this effort you are putting into staring at this watch is starting to cause you to feel tired but not to the point of falling asleep because you must focus on this watch. You feel your heart rate and your breathing slowing down as you become more relaxed focusing on this watch but the more you focus the more tired you become. Now you are at the point where you can't hold out much longer you are ready to fall asleep to much of your energy has gone into staring and fallowing this watch. So when I clap my hands you will stop staring at this watch and fall asleep.\"<br>\r\n<br>\r\nTony then claps his hands and Bryanna falls completely asleep.<br>\r\n<br>\r\nBut what does Tony feel like doing to her???</span></div></div>",
            "created":1442035860,
            "id":2033162,
            "title":"Bryanna"
        },
        "1121":{
            "choices":[
                "Make her think she's older",
                "Make her think she's younger",
                "Make her act like a stereotypical fifteen year old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"So how old are you Bryanna? I mean really?\" you ask<br>\r\n\"Fifteen.\" she answers.<br>\r\nJust as you thought. Well at least you knew where to start.</span></div></span></div>",
            "created":1455462420,
            "id":2103987,
            "title":"Play with her age mentally"
        },
        "11211":{
            "choices":[
                "18-30",
                "40-80"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Well now as far as you are concerned you are in fact.....................\"</span></div></span></div>",
            "created":1455528360,
            "id":2104412,
            "title":"Make her think she's older"
        },
        "112111":{
            "author_id":"bullet1520",
            "author_name":"bullet1520",
            "choices":[
                "Something sexy",
                "Something silly or ridiculous",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Well now as far as you are concerned you are in fact twice your age\" you state with a tone of authority. You walk over to the costuming rack, left there by staff at your request. No reason for them to find it odd, you're a performer who employs the help of many props and people alike. You find a women's business suit and some professional(ish) heels, close enough to the right size for your enthralled guest.<br>\r\nYou hand it to her while giving her more instructions; \"Get dressed in this as I command you further\" and she leaves her old clothes in a pile while she dons her new outfit. \"You're 30 years old, and work as an executive for a large company. You've hired me to entertain your upcoming holiday party, and you've just finished showing me around the area I'll be performing in. We're now back in this room, your private office. You now see this room not as it is, but as your office; clean organized, appropriate for meetings with other executives. The couch you're sitting on is the perfect spot for casual interactions such as the nature of ours.\"<br>\r\nBryanna, still dazed and obedient, nods slowly, absorbing your suggestions. She is finished getting dressed, and looks fantastic. Not only does she look professional in the suit, but she fixed her hair up in a high ponytail to complete the look. She has a new aura of confidence about her that one would not expect to find in someone of her age.<br>\r\n<br>\r\nNext, you suggest to Bryanna...</span></div></div>",
            "created":1553453100,
            "id":2634206,
            "title":"18-30"
        },
        "11212":{
            "choices":[
                "Think you're younger",
                "Give her younger traits"
            ],
            "content":"<div class=\"\"><div> <span>\"Well I don't appreciate kids sneaking into my shows Bryanna. Do you know what could happen if we get caught serving you?\"<br>\r\n\"Yes.\" she answered roboticly.<br>\r\nYou chuckled at this.<br>\r\n\"Well I think we need to remind you that at the end of the day you are just a little baby don't we?\"<br>\r\nThere was a silence.<br>\r\n\"From now on Bryanna you will.............\"</span></div></div>",
            "created":1455528180,
            "id":2104410,
            "title":"Make her think she's younger"
        },
        "112121":{
            "author_id":"doggog613",
            "author_name":"DogGod613",
            "choices":[
                "Tony convinces bryanna that she is a young slave",
                "Tony convinces bryanna that she is a cute genie"
            ],
            "content":"<div class=\"\"><div> <span>As Bryanna falls deeper into sleep,  Tony convinces her that although she enjoys her simi-adult lifestyle,  deep down there are times in our life that we all want to relive,  and although she was still physically an adult her inner child was throwing a mental tantrum and missed a time when she was out in the yard barefoot,  catching fireflies,  she was slipping into a deep deep pool of memories,  hypnotism worked best when your victim was told to do something that they subconsciously already wanted to do,  and childhood memories were one of the best place to start,  it was also also easier to convince her to furfill many of his deepest darkest fetishes particularity foot fedishes.  All was going well except for bryanna's eyes now open but the blackness of the pupils had already taken control of her eyes.  \"Now bryanna,  how old are you,  not of body but of mind,  how old are you? \" Tony asked delighted by his wicked plan,  \"mmm I-I don't know I can't member\" said bryanna still a bit woozy,  \"and if you had to guess how old would you say you are\" asked Tony grinning a creepy unatureal grin,  \"mmm eight I guess... \"</span></div></div>",
            "created":1504171320,
            "id":2377707,
            "title":"Think you're younger"
        },
        "112122":{
            "choices":[
                "Do you want to keep her around and play with her a bit more",
                "Or send her on her way for now"
            ],
            "content":"<div class=\"\"><div> <span>\"Have a strange craving to suck your thumb. You will long for the security and comfort of a little teddy by you at all times. You will become confused by this strange wannabe goth fascination you have and are going to go back to good old pinks and princessess and finally you will loose all control of your bowels. Is that understood?\"<br>\r\nShe merely nodded.</span></div></div>",
            "created":1455528300,
            "id":2104411,
            "title":"Give her younger traits"
        },
        "11213":{
            "choices":[
                "She caught up with the others ",
                "She sees a guy that has a crush on her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Anytime anyone says the word, \"teenager\" you will immediately become a stereotypical 15 year old girl. You will be boy crazy, preppy, and full of energy. Do you understand?\"<br>\r\n<br>\r\n'Yes' the Goth Bryanna replies.<br>\r\n<br>\r\nThis will continue until someone says the word \"normal\" At that moment you will return to your normal self unaware of what happened. <br>\r\n<br>\r\n</span></div></div>",
            "created":1482966600,
            "id":2255651,
            "title":"Make her act like a stereotypical fifteen year old"
        },
        "1122":{
            "author_id":"jj2u",
            "author_name":"JAJ",
            "choices":[
                "Wake her up",
                "Set some more triggers",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Whenever you feel embarrassed, you'll have the urge to take off an article of your clothing. The more embarrassed you are, the less clothes you'll wear. And if there's nothing left for you to take off, you'll stop covering yourself. However, you'll still be very embarrassed, when people see you under clothed. Do you understand?\"<br>\r\n\"Yes!\"<br>\r\n\"Good, now I want to set some triggers: Every time I say the word \"awake\", you'll wake up from the trance. <br>\r\nEvery time I say the word \"sleep\", you'll fall back into this trance. <br>\r\nEvery time I say the word \"freeze\", you'll be unable to move, but be fully aware of the situation.<br>\r\nEvery time I say the word \"beach\", you'll strip to your underwear and act like it is your bikini. <br>\r\nEvery time I say the word \"dressed\", you'll believe, that you're dressed normally.<br>\r\nEvery time I say the word \"brave\", you'll realize, how you're really dressed. Do you understand?\"<br>\r\n\"Yes!\"<br>\r\n<br>\r\nNow that he set the right triggers, Tony decides to...</span></div></div>",
            "created":1603575960,
            "id":2928285,
            "title":"Change her personality"
        },
        "11221":{
            "author_id":"jj2u",
            "author_name":"JAJ",
            "choices":[
                "Humiliate her further?",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Awake!\" Immediately Bryanna opens her eyes and starts looking around a bit confused. \"Did you hypnotize me? I can't remember.\" \"Yeah,\", Toni replies, \" you told me anything. Especially how much you love swimming and visiting a <i>beach</i>.\" \"Really?\", she asks, while taking off her boots and socks. \"What is going on?\" She seems to be confused, as she strips off her skirt and shirt. \"No! Why am I wearing my bikini? This is so embarrassing.\" <br>\r\nToni just sits there smirking and enjoys the show. Now Bryanna drops her bra to the floor and instantly covers her flat chest with both her hands. <br>\r\nStanding in front of Toni in only her panties makes the embarrassment even worse, which leads to her also dropping the Panties. As she wants to also cover her crotch, the situation is embarrassing enough for her to drop her hands to the sides. <br>\r\nFinally Toni speaks up: \"Don't you want to get <i>dressed</i>?\" Immediately the nude girl loses all her embarrassment. \"Why? I am dressed!\" \"Ok, so it would be alright for you, if we took a picture together?\" \"Sure.\" Toni first takes a few selfies with Bryanna, before taking pictures of only her. \"I think you're really <i>brave</i> for letting me take those pictures.\" Bryanna looks at you shocked, but is too embarrassed to cover up. \"What have you done?\" Toni smiles: \"I haven't done anything. I could, but what would be the fun in this?\" \"Please let me wear clothes. This is too humiliating. Please!\" <br>\r\nWhat will Toni do?</span></div></div>",
            "created":1603578120,
            "id":2928306,
            "title":"Wake her up"
        },
        "1123":{
            "author_id":"animeguy123",
            "author_name":"Mr. Anime Guy",
            "choices":[
                "Foot fetish stuff",
                "Implant sexual suggestions in her head",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will he do to Bryanna now that she's asleep and under his power.</span></div></span></div>",
            "created":1548950760,
            "id":2610413,
            "title":"Readers Choice"
        },
        "113":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Kiss her feet",
                "Sniff her feet",
                "Rub her feet"
            ],
            "content":"<div class=\"\"><div> <span>Samantha came in giggling, she seemed flattered that you had asked her.<br>\r\n<br>\r\nShe sits right down and you bring out your pocket watch and start to hypnotize her<br>\r\n<br>\r\n\"You are getting very sleepy Samantha...\" You say<br>\r\n<br>\r\nSamantha's eyelids slowly droop<br>\r\n<br>\r\n\"You are in my power...\" You say<br>\r\n<br>\r\n\"I am in your power...\" She says sleepily<br>\r\n<br>\r\n\"Now that you are in my power.\" You say \"I want you to take off those shoes and socks.\"<br>\r\n<br>\r\nShe does so...You decide to</span></div></div>",
            "created":1368594000,
            "id":1590602,
            "title":"Samantha"
        },
        "1133":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "Do whatever you want! Haha!",
                "Do foot stuff"
            ],
            "content":"<div class=\"\"><div> <span>Samantha continues to breath deeply, her footwear discarded. You quietly pull up a chair, sitting down as you gently grasp her ankles and place her limp feet on your lap. Her trance would need to be deepened before things got more...intense. <br>\r\n<br>\r\n\"Samantha, you are now walking on a beach. The cool breeze will feel good against your warm body, and the sand between your toes very relaxing. The further down the beach you walk, the deeper your level of hypnosis will become,\" you say to the girl as you begin rubbing and admiring her feet. The rubbing would be imagined to her entranced mind as the sand on the beach and so would not break her trance. You watched her breathing become even more relaxed, her body limper, and became turned on by the sight of feet and the feel of their smoothness in your hands.<br>\r\n<br>\r\nA few minutes went by before her trance level reached the deepest it could get. Now you would have free reign to command her as you saw fit and to do whatever you wanted to her. The choice was yours.</span></div></div>",
            "created":1368594000,
            "id":1590682,
            "title":"The Art of the Trance"
        },
        "11332":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Use a feather on her feet",
                "'Investigate' the peppermint smell"
            ],
            "content":"<div class=\"\"><div> <span>Seizing this opportunity, you grab some baby oil out your 'supply cabinet' and proceed to rub some on her foot.<br>\r\n<br>\r\nSamantha giggles slightly as you rub the oil on her feet.<br>\r\n<br>\r\nHer feet are soft and silky smooth, she clearly takes very good care of her feet.<br>\r\n<br>\r\nYou also smell a sweet smell from her feet, a peppermint smell<br>\r\n<br>\r\nYou decide to...</span></div></div>",
            "created":1369371600,
            "id":1596241,
            "title":"Do foot stuff"
        },
        "12":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Sara and...",
                "Bryanna and...",
                "Samantha and...",
                "two different girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Only two girls? Are you kidding? Well that's still good. As the old saying goes, one is better than none. However two is better than one. \"Come in, come in,\" you told...</span></div></span></div>",
            "created":1339218000,
            "id":1356414,
            "title":"...two ladies here for you.\""
        },
        "121":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Bryanna",
                "Samantha",
                "a different girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sara and who?</span></div></span></div>",
            "created":1339218000,
            "id":1356425,
            "title":"Sara and..."
        },
        "122":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Sara",
                "Samantha",
                "a different person"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bryanna and who?</span></div></span></div>",
            "created":1339218000,
            "id":1356426,
            "title":"Bryanna and..."
        },
        "123":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Sara",
                "Bryanna",
                "a different person"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samantha and who?</span></div></span></div>",
            "created":1339218000,
            "id":1356427,
            "title":"Samantha and..."
        },
        "1232":{
            "author_id":"xhion",
            "author_name":"Xhion",
            "choices":[
                "Swap their personalities",
                "Hypnotize Bryanna into Samantha's foot slave?",
                "Sara enters the room"
            ],
            "content":"<div class=\"\"><div> <span> You receive both girls in your private room, Samantha is quite impressed and excited but Bryanna in the other hand has an expressionless face; Samantha was wearing a red BodyCon Dress matching her platform slingback's while Bryanna adorned herself whit an exquisite black lace corset, red Hell Bunny Tartan Frilly Mini Skirt, thigh high goth boots, striped tights over a black pantyhose and a black lace frill around her neck.<br>\r\n <br>\r\n \"I didn't thought you will accept my invitation, after all, it felt like you were about to sleep\"<br>\r\n \"I just came to see your tricks\" her tone was quite challenging and of course you are not going to tolerate it.<br>\r\n \"How rude!\" Samantha interrupted \"you should felt honored to be asked by the great Tony Mesmer himself\"<br>\r\n \"Thanks, I'd appreciate that\" Bryanna just sigh in response.<br>\r\n \"You're welcome, great Tony\" she bite her finger whit a playful grin on her face, and the plan was starting to take form in your mind.<br>\r\n<br>\r\n \"Well Bryanna how about this? I'll try to hypnotize you and if I fail, I'll give you anything you want\" as the words came out of your mouth, you turn off the lights making the light of a single candle the only light source in the room.<br>\r\n \"...Deal\" the shadow of a smile crossed Bryanna's face but it disappeared immediately.<br>\r\n \"But great Tony, that's unfair\" <br>\r\n \"Oh don't worry Samantha, you can participate too, I want both of you to watch the candle... your eyes must be fixed into the flame\" You grabbed the candle and started to move it from left to right, slowly both women become mesmerized by your powers, her eyes lost in the flame and their bodies limp \"good, as you look into the flame you will become more and more relaxed and your eyes will become more and more heavy and when I turn off this candle you will be so relaxed than you can no longer keep your eyes open, you will fall asleep and the only thing you can hear will be my voice\"<br>\r\n<br>\r\n...And then he tuned off the light.</span></div></div>",
            "created":1407560400,
            "id":1839253,
            "title":"Bryanna"
        },
        "124":{
            "author_id":"animeguy123",
            "author_name":"Mr. Anime Guy",
            "choices":[
                "Elizabeth and Jordan (new characters)",
                "Hannah and Megan (new characters)",
                "Other girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about two new girls?</span></div></span></div>",
            "created":1548950880,
            "id":2610414,
            "title":"two different girls"
        },
        "13":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "You ask Brianna her last name",
                "You ask Samantha about her sexuality",
                "You ask Sara if she is dating Samantha",
                "You ask Brianna her age",
                "You ask the three of them if they are having fun"
            ],
            "content":"<div class=\"\"><div> <span>You smile as is your due. Three fabulous young women have agreed to attend your private invitation. You thank the organizer and enter the room. All three women are there, waiting for you. You note that the little Asian girl Sara is sitting on Samantha's lap as Samantha runs her fingers through her air. Sara reminds you of Liza Lapiri from Dollhouse and Dexter. Obviously the two have entered into a romantic relationship. That makes their submission greater.<br>\r\n<br>\r\nBrianna is also there, glaring at you dismissively. \"Hello ladies. My name is Tony Mesmer, and I think I can show you things you have not experienced before.\" you proudly declare. Brianna rolls your eyes. \"Don't bet on it, lady!\" she retorts. You smile as you retract a silver coin. \"If you could please focus your attention on the coin; it would please me!\" You choose your words carefully, yet implant the thought for later. The girls watch the coin as you twirl it around, the light catching it. With your spare hand, you reach for your pocket watch, swinging it seemingly aimlessly.<br>\r\n<br>\r\nYou notice that Sara and Samantha are starting to sway, their eyes becoming increasingly glazed. Brianna is trying to resist, her eyes starting to close and open. \"How are we feeling?\" you gently ask. \"We are happy!\" exclaim Sara and Samantha, unaware that this is written on the other side of the pocket watch. \"Y-You're g-going to h-have to do b-b-better than th-that!\" stammered Brianna, her eyes fighting sleep. You beam as you continue to twirl the coin in one hand and swing the watch in the other.<br>\r\n<br>\r\nThe dual act of the coin and watch is weakening resistance. While you remain certain that Sara and Samantha have already submitted; you maintain your actions to ensure Brianna joins them. Your mind races about the possibilities of three women. The fact that Sara and Samantha are involved; this will make your task considerably easier. Brianna is starting to sway as you notice she is starting to fall under. You decide to test the waters a little with your first request.<br>\r\n</span></div></div>",
            "created":1378270800,
            "id":1657919,
            "title":"...three ladies here for you.\""
        },
        "135":{
            "choices":[
                "pleasure Brianna",
                "have fun with sam and sarah"
            ],
            "content":"<div class=\"\"><div> <span>    \"Having fun ladies?\" you jest, knowing its a command phrase more than a question. \" I'm sure you’ve all noticed that the more you follow along with my words the more control i have over you're mind and bodies, and the more that i control you the more you enjoy my words and my control\" Sam and Sarah's faces were flushed with goofy smiles and glazed over eyes, While Brianna squirmed a bit knowing her fate but not being able to resist much more. You lean over towards brianna and whisper in her ear making her shake a little bit, you also suspect shes trying not to moan from you're words \"Brianna you enjoy my words soo much, infact my words are incredibly pleasurable to you, and the more pleasure you get from my words, the deeper under my control you become, and the deeper you go the more pleasure you recieve. After all Brianna submission to me is raw arousal\"<br>\r\n<br>\r\nAt this point the girl was completely lost to her own arousal and the control she felt, you and she both knew she was at you're mercy. Her face was flushed deep red and her breathing was deep but intense. The other girls we're clearly stuck in a trance circle of their own and their heads were drooped down in a deep submissive slumber, so you figured you'd enjoy breaking Brianna. \"No Brianna whenever i touch you an intense feeling of arousal and pleasure wash's through you're body\". you command  \"yes\" she Breathily replied as you stroked her arm and watched her squirm and moan blissfully to the touch, eyeing you like you were prey.</span></div></div>",
            "created":1388034000,
            "id":1713801,
            "title":"You ask the three of them if they are having fun"
        },
        "1351":{
            "choices":[
                "make brianna cum",
                "play with the other two"
            ],
            "content":"<div class=\"\"><div> <span>      \" Now Brianna whenever i say the words pleasure, i want you to imagine and feel a powerful sexual wave of energy wash through you tingling you're nerves and making you feel amazing\" Brianna just nodded her head in agreement, knowing every time that word would be used her body would Fill with those feelings. She was panting heavily and you could almost smell her arousal she was so turned on. \"now Briana i want you to try and not Feel the emotions i say, but im sure you will find the more you try not to the more you will Feel any Feeling or emotion that i describe\" she gulped in anticipation, her body expecting what was about to come inside of her. \"Brianna? Feel Pleasure.\" at that moment and that word her body roared to life in a sexual explosion of bliss and sexual ecstacy that she couldnt control. It was at that moment she knew his words controlled her body completely. She could feel herself dripping and already felt a craving for that feeling. She let out a loud moan of approval and stared into his eyes giving herself even more to the power of these words. \"ohh my fucking god that Felt good, more please more, i need that feeling inside of me, god you have me so turned on, how do you Fucking do that? its like youre words are magic.\" I put my hand out to shush her. \"Relax brianna i know what you want and im prepared to give it to you, just as you're body is subconsciously prepared to really Feel everything i say.\" She bowed her head in shame knowing it was true, every feeling or emotion that was said would be felt, and it was known to everyone present. </span></div></div>",
            "created":1388034000,
            "id":1713841,
            "title":"pleasure Brianna"
        },
        "14":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "Sara, just getting into her car.",
                "Bryanna, at the side of the road, thumb up, tapping her foot impatiently.",
                "Samantha, flirting with a guy to try and get a ride home.",
                "Another girl."
            ],
            "content":"<div class=\"\"><div> <span>You grit your teeth as you open the door. Reading the man's nametag, you say, \"Thank you very much, Albert. Finish cleaning up here. I have to go home early, I am not feeling well.\" Without waiting for a response, you briskly walk past him, grabbing your jacket as you pass the coat hanger. You walk out of the backdoor without breaking stride and turn immediately into the parking lot. There, you see...</span></div></div>",
            "created":1339131600,
            "id":1355502,
            "title":"...some bad news for you. All them said no.\""
        },
        "141":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You grin at the sight. Tonight would not be so boring after all. You get into your car just as she pulls out of the parking lot. You follow her, trailing behind, but not so much as to lose sight of her. You follow her for quite some time, as the two of you drive into a residential neighbourhood. The question is...does she suspect the car behind her is following her?</span></div></div>",
            "created":1339131600,
            "id":1355507,
            "title":"Sara, just getting into her car."
        },
        "1411":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "Screw it. You want her! Hit the pedal and risk it.",
                "Leave her be. A night of sex is not worth jail."
            ],
            "content":"<div class=\"\"><div> <span>You follow her as she pulls into a No Exit street. <i>\"No exit?\"</i>, you think to yourself. <i>\"This must be where she lives. She can't be older than 20. I wonder how she afforded a house.\"</i> You follow along behind her as she pulls into a driveway. Perfect. But then, to your dismay, she pulls out again and drives back the way she came, to the entrance of the street.<br>\r\n<br>\r\nYou are smart enough to realize what she is doing. For you to also come into a No Exit street and then leave, you would have to be following her. The shy, suggestible Asian is clearly no fool. You grit your teeth as you ponder your options, her car shrinking in the distance...</span></div></div>",
            "created":1339131600,
            "id":1355510,
            "title":"Yes"
        },
        "14111":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "...go under. Victory is yours!",
                "...bite her lip, and ask you to hurry up. Her will is weakening."
            ],
            "content":"<div class=\"\"><div> <span>You speed up, and turn out of the street a few seconds after she does. You follow behind her, a slight sweat breaking out. <i>\"What will happen now? Wait, is she on her phone?\"</i>, you think. And she is, you quickly find out. Behind you, you hear sirens. Sure enough, there is a police car right behind you. You pull over amicably, and watch in horror as Sara drives into the distance, disappearing from view. You wind down your window, and your eyes meet those of a darkly beautiful police officer, possibly Italian. She has long, lustrous black hair, olive skin, and deep eyes. From your vantage point, her large breasts are right at eye level. \"Why, thank you Sara...\", you say to yourself with a grin. And then, before the officer can ask what you mean, you say, \"What is the problem, officer?\"<br>\r\n<br>\r\n\"We received a call from an anonymous source that you were following a car around.\" Bullshit, it was Sara herself. Actually, for the police car to find you and Sara, Sara would have had to have been in constant contact with this officer. After all, the cars never stopped; the two of you were in constant motion. The officer continues, \"Is this true, sir?\" Her voice is musical.<br>\r\n<br>\r\nYou meet her gaze full-on, something few people can do to a beautiful woman or a cop, furthermore both at the same time. \"Not at all, officer. I was just heading home.\" Needless to say, she doesn't exactly buy it. \"Can I see your driver licence, sir?\" Of course, that would foil your lie, as your address was on it. But if your plan worked, she would never even get your name. \"Certainly officer,\" you casually say. Reaching into your pocket, you continue to meet her gaze with your hypnotic eyes. You pull out your wallet, covered in sparkly pieces of metal, and begin to fiddle with it, pretending to have difficulty getting it open. As you do, the setting sun reflects off the metal and on to her face and eyes. This, combined with your hypnotic stare, cause her to...</span></div></div>",
            "created":1339131600,
            "id":1355516,
            "title":"Screw it. You want her! Hit the pedal and risk it."
        },
        "141111":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "Sara will pay for what she did.",
                "This cop is sexy enough."
            ],
            "content":"<div class=\"\"><div> <span>You grin as she stand there with glassy eyes. \"Can you hear me?\", you ask her. \"Yes...\", is her blank response.<br>\r\n\"Good then! What is your name?\"<br>\r\n\"Alessandra...\"<br>\r\n\"Well, Alessandra, I want you to imagine yourself lying on a bed. That bed is inside an elevator, and is very comfortable.\"<br>\r\n\"Yes...very comfortable...\"<br>\r\n\"Now, the elevator will start moving down when I snap my fingers, and with each floor it passes, you fall deeper and deeper into this trance...do you understand?\"<br>\r\n\"Yes...\"<br>\r\n\"Good. But here is the thing: the building you are in has an infinite number of floors. The elevator will only stop when you are as deeply hypnotized as you possibly can be, willing to obey every command I give you without question. Do you understand?\"<br>\r\n\"Yes...\"<br>\r\n\"Good then!\", you say, snapping your fingers. She collapses to the ground, and remains there for nearly two minutes. Luckily, nobody is around to see a police officer lying on the ground. After about two minutes she rises to her feet. \"Are you willing to obey every command I give you, Alessandra?\"<br>\r\nShe responds with, \"Yes Master.\" Interesting, you didn't even have to tell her to call you master. <br>\r\n<br>\r\nA few minutes later, you have parked your car and are sitting in the passenger seat of her police car while she drives. \"What was the name of the woman who called about me?\" <br>\r\n\"Sara Ling, Master.\" You take the police issue laptop from between the seats and type in the name Sara Ling. There is only one result. You now have Sara's address. Do you go there with the police officer and make it a threesome, or go to Alessandra's house and have fun there?</span></div></div>",
            "created":1339131600,
            "id":1355525,
            "title":"The Hypnotized Policewoman"
        },
        "1411111":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "normal",
                "enter cop show style"
            ],
            "content":"<div class=\"\"><div> <span>You wanna make Sara pay, and the Alessandra can help you. \"Alessandra, you will take me to Sara Ling's home, and help me punish her,\" you commanded. \"Yes, master,\" Alessandra replied in monotone.<br>\r\n<br>\r\nWhen you get there, you take a moment to look at her front yard. It looks very nice. The bushes were trimmed to look like tigers, dragons, etc. You and Alessandra get out of the car, and walk up the walkway. As you get closer to the door, you wonder how to enter Sara's home. You could simply knock on her door, or ring the doorbell, but that seems a tad boring. Since you have Alessandra under your spell, you could enter like they do on cop shows.</span></div></div>",
            "created":1340168400,
            "id":1363577,
            "title":"Sara will pay for what she did."
        },
        "14111112":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to do this cop show style tell and tell Alessandra kick down the door. When she does, you see peer in and do you see Sara?</span></div></span></div>",
            "created":1340254800,
            "id":1364221,
            "title":"enter cop show style"
        },
        "141111121":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...in the kitchen/living room.",
                "...on the floor at the door unconscious"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see her and she's...</span></div></span></div>",
            "created":1340254800,
            "id":1364224,
            "title":"yes"
        },
        "1411111211":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...kitchen",
                "...living room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She turned to the turn quickly asking, \"What are you doing here?\" from the...</span></div></span></div>",
            "created":1340254800,
            "id":1364226,
            "title":"...in the kitchen/living room."
        },
        "1411111212":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "hypnotize her",
                "punish her while she's asleep"
            ],
            "content":"<div class=\"\"><div> <span>She's lying on the floor unconscious. She must've heard the car pull up and come to see what was outside. You can't use normal means of hypnosis on her now, but you could use your MP3 player that you carry around and play the hypnosis recording. Then when she wakes up, she'll be ripe for the picking. Then again, you could have fun with her while she's asleep. What will you do?</span></div></div>",
            "created":1340254800,
            "id":1364230,
            "title":"...on the floor at the door unconscious"
        },
        "14111112121":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "wait until she awakens",
                "MP3 hypnosis"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>will you wait until she wakes up to hypnotize her, or put the earphones in her so that she's ripe for the plucking when she awakens?</span></div></span></div>",
            "created":1340254800,
            "id":1364232,
            "title":"hypnotize her"
        },
        "141111122":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You don't see Sara, but you do see a nice living room with a chinese painting with a tiger and a dragon(AN: y'all know the one, right?) and a kitchen. Entering the house, does she hear someone?</span></div></span></div>",
            "created":1340254800,
            "id":1364222,
            "title":"no"
        },
        "1411111222":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "\"...bedroom.\"",
                "\"...bathroom.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She's just minding her own business, completely unaware of the people that have entered her house. \"Come Alessandra, let's check the...\"</span></div></span></div>",
            "created":1340254800,
            "id":1364223,
            "title":"no"
        },
        "14111112221":{
            "author_id":"lichlord08",
            "author_name":"Lichlord08",
            "choices":[
                "Falls under",
                "Resists"
            ],
            "content":"<div class=\"\"><div> <span>You arrive at Sara's bedroom and motion for Alessandra to be quiet as you peek into the room. You find Sara facing away from you wearing a revealing red nighty and panties, getting ready to go into bed. You give a hand signal to Alessandra, who enters the room quickly and grabs Sara from behind, shocking the girl as she is turned to face you. You pull out your pocket watch and began to swing it back and forth in front of her, beginning her induction.<br>\r\n<br>\r\nDoes she fall under your power right a way or does she resist?</span></div></div>",
            "created":1408251600,
            "id":1842925,
            "title":"\"...bedroom.\""
        },
        "141111122211":{
            "author_id":"lichlord08",
            "author_name":"Lichlord08",
            "choices":[
                "Punish her",
                "Fun Time"
            ],
            "content":"<div class=\"\"><div> <span>Moments later, Sara falls into a deep trance. Alessandra lets her go as she stands at attention, awaiting her next order. you look at Sara.<br>\r\n<br>\r\n\"Sara, I am your master, you are my slave. You will obey all my commands without hesitation.\"<br>\r\n<br>\r\n\"Yes Master, I am yours,\" Sara replied, kneeling before you. You examine your newest slave and think on what to do with her. You're still upset at her for sending the cops after you.<br>\r\n<br>\r\nShould you punish her or have some fun with her and Alessandra?</span></div></div>",
            "created":1408251600,
            "id":1843034,
            "title":"Falls under"
        },
        "1411111222112":{
            "author_id":"lichlord08",
            "author_name":"Lichlord08",
            "choices":[
                "have sex with each girl individually?",
                "have the girls make out with each other?"
            ],
            "content":"<div class=\"\"><div> <span>You smile as you look between your two slaves, before sitting on Sara's bed and opening your pants.<br>\r\n<br>\r\n\"Sara, remove your top, come over here and give me a blowjob,\" you command.<br>\r\n<br>\r\n\"Yes Master,\" she replies as she removes her night top, revealing her firm breasts, before crawling over to you and removing you erection from your pants. She gives it a few licks before placing the length of it in her mouth, expertly sucking on it.<br>\r\n<br>\r\nAs you begin to moan, you turn towards Alessandra, standing at attention in her police outfit.<br>\r\n<br>\r\n\"Alessandra, strip for me,\" <br>\r\n<br>\r\n\"Yes Master.\" She begins to remove her cloths, you feel yourself getting hotter as she removes her shirt, revealing a black laced bra that barely contains her mounds, before removing her jeans, showing her matching panties and her smooth ass. This, combined with Sara's ministrations, cause you to release your load into Sara's mouth, who greedily swallowed it all, before looking up at you to receive her next order.<br>\r\n<br>\r\nWhat should you do next?</span></div></div>",
            "created":1408390860,
            "id":1843625,
            "title":"Fun Time"
        },
        "14111112221121":{
            "author_id":"lichlord08",
            "author_name":"Lichlord08",
            "choices":[
                "Sara?",
                "Alessandra?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who first?</span></div></span></div>",
            "created":1408396560,
            "id":1843660,
            "title":"have sex with each girl individually?"
        },
        "141112":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...her will is broken.(her will lost the battle)",
                "...she's still resisting.(Almost there)"
            ],
            "content":"<div class=\"\"><div> <span>She bit her lip, looking like she was gonna colapse. \"Sir please hurry up,\" she asked. 'She's strong. Perfect. That'll make this more satisfying.' \"Of course, Officer.\" You continue to look at her and shine the light in her eyes. She continues to bite her lip and...</span></div></div>",
            "created":1340168400,
            "id":1363636,
            "title":"...bite her lip, and ask you to hurry up. Her w..."
        },
        "142":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...\"Sure.\"(All right!)",
                "...\"I'm just waiting for someone.\"(Looks like it's time to break out the big gun",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You see Bryanna, at the side of the road, trying to get a ride home. 'Perfect,' you think to yourself. 'I can go up there, offer her a ride home, hypnotize her, and have some fun. If she refuses, then I can hypnotize her to accept.'<br>\r\n<br>\r\nYou get in your car, and ride up to her. She seems to be getting more irrataited. You stop and say, \"Hello, ma'am. May I give you a ride home?\" She turned, and looked at you before replying...</span></div></div>",
            "created":1340168400,
            "id":1363626,
            "title":"Bryanna, at the side of the road, thumb up, tap..."
        },
        "1421":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...under your control instantly",
                "...resisting at first"
            ],
            "content":"<div class=\"\"><div> <span>'All is going according to plan.' Bryanna got into the passenger side and buckled her seatbelt. You got out your pocket watch and started swinging it in front of her face. She was...<br>\r\n<br>\r\n<br>\r\n1) under your control instantly(Yes! That was too easy!)<br>\r\n2) resisting at first(that's fine. you like strong-willed girls that don't go under without a fight. It's more fun to see a girl slowly lose herself, trying to hold on, only to fall under your complete control)</span></div></div>",
            "created":1340168400,
            "id":1363632,
            "title":"...\"Sure.\"(All right!)"
        },
        "1422":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...under your control instantly",
                "...resisting at first"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>'Time to bring out the big guns.' You pulled out your pocket watch. You tapped on your car door, getting her attention and started swinging the watch in front of her face. She was...</span></div></span></div>",
            "created":1340168400,
            "id":1363634,
            "title":"...\"I'm just waiting for someone.\"(..."
        },
        "14222":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "You will do as I command",
                "You will get into my car"
            ],
            "content":"<div class=\"\"><div> <span>She shook slightly, appearing gazed. \"Are you ok, Ma'am?\" you ask. 'I...I'm f-fine, lady!\" she managed to stammer. You smile as she is unable to fight the power of the hypnotic watch, swaying back and forth. You wait patiently, watching fascinated as her will, slowly faded. Her eyes tried to avoid falling, she constantly fought sleep. \"Submit.\" you whisper. \"I submit!\" she replies, her eyes closed. You smile, thanking your lucky stars you were born a woman, so no-one would suspect what you planned next.<br>\r\n<br>\r\nYou say</span></div></div>",
            "created":1377493200,
            "id":1652081,
            "title":"...resisting at first"
        },
        "142221":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Take her to the movies",
                "Take her back to your home"
            ],
            "content":"<div class=\"\"><div> <span>\"I will do as you command!\" she replied, her voice wooden and monotone. You smile to yourself as you consider the many possibilities. \"Come to me!\" you command. She obeys instantly, standing before you in all her beauty. \"When were you born?\" you ask. \"1st November, 1994!\" she answers you, her voice hollow and without emotion. \"What is your sexual orientation?\" you interrogate her. \"Whatever you say it is!\" is the reply you receive.<br>\r\n<br>\r\n\"You will call me, my beloved Mistress!\" you ordered her, your voice at its most imperious. \"Yes, my beloved Mistress!\" Bryanna responds. You ran your fingers across her hair. You notice that her body is reacting, even though she remained still.<br>\r\n<br>\r\nYou decide to:</span></div></div>",
            "created":1377838800,
            "id":1654169,
            "title":"You will do as I command"
        },
        "1422211":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "I want you both to kiss me",
                "I want you both to kiss each other"
            ],
            "content":"<div class=\"\"><div> <span>You drive Bryanna to watch the film Man of Steel. With all the audience focused on the film, no-one would notice them. There is no queue as you approach the ticket booth. Imagine your surprise when you approach the ticket booth. \"Miss Mesmer, what a surprise!\" exclaims Sara. You cannot believe your luck, no wonder Sara didn't stay back, she had to get to her job. You take out $50 and your lucky coin. \"Here you go!\" you declare, shining the coin in her eyes.<br>\r\n<br>\r\nShe smiles as she puts away the money, but her focus is on the coin. She barely is able to get the notes into the register. She tries to get you your change, but you refuse, smiling. \"After all I am spending time with two beautiful, SWEET GIRLS. I SHOULD be the one paying for everything. And I should thank my lucky stars that I chose to SUBMIT TO MY DESIRE to see this film!\" you state. You see her eyes dilute and she nodded. \"Coem to me!\" you ordered her. She leaves her station and stands before you. You take out your watch and move it back and forth. \"Bryanna and Sarah, you belong to me!\" you command.<br>\r\n<br>\r\n\"We belong to you!\" they reply. You grin, wrapping your arms around them. You notice a girl cleaning up. You offer her $40 to cover Sara's shift. She agrees willingly. You briefly debate whether to bring her under as well, but disregard it. After all you have 2 girls. You enter the theatre, taking your seats at the back. There are not as many as you thought and there are plenty of seats for you to take your girls. You take your seats and squeeze their hands. You whisper to the girls: </span></div></div>",
            "created":1378011600,
            "id":1655400,
            "title":"Take her to the movies"
        },
        "14222111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "to reveal their undergarments",
                "to dress in their birthday suits"
            ],
            "content":"<div class=\"\"><div> <span>This is something you have very little experience with as you massage each others tongues. They are both capable kissers, pleasing you with their powerful little tongues. You break the kiss, massaging their thighs. You feel them both moan. \"Sit on my lap!\" you command them. Despite their weight, you feel nothing but joy as you resume your actions. The girls moan happily. Your hands travel upward holding them close to you.<br>\r\n<br>\r\n\"Kiss my neck!\" you command them. Moans escape your throat as they begin to devour the skin of your throat. You feel your body begin to grow wet. Despite your personal enjoyment, you have no desire to humiliate yourself publicly. You command them to stop as you hold them tight. \"Do you love me, my treasures?\" you ask. They both affirm that they do in more assertive terms than you were expecting. Could these feelings be genuine? <br>\r\n<br>\r\nYou dismiss that thought, after all why would such beautiful girls love you? You command them</span></div></div>",
            "created":1378270800,
            "id":1657438,
            "title":"What a Kiss!"
        },
        "142221111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Take them to your house",
                "Take them to another film"
            ],
            "content":"<div class=\"\"><div> <span>Sara begins by slowly pulling down her skirt. Your eyes nearly fall out of their sockets, when you realise that she has no undergarments to reveal. She removes her sandals, slowly, taking time to expose her tiny toes. Bryanna helps her remove her work shirt to reveal a lace device protecting her upper body. You beckoned her to you as she delicately places herself on your body, shimmying herself into place. You feel your body reacted and some part of you wonders if Sara despite being under mind control is trying to seduce you.<br>\r\n<br>\r\nUnwanted romantic thoughts are starting to fill your head. Bryanna begins her display, shimming out of her leather one piece. She is wearing black undergarments, far more revealing than you would expect. Her shoes are patented, designed specifically with her in mind. They appear to be laced inside and she has no socks to wear. She sits on your right, her legs opening to seize your right leg. You wrap your arms around them, their clothes resting on the sea where they had been seating. You begin to massage them, sampling each girls' neck. They ggetnly moaned as you find your self control slipping.<br>\r\n<br>\r\nYou continue to play with them, your feelings are starting to overwhelm you. Notions of waking up with the two of them cradled by your side, looking at you lovingly is starting to make your eyes water. You try to regain control, but two delicious pair of lips are robbing you of your senses. You have to make a decision, the movie is at this point approaching the fight scene between Superman and his enemy Zod. You decide that you should....</span></div></div>",
            "created":1378789200,
            "id":1660878,
            "title":"to reveal their undergarments"
        },
        "1422211111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "To bring them out of the hypnotic state and take your chances",
                "To abandon all hope and take them to the bedroom"
            ],
            "content":"<div class=\"\"><div> <span>You turn to your girls and given them a proclamation. \"You must dress and go home with me!\" Both girls grant their assent, not that they can do otherwise. You watch them dress and realise the hopelessness of your situation. You have broken the one rule a lustful hypnotist should not do. You have fallen for your subjects. Sara is so adorable with her pixie face and sparking eyes. Bryanna is so strong with her determined features and powerful expression. <br>\r\n<br>\r\nYou leave before the movie ends and hand the girl covering Sara's shift another 100 dollars. She winks at the three of you as she returns to work. You watch the two girls sitting in the back seat. They almost appear to be hooking up as if they are going to date each other. More unwanted thoughts of a relationship between the three of you grow. You focus your attention on the road. You sure don't want an accident and hurt these treasures. You realise that you just thought of the two hotties as treasures. How did you fall so quickly for these girls?<br>\r\n<br>\r\nYou drive your girls to your house and order them to lie down. They rest on your couch seductively; Sara is on top of Bryanna. You know you have to make a decision about what you want from these two amazing women. If you sleep with them, you have no hope of forming any monopolygamous relationship with them. You shake your head, amazed you are even considering an exclusive relationship with these two girls. You decide that you have two options. So you choose....<br>\r\n</span></div></div>",
            "created":1379134800,
            "id":1662798,
            "title":"Take them to your house"
        },
        "14222111111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "punish you gently",
                "kiss you tenderly"
            ],
            "content":"<div class=\"\"><div> <span>To bring them out of the hypnotic state and take your chances<br>\r\nYou know what you are facing. Jail time and probably end up the bit** of some Big Bertha. But in the end, you look at these two and realise what you really want. You want a chance to be happy permanently, not just a temporary pleasure. You bite your lip and turn to the girls. \"Listen to me, my treasures!\" you say, your voice breaking a little despite everything. \"We hear you, Mistress Tony!\" they declare. \"You will feel your will returning. You will remember everything that has happened. You will know that....I have fallen for you both!\" you command.<br>\r\n<br>\r\nTheir eyes slid as they slowly regain full consciousness. \"W-what's going on?\" stammered Sara. You heart sinks at this statement. \"It's you! That bitch hypnotist! You used your voodoo on us!\" Bryanna accused you. You bite back your desire to cry. “Y-yes! I used my gi-gifts on you both!” you confess. “Why would you do that?” demanded Sara, her anger surprising you in its ferocity. “B-Because I…I’m a gay loser! Who would want to shack up with some…some two bit entertainer? No-one even wanted to see me after the show!” you reveal, shaking.<br>\r\n<br>\r\nYou try to keep your tears back, but they overwhelm you. “I’m sorry! I’m just lonely and you’re both so gorgeous and out of my league and….Oh God, I’m sorry!” you wail. Neither of them speaks and the urge grows strong. You ran out of your living room, bursting into your bedroom. You find what you are looking for quickly in its box. Your revolver, which you keep to protect yourself. Now it will do the reverse as you hold it to your temple. “NOOO! Don’t!” cried Sara.<br>\r\n<br>\r\n“Why? What point is there in this useless charade? I will die alone anyway. I might as well get it over with!” you declare tearfully, your finger ready to finish your pointless existence. The gun goes off but you’re not dead. Bryanna is holding the gun and it’s pointed at the wall. “You need help! Real help! You’re wrong too. I do think you’re hot! And…I would totally date you if you swear never to hypnotise me again without my permission!” Bryanna exclaimed.<br>\r\n<br>\r\n“Really? You would date me Bryanna?” you ask, your heart rising. “Hey, I like her too! Why should you get her!” retorted Sara, her voice again harsh. “Well, she likes us both! You’re hot! My house sucks! I think she owes us enough to date both of us! You want two girlfriends, ticket babe?” responds Sara. “You betcha, Emo!” You grabbed them both, holding them tight before Bryanna can give a sarcastic reply. They hug you back, that feeling they both like you not wishful thinking on your part.<br>\r\n“I think that we should punish our dear hypnotist!” announced Bryanna. “I’m with you!” agreed Sara. You stared at them. “Wait a minute, you…please don’t!” you squeal. “Promise you won’t hypnotise each of us without our express permission ever again and we won’t!” declared Sara. “Now Tony!” threatened Bryanna. You beam at them both “Never again without your permission!” you state, happier than you have ever been.<br>\r\n<br>\r\nThey both beam at you and…. <br>\r\n</span></div></div>",
            "created":1379134800,
            "id":1662818,
            "title":"To bring them out of the hypnotic state and tak..."
        },
        "142221111111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "navel",
                "feet"
            ],
            "content":"<div class=\"\"><div> <span>Punish you gently<br>\r\n <br>\r\nThey begin to gently undress you. \"Are you ticklish, Tony?\" begins Sara. \"Because if you are, the laughing is going to start.\" continued Bryanna. \"I...I don't know, probably. I...I'm a little scared. I'm not used to being out of control.\" you admit. \"Shhh, babe! You're still in control.\" disagreed Sara. \"We will let you choose where.\" whispered Bryanna.<br>\r\n<br>\r\nThey gently rest your naked body on the bed. You are wetter than you have ever been. You feel your essence flowing from you, and they haven’t even touched you yet. “She is so wet, Bryanna. Just look!” teased Sara, blowing between your legs. You moan joyfully. “Time to choose, ticklish!” exclaimed Bryanna, licking your neck. “I…I’m so close!” you plead. They both lean their faces in, beaming. “Choose!” they exclaim.<br>\r\n<br>\r\n“I don’t know. Underarms, I guess!” you suggest, uncertain. They gently lift your arms. Your feel your n****** stiffen as they lower their fingers. Its’ like slow motion before they gently make contact. You giggle as you tried to bring your arms down. They sit on your arms as they continue wiggling. The pitch of your voice increased as you shake your head. They lift their fingers and watch you. “Ok! Ok! Ok!” you pant, trying to regain your breath.<br>\r\n<br>\r\n“You have a few minutes before you have to pick somewhere else!” offered Sara. “C-can’t this be done?” you stammer, still trying to relax. “If its’ done baby, so are we!” responds Bryanna. Sara nods in agreement. You squeal and offer….   <br>\r\n</span></div></div>",
            "created":1379307600,
            "id":1663955,
            "title":"punish you gently"
        },
        "1422211111111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "1 hour",
                "4 hours"
            ],
            "content":"<div class=\"\"><div> <span>Navel <br>\r\n <br>\r\nThe two beam at you. \"And where do I get to play with you?\" asked Sara. You are to reply before you starting squealing. Bryanna had a wide grin on her face as her tongue got to work. \"Tony, if you want to keep me you get tell me where!\" she threatened you, but with a wide smile. You bang your arms and shake your head; you can't lose Sara, even if they are both messing with you. Bryanna stops with a smile. \"Well, where are we tickling you?\" demands Bryanna.<br>\r\n<br>\r\n\"Please...no more tickling!\" you plead. \"Bye, Tony!\" they both declare, holding hands. \"NOOO! B**!\" you suddenly offer, surprising yourself. They turn back to you and grin. They gently flip you over and Sara whispered. \"So far we are only getting about 30 seconds of tickling in. So we will give you the option of how long you want. The longer you agree to, the quicker we get to the three way. Remember Tony, you are in charge of your own punishment!\" she teased.<br>\r\n<br>\r\n\"You're both lucky that I am in love you with both!\" you retorted as Sara giggles. Bryanna simply shakes her head. \"You said both twice!\" she stated. \"Well, I love you two double then!\" you express, somewhat embarrassed by your foolish use of vocabulary. “If you want to stay in control, then choose quickly!  Sara, do you notice how tasty Tony’s ribs look?” remarked Bryanna. “They do look tasty!” agreed Sara. You squeal, the though of them licking or sucking on your ribs is not appealing. <br>\r\n<br>\r\nYou state….<br>\r\n</span></div></div>",
            "created":1379394000,
            "id":1664792,
            "title":"navel"
        },
        "14222111111112":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "and continue receving their love",
                "6 months later"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll take 4 hours! Then I expect we will get to the three way!\" you offer. Sara and Bryanna burst out laughing. \"There's no way, you could handle 4 hours!\" suggested Sara. “Tony, you would go delirious! We only meant you needed to give us about 10 minutes!” pointed out Bryanna. “Well….I’ll do ten minutes and I will be generous and go more if you two want!” stated Tony.<br>\r\n<br>\r\nBryanna giggled at that. “Let’s lay into our little toughie for ten minutes, see how she handles it!” “Oh, yeah!” added Sara. You quickly dissolve as four sets of clever fingers get stuck into your flesh. “Four hours, eh? My beloved Tony, you can’t even do 4 seconds!” commented Sara. Bryanna nodded in agreement. “Look how she’s shaking? I worry she might pee all over the bed!” noted Bryanna.<br>\r\n<br>\r\nSara pouted as you start to really shake. “I don’t think she can handle it! Bryanna; I think she might have had enough!” she smirked. “So much for our tough little hypnotist!” taunted Bryanna. You feel your eyes leek and pressed your legs together. They both stop and each give you a gentle slap on the b***. “We are yours!” stated Bryanna. “Totally yours!” added Sara. They flip you on your back and kiss your neck.<br>\r\n<br>\r\nYou quickly surrender as they begin to strip, their lips sucking their necks. You soon find the naked girls pressed against you. You wrap your arms around them….<br>\r\n <br>\r\n</span></div></div>",
            "created":1379566800,
            "id":1665582,
            "title":"4 hours"
        },
        "142221111111122":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "hypnotising them both",
                "calling for a female member of the audience"
            ],
            "content":"<div class=\"\"><div> <span>Vegas, the great stage where you will display your skills at their fullest. Bryanna and Sara don't look as confident as you do. Naturally as your panty clad assistants, you have all sort of things planned for them. Bryanna in particular looks nervous. You saunter up to your girls, wearing your business suit, looking superb as usual. \"Bry, darling, relax!\" you reply, gently tickling her belly. She squeals and doubles over. You grin; both of them will laugh tonight. You approach Sara, who raises her hands.<br>\r\n<br>\r\n\"Remember what we agree, darling? If you try and stop me, I get the right to tickle your bare b*** in public!\" you remind her. Sara lowers her hands, fuming. \"Why did I agree to that?\" she moaned. \"Because I said I would go d*** on you twelve times consecutively if you did and you receive that many delights!\" you recall, smirking. Sara frowns. \"Why are Bry and I submissive to you? Oh, that's right, because we love you! But you shouldn't take advantage!\" she whined. <br>\r\n<br>\r\nYou take her in your right arm, pulling her towards you. You kiss her lips, tasting her raspberry lip stick. You separate and call Bryanna to you, who comes willingly. You drag them both into a three way kiss. \"My treasures, I told you this was the price of me paying for your degrees and living with me! After all, you both want your Masters, don't you?\" you enquire. They both nod, cuddling against you. \"Well my beloveds, time to earn it!\" you reply, giving them both rib tickles. They both dissolve as you tickle away their nervousness. \"Make up girls, my soul mates need more make up!\" you yell.<br>\r\n<br>\r\nYou watch as the girls are dolled up again. Bryanna is in a purple bikini, you purposefully choose one too small, so as much of her goodies were on display as possible. Sara was in the red one, again with one too small. Despite the ease of her submission, Sara was very feisty. By contrast, Bryanna was more measured and controlled. Both girls were approaching their 20th birthdays. Sara is studying marketing; while Bryanna is studying psychology. <br>\r\n<br>\r\nIt took quite a lot of hypnotic suggestions to the staff members of the university they attended to ensure that they were able to take exams to make up what they had missed before meeting you. Their results had been quite poor and you decided to use this to make sure the girls acknowledged you as the top dog in your mono-polygamous relationship with them. It wasn’t particularly hard. <br>\r\n<br>\r\nNow you hear the curtain call and you take their hands to begin your act. You will start by<br>\r\n</span></div></div>",
            "created":1379912400,
            "id":1668061,
            "title":"6 months later"
        },
        "1422211111111222":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "I command you to stay still",
                "I want you to pretend you are alone"
            ],
            "content":"<div class=\"\"><div> <span>\"Good evening, ladies and gentlemen! I am the Great Mesmerina! And these are my darlings: Scintillating Sara and Beautiful Bryanna!\" you declare. You hear loud applause as Sara and Bryanna bow. You can see that they are slightly embarrassed. \"I will need a member of the audience to help. Could you join us up here, please Miss?\" you ask a girl in the audience. You can't believe your luck, its Samantha. She is wearing a tiny skirt and she is blushing slightly.<br>\r\n<br>\r\nAs she walks up, you notice she wasn't alone. A young man was cheering her on, a beautiful Latino girl on his lap. \"What is your name, Miss?\" you ask. She blushes again, her green eyes slightly closed. \"M-My name is Samantha Shake. I...I'm in my first year at the California Institute of Technology.\" she stammered. \"Well Samantha Shake of the California Institute of Technology, please look at this coin.\" you comment. You flicker the lucky coin at Samantha who follows it intently.<br>\r\n<br>\r\nYou hear her friend cheer out her name. Samantha's eyes keeping opening and shutting. It's quite obvious she is starting to fade. You hum as you keep flashing the coin back and forth. You reach for your watch in the back pocket for maximum effect. You have trained Bryanna and Sara to stare at it just as intently and you know they are going under as quickly as Samantha as she finally closes her eyes. \"Awaken under my control!\" you snap. The three of them leap up as if electrocuted. \"Samantha, when where you born?\" you request.<br>\r\n<br>\r\n\"12th May 1995!\" she revealed, making her 6 months younger than Bryanna and Sara. You smiled delightedly that she was of age, 6 months earlier. \"Samantha, what are you most afraid of?\" you ask her. Samantha replied in a monotone voice. \"When Master Chris and Mistress Maria command me to get naked in public!\" This provoke a roar of laughter and you notice her friends smirking. You are in little doubt that the boy is Master Chris, but there is something unusual about him. You quickly realise he is a hypnotist himself.<br>\r\n<br>\r\n\"Well ladies, you will now do as I say. Samantha....\" </span></div></div>",
            "created":1381294800,
            "id":1676477,
            "title":"calling for a female member of the audience"
        },
        "14222111111112222":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "take off her clothes, and masturbate to her master and mistress commanding her",
                "practice her blowing skills with a thick sausage she keeps in her panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I want you to pretend you are alone, and do whatever it is you do when alone,\" you commanded.<br>\r\n<br>\r\nWhat does she do when alone?</span></div></span></div>",
            "created":1381294800,
            "id":1676480,
            "title":"I want you to pretend you are alone"
        },
        "142221111111122221":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "A chance to see rare hypnotism",
                "A gig that pays big bucks"
            ],
            "content":"<div class=\"\"><div> <span>12th May 1995!\" she revealed, making her 6 months younger than Bryanna and Sara. You smiled delightedly that she was of age, 6 months earlier. \"Samantha, what are you most afraid of?\" you ask her. Samantha replied in a monotone voice. \"When Master Chris and Mistress Maria command me to get naked in public!\" This provoked a roar of laughter and you notice her friends smirking. You are in little doubt that the boy is Master Chris, but there is something unusual about him. You quickly realise he is a hypnotist himself.<br>\r\n<br>\r\n\"Well ladies, you will now do as I say. Samantha, I want you to pretend you are alone, and do whatever it is you do when alone.\" you command her. Samantha sits down, reaching for an invisible object. She begins to press her thumb up and down. It is clear she is watching television. \"Bryanna, you are now Master Chris and in charge! Sara, you are now Mistress Maria!\" you command them. Bryanna calls out Samantha's name, imperial in her tone.  Samantha leaps to her feet, dropping the invisible object. \"I am at your command, Master Chris!\" <br>\r\n<br>\r\nYou look at Chris who smirks. You whisper in Bryanna's ear. \"I, Master Chris, command you to take off your clothes and please yourself!\" Samantha obeys Bryanna's command and begins pulling of her clothes. When she is in her underwear, you click your fingers. All three stand to attention. The three girls are wearing only a top/bra and panties/bikini bottoms. You smirk as you call out to the crowd. \"Now you will see something! Girls, I command the three of you to engage in a three way tickle fight with each other!\" <br>\r\n<br>\r\nThe battle begins immediately to the delight of the crowd. You watch enthralled as your girls fight Samantha in a battle that leads to laughter. You note the boy Chris smirking. His girlfriend Maria is resting with her head on his shoulder. \"Stop!\" you declared, commandingly. The three girls stop their tickle game. \"Bark for me!\" you command. All three begin their barking. \"Dogs are on all fours, bark and smell each other's b******! You three are now beagles! Begin!\" you order them. The crowd roars as the three girls begin circling each other on their hands and knees, sniffing at each other's panty clad r**** and barking loudly. \"You are itchy!\" you continue.<br>\r\n<br>\r\nThe girls try in vain to lift their legs to scratch, making them roll on the ground. The crowd are beside themselves with mirth as the girls drag their b**** across the floor. You watch the display carefully, keeping your amusement suppressed. As tempting as it would be to make them act more like dogs in heat, the truth is Bryanna and Sara were her soul mates. She had no intention of sharing them with anyone! After that you inform them of the presence of a cat. The three girls set off at great speed on all fours before you halt them. \"You are now free, awaken from your sleep!\" she commanded.<br>\r\n<br>\r\nSamantha squealed when she realised she was in her underwear before this massive audience. \"You will listen to the sound of my voice!\" you declare. Samantha sways, following your watch. You keep up the pressure while Sara and Bryanna watch you. You are attempted to signal them back under control but desist. \"You are a Martial arts expert!\" you declare as she falls asleep. \"You will show this audience the full display of your mastery!\" you exclaim, moving your right hand slightly. Bryanna and Sara hide behind you. Samantha's eyes open and she begins to attack you.<br>\r\n<br>\r\nAs you are an accomplished martial artist in your own right, you dodge her attacks as she spins and kicks at you. You manage to grab her leg and hurl her back. She does a roll, then leaps to her feet backwards. You click your fingers as she falls under. \"You will now put your clothes back on and remember nothing!\" you state. The girl complies and soon you free her from your command. \"Let's hear it for Samantha Shake, everyone!\" you declared.<br>\r\n<br>\r\nThe show ends after you have made various members of the audience do things, like two girls who rolled their eyes at you kiss and grope each other for the pleasure of the crowd. You leave the stage, holding your girls tight to you. \"Do I even want to guess, what you made us do?\" enquired a sighing Bryanna. \"I will tell you later after you have both been t****** n***!\" you tease her. Both girls roll their eyes, though you all know they will do it.<br>\r\n<br>\r\nThere is a knock on your door. You open it to see the boy, Chris and his two girls at his side. \"Ms Mesmer, that was quite impressive. I have an offer for you.\" he offered.  <br>\r\n</span></div></div>",
            "created":1384405200,
            "id":1694089,
            "title":"take off her clothes, and masturbate to her mas..."
        },
        "1422211112":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Wolverine 2 with them",
                "Kiss Ass 2 with them"
            ],
            "content":"<div class=\"\"><div> <span>After pausing to consider your options, you command them to dress. It is not a good idea for the three of you to get caught. You decide to wait until the film ended. They continue to kiss you. You begin to wonder who is truly under whose control. You realise to your horror, you are starting to fall for these two gorgeous girls. You remind yourself that this is a mistake. You look first into Sara's eyes then Bryanna's. They both appear lucid. You pull them both to your body, cling them tight.<br>\r\n<br>\r\n\"I love you both!\" you find yourself whispering. \"We love you too, Mistress Tony.\" they exclaim, a surprising amount of emotion in their voices. You can't help but let your hands wander, bringing moans from your girl. You look up to see the film has ended. You command the girls to rise and you grab them as the lights come on. You may your way out of the theatre and see two lines forming. You decide that you will take your two hotties to another film. You decide to watch<br>\r\n</span></div></div>",
            "created":1378962000,
            "id":1661700,
            "title":"Take them to another film"
        },
        "144":{
            "choices":[
                "The mom and her daughters",
                "The Tweens",
                "The Brunet"
            ],
            "content":"<div class=\"\"><div> <span>You grumble as you exit the building and head for the parking area, you are sure you can catch one of them, but to you dismay the parking lot is empty. You look around and grumble to yourself, it seams you will have to settle for one of the theater workers, the girls who work there are pretty enough but they have gotten very boring. As you turn to head back into the theater you notice the local movie complex appears to be letting out. You stand there for a few minutes watching the crowd until only a few people is left, and you are quite happy with what has remained behind. You have a family of three it appears to be a mom and her two teen daughters, the mother is attempting to start her car with no luck, a pair of tweens who have started down the street, walking home in the dark and lastly but not least a busty brunet woman who shouts at her date for a bit before she slams his car door and a screeches off leaving her in the parking lot.<br>\r\n<br>\r\nBut who to choose.<br>\r\n</span></div></div>",
            "created":1339131600,
            "id":1355555,
            "title":"Fun fun fun"
        },
        "1441":{
            "author_id":"slicktop77",
            "author_name":"slicktop77",
            "choices":[
                "hypnotize them all in the car",
                "take them inside and hypnotize them there",
                "learn more about them inside"
            ],
            "content":"<div class=\"\"><div> <span>As you set your sights on the mother and her daughters, you slowly make your way to her car.  Upon reaching her car, you realize that the mother appears to be in her early thirties, and the girls in the back seat of the car are in their mid to late teens.  \"This could be in interesting adventure\" you tell yourself.  As you lean over, the mother rolls her window down.<br>\r\n<br>\r\n\"Hello there Mr. Mesmer\" she replies sheepishly.<br>\r\n\"Is there something wrong ma'am?\" you reply.<br>\r\n\"My car won't start,\" she says with a frown.<br>\r\n<br>\r\nAs you look at her, you see that she is a beautiful woman.  Guessing, you would say she is probably about 5'5 or so and no more than 110 pounds, with long straight blond hair, and her chest is roughly a large b cup.<br>\r\n<br>\r\n\"I would be happy to assist you and your daughters\" you say as you motion to the girls in the back with a smile.<br>\r\n\"That would be wonderful sir!  Me and my daughter and her friend will be forever in your debt!\" She says with a smile and obvious thanks on her face.<br>\r\n\"Well, why don't I give you a ride somewhere and we can get a tow truck called to come get your vehicle,\" you say with your best trust me smile.<br>\r\n\"That would be great, but we drove 3 hours to get here.  We don't have anywhere to go to call someone,\" she tells you staring into your eyes with disheartened look.<br>\r\n\"I can take you to my house and we can get someone called.  Then we can figure out how to get you home.\"<br>\r\n\"Oh thank you very much!\" she says as her and the girls exit the vehicle.<br>\r\n<br>\r\nYou all get in your car and you begin the drive to your house.  It's a good 30 minute drive and you use this time to learn about the mother and the girls.  The mother's name is Elizabeth and she is 33.  The daughter, Sara, is 15 and has long brunette hair.  She is very petit, at about 4'9 or so and maybe 90 pounds soaking wet.  The friend, Tammy, is 14 and appears to be about the same size and stature as Sara.  Neither girl has much of a chest, but rather stunning all together.<br>\r\n<br>\r\nAfter you arrive at home you:</span></div></div>",
            "created":1344574800,
            "id":1401971,
            "title":"The mom and her daughters"
        },
        "14411":{
            "author_id":"slicktop77",
            "author_name":"slicktop77",
            "choices":[
                "Mess with all of them",
                "Mess with just one of them"
            ],
            "content":"<div class=\"\"><div> <span>As you pull in your garage, you park the car and turn to the mother.  \"How would you ladies like a personal hypnotic session, so you feel like you are on the beach to help you feel better about this whole situation?\" you ask kindly.<br>\r\n<br>\r\n\"Oh that would be so much fun wouldn't it girls?\" the mother responds.  Both girls agree and they all become very attuned to you.<br>\r\n<br>\r\n\"Close your eyes and just relax, listening only to my voice.\"<br>\r\n\"You are standing at the top of a set of stairs, numbered from 10 to 1.  When I tell you, I want you to step down as I count out the steps.  Each step down you will feel yourself go further and further into a wonderful blissful trance.  When you reach step 1, you will in the deepest state of hypnotic trance, and open to my suggestion.  Answer yes if you understand.\"<br>\r\n<br>\r\nThe mother and the girls all answer yes.  You count down from 10 to 1 and after you reach 1, you look at the mother and the girls and realize they are in the deepest state of trance, and you know they are yours.<br>\r\n<br>\r\nFirst you are going to:</span></div></div>",
            "created":1344574800,
            "id":1401973,
            "title":"hypnotize them all in the car"
        },
        "144111":{
            "author_id":"slicktop77",
            "author_name":"slicktop77",
            "choices":[
                "The girls",
                "The mother"
            ],
            "content":"<div class=\"\"><div> <span>You decide to mess with them all.  <br>\r\n<br>\r\n\"When I snap my fingers, you will open your eyes but you will remain in this deep state of trance.\"  You snap your fingers and all of them open their eyes.  You see the classic glazed over look and konw you are still good.<br>\r\n<br>\r\n\"All of you get out of the vehicle and follow me.\"<br>\r\n<br>\r\nThey all get out and follow you into the house.  You take them down to your basement, where you have a varitable dungeon.  Once you are down there, you focus on:</span></div></div>",
            "created":1344574800,
            "id":1401974,
            "title":"Mess with all of them"
        },
        "1441111":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "one at a time",
                "both at once"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>will you focus on one of them or both at the same time?</span></div></span></div>",
            "created":1344574800,
            "id":1401975,
            "title":"The girls"
        },
        "14411111":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Sara",
                "Tammy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one will you focus on?</span></div></span></div>",
            "created":1344574800,
            "id":1401978,
            "title":"one at a time"
        },
        "14412":{
            "choices":[
                "Have Elizabeth teech the two teens to suck cock",
                "Have them remove their panties and pull up their skirts so you can eat them out"
            ],
            "content":"<div class=\"\"><div> <span>You pull up to your house and invite the three ladies in. You follow the three of them into your house watching the two teens admiring the sway of their young asses under their mini skirts. The four of you walk into the house and you guide the women to your living room. You motion towards your couch. \"Elizabeth How would you ladies like a personal hypnotic session, to help you relax and so you can feel better about this whole situation?\" you ask kindly<br>\r\n<br>\r\nAs the three ladies take a seat on the couch, Elizabeth smiles at you. \"Thank you that will be very nice, how would you girls feel about that?\"<br>\r\n<br>\r\nTammy and Sara clapped their hands in excitement and squealed in youthful exuberance. \"Yes, oh that would be so Kewl!\" Tammy replied.<br>\r\n<br>\r\nYou took out your watch from your pocket and started the specially designed spinner on it as you slowly swung the watch back in fourth in front of them. \"Close your eyes and just relax, listening only to my voice.\" You say calmly and quietly. \"You are standing at the top of a set of stairs, numbered from 10 to 1. When I tell you, I want you to step down as I count out the steps. Each step down you will feel yourself go further and further into a wonderful blissful trance. When you reach step 1, you will in the deepest state of hypnotic trance, and open to my suggestion. Answer yes if you understand.\"<br>\r\n<br>\r\nThe mother and the girls all answer yes. You count down from 10 to 1 and after you reach 1, you look at the mother and the girls and realize they are in the deepest state of trance, and you know they are yours. \"Your minds are open, your hearts are open, your thoughts are open, your bodies our open. Nothing is Taboo, nothing is immoral. All that I ask of you from this day forward is fully acceptable to you. Nothing I say or ask of you are anyone else is wrong because I am asking it. You want to please me; you want to make me happy. I have helped you and I am going to continue to help you, want to show me your gratitude for my help with all that you have, including your bodies. Do you understand?\"<br>\r\n<br>\r\n\"Yes, we understand.\" they say together.<br>\r\n<br>\r\n\"Please repeat what you will do?\"<br>\r\n<br>\r\n\"We will open our minds, our hearts, our thoughts and our bodies to you. Nothing you ask of us is wrong or immoral or taboo. Anything you ask we will give, nothing you ask us or others is wrong.\" The three repeated.<br>\r\n<br>\r\nYou smile at the three of them, knowing they are now yours. \"I am going to count to 10 as I go up in number you are now climbing the stairs, when I have finished you will be completely relaxed and will not consciously remember anything I have asked of you but you will still obey. You will only remember a relaxing experience and the pleasure of being hypnotized by me. 1...2...3...4...5...6...7...8...9...10.<br>\r\n<br>\r\nAs you say 10 the three women shake their heads and smile at you. \"Wow, thank you I am so much more relaxed.\" Elizabeth said.<br>\r\n<br>\r\n\"You know it is a little hot in her why don't we take off our shirts.\" You say to test if your suggestions have taken.<br>\r\n<br>\r\nThe three ladies fanned their faces with their hands, \"It is a little hot isn't it Sara replied.\" As the two teens pulled their shirts over their heads revealing their white lacy bras, and Elizabeth unbuttoned her top and pulled it off revealing a red see through bra.<br>\r\n<br>\r\nYou knew they were yours now and as you started taking off your jacket and the top of your show costume you decided that next you were going to:</span></div></div>",
            "created":1344747600,
            "id":1403145,
            "title":"Fun with the family"
        },
        "144121":{
            "author_id":"slicktop77",
            "author_name":"slicktop77",
            "choices":[
                "Make Tammy bring you hard again so you can defile her and Elizabeth",
                "Make Tammy bring you hard again so you can defile her and Sara"
            ],
            "content":"<div class=\"\"><div> <span>As you stand there admiring the beauty that surrounds you, realize that you can truly enjoy these toys for a long time if you so chose.  You decide that first you will have Elizabeth teach these young learners the art of sucking a cock.<br>\r\n<br>\r\n\"Why don't you all get on your knees and come kneel before me?\" You ask.<br>\r\n<br>\r\nThey immediately drop to their knees and kneel directly before you.  As you look down at them, they all look up to you waiting for your instructions.  \"Elizabeth I think that these girls should be taught the correct way to please a man, don't you?\" you ask her.  \"Yes Sir I totally agree with you\" she says genuinely smiling up at you.  You unbutton your pants and let them fall to your ankles as you push your boxer briefs to the floor with them.  Standing there, your semi-erect cock shows signs of being a rather large member.  \"Why don't you prepar my cock for these girls Elizabeth?\" you ask.  She wraps her hand around your cock and begins to slowly and methodically stroke you until you are fully hard.  Your modest 9 inch cock is plenty thick and her fingers barely surround it as she continues to storke it.<br>\r\n<br>\r\n\"You can begin your lessons at any time now Elizabeth\" you instuct.<br>\r\n<br>\r\n\"Girls, you want to make sure that you always take care to please a man, and this is the best way to do it.  Watch as I show you how to suck a man off,\" she says as she leans forward and takes all of your length down her throat.  You revel in her actions as she slowly slides your cock all the way into her throat.  The girls watch in amasement as the woman deep throats your cock.  \"Mommy that is amazing.  When do we get to try?\" Sara asks.  \"No better time than the present dear\" the mother responds.  she steps away from your cock and guids Sara in closer.  Sara leans in and wraps her small hand around your cock.  Your cock suddenly looks enormous in her hand.  Elizabeth slowly pushes Sara's head forward until your cock touches her lips.  She opens her mouth and slowly pushes your cock into it.  More and more she takes until your cock touches the back of her throat and you hear a faint gag.<br>\r\n<br>\r\n\"You have to relax your throat Sara, it will all fit if you relax.\" the mother says.  Sara relaxes her throat and more of it slides into her.  You see the strain on her jaw and lips as your cock presses deeper in her mouth.  All this excitement has you close to blowing your load.  \"I am not going to last much longer Elizabeth, I think you should let her speed it up a bit.\" You say to her.  Elizabeth begins fucking Sara's mouth with your cock.  Faster and faster as Sara tries to maintain her composure.  Suddenly you feel the end is near and grab Saras head and do it yourself.  You begin fucking her throat harder and faster than Sara's mom even thought about doing, causing the young girl to begin to get teary eyed as you pound her throat.  as you begin spewing your cum in her throat, you hold her nose against your abdomen and shot your load directly into her throat.  The little girl paws at your legs as she hokes and gags on your cum.  Elizabeth and Tammy look on in awe as your head is arched back and Sara  tries to get her breath.  You shoot so much cum in her that it begins spilling out the sides of her stretched motuh and a little comes out of her nose as you finish.<br>\r\nPushing Sara away from you, you look down at the orally violated girl and smile, knowing it has just begun.<br>\r\n<br>\r\nNext you decide to...</span></div></div>",
            "created":1344834000,
            "id":1403978,
            "title":"Have Elizabeth teech the two teens to suck cock"
        },
        "1441211":{
            "author_id":"swapbodies",
            "author_name":"Lily",
            "choices":[
                "Take her innocence",
                "Fuck her in the ass"
            ],
            "content":"<div class=\"\"><div> <span>You order Tammy to begin licking and sucking your cock. She does so with youthful acceptance, and you watch as the young girl methodically brings you back to ready. Your cock now fully engorged for you to once again defile a hot female.<br>\r\n<br>\r\n\"Elizabeth, lay down on your back and bring your knees up to your chest\" you order. She complies with no hesitation and you observe her smooth mound.<br>\r\n<br>\r\n\"Tammy, get on your hands and knees and bury your face in Elizabeth's pussy. I want you to lick and suck her pussy and make her cum\" you demand.<br>\r\n<br>\r\nTammy turns to face Elizabeth. She crawls to her and buries her face in her pussy. Licking and sucking on the young woman's pussy, you hear Elizabeth moaning and breathing heavy as her daughter's young friend attacks her pussy with a vengeance.<br>\r\n<br>\r\nYou drop to your knees behind Tammy, observing this tiny ass in front of you. Groping her ass, you feel between Tammy's legs and notice the wetness indicative of excitement. Slowly you slide a finger into her pussy, only far enough to feel her barrier of innocence, and then remove it, dripping with her juice.<br>\r\n<br>\r\nScooting up closer to her, you grab your cock and begin rubbing it up and down on Tammy's pussy lips. Preparing to plunge into her, you decide to fuck her in the...</span></div></div>",
            "created":1348894800,
            "id":1436780,
            "title":"Make Tammy bring you hard again so you can defi..."
        },
        "14412111":{
            "choices":[
                "Continue to fuck these three and leave the little ones alone.",
                "Fuck these three silly and have them bring the younger girls later."
            ],
            "content":"<div class=\"\"><div> <span>You push your rock hard cock into the 14 year old girl’s tight young pussy. It is difficult at first to get your cock inside of her; she is so tight it is almost painful. With each stroke you manage to slide a little more of your cock into her young cunt until you finally manage to bottom out inside her. You look down at the sight of your hard cock buried to the hilt inside of the teen girl and marvel at how erotic it is. You slip your cock almost all the way out and then thrust it back into her tight wet cunt. Tammy lets out small almost inaudible grunts with every thrust, but continues to lick and suck on Elizabeth's pussy. It is not long before the grunts turn to moans as Tammy's discomfort turns into pleasure. You continue to fuck her cunt as you turn to stare at her friend. Sarah is sitting on the chair watching you fuck her friend as Tammy eats out her mom. \"God master that is so hot, are you going to fuck me too?\" She asks.<br>\r\n<br>\r\n\"Of course I am, that's why I made you three into my sex slaves so I could fuck your cunts, mouths and asses whenever I wanted, and if I feel really naughty I might even knock you three up. It's not like you will remember what happened to turn me in after all. Shit I might even have you bring some other friends over for some fun.\" You say as you continue to fuck Tammy.<br>\r\n<br>\r\nSara looks at you as she continues to finger her pussy. \"Yes master, anything you want. Do you want us to bring our younger sisters over for you too master?\"<br>\r\n<br>\r\nYou smile at that question and give it some thought. \"How old are your sisters.\"<br>\r\n<br>\r\n\"Tammy's sister Angel is a year younger than her and my sister Becky is 12.\" Sara Replies.<br>\r\n<br>\r\nYou look over Tammy's back at Elisabeth as she thrashes and moans under Tammy's attack on her pussy. \"How about it Beth should I fuck your younger daughter and her friend Angel? Would you like to watch me deflower them too?\"<br>\r\n<br>\r\nElizabeth moans and plays with her breast as she replies. \"Yes, master, God yes, please let me watch you fuck their young pussies.\"<br>\r\n<br>\r\nYou consider your options as you pull your cock out of Tammy's cunt and motion for Sarah to take her place.</span></div></div>",
            "created":1350104400,
            "id":1446301,
            "title":"Fuck the 14 year old Pussy"
        },
        "1441212":{
            "author_id":"slicktop77",
            "author_name":"slicktop77",
            "choices":[
                "take her innocence from her",
                "Fuck her ass"
            ],
            "content":"<div class=\"\"><div> <span>You order Tammy to begin licking and sucking your cock.  She does so with youthful acceptance, and you watch as the young girl methodically brings you back to ready.  Your cock now fully engorged for you to once again defile a young girl.<br>\r\n<br>\r\n\"Sara, lay down on your back and bring your knees up to your chest\" you order.  She complies with no hesitation and you observe her smooth mound.<br>\r\n<br>\r\n\"Tammy, get on your hands and knees and bury your face in Sara's pussy.  I want you to lick and suck her pussy and make her cum\" you demand.<br>\r\n<br>\r\nTammy turns to face Sara.  She crawls to her and buries her face in Sara's pussy.  Licking and sucking on the girls pussy, you hear Sara moaning and breathing heavy as her young friend attacks her pussy with a vengance.<br>\r\n<br>\r\nYou drop to your knees behind Tammy, observing this tiny ass in front of you.  Groping her ass, you feel between Tammy's legs and notice the wetness indicative of ecitement.  Slowly you slide a finger into her pussy, only far enough to feel her barrier of innocence, and then remove it, dripping with her juice.<br>\r\n<br>\r\nScooting up closer to her, you grab your cock and begin rubbing it up and down on Tammy's pussy lips.  Preparing to plunge into her, you decide to fuck her in the...</span></div></div>",
            "created":1345179600,
            "id":1406514,
            "title":"Make Tammy bring you hard again so you can defi..."
        },
        "14412121":{
            "author_id":"swapbodies",
            "author_name":"Lily",
            "choices":[
                " Continue to fuck these three and leave the little ones alone.",
                "Fuck them and have them bring the little ones later"
            ],
            "content":"<div class=\"\"><div> <span>You push your rock hard cock into the 14 year old girl’s tight young pussy. It is difficult at first to get your cock inside of her; she is so tight it is almost painful. With each stroke you manage to slide a little more of your cock into her young cunt until you finally manage to bottom out inside her. You look down at the sight of your hard cock buried to the hilt inside of the teen girl and marvel at how erotic it is. You slip your cock almost all the way out and then thrust it back into her tight wet cunt. Tammy lets out small almost inaudible grunts with every thrust, but continues to lick and suck on Elizabeth's pussy. It is not long before the grunts turn to moans as Tammy's discomfort turns into pleasure. You continue to fuck her cunt as you turn to stare at her friend. Sarah is sitting on the chair watching you fuck her friend as Tammy eats out her mom. \"God master that is so hot, are you going to fuck me too?\" She asks.<br>\r\n<br>\r\n\"Of course I am, that's why I made you three into my sex slaves so I could fuck your cunts, mouths and asses whenever I wanted, and if I feel really naughty I might even knock you three up. It's not like you will remember what happened to turn me in after all. Shit I might even have you bring some other friends over for some fun.\" You say as you continue to fuck Tammy.<br>\r\n<br>\r\nSara looks at you as she continues to finger her pussy. \"Yes master, anything you want. Do you want us to bring our younger sisters over for you too master?\"<br>\r\n<br>\r\nYou smile at that question and give it some thought. \"How old are your sisters.\"<br>\r\n<br>\r\n\"Tammy's sister Angel is a year younger than her and my sister Becky is 12.\" Sara Replies.<br>\r\n<br>\r\nYou look over Tammy's back at Elisabeth as she thrashes and moans under Tammy's attack on her pussy. \"How about it Beth should I fuck your younger daughter and her friend Angel? Would you like to watch me deflower them too?\"<br>\r\n<br>\r\nElizabeth moans and plays with her breast as she replies. \"Yes, master, God yes, please let me watch you fuck their young pussies.\"<br>\r\n<br>\r\nYou consider your options as you pull your cock out of Tammy's cunt and motion for Sarah to take her place.</span></div></div>",
            "created":1351314000,
            "id":1454511,
            "title":"take her innocence from her"
        },
        "1442":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "They arrive at home - and there is no car in the driveway (parents are out)",
                "They arrive at home, and there is a car in the driveway (at least one parent in)",
                "They don't go home?"
            ],
            "content":"<div class=\"\"><div> <span>You are not one to discriminate against someone due to age, you think to yourself, as you stalk off down the street from shadow to shadow, following the two tweens. They should really know better than to walk the streets this late at night. Didn't their parents ever teach them about these things? Oh well, all the better for you. You round the corner as you continue to follow the girls. </span></div></div>",
            "created":1393563600,
            "id":1752828,
            "title":"The Tweens"
        },
        "14422":{
            "author_id":"kuddles",
            "author_name":"Kuddles",
            "choices":[
                "Force Rachel to punish her daughters Nina and Kristy",
                "Hypnotize the young girls into a deeper trance state."
            ],
            "content":"<div class=\"\"><div> <span>You waylay the girls as they cross a public park, nervously holding hands.  Explaining that they could be in a lot of trouble if they were found out to be outside this late at night, after curfew, you slowly draw their gazes to your eyes, and practice your craft, causing your captive audience to become under your suggestive control, until such time as you choose to free them.  The girls walk home with you, fearful of what you might tell their Mom.  <br>\r\n<br>\r\nYou don’t want them in a full dream-state for the walk back to their house.  You take their cell phones, and check their calls and contacts, then have them cancel plans with everyone for the evening.  Inquiring, you find out that their Mom is the only one home, and that their Dad is out of the country on business.  <br>\r\n<br>\r\nThen, you decide to have the girls lead you to their home, where you’ll have them all to yourself for deeper dreamstates.  Arriving there, you ask to speak to their Mom in private.  Worried, the beautiful late-twenties mother of two tells the girls to go to their rooms, while you discuss whatever trouble they are in with her privately.<br>\r\n<br>\r\nOnce alone with her, you easily place the frantic mom into a hypnotic state.  Taking your  time, you coax her deeper and deeper, until you have her fully under your control.  Then, you explain to her what she is expected to do this evening, to punish her two truant girls.  You will be on hand to monitor their behavior and progress throughout the evening, and make a fair assessment of their genuine respect for authority when all is said and done.  Under your advice her girls will be expected to perform several acts of penance, before being considered genuinely reformed.<br>\r\n<br>\r\nThe girls are adorable pixie-faced cuties with big beautiful eyes and thick, silky hair. Their poised young bodies wiggle and shimmy on flawless young legs.  Their names are Nina and Kristy.  You caught them wearing skimpy outfits, and they are huddled together in their room, afraid of their fate.  Their mom’s name is Rachel, and she is still sexy-as-hell, despite having two kids now entering their young teen years.  Seeing her, you have a fine idea of how fine these two pretty young playslaves are going to eventually be, later on as they grow and mature.   <br>\r\n<br>\r\nFor tonight, you decide to…<br>\r\n</span></div></div>",
            "created":1408251600,
            "id":1843087,
            "title":"Home is where the hurt is"
        },
        "14423":{
            "author_id":"kuddles",
            "author_name":"Kuddles",
            "choices":[
                "Visit a nearby school building closed for the evening",
                "Stay in the dark part of the park"
            ],
            "content":"<div class=\"\"><div> <span>Silently circling around and ahead of your quarry, you skulk in a narrow ivy-thick alcove abutting a fenced park.  Suddenly confronting them, the girls initially squeal in surprise, but you quickly establish control of the situation, explaining that you are a “state truant officer”, and that they should hand over their phones to you while you take down any pertinent data.  “First, what are your names, and what are you two doing out so late on a school night, girls?”<br>\r\n<br>\r\nNervously, the two explain their names are Brianna and Shannon, and that they were just going to see a friend of theirs down the street.  As you continue to grill them, the girls slowly fall under your mesmerizing gaze, becoming entranced and enthralled by your extraordinary understanding of the powers of hypnotism.  You discover by further interrogation that they have actually snuck out for the evening to go to a club that they’re far too young to get in.  Once you have this bit of information, the girls are afraid you’ll prosecute them, or get their parents involved.  <br>\r\n<br>\r\nNow you have them fully under your power.  You’ve brought the two into the shadows and hypnotized them with your commanding gaze, sending them into a deep state of receptiveness as you explain that everything you’re telling them is the absolute truth.  Later, when you repeat the secret word of freeing, which will break the spell, causing them to forget everything that’s happened to them.<br>\r\n<br>\r\n“Brianna and Shannon, let’s walk across the park, shall we?”, you suggest, and the pretty young foxes don’t seem to mind at all as you gently cup their rounded little asses.  You know you can’t have half the fun you’d like to have with these two nimble play-slaves outside like this, and you’re secretly glad that the hypnotism worked as quickly and completely as it did.  No one seemed to bother looking into the girl’s initial cries of surprise, high-pitched as they were, so you reckon it’s simply a matter of finding a place out of the open, where you can really have some fun tonight with these two living dolls.<br>\r\n<br>\r\nAs you consider all the entertainment these two might provide, you scan around the area, seeking somewhere, anywhere that you can test their level of entrancement.<br>\r\n<br>\r\nYou choose to…<br>\r\n</span></div></div>",
            "created":1408251600,
            "id":1843072,
            "title":"Waylaid Waifs"
        },
        "144231":{
            "author_id":"jamesmartin",
            "author_name":"James martin",
            "choices":[
                "Its a teen girl and boy who appear to have the same idea as you",
                "Its another pair of tween girls in school outfits seeking back into the school",
                "Its a nun making her rounds"
            ],
            "content":"<div class=\"\"><div> <span>\tAs you walk with the two young girls you notice a few buildings just off the park. They appear to be uninhabited and so you ask the girls about them. “Oh those, those are the outbuildings for the local girl’s school, St. Agnes’s.” Brianna replies.<br>\r\n<br>\r\n\t“Do you girls go to St. Agnes’s?” you ask as you continue to cup and grope their tight young asses.<br>\r\n<br>\r\n\tShannon presses her ass back slightly against your hand and lets out a slight moan. “No, it’s too expensive.” She says<br>\r\n<br>\r\n\tYou continue to enjoy the feel of the girl’s asses as you turn towards the buildings. “What do you girls know about St. Agnes’s?” You inquire<br>\r\n<br>\r\n\t“She is the patron saint of young girls and virgins.” Stated Brianna with a smile.<br>\r\n<br>\r\n\t“Ah, perfect, devilishly perfect, you’re going to deflower these two young tween girls in a girls school who’s patron saint is the patron of young girls and virgins. Oh it can’t get any better.” <br>\r\n<br>\r\n\tYou lead the two tweens to the fence line and then help them climb over. You quickly follow suit and the three of you head to the closest building. As you approach the building you notice movement out of the corner of your eye. You have the girls duck behind some bushes as you try to determine what it is.<br>\r\n</span></div></div>",
            "created":1415633100,
            "id":1884046,
            "title":"Visit a nearby school building closed for the e..."
        }
    },
    "info":{
        "author_id":"ichimaru12",
        "author_name":"Thatguywhoisme",
        "brief_description":"You are a stage hypnotist. Your goal? Hypnotizing young ladies to do your sexy bidding. ",
        "created":1339166220,
        "description":"<td align=\"left\" class=\"norm\">This is my first story, and it will contain all of my favourite things! In this story, you take on the role of Tony Mesmer, a very successful stage hypnotist. Your show is always entertaining for the audience, but tonight you seek some entertainment of your own...and your hypnotic abilities will get that entertainment for you.<br>\r\n<br>\r\nI highly encourage foot fetish stuff, but I won't force it on you. After all, I want EVERYONE to have fun, not just us foot guys. <br>\r\n<br>\r\nThe only rule is that Tony has to be in control. Other than that, anything goes. Wait, did I say anything? Stay out of the toilet, people. Not my cup of tea.<br>\r\n<br>\r\nWithout further ado, the ladies:<br>\r\n<br>\r\nSara: A petite, slim, big-breasted (for her short stature) asian, who was also very shy. She reminded you of pixie, as she was very short but very, very curvy. No fat at all. She had been sitting alone the entire show, staring intently. You're pretty sure you saw her go under a few times, without you even trying. She could be fun. The suggestible ones always are. <br>\r\n<br>\r\nBryanna: A tall, flatchested goth girl. Though she lacked the curves, her height made her quite attractive, and the gothic look made her very desirable. She did show up with a few friends, but they left quickly and never came back. Given that she probably has the stereotypical attitude, she may even have sneaked in to the show and may not even be 18. Well, if she wants to pretend to be 18, you will treat her as such...especially since she seemed uninterested in the entire show. Revenge would be sweet.<br>\r\n<br>\r\nSamantha: A tall, big-breated blonde woman. Stereotypical supermodel body; long blonde hair, bronzed skin, legs to kill for, not an ounce of fat. Though she came in alone, guys and even a few girls were hitting on her the entire show. Hopefully, you will get the last laugh...<br>\r\n<br>\r\n<br>\r\n<br>\r\nA note on your hypnotic prowess: though very skilled, your abilities are not supernatural. You cannot hypnotize a woman instantly, there needs to be an induction. It can be subtle, without her notice, or not. After hypnotized, she <i>can</i> be brought deep enough to do anything.<br>\r\n</td>",
        "id":1872490,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603578120,
        "modified":1603578120,
        "pretty_title":"The Evil Hypnotist"
    }
}