{
    "chapters":{
        "1":{
            "author_id":"ringer",
            "author_name":"ringer",
            "choices":[
                "Their own powers!",
                "A growth ray!",
                "A potion/formula!",
                "Other",
                "Add another girl! "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jessica and Ms. Vivian have been neighbors for years. <br>\r\nThey're both friendly, outgoing women, with not much in common.<br>\r\nExcept for getting bigger of course. How do they do that you ask? Well...</span></div></span></div>",
            "created":1390192080,
            "id":1730329,
            "title":"Genesis"
        },
        "12":{
            "author_id":"ringer",
            "author_name":"ringer",
            "choices":[
                "Jess tells Vivian of the ray, and she is excited ",
                "Jess tells Vivian of the ray, and she is unwilling",
                "Jess grows Vivian without warning!",
                "Jess has a change of heart and grows herself!",
                "Jess hugs Vivian and fires, growing them both!"
            ],
            "content":"<div class=\"\"><div> <span>Jessica had invited Ms. Vivian over to her pool. <br>\r\nIt was a hot day after all, so she was sure that Ms. V assumed <br>\r\nan innocent swimming invite was all she was getting. But there was more...<br>\r\n<br>\r\n<br>\r\nJess was a science major, a literal genius. She had spent two years building a device, a matter<br>\r\nmanipulator, and she wanted to use it. It increased the mass of whatever it hit. <br>\r\nIt worked on inanimate objects, but what about <br>\r\na person? She had to know. <br>\r\n<br>\r\n<br>\r\nNow Jess herself fancied the idea of growing to impossible heights. But she was rightfully nervous. <br>\r\nMs. Vivian was the perfect subject. She wasn't bright, so she wouldn't realize that Jess was <br>\r\nsimply using her. Jess also remembered how Ms. V had relished being taller <br>\r\nthan years ago. Plus, she was really easy on the eyes...<br>\r\n<br>\r\n<br>\r\nVivian opens the gate to Jess' backyard and walked up to hug her. <br>\r\n\" Hello Jessica! So nice to see you \", Vivian said. While hugging Jess, she couldn't <br>\r\nhelp but notice the enormous breasts touching hers.<br>\r\n<br>\r\n\" Likewise Ms. V! I like that bikini! The green is perfect. \" <br>\r\n<br>\r\nWhat happens next? </span></div></div>",
            "created":1390606200,
            "id":1732558,
            "title":"A growth ray!"
        },
        "121":{
            "author_id":"ringer",
            "author_name":"ringer",
            "choices":[
                "10 feet tall",
                "30 feet tall",
                "Bigger?!?"
            ],
            "content":"<div class=\"\"><div> <span>Jess decided that the best thing to do was tell Vivian about the ray. It wouldn't be good<br>\r\nto have an enormous woman angry at her. <br>\r\n<br>\r\n\" So Ms. V, I've got something I want to show you\"<br>\r\n<br>\r\n\" What is it dear? \"<br>\r\n<br>\r\nJess picked up her off of the chair she'd been laying on. <br>\r\nUnderneath was what looked like a water pistol. It was blue,<br>\r\nwith a green trigger and a smal dial on the side. Jess picked it up<br>\r\n<br>\r\n\" This \"<br>\r\n<br>\r\nVivian giggled. \" It's nice dear. But I've seen water guns before. What's<br>\r\nspecial about this one? \" <br>\r\n<br>\r\nJess took a deep breath. \" it's not a water gun, it's a matter manipulator. <br>\r\nBasically, what ever I aim at, I can increase in size. \"<br>\r\n<br>\r\nJess noticed Vivian perk up at the last part. <br>\r\n<br>\r\n\" That sounds... Awesome Jessica! \" Vivian said smiling<br>\r\nJust the reaction she had wanted. \" But I don't know if I believe you...\"<br>\r\n<br>\r\nJess had expected this. \" well, \" she said, \" how about I give you a demonstration? \"<br>\r\n<br>\r\nVivian thought for a few seconds. \" I guess that'd be okay. \" what are you going to grow? \"<br>\r\n<br>\r\nJess tried her best to act nonchalant. \" How about... You? \"<br>\r\n<br>\r\nVivian looked surprised. \" Me? Well alright! Make me bigger silly! \", she<br>\r\nteased<br>\r\n<br>\r\nJess smirked. \" Oh I will. \"<br>\r\n<br>\r\nJess raised the ray, pointing at the hot Mom before her, and fired. <br>\r\nA burst of green light hit Vivian in the chest. She moaned. <br>\r\nThen it happened. Slowly but surely, she was growing!<br>\r\n<br>\r\n\" Jessica! It really works! \", She said, growing past 7 feet. <br>\r\nJess still held the trigger. Just how big does she make Vivian? </span></div></div>",
            "created":1390673160,
            "id":1732903,
            "title":"Too good to be true? "
        },
        "15":{
            "author_id":"ringer",
            "author_name":"ringer",
            "choices":[
                "Emily!",
                "Ashley!",
                "Anna!",
                "Cassie!",
                "More than one!"
            ],
            "content":"<div class=\"\"><div> <span>Here's a few more...<br>\r\n<br>\r\n<br>\r\nEmily, Jessica's younger sister<br>\r\n18 years old<br>\r\n5'3\"<br>\r\n140<br>\r\nLong strawberry blonde hair<br>\r\nBlue eyes<br>\r\nHourglass body<br>\r\n<br>\r\n36-24-39<br>\r\n<br>\r\nAshley, Vivian's daughter<br>\r\n16 years old <br>\r\n6'1\"<br>\r\n180<br>\r\nShort, dirty blonde hair<br>\r\nBrown eyes<br>\r\nVery athletic build <br>\r\n<br>\r\n36-26-38<br>\r\n<br>\r\n<br>\r\nAnna, a friend of Jessica's<br>\r\n19 years old<br>\r\n5'8\"<br>\r\n180<br>\r\nEbony hair and skin<br>\r\nBrown eyes<br>\r\nBootylicious body<br>\r\n<br>\r\n40-31-44<br>\r\n<br>\r\n<br>\r\nCassie, a friend of Ashley and Emily<br>\r\n6'3\"<br>\r\n190<br>\r\nLong brown hair, blonde highlights<br>\r\nBlue eyes<br>\r\nFit body<br>\r\n<br>\r\n40-26-44<br>\r\n<br>\r\nUse the same options as in the first chapter<br>\r\n</span></div></div>",
            "created":1390192560,
            "id":1730339,
            "title":"Add another girl! "
        },
        "155":{
            "author_id":"dbarricade",
            "author_name":"Detective Barricade",
            "choices":[
                "Cassie and Emily!",
                "Ashley and Anna!",
                "More girls."
            ],
            "content":"<div class=\"\"><div> <span>How about we set them up into two groups of two?<br>\r\n<br>\r\nCassie and Emily - Jessica's younger sister, who she often has...disagreements with often settled in growth battles that they hope won't utterly demolish the Earth, (as that would <i>suck</i>) and her friend who has always wanted to experience growing to awesomely stupidly immense heights...and now gets her chance.<br>\r\n<br>\r\nAnna and Ashley - Jessica's friend, the self-proclaimed hottest ebony teen on the planet and with the booty to make it hard to argue against her claim, and Ms. Vivian's gorgeous daughter. She takes after her mother. Both have had some experience with growth to incredible heights and would love any opportunity possible to add another notch to 'ye olde growth belt'.<br>\r\n<br>\r\nAnd of course, there's a few other girls from Ringer's stories to pick from. Remember, use the options at the start for the means to making these lovely ladies BIG.</span></div></div>",
            "created":1390611480,
            "id":1732591,
            "title":"More than one!"
        },
        "1551":{
            "author_id":"dbarricade",
            "author_name":"Detective Barricade",
            "choices":[
                "The power of growth.",
                "Experimental growth gun.",
                "Growth potion/other."
            ],
            "content":"<div class=\"\"><div> <span>Jessica was setting up her gargantuan swimming pool today, expecting a very special guest over on this blistering scorcher of a day. That guest was, of course, Ms. Vivian. Ms. Vivian was 45 years old, but she didn't look a day older than 25, and had a body that could almost turn straight girls on such as Jessica. They were neighbors, so it wouldn't take that long for her to come over. She was planning on giving a big experience to herself and Vivian under the disguise of a friendly invite to a neighbor's pool. Nothing could spoil the young woman's day!<br>\r\n<br>\r\n...Or so she thought until a familiar car pulled into the driveway. The redhead who stepped out of the driver's side was about the one person in the entire world who could spoil it: Emily. Her younger sister. They've always had a sibling rivalry going on. Jessica was naturally taller, especially in the legs, but it burned her up inside to know that Emily had the better hips and ass despite the size difference. She was older, she should be better in every regard damn it! \"Hiya, sis! What are you setting up the pool for?\" Emily said happily, though whether it was genuine and friendly or an attempt to further grate on her sister's nerves was unknown. For some odd reason, she was clad in her favorite bikini. One of the few things that could grow with her whenever they had their growth battles, which so far hadn't caused any damage.<br>\r\n<br>\r\n\"I'm having a guest over, Emily. Why don't you buzz off before I end up doing something to you I'm going to regret?\" Jessica replied with barely hidden hostility.<br>\r\n<br>\r\n\"What, I can't stop by and say hello to my dear sister? You hurt me, Jess...\" Emily retorted sarcastically.<br>\r\n<br>\r\n\"Good. Now scram.\"<br>\r\n<br>\r\nJessica heard an opening and slamming of a car door. While she couldn't see Emily as her back was turned to her, Jessica could still feel her younger sister's presence annoyingly close by. \"No, Jess. You see, I've met this girl-\" Emily started to say, but Jess cut her off with, \"So you come all this way...to come out of the closet? Thanks for the info. Bye!\"<br>\r\n<br>\r\n\"Do you <i>have</i> to act like a complete jerk towards me? And I'm not a lesbian!\" Emily snapped at her sister. If this kept up, their boobs alone would wind up being as big as the Sun before they both calmed down, never mind the size of the rest of them. That wasn't the impression she wanted to leave on her friend Cassie.<br>\r\n<br>\r\n...Okay, granted, usually the anger would subside about part way through the battle and the rest was just them wanting to keep growing until they tired of it or got hungry. But still!<br>\r\n<br>\r\n\"Um, is she usually like this?\" Cassie asked, also in her bikini. The no less than 6'3\" girl was rather new to the dueling sisters, although she distinctly remembered a story about something like them from somewhere. She loved the idea of growth to stupidly extreme heights. The bigger, the better. And she had informed Emily of this, having no idea that she and her older sister did just such a thing on an almost disturbingly often basis. Of course, when she was told, Emily's first thought was to try and convince the one person she knew who could make such a desire possible: her sister Jessica.<br>\r\n<br>\r\n\"No, she's usually friendly and outgoing. She's just like this because we've never exactly got along for long stretches of time...\" Emily explained. \"It's really too bad that she has to soil such a good reputation in front of someone other than her younger sister's eyes. Such a thing could spread rumors across town.\"<br>\r\n<br>\r\nAt this, Jessica sighed and turned around. She loved Emily. She just preferred to love her from as far away from her as possible, that's all. She studied Cassie up and down, noting her fit physique, her tan skin, how she was at least 4 inches taller than herself, her long brown hair with blonde highlights, her deep blue eyes that she could almost lose herself in, and her generally good proportions...though Jessica believed she had better proportionately speaking. \"So you're a friend of my sister? I'm Jessica. And you are?\" she introduced herself at last.<br>\r\n<br>\r\n\"I'm Cassie! Pleased to meet you!\" Cassie returned the introduction. \"Emily said that you could help me make my...er, desires come true...\" she added, a little embarrassed. What if this was just a joke? What if Jessica didn't want to share?<br>\r\n<br>\r\nJessica smiled and said, \"Let me guess. You want to be able to grow as big as you could ever dream of, and then some. Am I close? Well, as it just so happens, I was planning on sharing the treat again with my neighbor Ms. Vivian. She should be here any minute... Anyway, I can share it with some other girls who would really enjoy it, provided they do not intend to break anything or harm anyone with this. I'd like to keep on living and not wear an ugly orange jumpsuit for the next 25 to life, thank you very much. So, how do wanna grow? Whatever you can think of, I probably have it.\"</span></div></div>",
            "created":1390621860,
            "id":1732658,
            "title":"Cassie and Emily!"
        },
        "15511":{
            "author_id":"dbarricade",
            "author_name":"Detective Barricade",
            "choices":[
                "They're more than willing to keep going.",
                "They want to enjoy this size for a little bit."
            ],
            "content":"<div class=\"\"><div> <span>\"Um... I've always thought about the growing part. I-I don't know how I want to do it...\" Cassie replied with great uncertainty, which miraculously managed to bring both Jessica and her younger sister Emily to be in complete agreement of their annoyance.<br>\r\n<br>\r\nMeanwhile, Sari was enjoying a nice glass of lemonade Ms. Vivian had just made, and for her no less. The chocolate-skinned redhead was amazed both by Ms. V's generosity and her looks. She was convinced that the 45 year old woman had the secret to eternal youth locked up inside her head to look that stunning at that age. It was her first time in this neighborhood, having been invited to come over by Ashley, Ms. V's daughter.<br>\r\n<br>\r\nThe two girls met when Ashley had bumped into Sparkplug. Naturally, she freaked and fled from the smaller blue and white robotic werewolf until she found Sari and tried to warn her about the supposed robot monster. Sari laughed and explained that Sparkplug was her little brother and generally harmless. Questions followed, and Sari revealed her own nature to the slightly taller girl. As well as Sparky's much taller friend Nightscream, who seemed to hit it off with the girl almost instantly. Two friendly, outgoing females will apparently do that.<br>\r\n<br>\r\nToday was just too hot for Sari's normal dress to make sense, so she was in her bikini that revealed a surprisingly good body. Not the greatest by any means, but more than sufficient to turn heads on days like today. Ashley was out running a quick errand for her mother, and Ms. V had left her scheduler open on the table. Sari didn't mean to be nosy, but she couldn't help but notice today marked on the calendar with a note saying to visit the neighbor...uh-oh. \"Uh, Ms. V? You're kind of running late for your visit with your neighbor...\" she informed her host.<br>\r\n<br>\r\n\"Oh! Oh my! I must have forgotten all about that... Thank you, dear! Would you like to come along? It's only just next door, and I'm sure Jessica won't mind someone else joining in on the poolside fun!\" Ms. Vivian replied gratefully, completely convinced that Jessica would be accepting of another person joining them in the pool. She was also completely convinced that that story from Jessica was what she was going over for. Not that she would have minded another chance to experience the fun of growing to tremendous heights.<br>\r\n<br>\r\nSari agreed, and left a note on the door if the sight of Ashley's mom in her tight-fitting green swimsuit over in the neighbors' pool wouldn't be enough indication as to where they had gone off to. It really wasn't a long trek over, and they soon arrived. \"Terribly sorry for being late, Jessica. I had completely forgotten about our arrangement when my daughter had invited her friend over. Oh, how nice of you to have invited your sister over!\" Ms. V announced to the group, elated to see Emily. Emily's face was beaming at how her sister's guest had thought she had invited her over. Jessica painstakingly tried to hide her contempt for the confusion with a welcoming smile and hug.<br>\r\n<br>\r\n\"Hey, Sari! Fancy meeting you here! How's your brother?\" Cassie said, welcoming her friend who had helped her out a little while back.<br>\r\n<br>\r\n\"Sparky's doing just as well as he's ever been. He's off playing with his friend today, so hopefully she'll keep both of them out of trouble.\" Sari answered, and then asked, \"So what's going on here? Seems like a little more than just a pool party...\"<br>\r\n<br>\r\n\"Well, this is an opportunity for all of us to grow to our hearts' desires. Problem is, Cassie here can't decide how she wants to do it.\" Jessica admitted, and Sari saw how Vivian's expression lit up. A pool party was wonderful on a day like this, but a growth party sounded like even more fun. Sari herself had kind of always wondered what it'd be like to grow, figuring she'd probably enjoy it.<br>\r\n<br>\r\n\"I see. Well why not grant us the power to grow at will? That sounds like the easiest and most straightforward way.\" Sari suggested.<br>\r\n<br>\r\n\"<i>We</i>? As in, you want to experience this too?\"<br>\r\n<br>\r\n\"Yeah, why not? It's not like I've got anything better to do, and I'd rather be one of the ones doing the growing than just sitting there watching. What can I say? I'm a hands-on type of girl.\"<br>\r\n<br>\r\n\"No reason why not. The more the merrier!\" Jessica said, but thought, <i>\"Except Emily...\"</i> the only black-haired girl among a brunette, a blonde, and two redheads then went inside and fetched an odd medallion. She closed her eyes and concentrated, and Cassie and Sari both suddenly felt slightly weird for just a fraction of a second. \"And done! I've just granted you girls the power to grow at will. This has been in our family for some time now. Anything you're wearing grows with you, unless you don't want it to, and there's no need to worry about most things while you're growing. Now, would you like a demonstration?\" she asked.<br>\r\n<br>\r\n\"No, I think we got it...\" Sari stated, and then tried to grow. To her surprise, once she thought about growing it was quite easy to do. Cassie didn't need prompting, and started shooting up like a weed on a time-lapse camera, really not hiding how much this was turning her on. 10 feet passed them by quickly, and Sari paused at a noteworthy 18 feet tall. Cassie was closer to 19 feet. Vivian moaned with pleasure as she grew to just over 17 feet tall.<br>\r\n<br>\r\n\"Oh, dears...I've been looking forward to having this experience again for awhile now! Such a shame Ashley isn't here to enjoy it too right now. Jessica? You will let my daughter experience this when she comes back, won't you? She would greatly enjoy it.\" Vivian said.<br>\r\n<br>\r\n\"Of course, Ms. V! ...But surely you aren't done at that paltry size, are you? Jess and I've passed that little stepping stone regularly before breakfast back in the day!\" Emily said while also trying to encourage them to grow more and more.</span></div></div>",
            "created":1391041620,
            "id":1735130,
            "title":"The power of growth."
        },
        "155111":{
            "author_id":"dbarricade",
            "author_name":"Detective Barricade",
            "choices":[
                "Ashley comes home immediately to join in.",
                "Jess joins the others in growth, unable to wait any longer!"
            ],
            "content":"<div class=\"\"><div> <span>Jessica stared at her younger sister Emily in disbelief. Had her enjoyment of growth spread to watching other girls grow in place of her? Well, possibly, but the black haired beauty suspected an ulterior motive to the encouragement. And she wanted to know what. \"What are you doing encouraging them to grow even further? What's your angle here? If you're so desperate for growing action, why don't you just start growing yourself?\" she asked with suspicion and her hands on her hips.<br>\r\n<br>\r\n\"Because, Jess, I believe in being nice and encouraging. I've actually enjoyed our little growing bouts together, prodding you to grow bigger and then you prodding me to grow... They deserve a little nudge to keep going! And as far as myself goes...actually, that's not a bad idea at all.\" Emily replied with a grin and then called to the much bigger girls, \"Hey, you mind if I join you guys in the fun? Apparently, my sister has been kidnapped by imposter aliens, as she seems to be completely against growing!\"<br>\r\n<br>\r\n\"Sure! We're just getting warmed up here.\" Sari answered, finding the whole experience so far to be quite enjoyable. Cassie and Vivian held no objections.<br>\r\n<br>\r\n\"Then here I grow!\" Emily said happily as she grew quickly. Her growth was so quick, her bikini broke off for a moment before restoring itself. She thought to be fair and grew herself to a couple inches shy of 16 feet tall, proportional to her three fellow giantesses from their original sizes. \"Whoops. Heh, nearly forgot my bikini. Not that I'd mind going <i>au naturelle</i>, of course, but for now I'll keep it on.\" she commented, blushing.<br>\r\n<br>\r\nMeanwhile, Jessica was irked by the comment that she was against growing. That was like saying a chocoholic hated chocolate! She loved it more than nearly anything! However, she had been asked to allow Ashley to be granted this power when she returned, and she was going to see to it that that happened. Though admittedly, watching everyone else grow around her was arousing...and her patience for waiting for the 16 year old's return was wearing thin. She opted to wait just a bit longer, and grow if Ashley wasn't back by then.<br>\r\n<br>\r\n\"Well I don't know about you guys, but I think I'm gonna get a little bigger now.\" Cassie mentioned casually with a slight giggle.<br>\r\n<br>\r\n\"Just a little, dear?\" Vivian questioned, already thinking of expanding further.<br>\r\n<br>\r\n\"Yeah right. It's gonna be much more than just a little bigger!\" Sari countered and then started her ascent. Emily then shot up in size, a little more slowly than previously but still quite rapid. She came to 50 feet...and then just sailed right on past it. Soon, Emily had achieved a height of 94 and a half feet. She knew she was going to be the shortest of the group again shortly, but she didn't care. The journey was just too much fun for her to give a warthog's backside about winning or losing.<br>\r\n<br>\r\nThe lovely Ms. Vivian was next, and she delighted at the feeling of becoming bigger and bigger with each passing second. She'd probably grow much, much more often...if she remembered that she had that power for some time now consistently. Then again, she was much too nice to stay big if she thought someone was frightened of her, and was always grateful for not having to worry about harming anyone in her growing fun. She surpassed Emily's stature and the 100 foot mark, leveling off at 103 and a half feet tall.<br>\r\n<br>\r\nCassie and Sari had to admit Ms. V knew how to turn anyone one, even if the five-alarm blaze hot blonde didn't quite realize it herself. But Cassie was just as turned on watching everything get smaller around her as she grew. During her expansion, she noted with mild curiosity how everything mysteriously managed to shift out of her way just in time. \"Cool!\" she remarked happily, even as she continued growing. She reached Emily's height, then Vivian's, and then topped off at an amazing 112 and a half feet tall. She was so glad to have gone with her friend after all, as she wouldn't miss this for the world if she could help it.<br>\r\n<br>\r\n\"Well I guess I ought to pick up the pace, shouldn't I?\" Sari asked rhetorically and kicked her growth up a notch. She wasn't quite being as utterly turned on by this as the other girls, but since it was still so enjoyable she wasn't going to consider herself done yet. Much of her friends have been far bigger than her, being giant alien robots that can turn into cars and trucks, (and a bat. And even a handful of mechanical dinosaurs once she earned their respect. Her brother was one too, turning into a robotic dog, but he was smaller than her normally anyway) so it was nice for her to be the big one for a change. By the time she let herself come to a halt, she was 108 feet tall. She was fine with looking up to meet Cassie's blue gaze by about as much proportionately as she normally did for now.<br>\r\n<br>\r\nHer patience having reached its end, Jess decided to call a friend to potentially help. \"Hey, Nicole. Could you get in touch with Ashley and tell her to get back to her home like now? ...Yes, I'm sure there's dozens of girls named Ashley. Are Greek gods always so technical? Fine, let me be more specific: the one who's mom makes Aphrodite green with envy. Yes, THAT Ashley. Please? Hey, remember you owe me for helping you to catch Hades' Cerberus in order to give it a bath, and it's not like it'd take you that long to...\" Jess said over the phone to Nicole, who in reality was Nike but just used her mortal name to avoid confusion.</span></div></div>",
            "created":1391742360,
            "id":1740606,
            "title":"Growing up a notch!"
        },
        "1553":{
            "author_id":"dbarricade",
            "author_name":"Detective Barricade",
            "choices":[
                "Nicole!",
                "Olivia!",
                "Savannah!"
            ],
            "content":"<div class=\"\"><div> <span>Alright, let's give a couple more girls to get in on the growing action.<br>\r\n<br>\r\nNicole, a friend of Emily and Vivian<br>\r\n18 years old<br>\r\n6'2\"<br>\r\n195 lbs<br>\r\nShoulder length brown hair<br>\r\nGreen eyes<br>\r\nVery athletically fit<br>\r\nTan skin<br>\r\n<br>\r\n38-25-47<br>\r\n<br>\r\nOlivia, a fellow student at Ashley's high school<br>\r\n14 years old<br>\r\n5'2\"<br>\r\n120 lbs<br>\r\nFlowing blonde hair<br>\r\nBlue eyes<br>\r\nGolden skin<br>\r\nStunning body beyond her years<br>\r\n<br>\r\n36-22-36<br>\r\n<br>\r\nSavannah, Vivian's neighbor and friend of Ashley<br>\r\n16 years old<br>\r\n5'6\"<br>\r\n145 lbs<br>\r\nShoulder length light blonde hair<br>\r\nBlue eyes<br>\r\nPale skin<br>\r\nRelatively fit body due to being adventurous, with generous curves<br>\r\n<br>\r\n42-23-41<br>\r\n<br>\r\nAgain, use the means at the start to grow these girls. Or arrange for more than one to join in on the growing action. They won't mind one bit at all.</span></div></div>",
            "created":1390614600,
            "id":1732609,
            "title":"More girls."
        }
    },
    "info":{
        "author_id":"ringer",
        "author_name":"ringer",
        "brief_description":"Vivian and Jess, characters from two stories, meet up \r\nin an old fashioned grow off! ",
        "created":1390191660,
        "description":"<td align=\"left\" class=\"norm\">Welcome everyone, to my newest story! If you've read<br>\r\nmy other work, you already know the title characters<br>\r\nIf not, or if you need a refresher, here there are...<br>\r\n<br>\r\n<br>\r\nVivian<br>\r\n45 years old<br>\r\n5'9\"<br>\r\n160<br>\r\nLong blonde hair<br>\r\nBrown eyes<br>\r\nFit, athletic build<br>\r\nCurves? Plenty<br>\r\n<br>\r\n38-24-36<br>\r\n<br>\r\nJessica<br>\r\n21 years old<br>\r\n5'11\"<br>\r\n160<br>\r\nShoulder length black hair <br>\r\nBrown eyes<br>\r\nFit, but not toned<br>\r\nLoooonnng legs<br>\r\n<br>\r\n41-22-34<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nAnyway, they grow, one or both of them. Your choice!<br>\r\n<br>\r\n<br>\r\nA few rules: no death, no violence, vore etc. <br>\r\nsex is okay, but nothing too explicit please.<br>\r\nNo new characters, other than those in my other stories( read them ) :)<br>\r\nOther than that, have fun!!! And make 'em Big!!!</td>",
        "id":1972804,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1398868020,
        "modified":1398868020,
        "pretty_title":"Vivian and Jess"
    }
}