{
    "chapters":{
        "1":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Qui-Gon dies of exhaustion (Possible alternate canon ending)",
                "The Jedi escape the palace and reunite with the Queen",
                "The Jedi escape the palace and report directly to the Jedi Council",
                "Obi-Wan turns on Qui-Gon",
                "Something else....."
            ],
            "content":"<div class=\"\"><div> <span>The light-wall in front of Obi-Wan Kenobi blazed shut and he skidded to a halt, just managing to stop before being incinerated by the laser barrier. He watched helplessly as his master, Qui-Gon Jinn, dueled the tattooed Sith alone. Qui-Gon was visibly tiring, but staying with the Sith step for step. The Sith brought the hilt of his double-bladed lightsaber up against the Jedi Master's face in an attempt to leave Qui-Gon's midsection defenseless. Just as the Sith thrust his blade in for the kill, Qui-Gon regained his focus and side-stepped, spinning his blade and cutting the Sith down. Frozen for a moment in stunned surprise, the Sith fell backward, into the reactor core shaft, his torso splitting in half as he fell. The laser barrier confining Obi-Wan vanished as Qui-Gon collapsed, thoroughly exhausted.   </span></div></div>",
            "created":1294462800,
            "id":1031318,
            "title":"Maul Defeated"
        },
        "12":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Report to the Jedi Council",
                "Private meeting with Master Yoda (in lieu of a Council meeting)"
            ],
            "content":"<div class=\"\"><div> <span>\"Master. Master!\" Obi-Wan tried to wake Qui-Gon, but to no avail. Obi-Wan picked his master up and threw his arm over his shoulder. Supporting the Jedi Master, Obi-Wan led them back out to the throne room of the palace. <br>\r\n\"Master Jedi, you're just in time,\" a familiar voice said, \"Queen Amidala will be leaving shortly to meet with the Gungans.\"<br>\r\n\"Thank you, Captain Panaka,\" Obi Wan said, \"Am I to understand that the Trade Federation has been defeated, then?\" <br>\r\n\"Yes, with the help of that boy from Tatooine.\"<br>\r\n\"Anakin?!\"<br>\r\n\"Reports say it was his fighter that destroyed the droid control ship.\"<br>\r\n\"I see.\"<br>\r\n\"If that will be all, we should go. The Queen is waiting.\" <br>\r\n<div align=\"center\"></div>***<br>\r\nThe next day, the Queen addressed Viceroy Nute Gunray at the Naboo victory celebration. <br>\r\n\"Now, Viceroy, you will have to return and explain all this to the Senate.\"   <br>\r\n\"I think you can kiss your trade franchise goodbye,\" Panaka sneered. As the leader of the trade federation was led away, the group was approached by Supreme Chancellor Palpatine. <br>\r\n\"We are indebted to you for your bravery, Master Jinn.\" Palpatine looked to Anakin. \"And to you, young Skywalker. We will watch your career with great interest.\" The chancellor took his leave of them and joined the Queen at her place next to Boss Nass. The Jedi joined the crowd of onlookers. As Queen Amidala handed a large energy sphere over to Boss Nass, he held it high and shouted, \"PEACE!\"</span></div></div>",
            "created":1294549200,
            "id":1031884,
            "title":"Peace..... for now....."
        },
        "122":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Continue with Qui-Gon and Anakin's story",
                "Venture into Obi-Wan's story with a new apprentice",
                "Venture into Queen Amidala's story"
            ],
            "content":"<div class=\"\"><div> <span>The Jedi returned to Coruscant and met privately with Master Yoda. <br>\r\n\"Confer upon you the level of Jedi Knight, the Council does,\" the wizened Master said to Obi-Wan, \"But-\" he turned to face Qui-Gon, \"Agree with you taking this boy as your apprentice, I do not. Grave danger I fear in his training.\" Qui-Gon was unfazed.<br>\r\n\"He <b>is</b> the Chosen One. Anakin will become a Jedi. I will train him, without the approval of the Council if I must.\" Yoda sighed. <br>\r\n\"Count Dooku's defiance I sense in you. Need that, you do not... Agree with you, the Council does. Your apprentice, Skywalker will be.\" </span></div></div>",
            "created":1294549200,
            "id":1031891,
            "title":"Obi-Wan Knighted, Anakin Apprenticed"
        },
        "1221":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Blue Crystal (Stay with current story arc)",
                "Green Crystal (Stay with current story arc)",
                "(Meanwhile... (Check in with Obi-Wan or Amidala)"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>A Few Years Later...</i></div><br>\r\n<br>\r\n\"Patience, padawan. Take your time. Building a lightsaber requires absolute concentration.\"<br>\r\n\"Yes, Master.\" Qui-Gon watched as Anakin pieced together the outer casing of what would become his lightsaber hilt. Finally, after much consideration, the last piece was fit into place. Anakin handed the hilt to Qui-Gon for inspection. <br>\r\n\"Very good, Anakin,\" the Master said, turning the wold-be weapon over in his palm, \"Your design seems to favor a Form V combat style. Shien or Djem So?\" Anakin shrugged.<br>\r\n\"A little of both.\" <br>\r\n\"A wise choice. All you need is an Adegan crystal and a power cell.\"<br>\r\n\"Where do I get an Adegan crystal?\"<br>\r\n\"We must retrieve one from the crystal cave on Ilum. Many Jedi have built their lightsabers in that very cavern. Now it is your turn. Pack your things. We leave tomorrow.\" </span></div></div>",
            "created":1294549200,
            "id":1032232,
            "title":"Jinn & Skywalker"
        },
        "12212":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "First Mission outside the Temple",
                "Something Else......"
            ],
            "content":"<div class=\"\"><div> <span>The next day, Anakin and Qui-Gon arrived on Ilum and made their way to the cave. The trip there was uneventful. <br>\r\n\"This is where we must part, padawan.\"<br>\r\n\"You mean... I have to go in... alone?\" Qui-Gon smiled.<br>\r\n\"Yes. But do not be afraid, Anakin. Trust your instincts.\" Nevertheless, the boy hesitated.<br>\r\n\"...Okay.\" Anakin steeled himself, then headed into the cave. <br>\r\n<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\nAs Anakin concentrated on focusing the crystal, visions began to appear to him. Strange visions. Like the Sith from Tatooine. In the vision, the Sith insisted that <i><b>he</b></i> was the master that Anakin truly wanted. Other things appeared too, images designed to break his concentration. One of them almost succeeded. It was Padme, standing next to a man dressed in all black with shoulder-length curly hair and holding a baby in her arms. Anakin almost lost his focus, but managed to push the vision aside and complete the process. He walked back out to where Qui-Gon waited for him. Holding the lightsaber high over his head, Anakin thumbed the power switch and a brilliant green blade shot forth. Qui-Gon smiled at his apprentice and patted him on the shoulder.<br>\r\n\"Well done, Anakin. You've taken a large step in your training today.\" The boy beamed from ear to ear as they made their way back to their ship. </span></div></div>",
            "created":1294549200,
            "id":1032545,
            "title":"Anakin's First Lightsaber"
        },
        "122121":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Later that night....",
                "Tracking Jango Fett...."
            ],
            "content":"<div class=\"\"><div> <span><i><b><div align=\"center\">Several years later....</div></b></i><br>\r\n<br>\r\n\"...No, but I do, Senator,\" Supreme Chancellor Palpatine was saying. Their argument was cut short as members of the Jedi Council entered the office. <br>\r\n\"Senator Amidala, your tragedy on the landing platform, terrible it was. Seeing you alive brings warm feelings to my heart,\" Yoda greeted. Amidala, Palpatine and the Jedi talked for a bit and Palpatine brought up the suggestion of placing Amidala in the Jedi's care for the time being.<br>\r\n\"Perhaps someone you're familiar with. An old friend, like... Master Jinn.\"<br>\r\n\"That's possible,\" Mace Windu replied, \"He's just returned from a border dispute on Ansion.\"<br>\r\n\"Do it for me, m'lady.\"<br>\r\n\"....Fine....\"<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\nTwo Jedi rode on a turbolift, approaching the Supreme Chancellor's office.<br>\r\n\"Calm yourself, Anakin. Don't center on your anxieties-\"<br>\r\n\"'Keep your focus here and now, where it belongs,' I know.\"<br>\r\n\"You're tense. I haven't seen you this unnerved since we fell into that nest of gundarks.\"<br>\r\n\"You fell into that nightmare, Master, and I rescued you, remember?\"<br>\r\n\"Yes,\" Qui-Gon said with a slight chuckle, \"Relax. You're sweating.\"<br>\r\n\"I haven't seen her in ten years, Master.\"<br>\r\n\"Remember the Code, my young padawan.\"<br>\r\n\"Yes, Master.\" The turbolift arrived and they stepped out and were greeted by Jar Jar Binks. The Gungan led them into the Chancellor's office. <br>\r\n\"Lookie lookie, Senator, desa Jedi arriven,\" He announced.<br>\r\n\"Master Jinn, it's good to see you again.\"<br>\r\n\"And you as well, Senator.\" Amidala looked to his side.<br>\r\n\"Ani? My goodness, you've grown.\"<br>\r\n\"So have you,\" the padawan replied, \"Grown more beautiful, I mean. Well, for—for a senator, I mean.\" Amidala smiled.<br>\r\n\"Oh, Ani, you'll always be that little boy I knew on Tatooine.\" At that point, Amidala's chief of security stepped in to introduce himself.<br>\r\n\"I know I'll feel better having you around. The situation is far more dangerous than the Senator will admit.\"</span></div></div>",
            "created":1296018000,
            "id":1042394,
            "title":"Return of the Jedi"
        },
        "1221211":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Into the nightclub... (Qui-Gon attacked)",
                "Into the nightclub... (Anakin attacked)"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i><b>Later that night....</b></i></div><br>\r\n<br>\r\n\"...I sense it too,\" Anakin said. The Jedi burst into the Senator's bedchamber and Qui-Gon, sensing the threat even before his padawan, grabbed the kouhuns with the Force and crushed them. Anakin, hearing a noise, looked to the window. As Padme sat up in bed, clearly shocked, Anakin jumped through the window and grabbed hold of the floating probe droid. The droid flew off, attempting to shake Anakin loose. After a short flight, a sniper rifle blast connected with the droid and Anakin dropped through the Coruscant skylanes like a stone. As he dropped he saw the origin of the shot and made a mental note of the culprit's speeder. Seeing another speeder stop below him, he angled his descent and fell into the passenger seat. <br>\r\n\"Just in time, Master.\"<br>\r\n\"That was foolish, Anakin. I can't rescue you every time you do something like this.\"<br>\r\n\"Yes, Master.... So, we're even for the gundarks, then?\" Qui-Gon flew on in silence, following the speeder that Anakin indicated as the shooter. But their speeder was no match for the bounty hunter's. They soon found themselves stopped, trying to decide what to do next.<br>\r\n\"Let's return and make sure the Senator is all right. I have a--\"<br>\r\n\"If you'll excuse me,\"Anakin said as he jumped over the edge of the speeder.<br>\r\n\"ANAKIN!\" But  it was too late, Anakin was falling through the Coruscant sky. Then, he landed right on top of the bounty hunter's speeder. Qui-Gon sighed and took off, following them at a safe distance. The Jedi struggled against the bounty hunter, but it took a shot at Anakin through the hole he'd created in the speeder's roof. The second bolt knocked his lightsaber from his grasp and sent it flying. Qui-Gon caught it and sat it next to him on the seat. As he watched, Anakin forced the bounty hunter's hand down and it accidentally fired the blaster into the speeder's control pipes. It careened toward the street below and Anakin fell off just before it crashed. The bounty hunter got out of the ruined vessel and ran off. Anakin seeing this, followed after it. He came to a nightclub,but Qui-Gon stopped him before he could enter. <br>\r\n\"She went into the club, Master.\"<br>\r\n\"Use your senses, Anakin, he went in there to hide, not to run,\" he handed Anakin back his lightsaber. \"Don't lose it again. This weapon is your life. Guard it as such.\"<br>\r\n\"Yes, Master. And I think 'he' is a 'she'. And I think 'she' is a changeling.\"<br>\r\n\"In that case, we must be extra cautious.\"     </span></div></div>",
            "created":1296104400,
            "id":1042922,
            "title":"Qui-Gon saves Padme"
        },
        "12212112":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Archives recognize the dart",
                "Archives don't recognize the dart"
            ],
            "content":"<div class=\"\"><div> <span>The Jedi followed the would-be assassin into the nightclub and surveyed the scene. <br>\r\n\"Go to the bar and order something,\" Qui-Gon said after some consideration. <br>\r\n\"Yes, Master.\" Anakin did as he was bade, even if the request confused him a bit. As the bartender sat a glass of Corellian whiskey in front of him, an alien seated beside him offered to sell him some deathsticks. Anakin raised his hand casually.<br>\r\n\"You don't want to sell me deathsticks,\" Anakin stated calmly.<br>\r\n\"I don't wanna sell you deathsticks,\" the alien replied, as if in a trance.<br>\r\n\"You want to go home, and rethink your life.\"<br>\r\n\"I wanna go home and... rethink my life...\" The alien walked away and Anakin sipped his drink. Meanwhile, Qui-Gon waited patiently behind his apprentice, out of direct sight of the bar. Just as he'd predicted, the assassin presumed to sneak up behind Anakin and shoot him from behind. The young Jedi's danger sense flared at the last second and even as he whirled around, his brilliant green lightsaber ignited, his Master cut the bounty hunter's arm off at the elbow, his own green blade flaring to life. They closed down their lightsabers and supported the bounty hunter between them.<br>\r\n\"Jedi business, go back to your drinks,\" Anakin said as they led the would-be assassin out into the street. They set her against the wall of the establishment.<br>\r\n\"Do you know who it was you were trying to kill?\" Qui-Gon asked.<br>\r\n\"It was the Senator from Naboo,\" the changeling said weakly.<br>\r\n\"Who were you working for?\"<br>\r\n\"It was just a job.\"<br>\r\n\"Who hired you? Tell us,\" Anakin said. The bounty hunter remained silent. \"Tell us now!\" Anakin exclaimed, irritated by her uncooperative behavior. Finally, she relented.<br>\r\n\"It was a bounty hunter called --\" She never finished her sentence as the belated sound of a gun firing announced the arrival of the dart in her neck.<br>\r\n\"<i>Weshanit, sleemo</i>,\" she cursed as her body shriveled into its natural Clawdite form. The Jedi looked up from the dead shapeshifter to see a man with a jetpack blast away into the Coruscant sky. Qui-Gon turned back and extracted the dart from the hunter's neck.<br>\r\n\"Toxic dart,\" he said examining it closely, \"Not one I recognize, though.\"<br>\r\n\"To the Archives then?\"<br>\r\n\"Yes, to the archives.\"<br>\r\n</span></div></div>",
            "created":1296190800,
            "id":1043465,
            "title":"The Rocket Man"
        },
        "122121121":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Anakin escorts Amidala home...",
                "Anakin goes with Qui-Gon to Kamino..."
            ],
            "content":"<div class=\"\"><div> <span>The Jedi returned to the Temple and headed straight for the Temple Archives. Qui-Gon put the dart through an analysis station and a result came up almost instantly. <br>\r\n\"A Kamino Saberdart?\" Anakin said, confused, \"I've never heard of Kamino.\"<br>\r\n\"I haven't either.\" Qui-Gon typed in 'Kamino' to search for the planet, but found no trace of it, only a cluster of stars and gravity's shadow where the planet ought to be. Brow furrowed he said, \"But I think I know someone who has. A friend of my old appentice.\"<br>\r\n\"Master Kenobi?\" <br>\r\n\"Yes. Dexter Jettster. He runs Dex's Diner in CoCo District. Let's pay him a visit. The sooner we unravel this mystery the better.\"<br>\r\n\"Shouldn't we report to the Council first?\"<br>\r\n\"Yes,\" Qui-Gon smiled, \"I suppose we should.\"</span></div></div>",
            "created":1305262800,
            "id":1105183,
            "title":"Kamino Saberdart..."
        },
        "1221211212":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "They inspect the units",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>After getting vague directions to the planet from Dexter, Anakin and Qui-Gon headed back to the Jedi Temple.<br>\r\nQui-Gon reported their findingd to the the other Jedi and their intention to go to Kamino. Mace Windu did not think Anakin was ready for a mission like this, but Qui Gon had faith in his apprentice and defended him. Mace Windu stood down, but thought to himself that he would keep a watch on Anakin.<br>\r\n<br>\r\nAfter getting the co-ordinates Qui Gon and Anakin see off for Kamino. They arrived at the cloudy blue planet easily enough. They pushed through the atmosphere and landed in a large watery city. They got out and made their way to the city, pushing through the strong winds and heavy rain.<br>\r\n<br>\r\nThey were greeted by a tall, bluish white woman with a long, ostrich like neck, and long, thing limbs.<br>\r\n\"Welcome to Tipoca City, Master Jedi.\".<br>\r\nAnakin and Qui Gon wiped the rain off themselves.<br>\r\n\"Everything is ready, the Prime minster is watiing for you.\"<br>\r\n\"We're expected?!\" Anakin said warily<br>\r\n\"Of course! He is anxious to see you. After all these years, we were beginning to think you weren't coming. Now please, this way!\"<br>\r\nQui Gon cleanly masks his surpise. Anakin does not<br>\r\n\"Master do you knows these people?\" Anakin whispered to Qui Gon<br>\r\n\"No, but I sense it would be best just to go along with it\" Qui Gon whispered back calmly.<br>\r\nThe door slides open. They enter and cross to where an important looking alien is seated. Herises, smiling, from behind his desk, which, like all the furniture on Kamino, seems made out of pure light.<br>\r\n\"May I present Lama Su\" The lady said \",Prime Minister of Kamino... and this is Master Jedi...\"<br>\r\n\"Qui-Gon Jin\" he said<br>\r\n\"And I'm Anakin Skywalker\"<br>\r\n\"I trust you are going to enjoy your stay. We are most happy you have arrived at the best part of<br>\r\nthe season.\" The Prime minster spoke.<br>\r\n\"You make me feel most welcome\" Qui Gon replied.<br>\r\n\"And now to business. You will be delighted to hear we are on<br>\r\nschedule. Two hundred thousand units are ready, with another<br>\r\nmillion well on the way.\"<br>\r\nQui Gon had no idea what he was on about and Anakin's eyebrow's flashed up. Qui Gon kept a cool demenar<br>\r\n\"That is... good news.\"<br>\r\n\"Please tell your Master Sifo-Dyas that we have every confidence his<br>\r\norder will be met on time and in full. He is well, I hope?<br>\r\n\"I'm sorry Master - ?\"<br>\r\n\"Don't you mean Y-\" Anakin started by Qui Gon gently elbowed him.<br>\r\n\"Jedi Master Sifo-Dyas. He's still a leading member of the Jedi<br>\r\nCouncil, is he not?\"<br>\r\n\"Oh, yes. Sifo-Dyas\" Qui-Gon said, as though it had just come back to him<br>\r\nLama-su stood up.<br>\r\n\"You must be anxious to inspect the units\"<br>\r\n\"Thats why I'm here\"</span></div></div>",
            "created":1305954000,
            "id":1110390,
            "title":"Anakin goes with Qui-Gon to Kamino..."
        },
        "12212112121":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Qui-Gon meets Jango (He sees the 'Rocket Man Armor')",
                "Qui-Gon meets Jango (Boba hides the armor successfully)"
            ],
            "content":"<div class=\"\"><div> <span>The Jedi accompanied the Kaminoan Prime Minister to a balcony overlooking a large central room. Below them, thousands upon thousands of white armored men were one at a time picking up a helmet and joining the ranks of their fellows. <br>\r\nIdentical men.<br>\r\nAnakin was silent, but clearly astonished by the sheer number of beings gethered below. <br>\r\n\"These men were cloned ten years ago from the finest genetic specimen available. Their growth has been accelerated so that they age at twice the normal rate for a human,\" Lama Su explained. Qui-Gon turned to face the Prime Minister, still hiding the fact that Master Sifo-Dyas had been killed almost a decade ago. <br>\r\n\"My Master will be pleased. If I may ask, who were they cloned from?\"<br>\r\n\"A bounty hunter called Jango Fett. A curious man. He refused any payment for his services, save for a place to stay and to have a single clone created without any tampering to make it more docile and no growth acceleration. Pure genetic replication.\"<br>\r\n\"I see. Could I meet with this Jango Fett?\"<br>\r\n\"Why, of course.\" The Kaminoan who first greeted them, Taun We, led them away from the clones.<br>\r\n\"This way, please.\"</span></div></div>",
            "created":1306213200,
            "id":1112165,
            "title":"A Clone Army..."
        },
        "122121121212":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Both Jedi follow Jango",
                "Anakin goes to Naboo"
            ],
            "content":"<div class=\"\"><div> <span>Taun We pressed a button next to a door. Within seconds it slid open to reveal a young man who looked curiously similar to the men they had just examined.<br>\r\n\"Boba, is your father here?\" Boba nodded. \"May we speak with him?\"<br>\r\n\"Sure,\" Boba turned and led them into the room, \"Dad! Taun We's here!\" Boba's father walked into the room.<br>\r\n\"May I present Jedi Master Qui-Gon Jinn and his padawan Anakin Skywalker. They have come to check on our progress\" <br>\r\n\"That right?\" Jango said. <br>\r\n\"Your clones are very impressive. You must be very proud,\" Qui-Gon said.<br>\r\n\"I'm just a simple man, trying to make my way in the universe.\" Jango saw Qui-Gon surreptitiously eyeing the bedroom doorway that had been partially left open. He moved in front of the Jedi Master to block his view.<br>\r\n\"Ever make your way as far into the interior as Coruscant?\" Qui-Gon asked.<br>\r\n\"Once or twice.\"<br>\r\n\"Then you must know Master Sifo-Dyas?\" Jango was getting suspicious. In Huttese, he told Boba to close the ajar door, then turned back to Qui-Gon.<br>\r\n\"Master who?\"<br>\r\n\"Sifo-Dyas. Is he not the Jedi who hired you for this job?\"<br>\r\n\"Never heard of em. I was recruited by a man named Tyranus on one of the moons of Bogden.\"  <br>\r\n\"Curious...\"<br>\r\n\"Do you like your army?\" The bounty hunter asked.<br>\r\n\"I look forward to seeing them in action.\"<br>\r\n\"They'll do their job well. I'll guarantee that,\" Jango said with a grin.<br>\r\n\"Thank you for your time, Jango.\"<br>\r\n\"Always a pleasure to meet a Jedi.\" Anakin, Qui-Gon and Taun We left the room. Jango turned to face his son, lost in thought.<br>\r\n\"What is it, Dad?\"<br>\r\n\"Pack your things. We're leaving.\"<br>\r\n</span></div></div>",
            "created":1315026000,
            "id":1180184,
            "title":"Jango Fett"
        },
        "1221211212122":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Follow Anakin",
                "Follow Qui-Gon"
            ],
            "content":"<div class=\"\"><div> <span>The Jedi made their way to their starfighters on the landing pad. Qui-Gon initiated a coded transmission to the Jedi Temple on Coruscant.<br>\r\n\"We have successfully made contact with the Prime Minister of Kamino. They are using a bounty hunter named Jango Fett to create a clone army. I have a strong feeling that this bounty hunter is the assassin we're looking for. The Kaminoans say a Master Sifo-Dyas placed the order for a clone army at the request of the Senate almost ten years ago. I was under the impression he was killed before that. Did the Council ever authorize the creation of a clone army?\" <br>\r\n\"No. Whoever placed that order did not have the authorization of the Jedi Council,\" Mace Windu replied firmly.<br>\r\n\"Into custody, take this Jango Fett. Bring him here. Question him, we will,\" Yoda added.<br>\r\n\"As for young Skywalker,\" Mace said, \"Senator Amidala is returning home to Naboo. You will accompany her there and keep her safe.\"<br>\r\n\"Yes, Master.\"<br>\r\n\"I will report back when I have captured Fett,\" Qui-Gon replied. Both Jedi bowed and Qui-Gon ended the transmission. He looked to his apprentice. <br>\r\n\"May the Force be with you, Anakin. This is an important mission the Council has tasked you with. Be mindful of the will of the Force, and of your feelings, my young padawan.\"<br>\r\n\"Yes, Master. May the Force be with you as well,\" Anakin said with a bow. They got into their fighters and parted ways.</span></div></div>",
            "created":1315198800,
            "id":1181474,
            "title":"Splitting Up"
        },
        "12212112121221":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Check in with Qui-Gon",
                "Continue to Tatooine"
            ],
            "content":"<div class=\"\"><div> <span>After a brief meeting with the Queen and her advisors, followed by a visit with Padme's family, Anakin and the Senator made their way up the stairs to the lake retreat. Padme walked over to the balustrade surrounding the terrace overlooking a large and well-kept garden. Anakin joined her.<br>\r\n\"When I was in Level Three, we used to come here for school retreat. See that island? We used to swim there every day.\"<br>\r\n\"It's beautiful,\" Anakin replied, \"Just like everything here.\" Padme realized that Anakin was gazing at her.<br>\r\n\"...We used to lie on the sand and let the sun dry us... and try to guess the names of the birds singing.\"<br>\r\n\"I don't like sand. It's coarse and rough and irritating, and it gets everywhere. Not like here. Here everything's soft... and smooth...\" They locked eyes for a moment. Then Anakin kissed Padme. He was lost in the lip-lock when she suddenly broke it off. <br>\r\n\"No, I shouldn't have done that.\"<br>\r\n<br>\r\n***<br>\r\n<br>\r\nAnakin and Padme spent the day in the hilly meadows near the lake house. <br>\r\n\"I don't know...\" Padme was saying.<br>\r\n\"Sure you do... you just don't want to tell me,\" Anakin said.<br>\r\n\"Are you going to use one of your Jedi mind tricks on me?\"<br>\r\n\"They only work on the weak-minded.\"<br>\r\n\"All right... I was twelve. His name was Palo. We were both in the Legislative Youth Program. He was a few years older then I... very cute... dark curly hair... dreamy eyes.\"<br>\r\n\"All right, I get the picture... whatever happened to him?\"<br>\r\n\"I went into public service. He went on to become an artist.\"<br>\r\n\"Maybe he was the smart one.\"<br>\r\n\"You really don't like politicians, do you?\"<br>\r\n\"I like two or three, but I'm not really sure about one of them.\" Anakin smiled. \"I don't think the system works.\"<br>\r\n\"How would you have it work?\"<br>\r\n\"We need a system where the politicians sit down and discuss the problem, agree what's in the best interests of all the people, and then do it.\"<br>\r\n\"That is exactly what we do. The trouble is that people don't always agree. In fact, they hardly ever do.\"<br>\r\n\"Then they should be made to.\"<br>\r\n\"By whom? Who's going to make them?\"<br>\r\n\"I don't know. Someone.\"<br>\r\n\"You?\"<br>\r\n\"Of course not me.\"<br>\r\n\"But someone.\"<br>\r\n\"Someone wise.\"<br>\r\n\"That sounds an awful lot like a dictatorship to me.\" A mischievous grin crept across Anakin's face.<br>\r\n\"Well, if it works...\" Anakin tried and failed to hide a smirk.<br>\r\n\"You're making fun of me!\"<br>\r\n\"Oh no, I'd be much too frightened to tease a Senator.\"<br>\r\n\"You're so bad!\"<br>\r\n<br>\r\n***<br>\r\n<br>\r\nAnakin, riding shaak, passed in front of Padme. Slowly he started to stand on the animals back. But he lost his balance and fell. He tried to rise but slumped back to the ground instead.<br>\r\n\"Ani, Ani! Are you all right?\" Padme rushed to Anakin's side and rolled him over. At which point he cracked up laughing. He caught her mock swing and they rolled over in the grass, embracing, and looking into each other's eyes.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nThat night, they sat inside the lake house in front of the fireplace.<br>\r\n<br>\r\n\"Padme, I love you. I've dreamt about you for the last ten years. Just being around you again is killing me. I can't hide this anymore.\" Anakin looked from the fireplace straight into Padme's eyes, almost as if he were looking into her very soul. \"If you are suffering as much as I am, tell me.\"<br>\r\n\"Anakin, If you follow your thoughts through to conclusion, they will take us to a place we cannot go... regardless of the way we feel about each other.\"<br>\r\n\"Then you do feel something!\"<br>\r\n\"You'll be expelled from the Order, Anakin. I can't ask you to give up your future for me.\" Anakin was silent for a time, staring into the fire.<br>\r\n\"It wouldn't have to be that way... we could keep it a secret.\"<br>\r\n<br>\r\n***<br>\r\n<br>\r\nThe next morning, Padme found Anakin out on the balcony overlook meditating. She started to walk away.<br>\r\n\"Don't go.\"<br>\r\n\"I don't want to disturb you.\"<br>\r\n\"Your presence is soothing.\"<br>\r\nPadme paused, weighing her words.<br>\r\n\"You had a nightmare last night.\"<br>\r\n\"Jedi don't have nightmares.\"<br>\r\n\"I heard you. It was your mother, wasn't it?\" Anakin opened his eyes and turned to look at her.<br>\r\n\"I saw my mother. As clearly as I see you now. She's in pain, Padme, they're killing her. I know I'm disobeying my mandate to protect you, but I have to go.\"<br>\r\n\"I'll go with you. That way you can continue to protect me, and you won't be disobeying your mandate.\"<br>\r\nAnakin smiled broadly. <br>\r\n <br>\r\n</span></div></div>",
            "created":1315198800,
            "id":1181501,
            "title":"Forbidden Feelings"
        },
        "122121121212211":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "They Lose Him",
                "They Lose Him...?"
            ],
            "content":"<div class=\"\"><div> <span>In a slow orbit around Kamino's far side, Qui-Gon waited patiently for the tracking beacon he'd placed on the bounty hunter's ship to appear on his radar. He slipped into a meditative trance to pass the time. Sure enough, Jango Fett's ship soon blasted off from the Planet of Storms. Qui-Gon followed the ship into hyperspace.<br>\r\n<br>\r\n***  <br>\r\n<br>\r\nAs they dropped back into real space, Boba Fett pointed to <i>Slave I</i>'s navigational screen in surprise.<br>\r\n\"The Jedi followed us!\" Jango looked at the screen, unconcerned. <br>\r\n\"He must have put a tracer on our hull. No matter, we'll lose him.\" </span></div></div>",
            "created":1325653200,
            "id":1252205,
            "title":"Plans Go Awry..."
        },
        "1221211212122112":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Anakin's Rescue",
                "Qui-Gon's Capture"
            ],
            "content":"<div class=\"\"><div> <span>***<br>\r\n\"Doesn't take a hint, this guy,\" Jango mused. A well-timed laser blast from <i>Slave I</i> scored a small hit on Qui-Gon's starfighter. <br>\r\n\"Yeah! Get 'im, Dad!\" Boba crowed.<br>\r\n\"We'll just have to finish him off.\" The crafty bounty hunter launched concussion missiles after the bothersome Jedi. Qui-Gon was hard-pressed to avoid the explosives. He managed to outmaneuver all but one of them. As the only remaining missile closed on his ship an idea struck him, though through the will of the Force, or of his own volition, he couldn't be sure. A split second from death, he jettisoned the spare parts canisters used for ship maintenance. The projectile exploded on the debris and Qui-Gon hid his fighter on the far side of a larger asteroid. Quickly, he shut the fighter down so as to complete the illusion of annihilation. <br>\r\n\"Well, we won't be seeing him again,\" Jango said. <i>Slave I</i> continued down to the planet. Little did they know, they were still being followed...  </span></div></div>",
            "created":1326949200,
            "id":1261607,
            "title":"We Won't Be Seeing Him Again..."
        },
        "12212112121221121":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Anakin\\'s Rescue II",
                "Qui-Gon\\'s Capture"
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile, on Tatooine, the Senator's ship landed just at the outskirts of a small homestead. After receiving vague directions from Anakin's former slave master, he and Padme had guided the ship to this location. Upon entering the borders of the homestead, they were greeted by a gray-plated protocol droid.<br>\r\n\"Oh! Hello! How might I serve you, I am See--\"<br>\r\n\"Threepio?\" Anakin said. He hadn't seen the droid in over a decade and at first the droid didn't recognize him. Then the realization hit him. <br>\r\n\"Oh my! The Maker! Master Anakin it is so wonderful to see you again. And you as well, Mistress Padme.\"<br>\r\n\"Hello, Threepio,\" she said. <br>\r\n\"I'm looking for my mother,\" Anakin pressed.<br>\r\n\"Oh dear. I think we'd better go inside.\"  <br>\r\n<br>\r\n***<br>\r\n<br>\r\nThe discussion was grim. Anakin's mother had been kidnapped by Tusken Raiders nearly a month ago. Outside the small home, Anakin prepared to track down and rescue her. Riding his step brother's swoop bike, he set off across the sands. </span></div></div>",
            "created":1330318800,
            "id":1285156,
            "title":"Return of the Skywalker"
        },
        "122121121212211211":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "A Family Reunited",
                "A Jedi Betrayed"
            ],
            "content":"<div class=\"\"><div> <span>The ride took all day to complete. Some helpful advice from a Jawa tribe pointed Anakin to a Tusken Raider oasis. Under the cover of night, the young Jedi-in-training crept into the camp and up behind the prisoner's teepee. Quietly, he cut a hole in the tent and stepped through. There, lashed to the wall, was his mother, Shmi Skywalker. She was bruised and beaten. Blood was caked in her hair and all over her hands and face. Carefully, Anakin retrieved her from the barbaric torture rack and laid her on the tent floor. <br>\r\n\"Mom? Mom?\" Shmi's eyes slowly fluttered open.<br>\r\n\"Ani? Is that you?\" <br>\r\n\"I'm here, Mom. I've come to rescue you.\"<br>\r\n\"Ani. Oh, my grown up son. You're so handsome.\" Shmi's eyes closed and her head lolled. <br>\r\n\"Stay with me, Mom.\" Her eyes opened again.<br>\r\n\"Ani, I love... I love... you.\" Her eyes closed again. Anakin felt her pulse. It was weak and getting weaker. Taking great care, he made his way back to the swoop and took off with his passenger. </span></div></div>",
            "created":1367211600,
            "id":1580960,
            "title":"Skywalker Reunion"
        },
        "1221211212122112112":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Anakin's Vengeance",
                "Anakin's Mercy"
            ],
            "content":"<div class=\"\"><div> <span>\"Anakin's tracking signal places him on Tatooine... He must have gone after his mother.\" Qui-Gon prepared to record his message.<br>\r\n\"Anakin, my long range transmitter has been knocked out. Re-transmit this message to Coruscant: I have tracked Jango Fett to Geonosis. I fear there is more going on here than is being revealed. I will report back again when-- wait a minute...\" Qui-Gon was interrupted by the imminent threat of droidekas surrounding him. R4 cut the transmission off as the Jedi was forced to surrender. <br>\r\n<br>\r\n***  <br>\r\n<br>\r\nSuspended in animation, Qui-Gon raised his head as a familiar figure entered the room. <br>\r\n\"Count Dooku.\"<br>\r\n\"Qui-Gon! How wonderful to see you again, my old padawan. What brings you to Geonosis?\"<br>\r\n\"A bounty hunter called Jango Fett. Do you know him?\"<br>\r\n\"Well there are no bounty hunters here, the Geonosians don't trust them.\"<br>\r\n\"I assure you, he is here. And what is your part in this, Count?\"<br>\r\n\"I? I am merely attempting to negotiate with the Geonosians to see reason. You see, they believe that by joining forces with the Dark Lord of the Sith, they can overthrow both the Republic and the Separatist forces. I simply cannot allow that. The Confederacy of Independent Systems must survive to take the reigns from the decaying Republic.\"<br>\r\n\"That's impossible. The Dark Lord of the Sith was killed almost ten years ago.\" Dooku was silent a moment as he contemplated his next lie. He looked back up at Qui-Gon, feigning a sincere look.<br>\r\n\"Suppose I told you that the Republic, and hundreds of its Senators were now under the influence of a Sith named Darth Sidious.\" <br>\r\n\"It cannot be. The Senate may be corrupt but the chancellor has control over the bureaucrats.\"<br>\r\n\"I'm afraid that is no longer so, my friend. This Sith Lord controls the Senate now, allowing the Republic and it's policies to fall into disrepair. There is nothing Chancellor Palpatine can do to counter the threat.\" A thoughtful look came to Dooku's eyes. \"If you were to join me, however, we may be able to combat the menace and restore order...\"<br>\r\nQui-Gon studied his former Master's face.<br>\r\n\"I do not believe you. The Jedi would be aware of this 'Sith Lord' if it were true.\" Dooku sighed.<br>\r\n\"You disappoint me, Qui-Gon.\" He turned to leave. \"It may be difficult to secure your release...\" And without another word, Dooku swept from the room.   </span></div></div>",
            "created":1367298000,
            "id":1581655,
            "title":"A Jedi Betrayed"
        },
        "12212112121221121122":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Anakin To the Rescue!",
                "Anakin to the... Rescue?"
            ],
            "content":"<div class=\"\"><div> <span>\"Get her inside, she needs medical attention immediately,\" Anakin said as he pulled the swoop bike onto the premises of the Lars Homestead. <br>\r\n\"Wait,\" Padme said, \"Where are you going?\"<br>\r\n\"I'm going back. Those Raiders need to be taught a lesson.\"<br>\r\n\"Anakin, don't! Remember your training. What would Qui-Gon say?\" The hard look slowly eased from Anakin's face. <br>\r\n\"You're right. My mother is no longer in danger, that's all that matters.\" Anakin accompanied Padme inside the compound. He approached his mother and laid a hand over her closed eyes. Her pulse was still faint, but it was no longer weakening. Slowly, she opened her eyes and glanced around. She smiled at the sight of her family. <br>\r\n\"Anakin. You saved me, my son.\"<br>\r\n\"You're safe now, Mom.\" <br>\r\n\"I can never thank you enough, son,\" Cliegg Lars said. \"How can I repay you?\"<br>\r\n\"Let me take care of my mother, at least until she is well again.\" Cliegg was about to respond when a familiar tweedling sound came from outside. \"I'll be right back,\" Anakin said. He trotted outside, C-3PO on his heels.<br>\r\n\"Artoo? What's wrong?\"<br>\r\n\"R2-D2 beeped a short message. Anakin looked to the protocol droid.<br>\r\n\"He says he has an urgent message from Qui-Gon Jinn at the ship. Does that name mean anything to you, Master Anakin?\"<br>\r\n\"<i>My</i> Master.\" Anakin hurried back inside. \"Padme, there's an urgent message from Qui-Gon, we have to go.\" He returned to his mother's side. \"I'll come back, Mom, I promise.\" <br>\r\nAnakin and Padme boarded the ship with Artoo and Threepio in tow. The astromech queued up the message.<br>\r\n<br>\r\n\"Anakin, my long range transmitter has been knocked out. Re-transmit this message to Coruscant.\" Padme pressed the necessary button to re-transmit, \"I have tracked Jango Fett to Geonosis. I fear there is more going on here than is being revealed. I will report back again when-- wait a minute...\" The transmission abruptly ended with Qui-Gon attempting to fight off way too many destroyer droids at one time. On the other end of the transmission, Jedi Master Mace Windu addressed them.<br>\r\n\"Anakin, we will handle this. The most important thing is for you to stay there and protect the Senator.\"<br>\r\n\"Yes, Master.\" With a click, the transmission ended. Anakin slumped into the co-pilot's chair. <br>\r\n\"We have to help Qui-Gon,\" Padme said.<br>\r\n\"What can we do, I'm not supposed to leave here.\"<br>\r\n\"We can't just abandon him, Anakin! He's your mentor, your friend!\"<br>\r\n\"You heard Master Windu, I'm supposed to protect you.\" A determined look settled over Padme's features.<br>\r\n\"Well, I'm going to help Qui-Gon. If you plan to protect me, you'll just have to come along.\" A broad grin cracked Anakin's sullen mood. <br>\r\n</span></div></div>",
            "created":1367298000,
            "id":1581664,
            "title":"A Family Restored"
        },
        "122121121212211211222":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Mace Windu",
                "Yoda"
            ],
            "content":"<div class=\"\"><div> <span>As it turned out, the idea to rescue Qui-Gon ended up being an unmitigated disaster. For C-3PO's part, his head was spot welded onto a battle droid's body, and vice versa. In an attempt to save Padme from the horrors of the droid factory, Anakin's lightsaber was halved by a large bladed piece of machinery. Padme was eventually saved by R2-D2, only to be captured by hostile Geonosians. Anakin, helpless, was taken hostage by the bounty hunter from Kamino. Jango Fett, he recalled. The two would-be rescuers were loaded into a chariot, sentenced to be executed in the arena.<br>\r\n\"Anakin... There's something I need to tell you.\" He looked at her, confused. \"I love you.\"<br>\r\n\"You love me? I thought we decided not to fall in love because it would destroy our lives?\"<br>\r\n\"I think our lives are about to be destroyed anyway. Before we die, I need you to know that I truly... deeply... love you.\" Anakin leaned in and, as the cart began to move into the sunlit arena, he and Padme shared a kiss. This time Padme didn't pull back. The chariot rolled onto the killing floor and the prisoners were unloaded to be chained to pillars. Anakin was chained next to Qui-Gon.<br>\r\n\"I was beginning to wonder if you'd gotten my message.\"<br>\r\n\"I re-transmitted it just as you asked, Master. Then we decided to come and rescue you.\"<br>\r\n\"Against Master Windu's orders, I imagine.\"<br>\r\n\"It was Padme's idea...\" The Senator was chained on Anakin's other side. Then the doors on the other side of the arena were released and three vicious beasts stormed out: a reek, a nexu and an acklay. Anakin and Qui-Gon outmaneuvered their respective attackers. Padme outsmarted hers, climbing to the top of her pillar. Anakin used his chains to rein in the reek and wrangled it to his will. He directed it toward Padme and it gored the nexu, killing it.<br>\r\n\"Jump!\" Anakin called. Padme dropped onto the reek behind her lover. They shared a brief kiss as the reek took off again. Qui-Gon used the beast handler's electrostaff to spear the acklay. The weapon protruded from the top of the beast's skull, indicating a clean kill. <br>\r\nAnd quietly, sneaking up behind the onlooking group of Dooku, Fett and the Geonosian Archduke Poggle the Lesser...</span></div></div>",
            "created":1367384400,
            "id":1582127,
            "title":"To Rescue or Not To Rescue..."
        },
        "1221211212122112112221":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Chasing Dooku",
                "Something Else?"
            ],
            "content":"<div class=\"\"><div> <span>As the arena gates opened to release a seemingly endless horde of battle droids, a purple blade flashed to life just under Jango Fett's chin. <br>\r\n\"Ah, Master Windu. How nice of you to join us. You're just in time to witness the executions,\" Dooku said, calmly turning to face the Jedi. <br>\r\n\"I don't think so, Dooku. This party's over.\" At a signal, a hundred lightsabers suddenly ignited around the arena.<br>\r\n\"This party is just getting started, my old friend.\" Dooku looked past Windu as a Super Battle Droid came stalking up the hallway. It fired on the Jedi and he leapt over the balcony to avoid the blasts. Fett loosed a jet of flame after him, catching his cloak on fire. Windu landed in the arena, shrugging off his burning mantle. As Jango followed the venerated Master and droids began being cut down, two Jedi tossed lightsabers to Qui-Gon and Anakin. Anakin cut the manacles still shackling Qui-Gon and they joined the fray. The reek barreled on, chasing Windu. Mace ran from it, then pivoted and sliced a tusk from its face. It kept charging past him, running Fett down. It trampled him, and as it turned take another pass, Jango squared up and fired three bolts from his WESTAR-34 blaster pistol, dropping the beast. Threat eliminated, he turned to face Windu. He fired three more bolts at the Jedi but they were easily deflected. As Mace charged into close quarters, Jango ignited his jetpack, flying over his head. As the bounty hunter landed, it began to spark, so he shrugged it off and tossed it aside. Windu turned and re-engaged in the melee. He swung his saber and it looked like it would be the end of Jango Fett. But Fett brought his left arm up into the blade's path. Much to the Jedi's surprise, it glanced off, affirming Fett's suspicion that investing in cortosis forearm plates was a good idea. The moment of shock gave Fett the opening he needed and he fired a bolt into Windu's chest. The Jedi staggered back and Jango charged in, intent on finishing the Master off. But, at the last instant, Windu brought his lightsaber around in a sweeping arc and beheaded the assailant. As Fett's lifeless body crumpled to the arena floor, Windu stumbled away to seek medical treatment. <br>\r\nMeanwhile, the battle droids were getting hammered. Dooku signaled and the arena gates opened once more to admit a whole new horde of Super Battle Droids. Quickly, the Jedi were forced into a compromised position. The remaining warriors were encircled by machines. At another signal from Dooku, the droids stood down. He addressed Qui-Gon. <br>\r\n\"You have fought gallantly, my old padawan. Worthy of recognition in the history archives of the Jedi Order. Now it is finished. Surrender, and your lives will be spared.\"<br>\r\n\"We will not be hostages for you to barter with, Count.\"<br>\r\n\"Then, I'm sorry, old friend.\" Dooku raised his hand and the droids prepared to fire. Padme glanced skyward. <br>\r\n\"Look!\" She said, pointing up. Several gunships were descending on the arena. <br>\r\n\"Circle the Jedi. A perimeter, create, around the survivors,\" Jedi Grand Master Yoda ordered. And from the gunships, clone troopers began to pour out. Suddenly, the odds were evened.<br>\r\n</span></div></div>",
            "created":1367470800,
            "id":1582866,
            "title":"Send in the Clones"
        },
        "12212112121221121122211":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Begun the Clone War Has...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Qui-Gon and Anakin boarded one of the gunships, pursuing Count Dooku, who had fled the arena. As the gunship flew over the sand dunes, Dooku's escorts turned tail and circled around behind the Jedi's transport. They opened and fire, causing the ship to jink into the top of a dune. As the pilot righted the gunship, Padme fell from the open doorway to the sands below. <br>\r\n\"Padme!!!\" He turned to the pilot, \"Put the ship down!\"<br>\r\n\"Anakin! Don't let your personal feelings get in the way. Pilot, follow that speeder.\"<br>\r\n\"Lower the ship!\"<br>\r\n\"Anakin, no. We have a job to do!\"<br>\r\n\"I don't care. Put the ship down.\"<br>\r\n\"You'll be expelled from the Jedi Order!\"<br>\r\n\"I can't leave her!\"<br>\r\n\"Come to your senses. What do you think Padmé would do if she were in your position?\"<br>\r\nAnakin hesitated, but resigned himself to reality. <br>\r\n\"She would do her duty.\" The gunship continued hurtling along, chasing the Sith Lord. The Jedi caught up with Dooku at the entrance to a hangar bay. The Count was preparing to take off and abandon Geonosis. <br>\r\n\"You're going to pay for all the Jedi you've killed today, Dooku,\" Anakin snarled. Qui-Gon addressed the young Jedi quietly, <br>\r\n\"We'll take him together - you go in slowly on the--\"<br>\r\n\"No, I'm taking him NOW!\" <br>\r\n\"Anakin, wait!\" It was too late. Anakin was speeding across the hangar, intent on vengeance. Calmly, Dooku raised his hand and loosed a fork of Force lightning, sending Anakin flying back across the hangar and into a wall. <br>\r\n\"As you can see, my Jedi powers are far beyond yours,\" Dooku said as Qui-Gon cautiously closed the distance between them. <br>\r\n\"I don't think so.\" The duel began and Qui-Gon was hard pressed to keep up with his former Master. <br>\r\n\"Come, come, Master Jinn. Put me out of my misery.\" The fight continued and Dooku pressed his former padawan into a compromised state. With a flourish, Dooku made a dual cut, one blow landing on Qui-Gon's shoulder, the other on his thigh. Qui-Gon fell, losing his saber in the process. Dooku stood over Qui-Gon and prepared to make him one with the Force. His brought his blade down and it sizzled and sparked as it came in contact with another blade.<br>\r\nAnakin's blade.<br>\r\n\"Brave of you, boy - but foolish. I would have thought you'd have learned your lesson.\"<br>\r\n\"I <i>am</i> a slow learner.\" Using the Force, Qui-Gon called his lightsaber to hand, then tossed it to his student. With both sabers, Anakin launched an attack on Dooku. But Dooku was the more experienced duelist. In one smooth motion, Dooku sliced through one saber and then through Anakin's opposite arm, severing it at the elbow. The Jedi apprentice collapsed next to his Master, squirming in agony. Just as Dooku was about to slay them, a new figure approached.<br>\r\n\"Master Yoda.\"<br>\r\n\"Count Dooku.\"<br>\r\n\"You have interfered with our plans for the last time.\" Dooku brought his blade up in a salute, then attacked the ancient Jedi. But he was no match for Yoda. <br>\r\n\"Fought well you have, my old padawan.\"<br>\r\n\"This is just the beginning.\" Dooku disengaged from Yoda and pulled with the Force on one of the cranes in the hangar. It  came crashing down toward Anakin and Qui-Gon. Yoda reached out and used the Force to keep the crane from crushing the helpless Jedi. But the distraction cost him Dooku. The Sith escaped up the ramp to his ship and blasted off. At that moment, Padme arrived and rushed to Anakin's side. Supporting him, the quartet stumbled back to the gunship she'd arrived in. </span></div></div>",
            "created":1367561100,
            "id":1583267,
            "title":"Escape of the Sith"
        },
        "122121121212211211222111":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Palpatine is kidnapped by Greivous!",
                "Something else or"
            ],
            "content":"<div class=\"\"><div> <span>Count Deku returned to Sidious.<br>\r\n<br>\r\n\"The Force is with us, Master Sidious.\" Dooku said in a tone of cool triumph. <br>\r\n<br>\r\n\"Welcome home, Lord Tyranus. You have done well.\" <br>\r\n<br>\r\n\"I bring you good news, my Lord. The war has<br>\r\nbegun.\"<br>\r\n<br>\r\n\" Excellent.\" A predatory smile fille his face Everything is going as planned.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nMeanwhile at the Jedi temple<br>\r\n<br>\r\n\"Do you believe what Count Dooku said about Sidious<br>\r\ncontrolling the Senate? It doesn't feel right.\" Obi Wan asked<br>\r\n<br>\r\n\"Becoming unreliable, Dooku has. Joined the dark side.<br>\r\nLies, deceit, creating mistrust are his ways now.\"<br>\r\n<br>\r\n\"I cannot be certain.\" Qui Gon interjected \"But I did not sense any sign of deception from my old master. I don't know how one man coud control the sennate, but we must not take him lightly\"<br>\r\n<br>\r\nMace Windu nodded his head, a grim expression his face. \"I agree, we should keep a closer eye on the senate\"<br>\r\n<br>\r\nYoda nodded his head.<br>\r\n<br>\r\n\"Still.. I have to admit something doesn't feel right about the situation. Why would Dooku tell us all of this?\"<br>\r\n<br>\r\n\"Though he could sway you, he did.\"<br>\r\n<br>\r\n\"That is true, but it may not be the only reason. I do not see why he would risk so much information falling into our hands, unless he is preparing a trap.\"<br>\r\n<br>\r\n\"That just increases our need for vigilance\" Mace Windu said. \"Anyway, where is your apprentice?\"<br>\r\n<br>\r\n\"On his way to Naboo. He is escorting Senator Amidala home. I have to admit, without the clones, we would have been in trouble.\"<br>\r\n<br>\r\n\"Trouble is just beginnning.\" Yoda said.\"Begun the Clone War Has....\"<br>\r\n<br>\r\nTENS OF THOUSANDS OF CLONE TROOPS are drawn up in strict<br>\r\nformation or move forward in neat files to climb the ramps<br>\r\nof the Military Assault Ships.<br>\r\n<br>\r\nOn the balcony, PALPATINE's expression is deeply sad.<br>\r\nEveryone watches somberly as, in the square, loaded Assault<br>\r\nShips take off. Others land immediately in their place. The<br>\r\nsky above is thick with transports. CLONE TROOPS march and<br>\r\nboard the Ships.<br>\r\n<br>\r\nThe Great Clone War has begun...<br>\r\n<br>\r\nElsewhere Anankin and Padame were getting married in secret, with only his droids to witness the ceremony. The jedi wondered if this might interfere with his duty, or what might happen to him if he were found out, but his feelings were too strong, the two of them could not live without each other. The Jedi forbade marriage, but Anakin was determined to find a way to make this. He would marry Padme AND fufill his duty as a Jedi.</span></div></div>",
            "created":1368919020,
            "id":1592477,
            "title":"Begun the Clone War Has..."
        },
        "1221211212122112112221111":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Can You Fly This Thing?",
                "A 'Grievous' Mistake"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Three Years Later...</i></div><br>\r\n<br>\r\nWar! The Republic is crumbling<br>\r\nunder attacks by the ruthless<br>\r\nSith Lord, Count Dooku.<br>\r\nThere are heroes on both sides.<br>\r\nEvil is everywhere.<br>\r\n<br>\r\nIn a stunning move, the<br>\r\nfiendish droid leader, General<br>\r\nGrievous, has swept into the<br>\r\nRepublic capital and kidnapped<br>\r\nChancellor Palpatine, leader of<br>\r\nthe Galactic Senate.<br>\r\n<br>\r\nAs the Separatist Droid Army<br>\r\nattempts to flee the besieged<br>\r\ncapital with their valuable<br>\r\nhostage, two Jedi Knights lead a<br>\r\ndesperate mission to rescue the<br>\r\ncaptive Chancellor....<br>\r\n<br>\r\n<br>\r\nAs Anakin Skywalker and Obi-Wan Kenobi's starfighters skidded to a halt in the hangar bay of the <i>Invisible Hand</i>, they leapt from the ships and ignited their lightsabers. As they deflected blaster bolts and destroyed a seemingly endless horde of battle droids, Anakin spoke.<br>\r\n\"I think we could really use Qui-Gon's help here.\"<br>\r\n\"Master Jinn is busy, Anakin.Council matters, you know.\" Having decimated the enemy, they approached the elevator, where R2-D2 was waiting for them.<br>\r\n\"The Chancellor's tracking signal is emanating from there, at the top of that spire,\" Obi-Wan pointed out.<br>\r\n\"I smell a trap,\" Anakin replied.<br>\r\n\"Next move?\"<br>\r\n\"Spring the trap.\" <br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"Good, Anakin, good... Kill him. Kill him now.\" Anakin and Obi-Wan had indeed walked into a trap. Count Dooku was waiting for them when they arrived at the top of the spire. After a vicious fight, in which Obi-Wan was knocked unconscious, Anakin stood over Count Dooku. His hands severed, there was nothing the Sith Lord could do as the Jedi Knight positioned both his own lightsaber and Dooku's lightsaber in a decapitating position. <br>\r\n\"I shouldn't.\" Anakin was obviously struggling with the decision. Dooku had taken his arm three years ago, and had very nearly taken his Master as well. The urge to pay him in kind was all but overwhelming.<br>\r\n\"DO IT!!\" Reaching his breaking point, Anakin made a choice.<br>\r\nHe extinguished the blades.<br>\r\nWith no power over the Jedi, Dooku could only watch as Anakin freed Palpatine from his bonds. He started to lead them out toward the elevator, then recalled Obi-Wan. He ran to check his friend's pulse.<br>\r\n\"Anakin, there's no time,\" Palpatine said.<br>\r\n\"He's still alive.\" <br>\r\n\"Leave him or we'll never make it,\" the Chancellor urged.<br>\r\n\"His fate will be the same as ours.\"</span></div></div>",
            "created":1372849560,
            "id":1621853,
            "title":"Anakin's Rescue Part III"
        },
        "12212112121221121122211112":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Plan B: Escape through the floor...",
                "Plan B: Escorted to General Grievous..."
            ],
            "content":"<div class=\"\"><div> <span>\"Activate ray shields!\" And as the light barriers sprung up around them, Anakin and Obi-Wan realized they were trapped. <br>\r\n\"Ray shields...\" Anakin observed.<br>\r\n\"Wait a minute, how did this happen? We're smarter than this...\" Obi-Wan commented.<br>\r\n\"Apparently not. How do you keep getting me into these situations?\"<br>\r\n\"Oh, so all of a sudden it's my fault?\"<br>\r\n\"You're the Master, I'm just a hero.\" Anakin grinned, a cocky half smile that showed he was joking.<br>\r\n\"I'm open to suggestions on how you plan to get out of this.\"<br>\r\n\"...I say patience.\"<br>\r\n\"Patience?\"<br>\r\n\"Yes. Artoo will be along in a moment and he'll release the ray shields...\"<br>\r\nAs if summoned by his words, the astromech droid came screaming into the hallway and crashed into the wall. <br>\r\n\"See? No problem.\" At which point, the problem arrived. Several super battle droids marched into the area. R2-D2 took it upon himself to zap one of them.<br>\r\n\"Ow!\" It said as it kicked R2 over. Obi-Wan looked back to Anakin.<br>\r\n\"Do you have a 'Plan B?'\"</span></div></div>",
            "created":1376636040,
            "id":1646830,
            "title":"A 'Grievous' Mistake"
        },
        "122121121212211211222111122":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Follow Anakin (Meeting with Padme)",
                "Follow Obi-Wan (Meeting with the Council)"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah, the Negotiator, General Kenobi! We've been waiting for you. That wasn't much of a rescue.\" General Grievous stalked up to the prisoners. \"And Anakin Skywalker. I was expecting someone with your reputation to be a little... older.\"<br>\r\n\"General Grievous. You're shorter than I expected,\" Anakin retorted. <br>\r\n\"Jedi scum.\"<br>\r\n\"We have a job to do, Anakin, try not to upset him,\" Obi-Wan said.<br>\r\n\"Your lightsabers will make a fine addition to my collection,\" Grievous taunted.<br>\r\n\"I don't think so. And this time you won't escape.\" As Obi-Wan spoke the word 'escape,' R2-D2's systems seemingly went haywire, creating an interesting distraction. Obi-Wan, hands restrained with electrobonds, spun around, reached out and, using the Force, yanked his lightsaber out of the General's hand He ignited it and cut his bonds. Continuing the spin, he cut Anakin free.  <br>\r\n\"Crush them! Make them suffer!\" Anakin used the Force to yank his lightsaber out of the General's hand.<br>\r\nThe droids that surrounded them began to fire. Obi-Wan and Anakin jumped into the line of fire. The bridge quickly degenerated into chaos. The Jedi were locked in a pitched battle between electrostaves and lightsabers with Grievous' four bodyguards. As the Jedi slowly overcame the bodyguards and their lightsaber-resistant staves, the ship took a massive hit and began to plummet toward Coruscant. Finally, the Jedi defeated the guards and turned to find Grievous. They leapt over the front console to surround him. With a sickly laugh, Grievous picked up one of the fallen electrostaves.<br>\r\n\"You lose, General Kenobi!\" Grievous hurled the staff at the starboard viewport and it shattered, allowing the vacuum to pull him into space. The two Jedi clung on to the console for dear life. As Grievous floated through space, he shot a cable from his wrist and into the ship, bringing him to stand squarely on the deck plates. Finally, the blast shield closed over the broken window and the Jedi could relax... for a moment. Grievous detached his cable and crawled along the exterior hull of the ship, using his magnetized hands and feet. He reached a row of escape pods and entered an airlock. Grievous entered the escape pod bay through the hatch. The Droid General went to a control panel and opened an escape pod.<br>\r\n\"Time to abandon ship,\" he snickered. The General pressed a a succession of buttons, and one by one the escape pods were jettisoned. Meanwhile, Obi-Wan and Anakin, dragging their newly re-rescued Chancellor and the re-captured Dooku with them, went over to the navigator's chair.<br>\r\n\"All the escape pods have been launched,\" Anakin observed.<br>\r\n\"Grievous. Can you fly a cruiser like this?\" Obi-Wan asked.<br>\r\n\"You mean, do I know how to land what's left of this thing?\" There was a great jolt, and the ship tilts forward.<br>\r\n\"Well?\"<br>\r\n\"Under the circumstances, I'd say the ability to pilot this thing is irrelevant. Strap yourselves in.\" Obi-Wan strapped Dooku into a chair, and as he did the same for himself, Palpatine followed suit. Anakin struggled with the controls of the ship. The ship started to glow, and pieces broke off. Artoo moved in on Palpatine 's controls and assisted in \"flying\" the cruiser.<br>\r\n\"Steady . . . Attitude . . . eighteen degrees.\" Obi-Wan informed. Artoo beeped.<br>\r\n\"Pressure rising. We've got to slow this wreck down. Open all hatches, extend all flaps, and drag fins.\" Anakin surmised.<br>\r\n\"Temp steady. Hatches open, flaps extended, drag fins . . .\" Obi-Wan began, but was interrupted as the back end of the ship broke away. <br>\r\n\"We lost something...\" Anakin said.<br>\r\n\"Not to worry, we're still flying half a ship,\" Obi-Wan confirmed. <br>\r\n\"Now we're really picking up speed . . . I'm going to shift a few degrees and see if I can slow us down.\" Anakin said, a mad grin of delight forming on his lips. This was almost as close to Podracing as one could get in outer space...<br>\r\n\"Careful . . . we're heating up-twelve thousand . . . thirteen thousand . . .\"<br>\r\n\"What's our speed?\"<br>\r\n\"Eight plus sixty... We're in the atmosphere . . .\" Anakin pointed to one of the controls. Artoo beeped madly.<br>\r\n\"Grab that . . . Keep us level,\" Anakin instructed.<br>\r\n\"Steady. Steady.\"<br>\r\n\"Easy, Artoo,\" Anakin said, \"Hang on, this may get a little rough. We lost our heat shields.\"<br>\r\n\"Five thousand... Fireships on the left and the right,\" Obi-Wan stated.<br>\r\n\"We'll take you in,\" the Fireship captain reported.<br>\r\n\"Copy that,\" Obi-Wan replied. <br>\r\n\"We're coming in too hot,\" Anakin noticed.<br>\r\nThe ship left a contrail as it streaked across the Coruscant skyline. Palpatine and Obi-Wan held on for their lives as the ship shook and rattled toward an industrial landing platform, surrounded by Emergency Fire Speeders. The smoking ship approached as five Fireships sprayed it with foam. The ship finally came to a rather jittery stop.<br>\r\n\"Another happy landing,\" Obi-Wan smiled.<br>\r\n <br>\r\n <br>\r\n</span></div></div>",
            "created":1376671200,
            "id":1646993,
            "title":"Down With the Ship..."
        },
        "1221211212122112112221111221":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Debate",
                "Padame says she is pregnant!"
            ],
            "content":"<div class=\"\"><div> <span>Anakin walks behind a shaodw piller, meeting Padme.<br>\r\n<br>\r\n\"Anakin, thank goodness your back!\"<br>\r\n<br>\r\n\"I missed you Padame, I missed you so.\" Anakin said emotionally.<br>\r\n<br>\r\n\"There were whispers . . .\" Padame said in a hushed tone \"-that you'd been killed. I've been living with unbearable dread. \"<br>\r\n<br>\r\nAnakin placed a hand on her arm.<br>\r\n<br>\r\n\"I'm back and I'm alright.\" <i>Though we had some close shaves... </i>he thought ruefully, but he didn't want to worry Padame. \"It feels like we've been apart for a lifetime. And it might have been ... If the Chancellor hadn't been kidnapped. I don't think they would have ever brought us back from the Outer Rim sieges. \"<br>\r\n<br>\r\nAnakin leaned forward to give her a kiss, but stopped. He stepped back. <br>\r\n<br>\r\n\"Is something wrong?\" Padame asked, clearly concerned.<br>\r\n<br>\r\n\"I'm torn....\" Anankin hesitated. \"I have intense feelings for you, but it clashes with my duty as a Jedi. I thought I could marry you, and a part of me dreams of leaving this and running away with you... but the war needs me.. I can't turn my back on the Jedi!\"<br>\r\n<br>\r\n\"I-I see....\" Padame said. She was clearly hurt, but struggled desperately to put on  a strong face. \"I-I suppose your right.....\"<br>\r\n<br>\r\nShe turned away, not able to beat looking in his eyes.<br>\r\n<br>\r\n\"Padame!\" Anakin called desperately. \"I thought I could make this work, I thought I could be married and be a Jedi, but those feelings I have for you.... its not just some empty Jedi code, I feel strongly attached to you, I'm afraid of losing you and I don't know what I would do if something happened to you....\"<br>\r\n<br>\r\nPadame paused. She surely couldn't drag Anakin away from a war he was needed in and would play a vital role? But... she loved him and didn't want to lose him, though could these secret meetings go on?<br>\r\n<br>\r\nShe turned to him.<br>\r\n<br>\r\n\"Can love exist with the Jedi code?\"<br>\r\n<br>\r\n\"I-I don't know... not with the code I've been taught... maybe in times of old....\" He hung his head. \"I don't know what to do!\"</span></div></div>",
            "created":1376697240,
            "id":1647116,
            "title":"Anakin,  torn between the Jedi way and Padame"
        },
        "12212112121221121122211112212":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Meeting With Yoda (Positive Outcome)",
                "Meeting With Yoda (Negative Outcome [canon])"
            ],
            "content":"<div class=\"\"><div> <span>Padme hesitated. She was unsure whether to tell Anakin her secret. <br>\r\n\"Are you all right? You're trembling. What's going on?\" <br>\r\n\"Anakin, you've been gone five months . . . it's been very hard for me. I've never felt so alone. There's . . .\"<br>\r\n\". . . Is there someone else?\" <br>\r\n\"No! Why do you think that? Your jealousy upsets me so much, Anakin.\"<br>\r\n\"I'm sorry, I'm just afraid of losing you, Padme . . . that's all.\" <br>\r\n\"I will never stop loving you, Anakin. My only fear is losing you. \" <br>\r\n\"It's just that I've never seen you like this . . .\" Still, she wasn't sure. She decided to tell him. He find out anyway sooner or later, with sooner being the more likely.<br>\r\n\"Anakin... Something wonderful has happened..... I- I'm pregnant.\" A million thoughts passed through Anakin's mind at once, but he simply held his wife's hands and said,<br>\r\n\"That's... That's wonderful.\" <br>\r\n\"What are we going to do?\"<br>\r\n\"Let's not worry about that now. This is a happy moment.\" They shared a long overdue embrace as the sun gleamed off the Coruscant skyline, fading into night. <br>\r\n<br>\r\n***  <br>\r\n<br>\r\nMeanwhile, on a distinctly different part of the planet, General Grievous knelt before a hologram.<br>\r\n\"Yes, Lord Sidious.\" <br>\r\n\"General Grievous. I suggest you move the Separatist leaders to the Mustafar system.\"<br>\r\n\"It will be done, My Lord.\" <br>\r\n\"The war draws to a close, General. The Republic will fall in short order very soon.\"<br>\r\n\"But... the loss of Count Dooku...\"<br>\r\n\"His capture was... a necessary loss... Soon I will have a new apprentice. One far younger, and more powerful...\"<br>\r\n<br>\r\n***  <br>\r\n<br>\r\nPadme walked down the stairs to the veranda of her apartment. Anakin had been having a bad dream, she knew. So she'd sought him out to talk about it. <br>\r\n\"Anakin, what's wrong?\"<br>\r\n\"...Nothing...\" He put his fingers to the japor snippet around Padme's neck. \"I remember when I gave this to you.\" <br>\r\n\"Anakin, how long is it going to take for us to be honest with each other?\" <br>\r\n\"...It was a dream.\"<br>\r\n\"Bad?\"<br>\r\n\"Like the ones I used to have about my mother... Before we rescued her...\" <br>\r\n\"And?\"<br>\r\n\"And... It was about you...\"<br>\r\n\"Tell me.\"<br>\r\n\"It was only a nightmare.\"<br>\r\n\"'Jedi don't have nightmares.' You told me that yourself.\" Anakin took a deep breath that didn't entirely calm him.<br>\r\n\"...You die in childbirth.\"<br>\r\n\"...And the baby?\" <br>\r\n\"I don't know.\"<br>\r\n\"...It was only a dream.\" Anakin pulled her close.<br>\r\n\"I won't let this one become real, Padme.\"<br>\r\n\"Anakin, do you think Obi-Wan might be able to help us?\"<br>\r\n\"We don't need his help. Our baby is a blessing, not a curse.\"<br>\r\n <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1376814300,
            "id":1647740,
            "title":"Skywalker: The Next Generation"
        },
        "122121121212211211222111122121":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Palpatine's Representative",
                "Petition of 2000"
            ],
            "content":"<div class=\"\"><div> <span>Anakin and Yoda sat in a secluded room, the latter deep in thought.<br>\r\n\"Premonitions . . . premonitions . . . Hmmmm . . . these visions you have . . \"<br>\r\n\"They're of pain. Suffering. Death.\"<br>\r\n\"Yourself you speak of, or someone you know?\"<br>\r\n\"Someone . . \"<br>\r\n\"Close to you?\"<br>\r\n\"Yes.\"<br>\r\n\"Careful you must be when sensing the future, Anakin. A path to the dark side the fear of loss is.\" <br>\r\n\"I won't let these visions come true, Master.\" <br>\r\n\"Death is a natural part of life. Rejoice for those around you who transform into the Force. Mourn them, do not. Miss them, do not. Attachment leads to jealousy. The shadow of greed, that is.\" That made Anakin slightly uncomfortable. The dark side was always there, prodding at his vulnerable mind.<br>\r\n\"I understand. What must I do, Master?\" <br>\r\n\"Train yourself to let go of everything you fear to lose.\"<br>\r\n<br>\r\n***  <br>\r\n<br>\r\nAnakin rushed into the briefing room. By the time he reached the chamber, the last of the Jedi were leaving. Only Obi-Wan remained at the front of the lecture hall. He shut off some holograms and electronic charts and maps.<br>\r\n\"You missed the report on the Outer Rim sieges.\" <br>\r\n\"I'm sorry, I was held up. I have no excuse.\" <br>\r\n\"In short, they are going very well. Saleucami has fallen, and Master Vos has moved his troops to Boz Pity.\"<br>\r\n\"What's wrong then?\"<br>\r\n\"The Senate is expected to vote more executive powers to the Chancellor today.\"<br>\r\n\"Well, that can only mean less deliberating and more action. Is that bad? It will make it easier for us to end this war.\"<br>\r\n\"Anakin, be careful of your friend Palpatine.\"<br>\r\n\"Be careful of what?\"<br>\r\n\"He has requested your presence.\"<br>\r\n\"What for?\"<br>\r\n\"He would not say.\"<br>\r\n\"He didn't inform the Jedi Council? That's unusual, isn't it?\"<br>\r\n\"All of this is unusual, and it's making me feel uneasy. You're probably aware that relations between the Council and the Chancellor are stressed.\"<br>\r\n\"I know the Council has grown wary of the Chancellor, yes.\" <br>\r\n\"The Force grows dark, Anakin, and we are all affected by it. Be wary of your feelings.\"<br>\r\n<br>\r\n<br>\r\n  <br>\r\n </span></div></div>",
            "created":1377125700,
            "id":1649509,
            "title":"The Shadow of Greed"
        },
        "1221211212122112112221111221211":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>ANAKIN stands with PALPATINE at his window overlooking the vastness of Coruscant. Several buildings have been destroyed. A brown haze hangs over the landscape. <br>\r\n<br>\r\nAnakin arrived to meet Palpatine, Obi Wan's warnings in the back of his mind.<br>\r\n<br>\r\nPalpatine was atop of a building, looking out the window at Coruscants vast yet damaged city states. The two could all too clearly see the damage the war had done.<br>\r\n<br>\r\nPalpatine turned to face Anakin.<br>\r\n<br>\r\n\"Anakin, this afternoon the Senate is going to call on me to take direct control of the Jedi Council. \"<br>\r\n<br>\r\nAnankin's eyes flicked with surprise<br>\r\n<br>\r\n\"The Jedi will no longer report to the Senate?\"<br>\r\n<br>\r\n\"They will report to me . . . personally. The Senate is too unfocused to conduct a war. This will bring a quick end to things. \"<br>\r\n<br>\r\nPalpatine's words were reassuring, though Anakin had a feeling in his gut that something might be off. Still, if this might bring an end to the war, surely that would be a good thing?<br>\r\n<br>\r\n\"I agree, but the Jedi Council may not see it that way. \" The Jedi council was often supicious of palptine. Anakin wondered if this were paranoia or if they actually had a good reason. Palpatine had always seemed a kindly old man who treated Anakin well, and as a grown up, but he couldn't shake the feeling that something wasn't right.<br>\r\n<br>\r\nIf Palpatine could tell Anakin was having doubts he didn't show it.<br>\r\n<br>\r\n\"There are times when we must all endure adjustments to the constitution in the name of security.\"<br>\r\n<br>\r\nThis made Anakin espeically uneasy. He also didn't imagine the politicans OR the Jedi going alone with this.<br>\r\n<br>\r\n\"With all due respect, sir, the Council is in no mood for more constitutional amendments. <br>\r\n<br>\r\n\"Thank you, my friend, but in this case I have no choice . . . this war must be won. \"<br>\r\n<br>\r\nAnankin felt conflicted. He did want the war to end as quickly as possible and with the least amount of blood shed, but was Palpatine going about this the right way? Their was indeed too much bickering and politiciking inside the sennate, but would giving that much control to one man be a good idea? Palpatine spoke gentle word's and had a gentle demeaner, but Anakin wasn't always sure if he was entirely sincere. Qui Gon and Obiwan had instilled a healthy distrust of most polictians inside him.<br>\r\n<br>\r\n\"I suppose we would all like to see the war end...\" He said in a non commital way.<br>\r\nPalpatine looked at him, a serious yet fatherly expression his face.<br>\r\n<br>\r\n\"Anakin, I've known you since you were a small boy. I have advised you over the years when I could ... I am very proud of your accomplishments. You have won many battles the Jedi Council thought were lost . . . and you saved my life. I hope you trust me.\"<br>\r\n<br>\r\nAnankin shuffled awakrdly.<br>\r\n<br>\r\n\"I want to, but I can't help feel uneasy. I appreicate the fact that you are trying to end the war, and I know the republic is often ineffective and bearcratic, but is it right one man to have so much power?\"<br>\r\n<br>\r\nA flash of frustration came on Palpatin'es face, though he soon regained his calmer demenar.<br>\r\n<br>\r\n\"The Jedi. The Council keeps pushing for more control. They're shrouded in secrecy and obsessed with maintaining their autonomy . . . ideals. I find simply incomprehensible in a democracy.\" <br>\r\n<br>\r\n\"I can assure you that the Jedi are dedicated to the values of the Republic, sir. I have never had a problem with the Jedi, I do not see what they have to hide.\"<br>\r\n<br>\r\n\"Yet they do not allow you to sit on all there meetings, do they?\"<br>\r\n<br>\r\nAnankin felt conflicted. He did long to be acknowledged as a full Jedi master, but he never felt Qui Gon hid anything of importance from him nor he feel like he was treated as a child.<br>\r\n<br>\r\n\"I trust they will tell me everything I need to know in time.\"<br>\r\n<br>\r\nPalpatine ceased this opening.<br>\r\n<br>\r\n\"Can you be so certain?\"<br>\r\n<br>\r\n\"I-\" Anankin hesitated. \"I trust my master at least.\"<br>\r\n<br>\r\nPalpatine smiled, seeing an open weak spot.<br>\r\n<br>\r\n\"But I see you also bothered by the Jedi's tendacy to keep secrets.\"<br>\r\n<br>\r\n\"I trust they have their  reasons.\" Anankin said uncertainly.<br>\r\n<br>\r\nPalaptine reflected on this. The boy is not as close to the dark side as I has hoped. His master has trained and led him well. None the less I might be able to use his uncertainty and naivety to my advantage.<br>\r\n<br>\r\n\"Nevertheless, their actions will speak more loudly than their words. I'm depending on you. \"<br>\r\n<br>\r\n\"For what? I don't understand.\" Anakin asked suspiciously.<br>\r\n<br>\r\n\"To be the eyes, ears, and voice of the Republic . . . \"<br>\r\n<br>\r\nANAKIN thinks about this. <br>\r\n<br>\r\nPalpatine waved his hand reassuringly.<br>\r\n<br>\r\n\"Don't worry, I will not ask you to act against the other Jedi, merely keep an eye on them.\"<br>\r\n<br>\r\nAnakin looked at Palpatine supiciosuly. Palpatine did not seem bothered.<br>\r\n<br>\r\n\"If they are not up to anything then you will have nothing to report.\"<br>\r\n<br>\r\nAnakin relaxed a little.<br>\r\n<br>\r\n\"Anyway.\" Palpatine said. \"Anakin . . . I'm appointing you to be my personal representative on the Jedi Council.\"<br>\r\n<br>\r\nAnakin was taken back in surprise. <br>\r\n<br>\r\n\"Me? A Master? I am overwhelmed, sir, but the Council elects its own members. They will never accept this. \"<br>\r\n<br>\r\n\"I think they will . . . they need you more than you know. \"<br>\r\n<br>\r\n\"Why me?\"<br>\r\n<br>\r\n\"Though you are young, you are a very promising Jedi, with a sharp mind and a great talent in the force. Also you will be able to look at the council with a fresh and unbiased perspective.\"</span></div></div>",
            "created":1377736020,
            "id":1653324,
            "title":"Palpatine's Representative"
        },
        "12212112121221121122211112212111":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Obi-Wan's story arc",
                "Anakin/Padme story arc"
            ],
            "content":"<div class=\"\"><div> <span>***<br>\r\n<br>\r\nAnakin jogged into the Galaxies Opera House and into the chancellor's private box. <br>\r\n\"You wanted to see me, Chancellor.\"<br>\r\n\"Yes, Anakin! Come closer. I have good news. Our Clone Intelligence Units have discovered the location of General Grievous. He is hiding in the Utapau system.\"<br>\r\n\"At last, we'll be able to capture that monster and end this war.\"<br>\r\n\"I would worry about the collective wisdom of the Council if they didn't select you for this assignment. You're the best choice, by far. Sit down,\" to his aides he said, \"Leave us.\" Anakin sat next to Palpatine as the Chancellor leaned over to him.<br>\r\n\"Anakin, you know I am not able to rely on the Jedi Council. If they haven't included you in their plot, they soon will.\"<br>\r\n\"I'm not sure I understand.\"<br>\r\n\"You must sense what I have come to suspect . . . the Jedi Council want control of the Republic . . . they're planning to betray me.\"<br>\r\n\"I don't think . . .\"<br>\r\n\"Anakin, search your feelings. You know, don't you?\"<br>\r\n\"I know they don't trust you . . .\"<br>\r\n\"Or the Senate . . . or the Republic . . . or democracy for that matter.\"<br>\r\n\"I have to admit my trust in them has been shaken.\"<br>\r\n\"Why? They asked you to do something that made you feel dishonest, didn't they?\" Anakin didn't know what to say. He simply stared at his boots, lost for words.<br>\r\n\"They asked you to spy on me, didn't they?\"<br>\r\n\"I don't know ... I don't know what to say.\"<br>\r\n\"Remember back to your early teachings. Anakin. 'All those who gain power are afraid to lose it.' <br>\r\nEven the Jedi.\"<br>\r\n\"The Jedi use their power for good.\"<br>\r\n\"Good is a point of view, Anakin. And the Jedi point of view is not the only valid one. The Dark Lords of the Sith believe in security and justice also, yet they are considered by the Jedi to be. . .\"<br>\r\n\" . . . evil.\"<br>\r\n\" . . . from a Jedi's point of view. The Sith and the Jedi are similar in almost every way, including their quest for greater power. The difference between the two is the Sith are not afraid of the dark side of the Force. That is why they are more powerful.\"<br>\r\n\"The Sith rely on their passion for their strength. They think inward, only about themselves.\"<br>\r\n\"And the Jedi don't?\"<br>\r\n\"The Jedi are selfless . . . they only care about others.\" Palpatine just smiled.<br>\r\n\"The fear of losing power is a weakness of both the Jedi and the Sith.\" Anakin considered that for a long moment.<br>\r\n\"Did you ever hear the tragedy of Darth Plagueis 'the Wise?'\" Palpatine continued.<br>\r\n\"No.\"<br>\r\n\"I thought not. It's not a story the Jedi would tell you. It's a Sith legend. Darth Plagueis was a Dark Lord of the Sith, so powerful and so wise he could use the Force to influence the midi-chlorians... to create life ... He had such a knowledge of the dark side that he could even keep the ones he cared about... from dying.\"<br>\r\n\"He could actually... save people from death?\"<br>\r\n\"The dark side of the Force is a pathway to many abilities some consider to be... unnatural.\"<br>\r\n\"What happened to him?\"<br>\r\n\"He became so powerful . . . the only thing he was afraid of was losing his power, which eventually, of course, he did. Unfortunately, he taught his apprentice everything he knew, then his apprentice killed him in his sleep.\" Palpatine let a sly smile come to his lips. \"Ironic. He could save others from death, but not himself.\" Anakin felt a new glimmer of hope welling up inside him.<br>\r\n\"Is it possible to learn this power?\" The chancellor slowly turned to face him.<br>\r\n\"Not from a Jedi\"</span></div></div>",
            "created":1379837280,
            "id":1667303,
            "title":"The Tragedy of Darth Plageus the Wise"
        },
        "122121121212211211222111122121112":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Anankin in the halls with Qui Gon (don't add, i'm going write this)"
            ],
            "content":"<div class=\"\"><div> <span>Padme was blind-sided. In one swift move, Palpatine had seized control of the senate. She couldn't believe how easily he had done so, and now feared for the future of democracy. She debated with her fellow senators, at least those who hadn't fallen under Palpatine's spell about what they could do.<br>\r\n<br>\r\nMeanwhile at the Jedi council.<br>\r\n<br>\r\nAnakin stood pensively by the door, preparing himself. He hoped the other Jedi would accept him, though he believed Qui Gon would be on his side. The door opened and he entered, the other masters looking at him intently. Mace Windu was the first to speak, his voice as solemn and serious as ever.<br>\r\n<br>\r\n\"Anakin Skywalker, we have approved your appointment to the Council as the Chancellor's personal representative. \"<br>\r\n<br>\r\nAnakin felt a wave of joy come over him, though he kept his composure.<br>\r\n<br>\r\n\"I will do my best to uphold the principles of the Jedi Order. \"<br>\r\n<br>\r\n\"Allow this appointment lightly, the Council does not.\" Yoda cautioned. \"Disturbing is this move by Chancellor Palpatine. \"<br>\r\n<br>\r\nAnakin nodded.<br>\r\n<br>\r\n\"I understand.\"<br>\r\n<br>\r\n\"You are on the council.\" Mace said reservedly \"But we do not grant you the rank of master.\"<br>\r\n<br>\r\nAnakin was outraged. How could they deny him this?!<br>\r\n<br>\r\n\"What? ! How can you do this?? This is outrageous, it's unfair . . . \" He flailed his arms. \"I'm more powerful than any of you. How can you be on the Council and not be a Master?\"<br>\r\n<br>\r\n\"Take a seat, young Skywalker.\" Mace Windu said sternly.<br>\r\n<br>\r\nAnakin knew he had stepped out of line, and prompt raced for a seat.<br>\r\n<br>\r\n\"Forgive me master.\"<br>\r\n<br>\r\nEveryone was embarrassed, Qui Gon looking especially solemn.<br>\r\n<br>\r\n\"Anakin.\" Qui Gon called in a fatherly  voice. \"Their is more to being a Jedi Master than raw power. You are indeed a very talented Jedi, but you have no perfected control over your emotions, and without that we can be vulnerable to the influences of the dark side.\" Qui Gon looked away guiltily, apparently recalling an unpleasant memory.\"<br>\r\n<br>\r\nAnankin was puzzled and reflected on this. A part of him took offence, and yet his earlier outburst proved his master right.<br>\r\nMaybe the Council had a point, though he hated how the others would sometimes make him feel like a child.<br>\r\n<br>\r\nSuddenly a hologram of a jedi sprang into life, a small Ceran figure, easily distinguishable by his large pointy forehead appeared before the council.<br>\r\n<br>\r\n\"We have surveyed all systems in the Republic, and have found no sign of General Grievous.\"<br>\r\n<br>\r\nThe Jedi were disappointed, but not discouraged.<br>\r\n<br>\r\n\"Hiding in the Outer Rim, Grievous is.\" Yoda said. \"The outlying systems, you must sweep.\" <br>\r\n<br>\r\n\"It may take some time . . .\" Obi Wan said. \"We do not have many ships to spare.\" <br>\r\n<br>\r\n\"We cannot take ships from the front line.\" Mace Windu replied <br>\r\n<br>\r\n\"And yet, it would be fatal for us to allow the droid armies to regroup.\" <br>\r\n<br>\r\n\"Master Kenobi, our spies contact, you must, and then wait. \"<br>\r\n<br>\r\n\"What about the droid attack on the Wookiees? \"<br>\r\n<br>\r\n\"It is critical we send an attack group there, immediately!\" Mace Windu said decisively<br>\r\n<br>\r\nObi Wan nodded.<br>\r\n<br>\r\n\"He's right, that is a system we cannot afford to lose. It's the main navigation route for the south western quadrant.\" <br>\r\n<br>\r\nAnakin proppedhimself up, eager to prove himself to the council, and feeling well suited to the mission.<br>\r\n<br>\r\n\"I know that system well. It would take us little time to drive the droids off that planet. \"<br>\r\n<br>\r\nMace Windu shook his head.<br>\r\n<br>\r\n\"Skywalker, your assignment is here with the Chancellor, and Kenobi must find General Grievous. \"<br>\r\n<br>\r\n\" Go, I will. Good relations with the Wookiees, I have.\"<br>\r\n<br>\r\nMace Windu nodded.<br>\r\n<br>\r\n\" It is settled then. Yoda will take a battalion of clones to reinforce the Wookiees on Kashyyyk. May the Force be with us all.\"<br>\r\n<br>\r\nAnankin scowled in disappointment., though none of the other masters seemed to notice, none except Qui Gon. Resentment burned inside Anakin, they really were treating him like a child! It was especially obvious that Mace Windu didn't trust him, and wasn't sure about his place on the council.<br>\r\n<br>\r\nQui Gon had been unusually silent, looking even more contemplative than usual.<br>\r\n<br>\r\n\"Is thier anything I could do to help?\"<br>\r\n<br>\r\nMace Windu shook his head.<br>\r\n<br>\r\n\"No. Right now the best you can do is stay here and help defend us if we are under attack. If their are any further orders I will get back to you. Although it does not seem like it, you are needed here.\"<br>\r\n<br>\r\n<i>If Palpatine wishes to have Anakin keep an eye on us, I will make sure someone has their eyes on Anakin.</i>.<br>\r\n<br>\r\n\"I see.\" Qui Gon said uncertainly, though he appeared as calm and unflappable as ever.<br>\r\n<br>\r\n</span></div></div>",
            "created":1380319020,
            "id":1670784,
            "title":"Anakin/Padme story arc"
        },
        "1221211212122112112221111221211121":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Anankin and Qui Gon walked through one of the temple's long halls. Anakin shook with fury.<br>\r\n<br>\r\n\"What kind of nonsense is this, put me on the Council and not make me a Master!?? That's never been done in the history of the Jedi. It's insulting.\"<br>\r\n<br>\r\nQui- Gon raised his hand in a calming gesture.<br>\r\n<br>\r\n\"Calm down, Anakin. You have been given a great honour. To be on the Council at your age . . . It's never happened before. However, although you are extremely talented, your emotions leave you vulnerable to the dark-side.\"<br>\r\n<br>\r\nAnaking bristled with frustration, he couldn't help but take some of it out on Qui-Gon. Sometimes Qui-Gon seemed like the only Jedi who listened to Anakin, and even he didn't think Anaking was ready to be a master.<br>\r\n<br>\r\n\"How can you be so sure?! Why doesn't anyone trust me?!\"<br>\r\n<br>\r\n\"I trust you Anakin. I belive you will make a great Jedi Master in time but-\"<br>\r\n<br>\r\n\"But what? I thought you were on my side Qui-Gon!\"<br>\r\n<br>\r\n\"I am. I want what's best for you and the council. The truth is I have had another apprentice fall, a fall brought on by his own ambitions of power and rage.  And... my own master was turned to the darkside by such feelings. You know him as... Count Dooku..\"<br>\r\n<br>\r\nAnakin reeled back in shock.<br>\r\n<br>\r\n\"You're- What happened?\" Suddenly Anakin was angry again. \"And you think I'll fall the same way? Just because I want the Jedi council to treat me as an adult? Just because I want them to recognise my potential?!\"<br>\r\n<br>\r\n\"That rage, that ambition is natural, it affects us all and it is understandable. I to have felt it. They are not emotions to be feared or hated, but you must understand them or they will control you. In order to be a Jedi Master and protect yourself from the influence of the Dark Side, you must constantly examine and balance your emotions. You do not need to deny them but you cannot ignore them.\"<br>\r\n<br>\r\n\"But-\"<br>\r\n<br>\r\n\"Do you deny that you let your anger get the best of you?\"<br>\r\n<br>\r\nAnankin looked at the floor.<br>\r\n<br>\r\n\"No master...\"<br>\r\n<br>\r\nQui Gon smiled.<br>\r\n<br>\r\n\"I do believe you will prove yourself to be a worthy Jedi Master, and with that you will come to win the Council's respect.\"<br>\r\n<br>\r\n\"How?! The other Council members don't trust me!\"<br>\r\n<br>\r\nQui Gon grimaced.<br>\r\n<br>\r\n\"You are in a tricky position. You are very close to Palpatine, the others suspect divided loyalties.\"<br>\r\n<br>\r\nAnakin looked at his pleadingly.<br>\r\n<br>\r\n\"You trust me, don't you?\"<br>\r\n<br>\r\nQui Gon nodded.<br>\r\n<br>\r\n\"I do. I do believe that when the time comes you will do the right thing. However I think you trust Palpatine too much.\"<br>\r\n<br>\r\n\"The Chancellor is not a bad man, Qui-Gon!\" Anakn protested \"He befriended me. He's watched out for me ever since I arrived here. \"<br>\r\n<br>\r\nQui-Gon was unmoved.<br>\r\n<br>\r\n\"Anakin use your feelings. Doesn't something feel amiss? Their is something you missing, something you are refusing to look at.\"<br>\r\n<br>\r\n\"What do you mean?!\"<br>\r\n<br>\r\n\"Open yourself up to your feelings and you will see it in time. Let yourself feel them and acknowledge them.\"<br>\r\n<br>\r\n\"Palaptine has given me no reason to mistrust him!\"<br>\r\n<br>\r\n\"You have only looked at his surface actions. On the face of things he has indeed been very kind to you and always told you what you've wanted to here. Yet I to have been here for you, I have been there to reassure you, yet also tell you what you needed to hear, even if it wasn't what you wanted.\"<br>\r\n<br>\r\nAnankin looked stricken.<br>\r\n<br>\r\n\"What do you have against Palpatine?!\"<br>\r\n<br>\r\n\" Look beneath his friendly façade. Every action he has taken has been to advance his political power and influence. I believe he does not simply want to increase his position with the senate, I believe he wants to supersede it.\"<br>\r\n<br>\r\nAnakin was outraged<br>\r\n<br>\r\n\"How can you say such a thing?!\"<br>\r\n<br>\r\nQui-Gon was unpreturbed.<br>\r\n<br>\r\n\"Look beneath the surface and you will see the same thing. Trust not just your initial feelings but also the misigivings you have buried. Do not simply look at his actions in the moment, but also look towards what he is working towards.\"<br>\r\n<br>\r\n\"But-\"<br>\r\n<br>\r\n\"The Jedi Council have an assignment for you. You are not going to like it, but it is very important. For the Jedi and for the Republic itself, and in your unique position you are the only who can fulfil it.\"<br>\r\n<br>\r\nAnakin leaned forward, clearly intrigued<br>\r\n<br>\r\n\"We need you to spy on Palpatine and report back to Jedi.\"<br>\r\n<br>\r\nAnankin's mouth fell open. He bristled with anger at this outrageous request.<br>\r\n<br>\r\n\"I can't do that! That's treason! You're asking me to do something against the Jedi Code. Against the Republic. Against a mentor . . . and a friend. That's what's out of place here. Why are you asking this of me?!\"<br>\r\n<br>\r\nQui-Gon smiled confidently.<br>\r\n<br>\r\n\"If Palpatine is really what he appears to be, then you have nothing to worry about. Their will be nothing sinster to report back to the Jedi will there? And I am not just asking you to do this, the whole council is. I have faith in you Anakin, I believe you will find the truth.\"<br>\r\n<br>\r\nQui-Gon walked away, still smiling. Anakin turned away. Clearly divided. Was Qui-Gon really trying to force him to choose between the Jedi and Palpatine? Or was their more to this? He did at least seem to trust Anakin.<br>\r\n<br>\r\nQui-Gon went back to the Jedi halls to speak with Mace Windu.<br>\r\n<br>\r\n\"Anakin did not take to his assignment with much enthusiasm, though I am not too surprised.\" <br>\r\n<br>\r\nMace Windu scowled.<br>\r\n<br>\r\n\"I sense anger and pride in that boy.\"<br>\r\n<br>\r\nQui-Gon nodded.<br>\r\n<br>\r\n\"Yes, but that is quite normal for a talented young Jedi. I believe he can keep it in check.\"<br>\r\n<br>\r\n\"I don't trust him.\"<br>\r\n<br>\r\n\"Do you trust me?\"<br>\r\n<br>\r\nMace Windu's expression softened, though he looked uncertain.<br>\r\n<br>\r\n\"We don't always approve of your actions, but I do believe you try to follow the Jedi Code in your own way. Your judgement is usally proven correct, though you have had an apprentice fall before.\"<br>\r\n<br>\r\nQui-Gon's head drooped.<br>\r\n<br>\r\n\"Yes. A mistake I never intend to repeat again. This time I am aware of the feelings inside him, and I do not deny him.\" Qui Gon smiled. \"And yet, he is not the same as Xanatos. They share some superficial similarities, but Anakin walks in the light and we have a much deeper bond. And I am a wiser man than I was back then.\"<br>\r\n<br>\r\n\"Hmm..\" Mace Windu assessed Qui Gon's speech. He had to admit Qui-Gon seemed to know what he was doing, or at least thought he did, though Anakin still seemed like a wild card. Windu had seen plenty of Jedi like Anakin fall to the Dark side, and Palaptine had a lot of influence over the boy. Still he had Qui-Gon. \"Whatever you do, keep an eye on the boy. And if necessary-\"<br>\r\n<br>\r\n\"I know. But I have faith in Anakin, I believe when the time comes he will do the right thing.\" </span></div></div>",
            "created":1380323400,
            "id":1670828,
            "title":"No servant can serve two masters"
        },
        "1221211212122112112221111222":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Anakin's Reunion",
                "An Ominous Summons"
            ],
            "content":"<div class=\"\"><div> <span>\"You did well today, Obi-Wan,\" Mace Windu commended. He looked across the circle of chairs to Qui-Gon. \"Perhaps we were wrong about not training Anakin.\" Qui-Gon didn't have to force the smile that settled on his lips as Obi-Wan bowed and accepted the words of honor. <br>\r\n\"I can't take all the credit, Master. Anakin fought Dooku alone for most of the battle. As I understand it, he made a difficult choice in sparing him...\" A hard look settled into Mace Windu's features. <br>\r\n\"Yes... From what you've told us, the exchange between the Chancellor and Anakin is... disturbing, to put it mildly.\" <br>\r\n\"This does not seem like the Chancellor at all,\" Qui-Gon mused, \"Are you certain Anakin wasn't embellishing?\" Qui-Gon's eyes unfocused momentarily, as if recalling a distant memory.<br>\r\n\"I'm certain, Master. Anakin had no reason to make this up, and I sensed no dishonesty from him.\" <br>\r\n\"If this exchange is not an isolated incident, we may have a serious problem on our hands,\" Windu observed. \"We cannot allow the leader of the Republic to become a destructive influence on young Skywalker.\" Yoda glanced at Mace.<br>\r\n\"To a dark place this line of thought will carry us. Great care we must take.\" <br>\r\n\"Agreed,\" Qui-Gon said, \"I will talk with Anakin when he returns. For now, we have other matters to discuss.\"</span></div></div>",
            "created":1431421620,
            "id":1977115,
            "title":"To A Dark Place...."
        },
        "12212112121221121122211112221":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Qui-Gon's Concerns",
                "Palpatine's Interference "
            ],
            "content":"<div class=\"\"><div> <span>A speeder buzzed past the apartment window as Padmé Amidala glanced out to the Coruscant cityscape. A brief chime indicated an arrival and as she turned, she saw Anakin standing in the doorway, grinning from ear to ear. <br>\r\n\"Ani, you're home!!\" She rushed over and threw her arms around him as he pulled her close. <br>\r\n\"I've missed you, Padmé. If the Chancellor hadn't been kidnapped, I don't think they'd have ever brought us back from the Outer Rim sieges.\" She looked up at him, a mix of emotions clouding her chestnut eyes. \"You're shaking, what's wrong?\"<br>\r\n\"I... Nothing's wrong. Ani, I... Have good news. I... We're pregnant.\" Anakin stood, stunned for a moment. <br>\r\n\"That's... That's great news.\" Consequences were multiplying in his head by the nanosecond. The Council would expel him. The Senate would kick Padmé out. What would Master Jinn think? And most worrisome was the realization that Anakin wasn't ready to be a father. None of this showed through in his smile though. <br>\r\n\"Anakin, what if we're not ready for this? What if we... If I can't do it?\"<br>\r\n\"We'll be alright, Padmé. This baby will be a blessing, not a curse, I promise you.\"<br>\r\n\"I hope you're right, General Skywalker.\"<br>\r\n\"I know I'm right, Mrs. Skywalker. I love you.\"<br>\r\n\"I love you too.\" As their lips touched, Anakin's communicator went off. He sighed as he answered it.<br>\r\n\"General Skywalker.\"<br>\r\n\"Anakin, we need to discuss some things, if you can spare a moment.\"<br>\r\n\"Of course, Master Qui-Gon. I'll meet you in the Council chamber.\"<br>\r\n\"I'll be waiting.\" Anakin shut the communicator off and kissed his wife once more.<br>\r\n\"Wait for me, I'll be back.\" He strode from the apartment, leaving Padmé to wonder about what was going on.</span></div></div>",
            "created":1438615320,
            "id":2016073,
            "title":"A Blessing, Not a Curse"
        },
        "122121121212211211222111122211":{
            "author_id":"raistlin2090",
            "author_name":"James F. Dracon",
            "choices":[
                "Anakin Agrees With Qui-Gon",
                "Anakin Disagrees With Qui-Gon"
            ],
            "content":"<div class=\"\"><div> <span>\"Anakin, what did Chancellor Palpatine tell you aboard Grievous' ship?\" The younger Jedi glanced down, the internal struggle keeping him silent for a moment. <br>\r\n\"He... He demanded that I kill Dooku. At the time, I thought little of it. The priority was to rescue the Chancellor and escape. After thinking about it, I don't understand. The Chancellor has never advocated this sort of violence before, Master.\" Qui-Gon remained quiet a moment, gathering his thoughts and taking in his former padawan's words. <br>\r\n\"Anakin, I'm going to share something with you that the Council doesn't even know. I believe the Sith have control of the Senate.\"<br>\r\n\"What?! But the Council decided that was impossible, didn't they?\" Qui-Gon nodded.<br>\r\n\"They did. They also weren't held captive by Dooku. I knew him better than anyone when he was my Master. There was no deceit in his voice when he told me this disturbing news, Anakin. This, combined with what you've said about the Chancellor's words... I believe Palpatine may be the Sith we've been on guard for.\"<br>\r\n\"Master, what are you saying?! The Chancellor has been nothing but supportive of the Jedi ever since he was elected, how can you accuse him of something like this?!\"<br>\r\n\"Anakin, quiet your mind and meditate on this. I want you to come to your own conclusion on this.\"<br>\r\n\"I... Yes, Master...\" Anakin stood and bowed, leaving the Council Chambers and heading back to Padme's apartment.<br>\r\n</span></div></div>",
            "created":1460471520,
            "id":2131833,
            "title":"A Dark Place..."
        }
    },
    "info":{
        "author_id":"raistlin2090",
        "author_name":"James F. Dracon",
        "brief_description":"Qui-Gon Jinn defeats Darth Maul on Naboo. What happens as a result...",
        "created":1294486920,
        "description":"<td align=\"left\" class=\"norm\">Not a lot of rules for this, however I have a couple.<br>\r\n<br>\r\nI. Must stay with Star Wars. No venturing off into whatever other stories you want.<br>\r\n<br>\r\nII. Try to stay with already established Star Wars characters. New characters are fine, but not encouraged.<br>\r\n<br>\r\nIII. No inappropriate material. Different time, different story.</td>",
        "id":1739521,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1460471520,
        "modified":1460471520,
        "pretty_title":"Star Wars: Infinites: Jinn defeats Maul "
    }
}