{
    "chapters":{
        "1":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "A man in a straight relationship",
                "A man in a gay relationship",
                "A woman in a straight relationship",
                "A woman in a lesbian relationship"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you?</span></div></span></div>",
            "created":1337490000,
            "id":1341561,
            "title":"Introductions"
        },
        "11":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "A single man",
                "A man who is already in a relationship too",
                "A single woman",
                "A woman who is already in a relationship too"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are Daniel and you have a wife named Susan<br>\r\n<br>\r\nWho does Susan fall in love with?</span></div></span></div>",
            "created":1337490000,
            "id":1341568,
            "title":"A man in a straight relationship"
        },
        "111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Treat you like a baby",
                "Keep you in diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Susan has fallen in love with a man named Richard<br>\r\n<br>\r\nWill Susan and Richard treat you completely like a baby or just keep you in diapers?</span></div></span></div>",
            "created":1337749200,
            "id":1343250,
            "title":"A single man"
        },
        "1111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Baby boy",
                "Baby girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Richard treat you like a baby boy or baby girl?</span></div></span></div>",
            "created":1337749200,
            "id":1343265,
            "title":"Treat you like a baby"
        },
        "11111":{
            "author_id":"juniorm",
            "author_name":"juniorm",
            "choices":[
                "Lisa wins- her choice",
                "Chad wins- his choice"
            ],
            "content":"<div class=\"\"><div> <span>You hear your wife moaning in the other room, but all you can do is lie there, trapped in a crib in a big baby nursery, wearing nothing but a dirty diaper and an oversized baby bonnet. Your wife's moaning crescendos, soon accompanied by the low bass sound of your wife's new lover, and your new \"daddy.\" Soon your nursery door swings open, and there stands your beautiful wife lisa, in her bra and panties, and her massive, ex military ogre Chad, wearing nothin but his boxers.<br>\r\n<br>\r\n\"Aww, whats the matter, junior,\" says Chad, looming over your crib menacingly, \"Did baby make a stinky for mommy and daddy.\" They laugh at you and play rock paper scissor to see you will change you.</span></div></div>",
            "created":1497438540,
            "id":2335656,
            "title":"Baby boy"
        },
        "111112":{
            "choices":[
                "Watched it swing around, already a submissive, dumb baby ",
                "Watched only so you wouldn't be embrassed "
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, cmere Junior.\" Chad picked you up carefully by the armpits and carried you to the table while you suck your pacifier like a good boy. <br>\r\n\"Let's take care of that stinky, huh?\" He cooed as he undid your diaper, a mobile swung above your head and you </span></div></div>",
            "created":1507372980,
            "id":2397617,
            "title":"Chad wins- his choice"
        },
        "1111122":{
            "author_id":"juniorm",
            "author_name":"juniorm",
            "choices":[
                "Bath with Chad",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You lay there, focusing on the moble while this larger, stronger man proceeds to wipe your filthy bottom. The whole experience is degrading, but you have to lay there and take it or Chad will kick your ass again. Finally, the mess is cleaned off, but Chad stops before he replaces your diaper.<br>\r\n<br>\r\n\"Hey babe, I'm all sweat from fucking you. I better go clean myself off while you finish diapering the baby cuck.\"<br>\r\n<br>\r\n\"Or better yet, why dont you take him into the bath with you, i'll be some good \"father son\" bonding!\"</span></div></div>",
            "created":1507504200,
            "id":2398335,
            "title":"Watched only so you wouldn't be embrassed "
        },
        "1112":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Male clothes",
                "Sissy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Richard let you wear male clothes or make you a sissy?</span></div></span></div>",
            "created":1337749200,
            "id":1343261,
            "title":"Keep you in diapers"
        },
        "11121":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Gay sex",
                "Only straight sex"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will you be forced to perform sexual acts on Richard?</span></div></span></div>",
            "created":1337749200,
            "id":1343262,
            "title":"Male clothes"
        },
        "11122":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Gay sex",
                "Only straight sex"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will you be forced to perform sexual acts on Richard?</span></div></span></div>",
            "created":1337749200,
            "id":1343263,
            "title":"Sissy"
        },
        "111221":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Wear the outfit",
                "Refuse to wear the outfit"
            ],
            "content":"<div class=\"\"><div> <span>It started when your wife. Susan got a new job. It was her dream job but it meant relocating to the other side of the country. So you gave up your job and the two of you moved out here.<br>\r\n<br>\r\nSince then, you've not been able to find another job. Financially it's not been a problem. Susan is well paid and you live very comfortably on her salary. However It has left you feeling rather inadequate.<br>\r\n<br>\r\nAnd this isn't helping...<br>\r\n<br>\r\n\"You want me to wear that?\" you ask, looking at the outfit Susan has laid out on the bed for you. \"Why?\"<br>\r\n<br>\r\n\"It's a fantasy of mine.\" she says. \"Can't I be a little kinky?\"<br>\r\n<br>\r\nKinky is one thing. This is something else. You look down at the sexy french maid costume, Well sexy except for the fact that Susan has replaced the panties with a large disposable diaper.<br>\r\n<br>\r\n</span></div></div>",
            "created":1337749200,
            "id":1343276,
            "title":"Gay sex"
        },
        "1112211":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Let her wax your legs",
                "Refuse to be waxed"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay.\" you reluctantly agree and begin undressing. \"If this is what you want.\"<br>\r\n<br>\r\n\"It is.\" She helps you out of your clothes. \"Thankyou.\" Then once you are completely naked she directs you. \"Lay on the bed.\"<br>\r\n<br>\r\nYou do as you are told and she unfolds the diaper then slides it under your bottom. \"Good girl.\" she says as she pulls the front of the diaper up between your legs and fastens the tapes.<br>\r\n<br>\r\nShe then helps you up of the bed and dresses you in the res of the outfit.<br>\r\n<br>\r\n\"What now?\" you ask, looking at your reflection in the full-length mirror. The plastic diaper can be seen sticking out under your short skirt.<br>\r\n<br>\r\n\"I think the first thing we need to do is wax those legs.\" She says. \"I can't have my little sissy all hairy.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1338008400,
            "id":1345436,
            "title":"Wear the outfit"
        },
        "11122111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Lick her",
                "Don't lick her"
            ],
            "content":"<div class=\"\"><div> <span>You look at her, wondering how far she is going to take this fantasy but ultimately agree. \"Okay.\"<br>\r\n<br>\r\nShe lays a towel on the bed and tells you \"Lay down.\"<br>\r\n<br>\r\nYou do as you are told and she prepares the wax.<br>\r\n<br>\r\n\"Ow!\" you almost scream as she rips the first strip off.<br>\r\n<br>\r\n\"You really are a sissy.\" she teases. \"Us girls do this all the time.\"<br>\r\n<br>\r\nIt feels like a hours have passed before the last patch of hair is removed. By then you are almost in tears.<br>\r\n<br>\r\n\"All done.\" she declares, caressing your now-smooth legs. \"That wasn't so bad was it?\"<br>\r\n<br>\r\nYou just lay there, exhausted by the pain.<br>\r\n<br>\r\n\"Good girl.\" she says, rubbing your penis through the diaper. <br>\r\n<br>\r\nBefore long you can't help growing hard. You penis strains against the padding of the diaper.<br>\r\n<br>\r\n\"My little sissy likes this doesn't she.\" Susan smiles down at you but stops rubbing. \"But I think it's my turn first.\" <br>\r\n<br>\r\nShe stands and undresses. You grow harder watching her. <br>\r\n<br>\r\nWhen she is completely naked she helps you up off the bed and makes you kneel facing it. She then sits directly in front of you and spreads her legs. Pushing her crotch into your face. \"Lick me.\" she directs you.</span></div></div>",
            "created":1338094800,
            "id":1346558,
            "title":"Let her wax your legs"
        },
        "111221111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Play with yourself",
                "Keep your hands out of your diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You stick out your tongue and begin to lick her. She moans as you press against her clitoris.<br>\r\n<br>\r\nThis only makes you harder inside your diaper.</span></div></span></div>",
            "created":1344920400,
            "id":1404466,
            "title":"Lick her"
        },
        "1112211111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Lay on the bed",
                "Tell her you've had enough of this"
            ],
            "content":"<div class=\"\"><div> <span>As you lick her you slide your hand into the waistband of your diaper and take hold of your penis.<br>\r\n<br>\r\nAs she rocks her hips back and forth, you move your hand up and down the shaft. Finally as she orgasms, you begin to squirt into the absorbent padding.<br>\r\n<br>\r\nSusan pushes you back away from her groin and looks down at you, catching you with your hand still inside your diaper. \"Did I say you were allowed to play with yourself?\" she asks.<br>\r\n<br>\r\nYou just look away, guiltily.<br>\r\n<br>\r\nShe pulls you to your feet and inspects the diaper. \"It looks like you need a change too. Lay on the bed while I get you a clean diaper.\"</span></div></div>",
            "created":1345006800,
            "id":1405057,
            "title":"Play with yourself"
        },
        "11122111111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Ask what the click was.",
                "Ask what she wants you to do now."
            ],
            "content":"<div class=\"\"><div> <span>You decide to keep playing along and lay down on the bed.<br>\r\n<br>\r\nSusan returns with another diaper and a package of baby-wipes. She moves the skirts of the dress out of the way then untapes your current diaper and pulls it open between your spread legs.<br>\r\n<br>\r\n\"It looks like you won't be any more fun tonight.\" she observes, poking your flaccid penis. She cleans you with the wipes. The are cold against your skin. Then she replaces your diaper with the new one.<br>\r\n<br>\r\nShe helps you up then pulls the dress off over your head and replaces it with a short pink nightie. Then from a drawer, she takes out a large pair of translucent pink plastic pants.<br>\r\n<br>\r\n\"What are they for?\" you ask as she pulls them up your legs.<br>\r\n<br>\r\n\"A little extra protection.\" she says. \"For the night.\"<br>\r\n<br>\r\nAs she settles them into place around your waist you hear a tiny 'click'.</span></div></div>",
            "created":1345006800,
            "id":1405059,
            "title":"Lay on the bed"
        },
        "111221111111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Go with her",
                "Demand that she unlock the plastic pants"
            ],
            "content":"<div class=\"\"><div> <span>\"What was that sound?\" you ask, looking around.<br>\r\n<br>\r\n\"Just your plastic panties locking.\" she says. \"To make sure you don't go taking them off while I'm not watching.\"<br>\r\n<br>\r\nYou try to pull the plastic panties off but she's telling the truth.<br>\r\n<br>\r\n\"Okay.\" she says. \"I think it's time you went to bed.\" Strangely, she leads you out of the bedroom.<br>\r\n</span></div></div>",
            "created":1346821200,
            "id":1421375,
            "title":"Ask what the click was."
        },
        "1112211112":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Accept her help",
                "Wait"
            ],
            "content":"<div class=\"\"><div> <span>As you lick her, Susan rocks her hips back and forth. As she get more excited, she presses your face into her, making it hard to breath. Finally, she orgasms and releases you.<br>\r\n<br>\r\nYou fall backward onto your padded bottom, gasping for air.<br>\r\n<br>\r\n\"Good girl.\" she say's smiling down at you. \"I suppose you want your turn.\"<br>\r\n<br>\r\nYou nod, feeling your penis strain against the diaper.<br>\r\n<br>\r\n\"You have do do one more thing for me first.\" she says. \"Use your diaper.\"<br>\r\n<br>\r\n\"But...\" you don't know how to respond to that. \"I don't even need to pee at the moment.\"<br>\r\n<br>\r\n\"I can help you with that if you like.\" she says. \"Or I guess we can wait. You'll have to eventually.\"</span></div></div>",
            "created":1376283600,
            "id":1644725,
            "title":"Keep your hands out of your diaper"
        },
        "11122111121":{
            "author_id":"kem25",
            "author_name":"BillS",
            "choices":[
                "go to a friends house to pick up something",
                "wait for the door"
            ],
            "content":"<div class=\"\"><div> <span>Susan gets a bucket of cold water and places your hand in it.<br>\r\n<br>\r\nAfter 45 seconds you start to feel the urge to go.  You take a good deep breath, relax and let the pee rush out and into the diaper.<br>\r\n<br>\r\nSusan just looks at you and can tell that you are done.<br>\r\n<br>\r\n\"Ok, lay back down, my little baby.\"  she says.  \"I need to get my little girlie all clean.\"<br>\r\n<br>\r\nYou lay back down and are still a little unsettled about this girlie baby talk but you try to get into it.<br>\r\n<br>\r\nSusan hikes up your skirt and undoes your diaper.  She take it off and throws the used diaper away.<br>\r\n<br>\r\n\"Hmm, something doesn't look right. I know what it is.\"  <br>\r\n<br>\r\nShe walks away and comes back slipping a towel under you.<br>\r\n<br>\r\n\"Your legs are hair free and you never grew chest or arm hair so you are hair free there too.  That is just like a good girl.  But you do have hair on your little wee-wee and that just isn't right for a wittle baby girl.\"<br>\r\n<br>\r\nBefore you have time to protest, Susan is putting wax on your little dick and pulling off all the hair in your nether regions.  Soon she is slathering you with lotion to make it feel nice.<br>\r\n<br>\r\n\"There you go.  You look just like a baby with no hair there.  And with your size, you can certainly pass for a little boy and, inside a diaper, a little girl.\"<br>\r\n<br>\r\nSusan had never mentioned that your dick was small before so you guessed it was part of the game.  Certainly, you were not big, 2 inches soft, 4 inches (maybe) hard.<br>\r\n<br>\r\nSusan then finished putting on your diaper.  \"See how nice and flat it lays?\" she asks you<br>\r\n<br>\r\nShe pulls down the rest of the maid outfit.<br>\r\n<br>\r\nWe need to...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1416891600,
            "id":1893493,
            "title":"Accept her help"
        },
        "1112212":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Watch Susan and Richard have sex",
                "Give Richard oral sex"
            ],
            "content":"<div class=\"\"><div> <span>\"No\" you decide finally. \"I'm not going to wear that.\"<br>\r\n<br>\r\n\"Fine. We'll do it the hard way.\" she says. \"You can come out.\"<br>\r\n<br>\r\nThe door to your wardrobe opens and out steps a man.<br>\r\n<br>\r\n\"What the hell is going on?\" you demand.<br>\r\n<br>\r\n\"Richard and I are lovers.\" Susan explains as Richard grabs your arms.<br>\r\n<br>\r\nYou struggle against him but find him too strong for you as Susan undresses you.<br>\r\n<br>\r\n\"He is moving in today.\" Susan continues. \"You will have the spare room.\"<br>\r\n<br>\r\n\"What makes you think I'd stay with you?\" you ask.<br>\r\n<br>\r\n\"Richard is the head psychiatrist at the local mental hospital.\" she explains as she finished stripping you naked. \"He's already filled out the paperwork to have you declared insane.\"<br>\r\n<br>\r\n\"Lucky for you I have generously offered to provide in-home care.\" Richard tells you, forcing you down onto the bed. \"If not for that you'd have to be committed.\"<br>\r\n<br>\r\n\"And if you don't cooperate.\" Susan warns, sliding the diaper under your bottom. \"You will be.\"<br>\r\n<br>\r\n\"Why? you ask, as she tapes you into the diaper. \"Why not just divorce me?\"<br>\r\n<br>\r\n\"Three reasons.\" Susan says, dressing you in the maid outfit. \"First, I don't want to go through the family court and lose half of this house Second, I still love you and want you in my life. And Third, Richard has a thing for sissy diapered men, so you can help me keep him satisfied.\"<br>\r\n<br>\r\nRichard is still holding you and you can feel his cock growing hard in his pants.<br>\r\n<br>\r\n\"Now you have a choice Danielle.\" Richard tells you. \"You can either sit in the corner and watch Susan and I fuck or you can give me a blowjob.\"</span></div></div>",
            "created":1337749200,
            "id":1343298,
            "title":"Refuse to wear the outfit"
        },
        "11122121":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Stay",
                "Leave the room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'm not giving you a blowjob.\" you state.<br>\r\n<br>\r\n\"Okay.\" He says. \"Then be a good girl and sit in that corner while we have sex.\"<br>\r\n<br>\r\nHe and Susan begin to undress each other excitedly.</span></div></span></div>",
            "created":1338354000,
            "id":1348225,
            "title":"Watch Susan and Richard have sex"
        },
        "11122122":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Bite him",
                "Make him cum"
            ],
            "content":"<div class=\"\"><div> <span>You can't bear to watch your wife gave sex with another man so you reluctantly decide. \"I'll give you a blowjob.\"<br>\r\n<br>\r\nRichard smiles and drop his pants before sitting on the edge of the bed and spreading his legs. \"Come here.\" His penis stands fully erect in anticipation.<br>\r\n<br>\r\nYou kneel in front of him and timidly bring you mouth up to his member. He pulls you forward, forcing himself between your lips. It's disgusting having another man's penis in your mouth.</span></div></div>",
            "created":1337749200,
            "id":1343305,
            "title":"Give Richard oral sex"
        },
        "111221222":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Swallow",
                "Spit"
            ],
            "content":"<div class=\"\"><div> <span>You move your tongue around over the head of his penis and he begins to move his hips back and forward until finally his member starts to squirt semen into your mouth.<br>\r\n<br>\r\nHe keeps himself inside you until he has finished then says. \"Now swallow like a good girl.\"</span></div></div>",
            "created":1337749200,
            "id":1343306,
            "title":"Make him cum"
        },
        "1112212221":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Sleep in your own bed",
                "Sleep with Susan and Richard"
            ],
            "content":"<div class=\"\"><div> <span>You do as you are told and gulp down the thick fluid.<br>\r\n<br>\r\n\"You are such a good girl I think you deserve a reward.\" Richard says, helping you up off the floor and laying you on the bed.<br>\r\n<br>\r\nHe then places his hand on the crotch of your diaper and begins rubbing your penis through it. Despite your humiliation and disgust you begin to grow hard. He squeezes you and rubs faster until you finally cum in your diaper and let out a little moan.<br>\r\n<br>\r\nRichard smiles down at you, happy with his work. You look away, too ashamed to make eye contact.<br>\r\n<br>\r\n\"I think Danielle needs some rest now.\" Susan says. \"Do you want to sleep with Richard and me tonight or in your own bed?\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1337749200,
            "id":1343329,
            "title":"Swallow"
        },
        "11122122212":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Try to get out of bed",
                "Stay where you are"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll stay here.\" you decide. You don't like the idea of them being alone in bed together. You not to think about the fact that they probably have been many times already.<br>\r\n<br>\r\n\"Okay.\" She says beginning to undress you. \"Let's hang up your pretty dress so you don't get it all creased.\"<br>\r\n<br>\r\nShe strips you down to your diaper then helps you under the covers. Next she and Richard take off all of their clothes and get into bed with you naked, Richard on one side and her on the other.<br>\r\n<br>\r\n\"I think you should go over the rules honey.\" Richard tells Susan as he squeezes your padded bottom.<br>\r\n<br>\r\n\"From now on your name is Danielle. If anyone asks your name, that is what you will tell them.\" Susan tells you. \"You will use your diapers. The toilet is off limits to you. And finally, you will not change your own diapers or dress yourself. Richard and I will choose your clothes.\"<br>\r\n<br>\r\n\"If you break any of these rules yo will be punished.\" Richard says. With that he turns off the light. \"Goodnight Susan, Goodnight Danielle.\"<br>\r\n<br>\r\n\"Goodnight Richard.\" Susan says. \"Goodnight Danielle.\"<br>\r\n<br>\r\nYou turn away from Richard but this gives him the opportunity to move his body against your back and pull you into a hug.<br>\r\n<br>\r\nUnable to sleep, you lay awake wondering how you will ever get out of this mess. <br>\r\n<br>\r\nA few hours later, you begin to feel the urge to pee. You consider getting up to use the toilet while Susan and Richard are asleep but Richard's arms are still wrapped around you.<br>\r\n<br>\r\n</span></div></div>",
            "created":1337835600,
            "id":1344666,
            "title":"Sleep with Susan and Richard"
        },
        "111221222122":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Use the diaper",
                "Keep holding on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You lay there, dreading the inevitable. The pressure builds over the next hour and starts to become too much.</span></div></span></div>",
            "created":1337835600,
            "id":1344672,
            "title":"Stay where you are"
        },
        "1112212221222":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Get up and find Susan",
                "Stay in bed"
            ],
            "content":"<div class=\"\"><div> <span>You begin to wriggle around, trying to hold on. <br>\r\n<br>\r\nThis results in you rubbing your diapered bottom against Richard's penis. You feel it begin to grow hard and Richard wakes up.<br>\r\n<br>\r\nWithout a word, he pulls down the back of your diaper and rubs the tip of his penis against your anus. You gasp as he pushes himself inside and the surprise makes you finally wet yourself.<br>\r\n<br>\r\nAs you soak the front of your diaper he thrusts, moving his penis in and out. It hurts but in a strange way it also feels pleasurable and you grow a little hard inside your wet diaper.<br>\r\n<br>\r\nHe finally climaxes inside you and withdraws, pulling your diaper back up into place. You feel the cum dribble slowly out of your bottom as you finally fall asleep from exhaustion.<br>\r\n<br>\r\nWhen you wake up you are alone in bed. Your soggy diaper is rather uncomfortable.</span></div></div>",
            "created":1337835600,
            "id":1344680,
            "title":"Keep holding on"
        },
        "113":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Treat you like a baby",
                "Keep you in diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Susan is actually in a secret lesbian relationship with a woman named Jennifer.<br>\r\n<br>\r\nWill Susan and Jennifer treat you completely like a baby or just keep you in diapers?<br>\r\n</span></div></span></div>",
            "created":1337576400,
            "id":1341612,
            "title":"A single woman"
        },
        "1131":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Baby boy",
                "Baby girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Jennifer treat you like a baby boy or baby girl?</span></div></span></div>",
            "created":1337576400,
            "id":1341613,
            "title":"Treat you like a baby"
        },
        "11312":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Have lunch with her",
                "Decline the offer"
            ],
            "content":"<div class=\"\"><div> <span>It started when your wife. Susan got a new job. It was her dream job but it meant relocating to the other side of the country. So you gave up your job and the two of you moved out here.<br>\r\n<br>\r\nSince then, you've not been able to find another job. Financially it's not been a problem. Susan is well paid and you live very comfortably on her salary. However It has left you feeling rather inadequate.<br>\r\n<br>\r\nIt was most acute when you did the weekly grocery shopping. Being the one not working, many of the traditionally female chores fell to you. You can usually put it out of your mind doing those chores at home, but here at the supermarket it is clear that you don't wear the pants in your marriage. The other shoppers are almost all women, housewives doing the shopping while their husbands are at work, earning money to support their families.<br>\r\n<br>\r\n\"Excuse me.\" Your self pity is interrupted by an attractive woman. \"Could you please help me reach that box?\" She points at a package on the top shelf.<br>\r\n<br>\r\n\"Oh.\" you say. \"Okay.\" and reach up to get it for her.<br>\r\n<br>\r\n\"Thanks.\" she says. \"I'm Jennifer.\"<br>\r\n<br>\r\n\"No problem.\" you say. \"I'm Daniel.\"<br>\r\n<br>\r\nYou chat a while as you both finish your shopping. She seems really nice.<br>\r\n<br>\r\n\"Well it was nice meeting you Jennifer.\" You say after going through the checkouts. \"Maybe we'll run into each other again.\"<br>\r\n<br>\r\n\"Have you had lunch?\" she asks. \"If not then you're welcome to join me.\"</span></div></div>",
            "created":1337835600,
            "id":1344194,
            "title":"Baby girl"
        },
        "113121":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Tell her to stop",
                "Kiss her"
            ],
            "content":"<div class=\"\"><div> <span>\"That would be nice.\" You agree. You tell yourself that this is innocent. It's just lunch and nothing is going to happen. However, you know that you're doing this because it makes you feel better about yourself to have a woman's attention.<br>\r\n<br>\r\nYou follow her back to her place and she makes lunch. As you eat it becomes more and more obvious that she is flirting with you. This gives your self-esteem an even bigger boost.<br>\r\n<br>\r\nWith the meal finished you move to her sofa. She places her hand on your leg and leans in to kiss you.</span></div></div>",
            "created":1337835600,
            "id":1344685,
            "title":"Have lunch with her"
        },
        "1131211":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Stay and have sex with her so she won't lie to your wife.  ",
                "Refuse and explain to your wife what actually happened.  "
            ],
            "content":"<div class=\"\"><div> <span>You back away, \"Hey - hey I'm flattered you are attracted to me but I'm married.\"<br>\r\n<br>\r\nShe smirks at you, \"Is that so?  Married men don't just go home with women they just met.  And unless you play along I'll be telling your wife that you've been cheating on her with me.  Who is she going to believe?\"<br>\r\n<br>\r\nYou were shocked - you loved your wife you didn't want to lose her!  But the idea of having sex with this woman so you wouldn't lose your wife was a bit crazy.  <br>\r\n<br>\r\nWhat were you going to do?  </span></div></div>",
            "created":1338094800,
            "id":1346337,
            "title":"Tell her to stop"
        },
        "1131212":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Give her your pants",
                "Go home"
            ],
            "content":"<div class=\"\"><div> <span>You know it's wrong but this feels too good. You kiss her and before long your are making out.<br>\r\n<br>\r\nYour penis quickly grows hard and stains against your underwear, demanding to be released. Jennifer notices and smiles then moves her hand down to caress it.<br>\r\n<br>\r\nIt's suddenly too much and you begin ejaculating in your pants. With her hand down there, Jennifer knows exactly what just happened. She giggles and looks down to see the wet spot appear in the crotch of your pants.<br>\r\n<br>\r\n\"I'm sorry.\" you stutter. \"I...\"<br>\r\n<br>\r\n\"Don't worry.\" She says. \"These things happen.\"<br>\r\n<br>\r\n\"What am I going to do about my pants?\" you ask, mostly to yourself.<br>\r\n<br>\r\n\"Take them off and I'll wash them for you.\" she offers.</span></div></div>",
            "created":1338008400,
            "id":1345382,
            "title":"Kiss her"
        },
        "11312121":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Put on the diaper",
                "Try to get your clothes back"
            ],
            "content":"<div class=\"\"><div> <span>\"Thanks.\" you say. \"Um, do you have something I could wear?\"<br>\r\n<br>\r\n\"Why so shy now?\" she teases. \"Go undress in the bathroom, I'll find you something.\"<br>\r\n<br>\r\nYou shut yourself in her bathroom and remove your pants and underwear.<br>\r\n<br>\r\nA few minutes later Jennifer knocks on the door. You open it a little and pass you pants out. She takes them and in return hands you something made of soft white plastic.<br>\r\n<br>\r\n\"What the hell is this?\" you demand, looking at the item. You have to unfold it before yo realise what you're looking at. \"A diaper? You expect me to wear this?\"<br>\r\n<br>\r\n\"You did just have an accident in your pants.\" she teases. \"And if you don't wear it I'll tell your wife about our little make-out session.\"</span></div></div>",
            "created":1338008400,
            "id":1345434,
            "title":"Give her your pants"
        },
        "113121211":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Go to the toilet",
                "Stay where you are"
            ],
            "content":"<div class=\"\"><div> <span>\"No.\" you say. \"Please don't tell her. I'll do anything.\"<br>\r\n<br>\r\n\"Put on the diaper.\" she tells you again. \"I'll put your pants in the wash.\"<br>\r\n<br>\r\nYou examine the diaper for a moment and after failing a few times to put it on while standing, you lay it on the floor and sit on it. You pull the front up between your legs and fasten the tapes.<br>\r\n<br>\r\nReturning to your feet, you feel the padding between your legs. You catch your reflection in the mirror and almost laugh.<br>\r\n<br>\r\n\"Do you need any help in there?\" Jennifer calls through the door.<br>\r\n<br>\r\n\"No.\" you reply.<br>\r\n<br>\r\n\"Then come out and let me have a look at you.\" she orders.<br>\r\n<br>\r\nYou open the door and the first thing you see is a flash of light. Jennifer is holding a camera. <br>\r\n<br>\r\n\"Hey!\" you complain, trying to pull your shirt down to hide the diaper. \"What are you doing that for.\"<br>\r\n<br>\r\n\"Just making sure you do what you're told.\" she says, snapping a few more photos. \"I'm sure you wouldn't want these photos getting around.\"<br>\r\n<br>\r\n\"What do you want from me?\" you ask.<br>\r\n<br>\r\n\"Well first I want you to take that shirt off.\" She says. You offer no resistance as she pulls it off over your head. Then she shoves a pacifier between your lips. \"And then I want you to keep that in your mouth until I take it out.\"<br>\r\n<br>\r\nShe takes a few more photos then directs. \"Crawl back to the living room.\" You get down on your hands and knees and she gets a few more shots as you make your way back down the hallway.<br>\r\n<br>\r\n\"Now be a good baby and sit here until your clothes are ready.\" She turns on the TV to some children's show.<br>\r\n<br>\r\nAs you wait for the washing machine to finish, you become aware of a growing need to pee.</span></div></div>",
            "created":1338008400,
            "id":1345456,
            "title":"Put on the diaper"
        },
        "1131212111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Use the diaper",
                "Hold on"
            ],
            "content":"<div class=\"\"><div> <span>You get up and make your way toward the toilet. You don't get far.<br>\r\n<br>\r\n\"Where do you think you're going?\" Jennifer catches you. \"I told you to sit in the living room.\"<br>\r\n<br>\r\nYou take out the pacifier and say. \"I have to use the toilet.\"<br>\r\n<br>\r\n\"I also told you to keep that in your mouth.\" she tells you. \"You are a bad baby and you need to be punished.\" She pulls you by the hand back to the sofa where she puts you across her knee. \"You need to learn to do as mommy tells you.\" she pulls down the seat of your diaper and begins smacking your bare bottom.<br>\r\n<br>\r\n\"Ow.\" you complain but she hits you again. With each whack, your bottom becomes more sensitive until the pain is unbearable and you actually begin to sob, begging her to stop.<br>\r\n<br>\r\nShe pauses to ask \"Are you going to be a good baby?\"<br>\r\n<br>\r\n\"Yes.\" you say.<br>\r\n<br>\r\n\"Yes who?\" she asks.<br>\r\n<br>\r\n\"Yes mommy.\" you say, feeling absolutely pathetic.<br>\r\n<br>\r\nShe pulls the back of your diaper back up and slides you off her lap and back onto the floor. She then picks up the pacifier and replaces it in your mouth.<br>\r\n<br>\r\nThe pressure is still building on your bladder but it's obvious that she won't let you go to the toilet. Does she expect you to use the diaper?</span></div></div>",
            "created":1338008400,
            "id":1345468,
            "title":"Go to the toilet"
        },
        "11312121111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Say yes",
                "Say no"
            ],
            "content":"<div class=\"\"><div> <span>She clearly wants you to humiliate yourself. Maybe wetting yourself will satisfy her and she'll let you go.<br>\r\n<br>\r\nCautiously, you release a little urine into the diaper. It is quickly absorbed by the padding so you keep wetting until you've emptied your entire bladder.<br>\r\n<br>\r\nThis leaves the diaper thicker, heavier and much less soft. Looking down you can see it has become discoloured, It would be obvious to anyone that it is very wet.<br>\r\n<br>\r\nYou hear the washing machine finish and Jennifer doing something in the laundry. <br>\r\n<br>\r\n \"I've put your pants in the drier.\" She explains as she returns to the living room. \"Oh, it looks like you've wet yourself again.\" She pulls the pacifier out of your mouth and asks. \"Do you want mommy to change you?\"</span></div></div>",
            "created":1338008400,
            "id":1345477,
            "title":"Use the diaper"
        },
        "113121211111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Go inside",
                "Find somewhere else to change"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes Mommy.\" you say, hopefully giving her what she wants.<br>\r\n<br>\r\n\"Okay.\" she smiles, putting the pacifier back in place. \"Wait here while I go her you a nice dry diaper.\"<br>\r\n<br>\r\nShe returns a few minutes later with a large bag. From it she removes a plastic mat, a box of baby wipes and another diaper. \"Lay down.\" she directs.<br>\r\n<br>\r\nYou lay on the mat and she untapes your diaper and pulls it open before wiping your privates clean. She then rolls up the wet diaper and replaces it with the new one which she quickly tapes you into. \"There.\" she says. \"All dry.\"<br>\r\n<br>\r\nThe dryer finally finishes and Jennifer brings you your clothes. \"Do you need another diaper change before I send you home?\" she asks.<br>\r\n<br>\r\nYou shake your head.<br>\r\n<br>\r\nShe pulls the shirt back on over your head then holds out the pants for you to step into.<br>\r\n<br>\r\n\"Wait.\" you say, taking the pacifier out. \"I've still got this diaper on.\"<br>\r\n<br>\r\n\"I didn't say you could take your pacifier out.\" she looks at you sternly. \"Do you want another spanking?\"<br>\r\n<br>\r\nYou shake you head and put the pacifier back in. Then you step into the pants and let her pull them up over your diaper.<br>\r\n<br>\r\nSo you leave her place, wearing a diaper under your pants and drive home. <br>\r\n<br>\r\nYou panic when you arrive and find Susan's car parked in the driveway.<br>\r\n<br>\r\n</span></div></div>",
            "created":1338008400,
            "id":1345498,
            "title":"Say yes"
        },
        "113121211112":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Go inside",
                "Find somewhere else to change"
            ],
            "content":"<div class=\"\"><div> <span>\"No.\" you shake your head. Having this woman change your diaper would be too much.<br>\r\n<br>\r\n\"Suit yourself.\" she says putting the pacifier back in your mouth. \"Stay in your soggy diaper.\"<br>\r\n<br>\r\nThe drier finally finishes and Jennifer brings your pants and shirt back. She pulls the shirt back on over your head then holds out the pants for you to step into.<br>\r\n<br>\r\n\"Wait.\" you say, taking the pacifier out. \"I've still got this diaper on.\"<br>\r\n<br>\r\n\"I didn't say you could take your pacifier out.\" she looks at you sternly. \"Do you want another spanking?\"<br>\r\n<br>\r\nYou shake you head and put the pacifier back in. Then you step into the pants and let her pull them up over your soggy diaper.<br>\r\n<br>\r\nSo you leave her place, wearing a wet diaper and drive home.<br>\r\n<br>\r\nYou panic when you arrive and find Susan's car parked in the driveway.</span></div></div>",
            "created":1338008400,
            "id":1345484,
            "title":"Say no"
        },
        "1131212111121":{
            "author_id":"kayledafox",
            "author_name":"Kayle Storm",
            "choices":[
                "Tell the truth",
                "Try to lie your way out of it"
            ],
            "content":"<div class=\"\"><div> <span>You stay in the car for a few long minutes, the wet diaper squishing every time you move.  You see the shades in the living room move, and know that Susan knows you're home.  Finally, your heart pounding, you get out of the car and pick up the bag of groceries from the back seat.  You make your way to the door, waddling slightly as the soaked padding wads up in your groin.  Susan opens the door as you approach, a strange look on her face.  \"Where have you been?  I was worried!\". Her nose wrinkles slightly.  \"And why do you smell like piss?\"</span></div></div>",
            "created":1594689300,
            "id":2868019,
            "title":"Go inside"
        },
        "1131212112":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Tell Jennifer that you need to use the toilet",
                "Keep holding on"
            ],
            "content":"<div class=\"\"><div> <span>Jennifer told you to sit here. You don't want to piss her off.<br>\r\n<br>\r\nBy the time you hear the washing machine finish you are growing desperate. But you tell yourself that you can hold on for a couple more minutes. Jennifer will bring your pants and then you can use the toilet.<br>\r\n<br>\r\n\"I'll just put your pants in the drier.\" Jennifer informs you, heading back to the laundry.<br>\r\n<br>\r\n\"Damn\" you say to yourself. You forgot that your pants would still be wet.</span></div></div>",
            "created":1346734800,
            "id":1420707,
            "title":"Stay where you are"
        },
        "113122":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Find some \"protection\"",
                "Refuse to consider wearing diapers"
            ],
            "content":"<div class=\"\"><div> <span>\"No. Sorry.\" you decline the offer. \"I'm married.\"<br>\r\n<br>\r\n\"I know.\" she says. \"I saw the ring. I really was only offering lunch.\"<br>\r\n<br>\r\n\"Oh.\" you try to recover. \"I didn't mean to imply that...\"<br>\r\n<br>\r\n\"Don't worry about it.\" she smiles. \"Well, See you later.\"<br>\r\n<br>\r\nYou say goodbye and head home.<br>\r\n<br>\r\nJennifer leaves an impression but the significance of this encounter will not become apparent for a few weeks.<br>\r\n<br>\r\nOne morning you wake up and feel something wrong. Your bottom feels cold and wet. You pull back the covers and discover that you've wet the bed.<br>\r\n<br>\r\n\"What's wrong Brett?\" Susan wakes up. \"Oh. Did you...\"<br>\r\n<br>\r\nYou blush and nod. You feel so childish, having an accident like this.<br>\r\n<br>\r\n\"Don't worry honey.\" she tries to reassure you. \"Go have a shower and I'll take care of this.\"<br>\r\n<br>\r\nYou shower and return to the bedroom to find that the bed has been stripped. However, a large, humiliating, wet mark remains on the mattress. <br>\r\n<br>\r\nSusan makes no mention of your accident and you try to put it out of your mind until a few days later when it happens again.<br>\r\n<br>\r\n\"I think you should consider buying some protection.\" Susan suggests over breakfast.<br>\r\n<br>\r\n\"Like diapers?\" you ask, trying your best to indicate how ridiculous the idea is through your tone.<br>\r\n<br>\r\n\"Just look at what's available.\" she insists. \"I don't like waking up in a puddle.\"</span></div></div>",
            "created":1338094800,
            "id":1346169,
            "title":"Decline the offer"
        },
        "1131221":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Tell her what you need",
                "Tell her you're fine"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay.\" you agree. \"I'll look today.\"<br>\r\n<br>\r\n\"Thank you honey.\" she smiles at you. \"I know this must be embarrassing for you.\"<br>\r\n<br>\r\nSo while she is at work you drive to a pharmacy. There is one at your local shopping centre but you are worried that someone you know might see you so you choose one a little further away.<br>\r\n<br>\r\n\"Can I help you?\" a young woman asks as you look around nervously.</span></div></div>",
            "created":1338267600,
            "id":1347477,
            "title":"Find some \"protection\""
        },
        "11312211":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Go with her",
                "Turn the TV on"
            ],
            "content":"<div class=\"\"><div> <span>\"Umm.\" you say, trying not to sound nervous. \"I'm looking for something to help with bed-wetting.\"<br>\r\n<br>\r\n\"And how old is the child?\" she asks.<br>\r\n<br>\r\n\"No. um.\" you blush. \"It's for me.\"<br>\r\n<br>\r\n\"Oh.\" she says. \"I'm sorry. The adult incontinence products are over here.\" she leads you over to a shelf at the back of the store. \"Now, how heavily do you wet?\"<br>\r\n<br>\r\nYou blush at the question. \"Um... I...\"<br>\r\n<br>\r\n\"Maybe you should just go for maximum protection.\" she says, handing you a package. \"If you're only wearing them in bed you don't have to worry about them being hidden.<br>\r\n<br>\r\nYou purchase the package and thank the woman as you leave.<br>\r\n<br>\r\n\"Did you find some protection?\" Susan asks after dinner.<br>\r\n<br>\r\n\"Yeah.\" you nod. \"They are in the wardrobe.\"<br>\r\n<br>\r\n\"Let's go have a look.\" she says, strangely enthusiastic. She stands and heads toward the bedroom.</span></div></div>",
            "created":1338267600,
            "id":1347500,
            "title":"Tell her what you need"
        },
        "11312212":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Pick up something from the incontinence aisle",
                "Just leave"
            ],
            "content":"<div class=\"\"><div> <span>\"No.\" you say a little to defensively. \"Thank you. I'm fine.\"<br>\r\n<br>\r\n\"Okay.\" she says, leaving, \"Let me know if you need any assistance.\"<br>\r\n<br>\r\nYou eventually find the incontinence products but are you brave enough to buy them. The woman is watching you from the counter. If you don't do something soon you're going to look weird standing here.</span></div></div>",
            "created":1339131600,
            "id":1355344,
            "title":"Tell her you're fine"
        },
        "113122122":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Follow her to the room",
                "Stay in the living room"
            ],
            "content":"<div class=\"\"><div> <span>You just turn and walk out, trying not to look at the woman. You worry that it might look like you're stealing something but you make it to your car without being tackled by security.<br>\r\n<br>\r\n\"Did you find some protection?\" Susan asks, that night after dinner.<br>\r\n<br>\r\n\"Um... No.\" you admit. \"I went to the store but...Um...I sort of chickened out.\"<br>\r\n<br>\r\n\"It looks like I'll have to do this myself.\" she says. \"I'll go in my lunch break tomorrow.\"<br>\r\n<br>\r\nThe following evening she arrives home from work carrying a couple of large shopping bags. You can guess the contents.<br>\r\n<br>\r\nShe greets you with a kiss then carries the bags to the bedroom.</span></div></div>",
            "created":1339131600,
            "id":1355361,
            "title":"Just leave"
        },
        "1131221221":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Try on a diaper now",
                "Wait until later"
            ],
            "content":"<div class=\"\"><div> <span>You follow her into the bedroom where she starts unpacking the bags. First comes a colourful plastic mat. Then baby powder and wipes. Next come a number of things that looks like towels.<br>\r\n<br>\r\n\"Cloth diapers?\" you ask.<br>\r\n<br>\r\n\"The woman at the store recommended them.\" she explains as she finishes unpacking the bulky diapers. \"These we can wash and re-use unlike the disposables which get thrown away even if you don't use them.\" She finishes unpacking by pulling out a few pairs of translucent plastic pants and a package of large safety-pins.<br>\r\n<br>\r\n\"Do you want to try one on now?\" she asks.<br>\r\n<br>\r\n\"What?\" you ask. \"It's hours before we go to bed. We haven't even had dinner yet.\"<br>\r\n<br>\r\n\"I just thought, since we're here, we could take care of it now and not have to worry about it when we just want to get into bed.\" She explains.</span></div></div>",
            "created":1339131600,
            "id":1355373,
            "title":"Follow her to the room"
        },
        "11312212211":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Diaper yourself",
                "Let her do it"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay.\" you agree. She's been very patient with your bedwetting and you're going to have to get into a diaper eventually anyway.<br>\r\n<br>\r\n\"Good.\" she says. \"Undress and lay on the bed.\"<br>\r\n<br>\r\n\"I think I can handle this myself.\" you say.<br>\r\n<br>\r\n\"Are you sure?\" she asks. \"If you don't put them on right they'll leak.\"</span></div></div>",
            "created":1345006800,
            "id":1405060,
            "title":"Try on a diaper now"
        },
        "113122122112":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Accept he help",
                "Just deal with the diaper yourself"
            ],
            "content":"<div class=\"\"><div> <span>\"If you say so.\" You begin undressing.<br>\r\n<br>\r\nAs you remove your clothes she folds the diaper on the bed.<br>\r\n<br>\r\nOnce you are completely naked, you reluctantly lay down with your bottom on the thick padding.<br>\r\n<br>\r\nSusan then sprinkles baby powder over your groin.<br>\r\n<br>\r\n\"Is that really necessary?\" you ask as smell the babyish scent.<br>\r\n<br>\r\n\"It'll keep your skin dry.\" She explains, rubbing some into your bottom. \"So you don't get diaper rash.\"<br>\r\n<br>\r\nShe then pulls the front of the diaper up firmly between your legs and fastens it with the pins.<br>\r\n<br>\r\nNext she takes a pair of baby-blue plastic pants and pulls them on over your feet and up your legs. \"Lift up.\" she directs then pulls them into place over your thickly padded bottom.<br>\r\n<br>\r\nAs Susan helps you up off the bed you realise that the thick diaper pushes your legs apart, making it impossible to stand or walk normally.<br>\r\n<br>\r\n\"Okay.\" Susan says, leading you back out of the room \"You're all ready.\"<br>\r\n<br>\r\n\"Wait.\" you complain. \"What about my pajamas, I can't go around in just a diaper.\"<br>\r\n<br>\r\n\"None of your pants will fit over that.\" she points out. \"And I'm the only one who is going to be seeing you.\"<br>\r\n<br>\r\n\"Fine.\" you say, and waddle out of the room behind her.<br>\r\n<br>\r\nAfter dinner you move to the sofa and start watching a movie. You are only 10 minutes in when your stomach starts feeling uncomfortable. It soon becomes apparent that you're going to need to use the toilet.<br>\r\n<br>\r\nYou get up and start toward the bathroom.<br>\r\n<br>\r\n\"Where are you going?\" Susan questions you.<br>\r\n<br>\r\n\"Dinner isn't agreeing with me.\" you explain. \"I need to use the toilet.\"<br>\r\n<br>\r\n\"Okay. Just a minute.\" she says, getting up. \"Let me help you with your diaper.\"</span></div></div>",
            "created":1351486800,
            "id":1456046,
            "title":"Let her do it"
        },
        "1131221221122":{
            "author_id":"kayledafox",
            "author_name":"Kayle Storm",
            "choices":[
                "Do as She Tells You",
                "Insist you can clean up yourself",
                "Tell Her It's Not Your fault"
            ],
            "content":"<div class=\"\"><div> <span>You shake your head vehemently.  \"No, I can do it.\" <br>\r\n<br>\r\nSusan shrugged.  \"Okay.  Just let me know if you need help.\"<br>\r\n<br>\r\nYou nod and begin to waddle toward the bathroom.  By the time you get half way there, your stomach is doing flips.  You quicken your pace, your bowels feeling as if they're turning to liquid.  As you cross the threshold into the bathroom, you feel a hot trickle of liquid.  You begin to struggle with the diaper, your brain enveloped in a blanket of panic.  Before you can unclip the garment, your bowels release into the seat of the diaper.  You let out a small, whimpering groan as the seat of your diaper sags.  By the time your gut is empty, a hot, rank stench fills the air, and you feel hot tears of shame running down your face.  If only you had asked Susan for help, you may have made it in time.  You turn to close the bathroom door so you can undress and shower, only to see Susan standing there.<br>\r\n<br>\r\n\"You poor, pathetic thing.  First wetting the bed, and now messing yourself.\". You look down at the floor, humiliated and unable to respond.  \"Lay down in the shower, and I'll change you.  You can't be trusted to do anything yourself.\"</span></div></div>",
            "created":1594691040,
            "id":2868048,
            "title":"Just deal with the diaper yourself"
        },
        "1131222":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "See a doctor",
                "Deal with it yourself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No way.\" you state. \"I'm not wearing diapers.\"<br>\r\n<br>\r\nShe drops the subject and you resolve to make sure you don't have any more accidents.</span></div></span></div>",
            "created":1338094800,
            "id":1346528,
            "title":"Refuse to consider wearing diapers"
        },
        "11312221":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Tell her the truth",
                "Make up something"
            ],
            "content":"<div class=\"\"><div> <span>After Susan leaves for work you make an appointment to see your doctor.<br>\r\n<br>\r\n\"There doesn't appear to be anything physically wrong with you.\" He says after examining you. \"Problems like this are often psychological\"<br>\r\n<br>\r\n\"So what can I do?\" you ask.<br>\r\n<br>\r\n\"I'll give you a referral to a psychologist.\" He says, scribbling something on a piece of paper.<br>\r\n<br>\r\nYou make an appointment with the psychologist for the following week. In the meantime you have two more accidents but Susan isn't upset because she knows you are getting help with the problem.<br>\r\n<br>\r\nNow you are in the waiting room at the psychologist's office. \"Jennifer will be with you in a few minutes.\"<br>\r\n<br>\r\n\"Jennifer.\" you repeat to yourself quietly as you wait. \"Why does that name ring a bell?\"<br>\r\n<br>\r\nYou have your answer when the door to the consultation room opens and you recognise the woman from the supermarket. \"Daniel.\" she says giving a smile which says she recognises you too. \"Come in.\"<br>\r\n<br>\r\nYou almost run away. The last thing you want to discuss with this woman is your bed-wetting problem. You manage to fight the urge to flee and follow her into the room.<br>\r\n<br>\r\n\"What brings you to see me?\" she asks as you both take your seats.</span></div></div>",
            "created":1338267600,
            "id":1347522,
            "title":"See a doctor"
        },
        "113122211":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Try the treatment",
                "Don't try the treatment"
            ],
            "content":"<div class=\"\"><div> <span>\"Um.\" you say. \"This is a little embarrassing.\"<br>\r\n<br>\r\n\"You don't need to be embarrassed.\" she reassures you. \"I'm here to help.\"<br>\r\n<br>\r\n\"I..Um..\" you say. \"I've been wetting the bed.\"<br>\r\n<br>\r\n\"I see.\" she responds clinically.<br>\r\n<br>\r\nShe asks you about your questions about your life and your relationship with Susan then says. \"You seem to have developed self-esteem issues related to your wife's current role as the provider.\"<br>\r\n<br>\r\n\"And you think that's why I've been wetting the bed?\" you ask.<br>\r\n<br>\r\n\"It seems likely.\" she says.<br>\r\n<br>\r\n\"So what can I do?\" you ask \"I can't ask Susan to give up her job and I can't find work here anyway.\"<br>\r\n<br>\r\n\"I have an idea which might help.\" she says. \"It's a little unorthodox and will require you and your wife moving in with me for the duration of the treatment.\"<br>\r\n<br>\r\n\"I'll have to discuss it with Susan first.\" you tell her.<br>\r\n<br>\r\nThat night Susan asks. \"How did your appointment go?\"<br>\r\n<br>\r\n\"The psychologist thinks I have self-esteem issues because I'm not the provider\" you explain. \"And she wants to try some new treatment.\"<br>\r\n<br>\r\n\"What treatment is that?\" she asks.<br>\r\n<br>\r\n\"She didn't really say.\" you tell her. \"But it involves us moving in with her I thought I'd better discuss it with you first.\"<br>\r\n<br>\r\n\"I think we should try it.\" she says. \"If it's going to help.\"</span></div></div>",
            "created":1338267600,
            "id":1348203,
            "title":"Tell her the truth"
        },
        "1131222111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Let them diaper you",
                "Say that this is crazy"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay.\" you say. \"Let's try it.\"<br>\r\n<br>\r\nYou call Jennifer the next day to make the arrangements. Three days, and one more wet bed, later you and Susan arrive at Jennifer's house.<br>\r\n<br>\r\n\"Come in.\" she says. \"Let's get started. Follow me to you room.\"<br>\r\n<br>\r\nShe leads you through her house and stop in front of a door. \"You'll be staying in here.\" She opens it, revealing a baby girl's nursery, except something seems wrong about it. It takes a moment to realise what it is. Everything is too big for a baby. Infact, it looks big enough for ... you.<br>\r\n<br>\r\n\"You expect us to sleep in a cot?\" you ask.<br>\r\n<br>\r\n\"No.\" Jennifer says. \"Just you, Susan's room is next door.\"<br>\r\n<br>\r\n\"I'm not sure I understand how this is meant to help his self-esteem.\" Susan says, looking around the room.<br>\r\n<br>\r\n\"The fact that you are the provider is not going to change. Even if Daniel could find a job, it's unlikely he will earn more than you.\" Jennifer explains. \"So the solution is to learn to accept his position, let go of his macho idea of the role he's meant to have and not be ashamed of the role he does have.\"<br>\r\n<br>\r\n\"By sleeping in a nursery?\" you ask.<br>\r\n<br>\r\n\"You will live as Susan's baby.\" Jennifer tells you. \"You will be completely dependent her to take care of you so that you can learn to accept your financial dependence on her.<br>\r\n<br>\r\n\"And why is it pink?\" you ask.<br>\r\n<br>\r\n\"Like I said. You have a macho idea of who you're meant to be.\" she says. \"To help you get over that, you will be living as a baby girl.\"<br>\r\n<br>\r\n\"And you're sure this will help?\" Susan asks.<br>\r\n<br>\r\n\"Yes.\" Jennifer tells her. \"Now it's time to get your baby diapered.\"</span></div></div>",
            "created":1338354000,
            "id":1348213,
            "title":"Try the treatment"
        },
        "11312221111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Play",
                "Take a nap"
            ],
            "content":"<div class=\"\"><div> <span>You reluctantly follow Jennifer to the giant changing table. She takes out a large thick terrycloth diaper and begins folding it on the table while Jennifer undresses you.<br>\r\n<br>\r\nWhen you are completely naked, you climb onto the table and lay down on top of the diaper. Jennifer then passes Susan some baby powder, which the spreads across your crotch and bottom before pulling the front of the diaper up firmly between your legs and pinning the sides in place.<br>\r\n<br>\r\nNext come a pair of pink plastic panties which Susan pulls up your legs and over your diaper. The women help you down from the table. You find yourself standing a little awkwardly as the thick padding pushes your legs apart.<br>\r\n<br>\r\n\"Now should we find you a pretty dress to play in or are you going to take a nap?\" Jennifer asks.<br>\r\n<br>\r\n</span></div></div>",
            "created":1338354000,
            "id":1348222,
            "title":"Let them diaper you"
        },
        "113122211111":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Wet your diaper",
                "Hold on"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm not really tired.\" you say.<br>\r\n<br>\r\n\"Okay.\" Jennifer says. \"Susan can choose you a cute dress from the wardrobe.\"<br>\r\n<br>\r\nSusan opens the wardrobe. You can see dozens of dresses hanging there. \"This one.\" she decides finally, pulling out a short pink dress which she pulls on over your head. You look at your reflection in the mirror, the dress is so short that the bottom of your thick diaper sticks out underneath it.<br>\r\n<br>\r\n\"Perfect.\" Jennifer says. \"But she's far too cute for a name like Daniel now.\"<br>\r\n<br>\r\n\"How about Danielle?\" Susan suggests. \"It'll be easy to remember.\"<br>\r\n<br>\r\n\"Well come on Danielle.\" Jennifer says, leading you out of the nursery. \"Lets go play in the living room.\"<br>\r\n<br>\r\nIn the living room, she sets up a large playpen and puts you in it with some dolls and a plastic tea set. You try to entertain yourself with the toys as the women comment about how adorable you look.<br>\r\n<br>\r\nBefore long you begin to feel the need to pee and start to climb out of the playpen.<br>\r\n<br>\r\n\"Where are you going?\" Jennifer asks.<br>\r\n<br>\r\n\"I need to use the toilet.\" you say.<br>\r\n<br>\r\n\"No you don't.\" she says. \"You're a baby. Babies don't use the toilet.\"<br>\r\n<br>\r\n\"You mean you expect me to wet myself?\" you ask.<br>\r\n<br>\r\n\"And mess yourself.\" she says. \"Don't worry, your mommy will change you.\"</span></div></div>",
            "created":1338354000,
            "id":1348237,
            "title":"Play"
        },
        "113122211112":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Sleep",
                "Stay awake"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'll take a nap.\" you decide, hoping to sleep through as much of this experience as possible.<br>\r\n<br>\r\n\"Okay.\" Jennifer opens a drawer and takes out a bundle of pink fabric. As she pulls it on over your head, you realise that it is a short nightie. Once it settles in place you realise that it only half-covers your thick diaper.<br>\r\n<br>\r\nJennifer lowers one side of the cot and helps you in before sticking a pink pacifier between your lips and raising the bars back up into place.<br>\r\n<br>\r\nThe women then leave you alone for your nap.</span></div></div>",
            "created":1339131600,
            "id":1355376,
            "title":"Take a nap"
        },
        "1131222111121":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Call out for Susan",
                "Wait in the cot."
            ],
            "content":"<div class=\"\"><div> <span>You pull the blanket over yourself and close your eyes.<br>\r\n<br>\r\nYou wake up sometime later and slowly become aware of a wet against your crotch and bottom. You've wet yourself again. You reach down to check the damage to the bed but instead feel your plastic panties and remember that you are wearing a diaper.</span></div></div>",
            "created":1339131600,
            "id":1355388,
            "title":"Sleep"
        },
        "1132":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Male clothes",
                "Sissy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Jennifer let you wear male clothes or make you a sissy?</span></div></span></div>",
            "created":1337576400,
            "id":1341614,
            "title":"Keep you in diapers"
        },
        "11322":{
            "author_id":"kayledafox",
            "author_name":"Kayle Storm",
            "choices":[
                "Tell them no",
                "Give in to your inadequacy and agree"
            ],
            "content":"<div class=\"\"><div> <span>From the start of your marriage, you knew that Susan was dissatisfied with you.  You just couldn't \"perform\" like she expected you to.  After a few months, she gave up completely trying to have sex with you.  Instead, she would get herself off while you watched, frustrated by your inability to participate.<br>\r\nThen Jennifer came into the picture.  She was a tall, beautiful blonde, and also a shameless lesbian.  She and your wife would make love several times each week while you sat in the corner of the room struggling to get off.  Jennifer mocked your impotence constantly, laughing at you to the point where you felt you would cry.  \"Useless, that's what you are.  Might as well be a girl; then at least you'd have an excuse.\". You realized that you had essentially become a cuckold.<br>\r\nOne night, when you came home from work, Jennifer and Susan met you at the door.  \"Some things are gonna change around here, starting with this.\". She held up a massive pink diaper, a pair of plastic panties, and a short, frilly skirt and blouse.  \"You can't perform as a male, so we're going to make you a girl.\"</span></div></div>",
            "created":1594836480,
            "id":2869127,
            "title":"Sissy"
        },
        "114":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "A man",
                "A woman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Susan is actually in a secret lesbian relationship with a woman named Rebecca.<br>\r\n<br>\r\nWho is Rebecca also in a relationship with?</span></div></span></div>",
            "created":1337576400,
            "id":1341620,
            "title":"A woman who is already in a relationship too"
        },
        "1141":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Treated like babies",
                "Just kept in diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rebecca is also married. Her husband's name is Michael.<br>\r\n<br>\r\nYou you and Michael be treated completely like babies or just kept in diapers?</span></div></span></div>",
            "created":1337576400,
            "id":1341696,
            "title":"A man"
        },
        "11411":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Baby boys",
                "Baby girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Rebecca treat you and Michael like baby boys or baby girls?</span></div></span></div>",
            "created":1337576400,
            "id":1341698,
            "title":"Treated like babies"
        },
        "11412":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Male clothes",
                "Sissies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Rebecca let you and Michael wear male clothes or make you sissies?</span></div></span></div>",
            "created":1337576400,
            "id":1341699,
            "title":"Just kept in diapers"
        },
        "114121":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Gay sex",
                "Only straight sex"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Rebecca encourage you and Michael to play with each other sexually?</span></div></span></div>",
            "created":1337576400,
            "id":1341704,
            "title":"Male clothes"
        },
        "114122":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Gay sex",
                "Only straight sex"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Rebecca encourage you and Michael to play with each other sexually?</span></div></span></div>",
            "created":1337576400,
            "id":1341705,
            "title":"Sissies"
        },
        "1142":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Treated like babies",
                "Just kept in diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rebecca already has a girlfriend named Lisa.<br>\r\n<br>\r\nWill you and Lisa be treated like babies or just kept in diapers?</span></div></span></div>",
            "created":1337576400,
            "id":1341706,
            "title":"A woman"
        },
        "11421":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Baby boy",
                "Baby girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will you be treated like a baby boy or a baby girl like Lisa?</span></div></span></div>",
            "created":1337576400,
            "id":1341708,
            "title":"Treated like babies"
        },
        "114212":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Yes",
                "No, only on Susan and Rebecca"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will you and Lisa also be forced to perform sexual acts on each other?<br>\r\n</span></div></span></div>",
            "created":1346821200,
            "id":1421402,
            "title":"Baby girl"
        },
        "1142121":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Wear the outfit",
                "Refuse to wear the outfit"
            ],
            "content":"<div class=\"\"><div> <span>It started when your wife. Susan got a new job. It was her dream job but it meant relocating to the other side of the country. So you gave up your job and the two of you moved out here.<br>\r\n<br>\r\nSince then, you've not been able to find another job. Financially it's not been a problem. Susan is well paid and you live very comfortably on her salary. However It has left you feeling rather inadequate.<br>\r\n<br>\r\nAnd this isn't helping...<br>\r\n<br>\r\n\"You want me to wear that?\" you ask, looking at the outfit Susan has laid out on the bed for you. \"Why?\"<br>\r\n<br>\r\n\"It's a fantasy of mine.\" she says. \"Can't I be a little kinky?\"<br>\r\n<br>\r\nKinky is one thing. This is something else. You look down at the cute pink big babylike onesie , and a large disposable diaper.<br>\r\n</span></div></div>",
            "created":1346821200,
            "id":1421490,
            "title":"Yes"
        },
        "11421211":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Let her wax your legs",
                "Refuse to be waxed"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay.\" you reluctantly agree and begin undressing. \"If this is what you want.\"<br>\r\n<br>\r\n\"It is.\" She helps you out of your clothes. \"Thankyou.\" Then once you are completely naked she directs you. \"Lay on the bed.\"<br>\r\n<br>\r\nYou do as you are told and she unfolds the diaper then slides it under your bottom. \"Good girl.\" she says as she pulls the front of the diaper up between your legs and fastens the tapes.<br>\r\n<br>\r\nShe then helps you up of the bed and dresses you in the res of the outfit.<br>\r\n<br>\r\n\"What now?\" you ask, looking at your reflection in the full-length mirror. <br>\r\n<br>\r\n\"I think the first thing we need to do is wax those legs.\" She says. \"I can't have my little baby girl all hairy.\"<br>\r\n</span></div></div>",
            "created":1346821200,
            "id":1421491,
            "title":"Wear the outfit"
        },
        "114212111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Lick her",
                "Don't lick her"
            ],
            "content":"<div class=\"\"><div> <span>You look at her, wondering how far she is going to take this fantasy but ultimately agree. \"Okay.\"<br>\r\n<br>\r\nShe lays a towel on the bed and tells you \"Lay down.\"<br>\r\n<br>\r\nYou do as you are told and she prepares the wax.<br>\r\n<br>\r\n\"Ow!\" you almost scream as she rips the first strip off.<br>\r\n<br>\r\n\"You really are a baby girl.\" she teases. \"Us girls do this all the time.\"<br>\r\n<br>\r\nIt feels like a hours have passed before the last patch of hair is removed. By then you are almost in tears.<br>\r\n<br>\r\n\"All done.\" she declares, caressing your now-smooth legs. \"That wasn't so bad was it?\"<br>\r\n<br>\r\nYou just lay there, exhausted by the pain.<br>\r\n<br>\r\n\"Good girl.\" she says, rubbing your penis through the diaper.<br>\r\n<br>\r\nBefore long you can't help growing hard. You penis strains against the padding of the diaper.<br>\r\n<br>\r\n\"My little sissy likes this doesn't she.\" Susan smiles down at you but stops rubbing. \"But I think it's my turn first.\"<br>\r\n<br>\r\nShe stands and undresses. You grow harder watching her.<br>\r\n<br>\r\nWhen she is completely naked she helps you up off the bed and makes you kneel facing it. She then sits directly in front of you and spreads her legs. Pushing her crotch into your face. \"Lick me.\" she directs you.</span></div></div>",
            "created":1346821200,
            "id":1421492,
            "title":"Let her wax your legs"
        },
        "1142121111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Play with yourself",
                "Keep your hands out of your diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You stick out your tongue and begin to lick her. She moans as you press against her clitoris.<br>\r\n<br>\r\nThis only makes you harder inside your diaper.</span></div></span></div>",
            "created":1346821200,
            "id":1421493,
            "title":"Lick her"
        },
        "11421211111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Lay on the bed",
                "Tell her you've had enough of this"
            ],
            "content":"<div class=\"\"><div> <span>As you lick her you slide your hand into the waistband of your diaper and take hold of your penis.<br>\r\n<br>\r\nAs she rocks her hips back and forth, you move your hand up and down the shaft. Finally as she orgasms, you begin to squirt into the absorbent padding.<br>\r\n<br>\r\nSusan pushes you back away from her groin and looks down at you, catching you with your hand still inside your diaper. \"Did I say you were allowed to play with yourself?\" she asks.<br>\r\n<br>\r\nYou just look away, guiltily.<br>\r\n<br>\r\nShe pulls you to your feet and inspects the diaper. \"It looks like you need a change too. Lay on the bed while I get you a clean diaper.\"</span></div></div>",
            "created":1346821200,
            "id":1421494,
            "title":"Play with yourself"
        },
        "114212111111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Ask what the click was.",
                " Ask what she wants you to do now."
            ],
            "content":"<div class=\"\"><div> <span>You decide to keep playing along and lay down on the bed.<br>\r\n<br>\r\nSusan returns with another diaper and a package of baby-wipes. She moves the skirts of the dress out of the way then untapes your current diaper and pulls it open between your spread legs.<br>\r\n<br>\r\n\"It looks like you won't be any more fun tonight.\" she observes, poking your flaccid penis. She cleans you with the wipes. The are cold against your skin. Then she replaces your diaper with the new one.<br>\r\n<br>\r\nShe helps you up then pulls the dress off over your head and replaces it with a short pink nightie. Then from a drawer, she takes out a large pair of translucent pink plastic pants.<br>\r\n<br>\r\n\"What are they for?\" you ask as she pulls them up your legs.<br>\r\n<br>\r\n\"A little extra protection.\" she says. \"For the night.\"<br>\r\n<br>\r\nAs she settles them into place around your waist you hear a tiny 'click'.</span></div></div>",
            "created":1346821200,
            "id":1421495,
            "title":"Lay on the bed"
        },
        "1142121111111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Go with her",
                " Demand that she unlock the plastic pants"
            ],
            "content":"<div class=\"\"><div> <span>\"What was that sound?\" you ask, looking around.<br>\r\n<br>\r\n\"Just your plastic panties locking.\" she says. \"To make sure you don't go taking them off while I'm not watching.\"<br>\r\n<br>\r\nYou try to pull the plastic panties off but she's telling the truth.<br>\r\n<br>\r\n\"Okay.\" she says. \"I think it's time you went to bed.\" Strangely, she leads you out of the bedroom.</span></div></div>",
            "created":1346821200,
            "id":1421496,
            "title":"Ask what the click was."
        },
        "11421211111111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Ask  Susan politely for an explaintation.",
                "Try to get escape."
            ],
            "content":"<div class=\"\"><div> <span>You don't like where this is going, but you agreed to this to do Susan a fravor and you stand to your word. You already feel like a burden for Susan and you don't want to make it even worse. So you decide to play along at least for now. Then Susan leads you into the spare room, when she switchs on the light, you realize that Susan somehow converted the spare room into a pink adult-sized nursery. Then Susan says \"Baby, this is your new room.\"</span></div></div>",
            "created":1349067600,
            "id":1438536,
            "title":"Go with her"
        },
        "114212111111111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Choose the easy way.",
                "Choose the hard way."
            ],
            "content":"<div class=\"\"><div> <span>\"Susan please tell me what's going on\" you request.<br>\r\n<br>\r\n\"Well, Daniel you are right, I owe you an explanation. Well, I am a lesbian and I am in a relationship with a woman named Rebecca, but don't worry I still want you in my live just under other conditions. I always had the fantasy to keep you as my sissy baby. Today was just a foretaste of the rest of your life. If you want to leave, now is your chance but we booth know that you will do everything to make me. And besides I will take good care of you and if you behave yourself Rebecca and I will let you do some adult things, and Rebecca's partner Lisa will get the same treatment as you, so that you have a playmate, yes I mean that equivocally. We can do it the easy way or the hard way, you choose.\"</span></div></div>",
            "created":1349326800,
            "id":1440003,
            "title":"Ask  Susan politely for an explaintation."
        },
        "1142121111111111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "let me give you enema, sit in your messy diaper for a whole day without complain",
                "let me take your anal virginity with a strap on.",
                "do what Rebecca tells you for a week without complaining ",
                "something else ",
                "Something else 2"
            ],
            "content":"<div class=\"\"><div> <span>“I am very disappointed, not because you cheated me. That is something I can easily forgive, given the circumstances. But you should have told me the truth, before we married. I might have agreed to such an agreement.But that doesn’t change that I promised to be there for you in good and in hard times. <br>\r\n<br>\r\nAnd as much as I want to leave you for good, I just can’t get myself to do it. I guess I am stucked as your sissy baby. Please just do me one last favor and don’t humiliate me in public.I swear I will do what you want.” You reply<br>\r\n<br>\r\n“Okay sweety, if you </span></div></div>",
            "created":1583602200,
            "id":2797869,
            "title":"Choose the easy way."
        },
        "11422":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Male clothes",
                "Sissy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Susan and Rebecca let you wear male clothes or make you a sissy?</span></div></span></div>",
            "created":1337576400,
            "id":1341710,
            "title":"Just kept in diapers"
        },
        "114222":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Yes",
                "No, only on Susan and Rebecca"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will you and Lisa also be forced to perform sexual acts on each other?</span></div></span></div>",
            "created":1345698000,
            "id":1411408,
            "title":"Sissy"
        },
        "1142221":{
            "author_id":"kayledafox",
            "author_name":"Kayle Storm",
            "choices":[
                "Resist!",
                "Let the drug put you to sleep"
            ],
            "content":"<div class=\"\"><div> <span>You knew pretty quick after getting married that Susan had a secret.  It took you months to find out what it was, but after you came home from work early and found her in bed with Rebecca, her best friend, it all clicked into place.  It had always seemed like having sex with you was simply a chore for Susan, and now you knew why.  After catching them in the act, you just sat down on the couch to mull it over.  Soon, the two women joined you, both of them reeking of sweat and sex.  Susan had made drinks for everyone, and she handed one to you.  You took a few sips to steady your nerves as Susan and Rebecca explained that your marriage to Susan was just a cover, and that Rebecca's lover, Lisa, was involved as well.  All of it was just too unbelievable.  You finished your drink and tried to stand up, but your legs suddenly gave out, dropping you back onto the couch.  <br>\r\n\"And that's the drug kicking in,\" Rebecca stated, smiling.  She looked over at Susan.  \"Told you it would work.  It knocked Lisa out in less than a minute.\" <br>\r\nSusan giggled as she watched your eyes glaze over.  You could barely even think by now.  \"Well, he's probably under far enough now.  Let's get him upstairs and restrained, then we can bring Lisa in.\". Both the women drug you to your feet and began to shuffle you toward the guest bedroom.</span></div></div>",
            "created":1594686480,
            "id":2868003,
            "title":"Yes"
        },
        "11422212":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "You try to wake the woman up.",
                "You call for Susan to explain the situation.",
                "Something else ",
                "something else ",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>You tried  to resist the effects of the drug but the dosage was just to high and you fell asleep. As you woke up you noticed you were laying in a adult sized crib and wearing something that felt like a diaper, next to you layed a woman in a state similar to your’s.</span></div></div>",
            "created":1594688340,
            "id":2868012,
            "title":"Let the drug put you to sleep"
        },
        "12":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "A single man",
                "A man who is already in a relationship too",
                "A single woman",
                "A woman who is already in a relationship too"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are Stephen and you live with your partner, Brad.<br>\r\n<br>\r\nWho does Brad fall in love with?</span></div></span></div>",
            "created":1337490000,
            "id":1341574,
            "title":"A man in a gay relationship"
        },
        "121":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "Treat you like a baby",
                "Keep you in diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Brad has fallen in love with another man named Sean<br>\r\n<br>\r\nWill Brad and Sean treat you completely like a baby or just keep you in diapers?</span></div></span></div>",
            "created":1337576400,
            "id":1342232,
            "title":"A single man"
        },
        "1211":{
            "choices":[
                "the nipple of a baby bottle",
                "the nipple of Sean or  Brad's chest "
            ],
            "content":"<div class=\"\"><div> <span>It started when you had a little too much to drink, in fact as you come from your hazy sleep you realize you are still drinking as warm sweet milk rushes in your muth and down your stomach. For those sleepy seconds you are at peace. Then slowly your eyes open to see what you're suckling on... you didn't even take in anything else at the moment.</span></div></div>",
            "created":1453993260,
            "id":2095619,
            "title":"Treat you like a baby"
        },
        "13":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "A single man",
                "A man who is already in a relationship too",
                "A single woman",
                "A woman who is already in a relationship too"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are Sarah and you have a husband named Allan.<br>\r\n<br>\r\nWho does Allan fall in love with?</span></div></span></div>",
            "created":1337490000,
            "id":1341596,
            "title":"A woman in a straight relationship"
        },
        "133":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Treat you like a baby",
                "Keep you in diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allan has fallen in love with a woman named Rachel<br>\r\n<br>\r\nWill Allan and Rachel treat you completely like a baby or just keep you in diapers?</span></div></span></div>",
            "created":1379221200,
            "id":1663406,
            "title":"A single woman"
        },
        "1332":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "Understanding.",
                "Angrily. ",
                "She didn't answer, she fell asleep."
            ],
            "content":"<div class=\"\"><div> <span>It was late in the evening, Sarah wonders why her lover was not home yet. He has been staying out late and has a different excuse every time. However Allan did come home soon after. <br>\r\n<br>\r\n\"Where were you?\" Sarah asks, curious.<br>\r\n<br>\r\n\"I was out with a friend. I understand you want to find out and you'll know tomorrow.\" Allan tells her.<br>\r\n<br>\r\nSarah responds...</span></div></div>",
            "created":1449684900,
            "id":2072350,
            "title":"Waiting late, reason tomorrow."
        },
        "14":{
            "author_id":"sillybaby",
            "author_name":"SillyBaby",
            "choices":[
                "A single man",
                "A man who is already in a relationship too",
                "A single woman",
                "A woman who is already in a relationship too"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are Samantha and you live with your partner, Tanya.<br>\r\n<br>\r\nWho does Tanya fall in love with?</span></div></span></div>",
            "created":1337490000,
            "id":1341599,
            "title":"A woman in a lesbian relationship"
        },
        "143":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "You decide to talk to her.",
                "You do your best to ignore the problems but play time keeps getting... weirder. ",
                "Tanya wants to talk with YOU.  And she has someone you need to meet.  "
            ],
            "content":"<div class=\"\"><div> <span>You loved Tanya with all your heart.  Though really you two were as different as night and day.  Its probably why you became attracted to her in the first place.  <br>\r\n<br>\r\nYou're a blonde a little taller than average height who is sweet, kind and very shy.  <br>\r\n<br>\r\nTanya was anything but shy.  She was outspoken, in your face and a big type A personality.  She was only five feet tall and had short black hair.  She loved dressing provocatively and craved attention.<br>\r\n<br>\r\nThe first time you met was in college when a guy was chewing you out for being late.  You'll always remember how she walked up to him, slapped him and chewed him out for being a horrible person.  It was love at first sight for you, you fast became friends and then when you learned she was a lesbian you stepped out of the closet yourself.  You have been together ever since.  Last spring you got married in California and you were the happiest woman alive. <br>\r\n<br>\r\nTanya of course wore the pants in the relationship - and you were OK with that. Only lately she's been coming home very late and being very defensive.  When you do have sex Tanya has been asking you to do... odd things.  You were very uncomfortable with it but you loved Tanya and so you played along but you were sure she could tell that you weren't enjoying it.  <br>\r\n<br>\r\nYou thought about having a talk with her... but you valued your relationship and didn't want to jeopardize it.  <br>\r\n<br>\r\n</span></div></div>",
            "created":1338094800,
            "id":1346329,
            "title":"A single woman"
        },
        "1431":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "You let Tanya turn you into her  babylover ",
                "You ask her if there is something less kinky, you could start with."
            ],
            "content":"<div class=\"\"><div> <span>One day after Tanya came  home late again, you approached her saying \"We need to talk. You have been avoiding me more and more and the very few times, we still have sex, you demanded weird things from me. Please tell me what I can do to make it better. I will do everything, I just don't want to lose you.\"<br>\r\n<br>\r\n\"Sweetie it isn't your fault, but there is something you can do to bring back the passion. You see there is a fantasy of mine, it is very kinky. I would like to baby you, with diapering and everything that entails. Don't worry there would be enough adult play time for us both to enjoy. Off course you would have to give your job up, but you hate it anyways, and my salary is more than than enough to keep our living standards up. What do you say sweety?\"<br>\r\n<br>\r\nHow do you react?</span></div></div>",
            "created":1450576980,
            "id":2076754,
            "title":"You decide to talk to her."
        },
        "14312":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "\"Sure... we can start with..\"",
                "\"No, you will be my little baby.\"  "
            ],
            "content":"<div class=\"\"><div> <span>This was quite the shock!  An adult baby fetish?  You were really surprised by this.  <br>\r\n<br>\r\nYour lover sees your shock and smiles.  \"Samantha this would make me very happy if you agreed to it.\"  <br>\r\n<br>\r\nYour fingers drum nervously on your leg.  \"Umm... Tanya I just... I don't know about this.  And quit my job?  That is a bit much.  Can we do something a little less kinky to start with?\"  <br>\r\n<br>\r\nHow does Tanya react?  </span></div></div>",
            "created":1450841940,
            "id":2078332,
            "title":"You ask her if there is something less kinky, y..."
        },
        "143122":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "try out being Tanya's baby for the weekend.",
                "to tell Tanya that you will never let her live out, her fantasy."
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"No, you will be my little baby. I don't ask for much, just let me live out, my deepest fantasy this weekend. And if you don't like it, I won't bring it up again. But if you can't bring yourself to do me, this little favor, I will have to change some things about our relationship.\"<br>\r\n<br>\r\nYou don't like the options Tanya gives, you but in the end to decide</span></div></div>",
            "created":1450845900,
            "id":2078358,
            "title":"\"No, you will be my little baby.\"  "
        },
        "1432":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Agree... you love Tanya.  ",
                "No - you're not interested in bondage.  ",
                "Something Else Happens?  "
            ],
            "content":"<div class=\"\"><div> <span>You love Tanya - and you're sure this is just a rut and it will pass.<br>\r\n<br>\r\nA few days later its time for a little fun.  You love her hot tight body, sex is always fun up until the strangeness started to occur.  You hoped tonight would be filled with long cuddling, 69 and the chance to run your hands on your wife's perfect body.  It was not meant to be though.<br>\r\n<br>\r\nTanya came in with box and said, \"Samantha lets do something different tonight.\"<br>\r\n<br>\r\nYou bite back a sigh and respond, \"Um OK sure.\" <br>\r\n<br>\r\nTanya's mouth twitched into a smile.  <br>\r\n<br>\r\n\"Since it's Friday and you don't have to work until Monday I want to have an all weekend event for us.\"<br>\r\n<br>\r\nHmm this was starting to sound interesting, you waited for your wife to continue.  <br>\r\n<br>\r\n\"Do you trust me Samantha?\" <br>\r\n<br>\r\nYou nod your head.<br>\r\n<br>\r\n\"Good, because I want to do an extended bondage scene with you, are you OK with this?\"  <br>\r\n<br>\r\nYou swallow thickly.  You weren't really into kinky scenes.  Tanya has spanked you before but you really didn't like that.  Soft bondage could be enticing but this sounded a lot different.  Weekend long bondage?  That... was extreme.  <br>\r\n<br>\r\nDo you go along with Tanya or do you say no you would prefer to just have sex.  </span></div></div>",
            "created":1338181200,
            "id":1346876,
            "title":"You do your best to ignore the problems but pla..."
        },
        "14321":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Tanya introduces you to her new lover.  ",
                "Tanya leaves... you make a mess before she returns.  "
            ],
            "content":"<div class=\"\"><div> <span>Though you weren't keen on the idea you wanted to make Tanya happy so you said yes.<br>\r\n<br>\r\nTanya's smile lit up her face.  \"Oh I'm so glad, I've been looking forward to this for a long time.  Go ahead and strip baby.\"  <br>\r\n<br>\r\nYou remove your clothing until you are completely nude.  You are good looking.  You could lose a few pounds but you have some amazing curves and your face has always been described as angelic.  Tanya keeps her own clothes on and motions for you to follow her into the basement.  <br>\r\n<br>\r\nOnce in the basement you see she has procured several bondage items.  First she puts a collar around your neck.  You shiver at the touch of your lover.  Maybe this wasn't going to be so bad.  She softly kisses your lips after attaching the collar, \"You have no idea how long I've wanted this Samantha - you're going to make me the happiest girl alive.\"  <br>\r\n<br>\r\nYou let out a moan of desire and try to kiss her more but she backs away, \"Not yet my love.\"  <br>\r\n<br>\r\nShe brings out a pair of restraints.  They are like cuffs except they provide a lot more slack, however they have two large rounded ends that go over your hands like gloves.  The leather covers your hands and bunches them into a fist.  Basically you can move your arms but you can not grab anything and your hands can not be spread more than a foot apart.  <br>\r\n<br>\r\nTanya than pushes you to your knees. \"Hmm do you like looking up at me Samantha?\"  <br>\r\n<br>\r\nYou two didn't do many domination/submission games but it did feel right and natural.  <br>\r\n<br>\r\n\"Y-yes\" you respond nervously.  <br>\r\n<br>\r\n\"While we are playing you should call me Mistress Tanya.\"  <br>\r\n<br>\r\n\"Oh OK Mistress Tanya,\" you respond meekly.  <br>\r\n<br>\r\nTanya strokes your face and murmurs, \"Good girl.\" <br>\r\n<br>\r\nTanya then attaches a lead to your collar and pulls you toward the wooden support beam in the middle of the basement.  She attaches the lead to the beam.  She then backs away and tells you to try to get out of your restraints.<br>\r\n<br>\r\nYou can't move from the beam because the leash is short.  You try to unhook the leash but because of the leather mitts on your hands you can't unhook it at all.  You were stuck and Tanya's smile got bigger and bigger as she saw how effective the bondage was.  <br>\r\n<br>\r\n\"Let me help you put on the last piece my sweet Samantha.\"<br>\r\n<br>\r\nTanya pulled out that last piece... a diaper.  <br>\r\n<br>\r\nShe helped you put it on and you had to ask, \"Uh Tanya what is this for?\"  <br>\r\n<br>\r\nYour wife slapped your hard.  \"I told you to address me as Mistress.\"  <br>\r\n<br>\r\nYou looked at your wife in shock.  She laughed at the look on your face.<br>\r\n<br>\r\n\"I told you this is going to be some extended bondage and we don't want a mess on the floor so...\"  <br>\r\n<br>\r\nYour eyes grew wide.  \"W-what?  How long are you going to leave me like this??\"  <br>\r\n<br>\r\nTanya smirked, \"Oh maybe a day or so, if your a big girl and manage not to make a messy I'll be impressed.  Of course if you're just a little girl who has to make messes in her diaper I think we may have to make some updates to our living situation.\" <br>\r\n<br>\r\nThis was sick.  Absolutely sick.  You thought this couldn't get any worse and then...</span></div></div>",
            "created":1338181200,
            "id":1346889,
            "title":"Agree... you love Tanya.  "
        },
        "143211":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Valerie a tall blond bombshell who was also a cruel sadist.  ",
                "Tanya a black woman who has always wanted a child... "
            ],
            "content":"<div class=\"\"><div> <span>\"Oh before I go I need to introduce you to someone.  Someone very special,\" your wife smiled at you.<br>\r\n<br>\r\nYou felt a sudden sinking feeling in your gut.  <br>\r\n<br>\r\n\"You've been a good girl Samantha but I crave... excitement and you're actually rather dull.  So I have found someone else, oh now don't cry I still love you.  Just in a different way.  It may take some time to get used to this and its going to be hard but it will be worth it.\"<br>\r\n<br>\r\nYour eye's welled up in tears, \"N-no you can't be serious.  Please Tanya I love you, please don't leave me.  Please Tanya, please please, I love you!\"  You beg desperately and pathetically.<br>\r\n<br>\r\nTanya strokes your cheek rubbing the tears that are now streaming down your face.  \"Samantha,\" she says softly, \"what did I tell you about how you should address me.\"  You look up surprised in time to see Tanya's vicious backhand strike across your face.  The blow was very painful and you cried out.  Tanya stalked away from you and opened the door so that you could see her new lover.  Your replacement.  <br>\r\n<br>\r\nShe was....  <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1340254800,
            "id":1364451,
            "title":"Tanya introduces you to her new lover.  "
        },
        "1432111":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "They return in 24 hours... you made a mess, BAD BABY.",
                "They return in 24 hours... somehow you didn't make a mess!  "
            ],
            "content":"<div class=\"\"><div> <span>She was... stunning to say the least.  She was drop dead gorgeous.  She shimmed into the room in high heels and black leather pants.  Her leather top left her well toned belly bare to the world.  You could see the sparkle of a diamond attached to her belly button piercing.  Her long flowing blond hair framed a model like face.  Her piercing blue eyes promised nothing but agony as they bore into your soul.  Even without heels she would be close to 6 feet, in them she towered over everyone in the room.  <br>\r\n<br>\r\nIn her hands was a riding crop.  She took a deep breath that made her voluptuous bosom swell gloriously.  You stared in awe at the woman.  No wonder your wife had chosen to be with someone else.  She looked like Pamela Anderson in her prime!  Even better!  <br>\r\n<br>\r\nTanya went to her new lover and a stab of jealousy streaked through your heart as they kissed.  As this kiss broke the blond woman said, \"Well my dear, don't be rude introduce us.\"  <br>\r\n<br>\r\nTanya quickly gave a little jerk of her head and said, \"Of course, where are my manners.   Samantha this is Mistress Valerie, Mistress this is Samantha my wife.\"  Valerie stalked forward in her heels to where you were bound helplessly.  \"A pleasure to meet you.  You are not half bad looking slave, we'll get you to lose those pounds pretty quickly.  I'm sure you are wondering what exactly your new role in the relationship will be.  Quite simply you are going to be our little baby.\"  <br>\r\n<br>\r\nYou must of looked disbelieving because Valerie slapped her crop hard against your bare breast.  <br>\r\n<br>\r\n\"You will be our little baby except for one hour a day.  That one hour will be adult time.  And if you have been a good baby, it will be enjoyable.  But if you've been bad... well lets just say that this little toy here is going to be least of your worries.\"  <br>\r\n<br>\r\nAbsolutely terrified now you started to plead.  \"Please don't do this.  Please, I'll never see you again - I won't tell anyone.  God please just let me go, please I'm an adult I want to live my life.  You've taken my love, my wife isn't that enough?\"  Valerie looked into your eyes without a shred of sympathy.  <br>\r\n<br>\r\n\"No.  It isn't enough.  I am going to break your mind until you are literally my helpless little baby.\"  <br>\r\n<br>\r\nValerie turned away from you and snapped her fingers.  \"Tanya lets go.  Its time to leave baby here by herself.  Try not to make too much of mess now, you don't want to make mommy mad.\"  With that the two of them left you naked save for your diaper.  </span></div></div>",
            "created":1349067600,
            "id":1438673,
            "title":"Valerie a tall blond bombshell.  Total Sadist"
        },
        "14321111":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Is baby thirsty?  How about a bottle full of Mistress Piss!  ",
                "Baby needs a good spanking for making a mess!  "
            ],
            "content":"<div class=\"\"><div> <span>You sat there on your knees stunned by the recent turn of events.  You couldn't believe your wife was doing this to you!  you began to weep at the unfairness of it all.  After a time you stopped crying and tried to get out of your restraints again.  It was futile, you weren't getting out.  Worse you realized you couldn't even sit down!  You would choke yourself on the collar, you had to be kneeling or standing.  You switched positions several times trying to take the ache off of your knees but you would get tired of standing too.  <br>\r\n<br>\r\nHelpless you screamed but the walls were thick - no one was coming.  Breaking down into tears again you wondered how long it had been.  3 hours? 4?  How long had they said they would be?  24 hours?  You thought you were going to go insane.  You get as comfortable as you can kneeling down and try to get some sleep.  It is not easy to get to sleep in that position.  You start to feel your thirst.  Your throat is sore from screaming and you lick your lips trying not to think about water.  Even though you haven't drunk anything since you've been down here you do need to pee.  <br>\r\n<br>\r\nYou try to hold it.  You won't let them do this to you.  You aren't going to piss in the diaper like a baby.  You strain and try to ignore your bladder and settle down to sleep.  But its impossible. Your knees hurt.  Your back hurts.  Your bladder hurts.  You jerk at your bonds again, you slam your bound hands into the wooden support beam.  How long had it been?  How long had it been?  You try to keep your mind off of your bladder.  You try to stop thinking about the utter betrayal the love of your life has done to you.  It wasn't enough to replace you bu t now she was subjecting you to this torture.  <br>\r\n<br>\r\n\"PLEASE LET ME OUT.... PLEASE!!!\"   <br>\r\n<br>\r\nNo answer.<br>\r\n<br>\r\nHow long has it been?  <br>\r\n<br>\r\n10 hours?  12 hours?  Maybe its been 20 hours... no it hasn't been you just wish it had been.  <br>\r\n<br>\r\nYour hungry.  Your thirsty.  You need to pee. Your tired.  Your sore.  Oh god you need to pee so bad.  You can't help it anymore, you stop clenching your bladder and let the urine flow.  You feel the warm wetness as it coats your diaper.  You cry from the utter shame and humiliation.  Weeping for the third time you rail at your wife and her sadistic new lover.   If only you could get free, you wanted to rip Valerie's perfect hair.  Smash that evil pretty face.  You weren't a violent woman but what they have just made you do... not that it matters.  You are helpless.  More hours pass.  <br>\r\n<br>\r\nAnd yet more time.  Your knees throb with a dull ache, when you shift even slightly the pain turns into a sharp horror that makes you never want to move again.  More hours pass, your parched throat is desperate for moisture.  Had it been 24 hours?  Had they lied?  Were they going to keep you here until you died?  You don't know and the terror is driving you mad.  <br>\r\n<br>\r\nFinally the door opens... they are back.  At first you are filed with joy that you had been saved.  You could get out of this diaper, you could drink water, you could get off of your knees and feet.  But then a chill spreads down your spine.  You made a mess... they were going to be angry.  You take a thick painful swallow as your wife and her new Mistress walk down the stairs.  <br>\r\n<br>\r\nIts punishment time.  </span></div></div>",
            "created":1373259600,
            "id":1624655,
            "title":"They return in 24 hours... you made a mess, BAD..."
        },
        "143211111":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "HARD spanking.  ",
                "Leave you there for another 24 hours.  "
            ],
            "content":"<div class=\"\"><div> <span>Valerie walked in with your wife Tanya.  <br>\r\n<br>\r\n\"Is baby happy to see us?\"  Valerie taunted as she glided forward on her stiletto heels.  <br>\r\n<br>\r\n\"P-please let me go.  I'm so thirsty and my knees hurt,\" you beg.  <br>\r\n<br>\r\nValerie just laughs.  Tanya walks behind her.  \"Mistress Valerie baby Samantha looks a bit worse for wear.  Maybe we should be a little merciful?\" <br>\r\n<br>\r\nValerie strokes my wife's cheek softly and then lightly grabs her jaw and tilts it up to look at her.  <br>\r\n<br>\r\n\"I know you still love your little wife but she's not been broken in yet.  Once she's been completely broken down and made into our baby then I'll let you comfort her OK darling?\"  <br>\r\n<br>\r\nTanya submissively bows her head, \"Yes Mistress Valerie.\"<br>\r\n<br>\r\nYou try to appeal to your wife again, \"Tanya, baby, please let me go.  This was hell, it was hell.  I thought I was going to die, if you ever loved me let me go.\"  <br>\r\n<br>\r\nThat evil sadist Valerie walks up to you and viciously backhands you. \"Babies don't speak.  Do not ever speak unless we ask you to.  Next time you speak I'll make Tanya whip your breasts bloody.\"  Her cold eyes left you no doubt that she would carry through with it.  Seeing your silence she moved on.<br>\r\n<br>\r\n\"See she can be taught.  Now baby was thirsty so we have prepared a bottle for baby.\"  <br>\r\n<br>\r\nTanya pulled out a baby bottle with a nipple and everything.  The liquid instead of being milk was yellow.  You felt sick to your stomach when you realized it was urine.  You let out a pitiful whimper as Tanya handed the bottle to Valerie.  <br>\r\n<br>\r\nThe tall blond stroked your hair and pushed you to your knees.  \"Be a good baby or you'll get punished more.\"  <br>\r\n<br>\r\nShe brought the bottle up to your lips and you forced yourself to part your lips and take the bottle in your mouth. You sucked on the urine and it entered your mouth.  You gagged violently but the evil bitch kept the bottle in your mouth.  It was disgusting, utterly disgusting.  The slightly acidic urine went down your dry throat and provided relief and pain.  <br>\r\n<br>\r\nThey boy made cooing sounds and talked about what a good baby you are for drinking from your bottle without a fuss.  It was degrading and mortifying.  Eventually you managed to completely empty the piss filled bottle.  <br>\r\n<br>\r\nTanya checked your diaper and announced, \"Uh oh it looks like baby made a mess.\"  <br>\r\n<br>\r\nValerie gave an exaggerated sigh.  \"And you were doing so well too baby Samantha.  Time for your punishment!\"  <br>\r\n<br>\r\nYou cringe in terror as you wait to hear what these monsters were going to do to you.  </span></div></div>",
            "created":1411534800,
            "id":1861589,
            "title":"Is baby thirsty?  How about a bottle full of Mi..."
        },
        "1432111112":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "You are whipped bloody.  ",
                "Tanya hesitates... Valerie is not amused.  "
            ],
            "content":"<div class=\"\"><div> <span>You look at them with undisguised terror and you know that sadist Valerie is getting off on it.  <br>\r\n<br>\r\n\"We are going to leave you here for another 24 hours baby.\"  She announced casually.  <br>\r\n<br>\r\nYou began sobbing and begging and pleading.  Valerie raised her finger and shook it side to side. <br>\r\n<br>\r\n\"Naughty, Naughty baby.  I don't mind you crying, babies do that but you aren't allowed to use words.  I told you what would happen if used words without permission.\"  <br>\r\n<br>\r\nYou suddenly remembered.  She was going to have your wife whip your breasts for that infraction.  You looked up at Tanya, you don't dare speak a word but you plead with your eyes.  Plead for some shred of mercy.  Tanya kneels down next to you and forces your head to face Valerie.  <br>\r\n<br>\r\n\"Don't look at me baby.  She is the Mistress.  I'll do anything she asks.  I love her.  I love her far more than I ever loved you.\"  <br>\r\n<br>\r\nThose cruel barbs sting your soul.  All the more so because you hear the pure and unadulterated truth in them.  Tanya may still have some feelings for you but she loved Valerie far more.  She slapped your face lightly and got up.  She walked over and grabbed a riding crop from the bag.  <br>\r\n<br>\r\nValerie looked at Tanya.  \"Do it, whip your wife until the blood is running from her disobedient breasts!\"  </span></div></div>",
            "created":1436763600,
            "id":2007643,
            "title":"Leave you there for another 24 hours.  "
        },
        "14321111121":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "The 24 hours pass and they return.",
                "Something else happens?  "
            ],
            "content":"<div class=\"\"><div> <span>\"Yes Mistress Valerie,\" your wife intones and raised the riding crop.  <br>\r\n<br>\r\nThe first lash ripped across your breasts.  It was like a line of fire had erupted across your chest.  You scream, how could you not?  Less than a second later the next blow came, and then next.  You wail and cry as Tanya beats your breasts.  On particularly nasty slash hit your right upon the nipple and you shriek in agony.  You see Valerie laugh with glee, her large breasts bounce up and down and you feel a level of hate for her far more than you have ever felt.  She took your wife away, she put you in this bondage, she was making the love of your life beat you.<br>\r\n<br>\r\nSpeaking of Tanya, she wasn't really enjoying it.  She had a pensive look on her face.  As she struck your breasts over and over again she started getting angry.<br>\r\n<br>\r\n\"Why are you making me do this baby?  Why did you speak?  Dammit do you think I like thrashing your the lovely round bags of fun?  Why can't you just be a good baby!\"  She cried out as she lashed you harder and harder.  <br>\r\n<br>\r\nThe pain was nearly indescribable, you don't have a high pain tolerance, you wanted to beg for an end but you were utterly terrified at what further punishment you would face if you spoke actual words again.  The very thought sent shrieks of terror through your mind.  You must never disobey Mistress Valerie.<br>\r\n<br>\r\n\"Yes Tanya, yes my wonderful little pet.  Ruin your wife's breasts.  Teach our little baby a lesson!\"  <br>\r\n<br>\r\n\"Yes Mistress!\"  Tanya nearly shouted as she continued to lash out with the crop, cutting line after line on your swiftly bruising breasts.  Your voice was growing hoarse from all of your crying of agony.  You just wanted it to stop.  You just wanted it to stop.  Your face was lined with tears as Tanya whipped you over and over and over again.  You weren't counting but the number of strikes had to have been an excess of 500 before Valerie finally called a halt.  Your breasts were bleeding, bruised, purple and utterly aflame with pain.  <br>\r\n<br>\r\nThe tall blond grabbed you by the chin and forced you to look up into her eyes. <br>\r\n<br>\r\n\"You are a baby.  I know you don't want to be a baby but you will be our baby.  Never speak again.  Never mouth human words.  I may rescind this command if you are exceptionally good for the 1 hour of play time or I may require you to never speak again.  The choice, is mine.  Nod if you understand baby.\"  <br>\r\n<br>\r\nYou nodded, abject terror filling your mind.  <br>\r\n<br>\r\n\"Now that this is settled we'll leave you here for another 24 hours.  Do try to get some rest dear.\"  Valerie mocked as she and Tanya turned and left you still in the terrible bondage.  You had another 24 hours of this.  Your mind quailed at the thought, how could you possibly endure this?  </span></div></div>",
            "created":1502679300,
            "id":2368846,
            "title":"You are whipped bloody.  "
        }
    },
    "info":{
        "author_id":"sillybaby",
        "author_name":"SillyBaby",
        "brief_description":"Your partner falls in love with someone else but keeps you as their diapered plaything.",
        "created":1337572860,
        "description":"<td align=\"left\" class=\"norm\">If you like reading or writing interactive stories with AB/DL themes please join our Google Group:<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"https://groups.google.com/forum/#\" target=\"_blank\">https://groups.google.com/forum/#</a>!forum/thicklypadded<br>\r\n<br>\r\nThe first few chapters let you decide who the characters are and the sort of things that will happen to your character. After that, the story should be like a \"Choose Your Own Adventure\" Book. It is written as though the reader was the main character and the choices offered are decisions that character can make.<br>\r\n<br>\r\nThe choices at the start result in a large number of different stories and I cannot write them all.<br>\r\n<br>\r\nCurrently I am focusing on two. Here are the links to the start of each:<br>\r\n<br>\r\n1) <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1868888-Threes-a-crowd/map/11312\" target=\"_blank\">http://www.writing.com/main/interact/item_id/1868888-Threes-a-crowd/map/11312</a><br>\r\nIn this one you are a married man but your wife is actually a lesbian. After she reveals this to you, her girlfriend moves in and you become their baby girl.<br>\r\n<br>\r\n2) <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1868888-Threes-a-crowd/map/111221\" target=\"_blank\">http://www.writing.com/main/interact/item_id/1868888-Threes-a-crowd/map/111221</a><br>\r\nIn this one you are a married man. Your wife falls in love with another man and they keep you as their diapered sissy. There is sexual contact between you and your wife's new lover.<br>\r\n<br>\r\nFeel free to add to these or start any of the others. If they get going I'll add the links to this page.<br>\r\n<br>\r\n<b>Sauurman</b> has started another story at:<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/interact/cid/1346329\" target=\"_blank\">http://www.writing.com/main/interact/cid/1346329</a><br>\r\nYou are a woman in a lesbian relationship and your partner brings another woman into the relationship.<br>\r\n<br>\r\n<b>Credil</b> has started one at:<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1868888-Threes-a-crowd/map/1142121\" target=\"_blank\">http://www.writing.com/main/interact/item_id/1868888-Threes-a-crowd/map/1142121</a><br>\r\nYou are a man in a straight relationship and your partner brings another woman and her lesbian partner into the relationship. You and the other woman's partner are treated like baby girls</td>",
        "id":1868888,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594836480,
        "modified":1594836480,
        "pretty_title":"Three's a crowd"
    }
}