{
    "chapters":{
        "1":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "vore",
                "feet",
                "butt",
                "cock",
                "relax"
            ],
            "content":"<div class=\"\"><div> <span>you are sitting in your room playing a pokemon game. you love the pokemon mewtwo and want to meet him in person. suddenly the game freezes. you wonder why. then it glows and sucks you in. you then wake up in a purple room that looks endless. you then hear a strange voice. \"I've seen how you admire me. And so I've brought you here. you can request anything you like as long as i have fun too.\" You turn around to see Mewtwo standing about 3 feet away. you give him a quick overlook. as you look him over he tells you the rules again. You then think about what you want to do. you figure you want to do...</span></div></div>",
            "created":1304571600,
            "id":1100523,
            "title":"you and mewtwo"
        },
        "11":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "grabs you",
                "shrinks you"
            ],
            "content":"<div class=\"\"><div> <span>You look at his purple belly and think of what it is like inside of it. you explain your curiosity to Mewtwo and tells you that sort of thing is called vore. you think about it and then say i would like you to vore me. he simply smiles he raises one hand and... </span></div></div>",
            "created":1304571600,
            "id":1100619,
            "title":"vore"
        },
        "111":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "outside ",
                "still inside",
                "in the intestines"
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo then grabs you and places your head in his mouth. You never knew how Mewtwo could be so flexible. He the swallows sending your head into his throat and bringing his lips to your chest. he continues swallowing powerfully untill he reaches your feet. He removes you socks and shoes then proceads. with one fina gulp you are fully inside his stomach. Mewtwo sits down admiring his bulging stomach. you feel comfy inside his stomach. Soon you fall asleep. when you wake up you are...</span></div></div>",
            "created":1304571600,
            "id":1100627,
            "title":"grabs you"
        },
        "1111":{
            "choices":[
                "He Wants To Swallow You Agian...",
                "He Wants To Put You In His Cock...",
                "He Wants To Put You In His Butt..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You Yawn and open your Eyes, Your back Outside of Mewtwo, He is Awake And Is Waiting For Something... </span></div></span></div>",
            "created":1314766800,
            "id":1178555,
            "title":"Back Outside "
        },
        "11111":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "Sure",
                "No thanks... let's do something else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The look in mewtwo's eyes were obvious... \"um excuse me... that was... fun!\" he says shyly. \"Can we do that again?\" you ponder for a bit... <br>\r\n\"____\"<br>\r\n</span></div></span></div>",
            "created":1404622800,
            "id":1823391,
            "title":"He Wants To Swallow You Agian..."
        },
        "111111":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "Bigger",
                "The same as before!"
            ],
            "content":"<div class=\"\"><div> <span>you really did like it in there... \"ok you can!\" you say. mewtwo practicly jumps for joy as he runs over to you. \"well I wonder if I could make you grow... that way i'll have twice as big as a meal... and twice as big as a belly!\" mewtwo says smacking his belly. \"well... what do you want?\" mewtwo asks<br>\r\n<br>\r\n\"Make me_____\"</span></div></div>",
            "created":1404622800,
            "id":1823392,
            "title":"Sure"
        },
        "1111112":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "Tilts his head Back and Gulps you down to his awaiting belly",
                "Licks your dick "
            ],
            "content":"<div class=\"\"><div> <span>You didn't think that would work out well for mew two, sure he was flexible... but you were pretty sure he wasn't THAT flexible. \"Nah, I'll stay the same.\" Mewtwo nods and licks your cheek. \"Ok then. you're very tasty you know,\" He says. You feel the spot he licked you and it still had saliva on it. You smiled and hugged Mewtwo tightly \"Thank you for voring me!\" You say in a cheesy way. Mewtwo chuckles and picks you up again. \"I hope that cheesy line makes you taste like cheese, that way I won't be tempted to keep you in me, I hate cheese.\" Mewtwo jokes. You slowly enter Mewtwo's maw again and smiled as he began to lick you all around.<br>\r\n<br>\r\n Mew two starts gulping you down and he purrs like a house cat as you go down his throat slowly, making a large bulge in his neck. You notice this time Mewtwo is taking his time swallowing you this time, He was quick and efficient last time, but this time, he was licking every single part of you. He lastly got to your thighs where he...</span></div></div>",
            "created":1455080400,
            "id":2102358,
            "title":"The same as before!"
        },
        "11112":{
            "author_id":"joshthemaster",
            "author_name":"Pokémaster01",
            "choices":[
                "Mewtwo sends you right into his stomach to reform",
                "Mewtwo cums you out on the floor and you reform"
            ],
            "content":"<div class=\"\"><div> <span>You awake to see Mewtwo holding his dick at your feet. He notices you have woken up and starts humping your feet until they somehow slip inside of his cock slit. You feel a constant tugging motion as Mewtwo's cock starts pulling you in quickly. Mewtwo's cock is up to your chest while Mewtwo has started humping the air from the intense pleasure of you moving in his cock. Suddenly your head has entered his cock and your descent had gotten faster until you land with a splash in his cum filled balls. You feel your body start dissolving into jizz. Mewtwo overwhelmed by your struggles in his sac starts cumming. Where do you end up?</span></div></div>",
            "created":1485045300,
            "id":2267158,
            "title":"He Wants To Put You In His Cock..."
        },
        "11113":{
            "author_id":"vorebrony",
            "author_name":"Mr. Brony",
            "choices":[
                "Outside",
                "Inside"
            ],
            "content":"<div class=\"\"><div> <span>You notice your feet are against his butt.  He then rolls you over so you are pointing to where you can enter his butt with one push.  You want to go in, so you push your feet in.  He pushes you all the way in with one push.  You push yourself in further and further.  You're feet are eventually at the end of his tight rectum.  It feels extremely warm inside, and you start to feel sleepy.  You then fall asleep inside.  You wake up...</span></div></div>",
            "created":1397451600,
            "id":1778848,
            "title":"Rear Entry"
        },
        "111131":{
            "author_id":"vorebrony",
            "author_name":"Mr. Brony",
            "choices":[
                "Fuck him",
                "Be Fucked"
            ],
            "content":"<div class=\"\"><div> <span>You wake up outside of his rectum.  You stand up and Mewtwo stands up as well.  You stare at each other stupidly for 10 minutes.  You then feel your cock start to get erect.  He notices it to and asks, \"Do you want to have sex?\"  You nod to this.  He asks, \"Do you want to fuck me, or do you want me to fuck you.\"  You think on this for a few minutes.  You then decide...</span></div></div>",
            "created":1397451600,
            "id":1778852,
            "title":"Outside"
        },
        "1111311":{
            "author_id":"vorebrony",
            "author_name":"Mr. Brony",
            "choices":[
                "Fuck you",
                "Shove you up his butt"
            ],
            "content":"<div class=\"\"><div> <span>You then decide you want to fuck you.  You pull off your pants and say, \"Bend over.\"  He bend's over, holding his tail up, revealing his butt.  You then slowly push your cock into his butt.  You then start thrusting, and Mewtwo moans in painful pleasure.  You thrust faster, and Mewtwo spreads his butt.  You cum, and mewtwo pins you to ground with his butt.  You were caught by surprise, so you were easily pinned.  You try to move him, but he won't budge.  He then starts to move up and down with your erect cock still in his butt.  You enjoyed this a lot and moaned in pleasure.  You put your hands on his waist, as to keep him balanced.  You cum into his butt again, and he then repositions himself to face you.  He moves up and down one more time, with your erect cock still in his butt.  You cum again, and he gets off of your cock.  What does he do now?  Does he...</span></div></div>",
            "created":1397451600,
            "id":1778854,
            "title":"Fuck him"
        },
        "11113111":{
            "author_id":"vorebrony",
            "author_name":"Mr. Brony",
            "choices":[
                "Lifts your lower half up (Licks your butt)",
                "Shoves his cock back in"
            ],
            "content":"<div class=\"\"><div> <span>He then rolls you over and grabs your buttcheeks.  He spreads them apart quickly and shoves his extremely large erect cock into your butt.  You moan in painful pleasure as Mewtwo lets go of your buttcheeks.  He then starts thrusting, while holding himself overtop of you in a push-up position.  He thrusts harder and faster with every thrust.  He eventually cant thrust any harder or faster.  He keeps at the rate and cums, but doesn't stop.  He keeps going.  He does this 2 more times, then pulls his cock out of your butt.  \"That was fun,\" he says.  You nod in agreement.  He then...</span></div></div>",
            "created":1397451600,
            "id":1778858,
            "title":"Fuck you"
        },
        "111131111":{
            "author_id":"blazephoenix",
            "author_name":"blazephoenix",
            "choices":[
                "To make out",
                "Rubbing each other's chests"
            ],
            "content":"<div class=\"\"><div> <span>He then lifts your legs so that your butt is now level with his face. You wonder what Mewtwo is going to do to you when he shoves his face in between your butt cheeks causing you to cry out in surprise. Suddenly you feel something slimy running up and down your butt crack then you realize that he's licking you with his tongue. You can hardly believe it, the legendary Mewtwo is tongue fucking you in the ass! You moaned loudly feeling the slimy appendage delving deeper as your cock gets harder and harder. Eventually it all becomes too much and you cum again, releasing semen all over your crotch. Mewtwo raises his head up and starts licking up your juices purring with pleasure. When he's done he crawls on top of your body so your face to face. The two of you then start...</span></div></div>",
            "created":1428296400,
            "id":1960186,
            "title":"Lifts your lower half up (Licks your butt)"
        },
        "1111311111":{
            "author_id":"blazephoenix",
            "author_name":"blazephoenix",
            "choices":[
                "Rubs his cock against yours",
                "Grabs your cock with his hand "
            ],
            "content":"<div class=\"\"><div> <span>The two of you lean forward until your lips meet and passionately begin to make out. You fiercely kiss Mewtwo who kisses back just as fiercely your arms intertwining around each others necks holding each other close. In the middle of a kiss you part your lips pushing your tongue against Mewtwo's begging for entrance. He opens his mouth allowing your tongue inside where it brushes against his own. For the next minute the two of you are moaning loudly as your tongues wrestle with each other, your saliva mixing with Mewtwo's as you attempt to subdue the slimy appendage. Eventually both of you get tired of it and decide to explore the inside of the others mouth. As you're running your tongue over his sharp  fang like teeth he suddenly pushes his tongue down your throat. Choking a little you retaliate by sticking your tongue down his throat, the intimate action causing both of your cocks to become harder. You are then surprised when Mewtwo...</span></div></div>",
            "created":1428296400,
            "id":1960192,
            "title":"To make out"
        },
        "1112":{
            "author_id":"kirinin",
            "author_name":"No",
            "choices":[
                "This is good! ",
                "Let me out!"
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo is obviously sitting as you fill his gut. He burps as he pats his belly where you're able to feel it easily. He then says, \"Surprise! I'm not letting you out. You seem a bit too tasty!\" he states. You then go into a state of shock! Your best friend keeping you forever? This was good in a way, but in another way horrible! You don't know what to do! You ponder for a moment...</span></div></div>",
            "created":1321074000,
            "id":1222267,
            "title":"Still inside"
        },
        "11121":{
            "choices":[
                "Mewtwo decides to let you out",
                "you are still inside"
            ],
            "content":"<div class=\"\"><div> <span>\"I like it in here so you don't have to let me out. I'd gladly stay in here forever.\"  I admitted<br>\r\n\"Well I'm glad you see things from my perspective as I like you in there so I won't let you out.  I'd gladly keep you in there forever.\"  We both enjoyed where we were so we slept.  Next morning...</span></div></div>",
            "created":1338440400,
            "id":1349078,
            "title":"This is good! "
        },
        "111212":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "...I love you\"",
                "... Can we try something?\""
            ],
            "content":"<div class=\"\"><div> <span>You awake in Mewtwo's Belly and stretch, but not enough to punch Mewtwo's walls. Mewtwo rubs his bulging belly with a purr. \"Morning, How are you?\" Mewtwo said. Although he cant see you, he could sense you were awake, he IS a psychic type after all. \"I'm good~\" you respond, happily feeling Mewtwo's two fingered paw rubbing his belly softly. \"So, what is your plan today?\" You ask Mewtwo. Mewtwo sits down and rubs you with a bit more force, pushing his paws into the bulge, this felt like a massage to you. \"I didnt really think about much, all i was thinking about was how good you are in my belly, and how tasty you were~\" He responds. You blush and put a hand on the stomach wall, \"I enjoy it here... but we could probably do something...\" Mewtwo pat his belly and nuzzled it \"Im fine with whatever as long as you're in my belly, and I feel movement!\" You smirked and squirmed around the belly, Mewtwo's gutn had bumps all over his belly, Mewtwo moaned as the movements happened, He rubbed his moving belly and purred. \"Ooh yeah, thanks!\" He says as he lays on his belly. You feel his weight and rub where it is... you then smirk and say \"Mewtwo...</span></div></div>",
            "created":1455080400,
            "id":2102360,
            "title":"Your Soft New Home"
        },
        "1112122":{
            "author_id":"bugaloo",
            "author_name":"Bugaloo",
            "choices":[
                "Options:"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mewtwo smirked and continued to rub you in the moist, hot confinements of his stomach. \"What is it you wanted to try exactly?\" He asked, the question still echoing in your mind.<br>\r\n<br>\r\nWhat was it you wanted to try?</span></div></span></div>",
            "created":1474121100,
            "id":2211160,
            "title":"... Can we try something?\""
        },
        "11121221":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "Turning Me into a Pokemon?",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>¨Well... um...¨ You thought aloud, Mewtwo was patiently waiting, hearing the whirl of options flow around in your mind. <br>\r\n<br>\r\nHow about...</span></div></span></div>",
            "created":1480530660,
            "id":2244040,
            "title":"Choices"
        },
        "111212212":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "Go get some food to eat",
                "Go for a fly with you still in hisstomach"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You ask him if he could eat some food with you still inside him or could go for a fly</span></div></span></div>",
            "created":1533768240,
            "id":2530812,
            "title":"More"
        },
        "1112122121":{
            "author_id":"pineball43",
            "author_name":"Pineball43",
            "choices":[
                "Sure!",
                "On second thought... "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You ask mewtwo to eat something, he responds with \"Sure, but be warned that I will have to digest you~\"</span></div></span></div>",
            "created":1602724740,
            "id":2921679,
            "title":"Go get some food to eat"
        },
        "11121221211":{
            "author_id":"pineball43",
            "author_name":"Pineball43",
            "content":"<div class=\"\"><div> <span>You feel mushed up berries start pouring down your back as acids start rising up to your waist. You try and tell mewtwo that you have reconsidered, but he only responds with \"Food doesn't talk, you wanted this~\" You feel a stinging feeling in your bottom half, are you melting?! A few minutes later mewtwo says \"Thanks for being my meal~\", you try and respond but you are too weak. You pass out, you have been reduced to pudge on mewtwo's ass.</span></div></div>",
            "created":1602726360,
            "id":2921721,
            "title":"Sure!"
        },
        "11122":{
            "author_id":"kirinin",
            "author_name":"No",
            "choices":[
                "Toward his mouth!",
                "Toward his butt!"
            ],
            "content":"<div class=\"\"><div> <span>You start to thrash around in Mewtwo's belly. Mewtwo decides to slap his own belly to get you to stop. \"Hey! Stop it! I thought you liked me a lot!\" he stated. You reply, \"Yeah, but I'm pretty sure I like you as a friend. Not as a predator!\" he shouted. After he stated that, Mewtwo sighed and went onto to snap his fingers. Suddenly a tremor could be felt in Mewtwo's body! It came from...</span></div></div>",
            "created":1321074000,
            "id":1222273,
            "title":"No!"
        },
        "111222":{
            "author_id":"hydranoid2009",
            "author_name":"hydranoid2009",
            "choices":[
                "you continue towards the exit",
                "he decides to suck you back into his belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>*you notice the rumble comes from beneath you* oh man.....is that youre butt?!*mewtwo only chuckles as a hole opens beneath you,and you start to slide into it,youre soon being pushed down a passage,headfirst*</span></div></span></div>",
            "created":1335157200,
            "id":1321596,
            "title":"Toward his butt!"
        },
        "1112222":{
            "choices":[
                "he accidently sends you up his osophagus",
                "you sigh and realise there's no way out"
            ],
            "content":"<div class=\"\"><div> <span>You realise that you are moving through his intestines and you feel happy that he's letting you out.  you start to feel yourself moving backwards.  \"You really think i'll let you out?  You fill my belly nicely so i'm not letting you out.\"  You are soon inside Mewtwo's stomach again.</span></div></div>",
            "created":1335848400,
            "id":1327070,
            "title":"he decides to suck you back into his belly"
        },
        "11122222":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "Starving",
                "Just a little"
            ],
            "content":"<div class=\"\"><div> <span>You look around in your new fleshy home. \"You know... I may or may not digest you... depending on how your behavior is.\" Mewtwo tells you while stroking his gargantuan gut. you think to yourself... \"So if I act up... i'll die.... but if I act polity i'll live... unless he's lying\" you settle down and decide to act up. \"Say... your starting to speak my language... Say... are you hungry?\" mewtwo tells you. \"Well yeah!\" You say as your stomach gurgles louder than mewtwo's belly. Mewtwo summons up a fridge. \"How hungry are you?\"<br>\r\n============================================================================ ============================================<br>\r\n\"Well... i'm_______\"</span></div></div>",
            "created":1404622800,
            "id":1823388,
            "title":"Stuck... forever..."
        },
        "111222222":{
            "author_id":"4ever333",
            "author_name":"4ever333",
            "choices":[
                "Mewtwo decides to continue with the peaceful musings of his belly.",
                "All the belly action has left Mewtwo a little...pent up, and he needs to unwind."
            ],
            "content":"<div class=\"\"><div> <span>\"Just a little...\" You reply hesitantly. You didn't want Mewtwo to think of you as either rude of glutinous, both out of slight fear of being digested and not wanting to sound rude to your friend. Though you're confidant that he wouldn't digest you, better to be safe than sorry.<br>\r\n<br>\r\n\"Alright then, if your sure.\" Mewtwo replies back to his rotund belly. \"I'll just send down a few snacks down, one at a time. Just let me know once you've had enough, ok?\" He asks, as he began to rummage about through the fridge that he summoned from who-knows-where. Within the space of a few minutes, Mewtwo swallowed down a turkey sandwich, some Pop-Tarts, and a small helping of animal crackers. You finish the food in a short while, your hunger sated, at least for now.<br>\r\n<br>\r\n\"Thanks for the food Mewtwo, that really hit the spot!\" You graciously thank him. Suddenly, you let rip a decently sized burp inside him, fueled by your recent swift meal. The force of the burp is strong enough to pleasantly vibrate the Pokémon's stomach, ironically triggering a burp from him as well.<br>\r\n<br>\r\nYou both chuckle for a while at the apparent humor of your situation. Though you are still a resident of your friend Mewtwo's stomach, you're quickly beginning to realize that it isn't so bad a place after all. Sure, it'll definitely take some getting used to, but it was nowhere near as bad as how it sounded before. In fact, it's almost beginning to become enjoyable for you.<br>\r\n<br>\r\nContent with your current situation and a bit wiped out after everything, you decide to drift off into a short, after-meal nap, the gentle sounds of Mewtwo's innards, coupled with the plush, slightly moist interiors of your fleshy home quickly carry you into the land of dreams.<br>\r\n<br>\r\n\"Mmm, you go ahead and have a good nap in there, I think I'll just take the time to enjoy myself.\" Mewtwo smiled to himself as he aided you in drifting off to sleep, gently rubbing, caressing, and swaying his extended spherical belly about to quicken the process, and to take immense pleasure in having you, his best friend, resting peacefully in his gut.<br>\r\n<br>\r\n\"Well, now that he's out of it, what should I do to occupy myself?\" Mewtwo mutters to himself.<br>\r\n</span></div></div>",
            "created":1413435600,
            "id":1872474,
            "title":"Just a little"
        },
        "112":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "slowly",
                "quickly"
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo's hand glows and you notice your shrinking. Mewtwo picks the 1 inch you up after he finishes shrinking you and tosses you into the air. you came rushing down and hit Mewtwo's tongue. The soft tongue is like abed to you. Mewtwo swishes you around his mouth. He then pauses to suck on you to get the most flavor out of you. He then swallows you... </span></div></div>",
            "created":1304571600,
            "id":1100641,
            "title":"shrinks you"
        },
        "1121":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "enter",
                "don't enter"
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo then pushes you to the back of his mouth where the entrance to the throat is. your feet enter and you keep going in until he stops at your arms. You are not sacred at all because you know he wouldn't harm you. He starts swallowing you in series of gulps. After about a few minutes you feel ground and Mewtwo stops gulping. He begins to talk to you. \"You've reached the entrance to my stomach. You won't be digested while your in there.\" As he finishes talking the ground slowly disappears under you and you fall into Mewtwo's stomach. You hear a rubbing sound as Mewtwo rubs his belly. you make yourself comfortable until the ground shakes. You then hear Mewtwo say something \"Try not to get into trouble.\" and with that Mewtwo Yawns and falls asleep. as the ground stops shaking you see a hole different from the one you entered in. You...</span></div></div>",
            "created":1304571600,
            "id":1100654,
            "title":"slowly"
        },
        "11211":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "investigate",
                "wait until Mewtwo wakes up"
            ],
            "content":"<div class=\"\"><div> <span>You decide to enter the hole. As you push your way through the hole you find it tight. Just as you were about to back out you are pushed further in. You keep getting pushed through the ever ending soft pipe. Soon you see light and you realize you are in Mewtwo's butt. you are pushed fully out of his but. He doesn't seem to have noticed and continues sleeping. you look around trying to get a clear view of your land scape. You then realize you are not covered in poop and notice Mewtwo is in a bed with no sheets. He is also laying on his back. You scale the pokemon until you are on top of his belly. You look down and see something erect. What do you do?</span></div></div>",
            "created":1304571600,
            "id":1100691,
            "title":"enter"
        },
        "112111":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "His bladder",
                "His balls"
            ],
            "content":"<div class=\"\"><div> <span>As you move to investigate you notice Mewtwo's ever swollen cock. He seems to be rather excited about something.<br>\r\nYou move closer to the monstrous cock, completely memorized by it. <br>\r\nBefore you knew it, you were right there staring into the shaft. <br>\r\nThe scent was something you found overly enjoyable and decided to move closer.<br>\r\nYour hands ran along the hulking cock and soon you pushed yourself inside.<br>\r\n<br>\r\nYou heard Mewtwo moan in pleasure despite still being asleep.<br>\r\nHis cock quickly slurped you down and forced you deep inside the psychic Pokemon.<br>\r\nSoon you reached a split path and had to make a choice.<br>\r\n</span></div></div>",
            "created":1380776400,
            "id":1673922,
            "title":"investigate"
        },
        "112112":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Sex",
                "Mewtwo sucks your cock into his cock"
            ],
            "content":"<div class=\"\"><div> <span>Pretty soon Mewtwo wakes up.<br>\r\n\"Ah, so how did you like my internal organs?\" he asks.<br>\r\n\"It was great.\" you say.<br>\r\nSuddenly looking at Mewtwo's Erection has made your cock erect.<br>\r\nMewtwo notices it too.<br>\r\n\"A little happy to see me?\" he asks.<br>\r\n\"I guess.\" you say.<br>\r\n\"Wanna have sex or do you want me to show you something, don't worry it will be quite pleasurable.</span></div></div>",
            "created":1304571600,
            "id":1100705,
            "title":"wait until Mewtwo wakes up"
        },
        "1122":{
            "author_id":"twoface",
            "author_name":"Dos Caras",
            "choices":[
                "Mewtwo wakes up later and spits you out.",
                "Mewtwo wakes up later and decides to keep you inside him",
                "The barrier that protected you isn't working!"
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo purrs and leans his head back slightly. His tongue pushes you down her throat. Mewtwo caresses the bulge in his neck and then quickly puts his fingers in his stomach.<br>\r\n<br>\r\nThe trip is fast. Almost afraid of being crushed by his esophagus, you soon fall into a large sack: the stomach. The wrinkled walls pulsate slowly, you hear the beat of his now huge heart and the circulation of the air in his lungs. Everything is so relaxing...<br>\r\n<br>\r\nMewtwo pats his belly and burps satisfied. He purrs every time you move inside him and licks his lips, still savoring your taste in his mouth.<br>\r\n<br>\r\n- Human, you were delicious! - he says, purring - You've been a worthy meal. I can assure you that never in my life have I eaten a treat as tasty as you.<br>\r\n<br>\r\nYou do not know very well what to think but, suddenly, a viscous liquid begins to fill the chamber. Frightened, you punch the walls of the stomach, but you just manage to tickle him.<br>\r\n<br>\r\nMewtwo rubs his stomach.<br>\r\n<br>\r\n-Calm down- you hear- I created a barrier around you. You're safe. My acids will not make you any harm. Now sit down and relax. I'll let you go tomorrow.<br>\r\n<br>\r\nYou obey. The truth is that the bubbling acids are like a giant hot tub and the walls, even if they move violently from time to time, are giving you a massage. Besides, the smell is not so bad: it smells like berries.<br>\r\n<br>\r\nA few minutes later, both Mewtwo and the human in his stomach are asleep.</span></div></div>",
            "created":1322888400,
            "id":1233978,
            "title":"quickly"
        },
        "11223":{
            "author_id":"blazephoenix",
            "author_name":"blazephoenix",
            "choices":[
                "Poop you out now",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You wake up to a burning feeling and realize that the barrier is no longer working.<br>\r\n<br>\r\n\"Mewtwo wake up! I'm being digested!\" you cried pounding on the stomach walls.<br>\r\n<br>\r\n\"Huh? What's going on?\" Mewtwo asks waking up from his nap.<br>\r\n<br>\r\n\"Your barrier stopped working and your stomach acids about to kill me\" you yell loudly.<br>\r\n<br>\r\n\"Oh I guess I can't maintain the barrier as well when I sleep. No matter I need to make another barrier since I'm going to...</span></div></div>",
            "created":1428296400,
            "id":1960208,
            "title":"The barrier that protected you isn't working!"
        },
        "112231":{
            "author_id":"blazephoenix",
            "author_name":"blazephoenix",
            "choices":[
                "\"You're on top of my bed\"",
                "\"You're inside my diaper\""
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to poop you out.\"<br>\r\n<br>\r\nYou thought about it for a moment, the idea of being pushed out of Mewtwo's butt along with his stinky poop sounded like a dream come true to you.<br>\r\n<br>\r\n\"Okay but I don't want to end up in a toilet\" you tell him.<br>\r\n<br>\r\n\"Don't worry I won't be pooping in a toilet\" he tell you leaving you confused.<br>\r\n<br>\r\nWhere else was he supposed to do his business then you wondered.<br>\r\n<br>\r\n\"Anyway you better hold your breath cause I've been needing to poop the moment I woke up and I can't hold it any longer\" Mewtwo said before letting out a couple of grunts.<br>\r\n<br>\r\nYou then noticed the walls start to close in as the ground below you opens up into a hole that starts sucking you down. You manage to swallow a lungful of air before you're send down into Mewtwo's bowels where its totally dark. You feel yourself collide with something warm and solid and though you can't see anything you realize from the smell that you've landed on one of Mewtwo's turds. Feeling the ground begin to shake you hang on tightly to the large piece poop as its sent through an opening and expelled out of his butt to freedom.<br>\r\n<br>\r\nYou feel the turd hit something causing you to fall off only to land on something soft and white.<br>\r\n<br>\r\n\"Where am I?\" you asked him.</span></div></div>",
            "created":1428382800,
            "id":1960223,
            "title":"Poop you out now"
        },
        "12":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "shrunk",
                "normal "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You Look at Mewtwo's feet with 2 big toes and ask him if you can do some feet worship. he nod then ask do you want to be shrunk or regular size. you ponder this then say....</span></div></span></div>",
            "created":1304571600,
            "id":1100525,
            "title":"feet"
        },
        "121":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "stomp",
                "clean",
                "in-between the toes"
            ],
            "content":"<div class=\"\"><div> <span>You then reply shrunk. he then lifts his arms and a blue aura surrounds you making you one inch tall. he picks you up and asks how to start the worship. You like his toes and think it over. he stands there waiting for your answer with you in his hand. you then say... </span></div></div>",
            "created":1304571600,
            "id":1100526,
            "title":"shrunk"
        },
        "1211":{
            "author_id":"tiger189a",
            "author_name":"That Goddess",
            "choices":[
                "...mortal",
                "...Immortal",
                "...Immortal, but you can feel the pain!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In this dimension you are...</span></div></span></div>",
            "created":1442293200,
            "id":2034928,
            "title":"stomp"
        },
        "12111":{
            "author_id":"yolomaster89",
            "author_name":"King of all",
            "content":"<div class=\"\"><div> <span>\"Well, goodbye then bug\" he raises his godlike foot over you and wiggles his toes a bit \"enjoy being flattened under my dirty feet!\" With one stomp, you  are reduced to a pulp underfoot, mewtwo enjoys the feeling of you squishing and crunching until you're paste under the godlike foot of mewtwo</span></div></div>",
            "created":1496861700,
            "id":2332620,
            "title":"...mortal"
        },
        "1212":{
            "author_id":"elendias",
            "author_name":"Elendias",
            "choices":[
                "Keep licking. It tastes so good.",
                "Stop licking. The taste is terrible.",
                "Get pinned by giant Mewtwo foot."
            ],
            "content":"<div class=\"\"><div> <span>\"I could clean them up with my tongue.\" you reply. Mewtwo grins and lifts his soles up supported by the heel. You notice his feet are sweaty and smell a little. You look up at him and he nods with a sly grin: \"Get to it then.\". He crosses his arms waiting for you to start licking. A blue-ish aura surrounds him as he levitates sitting on an invisible cushion. You stick out your tiny tongue to lick the wrinkled arches of Mewtwo's foot. The salty sweat coats your tongue. Do you</span></div></div>",
            "created":1492006560,
            "id":2303828,
            "title":"clean"
        },
        "1213":{
            "author_id":"maximize",
            "author_name":"Smartguy",
            "choices":[
                "asleep",
                "awake"
            ],
            "content":"<div class=\"\"><div> <span>you look at how the toes will tower over you and say in-between his toes. Mewtwo then places you in-between his two toes and has fun squishing and moving you around with his toes. this does nothing to you but you enjoy the situation. he keeps going for an hour. by this time he stops and looks down at you. You are...</span></div></div>",
            "created":1304571600,
            "id":1100528,
            "title":"in-between the toes"
        },
        "13":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Puts his mouth on your cock",
                "He's a herm",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"I want to do you anally,\" you say with a devious smile.<br>\r\nMew-two looks at you curiously and floats over to you. He then looks at the buldge in your pants, and relizes what you're asking of him. You take of your pants and boxers, letting your manhood spring out. You lie down. Mew-two sits on you and pushes your cock deep into his tight ass. He moans in pain and extasy, and you do the same. He lifts and sits on your cock, along with the occasional lick on the cheek. You feel that you're reaching your limit.<br>\r\n\"I'm about to cum!\" You cry.<br>\r\nMew-two jumps off and-</span></div></div>",
            "created":1320555600,
            "id":1219143,
            "title":"butt"
        },
        "131":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Go Again",
                "Foot Fetish",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>He jams your cock in his shaft, tightening and releasing, and moving forward and backward, milking you for your semen. You cry out in pleasure as you release a large load in his mouth, some dripping out onto your balls. Mew-two smallows happily and lifts his head, licking his lips for some more fun.<br>\r\n\"What do you want to do next?\" He asks with a smile.</span></div></div>",
            "created":1320555600,
            "id":1219147,
            "title":"Puts his mouth on your cock"
        },
        "1312":{
            "author_id":"mewandlatias",
            "author_name":"LuigiaRocks765",
            "choices":[
                "Some more feet worship...",
                "Maybe sex again...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"I know. I want to worship your feet.\" you say. Mewtwo nods. \"Very well.\" he said. He propped his huge feet infront of you, teasing you. You don't waste a minute and pick up the huge paw in your hand. You flick the tounge agross the arch. It tastes wonderful, the best taste you have felt in your life. You move your tounge up to his toe and lick it. Even more wonderful. You continue to suck the other 2 toes. \"Ahh, that was great human. What should we play now?\" he asked.</span></div></div>",
            "created":1351227600,
            "id":1454334,
            "title":"Foot Fetish"
        },
        "13121":{
            "author_id":"mewandlatias",
            "author_name":"LuigiaRocks765",
            "choices":[
                "Licking the toes clean",
                "Or maybe you can rub my toes?"
            ],
            "content":"<div class=\"\"><div> <span>\"More feet worship. I am enjoying having to worship your feet, Mewtwo.\" you say. Mewtwo bows his head. \"Thank you. I like the fact you are enjoying our playtime.\" he says. \"You decide what kind.\" he adds after about 5 seconds. You decide on..</span></div></div>",
            "created":1351227600,
            "id":1454339,
            "title":"Some more feet worship..."
        },
        "131211":{
            "author_id":"mewandlatias",
            "author_name":"LuigiaRocks765",
            "choices":[
                "Massage the tube coming out of his head",
                "He gives you a foot rub with his giant hand."
            ],
            "content":"<div class=\"\"><div> <span>\"I will lick your beautiful toes clean.\" you decide. Mewtwo nods and sits down. You crawl up to the giant foot and breathe in the scent. It was beautiful, but did have a slight musky scent of sweat. You quickly flick your tounge across the toes. In about 10 minutes you are done. \"Ahhh, you are a good little slave. Now what next?\" he asks.</span></div></div>",
            "created":1351227600,
            "id":1454351,
            "title":"Licking the toes clean"
        },
        "1312112":{
            "author_id":"mewandlatias",
            "author_name":"LuigiaRocks765",
            "choices":[
                "A forest",
                "Mewtwo's room"
            ],
            "content":"<div class=\"\"><div> <span>\"Ahhh, I know, lie down on your back, little human.\" Mewtwo said. You nod. He was so big. (Note: In this part, Mewtwo is a macro) You lay down. \"Now raise your feet.\" he said in his telepathy voice. You nod, wondering why he wanted you to that. He lifted his hand, as if he were going to crush you with it. He slowly lowered the hand onto your feet, and before you know it, he was giving you a footrub. You find that to be relaxing, you felt safe and warm as the three digits on his hand rubbed your feet. The digits then tickled your toes. You grinned and purred. This was wonderful! Mewtwo suddenly stopped and looked up. \"Oh sweet Genesect, look at the time. We should be getting to bed.\" he said and extended his hand. \"Hop in, little guy.\" he said. You nod and climb into the hand, resting in pinkish-purple fur. He began walking deeper into the dimension an then entered a portal. When you and Mewtwo came out, you saw...<br>\r\n</span></div></div>",
            "created":1351314000,
            "id":1454555,
            "title":"He gives you a foot rub with his giant hand."
        },
        "13121122":{
            "author_id":"mewandlatias",
            "author_name":"LuigiaRocks765",
            "choices":[
                "Penis vore",
                "Or how about Mewtwo poops and you eat it?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You looked around and saw a bedroom. It was well arranged, with a large bed in the middle. \"Human, before we drift off, I suppose we should have a little nightime play session. So my little human, what should we do?\" he asks.</span></div></span></div>",
            "created":1351314000,
            "id":1454562,
            "title":"Mewtwo's room"
        },
        "131211221":{
            "author_id":"mewandlatias",
            "author_name":"LuigiaRocks765",
            "choices":[
                "Still inside of Mewtwo",
                "Outside of him"
            ],
            "content":"<div class=\"\"><div> <span>\"How about, I put you inside my dick.\" Mewtwo said. You nod and gulp. Mewtwo spreads his legs, revealing his cock. Soon you were sucked in. \"Have fun.\" Mewtwo said as he fell asleep. The next day, you wake up in the deimension and you are...</span></div></div>",
            "created":1351314000,
            "id":1454743,
            "title":"Penis vore"
        },
        "1312112211":{
            "author_id":"cerfew",
            "author_name":"cxrf3w",
            "choices":[
                "Cum me out?",
                "Digestion?!"
            ],
            "content":"<div class=\"\"><div> <span>You sat in a small room with wrinkly flesh all around, full up to your neck this room was a container for a whitish-purple  sticky too; you had a feeling of just what this was and it made you go erect yourself. . .<br>\r\n<br>\r\nThe liquid stuck to your body, every drop off it tingling around your body giving off a slight tickling sensation. Before you knew it you found yourself relaxing back, leaning into the flesh of one of his balls letting out a load of your fresh and warm cum to mix in with his own. Although it didn't add much to the pool just being submerged within such a beautiful Mewtwo's seed filled you with ecstasy. From the outside you heard his  telepathic voice sounding in your mind, \"Finally you're awake, I couldn't wait to continue our play~.\" That seductive tone of his seemed a bit lewd, just what did he have in mind. . ?</span></div></div>",
            "created":1449205200,
            "id":2070082,
            "title":"Still inside of Mewtwo"
        },
        "13121122111":{
            "author_id":"cerfew",
            "author_name":"cxrf3w",
            "choices":[
                "Your butt. . ?",
                "Why not catch me again?"
            ],
            "content":"<div class=\"\"><div> <span>\"Play? Did you want to try something. . ?\" You ask cautiously, that's when the walls around you started to clench up against you, almost as if they were trying to hug your entire body. Though his insides squeezed at your tiny form you enjoyed it nonetheless before you were forced upward where a tiny hole resided, said hole opened up just enough for you to be shoved through, along with a load of his hot and bothered cum. Alike the way you entered you went into a tight tunnel; from the outside Mewtwo pumped hard at his cock and forced your small body through however fast he could with all the cum that followed you.<br>\r\n<br>\r\nNot a moment later you were fired out his tip, you landed right atop the bed you remembered being in before entering his powerful shaft, upon landing that violet cum poured on every inch of your body forming a small puddle of his sperm with you to soak in. Looking up to the gorgeous psychic you could see a fleshy tongue hanging out of his mouth as he panted. Yet still he didn't seem to pause yet, showering you with another load of his semen before lying down on his chest. Quite close to your face he'd lick his lips before letting out of hot breath of moist air to roll over your nude body. You felt embarrassed inside just to experience such a sensual experience; coated in that purple seed you spotted his deep crimson eyes eyeing you with all the love he could offer. \"Aren't you glad I chose you? Now I'd like you to choose me~,\" he rolled over to lay stomach up, rubbing slowly at his gut while still keeping a close eye on you.</span></div></div>",
            "created":1449205200,
            "id":2070094,
            "title":"Cum me out?"
        },
        "131211221111":{
            "author_id":"cerfew",
            "author_name":"cxrf3w",
            "choices":[
                "Deeper?",
                "Out?"
            ],
            "content":"<div class=\"\"><div> <span>He grinned deviously at your statement before whipping around, lying against the floor like a dog would with his glorious behind his in the air, those muscular thighs only added to his voluptuous rear. After a few moments of your dumbfounded staring Mewtwo's behind slowly swayed back and forth, \"Go ahead~.\" He seemed quite sensual today, and with that you took a few more steps toward that godly ass, only placing a single hand onto the smooth skin which covered it. Your other hand quickly joined in and they both started to rub in a circular motion, essentially massaging his plumpness. You found yourself enjoying this all too much, already growing hard just by the musky scent his butt gave off.<br>\r\n<br>\r\n\"Here it comes!\" And it did, using his titanic ass he pressed it down upon tiny you, his butt pressed you against the ground in attempt to get you between those cheeks, with a little aid of one finger he pushed at your feet getting you lodged tight between the soft mass of her butt flesh. When stuck between them she squeezes his behind as both cheeks clench tight against you, enough to make you shout out, but in pleasure not pain. After a lot of time for him to tease you your face pressed right up against what could only be described as his asshole. You looked into the orifice, smelling a musty stench which made your mind wander off into ecstasy long enough for that hole to open wide. <br>\r\n<br>\r\nThe gaping flesh took your entire body in with what could only be called a swallow, it brought you back into reality quick as ever, but when you became refocused on the situation the light faded from behind you energy he closed his behind tight. \"M-Mewtwo? Y-You're really nice today. .\" you mumble, yet he heard it nonetheless. \"And you're being quite obedient, not like you have much a choice either way; now feel my ass, human~.\"<br>\r\n<br>\r\nHis voice sounded cruel but at the same time so sexual, Mewtwo clenched, tightened, and began to stretch out his hips. On the inside his anal flesh closed in on your body, embracing you with great enough force to put somewhat of a strain on your body, yet even if you felt some pain this entire experience felt alike a dream come true.</span></div></div>",
            "created":1449205200,
            "id":2070103,
            "title":"Your butt. . ?"
        },
        "13121122112":{
            "author_id":"cerfew",
            "author_name":"cxrf3w",
            "content":"<div class=\"\"><div> <span>\"Squirm all you can for me, slave~.\" That tingling began to grow stronger, it began to make you feel lightheaded, like all thought was vanishing from your mind. \"W-what? . . . Mewtwo. .\" Were your final words before you fell into a deep sleep, one you'd never wake from. Mewtwo fondled his balls, giving them a gentle message in attempt to feel your body one last time. \"Goodbye now~.\"<br>\r\n<br>\r\nIt didn't take long for those walls to press and clench tight against your body, the cum within working to make you another steamy load for his balls to hold. With not much to do he'd begin pumping at his powerful length, eventually ejaculating out a heated load with a spot of flesh colored semen within the mix. He did enjoy your company.</span></div></div>",
            "created":1449205200,
            "id":2070097,
            "title":"Digestion?!"
        },
        "14":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Ooh, good idea! ",
                "Disgusting! "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Can you shove me in your cock?\"</span></div></span></div>",
            "created":1516741020,
            "id":2444194,
            "title":"cock"
        },
        "141":{
            "author_id":"wallace6",
            "author_name":"Wallace",
            "choices":[
                "Head first",
                "Feet first"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mewtwo lifted you in air with his powers.<br>\r\nMewtwo: How you want to go in?</span></div></span></div>",
            "created":1581020160,
            "id":2783385,
            "title":"Ooh, good idea! "
        },
        "1412":{
            "author_id":"darkzhadow1177",
            "author_name":"Darkzhadow1177",
            "choices":[
                "Yes but I want you to fuck a male Charizard! (Charizard anal Vore) ",
                "Yes but keep me in your balls forever, I love you "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As your feet entered his cock, you began to slide down easily.... <br>\r\n<br>\r\nMewTwo then stopped<br>\r\n<br>\r\nHe kisses you \"Are You sure?\" He asked </span></div></span></div>",
            "created":1581253380,
            "id":2784776,
            "title":"Feet first"
        },
        "15":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "Your Belly",
                "Your Tail"
            ],
            "content":"<div class=\"\"><div> <span>You tapped your foot to think of something to do. You couldn't think of anything that he'd not find weird. \"How about we just.... relax?\" Mewtwo tilts his head and smiles \"I was sure you were wanting to something else... but I can deal with relaxing.\" He says. He sits down next to you and smiles. you smile back and look around. The dimension was empty, and a deep sea blue. The sky looked like galaxies  rotating around you and the big psychic cat. Mewtwo broke the silence with a chuckle. \"Ya know, Most Pokemon and People are afraid of me... but not you... why? Is it my Past?\" You shake your head \"Yeah, but that's not the real reason why i like you so much.\" Mewtwo tilted his head \"Really? then what do you like about me?\" </span></div></div>",
            "created":1454994000,
            "id":2101942,
            "title":"R&R"
        },
        "151":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "\"What do you eat?\"",
                "\"Why are you slightly chubby?\"",
                "\"You know what, let's talk about something else... I dont want to seem weird.\""
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo tilted his head. \"Why?\" You chuckle and poke it, it wasn't hard, but it was'nt soft either... it was... in between. \"Well... the color for one thing....\" Mewtwo chuckled \"I have to admit, the purple color is kinda appealing... but why my belly? You shrugged \"I dunno, it was just interesting to me... Mewtwo smiles and pats your back \"It is?\" You blush and nod \"Yeah...\" Mewtwo chuckled \"Well since you like it, would you like to know something about it? or would you just like to talk about you?\" <br>\r\n<br>\r\nYou ponder and say: \"Well...</span></div></div>",
            "created":1454994000,
            "id":2101946,
            "title":"Your Belly"
        },
        "1512":{
            "choices":[
                "...is soft and fat.\" (Weight Gain Story)",
                "...Is big and round.\" (Inflation Story)",
                "He says something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Why are you slightly chubby?\"<br>\r\n<br>\r\nMewtwo tilted his head again, he had never thought about that before.<br>\r\n<br>\r\n\"I...I don't know. I guess my stomach was always a bit...chubby\" Mewtwo said as he rubbed his belly again.<br>\r\n<br>\r\nYou blush as he rubbed his purple tummy. It was enticing to see his tummy wobble slightly as his bulbous fingers stroked it, you were almost drawn in a trance.<br>\r\n<br>\r\nMewtwo notices this and smirked to himself. He stops rubbing, knocking you out of your daze.<br>\r\n<br>\r\n\"S-Sorry\" you said, regretting that you said anything in the first place.<br>\r\n<br>\r\n\"Don't be\" Mewtwo wraps his tail around you playfully \"Your here to do whatever you want to do so long as I have fun too. And now I'm pretty sure I know what you REALLY want to do.\" Mewtwo smirks as he closed the space between you two.<br>\r\n<br>\r\n\"You like how my belly...\"</span></div></div>",
            "created":1461042000,
            "id":2136110,
            "title":"\"Why are you slightly chubby?\""
        },
        "15121":{
            "author_id":"scarfed",
            "author_name":"Dewott",
            "choices":[
                "Basket Ball ",
                "Beach Ball"
            ],
            "content":"<div class=\"\"><div> <span>\"You like how my belly's soft and fat, do you?\" Mewtwo asks, his smirk still plastered onto his face. <br>\r\n<br>\r\nYou blush and look away, but in the Mewtwo's grasp, he kept your gaze directed towards his body. \"Y-Yeah...\" You respond, blushing as red as a Charmeleon. Mewtwo chuckles and places your hand on his belly and moves it in a rubbing motion. You blush ever so more as he does this, He purrs like a cat as his soft belly is stroked. \"Y-You know, its N-Not that big and fat... \" You say, blushing, not wanting to embarrass Mewtwo, even though he calmed you down. \"We could change this~\" Mewtwo says, smiling. He levitates upwards, with you in his tail's grip. Mewtwo floats over to a kitchen in the universal like area, the quiant feel of the kitchen is like you were embrassed in a best friend's hug. \"So, I have loads of food here, and I'm allowing you to feed me, How big and fat will I get?\" Mewtwo asks, gently setting you down, and sitting at a table, his chubby belly slightly being seen. <br>\r\n<br>\r\nYou didnt want to over fill him too fast, but you wanted to make his stomach quite big and VERY noticable... You decide to make Mewtwo's Gut as big as a...</span></div></div>",
            "created":1461349140,
            "id":2137520,
            "title":"...is soft and fat."
        },
        "151212":{
            "choices":[
                "Next Day",
                "Later that night"
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo, being a Psychic, seemingly read your thoughts and got excited. A large smile crept up on his face as he saw you walking towards the fridge to start feeding him.<br>\r\n<br>\r\nYou open fridge and see a cornacopia of fatty foods. There was all kinds of food: Ice cream, turkeies, pie, it seemned to go on and on, You didn't know what to feed him first so you just picked what ever caught your eye. There, on the top shelf, was a large chocolate cake, which had 3 layers, strawberries on top, and WAY too much icing for you to handle. It was so huge that it took up the whole shelf and still only barley fitting in.You knew Mewtwo would like this, he always came across as a sweet tooth.<br>\r\n<br>\r\nMewtwo wagged his tail like a puppy as you brought the cake over to the table. You set it down in front of him, his mouth practically watering at the sight. You prepare to cut the cake before Mewtwo grabs it with his paws and started to shovel it into his mouth. Chocolate icing smeared on his cheeks as he munched away. You couldn't help but think it was kinda cute how he ate. <br>\r\n<br>\r\nSoon, Mewtwo managed to eat the entire cake, not leaving a single crumb on the plate. He licks the last bits of icing off his cheeks and leans back in his chair, exposing his now food filled belly. It had definatley gotten bigger since you met him, but not do much to notice at first glance. You were confused, that cake was about 3 times the size of your head, it should be a lot bigger.<br>\r\n<br>\r\nThen you noticed something a bit off about Mewtwo's form. You thought it was a trick of the light at first, but you backed up to get a better look at him, just to make sure. Then you saw it: Mewtwo's belly wasn't bigger, it was fatter. In fact, his whole body was significantly pudgier. His face had developed fat on his cheeks and chin, almost a double chin. His hardened chest plate had softened up into slight moobs. His thighs, which were large before, now we're wide enough to graze each other. His tail had puffed up a bit too.<br>\r\n<br>\r\nSuddenly, Mewtwo's chubby belly gurgled loudly, surprising you and him both.<br>\r\n<br>\r\n\"...heh heh\" you patted Mewtwo's chubby belly \"Looks like your still hungry\"<br>\r\n<br>\r\nMeetwo smiled at this remark. He stood up and, out of the blue, pulled you into a hug. You blushed as his soft chest pressed into your face, his plump tail wrapping around your waist and into his gut. He nuzzled your hair lovingly and whispered in the sultriest to do he could muster:<br>\r\n<br>\r\n\"I'm always hungry~\"<br>\r\n<br>\r\n<br>\r\n--------------One Hour of Feeding Later-----------------<br>\r\n<br>\r\n<br>\r\n\"Yawn\"<br>\r\n<br>\r\nMewtwo yawned as he lied content on the floor. He purred like a cat as you rested your head on his now pillow like belly. You sighed as you rubbed Mewtwo's fat gut, loving how soft and warm it felt and how it squished in between your fingers. <br>\r\n<br>\r\nAfter an hour of eating, Mewtwo had eaten everything in the fridge. About halfway through the feeding, you realized that Mewtwo really is always hungry. It seemned that whatever he ate didn't stay in his stomach for long, and was almost immediately converted into fat.<br>\r\n<br>\r\nNow, Mewtwo's belly had finnaly got as big as a beach ball, although that wasn't the only thing that grew. His cheeks we're as bloated as a chipmunks, his chin, once only a sliver of fat, had grew second and a another on the way, which rested on his thick neck. His moobs grew to the size of the size of watermelons, His legs became the size of large tree trunks, as his huge tail, now as big as a seviper, hung down between his newly formned butt cheeks. The biggest of all was his gut, which was already touching the floor, and stuck out a few feet.<br>\r\n<br>\r\n\"'Sigh\" Mewtwo sighed happily \"'...this was more enjoyable than I thought to would\" Mewtwo pulled you up into another hug, this time however much more softer. <br>\r\n<br>\r\n\"Anything for you big guy\" you returned the hug gladly, you felt more loose around Mewtwo now. At first you were a bit intimidated by his presence, but seeing him act so...not serious loosened you up a bit. You giggled as Mewtwo licked your cheek in a loving manner. You snuggled up closer against Mewtwo soft form. Mewtwo yawned again, this time longer.<br>\r\n<br>\r\n\"Tired?\" You ask.<br>\r\n<br>\r\n\"Yes\"<br>\r\n<br>\r\n\"Too tired to get up?\"<br>\r\n<br>\r\n\"Yes\"<br>\r\n<br>\r\n\"Should I leave you alone to rest?\"<br>\r\n<br>\r\nMewtwo closed his eyes as if he was thinking hard on your question, but really he thought that was a stupid question to ask. To awnser, Mewtwo released you from your hug. Dissapointed, you start to get up from your comfy bed. But before you could, Mewtwo rolled over to his side, making you trip and fall beside him. Then he kept Rolling over until you were completely smothered under him.<br>\r\n<br>\r\n\"No\" Mewtwo smiled. You smile back and slowly drift into sleep.</span></div></div>",
            "created":1461634200,
            "id":2139324,
            "title":"Beach Ball"
        },
        "15123":{
            "author_id":"raverabbit",
            "author_name":"RaveRabbit",
            "choices":[
                "Is ticklish",
                "Is rubbable"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He says something else.  He says, \"You like how my belly...\"</span></div></span></div>",
            "created":1471214760,
            "id":2195932,
            "title":"He says something else"
        },
        "1513":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Rear.",
                "Mouth.",
                "Sack."
            ],
            "content":"<div class=\"\"><div> <span>“Oh come on now, don't be silly! You're not weird at all, human.” Mewtwo reassures you in a polite gesture, floating around you once more. You couldn't tell where he was some of the time, because one moment you could see him but the next you'd be staring into the background of stars.<br>\r\n<br>\r\n“Well- well I mean- I don't know, I mean, er-...” you're becoming quite flustered. He giggles as you cover your head in your hands, face red as a beet as your mind is drowning in perverse situations you could be having. Mewtwo backs off in front of you, only to give a face of understanding. <br>\r\n<br>\r\nFor a moment you thought you saw a hint of disappointment...<br>\r\n<br>\r\n“Oh alright then, what do you want to talk about?” Mewtwo asks in a playful manner, recovering. You summon the courage to ask Mewtwo your first question.<br>\r\n<br>\r\n“Where are we?” You ask him. You're able to lose some of the red that had formulated in your face as his demeanor changed. Mewtwo put his paw against his chin as he answered.<br>\r\n<br>\r\n“Well… it's an illusion,” Mewtwo starts, you stare as he continues, “but maybe it could be a picture of space itself? I mean, I'm strong but to think of everything moving like this?” You follow Mewtwo’s gaze out to the open galaxy.<br>\r\n<br>\r\nStarstruck, but before Mewtwo could get back on topic, you pull out another question. “So why did you decide to meet me?”  <br>\r\n<br>\r\nMewtwo quickly broke his stare and looked directly at you. His mouth couldn't find the words as fast as his brain, and he ended up stuttering and blurting out why at the same time.<br>\r\n<br>\r\n“You- you, uh- so- well, like I said, I saw the way I ad- you admired me, so I brought you here,” Mewtwo immediately straightened up his back and continued, keeping his composure better than you did, “the way you train your Pokémon, and how decisive your battles were, you're a person of a quality much better than a trainer or- really anyone.”<br>\r\n<br>\r\nYou had thought that you had exposed Mewtwo, if he had any personal reasons, but what he said took you aback. You? Exceptional? Decisive? Your spirits rose slightly and your blush came back.<br>\r\n<br>\r\nMewtwo drifted closer to you, his paws on your shoulders as he whispers in your ear, you tilt your head in a gentle sway to capture his words, his breath, “I also saw how lonely you were… not too many humans go so unnoticed at your age…” you felt hit with a pang of unexpected melancholy, your face draining of color as you dwelled on the subject, “and I didn't think that was fair for you… so here you are.”<br>\r\n<br>\r\nThe two of you float in silence for a moment. Mewtwo then places himself in front of you and wraps his arms slowly around your shoulders… “And… well… you know me… angry… unnatural. We're a lot alike you know?”<br>\r\n<br>\r\n“Yeah… you're right.” You admit to him, gently placing your arms around his back in a hug. His purple skin felt a lot like his belly, but with less flesh, just kinda squishy but not like his stomach. Admit it, his body felt nice, the curves, the beautiful color, his tail… you liked it.<br>\r\n<br>\r\nA gleam in Mewtwo’s eyes made them widen as the embrace of you hugging him back wasn't expected. His mouth was agape, about to speak.<br>\r\n<br>\r\n“You… you are special, aren't you.” Mewtwo whispered longingly. You were slightly confused once more as he placed his hands on your hips and lightly adjusted you to be floating in front of him.<br>\r\n<br>\r\n“I… I don't know… you keep saying that but really, I don't know what you mean…”<br>\r\n<br>\r\n“You didn't immediately… well, embrace your desires, you weren't… pushy for some action. Unlike others-” Mewtwo spat under his breath as he said the last two words, a twinge of momentary nervousness felt, “You just- wanted to talk. Everyone thus far I've brought here… only to be met with hidden perverts and two-faced humans. I've never taken a Pokémon in here… unless I was hungry but- only humans, because they were intelligent. I once thought to retract that thought after some had… some had some awfully weird requests. But, it's also my mistake, I bring too many here when I myself feel lone- I mean- I- I feel, pent up I'd say, and go about it the wrong way.”<br>\r\n<br>\r\nYou were amazed, and in pity for Mewtwo, because from what you could hear it sounded like he had been lonely. You reach out to grasp his hand and succeed in him drifting in front of you. His face in front of yours, his hands folded between yours, his hips parallel to your own, and a heat. You goad him to continue, “I know how that feels, people I've met tend to be pushy too, just, not in a sexual way… these days it feels like everyone's so spiteful and just out to get you.”<br>\r\n<br>\r\nMewtwo shot a look at you, one that catches you off guard, a look of sudden fear and shock. “Who? Who's out to get me?!” Mewtwo’s eyes widen and his grip to your hands tightens harshly. The power of his foreign paws, the nubs they were, held such that you let out a yelp of pain. Mewtwo instantly realized his mistake and jerked his paws away from your hands. His face turned red and he gasped, much to the irony of his grand posture. “Sorry- I'm sorry- I just-”<br>\r\n<br>\r\nBefore you let him finish you reach forward to hold his paws again, “No, no, it's fine. I remember, the lab-” Mewtwo’s eyes flickered with attention, he attempts to hold back his past fears, “you're alright, Mewtwo.”<br>\r\n<br>\r\nMewtwo pulled and sprung his arms around your body again, in a hug, but this time you knew there was more to it, and he had squeezed, his head just resting on your shoulder. You patted him on the back to assure him. “Thank you…” he whispered weakly.<br>\r\n<br>\r\nHoping to lead him into a lighter topic, you ask another question. “So…” you start, but he doesn't move much, “I had thought this question earlier, but what do you eat?” You whisper into his ear.<br>\r\n<br>\r\n“Oh, the usual I guess,” Mewtwo sighed, you tilt your head until he realizes that he was being asked what do you eat and not what do you want, “Oh- well… Pokémon for the most part. Berries sometimes,” he pressed his face still into your shoulder, “and when I said weird requests earlier, I meant really weird, some people just sacrifice themselves to me. They do it in different ways too…”<br>\r\n<br>\r\nYou blushed as you realized that he really did mean they were perverted people he had brought here, only to know you're a little bit like that as well. The heat before rose to an uncomfortable shift between Mewtwo’s body being pressed against yours and the fact both of you wanted some attention.<br>\r\n<br>\r\n“Some would wish to be inside of me. They had me swallow them… some had wanted to enter through my backdoor… some had gone down my cock…” Mewtwo wasn't as secretive about it anymore, and you knew he had grown an erection, to which it was pressed against your own flaccidness, “I'll admit it was nice, but I don't think some of them realized this wasn't a dream and fell asleep. I'd end up not needing to eat for a while, else I'd have gallons of cum for the next if they so wished.” You smile nervously as your boner was assaulted by Mewtwo’s own, the only layer in between being your pants. <br>\r\n<br>\r\nMewtwo stopped hugging you and made you look at him, you stare with a meek smile before he leans in to kiss you. You don't resist as he pecks you on the lips. “Well… that certainly was an… enlightening experience…”<br>\r\n<br>\r\nMewtwo smirked gleefully as you both knew where this was going. “It was, wasn't it? Do you… want to… experience it?” Mewtwo licked your cheek playfully.<br>\r\n<br>\r\n“Aheh… well, I'm not too fond of being digested…” you close your eyes and look away shyly. Mewtwo chuckles.<br>\r\n<br>\r\n“Psht- like I'd digest you- worse you'd just be inside of me for a while, I wouldn't digest you even if you pleaded by this point…” Mewtwo smothered the side of your face with saliva and seized your rear with his hands, forcing your body closer to him, animalistically, like he was trying to eat you with his outer body, “because I like you… more so than I think… because you're just like me-” he takes one of his paws and places it behind your head, he proceeds to shove your face into his own, and you feel him sniff your hair roughly, greedily, as if he wanted more from you, “and I like me too… your skin… your smell… your body…”<br>\r\n<br>\r\nYou can barely find words to explain how heated your lower parts were, much less resist his groping and heavy inspection, but you spoke anyways, “I remember you talking about some different entrances?”<br>\r\n<br>\r\nMewtwo’s mouth hangs open as he continues to lick your head, “Yes… those places…” he grips your arms and suddenly the two of you drop, landing on a nonexistent floor. He kneels and drags you down to the ground, but he pushes you backwards and you find yourself supine to him. The psychic type’s legs spread over the floor, his bottom just resting below your cock. Mewtwo leans forward and slyly presses your shoulders to the ground, pinning you under his paws as he drooled. “I'll take these off for you~” Mewtwo’s eyes glew a bright pink before your clothes suddenly vanished.<br>\r\n<br>\r\n“Oh…” you shudder. Your rod was pushed down onto your body along with Mewtwo’s as the Pokémon lay atop you.<br>\r\n<br>\r\n“Yes… so what will it be?” Mewtwo asks seductively, posing his question with a lusty gleam into your eyes.<br>\r\n<br>\r\n“Well… what I meant that I was interested in the supposed… gallons of cum.”<br>\r\n<br>\r\n“You want to be in my sack?” Mewtwo smiles.<br>\r\n<br>\r\n“No… I mean… I wanted to see you do it… what if I fed you some Pokémon so that you may make that?” You explain. Mewtwo is somewhat surprised at that, but nonetheless interested. “Actually… I don't mean to be pushy, but I want to watch you take others into your rear and mouth too.”<br>\r\n<br>\r\n“Alright then. Which hole first?”<br>\r\n</span></div></div>",
            "created":1543177680,
            "id":2581849,
            "title":"A Bit of Depth"
        }
    },
    "info":{
        "author_id":"maximize",
        "author_name":"Smartguy",
        "brief_description":"you wake up in a strange dimension. only to find mewtwo brought you there.",
        "created":1304627760,
        "description":"<td align=\"left\" class=\"norm\">This is the first story I wrote based on Mewtwo and you doing various things.<br>\r\n<br>\r\nThis story has over 9,000 views and is close to being 10,000. I encourage people to add and share their experience with Mewtwo.<br>\r\n</td>",
        "id":1773875,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602726360,
        "modified":1602726360,
        "pretty_title":"Mewtwo and you"
    }
}