{
    "chapters":{
        "1":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "you decide which you want"
            ],
            "content":"<div class=\"\"><div> <span>\"ARE YOU OUT OF YOUR MIND?\" spike yells as you walk towards the center. \"do you have ANY idea what will happen if anyone finds out you, ok, scratch that, WE actually play this game.\"<br>\r\n\"oh relax will you.\" you say, \"you always take things so seriously, yeesh\"<br>\r\n\"AND\" spike drawls on, \"i can't believe you dragged lily into this\"<br>\r\n\"hey, i'm just interested in it for personal reasons\" lily argues. here we go again, spike and lily having another one of their famous arguments.............. again.<br>\r\n\"can you help me out here.\" spike asks you.<br>\r\n\"hey, don't look at me\" you grumble, \"i'm stayin' out of this.....................again\" <br>\r\n\"thank you\" lily sighs as you reach the online center.<br>\r\nas you walk in, you can't seem to shake the feeling that a sinister shadow has followed you inside.<br>\r\nyou, spike and lily walk up to the counter and the receptionist asks if you want partner A, B or C to travel with you</span></div></div>",
            "created":1205974080,
            "id":510725,
            "title":"the beginning"
        },
        "11":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "A (monmon)",
                "B (kotemon)",
                "C (kumamon)"
            ],
            "content":"<div class=\"\"><div> <span>you quickly make up your mind and speed of to the capsule room before spike or lily have even chosen.<br>\r\nas you enter the capsule room, hundreds of capsules seem to be lined from wall to wall, you dash for the nearest capsule and enter it just as lily enters.<br>\r\n\"hey, wait up!\" she cries after you.<br>\r\nin the capsule, you slip asleep as the capsule does its work, but as it does, a shadow envelopes it from the inside, causing a glitch in the system.<br>\r\nyou wake up in a field somewhere and you know that you are definately in the digital world now. as you walk around, you can't shake the feeling you are being followed.<br>\r\n\"BLAST BLAZE\" yells a voice and a fire ball narrowley misses you. as you whirl around, you find your self face to face with a tyrannomon.<br>\r\n\"this is not good\" you mumble as the tyrannomon stares you in the face, before roaring as you turn and run. the chase runs across at least half the field, the scilence shattered by the booming sound of \"BLAST BLAZE\" and the loud thud of footsteps leaving footprints across the grass. finally you find yourself cornered between a cliff and the large bulking mass of data that is tyrannomon. what you think is your last thought is where is your partner when you need him the most as tyrannomon begins his attack<br>\r\n\"BLAST-\"<br>\r\n(think fast, what was the choice you chose. A, B, or C)</span></div></div>",
            "created":1205978940,
            "id":657805,
            "title":"TO THE DIGITAL WORLD"
        },
        "111":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "look for spike and lily",
                "head for the forest",
                "go to asuka city"
            ],
            "content":"<div class=\"\"><div> <span>\"-BLAZE\" tyrannomon finishes as the fireball erupts from its mouth.<br>\r\n\"SWING-SWING\" another voice erupts. a ball of energy hits the fireball and disperses it.<br>\r\n\"SWING-SWING\" another ball connects with tyrannomon and sends the champion level sprawling backwards in a stream of data. you follow the data stream to a digimon.<br>\r\n\"wait a minute\" you whisper, \"green monkey, odd tunic, overly-large slingshot. you're monmon!\" you erupt.<br>\r\n\"yes i am\" monmon says.<br>\r\n\"wait, are you my partner?\" you ask.<br>\r\n\"i am your partner.\" monmon chirps.<br>\r\n\"cool\" you grin. \"ok where do we go now?\"</span></div></div>",
            "created":1205988660,
            "id":510701,
            "title":"monmon to the rescue"
        },
        "112":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "look for spike and lily",
                "head for the forest",
                "go to asuka city"
            ],
            "content":"<div class=\"\"><div> <span>\"-BLAZE\" tyrannomon finishes as the fireball erupts from its mouth.<br>\r\nall of a sudden a small form jumps in front of you, using its sword to block the fireball. \"hot head\" the form whispered leaping at the tyrannomon, bringing its sword down on the dinosaur digimon's skull. the tyrannomon fell, data streaming from the skull. the mysterious digimon absorbed the data, then showing its true form. it was some kind of dinosaur with armour, armed only with its sword. facing you, the digimon bows to you.<br>\r\n\"are you a kotemon?\" you ask. the kotemon nods.<br>\r\n\"so you must be my partner?\" you conclude. kotemon nods again.<br>\r\n\"not much for talking are you?\" you ask. yet again, kotemon nods.<br>\r\n\"ah boy\" you grumble, \"ok, lets go then\"</span></div></div>",
            "created":1205989440,
            "id":510711,
            "title":"the silent guardian"
        },
        "1122":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "jump and attack first",
                "brawl it out at close range"
            ],
            "content":"<div class=\"\"><div> <span>As you look around the landscape, you see an ancient forest on the horizon.<br>\r\n<br>\r\n\"Wow\" you whistle, \"Maybe that forest leads to civilization. what do you think kotemon?\" the digimon nods at you with a blank look on what you can see of his face.<br>\r\n<br>\r\n\"oooooooook\" you say akwardly, \"let's go then\" you roll your eyes without kotemon noticing. as the two of you walk under the vast branches of the forest, you can't help but fell like you're being watched.<br>\r\n<br>\r\n\"KNIGHT BLADE!\" a sword crashes between you and kotemon, slicing a tree in half. down from the trees came a figure, armour covering every area of its body. it grabs the hilt of the sword and pulls it from the remains of the stump effortlessly. \"Stay where you are\" the figure growls, \"if you wish to pass, you must defeat me first.\"<br>\r\n<br>\r\n\"ok\" you say confused, \"Who, or what, are you?\"<br>\r\n<br>\r\n\"I AM KNIGHTMON\" the figure booms, \"DIGIMON GUARDIAN OF THIS FOREST. NOW, PREPARE TO PERISH AT MY SWORD! KNIGHT BLADE!!!\" the sword starts to drop, your head its obvious target.<br>\r\n<br>\r\n\"hot head\" kotemon's kendo crashes right between your head and knightmons sword. he jumps at knightmon, clashing sword-to-sword against the golden armour cladded digimon.<br>\r\n<br>\r\n\"you are strong\" Knightmon growled, \"but i shall finish this.\" you gulp as knightmon swipes the ancient sword, knocking your partner to the ground. <br>\r\n<br>\r\nyou look at a tree, more ancient than the others, and see a shrine in the trunk. in the shrine was is an odd looking device. you run up to the ancient tree and grab the device from the altar. \"come on, whatever you are\" you say, pressing the three buttons on it. \"my partner is about to be taken down, and you really are'nt helping\" <br>\r\n<br>\r\nKnightmon turns and sees you messing around with the device and starts advancing on you. the device suddenly starts glowing, and you and kotemon start glowing. the digivice suddenly says in a mechanic voice. \"MERGE DIGIVOLUTION\"<br>\r\n<br>\r\n\"kotemon merge digivolve to...\" you suddenly merge with kotemon, and in the spot, was a human looking digimon with a brown and blue coloured tunic covering you. a red cape tied to your back, a pair of blue boots on your feet and a sword grasped in both of your hands. \"SABREMON!\" you stand there, your cape billowing in the wind, the sword ready for battle. \"knightmon, your reighn of terror on this forest ends now!\" you charge at knightmon, sword in attack position. knightmon readies his sword and the fight begins.</span></div></div>",
            "created":1214416380,
            "id":548354,
            "title":"merge digivolution"
        },
        "11222":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Head for Asuka city",
                "Look for spike and lily"
            ],
            "content":"<div class=\"\"><div> <span>You slash at Knightmon. instantly, Knightmon blocks it and the duel is on. the sound of your swords clashing rings through the empty forest as you strike, parry and block through the battle. you finally back away, rather breathless from the duel.<br>\r\n<br>\r\n\"This isn't working, we gotta try something else\" you say. the silence that follows afterwards is soon broken by Knightmon's battle cry as he charges towards you. you block the sword and back off. as you do though, your sword starts to glow red hot. you notice this and grin. \"This ends now Knightmon\" you say as you run at him, sword set to strike. \"BURNING BLADE!\" the sword destroys Knightmon's sword and crashes deep into his armour.<br>\r\n<br>\r\n\"This is.........impossible.......how...........could i be beaten........by a............child\" Knightmon groans as he crashes to the forest floor. data pours from the fallen knight as he falls. you open your arms and let yourself absorb the data before splitting back to yourself and Kotemon.<br>\r\n<br>\r\n\"Wow\" is all you can say as you return to normal, \"Wow\".<br>\r\n<br>\r\n\"Is that all you can say?\" says a voice from nowhere. you look around but all that is there is Kotemon.<br>\r\n<br>\r\n\"Was that you?\" you ask.<br>\r\n<br>\r\n\"Yes\" Kotemon says, \"when you and I merged to Sabremon, a telepathic bond was formed between us. now I may talk to you whenever i want.\"<br>\r\n<br>\r\n\"Cool\" you whistle. \"So, what now?\" you ask.<br>\r\n<br>\r\n\"We should head for Asuka city to reasure everyone you are safe\" Kotemon says.<br>\r\n<br>\r\n\"But what about my friends, Spike and lily?\" you ask, \"We have to see if they are safe\"<br>\r\n<br>\r\n\"Ok\" Kotemon says, confused, \"what should we do then?\"</span></div></div>",
            "created":1215116640,
            "id":657804,
            "title":"swords, data and telepathy"
        },
        "113":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "look for spike and lily",
                "head for the forest",
                "go to asuka city"
            ],
            "content":"<div class=\"\"><div> <span>\"-BLAZE\" tyrannomon finishes as the fireball erupts from its mouth.<br>\r\n\"OH NO YOU DON'T!!!\" a voice yells and some kind of bear jumps in the path of the fireball, sending it back at the tyrannomon.<br>\r\n\"now, BEAR FIST\" the bear yelled, sending the dinosaur digimon sprawling backwards in a stream of data thanks to a punch in the chest. as the bear absorbs the data, you get a good look at the bear. there is a blue belt round his torso, wih other belts wrapped around his hands.<br>\r\n\"nice to meet you\" the bear suddenly notices you and starts shaking your hand \"my name is kumamon and i'm guessing i'm your partner.<br>\r\n\"i guess so too\" you chuckle<br>\r\n\"alright\" kumamon grins \"lets go then\"</span></div></div>",
            "created":1205989980,
            "id":510719,
            "title":"digimon jakie chan"
        },
        "1131":{
            "author_id":"foxxking",
            "author_name":"kingfoxx",
            "choices":[
                "Takuya",
                "Luna",
                "Sora"
            ],
            "content":"<div class=\"\"><div> <span>You and Kumamon walk though the field looking for Spike and Lily. Suddenly, you see an old man sitting in a lawn chair. \"Who's that?\" Kumamon asks you. \"You're gonna need this.\" the old man says to you as he throws a golden digivice and a white gem to you. \"What's th-\" you began to ask as you see Lily and a Lalamon being chased by a Veemon with red eyes. Te digivice began to heat up. \"BURNING...FIST!!!\" Kumamon shouted, eyes blazing, when he punched Veemon the stomach and sent him flying into a tree. The digivice flies out of your hand onto the Veemon's forehead, leaving a small cross on it's forehead. The Veemon was then sucked into the stone, turning it a lite blue color. The stone was absorbed into the digivice. Lily explaines everything to you. \"So there's a glitch in the sytem...\" You say to your self. \"Oh, yeah! This is my partner: Lalamon.\" Lily tells you and Kumamon. \"Hey, did you tell your digivice your and your digimon's name?\" Lily asks you. \" No. I forgot. At least I know why that Tyrannomon attacked me...\" You replied, emberassed. \"Well, better do it now.\" Lily tells you. \"Okay. My name is...</span></div></div>",
            "created":1214206620,
            "id":547513,
            "title":"Lily and the glitch"
        },
        "11311":{
            "author_id":"foxxking",
            "author_name":"kingfoxx",
            "choices":[
                "Togemon block it.",
                "His fist begins to glow."
            ],
            "content":"<div class=\"\"><div> <span>...Takuya.\" \"Your digimon's name?\" Lily asks you, Curiously. \"How bout'... Zero!\" You shout, excitedly. \"So I'm Zero now, huh? Cool!\" You hear a roar come from the forest on your right and Spike yell. You, Lily, and your digimon run into the forest to see Spike and a terriermon fighting a Togemon. They were getting beat. Bad.. A little kid ran up and tried to attack it with a lopmon. \"No! stay away!\" you yelled to the kid. The Togemon destroyed the Lopmon. The child fell to her knees, crying. You could feel anger rising inside me. \"Zero... I want that digimon gone...NOW!\" you shouted to Zero. Suddenly, your digivice begins to glow. You become so angry that you punch the Togemon the face. \"DNA Fusion Charge!\" Kumamon then digivolved. He had a steel V on his forehead, Boxing gloves, and belts around his arms. \"V-Kumamon!\" Zero jumped toward the Togemon prepared to punch when...</span></div></div>",
            "created":1214209800,
            "id":547536,
            "title":"Zero and the DNA Fusion Charge"
        }
    },
    "info":{
        "author_id":"edd682",
        "author_name":"Arcangel",
        "brief_description":"save yourself, your friends and the world",
        "created":1205971440,
        "description":"<td align=\"left\" class=\"norm\">you and your friends are starting to play digimon online. but as you do, an evil force begins to rift into the system.<br>\r\ncan you and your partner save the digital world, and more importantly your world before it's too late?<br>\r\n<br>\r\ndon't forget to keep it like a kids program, k?</td>",
        "id":1402926,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1236547500,
        "modified":1236547500,
        "pretty_title":"Digimon world"
    }
}