{
    "chapters":{
        "1":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "I am a Ninja",
                "I am a Konoichi"
            ],
            "content":"<div class=\"\"><div> <span>The trees wizzed by as you jumped from branch to branch, rushing towards the destination that was the object of your mission. You had been traveling for a few days now, and couldn't wait to get there so you could start heading back to the Hidden Leaf Village. Soon, you stopped on a high branch, resting your hand on the trunk, your destination now in view. You took in a deep breath, and sighed.<br>\r\n<br>\r\nSpeaking of which, who are you?</span></div></div>",
            "created":1504587600,
            "id":2380487,
            "title":"Mission Start!"
        },
        "11":{
            "author_id":"jikirauchiha",
            "author_name":"Aron Clancy",
            "choices":[
                "Sakura",
                "Hinata",
                "Ino",
                "Tenten",
                "Someone else, (Maybe from another Village?)"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Yuu, and you are the most unremarkable Ninja in the Village. Honestly it would be easy for anyone to forget you even exist. You don't excel at your missions, you don't do amazing in fights, hell you're only <b>decent</b> at ninjitsu. You just..... fade into the crowd. So, when you found out who your partner was, you were quite shocked. <b>How</b> you got paired up with one of the most talented and well-known Konoichi in your village, you'll never understand. Your only goal with this mission is to not embarrass yourself................... as the branch you're standing on breaks and you start to fall to the ground before your partner grabbed your hand. \"Honestly, you really need to be more careful Yuu.\" You look up and see the exasperated face of.......... </span></div></div>",
            "created":1552205040,
            "id":2628328,
            "title":"The most unimportant Ninja"
        },
        "12":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Sakura",
                "Hinata",
                "Ino",
                "Tenten",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You are a Konoichi, and a proud one at that. Your name was Lisa, a well known Shinobi in the Hidden Leaf. One, for being incredibly smart and rather gifted in the art of ninjitsu, and two, because you were one of the prettiest looking Konoichi in the Hidden Leaf. Your tan skin, round face, sizeable breasts, and incredible ass always got a lot of lustfull looks from the guys around town, and some of the girls too.<br>\r\n<br>\r\nAnyways, now at you're destination, you sigh happily as you catch your breath.<br>\r\n<br>\r\n\"Is that it?\" You turn around and see...</span></div></div>",
            "created":1504587600,
            "id":2380499,
            "title":"I am a Konoichi"
        },
        "121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Sakura hears you and finds you",
                "Sakura hears you, but can't find you",
                "Sakura can't hear or find you"
            ],
            "content":"<div class=\"\"><div> <span>\"Let me see.\" Your partner, Sakura, said.<br>\r\n<br>\r\nYou moved out of the way and she looks to see the object that they're searching for.<br>\r\n<br>\r\n\"Yep. That's the one, Lisa.\" Sakura said.<br>\r\n<br>\r\n\"Great! Let's grab this scroll and get out of here.\" You said you took the scroll and you and Sakura turned to head back towards the leaf. It was getting dark and you two decided to camp out in the woods for the night. You've grown curious about the scroll you took and you wondered what it could do. You opened the scroll and a puff of smoke, suddenly, came out of it that causes you to black out. You wake up and you've noticed that you'd shrunk.<br>\r\n<br>\r\n\"Woah! I'm small! Did the scroll did this to me?!\" You wondered.<br>\r\n<br>\r\n\"Lisa? Where did you go?\" Sakura asked as she doesn't see you.<br>\r\n<br>\r\n\"Sakura! I'm down here!\" You called out to her and</span></div></div>",
            "created":1504587600,
            "id":2380590,
            "title":"Sakura"
        },
        "1211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "\"....in my mouth.\"",
                "\"....in my panties.\"",
                "\"....in my boot.\""
            ],
            "content":"<div class=\"\"><div> <span>Sakura heard you calling to her and she looks down on the ground to see you so small, much to her shock. She bends down and grabs you to pick you up towards her face.<br>\r\n<br>\r\n\"Lisa?! What happened to you?!\" Sakura asked.<br>\r\n<br>\r\n\"It was that scroll. I opened it to see what it can do and it made me this little.\" You explained.<br>\r\n<br>\r\n\"Well, are you okay, though?\" Sakura wondered with concern.<br>\r\n<br>\r\n\"I'll be fine, Sakura. Where did I dropped that scroll?\" You wondered as you looked around.<br>\r\n<br>\r\n\"It must've disappeared after you opened it.\" Sakura said.<br>\r\n<br>\r\n\"Well, this is just great. What are we gonna do now?\" You complained.<br>\r\n<br>\r\n\"You can stay with me until we can sort this out, somehow.\" Sakura suggested.<br>\r\n<br>\r\n\"That does sound like a good idea. Sure.\" You said.<br>\r\n<br>\r\nSakura took you into the tent and sets you on her sleeping bag next to her face before she drifted to sleep. You smiled to her before you went to sleep too. Next morning, you girls wake up and put all of your stuff away before it's time to head out.<br>\r\n<br>\r\n\"Now listen, Lisa. I can't have you hanging on my shoulder or in my hand because I'm afraid you'll fly right off. So, I'll have to carry you for now.\" Sakura suggested.<br>\r\n<br>\r\n\"Sure thing, Sakura. Where are you carrying me in?\" You wondered as you looked up at Sakura's face, which you noticed that has a big blush on her cheeks.<br>\r\n<br>\r\n\"Well, I don't have any pockets on me and my pouch is, kinda, dangerous for you with all of my weapons and all in there. So, I'll carry you....\"</span></div></div>",
            "created":1504932780,
            "id":2382640,
            "title":"Sakura hears you and finds you"
        },
        "122":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Scream!",
                "What happened?",
                "Faint"
            ],
            "content":"<div class=\"\"><div> <span>Hinata, your partner in this mission, lands right behind you.<br>\r\n<br>\r\n\"Yep,\" you reply. \"This is it.\"<br>\r\n<br>\r\nThe two of you look upon an old abandoned temple. Apparently a scroll with a very powerful ninjitsu rests there, and you two have been sent to retrieve it.<br>\r\n<br>\r\n\"Let's go!\" you say running up to the building and going inside, Hinata close behind. You venture through the old temple, and eventually come across a scroll room. There are many scrolls scattered around the place, and so you and Hinata have no choice but to search through them all.<br>\r\n<br>\r\nAs you look through them, you come across a particularly odd one. It's not the one you're looking for, but you still decide to take a look at it. It describes something about altering something's size. Curious, you make the hands signs as instructed, and activate the jutsu.<br>\r\n<br>\r\n\"Size alter jutsu!\" You shout, and everything goes white.<br>\r\n<br>\r\nWhen you wake up, you see that you're on something soft. Looking around, you see you're one something that's slightly pale, but soft like skin.<br>\r\n<br>\r\n\"Oh thank goodness you're awake!\" Looking up, you see the giant face of Hinata.</span></div></div>",
            "created":1504587600,
            "id":2380516,
            "title":"Hinata"
        },
        "1222":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "She holds you above her breasts",
                "She lowers you to her panties +",
                "She raises you up to her mouth."
            ],
            "content":"<div class=\"\"><div> <span>\"Hinata, what happened?\"<br>\r\n<br>\r\n\"Well, when you used that jutsu, there was a bright white flash, and when I had looked back you had shrunk!\"<br>\r\n<br>\r\n\"I what?\"<br>\r\n<br>\r\n\"Shrunk! I'd say you're only an inch tall now.\" You sat in shock for a moment. How the he'll did this happen? Then you remembered the scroll.<br>\r\n<br>\r\n\"Hinata, what about the-\"<br>\r\n<br>\r\n\"The scroll? It disappeared after the bright white light.\"<br>\r\n<br>\r\n\"So you mean I'm stuck like this?\"<br>\r\n<br>\r\n\"For now, yeah. But maybe when we get back Tsunade can fix you!\"<br>\r\n<br>\r\n\"Hopefully. So, do we have the right scroll?\"<br>\r\n<br>\r\n\"Yep!\"<br>\r\n<br>\r\n\"Then let's go!\" Hinata nodded and left the building. However, you soon encountered a problem.<br>\r\n<br>\r\nWhen Hinata ran out of the building, you were on her shoulder. The moment she sped up, you nearly fell off, only just barely caught by Hinata.<br>\r\n<br>\r\n\"Oh my gosh are you okay!\" she asked worried.<br>\r\n<br>\r\n\"Yeah, just scared me a little,\" you say catching your breath from the horrible experience. \"So, this is a problem.\"<br>\r\n<br>\r\n\"Yeah. We need to put you somewhere where I can carry you and won't have to worry about you falling out.\" Hinata thought for a moment, then blushed.<br>\r\n<br>\r\n\"Well, you could...\"</span></div></div>",
            "created":1504587600,
            "id":2380521,
            "title":"What happened?"
        },
        "12222":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, you could stay in here,\" Hinata said lowering you to her crotch. You stared up at her in disbelief.<br>\r\n<br>\r\nSee, you had always secretly liked Hinata, but you were never brave enough to tell her because you knew she liked Naruto. Still though, you had become close with her, and she wouldn't offer this to just anyone.<br>\r\n<br>\r\n\"You... you'd really let me in there?\"<br>\r\n<br>\r\n\"Y-Yeah,\" Hinata said nervously. \"It's just to carry you right? I don't have any pockets, and if you were in my cleavage then you have a chance of falling out, and it'd be hard to catch you. If you're in there, you won't fall out, and I'll be able to feel you so I'd know if you did somehow fall out.\"<br>\r\n<br>\r\n\"I... guess that makes sense.\" Hinata nodded nervously. She grabbed the waist band of her pants and pulled them open, along with her panties. Slowly, she lowered you in, setting you gently on the fabric of her panties.<br>\r\n<br>\r\n\"R-Ready?\"</span></div></div>",
            "created":1504587600,
            "id":2380666,
            "title":"She lowers you to her panties +"
        },
        "122221":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Wake up still in her panties",
                "Wake up in her lap",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Um... yeah, I'm ready,\" you said, looking up at Hinata.<br>\r\n<br>\r\n\"Alright, here we go then.\" Hinata let go of her pants, allowing both them and her panties to snap back into place, pressing you against her nethers. You heard Hinata gasp slightly as you she felt you against her sex. She blushed heavily, and rubbed her crotch where you were currently nestled. \"You okay in there?\"<br>\r\n<br>\r\n\"Y-Yeah!\" you reply, blushing madly as you were held against your crush's privates.<br>\r\n<br>\r\n\"Okay, I'm gonna start moving. Tell me if you start slipping out or something okay?\"<br>\r\n<br>\r\n\"Okay!\" With that, Hinata started to head home. You however took the time to admire the massive lips you would be snuggled with for the next few hours. They were soft, pink, and clearly untouched by anything but her own hand. You also noticed that she shaved down her, which was something you always preferred.<br>\r\n<br>\r\nHinata meanwhile was blushing the entire time she ran. See, Hinata had always secretly liked you too. She was just too shy to tell you about it. And now her crush was in her pants, just not the way she expected. With every step she took, she could feel you rub against her lips, which was starting to make her feel hot. She just hoped she could hold it together and not make the situation awkward.<br>\r\n<br>\r\nAs you rode inside her panties, the warmth and the surprising comfiness started to make you drowsy. Soon you closed your eyes, and fell asleep.</span></div></div>",
            "created":1504587600,
            "id":2380668,
            "title":"Yes"
        },
        "1222211":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "=====> +"
            ],
            "content":"<div class=\"\"><div> <span>When you woke up, you were still pressed up against Hinata's sex. From what you could hear, Hinata was setting up camp. You shuffled a little, which made Hinata giggle. She pet you gently, which made you smile in return.<br>\r\n<br>\r\n\"Hinata?\"<br>\r\n<br>\r\n\"Oh, Lisa! Are you awake?\"<br>\r\n<br>\r\n\"Yeah. What time is it?\"<br>\r\n<br>\r\n\"I'm not sure, I'd say maybe eight. Here, let me get you out of there.\" Hinata reached into her panties and pulled you out. She brought you up to her face, a gentle smile gracing her lips and a slight blush on her cheeks. \"Sleep well?\"<br>\r\n<br>\r\n\"Um... y-yeah, I did.\"<br>\r\n<br>\r\n\"Oh good. Well I think it's about dinner time. You hungry?\" Your stomach growling answered that for you. \"I'll take that as a yes.\"<br>\r\n<br>\r\nSetting you on her shoulder, Hinata started up dinner. She started making some travel noodles, taking out a pot and using water from a nearby river to boil them over a fire. Once they were done, Hinata got herself a bowl, and gave you one of her smaller noodles, which you ate happily. After eating your piece, you rested against Hinata's neck, sighing in content.<br>\r\n<br>\r\nHowever, that didn't last for long.<br>\r\n<br>\r\nYou started to think about your predicament, and how scary the world was now. Everything was so huge now, the trees, the animals, your own partner. It was all so big, and so terrifying. Your life would never be the same now. You would need help with everything now. You couldn't get to different locations at a quick pace, you'd no longer be able to do missions solo, and now you couldn't even fight! Were you still a Konoichi?<br>\r\n<br>\r\nNot to mention the fact it was so easy to kill you now! What would happen if you encountered a hungry animal? You'd be eaten. What if you were on the ground and someone didn't notice you in their path? You'd be crushed. And what if you fell in someone's food and they didn't see you? You'd be devoured! All of this built up in your mind, and you couldn't help but she'd some tears. Your cries were quiet, but when it came to the cries of those she cared about, Hinata's hearing was more acute than Akamaru's.<br>\r\n<br>\r\n\"Lisa?\" she asked worridly. \"What's wrong?\"<br>\r\n<br>\r\n\"It's just... everything's different now. I'm so small, so helpless. Nothing will ever be the same!\"<br>\r\n<br>\r\n\"Hey,\" Hinata said putting her noodles down and taking you into the palm of her hand. \"Don't think like that. Everything's gonna be okay, we'll fix this you'll see.\"<br>\r\n<br>\r\n\"And what if we can't? What if Tsunade doesn't know how to get me back to normal? What if I'm stuck like this forever?\"<br>\r\n<br>\r\nYou burst into tears, crying into your hands as your fears grew. Hinata looked at you worridly. You were right, what if they couldn't fix this? What would happen to Lisa? Hinata thought for a moment, and knew exactly what would happen.<br>\r\n<br>\r\n\"Then I'll take care of you.\" You paused.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"If we can't find a way to fix this, then I'll take care of you. I promise that I won't leave you alone. I'll always be there for you.\" Hinata hugged you to her breast. \"Always.\"<br>\r\n<br>\r\nYou started to cry again, hugging Hinata breast as you she'd your tears. Hinata merely rubbed your back.<br>\r\n<br>\r\n\"Shh, it's gonna be okay Lisa. Shh.\" Hinata consoled you as you cried, gently rubbing your back as you let it all out. Eventually the water works stopped, and you looked up at Hinata.<br>\r\n<br>\r\n\"Thanks, Hinata.\"<br>\r\n<br>\r\n\"Of course Lisa.\" You yawned loudly and stretched out. \"Tired huh?\"<br>\r\n<br>\r\n\"Yeah.\"<br>\r\n<br>\r\n\"Me too. How about we get some sleep?\"<br>\r\n<br>\r\n\"Sure.\" Hinata nodded.<br>\r\n<br>\r\nSetting up a sleeping mat, Hinata laid her sleeping bag in top of it and got in. She took you from her shoulder, and nestled you into her cleavage, close to her heart.<br>\r\n<br>\r\n\"Night Lisa,\" she said with a smile and a slight blush.<br>\r\n<br>\r\n\"Sweet dreams Hinata,\" you replied, a blush and a smile adorning your face. The two of you closed your eyes and fell asleep.</span></div></div>",
            "created":1504632900,
            "id":2380693,
            "title":"Wake up still in her panties"
        },
        "12222111":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Hinata noticed",
                "Hinata didn't notice."
            ],
            "content":"<div class=\"\"><div> <span>The next morning, you wake up still between Hinata's breasts. Being in this particular spot makes you blush heavily, but you can't help but snuggled into the soft mammary glands of your giantess partner. Soon, Hinata awakens as well, and so, to see what she would do, you pretended to be asleep.<br>\r\n<br>\r\nHinata sat up and stretched. Then, feeling something in her cleavage, she remembered where she put you last night, and smiled as she looked at your sleeping form. She smiled and gently pet your head.<br>\r\n<br>\r\n\"So cute,\" she said quietly. Then her expression turned a little somber. \"Oh Lisa, if only I was brave enough to tell you how much I love you.\"<br>\r\n<br>\r\nHow much she loved you? Well this was a surprise. Didn't she like Naruto? You'd have to investigate this later. For now, you decided to wake up. Yawning, you stretched your arms out and opened your eyes.<br>\r\n<br>\r\n\"Hinata?\"<br>\r\n<br>\r\n\"Morning Lisa.\"<br>\r\n<br>\r\n\"Morning.\"<br>\r\n<br>\r\n\"Hungry?\" Your stomach growled. \"I guess so. Let me get breakfast started.\"<br>\r\n<br>\r\nHinata took out some breakfast noodles and boiled them. Giving you a noodle from her bowl, Hinata then started eating hers, you following suit. Soon breakfast was finished, your things were packed, and it was time to leave.<br>\r\n<br>\r\nHinata plucked you from her cleavage and held you out.<br>\r\n<br>\r\n\"Ready?\" You nodded. \"Alright, here we go.\"<br>\r\n<br>\r\nHinata pulled out her pants and panties again, and lowered you inside. She then let her pants snap close, trapping you inside. With you now snuggled in her panties, Hinata patted you before taking off, jumping from branch to branch as she made her way home.<br>\r\n<br>\r\nThere wasn't all that much for you to do while inside there. All you could do was sit there, pressed against her lips, and wait. You then remembered what Hinata had said that morning and smiled.<br>\r\n<br>\r\n\"I love you too Hinata,\" you said, giving her sex a gentle kiss.</span></div></div>",
            "created":1504635180,
            "id":2380701,
            "title":"=====> +"
        },
        "122221111":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Were asleep",
                "Were awake"
            ],
            "content":"<div class=\"\"><div> <span>Hinata blushed as she felt your lips press against her sex. However, she didn't make much of it, thinking that you probably just accidently brushed your lips against her nethers. Even so, some small part of her hoped it was intentional.<br>\r\n<br>\r\nHinata spent the whole day running. Whenever she stopped to rest, she would talk to you if you were awake. But for now, you were alseep, so she sat alone with her thoughts.<br>\r\n<br>\r\nShe thought back to when you kissed her sex. Had that been an accident? She hoped not, but she doubted you did it on purpose. She looked down at her crotch, knowing you were just below the fabric.<br>\r\n<br>\r\n\"Oh Lisa,\" she muttered. She reached down into her panties and gave your back a gentle rub. Inadvertently, doing so rubbed you against her nethers, which made her blush, but she continued.<br>\r\n<br>\r\nShe began to lightly rub you up and down her entrance, blushing as she became more turned on.<br>\r\n<br>\r\n\"Lisa, you feel so good down there.\" She started to rub harder, and faster, becoming more wet by the second.<br>\r\n<br>\r\nShe started to grope her own breast, the whole time praying you weren't awake. She started to moan and breath heavily, becoming increasingly more aroused. Soon, she started to rub you against her clit and she inserted a finger into herself. Feeling your tiny body rub against her like that was incredible! Hinata had never felt so good! It quickly became too much, and Hinata orgasmed all over you, covering her in your juices. She quickly took you out and licked you clean so you wouldn't know what had happened. Once she was done, she held you out and saw that you...</span></div></div>",
            "created":1504635960,
            "id":2380702,
            "title":"Hinata noticed"
        },
        "1222211112":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Awake. You were awake. You had been from the moment that Hinata started to please herself with you. Seeing this, Hinata froze. What had she done?<br>\r\n<br>\r\n\"Hinata?\" you asked, slightly shocked.<br>\r\n<br>\r\n\"Oh my god Lisa I'm so sorry! I-I don't know what came over me! Oh my god I can't believe I just did that to you! I'm so-\"<br>\r\n<br>\r\n\"Hinata!\" you interrupted. \"It's okay! It's okay!\"<br>\r\n<br>\r\n\"I... what?\"<br>\r\n<br>\r\n\"I said it's okay. I didn't mind.\"<br>\r\n<br>\r\n\"You... you didn't?\"<br>\r\n<br>\r\n\"Yeah. When I woke up to you rubbing me against you, well, I didn't mind.\"<br>\r\n<br>\r\n\"R-Really?\"<br>\r\n<br>\r\n\"Yeah.\"<br>\r\n<br>\r\n\"But I-\"<br>\r\n<br>\r\n\"Listen to me, okay?\"<br>\r\n<br>\r\n\"Um, okay.\"<br>\r\n<br>\r\n\"Now, answer me honestly. Hinata Hyuga, do you like me?\"<br>\r\n<br>\r\n\"W-What?\"<br>\r\n<br>\r\n\"I said, do you like me?\"<br>\r\n<br>\r\n\"We'll of course, we're friends aren't we?\"<br>\r\n<br>\r\n\"Not what I meant. I meant do you like me like me?\"<br>\r\n<br>\r\n\"W-Well I-\"<br>\r\n<br>\r\n\"I heard what you said earlier this morning.\"<br>\r\n<br>\r\n\"Y-you were awake then too?\"<br>\r\n<br>\r\n\"Yes, I was.\" Hinata blushed heavily. This was horrible! If she was ever going to confess to Lisa, she had wanted to do it when she was ready, at a time when everything was just right. But now everything was ruined. Hinata felt tears well up in her eyes as she began to cry. \"Hey Hinata, it's okay.\"<br>\r\n<br>\r\n\"No it's not! I promised that I would take care of you, but instead I just used for sexual pleasure because of some stupid crush! I'm a horrible person!\" You knew you had to fix this, and fast.<br>\r\n<br>\r\n\"Hinata!\" you shouted, temporarily shocking her to attention. Now was your chance. \"It's alright, I didn't mind at all. In fact, I kind of liked it.\"<br>\r\n<br>\r\n\"You... You what?\"<br>\r\n<br>\r\n\"I liked it. Truth be told, I've had a crush on you for a whole now, I've just never acted on it. But I believe that now is a better time than any to tell you so.\"<br>\r\n<br>\r\n\"You... You really like me?\" You hopped down onto her chest, crawled up to her face, grabbed her chin, and kissed her. At first she was shocked, but she slowly closed her eyes and kissed back. Soon the kiss ended, and you smiled.<br>\r\n<br>\r\n\"That answer your question.\" Hinata smiled back.<br>\r\n<br>\r\n\"Yeah, it does.\" She kissed you again, then picked you up and hugged you to her breast, right over her heart. You smiled and hugged back, happy to love, and be loved.  \"Still, I'm sorry about using you like that.\"<br>\r\n<br>\r\n\"Like I said, it's okay. In fact, that might be kind of my fault. I did kiss you down there.\"<br>\r\n<br>\r\n\"So that wasn't an accident?\"<br>\r\n<br>\r\n\"You felt it?\"<br>\r\n<br>\r\n\"Yeah. I thought that you might have accidently brushed your lips against me, but a part of me hoped it was on purpose.\"<br>\r\n<br>\r\n\"We'll then that part of you was right, it was on purpose.\" Hinata smiled down at you. \"So, do I really feel that good down there?\"<br>\r\n<br>\r\n\"Huh? O-Oh... um, yeah, you do.\"<br>\r\n<br>\r\n\"Heh, good to know.\"<br>\r\n<br>\r\n\"Uh, well I think I've rested enough,\" Hinata said blushing. \"Should we continue?\"</span></div></div>",
            "created":1504647300,
            "id":2380780,
            "title":"Were awake"
        },
        "12222111121":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Kissed her clit",
                "Crawled inside",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, we probably should.\" Hinata nodded and picked you up. Opening her pants again, she put you back in her panties. She smiled down at you with a blush. \"Now I know we just confessed to each other, but don't do anything too crazy down there okay?\"<br>\r\n<br>\r\n\"Too crazy? Does that mean I can do something a little crazy?\"<br>\r\n<br>\r\nHinata rolled her eyes and let her clothing snap shut, trapping you inside. She then leaped into the air and began the trek home once again, jumping from branch to branch. She smiled as she felt her tiny lover pressed to her southern lips, blushing as she felt you shift around.<br>\r\n<br>\r\nYou meanwhile were in quite the dilemma. Hinata told you not to do anything too crazy, but what did that entail? Deciding to test your limits, you...</span></div></div>",
            "created":1504672500,
            "id":2380939,
            "title":"Yes"
        },
        "122221111211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "“I haven’t given you pleasure yet.”",
                "“Do you think you can please me from behind me?”",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You decided to just play it nice and easy as you kissed Hinata’s clit. Hinata happens to felt that  kiss and blushed with a soft smile on her face while she moaned a little. You like how your new girlfriend moans when you do that and decided to give her clit more kisses. Hinata stopped when she feels what you’re doing and lays next to the tree on the ground.<br>\r\n<br>\r\n“L-Lisa. I-I thought I told not to do a-anything crazy.” Hinata moaned while she looks down at her pussy which you’re at underneath the fabric of her pants and panties.<br>\r\n<br>\r\n“Correction. You said not to do anything “too” crazy. Compare to what I could’ve done, this is nothing. Still, do you like it?” You asked as you rubbed her pussy.<br>\r\n<br>\r\n“Y-Yes.” Hinata moaned.<br>\r\n<br>\r\n“Then I bet that you wouldn’t mind me doing this.” You said as you go back to kissing your giant girlfriend’s pussy.<br>\r\n<br>\r\n“O-Oh yes, L-Lisa. Just like t-that. Don’t s-stop for n-nothing.” Hinata moaned softly as she starts rubbing her crotch from the outside of her pants.<br>\r\n<br>\r\nYou kept on kissing her crotch and you can taste the juices that’s coming out of it. You like the taste as you continue on pleasuring Hinata while she rubs on your back from the outside. Hinata has never felt this much excitement and pleasure in her life and she’s very grateful that you’re the one that’s giving her the experience.<br>\r\n<br>\r\n“L-Lisa. I r-really like h-how you’re touching m-my pussy. Keep t-touching me there.” Hinata moaned.<br>\r\n<br>\r\nYou kept on kissing her clit before you switched to licking it and it made Hinata go crazy. As you were licking, you can tell that she’s going to reach her climax soon and you prepare yourself.<br>\r\n<br>\r\n“Oh! Get ready, Lisa! I’m going to cum now!” Hinata moaned.<br>\r\n<br>\r\nSoon, Hinata finally came and her juices sprayed all over you. After gathering her breath, Hinata reached into her panties and pulls you back outside before cleaning you up with her tongue.<br>\r\n<br>\r\n“That was amazing.” Hinata said with a smile.<br>\r\n<br>\r\n“It was, wasn’t it?” You said with a smile of your own.<br>\r\n<br>\r\n“I love you so much, Lisa.” Hinata said as she hugged you to her breasts.<br>\r\n<br>\r\n“I love you too, Hinata.” You said as you hugged her back.<br>\r\n<br>\r\n“You know something?” Hinata asked.<br>\r\n<br>\r\n“What is it?” You wondered.</span></div></div>",
            "created":1548969660,
            "id":2610666,
            "title":"Kissed her clit"
        },
        "1222211112111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Hinata makes it back to the village",
                "Hinata makes another quick stop",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>You blushed when your big girlfriend told you that. Guess now will be as good of a time as any as you agreed to Hinata giving you pleasure. You took your clothes off and Hinata blushed by your figure before she starts licking you.<br>\r\n<br>\r\n“H-Hinata! L-Lick me so good!” You said in need of her giving you some sexual excitement.<br>\r\n<br>\r\nHinata does just that as she moves her tongue between your legs and started licking your crotch. Holy crap! This is becoming a turn on to you as you let Hinata lick you like this.<br>\r\n<br>\r\n“Oh yes! Right there! Do me more!” You cried out with pleasure.<br>\r\n<br>\r\nEventually, you came and Hinata swallows all of the juices you made. You took the time to relax and looked back at your big lover.<br>\r\n<br>\r\n“How was it?” Hinata asked.<br>\r\n<br>\r\n“That... was... incredible.” You said basking in the afterglow of that sex.<br>\r\n<br>\r\nHinata just smiles and kisses you.<br>\r\n<br>\r\n“We’re going to have a fantastic relationship together.” Hinata said smiling.<br>\r\n<br>\r\n“We sure are, Hinata. We sure are.” You said before it was time to continue on.<br>\r\n<br>\r\nHinata then puts your clothes in her pocket for safekeeping before she drops you back inside her panties.<br>\r\n<br>\r\n“You know, Lisa. If we can’t get you back to normal, then you’re more than welcome to stay in my panties or anywhere else on me if you want.” Hinata said.<br>\r\n<br>\r\n“Is that a guarantee?” You made a joke making Hinata roll her eyes again before she closes her panties and pants shut and moves on.</span></div></div>",
            "created":1582980240,
            "id":2794694,
            "title":"“I haven’t given you pleasure yet.”"
        },
        "122221111212":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "=====> +"
            ],
            "content":"<div class=\"\"><div> <span>With a devious smile, you spread Hinata's lips, and crawled inside. Hinata took notice immediately. She stopped on a branch as a blush built up on her face and she moaned slightly.<br>\r\n<br>\r\n\"L-Lisa, what're you doing?\"<br>\r\n<br>\r\n\"Getting comfy!\" you reply crawling in deeper. Hinata let out a quiet moan as you traveled further inside of her. Soon, you came upon a closed up wall. Her cervix. \"I've come this far, might as well go all the way!\"<br>\r\n<br>\r\nYou started to push through the cervix, which made Hinata cry out.<br>\r\n<br>\r\n\"L-Lisa, whatever you're doing in there, don't stop,\" Hinata said as she reached into her panties and started fingering herself. You happily complied, pushing through the wall, and into a small chamber. Hinata's womb.<br>\r\n<br>\r\n\"Whoa,\" you said looking around. The chamber was small, but cozy. With a smile, you kicked back and relaxed as you listened to Hinata pleasure herself. Soon your giantess lover orgasmed, and slid down to sight with her back against the trunk of the tree.<br>\r\n<br>\r\n\"That was... amazing,\" Hinata said quietly. Slowly recovering from the high of her pleasure, Hinata looked down at her tummy. \"Hey Lisa, you in there?\"<br>\r\n<br>\r\n\"If you mean your womb then yes, I am.\"<br>\r\n<br>\r\n\"My womb?\"<br>\r\n<br>\r\n\"Yep. Crawled in past your cervix, now I'm in here. Gotta say, it's pretty nice in here.\"<br>\r\n<br>\r\nNormally people would have been weirded out by this, but Hinata kind of liked it actually. She smiled as she rubbed her tummy, feeling her tiny lover safe inside her womb. Standing up, Hinata briefly stretched before she got ready to continue.<br>\r\n<br>\r\n\"We'll you might as well get comfy, you'll be in there for a while.\"<br>\r\n<br>\r\n\"That a promise?\" Hinata rolled her eyes and giggled, thinking you were cute. She then hops to the next branch and starts going on her way. Being in this small little pocket of love and safety inside your girlfriend made you rather tired, so you decided to take a nap. Laying down, you closed your eyes and fell asleep.</span></div></div>",
            "created":1504715280,
            "id":2381153,
            "title":"Crawled inside"
        },
        "1222211112121":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "Cleavage",
                "Panties",
                "Womb"
            ],
            "content":"<div class=\"\"><div> <span>When you wake up, you find yourself still in Hinata's womb. You smiled and nuzzled the soft walls, and heard a giggle in response. You felt Hinata rub her tummy in a loving manner, and nuzzled into the rubs.<br>\r\n<br>\r\n\"So cute,\" Hinata said, which made you smile. From what you could hear outside, Hinata was making dinner. And you, being hungry, decided to let her know you were awake.<br>\r\n<br>\r\n\"Hinata?\" you said pretending to have just woken up.<br>\r\n<br>\r\n\"Oh, hey there sleepy head. Did you have a nice nap?\"<br>\r\n<br>\r\n\"Yeah! Sleeping in here is so comfortable!\"<br>\r\n<br>\r\n\"We'll dinners almost ready. Wanna come out?\"<br>\r\n<br>\r\n\"Sure.\" Hinata nodded and sat down on a rock. Closing her eyes, she began to push. The walls around you closed in, slowly pushing you down through the birth canal. Soon you ended up back in Hinata's panties, and gave her lips a kiss to let her know you were out. A hand reached in, and pulled you out. Hinata brought you up to her smiling face, and kissed your head.<br>\r\n<br>\r\n\"Good to see you again.\"<br>\r\n<br>\r\n\"Heh, thanks.\" Then you saw you were covered in Hinata's love juice. \"Um, a little help?\"<br>\r\n<br>\r\n\"Huh? Oh, right. Let me get that.\" Hinata brought you close to her mouth, and let out her tongue. The fleshy muscle began to lick you clean, getting all of the nectar that covered your body. Once done, her tongue gave your cheek a gentle lick before she kissed you. She pulled back and licked her lips. \"Mmm, you taste delicious. I might have to put you in some ramen one day.\"<br>\r\n<br>\r\nThe joke made you laugh, but on the inside you were nervous. She really could do that. Swallow you whole even. And if that happened, you would be sent to her stomach, and digested.<br>\r\n<br>\r\n<i>'But, if it was Hinata, maybe it wouldn't be so bad,'</i> you thought. Shaking your head, you hopped onto Hinata's shoulder and got ready to eat. Once again you had ramen noodles, and ate the one Hinata gave you with a smile.<br>\r\n<br>\r\nSoon it was time for bed, and Hinata set up her sleeping bag. Taking you from her shoulder, she looked down at you and smiled.<br>\r\n<br>\r\n\"Where do you wanna sleep?\"</span></div></div>",
            "created":1504806300,
            "id":2381832,
            "title":"=====> +"
        },
        "12222111121211":{
            "author_id":"alexshark1234",
            "author_name":"MisterAlexShark",
            "choices":[
                "See some friends",
                "Go home+"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, you're cleavage was pretty comfy.\"<br>\r\n<br>\r\n\"Then you can sleep there.\" Hinata nestled you between her breasts, and laid down in her sleeping bag. You snuggled up to her soft mounds and kissed them, making Hinata giggle. \"Night Lisa.\"<br>\r\n<br>\r\n\"Night Hinata.\"<br>\r\n<br>\r\nThe next morning, you woke up just as Hinata did. You both ate breakfast and you soon found yourself back inside Hinata's panties. Soon the Hidden Leaf was in sight, and Hinata took you out right outside the gates.<br>\r\n<br>\r\n\"Don't want to make things awkward by having you in there.\" Keeping a tight hold on you, Hinata went to the Hokage's building and went inside. Soon she entered the Hokage's office and reported the mission's success.<br>\r\n<br>\r\n\"Wonderful job Hinata. And where is Lisa?\"<br>\r\n<br>\r\n\"Um, right here.\" Hinata showed you to Tsunade, and the older woman looked at you in surprise.<br>\r\n<br>\r\n\"Well, I see you've been hit with a size alter jutsu.\"<br>\r\n<br>\r\n\"Is there any way to fix it?\" you ask.<br>\r\n<br>\r\n\"Perhaps, I'll have to look into it. I'll send someone to find you if I find anything.\"<br>\r\n<br>\r\n\"Thank you ma'am.\"<br>\r\n<br>\r\n\"Of course. Now you two go, I have some things I need to do.\" Stepping out, Hinata looked down at you.<br>\r\n<br>\r\n\"What do you wanna do?\"</span></div></div>",
            "created":1507680540,
            "id":2399418,
            "title":"Cleavage"
        },
        "122221111212111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "join them",
                "have some time alone"
            ],
            "content":"<div class=\"\"><div> <span>\"How about we go see our friends?\" You suggested.<br>\r\n<br>\r\n\"Sure.\" Hinata said.<br>\r\n<br>\r\nHinata was carrying you while walking in the village. That's when you guys found Sakura, Ino and Tenten and wanted to join them.<br>\r\n<br>\r\n\"Hi girls.\" Hinata said walking towards them.<br>\r\n<br>\r\n\"Hey, Hinata. How was the mission?\" Sakura asked.<br>\r\n<br>\r\n\"Great. It was a success.\" Hinata said.<br>\r\n<br>\r\n\"Where's Lisa?\" Ino asked.<br>\r\n<br>\r\n\"Right here.\" You said.<br>\r\n<br>\r\nSakura, Ino and Tenten were shocked to see you so small. Though, they think that you're kinda cute like this. But, they pushed that thought out of their minds as they were concern for you.<br>\r\n<br>\r\n\"What happened to you?\" Tenten asked.<br>\r\n<br>\r\n\"To make a long story short, shrinking jutsu accident.\" You said.<br>\r\n<br>\r\n\"Will she be okay?\" Sakura asked Hinata.<br>\r\n<br>\r\n\"Yes. Tsunade will look to see if there is a way to return her back to normal.\" Hinata said.<br>\r\n<br>\r\n\"Well, we're just about to have a girl's day out together. You two wanna join us?\" Ino asked.<br>\r\n<br>\r\nYou two then decided to</span></div></div>",
            "created":1511106480,
            "id":2417099,
            "title":"See some friends"
        },
        "12222111121212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "\"There is a cure, but it's gonna take a lot of time.\"",
                "\"I'm sorry. But, there is no cure.\""
            ],
            "content":"<div class=\"\"><div> <span>\"You really like being in my panties, don't you, Lisa? Maybe, you should live in there.\" Hinata suggested with a playful smile.<br>\r\n<br>\r\n\"Boy! Would that be a dream come true.\" You said as a joke.<br>\r\n<br>\r\nYou and Hinata laughed together before Hinata pulls out her pants and panties and dropping you inside next to her sex again. Hinata closed her panties and pants with a snap and patted on her crotch to make sure you're secured before laying down on her sleeping bag. You then gave her vagina lips a quick kiss before falling asleep, which Hinata noticed and giggles before going to sleep as well.<br>\r\n<br>\r\nThe next morning, Hinata wakes up and gathers her stuff to get ready to head out. She makes sure that you're still in her panties before jumping on a branch to get going. You then woke up to see the lovely clit of your girlfriend in front of you before you see Hinata's hand reaching into her panties to pull you back out.<br>\r\n<br>\r\n\"What's up, Hinata?\" You asked curiously.<br>\r\n<br>\r\n\"Look up ahead.\" Hinata pointed.<br>\r\n<br>\r\nYou looked to see Konoha just a few yards away. You can finally get to Tsunade and have her fix this mess.<br>\r\n<br>\r\n\"We're finally home.\" You said.<br>\r\n<br>\r\n\"Yes. Now, I want to get in my jacket on my shoulder because if I carry you back in my panties, it would create a very awkward scene.\" Hinata said.<br>\r\n<br>\r\n\"Good idea.\" You agreed.<br>\r\n<br>\r\nHinata sets you on her shoulder and you crawled on inside her jacket to hold on to her shirt before she continues on to Konoha. Once she makes it there, she ran straight to Tsunade's office and knocks on the door. She enters after Tsunade let's her in.<br>\r\n<br>\r\n\"Hinata! Was the mission a success?\" Tsunade wondered.<br>\r\n<br>\r\n'It was, Lady Tsunade. Though, we have a problem.\" Hinata said.<br>\r\n<br>\r\n\"What do you mean and where's Lisa?\" Tsunade asked.<br>\r\n<br>\r\n\"Right here.\" You answered.<br>\r\n<br>\r\nYou crawled out of Hinata's jacked to reveal yourself to the hokage. Tsunade was in shock to see you so little.<br>\r\n<br>\r\n\"Lisa?! What in the world happened?!\" Tsunade wondered.<br>\r\n<br>\r\nYou and Hinata took this time to explain the situation about the scroll shrinking you and hopefully that Tsunade can fix you.<br>\r\n<br>\r\n\"I'm not sure if there is a way, but we'll try to help in anyway. Shizune!\" Tsunade called out as her assistant walks into the office.<br>\r\n<br>\r\n\"Yes, my lady?\" Shizune asked.<br>\r\n<br>\r\n\"Take Lisa to the lab and see if there's a reverse to this jutsu.\" Tsunade ordered.<br>\r\n<br>\r\n\"Of course, my lady. Come along, Lisa.\" Shizune said as you hopped on to her hand.<br>\r\n<br>\r\n\"I'll be back soon, Hinata.\" You said.<br>\r\n<br>\r\n\"Okay. Be careful with her, Shizune.\" Hinata said.<br>\r\n<br>\r\n\"I will.\" Shizune said before taking you to the lab.<br>\r\n<br>\r\nTsunade noticed that Hinata has a special care for you. She smiled as she figured that a romantic spark had light up suring the mission, but decided not to bother them about it right now.<br>\r\n<br>\r\nA few hours later, Hinata came back to Tsunade's office to wait for the results of your test. They see Shizune coming in with you in her hand.<br>\r\n<br>\r\n\"How did it go, Shizune?\" Tsunade asked.<br>\r\n<br>\r\n\"Yes. Is there a way to return Lisa to normal?\" Hinata wondered.<br>\r\n<br>\r\nShizune then said </span></div></div>",
            "created":1507384440,
            "id":2397698,
            "title":"Panties"
        },
        "12222111122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "You",
                "Hinata"
            ],
            "content":"<div class=\"\"><div> <span>“Not yet. There’s one other thing before we go.” You said.<br>\r\n<br>\r\n“What is it?” Hinata asked.<br>\r\n<br>\r\n“Well, since you were, somewhat, using me to pleasure yourself. I was thinking that we should, you know, continue what we left off.” You suggested while blushing.<br>\r\n<br>\r\n“Lisa. I would like that. But, let’s go someplace where other ninja won’t see us doing it.” Hinata said.<br>\r\n<br>\r\n“There’s a town just a about 5 minutes from here. Maybe, we can get a motel room there.” You said.<br>\r\n<br>\r\nHinata agreed and she places you back inside her panties before heading straight to the town. You felt excited about doing some fun time with the girl of your dreams before you gave her vagina a peck with your lips. Hinata actually felt it and smiled down before she makes it to the motel in town. She rented the room, goes inside it and locked the door behind her before she reached down to grab you.<br>\r\n<br>\r\n“Are you ready, Lisa?” Hinata asked while blushing.<br>\r\n<br>\r\n“You bet I am.” You said with enthusiasm.<br>\r\n<br>\r\nNow, who should be pleasured first?</span></div></div>",
            "created":1529241660,
            "id":2508373,
            "title":"No"
        }
    },
    "info":{
        "author_id":"alexshark1234",
        "author_name":"MisterAlexShark",
        "brief_description":"Naruto GTS/Shrink",
        "created":1504590600,
        "description":"<td align=\"left\" class=\"norm\">You a ninja in the world of Naruto, and you somehow managed to get yourself shrunken on a mission! Thankfully the konoichi of the leaf can help, but whether you actually grow back to normal is up to you.<br>\r\n<br>\r\nDisclaimer: Giantess only! No giants!<br>\r\n<br>\r\nOther things allowed include:<br>\r\nVore,<br>\r\nDigestion (You must be reborn afterwards)<br>\r\nUnbirth,<br>\r\nFuta,<br>\r\nLactation,<br>\r\nButt,<br>\r\nBreasts,<br>\r\nFeet,<br>\r\n+18 (Duh!),<br>\r\n<br>\r\nNot allowed:<br>\r\nDeath,<br>\r\nScat,<br>\r\nFarts,<br>\r\n<br>\r\nNo one sentence responses unless used to give more options and please use top of grammar. Also, if you have a part you want to continue on and not have someone else continue, put a plus next to that option.<br>\r\n<br>\r\nAny questions? Message me!</td>",
        "id":2133618,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582980240,
        "modified":1582980240,
        "pretty_title":"Shrunken Ninja"
    }
}