{
    "chapters":{
        "1":{
            "author_id":"andrew97",
            "author_name":"justaguy",
            "choices":[
                "...listen to her thoughts more!\"",
                "...stop being nosy!\""
            ],
            "content":"<div class=\"\"><div> <span><i>Yesterday night, Andrew saw a shooting star and wished for a power. A power with he could modify females bodies. Then the shooting star vanished and a voice told him that, he might use it carefully. He can modify any female by looking at them and think about what would happen to her. Also he can hear the girls thoughts he is looking at but not thoughts that may reveal feelings.</i><br>\r\n<br>\r\nMonday morning -- Classroom.<br>\r\n<br>\r\nAndrew was sitting in his desk. The lesson was about to start.<br>\r\n\"What a weird dream I had...\" he was thinking about what had happened yesterday.<br>\r\n- Hi Andrew! - A female voice interrupted him in the concentration. As he looked up he saw Zoe bent over his table. He couldn't ignore the deep cleavage that Zoe's V-cut shirt revealed. He quickly looked at her face as he didn't see anything.<br>\r\n- Oh, morning Zoe. - Zoe sits next to Andrew. That's why they used to talk a lot even during the lessons.<br>\r\n- So, are you doing anything at the weekend?<br>\r\n- Well, no. - Answered Andrew.<br>\r\n- Would you like to come with us to the pool?<br>\r\n- \"With us\" ?<br>\r\n- Well Jill is coming too.<br>\r\n- I see. Well, sure.<br>\r\n- Okay then! <i>\"Yes he is coming with us!\"</i><br>\r\n- Why are you so happy about it?<br>\r\n- Huh? What are you talking about? <i>\"What is he talking about? It's like he could hear what I'm thinking...\"</i><br>\r\n- N-never mind. \"It's like what the voice said; I can hear her thoughts! Let's see...\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1289278800,
            "id":990533,
            "title":"The begining"
        },
        "11":{
            "author_id":"andrew97",
            "author_name":"justaguy",
            "choices":[
                "\"...make her breasts bigger!\"",
                "\"...make her slimmer!\"",
                "\"...do nothing yet.\""
            ],
            "content":"<div class=\"\"><div> <span>\"... I kinda feel myself uncomfortable, but I should listen to her thoughts more.\" So Andrew looked at Zoe.<br>\r\n<i>\"Okay, the weekend is planned. What to do on Friday? I should go to the cinema! I wish I had more courage to ask <span style=\"text-decoration:line-through\"> a </span>.@r.&amp; out...\"</i><br>\r\n\"Whoa, that noise! I wonder who's name could it be...\" The bell rang signaling the students that the lesson begun. Andrew was paying attention to his teacher. In the last minutes of the lesson he had bee looking at Zoe so he could hear her thoughts.<br>\r\n<i>\"I wonder if I have any chance at him. But what if I'm too fat, or my breasts are too small? I really need to know how could I amaze him!\"</i> Andrew blushed a bit and turned his head away from Zoe.<br>\r\n\"...I don't know what to think... she is beautiful and she has no self confidence!\"<br>\r\n- What's the problem Andrew, your face is all red. - <i>\"He is so -.@! when she blushes.\"</i><br>\r\n- I'm fine it's just a bit hot in here. - \"I'm so what? Why I can't hear what she is thinking? Anyway should I try my new power on her...?\"</span></div></div>",
            "created":1308114000,
            "id":1126495,
            "title":"The mindreading"
        },
        "111":{
            "author_id":"andrew97",
            "author_name":"justaguy",
            "choices":[
                "\"...go to the toilet too.(go after her)\"",
                "\"...wait what happens.\"",
                "--Your Choice--"
            ],
            "content":"<div class=\"\"><div> <span>\"... right, if she isn't paying attention I'll have to stare at her breasts and imagine if they were bigger.\" The next lesson started. It was biology. One of the few lessons that Zoe was interested in. \"Alright, this is my chance.\" Andrew slightly turned his head towards Zoe and at looked at her breasts. Zoe's assets were already noticeable distracting for men. \"...I wish her breasts were bigger!\" Andrew kept staring at Zoe's<br>\r\ndecolletage. Suddenly she noticed something. Zoe's breasts seemed bigger every breath she took. Her top pushed outwards, and rose. The strap of her bra became more visible on her through the her shirt. Her shirt, and bra was being stretched. \"...It...actually works!\" Andrew felt surprised and pleasurable. She could see woman breast becoming bigger and bigger within seconds with his very own eyes. Not just Zoe's shirt seem to be tight. Andrew clearly felt her pants getting tighter.<br>\r\n<br>\r\n<i>\"I kinda feel weird.\"</i> Andrew heard Zoe's thoughts again. She looked down. <i>\"Weird... my bra must've slid down.\"</i> She grabbed the side of her shirt and adjusted her bra by giving it a lift <i>\"...Like my boobs were more sensitive, they weren't this ticklish before.\"</i> These words made Andrew blush and her pants tighter. He kept looking at Zoe's breasts. Now he could clearly see Zoe's bra being pushed downwards by the expanding flesh of Zoe's breasts. Suddenly he could see a quick movement and saw Zoe surprised. <i>\"What the hell was that? ... Wait...\"</i> She looked down and went all red. Andrew looked down the exact point where Zoe did. She could see Zoe's nipples poking through her shirt. <i>\"What just happened!?\"</i> Andrew was speechless he kept staring at Zoe. This caused and instant growth sprout. He could see Zoe's nipples getting twice as big and her breasts getting bigger slightly. At that point even Zoe's shirt rose that much, it revealed her belly button. <i>\"My tits are growing!\"</i> Andrew's pants couldn't have been tighter. \"...Her breasts... Grew! ...Massive!\" Zoe asked to go to the bathroom. \"I should...\"</span></div></div>",
            "created":1308200400,
            "id":1127222,
            "title":"Pervy power"
        },
        "1111":{
            "author_id":"andrew97",
            "author_name":"justaguy",
            "choices":[
                "Next day",
                "Later that day"
            ],
            "content":"<div class=\"\"><div> <span>Andrew went out of the classroom and saw Zoe entering the girl's bathroom.<br>\r\n- Zoe, wait! - She quickly turned towards Andrew. Her face was all red. She was about to cry and tried to cover her chest.<br>\r\n- W-what? -<br>\r\n- I know what happened. - Said Andrew<br>\r\n- Of course you do, I came out to go to the bathroom. - Said Zoe while sniffing sometimes.<br>\r\n- I mean that's not just it. our breasts grew. - Zoe started to drop tears.<br>\r\n- You perverted pig, that's the only thing you can pay attention to!?<br>\r\n- Wait... I, did it. - Zoe had a dumb looking on her face while didn't know what to say. - I knew you would like bigger breasts to impress someone.<br>\r\n- H-how? And you know w-who is that certain someone? - Zoe was even more embarrassed but she was a bit pale.<br>\r\n- I... Don't know. - Andrew stepped closer to Zoe and offered her a hug to make her calm down. He could feel Zoe's breasts being pushed to his chest. - Zoe...<br>\r\n- Y-yes?<br>\r\n- I've never been with a girl like you. - Zoe stepped backwards opening the door of the men's bathroom pulling Andrew in. She closed the door and took of her shirt and her worthless bra.<br>\r\n- Andrew... I love you... Do whatever you want with me!<br>\r\n<br>\r\nAndrew pushed Zoe to the wall. He started to eagerly grab and squeeze Zoe's breasts. Zoe moaned loudly.<br>\r\n- S-s-sorry Zoe, ... I... I just can't have enough of your enormous tits... by the way... how big are they if you would have to tell?<br>\r\n- P-p-probably... a size of... *moan* E-e E cup. - Zoe enjoy the breast massage she got. She stroked Andrew's face. Andrew licked Zoe's nipple and started to suck it while still squeezing her breasts. Zoe moaned louder. <i>\"This is much fun! SOOOO MUCH FUNN!!\"</i> Andrew slid his hands down over Zoe's naked upper body until his hands reached Zoe's butt. He grabbed Zoe's but roughly and kept sucking her breasts. Zoe moaned again.<br>\r\n<br>\r\nAfter five minutes of pleasurable enjoyment they both sat on the floor while hugging each other. They kissed each other and went back to the classroom.<br>\r\n<br>\r\n<font class=\"size5\" style=\"\"><div align=\"center\">-- Possible end of chapter one --</div></font></span></div></div>",
            "created":1328158800,
            "id":1269962,
            "title":"Chasin' boobs"
        },
        "11111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Andrew's P.O.V.",
                "Zoe's P.O.V."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does this chapter's focus begin?</span></div></span></div>",
            "created":1471582800,
            "id":2198243,
            "title":"Chapter 2"
        },
        "1112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Zoe returns, her larger breasts noticeable.",
                "Zoe doesn't show up; something's wrong.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andrew waited for a bit. After a few minutes...</span></div></span></div>",
            "created":1456030800,
            "id":2107348,
            "title":"Bid your time."
        },
        "11121":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "E cup",
                "G cup"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zoe returns Andrew.guess that Zoe is now a...</span></div></span></div>",
            "created":1556509380,
            "id":2651939,
            "title":"Zoe returns, her larger breasts noticeable."
        },
        "111212":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "G cup.",
                "Bigger."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Dose Zoe have a G cup or are her tits even bigger.</span></div></span></div>",
            "created":1572821700,
            "id":2741919,
            "title":"G cup"
        },
        "1112122":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "K cup boobs on Zoe",
                "Bigger tits."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Dose Zoe has huge K cup breasts?</span></div></span></div>",
            "created":1579995660,
            "id":2778401,
            "title":"Bigger."
        },
        "11123":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "The teacher.",
                "Another student."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andrew decided to take his interests and place them on another girl. He chose...</span></div></span></div>",
            "created":1468904400,
            "id":2183099,
            "title":"On to greener pastures."
        },
        "111232":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Mess with Nina or Jessica ",
                "Mess with lily or Caroline ",
                "Mess with Ms. violet or go look for the other girls "
            ],
            "content":"<div class=\"\"><div> <span>Nina was wearing a pair of shorts shorts and sports bra so she might be fun to mess with<br>\r\n<br>\r\nJessica was writing away in her notes <br>\r\n<br>\r\nLily had on a pair of sweat pants that were a little see through and was looking at Ms. Violets chest <br>\r\n<br>\r\nCaroline was wearing one of her button up tops but kept a extra button unbuttoned today showing the top of her crimson red bra<br>\r\n<br>\r\nMs. Violet was busy teaching the class, her top was unbuttoned a little showing her white and pink bra and wore a skirt that was a little to tight for her butt<br>\r\n<br>\r\nHe couldn’t find Erica or Jill today in the class </span></div></div>",
            "created":1559352660,
            "id":2667306,
            "title":"Another student."
        },
        "1113":{
            "author_id":"dr.blonde",
            "author_name":"Blondiehair",
            "choices":[
                "Caroline \"Melons\"",
                "The first-year girl",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>\"...well, let's just wait here in class. Hmm, why don't I give some other girl some more breast to carry on their chest or something? Who should I pick...\"<br>\r\nYou look for a sexy girl sitting on a place where you can easily look at her and use the power on her.<br>\r\n\"Well, there's Caroline from class C in front of me... how lucky, I've always wanted to see her breasts even bigger, and this is going to be easy!\"<br>\r\n<br>\r\n Then you notice that cute, short first-year girl with blonde hair, sitting further to the side.<br>\r\n You don't know her name, but you know that her butt is well-shaped and it protrudes cutely but isn't very big, her thighs are a bit thick and they look quite nice and girly, and she has a fit, but not overly thin waist, and it looks like her boobs are close to D-cups. With the speed they have been growing through the semester, she's going to be on the same level with Caroline soon!<br>\r\n Maybe you should speed their growth even more! She's not a difficult target from your desk...<br>\r\n<br>\r\n...Or maybe you make another choice? Someone else to target perhaps?</span></div></div>",
            "created":1438750800,
            "id":2017408,
            "title":"Maybe blessing another girl?"
        },
        "11131":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Her breasts (obviously).",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What would Andrew change?</span></div></span></div>",
            "created":1477630800,
            "id":2229563,
            "title":"Caroline's new look."
        },
        "111311":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "It was then that the stitching surrendered, and she had to hide...",
                "As Andrew watched, he saw Caroline become agitated... aroused...",
                "With a thought, Andrew erased Caroline's fears...",
                "Andrew rubbed his hands, eager for the next stage..."
            ],
            "content":"<div class=\"\"><div> <span>Caroline hated her outfit. To honour her ancestry... she scowled at the lazy excuse her school gave for it. But she had to confess that her German heritage entitled her to wear the dirndl.<br>\r\n<br>\r\nOr as she overheard some of the guys describing it, the peasant dress that showed off her rack...<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/19/31/b5/1931b57a455e03d2b05555236ef2d803.jpg\" target=\"_blank\">https://i.pinimg.com/originals/19/31/b5/...</a><br>\r\n<br>\r\nAlready feeling self-conscious, her bust covered only with the thinnest of coverings. It also wasn't designed for modern women... well, modern women with a real need for some support and restraint. The girls shifted from side to side, every move becoming an bust shimmying dance.<br>\r\n<br>\r\nWith his fey-vision, Andrew was able to watch, as she nervously walked down the corridor. Sensing his eagerness, the view in his mirror cleared, becoming fuller, and his own reflection vanishing entirely. At the back of his mind, as a teasing after-taste he felt her insecurity.<br>\r\n<br>\r\nSlowly... teasingly so... he focused on Caroline's increasing bust.<br>\r\n<br>\r\nShe rolled her shoulders, and tugged at the neckline of her outfit. The discomfort as much physical as mental now. It felt as if she were growing... Dismissing that thought as paranoid, she gave the neck one more tug upwards.</span></div></div>",
            "created":1526360400,
            "id":2493831,
            "title":"Her breasts (obviously)."
        },
        "1113114":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the next stage to.make her love him?</span></div></span></div>",
            "created":1559358000,
            "id":2667331,
            "title":"Andrew rubbed his hands, eager for the next sta..."
        },
        "111312":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Bigger butt.",
                "Slimmer waste."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andrew changes Caroline's...</span></div></span></div>",
            "created":1527457800,
            "id":2499532,
            "title":"Something else."
        },
        "11132":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Grow her body.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you plan to do to the new girl?</span></div></span></div>",
            "created":1466485200,
            "id":2167862,
            "title":"Altering the new girl."
        },
        "111322":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Impregnate her.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to the new girl?</span></div></span></div>",
            "created":1505624400,
            "id":2387219,
            "title":"Other plans."
        },
        "11133":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Ms.Violet",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You notice ms.Violet teaching, wearing a blouse that is clearly to small for her breast as the buttons threaten to burst off. She is also wearing a mini skirt that hugs to her ass, showing it off. You wonder what you should do to her.</span></div></span></div>",
            "created":1489986000,
            "id":2292646,
            "title":"Something else?"
        },
        "111331":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "She grows.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to Ms. Violet?</span></div></span></div>",
            "created":1496725200,
            "id":2332065,
            "title":"Ms.Violet's new look."
        },
        "111332":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Can Andrew alter all the girls at once?</span></div></span></div>",
            "created":1512277200,
            "id":2423403,
            "title":"Change them all?"
        },
        "12":{
            "author_id":"andrew97",
            "author_name":"justaguy",
            "choices":[
                "Jessica",
                "Nina",
                "Jill",
                "Erica",
                "Lilly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"...I shouldn't read in her mind... I kinda like her. Let's see...\" There were a plenty of more classmates of him to try his powers on...</span></div></span></div>",
            "created":1310533200,
            "id":1147081,
            "title":"Don't read in her mind!"
        },
        "121":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Her breasts must grow.",
                "Slim down that stomach.",
                "Just probe her thoughts for now."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andrew decided to mess with Jessica's look. Granted, he might not have had any prior relation with her, but there's a first time for everything.<br>\r\n<br>\r\n\"Only thing is, what should I change?\" thought Andrew.</span></div></span></div>",
            "created":1435554000,
            "id":2000615,
            "title":"The full package."
        },
        "1211":{
            "author_id":"hotdilltook",
            "author_name":"Gregory15",
            "choices":[
                "Peoples stares power her growth, increasing all her atributes",
                "She starts to grow taller as well"
            ],
            "content":"<div class=\"\"><div> <span>Andrew suddenly gets an idea.  He uses his power, focuses on her breasts, and they grow.  Only slowly at first.  Jessica thinks,<br>\r\n<br>\r\n-Oh, by bra feels a bit tight.<br>\r\n<br>\r\nShe adjusts her bra, and tries to shake off the thought.  Her breasts then start to grow faster, increasing in size, and she starts to notice.<br>\r\n<br>\r\n-Oh god, what is happening?!  I hope no one notices!<br>\r\n<br>\r\nThat was quite the contrary, boys in the class started to stare, and her breasts right past a B cup.  They filled her bra, her nipples pushing hard against her shirt and bra, poking right out, clearly visible.  Her breasts start to bulge out her bra, and her shirt starts to tear.  She was at least a D cup now.</span></div></div>",
            "created":1498885200,
            "id":2345659,
            "title":"They grow"
        },
        "12111":{
            "author_id":"hotdilltook",
            "author_name":"Gregory15",
            "choices":[
                "She grows into a giantess",
                "She becomes a goddess "
            ],
            "content":"<div class=\"\"><div> <span>Almost all the people in the class were staring now, causing her to grow right through her top.  Her bra was long gone, and her shirt was ripping.  Andrew saw how this now was out of his reach.  Everyone staring causes her to grow taller, and not a minute passes when her head brushes the ceiling.  At this point, her shirt is gone, and her pants are ripping at the seams, with her butt growing right out of her pants.</span></div></div>",
            "created":1498885200,
            "id":2345667,
            "title":"Peoples stares power her growth, increasing all..."
        },
        "121111":{
            "author_id":"hotdilltook",
            "author_name":"Gregory15",
            "choices":[
                "GROW",
                "get shorter, but her breasts and butt don't shrink"
            ],
            "content":"<div class=\"\"><div> <span>Jessica clears through the roof, with FF cup breasts, for her size any way, and her butt grows huge.  She tries to cover herself, but her breasts grow right out of her reach.  She just kept on growing,  Her breasts squirting milk all over, and Jessica succumbs to her beauty.  She starts to drink her own milk, and to her it was so sweet, it caused her to... </span></div></div>",
            "created":1498885200,
            "id":2345673,
            "title":"She grows into a giantess"
        },
        "1213":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "She has a secret crush on him.",
                "She has a secret fetish.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Andrew find in Jessica's mind?</span></div></span></div>",
            "created":1483592400,
            "id":2259439,
            "title":"Secret found?"
        },
        "122":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Nina's inner sexual preferences.",
                "Something sinister.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Andrew decided to read Nina's thoughts. After all, she was something of an oddity amongst his friends- granted, she was nice enough, but something about her was just begging for an in-depth analysis. So, Andrew focused on her thoughts, but what he heard shocked him! He heard...</span></div></div>",
            "created":1438318800,
            "id":2014746,
            "title":"A lesbian's inner workings."
        },
        "1221":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Andrew shifted his focus to visit Lisa thoughts for comparison...",
                "Andrew found himself erect at the fantasy of the busty, lusty Lisa.",
                "Andrew found himself wishing he was in Nina's sway, her thrall...",
                "Andrew shifted to make Nina's fantasy a reality, hunting for Lisa's mind.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Andrew watched her thoughts like a favourite TV show. Nina picturing one of her friends in her lingerie. It was a compulsive vision and he couldn't look away. Even doubting that was what Lisa actually wore, Nina's imagination was pin sharp.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/40/c8/9b/40c89b242ec5a0fda7b8d1f8c26c8798.jpg\" target=\"_blank\">https://i.pinimg.com/originals/40/c8/9b/...</a><br>\r\n<br>\r\nThe lewd focus on particular details, followed Andrew's preference so closely, he was surprised to see so clearly that Nina was a lesbian. He doubted that Lisa knew she was the focus of Nina's thoughts and fantasies.<br>\r\n<br>\r\nAs Nina imagined, a firm steady hand pressing her down. Forcing her to her knees in front of Nina. Before commanding a timid Lisa to start going to work.<br>\r\n<br>\r\nA whimper from a terrified, submissive Lisa quickly muffled as Nina smothered it driving the fantasy Lisa until her face was buried in her own crotch. Nina quivered in anticipation, then pleasure, as Lisa's tongue went to work...<br>\r\n<br>\r\nOnly allowing the fantasy woman back to her feet, crimson cheeked, and hiding a secret smile.<br>\r\n<br>\r\nAndrew was incredibly turned on by Nina's fantasy, he almost missed the final twist. As Lisa quivered, her hands darting to tease her own aching need... a fire ignited, unfamiliar, alien, scary but intriguing...<br>\r\n<br>\r\nThe dream Lisa suddenly surged. Her dimensions ripening too lewd for the real world... She was all curves in Nina's imagination.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/3f/8f/16/3f8f16729d4701e9a776f4db0214b11d.jpg\" target=\"_blank\">https://i.pinimg.com/originals/3f/8f/16/...</a><br>\r\n<br>\r\nThe lingerie straining to contain those juicy titties, and that overripe delicious ass.<br>\r\n</span></div></div>",
            "created":1591097280,
            "id":2844651,
            "title":"Nina's inner sexual preferences."
        },
        "12213":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "In his sleep, Andrew purred his approval of the new girl.",
                "Well, she could still be tweaked physically.",
                "As Andrew dreamed, he was blind to his body's changes...",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>With Lisa shifted to fit Nina's ideas of her dream submissive. He turned his thoughts to Nina herself. A 'sporto' herself, and ready to beat into submission any man who challenged her on the athletics field. She had hidden reserves of stamina, strength, and most of all determination.<br>\r\n<br>\r\nPicturing her, Andrew closed his eyes. She swam into focus, her gorgeous ass packed tightly into her shorts. Made her a target of many guys who wanted to 'fuck her straight'. That look of dismissal, instant condescention was clear in her eyes. She didn't need to say a word.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/54/8a/95/548a958a9ebacecb5451cf178bc033c9.jpg\" target=\"_blank\">https://i.pinimg.com/originals/54/8a/95/...</a><br>\r\n<br>\r\nAndrew saw she was jogging laps around the track. Smiling to himself, he imagined sweetening the deal for Lisa too. With a mental shove, Nina was running with more bounce in her step. Her outfit straining to control her expanded bust, and boosted butt.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/d8/6d/1c/d86d1c51b0aac6a31cda863c0972055a.jpg\" target=\"_blank\">https://i.pinimg.com/originals/d8/6d/1c/...</a><br>\r\n<br>\r\nA shake of his head, he half-wished she was straight. But he couldn't do that to her... She was who she was... and he doubted she'd be happy if that core part of her identity was changed.<br>\r\n<br>\r\n- - - - -<br>\r\n<br>\r\nTaking a break to have a coffee. Andrew wondered where to apply his skills next, as he sipped away at the mug. Pacing his living room, and opening a window, he took a deep breath of the fresh air outside. A small frustrated part of Andrew felt disappointed that he couldn't be more central to her life. Alas, that same small part was what she didn't like... and Andrew didn't want to surrender that.<br>\r\n<br>\r\nReturning to his seat, he found it was still warm. The vague impression of his body still in the memory foam. Resting his mug on the arm of the chair. Andrew settled back, the comfort claiming him before he realised. Falling asleep he started to snore softly.<br>\r\n<br>\r\n- - - - -<br>\r\n<br>\r\nThe thought of being in Nina's life accompanied him into the dream realm. As he fantasised about the type of woman who could enter, and challenge her life. He imagined her as sporty herself. With the curves that Nina adored, a similar... but, different girl. Her body accentuated by the clinging curves of her outfit. Andrew's imagination supplied it's first suggestion.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/94/50/39/9450394cbcf1428611512e57dc9dc0b4.jpg\" target=\"_blank\">https://i.pinimg.com/originals/94/50/39/...</a><br>\r\n<br>\r\nHe imagined the pair running laps side by side.<br>\r\n<br>\r\nWith a shake of his head, Andrew turned that image to nothing. The fantasy running partner evaporating away. Perhaps a trophy, if Nina was the jock... then perhaps she'd want her own girly girl to possess, as proud arm-candy.<br>\r\n<br>\r\nWhimpering softly in his sleep, Andrew summoned up his next fantasy bride for Nina. She was proud, she was busty, she was dressed to perfection. A partner to Nina, and a beauty to inspire envy from the guys, and disturbing curiousity from the girls.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/c9/88/3c/c9883cb2efcd6dc8b653fe8ac91a2029.jpg\" target=\"_blank\">https://i.pinimg.com/originals/c9/88/3c/...</a><br>\r\n<br>\r\nAndrew imagined her turning in his imagination. A dream twirl from Nina's dream girl.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/54/28/b9/5428b979b5c580cd56988e21d79bfe4d.jpg\" target=\"_blank\">https://i.pinimg.com/originals/54/28/b9/...</a><br>\r\n<br>\r\nBusty and proud, a match for Nina, but leaning into her femininity rather than Jock... <i>Jill? </i>pride.<br>\r\n<br>\r\n- - - - -<br>\r\n<br>\r\nHe could imagine them together... Then the thought of Lisa intruded. Andrew mumbled in his sleep, as he restarted. He was trying to summon up Nina's equal, not to complete the set. He wanted to see if he could picture a different Nina, someone who could hang with her, without interfering with her relationships.<br>\r\n<br>\r\nThis time, the image seemed to summon itself. A svelte, toned girl who could run with her. Who wasn't intimidated by her, and that was a bosom companion.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/5c/b1/f7/5cb1f748f951c1dd8bda7c0a765c5b16.jpg\" target=\"_blank\">https://i.pinimg.com/originals/5c/b1/f7/...</a><br>\r\n<br>\r\nThis time, everything just felt right.</span></div></div>",
            "created":1591285200,
            "id":2845755,
            "title":"Andrew found himself wishing he was Nina's type."
        },
        "122131":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Andrea had to admit with a blush, she was horny as hell...",
                "Andrea found her thoughts wandering to Nina, and pleasing her...",
                "Andrea tried to wish Andrew back into existence...",
                "Something else...",
                "Something else different..."
            ],
            "content":"<div class=\"\"><div> <span>Everything felt just right... Andrew thought.<br>\r\n<br>\r\nSoftly purring in his sleep. Unaware that his dreams weren't shaping some unknown figure to be the perfect counterpart for Nina.<br>\r\n<br>\r\nAndrew was now snuggling deeper into her comfy, cozy grey sweatsuit. As if they were the perfect pyjamas. In his dreams, he transformed Nina's new mate, just a little further. Giving her a little more of a bust boost. Something for Nina to ogle as the pair jogged together.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/db/ba/bb/dbbabbf5ba0dd2ff3d1849bb537e683a.jpg\" target=\"_blank\">https://i.pinimg.com/originals/db/ba/bb/...</a><br>\r\n<br>\r\nFor balance he also imagined her with an extra juicy ass. Something for any spectators to enjoy when the pair were out running, too.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/50/e4/cb/50e4cb856f0f950172dc36cdad6ed5fb.jpg\" target=\"_blank\">https://i.pinimg.com/originals/50/e4/cb/...</a><br>\r\n<br>\r\nAs Andrew imagined Nina new mate his new tongue darted out, moistening lips now coated with lipstick. Snuggling in the seat to make himself, he found the seat more comfortable, more padded.<br>\r\n<br>\r\nJust for his amusement, Andrew gave her a last final push. Imagining her with wide, sensitive nips, and a boost to her jiggles.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/06/b1/b9/06b1b992fcf3b3cdfced72ee6119104b.jpg\" target=\"_blank\">https://i.pinimg.com/originals/06/b1/b9/...</a> <br>\r\n<br>\r\nA restless, soft, moan came from Andrew's lips as he felt the discomfort of her new bust, and those too sensitive nipples and titties.<br>\r\n<br>\r\n\"Andrea...\" he purred, christening the new woman.<br>\r\n<br>\r\nAs he purred, he woke with a cough to find himself inhabiting the Andrea body he'd fantasised. A startled shriek burst from her lips, as she erupted from the chair.<br>\r\n<br>\r\nAndrea flailing wildly, as she found her new body, and new centre of balance hard to manage. The extra bounce, jiggle, ripple and roll were unsettling and unfamiliar. A quick game of grab-ass played with herself, brought that too sumptuous bust under control. And confirmed by the clingy jogging bottoms, that she was a woman from head to toe.<br>\r\n<br>\r\nQuivering, on the verge of being overwhelmed by her changes. Andrea felt her body was more alert than he'd ever felt, more aware of every inch of her sensitive flesh, and the hormones pumping through her veins.</span></div></div>",
            "created":1591523280,
            "id":2847284,
            "title":"In his sleep, Andrew purred his approval."
        },
        "1222":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "She was part of a gang.",
                "She was a wanted person.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What dark secret did Nina have?</span></div></span></div>",
            "created":1488862800,
            "id":2286241,
            "title":"Nina's dark side."
        },
        "123":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Her love interest.",
                "Her secret desire.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andrew decided to read Jill's mind. What he found was...</span></div></span></div>",
            "created":1450760400,
            "id":2078031,
            "title":"In Jill's head."
        },
        "1232":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "To have an impossible hourglass figure.",
                "To be the first of her friends that got pregnant.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jill had a secret desire, one she hoped nobody would ever find out. It was...</span></div></span></div>",
            "created":1518930000,
            "id":2454075,
            "title":"What a girl wants."
        },
        "12321":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Jill wakes to her new reality. Her shriek waking the rest of the house.",
                "Andrew finds he can't disengage from Jill's dreaming mind.",
                "Walking home, Andrew bumps into a friend.",
                "As he leaves, Andrew picks up an errant, but familiar thought."
            ],
            "content":"<div class=\"\"><div> <span>Squirming in his seat, Andrew knew he could help her with this. It was hard to concentrate for the rest of the day with his imagination more than eager to fantasise his and her new figure. Finally, the end of the day came, and college finished. Following Jill home, he kept her at a discreet distance, not visible but still within reach of his powers.<br>\r\n<br>\r\nShe was humming a pleasant tune, as she reached her home. As she preened and posed in front of the mirror, Jill knew she wasn't the smartest in the class. She knew she had to use every advantage she could muster for the best future she could have. But, she didn't know there was another spectator behind her eyes enjoying the display.<br>\r\n<br>\r\nOutside, Andrew was stiffening at the seductive display, also feeling Jill's caressing touches, as her hands roamed over her body. Wandering softly through her cleavage... Idly wishing it were deeper, her hands traced a circle around her pierced belly button.<br>\r\n<br>\r\n\"Wow....\" Andrew muttered to himself, hidden in the shade of a nearby tree.<br>\r\n<br>\r\n\"What.. Who's there..?\" Jill spoke aloud, her voice quiet, as she was startled, and afraid.<br>\r\n<br>\r\nPulling himself from her mind, to escape her rising fear. His last connection to her the worry about a voyeur. She gathered her clothes, roughly piling them around her shoulders, her hands clutching them in an untidy mess over her body. Her pulse racing, as she darted to the window. She stumbled, immediately. The curtain was closed, and nobody could see in.<br>\r\n<br>\r\nScowling at it, she double checked the window was closed. The sound of traffic was dulled, but she checked, giving the frame a stiff push, just to ensure it was fully shut. Andrew was outside, and just a little agitated, a carry over of Jill's emotions he was sure... But certain he was invisible in the shadows. Nodding to himself, his discovery. He'd never projected his thoughts, before, but as his pulse slowed he knew it was time to act.<br>\r\n<br>\r\nReconnecting with Jill's mind, he found her now naked, except for some high heels. Boosting her shaken confidence with a bigger display of her body, she walked back and forth, admiring her body, from different angles. Still the thought of a more outrageous physique teased her, as she climbed onto her bed.<br>\r\n<br>\r\nSeizing the moment, the resurfacing of those thoughts, drove Andrew to act. As Jill watched the mirror, Andrew pictured her body gaining extra curves.<br>\r\n<br>\r\nIn moments, Jill's bust was fuller, her rump perhaps a touch more cushioned.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/5738132b491360450ccd001b9c0b89a0/tumblr_olhkt2SNxS1w2lwkto1_1280.jpg\" target=\"_blank\">https://66.media.tumblr.com/5738132b4913...</a><br>\r\n<br>\r\nHearing the purring satisfaction, as Jill admired it. He also heard her doubt, smiling to himself, Jill thought it was her imagination. Emboldened, he went further.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/2b0e25af50d0a13a32a716802427dc86/tumblr_olhkt2SNxS1w2lwkto3_1280.jpg\" target=\"_blank\">https://66.media.tumblr.com/2b0e25af50d0...</a><br>\r\n<br>\r\nTheir was a rush of hormones flooding through her body, as the change was undeniable. Jill's hands explored her body, even as she handled the girls, she couldn't believe what was happening.<br>\r\n<br>\r\n<i>-It has to be a dream...-</i><br>\r\n<br>\r\nAndrew heard the thought, feeding that thought, \"Just a dream...\" he projected that thought as a reassurance, as a confirmation, not in his own voice, more as an echo of Jill's own thoughts.<br>\r\n<br>\r\nAccelerating the changes, he delighted, in Jill's rushing excitement.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/c95034d70c3a2d6efd938dd231090a85/tumblr_olhkt2SNxS1w2lwkto4_r1_1280.jpg\" target=\"_blank\">https://66.media.tumblr.com/c95034d70c3a...</a><br>\r\n<br>\r\nHer body, now far beyond what nature could give any woman. Andrew wondered just how dumb Jill had to be...<br>\r\n<br>\r\nShe didn't pick up on his contempt, or took it as her own. She was more taken with the growing need she felt. A body as lush as this was horny... Those sumptuous breasts that lavish ass, were fuelling her hunger... her itch...<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/0698fd2338800f8602b16be24bfca9fc/tumblr_olhkt2SNxS1w2lwkto5_r1_1280.jpg\" target=\"_blank\">https://66.media.tumblr.com/0698fd233880...</a><br>\r\n<br>\r\nLooking over her shoulder, Jill saw how full her ass now was, how wide the hips, and was finally satisfied. She ground her hungry snatch against the bedding eager for any friction, anything to take the edge off it.<br>\r\n<br>\r\nBut Andrew wasn't satisfied. He wanted to push it just a little further.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/91550815c73eb18969a6792b3e87a808/tumblr_olhkt2SNxS1w2lwkto6_r1_1280.jpg\" target=\"_blank\">https://66.media.tumblr.com/91550815c73e...</a><br>\r\n<br>\r\nJill gasped, at the final surge. Rising from the bed, she found her walk was now a hip swaying, bust shimmying walk. It was the only way she could move, the jiggle of her abundant flesh forcing the eye-catching sashay on her. It was only now, that she felt there might be some drawbacks to a body like this.<br>\r\n<br>\r\n<i>-This ass belongs on a horse-</i><br>\r\n<br>\r\n\"But it's so sexy.\" Andrew quickly adding his thoughts into the mix, as Jill returned to her bed.<br>\r\n<br>\r\nFrigging herself, Jill fell asleep, still believing that her new body was only a dream. As her thoughts muddled and became dreams, Andrew emerged from the shadows, satisfied with that night's work.</span></div></div>",
            "created":1539946860,
            "id":2565670,
            "title":"To have an impossible hourglass figure."
        },
        "123213":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "A twinge of jealousy fired through Andrew's brain.",
                "Andrew realised, his walk home would take him passed Jessica's home.",
                "Eagerly, Andrew went to college the next day.",
                "As he walked home, Andrew felt an extra sway in his hips..."
            ],
            "content":"<div class=\"\"><div> <span>On the walk home, Andrew was almost skipping the rush of Jill's hormones seemed to still thrill through his veins. The warm, fuzzy sensation of a lushly extravagant body a joyous memory.<br>\r\n<br>\r\nWaving cheerily, he saw Sakura at the corner of the road. Jogging to catch up with her, he walked her home.Chatting about their favourite subjects, the walk was over before Andrew realised. However, as they parted, he felt the need to test his new talent once more. Besides, he didn't want Jill to be the only one with a new über busty body, one would be too odd. But two... well, two makes people look for a connection.<br>\r\n<br>\r\nHe walked around the block, reaching out to her mind, until he felt her drift off to sleep. Diving into her dreams, he found an insecurity, as he'd suspected Sakura was feeling a touch under-developed.<br>\r\n<br>\r\nFocusing on her bust, Sakura moaned softly in her sleep, as her bust swelled. Growing far beyond, what her diet, and exercise would give her, Sakura was blessed. Tossing and turning, the sensation of the sheets against her nips made her squirm. Andrew shuddered, at the friction of the bedding rubbing at them. Until, they emerged bare into the chill air of her bedroom.<br>\r\n<br>\r\nSakura dreamily admired her ample new bosom, imagining this all as some fantasy.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/9f797a2117494ead794cf792c371ef57/tumblr_ojtvhsPnvZ1w2lwkto1_1280.jpg\" target=\"_blank\">https://66.media.tumblr.com/9f797a211749...</a><br>\r\n<br>\r\nAndrew however, was only getting started. Their warm comforting weight already feeling familiar, he didn't want the girls to get any bigger. But, the teasing sensitivity of those nipples was addictive. Focusing purely on them, he moaned softly, as they swelled spreading wider, rising higher, increasing in sensitivity. Sakura's teeth chattered, a sensual shudder racing through her body.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/c633bc4a47824938cf489bc1ed5dc0c9/tumblr_ojtvhsPnvZ1w2lwkto3_1280.jpg\" target=\"_blank\">https://66.media.tumblr.com/c633bc4a4782...</a><br>\r\n<br>\r\nThe idea of such a ripe body, intoxicating, and terrifying, her eyelids fluttered shut, as she blocked out her fantasy body. Unaware it was truly hers. Andrew was nursing the weirdest erection he'd ever had. The memory of those nips making the blood pound in his ears, thundering through his racing heart.</span></div></div>",
            "created":1540296540,
            "id":2567493,
            "title":"Walking home, Andrew bumps into a friend."
        },
        "1232131":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Andrew finds his old clothes are still there.",
                "Opening the drawer, Andrew's confronted by an array of lingerie.",
                "Reaching the dresser, Andrew finds it's top covered in make up...",
                "Andrew tries again to imagine, to summon his former body.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Andrew had trouble sleeping that night, anticipation was too sharp. Just too eager to see Jill in all her glory, or Sakura with her nifty new nipples. There was no way any outfit was going to be thick enough to hide those nice, impertinent nips.<br>\r\n<br>\r\nHe wasn't sure when he finally fell asleep. As his thoughts merged into his dreams, it was easy to imagine them strutting proudly down the college corridors. The wide, wide sway of Jill's hips, the bounce of her bust, with every planted foot. Or the hypnotic appeal of Sakura as she walked towards him. She knew everyone was focused on her bust, on those rude, ripe nipples. Leaning in to their appeal, embracing what she couldn't hide.<br>\r\n<br>\r\nAndrew's dreams wandered to their new-found confidence and pride. Fantasising about his next target. This time imagining her as becoming a blonde. A combination of the best of both Jill and Sakura.<br>\r\n<br>\r\nHe was oblivious, as his hair grew out. While he slept it went paler and paler, losing it's original shade, and became blonde. Moaning softly in his sleep. Andrew was fixated on her. Her face was gorgeous, her lips full and pouting, her nose petite, and almost feline in her elegance. Possessed of a natural grace. She was incapable of moving with awkwardness. Incapable of being proud of how she looked.<br>\r\n<br>\r\nThe sleeping moans, took on a more sensual tone, and shifted beyond that to pure sexual invitation. Every purring syllable sounding like a tease from a phone sex-operator. She'd be sex personified.<br>\r\n<br>\r\nNodding in his sleep, approval clear on lips that were far from Andrew's familiar ones. Had drifted past androgynous, to feminine.<br>\r\n<br>\r\nIt was her torso that was the focus of Andrew's dreams now. A soft gasp spilling from his lips as he imagined her with a tiny waist. Well, far smaller than it should be... The contrast made even more obvious by the swell of her bust. She'd be truly blessed with a bust like Sakura, and round, wide, full nips too.<br>\r\n<br>\r\nBeneath the sheets, Andrew's hips cracked as they spread wider. Andrew shifted uncomfortably on the matress, as her rump feminine, then hyper-feminine.<br>\r\n<br>\r\nHis dreams lost their focus, as he saw his fantasy woman personified. She was the epitome of womanhood. Someone he'd absolutely love to see tomorrow.<br>\r\n<br>\r\nHis... Well, her features now, relaxed into a deep peaceful slumber.<br>\r\n<br>\r\nAndrew woke, quickly realising something was very wrong. Pulling aside the sheets, she took in her voluptuous body, and quickly covered it over again. However, the outline of the sheets was too clear. Andrew knew his dreams had manifested this damned body... This nightmare was his to live.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/c7/f2/2c/c7f22cbee84c0853b05414b0dfe377cc.jpg\" target=\"_blank\">https://i.pinimg.com/originals/c7/f2/2c/...</a><br>\r\n<br>\r\nScrewing her eyes shut against the reality. She fought to control her breathing. Which was too rapid and shallow. She was afraid of fainting. Besides, each snatched breath just reminded her of the sumptuous bust she now carried. Her shoulders already aching. Andrew tried to wish it away.<br>\r\n<br>\r\n- - - - -<br>\r\n<br>\r\nPain spiked through his temple, shattering his thoughts. Another attempt and the same result. He knew it was futile to repeat the experiment, and she wasn't happy to take that risk again.<br>\r\n<br>\r\nShe emerged from bed, eyes open the thinnest slits. She didn't want to confront that body, confirm it's reality. But she felt it's bounce and sway with every step. Walking on her toes, as if afraid of stepping on lego... or with an arch to her ankles that suggested she needed heels to walk comfortably. She was kept aware of her unrestrained bust, is it shifted and shimmied.<br>\r\n<br>\r\nHeading to the dresser, she wanted this body clothed. Her nudity covered, and this body as hidden as possible.</span></div></div>",
            "created":1588092780,
            "id":2826301,
            "title":"A twinge of jealousy fired through Andrew's..."
        },
        "1233":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Andrew started adding weight to Jill's ass, expanding it sumptuously.",
                "Andrew decided to ignore it... It wouldn't affect his goal.",
                "Andrew worked to darken Jill's skin... either a Latina... or ..."
            ],
            "content":"<div class=\"\"><div> <span>From the comfort of the armchair in his bedroom, Andrew projected his mind towards the gym. Soaring through the ceiling the court became visible and Jill was watching, as the team practised.<br>\r\n<br>\r\nThe sensation was still intoxicating and new, addictive, and eager to experience it as fully as possible, he plunged into Jill's mind. He felt her flesh become his, as he sank to merge with her body.<br>\r\n<br>\r\nThe feeling of constriction, of discomfort was overwhelming. As she plucked at her skirt, the sensation of being split in two by her underwear was battling the ache from the bra straps digging into her shoulders.<br>\r\n<br>\r\nForcing her hands into her lap, Andrew blushed as Jill's cheeks warmed to pink. The unladylike display caught a little too late. Andrew drew back his control, allowing Jill more control, more freedom.<br>\r\n<br>\r\nIt was an effort to take the backseat in her mind. Andrew quickly regretting the decision, as he felt a tsunami of racism spill unspoken from Jill's mind. The judgement coming as her eyes drifted over the players. The sneering judgement about parentage when she spotted a generous ass. The snide assumptions about a loudly voiced opinion, the presumption about stupidity, and ignorance.<br>\r\n<br>\r\nAndrew felt sick, Jill's hand came to her stomach, as it gurgled at the fight raging within her. Normally she was so sure of her opinions, her rightness, she wondered if she had eaten something that disagreed with her.</span></div></div>",
            "created":1525669200,
            "id":2489854,
            "title":"Andrew probed deeper into Jill's mind."
        },
        "124":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "School stuff.",
                "Her own inner doubt of her attractiveness.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What was Erics thinking?</span></div></span></div>",
            "created":1462942800,
            "id":2146196,
            "title":"The nerd's inner workings."
        },
        "1242":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Andrew intensified her growth, accelerating it...",
                "Erica felt her bra surrender, with a cry, the strap broke.",
                "Andrew implanted the desire, \"Erica was jealous of the Cheerleaders\"."
            ],
            "content":"<div class=\"\"><div> <span>Unsure what to feel, Andrew sank back deeper into his chair, as his thoughts lined up with Erica's. Doubts filled him, as he felt her insecurities. The hunched shoulders, as she leaned forward burying herself in her books. Focusing on her strengths, her mind, and her ability to concentrate.<br>\r\n<br>\r\nBut, a worm of doubt gnawed at the core of her happiness, that a bigger bust wouldn't inhibit her from studying. That if she were cuter, that she could feel more womanly. The chair would feel a little more padded, a little more comfortable, a smirk at the very idea... half serious, but still only half so...<br>\r\n<br>\r\nSensing her insecurity, Andrew's brow furrowed, he felt the power flowing through his veins. A superficial push, and Andrew's resolve strengthened, as he felt her contempt for him... for everyone who judged her...(all women by their looks). The niggling doubt was buried, in Erica's subconscious, as she tried to deny her own self-doubt, her own desires. With a snort, he knew he could project into her mind, convince her that the coming changes were hers. That she was the one with the power.<br>\r\n<br>\r\nConfident that she was ready, a sense of hope planted in Erica's fertile mind, an eagerness for the coming change.<br>\r\n<br>\r\nAt Andrew's willing, Erica felt her nipples stiffen. Her breasts warming as he focused on them. Erica went with the flow, a sense of amusement, as she imagined her bust growing. Closing her eyes, she concentrated on the alluring feelings. The heat spreading, filling her body, expanding her. She imagined the increased tightness of her bra, the caress of the blouse, as her bust grew.<br>\r\n<br>\r\nIt was an imagination she wasn't sure she felt she had. Snapping her eyes open she saw to her horror, her humiliation that she was bigger... Already a B-cup, she was terrified to see that her growth showed no signs of slowing. Screwing her eyes shut against the relentless growth, she concentrated on stopping the growth. Her head shaking, firmly from side to side, as she mutely shook her head 'No'.....<br>\r\n</span></div></div>",
            "created":1525669200,
            "id":2489834,
            "title":"Erica doubts her attractiveness."
        },
        "12421":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Andrew pushes things a little further for Erica.",
                "He senses a contempt for her friends, that Andrew doesn't like...",
                "Erica wasn't merely changed physically...",
                "Andrew's mind flitted to find another girl to please... to boost and enhance.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Andrew focused on boosting Erica's self-confidence. He watched, as her clothes changed. Flashing in one instant from the casual clothes that smothered and hid her body, to a tight pair of shiny latex trousers. Andrew was suprised and pleased to see how well she filled them.<br>\r\n<br>\r\nHer stappy top, also low with a display that told of her new confidence too.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/50/82/0f/50820fff9fadb74b624fe5a62a7cfde4.jpg\" target=\"_blank\">https://i.pinimg.com/originals/50/82/0f/...</a><br>\r\n<br>\r\nSensing Erica's seeds of doubt, he knew he couldn't erase a fundamental insecurity.... He had to deliver, until she was satisfied, and proud of her new body.<br>\r\n<br>\r\nSqueezing his eyes closed, he imagined her with the fuller bust she wanted... and he was more than happy to provide. It grew in a surge, Erica blissfully unaware as from one moment to the next she gained a host of inches to her bust.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/65/6d/7f/656d7f9de500be6ed8e68ed037e39f9d.jpg\" target=\"_blank\">https://i.pinimg.com/originals/65/6d/7f/...</a><br>\r\n<br>\r\nPleased with his work, Andrew was about to withdraw. Pleased with his work, and hoping Erica would be too. But as he went to withdraw from her mind, a niggling worry reached him.<br>\r\n<br>\r\nErica felt top-heavy! A scowl crossed his face, knowing he couldn't reduce her bust... That'd just trigger the original insecurity. Hunting for a solution, it occured. Or rather Erica supplied her solution.<br>\r\n<br>\r\nPain speared through Andrew's head, as he delivered on Erica's hope. Giving her a curvaceous ass, she'd wanted.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/41/8f/ed/418fed6d7f819ce584adf410608b5c49.jpg\" target=\"_blank\">https://i.pinimg.com/originals/41/8f/ed/...</a><br>\r\n<br>\r\nHaving thought a too large ass was an insecurity he'd dismissed it. But, he could hear the purring satisfaction, and pride in the new Erica.</span></div></div>",
            "created":1591098180,
            "id":2844659,
            "title":"Andrew intensified her growth, accelerating it..."
        },
        "124211":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Deciding he was too comfy, he eased himself off to sleep.",
                "A quick espresso fix, and Andrew was fully awake and raring to go!",
                "Andrew headed out, wanting to inspect his goods deeds in the flesh...",
                "Andrew's phone buzzed into life, mutely shaking on the chair's armrest.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Still sensing a little insecurity on Erica's part. Andrew started to think maybe she was impossible to please. Maybe, she was ungrateful, so with a final push of concentration, he gave her his final push. A boost to bust and butt.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/77/52/97/775297f32d49dee589c14c4f4267d002.jpg\" target=\"_blank\">https://i.pinimg.com/originals/77/52/97/...</a><br>\r\n<br>\r\nHe didn't wait to see if she was happier. Already sure, she wasn't, but he was tired of trying to please her. Andrew withdrew before finding out his final gift added to her insecurities.<br>\r\n<br>\r\nOpening his eyes, he fought to swallow a yawn, and rise from his comfy chair.</span></div></div>",
            "created":1591283460,
            "id":2845751,
            "title":"Andrew pushes things a little further for Erica."
        },
        "1243":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Yes Erica was thinking about Andrew.",
                "Someone else.",
                "Somthing else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>    Was she thinking about how to get Andrew to notice her?</span></div></span></div>",
            "created":1546816020,
            "id":2599815,
            "title":"Something else."
        },
        "125":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Lots of information (mostly facts).",
                "A secret desire.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Against his better judgement, Andrew decided to read Lilly's mind. He found...</span></div></span></div>",
            "created":1444453200,
            "id":2045830,
            "title":"Lilly's inner workings."
        }
    },
    "info":{
        "author_id":"andrew97",
        "author_name":"justaguy",
        "brief_description":"This is a story about what would happen if you could change women's body.",
        "created":1289324400,
        "description":"<td align=\"left\" class=\"norm\"><img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/infob.png\" alt=\"*InfoB*\" title=\"InfoB\" border=\"0\" width=\"15\" height=\"15\"><font class=\"size35\" style=\"\"> General information:</font><br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/checkg.png\" alt=\"*CheckG*\" title=\"CheckG\" border=\"0\" width=\"15\" height=\"15\"> - Things accepted are;<br>\r\n        - Breast expansion*<br>\r\n        - Butt expansion<br>\r\n        - Pregnancy<br>\r\n        - Belly expansion / inflation<br>\r\n        - Mildly erotic scenes<br>\r\n<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/xr.png\" alt=\"*XR*\" title=\"XR\" border=\"0\" width=\"15\" height=\"15\"> - Things <b>NOT</b> accepted are;<br>\r\n        - Vore / unbirth<br>\r\n        - Intense sex scenes<br>\r\n        - Homosexuality**<br>\r\n        - Foot fetishes<br>\r\n        - Tickling fetishes<br>\r\n<br>\r\n* Breast expansion involving lactation is accepted.<br>\r\n** Lesbian scenes <b>MAY</b> be accepted, depending on quality.<br>\r\n<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/dollar.png\" alt=\"*Dollar*\" title=\"Dollar\" border=\"0\" width=\"15\" height=\"15\"> - Rewards:<br>\r\n        - You may recieve rewards if adding good quality chapter.<br>\r\n        - You may recieve rewards if reaching certain amount of chapters added.<br>\r\n<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/no.png\" alt=\"*No*\" title=\"No\" border=\"0\" width=\"15\" height=\"15\"> - Chapter removal:<br>\r\n        - A chapter can be removed if it doesn't meet the requirements of quality.<br>\r\n        - A chapter can be removed if it was asked to. (to replace it with a better chapter*)<br>\r\n<br>\r\n* If the new chapter won't be qualified to be better the original will be restored.<br>\r\n<br>\r\n<font class=\"size5\" style=\"\"><div align=\"center\">Story</div></font><br>\r\n<br>\r\nOne day a boy have granted a wish to modify any female body, and any part of it. Also; you are a 18 years old guy who called Andrew.<br>\r\n<br>\r\n<b>Character list:</b><br>\r\n<b>Andrew:</b> Average 18 year old guy. He has got no girlfriend and he has a fetish of breast expansion and butt expansion.<br>\r\n<br>\r\n<b><u>Girls:</u></b><br>\r\n<b>Jill:</b> One of Andrew's classmates. She is not too smart however she has got great body. She doesn't like Andrew much. She has got C cup breasts, slim belly and an average sized butt.<br>\r\n<br>\r\n<b>Erica:</b> One of Andrew's classmates. One of the flattest girl in her class, however she is very smart. She likes Andrew and used to talk with him. They know each other about four years for now. She has got A cup breasts slim belly and a flat butt.<br>\r\n<br>\r\n<b>Nina:</b> One of Andrew's classmates. She is not the most brightest person, but his almost perfect body ballances this. She doesn't care about boys much especialy not Andrew. She is lesbian what she is trying to cover however her best friend knows this. She has got D cup tits slim belly and pant-busting voleyball-sized ass.<br>\r\n<br>\r\n<b>Lilly:</b> One of Andrew's classmates. She is the smartest girl in the class. Her upper body is completely flat and she would do anything to have bigger breasts. Her butt is however almost as big as Nina's. She clearly dislikes Andrew. She once was in love with him but when Andrew declined her she was in deep depression. Since then, she never really talked to Andrew.<br>\r\n<br>\r\n<b>Zoe:</b> One of Andrew's classmates. She is quite smart and also has a great body. She knows Andrew since they were 14. She loves Andrew but she is shy to tell him. However they used to talk a lot since they are good friends. She has got D cup breasts a slightly soft belly and a firm, round rear.<br>\r\n<br>\r\n<b>Jessica:</b> One of Andrew's classmates. She is not as smart as Zoe but more smarter than Nina, but her body is way less perfect. Nina is her best friend. She knows that Nina isn't attracted to boys. She has got B cup breasts, a pillow-like soft belly, and a slightly noticeable rear. She has no relation with Andrew.<br>\r\n<br>\r\n<b>Caroline \"Melons\":</b> She isn't Andrew's classmate however she is in the same age as her. She is a typical<br>\r\nblonde. She is hardly a birght person but she is perfectly slim and she has got a pair of natural DD's. She has an average rear. She is often called \"Melons\" for obvious reasons. She loves to show of her breasts. She wears a tight and white button-up shirt leaving the top buttons unbuttoned.<br>\r\n<br>\r\n<b>Ms. Violet:</b> She is a 28 year old teacher. She teaches mathematics and physics. She is quite well informed. Also she is popular among the boys. She has flat belly, a nice rear, and E cup jugs. That is know that she had plastic surgery.<br>\r\n<br>\r\n<u><b>Boys:</b></u><br>\r\n<br>\r\n<b>Eric:</b> One of Andrew's classmates. He is a good friend of Andrew. He is a bit perverted but most of the girls like to hang out with him.<br>\r\n<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/pencil.png\" alt=\"*Pencil*\" title=\"Pencil\" border=\"0\" width=\"15\" height=\"15\"> <i>Note: More characters can be added during the story but when they firs appear discribe him / her.</i></td>",
        "id":1723263,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1591523280,
        "modified":1591523280,
        "pretty_title":"Breast and other expansion stories"
    }
}