{
    "chapters":{
        "1":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Story 4",
                "Other Stories."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story, any story!</span></div></span></div>",
            "created":1563253200,
            "id":2687865,
            "title":"Where to start?"
        },
        "11":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Wanted to become a baby so for the day she wouldn't have to go to school",
                "Find a family and become there adopted baby ",
                "Be reborn and start a whole new life ",
                "Give into her secret fantasty of become a fat baby ",
                "more "
            ],
            "content":"<div class=\"\"><div> <span>Star Butterfly was a magical 15 year old.with her magic wand she could do anything she wanted. <br>\r\nwith her powers she made any problem she had go away. <br>\r\n<br>\r\nThat's when one day Star woke up feeling tired. Marco came and said \"Come on Star it's Monday. we need to go to school\"<br>\r\nStar said \"Ohhh really? I don't want to go to school I'm too tired today. all this responsibility is such a pain\" <br>\r\nMarco said \"Sorry Star your not a baby anymore get ready so we can go.\" <br>\r\n<br>\r\nStar thought about it and said to herself \"Hey babies don't need to do anything? wow if I was a baby then I wouldn't have to go to school or worry about anything\" <br>\r\nStar then using her magic wand......</span></div></div>",
            "created":1563253200,
            "id":2687869,
            "title":"Story 1"
        },
        "114":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Marco came in, shocked to see how big and young Star got.",
                "Star kept eating, making bigger and bigger food.",
                "Eventually, Star decided to just fatten herself up with magic."
            ],
            "content":"<div class=\"\"><div> <span>Star had always idealized the life of laziness and gluttony, and being a baby would make that so much easier! So, instead of going to school, Star decided she was going to live out the rest of her life as the big, fat baby she'd always wanted to be. With a wave of her wand, she magically found herself shrinking down, down, down until she was no older than a few days old. Star still retained her teenage brain, as well as her knowledge on how to operate her wand, so this change was purely aesthetic.<br>\r\n\"Yay! I'm a baby! Now it's time to get me lots of food to make me into a FAT baby!\" Star said in a high-pitched voice, as she began to create tons of huge food portions in her room. As they spawned in, Star was able to eat each and every last bit of it, swallowing down burger quadruple her own size, guzzle down fries, slurp steaks and even chug down big quarts of milkshakes.<br>\r\nEvery second she ate, Star was getting fatter, and it seemed she wasn't going to slow down any time soon...</span></div></div>",
            "created":1563253200,
            "id":2687871,
            "title":"Give into her secret fantasty of become a fat b..."
        },
        "1141":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Turned Marco into her feeder ",
                "Made time froze ",
                "Tellported somewhere else "
            ],
            "content":"<div class=\"\"><div> <span>Star was in love with this new way of life \"Oh man I should of done this ages ago being a fat baby is so fun! she said eating a 10 foot long subway meatball sandwich in 5 seconds flat. <br>\r\nAs she ate her fat belly grew out becoming a large round pale dome. her ass grew out as her diaper become tight and small. her little dress couldn't cover up her belly and acted more like a stretched out bra for her fat baby boobs <br>\r\n<br>\r\nHer arms and legs became plump and her cute face hot fat with big plump cheeks and two chins.<br>\r\nBut her feast was rudely interrupted when she heard \"Star! come on the bus is here! get up otherwise will be late for sch....\" he froze when he came in to see his best freind now an obese baby eating up tons of junk food. <br>\r\n<br>\r\nMarco said \"Star what the heck is this?<br>\r\nStar grabbed her magic wand and..... </span></div></div>",
            "created":1563253200,
            "id":2687873,
            "title":"Marco came in, shocked to see how big and young..."
        },
        "11413":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Star was met with several guards inclined to stop her.",
                "The machines didn't seem to be working!"
            ],
            "content":"<div class=\"\"><div> <span>In a state of shock, Star panicked and used her wand to teleport herself somewhere different. The last thing she heard from Marco was \"Star, wai--!\" before she found herself in a totally new location. Luckily, she was still able to move, even as a massive baby blob, and surveyed her surroundings. It seemed very dark and dusty, as though nobody had been here in centuries, an area lost in time. It was a bit spooky, and she was about to teleport herself back to face the consequences of her actions when she suddenly heard heavy machinery, as well as something that smelled absolutely divine. She couldn't tell what it was, but whatever it was she knew it was edible.<br>\r\n\"So hungry...\" Star smiled, drooling from her mouth, feeling her stomach growl. She followed her nose, guided through the pitch-black area until she ran into a door with a more well-lit area, realizing she was just in the broom closet of a massive dessert factory!<br>\r\n\"Oh, man... So many treats! I want it all!\" Star smiled, rushing up to begin gorging.<br>\r\n<br>\r\nHowever...</span></div></div>",
            "created":1563253200,
            "id":2687876,
            "title":"Tellported somewhere else "
        },
        "114131":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Began to drink from a hose filled with custard ",
                "Had her slaves feed her desserts ",
                "used her wand to give herself a cute little bikini "
            ],
            "content":"<div class=\"\"><div> <span>Star forgot all about Marco and now just wanted those sweet smelling desserts <br>\r\nShe waddled out into the big halls thinking she could eat all the sweet dessert in this place.<br>\r\nBut as she waddled her fat ass down the halls she heard \"HALT! <br>\r\n<br>\r\nStar turned and saw seven guards men and woman they ran up to Star one said \"How did this baby get here?<br>\r\nAnother guard said \"pick her up and will get her out of here. maybe find her parents and tell them to put her on a diet\"  <br>\r\nBut Star using her wand casted a spell making all the guards into her willing slaves. <br>\r\nThe guards said \"What can we do for you sweet baby Star?<br>\r\n<br>\r\nStar smiled and said \"Prepare the factory for me. this whole place is mine now! <br>\r\nThe guards got to work turning everything on and locking everything up so no one would interfere <br>\r\nStar's first......</span></div></div>",
            "created":1563253200,
            "id":2687892,
            "title":"Star was met with several guards inclined to st..."
        },
        "1141312":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Make the food exponentially bigger.",
                "Get more people to feed her.",
                "Give herself a revealing outfit."
            ],
            "content":"<div class=\"\"><div> <span>Star made all her slaves feed her the desserts scattered around the entire area, and so they went straight to work running up and down stairs and scaffolding in order to most quickly feed their new master.<br>\r\nEach one seemed very pleased to feed such a gluttonous baby, and Star was more than happy to eat all the food they had to offer her. \"More, more!\" She would cry, as her slaves gladly obliged.<br>\r\n<br>\r\nAs Star continued her monstrous binging, she could feel her weight spreading across the entire factory floor, now nearly half as large as the entire room itself. Some guards placed tubes on either side of her mouth to keep her fed while other guards got more to feed her with, which only increased her weight gain by several times.<br>\r\nHer constant groans of pleasure, demanding even more than she already got echoed across the room. Yet still, Star felt unsatisfied. She decided to...</span></div></div>",
            "created":1563253200,
            "id":2687908,
            "title":"Had her slaves feed her desserts "
        },
        "11413121":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Star couldn't move anymore to use her wand ",
                "Star ran out of food ",
                "Star decided to make her age pernement deciding she didn't want to grow up"
            ],
            "content":"<div class=\"\"><div> <span>Star desired more. her greedy hunger demanded bigger tastier food she using her really fat arm she managed to cast another spell making all the desserts in the factory grow 5 times there size. doughnuts were as big as couches and cakes and pies became as big as cars <br>\r\nStar licked her lips and shouted \"Feed me! and the guards rushed carrying the huge heavy deserts on there backs. they stuffed huge loads of pie dough and frosted cake into her mouth. <br>\r\n<br>\r\nShe greedily ate it all she even casted another spell to make her mouth stretch widely allowing her to devour whole giant doughnuts in one mouthful <br>\r\nAs she ate her body grew fatter faster all her cloths ripped apart leaving her fully naked. <br>\r\nStar didn't care she loved being a blob baby she had no shame. <br>\r\n<br>\r\nBut soon something happened....... </span></div></div>",
            "created":1563253200,
            "id":2687920,
            "title":"Make the food exponentially bigger."
        },
        "114131213":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Eventually outgrew the factory, and needed a new source of food.",
                "Fully reverted to a newborn baby, her mind nothing but mush.",
                "Wanted some clothes to cover up with."
            ],
            "content":"<div class=\"\"><div> <span>Star, deciding she no longer cared for the life of teenagehood or adulthood, wanted to stay as a baby for the rest of her life. So, she cast her magic wand, and made herself a permanently a newborn baby, allowing herself to be a cute, obese baby forever! This made her giggle happily as she continued to swallow down the enormous foods, swelling up like a lard balloon.<br>\r\nHer slaves were still happily feeding her, until they realized they were running low on food. One slave brought this up to Star, but she merely laughed, and used her magic to refill all of the vats with food, these ones even larger than the last! A resounding cheer from all vibrated through the entire factory as they resumed their feeding, with Star still gluttonously devouring everything she could.<br>\r\n<br>\r\nThrough all the feeding, Star...</span></div></div>",
            "created":1563339600,
            "id":2688233,
            "title":"Star decided to make her age pernement deciding..."
        },
        "1141312131":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "used her wand to make ever food factory in the world appear around her ",
                "devoured the slave and began to eat all the humans ",
                "found she was no too fat to use her wand leaving her powerless "
            ],
            "content":"<div class=\"\"><div> <span>Star outgrew the large factory first her fat spilled out of the windows before the building seemed to swell like heated popcorn before finally bursting letting the massive blob of a baby spill out freely. her fat seeping out into the streets crushing passing cars and even civilians became trapped under her many folds. <br>\r\n<br>\r\nShe grew so huge her whole body began to press into the near by buildings and her huge ass even crushed a near by school  <br>\r\nStar said in her cute high pitched fat voice \"Aww...this is the life. being a greedy fat baby is the best way to live\" <br>\r\nStar then noticed all how none of her slaves were feeding her and she began to feel hungry all over again. <br>\r\n\"Hey hurry up and feed me! one slave came out from her many fat folds up to her cute fat face and said \"I'm sorry my cute baby. the factory is in ruins we have no way to feed you...\" <br>\r\n<br>\r\nStar was annoyed this would no do. she needed a new way to eat.<br>\r\nThat when she got a great idea as she......</span></div></div>",
            "created":1563339600,
            "id":2688242,
            "title":"Eventually outgrew the factory, and needed a ne..."
        },
        "12":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "5 years old ",
                "3 years old ",
                "1 year old ",
                "newborn ",
                "beyond newborn "
            ],
            "content":"<div class=\"\"><div> <span>Star Butterfly was just your normal magical princess who now lived on Earth getting into all kinds of trouble. <br>\r\nOne day while she was having a bad day at school being bored and having crummy weather Star Butterfly wondered to herself <br>\r\n\"Oh man...why didn't I just stay in bed today? I'm still tired and being here is soooo boring. I wish I could just go back to the house and chill out. too bad I can't rewind time\" she said resting her chin in her hand looking forward in class <br>\r\n<br>\r\nThat's when she suddenly jumped out of her seat \"Wait that's it! I'll just rewind time! she said excitedly.<br>\r\nThe teacher said \"Quiet please! and Star sat back down feeling a bit embarrassed speaking outloud <br>\r\nBut now she knew just what to do.<br>\r\n<br>\r\nDuring break period. Star sneaked into the bathrooms and began to use her magic wand \"Rewind time...go back to the past and let me redo what has been done\" she said to her wand as it glowed purple her eyes glew too and she knew it was working.<br>\r\nBut...something was wrong as she looked at her wrist watch the clock was not going backwards but she did notice her hands growing smaller and softer.<br>\r\n<br>\r\n\"What? Oh no! she said as her body began to grow smaller her skin becoming softer. her hair growing shorter. her limbs becoming smaller and more chubby. her face growing round and cute with big eyes. <br>\r\nShe was getting younger! her wand messed up and she was accidentally making herself younger and younger<br>\r\nAnd before she could even stop it. soon poor Star was left......</span></div></div>",
            "created":1587358800,
            "id":2821917,
            "title":"Day gone wrong "
        },
        "124":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Tried to find an alternate route down.",
                "Was caught by someone!",
                "Felt another effect of the spell she cast taking place..."
            ],
            "content":"<div class=\"\"><div> <span>Poor little Star messed up the spell, if only she hadn't been dozing off in class, she would know how this worked! But there would be time for karmic irony later, for now Star was faced with bigger problems. She flopped down onto the ground and crawled through the bottom of the stall, managing to climb up to the sinks where the mirror was and watched as the last of her maturity, or whatever she had, faded away and was left only as a pitifully tiny newborn baby.<br>\r\n\"Oh no, I'm so young! I look like I was just born!\" Star stated, now realizing she was completely nude! She couldn't let anyone see her like this, they'd never let her forget it! She would be kicked out of school, she'd be the laughingstock of all of Mewnie!<br>\r\n<br>\r\nFor this reason, Star needed a way out. She looked around for her Magic Wand, and found it dropped on the floor next to her now over-sized clothes. She was about to get down, but found herself in another predicament. Now that she was so tiny, she couldn't exactly climb OFF the counter. The ground was so far down, she'd easily break one or more of her fragile bones.<br>\r\nWith this in mind, Star...</span></div></div>",
            "created":1587358800,
            "id":2821925,
            "title":"newborn "
        },
        "1241":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "The cafeteria and Star fell right into a huge pot of food ",
                "the science lab. she landed on some weird chemicals that had an affect on her",
                "a dumpster outside. soon a dump truck came and took Star away "
            ],
            "content":"<div class=\"\"><div> <span>Baby Star made a huge mistake climbing up to the sink now she couldn't get down. being a baby was wasn't very mobile <br>\r\nIf she could reach her wand she might be able to undo this but in the heat of the moment she forgot and now the newborn naked Star was stuck on the counter. <br>\r\n<br>\r\n\"Crud...I need to find a way down and fix this! I can't be seen like this. <br>\r\nStar looking around soon saw a near by air vent. it was tiny but seeing how she was no bigger then a football it would be pretty easy for her to climb in. she thought maybe she could climbed through find a safe way down and get back to the bathroom and fix this.<br>\r\nStar opened the vent and crawled inside <br>\r\n<br>\r\nThe little naked pale baby crawled through the dark vents hoping to find an exit. <br>\r\nShe knew no one could see her but the thought of her plump little baby ass being on full display behind her made her feel embarrassed <br>\r\nSoon she saw a light at the end of the tunnel she climbed through and tripped a bit sending her falling out and into.....<br>\r\n</span></div></div>",
            "created":1587358800,
            "id":2821932,
            "title":"Tried to find an alternate route down."
        },
        "12412":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Gained a ton of weight",
                "Grew a huge penis",
                "Shrank even younger!",
                "Didn't change, but became incredibly hungry..."
            ],
            "content":"<div class=\"\"><div> <span>Star crawled through those air ducts like her life depended on it. And in a way, it did. Or at least any life she wanted to live, she didn't want to spend another 15 years regrowing into her old age, or worse, staying like this forever! She wasn't entirely certain which it was, but she wasn't entirely eager to find out.<br>\r\nEventually she found a loose vent, and managed to bust it open and fell down into the science lab, breaking plenty of vials on the way down and getting doused in strange liquid. Thankfully, nobody was about to see her at that particular moment, but she certainly was embarrassed nonetheless. Now she was in an even more public space, with more chances of somebody seeing her in such a compromising position! She looked around for any way out, until she began to feel something strange. The chemicals she was doused in must've had some effect on her body, as she was rapidly beginning to change!<br>\r\n\"Oh no, oh no! What's going on? I... Feel funny!\" Star said, as she...</span></div></div>",
            "created":1587444300,
            "id":2821946,
            "title":"the science lab. she landed on some weird chemi..."
        },
        "124121":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "As she waddled soon she began to gain weight again ",
                "Someone she knew found her as she tried to get to the bathroom",
                "Star had spent too long and now school was closed and she was locked in "
            ],
            "content":"<div class=\"\"><div> <span>Star stood up seeing the chemicals have splashed all over her.<br>\r\nStar thought to ignore it and go find a way down she saw a way down off the table and went down Now she was pretty far from the bathroom she would have to navigate an entire school to get back to the bathroom<br>\r\nAs she was about to walk their suddenly something weird began to happen<br>\r\n <br>\r\n\"Ohhhh..what the? my belly feels so full...\" she said holding her pale flat stomach. only in horror to see it balloon out into a big round fat belly! <br>\r\n\"Oh no! I'm getting fat! she said as she watched her whole body swell up.<br>\r\nHer arms and legs became thick and round. her hands and feet sunk into her chubby wrists and ankles.<br>\r\nShe grew a huge round fat ass two massive pale butt cheeks big enouth to crush a water melon. <br>\r\n<br>\r\nShe even grew fat round boobs and even her cute face became chunky with big cheeks and 3 chins.<br>\r\nPoor Baby Star was morbidly obese now<br>\r\n\"Not only am I a baby but I'm an obese pig now too? oh this just keeps getting worse! <br>\r\nBaby Star was still able to move despite being so fat so she had to act and get back to finding her wand and hopefully fixing this.<br>\r\nBaby Star now had to get back to the bathroom without getting caught. <br>\r\n<br>\r\nShe waddled her big fat ass through the school halls hoping things wouldn't get worse.<br>\r\n</span></div></div>",
            "created":1587473400,
            "id":2822075,
            "title":"Gained a ton of weight"
        },
        "1241212":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Marco",
                "Jackie",
                "Tom"
            ],
            "content":"<div class=\"\"><div> <span>Star waddled through the school halls, taking a look at the time. She'd spent so long trying to cast her spell, going through the vents, gaining a ton of weight and now struggling to make it back to the bathroom that the school day was almost up! If she wasn't quick, she'd be locked inside with no way out, unless someone found her, which would be even worse.<br>\r\n<br>\r\nStar waddled her 350 pound newborn body all around the school, desperately searching for the bathroom that held her wand, hoping that maybe, just maybe, she'd be able to get back to her normal self again. Thankfully she was able to, and with a grin she made her way over to the girl's bathroom where she could just feel her wand laying in wait for her.<br>\r\n<br>\r\nBut, just as she was about to celebrate her return to normality, who should appear but...</span></div></div>",
            "created":1587491220,
            "id":2822222,
            "title":"Someone she knew found her as she tried to get ..."
        },
        "12412122":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Used the wand on Star to make her grow younger and fatter ",
                "Broke the wand and stuffed Star into her backpack and took her home ",
                "Gave Star the wand and Star being petty used the age regression spell on Jackie "
            ],
            "content":"<div class=\"\"><div> <span>Star waddled her fat ass across the school halls thanking god no one was around it seemed most people have left school already.<br>\r\nBaby Star was hoping she could get her wand turn herself back into her cocky slim teen self and get back home with Marco no one would ever know this happened and she could just treat this as a weird day to look back at and laugh about.  <br>\r\nBut as she waddled into the bathroom hoping to find her wand she froze in place her fat belly and ass jiggling from motion as she stood still like a deer in the headlights. <br>\r\n<br>\r\nIt was Jackie! Stars revival as Star had a crush on Marco but Marco had a crush on Jackie and that always made Star jealous of her. <br>\r\nJackie stared down at the obese newborn and said \"Star? what the hell happened to you man? <br>\r\nStar blushed and said \"Hmmm....it's a long story. I need my wand so I can change myself back to normal! <br>\r\nJackie picked up the wand from the pile of cloths in the stall and said \"This wand?<br>\r\nStar said \"Yes give it to me please! <br>\r\n<br>\r\nJackie looked down at the big pile of fat taken up the bathroom hall and.......</span></div></div>",
            "created":1587491820,
            "id":2822226,
            "title":"Jackie"
        },
        "124121222":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "A restaurant",
                "Jackie's house",
                "A large factory",
                "The dump"
            ],
            "content":"<div class=\"\"><div> <span>Jackie looked at the heavily obese Star and smiled, taking the wand and breaking it over her knee. The magic inside of it faded away as she tossed it right in front of Star. \"Whoops!\"<br>\r\nStar let out a mortified gasp. \"Wh-what did... You do?\"<br>\r\n\"Honestly, I was thinking of using it to bring you back to normal, but then I remembered I have no idea how it works! And because you're too small and fat to even use it, what's the point of even keeping such a worthless relic around?\" Jackie asked, picking up the tiny baby star by her armpits. \"Besides... You like way cuter like this.\"<br>\r\n\"N-no! Let me go!\" Star squirmed as Jackie stuffed her into her backpack.<br>\r\n\"Shh, little baby. Be quiet and don't be fussy, I'll have my fun with you soon enough.\" Jackie smiled, heaving the backpack around her arms and carrying the heavy infant all the way out of school without anyone even noticing.<br>\r\n<br>\r\nJackie would soon take Star out of the bag, flopping her onto a table in a dark room.<br>\r\n\"Huff... Huff... Wh-where am I?\" Star asked, looking around only to have the lights turn on magically, revealing...</span></div></div>",
            "created":1587492420,
            "id":2822232,
            "title":"Broke the wand and stuffed Star into her backpa..."
        },
        "1241212222":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Jackie fed Star all night then used her fat belly as a bed ",
                "a month later and Star had been stuck in Jackie's basement ever since ",
                "Jackie had more chemicals from the science lab to use on Star "
            ],
            "content":"<div class=\"\"><div> <span>Star saw she was in Jackie's house. now sitting on a bed, she saw she was in the basement. <br>\r\nJackie arched her back and said \"Ohh boy. you are so heavy. nearly broke my back carrying your fat ass home\" Jackie joked. <br>\r\nStar feeling like she wanted to cry like the newborn she was said \"You can't do this to me! I'm a princess. people will know I'm missing Marco will come find me.\" <br>\r\n<br>\r\nJackie said \"I'm sure he'll look but he'll never find you. no one will know what happened. Before I left I dumped that broken wand and all your useless ugly cloths down the toilet. took a lot of flushes.\"  <br>\r\nStar with a red face and tears in her eyes said \"Why Jackie? you've doomed me to being a newborn forever! I'll never get a boyfriend now!  <br>\r\nJackie said \"Awwww don't cry baby. mommy Jackie will look after you now. the truth is I've always had a fantasy about fattening up a small helpless baby making them into my cute fat blob bed. and you are just so cute like this I couldn't resist. now in here I can do what ever I want! <br>\r\nStar said \"No please Jackie stop! Mmmmgggghhhh\" she was silenced as a big hot dog was stuffed into her mouth.<br>\r\n<br>\r\n\"Shhhh hush little baby don't say a word. momma's gonna feed you in till you burst! she said stuffing more food down her mouth.<br>\r\nJackie had ordered a lot of food to fatten Star up with and the feeding just wouldn't stop.<br>\r\nStars belly grew across the bed her ass filling up the back her limbs became useless sacks of fat.  <br>\r\n<br>\r\nStar was now at Jackie's mercy....</span></div></div>",
            "created":1587493140,
            "id":2822237,
            "title":"Jackie's house"
        },
        "12412122222":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Used a chemical from the science lab to erase Star from people's memory.",
                "Told Marco she went back to Mewnie, and was never coming back.",
                "Actually had Star's wand the whole time she broke a fake one!"
            ],
            "content":"<div class=\"\"><div> <span>An entire month had passed, though it's not as if Star would've noticed. Her life had become all about eating and sleeping, gulping down endless amounts of food from her captor Jackie while she splayed herself across her massive body. At first people went searching for Star, but for some mysterious reason, likely something to do with Jackie, they all stopped. It was as if they either didn't care about her, or just forgot her existence entirely.<br>\r\n<br>\r\nStar would continue to hold out hope, however, not knowing that the search parties had been called off and she may as well just be another random baby. It wasn't as if she could leave, either, her body had grown so massive she could easily crush cars beneath her ass, her belly gorged to the point of filling up nearly the entire basement she dwell in.<br>\r\nAs Jackie came down with many more bags of food to feed the massive infant Star, the little infant sighed in a depressed tone. \"N-nobody's coming for me, are they? I'm gonna be trapped down here forever...\"<br>\r\n\"Yes, little Star. Well... Not forever.\" Jackie mentioned. \"Eventually we'll have to move you, you're getting so big you'll soon outgrow the house. But I need to let you in on a little secret...\"<br>\r\nStar gasped, hearing what Jackie had done to keep Star her's for the rest of eternity. Jackie...</span></div></div>",
            "created":1587494040,
            "id":2822246,
            "title":"a month later and Star had been stuck in Jackie..."
        },
        "124121222221":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "It's time I take you to a place where you can grow forover! ",
                "I'm removing your memory too. your going to be a blank slate ",
                "I'm leaving you down here. you enjoy being alone forover "
            ],
            "content":"<div class=\"\"><div> <span>Jackie showed Star a bottle filled with a strange chemical.<br>\r\nJackie said \"I nerd in the science lab gave this to me. I bribed him with my nudes\" she gave a cheeky wink. <br>\r\nStar said \"What is that? magic? <br>\r\n<br>\r\nJackie said \"No just good old fashioned science. thanks to this chemical everyone I slipped it to now has no memory of you Star! <br>\r\nStar's eyes went wide. \"What! that's not possible! theirs not even magic capable of such things! <br>\r\nJackie said \"Oh it's true. I gave this to almost everyone I could think of who knew you. the school your friends. even people you barely know. I even gave it to your parents. and best of all...not even Marco remembers you Star. you've left no traces. you've been written out of everyone's lifes you might as well not exist.\" she said getting more sinister. <br>\r\n<br>\r\nStar began to cry like the newborn she was weeping tears down her fat cheeks.<br>\r\n\"No! how could you do this to me! Marco! please remember me please! I don't want to be alone! she said crying hard making her rolls jiggle around. <br>\r\nJackie said \"Awww don't worry my sweet fat baby. mommy Jackie is still here. you still have me and with no one else to remember you. your all mine! she said pressing her body into Star's fat belly hugging her huge pale tummy like it was her giant teddy. <br>\r\n<br>\r\nJackie said \"Cheer up Star. you don't need to cry anymore because......</span></div></div>",
            "created":1587495060,
            "id":2822256,
            "title":"Used a chemical from the science lab to erase S..."
        },
        "1241212222212":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Her daughter, gluttonous and spoiled.",
                "A baby, blobby prostitute, hungry to get dicked.",
                "Nothing, she just left her in the basement, never knowing who she was."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to remove your memory as well, Star. You'll disappear from this world, and nobody will be able to bring you back.\" Jackie smiled. \"Now you'll never get in the way of me and Marco!\"<br>\r\nStar was panicked. The drink came closer and closer to her lips as she struggled to break free, hoping this was all some kind of sick, twisted nightmare! But unfortunately, it was all too real. As the chemicals slid down her throat, her memories faded away, the last remnants of Star's life had disappeared and now Star was nothing but a husk of her former self. Not a single trace of Star existed, and her mind was open to suggestion on her new personality.<br>\r\n\"Who... Am I?\" Star asked, Jackie pondering her next move.<br>\r\n<br>\r\nJackie thought it through hard, and decided Star should be...</span></div></div>",
            "created":1587495960,
            "id":2822263,
            "title":"I'm removing your memory too. your going to..."
        },
        "12412122222121":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Jackie brought Piggy to a new place where she could grow and grow in peace",
                "Jackie rewrote Marcos mind to make him her husband making them a family unit",
                "Jackie wanted Piggy to look like a new person she hated being reminded of Star"
            ],
            "content":"<div class=\"\"><div> <span>Star was finally gone. all traces of her now removed from the world with her memory removed leaving her as a blank state. an eternally new person with Stars body.<br>\r\nStar said \"Wait who am I? I don't know who I am...\" she said confused. <br>\r\nJackie put her hands over her fat round cheeks and said \"Wakey wakey sleepy head. how's mommys angel doing today?<br>\r\nStar said \"Huh? mommy? clearly still confused. <br>\r\n<br>\r\nJackie said \"Oh don't you remember sweetie? it's me your mommy Jackie.\"<br>\r\nStar said \"Your....my mommy? almost like it made sense to her.<br>\r\nJackie said \"Yes and your my sweet fat spoiled little baby your name is Piggy! and your the most spoiled brattiest and most of all Gluttonous little baby in the whole world. and all you want to do is get fatter! <br>\r\nStar said \"Yes...Piggy..Hehehehe of course I know now. I'm piggy. the fattest baby on Earth and I am so hungry feed me mommy! I want to get so BIG! <br>\r\n<br>\r\nJackie was so happy Star was finally gone and in her place was her new pet Piggy. <br>\r\n</span></div></div>",
            "created":1587501420,
            "id":2822297,
            "title":"Her daughter, gluttonous and spoiled."
        },
        "124121222221213":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Wanted to feed her, but needed to take her somewhere else.",
                "Grew romantic feelings towards Piggy, wanting to be with her instead of Marco.",
                "Just left Piggy in the basement, only occasionally coming down to check on her."
            ],
            "content":"<div class=\"\"><div> <span>Jackie knew Star was gone for good, nothing would ever bring back the memory of that annoying magic girl the world once knew. But Piggy still looked like Star, and she couldn't have that! So Jackie decided to give Piggy a little makeover.<br>\r\nShe pulled out a duffer bag of clothes, all of them made to fit any size, no matter how ludicrous. \"Here we are, Piggy! Let's get you into something more presentable...\"<br>\r\n<br>\r\nJackie began making alterations, changing her clothes, her hairstyle, even different contacts that changed her eye color. But eventually she settle on the perfect outfit: A huge pink tank top and skirt, barely covering her massive ass, with no panties and a little tiara on her head as well. She also had much longer hair now, dyed pink as well.<br>\r\n\"There you are! My little, tubby princess.\" Jackie smiled, rubbing her up and down. \"You're such an adorable, beautiful baby blob, you know that?\"<br>\r\n\"Yaaay!\" Piggy smiled, no longer even slightly resembling the magical princess she once was. It was as if this were a completely different person, as though Star had been banished from existence entirely.<br>\r\n<br>\r\nWith this new Piggy daughter Jackie had, Jackie...</span></div></div>",
            "created":1587502680,
            "id":2822310,
            "title":"Jackie wanted Piggy to look like a new person s..."
        },
        "1241212222212131":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "She was at a cake factory ",
                "She was in a huge field ",
                "She was in an endless bunker deep underground "
            ],
            "content":"<div class=\"\"><div> <span>Jackie was very pleased with the results as she looked at the newborn blob girl. she didn't see anything resembling Star anymore. she now had bright green eyes instead of blue. her hair was long curly pink. she had new cute pink tank top and skirt. a little tiara. and she even gave her a fake beauty mark. <br>\r\n<br>\r\nAll traces of Star where gone now all the was left was Piggy and Jackie loved everything about her blob daughter. <br>\r\nJackie said \"Do you like your new look honey? <br>\r\nPiggy smiled and said \"I look so much better like this mommy. in fact I'm not really sure how I looked before you gave me a makeover and new cloths. of well I like this so much more! <br>\r\n<br>\r\nJackie hugged her fat baby saying \"Oh your perfect now. not a single flaw. but there is something we need to fix. your still far too small for my liking. <br>\r\nPiggy jiggled around excitedly \"Yeah I want to be fatter mommy! feed me! <br>\r\nJackie had to get Piggy to a new place to feed her. it was a struggle but she managed to get her huge ass upstairs and outside. <br>\r\nNow outside Jackie used a forklift to drive Piggy to her new home.<br>\r\nP<br>\r\niggy was excited to see...... </span></div></div>",
            "created":1587503160,
            "id":2822314,
            "title":"Wanted to feed her, but needed to take her some..."
        },
        "12412122222121313":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Piggy would spend forever here, eventually becoming mindless.",
                "Jackie changed her mind, coming up with a new plan to torment \"Star\"",
                "Someone else found Piggy, and had their own ideas on how to use her."
            ],
            "content":"<div class=\"\"><div> <span>Despite having her memory wiped from everyone and everything, Jackie didn't even want Star's body to be seen ever again. In preparation for this day, she found an underground bunker that was equipped with it's own time-space displacement array, which allowed for the space to go on for eternity, and time to move much, much slower. You could spend a millions upon billions of centuries trapped in this space, and only a fraction of a nanosecond would pass in the real world.<br>\r\n\"Here we are, Piggy. Where you'll spend the rest of eternity. I won't be here to see you grow into the massive blob I know you will, for I have a boyfriend to meet.\" Jackie smiled. \"You'll outgrow the world, the solar system, entire galaxies, constantly growing forever without end. Even when the world comes to an end, you won't be aware of it. You'll be trapped in this pocket dimension, blissfully unaware of everything going on outside. If you think about it, I'm doing you a favor.\"<br>\r\n<br>\r\nJackie hooked up a tube to Piggy's mouth, and huge bulges of food came pouring in, fattening her up rather quickly. Piggy just moaned in pleasure as Jackie left her, snickering ominously.<br>\r\n\"Goodbye, Star... You were always such an annoying brat, it's only fitting you spend the rest of eternity trapped in a fat body, your old life forgotten with nobody around to save you.\" Jackie mentioned, as she left Piggy alone in this realm forever...</span></div></div>",
            "created":1587505920,
            "id":2822327,
            "title":"She was in an endless bunker deep underground "
        },
        "124121222221213131":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Star would become nothing but a husk. no soul just a body eating forever [END]",
                "Someone soon found her but to Star in this bunker it had been decades ",
                "Star many decades later broke out of her trace remembering who she is"
            ],
            "content":"<div class=\"\"><div> <span>Piggy was sad she would never see her mommy again but everything else she said was a dream.<br>\r\nAll she wanted was to eat and grow fatter and her mommy would make sure that dream would become real and last forever  <br>\r\nNow in this giant white room she could grow and grow decades would pass and not even a second outside would of gone by.<br>\r\nPiggy would never notice or care. As Jakie stuffed the feeding tube into her mouth. Piggy just moaned in pure pleasure as an endless stream of sugar coated cake batter pure down her throat. \"Mmmmmmmmmhhhhhhh \"Gulp gulp gulp gulp gulp\" <br>\r\n<br>\r\nJackie would spend the rest of her life with Marco marrying him and starting a family with him. with Marco not knowing anything about her freind Star. Jackie never never even mentioned her like she never existed. she herself even soon forgot about her. <br>\r\nPiggy meanwhile would spend decades upon decades just growing. her cloths long ago ripping apart as she became two as big as the planet. <br>\r\nHer fat rolls jiggled all over. her soft newborn fat jiggling and wobbling around as she ate and moaned. <br>\r\nPiggy lost all sense of time. soon her mind began to melt away. <br>\r\n<br>\r\nShe didn't have any real thoughts anymore. she forgot about her mommy Jackie, she soon forgot her own goals and even her bare bones personality began to fade. <br>\r\nSoon Piggy became nothing more but a robot. her eyes glazed over as her mind went blank like a busted TV. with only her heart beating and the sounds of her emotionless eating filled the never ending room.<br>\r\nStar had reached her final chapter. an endless chapter that would never end just her growing for all eternity....</span></div></div>",
            "created":1587506700,
            "id":2822334,
            "title":"Piggy would spend forever here, eventually beco..."
        },
        "1241212222212131311":{
            "author_id":"single22",
            "author_name":"Singed212",
            "content":"<div class=\"\"><div> <span>Nobody would ever see or hear from her ever again. She wasn't even Piggy anymore, just an permanent blob of flesh growing and growing, reaching sizes far past the extent of the universe in this infinite plane. She had even spent so much time in this realm, that even if she managed to shrink back down, regain her memories and leave, the whole planet had already been destroyed, and all that was left of anywhere was this realm, where the mindless, soulless baby blob would continue to grow forever. No matter what happened, Star would keep filling her reality-crushing body, resuming to make it infinitely massive, no part aside from her naturally wobbling belly moving even an inch.<br>\r\n<br>\r\nStar was gone. Everything she knew was gone. All that was left was her big, fat belly.</span></div></div>",
            "created":1587507180,
            "id":2822337,
            "title":"Star would become nothing but a husk. no soul j..."
        }
    },
    "info":{
        "author_id":"single22",
        "author_name":"Singed212",
        "brief_description":"Star Butterfly, but as a baby, growing fatter!",
        "created":1563324120,
        "description":"<td align=\"left\" class=\"norm\">Star Butterfly from age 0-3 growing fatter than any other star!<br>\r\n<br>\r\nRules are as always: No scat, no gore and no transformation (Except futa)<br>\r\n</td>",
        "id":2195891,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1587503605/item_id/2195891.jpeg",
        "last_full_update":1587507180,
        "modified":1587507180,
        "pretty_title":"Star Babyfly WG Story"
    }
}