{
    "chapters":{
        "1":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Muscle Growth",
                "Height Growth",
                "Weight Gain",
                "Inflation",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to Metropolis, home of the Daily Planet, Luthorcorp and most importantly of all, Superman! The Man of Steel has become an iconic figure to the world, handsome proud and strong. But, things are going to change...or more specifically, he is.<br>\r\n<br>\r\nWhich path will you take?<br>\r\n<br>\r\n</span></div></div>",
            "created":1277096400,
            "id":903915,
            "title":"It begins"
        },
        "11":{
            "choices":[
                "New kind of kryptonite",
                "Solar flares",
                "Kryptonian second puberty",
                "An enemy plot",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Superman has lots of super powers and stuff, but the things that stand out most of all is his Super Strength and his muscular physique. But now he's going to become even more muscular! How is he going to grow?</span></div></span></div>",
            "created":1277096400,
            "id":903957,
            "title":"Muscle Growth"
        },
        "111":{
            "author_id":"apollotalon",
            "author_name":"Jordan",
            "choices":[
                "Lois begins to ask questions involving the kryptonite.",
                "Clark goes for a closer look at the kryptonite.",
                "A man comes in and moves the kryptionite from its case; passing by Clark."
            ],
            "content":"<div class=\"\"><div> <span>Clark Kent and Lois Lane were heading to a reasearch wearhouse to get a first hand view of an unusual chunk of kryptonite.  When they entered the facility they encountered a Professor named Issac Jameson. Jameson led the two reporters to the lab where the kryptonite was being stored. In the middle of the lab was a little rock, about the size of a human fist; it was the kryptonite. It was giving off a blue glow from within its lead glass case.</span></div></div>",
            "created":1311656400,
            "id":1155280,
            "title":"New kind of kryptonite"
        },
        "1112":{
            "author_id":"stenfk3",
            "author_name":"Sten",
            "choices":[
                "He grows immediately",
                "He grows slowly ",
                "Nothing happens...yet"
            ],
            "content":"<div class=\"\"><div> <span>Lois was interviewing dr Jameson, so Clark took that chance to get a closer look at the kryptonite. He walked towards the box and touched the glass. But when he touched the box, the kryptonite suddenly started throwing rays everywhere. One of them hit Clark unprotected. He didn't knew what to do.</span></div></div>",
            "created":1545505260,
            "id":2592020,
            "title":"Unprotected ray exposure"
        },
        "11123":{
            "author_id":"stenfk3",
            "author_name":"Sten",
            "choices":[
                "He grows in spurts",
                "He grows later"
            ],
            "content":"<div class=\"\"><div> <span>Clark instinctively tried to shield his eyes from the glowing kryptonite. The bright light stopped and he waited for something to happen... But nothing happened. <br>\r\n<br>\r\n\"What will happen if you come in contact with the kryptonite?\" Clark overheard Lois interview. <br>\r\n<br>\r\n\"We don't know for sure, but we're not going to test it on someone.\" Jameson said not knowing Clark already did.<br>\r\n<br>\r\nClark became a little worried that nothing happened and checked himself one more time, only to discover that still nothing had happened. </span></div></div>",
            "created":1545592680,
            "id":2592493,
            "title":"Nothing happens...yet"
        },
        "1113":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "He starts growing immediately",
                "He grows slowly",
                "Nothing happens...yet"
            ],
            "content":"<div class=\"\"><div> <span>After hearing about a newly discovered kryptonite, Clark Kent (otherwise known as Superman) came to investigate. All kryptonite, no matter what the color or the effect, needed to be carefully dealt with, because in the wrong hands it could mean disaster. Fortunately, they were the first ones to hear of it, so Clark was able to get to it first before any evil villains could.<br>\r\n<br>\r\nAs Lois did her interview with Professor Jameson, Clark took this chance to take a look at the kryptonite. It didn't appear to be the same variety as the blue kryptonite he had encountered before, this version was a different shade of blue, so it was indeed a new kind of kryptonite. Before he could observe any closer, however, someone in a lab coat went to the box, opened it and took out the kryptonite, the rays hitting Clark unprotected!</span></div></div>",
            "created":1314853200,
            "id":1179300,
            "title":"Accidental Exposure"
        },
        "11131":{
            "author_id":"stenfk3",
            "author_name":"Sten",
            "choices":[
                "Clark grows at home",
                "Clark decides to go to the gym but the kryptonites power hasn't worn out yet"
            ],
            "content":"<div class=\"\"><div> <span>Clark tried to protect himself...but it was already too late. Clark's muscles started feeling really tight, they started making a ripping sound... <br>\r\n<br>\r\nAll his muscles started to grow. His pecs started to inflate and stretching his upper shirt a lot almost revealing his suit. \"Oh no, my identity must stay secret!\" Clark flustered. Then at the moment of ripping... His pecs stopped growing, but already were big inflating ovalic balloons. <br>\r\n<br>\r\nHis arms filled his upper shirt more and more... Eventually his biceps started bulging out his shirt revealing a little and in that hole a piece of his suit. He had to get out of here! But how? He still had to finish his investigation. His abs started hardening and almost instantly forming in an eight pack. His lats grew holding his arms a little more up. His waist got smaller making his muscles look even bigger.<br>\r\nAt the end, his muscles stopped growing.<br>\r\n<br>\r\n\"Phew! Clark said, it's done!\" But it really wasn't. His legs started growing ripping his office pants. There already started forming tears... But then they stopped growing. His calves grew a little too, but not enough for someone to notice. Then...he stopped growing, he was just standing there shocked. He just got a little growth spurt, but how would the kryptonite affect him further and it could reveal him as Superman. <br>\r\n<br>\r\nHe heard Lois saying: \"thank you for the interview, that's all for now!\" \"but wait, how would the kryptonite affect Superman?\" she asked. <br>\r\n<br>\r\n\"Well we don't know, but we're not going to do such a thing, it could be really dangerous!\" Jameson said not knowing Clark already had been exposed to the kryptonite. <br>\r\n<br>\r\n\"May I bring the kryptonite to Superman?\" Lois asked. <br>\r\n<br>\r\n\"You can't...well okay, but only if you write down what happened!\" Jameson said.<br>\r\n<br>\r\n\"Thank you professor\" Lois said. She took the kryptonite. \"We can go now, Clark.\" she said, not noticing that Clark had grown.<br>\r\n<br>\r\n\"Yes well, my stomach is upset..so I think I'm going home!\" Clark said scared for the kryptonite. <br>\r\n<br>\r\n\"Sorry to hear that, well then... Could you deliver this to Superman?\" She asked, giving Clark the kryptonite. <br>\r\n<br>\r\n\"Um..sure!\" \"see you tomorrow!\" he said scared that he had to take the kryptonite home now. How much would he grow now...and when?<br>\r\n</span></div></div>",
            "created":1546602300,
            "id":2598597,
            "title":"He starts growing immediately"
        },
        "111311":{
            "author_id":"apollotalon",
            "author_name":"Jordan",
            "choices":[
                "He begins to grow slowly",
                "He grows quickly, faster than before",
                "He bulges out instantly"
            ],
            "content":"<div class=\"\"><div> <span>Later at home. Clark felt nervous. <br>\r\n\"That was close,\" he said to himself, \"If my growth went any further, my secret identity would have been revealed.\"<br>\r\nHe then took off his glasses, \"Well, at least it's over for n-\"<br>\r\nSuddenly, he felt a vibrating sensation. \"Oh, no...\" he said, \"That's not good...\" <br>\r\nSuddenly, he began to grow again...</span></div></div>",
            "created":1556224740,
            "id":2650309,
            "title":"Clark grows at home"
        },
        "11132":{
            "author_id":"stenfk3",
            "author_name":"Sten",
            "choices":[
                "Clark grows at home",
                "Clark grows while he's flying"
            ],
            "content":"<div class=\"\"><div> <span>The rays started to glow brighter when they touched Clark. Everything lit up for a second, blinding everything and everyone; especially Clark. With a flash it was gone. Clark's body started making a ripping sound.<br>\r\n<br>\r\nHis pecs pushed his office shirt further in a slow rate, slowly ripping the shirt until it ripped and revealed the Superman sign on his suit. <br>\r\n<br>\r\nHis biceps slowly grew ripping the sleeves, his triceps tearing the sleeves and eventually it ripped and the shirt almost fell off. <br>\r\n<br>\r\nHis eight pack formed a ten pack. His back teared the shirt but the shirt could hold the muscled wings of his back...for now. <br>\r\n\"Umm...oh god!\" Clark moaned softly.<br>\r\n<br>\r\nHis quads grew and eventually his legs grew slowly making holes in his pants, growing wider and wider but it didn't rip.<br>\r\nHis already muscular calves bulged more.<br>\r\n<br>\r\nAll his clothing at the edge of bursting, he stopped growing. \"I have to get as fast away as I can!\" He whispered slowly backing away from the blue kryptonite, as if that would stop the growth. \"Lois I have to go!\" Clark said. \"Clark wait i'm-\" She turned around but Clark was already gone.<br>\r\n<br>\r\nLater on...</span></div></div>",
            "created":1545343200,
            "id":2591342,
            "title":"He grows slowly"
        },
        "11133":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Superman grows in spurts",
                "Superman grows later"
            ],
            "content":"<div class=\"\"><div> <span>Instinctively Clark tried to shield himself with his hands, despite knowing that it would be pointless. He waited for the effects of the kryptonite to take hold...but nothing happened.<br>\r\n<br>\r\nLois and Professor Jameson were too busy speaking with one another to notice Clark's little moment. A bit confused, Clark began to check to see if there were any effects. He didn't feel any different at all, so it was not poisonous to him like Green Kryptonite. He didn't feel any aggressiveness or unrestrained emotions like the Red Kryptonite. He was still able to see through walls with his X-ray vision, so his powers seemed unaffected. For now he seemed perfectly normal...for a super powered alien, that is.<br>\r\n<br>\r\n\"So what effects would this kryptonite have on Superman?\" Clark heard Lois asked the Professor.<br>\r\n<br>\r\n\"I'm afraid we won't know until we actually expose it to him, but I for one am not willing to do such a thing.\"  Professor Jameson replied, not knowing that he already did.<br>\r\n<br>\r\n</span></div></div>",
            "created":1343451600,
            "id":1391994,
            "title":"Nothing happens...yet"
        },
        "111331":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Superman has another growth spurt that night when he's at home",
                "Superman has a growth spurt when he's as Clark Kent in his office"
            ],
            "content":"<div class=\"\"><div> <span>\"Well then, I will see if I can arrange a meeting...\" Lois suggested. \"I see Superman occasionally and maybe I can convince him to come here, in a controlled environment, and to see if it affects him!\"<br>\r\n<br>\r\nLois then turned towards Clark.<br>\r\n<br>\r\n\"Come on, Clark! We're done here!\"<br>\r\n<br>\r\n\"Sure, Lois!\"<br>\r\n<br>\r\nThe two then walked back to the car, which was parked outside. Meanwhile, Clark felt like his shirt and his suit was feeling a bit tight. Had he grown a bit?<br>\r\n<br>\r\nWhen they arrived back at the offices of the Daily Planet newspaper, Clark went into the men's room and he removed his coat. There, he noticed that he seemed a little more... muscular. Did that brief exposure to the blue Kryptonite cause his muscles to grow?<br>\r\n<br>\r\nHe put on his jacket and walked back outside.<br>\r\n<br>\r\n\"Clark! Oh there you are!\" Lois said to him. \"Let's see if Superman can meet us here this afternoon and if he wants to come to the lab with us!\"<br>\r\n<br>\r\n\"Well, umm...\" Clark mumbled. \"My stomach is upset again... I think I'm going home...\"<br>\r\n<br>\r\n\"Alright. See if you can get a hold of Superman before you go!\" Lois ordered him.<br>\r\n<br>\r\nClark went in his office and made a phone call before he left.<br>\r\n<br>\r\nMoments later, Superman arrived at Lois' office door at the Daily Planet!<br>\r\n<br>\r\n\"Superman! Good to see you! Can you meet us at the lab where Professor Jameson works? They have some blue kryptonite there and they're curious to find out how it affects you!\" she said to him.<br>\r\n<br>\r\n\"Very well! I'll fly over there and meet you at the entrance!\" Superman said. Then, the Man of Steel raced down the hall, leaped out the window, and flew to the lab where he waited for Lois to arrive in her car.<br>\r\n<br>\r\nLois and Superman then met Isaac jameson, who took them into the room where the blue Kryptonite was stored behind a glass display covered with lead walls.<br>\r\n<br>\r\n\"Do you feel anything?\" Lois asked Superman.<br>\r\n<br>\r\n\"No, not really...\" he replied.<br>\r\n<br>\r\nThen Mr. Jameson took his keys and unlocked the display, opening the cover and exposing Superman to the blue rock, which was the size of a human fist.<br>\r\n<br>\r\nThe rock was oval shaped and it had a teal color to it, and the surface was shiny and smooth.<br>\r\n<br>\r\n\"Wow, it's so pretty!\" Lois said, holding the blue Kryptonite in her hand.<br>\r\n<br>\r\n\"Superman! What are you feeling now?\" Dr. Jameson asked him.<br>\r\n<br>\r\n\"I... Umm... I feel like... I'm getting... bigger and... stronger!\" the Man of Steel replied, as he flexed his muscles.<br>\r\n<br>\r\nThen, Superman's chest began to push out while his shoulders expanded a bit. His biceps appeared to be inflating as well. <br>\r\n<br>\r\n\"Ummmmm.... Arrrhhhhh!\" Superman growled softly, while Lois held the blue Kryptonite close to him.<br>\r\n<br>\r\nSuperman's calves became harder and thicker while his quads grew wider and deeper. Then his growth spurt stopped.<br>\r\n<br>\r\n\"Wow! Superman! You had a growth spurt!\" Lois exclaimed.<br>\r\n<br>\r\nSuperman looked more muscular than ever! he had put on at least thirty pounds of muscle!<br>\r\n<br>\r\n\"Remarkable!\" Dr. Jameson said, as he put the stone back.<br>\r\n<br>\r\n\"Wow! I feel stronger!\" Superman smiled, as he flexed his bigger biceps.<br>\r\n<br>\r\n\"Well, now we know how this affects you! Thanks, Superman!\" <br>\r\n<br>\r\nLois and Superman then left, happy to have completed the experiment.<br>\r\n<br>\r\nHowever, Superman wasn't done growing yet...<br>\r\n<br>\r\n</span></div></div>",
            "created":1352005200,
            "id":1460712,
            "title":"Superman grows in spurts"
        },
        "1113311":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Blue rock, big growth spurt",
                "Super muscle giant"
            ],
            "content":"<div class=\"\"><div> <span>Superman was back in his apartment that night, lifting weights in the basement using special weight training equipment that was especially made for him and his super strength. When he was done, he took a shower and dried off in the bathroom, using the large mirror to examine his reelection of his now extremely impressive physique.<br>\r\n<br>\r\n\"Wow!\" He gasped, as he took note oh his bigger chest and arms. He grinned at the thought of having experienced this nice little growth spurt thanks to his brief exposure to blue Kryptonite. Who would have thought that any exposure to this type of rock would have a positive effect on him?<br>\r\n<br>\r\nHe was about to put on his bathrobe so he could watch TV in the living room, when he was suddenly overcome by that intense, weird tingling sensation in his muscles. It was the same thing he felt earlier that day, when he was in the lab. What was going on?<br>\r\n<br>\r\nThen it happened! Superman had a strong urge to flex his arms all of the sudden as he closed his eyes and tilted his head back, letting out a loud moan. Then, while he was standing in his living room, his pectorals inflated to the size of basketballs; his calves in his legs grew to the size of soccer balls, and his quads became even bigger than sewer pipes! Furthermore, his arms and his quads were now covered with thick, long veins that were as thick as ropes. <br>\r\n<br>\r\nIf Superman had looked like a bodybuilder before, then he began to resemble a muscle freak now. His shoulders grew even wider, with mighty lats and delts growing on them as a huge six pack formed over his abdominal muscles. He actually grew four inches taller, getting close to seven feet tall! <br>\r\n<br>\r\n\"Great sons of Rao!\" He gasped, when he stared at his reflection in the mirror. In fact, he was too big for the mirror! \"This can't be good! I had another growth spurt!\"<br>\r\n<br>\r\nThe man of steel loved being big and strong, but what if he kept on getting even bigger than this?<br>\r\n<br>\r\n\"I need to get that rock and examine it so I can create an antidote!\" Superman thought out loud. <br>\r\n<br>\r\nHe picked up his cell phone and started calling Dr. Jameson, only to crush the small device under his great strength! <br>\r\n<br>\r\n\"Oh no! I'm too strong!\"<br>\r\n<br>\r\nThen he tried typing an email on his laptop, only to demolish the laptop keyboard with his super strength and speed.<br>\r\n<br>\r\n\"I'm too big and too strong for this! I need to fly to the lab and get the blue Kryptonite! But, what will happen if I get exposed to it again?\" He wondered out loud.<br>\r\n<br>\r\nThen he leaped out the window and soared across the sky...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1352091600,
            "id":1461181,
            "title":"Superman has another growth spurt that night wh..."
        },
        "11133112":{
            "author_id":"chopper1234",
            "author_name":"Ilike'emhuge",
            "choices":[
                "Kept growing..",
                "Finally stopped... For now..."
            ],
            "content":"<div class=\"\"><div> <span>Superman flew over to the lab, now deserted because of the time, and found the blue kryptonite. He went to remove the cover carefully but instead shattered the glass.<br>\r\n\"Oh no..\" Sighed Superman. He already felt the tingling inside him. Then he felt his pecs growing bigger now the size of beach balls. His biceps growing to the size of basketballs with veins as thick as his own finger wrapping around them. His quads grew huge, straining his suit. His cut 6 pack grew to an outstanding 8 pack. His height increased to about 7'4\". <br>\r\n\"Whoa... I gotta hurry.\" He grabbed the kryptonite in his hands only to get the crystal stuck to his hand.<br>\r\n\"This can't be good...\" Suddenly his body started growing huge, his suit starting to rip to shreds. He was growing so huge and it was turning him on. His \"other\" muscle was growing to, now the size of a water pipe. Soon he was crouching to keep from crushing the building. It was no use though. Soon, he outgrew the lab and was able to stand up. His pecs were HUGE now. They were as big as an entire house now. His biceps were bigger than monster trucks with veins as big as buses on them. His penis was huge bigger than an entire row of apartment buildings. Suddenly, superman felt a surge of pleasure rush through him, he moaned in pleasure.<br>\r\nHe...</span></div></div>",
            "created":1370754000,
            "id":1608073,
            "title":"Super muscle giant"
        },
        "1113312":{
            "author_id":"stenfk3",
            "author_name":"Sten",
            "choices":[
                "Clark grows again at home",
                "Clark grows while he's flying"
            ],
            "content":"<div class=\"\"><div> <span>An hour after the experiment Superman started to feel strange. He quickly changed into his Clark Kent outfit, but just when he wanted to leave he felt his body tingling. <br>\r\n<br>\r\n\"Woah, I might have to sit down for a second!\" Clark said, stumbling and shaking, not knowing that his body was still reacting to the blue kryptonite, he flew to work. <br>\r\n<br>\r\nAfter his tricky flight, Clark ran to the men's room and took off his clothes and his suit. Standing there half naked he saw that he already had gained 10 pounds off hard muscle in the time he was away from the blue kryptonite. \"Oh my, i have to do something or my identity will be revealed!\" Clark thought. He was going to work quick and then had home to think about a solution for the growth problem, he couldn't control it although the kryptonite made him grow right away. <br>\r\n<br>\r\nAt the office, Clark's body started tingling. He tried to concentrate, but the feeling became stronger until he couldn't hold it any longer. <br>\r\n<br>\r\nHis body started to expand. \"Oh my-\" Clark whispered scared that somebody would hear him.  <br>\r\n<br>\r\nHis pecs pushed out of his shirt ripping it and tearing it. His suit pushed almost out of his shirt when it stopped. His biceps gained a few inches and his triceps teared the sleeves revealing a pair of muscled arms in his suit.<br>\r\nHis eight pack slowly turned into a ten pack tightening the suit against his body. His back bursted out of his coat revealing his suit a little. Oh shit, what's happening to me!\" Clark moaned softly. <br>\r\n<br>\r\n\"I...I have to get out of here, now!\" he whispered.<br>\r\n<br>\r\n\"Oh god, not my-\" he started but his muscles grew too big and ripped his jeans. His quads expanded and his already muscular calves bulged more and all over his body started to pop up some veins.<br>\r\n<br>\r\n\"No...no...no!\" he yelled. \"I have to go, bye!\" he said to Lois who just came around the corner. \"Wait I just got-\" Lois started. \"Nevermind.\" she said staring at Clark, suddenly noticing that Clark's back was way more muscular then before and actually Clark's whole body seemed bigger. She knew something wasn't right, but she couldn't put a finger on it.<br>\r\n<br>\r\nLater on...<br>\r\n</span></div></div>",
            "created":1545333420,
            "id":2591294,
            "title":"Superman has a growth spurt when he's as Cl..."
        },
        "112":{
            "choices":[
                "He grows slowly",
                "He has growth spurts",
                "His growth is triggered by something"
            ],
            "content":"<div class=\"\"><div> <span>It was another day in Metropolis, and Clark Kent was just waking up at exactly 7 AM in the morning. Sitting up in his bed, he stretched his limbs, the muscles on his glorious physique bulging outwards as he did so. Getting out of bed, Clark proceeded with his usual morning rituals, which began with starting a pot of coffee going, turning on the TV to listen to the news.<br>\r\n<br>\r\n\"...to tell us about the unusual space activity is Dr. Hamilton from S.T.A.R Labs.\" Lois Lane held her microphone towards Dr. Hamilton.<br>\r\n<br>\r\n\"Yes, recently we've observed a cluster of sun spots acting up and creating solar flares.\" He replied.<br>\r\n<br>\r\n\"Does that mean we'll need to expect some interference and malfunctions with our electronic devices and so on?\" Lois asked.<br>\r\n<br>\r\n\"I see you've done your homework.\" Dr. Hamilton smiled. \"No, unlike normal solar flares, these ones seem to be a bit...unusual.\"<br>\r\n<br>\r\n\"Unusual? How?\"<br>\r\n<br>\r\n\"Normal solar flares emit electromagnetic pulses which, as you said, disrupts our electronic devices. However, from what we observed, these flares are not sending electromagnetic forces, but a different kind of energy we have yet to identify. For now, we'll observe it carefully and see what kind of effects it has on Earth.\"<br>\r\n<br>\r\n\"Thank you Dr. Hamilton. This is Lois Lane reporting, back to you.\"<br>\r\n<br>\r\nWhat kind of effects indeed. Clark frowned as he mentally took in the what Dr. Hamilton said. If the sun was acting up, who knew what kind of effects it would have on Superman, whose powers came from its rays?</span></div></div>",
            "created":1277096400,
            "id":904031,
            "title":"Solar flares"
        },
        "1123":{
            "author_id":"zespara",
            "author_name":"Zespara",
            "choices":[
                "Lois experiences muscle growth after Superman leaves.",
                "Superman's errection doesn't subside so he looks for someone else.",
                "Superman looks starts to feel funny."
            ],
            "content":"<div class=\"\"><div> <span>The solar flare wave approached and quickly the Earth went through it.  All life on the planet appeared to be unaltered except for the lone male Kryptonian standing in the lab.<br>\r\n<br>\r\nSuperman felt a tingling in his loins that subsided after a few minutes.  Looking around with his X-Ray and Telescopic visions, he noticed that nobody else in the city seemed to be affected.  He scanned the lab where he saw Dr. Hamilton and some of his assistants were making notations on their electronic devices after the wave passed through the Earth.<br>\r\n<br>\r\nHe quickly changed into his Superman uniform and quickly flew over to STAR Labs to see if they had discovered anything.<br>\r\n<br>\r\nDr. Hamilton looked up from his work and saw the Man of Steel standing there.  \"What a pleasant surprise, Superman.  We've obtained quite a bit of data from that solar flare.  But it will take a few days to discern what, if any, effects if had on the Earth... or you or your cousin for that matter.\"<br>\r\n<br>\r\nSuperman then looked towards Lois, who had the most seductive smile he had ever seen.  \"It's always a pleasure to see you...  is there something wrong, Superman?\"<br>\r\n<br>\r\nThe Kryptonian felt the pressure in his lower regions well up and he felt a wave of lust come over him.  Without thinking, he rushed quickly over to Lois, grabbing her in his arms and immediately flew her out to their apartment.  \"I have an itch that only you can scratch, Lois.\"<br>\r\n<br>\r\n\"Oh!  Superman!\", Lois replied in a light-hearted manner as though she were acting in a bad play.<br>\r\n<br>\r\nThe tingling continued to crescendo in the Man of Steel's loins as he immediately had sex with her, not even attempting any hint of foreplay until he released a huge load of semen into the woman of his dreams.</span></div></div>",
            "created":1386352260,
            "id":1704060,
            "title":"His growth is triggered by something"
        },
        "115":{
            "author_id":"apollotalon",
            "author_name":"Jordan",
            "choices":[
                "A part of metropolis suffers unusual artificial solar radiation.",
                "a STAR Labs experiment gone wrong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some other stuff you can choose from. As the one making this addition, I hope the muscle growth parth of this Interactive becomes filled out completely written.</span></div></span></div>",
            "created":1309582800,
            "id":1139161,
            "title":"Something else?"
        },
        "12":{
            "choices":[
                "A new type of Kryptonite!",
                "A genetically modified insect!",
                "A new superpower!",
                "An experiment gone mad!",
                "Something else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if the largest metropolis superhero, Superman, become really gigantic, maybe even bigger than a skyscraper?<br>\r\n<br>\r\nAnd above all, how such a thing happen?</span></div></span></div>",
            "created":1351832400,
            "id":1458327,
            "title":"Height Growth"
        },
        "121":{
            "author_id":"aeolian",
            "author_name":"Montparnasse",
            "choices":[
                "Clark flies into the atmosphere to meet the meteors head-on.",
                "The meteors hit the city before Clark can leave."
            ],
            "content":"<div class=\"\"><div> <span>Clark and Lois were at the Daily Planet when they got the news: a freak meteor shower was headed right for the city within hours, and the government needs to contact Superman to try and stop it before the city is destroyed.<br>\r\n<br>\r\nWhile Lois hurried to her desk, Clark slipped inside a stall in the men's bathroom to answer the call he knew was moments away.<br>\r\n<br>\r\n\"Miss Lane?\"<br>\r\n<br>\r\n\"Superman, no time for chit-chat today. A deadly meteor shower is headed this way and will hit the city within two hours. We desperately need your help to stop this.\"<br>\r\n<br>\r\n\"I'll come by the Daily Planet straight away and—\"<br>\r\n<br>\r\n\"No,\" Lois cut in. \"I'm sorry, but this needs your immediate attention.\" She paused to take a deep breath. \"We need you to fly up there and stop this now before it enters the atmosphere.\"<br>\r\n<br>\r\n\"Consider it done,\" Clark said before hanging up. Slipping out of the bathroom he saw Lois at her desk, her fingers pinching the bridge of her nose.<br>\r\n<br>\r\n\"Lois?\"<br>\r\n<br>\r\nShe startled, turning towards Clark hastily.<br>\r\n<br>\r\n\"Sorry, I didn't mean to scare you.\"<br>\r\n<br>\r\n\"No, it's fine, it's just that just then you sounded so much like... well, never mind. What is it, Kent?\"<br>\r\n<br>\r\n\"I have a lead about the shower with some scientists, I thought I'd let you know that I'm running down to follow through before the meteor shower hits.\"<br>\r\n<br>\r\nLois nodded before turning to look out the window and up at the sky.<br>\r\n<br>\r\nClark left without another word.</span></div></div>",
            "created":1420360920,
            "id":1912633,
            "title":"A new type of Kryptonite!"
        },
        "1211":{
            "author_id":"aeolian",
            "author_name":"Montparnasse",
            "choices":[
                "Clark crushes all the meteors by hand in space.",
                "Clark can't crush all the meteors in before they enter Earth's atmosphere."
            ],
            "content":"<div class=\"\"><div> <span>Between the time it took for him to get on the elevator alone and reaching the first floor, Clark had changed from his work attire to his Superman suit, loosing no time in rushing through the lobby and immediately flying high into the sky. He may have paused for just a moment outside Lois' office window, but that was pretty typical of Superman.<br>\r\n<br>\r\nBut this time, Lois looked concerned.<br>\r\n<br>\r\nClark continued his flight into the sky, thinking about the concern on Lois' face as she looked at him through the window of the Daily Planet. As the top reporter on Superman, Clark had seen Lois in scarier situations than this where she had never faltered, so he knew this had to be pretty big if it was shaking her nerve.<br>\r\n<br>\r\nAs he reached Earth's atmosphere, he used his telescopic vision to hone in on the meteors. They appeared to be some sort of shining green color, shining as if made out of polished emeralds despite their rough, rocky texture. They were fairly sizable, too; the smallest was about the size of a beach ball, give or take, and the largest looked like it was as wide as a football field, easily able to crush multiple buildings in one go.<br>\r\n<br>\r\nThis really <i>was</i> serious.<br>\r\n<br>\r\nContinuing to rush towards the meteors, Clark started to feel a tingle on his skin. As he quickly got closer he felt the sensation go deeper, becoming less like goosebumps and more like a dull ache in his muscles.<br>\r\n<br>\r\nIt wasn't until he smashed his fist into the first meteor seconds later that it dawned on him.<br>\r\n<br>\r\n<i>Kryptonite</i>.<br>\r\n<br>\r\nAs Clark blasted through the rock his fist suddenly cramped, a dull throb starting in his hand and slowly creeping up his arm. It quickly spread into his shoulders, from their branching out into his chest, his abs, his legs, his back and his other arm. Even his head wasn't spared the dull throbbing as he could feel the blood pumping in his ears.<br>\r\n<br>\r\nThat's when the painful throbbing changed into a strange sort of soreness, the kind that almost felt good. As if he had been working out and got a good pump. He felt all the muscles in his body tense as he suddenly felt his body expand, going taller by at least four inches. The sensation didn't last long, and the strangely good ache disappeared immediately. His suit, already designed tight, seemed to be doing its best at accommodating his new height.<br>\r\n<br>\r\nBreathing heavily after the experience, Clark looked down at himself in shock. He'd never had <i>that</i> sort of reaction to kryptonite before. This had to be some sort of new, rare type. So far, his body seemed to be exactly the same save for the added height.<br>\r\n<br>\r\nBut Clark was so preoccupied with his sudden growth that he didn't notice the larger meteor hurdling toward him until it smashed against his back, immediately cracking and falling away into harmless fragments.<br>\r\n<br>\r\nThis time Clark recognized the dull throb that immediately spread over his back and shoulder muscles simultaneously. It spread through his body more quickly than before, and his breathing grew quick as that pleasurable ache seeped into his muscles and his bones.<br>\r\n<br>\r\nHe gasped as this time he felt his back lengthen independently of the rest of him, his lats and chest growing proportionately to the added length. He felt his head follow suit, and suddenly he realized that he wasn't just growing taller but was growing <i>proportionally</i> taller. If this kept up, he'd be a giant.<br>\r\n<br>\r\nHis arms quickly lengthened, and Clark watched as his biceps stained the cloth of his suit, stretching it as far as it could go. His legs both lengthened and filled out, and Clark groaned as the front of his suit was suddenly stretched too tight over his groin. It wasn't an entirely unpleasant feeling, Clark couldn't help think, but he knew that the suit wouldn't stand too much more growing.<br>\r\n<br>\r\nAnother, smaller meteor rushed passed Clark as the growth stopped, and suddenly he realized that in order to save Earth and the areas that would be hit by the meteors he would have to destroy each meteor one by one.<br>\r\n<br>\r\nThis didn't bode well for Superman's suit.</span></div></div>",
            "created":1420364760,
            "id":1912647,
            "title":"Clark meets the meteors head-on in the atmosphere."
        },
        "12112":{
            "author_id":"aeolian",
            "author_name":"Montparnasse",
            "choices":[
                "Clark risks taking the consequences.",
                "Clark flies to Earth to tackle the problem there."
            ],
            "content":"<div class=\"\"><div> <span>Clark turned and saw the next meteor coming in his direction fast before turning back to the one that had rushed past him. He needed to destroy it but couldn't risk exposing himself to its touch again.<br>\r\n\u2028<br>\r\nThinking fast, Clark turned his heat vision towards the meteor headed towards Earth's atmosphere, hoping to destroy it with his vision's blast. As soon as the beam of heat struck the rock's side, though, a wave a green light blasted out of it in all directions. Before Clark could react it struck him with a force strong enough to knock him back and straight into the next oncoming meteor, shattering it immediately.<br>\r\n\u2028<br>\r\nEvery hair on Clark's body felt like it was standing on end as he felt a strong pulsing under his skin. He could actually feel his heart rate increase, and with each pump of his heart he felt his blood rush through his veins. Gasping, Clark felt all of his muscles ache again.<br>\r\n\u2028<br>\r\n\"No, no, no... I can't! Not... ugh... again...\"<br>\r\n<br>\r\n<br>\r\nClark watched in horror as he felt every muscle on his body flex and relax of their own will, growing and swelling with each pump. His muscles began growing as he felt another, more pleasurable ache in his muscles with each contraction as he began to grow taller.<br>\r\n<br>\r\nAs if one type of growth weren't enough, now he was experiencing <i>two</i>.<br>\r\n<br>\r\nClark grunted as he felt his body lengthen, his muscles continuing to swell all the while. He felt his shoulders and lats widen together, his chest swelling out even further, stretching the shield on his suit. His thighs and calves twitched as they tightened and expanded and grew along with his lengthening bones. Clark couldn't help the moan that slipped out as he felt his glutes clench before swelling outward, stretching out the back of his suit even more than before.<br>\r\n<br>\r\nMaybe only twenty seconds had passed before his muscles and his bones stopped growing. Panting, Clark looked down at himself in shock and awe. He couldn't deny it now, he was <i>massive</i>. His muscles had been large before, but at least he merely looked like a strong human. Now there was no way he could pass as a normal person due to his muscle alone. Add that on top of being around eight feet tall and Clark knew that there was no returning to civilian life.<br>\r\n<br>\r\nHe needed to stop these meteors and find an antidote, fast.<br>\r\n<br>\r\nClark looked back at the next wave of meteors and then down at himself. The more he grew the more he wished he had a chance to explore his new physique. There was no denying how much such a physique on a person with Clark's powers could help the Earth. Superman, enlarged and possibly even more powerful? Clark couldn't help but think of the possibilities. But even if he was stuck like this, he'd have to find a new suit soon. Even though it seemed to be stretching well,  his suit's sleeves were beginning to ride up his massive forearms, and the the suit now left even less to the imagination than before...<br>\r\n<br>\r\n\"Focus, Clark!\" he muttered to himself, shaking his head as if to clear it before looking away from his body and back to the oncoming meteors. Using his telescopic vision, he could see that they would be coming in waves, with time in between each one.<br>\r\n<br>\r\nHe needed a plan. There was no way he could continue deflecting him. Some would go past him. And then there was the side effect problem; if he physically destroyed them himself he grows taller, and if he blasts them with his heat vision they let out a wave that makes his muscles enlarge.<br>\r\n<br>\r\nClark <i>really</i> needed a plan.</span></div></div>",
            "created":1420781700,
            "id":1915419,
            "title":"Clark can't crush all the meteors in space."
        },
        "121121":{
            "author_id":"aeolian",
            "author_name":"Montparnasse",
            "choices":[
                "Something forces Clark back to Earth.",
                "Clark continues to try to destroy the meteors in space."
            ],
            "content":"<div class=\"\"><div> <span>Clark turned to look at Earth. What would happen if some of the meteors slipped passed him while he was struck helpless, unable to do anything while growing? What if he was somehow able to catch up to them in the Earth's atmosphere and destroy them? Would his own larger, denser mass send <i>him</i> hurtling to the Earth like a meteor, causing damage and death as he lands?<br>\r\n<br>\r\nClark saw no option but to risk taking on the side effects of the meteors.<br>\r\n<br>\r\nTurning back to the next wave, he speed towards them. As he flew faster than a speeding bullet he knew it would only be moments before he hit the first meteor. In the few seconds it took him to reach it he had decided to take a risk and annihilate as many meteors as fast as possible to ensure than none escaped past him.<br>\r\n<br>\r\nHe knew he'd regret it, but what chance did he have?<br>\r\n<br>\r\nClark's fist immediately pulverized the first meteor, and in seconds he was bearing down on the second while simultaneously kicking out at a third with his foot, both exploding apart into smithereens.<br>\r\n<br>\r\nIt didn't even take seconds before he felt the now familiar, pleasant ache, but this time it seemed more intense than it had before. Letting out a gasp of shock that quickly became a groan of pain, Clark bent over double, wrapping his arms around his torso as if he could force the growth from happening. He felt his muscles constrict over once-again lengthening bones in no time. He growth was faster this time, seemingly accelerated by destroying three asteroids at once. In two seconds alone he grew four inches. After ten seconds he was two feet taller than <i>that</i>. He grew at least another three and a half feet on top of <i>that</i> before it stopped.<br>\r\n<br>\r\nNow somewhere between thirteen and fourteen feet tall and more than a few hundred pounds of muscle, Clark really couldn't ignore his body anymore. A part of him realized that the more he grew, the more his natural instinct was to focus on his body. He had never felt so good as he did after the growths, and each one made him feel better than the one before. Feeling a bicep with his hand, he felt the muscle swell and move under the straining fabric of his suit. Flexing it, Clark watched as the sleeve gave up the ghost and ripped right across his bicep. His skin had been like steel before, but now it looked like it, too. Veins stood out under the stretched skin, and the muscle visibly shifted with each movement his arm made.<br>\r\n<br>\r\nHe moved his large hand to his chest, grabbing an enlarged pec in his hand and feeling the large muscle flex and jump under her hand. Sliding his hand down he felt each ridge of his abs and was shocked to find how deep they were. Looking down he could see past his hand to the front of his groin, suddenly realizing just how tight it was; apparently he was enjoying exploring his new size more than he had expected as he felt the front of his suit grow tighter and tighter with each second that passed. Clark could actually <i>see</i> just how much down there had grown with the rest of his body as he watched his cock slowly engorge and force itself down the already tight leg of his suit. It went more than halfway down his thigh now. Clark slowly ran a hand down to feel himself when a meteor shot past him, bringing him back to his senses.<br>\r\n<br>\r\nThis was getting bad.<br>\r\n<br>\r\nDragging his attention—and his wandering hands—away from his body, Clark rushed towards the meteor that had passed him before quickly realizing that it was past hope to catch it. There was only one option.<br>\r\n<br>\r\nHe was already nearly a fourteen foot muscle giant, what harm could a few more pounds of muscle do to him?<br>\r\n<br>\r\nWith that in mind, Clark turned his heat vision to the meteor, exploding it into small, harmless pieces that fell to Earth. This time he was ready for the wave that came towards him, pushing him back again.</span></div></div>",
            "created":1461573060,
            "id":2139087,
            "title":"Clark risks taking the consequences."
        },
        "13":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Superman is hit by a strange ray",
                "Superman eats a strange food",
                "Superman's metabolism fails",
                "The Fattening Kryptonite",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Superman is ripped, but not for long! Journey with him as the famous hero puts on the pounds</span></div></span></div>",
            "created":1277182800,
            "id":904358,
            "title":"Weight Gain"
        },
        "131":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "When he wakes up, he's chubby!",
                "He slowly grows fatter",
                "He's super hungry!"
            ],
            "content":"<div class=\"\"><div> <span>It was another average night for the Man of Steel. Superman was on his patrol, flying over the city of Metropolis to ensure the safety of it's citizens. So far It has been a quiet evening, he only caught one falling person, rescued people from a burning building and also cut the ribbon for the new hospital opening.<br>\r\n<br>\r\nSuddenly his Super hearing caught signs of shady activity down at the docks. Flying down there, he flew through the window and landed in the center of the dock's warehouse, where a bunch of men were loading crates of what appeared to be some kind of new weapon.<br>\r\n<br>\r\n\"Why don't you make it easier for yourselves and give up?\" Superman asked them. Right away the men grabbed their guns and fired at him, but Superman easily dodged their attacks, apprehending them in super speedy record time. However, as he was tying them up, one of the men who had stayed hidden suddenly shot him with one of the new weapons, an orange ray striking him. Superman grunted slightly as an electric feeling passed through his body, but he was otherwise unharmed. Within the blink of an eye, Superman grabbed the man and tied him up with the rest.<br>\r\n<br>\r\nAfter the police arrived and took the men in custody, Superman decided to fly home and call it a night. Little did he know that that blast from the ray gun earlier had done more to him than he realized.</span></div></div>",
            "created":1277442000,
            "id":906418,
            "title":"Not your average heist"
        },
        "1311":{
            "choices":[
                "He was hungry",
                "His gut got bigger",
                "His powers are fading"
            ],
            "content":"<div class=\"\"><div> <span>The next day, he woke up only to see that his gut has greatly increased and his body the size of fat superboy. \"Great gods of Kryton, what happened!\" Clark cried outz; he rushed to the bathroom and was shocked of what he saw. His fingers sank into the soft flesh that was now where his hard, chiseled abdominal muscles used to be, confirming that it was not an illusion but a reality. He rushed in front of his full length mirror, horrified with what he saw. Instead of the muscular hero he was, he looked an obese man who weighs 400 lbs.<br>\r\n<br>\r\n\"This is impossible!\" He exclaimed as he shook his stomach and watched it jiggle in his hands. \"My super metabolism should have prevented me from retaining any fat! Perhaps that ray gun has something to do with this, it would also explain my ravenous hunger! I must investigate this right away!\"<br>\r\n<br>\r\nHe quickly donned his super suit, but when he tried to put his belt on, he had trouble. Then, with his super speed, not noticing the fact that he was somewhat slower than usual, and then he took off out the window to find out what was happening. However.... <br>\r\n<br>\r\n</span></div></div>",
            "created":1298610000,
            "id":1060372,
            "title":"When he wakes up, he's chubby!"
        },
        "13113":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Someone stumbles upon him",
                "He tries to go on foot"
            ],
            "content":"<div class=\"\"><div> <span>Superman flew out into the sky above Metropolis, intent on finding that ray gun and find out how to reverse what was happening to him. However, as he flew, he suddenly found himself losing altitude. Frowning, he tried to fly higher, but slowly he continued to descend, as if his newly swollen gut was pulling him down towards the ground. In fact, as he flew, his gut was actually <i>growing bigger.</i> Putting in more effort, he tried to continue flying, but he found himself struggling, and for the first time in his life, sweating. Not only was he flying lower, but his speed was also slowing down, going from as fast as a plane to a car to the speed of a old lady with a walker. With each added pound of fat, he felt himself grow weaker, more exhausted and less super. He was breathing heavily to try and continue his flight, the wind taken out of him.<br>\r\n<br>\r\nFinally, Superman couldn't take it any more. Struggling, he managed to make it to a secluded alleyway to land. The moment his feet touched the ground, he collapsed and sat down, gasping for breath as if he had just run a marathon for a year straight. Looking down at himself, all he found was a sea of flab that was once the strongest muscular body in the world. His taunt abs was replaced by a huge doughy gut with love handles stretching the sides. His proud pectorals were now two fleshy moobs that stretched out his trademark S into a distorted mess. His thighs were thicker, now rubbing against each other. Every time he moved, his whole body would jiggle and wobble endlessly.<br>\r\n<br>\r\n\"This can't be happening...\" Superman gasped.</span></div></div>",
            "created":1314939600,
            "id":1179427,
            "title":"His powers are fading"
        },
        "131131":{
            "choices":[
                "Superman starts becoming even fatter",
                "Superman grows fatter every time he uses his powers"
            ],
            "content":"<div class=\"\"><div> <span>It was Dr.Vernom. Dr.Vernom, was about 28. He had huge muscles, and looked like a supermodel. Short, dark hair, blue eyes, and the face of Dean Cane.<br>\r\n<br>\r\n\"Superman? What happened\", he asked rubbing Superman's huge, round, gut. It hung way out of his spandex shirt, tan, &amp; smooth. His spandex pants ripped from his fat thighs. His pants slipped down, exposing half of his fat, round ass.<br>\r\n<br>\r\n\"I got hit by some ray gun last night. It made me gorge myself, &amp; I woke up like this! I lost my powers!\"<br>\r\n<br>\r\n\"I'll take you back to the lab. I have a machine, that can give your powers back.\" Dr.Vernom wrapped his arms around Superman, as much as he could. He dug into Superman's gut. making him belch.<br>\r\n<br>\r\n\"Great. it makes my belch too! BRAAAAAAAAAAP.<br>\r\n<br>\r\nAt the lab, Dr.Vernom made Superman strip. \"You have to be naked. Otherwise your clothes will start on fire. Superman's body, was huge! His gut hung just over his junk. It jigled as he entered the chamber. Dr.Vernom, started the machine. There was lightning, and Superman got his powers back</span></div></div>",
            "created":1317013200,
            "id":1195364,
            "title":"Someone stumbles upon him"
        },
        "131132":{
            "author_id":"mattebelly",
            "author_name":"mattbelly",
            "choices":[
                "Bruce Wayne is here",
                "Lex Luthor are in Wayne attic"
            ],
            "content":"<div class=\"\"><div> <span>Superman walked with difficulty but remembered that today his friend Bruce Wayne was in Metropolis for business and decides to head to the headquarters of Metropolis of Wayne corporation. The skyscraper is really huge and l ' penthouse of Bruce Superman must fly, an incredible effort but we can climb slowly into the air like a hot air balloon. Sweaty and breathless sanza Clark lands on the garden of ' attic and ... </span></div></div>",
            "created":1381726800,
            "id":1679348,
            "title":"He tries to go on foot"
        },
        "1311321":{
            "author_id":"mattebelly",
            "author_name":"mattbelly",
            "choices":[
                "Bruce host Clark for the night",
                "Both go to the Batcave"
            ],
            "content":"<div class=\"\"><div> <span>Just the huge amount of Clark comes in the moment Bruce Wayne gets up from his chair, he was reading the Daily Planet but immediately is ready for any eventuality, however, is speechless seeing in front of them the huge tonnage of steel man . \"Bruce, I need your help ... I was struck by a strange weapon range and ... this happened to me!\" Superman says grabbing her fingertips her soft belly and shaking it. The enormous abdomen Clark gasps and shake like a stormy sea, Batman is wordless, approaches his friend and tap the huge soft mass as to want to weigh that flab to realize that it was real.<br>\r\nSuperman is out of breath, trying to breathe slowly and rests his hands on the great love handles, Bruce turns around its huge friend still studying it in disbelief. Superman's body is nearly spherical, the fat has invaded not only his belly but also the legs, thighs, arms, face, neck and sit, virtually a riot to fat!<br>\r\nWhen Clark again unable to speak and Bruce has over the initial shock ...</span></div></div>",
            "created":1474047840,
            "id":2210885,
            "title":"Bruce Wayne is here!"
        },
        "1313":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "His abs were gone!",
                "He had a small gut!",
                "All the food had converted to fat!"
            ],
            "content":"<div class=\"\"><div> <span>After a day of hard work from saving people and stopping criminals, Superman returned to his humble apartment and donned his secret identity, Clark Kent. He didn't even finish buttoning his shirt when a growl escaped his tiny, ripped stomach. Thinking it would be best to satisfy his stomach before bed, Clark went to the fridge and proceeded to make a sandwich. As he was making it, however, his hunger grew stronger and stronger until he found himself using super speed to finish the sandwich, and even after he devoured it in three big bites, he found himself still starving!<br>\r\n<br>\r\nClark proceeded to clean out the fridge, his mouth chewing nonstop as he took bite after bite of food. He never known such intense hunger before! Finally, after what seemed like an eternity, the hunger pains stopped. Groaning, Clark reached up to rub his stomach, but instead of hard muscular abs, he found something....soft instead. Blinking, he looked down and found out...</span></div></div>",
            "created":1278738000,
            "id":915357,
            "title":"He's super hungry!"
        },
        "13132":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "He finds the ray guns",
                "He gets hungry again"
            ],
            "content":"<div class=\"\"><div> <span>A small, doughy looking gut was bulging out from his stomach! \"Great gods of Kryton, what happened!\" Clark cried out, dropping the chinese take out box and grabbing a hold of the stomach. His fingers sank into the soft flesh that was now where his hard, chiseled abdominal muscles used to be, confirming that it was not an illusion but a reality. He rushed in front of his full length mirror, horrified with what he saw. Instead of the muscular hero he was, he looked more like a jock gone to seed, his muscles still retaining their size and bulk, but now covered with a small layer of what seemed to be 20 pounds of fat which took away his vascular, defined look. Most noticeable was his stomach, which now hung out from him quite a bit.<br>\r\n<br>\r\n\"This is impossible!\" He exclaimed as he shook his stomach and watched it jiggle in his hands. \"My super metabolism should have prevented me from retaining any fat! Perhaps that ray gun has something to do with this, it would also explain my ravenous hunger! I must investigate this right away!\"<br>\r\n<br>\r\nHe quickly donned his super suit once more with his super speed, not noticing the fact that he was somewhat slower than usual, and then he took off out the window to find out what was happening. First thing he should do was get one of those ray guns and bring it to Starr labs. </span></div></div>",
            "created":1285477200,
            "id":963782,
            "title":"He had a small gut!"
        },
        "135":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "A new villain fattens everyone",
                "He gets hit by a spell",
                "More options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Have no fear, more options are here!</span></div></span></div>",
            "created":1343451600,
            "id":1391923,
            "title":"Other"
        },
        "14":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "water",
                "air",
                "helium",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of inflation will he go though ?</span></div></span></div>",
            "created":1285477200,
            "id":963733,
            "title":"Inflation"
        },
        "144":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Blueberry.",
                "More Options."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1309496400,
            "id":1138696,
            "title":"other"
        },
        "15":{
            "author_id":"reedington",
            "author_name":"Big Boy",
            "choices":[
                "Body Part Expansion",
                "MPreg",
                "Penis Growth",
                "Free Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more options for you to choose from</span></div></span></div>",
            "created":1277096400,
            "id":903920,
            "title":"Other"
        },
        "152":{
            "author_id":"mattebelly",
            "author_name":"mattbelly",
            "choices":[
                "A gay relationship with Batman",
                "Lois relationship",
                "Lex Luthor evil plan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Superman become pregnant by...</span></div></span></div>",
            "created":1381640400,
            "id":1678581,
            "title":"MPreg but..."
        },
        "1521":{
            "author_id":"mattbrad",
            "author_name":"mattbrad",
            "choices":[
                "\"Yes, let's do it\"",
                "\"No, I'm not ready for it\"",
                "\"Not sure, I have some more questions\""
            ],
            "content":"<div class=\"\"><div> <span>Clark Kent looked into Bruce Wayne's eyes as they held each other in bed. The past two months had been bliss, not least in the bedroom, where Bruce's 10 inch penis had more than satisfied Clark's desire in a way that Lois never could.<br>\r\n<br>\r\nBruce looked back and was about to say something, but hesitated.<br>\r\n<br>\r\n\"What is it?\" Clark said softly.<br>\r\n<br>\r\n\"Everything is so perfect right now, except we are missing one thing\" replied Bruce.<br>\r\n<br>\r\n\"What?\" said Clark, excited.<br>\r\n<br>\r\n\"A baby\" Bruce said.<br>\r\n<br>\r\nClark paused for a moment, surprised but not shocked by the revelation. He had noticed Bruce always took an interest in children, but he assumed it was just due to Bruce being an orphan. <br>\r\n<br>\r\n\"Well...\" Clark hesitated, \"we are a little early into our relationship to look at adopting, and surrogacy has too many risks\".<br>\r\n<br>\r\n\"Agreed\" said Bruce, \"which is why I was hoping you would permit me to conduct an experiment on you I've been working on\"<br>\r\n<br>\r\nNow Clark was shocked. \"An experiment?\"<br>\r\n<br>\r\n\"Don't worry, the trial runs on the rats and rabbits have gone well. Better than well actually\". <br>\r\n<br>\r\nClark wanted to rebel, scream that he was not some laboratory animal, but a human, and more than that, Bruce's lover. Yet instead all he felt was intrigue. \"How would it work?\" he asked.<br>\r\n<br>\r\n\"I have been given male rats a tablet that constructs an artificial uterus. It takes a few days to build at least but is every bit as secure as a natural one. Then I take an egg containing half the chromosomes of one rat and the sperm from another and inseminate the rat with both of these. Ours will work on a similar basis, I will place your DNA in the egg, and add my sperm. That is if you agree to it.\"<br>\r\n<br>\r\nClark thought for a minute - he had so many questions, but he wanted to say yes.<br>\r\n</span></div></div>",
            "created":1427732220,
            "id":1956299,
            "title":"A gay relationship with Batman"
        },
        "15213":{
            "author_id":"mattbrad",
            "author_name":"mattbrad",
            "choices":[
                "Yes, I will do it",
                "No, I won't do it"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, I'm interested\" said Clark, \"but I have some more questions\".<br>\r\n<br>\r\n\"Of course,\" said Bruce, \"this is a big decision\".<br>\r\n<br>\r\n\"First of all, what happens to my powers?\" asked Clark<br>\r\n<br>\r\n\"I cannot answer with any certainty. My plan was not too fall in love with you but with a 'normal' man. Your powers are a complicating factor - they could be strengthened, weakened or not affected at all\" answered Bruce.<br>\r\n<br>\r\n\"What about side effects? Besides getting a big belly of course.\" Clark said with a smile.<br>\r\n<br>\r\nBruce smiled back. \"Well that seems to vary from subject to subject. Those carrying boys seem to differ from girls. The latter tend to be more docile and become softer featured. Don't worry, that is the extent of the feminization as far as we can tell. Those carrying boys become more aggressive, sexually and otherwise. They also put on more weight, partially from extra muscle mass which seems to develop, and we have also noticed growth in genitalia\".<br>\r\n<br>\r\n\"Wow!\" laughed Clark, \"I better not have a boy, I'm already horny all the time and packing heat down there!\"<br>\r\n<br>\r\n\"Anymore questions?\" asked Bruce.<br>\r\n<br>\r\n\"No\" said Clark, \"but let me sleep on it before I make my decision\".<br>\r\n<br>\r\n\"Sure thing\" said Bruce. He smiled again, kissed Clark on the lips and went to sleep.<br>\r\n<br>\r\nBy the next morning, Clark had made his decision.</span></div></div>",
            "created":1427802600,
            "id":1956735,
            "title":"\"Not sure, I have some more questions\""
        },
        "152132":{
            "author_id":"kneelover69",
            "author_name":"KneeBoiDaddy",
            "content":"<div class=\"\"><div> <span>\"No, I don't want to be pregnant. I think the problem is that you think it's hot or something. It's really not. The idea of male pregnancy is disgusting,\" said Clark. <br>\r\n<br>\r\nThey broke up the same day.<br>\r\n<br>\r\nThe end</span></div></div>",
            "created":1514847780,
            "id":2435464,
            "title":"No, I won't do it"
        },
        "154":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "still superman BUT an ultimate nerd/ geek",
                "still superman but  has a mouse transformation",
                "trapped in a TV show."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More problem on his path. He still may have his powers BUT</span></div></span></div>",
            "created":1352437200,
            "id":1464379,
            "title":"More choices."
        },
        "1542":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Scare Batgirl as a prank",
                "enter a yard full of cats. Mice Rules! ",
                "Travel to the country of  _______"
            ],
            "content":"<div class=\"\"><div> <span>Superman noticed that the world looked much smaller now and wondered aloud 'What is happening to me. I look much smaller.' At that moment, he noticed a tail on him. He hurried to a mirror to see what he looked like. Superman noticed that he was now a mouse. He still had his Superman outfit and cape on him. It was adjusted to his size of a mouse. And there was a very small trace of black hair on the top of his head.<br>\r\n<br>\r\nThen Superman tried to fly as he normally did. He noticed that he still could fly. In fact, he still had of his superpowers.<br>\r\n<br>\r\nFor some reasons, Superman liked it. ' Is this some kind of punishment? Ha ha ha. '  Feeling a bit mischievous, he wondered what to do first.</span></div></div>",
            "created":1352523600,
            "id":1464955,
            "title":"still superman but  has a mouse transformation"
        }
    },
    "info":{
        "author_id":"reedington",
        "author_name":"Big Boy",
        "brief_description":"Superman is the ultimate superhero. However, he is about to face some BIG trouble!",
        "created":1277164980,
        "description":"<td align=\"left\" class=\"norm\">One of the things Superman is known for is his large figure and physique, his strength and powers and his ability to overcome any obstacle. However, things are about the change in BIG way for him. He (and possibly his fellow heroes) is about to undergo a series of transformations that may put him to the ultimate test.<br>\r\n<br>\r\nRules are that story has to revolve around Superman. You can do just about anything to Superman revolving around growth. Muscle growth, giant, fattening, feet expansion, it's all game!<br>\r\n<br>\r\nTry and keep the threads going with some good choices, and don't be afraid to add stuff.</td>",
        "id":1684092,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556224740,
        "modified":1556224740,
        "pretty_title":"Superman's BIG Problem"
    }
}