{
    "chapters":{
        "1":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Towards all the TV/movie actresses",
                "Towards all the singers",
                "Towards all the athletes",
                "Stay still and wait to hitch a ride with someone"
            ],
            "content":"<div class=\"\"><div> <span>You're name is Chris and you've been a limousine driver for several years now in Hollywood. You get to meet the most interesting celebrities and they're not bashful with their tips either. It's not a bad living, considering you're in the center of all the action nearly every day of your life. Tonight you were hired to be a chauffeur for the biggest Hollywood party of the year. From what you've heard, pretty much every big name's gonna be there, including a few of the athletic celebrities. You are assigned to pick up Britney Spears, but you're not nervous because you've done it before and you know her pretty well by now. You pick her up and head off to the party. When you get there she ivites you to come in for a little bit until your next job. Due to company policy, you have to call the boss first but he gives the green light. So in you go. You recognize hundreds of faces at once, but you're not particularly interested in the male celebs right now. In the center of the room is a beautiful, massive fountain. You walk over to look at it and see a few pennies at the bottom. \"Huh,\" you think to yourself, \"people must have tried wishing in this thing.\" You figure what the hell, grab a penny in your pocket, make your wish and throw it in. The second the penny hits the surface of the water, the world just freezes right in front of your eyes as you spin endlessly. Then everything goes black.<br>\r\n-------------------------<br>\r\n<br>\r\nYou wake up slightly dizzy to the sound of running water. You look around you and at the lush, red surface you're sitting on. You recognize the design on the floor, and hesistantly turn around afraid of what you may find. There's the fountain, only a couple hundred times bigger than it was a few seconds ago! Holy crap, your wish to be one inch tall at this party has come true! You figure you'll just have to find someone to throw a penny in for you, but while you're this small you might as well enjoy it, then ask for help. Where do you head first:</span></div></div>",
            "created":1072242000,
            "id":388766,
            "title":"Lucky You"
        },
        "11":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Jennifer Love Hewitt",
                "Jessica Alba",
                "Jennifer Aniston",
                "Keira Knightley",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now that you're at the table with all the actresses, which one?</span></div></span></div>",
            "created":1072501200,
            "id":318183,
            "title":"Decisions, decisions"
        },
        "111":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Had gotten sucked inside of her butthole...",
                "Was slowly running out of air..."
            ],
            "content":"<div class=\"\"><div> <span>As you head under the table, you're keeping both an eye and an ear out for someone familiar. On the far side of the table you hear a voice that is vaguely familiar, you know you've heard it before. You head in that direction and stand at the base of the celebrity, right in front of her sandal-clad feet. There's a mixture between perfume and a hint of a stale vinegary smell, but you ignore it. Looking up, you can make out the face of Jennifer Love Hewitt. \"This is pretty sweet,\" you think to yourself. If you can scale her pants and get to her lap, maybe she'll notice you. It'll be tough to climb at your size, and even tougher to get noticed, but it's the only shot you have. Drawing in a heavy sigh, you jump on the bottom of her pants and begin your climb.<br>\r\n<br>\r\n-----Later-----<br>\r\n<br>\r\nHuffing and puffing, you come to rest at the crotch area. Jen's sitting down with her legs crossed, and you hope it stays that way, otherwise there will be more climbing involved. \"Now how to get her attention,\" you wonder. You try just jumping up and down, but you're not having much luck. She's engrossed in a pretty interesting conversation. Your only option is to get closer. You begin climbing her shirt, and eventually you make it to the base of her breasts. Suddenly she laughs out loud, her chest shakes, and fall back down in to her lap. \"Jeez, this is no good,\" you say out loud to nobody in particular. You could try climbing the front again, but everytime she laughs you're just going to fall. On the other hand, her back's a lot flatter, and will be less affected by the laughter and easier to scale. Besides, once you get to her shoulders, her ears are only a few inches (or a few body lengths for you) away. Grinning at your cunning idea, you start to circle towards her back.<br>\r\n<br>\r\nEventually you make it to the base of the back of her shirt, and you begin your climb anew. Suddenly you see her arms come behind her back, then cross behind her head. The whole lower side of her back begins to cave inward. \"She's stretching!\" you realize. As the shirt moves with you on it, you begin to lose your grip. The silky surface isn't much to hold on to. Looking down, you see the back of her pants protrude out slightly, giving you a glimpse at what appears to be a thong. Suddenly she straightens out, and that was all the movement you needed to lose your grip. As you fall, you hit the base of her back and tumble in to the little hole you were looking down earlier. <br>\r\n<br>\r\nYour tumble comes to a halt in her pants, right at the top of her butt crack. You look up to see light coming in the hole you fell in, and then you look in front of you to see the top of the thong. A setback, but it could have been worse. Just as you begin your climb again, apparently Jennifer felt the thong uncomfortable for a moment. She lifts her butt off the chair slightly, and as discreetly as possible she slips her hand down the back of her pants and yanks the string out of her butt crack. You fall further down her ass crack as a result, and not wanting to squished when she sat back down, you grabbed on to the thong string. Not one of your better ideas. The instant she lets go of the underwear, you and the string are projectiled deep in to her buttcrack. Screaming, you come to a halt right in front of something ridged, constantly dialating, and slightly stale smelling. \"Oh holy hell, I'm right up against her asshole,\" you think to yourself. There is immense pressure all around as she plants her butt back in to the seat, and the cheeks expand inward to envelope you in warm skin. You realize now that your only hope is to struggle fiercely. Perhaps you're in a sensitive enough area that she'll feel you and head to the bathroom, though you're not sure what'll happen to you if she walks. You begin to wiggle, kick, punch, bite, claw, and do anything else you can think of hoping to get her attention.<br>\r\n<br>\r\nJen's lips twisted as her face distorted in to a look of confusion. Right after she adjusted her thong, her butthole begin tickling ever so slightly. Assuming it was the string brushing up against it, she shifted in place trying to satisfy the itch. She clenched her cheeks together once, and the itch subsided. Her face relaxes, and she resumes conversation, not knowing that the little man deep inside her crack...</span></div></div>",
            "created":1132376400,
            "id":284698,
            "title":"Not exactly where you want to be..."
        },
        "114":{
            "choices":[
                "Escape the bathroom and find a more... friendly actress",
                "Continue! This is fun!"
            ],
            "content":"<div class=\"\"><div> <span>Straight away, you grab onto Keira Knightly's trousers. Pretty much instantly, she heads down into the toilet. You can't believe your luck! She drops her trousers and straight away does a HUGE fart and you hear her shit dropping. Then, she notices you. Suddenly she picks you up and lifts you to her eye level.<br>\r\n\"Wow! This'll be fun! I've always had a fantasy about tiny men!\"<br>\r\nThen she shoves you up her arse. It is still filled with her crap and you cant breathe. You close your eyes and mouth but still accidently swallow some. Then she stops to think... Well, after pissing on you and crushing you under her tits.</span></div></div>",
            "created":1281589200,
            "id":934716,
            "title":"Keira Knightley"
        },
        "115":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "More choices...",
                "Natalie Portman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list goes on</span></div></span></div>",
            "created":1072501200,
            "id":284690,
            "title":"more choices"
        },
        "1151":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Yulia Volkova (tatu)",
                "Brody Dalle (singer from Distillers)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about these?</span></div></span></div>",
            "created":1147496400,
            "id":318488,
            "title":"sexy"
        },
        "11512":{
            "choices":[
                "Continue with the story",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or someone else?</span></div></span></div>",
            "created":1182056400,
            "id":417585,
            "title":"Wait a second"
        },
        "115122":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Halle Berry?</span></div></span></div>",
            "created":1182056400,
            "id":417586,
            "title":"Halle Berry"
        },
        "1151221":{
            "choices":[
                "Bathroom",
                "Gym"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you find the sexy actress?</span></div></span></div>",
            "created":1272085200,
            "id":872678,
            "title":"Delicious Halle Berry"
        },
        "1151222":{
            "author_id":"skeletorio",
            "author_name":"expandor",
            "choices":[
                "Scarlett Johansson?",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Scarlett Johansson?</span></div></span></div>",
            "created":1258434000,
            "id":793095,
            "title":"Scarlett Johansson"
        },
        "11512222":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Amanda Bynes?</span></div></span></div>",
            "created":1263790800,
            "id":822321,
            "title":"More?"
        },
        "115122221":{
            "author_id":"iambeowulf",
            "author_name":"iambeowulf",
            "choices":[
                "Climb Amanda's Leg",
                "Try and get her attention"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look up to see a bikini Amanda Bynes towering over you. What do you plan on doing next?</span></div></span></div>",
            "created":1263790800,
            "id":822402,
            "title":"Big Amanda!"
        },
        "115122222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>miranda cosgrove?</span></div></span></div>",
            "created":1386530280,
            "id":1704962,
            "title":"no"
        },
        "1151222222":{
            "author_id":"curttehmurt",
            "author_name":"Banjoenelbano",
            "choices":[
                "hell yeah fat funny Aussie farts ",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the big beautiful comedienne Rebel Wilson?</span></div></span></div>",
            "created":1401759960,
            "id":1806370,
            "title":"no"
        },
        "1152":{
            "choices":[
                "You hang onto Natalie's shoe for the ride",
                "You let go of Natalie's shoe and take your chances"
            ],
            "content":"<div class=\"\"><div> <span>You have always been enticed by Natalie Portman, and now she is sitting right in front of you, larger than life!  MUCH larger!  You swallow hard as your legs seem to propel yourself of their own accord towards the towering beauty.  As you near her massive foot, you can smell her womanly scent and you idly wonder what kind of perfume she is wearing tonight.<br>\r\n<br>\r\nWithout any real foresight, you climb onto her shoe.  You are considering your next move when suddenly the giant beauty stands up and begins walking to the bathroom!  Your grip falters and you almost fall to the floor, but catch her heelstrap just in time.  You have to decide what to do next, and quick!</span></div></div>",
            "created":1072760400,
            "id":183480,
            "title":"One foot at a time"
        },
        "11521":{
            "choices":[
                "Natalie sees you!",
                "You dash back under her legs just in time to avoid detection!"
            ],
            "content":"<div class=\"\"><div> <span>You decide it's best to hang on, as you may get trampled otherwise.  Natalie enters the bathroom and steps into a large airy stall, laden in marble with rose planters and what appears to be a solid gold toilet paper holder.  'Geez, they even go to the can is style!' you think to yourself.<br>\r\n<br>\r\nNatalie hikes up her skirt and wiggles her panties down her smooth legs.  From your vantage, you only have a second to gawk before the huge thong underwear settle over you, blocking your glimpse of heaven.  Oh well.  The fragrance coming from her panties are just as exciting to you.  She then seats herself on the toilet and you hear her pee, which is followed promptly by a short but loud fart!  Natalie stifles a giggle as you crouch beneath her underwear in disbelief.  You witnessed Natalie Portman farting!  The prospect hits you so suddenly, you bust out laughing, despite your current situation, and fall off her shoe, rolling onto the cool tile in front of her feet.<br>\r\n<br>\r\nYour laughter comes to an abrupt halt as you helplessly gaze up at her.  Her big brown eyes sweep across the floor and.....</span></div></div>",
            "created":1072760400,
            "id":183481,
            "title":"Fire in the hole!"
        },
        "115211":{
            "choices":[
                "Natalie drops you into her mouth and decides to swallow you alive.",
                "Natalie bends over and sends you anal spelunking."
            ],
            "content":"<div class=\"\"><div> <span>At first, Natalie's expression was one of pure confusion, and even anxiety.  She isn't sure of what she is seeing.  You freeze despite your instincts telling you to BOLT, MAN!  Just as you are about to make good on this wise and tardy instinct, Natalie quickly reaches forward and snatches your tiny form up between her thumb and index finger.<br>\r\n<br>\r\n\"WHAT THE HELL??\" she wonders aloud.<br>\r\n<br>\r\nYou are lost for words as you stare back into those huge eyes.<br>\r\n<br>\r\n\"AREN'T YOU.....CHRIS?  CHRIS, RIGHT?  BRITNEY'S DRIVER TONIGHT.  YOU DROVE ME TO THE HILTON LAST WEEK.  I REMEMBER YOU....I THOUGHT YOU WERE KINDA CUTE.\"<br>\r\n<br>\r\nYou are about to fail to explain the unexplainable when she cuts you off.<br>\r\n<br>\r\n\"SO WHY ARE YOU....TINY???  HOW DID YOU SHRINK?\"<br>\r\n<br>\r\nShe lifts you near her ear and you explain briefly what happened.  As you are doing this, you can feel her hot breath wash over you.  This turns you on quite a bit, and you are sure that you can detect the sweet odor of wine on her breath.  As she pulls you back to examine you more closely, you observe that Natalie is, in fact, a little drunk.  Her beautiful face is slightly flushed.<br>\r\n<br>\r\n\"SO YOU WISHED TO SHRINK DOWN TO ONE INCH AT A PARTY FULL OF BEAUTIFUL WOMEN.  SOUNDS LIKE YOU'RE AIMING FOR A GOOD TIME.\" Natalie quips.<br>\r\n\"AND IF YOU'VE BEEN IN THE BATHROOM THE WHOLE TIME...OMIGOD, YOU HEARD ME FART, DIDN'T YOU??\"<br>\r\n<br>\r\nYou begin to concoct a story about an unfortunate ear-drum disabling childhood incident involving an M-80 and your cat, but all that comes out of your mouth is: \"Uh.....\"<br>\r\n<br>\r\n\"YOU DID HEAR ME FART!  THIS CAN'T GET OUT!\" Natalie says, with a half smile on her face.<br>\r\n<br>\r\n\"Belive me lady, I won't say SHIT!!\" you yell at her, but she either doesn't hear you or is ignoring you.<br>\r\n<br>\r\n\"I THINK I NEED TO PUT YOU SOMEWHERE SAFE FOR THE TIME BEING.  I'M NOT EVEN SURE IF I SHOULD LET YOU LIVE!\" Natalie says.<br>\r\n<br>\r\nUpon hearing this, you cringe in fear.<br>\r\n<br>\r\n\"I COULD DISPOSE OF YOU PERMANENTLY AND SWALLOW YOU ALIVE.  I AM A LITTLE HUNGRY AND MY GIRLFRIENDS DO CALL ME A MAN-EATER!\" Natalie licks her gogegeous lips for effect.<br>\r\n<br>\r\n\"OR I COULD JUST STORE YOU FOR A BIT....INSIDE OF ME, AND YOU'LL NEVER GUESS EXACTLY WHERE!\" she says.<br>\r\n<br>\r\nSaying that, she lowers you to her crotch.  You can't help but gasp as you gaze at Natalie's smooth neatly trimmed pussy.  She gently rubs you aginst her vaginal lips and you are fully turned on now, depite your fear.  <br>\r\n<br>\r\n\"YEAH, I COULD STICK YOU IN MY PUSSY FOR THE TIME BEING....BUT YOU'RE ONLY A LIMO DRIVER.  YOU HAVEN'T EARNED MY PUSSY!  I HAVE ANOTHER HOLE IN MIND FOR YOU.  TAKE IT OR LEAVE IT!\" Natalie says.<br>\r\n<br>\r\nYou are quickly whisked behind her as she bends over.  You stare at her smooth perfectly shaped butt as the cheeks separate slightly, revealing her dark asscrack.  With the other hand, the grabs one of her cheeks and pulls in open, exposing her hairless puckered anus.<br>\r\n<br>\r\n\"ISN'T THIS WHAT MADE THAT LITTLE RACKET A FEW MINUTES AGO?  WELL I JUST MIGHT SHOVE YOUR LITTLE BODY RIGHT UP MY ASS.  DON'T WORRY, DESPITE THE DISTURBANCE, MY ASSHOLE IS QUITE CLEAN.  YOU MIGHT EVEN ENJOY YOURSELF!\" laughs Natalie, \"HERE, I'LL EVEN GET IT READY FOR YOU!\"<br>\r\n<br>\r\nNatalie quickly spits on her fingers and reaches behind her again, this time working her middle finger into her butthole.  You stare with a mixture of lust and horror as her finger sinks slowly into her waiting asshole.  Natalie moans softly, and after working her saliva covered digit in and out of her anus, she slowly withdraws it.<br>\r\n<br>\r\n\"SEE CHRIS, PERFECTLY CLEAN!\" says Natalie, showing her unblemished middle finger to you in a full-on bird.<br>\r\n<br>\r\nYou're still searching for the humor in this one  as she brings you back to her face.<br>\r\n<br>\r\n\"I JUST CAN'T DECIDE!  SHOULD I SWALLOW YOU AND BE RID OF YOU FOREVER, OR SHOULD I SHOVE UP MY ASS AND DEAL WITH YOU MORE LATER??\"<br>\r\n<br>\r\nWhat's it gonna be??</span></div></div>",
            "created":1072760400,
            "id":183483,
            "title":"Which Fate?"
        },
        "1152111":{
            "author_id":"shrapnel333",
            "author_name":"Shrapnel333",
            "choices":[
                "Whatever shrunk you made you impervious to digestion...",
                "You get digested..."
            ],
            "content":"<div class=\"\"><div> <span>\"Well, as fun as having you up my ass would be, I'm feeling a little hungry. And besides, when am I going to get a meal as exotic as this again?\" <br>\r\nYour heart sinks as she lifts you up to her mouth. She opens a gaping maw and you see strands of saliva dripping of her teeth. Natalie sticks out her tongue and slides it up and down your nude body. The feel of her velvety tongue arouses you, and your dick hardens. <br>\r\n\"Looks like you enjoyed that Chris,\" she says. Her tongue twirls around your cock for a moment, then continues to soak you in spit. <br>\r\nAfter you are completely covered, she plops you into her mouth. She rolls you around on her tongue, mashing you into the roof of her mouth from time to time. You get forced back towards her cavernous throat and your adrenaline pumps before you get pushed back away again. She moans softly, though you don't know if its at your taste or your struggles.<br>\r\nFinally she tilts her head back. Her throat opens up and her tongue pushes you all the way back. With a great big gulping noise, you enter her throat. The long, hot passage welcomes your tiny body as you are pushed down towards her stomach. After a few seconds of the muscles squeezing you downwards, a ring of muscle opens and you fall into her belly. <br>\r\nThe air is hot and humid, filled with the stench of her last meal digesting. Bits of half digested food still remains in pools of acid among the folds of her stomach, though it is mostly empty. More acids are beginning to seep in around you and you worry at their approach.<br>\r\nSatisfied that you will be talking to no one about your experience in the bathroom, Natalie Portman returns to the party with a smile on her face.</span></div></div>",
            "created":1194325200,
            "id":461346,
            "title":"Eaten by Padme"
        },
        "1152112":{
            "choices":[
                "Natalie returns to the party.",
                "Natalie pushes you out after a few minutes and traps you between her tits."
            ],
            "content":"<div class=\"\"><div> <span>  Considering your options, you hope Natalie sticks you up her ass. You don't really like the idea, seeing as how suffication could claim your life, but if she swallows you, your life is over for sure.<br>\r\n<br>\r\n   \"Well, I wouldn't mind a snack!\" exclaims Natalie.<br>\r\n<br>\r\n   Your heart sinks as Natalie hoists you up, leaning her head back. Her once beautiful mouth opens frighteningly wide. You stare into her giant pink maw, past her gleaming white molars, and into her pink slick throat, pulsing and shiny with saliva.<br>\r\n<br>\r\n  Slowly, you are lowered down into her cavernous mouth. Natalie's hot humid breath engulfs your body. Then, still holding you, she closes her mouth around you. You feel her huge wet tongue sliding around your body, drenching you. A shudder of fear passes over you as you wait for Natalie to let go of you, sending you towards the dark pit at the back of her mouth to your doom. You are surprised when she opens her mouth and pulls you out again. Soaked with saliva, you are confused and disoriented, not knowing whether to be relieved or even more scared.<br>\r\n<br>\r\n  \"Bet ya thought I was gonna eat you!\" Natalie giggles. \"But I don't want to kill you already! Even though I wouldn't mind swallowing you alive.... But for now, I'm gonna let you tour my ass!\"<br>\r\n<br>\r\n  Natalie reaches back and grabs her left ass cheek, pulling it back and she bends over slightly, revealing her anus. You find yourself being stuffed into her hole, feet first. Natalie's asshole easily swallows your feet, then your legs. The giant sphincter slides up your body up to just underneath your arms. You make a vain last ditch effort to save yourself by trying to push back around the edges of her anus, but her single finger pushing you inside her body effortlessly overpowered your futile attempt. Natalie stops pushing when your head is just inside her anal tunnel, with your arms sticking straight up above your head. The soft slick flesh surrounding your body strongly contracts suddenly, and her sphincter squeezes shut as her rectum widens and pulls your body inside her intestine. Natalie's rectum is pitch black, the humid hot atmosphere closing in around you. Thankfully it is empty and relatively clean, but the air is limited. </span></div></div>",
            "created":1077598800,
            "id":189830,
            "title":"End zone"
        },
        "115212":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "You get ridden all the way up her butt",
                "You manage to find a way to get out of this"
            ],
            "content":"<div class=\"\"><div> <span>You dash away to avoid her finding you, that would ruin all the fun you were looking to have at your new size. You realize that you're never going to have an opportunity like this again, and this is the whole reason why you chose to stay at this size to begin with rather than look for help immediately. You're not about to ruin your chances, so you climb on top of the soft, silk thong underwear that you were inhaling moments before. Good, at least now you can see up the goddess-like legs all the way to her face. You can't wait for her to finish her business so that she stands up and you get an even better view. You see her start to rise off the toilet bowl and hold your breath...this is it!<br>\r\n---------<br>\r\nNatalie grabbed a piece of toilet paper to wipe herself off and finish her business. She stood up and discarded the soiled cloth in the toilet bowl, and reached down for her silk thong. She began to pull it up eager to get back out to the party.<br>\r\n---------<br>\r\nYou were admiring the lovely view up until she reached down and put a hand on either side of the thong you were standing in. Crap! You realized you need to get off this thing and now, or else end up imprisoned in a giant ass. You go to jump off it, but your foot is caught in one of the threads. You desperately tug and tug at your leg, trying to free your foot. Eventually you rip right through the thread, but it's too late...<br>\r\n---------<br>\r\nNatalie finishes pulling up her thong all the way. She felt something wedged inbetween her butt cheeks, but carelessly dismissed it. She had never really gotten used to wearing thongs, and she just assumed it was that typical wedge feeling she always gets. She shifted her butt cheeks in place to adjust the thong. and then pulled up her skirt. She let one more fart fly before heading back out to the party where she wouldn't have such freedom. She slipped on her shoes and headed out the door.<br>\r\n---------<br>\r\nYou looked up and saw the massive jiggling butt cheeks waiting to suck you inbetween them. Her crack was enormous from this angle, and you couldn't believe it as the soft, smooth flesh hit you all at once. You were easily manipulated with the thong string in to her ass. You realized you had a chance to get out, until she readjusted the thong sending you right up to her butthole. Here you could smell the odor very easily as the hole in front of you puckered open and close and the soft, fatty walls around jiggled. You were starting to get really aroused despite your position, until her butthole bulged outward then opened with a release of her toxic gas. You here her laugh and she has no idea you're down here, smelling whatever her bowels have to offer. As she walks you get ridden closer to the hole, and you start to flip out. What the hell's gonna happen?</span></div></div>",
            "created":1072760400,
            "id":183482,
            "title":"You and Natalie star in \"Butt Wars\""
        },
        "1152121":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Continuing on in Natalie's butt"
            ],
            "content":"<div class=\"\"><div> <span>As the rippling, fatty walls of your prison continue their repeated up and down pattern, you are overcome by a new fear that has presented itself. With every shift of one of her ass cheeks you are corkscrewed closer and closer to her gigantic (to you at least) butthole. The gaping hole puckers outward for a second, the opens wide and blasts you with a moist, hot, steamy gas that causes your prison to create a thunderous roar and vibrate. After coughing due to the over-inhalation of her foul gas, you struggle fiercely because you are running out of options. If she doesn't feel you very soon, you very well might find yourself deep in a celebrity's bowels!<br>\r\n---------------------<br>\r\nAs Natalie slipped on her dress and started walking out of the stall, she paused for just one more second to let out another fart. She wouldn't have such liberty at the party and she knew it, so she might as well get out her gas now or suffer during the party. She stifles a giggle at the loud noise that her gas makes as she thinks to herself, \"Wow, I have such terrible gas tonight. Whew!! And it reeks too!\" Immediately after farting she felt a tickle against her butthole, but figured it was just the after effects of her massive fart. Natalie drew in a heavy sigh, and walked out the door.<br>\r\n----------------------<br>\r\nGreat, she didn't feel you. All that insane flailing and she didn't even think twice. You are too close to her butthole for comfort, so in an effort to get further away you put her hands and feet on it and try to push off of it and away. As you're pushing though, one of your feet slips on butt sweat and slides easily in to the butthole. \"Jeez, I'm gonna have to be more careful,\" you think. You go to pull your foot out, but nothing happens. You grab with both hands and yank, but Natalie's butthole has felt the pleasureable sensation of your foot in it and has gripped down. Completely forgetting the sweat, you put your feet and your hands on the butthole again, this time trying to get your foot out. Again it results in negative progress, and your other foot slips and goes deep in. Pushing up with your arms you find it near impossible to escape the grip of the hole, so you start pounding again. You're running out of time!<br>\r\n---------------------<br>\r\nAs Natalie was heading back out to the party she felt an odd, barely noticeable yet pleasureable sensation coming from her butt. It was so insignificant that she dismissed it instantly at the sight of all the great food laying at the table. Her fleshy butt jiggled up and down as she quickened her step, eager to have at the great dinner laid out before her. She felt the same sensation as before coming from her butt, only much stronger this time as she sat down. But the pleasureable feeling was gone so fast that she ignored it yet again, and shifted her butt in her seat in an effort to get comfortable. As she shoved spoonful after spoonful of food in her mouth, she couldn't help but let another tiny, soft fart out. It was quiet enough so that no one noticed it. She smiled to herself and continued her dinner.<br>\r\n---------------------<br>\r\nThe gigantic cheeks on either side of you shifted rhytmically up and down as you intensified your struggles. She paid you no heed. Suddenly, you felt something that you knew would confirm your fears...she was sitting down! As her cheeks squeezed outward you were pushed inward. You were shoved with so much force that you went straight up all the way in to the tight hole. The squeeze was so tight that you thought one of your limbs or maybe even your nose might break. You knew hadn't gone in too deep and that your head had to be close to the rim of her butthole. You struggled to push but it had a reverse effect. It appears that you only pleasured her more once again, and the Natalie, in an effort to get more of the pleasureable feeling, subconsciously had her butt keep sucking you inward. Soon you were delivered in to a much less tight area, rid with slimy walls and the worst scent that you've ever smelled. This was absolutely awful!!!! There had to be a way out!! You pounded against everything, struggled and kicked in an attempt to get any sort of reaction at all, but the disgusting walls only quivered with joy as you became swamped in anal juices. The hot, steamy environment began to pulsate as you were hit with another blast of the foul smelling gas that escaped very easily out her butthole. You coughed and thought that you might black out...seconds later you barfed. You couldn't help it. The entire situation was too foul and disgusting for your poor nerves and stomach. No reaction at all from Natalie, she has no idea that you're in her rectum suffering to no end. You slump against the walls, coating your back in anal slime and juices, but you don't care. What can you do but wait for her to crap? It appears that that's the only way that a solid form will get through her butthole. You sigh and start to think...</span></div></div>",
            "created":1083474000,
            "id":197636,
            "title":"Murphy's Law in Full Effect: Ass Torture"
        },
        "11522":{
            "author_id":"rpcity",
            "author_name":"SmittySmith",
            "choices":[
                "Shakira",
                "Vida Guerra"
            ],
            "content":"<div class=\"\"><div> <span>You grab onto the heelstrap of her shoe, but as she walks, you are repeatedly bashed into the back of her shoe, a few times narrowly missing being caught underneath it. The ware and tare is too much for you, so you eventually give in and let go, longingly watching Natalie walk off in the distance. You're still gazing at her, as a giant hand grabs you!<br>\r\n<br>\r\n\"Ah...I knew that I picked the right limo driver\" a feminine voice from above says.<br>\r\n<br>\r\nIt's Britney Spears! She goes on to tell how you how it was HER who shrunk you, with her patented pocket shrink ray. It wasnt the fountain afterall....but...now the question in your mind is why?<br>\r\n<br>\r\nBefore you can ask, she begins to walk and soon you are set down in a glass container and steps up to a microphone.<br>\r\n<br>\r\n\"Thank you all for coming ladies! Now for the moment you've all been waiting for, the drawing for the grand prize! You've all paid $1500 to the Help the Heart charity in hopes of winning what is in this small glass case! Take a good look and you'll see that I made good on my promise of providing an inch tall man for the enjoyment of the winner! You may be familiar with him....Chris Minutae, some of you may have even been in his limo previously. But now...without any further delay, get out your tickets!\"<br>\r\n<br>\r\nShe reaches her hand into a large bin of tickets and pulls one out.<br>\r\n<br>\r\n\"The winning number is 3-6-2-4-3-6!\"<br>\r\n<br>\r\nA hand shoots up from the back....<br>\r\n<br>\r\n\"I won!!!!\"<br>\r\n<br>\r\nYou then see ____ run up to the podium.</span></div></div>",
            "created":1072933200,
            "id":183654,
            "title":"The new lotto."
        },
        "115222":{
            "author_id":"rpcity",
            "author_name":"SmittySmith",
            "choices":[
                "Your life with Vida Guerra"
            ],
            "content":"<div class=\"\"><div> <span>It's Vida Guerra! The up and coming Cuban model! The proud owner of what you think to be THE perfect body, including one heck of a butt!<br>\r\n<br>\r\nBritney steps back to the mic \"Congratulations Vida! You are now the proud owner of Chris! He's yours to play with, enjoy, or have serve you in any way you deem fit!\" <br>\r\n<br>\r\nThose words echo in your mind....OWNER...<br>\r\n<br>\r\nStepping away from the mic she talks privately with a very excited Vida.<br>\r\n<br>\r\n\"Now Vida....you have to remember, he's not immortal. He can be killed. However, my ray does give him more resistance than it would be if everything were in the exact proportions.\"<br>\r\n<br>\r\nVida nods...she is obviously VERY excited to have won you.<br>\r\n<br>\r\n\"Allright Vida...here you go! He's all yours!\"<br>\r\n<br>\r\nVida's wearing a tight fitting miniskirt and a fairly lowcut blouse. She reaches into your holding case and wraps her fist gently around you. <br>\r\n<br>\r\n\"Ooooo...I can tell you like what you see mini-man. And believe me, I am going to enjoy this very much myself. Britney...will you do the honors?\"<br>\r\n<br>\r\nWith that she hands you back to Britney, and what she does next draws an envious gasp from the crowd and a very nervous gasp from you. Her hand goes to the back of her skirt and lowers it to her knees, revealing her very tight (probably too small) black panties. She then pulls the waistband away from her back.<br>\r\n<br>\r\n\"Let him fall where he may\"<br>\r\n<br>\r\nBritney releases you into the abyss between her butt and the material. You land and bounce, before being smushed to her soft skin by the releasing of her waistband. Everything gets dark as she hikes her skirt back up. You are stuck to her left cheeck.<br>\r\n<br>\r\nAs she begins to walk off stage, Britney gives her a half slap half squeeze in the rump, smashing you into her.<br>\r\n<br>\r\n\"Enjoy yourself\" she calls off after her.</span></div></div>",
            "created":1072933200,
            "id":183655,
            "title":"You just got OWNED!"
        },
        "1152221":{
            "author_id":"bds123",
            "author_name":"biggirl",
            "choices":[
                "Jessica Simpson",
                "Hillary Duff"
            ],
            "content":"<div class=\"\"><div> <span>Vida purposely moves her butt back and forth, back and forth obviously very happy about having you smooshed up against her fine ass.  She continues to walk and then she stops.  You Thank God that the moving has stopped hoping that she may take you out. However you just feel her fingers from the outsider pulling on you, she must be pulling out her wedgie, and with it removed she laughs, and says so you can hear her. <br>\r\n\"Well my little guy, i hope you like where you are, cuz you're gonna be there for a while.\"<br>\r\n she then slaps her own butt causing your world to shake. When you can just hear someone else.<br>\r\n\"Thats what you think...i should have won that little guy, take a look i have that same number.\" You can tell that voice anywhere it must be...</span></div></div>",
            "created":1082782800,
            "id":196613,
            "title":"A cat fight in the making?"
        },
        "11522212":{
            "author_id":"rpcity",
            "author_name":"SmittySmith",
            "choices":[
                "Follow Vida and Chris' story",
                "Follow Hillary's search for a man of her own."
            ],
            "content":"<div class=\"\"><div> <span>Vida turns and sees a very angry Hillary Duff.<br>\r\n<br>\r\n\"Thats right, the little man should be MINE!\"<br>\r\n<br>\r\nVida giggles.<br>\r\n<br>\r\n\"Oh? Well there is no denying that I had the winning number. Britney checked it and everything.\"<br>\r\n<br>\r\n\"I have the winning ticket\" Hillary says through clenched teeth.<br>\r\n<br>\r\n\"How old are you hun? 16?\" Vida laughs again<br>\r\n<br>\r\n\"I'm old enough to know that I can have LOTS of fun with a man that size.\"<br>\r\n<br>\r\n\"I'm sure you do. Tell you what, why don't you go and ask Britney if she has anymore little men. Maybe she can make a new one for you. But THIS one belongs to me.\"<br>\r\n<br>\r\nAnd with that, Vida continues her way to the exit, leaving Hillary lost in the crowd. The young blond then turns to seek Britney, searching for the only person who can get her a little man of her own.</span></div></div>",
            "created":1084597200,
            "id":199384,
            "title":"Turned back"
        },
        "12":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Britney Spears",
                "Christina Aguilera",
                "Avril Lavigne",
                "Jennifer Lopez",
                "more choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>man oh man, there are some tough decisions here...</span></div></span></div>",
            "created":1072501200,
            "id":183147,
            "title":"Talk about choices!"
        },
        "122":{
            "author_name":"tjaj14",
            "choices":[
                "brings you up to her face for a closer look at you.",
                "Drops you in her soup where she promptly continues eating, knowing that you'"
            ],
            "content":"<div class=\"\"><div> <span>You look up at the beautiful teen pop goddess, Christina Aguilera. She is wearing tight black leather pants and a small halter top with a jacket. As you stare, you see her reach dwon to scratch her ankle and you see this as an oppurtunity to hitch a ride so you jump on her hand hoping that she didnt notice you. You then see all the other singers leave and you hear Christina say that she'll catch up. She then continues to eat her half eaten soup on the table. You, on the table, watch in awe as the steaming soup is lifted to her glossy lips, into her wide mouth. You seem to stare forever when you see her eyes lock onto yours. You are frozing in fear knowing that she has spotted you.<br>\r\n\"Hi\", you say.<br>\r\n\"Hey there, cutie\", she says,\"did you come to watch me eat my food or did you come for a little swim in my mouth.\" You try to say something but nothing comes out of your mouth. She then picks you up with her silky smooth hands and</span></div></div>",
            "created":1103259600,
            "id":229247,
            "title":"Christina"
        },
        "1222":{
            "author_name":"jay",
            "choices":[
                "Eaten",
                "Pleasure"
            ],
            "content":"<div class=\"\"><div> <span>She drops you in her soup and the thought of her being a giantess gets to her.  She eats all of the soup, but she leaves you in the bottom of it.  She says, \"I wasn't letting the taste of you get mixed in with soup, so here it is\".  You stare at her beauty in awe as she brings her face closer to the bowl and she starts to lick it clean.  She licks you up into her mouth and starts to suck on you.  The sucking cause you to get an erection and cum in her mouth. She really enjoys this and decides...</span></div></div>",
            "created":1140411600,
            "id":302724,
            "title":"Soup please!!"
        },
        "124":{
            "author_id":"bds123",
            "author_name":"biggirl",
            "choices":[
                "hears you and turns around",
                "Continues to sit down (on top of you)"
            ],
            "content":"<div class=\"\"><div> <span>You are very happy that your wish came true, but then you realize the world can be a dangerous place when you are so small.  You then look over to a table that has a bunch of hot singers sitting there, and you think you'll try to get they're attention.  You run over to the table and jump on to one of the feet, when you look up you can just barely make out the face of Jennifer Lopez.  You start climbing her beautiful leg all the while yelling trying to get her attention but you are simply too small.  Right about when you reach the top the whole surface beings to shake, as J-lo is decided to stand up for a minute<br>\r\n<br>\r\nWhile she stands up she manages to shake you free and you fall dwon onto the hard chair, you are dazed for a minute, but then come to your senses just in time to see the big famous J-Lo booty coming right for you <br>\r\n\"J-lo, J-LO!! please don't sit down!\" you yell, she then...</span></div></div>",
            "created":1076994000,
            "id":188826,
            "title":"J-Lo's best feature"
        },
        "1242":{
            "choices":[
                "bedroom",
                "bathroom"
            ],
            "content":"<div class=\"\"><div> <span>its no secret u like big butts, J-Lo's espically,but not coming down on top of you! there is no wear to run as the massive butt covers u completely.  luckily you are in the crack area or you would have been killed,then all of a sudden there is a rumble, then a hush of wind, J-Lo just farted on you! After that she stands up,with u stuck to her booty and goes to the</span></div></div>",
            "created":1078808400,
            "id":191329,
            "title":"i like big butts"
        },
        "12421":{
            "choices":[
                "butt smother",
                "she cuts another one"
            ],
            "content":"<div class=\"\"><div> <span>J-Lo heads to the bedroom with you still stuck to her butt. Wriggling desperately, you look for an opportunity to escape her massive ass. <br>\r\n<br>\r\nFinally, she moves over to the bed, which has some clothes on it. She turns abruptly, which allows you to drop harmlessly onto a piece of clothing. You weave your way through the silk garment as you hear J-Lo shuffling about and muttering something like \"Where did I put it?\"<br>\r\n<br>\r\nThe muttering and shuffling stop. You freeze, wondering if you've been spotted. \"Aha!\" she cries in triumph.<br>\r\n<br>\r\nUh-oh.<br>\r\n<br>\r\nThe garment you've been trying to get out of suddenly gets jerked upward. Now it plunges down, then up again, making you disoriented. You lie on your back and look upward...just in time to see two incredibly huge globes rushing up to you. You realize with horror that you've seen this beautiful, but awful thing before -- just not unclothed.<br>\r\n<br>\r\nYou realize you're in a pair of panties she was looking for. And now her enormous butt is coming to get you again.<br>\r\n<br>\r\nHer panties (and you) snug against her butt, JLo then gets to her next task -- putting on new shoes. Of course, she has to sit down to do it. </span></div></div>",
            "created":1103259600,
            "id":229280,
            "title":"No escape from JLo's butt"
        },
        "124212":{
            "author_id":"nitebyss",
            "author_name":"Nitebyss",
            "choices":[
                "She needs to go to the bathroom.",
                "She thinks she felt something (you) in her panties but isn't sure."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>J-Lo is about to sit down to put on her shoes when she suddenly stops.  There is a great rumble as she lets out a long smelly fart, making you flail all around, trapped in the smell.  Soon after she seems to have forgotten about her shoes.</span></div></span></div>",
            "created":1107493200,
            "id":235212,
            "title":"Let 'er Rip!"
        },
        "1242121":{
            "author_id":"shrapnel333",
            "author_name":"Shrapnel333",
            "choices":[
                "You end up in the toilet and she notices you before flushing...",
                "You get flushed away..."
            ],
            "content":"<div class=\"\"><div> <span>With all that rank gas coming out of Jennifer's perfect ass, you can guess what's coming next. You hear a muffled voice, \"Oh, I shouldn't have had that Mexican for lunch.\" You can barely believe your rotten luck; you're hugged up against one of the most famous and most gorgeous asses in Hollywood and she's got terrible gas and is about to take a shit. <br>\r\nYou feel the fleshy mounds bounce up and down as J-Lo walks to the bathroom. She stops and lets out another fart, this one blasting right into your face. As she returns to her walking you notice that you're getting pushed in-between her ass cheeks by the motion. You're now worried you won't be taken off with her panties. Your chance for escape seems to be going down the toilet...<br>\r\nJ-Lo stops in the bathroom and lifts the seat. She turns around and drops her pants and panties and sits down on the toilet. You have no chance to free yourself from her massive ass before the clothe disappears. <br>\r\nSuddenly you see water below. You fling out your arms and legs into her cheeks, trying to maintain your position by wedging yourself in. Her gigantic ass has spread a little and you worry you might lose your grip, but you hold on. You feel her body relax around you, preparing to release the contents of her bowels. You'll be fine, you think, until she farts and you nearly fly into the frigid water. You look behind you. Her anus is right behind you, and its starting to ease open with a big brown surprise.</span></div></div>",
            "created":1194325200,
            "id":461343,
            "title":"Royal Throne"
        },
        "12421211":{
            "author_id":"bootylover",
            "author_name":"dinglish",
            "choices":[
                "Selena Spice",
                "Kim Kardashian"
            ],
            "content":"<div class=\"\"><div> <span>With J-lo's big browns surprise creeping ever so slowly, you begin to wonder if you could hold on much longer let alone during her bathroom ritual.  As you hold the ass hairs of J-lo the bus sized log makes contact with pushing you against and along J-lo's  inner cheek, eventually you lose your grip and fall into the frigid waters below.  Only to see the giant log come crashing down next to you.  You think to yourself thank god that's over, then you hear J-lo grunt and releases another massive fart practically making you deaf.  Then to your horror you see another log emerge from J-lo's ass this one is coming much faster.  You have little time to think and luckily once again it misses you but now you're trapped between the two giant logs with nowhere to go.  Then your world is flooded with light as J-lo lifts her humongous ass of the toilet.  <br>\r\n<br>\r\nShe looks down and says,\"Wow, I haven't took a shit that big in a long time.\"<br>\r\n<br>\r\nThinking J-lo sees you, you scream,\"HELP ME PLEASE!!\"<br>\r\nAnd in fact she does<br>\r\n<br>\r\n\"Well hey there little guy\" she says, \"I see you wanted a closer look, Was it all you hoped it to be?\"<br>\r\n<br>\r\nYou try again but its appears she's ignoring you or really can't hear you.<br>\r\n<br>\r\n With a smirk on her face she continues,\"Well I'm sure you didn't come here to see just one big beautiful latina ass, now did you\"<br>\r\n<br>\r\n\"Well have fun with the next one you're gonna love her much more then me.\" she says as she leaves.<br>\r\n<br>\r\nTo your excitement and horror you see the beautiful Vida Guerra.<br>\r\n<br>\r\nShe look into to the toilet and says,\"EWW!! GROSS.  Well I guess I'm about to make it much worse.\" <br>\r\nshe spins around showing her big ass being hugged by tight leather pants.  She peels them off and plops on then toilet seat.  Quickly releasing two horrid smelling farts.  The smell  makes your eyes water and you're ready to puke.  But you suck it up and hold it in.  But that much couldn't be said for Vida as the first log started to appear.  It fell and a direct hit, sending you under water.  You reach the surface of the murky water only to be greeted by another turd with another direct hit.  But this time you stick to it.  The log rolls over with you lying face down indented into the enormous log.  You manage to get free and roll onto your back only to see Vida isn't quite done.  With a huge grunt Vida drops a third giant log again on top of you, sandwiching you between the immense logs of shit with only your head exposed.  You spit the shit out of your mouth and see giant goddess raise her ass from the seat.<br>\r\n<br>\r\n\"Man I wouldn't want to be in there\", she giggles.  She wiggles into her skin tight pants.<br>\r\nAnd on her way out she says,\"hey girl feelin sick to huh, well its about half full so you got plenty of room.\"<br>\r\n<br>\r\nWho is next<br>\r\n</span></div></div>",
            "created":1241845200,
            "id":688841,
            "title":"The mexican onslaught!!"
        },
        "124212111":{
            "author_id":"bootylover",
            "author_name":"dinglish",
            "choices":[
                "Shakira",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>A shadow casts over you.  To see Selena Spice a beautiful latina model with a huge ass at normal size.  Is now Planetary to you.<br>\r\n<br>\r\nA tear runs down your cheek, \"how much more do I have to endure?\"<br>\r\n<br>\r\nUp above Selena has no idea of the hell the little below has been through, and she is about to add to his torment.<br>\r\n<br>\r\nSlowly peeling off her tight booty shorts you begin to get hard and cry at the same time knowing whats about to happen.  And also knowing that there's nothing you can do due to the fact you are sandwich between Vidas giant logs.<br>\r\n<br>\r\nSelena peeled off her shorts and slowly sat on the toilet.<br>\r\n<br>\r\nMinutes pass and nothing<br>\r\n<br>\r\nA glimmer of hope you think.  But that is soon to change.  Selenas ass explodes with a gigantic fart that pushes the log thats on top more into you, embedding you into it even further.  <br>\r\n<br>\r\nNow in your shit coffin you look up to see your soon arriving addition to your tomb. An absolutely massive turd the greatly out weighs the two holding you captive.  It drops with such force it snapped your legs like toothpicks.  The newly added smells makes your eyes and nose burn like fire.  You try to use your hands but they are buried under shit.  <br>\r\n<br>\r\nA gurgle from above makes you cry out loud hoping she might hear you and get you out of this hell.<br>\r\nYet again that hope is gone.  These gigantic latina goddesses are completely annihilating you with their perfect asses and you have no way of fighting back.<br>\r\nAnother gurgle then the second log appears.  This one as like the first land width ways slamming into vidas logs burring you more and breaking you right arm in the process.  Now only your eyes and nose are visible with no chance to open your mouth unless you wan to eat shit. <br>\r\n<br>\r\nLuckily for you selena is done letting out her massive logs of pain and torment<br>\r\n<br>\r\nAfter she's gone the door creaks open who's next to unleash there bowels wrath upon you?</span></div></div>",
            "created":1272344400,
            "id":874412,
            "title":"Selena Spice"
        },
        "1242121111":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Describe your death scene.  ",
                "The water churns when she flushes and you escape from the shit coffin!  "
            ],
            "content":"<div class=\"\"><div> <span>The next girl to use the toilet is none other than Shakira.  You considered it very ironic that most men would give almost anything to see so many naked booties like you have been able to see.  But the price... oh god the price is too high.  <br>\r\n<br>\r\nShakira lets out a moan.  <br>\r\n<br>\r\n\"Oh I can't believe how backed up this stomach flu has made me!\"<br>\r\n<br>\r\nHer voluptuous figure appears above you.  Despite the pain of the broken legs and one broken arm you do get aroused at seeing her naked booty.  It was round and large and utterly gorgeous.  You could wax poetically about the breathtaking behind but you had larger concerns, largely your oncoming death.  <br>\r\n<br>\r\nBefore any shit comes out she lets out a loud fart.  PFFFFFFFFBBBBBBPPPPFBBBBBTTT.  <br>\r\n<br>\r\nThe smell is worse than the previous users fo the toilet.  You are forced to cough due to the stench.  This is a very bad thing as your mouth was partially covered in a large shit log.  Through your coughs some of the previous singer's shit got inside of your mouth.  You feel your gag reflex take over and you retch awfully.  <br>\r\n<br>\r\nAnother massive blast of flatulence fills the air of the toilet bowl.  <br>\r\n<br>\r\n\"Ugh just come out already!  I haven't been able to take a dump in days.  I feel it inside, come out shit come out!\"  <br>\r\n<br>\r\nYou hear her grunted and straining above you.  You pray that she continues to be constipated so that you do not literally become buried alive in shit.  The idea of slowly suffocating under human shit scares the shit out of you.  (Hah!)  Your prayers go unanswered.  <br>\r\n<br>\r\nA loud squirt is heard and a small pit of shit runs out in liquid form from her ass.  It slams into the water beside you and you look fearfully up.  And then it occurs.  The massive explosion out of her booty.  The MILF ejects a colossal tidal wave of brown filth.  It coats every part of the toilet including you!  You begin to hyperventilate as you are still trapped on the shit log.  It gets into your eyes, nose and mouth.  Only it's runny consistency allows you to survive as flows off of your face and around you.  <br>\r\n<br>\r\nAnd she wasn't done, The MILF grunts again and what looks like brown urine begins to stream out of her booty.  It hits you and the shit log your on and the strong piece of shit actually rolls over sending your entire body into the disgusting waters.  Luckily for you it completes a full rotation so you are back facing the surface.  Unluckily for you the tide of brown continues to pour out of her booty making the log rotate again.  It is rotating at a decent clip and you have to time your breaths carefully in order to avoid drowning.  <br>\r\n<br>\r\n\"Ugh I can still feel more inside of me.\"  <br>\r\n<br>\r\nThat statement makes you weep.  You figure that this is it.  Your life is over.  Finally the log stops rotating and The MILF above you starts grunting again as her stream has stopped.  <br>\r\n<br>\r\nHer phone rings and she answers, \"Ugh I know I'm late but I'm finally getting all of this crap out of me.\"  You don't hear the other end of the conversation of course.  <br>\r\n<br>\r\n\"No I don't know how long I'll be.  Do you realize I haven't taken a dump in 4 days!  Four days!  And you know I've been trying to put on some weight for my new movie roll so I've been eating more.\"<br>\r\n<br>\r\nFour days of shit.  Four days of shit.  Oh god oh god oh god you moan.  <br>\r\n<br>\r\n\"Look I'll be there when I can now shut up about it.\"<br>\r\n<br>\r\nShe hangs up the phone and begins to grunt again.<br>\r\n<br>\r\n PFFFFFFFFBBBBBBPPPPFBBBBBTTT <br>\r\n<br>\r\nBBBBRRRRPFFFFFPPPPTTTTTTTT<br>\r\n<br>\r\nThe gas is somehow getting even stronger!  You had a strong will to live but this was getting ridiculous.  What had she been eating to bulk up?  She was a Latina so the stereotype would suggest a lot of beans...  <br>\r\n<br>\r\n'I'm not going to make it out alive,' you think to yourself.  <br>\r\n<br>\r\n\"DAMN IT.  I AM LATE GET OUT OF MY ASS!\"  <br>\r\n<br>\r\nStrangely enough The MILF yelling at her crap got it going again.  <br>\r\n<br>\r\nThis time the sludge that exited her massive booty was green in color.  You whimper as a thin green stringy mess squirts out of her sphincter and onto your tiny belly.  It coils around your body which pushes you and the log down slightly.  Murky water piles up around your ears and you feel the shitty water actually enter your ear canal.  You couldn't take it anymore.  You puke.  <br>\r\n<br>\r\nThis is a horrible turn of events because the shit log that you were partially buried under had your chin partially submerged.  You puked into the shit and the shit and puke roiled over back onto your face.<br>\r\n<br>\r\n\"Ah yes that' sit come on out so mama can make her rehearsal!\" <br>\r\n<br>\r\nA thunderous explosion roared from above you as flecks of green shit rip out of her booty.  Thankfully it doesn't capsize the shit coffin your in but you are now drenched in the most foulest smelling shit yet.  The greenish slim is twice as bad as all of the previous loads combined.  This led to you puking again.  And having it roll back into your mouth again.  Your entire face except your nose, a bit of your forehead and your eyes were now buried in shit as you floated on a log.  <br>\r\n<br>\r\n\"Ah yes god this is better than sex!\"  The MILF above you was clearly as thankful for getting her waste out of her ass as you were horrified by it!  <br>\r\n<br>\r\nYou could barely see what was going on but you heard her strain and than a thick log of greenish shit emerged.  The noxious fumes redoubled in intensity and you felt yourself getting light headed.  You strained against your shift coffin to move your tiny arm that was the only limb that wasn't broken.  You  needed to get out, you needed help.  You needed to get away from this gigantic shit log of doom!  <br>\r\n<br>\r\nYou try to scream for help but that just causes your mouth to get gagged with shit.  You'v actually breathed in shit particles down your windpipe and now each breath burns.  You weep and pray and beg in your mind for some relief before this massive piece of shit crushes you.  <br>\r\n<br>\r\nThe log that is exiting Shakira's ass is truly massive.  It would be massive to normal people however to a a shrunken tiny person like you it looks the size of a house.  The weight would probably kill you.  As you float on your shit coffin you bob helpless, hoping and praying that this green beast misses you.<br>\r\n<br>\r\n\"Ugh almost there there.  Almost there.  Damn I'm never going to long with out taking laxatives again!  This is ridiculous.  UGH COME ON!\"  <br>\r\n<br>\r\nShe gives a mighty shout and her booty pushes out the last of the massive mammoth sized log.  It descends in slow motion and slams an inch away from you.  You sigh with relief but that relief is short lived as the weight of that shit tosses your shit log around like a ship in a hurricane.  Your log does it's spinning thing again and you find yourself upside down in the shitty brown and greenish water.  <br>\r\n<br>\r\nOnly this time it bumps up against the massive piece of shit.  It bumps up against that massive piece of shit while you are still on the downward side which meant you were under the water with no way to get out.  You are trapped upside down in a shift log that is holding you under water.  You scream and thrash but it is futile you are trapped...   </span></div></div>",
            "created":1419993060,
            "id":1909787,
            "title":"Shakira"
        },
        "1242122":{
            "content":"<div class=\"\"><div> <span>J-Lo feels a slight tickle as she sits down. She ponders for a second taking off her panties to see what it is, but she's kind of pressed for time. She clenches her cheeks a few times, and the tickle seems to go away. Oh well, time to get ready, probably just the gas anyways.<br>\r\n<br>\r\n-----------------<br>\r\n<br>\r\nYou are flailing around in J-Lo's butt crack, when she stops moving. You hope she felt you and will check, but no such luck. You feel her gigantic ass cheeks crush in on you as she clenches her muscles. You worry at first that you will be pulled into her asshole, but then you realize that's not a problem. Instead you are just crushing into her asscrack. The pain is intense, and you can't wait for death just so it will end. You feel your bones reduced to paste, your entire body squashed flat, but somehow you still live. You can't move anymore, yet apparently your senses still work because you can smell her ass as badly as ever. You wonder what's going on as J-Lo gets up and leaves her room.<br>\r\n<br>\r\n--------------<br>\r\n<br>\r\nA long time and a lot of farts later, J-Lo returns to her room, and starts to take her cloths off to take a shower. As she's bent over to turn on the water, you see her ass in the mirror. In her crack, you see your crushed body, but it's not really a body anymore. It's more like a tatoo right above her hole. You want to scream, but realize that you are now just part of J-Lo's skin, and will spend the rest of her life as part of her buttcrack.</span></div></div>",
            "created":1121317200,
            "id":261445,
            "title":"squashed flat"
        },
        "125":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Jessica Simpson",
                "More choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more to choose from</span></div></span></div>",
            "created":1072501200,
            "id":284694,
            "title":"more choices"
        },
        "1252":{
            "choices":[
                "Rihanna",
                "Beyonce",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about these?</span></div></span></div>",
            "created":1277701200,
            "id":907908,
            "title":"More choices..."
        },
        "12521":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Cue the ass rub."
            ],
            "content":"<div class=\"\"><div> <span>You walk in the thankfully empty corridors and find a door slightly opened with the name \"Rihanna\" on it. This must be Rihanna's room. You've never driven Rihanna before to your dismay, as you've always desired this beautiful woman. You walk into the room to notice Rihanna sitting at the mirror removing her make-up. \"She doesn't even need the make-up,\" you think to yourself as she still looks perfect au-naturale. You wonder to yourself what on earth to do.<br>\r\n<br>\r\nYou look over at her bare feet, which you've secretly fetishised over. You walk over to them and look at them in awe. Rihanna is massive in comparison to your size. It would be best to get her attention so you start to massage her feet. Merely three seconds into it Rihanna stops removing her make-up and looks down investigating the strange feeling at her feet. She looks in shock to find your small figure. \"Oh my God, you're tiny. But how?\" she asks with both confusion and curiosity. Your answer sounds a bit silly even to you. \"Well I put a penny in the wishing well and made a wish to be smaller out of pure curiosity. Then I blacked out and all of a sudden I'm tiny.\"<br>\r\n<br>\r\nRihanna smiled at you and picked you up. \"Well you know what they say little guy. Be careful what you wish for.\" You smile back at the smart comment. \"Fair enough. But if I hadn't then I wouldn't be held at this moment by a beautiful goddess,\" you reply making Rihanna blush. \"Thank you cutie. Y'know what, Imma keep you. I think you'll be a fun little pet. That brief foot rub was nice. I'd like an ass rub when we get home,\" Rihanna says giving you both a wink and a boner. \"I'll put you in my panties until we get home.\" Rihanna then put you in her panties against her warm and smooth butt cheek and got home.</span></div></div>",
            "created":1358905440,
            "id":1514497,
            "title":"Owned"
        },
        "12523":{
            "choices":[
                "Yes!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Katy Perry perhaps?</span></div></span></div>",
            "created":1280379600,
            "id":926667,
            "title":"More"
        },
        "125231":{
            "author_id":"jzar16",
            "author_name":"Joey",
            "choices":[
                "Katy let a HUGE fart rip",
                "She got up to go talk to another singer"
            ],
            "content":"<div class=\"\"><div> <span>You saw the beautiful Katy Perry sitting at the table wearing a short, rubbery green dress . You decided that she'd be the best person to go see. As you scaled the chair, Katy leaned forward to talk to the other singers.<br>\r\n<br>\r\nYou reached the base of the chair and wondered the best path to get to her. You knew that climbing the back would be nice but you were worried that the dress might be too slippery to get ahold of. You could always go up the front but since she was leaning forward, you could potentially fall off her. As you approached her closer, you saw that she had a slight tear on the back of her dress, which would be helpful as a foothold.<br>\r\n<br>\r\nYou started to climb with this hole and were lucky enough to find the dress zipper just above you. As you reached for the zipper, you felt Katy jump. Somebody must've said something surprising to her because she launched herself back into the chair. This movement caused you to slip right down the hold and get stuck on the outside of her sea green panties.<br>\r\n<br>\r\nYou tried to wiggle free but this seemed to only drive you further into her crack. You were clawing to drag yourself out when suddenly...............</span></div></div>",
            "created":1425951120,
            "id":1946371,
            "title":"Yes!"
        },
        "125232":{
            "choices":[
                "Yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Nicki Minaj?</span></div></span></div>",
            "created":1302757200,
            "id":1088061,
            "title":"Nicki Minaj"
        },
        "1252321":{
            "choices":[
                "in her butt",
                "in her cooch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where do you want to go?</span></div></span></div>",
            "created":1305536220,
            "id":1106915,
            "title":"Yes!"
        },
        "1252322":{
            "choices":[
                "Yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jennifer Hudson?</span></div></span></div>",
            "created":1302757200,
            "id":1088078,
            "title":"Jennifer Hudson"
        },
        "12523222":{
            "choices":[
                "Yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keri Hilson?</span></div></span></div>",
            "created":1302757200,
            "id":1088086,
            "title":"Keri Hilson"
        },
        "125232222":{
            "choices":[
                "Yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fergie then?</span></div></span></div>",
            "created":1302757200,
            "id":1088091,
            "title":"Fergie"
        },
        "1252322222":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Shakira",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm shocked this hasn't been suggested considering the nature of the story.</span></div></span></div>",
            "created":1407557220,
            "id":1839210,
            "title":"Shakira?"
        },
        "13":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Stay on Anna, after all, this is what you've been waiting for",
                "Jump off her, you think you see Maria Sharapova...",
                "Jump off and find another hot athlete"
            ],
            "content":"<div class=\"\"><div> <span>You begin to make your way over to the table where you had recognized some athletes, when you get slammed in to from behind. Trying desperately not to go flying you grab on to the nearest thing, and it is a shoelace. You realize someone was just walking and nearly kicked you across the room if it weren't for your reflexes. You look up to see who you're dangerous ride is, and it is none other than the beautiful Anna Kournikova. For some reason though, the slightly vinegary/cheesy smell coming from her sneaker subtracts from her beauty. Oh well, you're not complaining. As she makes her way over to the table, you have to make a decision. Do you...</span></div></div>",
            "created":1072501200,
            "id":318184,
            "title":"Whoops! Well, I guess it's not bad at all"
        },
        "131":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Plan goes off without a hitch, onwards to Anna's ass!",
                "Something goes wrong, you find yourself in trouble"
            ],
            "content":"<div class=\"\"><div> <span>Caught up in the moment, you carelessly discard any worries about getting back to your own size. Here you're sitting on Anna Kournikova's tennis shoe with a perfect upskirt view. As she continues her walking, you watch her fleshy ass cheeks jiggle up and down from your position. \"Damn, I'd like to get in that underwear,\" you think to yourself. Her mini-skirt looks soft and cottony from here, so it shouldn't be any issue getting past how tight it is, it probably expands very easily. Then you just have to slip under the elastic and enjoy her ass. You can't wait, and your dick leads you upward...</span></div></div>",
            "created":1086757200,
            "id":202449,
            "title":"The Best Laid Plans..."
        },
        "1312":{
            "author_id":"modcheese",
            "author_name":"dr.weird",
            "choices":[
                "Tumble under her moist, smelly, sock-covered toes?",
                "Manage to keep your position fo r now"
            ],
            "content":"<div class=\"\"><div> <span>You began scaling her bare leg, which is pretty frickin difficult due to how well-shaved she made sure it was. You inch up, occasionally finding a hair that's just long enough to grasp firmly, after all, you're only one inch tall so the hairs are like dowels to you. This next move's gonna be tricky though, the next hair is a little high, you're going to have to jump up to reach it. By now, Anna has taken a seat so stability is not an issue. You're just praying you can reach the hair by jumping. You throw yourself up and grasp wildly, but completely miss. You start plummeting towards the ground and look to see where you will land. Oh crap! Apparently Anna had a foot itch and slid her foot out of the sneaker! You fall right in to the moist, sticky heel section. You're surrounded by an awful, cheesy/vinegary smell and a crap load of humidity. Within the first ten seconds that you're in there you're already soaked with sweat, though you're not sure if it's hers or yours. Suddenly your entire world becomes angled as she picks up her sneaker to put it back on. You tumble helplessly down the moist, slick, smelly surface all the way to the toe section. You hear a scratching noise which can only be one thing. You look towards the light of the exit of her shoe and see the sock that was once white (now a nice tan brown from her sweat) coming towards you, with her foot in it of course. You push yourself against the wall, hoping you'll have enough space. The front of her second toe hits you in the face though, just barely. There's no room to move, and you're trapped against the sock. Gradually, everything that you had thought about the shoe became magnified times ten. The humidity got unbearable as your shirt was soaked with a combination of both yours and Anna's sweat. The stink magnified to create the most rotten blend of bad locker room stench, lindbeger cheese, and a nice stale vinegary stench. The sock-encased toe presses against you, you wish she would wear bigger sneakers but tennis players can't run the risk of slipping out of their shoes. It JUST fits her smelly feet. She has no idea you're down here, and it's only getting worse. When the hell is she gonna take these rank things off? Suddenly, the sneaker begins to move. Do you...</span></div></div>",
            "created":1086757200,
            "id":202451,
            "title":"Trapped in the Stink"
        },
        "133":{
            "choices":[
                "Yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Serena Williams?</span></div></span></div>",
            "created":1302757200,
            "id":1088071,
            "title":"Jump off and find another hot athlete"
        },
        "1332":{
            "choices":[
                "Sure!",
                "Nah."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Trish Stratus?</span></div></span></div>",
            "created":1302809640,
            "id":1088135,
            "title":"How about this fine piece of tail?"
        },
        "13322":{
            "author_id":"awesomedude65",
            "author_name":"Dikbutkis",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of/both of the Bella Twins?</span></div></span></div>",
            "created":1441015080,
            "id":2028181,
            "title":"Stay with the world of Wrestling"
        },
        "133222":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "yes",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the British diva Paige?</span></div></span></div>",
            "created":1501048260,
            "id":2359489,
            "title":"No"
        },
        "14":{
            "choices":[
                "Yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Vida Guerra?</span></div></span></div>",
            "created":1302808800,
            "id":1088106,
            "title":"Who is that passing by?"
        },
        "142":{
            "choices":[
                "Yes! Oh yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Buffie\"The Body\"Carruth?</span></div></span></div>",
            "created":1302809160,
            "id":1088118,
            "title":"Hold on a sec who is this coming up?"
        },
        "1422":{
            "choices":[
                "Oh yeah!",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>Gizem Memic: the smokin' hot Turkish beauty pageant titleholder who won the title of Miss Turkey Universe in 2010 and conveniently is also the star of the Hardee's and Carl's Jr. turkey burger commercial. She's too sexy even though her name isn't. Sadly she's not well known in the U.S. of A.</span></div></div>",
            "created":1302850260,
            "id":1088423,
            "title":"Gizem Memic?"
        },
        "14222":{
            "choices":[
                "OH GOD YES!!!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Catia Carvalho? She is an extremely sexy Brazilian model, and was in Playboy. She has a <u><b>MASSIVE</b></u> ass! Her buttocks are nearly the size of your head!</span></div></span></div>",
            "created":1314336180,
            "id":1175356,
            "title":"Catia Carvalho"
        },
        "142222":{
            "choices":[
                "Hell yeah! :D",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>How about Sofia Vergara? The super sexy Latina actress/comedian/model/television host from Columbia. She's probably better known in The States as the current sultry female spokesperson for Comcast's/Xfinity's commercials. She has a GREAT ass!</span></div></div>",
            "created":1322555280,
            "id":1231602,
            "title":"Sofia Vergara?"
        }
    },
    "info":{
        "author_id":"modcheese",
        "author_name":"dr.weird",
        "brief_description":"Created in the same mold as the original \"What's That Smell?\" story.",
        "created":1072308420,
        "description":"<td align=\"left\" class=\"norm\">Like the original \"What's That Smell?\" story, this story revolves around the GTS/Butt theme. However, this story features celebrity characters and FOOT AND SOFT VORE ARE PERMITTED. For those who aren't clear on what \"soft vore\" is, it is the act of consumption through specifically swallowing. In other words, no chewing involved. All posts that are not Butt/Foot/Soft Vore posts are not permitted and will be deleted. Just stick to the storyline, add chapters and even characters if you so desire, and other than the restrictions listed above, have fun!</td>",
        "id":793066,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1501048260,
        "modified":1501048260,
        "pretty_title":"Celebrity What's That Smell?"
    }
}