{
    "chapters":{
        "1":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "The teacher starts to shrink",
                "Stephan starts to grow rapidly",
                "Somebody walks in the door",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Stephan was bored at the back if the class as his religion teacher blabed on about the subject, Stephan of coarse wasnt listening to him and day dreamed away to himself the odd time throw somthing around the class or tell a joke anything to waste time for Stephan.<br>\r\n<br>\r\nSTEPHAN!!!! His teacher roared and woke half the class that where as bored as Steve<br>\r\n<br>\r\n\"This behavour is disgraceful I'll speak to you after class!\" The teacher was fumming and a dozen heads turn glazing at him<br>\r\n<br>\r\nThe bell rang and everybody left to go home the summer sun beating in on the class that was silent with the two figures in it.<br>\r\n<br>\r\nStephan droned out his teacher voice yotaly not listening to a single word he was so angery at him he gazzed a the teacher that was still blabing on about his behavor<br>\r\n<br>\r\nSTEPHAN!!! The teacher voice rose <br>\r\n<br>\r\nShut the FUCK up !!!! Stephan was so enrage but suddenly...... </span></div></div>",
            "created":1272949200,
            "id":878243,
            "title":"Religon class"
        },
        "11":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "1 inch tall",
                "1 centimetre tall",
                "Flea sized!",
                "Smaller!!!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Stephan watchs the shocked teacher that normal he looks up to at his hight. <br>\r\nSteve more shocked then the shrinking teacher. He gets smaller and smaller and suddenly rage turns to humor and he evily jeers the now panicing teacher that stand in shock as Stephan now even towers over him and he is still shrinking!!<br>\r\n<br>\r\nThe teacher shrinks more rapidly until he is only....</span></div></div>",
            "created":1272949200,
            "id":878254,
            "title":"The teacher starts to shrink"
        },
        "111":{
            "choices":[
                "Puts his foot on Mr. Jackson",
                "Picks up the annoying teacher",
                "Does something really mean"
            ],
            "content":"<div class=\"\"><div> <span>Stephan had no idea why his teacher was shrinking, but ideas of revenge started whirling around in his head. While his teacher dwindled down, Stephan went over, shut the door and locked it. He turned around and smiled with a devilish smirk. \"You are in deep shit Mr. Jackson.\" His teacher seemed to have finally stopped growing at about a pitiful inch. \"You better watch out bitch! I feel like crushing you like a miserable bug asshole.\" He was getting excited with this new found power over his teacher.<br>\r\n<br>\r\nMr. Jackson yelled up at him, \"Return me to normal, you horrible little boy. You are going to be in big trouble!\".<br>\r\n<br>\r\nStephan just laughed, \"From my view, you are the one in big trouble. You'd better try and hide fucker!\".<br>\r\n<br>\r\nMr. Jackson continued berating Stephan. That is, until Stephan lifted his leg up high and then crashed his foot onto the tiled ground so loudly that it hurt the tiny man's ears. Mr. Jackson held his hands over his ears. Stephan purposely stomped his feet hard as he started heading toward Mr. Jackson. Stephan stopped and banged his hands on his chest, Grooooowwwwwllllll, \"Watch out - the deadly Stephanzilla is going to fuck you up!\" The teacher ran to try and hide under the desk. Unfortunately for him, Stephan easily caught up to him. </span></div></div>",
            "created":1334898000,
            "id":1319613,
            "title":"1 inch tall"
        },
        "1111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "You will shrink smaller!",
                "Spend the rest of the day in my shoe!",
                "Spend the rest of the day somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>\"Your pathetic to me!\" Stephan gave a roar at his 1 inch teacher that quivered in fear at the towering giant trouble-maker. The teacher had given up on his attempts to give out at Stephan after the realisation of the situation hit him. Stephan at his massive heigh could crush a buildings as the shrunken teacher gazed to the heavens between Stephans  legs as they rose high into the air like skyscrapers. *BOOM!* Stephen stomped his foot extremely close to Mr Jackson that resulting in the teacher on his back in fear as a devious smile rose across Stephan's. Face of Mr. Jackson was white with shear and utter fear as the building sized shoe landed only metres to him. It reacted of sweat and other foot odours but that was the least of the shrunk teachers worries. \"I could crush you like a little bug under my shoe\" Stephan explained, \"But that will be no fun killing you...just yet\" Stephan then slipped his sweat socked foot and pinned the teacher under his big toe. He wasn't applying any real pressure but the shear size and strength of toe trapped the shrunken teacher underneath. \"Please stop! Your going to kill me! Aaaaaahhhhhhhh!!!!! Help!!!\" Mr Jackson gasped as the thick cotton covered his view and was fighting agains an enormous enemy. \"Your my slave now!\" Stephan started to put slight pressure under Mr Jackson start gaged under the weight. \"Isn't that right?\" Stephan said, he was enjoying himself so much the feeling of the his 'slave'  under his toes felt so good! All this power was Stephan's and nobody else's! \"You are Stephan\" A faith shout from below. Stephen then released his foot as once more looked fully up to his masters face. \" Yes SLAVE!\" Stephan gloated. He knelt down making himself look bigger and more intimating. A massive grin rose as Stephan glared right at your tiny frame. What ever he was planing it was bad....<br>\r\n<br>\r\n\" I'm your master so first....     </span></div></div>",
            "created":1339304400,
            "id":1357135,
            "title":"Puts his foot on Mr. Jackson"
        },
        "11111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Crush him and end his puny, worthless life!",
                "Have another idea for this microscopic slave"
            ],
            "content":"<div class=\"\"><div> <span>\"Beg!\" Stephen proclaimed as he glazed down  at the inch tall teacher. \" Please Stephen just let me get back to normal! I've a wife and kids!\" The teacher pleaded for his life as he one more feel onto his knees at the giant shoe of Stephen. \"What was that I can't here you from way up here maybe say it a bit  loader?\" Stephen joked and laughed to himself. He stood up and looked to the sky miles above he gazed into the teens evil glaring eyes as tears began to build on the poor teachers face\" Please Stephen I hav.......\" Suddenly Stephen started to grow even bigger leaving the teacher gob smacked as it wasnt Stephen getting bigger he was shrinking smaller! \" Tears rolled off the face of the teacher as he shout up at the growing Stephen as his massive looming shadow now dawned over the tiny teacher. \"Please Stop! Oh God I'm getting smaller!\" A panicked Mr.Jackson proclaimed as Stephen had gone from a towering figure to a gigantic titan for his feet could flatten city blocks with ease as use some of the world tallest and most impressive skyscrapers as mere tooth picks. <br>\r\n<br>\r\nSmaller and smaller Mr Jackson dwelled  at the presence of an ominous Stephen. \"YOU ARE NOTHING TO ME!\" Stephens voice boomed from above. To the view of Mr. Jackson it was difficult to see over the Stephen black runner that now towered menacingly over head.<br>\r\n<br>\r\nHe couldnt see the titanic face of Stephen but his laugher shook the ground as a large chill ran up his now teeny spine he was about one millimetre in hight maybe smaller. The stood between the feet of a troubled teen that was now like a God to him. He had given up hope..,,,    </span></div></div>",
            "created":1342933200,
            "id":1386147,
            "title":"You will shrink smaller!"
        },
        "111112":{
            "author_id":"mote",
            "author_name":"Mote",
            "choices":[
                "In a flash, you return to your original scale!",
                "The world starts stretching out rapidly once more!"
            ],
            "content":"<div class=\"\"><div> <span>Stephen grinned wickedly as he braced his hands on his knees, stooping low over the teacher that had harried him for so long. <br>\r\n<br>\r\n\"Actually, I think I have an idea. Since you seem to think you're an expert on gods and I'm a god now, I may just keep you around. My own personal advisor. . . \"<br>\r\n<br>\r\nYou almost manage to let out a sigh of relief at that, your hand instinctively moving towards your heart, before Stephen cracked a wide smile, rocking on his well worn sneakers, the ground seeming to tremble under your feet.<br>\r\n<br>\r\n\"I just have to decide, are you more useful to me at your original size?  Or the size of an actual germ. . . </span></div></div>",
            "created":1516510800,
            "id":2443316,
            "title":"Have another idea for this microscopic slave"
        },
        "11112":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Shrink Mr.Jackson even more inside his shoe",
                "Do something with this maths class for GODLY enjoyment "
            ],
            "content":"<div class=\"\"><div> <span>\"Slave!\" Stephen bellowed from above. Mr.Jackson gazed up his hands and knees violently shacking in sheer fear of the titanic boy in front of him. He breathed heavily as he isn't fully recovered from the immense weight of Stephens foot from above crushing him nearly to death. \"Yes my Lord Stephen\" He said thus falling to his knees too weak to stand. \" Hahahahahahaha!\" Stephen boomed from above as he pinched the inch tall teacher flinging him high in the air until reaching a abrupt stop face to face with his 'master' Stephen. <br>\r\n<br>\r\n\"Enjoy the ride with my toes!\" Stephen giggled as he slipped off his stinking runner and dropped the poor teacher in there. He gazed out the hole as he could hear Stephen evil menacing laughter of dread boom and echo in the vast cavern that was this 13 year old boys well worn runner. The light suddenly eclipse as he huge set of ties rolled into the shoe causing a sudden panic as Mr.Jackson raced to the end of the shoe but was rapidly caught up with the toes thus throwing him the the tip of the shoe compressed between the thick leather and the damp salty cotton that layered his toes and foot.  A wiggle of Stephen toes caused more pain to the teacher as he was shifted up then down in the shoe. Then the worst part, Stephen started to walk to his next class with the miniature teacher incased in a sweaty prison of salty and rank odours and complete darkness and fear. He could have used his powers todo Much more but enjoyed the squirming and futile struggling his tiny teacher had to over as he screamed for attention and tried to escaped his leathery prison. The thick cotton fibres before him recked of serious sweat as they where drenched with it, he doubted Stephen had changed his these socks for a few days! He was in pain but the whole fear of dying under giant brats toes produced vast amounts of adrenaline as his eyes tried to gain clarity. He violently coughed and gagged as the shoe was beginning to heat up as Stephen took off in a quick walk to his next class tossing the poor teacher violent up and down like dining mixing a bowl of salad. He screamed in pain and fear despritly for help, to get noticed but his small little voice didn't even reach out side of Stephen massive runner as he took his seat for another boring class the earthquake like movements stopped as another class begins.. <br>\r\n<br>\r\n  Meanwhile back in reality of normal had take Math next. \"What a drag\" he said. He entered the room to stop the class that had already begun as his teacher paused on his entrance but did nothing about him as he had givin up with Stephen years ago. As he as he took the furthest seat from the top of the class room. Lying casually at the back mess with a pencil and wiggling his toes causing a sweaty hell for Mr. Jackson he looked up to see the board filled with numbers as Mr.Lucy droned on and on. He wanted to be entertained after all he was a GOD!<br>\r\n<br>\r\n     </span></div></div>",
            "created":1341637200,
            "id":1373664,
            "title":"Spend the rest of the day in my shoe!"
        },
        "113":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Shrink entire school!",
                "Try to grow bigger",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The teacher is in utter panic as he only is the size of Stephan's shoe <br>\r\n\"Smaller you piece of shite!\" Stephan shouts hand slamming his foot down causing his helpless teacher to his knee's <br>\r\n<br>\r\nThe teacher now looked up the site of stephan was gone now all he could see was the was black shoe that was starting to tower over him and seconds later it did! No flea sized the curve of the shoe was towering over head something an inch high was now miles in height. The teacher in awe at the sight but started to remember that the block of rubber and leather is a gigantic troubled child that would take every moment to bring you down now was towering over your teeny body. Then massive echoes like from the heaven of stephan laughing and slowly slide is massive toes out of is shoe. The teacher knew his faith and started to run as fast as he could but there was no stopping Stephan's godly foot. A massive shadow desended on the teacher there was no where to run and was stepped on by stephhans sweaty foot! <br>\r\n<br>\r\n\"That was fucken class!\" Stephan looking at the tiny dot of blood that was his splattered teacher body<br>\r\n<br>\r\n\"Now I want more I will Rule!!!!\" Stephan shouts <br>\r\n<br>\r\nBut he stops to think what next for Steve<br>\r\n </span></div></div>",
            "created":1285822800,
            "id":966144,
            "title":"Flea sized!"
        },
        "1131":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Go with plan and shrink everybody",
                "Shrinks the whole school itself!",
                "Change of plan?"
            ],
            "content":"<div class=\"\"><div> <span>Stephan but his shoe back on and stormed down to the principles office. Stephan having an evil grin on his face. He strolled down the hallway until he was at the door with big capital letters saying principle  on it. Stephan did knock just threw the door open and walked in. The principle wasn't too shocked about Stephan's respect so ignoired his entrance.<br>\r\n<br>\r\n\"Stephan what did you do this time Stephan smash a widow, Not do your homework....\" The principle went on and on until Stephan start to giggle and he looked up.<br>\r\n<br>\r\n\"What's so funny?\"<br>\r\n<br>\r\n\"I want you to make a notice for everybody in the school to go to the gym in 15min sharp\" Stephan demanded<br>\r\n<br>\r\n\"Ha ha! No, why would I do that ?\" The principle said no getting feed up of him.<br>\r\n<br>\r\n\"Because I can do!\" then suddenly the principle shank half his size and Stephan simply picked him up.<br>\r\n<br>\r\nThe principle was in utter fear!<br>\r\n<br>\r\n\"No I will only return you if you make an announcement to everyone to meet at the hall in 5min sharp\" Stephan said and quickly the 2foot principle agreed.<br>\r\n<br>\r\nFew Mintues later....<br>\r\n<br>\r\n\"Ok that's done now change me back!\" <br>\r\n<br>\r\n\"Good luck with that\" Stephan then shrunk his already small principle to the flea size Religion teacher. Then he gently pick him up and Stephan opened his mouth and Tongue out. The teeny principle beg and beg but was drop onto the simmering hot Tongue and the swallowed whole to be digested in his stomach acids! A little giggle was let out of Stephan having a deadly plan in store.</span></div></div>",
            "created":1285909200,
            "id":966480,
            "title":"Principle's Office"
        },
        "11311":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Stephan  forces everyone into worshiping him",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span>There was over 900 people all crammed into the schools sports hall. They all thought there was an assembly they all didnt think what would happen next. There was a few gasps as Stephan walked out onto the stage and got everybodies attention.<br>\r\n<br>\r\n\"Well hello all me loser class mate's Im now your ruler everything I say is law and this school is my very own dictatorship and everybody will worship me\" Stephan make a speach everybody is looking at him like what the hell?<br>\r\n<br>\r\n\"Well I haven't made myself clear what about this!!<br>\r\n<br>\r\nSuddenly massive of blue shock waves shout out of Stephan's body. Everybody around the 13 year old shrank even smaller then the size his first two victims to about 0.2 mm mare specks to Stephan. Everything went quit there was just under 1000 people there 10 seconds ago now nothing, then Stephan's laughed and laughed each time louder and echoing across the room. <br>\r\n<br>\r\n\"Worship your new God! I am your new Jesus Christ, Im your ruler! Stephan took his shoes and socks off his sweaty feet and wiggled his toe's abit in glee. Stephan stood proudly and liked it. Nobody telling him what to do and all his micro people to worship and obey him.<br>\r\n<br>\r\nThen Stephan jumped off the school stage and killed  a dozen people already between his toes and just stood there in awe in what he had done but the shrunken school member where in more awe as Stephan would be 80 miles tall to them. The people at the back of the hall could see Stephan clearly but closer to him people could barely see his toes! Stephan was a godly sight to be see but then......</span></div></div>",
            "created":1285995600,
            "id":967027,
            "title":"School Assembly "
        },
        "113111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Brings them home",
                "More shrinking ahead!"
            ],
            "content":"<div class=\"\"><div> <span>Stephan looks at his foot. A few small dots of red scattered around on his left foot. Stephan lowered the foot down and looked all around the hall. Never in his whole life had he been so crazed and powerful. It felt great for Stephan a person that his run on sheer power and lust for more. Stephan looked at the barely visible students they where running for the lives from Stephan but suddenly  he snapped his fingers. In a flash the minute the connection of his fingers everybody on the floor flew across the room to the feet of Stephan. The larger group of people all at the toes of Stephan measured only the size of a 15cm ruler and dept of 5cm the students older and younger then Stephan all started to<br>\r\nworship Stephan bowing, praying and chanting his name. This barely reached his ear dozens of miles away but knew that he had now took full control. The people that where mostly young as 11 up to 18 year old all feared Stephan a begged them for safety and protection. For a full 10 minute there was silence. Stephan stood alone in the massive gym but looking closely at the boys feet there was a odd blur. But under a microscope this was a large group of people! Stephan didn't take his eye's off them for a second. The Stephan broke the silence with a deafening evil laugh that reach the entire room not just the millimetre tall people at his titanic toes. Stephan knew what he was going todo next.</span></div></div>",
            "created":1293512400,
            "id":1023988,
            "title":"Stephan  forces everyone into worshiping him"
        },
        "1131111":{
            "author_id":"tinybug94",
            "author_name":"TinyBug94",
            "choices":[
                "Gets home for some fun",
                "Gets to excited and plays with them on the way home"
            ],
            "content":"<div class=\"\"><div> <span>Stephan looks at his watch and smirks \"Well it's home time runts\" as the schools bell rings out to signify home time. The students and staff rise and gulp as Stephan steps forward his foot steps boom and the schools pupils panic... \"I said its home time like guys so your coming with!\" Stephan pulls his lunch box out and throws a rotten apple core and half eaten sandwich leaving the clear case empty. He snap his fingers and teleported them all to his box.<br>\r\n\"Do I don't be scared little guys your in good hands\" as Stephan burst out laughing as he threw it into his bag and walked home... Leaving hundreds of the tiny pupils screaming watching the school buses and parents wait outside for the kids... <br>\r\n</span></div></div>",
            "created":1427778000,
            "id":1956900,
            "title":"Brings them home"
        },
        "11311111":{
            "author_id":"marsanr",
            "author_name":"Donotkw",
            "choices":[
                "Crush them",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Stephan finally arrives to his house ready to have some fun with his tiny toys, but just when he is about to get to his room, he hears something that interrupts him, “where do you think you are going?”, when he turns he sees his mother and his little sister with a mocking smile, “I’m just going to my room” Stephan replied, “oh no young man, your sister told me about everything you did yesterday, and I want to have a very serious conversation with you about that”. Stephan was getting angry, why does he have to hear all this when he was a god? He didn’t have to obey this bitch any more, “I don’t have time for this shit” Stephan said, “what the hell did you jus...” his mother wasn’t able to finish what she was saying when suddenly she and her daughter became half of an inch tall at the feet of his now godly son. Stephan removed his shoes and socks from his feet, then he raised his barefoot upon the tiny women, “Hey mom, you don’t seem so frightening any more, you actually are fucking puny and worthless to me now, and I can do whatever the fuck I want with you little shits” Stephan wiggled his toes scaring the shrunken girls, but now he has to decide what to do with them? </span></div></div>",
            "created":1556032440,
            "id":2648946,
            "title":"Small inconvenience "
        },
        "113111111":{
            "author_id":"marsanr",
            "author_name":"Donotkw",
            "choices":[
                "Stephan plays with his preys",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>\"And I think that I kind of fucking want to crush you\" Stephan laugh as he began to lower his foot towards his mother and sister, \"please son don’t do this, we are your family we love you so much\" his mother beg as his sister cried \"you’re nothing but ants, that’s what you’re, and you know that I like to squish ants\" Stephan continue laughing and toying with them, then, his sister tried to run away, but Stephan quickly moved his toes, blocking her way \"there’s no escape from me you stupid bitch\" he began to lower his big toe into his sister \"no please, don’t kill her!\" His mother cried, but the cruel, uncaring giant continued applying pressure, enjoying as his sister cried in agony, and then \"crunch\" his sister was transformed in to a red stain under his toe \"NOOOOO!\" What the only thing that his mom could say after watching her little daughter been crush by her son, then she turn her head up, just to watch the big feet of her god son been lowered into her, she was completely broken and couldn’t do anything about it \"fuck, this is turning me on so much\" those were the last words she hear from his son when finally the foot came down, and just like that’s, she was gone. A bulge began to grow in Stephan school pants, so he couldn’t wait to use the shrunken classmates to satisfy his needs.</span></div></div>",
            "created":1577459820,
            "id":2765312,
            "title":"Bye bye family "
        },
        "113111112":{
            "author_id":"marsanr",
            "author_name":"Donotkw",
            "choices":[
                "He knows what to do",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Stephan was tempted with the idea of crushing his mom, but, he thinks that they are a lot of things that he can do to her an his sister  just for fun, so to prove his power, he wants to force them to worship his feet. “Ok mom, if you and my stupid sister wanna live, you will have to do everything I say, first, for now on you have to call me master or god, and your first task it’s to worship my feet, I want you to lick, kiss and massage my perfect and smelly feet”. At first the tiny girls didn’t obey, they were saying something and using his powers Stephan was able to hear what his mom was saying, “son, please don’t do this, we’re your family, I now that there is good inside you, so please...” before she can finish Stephan interrupts her, “shut up you bitch! You are not my family, you’re a pathetic little slut, so do what I said or I will crush you like the fucking ant that you are”. Stephan sat on the floor and then put his immense bare soles in front of the tiny ladies, who defeated, started to work on his feet, Stephan felt absolutely powerful seeing his mother and sister shrunken and worshiping his feet, for years his mother was very bossy with him, but now he held absolute power and domination over her life, and that felt pretty good. “Oh mommy, you always wanted to control and ground me, and even if I never give a shit about that, I think that this is perfect for you, being nothing more than my foot slave will show you who is charge and that you are just a little piece of crap” after saying this Stephan began to feel a strange sensation coming from his underwear, only a year before he wouldn’t know what was happening, but now, this cruel preteen was more than conscious of the things happening on his underwear and what to do with them, so when he started to feel that, he smiled...</span></div></div>",
            "created":1556466240,
            "id":2651687,
            "title":"Dominating his family "
        },
        "113112":{
            "choices":[
                "went to his brother's school",
                "Went downtown"
            ],
            "content":"<div class=\"\"><div> <span>Stephan lifted up his foot and placed it over where there had been a large number of people. He pressed down and barely felt the splatter of blood or cracking of bones of the victims. He could have them worship him, but what good were the little shits anyway? <br>\r\n<br>\r\nPeople fled everywhere, but with simple hand gestures he “magically” pushed them into a large pile, which was still small enough to fit under his foot completely, but that would be too easy for them. They needed to suffer.<br>\r\n<br>\r\nHe walked over to the pile, turned around and sat on it. He felt them all squirm underneath his butt, which he rubbed forward-and-back and side-to-side. The tiny people had no value to Stephan. They weren’t gods, but he was.<br>\r\n<br>\r\nAfter a while he lost interest and …<br>\r\n</span></div></div>",
            "created":1370926800,
            "id":1609477,
            "title":"school massacre"
        },
        "11312":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "He picks it up while he decides whether to keep it",
                "He crushes it underfoot"
            ],
            "content":"<div class=\"\"><div> <span>Stephan had finally had enough of his school. The mind-numbingly dull lessons, the patronising teachers, the dumb kids - especially the older ones who thought they could push him around. But no more! Things were about to change and the Principal's announcement meant that everybody was neatly collected in one place.<br>\r\n<br>\r\nInstead of going to the hall Stephan headed out through the entrance. He walked to the school gate and turned round to look one last time at the various buildings outlined against the sky. Then there was a flash as Stephan clicked his fingers and exerted his power once more. In an instant all the buildings had vanished; all that could be seen now was a neat rectangle of earth, several hundred feet across, where the school had once stood. Stephan climbed down and strolled lazily across the exposed soil. His keen eyes picked out a small object sitting exactly at the center of the rectangle. He reached the little thing and stood over it, positioning himself so that he had one foot on either side of it. The soles of his sneakers dwarfed the tiny object completely.<br>\r\n<br>\r\nIt was the school. The little cluster of buildings, along with the playground, car park, and sports field had been reduced to a size not much bigger than a postage stamp. The whole thing was easily small enough to fit comfortably in the palm of his hand. And inside were roughly 1000 teeny people.</span></div></div>",
            "created":1295758800,
            "id":1040688,
            "title":"Shrinks the whole school itself!"
        },
        "113121":{
            "author_id":"quagmire69",
            "author_name":"NinjaHound13",
            "choices":[
                "In pocket ",
                "Somewhere else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should I put it in my pocket? </span></div></span></div>",
            "created":1486443600,
            "id":2274640,
            "title":"He picks it up while he decides whether to keep it"
        },
        "1131212":{
            "author_id":"quagmire69",
            "author_name":"NinjaHound13",
            "choices":[
                "On/in his body ",
                "Something else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about somewhere on or in my body?</span></div></span></div>",
            "created":1495083600,
            "id":2321365,
            "title":"Somewhere else "
        },
        "113122":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Go on a shrinking rampage around town.",
                "Has another idea!"
            ],
            "content":"<div class=\"\"><div> <span>Smaller Stephen thought to himself as he watched in hellish delight as the school diminished and whittled away in front of his shoes now becoming more and more ominous compared to this now worthless school! <br>\r\n<br>\r\nThe crowed sports hall echoed with chatter as the students discussed what was so important for the principle to suddenly call this meeting. The school faculty and teachers also discussed the same topic as there still was no sign of the principle. The students where delighted with the lateness of there principle as 20mins had surely arose as the teachers started to grow inpatient with there boss after all they had classes to teach! <br>\r\n<br>\r\nThere was a sudden rumble and the concert wall of the entire school shock like it had been hit by an earthquake. The jolt sent a ring of frightened whines and screams from the students and teachers like-wise.... They opened the emergency doors as the escaped the large complex until to be be greeted with a black leather school shoe that towered high above anything they had ever seen and it's sheer dimensions making the school the mere size of a gain of sand. High above the sight aren't everyones spines chilling as the glee filled face of Stephen miles above titanically gazed over the teeny school that lay between the two gigantic shoes of the \"boy-god\". A bully to some, a trouble make to many and now a god for all as he knelt down and face took aim on the micro-sized school campus. Screams ran out as people began to panic as a snigger from Stephen that then shifted back but to his towering full height. <br>\r\n<br>\r\n\"You know I never really like anyone of you little losers and now your going to end up under my big giant shoe!\" Stephen gloated as he took one step forward as his left shoe came close to the school as it cause the school to violently shake as some walls behind them collapsed and lights feel from the roofs but they where to fixed on there pending death as the force of shoe made may tremble to there knees. Tears  rolled down many peoples eyes as various people prayed to various gods as the sky went black. Stephens shoe could flatten large cities with ease and this mere grain of cement, steel and human was no exception as he dangled his foot for a few seconds,imagining the happening underneath  it. He shifted his pressure as the shoe hit the brown soils underneath as he rubbed the shoe back and forth like stepping on a cigarette butt. He smiled with delight, all his teachers gone!, annoying classmates gone! The works HIS! He thought as he slowly emerged from the pit created by the shrinking of the school now deep inside the groves of his shoes sole. Stephen smiled at what he accomplished looking at the muddy shoe....  </span></div></div>",
            "created":1353301200,
            "id":1471244,
            "title":"He crushes it underfoot"
        },
        "1131222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Okay! Let's get to imprisoning innocent people!"
            ],
            "content":"<div class=\"\"><div> <span>Stephan got an idea, an idea that's beyond cruel! He would do the same thing, only bare foot! This in itself wouldn't be overly cruel, but he had the power to imprison people IN his foot, under several layers of epidermal skin, where they retain their sight and hearing, though muffled, but also their hearing, smell and taste. What this means is that the trapped people will be able to look outwards from Stephan's foot; they will be able to communicate with him, assuming he talks to them; they will have to perpetually smell his smelly feet, and they will perpetually have to taste of his dirty feet!<br>\r\n<br>\r\nThat was what you plan to do, but you have already destroyed this school. No problem, you can just walk to the next school. </span></div></div>",
            "created":1372914000,
            "id":1622718,
            "title":"Has another idea!"
        },
        "1133":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "He starts playing with his little \"toy\" city",
                "He decides to shrink it down even further",
                "He places it down on the floor next to his feet"
            ],
            "content":"<div class=\"\"><div> <span>Stephan was delighted with his new-found power. He could now shrink down anybody he chose with a mere thought. And make them not just small, but <i>incredibly minute</i>, microscopic even. For a kid that age the thought was utterly intoxicating. All the people who bored or annoyed him, anybody who caught his eye, all completely in his power!<br>\r\n<br>\r\nThen an idea suddenly popped into his head.<br>\r\n<br>\r\n\"All the people...\" he murmured with a sly grin on his face. \"I wonder exactly how many people I could shrink down and capture, just by thinking about it...\"<br>\r\n<br>\r\nTen? A hundred? A thousand? More!?<br>\r\n<br>\r\nAs he continued to daydream his thoughts returned to one of his earlier classes: a particularly boring one on geography and economics.<br>\r\n<br>\r\n\"Perfect! I know exactly how to liven things up!\" he smirked. Then he concentrated and snapped his fingers.<br>\r\n<br>\r\nInstantly Stephan was back in that earlier class, sitting on his own at a desk at the back of the room. He looked around, but nobody seemed to have noticed anything unusual. His new god-like powers had brought him back without any disruption.<br>\r\n<br>\r\nIt was just as boring as the first time he sat through it. The teacher was droning on about New York and its role as a economic and tourist center, how many people lived and worked there, and blah, blah, blah...<br>\r\n<br>\r\nSo instead of listening to the man's useless speech Stephen held his hand out in front of him and concentrated...<br>\r\n<br>\r\n* * * * * *<br>\r\n<br>\r\nThe inhabitants of New York were going about their lives as usual when there was a sudden rumbling sound and the ground began to shake. Before they could react properly there was a flash of light. As it faded they realised that the sun and sky had disappeared, to be replaced by a featureless grey expanse countless miles above them. The light now seemed to be coming from long glowing strips stretching along this strange expanse, but they were simply too far away to be seen clearly. Before they could speculate further another impossibly huge shape rose above the skyline, blocking everything from view. As the shadow fell over the city millions of people started screaming....<br>\r\n<br>\r\n* * * * * *<br>\r\n<br>\r\nStephan smiled as he looked down at his hand. It was no longer empty. There, in the middle of his palm was a teeny grey and silver shape, no more than an inch across. He brought the little thing up to his face for a closer inspection. It was incredibly tiny, but he could make out intricate little patterns running across its surface like grids. There were even a couple of minute strands of blue to be seen. Stephan glanced up and compared those patterns with the map of the city that was on display at the front of the class. It was a perfect match. His plan had worked. He now had the city of New York and its millions of inhabitants cupped in the palm of his hand!<br>\r\n<br>\r\n\"Time to meet your new God,\" he whispered. His clear blue eyes glittered with excitement.<br>\r\n</span></div></div>",
            "created":1292389200,
            "id":1015877,
            "title":"He decides to shrink a whole city full of people"
        },
        "11331":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "He transports the teacher and class into the tiny city",
                "He shows the teacher *exactly* what he has in his hand..."
            ],
            "content":"<div class=\"\"><div> <span>The teacher is still busy with the lesson with the rest of the class watching him. Stephan can hardly keep from laughing at the thought that none of them realises that the subject of the lesson - one of the world's largest and most important cities - is actually just a few feet away from them, reduced to the size of a toy. The teacher has a larger audience than he could possibly imagine!<br>\r\n<br>\r\n\"Don't worry, I've got you all to myself,\" the boy sneered down at the terrified inhabitants. \"I could crush you...\" - he starts to close his hand around the micro-city, causing huge chunks of land and entire neighbourhoods around the edges to break apart and crumble, falling down into the deep canyons that are the lines running across his palm - \"...or I can keep you as slaves. Or maybe snacks.\" The boy licked his lips dramatically.<br>\r\n<br>\r\nBut instead the boy-god contented himself with merely picking up a pencil and using it to start poking at the tiny city. Everything he touched with the pencil tip was obliterated: houses, office blocks, roads and bridges.<br>\r\n<br>\r\n\"Man, you microbes sure don't know how to build properly. Look how fragile all your stuff is\"<br>\r\n<br>\r\nStephan held the teeny tiny city up to his lips and blew gently on it. A stream of barely visible particles of dust drifted over the edge of his hand to fall down onto the desk or onto his crotch. They were crowds of microscopic people, thousands of them, along with their vehicles and homes. <br>\r\n<br>\r\n\"Heh, I guess you can't handle high winds either. Hope you know how to deal with floods\"<br>\r\n<br>\r\nThe boy started gathering a ball of saliva ready to drop down onto the miniaturized city, but before he could do so - <br>\r\n<br>\r\n\"STEPHAN!\"<br>\r\n<br>\r\nIt was the teacher. He'd finally noticed that Stephan had other things on his mind. The other kids all turned round in their chairs to look at him.<br>\r\n<br>\r\nThe teacher smirked arrogantly at him, always ready to humiliate any student who tried to fool around in class, and spoke to him with exaggerated politeness.<br>\r\n<br>\r\n\"Well, Stephan, perhaps you'd like to share with the rest of the class exactly what you think is more deserving of your attention than today's lesson?\"<br>\r\n<br>\r\nOn previous occasions Stephan might have given a surly and reluctant response, but not today! Today he could do anything!<br>\r\n<br>\r\n</span></div></div>",
            "created":1292389200,
            "id":1015886,
            "title":"He starts playing with the tiny city..."
        },
        "113311":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Tourism: he shows the city to his friends (or brother).",
                "Economy: he compares the city with some coins from his pocket"
            ],
            "content":"<div class=\"\"><div> <span>Still holding the tiny city of New York casually in the palm of his hand, Stephan put on his most innocent expression as he answered the teacher.<br>\r\n<br>\r\n\"I was just thinking about the lesson and how much more interesting it might be if we could take a trip to the city to see it all for ourselves.\"<br>\r\n<br>\r\nThe teacher frowned. He'd been expecting a more insolent reply from the teenage troublemaker, but his response suggested he was actually showing some kind of interest in the lesson for once. Still, he couldn't let Stephan get the better of him in front of the other kids, <i>and what was he holding in his hand anyway?</i><br>\r\n<br>\r\nDeliberately making his tone sound as patronising as possible the teacher answered:<br>\r\n<br>\r\n\"Well, Stephan, I'm sure we'd all love to take a trip out to the city to see the sights and enjoy ourselves, but you know full well that the school doesn't have the money or resources to send a whole class to New York just because one kid thinks it might be a good idea.\" He chuckled and the rest of the class laughed obediently along with him. \"Now, what is that you've got in your hand?\"<br>\r\n<br>\r\nInstead of blushing with embarrassment as the teacher had intended Stephan grinned broadly.<br>\r\n<br>\r\n\"What, this little thing? Oh, it's nothing much. I just thought that if it was too difficult for us to go to New York, then maybe I should bring the city here instead.\" The thirteen-year-old looked down at the terrified little metropolis with a look of amusement. \"I thought you said it was supposed to be a really big city. It looks pretty teeny to me. I could probably squash the whole thing under my thumb.\" Still smiling, Stephan looked back up at the teacher, waiting to see his reaction.<br>\r\n<br>\r\nSure enough, it was the teacher's face that started to flush, first from confusion, then with anger. Just what was this dumb kid playing at? He peered more closely at the tiny object that Stephan was holding out for him to see. It was irregularly-shaped, ragged around the edges like it had been ripped out of something larger, but there was something about it.... It was almost too small to notice but was one shape that looked almost like Manhattan.... and that minute speck of green - it was in just the right place to be Central Park! It couldn't be... the boy had to be playing some kind of joke on him!<br>\r\n<br>\r\nStephan smiled again. \"Maybe you should take a closer look. Hey, why don't you show the rest of the class around?\"<br>\r\n<br>\r\nBefore the teacher had a chance to respond the boy had snapped his fingers. There was a brief flash and he found himself standing somewhere completely different. Completely disorientated, he looked around and saw the rest of the class nearby looking similarly dazed. Stephan, however, was nowhere to be found. Then the teacher looked up and gasped in surprise: they were standing on Liberty Island, at the base of the Statue of Liberty! However, something was badly wrong: the statue appeared to be damaged, with chunks missing and cracks running across its surface. The water around the island was unsually turbulent, almost as though it was draining away somewhere. He could even see a large cargo vessel being pulled along helplessly by the current. All around the city he could see damage. The skyline had been reshaped, and there was a huge groove running through the middle off into the distance, as though some colossal object had touched down and scraped a line through the city.<br>\r\n<br>\r\nA sudden rumble of thunder and a blast of hot wind caught his attention and sent the students into a panic. The teacher looked up to see Stephan's face smiling down on him! He was simply <i>colossal</i>! The teacher couldn't even begin to guess how big he must be, but from a comparison of the tallest skyscrapers with the size of the boy's lips he had the uncomfortable feeling that the entire city could be casually placed inside the teenager's mouth like a small piece of candy!<br>\r\n<br>\r\nThere was another rumble of thunder: it was Stephan laughing. Then the boy spoke, his voice almost deafening in its volume.<br>\r\n<br>\r\n\"You see, I told you I'd bring New York to you! Guess it's too bad I had to shrink you down to fit you inside it, but I have to say it's pretty awesome being able to hold an entire city in my hand like this!\"<br>\r\n<br>\r\nThe teacher didn't reply. Instead he felt his legs turning to jelly with utter fear. He thought about just how tiny that \"thing\" in Stephan's hand had been. Definitely no bigger than an inch across, maybe even smaller... And that little trinket had been New York!? His throat tightened up as he tried to imagine all the people who lived in that city, how tiny they must now be. How tiny <i>he</i> must be! Millions of humans, reduced in an instant to microscopic scale! And this boy, Stephan the troublemaker, was now like a god to them! He could do anything...<br>\r\n<br>\r\nThe boy-god spoke again: \"I think we should continue the lesson now. Maybe things will be a bit more interesting! What was it you were talking about? Tourism and economy? Which one shall we choose?\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1292562000,
            "id":1016820,
            "title":"Microscopic school trip"
        },
        "1133111":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Stephan gets home and torments the tiny city even more",
                "Stephan decides to collect a few more \"playthings\" on the way..."
            ],
            "content":"<div class=\"\"><div> <span>With the teacher and the other students now reduced to microscopic size and trapped inside the stolen metropolis there was no reason to remain at school for any longer. Stephan was the one now in charge and ready to teach the entire world a lesson...<br>\r\n<br>\r\nFor a brief moment he considered showing his new toy to some of his friends so they could play with it together - but only for a moment. Gods are capricious - especially ones that are 13-year-old kids - and Stephan had already changed his mind about what he was going to do with what was now the tiniest city on Earth. Perhaps he would invite his friends round later, but for now the teenage megalomaniac planned to give his captives a special guided tour of their new home - his bedroom!<br>\r\n<br>\r\nIn theory Stephan could have used his new powers to transport himself home with a mere snap of his fingers, but he wanted to take the opportunity to humiliate his pets further so he strolled along the corridor to where his locker was situated. When he got there he found a couple of jocks that had cornered some poor dork and were about to beat him up. A couple of seconds later the bullies found themselves standing in the vast expanse of the corridor floor, staring up at a pair of towering sneakers. Stephan scooped up the two terrified half-inch tall boys and handed them to the dork, telling him: \"Here, do whatever you want with them. Crush them; eat them; feed them to your goldfish; anything you like. But if you tell anybody else what happened then you'll find yourself ending up the same way...\" The dork didn't need to be told twice. He flashed Stephan a shy smile of gratitude and wonder, then scampered off down the corridor, dropping the two tiny jocks into his pocket as he went.<br>\r\n<br>\r\nFinally alone, the boy-god opened his locker and took out his sports bag. He'd had a gym class earlier and his kit was inside. It was a particularly warm day and the exercise had taken its inevitable toll: as Stephan unzipped the bag the smell of perspiration and stale running shoes rose like a cloud of pollution from a poorly-maintained power station. Taking the teeny city of New York between his thumb and forefinger he carefully placed it deep inside one of the sneakers. \"That should keep you safe - at least for now\" he muttered with satisfaction. Then it occurred to him to stuff something into the opening of the sneaker, just for extra \"protection\". He picked up a sock - and then had a better idea. Apart from the shoes the main source of the aroma was his white sports shirt with its two dark, telltale stains of moisture under the armpits. Stephan folded the shirt so that one of the stains was outermost and then pushed it into the opening of the sneaker contained the city. Already cowering in the near-darkness of the footwear, the surviving population could only watch in terror and disgust as the sweat-drenched fabric, covering an area far larger than the entire city, descended and came to rest almost touching the tops of the skyscrapers. As the temperature and humidity quickly rose to unbearable levels the bag was zipped shut; the metropolis was rocked by earthquakes as the sports bag was lifted up and casually slung over the boy's shoulder.<br>\r\n<br>\r\nPausing briefly to crush underfoot a teacher who challenged him for leaving without a pass, Stephan walked out of the school and slowly made his way home. Much to his satisfaction he soon noticed the people around him talking in shocked tones about the sudden mysterious disappearance of New York. Passing by an electrical store he noticed the television sets in the window were all displaying the breaking news, with aerial images of the barren landscape where an entire city had once stood. Stephan could hardly keep from laughing at the thought of how the missing city was closer than anybody could imagine: he had <i>millions </i>of people inside his sports bag, now his own personal playthings, just inches away from the rest of the world. He could hardly wait to get home to toy with them all...</span></div></div>",
            "created":1312434000,
            "id":1161605,
            "title":"Stephan carries off the tiny city..."
        },
        "11331111":{
            "choices":[
                "Stephan Takes His Shoes and Socks Off For Some Worship",
                "Stephan Does Something Else Godlike"
            ],
            "content":"<div class=\"\"><div> <span>Stephan approached his neighborhood, it was an extremely hot day, and the T-shirt he was wearing was already beginning to show signs of underarm sweat. Inside the sneakers and socks he was wearing, his feet felt like he had walked through a puddle and the water had soaked through his shoes and into his socks. This was not the case however, he was simply dripping wet with perspiration, worse than he was in gym. But through the soaking wet bangs of his hair that were over his eyes, Stephan could see his house, his mom and dad weren't home this early of course, plus it was Friday, so he had all day, and the entire weekend to experience his new status as Stephan: God of NYC.<br>\r\n<br>\r\nOnce he entered through the door with his house key, Stephan sighed and entered the cool air conditioned house. Stephan stood in front of the AC, holding his arms above his head and allowing the cold air to blow his hot pits off. Though by doing this he made himself aware of the pungent odor he was now giving off after his long walk. \"Meh, oh well....I'll take a shower later.\" The young god said to himself as he picked up his bag and bounded upstairs to his messy room, locking his bedroom door behind him and making sure to close the blinds on the window after turning on the light. <br>\r\n<br>\r\n\"Now...lets get down to business.\" Stephan chuckled as he unzipped the bag, pulling out the sneaker with the moist shirt hanging out of it. He pulled the garment out and peered inside with his enormous eye. <br>\r\n<br>\r\nThe people inside were coughing from the mixed reek of armpit smell and built up foot odor, and when the shirt was removed and replaced with Stephan's eye they all screamed in terror and some began pleading. <br>\r\n<br>\r\nStephan looked in upon the pleading New York and chuckled darkly, \"Yeah...I like being begged, keep doing that! And maybe I won't put the shoe on!\"<br>\r\n<br>\r\nAll together, a chorus of voices began pleading in different ways, many of them falling to their knees as if in prayer to the giant thirteen year old. This made the boy's ego swell, he actually had an entire city in his shoe and at his mercy, they were begging him to let them out of his smelly shoe! Stephan finally decided to take them out, and put them to work. <br>\r\n<br>\r\nStephan reached inside the shoe with his thumb and index finger, plucking out the tiny city and placing it on the carpet as he sat high above on his bed. \"Now you puny insects, I've got a job for you!\"</span></div></div>",
            "created":1313211600,
            "id":1167571,
            "title":"Stephan: New York's New God"
        },
        "113311111":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Divine punishment!",
                "More giant footplay..."
            ],
            "content":"<div class=\"\"><div> <span>Stephan paused for a moment, allowing the suspense to build. He knew the entire population must be wondering just what a 13-year old boy could possibly want with a city the size of a single M&amp;M candy. He loved how puny and helpless the tiny metropolis appeared, resting on the giant carpet fibers; it occurred to him that by his captives' scale his room would seem like an entire new world, mysterious and filled with danger. Not just New York, but the entire U.S. could easily fit on the floor of his bedroom like some kind of bizarre model set. \"Maybe later.\" he snickered to himself...<br>\r\n<br>\r\nHe pulled off one sneaker and carelessly let it drop down perilously close to the city. New York was shaken by the titanic impacts as it bounced slightly and came to rest, all too close. Another couple of centimeters and it might have rolled over them.... A few seconds later the other sneaker plunged from the heavens, landing even closer than the first. So close, in fact, that one of the dirt-smeared laces was flung outwards, almost hitting the city and finally settling down almost against its edge. The microscopic population was once more reminded of how truly minute they had become by the sight of the miles-wide lace towering above the skyline.<br>\r\n<br>\r\nThe terror wasn't over. Now Stephan began to remove his socks, one by one. They were so drenched in sweat that he had to <i>peel</i> each one slowly away from his foot. Then they two were casually tossed away, these impossibly huge objects landing in a messy pile that rose higher than any mountain next to the teeny metropolis.<br>\r\n<br>\r\n\"Wow... that's so much better,\" exclaimed Stephan, flexing his toes with delight. His feet felt able to breathe now. However, there were some annoying little patches of lint and fluff left stuck to his skin and the boy knew exactly how to deal with them...<br>\r\n<br>\r\nOnce again New York was filled with the sound of screams as the thirteen-year old's hand descended from above to grab them. The world's most famous city was just a toy, pinched between his thumb and forefinger, as he effortlessly picked it up and held it next to his big toe. Thunder rumbled above them as the city's newest deity spoke his commands:<br>\r\n<br>\r\n\"Listen up microbes: it's hot and my feet need attention. I guess I could just take a shower, but somehow I don't think you'd survive very long if I took you in there with me!\" Cruel laughter echoed through the heavens, and millions of people cringed. New York was not much bigger than a drop of water on its own; nobody wanted to imagine just how colossal and powerful a shower might be...<br>\r\n<br>\r\nBut Stephan continued: \"So what you're going to do is remove all of the crud from on my feet and under my nails. If you succeed then I may reward you. If not.... I may have to reconsider whether you are worthy of a god such as me.\" To demonstrate his point Stephan increased the pressure of his fingertips very, very slightly, making the city shake and groan. It was clear to everybody that all he had to do was rub his finger and thumb together gently and the centuries-old city would be ground into dust in a fraction of a second - just a little smudge of dirt on his skin.<br>\r\n<br>\r\nStephan set the tiny city down on the nail of his big toe: New York was now resting on what seemed to be a huge flat plateau. The edges of the city were heavily damaged from where the metropolis had been torn away from the landscape; countless cars, homes, and people had already fallen off to become lost on Stephan's desk at school; in the grooves running across the palm of his hand; under his fingernails; on his clothing. Like grains of sand (though infinitely smaller), microscopic people were now scattered all over his body. As he absently ran his hand through his hair, another ten or twenty thousand were transferred onto his scalp... Nevertheless, those remaining in the city worked to form impromptu ramps down on the surface of Stephan's toenail; nobody had yet come up with any idea how to move any of the mountain-sized piece of lint, assuming they could even reach them. The miasma of Stephan's feet was almost unbearable, and his skin, glistening with sweat, presented a treacherous, sticky trap...<br>\r\n<br>\r\nStephan, settled himself down in his chair, took out his DS, and began playing. He knew the New Yorkers had no chance of fulfilling his commands, but he wanted some time to relax and think up some suitable punishments for them...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1313211600,
            "id":1167655,
            "title":"Stephan Takes His Shoes and Socks Off..."
        },
        "1133111111":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "He decides to crush them inside his armpit",
                "He decides to eat them!"
            ],
            "content":"<div class=\"\"><div> <span>Stephan finished the game he was playing and snapped shut the DS. It was time to turn his attention to even more pleasant matters. Roughly half an hour had passed and he wanted to check up on the progress of his new, microscopic slaves. He glanced down at his bare foot and smiled at the small grey smudge resting in the middle of the nail of his big toe. Anyone else would have mistaken it for a smear of dirt, but of course it was actually one of the world’s largest and most important cities—reduced to an utterly minute scale, along with the many millions of people who lived in it!<br>\r\n<br>\r\nTaking care not to dislodge the helpless little thing, Stephan leaned back in his chair and eased his foot up onto the desk in front of him so he could get a better look. He didn’t really need one, but for effect he clicked his fingers and a magnifying glass appeared on the desk. The boy picked it up and held it over his nail. Millions of people looked up to see an immense glass shape appear above them, and through it a single eye loomed terrifyingly large, magnified to an overwhelming scale. New York was just a mote by comparison...<br>\r\n<br>\r\nStephan inspected his toenail. The metropolis still appeared so tiny, even when magnified, but he could see now the incredible detail of its layout: countless streets and roads; neighbourhoods and city blocks; skyscrapers and homes. A populated area miles across—compressed into a tiny little patch, smaller than a boy's nail. Next to it was something even tinier: an incredibly faint line, even thinner than a human hair, stretching from the edge of the city to the back of his nail, where a teeny little speck of coloured fluff was stuck. The line was a whole convoy of trucks and construction vehicles. They were so minuscule that they could scarcely be seen, even with the magnifying glass, but there were so many of them that they appeared as a tiny dark thread, stretching out over a distance of at least five miles. Clearly they were heading out to move the speck of lint, but it was simply too immense for them. Stephan chuckled at their futile struggles and decided to help them out. He pursed his lips and blew softly on the lint. It immediately flew off and disappeared somewhere down on the floor. Unfortunately the sudden gust of wind, more powerful than any hurricane, also blew away most of the convoy. Hundreds of trucks and cranes, most of them weighing well over 10 tons at least, were simply carried off like particles of dust. As for the rest... Stephan licked his fingertip and touched it to the patch of nail next to the city. The remaining vehicles and people were instantly snatched up in the powerful adhesive and carried miles into the air. The 13-year old studied his fingertip with the magnifying glass, taking note of the minute dots that had now appeared—and then he lazily stuck his finger into his mouth and sucked it clean...<br>\r\n<br>\r\n“SO!!!”<br>\r\n<br>\r\nThe accusation echoed through the world-sized region. It hardly seemed conceivable that this colossal space was nothing more than a teenager’s messy bedroom, carefully locked so its occupant could have some privacy while playing with his toys...<br>\r\n<br>\r\n“It seems even that modest task was beyond you. I guess I’ll have to punish you after all. Now what would be most appropriate?”<br>\r\n<br>\r\nStephan made a show of pondering the question, even though he already knew exactly what he intended. He wanted to make things as humiliating as possible for the city and its populace.<br>\r\n<br>\r\n“When my dog was a puppy and left a mess we had to train him to stop by rubbing his nose in it. I guess I’ll have to do something similar with you.”<br>\r\n<br>\r\nOnce again the Hand of the Boy-God descended and picked the tiny city as if it was just a little trinket. He placed it carefully in the palm of his left hand: an even larger expanse than the toenail, but covered in large hills and deep valleys. Then with his right hand he reached down and wiped a particularly juicy piece of crud from between his big toe and the next. He compared the piece of toe-jam with the shrunken city of New York: it was actually bigger! Snickering with satisfaction the boy slowly and deliberately lowered his finger towards the helpless city...<br>\r\n<br>\r\nThe people of New York could only look up in terror as the finger descended towards them. In a matter of seconds, the piece of toe-jam filled the entire sky above. They could smell its scent washing over them; they could feel its moist humidity enveloping them like a clammy hand. Closer and closer it came, until it finally reached the tops of the highest skyscrapers. The tall buildings began to sway and crumble under the immense pressure...<br>\r\n<br>\r\nStephan casually began to rub the little piece of crud into the city. He could feel the slight sensation of the city being crushed beneath his fingertip. He was hardly even exerting any pressure, but New York was just so tiny and fragile! He gently stirred the toe-jam some more, mixing it in with the remains of the once-mighty city. The remains of skyscrapers, city blocks and parkland became deeply embedded in the smelly, sticky mass. Millions of microscopic people were now mixed in with it, scarcely more than germs or bacteria. The tiny city had been completely crushed and absorbed by an ordinary piece of toe-jam on the end of a 13-year old boy’s finger!<br>\r\n<br>\r\nEven now, Stephan’s punishment was incomplete. He was still hot and sweaty from the heat of the day, and his t-shirt was clinging uncomfortably to his skin. Wiping the speck of crud onto his knee for a moment, he pulled off the drenched t-shirt and tossed it aside. Stephan snickered: the best part was yet to come. He collected the now-populated toe-jam once more and lifted up his arm, exposing one armpit. He took a careful sniff: it was ripe with body-odor and glistening with sweat. The boy lifted up the piece of crud and wiped it slowly across the surface of his armpit, using it almost like a sponge to soak up every droplet of sweat. Soon the piece of toe-jam had been reduced to an even more soggy, saturated mass; many of the tiny people were drowned, but there were still millions left in the drenched wreckage of New York, trying desperately to survive in the horrific conditions of the boy’s armpit, terrified at what might happen to them next...<br>\r\n<br>\r\n</span></div></div>",
            "created":1313298000,
            "id":1167750,
            "title":"Divine punishment!"
        },
        "11331111112":{
            "choices":[
                "Stephan Speeds Up Time and Makes Himself Reappear in Class the Next Day to Grow"
            ],
            "content":"<div class=\"\"><div> <span>Stephan wiped the glob of sticky, wet, crud out of his armpit using the tip of his index finger, and brought it up to his blue eyes. Any remaining people in his armpit were left unnoticed or uncared for by Stephan as he put his arm down and they were either crushed or smothered. Stephan stared at the miniscule blob stuck to the tip of his finger, knowing he had no more use for NYC now that it was rendered down to a soggy microscopic ball of crud and sweat, this thirteen year old god of size found himself bored with it. Regardless of whether he had the godly powers to undo what he'd done by turning back time for the city, or even snap his fingers and cause the city and all its inhabitants to be placed back where the landmass had been before. Stephan then got a devious, although it would be considered disgusting to anyone other than a young mischievous boy, idea. <br>\r\n<br>\r\nWithout a word, the young god of size opened his mouth and popped the tip of his finger into his mouth, there was so much crud and sweat coating the tiny city, that that was most of what he got as he sloshed the microbes and remaining buildings around his mouth. Still, the satisfaction of what he was doing made the taste not as bad as it would have been normally. Tilting his head back, Stephan swallowed mightily, sighing as he felt a few specks of crud and maybe some people get washed down his throat, he burped proudly and laughed evilly. \"That settles that!\"<br>\r\n<br>\r\nStephan turned on the news, people were still flustered over how New York had just vanished. Feeling in the mood to tease the mere mortals a bit, Stephan snapped his fingers just as the reporter was in the gap left by the missing NYC. Without a sound, the city reappeared, seemingly right on top of the reporter! Stephan laughed so hard tears streamed down his face, the look on the news anchors faces were priceless! What was best was that he'd made sure that the people had no memory of where they'd been! As Stephan wiped a few tears away from his cheek, he got another idea, he put on his shoes, socks and shirt and stepped outside into the fading daylight. </span></div></div>",
            "created":1322283600,
            "id":1229904,
            "title":"Stephan Eats The Big Apple"
        },
        "113311111121":{
            "choices":[
                "Stephan Has Some Fun Once He Reaches His Desired Height of 50 ft.",
                "Stephan Grows So Big That His Feet Can Cover Entire Buildings!"
            ],
            "content":"<div class=\"\"><div> <span>(My Bad, I said it was the weekend in a previous chapter, so pretend that he skips to Monday.) <br>\r\n<br>\r\nStephan didn't even need to concentrate, he just thought it and it was Monday and he was in English class instantly. Smirking, he waited for an opportunity for everyone's attention to be on him, it was only a matter of time, he had purposely made it so that he was late today, the teacher just hadn't bitched him out yet. <br>\r\n<br>\r\n\"Now,\" The teacher turned around from the blackboard and stared daggers at Stephan, \"I'm oh so glad you could take time out of your busy schedule to join us today.\" Sarcasm dripped from the man's voice, and the students snickered as they turned around to stare at the offending student: Stephan O Sullivan. <br>\r\n<br>\r\nStephan simply folded his arms behind his head and kicked his feet up on his desk, which was riddled with crude drawings and curse words. Flexing his toes inside his shoes, knowing that they would all be between them and very sorry they'd ever crossed a god like him shortly. \"Get your feet off of your desk Stephan!\" The teacher, growing red in the face at Stephan's arrogance and how he seemed to be laid back even though he was supposed to be embarrassed in front of the whole class.<br>\r\n<br>\r\nStephan just smirked at the man, the guy didn't like that look, there was something about it that seemed less mischievous than usual and more....sadistic and knowing. \"Hmph...make me, shorty!\" <br>\r\n<br>\r\nWith those words, Stephan's desk began to creak under his increasing weight, the students and teacher stood there dumbfounded as the troublemaker's head smashed through the roof, and his booming laughter could be heard throughout the countryside.</span></div></div>",
            "created":1322283600,
            "id":1229912,
            "title":"Time Skipping"
        },
        "1133111111212":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Stephan decides to work up a sweat by going for a run",
                "Stephan grows again until his feet can cover entire cities!"
            ],
            "content":"<div class=\"\"><div> <span>Still growing, Stephan stepped out of the ruined building and onto the street that ran next to the school. As he expanded parked cars crumpled against his sneakers and passers-by fled in panic. The teenage titan kept a check on his progress by comparing the size of his foot with the main school building, and once he had reached the point where the school could fit completely beneath the sole of one shoe Stephan brought his growth to a halt.<br>\r\n<br>\r\nHe peered down into the little wrecked classroom far below. He could just make out the figures of his teacher and former classmates gazing up in fear and disbelief. Slowly and deliberately, like a parody of a cheesy monster horror movie, Stephan raised one mighty foot and and brought it over the tiny school, casting it into deep shadow. Then, equally ponderously, the foot descended...<br>\r\n<br>\r\nAs the fragile concrete and brickwork began to collapse under the immense pressure the main door was flung open and his former classmates—the only ones with sufficient warning to escape in time—began to spill out into the road. Stephan laughed at the sight and put his full weight down on the school. He heard a slight *crack* as the hated institution was obliterated, followed by a faint cunching sound as he pivoted his foot back and forth, grinding the debris deep into the treads of his sneakers.<br>\r\n<br>\r\nMeanwhile the group of survivors had begun running down the street, desperate to get as far from the giant as possible. Stephan’s other foot abruptly slammed down in front of them, halting their progress.<br>\r\n<br>\r\n“Not so fast, guys! I haven’t finished with you yet!”<br>\r\n<br>\r\nThe boy-god inspected the group with an expression of scorn. “You’ll have to do, I suppose. You were the only ones to get out in time so I guess you must be the strongest and fastest. Survival of the fittest, after all!” Stephan paused for a moment to let his words sink in and then continued. “Don’t worry, I’m not going to squish you—yet—provided you do what I tell you. I have something special in mind!”<br>\r\n<br>\r\nThe giant troublemaker held out one hand and a small glass vial appeared in his palm. He placed it open on the ground and commanded the tiny class to step inside. However, when the teacher moved to follow his students into the gigantic container Stephan quickly pinched him between his fingers and lifted him high into the air.<br>\r\n<br>\r\n“<i>You</i>, on the other hand, are pretty worthless.”<br>\r\n<br>\r\nStephan watched the tiny man squirm helplessly between his thumb and forefinger. He'd hated his Engish teacher ever since the man had humiliated him in front of the rest of the class for reading the wrong chapter for homework by mistake. The young giant’s eyes glittered with malice and the teacher began to shrink, tinier and tinier, until he was nothing more than a minute speck trying not to fall into the canyon-deep whorls on Stephan’s index finger. It was entirely fitting, considering the man had once tried to belittle him, that <i>he</i> should be made to feel as small as possible in front of the others. Stephan watched him struggle for a moment—and then casually dropped him inside the vial along with the students.<br>\r\n<br>\r\nThe titan screwed the lid on the vial, then brought it up to his face to look inside. A couple of his former classmates were yelling and beating their fists against the thick transparent plastic; however, most of the others were now fighting over who got to play with the minuscule, terrified teacher. Stephan grinned at them, then stuffed the vial and its contents inside his pocket as he considered what to do next.<br>\r\n</span></div></div>",
            "created":1322974800,
            "id":1234860,
            "title":"Stephan Grows So Big That His Feet Can Cover En..."
        },
        "11331111112122":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "Stephen modifies the entire Earth to be able to accomodate his growth",
                "Stephen grows with the Earth as-is, even though this may crush the entire planet"
            ],
            "content":"<div class=\"\"><div> <span>\"Looks like summer came a little early this year!\" boomed the 1,000 ft tall boy whose voice could be heard 100 miles away.<br>\r\n<br>\r\nStephen lifted his foot off the wreckage that had once been a school, but was now a boy's footprint compressed several feet down into the earth. Most of his classmates, including some who were his friends, along with his teachers were compacted and dead down below. Those who managed to escape were now trapped in a vial in his backpocket. In a way they might consider themselves lucky, because in Stephen's pocket they were safe from just about anything, which was more than could be said for the world below....<br>\r\n<br>\r\nSchool was in the past, and Stephen turned his attention to bigger and better things. Crushing an entire building full of hundreds of people with his feet was an amazing feeling, and Stephen yearned for more. If crushing one building could be so awesome, what would it be like to crush hundreds of similar buildings at the same time? In order to do that, Stephen would have to get bigger. Much bigger. But before he grew any further, he needed to decide which city he should target.<br>\r\n<br>\r\nThe city of New York (or what was left of it) was slowly dissolving in his stomach acid, so crushing that under foot wasn't an option. Fortunately, there was no shortage of other cities all over the world, but because Stephen was a god, he wouldn't settle for just any city. It had to be the biggest and the best. \"Tokyo!\" Stephen exclaimed as he vanished, much to the bewilderment of onlookers.<br>\r\n<br>\r\nAt the same moment, thousands of miles away, thousands of Japanese found the sun had suddenly been blocked out by an enormous object. As they turned their heads up to see what this was, they began to scream in terror at the sight of a 1000ft American boy grinning down at them.<br>\r\n<br>\r\nStephen was still the same height as he was before he had teleported, but even so he had teleported on top of several apartment buildings and had instantly snuffed out the lives of hundreds of Japanese men, women, and children beneath the soles of his sneakers. Even this many deaths was a great tragedy, but unfortunately for the people of Japan things were about to get much, much worse.<br>\r\n<br>\r\nStephen began wriggling his sweaty toes within his musty old sneakers in delight as he felt the souls of the Japanese people he had crushed become imprisoned for eternity within the sweaty stench of his soles. This was a horrible after life that was worse than any hell that anyone could possibly imagine, but Stephen was a god and he loved to imprison souls within his soles. He was about to send millions more to this horrible smelly fate.<br>\r\n<br>\r\nTokyo was Stephen's target because he was familiar with the Godzilla movies and would often fantasize about what it would be like to be a giant monster attacking Japan. Now he was living this dream, and it felt wonderful. Stephen also learned in school that Tokyo was the world's largest city with over 34 million people. So when it came to cities there was no greater prize in the entire world than Tokyo Japan. If Stephen could grow large enough to crush Tokyo under his foot, then he could do the same with any other city without breaking a sweat.<br>\r\n<br>\r\nBut the Greater Tokyo Area covers a really massive area, so in order to be able to do this, Stephan will have to get big. REALLY BIG.</span></div></div>",
            "created":1345006800,
            "id":1404979,
            "title":"Stephan grows again until his feet can cover en..."
        },
        "113311111121221":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "He keeps using the perspective trick until NA is no bigger than a grain of sand",
                "He transforms North America into a delicious (and still fully populated) cookie"
            ],
            "content":"<div class=\"\"><div> <span>Stephan knew what he wanted to do. However, he was already starting to wonder about the potential problems of getting too big on the surface of the planet - or at least until he finally outgrew it completely and could hold the entire globe comfortably in his hands. Fortunately, he was now a god and didn't have to worry about annoying things such as the laws of physics. All that mattered was visualising in his mind precisely what he wanted to happen and the Universe would somehow adapt to satisfy his needs.<br>\r\n<br>\r\nStephan's school lessons hadn't been entirely wasted upon him. He remembered being told how, centuries ago, people had once believed that the world was flat. \"But what if it really was?\" Stephan wondered. And with that thought he exerted his power and the world immediately began to change. A great fissure appeared in the middle of the Pacific Ocean and the lithosphere slowly began to unwrap itself from the rest of the planet, like an orange slowly being unpeeled. The Boy-God's mind kept the surface more or less stable and intact until the process had been completed; when he was done, what had once been the surface of the planet had been transformed into a flat multi-coloured mat or carpet that stretched out all around him. To keep the oceans, atmosphere, or anything else, from spilling out into space mighty barriers around the edges now held everything in place.<br>\r\n<br>\r\nAnd then Stephan began to grow.<br>\r\n<br>\r\nHe watched in delight as the world diminished beneath him. Making himself large enough to crush the Greater Tokyo Area was almost pitifully easy and he soon realised this wasn't enough. Stephan moved his feet slightly, first positioning himself so that his feet were either side of the metropolis and the population was forced to look up at the towering pillars of his legs rising up into the heavens, and then shifting his feet out into the shallow pool of water that surrounded Japan as he began to dwarf the nation itself. He used the now-tiny islands to measure his rate of growth, stopping when his feet had reached the same length as Japan. Stephan grinned as he imagined how Godzilla might appear to him now. Japan's favourite monster would be nothing more than an infinitesimally small tick or mite, a micro-organism that could only be examined with the aid of a microscope. And as for the even tinier human race...<br>\r\n<br>\r\nDelighting in his total power, Stephan slowly raised his right foot and held it suspended above the Japanese islands, allowing them to see and understand what was about to happen. The nation that had so often fantasized about being devastated by gigantic monsters would now have those fantasies fulfilled by a colossal teenage boy. Stephan lowered his foot, pressing down very gently, enjoying the sensation of the tiny nation being compressed beneath his sole, turned into mud.<br>\r\n<br>\r\nBut as he looked down at what he had just done he noticed a number of minute sparkles around his ankles, and felt a very faint momentary sensation almost like pins and needles. For a moment he couldn't work out what it might be... but then he squatted down for a closer look and realised: he'd just been nuked! The rest of the world had finally stirred itself to take action against him, combining their forces in an all-out nuclear assault! Stephan almost laughed out loud at the futility of their attempt, but it meant he now had an excuse to punish somebody. Titanic beyond belief, he strode across the now-flat surface of the Earth in the direction of the most likely culprit, the United States of America.<br>\r\n<br>\r\nThe journey didn't take very long. Stepping gingerly over Africa he crossed the Atlantic in a couple of footsteps and positioned himself next to the narrow isthmus that joined North and South America. Once again the boy contemptuously raised his foot and scuffed it across Panama, separating the North and South forever. Not caring that his punishment would affect Canada and Mexico, as well as a few Central American nations, Stephan prepared to exert his power once more.<br>\r\n<br>\r\nThis time he decided to play a very old game, the kind of trick that he'd often used when fooling around with friends, and had seen employed in countless holiday photographs. He brought his thumb and forefinger up close to his eye and positioned them so that it seemed from his perspective that all of North America was being held, pinched, between them. He closed his finger and thumb a fraction and the landmass appeared to shrink slightly to fit within the smaller gap. Then he re-focused his gaze and shifted his hand... and suddenly it was no longer just a trick of perspective: <i>he was actually holding North America itself, tiny and helpless, between his thumb and forefinger</i>. Where the mighty continent had once been there was now just a roiling mass of water as the ocean rushed in to fill the space, lowering sea levels everywhere else. But Stephan didn't care: he had his new plaything and it was time to decide what to do with it!<br>\r\n<br>\r\n</span></div></div>",
            "created":1345870800,
            "id":1413482,
            "title":"Stephen modifies the entire Earth"
        },
        "1133111111212211":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "'Plays' with the teeny continent ",
                "Does the same thing that he did with America to the world!"
            ],
            "content":"<div class=\"\"><div> <span>\"WELL THAT WASN'T VERY NICE!\" Stephen boomed from above as North America was rocked by his voice. His titanic index finger had easy a half a dozen once huge American states like Kansas flatten to dust under it. It was hundreds of miles thick and thousands in length as it was attached to the godly figure of there new God. The few hundred million that the finger had not instantly crushed gazed up to the sky to see the titanic face of stephen glimming with joy at all the havoc he was causing. \"I'M AM YOUR GOD! Stephen boomed once again shacking one of the worlds most powerful nation to its core. How can one 'boy' have so much power! Stephen also thought the same as the puny citizens of the massive country but unlike them he wanted more! \"NUKING PEOPLE ISN'T VERY NICE AMERICA... IM YOUR GOD! AND IT'S TIME RO FACE THE CONSEQUENCES...\" With that Stephen stared hard at the contingent between his grasp and all off a sudden it began to shrink in between his fingers. The rest of the world looked up in awe as the continent hundreds of thousand miles above them shrank away as Stephen showed what was left of humanity who really was in charge here. <br>\r\n<br>\r\nSmaller and smaller the continent in shrank to the pleasure of Stephen. His towering finger wiping out all of central America as it became less and less to him. He soon was able to balance the once powerful continent on his index finger as he smiled at the power he bestowed. Meanwhile in America there was utter panic as Stephen had become titanic to plain ridiculously Godly! His face now to the still shrinking continent was hundreds of times larger the earth and once major cities like New York had to be measured on sub-atomic levels compared to Stephan now, people where even smaller... \"HAVE YE  LEARNED YOUR LEASON PUNY AMERICANS THIS WORLD IS MY! YOU ARE MINE! HAHAHAHA! Stephen boomed this time his voice was almost earthquake like as glass broke and alarms went off, people loss balance and old building crumbled. The country still shrank to the horror of all of America as Stephen really was enjoying himself he had to almost squint to see the county now the size of a single state on the titanic plain which was the tip of Stephens titanic index finger as he brought the ruined county up close to further inspect.<br>\r\n<br>\r\nHe had shrunken the county to the size of a mere grain of sand in comparison to his godly form. For the people they looked up into the deep blue eyes that gazed at them. These titanic eye balls where planets within there own right. To Stephen America was nothing and completely doomed at the powers of Stephen. The world watched on from the mighty feet of Stephen what he was todo next as he had an idea! </span></div></div>",
            "created":1346475600,
            "id":1418717,
            "title":"He keeps using the perspective trick until NA i..."
        },
        "1133111112":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "As large as his entire foot!",
                "Covering his entire body!!"
            ],
            "content":"<div class=\"\"><div> <span>Stephan relaxed and played his video game for the next hour or so, occasionally wriggling his feet just to mess with the millions of slaves resting on his toenail. He knew there was no chance they could clean the crud off his feet, but he just loved having them there and knowing they would still try their best to do what he demanded because their lives depended on it.<br>\r\n<br>\r\nFinally, Stephan snapped his DS shut and lifted his foot up to his face to inspect the job his slaves had done. Stephan frowned to see that nothing had really happened at all, which was pretty much what he expected. It had taken the city of New York many months to clear the wreckage of the WTC, and that was only just a few buildings. If it took so many months just to clear out a few buildings how could the city possibly clear away gigantic balls of lint and crude which were even larger than the entire city itself?<br>\r\n<br>\r\nEventually it could be done, but it might take hundreds or even thousands of years, and Stephan didn't feel like waiting that long even though with his God like powers he probably would be alive that long. Stephan pondered this dilemma for a moment, and then realized he could solve the problem by just speeding up time for the tiny people by a huge amount, so that their entire lifetime would fly by in less than the blink of an eye, and even though they would die of old age, they would give birth to newer generations and these would carry on their parents work and so on.<br>\r\n<br>\r\n\"Okay, you little microbes.\" roared the continent sized face of Stephan as he loomed over the shrunken city on his toenail. \"I realize an hour is no where near enough time for you to complete the task I have assigned to you, so I have decided to be lenient and give you the next 10,000 years or so to finish the job. The sole purpose for your entire lives is to serve and clean and worship my feet! This will also be the sole purpose of your children, and your children's children, and so on for the rest of eternity, or until I get tired of you. When I wake up for school tomorrow I expect my feet to be fresh and clean, or else!\"<br>\r\n<br>\r\nAnd with that, Stephan turned off the light and hopped into bed. It was still fairly early, but it had been a long and interesting day, and he couldn't wait to see what the millions of people on his toenail had managed to accomplish now that he gave them about 10,000 years of their time to clean off all his foot crud. Stephan then jerked himself off into one of his sweaty socks as he thought about his tiny slaves and servicing his feet, and then fell asleep with a smile on his face.<br>\r\n<br>\r\n*************<br>\r\n<br>\r\nMeanwhile, the city of New York breaks out into chaos and there is mass suicides as people realize that they will never be returned to normal and must spend the rest of their lives cleaning crude off the smelly foot of a teenage boy. However, many millions decide that even life as a foot slave is better than no life at all and they do not commit suicide. Eventually the chaos settles down, and a new government comes about which brings order and stability to the city.<br>\r\n<br>\r\nThe first order of business is what to do about food. Before NYC had been shrunken, food had to be shipped in from elsewhere, but now this was no longer possible. Eventually it is decided that they will live by eating the grim, crud, and dead skin cells of their new master. Most people find this idea revolting, but eventually the city's food supply would be exhausted and this is the only way they will survive. It is also decided that Stephan's sweat would have to make due as the city's water supply.<br>\r\n<br>\r\nEventually after a few hundred years NYC manages to cope with its new situation, and by now all old religions have been abandoned and forgotten and in their place new religions were founded which worshiped their sleeping god, Stephan. These religions might differ from each other on details and dogma, but they all agree with Stephan being their one and only god. Now, whenever a New Yorker ate his or her meal of crud or fungus they gave thanks to this bountiful feast which their god has so graciously provided to them.<br>\r\n<br>\r\nThe people of New York also did not forget Stephan's instructions to them that their sole purpose was to clean his feet, and they knew this monumental task could never be finished within their lifetime, so they made it a high priority for every citizen to not only have children, but to have as many children as possible. Every child was born into a life of slavery to serve Stephan's feet. They were baptized in his sweat and indoctrinated in the new religions which taught that they were nothing more than a slave to him. Each of them grew up, labored their entire lives, and eventually died of old age all within the blink of an eye from Stephan's perspective.<br>\r\n<br>\r\nThe new religions taught that it was every man and woman's duty to produce more children, and the government enforced this rule by law. Food was never scarce, so the population exploded. New skyscrapers began to be constructed using Stephan's dead skin cells, and whatever other materials they could find. Eventually the city regained all of the population that had been lost due to Stephan's playing with it earlier in the day, and all of the damaged buildings also were eventually repaired and even expanded.<br>\r\n<br>\r\nAfter the first 1,000 years the city had now quadrupled in size and now covered his entire big toenail. Powerful machines were improvised out of Stephan's skin cells and whatever they could find, and these machines began to clear away the first huge ball of lint. These balls of lint and crude proved to be very valuable in providing materials for the city to grow and expand. This sweat soaked lint which had been part of Stephan's sock was full of dirt and dust and various other debris which were refined and used to create skyscrapers and vehicles to carry out the task Stephan had ordered.<br>\r\n<br>\r\n**************<br>\r\n<br>\r\nMany hours later Stephan wakes up and rubs his eyes. He then remembers the city of New York which had been on his toe and he became excited to see what they had managed to achieve while he had slept. As he raised his foot up to his face his eyes went wide in amazement how the tiny city which was once smaller than a piece of lint was now...</span></div></div>",
            "created":1336107600,
            "id":1329291,
            "title":"More giant footplay..."
        },
        "113311112":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Stephan makes it so the tiny city has gravity and gets up and does something....",
                "Stephan stays and enjoys the tiny city's tickling some more...."
            ],
            "content":"<div class=\"\"><div> <span> Stephan sat on his bed looking down at the impossibly small city on the floor and smirked. He wanted to think of something extra special for his first worshipers. Sitting watching the barely visible movements in the city, he was getting a raging hard on. In his daydreaming of scenarios he reached down and casually scratched a tiny itch in his boxers when it came to him. Could he do it? How limitless were his powers? He wanted to find out and he had the most devilish plan. Reaching down he carefully picked the entire city up in his fingers and held it in front of his face. He leaned back on his bed and with his free hand pulled down his clothes until he was naked from the waist down. He slowly lowered the city till it was directly above his crotch and he concentrated. A flash and the city was gone from his hand. In a moment Stephan began to panic that he messed up and lost the tiny city all together. That is....until he felt a tickle down in his crotch. With a shaky hand he reached down and gently rustled his pubic hairs apart until he saw something that made his heart jump. Down below he saw the tops of tiny little skyscrapers poking out from between the spread hairs in his fingers. He shot his hand into the night stand drawer and noisily searched for his magnifying glass. Finding it he gently spread his hairs and with a slightly shaky hand focused his view through the glass. There, among his patch of hair was New York City! The tiny landscape went from the shrunken land mass to the buildings, sidewalks, cars and people now grounded to his flesh. The occasional tickle he felt was the flea sized cars driving around his sensitive skin where the streets used to be.<br>\r\n<br>\r\n Frustrated with the looking glass he looked at the big screen TV across the room and concentrated. The TV made a buzz and came on. As the screen adjusted it was a much closer look at the city that was now engulfed in his pubic hair. With a much clearer view he could see the little cars speeding around on the expanse of pink flesh as tiny little people panicked in the streets. All while dodging the mighty stalks of his pubes that shot upwards like giant redwoods. There were a few car accidents that had slammed into the base of some of the pubes with little billows of smoke wafting up from them. So small that the smoke didn't even go high enough to leave the forest of hair. As he consciously moved his view around the tiny city, marveling at the bustling goings on of the flea inhabitants, a dark shadow fell across the area like nightfall. Stephan realized it was his celestial cock that was looming overhead like a god's dick would. Angling his view skyward, he could make out the silhouette of the massive organ obscured by the twisting and tangles hair canopy. Stephan looked down at his cock from his point of view and it was slowly throbbing above his patch of hair with the tip with the beginnings of precum leakage. He was loving this.<br>\r\n<br>\r\n Back down in the city, people were running everywhere. First they had the entire city somehow transported to the palm of a teen boy.... the next thing they knew they were lost in a dense forest. One boy, a young teen named Kenny walked around among the panicking, trying to make sense of it all. He stepped off the front entrance of his favorite coffee shop and onto some new surface where the sidewalk and street used to be. It was an odd shade of light pink and almost leathery. He walked out and toward one of the strange shafts jutting up from the ground high into the air. They seemed to appear out of no where, and were the cause of much destruction in their sudden emergence. Cars were slammed into them... buildings were partially demolished. They were everywhere and they rose far above the skyscrapers. Walking to the one before him he saw a group of people struggling to free a man from his damaged car that had hit it broad side with his SUV. As they freed the disheveled man Kenny noticed the huge black stalk was unscathed. Stepping closer he stepped carefully around the raised and slightly sunken rim that surrounded the base of the shaft. He could see that it must go much farther underground a ways. It was wide... and black in color. Laying a hand on the surface revealed it was very solid and heavy that it couldn't be budged in the slightest. What were they and why were there so many of them? As far as the eye could see throughout the city they were everywhere. The huge metropolis was under the shaded canopy of all these shafts. Shafts that, after a certain random height, took on crazy angles and bends on their way up into the sky. Kenny knelt down and examined the ground where it came up from. There was a slight space between the shaft and the ground before it angled and went flush with the jutting structure. A space just big enough for his hand, so he reached down as far as his fingers could reach. It met the hard trunk and could go no further. If this was some sort of ground....maybe he could dig down into it. Kenny began to scrape his nails and fingers down into the crevice trying to unearth what he could....<br>\r\n<br>\r\n Stephan sat in awe at himself as his cock loomed over the helpless tiny city. He could feel things crawling in his pubes like tiny, tiny fleas and it filled him with arousal....knowing they were people. Honest to god people. People....and cars...and buses...and-....wait....what was that? Stephan felt a new sensation from somewhere down in his lush forest. It was a tiny little tickle. Like something was nibbling on him. Or scraping. It was amazing! He sat and revelled in the feeling that was a mixture of a tickle and a flea bite. His new godlike powers must enhance his senses for him to feel something that miniscule to effect him like this. His God dick go even stiffer and began to dribble precum from the tip as he bit his lip. He wanted so badly to rake his nails into the hair and please himself. But not doing it served him more pleasure so he let it continue. A droplet of precum made a lazy strand downward slowly into the patch of pubes as he enjoyed every movement the tiny people were giving him....<br>\r\n<br>\r\n Kenny felt the shadow cross over him and he looked above to see a massive....thing! He didn't know what it was...as did anyone else who also felt the darkness wash over them. As they looked up a massive amount of something crept towards them all! As it hit shafts on the way down it almost looked like it was going to stop. But the sheer amount of it pushed on and crashed into the pink ground engulfing some in it's substance!</span></div></div>",
            "created":1317445200,
            "id":1198675,
            "title":"The City in the Woods"
        },
        "11332":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "It was 1/16 inch",
                "Smaller?"
            ],
            "content":"<div class=\"\"><div> <span>There it was a whole city in the hands of Stephan. Millions of new slave for his demands but still it wasn't enough to satisfy Stephan in his mind the whole of New York should be much smaller! Stephan glared at the inch square on his hand. Stephan watched as the city seemed to shrink before his eyes...<br>\r\n<br>\r\nMeanwhile there was utter panic in New York as It seemed this Boy-God was not with them yet as every single feature on Stephans hand grew bigger and bigger as too the massive face that loomed over head blotting all light to the tiny city in the shadow of a titanic face of Stephan. <br>\r\n<br>\r\nThe whole city shrank until..</span></div></div>",
            "created":1292475600,
            "id":1016096,
            "title":"He decides to shrink it down even further"
        },
        "113322":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Dispose of the useless little thing!",
                "Take it to science class and put it under the microscope!"
            ],
            "content":"<div class=\"\"><div> <span>Stephan watched with satisfaction as the once-impressive city of New York continued to dwindle in his hand, becoming tinier and tinier until it was finally nothing more than a barely-visible speck of dust lost in the vast expanse of his palm. It was now so small that it would probably take an airliner hours to cross the width of his hand!<br>\r\n<br>\r\nTaking care not to accidentally dislodge the speck-sized metropolis Stephan leaned across and took a ruler out of his bag. He laid the ruler across his palm, almost touching the little city... <br>\r\n<br>\r\nThe microscopic population could only pray as they saw the vast object, seemingly hundreds of miles in length, descend from the sky in the grip of a gigantic thumb and forefinger. At first they thought it was going to flatten them, but the object finally came to rest somewhere between five and ten miles away from the edge of the city. Even that distance was too close for comfort: although nearly flat by Stephan's scale the cheap plastic ruler seemed so huge to the tiny New Yorkers that it rose higher than any mountain above the skyscrapers. They could see clearly how the white plastic surface was pitted and scarred with scratches that would normally be invisible to the naked eye. They could also see the widely-spaced black measuring lines stretching off into the distance along the length of the ruler. If that wasn't humiliating enough, they realised with shock that the entire city of New York was <i>less than the width</i> of a single one of those black lines!<br>\r\n<br>\r\nStephan lined up the marks on the ruler with the minuscule speck that was the shrunken city. He felt a thrill of satisfaction and excitement as he saw that the city was so tiny that he could no longer get an accurate measurement: it was certainly no more than a 10th of a millimeter across at most! The teenager wondered what he might do next with the helpless little city...</span></div></div>",
            "created":1292648400,
            "id":1017181,
            "title":"Smaller? Yes, MUCH smaller..."
        },
        "1133221":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Yes go ahead with his plan",
                "Knock on the class room door!"
            ],
            "content":"<div class=\"\"><div> <span> Stephan looked at his hand. The tiny city was in ruin and was beyond the sight of Stephan. The was a large sigh from Stephan as the whole of New York was now ant-sized to his massive form but was too small to really enjoy playing with any more. Soon Stephan thought of destroying the useless little city. But how was the question buzzing around in his head. Gazing at the city he thought of evil and the odd revolting was to destroy this speck of dirt on his hand. After a few minutes he had the idea of simply placing the entire city of New York inside his smell giga-sized school shoe. The micro civilisation would be a speck to his godly toe's that they would end up worshiping until. He crushes them. The thought of a once massive and powerful city like New York shrunken was a dream come true but having it microscopic between his toe's was the icing on the cake! <br>\r\n<br>\r\nStephan took off his right shoe. Stephan evilly shifted his hand and pointed to the massive dark abyss that was the top of his shoe. The few millions left in the city panicked as there fate was sealed. They begged more for this god-figure of Stephan to stop his evil ways but where greeted with shock as Stephan was only grinning at the thought!</span></div></div>",
            "created":1294117200,
            "id":1029134,
            "title":"Dispose of the useless little thing!"
        },
        "11332211":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "New Play things?",
                "Tell A friend About his powers!"
            ],
            "content":"<div class=\"\"><div> <span>Stephan snapped his fingers. In a flash the tiny city was gone from Stephan's palm. Had it worked? Stephan picked up his shoe and pulled the tongue as far back as it could go. Stephan lowered down to the shoe and scanned the sole for any sign of life. <br>\r\n<br>\r\nThere it was! Stephan's plan had worked and the now micro city was inside the sole of his runner. Stephan smiled as the speck that was the city was now next to a small piece of lint that was about 12 times the size of the city that made Everest a small hill. But the worst was yet to come as Stephan took off both socks and threw them across the empty class and put both shoe's on barefoot! The city was doomed as the now toe planets slipped inside the smell cave that would be the length of the solar system for a atomic sized person in New York! A sweat pore that was normally invisible to the naked eye would be country size and a drop of sweat continent sized! Stephan continued the rest of the day knowing that New York was doomed and millions of atomic people where under foot! </span></div></div>",
            "created":1294203600,
            "id":1029460,
            "title":"Yes go ahead with his plan"
        },
        "113322111":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "The Solar System",
                "The Milky Way and other galaxies"
            ],
            "content":"<div class=\"\"><div> <span>Stephan flexed his toes with satisfaction. He'd barely felt even the slightest <i>crunch</i> as the teeny city was crushed beneath his toe. He'd reduced New York to such a tiny size that he guessed that parts of it might even have survived: skycrapers, city blocks, even whole neighbourhoods might have been pressed into the relative safety of the vast canyons that were the shallow grooves running across his toes. It pleased the boy to imagine scattered groups of microscopic survivors living as parasites on his body - at least until he took a shower, or the titanic globules of sweat simply washed them away... <br>\r\n<br>\r\nFor a kid his age, whose body was already awash with hormones, the ability to abduct and change the size of anybody or anything he wanted was overwhelming. His already healthy ego swelled to godlike proportions. Stephan was already thinking about who he could shrink next. Having the power of life or death over millions had been pretty cool: maybe he'd shrink a few more cities and keep them in his bedroom. He could keep the micro-populations as slaves, worshippers, pets... or even snacks. Caught up in his megalomaniacal fantasies, the boy made his way to his next class.<br>\r\n<br>\r\nScience was actually one of his favorite classes. The teacher was just as much an asshole as all the rest, but they were currently studying astronomy and Stephan had always liked thinking about the stars and planets. <i>\"Ha! I bet they'd make great toys!\"</i> he thought to himself. Some more interesting possibilities were starting to occur to him...<br>\r\n<br>\r\nStephan lazily entered the science room and slouched down in his usual chair at the back. The teacher was already setting up the stuff for the lesson. As the man looked up and began to speak Stephan ostentatiously pretended to yawn - but his mind was alert and waiting for an opportunity to exert his powers once more.<br>\r\n<br>\r\n\"Good afternoon, class. Today we are going to be looking at....\"</span></div></div>",
            "created":1294462800,
            "id":1031651,
            "title":"New Play things?"
        },
        "1133221112":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Stephan wants to keep the little \"model\" galaxy",
                "But what if the Milky Way was even smaller...?"
            ],
            "content":"<div class=\"\"><div> <span>The teacher began his lesson.<br>\r\n<br>\r\n\"Galaxies are huge clusters of stars. They come in a variety of shapes, ranging from spirals to irregular clumps. The smallest contain tens of millions of stars, while the largest can have as many as a hundred trillion! We live a medium-sized one that probably consists of two or three billion stars. From here on Earth our galaxy appears as a band stretching across the sky, but according to Greek mythology this was actually a splash of milk from the breast of the goddess Hera - and that is how the galaxy got its game.\"<br>\r\n<br>\r\nAs the rest of the class of adolescents tittered slightly at the mention of the goddess's breast, Stephan sighed. He'd heard all this before and was impatient to get to the good stuff.<br>\r\n<br>\r\nThe teacher continued: \"Although we see it as just a band of light, this is because we are actually inside the galaxy itself and cannot view it in its entirety. However, I've brought in something special today to illustrate it clearly.\" Stephan snapped back to attention as the teacher picked up a object from his desk. He couldn't see it clearly, but it looked like some kind of glass box, about 12cm on each side, with a tiny white shape inside.<br>\r\n<br>\r\n\"As part of the National Schools' Science Foundation we've been loaned this exhibit, which is the most accurate model of our galaxy yet created.\" The teacher handed the object to one of the kids at the front so that it could be passed around the class. \"It's a 3D representation of the Milky Way, made using the latest astronomical data. The exact positions of more than 80,000 known stars have been etched inside a block of crystal. What you are holding in your hands right now is pretty much the Milky Way as we know it!\"<br>\r\n<br>\r\nAs the girl in front of him turned round to hand him the crystal Stephan smiled. A whole galaxy in the palm of his hand sounded like exactly what he wanted! He narrowed his eyes and began to concentrate.<br>\r\n<br>\r\n<br>\r\n* * * * * * * * * * * *<br>\r\n<br>\r\nOn the other side of the world it was still night, but among those who were still awake were the legions of astronomers, hard at work studying the heavens while the darkness lasted. They had already been startled by the recent news reporting the mysterious unexplained disappearance of the entire city of New York - but that was as nothing compared to the latest surprise. Without warning the sky lit up! It was as though morning had come, even though it was still the middle of the night... and the sun was not even in the sky! The light was everywhere, waking everybody on the planet, sending them rushing out in to the streets to look up in terror. The moon and the stars had disappeared in the glare; even the sun was all but drowned out by the brightness on what was formerly the \"day\" side of the planet. Astronomers rushed to interpret the latest data from their orbital telescopes, and reports were quickly sent to all the world leaders....<br>\r\n<br>\r\n\"The stars are still there, but... the light seems to be coming from beyond them... we think it's from somewhere outside the galaxy itself! And not just outside it; everywhere around it! Everything beyond that has simply disappeared, apart from what appear almost to be immense reflections that must be thousands or millions of light years across. It's almost as though.... it's almost as though our whole galaxy was inside some kind of impossibly huge glass box!\"<br>\r\n<br>\r\nBut then the light on one side of the planet was blocked out and a new shape appeared, fillling the sky completely. It was so huge that it took a while for people to actually recognise what it was. And when they did... a wave of hysteria spread across the world. Unbelievably titanic, studying them from beyond the most distant stars was a huge, HUGE eye! From its sheer scale scientists could only speculate that it might be as big as an entire galaxy. Then the eye slowly pulled back revealing more of a giant male face. No existing religion could account for what the population of Earth could now see:<br>\r\n<br>\r\n\"It looks... it looks like a gigantic teenage boy!\"<br>\r\n<br>\r\n<br>\r\n* * * * * * * * * * * *<br>\r\n<br>\r\nBack in class one of the kids was asking a question. \"Where exactly are we in the galaxy?\"<br>\r\n<br>\r\nThe teacher smiled as he answered: \"You've probably noticed that the model of the Milky Way appears to be slightly off-center. That's because it has been designed so that Earth appears to be right at the center of the crystal. Of course, you wouldn't be able to see it anyway: at this scale our entire solar system would be completely microscopic. In fact even the largest stars would be far too tiny to be seen. Remember, that little thing you've been holding in your hands is actually 100,000 light years in diameter!.<br>\r\n<br>\r\nStill holding the small glass box containing the model, Stephan smirked. Unbeknownst to anybody else, the tiny shape inside the crystal had undergone a subtle transformation. The previously sharp pinpricks of the laser etching had been replaced by even tinier flickers of light, glowing softly. And there were now more of them. Many more. Several billion, in fact. Stephan peered closer and tapped gently on the glass, studying the cluster of tiny specks with amusement. They were utterly minute. It was hard to believe that each one was an actual living microscopic star system. And they were all his - every one of them! Nobody yet realised it, but Stephan had used his powers to replace the model galaxy with a real one. An exact living copy of the Milky Way and everything in it - <i>including a fully populated planet Earth!</i> - that was no bigger than his palm.<br>\r\n<br>\r\n The entire Milky Way was now just a teeny little plaything in his hand...</span></div></div>",
            "created":1294635600,
            "id":1032913,
            "title":"The Milky Way"
        },
        "11332211121":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Home Time",
                "More Class"
            ],
            "content":"<div class=\"\"><div> <span>Stephan smiled and played with the glass box's for a few minute's. He then looked around and noticed nobody wanted the milky way back so he looked at the glass cube with a great delight and wonder. His massive finger grasped the cube and he rolled it around like a play thing and not an entire galaxy that over 100000 lightyears big but now only 12cm to Stephan. Stephan then brought the cube up to his face and was amazed at the sight of the milky way. Stars that would deaf your sun would be teeny specks to Stephan. All this was so exciting for Stephan. He had another look about and released still nobody was looking at him still. He then placed the glass cube inside his pants pocket hoping that the teacher would forget completely about it. For It was Stephan's now<br>\r\n<br>\r\nPOV of Earth #2<br>\r\nThere was panic on earth as the God literally played with the entire galaxy with ease. Light was plotted out on one side of this galactic sized box with the massive finger print as he more or less fiddled with it in his hand. The earth had now claim this teenage boy as there God as all other religious believes and stories where now over shadowed by this immense being. Science experts had come to the conclusion that he was over 1.5 million lightyears tall! Still this boy gazed at there galaxy with a evil smile. Then without warning. This titanic god placed the whole milky way inside his pocket like it was a common object of no worth like a pencil. The sheer power of this boy brought every living creature to its knee's all bowing as this was there new God. He was so large even our own Sun that dwarfs our planet already was unnoticeable. To the Gods Eyes. People prayed hoping he was a kind caring God and boy where they wrong.<br>\r\n<br>\r\nDing, Dong! The school bell rang out and it was....<br>\r\n <br>\r\n <br>\r\n <br>\r\n<br>\r\n         </span></div></div>",
            "created":1294635600,
            "id":1032953,
            "title":"Stephan wants to keep the little \"model\"..."
        },
        "113322111211":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Plays with his New \"Toy\"",
                "\"Smaller the more powerful I am!\""
            ],
            "content":"<div class=\"\"><div> <span>Stephan grabbed his school bag and dash to the exit. It was home time! Stephan had some idea's in store of the Milky Way!<br>\r\n<br>\r\nDarkness was back, it was like the past 20 minutes never happened as the earth sky was black once more. The terrorising sight on this God had vanished again and people thought everything was back to some normality. Stephan was only visible to earth for just over  20 minutes and in then minutes a true god was crowded. Stephan had the largest religion in the world with all 6 billion human bowing to there New and true God. Massive statues where made of the face of this god and every church on the planet was scrapping all religious reference's. This \"Boy held over 100000 lightyears in his palm with ease a person that big and powerful had to be a God. They where indeed right Stephan was a God! But was not a kind god. He had plans for this teeny galaxy that would bring everything to there knee's. <br>\r\n<br>\r\nMean while in Stephan universe he was walking home from the best day of school ever! He had released that he was God! All this power to use at his benefit. He had the microscopic remains of New York under his big toe. While now he has really done it by having an entire galaxy inside is pants pocket. There was nobody home until really late and he had the house to himself. Stephan flung his bag full of homework in the hall (like as if he was going to do it!) And ran up the stairs to his room. <br>\r\n<br>\r\nIt didn't take very long until the earths new God had repaired. Stephan simply pulled it out of his pocket but to the micro planet earth it was like a massive flash of light blinding people for a few seconds. The eye's of the people of earth adjusted to there new surroundings and looked up at the sky that was again Stephan's face. Billions where on there knee's bowing to there God but where so small Stephan even see there whole solar system! It was far to small for him to see. <br>\r\n<br>\r\n\"I am Stephan O Sullivan and I am your God! All most bow at my greatness and worship me as I'm almighty. Your all nothing but microscopic specks to me and I demand Worship!\" his voice boomed about the heavens and everybody gave worship to there God Stephan. <br>\r\n<br>\r\nEvery where on the earth you could here every living man,woman child given worship shout on the top of there lung praise to Stephan. <br>\r\n<br>\r\n\"All hail Stephan master of your puny galaxy may he rule us under his very word and let us worship his godly body! All hail Stephan!\"<br>\r\n<br>\r\nAs this was happening Stephan wanted to get rid of the glass housing of the galaxy. But with a snap of Stephan fingers the glass was removed and it was now play time for Stephan.  </span></div></div>",
            "created":1294722000,
            "id":1033752,
            "title":"Home Time"
        },
        "1133221112111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Down to his Feet the Milky Way goes!",
                "Starts to jack off too horny at the moment"
            ],
            "content":"<div class=\"\"><div> <span>Stephan then grasped the entire universe in one hand. His titanic finger blot all light to earth and again the stars brought the main source of light. These gigantic fireballs in the sky took billions of year to form but now look helpless and weak against the might of someone the size of Stephan. The universe in fact was so small Stephan's gravitational pull made the Milky Way moveable without destroying the trillion year old galaxy and it's many billions of stars and planets including a teeny earth. Everyone was shock as soon as Stephan opened his grasp on the tiny galaxy to find the Godly face of Stephan unbelievable! Stephan was much closer to the shrunken Galaxy and for Earth Stephan's face was there only view. Stephan was extremely close now and earth was very lucky as each exhale was like a shower of water vapour that quenched whole star systems and the hydraulic power of the force dissolved even the largest of planets. He was already destroying the Milky Way and it was so small just a breathe of wind was fatal to some outer systems.<br>\r\n<br>\r\nOn earth every small detail on Stephan face could be seen. From earth Stephan could was just so immensely big every human was awe struck. Stephan then gave a deliberate blow and the gush of wind was again so great it blew out stars and destroyed planets with ease. Any Move Stephan made was going to cause amounts of destruction so large we really can't process. Then out of the blue there was a massive swipe from his left index finger and a large chunk was now on the tip of his finger. Stephan then playfully examined what was on his finger. Solar system much larger then our's where lint sized flickers of light, immense stars hundreds of times larger then the sun where the same. Every law of physics had been broken now as Stephan then shoved the finger into is mouth. He sucked it for a minute baby-like and then pulled it out leaving no trace of the quadrant of the Milky Way void and empty. <br>\r\n<br>\r\nThe Power was truly endless for Stephan as he had just come to term what he gad just done! All this power had again ran to his head and there was a large bulge forming in his pants but before that it was time for his feet to get some of the action!<br>\r\n<br>\r\nStephan flung off his shoe's he had no socks on he had disposed of them earlier. His small feet wiggled in delight as Stephan then lowered the galaxy to level his gigantic smell, sweaty feet!</span></div></div>",
            "created":1294808400,
            "id":1034303,
            "title":"Plays with his New \"Toy\""
        },
        "11332211121111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Someone At the Door",
                "Milky Way Starts to Randomly Shrink "
            ],
            "content":"<div class=\"\"><div> <span>Stephan slightly slid his hand down his pants and moaned lightly. To the people of the universe there was a huge bulge in them as Stephan got more and more horny of the thought. Then with extreme slowness Stephan push the galaxy down lower and lower until it was 'eye level' with the sweaty foot of Stephan. Trying not to add a huge amounts of pressure, Stephan's foot moved face-to-face with the entire Milky Way. On earth people thought they where doomed (but not yet) and ran in fear and riots started not releasing there luck that if smell traveled through space his feet where so bad that the planet would simply rot and disintegrate in mere seconds. Then Stephan's foot crushed the outer layer of the galaxy easily and the band of newly born stars with destroyed with ease but even with there immense  heat for there teeny size was there let down and ended as more dirt and dust particles between sweaty skin ridges on the sole of his foot. Stephan still had his hand down his pants more and more horny as the time passes.<br>\r\n<br>\r\nStephan then snapped his fingers the whole Milky Way shrank in sheer seconds to about 1cm in length and 0.5 in height. Stephan foot was over 10 bigger then what it was 5 minute's a thunderous laugh rocked the now even more shrunken galaxy. Stephan then tormented the poor little milky Way by measuring it to his giga-sized big toe! It loomed over the view of earth and plotted out the entire view of the rest of Stephan. Then only sight of detail was the ridges of skin to form a massive toe print. <br>\r\n<br>\r\nTruly Stephan had deaf the light year as a scale. A lightyear is a immense speed that is used to record the speed of light and the length of item of gigantic potion like galaxies and star system's but now Stephan was now so large that 1 lighter = 0.00065cm!!!!!<br>\r\n  <br>\r\nThen suddenly...         <br>\r\n</span></div></div>",
            "created":1295067600,
            "id":1036061,
            "title":"Down to his Feet the Milky Way goes!"
        },
        "113322111211111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Hours Later",
                "Inside Stephan's socks"
            ],
            "content":"<div class=\"\"><div> <span>*Ding Dong!*<br>\r\n<br>\r\n\"Hey Stephan you up there the door was slight open!\" his friend David  shouted from the front door step. <br>\r\n<br>\r\n\"Oh Shit!\" Stephan jumped and panicked. He then quickly wedged the Milky Way between his big toe and his index toe. He then grabbed some used dirty socks off his floor and quickly but them on. <br>\r\n<br>\r\n\"Hey You all right Stephan?\" David was walking up the stairs each foot steps getting loader and loader. Finally Stephan door flung open to find a tense Stephan just siting down.<br>\r\n<br>\r\n\"Hey David! What do you wanna do!\" Stephan said now more relaxed<br>\r\n<br>\r\n\"Maybe Video Games?\" David said gleefully pointing at Stephan  console.<br>\r\n<br>\r\nDavid was a bit older the Stephan at fifteen but was small for his age and just a small bit taller the Stephan. He had very short black hair and tanned skin. He was very sporty and wore tracksuit pants and a football jersey. He was into the room where Stephan sat on the bed. Took off his shoe's but hadn't any socks on.  The two boys continue to play games for a couple of hours.....<br>\r\n<br>\r\nPOV Earth:<br>\r\nThe whole rush was of universal propitious the Milky Way was on the verge of collapse the was Stephan treated it like a 'toy' of some kind that he just endangered earth let alone all the billions of stars in the Milky Way. That was the start then when he engulfed the galaxy with 100% cotton sock again the whole would went black on massive highlights of the toe's each side very noticeable but the main worry for this already hopeless galaxy was another peril as massive micro drops of sweat rained on the Milky Way. These drops engulfed solar systems in massive Walls of water destroying all life on them. Still the human prayed to God Stephan worshiping and bowing for freedom of his sock and kindness to all. This was not going to happened as he soon started to care about kicking Ass on his game. Forgetting about the bug sized universe.<br>\r\n<br>\r\n<br>\r\n    </span></div></div>",
            "created":1295067600,
            "id":1036081,
            "title":"Someone At the Door"
        },
        "1133221112111111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Yes the Milky Way is gone",
                "No It's still alive!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey See you later Steve! David said as he closed the front door it was now late and Stephan yawed tiredly it had been a long and eventful day. Stephan then took off his top and pants and left the teen in his under wear inside his bed room. He then collapsed on to his bed only know had all the day events hit him and all the power he had. Stephan then pulled both of his dirty socks of his sweety feet. The third time the universe had experience a flash of light and now released where they had been. The earth was very lucky for two important reasons. One smell doesn't travel through space or the foot oder would have rotten the microscopic earth in second of being inside his sock and that Stephan sweet droplets didn't drown the planet in seconds. Vast amounts of the Milky Way had vanished and now lay in micro water droplets on his feet and on the sock itself.<br>\r\n<br>\r\nThis was all great until again the  whole galaxy shook and it was pinched up to eye level with Stephan's face again. The people of the Earth where mesmerised as underneath them there was a large bulge forming in Stephan underwear as he reached down and grasped his growing erection. There was a few load moans from Stephan as he stoked  that was hundreds of thousands lightyears in length. Stephan then pulled down his underwear and the massive dick rose like a universal skyscraper. Stephan moved his hand faster as there was a few more moans from the horny teenager. He slowly moved the Milky Way forward to the piss-slit of his penis and the earth actually thought it was the end but far from it as Stephan was just about to climax he snapped his fingers and the Milky Way itself shrank microscopically and second later was followed by a moan as White cum shot vertically up out of Stephan's dick the hot cum then fell back onto the chest of a sweetie and tired Stephan. That bow had a lower chest drenched in white cum. Stephan yawed again and pulled his duvet lazily over him to tired to clean his mess that he made. Stephan fell asleep in minutes and totally thought the whole Micro-sized galaxy had \"cum\" to a very sticky ending.                    </span></div></div>",
            "created":1296018000,
            "id":1042714,
            "title":"Hours Later"
        },
        "11332211121111112":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "The Next Morning",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Stephan had fallen asleep it was late and with all the happening today he need to rest and let his mind simply process the power he now had. Stephan thought that magnificent show of manhood was the true death and destruction of the puny Milky Way with ease and pleasure but in fact the galaxy was missed (just). <br>\r\n<br>\r\nBut now there was a new problem for the teeny Galaxy as it was immensely small size was trapped between the masses of flesh that was Stephan's personal area and hundreds of lightyears of duvet. This was ok at the moment as Stephan was asleep but this situation worsted as the the sheer size of Stephan pulled the Milky Way closer and closer to his body. Without knowing Stephan had pulled the Milky Way to his very own gravitational pull. The galaxy was then drifted toward the gigantic dick of Stephan but his became worst as the Milky Way crashes onto the cock head of Stephan's dick. There was nothing the people of earth could do there universe was puny to Stephan no mind the earth itself. They could watch in horror as the foreskin of his cock closes in trapping the universe in the musky, stick foreskin! <br>\r\n<br>\r\nStephan was still asleep hams he dreamed about what he was planning todo with his powers. All must see his power!              </span></div></div>",
            "created":1296622800,
            "id":1046414,
            "title":"No It's still alive!"
        },
        "1133221112111112":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "All Hail David!",
                "Somebody Else"
            ],
            "content":"<div class=\"\"><div> <span>The people of earth looked around everything looked different. There was darkness in side the sock but with the billions of stars there was enough light to make outline of the huge toes each side of the beyond micro galaxy. There was the odd rumble as Stephan wiggled his toes but except that it was fine. The Milky Way was in fact too small for any real damage as it sat wedge between Stephan massive toes. <br>\r\n<br>\r\nThen there was an odd figure emerged from out of now where the figure must have been 100 lightyears in size! It was one of Stephan former class-mates that where in the New York City and what looks like the sole survivor. Then the massive boy enters the Milky Way gravitational field and floats over to your teeny solar system in the centre and again the earths light gets blot out as its the titan sized body of :<br>\r\n<br>\r\nDavid King<br>\r\nAged:13<br>\r\nHeight: 150cm approx.<br>\r\nBuild: Skinny and musclier<br>\r\nDavids very sports but extremely demanding.<br>\r\n<br>\r\n<br>\r\n <br>\r\n   </span></div></div>",
            "created":1296450000,
            "id":1045333,
            "title":"Inside Stephan's socks"
        },
        "11332211121111122":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Ben",
                "Kevin"
            ],
            "content":"<div class=\"\"><div> <span>What about these 2 boys?<br>\r\n<br>\r\nBen Murphy<br>\r\nAged:14<br>\r\nHeight: 155cm approx.  <br>\r\nBuild: Very Skinny<br>\r\nSkin: Pale Caucasian<br>\r\nHair:Light Blode<br>\r\nBen is friendly but never give him an upper hand!<br>\r\n<br>\r\nKevin Muggaire <br>\r\nAged:14<br>\r\nHeight: 150cm approx.<br>\r\nBuild: Skinny<br>\r\nSkin: Caucasian<br>\r\nHair: Short Blonde<br>\r\nKevin is a quit kid but is there a dark side? <br>\r\n<br>\r\n</span></div></div>",
            "created":1296536400,
            "id":1046049,
            "title":"Somebody Else"
        },
        "1133221112112":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "1cm",
                "Smaller?"
            ],
            "content":"<div class=\"\"><div> <span>Now the Milky Way was tiny to Stephan he could crush it in his palm with sheer ease but still Stephan thought there was more room for him to become even bigger.The whole universe was pinched by Stephan massive index finger and thumb. The whole sight sent people into panic as there was a evil grin right across his face. Then Stephan glared at the galaxy and in seconds started to shrink! The whole surrounding of the Milky Way grew and grew including the immense figure of Stephan. Finally after a couple of minute's<br>\r\nthe Universe was only...</span></div></div>",
            "created":1296018000,
            "id":1042680,
            "title":"\"Smaller the more powerful I am!\""
        },
        "113322111212":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "Stephan shrinks the country even smaller!",
                "Stephan cuts the country apart and gives pieces to his friends"
            ],
            "content":"<div class=\"\"><div> <span>Having an entire Galaxy in his pants pocket was giving Stephen a really hard boner, and he would have loved nothing more than to go home to the privacy of his bedroom and jerked himself off, but unfortunately there was more school to be had, so playing with his new toy galaxy and its untold billions of humans and other alien species would have to wait for a few more hours.<br>\r\n<br>\r\nStephen's next class was History, which he usually found incredibly boring, but for some reason he felt that today it might be a little more interesting. Stephan made his way to his desk and sat down as the teacher instructed everyone to open their history books to page 130. On that page was a large map of Europe, but the borders of the countries were a little bit different than Europe of today.<br>\r\n<br>\r\n\"Okay class, today we will be learning about the bloodiest war mankind has ever fought.\" said the teacher. \"This war began in Europe in the year 1939, when an evil dictator by the name of Adolf Hitler invaded Poland and set his sights on conquering the entire world.\"<br>\r\n<br>\r\nThis talk of conquering the entire world didn't help much to relieve Stephen's aching erection as he continued daydreaming about the squashed city of NYC under his sweaty feet, or the billions of stars in his pocket. Stephen already had so many toys to play with, but looking over this map of Europe only made him hungry for more.<br>\r\n<br>\r\nStephen decided he could not only give himself millions of more tiny toys to play with, but also do the world a favor at the same time by snatching Nazi Germany right out of the history book and completely erase it from history! This way WW2 would not have to happen at all, and millions of lives would be saved. With a grin on his face, Stephen snapped his fingers and in an instant the map of Europe was permanently altered by the spontaneous disappearance of Nazi Germany.<br>\r\n<br>\r\nThere right in front of his desk materialized the enormous country of Nazi Germany, except it was no longer quite so enormous as it was now roughly the same size as a dinner plate. Stephen had already shrunken the entire city of New York, but this time he had not only an entire city, but an entire country of slaves! NYC was one city, but Germany was full of many such cities. Stephen began to daydream about what he might do with his new toys. Perhaps he would cut the country into pieces and give an entire city to each of his friends? Or maybe he would just keep it all to himself?<br>\r\n<br>\r\n<br>\r\n<br>\r\n**************<br>\r\n<br>\r\nMillions of Germans in the year 1939 were going about their daily lives and preparing for the upcoming war with Poland, when all of the sudden the sky changed without warning from a clear blue to a more dull grey. The sun was also mysteriously gone, but instead there were rows of enormous rectangular suns which showered the country of Germany in a bright light.<br>\r\n<br>\r\nAs about 100 million pairs of eyes began to adjust to the new light, they looked up and to their total horror observed the face of a smiling teenage boy of an impossible size! At this scale the boys face alone was as large as their entire country, and his body was about the size of the entire earth itself!</span></div></div>",
            "created":1335934800,
            "id":1328095,
            "title":"More Class"
        },
        "1133221112121":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Stephan closes the book on Nazi history and finds other playthings",
                "New York versus Nazi Germany!?"
            ],
            "content":"<div class=\"\"><div> <span>So preoccupied was Stephan with gloating over his new plaything that he scarcely even noticed the momentary pause in the class. He was oblivious to the fact that the decor of the classroom had subtly altered; that a couple of his classmates had been replaced by entirely different kids; that the hair of the girl sitting in front of him had darkened from light blonde to chestnut brown. He didn’t even care that the teacher had broken off with a confused expression on his face, as though trying to re-capture his train of thought. A moment later the man shrugged in puzzlement and returned to his intended topic of the greatest mystery in human history: the complete disappearance of the German nation in 1939.<br>\r\n<br>\r\nLittle did he know that the nation in question was even now laid out on a desk at the back of the class in front of his most troublesome student, miniaturized to an utterly minute scale and completely powerless despite its military build-up. In fact, so small was it that a casual observer would likely have mistaken the tiny nation for nothing more than some kind of novelty mouse mat—just the thing a school kid might own. Lying open on the desk next to the miniaturized landmass was Stephan’s history book, perhaps some 200 miles thick compared to the microscopic Nazis. And inside the textbook, where Germany had once appeared on the map, there was now just a blank space with a dotted outline marking its prior location. The text on the opposite page had also changed and now listed some of the most popular theories for the incredible disappearance of the entire country on the eve of what had been feared at the time to be a potential invasion of Poland. The theories were inevitably vague and unsatisfactory, but one of the more outlandish suggestions caught Stephan’s eye. He thrust his hand into the air, interrupting the teacher.<br>\r\n<br>\r\n“Sir! It says here that many people think GOD took Germany. What’s that all about?”<br>\r\n<br>\r\nThe teacher was slightly irritated by the interjection, but he figured he might as well answer since it was a rare event for Stephan to show any interest in class.<br>\r\n<br>\r\n“Certain more vocal religious groups have speculated that Germany offended the Lord with its wicked nature and was therefore completely removed from the world.”<br>\r\n<br>\r\n“Removed?” asked Stephan innocently and with a slight smile on his face. “You mean, like God just reached down and grabbed it? Why would he do something like that.”<br>\r\n<br>\r\nThe teacher frowned slightly at the boy’s simplistic description. “I suppose the Church believes that it was to punish Germany.”<br>\r\n<br>\r\n“Wow. So he just took a whole country full of people. Like it was nothing. That’s so cool.” Stephan smiled again and glanced briefly down at the country in question. Under the desk his crotch was throbbing from the sight of the “toy” nation and the casual way in which he had played the part of “God”. Now he just needed to complete the theory by \"punishing\" it...<br>\r\n<br>\r\nThis time the teacher’s frown was clear and unmistakable. “ ‘Cool’ is hardly an appropriate word, Stephan. Remember, thousands of innocent men, women and children vanished along with the Nazi regime. And that’s why this theory is so ridiculous—do you think they also deserved to be punished by God?”<br>\r\n<br>\r\nStephan didn’t bother to answer: he was too busy studying the phenomenal detail of the miniature landmass before him, with its miniscule geography and cities like sprinklings of dust. Those of the microscopic population who were brave enough to look up at the country-sized face of the teenage boy would have noticed a momentary glow in his eyes. Once again there was a slight pause as the world around Stephan reshaped itself to adapt to a slightly different version of history—one in which all the innocent citizens were miraculously transported away to live their lives safely in neighbouring countries.<br>\r\n<br>\r\nAs the teacher returned to his lecture Stephan took a stick of glue from his school bag and applied a thin film of adhesive to the blank patch on the map. Then he carefully picked up the tiny country in both hands, doing his best not to crush too much of it beneath his colossal fingertips. It was so light and fragile that he knew it would take barely any pressure to simply snap it in two or grind it into a ball of dirt between his hands—but he had other plans, at least for now. Stephan concentrated instead and began shrinking the little nation once more. This time he deliberately made sure the process was relatively slow so that he could enjoy the sight of the once-huge landmass getting smaller and smaller by the second, and actually feel the sensation of it dwindling in his grasp. Soon Germany was tiny enough to rest on one hand, and by the time Stephan judged it to be small enough for his purposes the entire country was nestling right in the centre of his palm and was barely an inch across at its widest point. He was rock hard from the overwhelming sense of power and the knowledge that he had <i>millions</i> of people in the palm of his hand. Fighting an overwhelming desire to just close his fist around it and crush it he pinched the teeny little nation gingerly between the thumb and forefinger of his other hand, picked it up, and carefully lowered it down onto the page of his textbook, rotating and fitting it neatly within the dotted outline of where Germany—the printed version—had once been. The glue took effect immediately, holding the trillions of tons of abducted continental bedrock in place as though the landmass was as flimsy as a leaf or sticker (which of course it now was). The map of Europe in Stephan’s textbook was complete once more, but now with the actual, real, <i>living</i> Nazi Germany in place of the illustration.<br>\r\n<br>\r\nStephan leaned back, highly pleased with his work. Now the Nazis could have all the “Lebensraum” they desired and even spread out across the entire page if they wished, while the rest of the world would be spared. It amused the boy-god greatly to imagine the Nazi troops marching into Poland—to find just a vast bare expanse of coloured paper, populated only by micro-organisms. Perhaps that would be the true war for the now-microscopic humans: battling to survive against encroaching microbes and bacteria that threatened to devour them. Stephan liked the idea: it would certainly be more entertaining to study than World War II. He idly probed the inside of one nostril with his pinky finger and then carelessly wiped it on the map next to the German border, leaving a faintly glistening smear of mucus ready for the armies to blunder into.<br>\r\n<br>\r\nHowever, Stephan wasn’t known for his lengthy attention span and wasn’t sure if he could really be bothered to  continue playing with them. There were surely other toys to find...<br>\r\n</span></div></div>",
            "created":1337317200,
            "id":1340105,
            "title":"Stephan shrinks the country even smaller!"
        },
        "11332211121211":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "Stephen slams the book shut",
                "The book vanished! (Gutenberg never existed)"
            ],
            "content":"<div class=\"\"><div> <span>As Stephen began to grow bored with his new playthings, Hitler wasted no time in ordering his airforce into attacking the planet sized American boy who held the 3rd reich hostage. In no time, thousands of war planes took off into the air with the intention of bombing and firing at the teenage boy. But the planes were so minusculy insignificant that even a mote of dust was colossal huge in comparison. Stephen wouldn't even have been able to see them with a magnifying glass, and was unaware of their imminent attack.<br>\r\n<br>\r\nBut long before the planes could climb the hundreds of miles necessary to even reach his face, Stephen took a breath and within the blink of an eye the thousands of planes and their crews were sucked up and into his nostrils at an impossible speed. Some of the planes crashed and exploded against his nose hairs, or the interior of his nostrils, while others were \"fortunate\" enough to have a cushy landing in Stephan's nasal mucus which kept the pilots alive, but trapped their planes in his boogers. Hundreds of other planes were sucked into the depths of his lungs were they suffered similar fates.<br>\r\n<br>\r\nMeanwhile, Stephen was completely oblivious that he had just inhaled the entire Luftwaffe and had hundreds of screaming pilots trapped helplessly in his lungs and in his boogers. To Stephen this had just been a normal breath and he hadn't put any thought into it, but this seemingly trivial act had just annihilated the German air force.<br>\r\n<br>\r\nAs the teacher continued to drone on about Germany and its mysterious disappearance, Stephen was certain that snuffing the country out of existence was the right thing to do. Firstly, it was a fitting punishment for what the Germans had done (or were about to do), and secondly it meant he would never have to be bored about hearing about them ever again.<br>\r\n<br>\r\nTo that end, Stephen used his unlimited god powers and erased Germany and everything associated from Germany out of all existence so that instead of Germany having mysteriously disappeared in 1939, it now no longer existed to begin with.<br>\r\n<br>\r\nAs soon as Stephen made this change, the teacher's appearance changed yet again and now instead of English he and all the rest of the class now spoke Latin, and there were countless other changes in the classroom. But most importantly of all, the teacher was no longer droning on about Germany's mysterious disappearance in 1939.<br>\r\n<br>\r\nWith a grin on his face Stephen leered down at the tiny stamp-sized nation. \"Now there is just one more thing to get rid of,\" he said.</span></div></div>",
            "created":1357016400,
            "id":1499286,
            "title":"Stephan closes the book on Germany"
        },
        "11332211121212":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "Take the city out of his shoe and put it on the map",
                "Take the country off the map and put it in his shoe"
            ],
            "content":"<div class=\"\"><div> <span>The scale of the book was simply so incomprehensibly large that the millions of tiny Germans had no idea that their entire country had been glued into the textbook of an American teenage boy. They knew that their already minuscule country had been shrunken even further and placed somewhere, but they did not know exactly where. They could see the enormous face of the teenager looming over them, and this frightened them very much.<br>\r\n<br>\r\nBut Hitler was still very much in control of this tiny empire, and he ordered his troops to explore the areas beyond the borders of Germany to see exactly what was going on. From all four corners of Germany the armed forces answered the call, and moved out beyond the borders of their country and \"invading\" the strange territory surrounding them.<br>\r\n<br>\r\nTo Stephan or anyone who was normal sized, the pages of the book appeared to be perfectly flat, but to the tiny military it was a strange and uneven landscape made up of bright colored fibers which were each as large as the Autobahn! Little did the Germans know these fibers were actually the pulp of the fiber that made up the map of Europe on which they were now situated, and the bright colors were actually the ink.<br>\r\n<br>\r\nIn the west, the German army that was under the command of Erwin Rommel launched a \"Blitzkrieg\" attack through what would have been the Netherlands when the tanks and trucks ran into a strange sticky sea which the troops and machines quickly became bogged down and stuck. Unbeknownst to the German soldiers, this vast sea which covered the entire Netherlands was actually a booger that the giant teenager had carelessly wiped there just moments ago!<br>\r\n<br>\r\nThousands of Hitler's most elite troops and best tanks had been stopped cold by a kid's booger! Those who were trapped in the thick sticky mucus screamed and begged for their comrades to help them, but the mucus was 100 times stickier than super glue and the men who were trapped could not be saved. Many were lucky enough to just simply be stuck, but others slowly sunk into it as if it were quicksand and there they drowned to death in a country sized booger.<br>\r\n<br>\r\nUnfortunately, this wasn't even the worst of it. Unbeknownst to Stephan the booger he had just wiped was full of millions of microscopic organisms which had lived inside of his nose, but were now wrecking havoc on Rommel's army! Each of these Amoeba like microbes was as large as a tank and these massive creatures swarmed over the helpless Germans and swallowed them up like prey. The overpowered Germans fired back with their rifles and machine guns, and some even attempted to bayonet the large amoebas, but all of this had little effect. Only Rommel's tanks with their large explosive shells were effective against the booger amoebas and a massive battle ensued.<br>\r\n<br>\r\nRommel radioed in to headquarters and called in air support, which showed up minutes later and divebombed the Amoebas into oblivion. Instead of staying around and suffering more casualties, Rommel went against Hitler's orders and ordered his men to retreat back to the relative safety of Germany.<br>\r\n<br>\r\n*********<br>\r\n<br>\r\nMeanwhile, Stephan had been completely oblivious to the epic battle which had just taken place on his booger. He debated slamming the book shut and just squashing the entire German race into oblivion, but decided that would be a huge waste when he could have a lot more fun with them instead.<br>\r\n<br>\r\nAs his huge eyes looked over the map of Europe, he realized that aside from his booger there wasn't really anyone for his new toys to play with. Then he remembered the really microscopic city of New York which he had put in his shoe earlier. \"I wonder how they are doing?\" Stephan whispered softly to himself so his teacher and classmates wouldn't over hear.<br>\r\n<br>\r\nReaching under his desk, Stephan carefully peeled off his sweaty sneaker and peeked inside the dark smelly cave. \"Is anyone still alive in there?\" he said. \"I have some new friends for you to play with! Would you like to meet them?\"<br>\r\n<br>\r\nThere was two ways Stephan could go about introducing the city of New York and the country of Nazi Germany to one another. Which of these two ways does he choose?</span></div></div>",
            "created":1337403600,
            "id":1340349,
            "title":"New York versus Nazi Germany!?"
        },
        "113322111212121":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "Follow the Americans' POV.",
                "Follow the Germans' POV."
            ],
            "content":"<div class=\"\"><div> <span>Having only one country in the map wasn't enough to recreate WWII. They needed someone to fight against. However, instead of just recreating the WWII exactly the way it happened, he decided it might be more interesting to make a mix of times. WWII Germany vs nowadays New York. So, without giving it a second thought, he made the tiny city of NY appear on his book. He scaled it to about 2/5'' in size, so the tinies would all be the same size and the war would be more even. Even as it was a whole country against just one city, NY would be obviously much more advanced in technology, so it should make up for it.<br>\r\n<br>\r\n*********<br>\r\n<br>\r\nAs soon as Hitler and the Nazis found out that there was an American city nearby, they didn't hesitate to invade it. Sending the whole army against it, they swiftly began to destroy it even more. The last few survivors from Stephan's shoe ran in panic for their lives, trying to hide from the foot soldiers that patrolled the city looking for Americans, while also trying to avoid the bombing from the <i>Stuka </i>planes and the <i>Panzer </i> tanks. It wasn't looking good at all for the former biggest city in the world, and soon enough, the entire Nazi army was already inside it.<br>\r\n<br>\r\n*********<br>\r\n<br>\r\nStephen couldn't see what was going on in the micro-war, but he could only assume it was awesome. However, after a few minutes, he started to think about how the war might actually be going. NY was nearly destroyed by his shoe, and the Germans were already ready for war, so they most likely took the Americans off guard. He realized that the war on his desk was clearly one-sided. He couldn't allow that, especially since he was also American. He couldn't let Germany win.<br>\r\nAt first, he was tempted to simply lower his thumb and flatten Germany completely, but he quickly dismissed the thought. It'd be too fast, too easy, and too boring. So, instead, he decided to give the Americans a good edge in the war to help them prevail.<br>\r\n<br>\r\nStephen didn't want anyone else to know about his micro-scale war, so he could only use the dimensions of his own desk. Still, it would be more than enough. With just a thought, he expanded NY city's dimensions to match those of his desk, covering it completely. By then, Germany was only a mere fraction of the American city, located completely inside it. The teenage boy grinned down at his desk.<br>\r\n<br>\r\n\"Let's see how you deal with this now, you little shitty Nazis.\", he whispered to himself.<br>\r\n<br>\r\n*********<br>\r\n<br>\r\nJust when everything seemed lost for New York, the entire city and the Americans inside started to expand. Of course, as everything in it grew, to the perspective of the people in there it seemed as if it was the Germans who were shrinking. Everyone was very confused and shocked at first, as the sudden change of scenery took them all by surprise. However, being used to the continous size changing that the teenager did, it didn't take long to them to understand the whole thing.<br>\r\n<br>\r\nThe Germans immediately realized that things would get much more difficult for them. Even as they utterly outnumbered the Americans, each one of the Newyorkers stood over 300' in height. This meant that each one of them would take a lot of their firepower to take down.<br>\r\n<br>\r\nThe Americans, on the other hand, felt immediately relieved to see the Germans suddenly \"shrink\" to just over 1 inch in height. Since the whole size-changing craziness started, this was the first time that things started favoring them. Looking around at the floor, they could see that the diminutive Germans were just as confused as they were. But the Nazis' confusion turned to worry, while the Americans' one turned to joy.<br>\r\n<br>\r\nHow would things go from then?</span></div></div>",
            "created":1348549200,
            "id":1434809,
            "title":"New York vs Germany"
        },
        "1133221112121211":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "Continue from the perspective of a Black or Jewish American",
                "Continue from the perspective of an Asian or Hispanic American"
            ],
            "content":"<div class=\"\"><div> <span>The city of New York had been badly damaged by the teenage giant who had cruelly abducted their city and tormented them in his smelly sneaker. Many buildings had been reduced to rubble, and thousands if not millions of people had been killed. To make  matters worse, when the city finally did escape from the stinky shoe and the people found themselves in the light of day, they were immediately attacked by a vast army of Germans from WW2.<br>\r\n<br>\r\nEven though New York had the benefit of modern technology, there were very few soldiers in the city and very few weapons with which to fight back. Aside from the NYPD and Gangs there was no one in the city who could fight back against the invading Germans, so most people fled to their homes or simply surrendered.<br>\r\n<br>\r\nThe Nazis quickly began to round up all Black, Hispanic, Jewish, and Asian citizens and began to march them back to Germany where they would be put in concentration camps and used as slave labor before eventually being killed off.<br>\r\n<br>\r\nFortunately, before this could happen things suddenly changed and the city of New York as well as all of its people began to grow and grow, and as the city grew it began to swallow up the entire country of Germany. To the Americans it seemed as if the Germans were shrinking, but in reality they were exactly the same size and it was the Americans who had grown until each American towered over the Germans like a skyscraper, and the Skyscrapers of New York were the size of cities, and New York itself was like a continent.<br>\r\n<br>\r\nThe thousands of Black, Hispanic, Jewish, and Asian Americans who were being marched off into Germany suddenly found themselves towering like Gullivers over a vast landscape full of tiny buildings, Farmlands, roads, and people. The German soldiers who had been marching them at gunpoint were now the size of insects, and their puny weapons were now barely capable of even hurting them, let alone killing them.<br>\r\n<br>\r\nRealizing this, the American prisoners stopped marching and began to fight back. They didn't have any weapons, but because they were hundreds of feet tall they didn't even need any. The tiny German soldiers screamed in terror and began firing their weapons to no effect as the vast shadows of American shoes fell over them before squishing them deep into the ground. Even kids were so large that hundreds of Germans could be wiped out with a single stomp.<br>\r\n<br>\r\n</span></div></div>",
            "created":1349326800,
            "id":1440004,
            "title":"Follow the Americans' POV."
        },
        "11332211121212111":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "African American.",
                "Jewish."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one to follow, then?</span></div></span></div>",
            "created":1350190800,
            "id":1446800,
            "title":"African American or Jewish?"
        },
        "113322111212121112":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "Sarah.",
                "Jake."
            ],
            "content":"<div class=\"\"><div> <span>The Kohen siblings Sarah, 17 years old, and Jake, 15 years old, were already in Germany when the size changing occurred. Being boy and girl, they had recently just been separated from each other, in order to be taken to concentration camps. Then, all of a sudden, their entire surroundings started to diminish in size. Buildings, trees, and even the soldiers aiming at them, all got smaller and smaller fast. Before they could realize what was going on, Sarah and Jake, along with some other Americans, were now surrounded by hundreds of bug-sized Germans.<br>\r\n<br>\r\nThe first ones to react were the Germans, as they were the more startled ones by the change of scenario. Seeing their hostages suddenly shoot up to the sky made them realize immediately how threatening they could be now. So, without giving it a second thought, they started attacking the giant Jews.<br>\r\n<br>\r\nOne problem the Germans quickly found themselves into was the lack of powerful weapons. Not only were the military technology much less advanced at the time, but these soldiers were only taking unarmed hostages to concentration camps, which meant that their weapons were reduced to a few weak hand guns, like Walther P38 or Luger P08 pistols. However, they didn't have much choice, so they opened fire at the giant Americans, anyway.<br>\r\n<br>\r\nSarah and Jake, along with the rest of the Americans around, stared down for a few seconds at the tiny Germans attacking them. Jake was wearing jeans and sneakers, so the diminutive bullets weren't even felt by him. Sarah, on the other hand, was wearing shorts and sandals, so the pelting of Nazi bullets against her skin were surely noticed, even if they only felt like sparklers sparkles when they're held close to someone's hand.<br>\r\n<br>\r\nAfter the initial shock, both siblings reacted. Jake, being a teenage boy, immediately fought back against the Germans. Stamping on them as if he was standing on an ant hill, he used both his huge sneakers to attack his former captors. Seeing their attacks do nothing against him only encouraged Jake to continue fighting the people who were about to murder him.<br>\r\n<br>\r\nSarah, on the other hand, was just as angry, but her reaction was different. The tiny bullets tickled her feet and ankles, but she was in no mood of laughing. Annoyed by the constant tickling of the German weapons, she stamp on them a couple of times, to at least decrease the amount of tickling on her feet. But instead of staying to fight, as her brother did, she immediately thought about the concentration camps they were about to be sent to, and about all the Jews already held captive there.<br>\r\n<br>\r\nWithout hesitating, Sarah stepped over the ring of soldiers surrounding her and proceeded towards the nearby concentration camps, intending to release as many Jews as possible before they were killed.<br>\r\n<br>\r\nWhich sibling do we follow now?</span></div></div>",
            "created":1350190800,
            "id":1446869,
            "title":"Sarah and Jake."
        },
        "11332211121212112":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "Asian.",
                "Hispanic."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We need to pick one of these before continuing.</span></div></span></div>",
            "created":1350190800,
            "id":1446799,
            "title":"Asian or Hispanic?"
        },
        "1133221112121212":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "Follow the ones who stay.",
                "Follow the ones who look for Hitler."
            ],
            "content":"<div class=\"\"><div> <span>A few minutes before the sudden size change took place, the Germans had already found and arrested most of the Americans in the city. However, before they could even start taking them back to internment in Germany, right there, in the city's streets, their prisoners soon started to grow in size. And not just them, but the buildings, cars, and everything else around them. Still aiming their guns at the expanding Americans, they soon had to back away to avoid being bulldozed by the expanding motion of their captives' feet.<br>\r\n<br>\r\nAfter just a couple of minutes, every American had grown to just over 300' in height. The German soldiers were still aiming their guns at them, but they weren't sure what to do next. There was a moment of tension, as everyone in the city was still trying to overcome the surprise. The tension, however, was broken by a few Americans shifting their feet, which startled the already jumpy Germans, who started to fire their guns. <br>\r\n<br>\r\nThis immediately got the giants' attention, who, startled at first, a few seconds later were simply amused. The men couldn't even feel the almost microscopic bullets pelting against their pants and shoes, while the women (only the ones who wore open shoes and skirts or shorts) could barely feel tickles on their bare skin. The Germans, even after seeing how inefective their attacks were, kept firing at the massive Americans, not knowing what else to do. Some of them immediately started calling for back up, but most of them just kept emptying their guns on the giants.<br>\r\n<br>\r\nThe pointless German attack was suddenly halted by the Newyorkers' reaction. After a few minutes of watching, amused, as the Nazi soldiers tried in vain to hurt them, American men, women, and even kids started the counter-attack. Some of them crouched or bent down and tried to grab handfuls of tiny German soldiers, while others, too angry to keep toying them, simply started attacking them.<br>\r\n<br>\r\nThe Germans, of course, started to panic. Some kept fighting, while others simply tried to escape. The Americans, on the other hand, started to split into two groups. One, trying to go find Hitler and teach him and Germany a lesson, while the other stayed there and simply kept toying with the Germans, as they waited for Panzer and Stuka backup.</span></div></div>",
            "created":1348635600,
            "id":1435488,
            "title":"Follow the Germans' POV."
        },
        "11332212":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Earths turn?",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>*Knock,Knock*<br>\r\n<br>\r\nStephan slightly jumped with surprise and looked at the door. The hinge slowly turned and a friend of Stephan's Ben Collins had walked in .Stephan was relieved that it wasn't a teacher as he would have some explaining. <br>\r\n<br>\r\n\"Where is everyone Steve?\" Ben causally walked in the door to Stephan desk. <br>\r\n<br>\r\nStephan began to panic and resulted in a half faith \"I don't know\" It wasn't really  satisfying but Ben ignored it an sat down on the deck next to Stephan.<br>\r\n<br>\r\nBen was the same age as Stephan but was much smaller then him. He wore a football jersey and some shorts. Ben was hispanic and had a cute face with short brown hair.<br>\r\n<br>\r\n\"Wanna go to my house later?\" Stephan asked. <br>\r\n<br>\r\n\"Ya sure!\" Ben said immently.The two talked on and on. But Stephan still had the City in his palm.Ben not even noticing it <br>\r\n<br>\r\nThen something catched Stephan's eye. Ben was wearing  brown sandels. Stephan gazed as Ben talked on about sport wiggling his toe's. Stephan knew Ben was small but even though quite popular wanted to be bigger then everyone else. The though ran through his head. And Stephan contued the conversion. <br>\r\n<br>\r\n\"Well I'm off my teacher is going to kill me!\" Ben sprung to his feet from the table. And was about to leave when Stephan snapped his fingers. Ben looked to see his friend cheerfully smilling away and so he left.<br>\r\n<br>\r\nBut he was not alone as on his sandal lay a teeny little speck of dirty right infront on his sweety big toe. This teeny microbe of dirt was infact New York City! Once a trilling metropolis was now reduce to a speck of dirt on a 13 year olds sweet sandal. People had given up hope. As the city was doomed from the start. Massive quakes rocked the city as every foot step was a massive force. Then came the cities final few seconds. As Ben's titanic big toe that was now planet sized rows high in the air and down in milliseconds. The city full of sky scrapers was now nothing. As the city was now a scathed microbe piece of rubble between a few groves in Ben's toe print. Ben had  just ended life in New York and was total un a where of it! Stephan had now had other twisted idea's and plans...     </span></div></div>",
            "created":1294117200,
            "id":1029236,
            "title":"Knock on the class room door!"
        },
        "113322121":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Place the planet somewhere...",
                "Torture the planet by destroying it over and over."
            ],
            "content":"<div class=\"\"><div> <span>As Ben walk on carrying on with his normal day totally unaware that just killed everybody in New York and reduced  the once huge metropolis to microscopic dust under his immense sweaty big toe. Stephan watched from the window as his friend walked on his way. \"This is soo cool!\" Stephen proclaimed giggly as he thought of what devious mayhem he could cause next and with the powers he had he could do pretty much anything!  Stephan looked around the deserted class room for idea's on what he could possibly do next. Then as he turned face a large poster of the solar system giving  Stephan a wicked idea if it was anywhere possible. The young teen walked over to the poster looking at all the planets including earth. He then smiled to himself \"Imagine\" he said to himself glaring at the educational poster. Then suddenly as he snapped his fingers the poster magically warped and suddenly the planet earth in the plain 2d poster had completely vanish but instead a teeny earth was left between Stephen and the poster \" Awesome\" Stephan boomed from above a 7 billion sub atomic sized people looked up into the skies to see the truelly titanic head of Stephan. With all this excitement Stephan grabbed  the planet and pulled it in for a closer look but the tiny sphere was so fragile that Stephan godly fingers had crushed and crippled most of the planets surface killing a few billion horrified onlookers in the process. In a matter  of mere seconds the planet had turned into an apocalyptic wasteland as it destroyed itself under the immense strength of Stephan's   excited antics. \"Oh Shit!\" Stephan said as he was left with a ruined earth. Stephen searched and scanned  the planet up  little to no forms of life had survived. \"Holy Shit earth is so pathetically weak!\" With that Stephen snapped his fingers and the planet reformed to it's previous glory. All that was destroyed and ruined was rebuilt and remade in seconds and the planet refilled with life as the 7 billion inhabitants again looked up in sheer awe at the titanic scale of Stephen. \"This is so cool!\" As he swooped in for a closer look. Everything was so detailed it was inexplicable. <br>\r\n<br>\r\nMeanwhile in the tiny planet it was like a judgement- day scenario. The last 15mins was  undesirable....  First the sky suddenly changed instead of a light blue it was the face of devious teen boy. With in an instant with this godly sized being he destroyed the world in his bare hands accidentally and with no effort at all. A simple snap of this boys fingers reformed the broken planet bring back to live the countless billions of people he just massacred seconds previous for 'Fun' This boy was truly God....<br>\r\n<br>\r\n\"What todo with you next?\" Stephen at the bouncy-ball  sized planet. As everybody quaked in fear at Stephen..,<br>\r\n<br>\r\n   </span></div></div>",
            "created":1339131600,
            "id":1355426,
            "title":"Earths turn?"
        },
        "1133221212":{
            "author_id":"joemjackson",
            "author_name":"joemjackson",
            "choices":[
                "Softball sized",
                "Marble sized"
            ],
            "content":"<div class=\"\"><div> <span>Planet Earth was, yet again, sitting in the barely teen boy’s huge palm. Stephen poked at it with a finger, grinning that he could so easily push his former homeworld about. It rolled into his curled pinky and bounced back. “So I can do anything I want with you and you’ll just come back?” he asked. “Forever my plaything!”<br>\r\n<br>\r\n“NOOOOO!! HELLLPP!!!” People right along the side being used to flick a planet around screamed. Flesh-colored lines filled the sky as the world rolled in a crazy direction. The city of Stockholm ceased to exist. Nothing remained but a crater 100 miles across and 5 miles deep. On the rebound, the entire chain of Hawaiian islands were crushed into the Pacific Ocean. Then there was a ‘Panama Canal’ from Nicaragua to Columbia. Probably no people died when the center of Australia was hit, but the continent now had a mountain range over 50 miles tall.<br>\r\n<br>\r\nStephen couldn’t even tell that his play caused any damage. He merely giggled “Fun little toy! I could just do this all day! Earth was only grape-sized so there was quite a bit of room in the youngster’s palm. He didn’t know how many times he flicked the planet about, but finally Stephen got bored, pinched the Earth between thumb and forefinger and held it up to his face.<br>\r\n<br>\r\n“That eye must be as big as the world!” a stunned Bangkok resident declared. They could see it flicking about and the eyelid working.<br>\r\n<br>\r\nThe boy-god rolled his toy about between his colossal fingers and a thought occurred to him “I wonder if you bounce. This is a science lab. Bet no scientist ever tested Earth’s bounciness.” With that, Stephen clenched his fist around the planet and spun his arm around. As he judged it at top speed, Stephen’s hand opened…. And ****<br>\r\n<br>\r\n“What the f---!!” darkness enveloped the entire planet suddenly. The curse/question was on everyone’s lips worldwide. But it never quite finished for anyone on the helpless world. Light returned after maybe two seconds, but no one had more than perhaps one second to realize it as Earth simply SPLATted. All over…well, not that big a stain… the science classroom floor.<br>\r\n<br>\r\nStephen was quite put out by the result of his experiment. He scuffed the toe of his sneaker over the remains and complained “Didn’t bounce at all!”<br>\r\n<br>\r\n&lt;POP&gt; came a sound, followed by another &lt;PIP&gt; The remains of the splatted Earth disappeared. And, on the Solar System poster, the planet was there again.<br>\r\n<br>\r\n“Awesome!” the boy-god declared “Uhh…this time I think I want you to be…”<br>\r\n</span></div></div>",
            "created":1339218000,
            "id":1356623,
            "title":"Torture the planet by destroying it over and over."
        },
        "11332212121":{
            "author_id":"oslahin",
            "author_name":"Helping Hand",
            "choices":[
                "Stephan shrinks the Earth to microscopic size",
                "He decides to create a working \"model\" of the entire Solar System"
            ],
            "content":"<div class=\"\"><div> <span>“... softball-sized!”<br>\r\n<br>\r\nWhy a softball? In fact, Stephan’s keen eyes had already noticed something going on outside the window. A group of older kids were playing softball, and that gave Stephan a great idea...<br>\r\n<br>\r\nOnce again, Planet Earth and the seven billion people (more or less) living on it were transported into Stephan’s waiting palm. This time the tiny planet was enclosed within a transparent protective shield: the boy wanted to make sure the population survived for as long as possible. Nevertheless, while a good proportion of the southern hemisphere was saved from being crushed against Stephan’s palm, it was still cast into utter darkness, while the countries in the north could only look up at their new god’s face smirking down at them. Mass hysteria gripped the planet as it began to dawn on the miniaturized human race where they now were.<br>\r\n<br>\r\nThey didn’t have to worry about it for long.<br>\r\n<br>\r\nThe Earth abruptly vanished from Stephan’s palm... only to reappear in the grip of another, even bigger titan: the pitcher of the softball match. A fraction of a second later the tiny Earth was launched into the air and send flying towards the waiting bat. If the batter was aware that the previously white softball had changed to a mixture of blue, green and white he certainly didn’t have time to react, except by instinct. He hit the “ball”.<br>\r\n<br>\r\n*THWACK*<br>\r\n<br>\r\nThe tiny Earth was instantly obliterated by the force of the bat, exploding in a messy shower of dirt, water, and minute blobs of semi-solid magma. The shocked kids crowded round the debris in confusion, poking at the fragments with their toes, unaware they were crushing the shattered remains of entire continents beneath their sneakers.<br>\r\n<br>\r\nStephan laughed uproariously at the sight, totally loving the prank he had just played on an entire inhabited world. It made him all the more eager to experiment further.<br>\r\nThe rest of the afternoon was nothing less than a living hell for the human race—at least that “copy” of the human race that Stephan had brought into being to be his personal toy. The boy-god brought them back again and again at a variety of different sizes, only to be destroyed in some cruel and inventive manner. Not only that, he also arranged for the memory of each catastrophe to carry over: the human race was fully aware of every punishment that had been inflicted upon them while remaining utterly powerless to prevent the next.<br>\r\n<br>\r\nOver the next couple of hours Stephan dropped the tiny planet into a beaker of acid and watched it slowly dissolve; he used a pen to scrawl “I AM GOD” across several continents, crushing everything underneath; he used a straw to suck up all the oceans... and then finished by sucking up the atmosphere (and much of the population) too. After that last little game he decided to experiment further by turning the Earth into a ball of candy, with a soft strawberry filling replacing the core. He popped the teeny planet inside his mouth and sucked on it thoughtfully. Of course the population died almost instantly, but Stephan was more interested in savouring the unique flavours of the continents as they were abraded away by his tongue and dissolved in his saliva. To his disappointment the planet felt surprisingly bland beneath his taste-buds. He’d hoped to enjoy the fragile textures of the mountain ranges and ocean trenches, but sadly even the tallest mountains on Earth were so microscopically tiny by comparison to the boy-god that the Earth might as well have been a highly-polished pool ball, completely without discernible features. Oh well.<br>\r\n<br>\r\nAs a punishment for that disappointment the Earth’s next destination was inside the mouth of one of Stephan’s buddies. Mike was busy scarfing down a bag of M&amp;Ms and it took but a casual flick of the fingers for the planet to rematerialize inside the bag. Stephan then watched as Mike tipped the remainder of the bag into his mouth and smiled in satisfaction as the teeny Earth rolled between Mike’s teeth and was crushed a moment later beneath a gigantic molar.<br>\r\n<br>\r\nStephan brought the games to a conclusion by wandering into another Geography class. He wasn’t really supposed to be there, but who was there who could stop him? Moreover, the teacher, Mr. Wheezely, was a short-sighted old dinosaur who was counting the days until retirement. And his desk was an ordinary classroom globe, of the kind that were used in schools everywhere...<br>\r\n<br>\r\nA boy sitting at the back of the class was unexpectedly reduced to half a millimeter in size right where he sat and Stephan slid into his place, crushing the tiny mite without a second thought. Instead, the boy-god focused his attention on the globe and was rewarded a moment later by a slight gasp and low murmurings from the rest of the class. Now the actual planet Earth rested on the teacher’s desk, with a metal bar, thousands of miles long, punched right through the poles and core to hold the little thing in place and allow it to be casually rotated. <br>\r\n<br>\r\nAnd rotated it was.<br>\r\n<br>\r\nAgain and again Mr. Wheezely’s hand descended from the heavens, sending the tiny Earth spinning helplessly. Each time his hand touched the surface it gauged immense trenches across the continents, while towns and villages, along with millions of people, were scooped up to find new homes deep under the already-dirty fingernails of the shambling, short-sighted old Geography teacher. Each time his finger stabbed down to point out the location of a major city, that entire metropolis was obliterated in a trice. Los Angeles, New York, London, Tokyo... all were nothing more than tiny little specks ground into dust beneath a mighty fingertip.<br>\r\n<br>\r\nAt the end of the class many of the kids went up to the desk to examine the mysterious blue and white globe... but by then it had changed back to its original form. The actual planet was now in Stephan’s cupped palm where it belonged. By now he was starting to lose interest, but maybe there was time for one final prank.<br>\r\n</span></div></div>",
            "created":1339650000,
            "id":1359882,
            "title":"Softball sized"
        },
        "113322121211":{
            "author_id":"chozo_ghost",
            "author_name":"Chozo",
            "choices":[
                "The teacher doesn't care. Back to the matter at hand",
                "The teacher does care. Stephan sends the entire class on a field trip."
            ],
            "content":"<div class=\"\"><div> <span>Stephan opened up the desk that belonged to the poor kid now squished beneath his ass and pulled out a microscope, as well as a glass slide, some tweezers, and a scalpel. Holding the scalpel in one hand between his fingers, he carefully sliced into the crust of the Earth roughly along the equater. As he did so, molten magma oozed out and sizzled and steamed as it collided with the oceans.<br>\r\n<br>\r\nStephen cut the Earth in half and placed each of the halves flat side down on the microscopic slide, which he then placed under the microscope. He now could view any side of the pea-sized planet without having to rotate it or worry about it rolling off the slide to its doom. Stephen then put his enormous eye to the microscope and adjusted the magnification so he could make out countries, and even cities in great detail. Just as if he were viewing an image from a satellite.<br>\r\n<br>\r\nWith the tweezers Stephen could delicately move around both of the worlds hemispheres to his liking, and there was no where on the planet that could escape his view, and with his God like powers he could boost the microscope's magnification to nearly infinite zooming, which means he could even zoom in on specific people if he wanted to.<br>\r\n<br>\r\nThen Stephen remembered the ruined city of New York sealed inside the dark smelly prison of his shoe, and wriggled his sweaty toes in delight. What if he were to check on that city and take it out of his shoe and place it on the slide to see how it compared to the miniature planet?<br>\r\n<br>\r\nAs he was pondering this, a girl seated next to him realized he wasn't supposed to be using the microscopic, and indeed he wasn't even supposed to be in this class at all. \"Mr. Wheezely!\" exclaimed the girl, drawing the teacher's unwanted attention.<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1339736400,
            "id":1360329,
            "title":"Stephan shrinks the Earth to microscopic size"
        },
        "11332212122":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Teleport the earth Inhabitants away from the planet ",
                "Destroy the planet "
            ],
            "content":"<div class=\"\"><div> <span>Stephen then looked at the large educational poster on the wall. He glared at the 2d print of the earth and suddenly once more with his infinite god powers he created a whole 3d earth thriving full of life (not for long) and the teen was amazed, \"This is too awesome!\" He boomed as the people of the tiny planet looked up in utter fear once more totally oblivious he ended another earth 'Toy' only a few moments ago. \"I'm Stephen your god! All bow to my supremacy you inferrer mortals!\" He boomed with joy once more. He was loving every minute of this as he begin to get a hard-on. The people of earth where in utter disbelief, shock and panic as Stephen glazed at the sphere menacingly. \"Your a bit  big for my liking,  like the other one maybe..\" Boomed Stephen and as soon as the thought came into his head the planet shrunk down to a much smaller size before him causing a gleeful smile on the young 13 year olds face. \"This is awesome!\" Stephen boomed now much more ominous then ever before this was truly this planets God as many have up hope and bowed to the Titanic form the loomed over the planet. Massive nukes attacked Stephen up there damage was on such a microscopic level he didn't even notice. Moving his face in closer sent half of the planet into darkness as he could swallow the entire planet whole. Stephen playfully open and closed his mouth repeatedly in front of the planet  causing mass panic. He then pinched the planet by both poles. His massive fingers could crush the fragile planet as massive cracks on both ends of the planet oozed molten rock from them. The world was in distraught as Stephen had an idea. <br>\r\n<br>\r\nThis sent chills down 7 Billion spins as he started to laugh....<br>\r\n<br>\r\n      </span></div></div>",
            "created":1341032400,
            "id":1369812,
            "title":"Marble sized"
        },
        "1133222":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "He Shrinks It Even more",
                "Does Something Dirty?"
            ],
            "content":"<div class=\"\"><div> <span>Stephan then released he had science now!He grabbed his bag and without destroying all of New York ran to science. Stephan sneaked to the very back of the lab. Still the tiny city intact in the palm of his hand. The teacher was boring Stephan all ready and he looked around for things to mess with and occupy himself. Stephan then released that there was a scientific telescope right in front off him on the table. Stephan then looked at his hand and smiled. He then carefully slid the teeny city onto a glass slide nearby. Perfect the entire city of New York had been place dead centre of the glass slide that was the size of a large state or small country to a typical New Yorker. <br>\r\n<br>\r\nStephan then looked through the magnifying glass and saw every single sheer detail of New York. Every building unique in different ways some bigger,some smaller,some glass others stone. The list was huge and it was all Stephan's to himself. Stephan then slowly moved his finger over the city. Through the microscope it was like a would cover the city a hundred times over. Stephan just started to lower it but at the end pulled out just before he left New York end up dust. The teacher had noticed Stephan's antics but had just given up on him.<br>\r\n<br>\r\nStephan the enhanced the zoom greatly. He could see people on the streets! These would be germ sized to him they all seemed to be either looking up in awe at Stephan or on there knee's begging to there gigantic sized God. This was the power Stephan craved and it really got Stephan thinking!           </span></div></div>",
            "created":1294462800,
            "id":1031716,
            "title":"Take it to science class and put it under the m..."
        },
        "11332221":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "He Eats NYC ",
                "His micro-sized snack is interrupted "
            ],
            "content":"<div class=\"\"><div> <span>Stephan then felt the urge to shrink the city again! Smaller and smaller from looking at a single street at 130x magnification Stephan had the whole city insight. The city was truly small now. It was 0.001mm and barely visible to the naked eye. Stephan had the microscope on the highest level and the city was just visible! The people of New York it was a whole new world. Stephan voice seemed to echo and boom from the heavens everything is a treat to the city even an ant would crush the city underfoot. Stephan the slid the slide out from under the microscope. Every sub-atomic New Yorker looked to the heavens at the planetary Face of Stephan. The face of Stephan was the only visible sight for the city even with it looming over thousands of miles over head. <br>\r\n<br>\r\nStephan smiled at the speck that was once a huge,powerful city but now it was just the size of a microbe to a now huge,powerful kid! Stephan then decide that New York was doomed in every situation. <br>\r\n<br>\r\nStephan then heard a large rumble and looked at the stomach. Stephan was getting very hungry. Then Stephan lowered the slide to mouth level and licked his titanic lips in jester right in front on the now doomed city. The city might now even quench Stephan's hunger but opened his mouth wide. Stephan in fact was so large he could actually devour planets at this scale. Stephan stuck out his giga-sized tongue. He is about to eat it! </span></div></div>",
            "created":1294549200,
            "id":1031953,
            "title":"He Shrinks It Even more"
        },
        "113322211":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "All the class shrink!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Stephan then rolled his massive tongue out. Hot steamy water vapour rushed out of the dark abeyss that was Stephan mouth. Stephan then slowly tilted the slide to the down and moved it much closer to his mouth. Then in one swift movement he licked the glass slide covering all of it in seconds and now the teeny city of New York was a mere piece if dirt frozen in a ball of saliva on Stephan tongue. The people drown instantly. Then with a large gulp. The city was thrown down the thousands of mile drop from mouth to stomach in massive speeds. The saliva drop then splashed into the fire pits of acid the was Stephan's stomach. The city disintegrating on impact. Stephan rubbed his stomach in pleasure as he had just devoured the entire city of New York!     <br>\r\n<br>\r\nThis was too much for Stephan as all this ran to his head and he started to get horny all of a sudden. Stephan looked down as there was a large bulge clearly forming in his pants. Still more of these dirty thoughts ran through the head of Stephan. He was having an erection and it was slowly growing. Stephan stuck his hand down his pants he couldn't resist but then his sexual bubble popped as there was a snigger of laughter from the bench in front he looked as Liam was pointing childishly at Stephan pants. <br>\r\n<br>\r\n\"Hey Everyone Stephan has a boner!\" Liam joked and pointed as Stephan grabbed a book to cover it. Everybody turned and laughted Stephan blushed at all the face's of his class laughing but still all these sexual thoughts fuelled his erection. Then suddenly....          </span></div></div>",
            "created":1294549200,
            "id":1032325,
            "title":"He Eats NYC "
        },
        "11333":{
            "author_id":"tinybug94",
            "author_name":"TinyBug94",
            "choices":[
                "He ends it quickly and retries with a the world! ",
                "He messes around with the germ sized city a bit more "
            ],
            "content":"<div class=\"\"><div> <span>Smaller! Smaller! Stephan mumbled as the  city turned speck and further and further until it was nothing... <br>\r\nTo the inhabitants of the vast mega city they still couldn't believe what happened, one day they simply vanished ... There normal lives warped and changed forever. Within minutes of being teleported onto this 'boys' he demanded they shrunk faster! More! How could this happen! How was all this possible! The vast plane that was his hand only seem to stretch as the boys features simply became more ominous and powerful.  The people of the city held each other and prayed to there ruler and God! But Stephan didn't care... \"Wow holy shit your nothing to be NOW\" Stephen smirked and tired to inspect his palm but he couldn't even see the city! \"Holy shit i made ye runts WAY to small...\" Stephan looked at his hand and smirked he thought of what todo... <br>\r\nWith his other hand he snapped his fingers and the speck of a city was teleported to his feet... He looked down his toes wiggling his his black school shoes as he slips them off... His feet sweaty.. This thin black socks moulded around his soft young feet as he stepped down on the cold class floor... He looks down again... His cock tenting in his grey school papers as Stephan bit his lip... </span></div></div>",
            "created":1427778000,
            "id":1956892,
            "title":"He places it down on the floor next to his feet"
        },
        "113332":{
            "author_id":"awsmgy",
            "author_name":"unowen",
            "choices":[
                "His house",
                "The park"
            ],
            "content":"<div class=\"\"><div> <span>Stephan lifted his big toe and inch above the floor and slid his foot forward until it hung directly above the tiny city. \"Your city fits so neatly under my big toe. You're all so puny, it would be so easy to crush you all right here just by lowering my toe. Heck, I wouldn't even need to use my big toe.\" He raised his little toe and placed it over the city. \"Even my little toe could crush you without any effort on my part. And even that's too much for you! I could drop a toenail clipping on you and it would still be more than enough! You're all nothing to me!\"<br>\r\n<br>\r\nStephan raised his foot high above the city as its tiny inhabitants looked on, some screaming, some fainting, and others shuddering in anticipation. Then Stephan stomped his foot on the ground so that the city ended up right between his toes. The resulting impact turned every bit of glass in the city to dust, blew every building miles up into the air and tore up every last road. But the people, miraculously, remained exactly where they were standing.  \"In fact,\" Stephan said to the scared and confused people, \"you're so insignificant that it makes no difference whether you live or die; either choice is as good as the other. But since I'm a merciful god, and since you might still provide some entertainment to me, I'll let you live. For now.\"<br>\r\n<br>\r\nAs Stephan drummed his toes on the floor, the microscopic people were lifted up off the ground and flown towards his feet. They landed on the underside of Stephan's little toe, between the mountainous ridges that made up his toeprint. Stephan then tapped his foot on the ground a few times, which deafened the tiny people but didn't move then a single inch. \"This will be your home from now until the day I grow tired of you. If you want to prolong the time until that day comes, then I suggest you spend every second you can spare praying for my mercy.\"<br>\r\n<br>\r\nStephan picked up his sock and slid it over his foot, enveloping his little colony in darkness. \"That's all for now. I'll check up on you again in a few hours.\" Slipping his shoes back on, Stephan walked out of the classroom and went to...</span></div></div>",
            "created":1469768400,
            "id":2187831,
            "title":"Itty Bitty City under Stephan's  Godly Toe"
        },
        "115":{
            "choices":[
                "Shrink all of the cheerleaders?",
                "Go to the mall or the beach?",
                "More size choices please?"
            ],
            "content":"<div class=\"\"><div> <span> Stephan sees the teacher shrinking out of his clothes before him, becoming smaller and smaller until he finally stops at around two-inches tall. The entire shrinking process took about thirty seconds. After everything was done, Stephen saw the tiny two-inch tall teacher crawling naked out of his clothes. Stephen then looks down at the teacher, smiles wickedly, lifts up his foot, and crushes the tiny man like a grape, splat! He then wipes the tiny bloodstain off his shoe and leaves the room. Stephen then decides to have some fun with his new powers and keep the testes of his powers small before he goes global in a few months, maybe sooner. <br>\r\n<br>\r\n As he leaves the school and sees that, a small group of rather young but hot looking cheerleaders practicing in the old football field today. They are about two dozen young girls, and even a few young boys in the group. They school is running a cheerleading camp today for young girls and boys from the area. He knows that these young girls and boys are all between the ages of nine to thirteen years old because he sees his hot ten-year-old sister Amy and eleven-year-old Kevin, a handsome friend of hers among them. As he watches, the hot young flesh jump around, another thought crosses his mind. He could go to the beach or the mall too, but those young coed cheerleaders look temping. He decides too…<br>\r\n</span></div></div>",
            "created":1291266000,
            "id":1006912,
            "title":"The two-inch tall teacher. "
        },
        "1151":{
            "choices":[
                "Stuff Kevin and Amy down his pants",
                "He wants to see how they taste"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, do you mind if I join?\" \"Sorry, it's too late to sign up,\" one of the boys in the group said. \"Well, that's a shame, because now I have to shrink you.\" And with a snap of Stephens fingers, everyone on the field shrunk to a mere 1/2 inch tall. Stephen rounded them all up with his feet and sat down and trapped the entire group within his legs. \"Everyone in here,\" Stephen said as he pulled out a pencil pouch from his backpack. He allowed everyone to go into the pouch EXCEPT for Amy, and Kevin. This was he because he planned to...</span></div></div>",
            "created":1498366800,
            "id":2342780,
            "title":"Shrink all of the cheerleaders?"
        },
        "11511":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Front or back?</span></div></span></div>",
            "created":1516770000,
            "id":2444538,
            "title":"Stuff Kevin and Amy down his pants"
        },
        "115111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "kevin is going to ether be with amy or in the nuts that amy squirms against.",
                "lower kevin to the ground so he can be with the others"
            ],
            "content":"<div class=\"\"><div> <span>well the other's are fallowing there new gods orders stephan picks up kevin &amp; amy with his right hand and with his other <br>\r\nhand pulls his waistband away from himself then bring them to his face opens his mouth shoves<br>\r\nkevin in \"wai..\" and well he sloshes to an frow <br>\r\n\"now can you put me down stepan and don't hurt kevin please\" amy says stephan stops and moves his left hand to his<br>\r\nmouth sliping his index and thumb between his lips kevin still mumbling as he is retrived. <br>\r\nstephan's erection being ignored ever since they shrunk \"and now that kevin lubrcated we can get more intimate\" before amy could voice any conerns thow kevin was to shock at what he was seeing as stephan shoved his right hand in his pant up against his nut's amy's squirms were making stephans penis expand<br>\r\nas he's dick swelled and grow longer finaly as stephan's penis head poped free kevin couldn't hold back \"why are you doing this\" stephan's reply was simple kevin was lowering.</span></div></div>",
            "created":1531112400,
            "id":2516810,
            "title":"stephan's toy "
        },
        "1151111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "kevin is prest against stephan's dick slit",
                "kevin is shoved againststephan's balls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"kevin we're going to have fun\".<br>\r\n<br>\r\n<br>\r\n<br>\r\nps i wish there was 8 choices.</span></div></span></div>",
            "created":1531137120,
            "id":2516813,
            "title":"kevin is going to ether be with amy or in the n..."
        },
        "11511111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "stephan puts amy with the other and walks out of the room like noth ever happend",
                "stephan hears foot step's out in the hall where the classes of all ready?"
            ],
            "content":"<div class=\"\"><div> <span>stephan lowered kevin to the huge penis head and reoriented his hand so kevin was face to face  with the slit of his penis  \"no you can't dwm.\" before there was time for kevin to replay he chin deep and now stephan's balls where pulling up slowly stephan's balls where rolling up amy's body.sephan  lightly prastest kevin's shaolder's in now that kevin was shoulder deep stephan alny had to hold kevin well his cock slowly fourst kevin pre starting to pool in his urethra kevin sqeerming trying to make stephan lose his grip he could try to pop his head free from this monster but try <br>\r\nas he stephan's balls where hungry. <br>\r\nstephan ever so slightly pushing kevin in an some times humping in an out but as kevin's hip enter stephan let go and <br>\r\nlet his dick consume kevin and ones the slit was at kevin's knee's stephan <br>\r\nremoved kevin's shoes and started to slowly rub up his shaft an down with his free hand <br>\r\nstarted rubbing his pen horizontally to an fro to lub his sounding tool and then <br>\r\nslowly inserted it in the slit after kevin and slowly pushed it in to help kevin by pushing on the soles of his foot and finally<br>\r\nas kevin's contour on the under side of stephan's dick slowly disappear at the base of stephan's erect spire.<br>\r\nstephan remove slowly removed his pen free of the slit an kevin's movement's felt nice but as time weren't on his movement slowed<br>\r\nand eventually stopped all together curious so he stuck his left hand in his pant's to feel around his fat lopsided ball's he could barely feel kevin                                                                            <br>\r\namy now unable to move out from under stephan's ball's with kevin's added weight.<br>\r\n\"werd well amy\" stephan reaching into his pant's with his right hand and lifting his balls with his left so he could fish amy out <br>\r\nfrom under stephan's full left nut and after rising both hand's out of his pant's \"thank you stephan where's kevin?\" amy asked<br>\r\n\"he's in my special place don't worry\" stephan replied. amy \"asks you're special place wheres that?\" <br>\r\n\"between my lags and if you want be in my special place i'll let you but i don't know how to get him out besides i'm sure he'l be fine\"<br>\r\namy was to shocked to reply and stephan waited a sec for a reply but nothing came.<br>\r\n</span></div></div>",
            "created":1532256660,
            "id":2523253,
            "title":"kevin is prest against stephan's dick slit"
        },
        "115111111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "stephan run's up stair's for some privecy",
                "as stephan's walking home some one run's up to stephan "
            ],
            "content":"<div class=\"\"><div> <span>putting amy with the other four stephan walked to his next class keeping an eye on the other<br>\r\nstudent's to make sure they wouldn't try to open his backpack it's an other wise uneventful<br>\r\nschool day with it only being second period <br>\r\n<br>\r\nafter school <br>\r\n<br>\r\nwalking home with his old brother an sister the walk home was silent other <br>\r\nthen kevin's likely liquefied body sloshing around</span></div></div>",
            "created":1538507100,
            "id":2557986,
            "title":"stephan puts amy with the other and walks out"
        },
        "1151111111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "pick's up one the football player name mitchal",
                "some one speaks out"
            ],
            "content":"<div class=\"\"><div> <span> after you're sister unlocks the you run down the hall an turn right then turn up the stairs to a big room an four doors <br>\r\nand the closest door to stephan and set his backpack down next you're bed. taking out the<br>\r\npen pack an placing it in a three feet tall plastic cylinder <br>\r\nunzipping the pen pack amy an the other pet human's started step out the <br>\r\nstress could be seen on there face's <br>\r\nmitchal\"look\"he say's nervously \"why don't you let us go if you are wearily\"<br>\r\nstephan  focusing on mitchal said \"okay then if i let you alone walk around my room and you run past the door hinge<br>\r\n i won't let you out of my sight\"<br>\r\nmitchal &lt;gulps&gt; hard yes i will stay in this room.<br>\r\n</span></div></div>",
            "created":1538512680,
            "id":2558026,
            "title":"stephan run's up stair's for some privecy"
        },
        "11511111111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "amy threat's stephan",
                "every one try's to make a human pyramid"
            ],
            "content":"<div class=\"\"><div> <span>picking mitchal and setting him down on the bed mitchal running stephan's left <br>\r\nan looking off the bed to his right was a trash bin stephan gets on his and removes his<br>\r\npant's then grab's mitchal an places him in front of his huge ball's <br>\r\n\"rub my ball's noW!\" <br>\r\nmitchal looks up at stephan and with tears says <br>\r\n\"you said that I COULD LOOK AROUND\" stephan just roll's his eye's \"yes and <br>\r\nyou still can after\" mitchal just stare's \"AMY..told US WHAT <br>\r\nYOU DID... to kevin\" Mitchal starting to run to the edge of the bed but stephan was faster and <br>\r\npicked mitchal up to his mouth an with out even trying to explain how he wasn't going to hurt mitchal or the ether's stuffed his mouth and waited<br>\r\nfor mitchal to get tired with in less then 15 minutes stephan swallowed it felt nice since he hadn't <br>\r\neaten in 2 hours stephan sighed \"you know mitchal for all the panicking was worth<br>\r\ni wasn't going to kill you but i'm still not tho if you live till super maybe i can extract <br>\r\nyou if not well maybe you need company\"</span></div></div>",
            "created":1538517960,
            "id":2558059,
            "title":"pick's up one the football player name mitchal"
        },
        "115111111111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "wait till supper maybe go play games... a social site... sleep? ",
                "make small talk with you're three inch pets "
            ],
            "content":"<div class=\"\"><div> <span>\"stephan you can't lie to us you just want to eat us\" stephan just laying there in thought<br>\r\nafter a minute of laying on his bed stephan get's up and walks to the trash bin and pick's<br>\r\namy out of the crowd \"amy we will never be apart this way\" before for stuffing amy into his mouth<br>\r\nfor all the sports mitchal did he wasn't very filling but that didn't mater <br>\r\namy and mitchal have to get cosy with stephan's gut.<br>\r\nlooking down stephan noticed a small soft lump where amy an mitchal. all 8 student's an 3 teacher's <br>\r\nlooking up past the rim of the bin they where trapped in at the moving lump in stephan's naturally flat stomach &lt;hic...brauup&gt; </span></div></div>",
            "created":1538520840,
            "id":2558070,
            "title":"amy threat's stephan"
        },
        "1151111111111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                " his mom has a feast of many diffrent foods ",
                "tephan is't hungery but as he step's out side he sees a crow an drools"
            ],
            "content":"<div class=\"\"><div> <span>after a half-minute stephan decides to take a picture of him self with <br>\r\nhis six-centimeter lump of amy an mitchal in a half-hour <br>\r\namy an mitchal wouldn't even be visible <br>\r\nkevin on the other hand well at least he left a mark on my balls.<br>\r\nstephan turning his head left to the bin three feet away <br>\r\n\"don't get in there or i might have to enforce some rules\" <br>\r\nan lay down an talk to people on twitter<br>\r\nan with that stephan lost track of time looking at his phone time it had been forty minute's looking past his phone at his flat stomach  <br>\r\nan could feel the content's of his stomach sloching about with the faintest of twitches they<br>\r\ncould make \"not much of a fight in ether of you o'well guess you won't last past supper\"<br>\r\nat five stephan's mother called for him mitchal at least sloushing thou <br>\r\nstephan's gastric track but stephan wasn't certain if it was both amy an mitchal </span></div></div>",
            "created":1538684820,
            "id":2559256,
            "title":"wait till supper maybe go play games... a socia..."
        },
        "11511111111111":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "ask you're dad what the biggest animal he ate",
                "stephan taking some scraps of food on his plate up to his bedroom "
            ],
            "content":"<div class=\"\"><div> <span>stephan having some ingestion Mitchel's fits of rag an waken up stephan the<br>\r\nnot shrinking yet but Amy was not moving much stephan getting out of bed an looking at his it<br>\r\n3:47 there fighting for space had upset Stephan's <br>\r\nstomach thou the more Stephan the more nice it felt <br>\r\nalmost jumping off the bed an quickly walked over to the bin an grabed one of the <br>\r\nteacher's more plump an scarfed her down \" you cammfft\" an with the small lump getting <br>\r\nstuck his collar bone a second or two then looking over the rest of the crowd stephan asked<br>\r\n\"what was her name\"<br>\r\n <br>\r\nan nervously with tears streaming his face \"her name was Isabella why would you even ask\"<br>\r\nstephan picking him \"so what is you're name\" nervously he said \"jack\"<br>\r\nstephan lowering jake \"what do you think Kevin\" Jake now shaking like crazy \"where is kevin\"<br>\r\nI'm glad you asked because he need's company so bye then shoving jake head first into his<br>\r\ndick where there was an 2 centimeter opening Jake's head poping in an then his shoulder's<br>\r\nstephan letting go of his dick an Jake both falling to the ground where jake was slurped the<br>\r\nrest of the way but before he was gone stephan held his dick up his drooling dick<br>\r\nan take a picture of jake it was nice to have souvenir to remember them by.<br>\r\nplacing a lid on the bin an his study books stephan was confidant that there was no way<br>\r\nfor them to get out then jumping back on his bed an squishing his kevin in liquid form by<br>\r\naccident then masturbating until<br>\r\n<br>\r\nsupper was ready his mom giving a yell an stephan put his pant's back on Jake was probably not<br>\r\nhaving a good time the flexing of Stephan's ball's an the pant's 2 time's worse<br>\r\nbut finally at the bottom of the stairs stephan started walking to the front door<br>\r\nhis elise \"honey aren't you going to eat?\"<br>\r\n<br>\r\nstephan replying with \"no there was a bird outside the window that keep peaking at the an i opened the window to shoie it away but then it got in an well <br>\r\n<br>\r\n\"stephan turned around the moving lump's weren't that large his just smiles \"you know you're dad was the same way never saw him eat a whole other animal but there was usually a lump a bit bigger \"<br>\r\n&lt;groan..growl... burble  &gt; stephan walks over to the table an has a seat twelve minutes later Stephan's belly swollen to a half sphere squished between<br>\r\nhis leg's. &lt;BEuurp&gt; stephan looking over at his dad who had the most on his plate out of them all</span></div></div>",
            "created":1538693880,
            "id":2559288,
            "title":" his mom has a feast of many diffrent foods "
        },
        "1151111112":{
            "author_id":"coldshell",
            "author_name":"icest drake",
            "choices":[
                "it's a teacher",
                "it's a student"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and they tap you on the shoulder </span></div></span></div>",
            "created":1538507220,
            "id":2557988,
            "title":"as stephan's walking home some one run'..."
        },
        "12":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Stephan Starts to wank",
                "Stephan starts to grew",
                "Stephan gets up",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span>There was silence Stephan's temparter had boiled and the two of then stood still until Stephan weirdly felt all his clothes getting much tighter.His toes ripped out of his shoes is tie shreded and each button off his school shirt was flung at his teacher at 10feet the teacher ran for is daft as Stephan burst out of his classroom. The school was in panic as Stephan's pant torn and he was left in his underwear. Stephan was loving it he was 50 feet tall but this was the beginning suddenly Stephan felt a strange tingle then out of the blue he shot up into the sky. There was no stop to the growth and Stephan was stunned.<br>\r\n<br>\r\nStephan final stop growing and he was now gigantic cities where mere grey spots and massive ovens where swallow puddles even Stephan could see the curvature of the entire planet but Stephan wanted power, he wanted to rule the entire human race the half naked boy then slammed his right foot onto American and the other in Europe killing hundreds millions of innocent people that where microsopic to him.<br>\r\n<br>\r\n\"I'm Stephan and I'm your God bow to me slaves!\" Stephan was power crazed and he slammed his massive foot down on the earth again. Billions of Rockets,Nukes and other warheads where useless to Stephan and the human race fell to the feet of the massive God Stephan. Millions of faces looked up to Stephan and worship his feet. Stephan then  needed to relax so he stretched out the whole of America  was covered by his light blonde hair but is was far worse as Europe was under is titanic ass chicks! And the rest of the world legs. Stephan was enjoying it but all of a sudden....</span></div></div>",
            "created":1286168400,
            "id":968519,
            "title":"Stephan starts to grow rapidly"
        },
        "121":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Snap! The world is back",
                "Sexy Crazied Stephan wants more",
                "Has more idea's"
            ],
            "content":"<div class=\"\"><div> <span>Stephan stretched out fully. His massive form covering most of the planets surface and his feet still hung over the edge of the planet Earth. But for the teeny inhabitants it was a true living hell as the Titan form of Stephan was so immense that even though Stephan lay relaxed on the planet. The now unnoticeable spices of the human race Stephan had killed them in there hundreds of millions. Every where in the world there was a towering body part of Stephan plotting out the Sun and crushing millions with no difficulty whats so ever. As this all happened and Stephan could fell it all happen. The once dominant people of the world where all now slaves to Stephan. Thoughts ran through Stephan's head of everyone worshipping him as there only god. Devoting there lives to worship him. <br>\r\n<br>\r\nBut soon all these evil and power crazed thought went to his head. And soon his already gigantic cock started to grow in size Stephan shifted slightly destroying pretty much all of Europe under his Ass checks with such ease the some most powerful countries on the planet where lifeless.Stephan looked at his underwear to see a massive bulge coming from it. The temptation got the better of the now horny God as he took of his mega sized underwear and threw it into space and covering the moon. Stephan he grasped his massive cock as it was now rock hard. Stephan moaned to himself simple thinking of all the power he has. The earth started to heat up as Stephan was letting of island sized droplets of sweat and soaring temperatures! Stephan shifted no more frequently as he was about to climax But suddenly he started to notice he was taking up more and more of the planet he was growing. Then a sick thought ran though his head moments before he cummed. He floated away from the earth. Then seconds later the planet was rocked as Stephan a kid who only hit puberty last year had managed to shrove his gigantic cock into the earth. \"I going to cum!\" Stephan shout as the earth was the size of a baseball. Crumbling as his gripped tighten.<br>\r\n<br>\r\nIn the space of seconds. Every volcano erupted all around the world but there was no lava but White cum! Every fault line cracked and billions of gallons of cum oozed out. The cum flooded countries all over the world. Stephan moaned in pleasure as  Billions drowned in the cum and where disintegrated by the now 100 foot long sperm cells. The sperm where so big that a few dozen could destroy massive cities and entire states with ease. The destruction didn't just stop there as the planet the was  blown to pieces as Stephan cock head out grew the planet and earth was no more. It was a sticky end to earth. And Stephan took a minute to catch his breathe. <br>\r\n             </span></div></div>",
            "created":1292821200,
            "id":1018704,
            "title":"Stephan Starts to wank"
        },
        "1212":{
            "author_id":"daemon12",
            "author_name":"godlyhorse",
            "choices":[
                "Go towards the moons?",
                "Screw the moons! He's going for the main course."
            ],
            "content":"<div class=\"\"><div> <span>Alex's eyes slowly steadied themselves as the godlike powers of his beings quickly gave back his breath, he thought whimsically, do gods even need to breathe? Of course not! He was idly thinking of repairing the Earth to mess with the inhabitants again but decided against it, after all, he can always just bring it back and have some more fun with it, and speaking of fun...<br>\r\n<br>\r\nAlex chuckled at the sight of his erect dick still not done yet, but hey he does have endless stamina, it would only be natural that he doesn't run out of gas, but now another problem has been brought to his attention, he still needed to get off on something, and the moon was too damn small for the pleasure he wants, he drifted away from the debris field of the ravaged planet, lightly stroking his dick as it twitched and leaked out pre as it was an angry purple, wanting to be filled once more.<br>\r\n<br>\r\n'Now which planet I want to fuck next?' He thought to himself, toes curling slightly at how badly he needed to jerk off again, he saw out in the distance, the Jovian moons of Jupiter floating out in its orbit, maybe he could use those, or just go and fuck the planet itself, who cares if its a Gas Giant, he's a Horny God and he needs to get his cock embedded in something to fuck.<br>\r\n<br>\r\nDoes he?</span></div></div>",
            "created":1457499600,
            "id":2115285,
            "title":"Sexy Crazied Stephan wants more"
        },
        "122":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Outgrows the entire universe",
                "Stephan plays with the universe",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"Well, slaves!\" Stephan bellowed again. \"You've been good and subservient to me so far--now it's time to say goodbye! I'm tired of this little planet--I want to be HUGE! It's time this universe recognized its true GOD!!\" With that, Stephan got up and  began to grow violently, shooting up hundreds of miles in mere seconds. The earth's curvature became more and more obvious as he towered higher and higher, hisevery motion causing endless disaster as he simply crushed and killed without even trying. The air displaced by his exponentially-growing body caused violent storms to sweep across the planet, his body already bigger than the entire earth<br>\r\n<br>\r\nThe planet was ruined, entire countries brought to their knees. Every surviver was utterly devastated, holes covering the area, entire cities and towns crushed, destroyed, or eaten, people broken and dead or living and fearing the god Stephan. The people emerged, hope finally blossoming in their hearts after all of this cruel destruction.<br>\r\n<br>\r\nThen Stephan reappeared on the Earth's surface. His massive naked body was a sight to behold, and the power he now wielded was evident in his perfect shape and form. Not a single person who laid eyes on him had any doubt that this teenage giant was God, through and through. Stephan laughed as he looked out over the ruined planet. \"Man! I really did a number on you bugs didn't I? Well, good! This planet will make the perfect tool to test my new powers on!\"<br>\r\n<br>\r\nHe started to grow, his body stretching up and out, his feet doing damage on a massive scale without him even having to move. The humans ran and screamed, trying to avoid the massive appendages and ultimately failing as the feet bulldozed over them. Stephan was eager to see how much abuse this planet could take. How much weight it could withstand. Soon, his feet covered all of the United States of America. The country sank under his unfathomable tonnage, the ground shattering under the weight, magma already starting to rise up and consume the area, the oceans rushing over the land until there was nothing left. Stephan shook his head and said, \"This is the most powerful country in the world? What a load of crap! It wouldn't even make a good footstool for a god like me!\"<br>\r\n<br>\r\nHe moved on, still growing, his feet taking out entire countries in one step. He was a force of nature, a force that couldn't be challenged or stopped. The human race was at the whim of a cruel child who had gained mastery over the entire universe. Soon, Stephan had escaped the atmosphere, his massive upper body jutting out into space. Looking down, it was like he was striding over a road map of the world. He snickered at how pathetic everything looked from his height. He stopped moving and just stood on the most northern part of the planet, growing bigger and bigger, slowly crushing the world under his weight. He picked up the moon, still shaped as his face, and played with it like a human would with a ball. He inadvertently crushed it when he grew too big to handle it properly but merely created a new one and kept playing. He barely even had to think about it. Massive cracks started running over the planet, the core warping under the sheer weight of Stephan, magma flooding the Earth and turning it into a barren wasteland of destruction, the skies clouded by ash and smoke. All of this registered as nothing more than a pleasant tickle on Stephan's feet. He stepped off the Earth just before he smashed the thing into oblivion and sat down next to it. He slowly brought his feet together, rubbing the Earth between the enormous, soft soles, before bringing the feet together, smashing the Earth into dust. It was no more. The suffering of the human race had finally ended...<br>\r\n<br>\r\nAs if!<br>\r\n<br>\r\nWith a snap of his fingers, Stephan made the planet reform, all the humans present on it once more. Those who had been smashed or eaten back when Stephan  was merely hundreds of feet tall, now looked up in horror as the sky was filled with the eye of Stephan. That was all they needed to see. The malice, the cruelty, the joy of destruction in his eye was the same no matter his size. Some of the humans were sure they were still dead and this was their personal Hell. Others thought that Stephan was a second coming and was preparing to take them all to Heaven. Still others, and these were the fatalistic minority, knew what Stephan really was and were prepared to be a plaything for as long as Steve was interested in them.<br>\r\n<br>\r\nStephan sighed and gale force winds suddenly ripped South America apart. He laughed at how easy it was to harm the planet and said, \"I can't believe I used to live on this pathetic little mud ball! Look at it! Size of a baseball...\"<br>\r\n<br>\r\nHe suddenly grew larger. \"Size of a ping pong ball...\"<br>\r\n<br>\r\nHe grew larger still. \"Size of a marble! Pathetic! I can balance it on one finger!\"<br>\r\n<br>\r\nThe massive fingertip rose up and obliterated half the planet, the other half barely surviving as it ground to a halt in its rotation on Stephan's finger. He bellowed laughter at this and said, \"Damn! I barely have to do anything to destroy you microbes! But that's okay, because I can just bring you all back again!\"<br>\r\n<br>\r\nWith a mere thought the Earth was whole again. He shrank himself down until the planet was the size of a basketball to him. He held it in his hands and peered down at the people. Without him even having to say anything they were worshiping him as God. He nodded approvingly and said, \"It's about time you specks understood! I'm God and you all survive on a whim! Tomorrow I might decide the Earth is a rotten place and crush it! And then, if I'm particularly mean spirited, I might not even bring it back! But as long as you all keep worshiping me and do exactly as I say, there won't be a problem! Got it?\"<br>\r\n<br>\r\nStephan couldn't hear the entire world unite as one to agree with his proposal, but he knew they got the message. He crushed the Earth between his hands again, tearing huge chunks of it off and eating it, using various parts of his body to destroy it, until it was gone again. *Snap!* And there it was again, same as ever. He was loving every second of this. There was an entire universe out there for him to toy with. And he had all the time in the world to enjoy it!</span></div></div>",
            "created":1286168400,
            "id":968625,
            "title":"Stephan starts to grew"
        },
        "1221":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Stephan grows bigger",
                "More devouring of our universe",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>His growth began to pick up exponentially faster as he grew into infinity.<br>\r\n<br>\r\nPlanets practically disappeared in the blink of an eye, and stars quickly followed suit, though he could feel their heat tickling him, which would have made him laugh, but space is still a vacuum.<br>\r\n<br>\r\nGalaxies soon looked like tiny little disks and balls to the ever-expanding Stephan, and by accident, he destroyed a cluster of galaxies merely by squeezing them too hard with his Titan feet. Not thinking of all the lifes he so easily snuffed out, Steve watched as all of the universe, all of existance seemed to \"shrink\" to just a simple speck of light to Stephan.<br>\r\n<br>\r\nStephan let out the largest laugh since time began as the universe was a teeny flicker of light. Stephan gigantic body floated closer to the universe. Stephan the titanic god eye flickered side to side as he knew that every single piece of life was in awe at his titanic scale. The earth was million of times  smaller then an atoms electron to Stephan and from the milky way it was not even a cell! <br>\r\n<br>\r\nStephan thought what todo next. Until he got tempted to eat it. So he did  Stephan then opened his mouth. His breath was a galactic wave of steam as outer planet already where too fragile and tore up with the force.   Then  Stephan pinched the universe with two fingers dangling it over the black hole that was his month. Stephan rolled his out  and placed the universe on  his saliva covered tongue. The universe melted out over his tongue as galaxies perished in the taste buds of Steve. Then as a piece if food he gulped it down in one go. Stephan loved the taste of it surprisingly! Oddly a trillion year old universe tasted sweet and surgery. <br>\r\n<br>\r\nWith a snap of his fingers the universe reappeared. Then the intergalactic boy-god looked at the helpless speck of life and...</span></div></div>",
            "created":1291266000,
            "id":1006771,
            "title":"Outgrows the entire universe"
        },
        "12211":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Stephen STLL wants more ",
                "Stephen creates his own universe "
            ],
            "content":"<div class=\"\"><div> <span>Stephan smiled he was truelly what people called 'God' his titanic figure could pulverise the entire universe with ease and no effort whatsoever. The people of earth and other intelligent alien races watch in utter disbelief and awe of Stephan as his immense size made parsecs units mare subatomic micrometers. His godly body covered the skies of all the universe planets as the teen let out a giggle that shook time and space to the core. The face of Stephan glanced at the puny flicker of light 'with a evil and torturous smile. With a snap of his fingers he transported the universe to rest between his left foots big and second toe. These emense mountains of flesh where hundreds of times the size of the universe itself as it sits between the skinny toes of Stephan like a worthless insignificant piece of lint or toe jam. \" Let you god 'discover more your worthless universes and let them too bow to me in mercy!\" Stephan gloated to the speak on his foot and a booming wiggle of his toes shaking the universe playfully again.'<br>\r\n<br>\r\nWith that Stephan started to grow bigger and bigger! The universe sank deeper and deeper into Stephan massive toes as our universe became 'near microscopic to his Godly size. Stephen stopped his growth with teeny orbs all around his godly body. Hundreds of other universes looked up in utter awe as the size of this boy''demolished any size or length ever imaginable. \"IM YOUR GOD PUNY UNIVERSES WORSHIP YOUR GOD!\" Stephan boomed as he now towered above the various multiverses. He pinched and plucked the nearest multiverse he could see with his naked eye. The people of its earth looked up as it was swamped in darkness as he pulled his fingers together crushing and popping the universe as its billions of galaxies crumple to nothingness to the delight of the boy-god.'<br>\r\n\"IM AM YOUR LORD WORSHIP ME!\" As he swung his foot kicking hundreds of universe of into the oblivion of nothingness. \"HAHAHA WEAK AND PATHIC YOU MINUTE BUGS IM YOU GOD AND ALL WILL WORSHIP ME! </span></div></div>",
            "created":1339563600,
            "id":1358923,
            "title":"Stephan grows bigger"
        },
        "122112":{
            "author_id":"gigagod",
            "author_name":"Gigagod",
            "choices":[
                "Eat more!",
                "Have more fun destroying tiny universes!"
            ],
            "content":"<div class=\"\"><div> <span>Stephe laughed, shaking all of time and space to the core with his giggles, at how puny the universes were compared to him! He flexed, his slender muscles still small, but bigger than an entire universe! He grabbed a puny universe, crushing it against his small bicep, laughing wildly. He started walking through the sea of universes. His stomach rumbled slightly before he felt a bubble of gas coming up from where he'd devoured the universe. He opened his mouth and let out a thunderous burp that shook the very fabric of reality. \"BBBBBBBUUUUUUUUUURRRPPPP\". The 13 year old God Boys belch thundered through time and space, shaking it to its core. Hundreds of puny universes destroyed. He smirked. \"THAT WAS A GOOD ONE!\" He grinned at the fact that just by releasing air he could destroy entire universes. He smirked and grabbed a few universes, tossing them into his mouth. \"MMM. TASTY!\" He boomed, rubbing his abs, sending trillions of lives down to his stomach to become protein and nutrients for him. <br>\r\nHis sheer size and power was turning him on. <br>\r\nHe started to jerk off, his hands furiously stroking his cock. Despite being just 13, he was quite skilled in the art of pleasuring himself. He grabbed handfuls of universes and boomed \"PLEASURE YOUR GOD PUNY UNIVERSES!\" He crushed them against his colossal cock, trillions upon trillions of lives instantly ended against his cock, the \"remains\" of the puny universes acting as a lubricant. With a mighty moan, the 13 year old boy god came. His cum destroyed dozens of universes, his sperm cells destroying or swallowing up entire planets. Stephen panted, sighing. He thought about what to do next...</span></div></div>",
            "created":1498107600,
            "id":2340422,
            "title":"Stephen feels horny"
        },
        "1221122":{
            "author_id":"tinytopher",
            "author_name":"doglefox",
            "choices":[
                "Stephen watches his creation...",
                "Stephen summons a tissue and cleans his mess..."
            ],
            "content":"<div class=\"\"><div> <span>Ever a horny 13 year old, Stephen started masturbating again. He grabbed a handful of universes every stroke, giving himself indescribable pleasure at the cost of a quadrillion mortal lives!<br>\r\n<br>\r\nFinally, he came, and a flash of light erupted from his cock. It took a second for the Boy God to realize what happened, but when he did he laughed at it. \"My orgasm created a universe! Fuck, I love being god!\"</span></div></div>",
            "created":1532710860,
            "id":2525522,
            "title":"Have more fun destroying tiny universes!"
        },
        "12211222":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "Stephen summons a meal and mixes in some universes",
                "Stephen summons some sex toys to use with universes"
            ],
            "content":"<div class=\"\"><div> <span>The new universe made from Stephen were already furiously worshiping him. However, this God only saw the universe as a mess he made and deserved to be destroyed.<br>\r\n<br>\r\nStephen proceed to summon a napkin and have the strands of cloth rip apart entire galaxies until the whole universe was destroyed. Our Boy God wanted to supon more tools to destroy universes. </span></div></div>",
            "created":1556054520,
            "id":2649152,
            "title":"Stephen summons a tissue and cleans his mess..."
        },
        "123":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Stephan declares himself God ",
                "Stephan find more God powers",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span>Stephan was utterly power crazed with this whole experience. This was a sudden leap from being a young teen boy that went to school,played with teams and had normal friends. But now Stephan was much more then that! This young teen was God! He had infinite power of growth and other powers, massive cities being flattened and the joy of ruling the whole world.<br>\r\n<br>\r\nStephan was up on his feet again after a short rest of a couple of minutes.  Stephan gazed at the thin mist at his toes and slammed down with all his force causing the clouds push out. On a global scale this single show of power was immense his left foot had ruptured the core and there was a massive crack in the shape of Stephan's foot left. Boiling hot lava spilled out in it's trillions of tons. It was like a country sized volcano had just started erupt but that was just one of the four elements that this created. The massive force of the foot created a earthquake so large it broke the ricter scale several times over. All over the earth. Shake could be Felt all around the planet, the sheer power of the drop of his foot was also causing tsumini's all around the oceans of the world small islands where soon lost by the waters. Finally massive winds where so large gale force wind felt like a breeze. This wind ripped skyscrapers out of there foundation and cars,people and smaller building blown away.<br>\r\n<br>\r\nStephan killed about 250 million people world wide in seconds it was so destructive the damage was utterly un-describle.Stephan giggle at the fact and turn his attention to his other God-Like powers. Stephan snapped his fingers and all his pervious damage was no more the millions of died even from his first growth where back from the died. It was a miracle in itself by only to find there view was of a titanic, power-crazed boy wasn't really a pretty sight.<br>\r\n\"Cool this is a nice little power\" Stephan said looking at the restored earth only to rampage through it even more! The death toll was in billions of people as each step ended millions of innocent lives so easily. The world was in awe at the sight of the discovery of there new God! </span></div></div>",
            "created":1292302800,
            "id":1015202,
            "title":"Stephan gets up"
        },
        "1232":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Lawing Down The Laws",
                "Grow Bigger",
                "Find Even More New Powers"
            ],
            "content":"<div class=\"\"><div> <span>Stephan then strolled to the north pole. The earth world in flames from his destruction. The world might have been made in 7 days but by God it was destroyed in under an hour in the hands of Stephan. A lucky surviver was a rareity the evil smile on Stephan's face was enough to tell you your fucked. <br>\r\n<br>\r\nStephan then snapped his fingers and all the flames disappeared and cities even entire countries reformed,rebuilt and repopulated. All gazing up at there yet again never ending hell on earth. Stephan then simply point to the tip top of the planet, the north pole. Thinking of what todo. There was a little rumble felt all around the planet and a gigantic stone chair rose from the planet. Stephan sits. Even sitting the scale of Stephan his toes could still crush the ends of the planet so there was no place to hide. Towering titanic toes wiggled over head so large they easily blotted out the sun People bowed and begged him for forgiveness but the teen showed no emotion to these puny human race. A person was a mere germ to Stephan and the teeny microscopic civilisations where nothingness to his Godly status.</span></div></div>",
            "created":1292389200,
            "id":1015494,
            "title":"Stephan find more God powers"
        },
        "12321":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Stephan Appoints A Demi-God ",
                "Stephan's bored"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nStephan cleared his throat and everybody gazed at the blonde God that relaxed in his chair that towered over the earth. Everybody didn't take there eyes off the boy. Then he spoke:<br>\r\n\"•I am Stephan and from now until eternity I am you Lord/God. •All must worship me for one hour a day minimum and devote all belongings to me<br>\r\n•I am Leader of every country there is to be no government <br>\r\n•Every country also must build a statue of me that has to be double the size of the countries tallest structure and every puny country bow down to it!\" <br>\r\n•All people who speak against me or have caused a crime must me sentenced to death.<br>\r\n•All must sign a oath of worship to Stephan.<br>\r\n•All must fear my power and super mercy only I can take your puny lives\"<br>\r\n<br>\r\nAfter Stephan had spoken he relaxed back on his chair and wachted the punny civilisations of the world get to work setting up whole new changes to there mortal lifes<br>\r\n</span></div></div>",
            "created":1292475600,
            "id":1016220,
            "title":"Laying Down The Laws"
        },
        "123211":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Yes",
                "Brother "
            ],
            "content":"<div class=\"\"><div> <span>Stephan was loving all this power but after a week at this size he soon became bored. He would often get up and rampage for no go reason just for is amusement killing again thousands. People felt a load of pain but had come to terms with him bring them back to life. There Stephan sat physically setting on top of the world having all this power but loneliness had won. Finally he had to appoint somebody as Demi-God to him. A minor God would be perfect,but who? There was so many. Maybe a friend? He did have a younger brother? Or even his on and off girlfriend?<br>\r\n<br>\r\nThe list was great but he soon thought of he best friend:<br>\r\n<br>\r\nDylan Folly<br>\r\nAge:14<br>\r\nHair: Short and dark black<br>\r\nDylan when Stephan was normal sized was very tall much taller then him. Even though Stephan was self-centred and Dylan was quite these two got on really well. Dylan has also a muscular build and is sporty. <br>\r\n<br>\r\nIs Dylan Stephan's true Demi-God or maybe a Brother? </span></div></div>",
            "created":1292475600,
            "id":1016274,
            "title":"Stephan Appoints A Demi-God "
        },
        "1232111":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Earth is your's im leaving to explore the universe",
                "Let the rampaging begin X2"
            ],
            "content":"<div class=\"\"><div> <span>Stephan rises from his seat. As normal the world gazed in awe at the sight of the teens body. Stephan look at the earth and billion looked at him. Then Stephan's voice boomed \" Dylan Grow\" This was confusing but there question would be answered in a couple of minute's. <br>\r\n<br>\r\nDylan was a typical normal boy. He went to school, played sports did the normal a typical boy his aged would do. But after Stephan's growth for Dylan it was all worship of his God friend. Dlyan was a speck to Stephan a person he towered over only a week ago. Now a days  he was spending time worship a 50 foot stautue of him. But then came the day. It was a call from the gods literally! The mintue the words left Stphans mouth. Dylan rapidly grew. Dlyan had no shirt on as it was very warn  and wore a pair of brown sandals and White shorts. Soon Dylan was as tall as the statue then bigger and bigger. Dlyan laught as his growth didnt stop at a mile mark in under a mintue. Soon a speck between Stephan's toe's was growing. Soon it was a  blur. Then basic features like hair,arms and leg. Dylan grew beyond the clouds. He looked down at his feet ,millions of people had now focused on Dlyan and a daunting smile plotted firmly on his face. Dlyan the saw the titanic face of his beat friend. Dylan had grown to half size of Stephan. <br>\r\n<br>\r\n\"World this is your Demi-God Dylan he too demands worship and has god power like me\" Dylan was in shock he knelt down to his feet to find large cities only grey plots of land. <br>\r\n<br>\r\nDylan was amazed with the whole experience. The amount of details was in the planet. Then Stephan Spoke....   </span></div></div>",
            "created":1292907600,
            "id":1019455,
            "title":"Rise of A Demi-God"
        },
        "1232112":{
            "author_id":"giant-g",
            "author_name":"Giant-gg",
            "choices":[
                "Yes",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Or maybe his younger brother Luke?<br>\r\n<br>\r\nLuke O Sullivan<br>\r\nAged:9<br>\r\nHair: Short,messy blonde hair<br>\r\nLuke was very like his older brother he had lightly tanned skin,Deep blue eyes and also got on really well with Stephan. They played together,laughed together and like the same sports. Luke doesn't have the same short temper as his older brother but can get hyper-active and giddy<br>\r\n<br>\r\nSo are we all going to me worshipping his younger brother or not?    </span></div></div>",
            "created":1292475600,
            "id":1016278,
            "title":"Brother "
        },
        "12321121":{
            "author_id":"hunky",
            "author_name":"LucasFan17",
            "choices":[
                "Bropage(brotherly rampage)",
                "More growing "
            ],
            "content":"<div class=\"\"><div> <span>Stephan stood up and his voiced boomend \"LUKE GROW\" Luke was in school bored out of his mind but that was all about to change. The moment those faithful words left his mouth Luke begin to grow. He grew past 5 feet 6 feet 7 feet. His clothes and blue shoes were all shredded during his growth. The only thing that was growing with him were his rockstar underwear. Luke laughed a evil laugh as he soon outgrew the school. He as 700 feet tall 800 feet tall 900 feet tall. He soon grew past the clouds at 100 miles. Soon he was the same height as Stephan and they were eye to eye. \"Well Bro\" what do you think asked Stephan. Of course Luke said in a booming voice \"HEELLLL YEAH\".</span></div></div>",
            "created":1503810000,
            "id":2375847,
            "title":"Yes"
        },
        "123212":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "Go out see what is in space",
                "Do some micro management on the world"
            ],
            "content":"<div class=\"\"><div> <span>The world that he sat on is his.<br>\r\n<br>\r\nHe could feel the fear he imposed on every single living thing on globe. He word, let alone his thoughts, were law of reality now...<br>\r\n<br>\r\nAnd Stephan was bored already by it.<br>\r\n<br>\r\nWhat else is there. Death and destruction of the planet was fun, but very limited. Any foolish mortal who dreamed of resistance of him was easily dealt with... but then Stephan took a look out the void that is space. So far and vast, he could just barely sense some other being out there that might be amusing to him.<br>\r\n<br>\r\nAnd being a god, Stephen can be omnipresent, anywhere and everywhere. He could have multiple bigger versions of himself in space, or smaller replicas of him all over the globe to remind the people of his powers, all of this while NOT leaving his throne upon the top of the world.</span></div></div>",
            "created":1425963600,
            "id":1946475,
            "title":"Stephan's bored"
        },
        "1232122":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "Giant Stephen at his home town",
                "Giant Stephen wreking around the world...."
            ],
            "content":"<div class=\"\"><div> <span>Stephen looked down at the world that he literally sat above on. <br>\r\n<br>\r\nThough he can see and feel all on the small globe from this position, Stephen wanted a more personal view the world. See the sites and lands. To be with the puny mortals that now have to pray to him to let them live. He wanted to be with mortal parents and friends, just to personally lord over them. He wanted to wreck places!<br>\r\n<br>\r\nSo with little to no effort. He just saw himself literally al over the world, and sure enough, duplicates of himself appeared out of thin air. Each one varyiong size, but all of them were the original Stephen who was still on his global throne. He was everywhere at once.<br>\r\n<br>\r\nBut the story will now focus on...</span></div></div>",
            "created":1427605200,
            "id":1955916,
            "title":"Do some micro management on the world"
        },
        "12321221":{
            "author_id":"dontaskdotcom",
            "author_name":"ringman77",
            "choices":[
                "One of his old friends looking at him slack jawed.",
                "A group of worshipers, praying to his giant self's toe.",
                "A group of protesters, vandalizing one of his statues."
            ],
            "content":"<div class=\"\"><div> <span>Stephan suddenly appeared in front of his old house, back at his original size. He decided that he wanted to have a little look around and observe how the world had changed after he established himself as god. After all he had all the time in the world to do what ever he wanted  so crushing the entire city under his pinky toe could wait just a little while.<br>\r\n<br>\r\nThe first thing that caught Stephan's attention was, well, Stephan! He looked up and saw a wall of flesh dominating part of the skyline, a single toe that was so massive you couldn't see where it ended. And beyond that Stephan could see the massive hazy image of the rest of his body including his face looming beyond the atmosphere. It was a truly terrifying sight, or, it would be if Stephan wasn't simply looking at himself. So Stephan simply looked up at his own massive face and smiled and waved, and his massive self looked down at Stephan and smiled and waved back. <br>\r\n<br>\r\n\"Man being a god is so freaking cool\" Stephan thought out loud, and turned his attention back to the immediate world around him. It was at this point that Stephan noticed...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1591042920,
            "id":2844256,
            "title":"Giant Stephen at his home town"
        },
        "14":{
            "author_id":"shadowed16",
            "author_name":"Danny23",
            "choices":[
                "He grows bigger",
                "He decides to jerk off"
            ],
            "content":"<div class=\"\"><div> <span>Stephen's muscles grew bigger, he felt unstoppable.<br>\r\n<br>\r\nIn just a few seconds his body became stronger than any man's body, but that wasn't the end of it... The teacher stood there in terror, as Stephen's face showed a powercrazed expression... He began growing... Slowly, but surely, just enough so he can enjoy it to the fullest. He chuckled as the walls around him crumbled down, crushing the teacher and some others who happened to be too close. He felt it everywhere in his body, the infinite power.... His height matched that of the empire state building. The growth stopped, he looked around to see tiny people stare in awe at the sight of his giant form, and perfect body. <br>\r\n<br>\r\n\"Run bugs, run or I'll step on you\" he said chuckling as he stepped out from the rubble left after his school building.<br>\r\n<br>\r\nHis first step killed a group of students, the second destroyed a police car, every step he took destroyed something or killed groups of people. He walked off towards the city, to show the world its new God. <br>\r\n<br>\r\nThe growth spurt made him horny, and destructive, even more than usual.<br>\r\nThe first building reached up to his shoulder in height, he just pushed it over with his right hand, also destroying the building next to it.<br>\r\n<br>\r\n\"Ha! That's all your structures can take?\"<br>\r\nHis voice thundered.<br>\r\nThe tiny people at his feet ran around in total chaos and panic.<br>\r\nHe stomped his right foot down, causing the buildings to crack, asphalt to shatter, people fall.<br>\r\n<br>\r\n\"This is too easy.\" He noted, as he joyfully crushed an apartment building by jumping on it.<br>\r\n<br>\r\nWhile he enjoyed his power, and played around with the little city, the army arrived.<br>\r\n<br>\r\nBy the time they got there Stephen wrecked pretty much every building in the central area of the city.<br>\r\nHe sat down to think about more cruelty he can do to the tiny people, when the annoying noise of a jet hit his ears.<br>\r\n<br>\r\n\"Ahhh... The ant army...\" He smiled.<br>\r\n<br>\r\nHe stood up, and watched as the tanks crawled closer. <br>\r\n<br>\r\nThey opened fire, aiming at Stephen's chest, and amazing six pack.<br>\r\n<br>\r\nHe didn't even feel it. \" Bow down and worship me!\" He said, but they didn't listen. He got angry again, and suddenly the tingling sensation was back...<br>\r\n<br>\r\nHe chuckled as he grew even bigger.<br>\r\n<br>\r\nWhen he opened his eyes, he found that skyscrapers don't even reach his ankles in height.  Lots of tiny cities around, waiting just for him to crush them. <br>\r\n<br>\r\n\"You tiny things look thirsty...\"<br>\r\nHe took out his gigantic cock and pissed all over america, killing every living thing on it. The ground tore up, the water resources all mixed with the yellow acid...</span></div></div>",
            "created":1482037200,
            "id":2251579,
            "title":"Stephen destroys everything"
        }
    },
    "info":{
        "author_id":"giant-g",
        "author_name":"Giant-gg",
        "brief_description":"Stephan thinks he is an average boy until he finds he is a god of size  with BIG results! ",
        "created":1272994440,
        "description":"<td align=\"left\" class=\"norm\">Stephan O Sullivan a troubled 13 year old with an undiscovered past . Stephan is skinny,short and has short blonde hair, his lightly tanned and big blue eyes.<br>\r\n<br>\r\nStephan is a major trouble maker and hates his school teachers as much as they dispicies him! He is noted for is destuctive humor and very sort tempar,So watch out! <br>\r\n <br>\r\nStephan also doest care about any other person other then himself and shows all the time too.<br>\r\n<br>\r\nBut underneath all this Stephan is a God! This<br>\r\n boy has the godly power to change his and <br>\r\nothers size with one look!<br>\r\n<br>\r\n Please add and make Stephan God! <br>\r\n<br>\r\n<br>\r\nLike this story? Message (PM) me idea's I would love to here from you and grow this story as big as Stephan himself :)<br>\r\n<br>\r\nWant to add a chapter but your idea isn't an opinion PM I'll be happy to add it in for you....<br>\r\n<br>\r\nI've a few non-interactive story's that lovers of this story would like do email me at : nottelling@europe.com <br>\r\n<br>\r\n</td>",
        "id":1670139,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1591042920,
        "modified":1591042920,
        "pretty_title":"Dicovery of the Boy-God"
    }
}