{
    "chapters":{
        "1":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "Himself",
                "Scott",
                "Stiles",
                "Corey who was walking by",
                "Nolan also walking up"
            ],
            "content":"<div class=\"\"><div> <span>Scott McCall was in his room with his best friend Stiles.  Both of them were staring in confusion at the young beta.  Liam held a strange looking gun in his hand.  \"I swear the guy who sold this to me said it was a size changing zapper\" Liam told them once again.  Stiles just shook his head in pity, \"Liam, Liam shrinking isn't physically possible.\"  Liam's eyes  twitched to look at his alpha \"What about growing\" he asked?  Following his line of sight the human imagined his best friend as a giant.  Truth be told it was an exciting thought.  \"Even growing isn't possible\" he bluntly told the young teen.  As he saw the joy leave the young werewolf's face.  He felt so bad that he had too look away.  <br>\r\n<br>\r\nScott surprised both of them when he spoke up.  \"We could try it out, I mean test it\"  Liam's smile returned instantly, while Stiles eyed his friend with suspicion.  Seeing the look Stiles was giving him.  \"Don't you want to see if it is true\" Scott asked him?  <br>\r\n<br>\r\nStiles thought it over \"We should go outside, so we don't wreck your house\" he told the others.  They both realized that was a wonderful idea.  All three left the room and made there way out of the house.  Liam held the gun tightly then raised it to.... </span></div></div>",
            "created":1540707300,
            "id":2569620,
            "title":"begin"
        },
        "12":{
            "author_id":"cakecup",
            "author_name":"cakecup",
            "choices":[
                "Liam listens to Scott",
                "Stiles doesn't think it's a good idea"
            ],
            "content":"<div class=\"\"><div> <span>Liam looked at the zapper in his hand then both of the other boys.  Raising it up he pointed it to Scott.  \"I think it should be you' he saw Stiles nodding in agreement.  He then pulled the trigger as he held his breath.  Stiles also held his breath as a beam was emitted from the device.  Scott was bathed in a greenish glow.  Stiles was in utter shock as he saw his friend start to grow up to 10 feet.  \"That is impossible\" he exclaimed.  Liam answered \"See I knew it would  work.\"  Scott looked at himself being 10 feet tall was kind of cool.  He looked all over everything was in perfect proportion.  He was just bigger, \"Hey Liam make me bigger\" he told his beta.</span></div></div>",
            "created":1540708740,
            "id":2569625,
            "title":"Scott"
        }
    },
    "info":{
        "author_id":"cakecup",
        "author_name":"cakecup",
        "brief_description":"A story where the guys from Teen wolf become giants",
        "created":1540704960,
        "description":"<td align=\"left\" class=\"norm\">The town of Beacon Hills has gone through its array of strange and mysterious things.  The next phase the town will go through may leave it in ruins.<br>\r\n<br>\r\nRule 1 Only Male giants<br>\r\n<br>\r\nRule 2 Only characters from the show can become giants, any add ons are welcome but cannot grow.<br>\r\n<br>\r\nRule 3 Having the character be OOC is fine<br>\r\n<br>\r\nRule 4 Death and Sex are acceptable<br>\r\n<br>\r\nRule 5 Breaking the rules of realty is also fine, as long as it fits within the narrative. <br>\r\n<br>\r\nRule 6 I may change add or alter any rules as i deem fit.<br>\r\n<br>\r\nWill give Gift points for additions</td>",
        "id":2173120,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1541586600,
        "modified":1541586600,
        "pretty_title":"Teen Wolf Giants"
    }
}