{
    "chapters":{
        "1":{
            "author_id":"doctor",
            "author_name":"The Author",
            "choices":[
                "Discovers morphing",
                "Discovers body swap",
                "Heads home",
                "Goes to  Kairi's",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Sora was getting ready to leave the Small Island for the evening and head home. Before he did though he figured he'd check the Secret Place, just to make sure everything was still fine. Everything was fine, but as he turned to leave something glinted in the corner of his eye. Deciding to take a closer look Sora approached the glinting object. On closer inspection it was revealed to be a crystal, kind of like a gummi only clear.<br>\r\n<br>\r\nThe moment Sora grabbed the crystal a powerful bolt of static leapt to his hands and when he looked again he saw the crystal was gone. \"What just happened?\" he asked to nobody in particular. Shrugging it off he headed for his boat and began making his way back to the main island.<br>\r\n<br>\r\nWhat next?</span></div></div>",
            "created":1276750800,
            "id":901426,
            "title":"Enchanted!"
        },
        "11":{
            "author_id":"night115",
            "author_name":"Handle",
            "choices":[
                "Go see Kairi",
                "Play with himself",
                "Try out his power more"
            ],
            "content":"<div class=\"\"><div> <span>Sora saw a bright flash, of dazzling blue light. it was blinding, truly bright. When it was over, sora was feeling dizzy, he counldnt find his bearings for a while, but eventually got there. \"Woah, err, what just happened?\" sora said, still stunned. \" well, whatever it was, its over now. I'd best get home\"<br>\r\n<br>\r\nSora lay in bed, feeling woozy still, and got out his scrapbook. He looked over it, all his pictures with his friends, and Riku and Kairi.<br>\r\n\"I really can't get over how pretty Kairi is... i really wonder what it would feel like to be her, even if it was just for a day...\"<br>\r\nSora blacked out, for an hour, as he slept, his body changed into the feminine shape of kairi's.<br>\r\n<br>\r\n\"Oh my head...\" he said, not realizing the changes now taken place in his body. Sora yanwed and looked down.<br>\r\n\"what the...?\" sora said \" why the hell do i have boobs?\" he Ran to his mirror, and got a big shock.<br>\r\n\"i-i-i'm Kairi!\" sora said in disbelive. \"i must have morphed into her! thats what the crystal must do!\"<br>\r\n\"Hey...if im kairi, then, what can i do?....\"<br>\r\n<br>\r\nSora decided he was going too...</span></div></div>",
            "created":1301288400,
            "id":1077767,
            "title":"Mega Morph"
        },
        "111":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "No one answers.",
                "Kairi isn't home, but the door's unlocked.",
                "Kairi answers and is shocked to see Sora as a twin of herself."
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm... Seeing as I don't exactly have a handle on this, and can't change back yet, I'll just have to go see Kairi about this, I'm sure she'd get me clothes and other things I need...\" Sora told himself aloud before he left his house. <br>\r\nThe new weight on his body, both from his boobs and his ass made for an awkward walk to Kairi's house.<br>\r\n<br>\r\nHe arrived at her house ready to ask her if she'd be willing to help him. In all honesty he knew she would help him, but she'd probably still be really shocked to see Sora as a twin of herself.<br>\r\nWell it was the moment of truth now...<br>\r\nSora knocked on Kairi's door...</span></div></div>",
            "created":1402030800,
            "id":1808237,
            "title":"Chapter 3: Pay Kairi a visit"
        },
        "1112":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Go to Kairi's room to try on some outfits.",
                "Cook something to eat in the kitchen.",
                "Kairi suddenly arrives back at home."
            ],
            "content":"<div class=\"\"><div> <span>As Sora knocked on the door and it opened by itself, meaning that either Kairi wasn't home and forgot to lock the door, or that someone had broken in. Luckily after an extensive search of the premises, Sora found no such intruder. <br>\r\nSo he decided to lock the door himself and wait for Kairi to return.<br>\r\n<br>\r\n\"Waiting around here is boring.\" Sora sighed to himself as he sat down on the couch in the living room. <br>\r\nHe looked around the living room and saw the door to Kairi's room, the guest room and the kitchen on the other side.<br>\r\n\"What can I do in the mean time?\"</span></div></div>",
            "created":1402030800,
            "id":1808243,
            "title":"Kairi isn't home, but the door's unlocked."
        },
        "11121":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Leopard Print Bikini",
                "Belly Dancer outfit"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what? I might as well try on some outfits while I wait...\" <br>\r\nSora then stood up and proceeded to exit the living room, entering Kairi's room...<br>\r\n<br>\r\nIt wasn't that new to him as he had been in there plenty of previous times when he would go to visit Kairi.<br>\r\nThe only thing he hadn't done, was look through her clothes. He was genuinely surprised to find some of the outfits he found in there...<br>\r\nHe put all of the ones He wanted to try on out on the bed and picked up the first two, looking them back and forth.<br>\r\n\"Hmm... Which one first? Leopard Print Bikini? Or the Belly Dancer outfit?\"</span></div></div>",
            "created":1402030800,
            "id":1808257,
            "title":"Go to Kairi's room to try on some outfits."
        },
        "111211":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Next Outfit",
                "Kairi gets home"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm... I think I'll go with this one...\" Sora held up the leopard print bikini and put the other one down.<br>\r\n\"Now to put this thing on.\" He smirked as he entered the closet to change into it.<br>\r\n<br>\r\nAfter several minutes of figuring out how to put it on, Sora finally emerged from the closet, donning the two piece leopard print bikini and swaying his hips back and forth like he was a model.<br>\r\n\"This is awesome!\" he laughed as he approached the mirror in the room. \"Kairi looks amazing in this... I'm surprised she hasn't worn this to the beach yet...\"<br>\r\nSora started posing sexily and dancing around the room, ( at one point grinding his body on a large lamp in the room) making sure he had his phone's camera to record his dancing and take pictures of him posing. Sora then stopped everything and looked in the mirror, down at every one of Kairi's curves... <br>\r\n<br>\r\n\"Damn I'm so sexy now. But this isn't the only outfit to try on. Hmm... What to try on next?\"<br>\r\n</span></div></div>",
            "created":1402030800,
            "id":1808273,
            "title":"Leopard Print Bikini"
        },
        "1112112":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Approach Kairi and tell her the truth, hoping she won't freak out and get mad.",
                "Continue hiding till Kairi leaves again and then leave."
            ],
            "content":"<div class=\"\"><div> <span>Before Sora could move on to the next outfit he was startled when he heard the door to the house open... \"Gotta hide!\" he panicked as he immediately ran into the closet and in the corner behind some clothing.<br>\r\n<br>\r\n\"I can't believe I left the door unlocked again!\" Kairi shrugged as she locked the door and looked around the house. \"Well no one broke in, so that's good.\" she sighed in relief as she entered her room and collapsed on the bed. \"Hmm? What's this doing here?\" she noticed her belly dancer outfit was on the bed. \"I could have sworn I stowed this in a good spot when I got it.\" she then opened her closet and put it back where it was, Sora holding his breath in as Kairi put it right in front of him and went out back to her room closing the closet door behind her.<br>\r\n<br>\r\n\"This is just great. What am I gonna do now?!\" Sora asked himself. He was still stuck looking like Kairi and was wearing her leopard print bikini. If Kairi saw him like this she'd probably freak out... \"There has to be some way out of this. But what? Hmm. Let me just way my options here.\"</span></div></div>",
            "created":1407042000,
            "id":1836924,
            "title":"Kairi gets home"
        },
        "11121121":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "A matching leopard print bikini",
                "A regular pink bikini"
            ],
            "content":"<div class=\"\"><div> <span>Sora took a deep breath. \"It's no use hiding... She's gonna find out eventually.\" Sora stood up and got out of hiding, as he opened the closet door his face reddened when he saw Kairi clad in nothing but her undergarments listening to music on her bed. <br>\r\n<br>\r\n\"Ahem.\" Sora coughed a bit just as Kairi looked up to see a twin of herself wearing nothing but a leopard print bikini. \"What in blazes?!\" Kairi stood up and removed her headphones, looking at her double confused... After she gave her double a glance around.  \"I still look good in that bikini.\" Kairi smirked and Sora blushed even more. \"...\" she looked her double in the eyes before finally putting two and two together, mainly from the necklace. \"Sora? Is that you? What happened?\"<br>\r\n<br>\r\nSora then explained everything to her in honest detail and sat down on her bed, looking down shamefully afterwards. \"Kairi... I'm sorry I took advantage of looking like you, I know it's wrong and that I-\" he was taken off guard when Kairi kissed him. \"It's okay Sora.\" Kairi stated as she strutted towards her closet. \"What are you doing Kairi?\" Sora asked, confused. \"You'll see in a second.~\" she giggled as she closed the door behind her. Sora looked rather puzzled at first, but then it made sense when Kairi walked out wearing...</span></div></div>",
            "created":1407042000,
            "id":1836936,
            "title":"Approach Kairi and tell her the truth."
        },
        "111211211":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "\"Turn Roxas into Namine and make him and Namine join us!\"",
                "\"Change Riku, so he can join the two of us!\""
            ],
            "content":"<div class=\"\"><div> <span>Sora's eyes widened when Kairi strutted out of the closet in an identical leopard print bikini. \"Well Sora, what do you think?~ We match now!\" Kairi giggled as she wrapped an arm around Sora. \"I-I er... Um.\" Sora didn't really know how to react to this. In the mirror were two Kairi's both wearing matching leopard print bikinis. <br>\r\n<br>\r\n\"I'm confused. You're not mad at me?\" Sora asked her as he turned to face her. \"Nope. Not at all! In fact I'm kind of impressed.~ Now I don't have to be the only one in our relationship that looks good in a bikini. Now we both can strut our stuff for each other!~\" Kairi grinned as she went in front of Sora and grinded her butt on his leg. Sora's face turning a deeper red as Kairi turned to face him, wrapping her arms around his waist and leaning forward, which made both of their breasts touch and press up against each other. \"I love you, Sora.\" she smiled as she kissed him. <br>\r\n<br>\r\nSora blushed at first but kissed her back. \"What now Kairi?\" Sora asked her as she pulled out of the kiss and strutted in front of the mirror and posed. \"First thing's first. These bikinis will be our new regular outfits.\" she told Sora. \"R-Really?\" he asked her. \"Yup. I kind of like em. Besides we both look rather ravishing in them, don't we?~\" Kairi asked Sora in a seductive tone. \"Y-Yeah.\" Sora smiled as she strutted over to the mirror and posed as well, looking at his and Kairi's curves. \"This is a sight I could get used to seeing every day.\" Sora chuckled a bit. \"That's the spirit Sora!\" Kairi smiled as she wrapped an arm around Sora's hip, which in turn made Sora buck her hip at Kairi's, much to her amusement. \"So, what's the plan now Kairi?\" Sora asked her again as she had a hand around Kairi's hip as well. \"I'm thinking that we could-</span></div></div>",
            "created":1407115800,
            "id":1837027,
            "title":"A matching leopard print bikini"
        },
        "1112112112":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Scolded them for changing him.",
                "Asked if he could join them in their fun."
            ],
            "content":"<div class=\"\"><div> <span>\"Wait really?! You know how to do that?!\" Sora asked her only to get a light slap on the back of the head. \"No silly, we're gonna use your abilities to change him. You can change others, right?\" she asked him. \"I think so... I haven't tried it, but it's certainly worth a shot.\" Sora nodded to her. \"Alright. So I'll call Riku up and tell him to meet up with me here... you're gonna hide when he gets here and change him when he's too distracted by me in my bikini.\" Kairi explained to him as she called Riku.<br>\r\n<br>\r\nIt was several moments later before a knock on the door could be heard. Sora immediately ran into the closet and hid, waiting to make his move... Riku had just entered the house. As Riku entered the house he called out to her, wondering where she was. He proceeded to check out every room till reaching her bedroom. <br>\r\n<br>\r\nHe was surprised to see Kairi clad in nothing but a leopard print bikini. \"K-Kairi... Wh-Why are you wearing that?\" he asked her. Kairi giggled a bit. \"You'll see in a second. Now, Sora!\" she signaled to Sora as Sora opened the closet door and looked at Riku, his eyes glowing a bit as well as Riku's, which caused Riku to start changing... A few moments later Riku's transformation was complete and he was now an identical copy of Kairi wearing his regular clothes(Which were too loose on him now). Riku looked up to his friends after feeling up his new body for a moment, realizing what their intentions were and-</span></div></div>",
            "created":1407283620,
            "id":1837879,
            "title":"\"Change Riku, so he can join the two of us!\""
        },
        "11121121122":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "\"Change Roxas into Namine and make him and Namine join us.\"",
                "\"Have a little more fun.~\""
            ],
            "content":"<div class=\"\"><div> <span>\"So... You guys changed me just so I could join you, right?\" Riku asked them, still trying to adjust the sound of his new voice. \"Yes.\" the two Kairis responded in unison. Riku was able to differentiate the two by their necklaces, Sora still had his crown necklace on and Kairi had her necklace on. \"So, where's my outfit?\" Riku asked with a smirk on his face. Kairi and Sora smiled at Riku and handed him a leopard print bikini. \"How many of those did you get anyway Kairi?\" Sora asked her. \"Enough.\" was her only response as Riku entered the closet to change into his new attire.<br>\r\n<br>\r\nRiku strutted out clad in the leopard print bikini and hugged both Sora and Kairi, all of their breasts pressing up against one another and Riku's hands on both Sora and Kairi's butts. \"This is rather nice.\" Riku admitted to his friends before turning his attention to Kairi and kissing her firmly on the lips, which made her giggle in response. \"Don't think you're counted out of this too, Sora.~\" Riku kissed him on the lips as well before turning his attention towards the mirror and posing.<br>\r\n<br>\r\nSora couldn't believe this sight for a moment. Looking at the mirror, he could see three Kairis clad in nothing but leopard print bikinis, the wildest part of the whole thing was that him and Riku made up 2/3 of the Kairis he was staring at. \"Thanks guys.~\" Riku smiled to his friends as he posed. \"Hey, anything for our best friend, right Sora?\" Kairi smiled. Sora was too busy checking Riku, Kairi and himself out in the mirror. \"Distracted, now are we Sora?\" Kairi giggled deviously and groped Sora's butt from behind, resulting in Sora moaning sensually.<br>\r\n<br>\r\nRiku couldn't help but laugh a bit at Sora, which resulted in Sora retaliating by going over to Riku and pulling him into a hug, their breasts pressing up against each other and both of them letting out a moan before Sora pulled out of the hug and giggled a bit at Riku's reaction. \"H-Hey! You moaned too you know!\" Riku countered as Kairi was just giggling at the two. <br>\r\n<br>\r\nSora and Riku smirked to one another as Sora went in front of Kairi and Riku behind her. Kairi seemed rather confused and a bit flustered by this before, Riku started caressing Kairi's thighs, making her moan a bit before Sora kissed her on the lips, Sora giggling after breaking out of the kiss and looking at a blushing Kairi.<br>\r\n<br>\r\n\"Alright guys, we need a plan for what to do next.\" Riku stated to his friends. \"I propose that we-\"</span></div></div>",
            "created":1407285240,
            "id":1837885,
            "title":"Asked if he could join them in their fun."
        },
        "111211211221":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Roxas exits the room and is furious.",
                "Roxas exits the room and likes his changes."
            ],
            "content":"<div class=\"\"><div> <span>The plan had already been set up and discussed. Roxas and Namine were invited over and Roxas would be lured away from Namine before he was changed.<br>\r\n<br>\r\nRoxas and Namine arrived at the house to oddly enough, find that the door was unlocked. \"Um, Kairi? You left the door unlocked.\" Namine stated aloud as she started to search the house. \"Roxas, you search as well.\"<br>\r\n<br>\r\n\"Got it.\" the blonde boy nodded as he started searching for Kairi. \"Kairi?!\" he called out before he entered the room he presumed to be Kairi's bedroom when the door suddenly slammed behind him. \"Wh-What?!\" he looked around when a Kairi, clad in a leopard print bikini, wearing Sora's necklace strutted towards him. \"Um... Kairi? What are yo-\" his eyes suddenly glowed when he looked into her glowing eyes.<br>\r\n<br>\r\n\"Not, Kairi.\" she responded simply as Roxas changed into an exact copy of Namine.<br>\r\n<br>\r\nRoxas looked down at her body in shock before she was suddenly tossed a leopard print bikini.<br>\r\n<br>\r\n\"It's me, Sora.\" she grinned cheekily.<br>\r\n<br>\r\n\"Sora?!\" Roxas seemed quite surprised by this as she felt up her new body, thinking that he was only changed into a girl and not Namine.<br>\r\n<br>\r\n\"You should put on that bikini. It is kind of the only thing that will really fit you right now...\" Sora stated as she turned and exited the room.<br>\r\n<br>\r\n\"Well... This is gonna take a while to get on.\" Roxas sighed as she stood up and started to change her outfit.</span></div></div>",
            "created":1414335480,
            "id":1877871,
            "title":"Change Roxas into Namine"
        },
        "1112112112212":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "I think you should change him back,",
                "I like it!"
            ],
            "content":"<div class=\"\"><div> <span>After several minutes of struggling, Roxas had finally managed to get the bikini on herself. She finally looked at herself in the mirror and was shocked to see that he had turned into a copy of Namine.<br>\r\n<br>\r\n\"Hmm... Not bad...\" Roxas smirked as she grasped her chest. \"These feel nice.\" she let out a giggle as she looked into the mirror. Roxas did find it slightly amusing to see Namine's reflection in the mirror, doing everything he was doing.<br>\r\n<br>\r\n\"You dressed yet, Roxas?!\" Sora called out to Roxas.<br>\r\n<br>\r\n\"Yeah!\" she responded as she exited the room.<br>\r\n<br>\r\n\"Looks good on you.\" Sora smiled at Roxas.<br>\r\n<br>\r\n\"Thanks.\" Roxas winked and posed before she followed Sora to the kitchen where Namine sat in a chair, clad in a leopard print bikini as well, talking with two other bikini clad Kairis. <br>\r\n<br>\r\n\"Oh, Roxas you're here!\" the Kairi wearing the real Kairi's necklace smiled.<br>\r\n<br>\r\n\"Roxas? Is that you?\" Namine asked her.<br>\r\n<br>\r\n\"Y-Yeah. It's me. I look like you now...\" Roxas blushed, looking down and away.<br>\r\n<br>\r\n\"Well? What do you think, Namine?\" Riku asked her as she sat next to her.<br>\r\n<br>\r\n\"Hmm... Well-\"</span></div></div>",
            "created":1414351860,
            "id":1877928,
            "title":"Roxas exits the room and likes his changes."
        },
        "11121121122122":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "The five of us can have some fun!",
                "Look for more people to change."
            ],
            "content":"<div class=\"\"><div> <span>\"I like it!\" Namine exclaimed as she approached Roxas and hugged her.<br>\r\n<br>\r\n\"Y-You mean you don’t care that I look like you?\" Roxas asked her.<br>\r\n<br>\r\n\"Nah… I think you look better this way.~\" she winked and slapped Roxas’ butt which made her let out a high pitched \"Eep!\"<br>\r\n<br>\r\n\"Namine!\" Roxas whined as she rubbed her butt and Namine wrapped an arm around her and walked her towards a mirror.<br>\r\n<br>\r\n\"Let’s have a little fun!~\" Namine giggled as she shook her hips and leaned on Roxas.<br>\r\n<br>\r\n\"O-Okay.\" Roxas nodded in agreement as she shook her hips as well, which prompted Namine to stop leaning on her and raise her arms.<br>\r\n\"W-Woah, you know how to dance?!\" Roxas asked as she mimicked Namine’s movements.<br>\r\n<br>\r\n\"Yeah!\" Namine grinned and shook her hips, continuing to dance. Roxas merely mimicked her motions, be it a bit more sloppy than Namine's.<br>\r\n<br>\r\n\"Hehe, well they seem to like their changes.\" Sora giggled a bit and turned to Kairi and Riku. \"What now?\" she asked her friends.</span></div></div>",
            "created":1423431540,
            "id":1929990,
            "title":"I like it!"
        },
        "111211211221222":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Change Terra and Ventus into Aqua",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"We should change some more people!\" Kairi exclaimed.<br>\r\n<br>\r\n\"But whom?\" Riku asked.<br>\r\n<br>\r\nSora stepped forward. \"Oh, I know! We could-\"</span></div></span></div>",
            "created":1423440600,
            "id":1930106,
            "title":"Look for more people to change."
        },
        "1112112112212221":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "They meet up with Aqua first",
                "They spring their trap on Ventus and Terra"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, let's change those three!\" Kairi agreed, giggling a bit.<br>\r\n<br>\r\n\"But when can we change them?\" Sora asked crossing her arms.<br>\r\n<br>\r\n\"They are about to go to the play island for a bit of a beach trip.\" Riku explained to her as Kairi messaged Aqua about it.<br>\r\n<br>\r\n\"Awesome, Aqua's on board guys.\" Kairi grinned.<br>\r\n<br>\r\n\"Sweet, let's get to work then.</span></div></div>",
            "created":1424105040,
            "id":1935091,
            "title":"Change Terra and Ventus into Aqua!"
        },
        "11121121122122212":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "The two exit the shack, begrudingly",
                "The two exit the shack, seemingly enjoying it."
            ],
            "content":"<div class=\"\"><div> <span>Terra, Ventus and Aqua all stepped out of their boat they took to the mainland and each of them took a nice deep breath of air. <br>\r\n<br>\r\n\"Welp, let's get ready for swimming.\" Ven smiled. <br>\r\n<br>\r\n\"You should get dressed first Aqua, Ven and I can wait.\" Terra assured her. <br>\r\n<br>\r\n\"Okay.\" Aqua nodded and entered the shack, where she was greeted by 2 Kairi's one had Kairi's necklace and the other had Sora's. <br>\r\n<br>\r\n\"You can go after them now.\" Aqua nodded as Sora went up the stairs and exited the shack on the second floor. Sora then peered over the dock to see Terra and Ven pacing around the Beach.<br>\r\n<br>\r\n\"Man, Aqua always takes so long to get dressed, why couldn't I have gone first?\" Ven asked. \"Because, then I'd be waiting alone for her to get ready.\" Terra retaliated before noticing someone on the bridge above them. \"Hey, is that Kairi?\" Terra asked as Ven looked as well. The Kairi on the bridge smirked as her eyes flashed as did Ven and Terra's eyes before their changes began.<br>\r\n<br>\r\nThey were soon turned into exact copies of Aqua. They both screamed looking at each other then their own bodies as another Kairi, wearing Kairi's necklace, exited the shack, handing them both leopard skin bikinis. \"You two still do want to enjoy the beach, right?\" she asked in a bit of a playful tone as the two of them seemed a bit unamused as Aqua exited the shack, wearing a leopard skin bikini with her wayfinder tied to the bottom with her arms crossed. \"Gotcha boys.\" She smirked.<br>\r\n<br>\r\nTerra and Ventus both sighed in defeat as Aqua followed them into the shack and helped them get their bikinis on...</span></div></div>",
            "created":1424105880,
            "id":1935095,
            "title":"They spring their trap on Ventus and Terra"
        },
        "111211211221222122":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "\"Lea and Vanitas into Xion.\"",
                "\"I think we got enough people for now.\""
            ],
            "content":"<div class=\"\"><div> <span>Terra was first to step out, a smile on her face as she strutted her stuff, her hips were swaying and her breasts were bouncing with each step, her orange wayfinder was tied to her waist as she posed with a hand on her hip. \"This isn't that bad.\" she pushed her chest out as she posed. \"Come on out Ven!\"<br>\r\n<br>\r\nVen was the next to leave the shack her face with a smirk on it as she strut over, enjoying the feeling of her breasts and butt jiggling with each movement she made. \"This is great!~\" Ven posed beside Terra, bumping their butts together as Aqua then came up from behind them and wrapped her arms around them. \"You're welcome boys!\" she then pushed all their boobs together.<br>\r\n<br>\r\n\"And another group down.\" Sora grinned to Kairi as the two then looked to each other.<br>\r\n<br>\r\n\"Is there anyone else we can change?\" Kairi asked.<br>\r\n<br>\r\n\"Hmm...\"</span></div></div>",
            "created":1463190120,
            "id":2147589,
            "title":"The two exit the shack, seemingly enjoying it."
        },
        "1112112112212221221":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "\"I think we can just have fun now~\"",
                "\"How about we ask the others if there's someone else to change?\""
            ],
            "content":"<div class=\"\"><div> <span>Roxas was more than happy to get involved in this one when she was offered as Lea was her best friend. <br>\r\n<br>\r\nVentus seemed a little hesitant when Vanitas was brought up, but figured that it'd be fun to mess with him this way.<br>\r\n<br>\r\nXion was ecstatic when Namine, Kairi and Aqua all brought this idea to her attention, for quite some time Xion thought that Lea needed a makeover and needed to relax a little after how stressful things were for him all this time. Vanitas on the other hand was someone she had to admit, she had a bit of a crush on... Sora's looks? Roxas's attitude? That just sounded perfect to her! So their plan began...<br>\r\n<br>\r\nLea and Vanitas simultaneously arrived at the house Xion told them to. <br>\r\n<br>\r\n\"What're you doing here?!\" they asked each other in annoyance before the door opened and they were greeted by a bikini clad Namine. <br>\r\n<br>\r\n\"Sup guys~\" she greeted with a wink.<br>\r\n<br>\r\n\"H-Hey...\" Vanitas was quick to follow her in while Lea was a little confused.<br>\r\n<br>\r\n\"Where's Xion?\" he asked as Xion soon made herself known as the door closed behind them.<br>\r\n<br>\r\n\"I'm right here boys~\" she was clad in a similar leopard print bikini to Namine. \"You're gonna get to have some fun with me now~\"<br>\r\n<br>\r\nA trio of Kairis then stepped out and the one in the middle's eyes began to glow.<br>\r\n<br>\r\nIn almost an instant, Vanitas and Lea were turned into copies of Xion.<br>\r\n<br>\r\n\"W-What?!\" Lea was more perplexed, especially when Xion handed her a matching swimsuit.<br>\r\n<br>\r\nVanitas on the other hand was giggling deviously as she took the swimsuit and went to change.<br>\r\n<br>\r\nXion led Lea along, taking her hand as they went to change as well.<br>\r\n<br>\r\nVanitas smirked, groping her nice and round butt as she was rather enjoying things.<br>\r\n<br>\r\nLea was a little slower on the uptake, but as soon as Roxas revealed herself, all concerned were immediately calmed.<br>\r\n<br>\r\nThe Trio of Kairis sat on the couch and looked at each other. \"So Think this is enough changes?\" asked Riku.<br>\r\n<br>\r\n\"Hmm I dunno you guys? Is there anyone we might have missed?\" Kairi asked.<br>\r\n<br>\r\n\"Good question.\" Sora looked to the others in the room whom were busy playing around with their new bodies, or the ones they turned into copies of themselves.</span></div></div>",
            "created":1565010300,
            "id":2697460,
            "title":"\"Lea and Vanitas into Xion.\""
        },
        "11121122":{
            "author_id":"blastgeass",
            "author_name":"Hei",
            "choices":[
                "Kairi was going to take a shower",
                "Someone was knocking on the door"
            ],
            "content":"<div class=\"\"><div> <span>'Well i don't want to get out there now. One it would freak her out and she would kill me or worse call the police. and two, me wearing nothing but a leopard print bikini is embarrassing. Even if she believed me that I was Sora she would probably embarrass me. Like make me go outside and wear this or make me kiss a guy.' Sora thought as he was blenching at the thoughts. So she waited until kairi decides to leave. She plans to take some of Kairi's clothes with her when Kairi leaves. Now she only has to wait. wait...wait...waiting...'I'M WAITING FOR YOU TO LEAVE!!!!!' <br>\r\n<br>\r\n'Kairi sure can read.' Sora thought as she was slumping down. just then a miracle had happened.<br>\r\n<br>\r\n<b>What was the miracle?</b></span></div></div>",
            "created":1421392980,
            "id":1918532,
            "title":"Continue hiding till Kairi leaves again and the..."
        },
        "111211221":{
            "author_id":"blastgeass",
            "author_name":"Hei",
            "choices":[
                "Continue watching Kairi",
                "\"Enough I Can't take it anymore!!!\""
            ],
            "content":"<div class=\"\"><div> <span>Sora was relieved. He saw Kairi stand up and stretching. and being the best friend/boyfriend that he was knew that was sign of hers that she will be leaving. Sora was ready to bolt soon. But stopped when she saw Kairi strip. Sora was blushing but couldn't find the will to move or get ready to leave. She just stayed watching her girlfriend undress and get ready to take a shower. <br>\r\n<br>\r\nSora was feeling weird n her stomach as she was feeling a warm feeling under her stomach while watching Kairi. <br>\r\n<br>\r\nWhat does Sora do?</span></div></div>",
            "created":1421437380,
            "id":1918735,
            "title":"Kairi was going to take a shower"
        },
        "1112112211":{
            "author_id":"alexgil77",
            "author_name":"Alex G",
            "choices":[
                "Hide further back in the closet successfully.",
                "Try to hide behind some clothes and fail horribly."
            ],
            "content":"<div class=\"\"><div> <span>Sora couldn't help his inner urges, he merely stayed there, watching Kairi undress, blushing as he still felt this warm feeling under her stomach. <i>So... Sexy...</i> Sora thought to herself as Kairi, whom was now in her underwear went towards the closet.<br>\r\n<br>\r\n<i>Oh no! She's coming here to get some clothes! Quick think of something!<br>\r\n</i><br>\r\nWhat are you gonna do now, Sora?</span></div></div>",
            "created":1423431780,
            "id":1929993,
            "title":"Continue watching Kairi"
        },
        "112":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Someone knocked on the door",
                "Decided to turn into someone else",
                "He turned back to normal"
            ],
            "content":"<div class=\"\"><div> <span> \" Might as well play with myself.\", Sora thought<br>\r\n \"First I should get out of my shirt\" he thought \"The moment of truth...\" He took off his shirt which was hard, since they were sticking to it tightly, which basically flew off  afterwards(He did think it was a bit tight), and his cleavage was released, now laying upon his chest. He walked over to the mirror. \"Holy crap\" he thought. They were huge! Like melons! He placed his and on the nipple, which was firm, and felt really good. He started rubbing them vigorously afterwards, just feeling the pleasure made him moan. \"yeah baby! Keep going!\" he said, his breasts jiggling madly. After a few minutes he decided to stop. <br>\r\n<br>\r\nA few moments later Sora was going to continue what he was doing, but then...</span></div></div>",
            "created":1340427600,
            "id":1365450,
            "title":"Play with himself"
        },
        "1121":{
            "author_id":"blastgeass",
            "author_name":"Hei",
            "choices":[
                "Riku",
                "Kairi",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Someone was knocking on his door. He was annoyed at the fact he was disturbed during his activities but he knew he had to get the door or the knocking was going to continue. He put his T-shirt and pants back on and went to check who it was. When Sora looked through the peep hole he gasped. It was ______<br>\r\n<br>\r\n\"Hey Sora you in there?\" The person behind the door asked. <br>\r\n<br>\r\nWho was it?</span></div></div>",
            "created":1402549200,
            "id":1811058,
            "title":"Someone knocked on the door"
        },
        "12":{
            "author_id":"shadow_lord",
            "author_name":"skyler00",
            "choices":[
                "Right now",
                "When the two of them are swimming (in their swimsuits)",
                "Someone else comes",
                "Sora says no",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>On the main island, he found Kairi waiting for him. \"Hey Sora, do you want to go swimming?\"<br>\r\n<br>\r\nFor some reason, something told Sora that he could body swap. He came to realize that the crystal gave him the power to swap bodies. This wasn't too surprising for him considering the crazy adventure he went though while fighting the heartless, Maleficent, and the organization. The only thing he could do now was decide when to use it. When?</span></div></div>",
            "created":1299387600,
            "id":1065990,
            "title":"Discovers body swap"
        },
        "122":{
            "author_id":"night115",
            "author_name":"Handle",
            "choices":[
                "A normal swimsuit",
                "A pink bikini"
            ],
            "content":"<div class=\"\"><div> <span>\"yeah, sure!\" said sora, anxious to tr out his power.<br>\r\n\"We'd best get changed then\" kairi. everyone brought there swimming gear, just in case, so they both had it on hand.<br>\r\n<br>\r\nSora waited for kairi, hoping his plan worked. she came out seconds later wearing...</span></div></div>",
            "created":1301202000,
            "id":1077217,
            "title":"The big switch"
        },
        "1222":{
            "author_id":"shadow_lord",
            "author_name":"skyler00",
            "choices":[
                "Go swimming",
                "Stick with Sora (in Kairi's body)",
                "Stick with Kairi (in Sora's body)"
            ],
            "content":"<div class=\"\"><div> <span>Sora drooled and thought to himself, \"Oh, what I wouldn't give to rub my hands over that body. I want to swap bodies with her, but how do I make it logical?\"<br>\r\n<br>\r\nHe dashed forward to Kairi and \"accidentally\" bumped his head into her. At that instant, he used his power and it felt like he shot out a shockwave from his mind to Kairi's. Sora rubbed his head and said, \"Oww, sorry.\"<br>\r\n<br>\r\nHe stopped and heard that he had a feminine voice. He looked down and couldn't see his crotch over his boobs. These were Kairi's boobs! He was in Kairi's body! He looked in front of him, and indeed his own body was sitting in front of him, mouth agape. Kairi screamed while in his body. Sora covered Kairi's (in Sora's body) mouth. \"Don't make me scream like a sissy!\"<br>\r\n<br>\r\nKairi knocked Sora's hands down, \"Well what do you expect me to do! You're in my body... it is you, right Sora?\"<br>\r\n<br>\r\nSora nodded. \"I'm not too surprised actually. What are we going to do?\"<br>\r\n<br>\r\nKairi thought to herself, should they continue swimming or split up and find out what happened?</span></div></div>",
            "created":1301202000,
            "id":1077237,
            "title":"A pink bikini"
        },
        "12221":{
            "author_id":"shadow_lord",
            "author_name":"skyler00",
            "choices":[
                "Speedo over underwear.",
                "Speedo alone"
            ],
            "content":"<div class=\"\"><div> <span>Kairi shrugged, \"We can try to find out the cause of this later. Let's just enjoy ourselves right now like we planned.\"<br>\r\n<br>\r\nSora nodded and pulled down his bikini bottom. Kairi scream, \"What are you doing!?!?\"<br>\r\n<br>\r\nSora looked at her strangely, \"I'm changing into my swimsuit.\"<br>\r\n<br>\r\n\"I already changed into my bikini for you!\"<br>\r\n<br>\r\nSora looked back down and saw Kairi's vagina. He blushed madly and pulled it back up. \"I'll- er.. I'm going for a swim.\"<br>\r\n<br>\r\nHe ran into the ocean. Kairi yelled after him, \"Don't do anything weird to my body! ...pervert.\"<br>\r\n<br>\r\nThen Kairi realized that she had to change Sora's body into a swimsuit. She blushed madly at this thought and saw that Sora was too far away for her to call to him. She peeled off his shirt and pants, leaving him in his sky blue briefs. She pulled out his navy blue speedo and blushed. \"Do I put on the speedo over the underwear or do I pull off my underwear then put on the speedo?\"</span></div></div>",
            "created":1301202000,
            "id":1077248,
            "title":"Go swimming"
        },
        "122212":{
            "author_id":"endoftime57",
            "author_name":"EndofTime57",
            "choices":[
                "Got them on in time and ran into the water.",
                "Heard Sora's voice call out to her while still struggleing."
            ],
            "content":"<div class=\"\"><div> <span>Kairi couldn't deny that her curiosity about the opportunity to see and feel a dick, <i>Sora's dick</i>, <i>as Sora</i>, was making her fell lite headed and new mouth water.<br>\r\n<br>\r\nGulping and snapping out of the trance she had been in for the last minute or so staring off into the distance and fantasizing, Kairi shut her eyes and braced herself, grabbing Sora's briefs, pulling them down in one fluid motion and stepping out of them.<br>\r\n<br>\r\nShivering at the feeling of the cool sea breeze flowing over Sora's now completely naked (and <i>verry male</i>) body, Kairi slowly faced downwards and peeked open her eyes.<br>\r\n<br>\r\n\"O-o....wow.\" she gasped, her eyes having been greeted upon opening to the sight of Sora's semi-erect cock and balls, hanging attached to her crotch between her new legs. <br>\r\n<br>\r\nKairi stared mesmerized, as the now unrestrained junk moved and shifted slightly, as she breathed in and out and shifted her weight slightly from foot to foot. \"I wonder...how it would feel...if I just...\" she mumbled.<br>\r\n<br>\r\nBiting her lip, slowly, tentatively, Kairi raised one hand and brought it down to wrap around Sora's dick, releasing a gasp at the new and unfamiliar, but pleasant feeling and watching wide eyed, as it quickly hardened to its full size.<br>\r\n<br>\r\nKairi was probably making Sora's face more red then it had ever been by now, standing there as she was with his penis grasped in her hand and enjoying the feeling having her first ever erection, before she rapidly paled, as her brain kinked into gear and all at once she became fully aware of her current situation.<br>\r\n<br>\r\n1. She was in Sora's body.<br>\r\n2. She was <i>naked</i> on a public beach!<br>\r\n3. She had an<b> erection!!!</b><br>\r\n4. She had her hand around said erection.<br>\r\n5. Sora in her body, was just off shore. <br>\r\n<br>\r\nLetting out a curse (and letting go of Sora's cock), Kairi scrambled to get Sora's speedo on and cover up before Sora or anyone else could see her. She quickly however ran into a rather <i>hard</i> problem, that <i>really</i> didn't want to be sealed away again so soon.<br>\r\n<br>\r\nKairi, close to panicking...<br>\r\n</span></div></div>",
            "created":1511091780,
            "id":2417046,
            "title":"Speedo alone"
        },
        "12222":{
            "author_id":"night115",
            "author_name":"Handle",
            "choices":[
                "They attempt to change back",
                "Riku arives"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, we shouldn't let this get in the way of us swimming, should we!\" Sora laughed, sounding strange as it was a masculine laugh, with a feminine voice.<br>\r\n\"Yeah, I suppose, but nothing dirty!\" kairi said<br>\r\n\"Kairi, what do you take me for!\" sora replied blushing.<br>\r\n<br>\r\nWhen Sora started walking, he noticed the weight, and bounce of his new \"Assets\". <br>\r\n\"Bide your time Sora\" he thought to himself \" act like you can't fix this, and you can take a peak later!\"<br>\r\n\"Do wonder what size they are though...\" he said, but quickly stopped, as kairi was looking in his direction.<br>\r\nHe ran to the water, enjoying the pressure on his chest as he got in the water.<br>\r\nKairi had mastered swimming already, but Sora kept getting drag, and couldn't swim properly for 15 minutes.<br>\r\n<br>\r\nEventually, they decided it was time for a rest, it was getting late. What happened then?</span></div></div>",
            "created":1301202000,
            "id":1077253,
            "title":"Sora's story"
        },
        "122221":{
            "author_id":"night115",
            "author_name":"Handle",
            "choices":[
                "Get changed now",
                "Back to kauris house"
            ],
            "content":"<div class=\"\"><div> <span>They got out and had a good think about how to change back.<br>\r\n\"hmm we banged our heads getting into this mess, so maybe that will fix it too\" Kairi thought<br>\r\nso they got up (Sora didn't think about switching) and banged into each other. They fell on the ground with a clump.<br>\r\n\"that didn't go as I expected\" Kairi said, dazed.<br>\r\n\"Oh what a predicament\" sora said \"How are we gonna fix this?\"<br>\r\n\"oh I dunno\" kairi said \" it's late, we'll work this out tommorow\"<br>\r\n<br>\r\nKairi got changed quickly and went home. Sora went to get her (now his) clothes. As he lifted up her top, the crystal fell out.<br>\r\n\"It must travel with the soul! Clever!\" he thought.<br>\r\n<br>\r\n\"wait, should I get changed now, or go back to kairos house and get changed?\"<br>\r\n</span></div></div>",
            "created":1301202000,
            "id":1077256,
            "title":"They attempt to change back"
        },
        "1222212":{
            "author_id":"night115",
            "author_name":"Handle",
            "choices":[
                "Kairi called, with some \"Boy trouble\"",
                "There was a knock on the door"
            ],
            "content":"<div class=\"\"><div> <span>\"Back to karis house is probably the best bet, I mean, silly kairi never even brung a towel!\" sora giggled to himself, a giggle he always loved.<br>\r\n<br>\r\nKairos parents were away a lot, and tonight was no exception. Sora went in, dripping wet, wearing only a bikini. He went upstairs, into kairi's room. As her best friend, He'd been here quite a lot. The Walls were pink and skyblue, with pictures of her, Sora and Riku all over. There was a bookshelf, full of what appeared to be quite long, complicated novels. Then there was her make up stuff, which puzzled Sora, as she never used it. There were drawers of clothes, a big oak wardrobe, Next to the wardrobe was a large mirror, and finally kairi's bed, which lay at the far end of the room. <br>\r\n\"So, thechnically, this rooms mine?\" Sora said \"Well, it should be a fun night then!\"<br>\r\n\"First I should get changed\" he thought \"The moment of truth...\"   He unhooked the the bikini, which basically flew off (He did think it was a bit tight) and his cleavage was released, now laying upon his chest. He walked over to the mirror. \"Holy crap\" he thought. They were huge! Like melons! He placed his and on the nipple, which was firm, and felt really good. <br>\r\n\"Why hello girls, I don't believe we've met\" sora said, giggling. He started rubbing them vigorously, just feeling the pleasure. \"yeah baby! Keep going!\" he said, his breasts jiggling madly. After a few minutes he decided to stop. Fun was fun, But kari was his best friend, and he still had respect for her.<br>\r\n\"best get changed then, hadn't I\" he said. He pulled out Bra from the Drawer, a nice pink one, and checked the label.<br>\r\n\"Woah Kairi, 36D! That's amazing!\" he said in disbelieve. He had a struggle getting it on though, but finally<br>\r\nmanaged it. He put in a nice pair of panties, a White tank top, and some trousers, and decided to get some sleep.<br>\r\n<br>\r\nThen, the following morning...</span></div></div>",
            "created":1301202000,
            "id":1077263,
            "title":"Kairi's House"
        },
        "12222121":{
            "author_id":"benjamin510",
            "author_name":"Benjamin!",
            "choices":[
                "Agree",
                "Disagree"
            ],
            "content":"<div class=\"\"><div> <span>\"SORA!\" said an voice over the phone. \"I need help! You don't wear any good clothes! All I see is big shoes, a big pair of pants, AND a shirt with your crown necklace!\"<br>\r\n<br>\r\n\"In my drawer, theres a pair of jeans, nikes, and a skull t-shirt, kay?\"<br>\r\n<br>\r\n\"Yea.... hey, I always wanted to have sex with you, you wanna do it in my body? You can test out my stuff!\"<br>\r\n<br>\r\n\"Err.... Lettme think, kay Kai, or should I say, Sora?\"<br>\r\n<br>\r\nOn one hand, he wanted to test out Kairi's body, yet, it seemed wrong....</span></div></div>",
            "created":1303966800,
            "id":1096427,
            "title":"Kairi called, with some \"Boy trouble\""
        },
        "12222122":{
            "author_id":"shadow_lord",
            "author_name":"skyler00",
            "choices":[
                "Just make the most out of their situation",
                "Find help"
            ],
            "content":"<div class=\"\"><div> <span>Sora got up and walked to the door. At the door, he saw his own body and widened his eyes, \"Who the heck are you!\"<br>\r\n<br>\r\nThen he realized what happened yesterday and sighed, \"Never mind. Hey Kairi, what are you doing here?\"<br>\r\n<br>\r\nShe walked in, \"This is technically my house remember? Even if you have my body.\"<br>\r\n<br>\r\nDeep inside, she wanted to make sure that Sora didn't do anything too extreme with her body. \"So what are we going to do now? How are we going to get our bodies back?\"<br>\r\n<br>\r\nSora was slightly annoyed; he wanted to continue enjoying Kairi's body a bit longer before giving it back to her. \"I don't know. The way I see it, let's just wait until the effects wear off and try to enjoy ourselves as we are?\"<br>\r\n<br>\r\nKairi looked at Sora quizzically, \"What if it doesn't? We need to find help.\"<br>\r\n<br>\r\nThey...</span></div></div>",
            "created":1304226000,
            "id":1098173,
            "title":"There was a knock on the door"
        },
        "14":{
            "choices":[
                "i was wondering if you would have sex with me",
                "i wanted to know if you wanted to come to my house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sora arrives at kairis door and knocks kairi quickly opens it she lets him in hello kairi says sora what do you want?</span></div></span></div>",
            "created":1290920400,
            "id":1003448,
            "title":"Goes to  Kairi's"
        },
        "141":{
            "choices":[
                "get undressed and go to kairi",
                "run away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>i thought you would never ask kairi said while getting undressed 4 minuets later kairi was fully undressed and said okay sora the next move is yours</span></div></span></div>",
            "created":1290920400,
            "id":1004052,
            "title":"i was wondering if you would have sex with me"
        },
        "1411":{
            "choices":[
                "say i love you to",
                "say i love you to[but you dont meen it]",
                "pull out and leave"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sora walks over to kairi and they start kissing they fall over on kairis bed sora puts it in kairi and kairi says i love you</span></div></span></div>",
            "created":1290920400,
            "id":1004061,
            "title":"get undressed and go to kairi"
        },
        "14111":{
            "choices":[
                "tell riku to get out",
                "stay in a akward silence until kairi says some thing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sora and kairi make love for a few hours[unprotected] when sora  and kairi finish kairilets out a lat scream of ecstasy riku heard this and he came running and he opened kairis door and saw sora and kairi naked what should sora do?</span></div></span></div>",
            "created":1290920400,
            "id":1004068,
            "title":"say i love you to"
        }
    },
    "info":{
        "author_id":"doctor",
        "author_name":"The Author",
        "brief_description":"Sora is accidentally enchanted with the ability to morph and body swap.",
        "created":1276767840,
        "description":"<td align=\"left\" class=\"norm\">(Post-KHII)<br>\r\n<br>\r\nSora finds a strange crystal in the Secret Place and gains the ability to morph and swap bodies. What havoc and fun can this cause on Destiny Islands?<br>\r\n<br>\r\nAbility description:<br>\r\n<br>\r\nMorph: Changes shape, but not powers. So he could look like Riku, buthe'd still wield his own Keyblade and not the Way to Dawn.<br>\r\n<br>\r\nSwap: Switches bodies and therefore Sora gets the powers of the body he's in. However he can't morph while swapped and has to at least be looking at the swappee.<br>\r\n<br>\r\nCharacters (All in KH2 clothes):<br>\r\n<br>\r\nSora (Main)<br>\r\nAge: 15<br>\r\nAthletic, tanned, brown hair, blue eyes... if you know Kingdom Hearts than you know what he looks like.<br>\r\n<br>\r\nRiku<br>\r\nAge: 16<br>\r\nLeanly muscular, platinum hair, teal eyes, again if you know KH you know what he looks like. For the purposes of this interactive he's had a bit of a haircut since KH2.<br>\r\n<br>\r\nKairi<br>\r\nAge: 15<br>\r\nReddish-brown hair, athletic, blue eyes, same as the above two, you should know who she is.<br>\r\n<br>\r\nSelphie<br>\r\nAge: 14<br>\r\nBrown hair, athletic, green eyes, you can invent her 'KH2 outfit'.<br>\r\n<br>\r\nWakka<br>\r\nAge: 16<br>\r\nRed hair, muscular, brown eyes, free control over his 'KH2 outfit'<br>\r\n<br>\r\nTidus<br>\r\nAge: 14<br>\r\nBlond hair, athletic, teal eyes, again free control over 'KH2 outfit'<br>\r\n<br>\r\nRoxas and Namine are also sort of characters given that they're part of Sora and Kairi. Either way they're viable full-morph options. You can add other characters as you see fit.<br>\r\n<br>\r\nRules:<br>\r\n1. Third-person perspective.<br>\r\n2. Try not to make it all slash please. Not saying you can't do them, just try to keep it under control. Canon couples can be just as fun.<br>\r\n3. Don't get too descriptive with sex please.<br>\r\n4. Try to use good spelling and grammar. We're not perfect, I know, but don't type in script format, in l33t or in text message type.<br>\r\n<br>\r\nCan't think of anything else to add here. Remember Destiny Islands is not just the little island from the first game, it also includes the much larger island seen briefly in the second game.</td>",
        "id":1682854,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1565010300,
        "modified":1565010300,
        "pretty_title":"Kingdom Hearts: Sora's TF Adventure"
    }
}