{
    "chapters":{
        "1":{
            "author_id":"coodookie",
            "author_name":"Coodookie",
            "choices":[
                "Sydney",
                "Nadia",
                "Rachel (Season 5)",
                "Lauren (Season 3)",
                "Other???"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who are we transforming??<br>\r\n<br>\r\nREMEMBER: Other female characters can be transformed during the story!!</span></div></span></div>",
            "created":1150593120,
            "id":324995,
            "title":"Who will it be??"
        },
        "11":{
            "author_id":"coodookie",
            "author_name":"Coodookie",
            "choices":[
                "A Thong",
                "A Dildo",
                "A Tampon",
                "A Pair of Shoes",
                "Other??"
            ],
            "content":"<div class=\"\"><div> <span>My story is set in an alternate version of season 5. Sydney isn't pregnant, Nadia's awake. Rachel, Nadia and Sydney also live together. <br>\r\n<br>\r\nNow on with the story.......<br>\r\n<br>\r\n<br>\r\nThe sun shining on her woke Sydney Bristow up from a deep sleep. She yawned and tried to rub her eyes but found that she couldn't move. She tried to replay the events of last night through her mind...<br>\r\n<br>\r\nThe previous night had been a strange one. At the A.P.O. office, Marshall had developed a no hassle way to transport prisoners by transforming them into objects. Sydney had offered herself as a guinea pig to test the device but it failed. She had arrived home and felt a little rough. She'd had a bath to make herself feel better. She went into her room to get ready for bed when she simply collapsed and passed out.<br>\r\n<br>\r\nThat didn't explain why she couldn't move though. 'The mirror' she thought to herself. She 'turned' towards the mirror to take a look but couldn't see herself. All she could see was....</span></div></div>",
            "created":1150908060,
            "id":326455,
            "title":"Experiment gone wrong"
        },
        "111":{
            "author_id":"coodookie",
            "author_name":"Coodookie",
            "choices":[
                "One of her housemates bedrooms",
                "Washing basket"
            ],
            "content":"<div class=\"\"><div> <span>In the mirror she could see the towel she had been wearing and some black lacy panties.<br>\r\n<br>\r\n'Oh no' she thought to herself, 'The experiment worked, must have been a delayed effect.'<br>\r\n<br>\r\n\"RACHEL.... NADIA..... HELP ME, MARSHALLS EXPERIMENT WORKED, HEEEEEEEELLLLLLLLPPPPPPPP!!!\" she screamed.<br>\r\n<br>\r\n'Damn, guess panties can't talk' she thought to herself.<br>\r\n<br>\r\nA gust of wind from a nearby open window caught her and her lacy body was lifted into the air. She was blown through the front room and into....</span></div></div>",
            "created":1151264340,
            "id":326459,
            "title":"Realisation!"
        },
        "1111":{
            "author_id":"coodookie",
            "author_name":"Coodookie",
            "choices":[
                "Nadia",
                "Rachel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which room does she float into??</span></div></span></div>",
            "created":1151272080,
            "id":326485,
            "title":"Who finds her??"
        },
        "11112":{
            "author_id":"coodookie",
            "author_name":"Coodookie",
            "choices":[
                "Stick with Rachel at APO",
                "Stay with Nadia at home (maybe she finds a clue??)"
            ],
            "content":"<div class=\"\"><div> <span>As the gust of wind caught her, Sydney began to panic.<br>\r\n<br>\r\n'What if I'm blown out of the window and they never find me!'<br>\r\n<br>\r\nShe breathed a metaphorical sigh of relief as she realised she was being blown towards Rachel's room. The wind carried her through the open door and she landed neatly on the bed.<br>\r\n<br>\r\n'That's lucky, Sydney thought, Rachel's bound to figure out I don't belong here and investigate.'<br>\r\n<br>\r\nRachel was having a shower and entered the room wearing nothing but a towel. \"I don't remember these panties, Rachel exclaimed looking directly at Sydney, but they are beautiful.\" <br>\r\n<br>\r\nAt this point Sydney was screaming in her inanimate prison. 'RACHEL, PLEASE WORK OUT IT'S ME AND TAKE ME TO APO!'  <br>\r\n<br>\r\nRachel was looking at the panties with a look of puzzlement when her alarm clock began to chime.<br>\r\n<br>\r\n\"Oh crap, Rachel shouted, gonna be late for work again. Dunno where these pants came from but they'll do\"<br>\r\n<br>\r\nSydney could only look on as Rachel removed her towel and picked her up off the bed. As she was being lifted she realised for the first time that there were clothes on the bed.<br>\r\n<br>\r\nRachel quickly put Sydney on, pulling her up so hard she got a good 'mouthful' of her private area. Sydney was mentally gagging as Rachel continued to get dressed and plunged her into darkness.<br>\r\n<br>\r\nSydney could see nothing and only hear muffled noises. Every step Rachel took pushed her further and further up her ass crack.<br>\r\n<br>\r\n\"Syd, you ready to head to work? she heard Rachel call, we're gonna be late!\"<br>\r\n<br>\r\n'RACHEL, I'M DOWN HERE, PLEASE SOMEHOW FIGURE IT OUT!' Syd mentally screamed back.<br>\r\n<br>\r\n\"What's going on Rach?\" Nadia's voice could be heard chiming in.<br>\r\n<br>\r\n\"You seen Syd?\" Rachel replied<br>\r\n<br>\r\n\"Nope, I assume she's either with Vaughn or at the office already!\"<br>\r\n<br>\r\n\"She must have already set off, you coming in?\"<br>\r\n<br>\r\n\"Not right now, got some work to be doing here first.\" <br>\r\n<br>\r\n\"Okay then, I guess I'll see you both there later\"<br>\r\n<br>\r\nWhen Sydney heard Rachel utter this her heart sank. 'At least I'm going to APO, she thought, Marshall will figure it out!' <br>\r\n<br>\r\n</span></div></div>",
            "created":1262106780,
            "id":812545,
            "title":"Rachel's Room"
        },
        "111121":{
            "author_id":"coodookie",
            "author_name":"Coodookie",
            "choices":[
                "Rachel doesn't find her - That Night",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Rachel arrived at APO without incident. No sooner had she stepped in that she had Marshall running towards her. His head covered in sweat and a look of panic in his eyes.<br>\r\n<br>\r\n\"Hey Rachel, you seen Syd?\" He asked enquiringly, his eyes dashing wildly from left to right.<br>\r\n<br>\r\nRachel let out a little laugh \"No Marshall, why? Has she not arrived yet?\"<br>\r\n<br>\r\n\"You better come with me!\" He stuttered, as he grabbed her hand and dragged her to his office.<br>\r\n<br>\r\nSydney was listening carefully to everything that was being said and was beginning to get excited.<br>\r\n<br>\r\n'This must be to do with the experiment, he's figured out it worked! Won't be long now before they work out what I am!'<br>\r\n<br>\r\nRachel was dragged into Marshall's office. The place was a mess except for his desk, on which lay a dildo and bra,<br>\r\n<br>\r\n\"So what, you brought me in here for some fetish play\" quipped Rachel<br>\r\n<br>\r\nMarshall snatched up the dildo and waved it in Rachel's face. \"This is no ordinary object, he began, it is actually Kelly Peyton!\"<br>\r\n<br>\r\n\"Yeah right, Rachel laughed, have you spent a night on the caffeine again.\"<br>\r\n<br>\r\n\"In my genius I invented a device that would ease prisoner transport by turning them into objects. I tested it last night on two of our own inmates, Kelly Peyton and Lauren Reed.\" He gestured towards the bra on the table. \"It didn't work so I tweaked it a bit and tried on a volunteer!\"<br>\r\n<br>\r\n\"Who?\"<br>\r\n<br>\r\n\"SYDNEY!\"<br>\r\n<br>\r\nRachel looked a little shocked at first, then realised he was serious. \"So it was a delayed reaction or something?\"<br>\r\n<br>\r\n\"Exactly! That's why I asked if you've seen Syd, the transformation occurred for these two 12 hours after exposure.\"<br>\r\n<br>\r\n\"Which would mean she probably transformed into something during the night at our house!\"<br>\r\n<br>\r\nSydney could hear all of this and she brightened a bit. They knew what had happened and soon Rachel would work it out and she could be changed back.<br>\r\n<br>\r\n\"She could be anything so I created a way of detecting her. BEHOLD!\"<br>\r\n<br>\r\nMarshall pulls a torch out of his pocket and begins to shine it around the office, when it touches the bra it begins to glow green!<br>\r\n<br>\r\nHe hands it to Rachel, \"take this, scan everything you can think of at home and bring Sydney here for me so I can turn her back!\"<br>\r\n<br>\r\nSydney is getting a little worried that Rachel hasn't figured it out already. 'She'll get it eventually!1 She thinks to herself.<br>\r\n<br>\r\nRachel takes the torch and sets off for her house, but not before taking the Lauren bra and Kelly Dildo and smuggling them into her bag.<br>\r\n<br>\r\n\"I'll let you know\" </span></div></div>",
            "created":1262117400,
            "id":812617,
            "title":"Detection Device"
        },
        "13":{
            "author_id":"coodookie",
            "author_name":"Coodookie",
            "choices":[
                "Turn her into an object",
                "Shrink her",
                "Age regression",
                "Turn her into an animal",
                "Other??"
            ],
            "content":"<div class=\"\"><div> <span>Rachel awoke to find herself handcuffed to a chair in a damp, dimly lit room. The room was empty besides the chair and a small table on the far wall next to the door.<br>\r\n<br>\r\nThe mission was a simple surveillance. She was supposed to be watching a hand off between Kelly Peyton (her ex best friend and lacky to the prophet five organisation) and Lauren Reed (former covenant and present free-lance operative). They were trading some next gen technology but what it was was a mystery to all.<br>\r\n<br>\r\nThe door opened and Peyton entered. She was carrying a strange device in her hands.<br>\r\n<br>\r\n\"Today is your lucky day\" She began \"You get to be the fourth test subject for our new device\"<br>\r\n<br>\r\n\"What device? Rachel enquired, what does it do??\" <br>\r\n<br>\r\n\"It's a matter transformer, it can re-arrange your molecular structure into anything I want!! An animal, an object, I could even shrink you or make you younger!!! Now which will it be???\"<br>\r\n<br>\r\n\"Who else has been transformed??\"<br>\r\n<br>\r\n\"The chair you're sitting on is the lovely Lauren Reed. The table in the corner is Anna Espionosa and the handcuffs you are tied to the chair with are Irina Derevko!! Now enough chit-chat, what shall I do to you??????????\"</span></div></div>",
            "created":1152272400,
            "id":329093,
            "title":"Mission gone wrong"
        }
    },
    "info":{
        "author_id":"coodookie",
        "author_name":"Coodookie",
        "brief_description":"TF story featuring the girls from Alias!!",
        "created":1150592940,
        "description":"<td align=\"left\" class=\"norm\">Alias TF story. Some rules apply...<br>\r\n<br>\r\nNO male transformations, vore, toilet stuff, furries and age progression!!<br>\r\n<br>\r\nShrinking, animal transformation and age regression is fine though (again only female characters)<br>\r\n<br>\r\nPlease add and make this story great!!!</td>",
        "id":1120349,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1262117400,
        "modified":1262117400,
        "pretty_title":"Alias TF Story"
    }
}