{
    "chapters":{
        "1":{
            "author_id":"yusih2e",
            "author_name":"dinosaurs are awesome",
            "choices":[
                "Created by scientists",
                "Mutated",
                "Time Traveled",
                "In a world where dinosaurs never went extinct",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Origin/creation? Depending on which you choose that dinosaur will have a different personality.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nC1: Will hate humans<br>\r\nC2: Will Be evil<br>\r\nC3: Will have a mind of a normal dinosaur<br>\r\nC4: Will Be super intelligent and friendly towards humans<br>\r\nC5: Other Choices</span></div></div>",
            "created":1355461200,
            "id":1488135,
            "title":"Choose your origin"
        },
        "11":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "The army",
                "The movie industry",
                "A large entertainment park chain",
                "Woah where did all of this money show up from...",
                "Another choice"
            ],
            "content":"<div class=\"\"><div> <span>In the far future of the year 2050 humanity has made groundbreaking advancements on cloning and altering DNA. Spearheading humanity's efforts was the world famous Genesplitters corp. who were well known for their many breakthroughs in the fields of extinct species recovery. They were aiming really high this time as in a conference they stated that they would bring back a dinosaur through genetic cloning. Before they had brought back recently extinct species like sea minks or tasmanian tigers but no one has ever thought bringing something like a dinosaur back as even being possible. Some people believed this to be impossible but the others were trembling with anticipation for the chance to see a living breathing dinosaur.<br>\r\n<br>\r\nAnd sadly a complication happened, and a pretty big one at that. Due to a certain incident involving and overworked intern, a rod of plutonium and a ham sandwich, the entire London Genesplitters lab ended up as a smoldering, radioactive crater. This obliviously set back research a lot but whats worse is the fact that most of the major investors stopped funding Genesplitters corp. after this fiasco. After such a large hit to the funding the large corporation had to make some budget cuts, but they couldn't cut the dinosaur reviving project as they had already promised the public, but they needed money.<br>\r\n<br>\r\nThe solution? Find a very large investor of course. </span></div></div>",
            "created":1521745500,
            "id":2467882,
            "title":"Created by scientists"
        },
        "111":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "They create a mutated T-rex",
                "They create a mutated Triceratops",
                "Another choice or another story"
            ],
            "content":"<div class=\"\"><div> <span>Of course! What better investor than the U.S. military! Those guys have so much money they have no idea what to do with it so they've been throwing it away at all kinds of wacky projects like battle trained turtles or Sharks with Frickin' laser beams. This seems like a mach made  in heaven but of course, the deal must be taken first.<br>\r\n<br>\r\nMr. Jacob the spokesman for Genesplitters corp. was making his way through a large military base in which he was supposed to meet Sergeant Russel. the meeting was supposed to disclose the details of the deal between the army and his company. Jacob had to pass through several heavily armed guards and he had to present several documents and identifications before he finally got to meet the sergeant.<br>\r\n<br>\r\nThe two men met in a small concrete room with a single fluorescent light on the ceiling. Jacob felt rather uneasy, it was like he was getting interrogated in some sort of action movie or a novel. The awkward silence was broken by Sergeant Russel who said:<br>\r\n<br>\r\n\"Pardon us for the harsh welcome Mr. Jacobs, but the higher ups want to make sure no one's listening to us\" Disclosed the Sergeant.<br>\r\n<br>\r\n\"No problem at all Sergeant Russel, You have a pretty impressive complex set up here\" Answered Jacob.<br>\r\n<br>\r\n\"Why thank you. But we should get to business, the eggheads down at the research department reviewed your licenses, your methods and your requirements and everything seems fine. With one exception...\" said Russel.<br>\r\n<br>\r\n\"What is it Sergeant. I'm sure we can reach an agreement.\" assured Jacob.<br>\r\n<br>\r\n\"We both know these dinosaurs will be used in the military right? It goes without saying, But we reviewed your \"Blueprints\" and concluded that you will need to make some changes\" Answered the Sergeant.<br>\r\n<br>\r\n\"Well... what are they?\" asked Jacob.<br>\r\n<br>\r\n\"For starters you need to make em' scarier, to really spook the enemies. You will need to make em' harder, i want em' to take out a platoon of armed and armored soldiers and still keep going, and we want em' to be merciless, no retreating, no fear. In summary we need them to be the perfect weapon.\" concluded the Sergeant.<br>\r\n<br>\r\n\"Well it's going to take some extra work on our researcher's part but i'm sure we can do it\" Said Jacob.<br>\r\n <br>\r\n\"In that case Mr. Jacob. We have a deal!\" said the colonel rather excited.<br>\r\n<br>\r\nWith that both men shook their hands, waved goodbye and went their separate ways. One to inform the president of the new assets they will be receiving and the other to give the signal to the scientist to start doing their work.</span></div></div>",
            "created":1521751140,
            "id":2467937,
            "title":"The army"
        },
        "1111":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Meanwhile in the dinosaurs mind( a.k.a. your mind)"
            ],
            "content":"<div class=\"\"><div> <span>After roughly 2 months worth of research, experimenting and a large amount of trial and error, the scientists managed to figure out a way to properly \"create\" a dinosaur. They couldn't just extract blood samples from a mosquito frozen in amber, oh no they had to devise a more plausible way of doing this. They incarcerated many ancient lizards and analyzed their genes extensively. If they looked hard enough they would usually find a single or a few genomes in the specimens that were left over from their ancient predecessors: The dinosaurs. After that they just had to do a little editing so it could fit the army's liking.<br>\r\n<br>\r\nAs the person who was responsible for this, Jacob was invited to see the specimen before it's official public announcement. After entering the building Jacob was guided through the many corridors until he reached a door that said top secret. He cautiously entered inside and was greeted by multiple scientists.<br>\r\n<br>\r\n\"Ah Mr. Jacob we were expecting you.\" The scientist said.<br>\r\n<br>\r\n\"A pleasure to meet you uh...\" he said as his eyes drifted towards a little card on the scientists lab coat \" Professor Murrow. Is uh the specimen here?\"<br>\r\n<br>\r\n\"Why yes the specimen is right behind this vault. We are currently monitoring his vitals and brain waves to make sure he is fine. We will soon open the gates for you to see him, there will be 1 meter of bulletproof glass between us so we can observe safely. Oh and a fair warning: he hasn't seen a human or in fact anything living until now, so we don't know how he will react.\" Said Professor Murrow.<br>\r\n<br>\r\nAfter that the professor signaled one of his peers to open up the gates. The large metal gates slowly opened to reveal a large,hulking crimson form. It had the body structure of a T-rex only bigger. It had a monstrous maw filled with sharp teeth and multiple Sharp horns. it's skin was rough and scaly and could withstand being shot over and over and it's back was covered in thick armor plating that could survive artillery. Unlike the real t-rex it's arms were large and had four digit hands with colossal razor sharp claws. This... creature was truly abominable, a monstrosity and a crime against nature by any other name.<br>\r\n<br>\r\n\"Woah!\" screamed Jacob startled from the creature\" You have quite the specimen here Murrow.\" he continued.<br>\r\n<br>\r\n\"Well, i'm not sure how i should feel about it\" the professor said looking at the ground.<br>\r\n<br>\r\n\"Look sometimes we have to make compromises. We don't set out to make monsters and this very well isn't. It may look... scary but that's the point. If out plan works he and his clones will do a lot of good for the world by taking out terrorist, rebels and other people seeking to do us harm\" said Jacob.<br>\r\n<br>\r\n\"I guess your right. Oh i forgot to say we also made him quite aggressive. You know, so he can be a better soldier\" Said the professor.<br>\r\n<br>\r\n</span></div></div>",
            "created":1521827520,
            "id":2468374,
            "title":"They create a mutated T-rex"
        },
        "11111":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Kill",
                "Wait"
            ],
            "content":"<div class=\"\"><div> <span><b><i>Kill Kill Kill Kill</i><br>\r\n<i>Kill Kill Kill Kill Kill</i><br>\r\n<i>Kill Kill Kill Kill Kill Kill</i></b><br>\r\n<br>\r\nIt was mostly just that going through your mind. You can say the scientist really outdid themselves with the aggressiveness. For as long as you can remember your entire world had been this relatively small grey room. You just walked around in circles thinking about doing a one thing, that you werent even sure was possible since the walls could not be killed no matter how hard you tried.<br>\r\n<br>\r\nThen it all changed. The walls started parting away revealing a blinding white light. You closed your eyes and then you looked away. It took you a few minutes to adjust your eyes to the brightness but when you returned your sight at the now fully opened walls you saw something new. Well several new things in fact, several small white creatures and one that was instead black and visibly more afraid of you.<br>\r\n<br>\r\n<b><i>What are those. They move. If they move they are alive. If they are alive they can die. If they can die i can KILL them.</i></b></span></div></div>",
            "created":1521828480,
            "id":2468382,
            "title":"Meanwhile in the dinosaurs mind( a.k.a. your mind)"
        },
        "111112":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Diablosaururs ",
                "Dominus Rex"
            ],
            "content":"<div class=\"\"><div> <span><i><b>Wait</b></i><br>\r\n<b><i>...</i></b><br>\r\n<b><i>WAIT!?</i></b><br>\r\n<b><i><br>\r\nWhat even is that? I am not killing. So waiting must be not killing</i></b><br>\r\n<i><b>Wait Wait Wait</b></i><br>\r\n<i><b>Not sure if i like it.</b></i><br>\r\n<b><i>Wait Wait Wait Wait</i></b><br>\r\n<i><b>Maybe i should try it more?</b></i><br>\r\n<b><i>Wait Wait Wait Wait Wait</i></b><br>\r\n<br>\r\n\"Why is it just standing there?\" asked Jacob<br>\r\n<br>\r\n\"It has never seen humans before. It's probably examining us\" concluded the professor.<br>\r\n<br>\r\n\"Have you thought of a name yet?\" asked Jacob<br>\r\n<br>\r\n\"We actually planned on giving you the privilege of choosing.\" he answered.</span></div></div>",
            "created":1521836100,
            "id":2468443,
            "title":"Wait"
        },
        "13":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Adult",
                "Hatchling",
                "You will hatch when you time travel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we start this branch, just how old are you?</span></div></span></div>",
            "created":1358571600,
            "id":1511538,
            "title":"Time Traveled"
        },
        "132":{
            "choices":[
                "A Carnivore",
                "A Herbivore",
                "An Omnivore"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of dinosaur are you?</span></div></span></div>",
            "created":1371704400,
            "id":1614534,
            "title":"Hatchling"
        },
        "1321":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "T-rex",
                "Raptor ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about?</span></div></span></div>",
            "created":1397019600,
            "id":1776089,
            "title":"A Carnivore"
        },
        "13211":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "The 2010's.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span>50,000 years in the past when dinosaurs ruled the earth you happened to be an animated gigantic green fat baby Tyrannosaurus Rex with blue appendages, in other words Rep Phil from Rug-rats as you were one day stomping around as usual until something happened.<br>\r\n<br>\r\nAs a beam of light appeared above you and zapped you as you soon vanished without a trace while you were being hurtled through the centuries until you appeared in an era that you have never seen before.<br>\r\n<br>\r\nNow the question was what era were you in now?</span></div></div>",
            "created":1456699920,
            "id":2110864,
            "title":"T-rex"
        },
        "13212":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Hmm, a odd creature",
                "a snake! kill it!",
                "I don't know what this is"
            ],
            "content":"<div class=\"\"><div> <span>Well you appear in some grass. Yes you may be able to take care of yourself, but you were being fed by mama raptor before a light consumed you and took you here... you see an odd tree that makes light. Then it opens and something comes out... An ape like creature came out with a odd stick, then came near you...</span></div></div>",
            "created":1456030800,
            "id":2107692,
            "title":"Raptor "
        },
        "132121":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>You hear it make noise<br>\r\n<br>\r\n\"Hmm this is an odd creature. I don't know it looks like a lizard or snake. I think my son may like this.\" The ape then reached down and picked you up... It wasn't threatening so you didn't bite it. Even so you felt like the ape could kill you if you tried to bite... The ape then spreads your legs...</span></div></div>",
            "created":1456030800,
            "id":2107693,
            "title":"Hmm, a odd creature"
        },
        "1321212":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "nudge it",
                "bite it",
                "back away"
            ],
            "content":"<div class=\"\"><div> <span>\"I reckon that small slit there means you are female. Well little girl come on lets show you your new home.\"<br>\r\nThe ape brought you to the odd tree and entered it. Then did something to seal it shut... Then you see some odd things made of trees...<br>\r\nYou look around from the Ape's paw. It then put you on one of the tree things and walked off making some noise...<br>\r\n<br>\r\n\"Luc! Come here, I think you will like this.\" You don't know what it is say but you hear a lot of noise as a smaller ape comes into view... The bigger one led the smaller one to you.<br>\r\n\"Oh, Cool a new lizard?\"<br>\r\n\"I don't know son, but see if she likes you first. I don't want my son hurt by a new pet.\"<br>\r\nYou don't know what is going on even as the smaller ape reaches to you. You back up afraid at first but the smaller ape slowed his hand... You smell of it and...</span></div></div>",
            "created":1456030800,
            "id":2107697,
            "title":"Female"
        },
        "13212121":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "You're afraid",
                "You're sad"
            ],
            "content":"<div class=\"\"><div> <span>You nudge the hand and look to the ape. It seems friendly. You wonder if it will feed you because you are still hungry.<br>\r\nAfter that the small ape carefully picked you up and took you somewhere in this odd tree. You see other creature that were scaled but not even close to being what you are... You look at them. The ape then went off to the side and returned with a small thing... You smell it and your mind tells you: meat!<br>\r\nYou snatch the meat away from the ape and eat it... You then look around and see that there is no more... You whine a bit.<br>\r\n\"Oh you little crybaby.\" It made more noise, but put another small meat in front of you, You ate it and that made you feel full.<br>\r\nAfter that the ape comes by with something in his hand, he was looking at it...<br>\r\n\"No, not that one; next, next...\" It continued to make noises... but after a bit... he grabbed another thing and looked at it then you... and repeated a couple of times...<br>\r\n\"Your a... a ... a... Raptor!\" You don't understand a bit of it, so you growl then find a comfortable place to lay. Having filled your belly you are content on sleeping then finding the pack tomorrow...</span></div></div>",
            "created":1456030800,
            "id":2107701,
            "title":"nudge it"
        },
        "132121212":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Skip to show and tell",
                "Run from the apes.",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>The next day, you wake up and look around, and see that the walls have odd still things on it... Ruffled by the air that you feel. You climb out of your den and walk around... After getting up high and looking out you see nothing that suggested that your pack was nearby, you didn't see high rock or the forest... just a large field... You start whining with realization that home wasn't anywhere near here.<br>\r\n<br>\r\nAfter a moment you hear the small ape, \"There there, it is okay. I will take care of you.\" <br>\r\nYou whine again and press into its offered paw.<br>\r\n<br>\r\nLater he gave you small meats that you were thankfull for...<br>\r\nAs the day passed you decided on, protecting this little ape... though you were smaller at this time. You knew that you would be big enough soon to protect him.<br>\r\n</span></div></div>",
            "created":1456030800,
            "id":2107711,
            "title":"You're sad"
        },
        "1321212121":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "You chase off a bully",
                "The both of you get home"
            ],
            "content":"<div class=\"\"><div> <span>You are in his hand... yes his. It turns out these 'Apes' are called humans. And your human is Luc. He is a big reptile fan, and well you are a warm blooded clever reptile to him at this time. But he hopes that you will grow and be awesome. Well you have put on an inch in size since you came to his family.<br>\r\n<br>\r\nSadly the other kids laughed at your human.<br>\r\nYou growl angry that they hurt your human's feelings. \"No, Rilia. I am fine, I just need my seat.\" He said. You understand your human to a degree, but not everything he says as you have yet to grasp the full language, as it is called, that he uses.  But the more he talks to you the more you learn.<br>\r\nHe walks back to his desk and sits and lays his head on the table. You walk to the side of his head and nudge it. making him move his head and start to gently stroke you. You purr and nuzzle his face making his mood better.<br>\r\n<br>\r\nLater...</span></div></div>",
            "created":1456030800,
            "id":2107717,
            "title":"Skip to show and tell"
        },
        "13212121212":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Continue",
                "Friendly bonding time"
            ],
            "content":"<div class=\"\"><div> <span>After a long day, your human takes you home. You purr and nuzzle him as you ride his shoulder.<br>\r\n\"Well Rilia. That was a good day at school though it was bad, you made it all better. I just hope that you get big enough to make everyone believe that you are a Raptor. A real life Raptor.\"<br>\r\nRaptor... that is what your kind is called by the humans. But as you know there are no raptors or other 'dinosaurs' around. You would be unique in this world as you were the only one of your kind... <br>\r\n<br>\r\nYou accompanied your human daily. He would feed you well in the morning and the evening. You slept like a normal raptor young. After a few weeks of this your human had to put a collar on you... And yes you learned his language... there were only a few words that you didn't know what it was. but for the most part you understood your human and every other human regardless of their voice... and your human's safety was ensured as you scared the bullies away from him... but after that you were left home... but you would check your human's health... he would be fine for the most part... and if you found him hurt you followed him to school and watched and made sure he was safe. The bullies attacked him a few times... but they found that they anger the protective Raptor they would have to pay... After a few incidents like that and your Human was pulled out of school... Just as you reached four months of age and was as tall as his desk.<br>\r\n</span></div></div>",
            "created":1456030800,
            "id":2107722,
            "title":"The both of you get home"
        },
        "132121212122":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Well you are bigger and he actually said that he loved you... He hugged you making you purr, and according to the rules he is only a kid, and you plan to have him... but as what? The one you want to protect forever, or love forever?<br>\r\n<br>\r\nYou cuddle up with him as he hugs you lovingly. You like this ever since you got big enough to cuddle he had been hugging you every night that he could. You fell asleep hugging him in return.</span></div></div>",
            "created":1456030800,
            "id":2107749,
            "title":"Friendly bonding time"
        },
        "1321212121221":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Like what UB",
                "Like what (S)"
            ],
            "content":"<div class=\"\"><div> <span>Well Over the next few months you reached your full size. And well your human got to ride you... Like literally ride you. He loved it and you liked it too. You took him all over the new property that his dad had bought.  It was wide open with plenty of wild life to support your appetite. And even so he got money each time some men came and took a blood sample from you. So if you ever ran out of wild life, he would be able to purchase the needed food for you.<br>\r\n<br>\r\nAfter a long day your human asked.<br>\r\n\"Could we do something together?\"</span></div></div>",
            "created":1456030800,
            "id":2107780,
            "title":"continue"
        },
        "13212121212211":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "let him",
                "show it off",
                "refuse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Well you know you are bigger and... I, uh, always wanted to see the inside of a womb... and you are bigger than I so... would you let me?\" Your human asked...<br>\r\nYou think and...</span></div></span></div>",
            "created":1456157940,
            "id":2107960,
            "title":"Like what UB"
        },
        "132121212122112":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "pleasured you",
                "tried getting in (won't fit)",
                "gets in"
            ],
            "content":"<div class=\"\"><div> <span>You know he doesn't understand you. But you know that if you show it to him that he will know... So you do just that.<br>\r\nYou turn and lift your tail showing off your tailhole and vagina. The very one that his dad saw when you were small. Your human grew a smile and came closer to your rear and gently stroked your lips... He then...</span></div></div>",
            "created":1456159620,
            "id":2107975,
            "title":"show it off"
        },
        "1321212121221123":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Later",
                "the next day"
            ],
            "content":"<div class=\"\"><div> <span>Pushed into you. You purr as you feel him push in. Further into he went till you felt his head enter then it was a simple matter of staying relaxed and pulling him in. His torso was sucked in next, then his hips. and you slowly pulled in his legs... gentle flexes and pulls of you sex pulled him in. his knees came in after five minutes, then his calves, then his feet moved a bit in your lips as you pulled him the rest of the way in.<br>\r\nYou smile in your way and purr then you hear him. \"I love this. So warm and peaceful.\" You purr and nod as you know that the two of you will have multiple occasion of this, and no one could stop you... unless of course it was done at the wrong time.</span></div></div>",
            "created":1456225920,
            "id":2108317,
            "title":"gets in"
        },
        "13212121212211231":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Next day",
                "Next day"
            ],
            "content":"<div class=\"\"><div> <span>You had found yourself a spot to bask with you little friend in you... You purred each time he moved. You purred your love to him and kept him inside of your warm folds... unlike the reptiles you happened to be a warm blooded creature, as such your temperature was well normal to humans... and because of that he was enjoying being inside of you... sadly you knew this would end as you needed to get back home and your human had to be on your back not in you.<br>\r\nSo you enjoy another hour with him, then eased him out of your womb... gently putting him on the ground... <br>\r\nHe sighed as he sat up. \"I was enjoying that.\" He said. You shake you head at him, then offer your back to him... you smelled yourself on him, so you would need to get him cleaned but other than that you could keep him safe from harm because you knew that your scent would be distinctly on him.</span></div></div>",
            "created":1456376340,
            "id":2109244,
            "title":"Later"
        },
        "132121212122112311":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Take care of him",
                "Take him out of bed",
                "Leave him and go outside for a bit"
            ],
            "content":"<div class=\"\"><div> <span>The next day, you woke and yawned as you look at your little human... they figured you were a 'UtahRaptor' as you were big as the skeletons found... just covered in flesh... you sigh as you know that you are the last of your kind, with only one friend... your little human...</span></div></div>",
            "created":1456462260,
            "id":2109678,
            "title":"Next day"
        },
        "1322":{
            "choices":[
                "Tricertops (three horns)",
                "Apatosaurus (Long neck)",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of herbivore?</span></div></span></div>",
            "created":1371704400,
            "id":1614537,
            "title":"A Herbivore"
        },
        "13221":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Hatch out of your egg",
                "Stay in your egg"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a Tricertops</span></div></span></div>",
            "created":1547284140,
            "id":2602377,
            "title":"Tricertops (three horns)"
        },
        "13223":{
            "choices":[
                "Hadrosaur (Duck-Billed Honker)",
                "Something else still?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these?</span></div></span></div>",
            "created":1371704400,
            "id":1614539,
            "title":"Something else"
        },
        "14":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "50 feet tall",
                "100 feet tall",
                "1000 feet tall",
                "10,000 feet tall",
                "100,000 feet tall or bigger"
            ],
            "content":"<div class=\"\"><div> <span>65 million years BC. <br>\r\n<br>\r\nThe huge asteroid tumbled through space, towards earth. In a different, more familiar timeline, it would have smashed into the earth, throwing up huge clouds of dust and leading to the extinction of the dinosaurs. However, it was not so in this universe. The asteroid gracefully slipped past earth before harmlessly crashing into the sun several hours later. The dinosaurs continued to thrive, with humanity eventually evolving alongside them. However, over time the animals that would have gone extinct in our timeline began to grow larger as time went on, leaving humanity small and vulnerable. However, the dinosaurs started to protect humanity, like an older brother, as time went on, and the two species' became inseparable. <br>\r\n<br>\r\nIt is now modern day. Just how big is the average dinosaur?</span></div></div>",
            "created":1358312400,
            "id":1509913,
            "title":"In a world where dinosaurs never went extinct"
        },
        "141":{
            "author_id":"chrono1899",
            "author_name":"Chronological Order",
            "choices":[
                "His nest! He worked really hard on it, and hopes your proud of him!",
                "He found something and doesn't know what it is...",
                "He needs your help, he doesn't feel good..."
            ],
            "content":"<div class=\"\"><div> <span>Our reptilian protectors stood about 50 feet at the shoulder for an average Dino, who often either patrolled human populated areas with the intent of simply guarding  populated areas, others made active attempts to interact with the things scurrying between their legs. You, happen to be a citizen in one of these Dino guarded communities, and were rather fond of them. You had an apartment of average size on the 5th floor (only thing you could afford with your current job) but were happy with the, although minimal, fruits of your labor.<br>\r\n<br>\r\nBack to the present, you were currently sitting on a leather stool in the kitchen, shifting slightly on the material. It was your day off, a time to relax. Looking through the glass sliding that made a translucent barrier between the living room and balcony, you enjoyed the midday sun on your skin. Then you heard something: well, felt it first, a deep but soft tremor that vibrated the building in its entirety. This tremor was followed by a thunderous \"THOOM\" as a reptilian foot collided with the ground. This wasn't abnormal, some of the more dedicated and social Dino's would make rounds, peeking in our windows to make sure were safe and sound. After the resounding sounds of his presence a orange-brown T-rex rounded the corner, peeking in through the door and rewarding your presence with an affectionate rumble from his throat. \"Hey there big guy.\" you responded, you knew this rex well, his name was King and despite his name, was happy-go-lucky goofball, and, although you didn't know it he especially liked you.<br>\r\n<br>\r\nAfter heading outside into the warm air of afternoon, and began running your hands along King's scales, as per morning routine. They reminded you of pebbles in a river. Or freshly lacquered and polished wood. Either way, he let out a happy 'murrrr' and closed his eyes. After a few minute of stroking, Kind suddenly pulled away, a sif remembering something. \"Whats wrong, bud?\" you shouted, leaning over the balcony and craning your neck to look at him. He seemed to be thinking.  he then remembered!  He wanted to show you something.<br>\r\n<br>\r\nWhat was it?<br>\r\n</span></div></div>",
            "created":1506477960,
            "id":2392375,
            "title":"50 feet tall"
        },
        "142":{
            "author_id":"wdearth",
            "author_name":"wdearth",
            "choices":[
                "T-rex or related",
                "Seismosaurus or related",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>For the average dinosaur, an average human was up to eye level to its ankle. And the humans loved to have fun with these enormous reptilian giants, ride them, get gently pinned by them, always being careful not to crush their little friends, and some enjoyed tickling them and making them laugh in a deep thunderous voice.<br>\r\n<br>\r\nSo, what kind of dinosaur from this world you like to focus on?</span></div></div>",
            "created":1481846100,
            "id":2250498,
            "title":"100 feet tall"
        },
        "145":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "100,000 feet tall",
                "1 million feet tall",
                "10 million feet tall or bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Humanity's dinosaur protectors soon reached absurd sizes- after all, the bigger you are, the easier it is to protect your friends. <br>\r\n<br>\r\nJust how huge are these dinosaurs?</span></div></span></div>",
            "created":1358312400,
            "id":1509916,
            "title":"100,000 feet tall or bigger"
        },
        "1453":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "10 million feet tall",
                "100 million feet tall",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The dinosaurs utterly eclipsed everything with their sheer size, but they were still devoted to the tiny beings called humans. Still they grew, stopping at an average height of...</span></div></span></div>",
            "created":1358312400,
            "id":1509918,
            "title":"10 million feet tall or bigger"
        },
        "14533":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "1000 million feet",
                "Planet sized or bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And still they grew and grew, reaching heights of...</span></div></span></div>",
            "created":1358398800,
            "id":1510234,
            "title":"Bigger"
        },
        "145332":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Planet sized",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The dinosaurs soon recurs the size of earth itself, but the question was, will they stop growing?</span></div></span></div>",
            "created":1358571600,
            "id":1511544,
            "title":"Planet sized or bigger"
        },
        "1453322":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Galaxy sized",
                "There is only one dinosaur, but they are universe sized, and may grow even more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The dinosaurs dominoes to grow and grow and grow, having long discarded hinge such as mortality, with each generation being several orders of magnitude larger than the last. </span></div></span></div>",
            "created":1358571600,
            "id":1511545,
            "title":"Bigger"
        },
        "14533222":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Start off small. ",
                "Start of huge. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(You see, those last few chapters are why you don't use your iPod to write.)<br>\r\nOkay, so do you start off as a small dinosaur and the. Grow to incomprehensible sizes, or do you start of at said sizes, then grow even more?</span></div></span></div>",
            "created":1365570000,
            "id":1569207,
            "title":"There is only one dinosaur, but they are univer..."
        },
        "145332221":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "T-Rex",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You feel th shell of your planet-sized egg begin to crack and splinter, and you capitalise on this fact, shattering sections of the shell with your immense head. The egg disintegrates, leaving you floating in space. There is a planet next to you, it is blue and green. Somehow, you know it is called 'Earth', and that humans lived on it. You liked humans. They were tiny and funny. You look down at the planet and see countless humans worshipping you, others running in fear, and some standing, jaws agape, in awe. <br>\r\n<br>\r\nYou gently nuzzle the planet, love and affection spilling into it. It made you feel warm and fuzzy inside, you liked that feeling! Oh, wait... You were growing! The feeling builds as you grown and grow, you love this feeling! <br>\r\n<br>\r\nSuddenly, you explode in size, the growth spurt stopping instantly. You were now larger than the solar system, planets, sun, and moons orbiting your massive bulk. <br>\r\n<br>\r\nThe question was, what species of dinosaur are you?</span></div></div>",
            "created":1371704400,
            "id":1614186,
            "title":"Start off small. "
        },
        "15":{
            "author_id":"yusih2e",
            "author_name":"dinosaurs are awesome",
            "choices":[
                "Lives in world of technologically advanced dinosaurs",
                "Raised as a baby with humans",
                "Grown from dna",
                "Raised in a nest with some ducks",
                "Is Human Female like"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices<br>\r\n<br>\r\n<br>\r\n<br>\r\nC1: Is Smart and powerful<br>\r\nC2: Loves Humans<br>\r\nC3: Confused<br>\r\nC4: Duck Like Behavior<br>\r\nC5: Looks like a teen girl but with a tail and teeth and the size of 1000 ft</span></div></span></div>",
            "created":1355461200,
            "id":1488140,
            "title":"More Origins"
        },
        "153":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "A T-Rex",
                "A Triceratops",
                "A different Dino "
            ],
            "content":"<div class=\"\"><div> <span>You feel fragmented somehow, and find yourself unable to form any thoughts as a great fog clouds your mind. You can see nothing but darkness, but if you push your head as far forward as your body allows, you can feel some kind of wall. <br>\r\n<br>\r\nThis was all horribly confusing, but then the walls split open, allowing light into the... Whatever you were in. A pair of deft appendages lightly grasp you, lifting you out of the place and setting you down on a cold, hard surface. You see funny things, standing upright and wearing long white clothes. The one who lifted you out lightly strokes your head before turning to the others. That felt good. <br>\r\n<br>\r\n\"Ladies and gentlemen, today is one of the proudest moments in the history of the human race. Not only have we mapped this little Dino's entire genome, but as you can see, we have cloned it!\"<br>\r\n<br>\r\nWhat kind of dinosaur are you?</span></div></div>",
            "created":1375592400,
            "id":1639984,
            "title":"Grown from DNA"
        },
        "1531":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "A growth ray emerges from one of the walls!",
                "The door opens, and a human walks in!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The... Humans, you think one of the called itself, continue to talk with eachother, laughing at some points, finally producing a bottle of something and pouring it into glasses for each of the other humans. <br>\r\n<br>\r\nYou are quickly carried off by another human into a different room, who idly pets you as he walks. That felt really good. The human places you inside a room, then quickly leaves. You can see another group of humans watching you through some sort of invisible barrier. You didn't like that, you wanted the nice feeling from being stroked!<br>\r\n<br>\r\nThe humans talk amongst themselves for a minute before turning back to you. One of them pushes a button on a panel, and...</span></div></div>",
            "created":1375592400,
            "id":1639987,
            "title":"A T-Rex"
        },
        "15311":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Invade the big city itself.",
                "Remain where you are."
            ],
            "content":"<div class=\"\"><div> <span>At that moment a growth ray emerged from the very wall itself and was aimed directly at you. Immediately it fired a beam of light at you, as you started growing bigger and bigger until you manage to demolish the roof of the building itself. <br>\r\n<br>\r\nYou then notice some bright lights in the distance, in this case a big city you could invade or you could remain where your at.<br>\r\n<br>\r\nYou then decide on what you want to do.</span></div></div>",
            "created":1376197200,
            "id":1644331,
            "title":"A growth ray emerges from one of the walls!"
        },
        "153112":{
            "author_id":"wdearth",
            "author_name":"wdearth",
            "choices":[
                "You decide to sit down and let them rub your feet.",
                "You decide to offer them a ride on your back."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You then see some of the humans decide to rub your feet, which are now big enough to easily crush one of them. You feel relaxed and stand still as they continue to rub, then...</span></div></span></div>",
            "created":1481846520,
            "id":2250504,
            "title":"Remain where you are."
        }
    },
    "info":{
        "author_id":"yusih2e",
        "author_name":"dinosaurs are awesome",
        "brief_description":"Become a intelligent powerful dinosaur in the modern world",
        "created":1355522220,
        "description":"<td align=\"left\" class=\"norm\">No sex</td>",
        "id":1908517,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1547284140,
        "modified":1547284140,
        "pretty_title":"Life Of A Dinosaur"
    }
}