{
    "chapters":{
        "1":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Pete sucks on Kevin's big toes causing Kevin to erupt",
                "Pete continues the massage, causing Kevin to become more erect",
                "Drew stares at his friend's massive hard on and is jealous.",
                "Pete turns and sees Drew's stocking feet wiggling."
            ],
            "content":"<div class=\"\"><div> <span>Not sure about attracting business, the owner, Mr. Peabody placed a sign outside his storefront stating half-price for massages between 3 and 5 pm. He had hired ten masseuses and masseurs for his opening week. <br>\r\nBusiness was slow the first half of the first day, but as schools let out, business seemed to boom. Mostly female teenagers took advantage of the special and all but one room was occupied. <br>\r\nKevin, a well-built, brown-haired young sixteen year old, and his friend Drew, a blonde-haired, skinny  saw a flyer on the school's bulletin board and were curious about getting a massage. When they both arrived, Mr. Peabody explained \"Boys, there's only one room left for the next hour and I only have Pete here to massage you\". Kevin and Drew look at each other. <br>\r\nMr. Peabody exclaims \"Tell you what boys...it's a double room with two tables. Both of you can be in there at the same time if you wish and I'll send in the next masseur or masseuse that becomes available\". <br>\r\nDrew questions saying \"Do we like have to get naked and all?\" Kevin laughs and replies \"What's wrong Drew, didn't change your underwear or socks this morning?\"<br>\r\nDrew sarcastically replies \"No, I just don't like being naked in front of other people\". Mr. Peabody pipes in and says \"You just need to strip down to your underwear, that's all\". Kevin replies \"I'm wearing boxers\". Mr. Peabody looks at Kevin at says \"then strip down to your boxers\".<br>\r\nKevin and Drew smile at each other and place their backpacks on the coat rack. They follow Mr. Peabody down the hall to the last empty room.<br>\r\nHe introduces Pete to the boys and walks back up front.<br>\r\nPete shakes Kevin and Drew's hands and invites them in the room. Kevin and Drew walk in and sit atop the two tables facing each other.<br>\r\nPete looks at both boys and states \"So boys, either of you ever have a massage before?\"<br>\r\nDrew shakes his head, but Kevin pipes in saying \"My mom massages my back and my feet after my football games sometimes\".<br>\r\nPete exclaims \"I hope you take a shower first!\" Drew laughs and says \"Kevin, you can go first. I can wait\".<br>\r\nKevin jumps up onto the floor saying \"Cool!\" and begins to peel off his t-shirt and kick off his shoes. Pete laughs as he adjusts the bed and prepares the oil. Drew kicks off his own shoes and wiggles his stocking toes as he watches Kevin pull his own shorts down and tosses them to a chair in the corner. Kevin hurriedly lays down onto his stomach and sighs as he places his face in the small hole. <br>\r\nPete looks down at Kevin's body and places a small towel across his boxers. He places a cushion under Kevin's shins, then tugs off Kevin's dark socks exposing his pink bare soles and toes. Kevin sighs again and wiggles his bare toes in the open air. Pete brushes the sock lint from Kevin's soles and he squirms. Kevin exclaims \"Hey no tickling my feet man. I'm very ticklish!\" Drew laughs.<br>\r\nPete says \"I'm sorry Kevin. I just wanted to clear your bare feet of sock lint. You know, for a boy your age, you've got some smooth and soft bare feet. Just saying. I'm used to having dry skin or worse\". Pete lifts Kevin's bare feet up and looks at his toes and tops saying \"and they're pedicured too\". <br>\r\nKevin smiles and says \"My mom does it for me once in a while. She doesn't like seeing bare feet that are smelly or that have dry skin or callouses all over\". Pete admires Kevin's bare beauties before placing them back down.<br>\r\nHe gets started by spreading warm oil all over Kevin's back and kneads it in. Kevin groans as Drew watches Pete's skillful hands. <br>\r\nPete says \"Hey, I don't want to get oil all over your boxers Kevin. Do you mind if I take them off? I can cover you back up with a towel\".<br>\r\nKevin replies \"Sure, go ahead and take them off. You can leave the towel off too since its a little hot in here\". <br>\r\nPete pulls the towel away and pulls off Kevin's boxers leaving him buck-naked on the table. Kevin's skin is very tan except for his buttocks region and the bottoms of his bare feet.<br>\r\nPete works in more oil on Kevin's buttocks area and back of his legs. Kevin groans some more as Drew admires his friend's bare body. Pete pops Kevin's bare toes and works in the oil into his bare soles. Kevin's toes splay in delight as he moans some more.<br>\r\n<br>\r\nPete turns to Drew saying \"If you want to get undressed and lie down, please do. It is a bit stuffy in here. The air conditioning is working overtime\". Drew smiles and begins to peel off his t-shirt, then says \"Everything Pete?\" <br>\r\nPete smiles and replies \"No, just your shorts and socks, leave your underwear on\". Pete begins to wipe off the oil on Kevin with hot towels.<br>\r\nDrew tosses his shirt aside and stands up to unbuckle his pants. His semi-tan chest is hairless, but showing signs of muscles and a six pack. He unbuckles his pants and takes them off, placing them on the chair next to Kevin's clothes and shoes. Drew hops back up onto the table and lies down on his back the opposite way of Kevin crossing his legs.<br>\r\nPete finishes saying \"Okay Kevin, you can turn over now. Let me get a towel first\". Before Pete can retrieve a towel from the cupboard, Kevin turns over exposing his big manhood to both Pete and Drew. Kevin is semi-erect, but doesn't seem to care. Pete puts a small towel over Kevin's package which doesn't cover it all the way, eventually coming off leaving Kevin fully exposed.<br>\r\n<br>\r\nPete is awestruck at Kevin's manhood and naked body that he doesn't know what to do. Kevin twitches his golden bare toes which causes his penis to grow. Pete looks over at Drew with his eyes now closed and then back at Kevin. Kevin as a strange look on his face.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1541739600,
            "id":2575475,
            "title":"Half Price Special not needed"
        },
        "14":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "A knock at the door startles Pete",
                "Drew wakes up and sees that he is completely naked",
                "Kevin asks Pete to relieve him",
                "Pete relieves Kevin's erection and Drew's erection"
            ],
            "content":"<div class=\"\"><div> <span>Pete thinks to himself that he can't take advantage of Kevin or his massive erection or even his beautiful bare feet. He notices Drew laying the opposite way with his stocking feet only a few feet away. <br>\r\nPete says \"Hey Kevin, I'm going to start on your friend and let you relax a little\". Kevin sighs and only moans. Pete takes hold of Drew's stocking feet and begins to rub and knead them both at the same time. Drew keeps his eyes closed, but moan along side his friend Kevin. <br>\r\nAfter a moment, Pete tugs off both of Drew's gray socks exposing Drew's semi-tan, hairless bare feet with long pedicured toes. They wiggle as they are set free. Drew's feet are not as tan as Kevin's, but are smooth and soft to the touch. Pete massages Drew's bare toes and soles with oiled hands as Drew sighs in relaxation. Pete notices Drew's bulge in his underwear and softens the massage. He looks back at Kevin noticing his penis is now flaccid.<br>\r\nPete stops massaging Drew's bare feet and covers him with a towel. He begins to work in warm oil onto Kevin's bare feet and legs trying not to get him erect. Before putting oil on Kevin's feet, he slowly engulfs Kevin's right big toe into his mouth and sucks on it. Pete does the same with Kevin's left big toe before continuing the massage. Kevin reacts only with moaning. He notices Kevin is erect again and decides to take a break. He steps over to Drew's exposed bare beauties and carefully sucks on each of his two big toes. Drew too only is able to moan and groan. Pete pulls the towel away exposing Drew's underwear with a bigger bulge. He carefully pulls off Drew's underwear unleashing Drew's smaller, but impressive package.<br>\r\nPete stands back and looks at both naked boys asleep.</span></div></div>",
            "created":1541739600,
            "id":2575484,
            "title":"Pete turns and sees Drew's stocking feet wi..."
        },
        "141":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Drew feels strange, but is shocked to see he is naked",
                "Kevin & Drew request a shower",
                "Kevin notices his toes are wet"
            ],
            "content":"<div class=\"\"><div> <span>Pete quickly places large towels over Kevin and Drew exposing only their heads and bare feet. He adjusts the light and opens the door to find a female colleague standing there.<br>\r\nPete says \"JC, you can take Drew there (points) as I am working on this one (points)\". They're both completely naked because they didn't want to get any oil on their boxers or underwear. Every time I touch Kevin's or Drew's bare feet, they get an erection\".<br>\r\nJC replies \"Pete, customers are not supposed to be naked. You know the rules!\" She looks over at the two of them then says \"Are they out completely?\"<br>\r\nPete nods and smiles. JC says \"I'll relieve Drew, you relieve Kevin\". Pete replies \"But it might wake them up\". JC exclaims \"Not if you do it slowly and carefully. Watch me\". <br>\r\nJC takes hold of a bottle of warm oil, then walks over to where Drew is laying down and removes the towel. She looks at him from head to toe and says \"My, oh my, what a stud you have here. Those bare feet of his are to die for! As for that package, better get some extra towels\". <br>\r\nPete smiles as JC lightly massages Drew's front side and nibbles at his bare toes. He hands her some extra towels as JC pours warm oil on Drew's manhood and begins to stroke it slowly. Pete helps her by engulfing both of Drew's big toes into his mouth and tantalizing them at the same time. In almost no time, Drew's manhood springs up to a stiff erection. After a few more strokes and licks on his bare toes, Drew explodes, sending several gushers all over. His body collapses in total relaxation. They clean him up, then cover him up keeping his bare feet exposed and go to work on Kevin. <br>\r\nJC takes hold of Kevin's big toes and tantalizes them with her tongue as Pete pours the warm oil onto Kevin's package and begins to stroke it. After a few moments, Kevin has a massive erection. Kevin's toes splay as he shoots a big gusher all over his stomach.<br>\r\nKevin body too, collapses into a total relaxed state. The two massage workers clean up Kevin and place a towel over his naked body keeping his bare feet exposed.<br>\r\nThey clean up the room and fold the boys' clothes in the chairs. After one more nibble and sucking session, Pete and JC wake the boys up.</span></div></div>",
            "created":1541739600,
            "id":2575498,
            "title":"A knock at the door startles Pete"
        },
        "1412":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "JC helps the boys put their shoes and socks back on their bare feet",
                "Pete gets a big tip as does JC from both boys",
                "Pete gives Drew a coupon for having to wait for his massage"
            ],
            "content":"<div class=\"\"><div> <span>Both boys are groggy and ask if they can shower before dressing.<br>\r\nPete says \"There is only one shower, but we also have a shower table. Which one of you would like try out the shower table?\"<br>\r\nKevin replies \"Drew, you can have the shower. I want to try the shower table\". Drew sits up and swings his bare legs around and says \"Cool! I like to wash my own body anyways\". Pete and JC smile.<br>\r\nJC says \"Kevin, do you want me or Pete to assist you?\" Kevin replies \"Why not both of you?\" Pete replies \"Why not?\"<br>\r\nPete helps Drew put a towel around his waist and shows him the shower across the hall. JC helps Kevin put a towel around his waist and escorts him to the shower table room down the hall. Kevin whips off his towel exposing his naked body to the two massage staffers and lies down on the padded table. His body is rinsed with warm water then JC and Pete begin to scrub Kevin's backside with soap. Pete gets his legs and bare feet while JC gets his buttocks and back. Kevin sighs and twitches his toes. After a quick rinse of warm water, Kevin turns over onto his back. <br>\r\nJC admires Kevin's package as it is semi-erect. Pete tries not to look interested and begins to scrub the front of Kevin's legs and tops of his bare feet, playing with his twitching toes. JC says \"Kevin, do you mind if I wash your penis too?\" Kevin replies \"No problem, I hope it doesn't grow though\". JC begins to scrub Kevin's arms, chest, stomach and penis. It begins to grow a bit, but stops after being rinsed off. <br>\r\nJC and Pete dry Kevin's body off and escort him back to the room to get dressed. <br>\r\nDrew is already back from his shower and is already getting dressed. He has his pants on, but still bare chested and barefoot. Kevin whips off the towel and puts on his boxers and shorts, then his shirt. He picks up his shoes and socks and walks out of the room in bare feet. Drew puts on his shirt and walks out barefoot carrying his shoes and socks.</span></div></div>",
            "created":1541739600,
            "id":2575510,
            "title":"Kevin & Drew request a shower"
        },
        "14123":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Pete gives Gil a good massage",
                "Steve goes against his wishes and gets Pete to massage him",
                "Kevin and Drew sit down to have a snack while waiting"
            ],
            "content":"<div class=\"\"><div> <span>The boys put on their shoes and socks in the lobby after paying for their massages. They bump into some of their school friends who are waiting their turn. Drew's friends Kelly and Gil, part of his cross-country team, are waiting impatiently. Kevin's girlfriend and best friend, Amy and Steve, are hanging out with other friends. <br>\r\nPete takes Drew aside and gives him a coupon for a free massage since he had to wait. Drew thanks him saying \"The foot massage was wonderful Pete. Did my toes taste good?\" Pete smiles and summons the next client. Gil, Drew's friend, follows Pete back to the same room.<br>\r\nKevin goes over to Amy and gives her a kiss on the cheek. He thanks Steve for picking her up from cheerleading practice. Kevin says \"I'll wait for you two in the food court okay. Hey Steve...I hope you get Pete...he's great!\" Steve smiles and replies \"I'd rather get a female than a male massage person\". Kevin replies \"He has strong hands and technique. My back and feet feel great!\". <br>\r\nSteve looks down at Kevin's shoes and replies \"Nobody's working on my feet. I'm too ticklish and anyways they stink\". Everyone laughs.<br>\r\n<br>\r\nMeanwhile, Gil follows Pete into the room and sits on the table. Pete comes over and bends down and begins to untie Gil's shoes and pulling them off. Gil says \"Uh Pete, I can do that myself\". Pete chuckles as he places Gil's shoes in the corner. He then peels off Gil's white socks exposing his tan, yet somewhat hairy bare feet with slender, pedicured toes. Gil wiggles his toes as Pete brushes off the sock lint. Gil peels off his own shirt and then stands to pull off his shorts. Pete exclaims \"Do you me to use oil? If so, you might want to take off your underwear too. I'll cover you with a towel\". Gil replies \"Lots of oil...and there's no need for a towel. I like to bare it all especially at home\". Pete exclaims \"Well you do have a good looking body...do you work out?\"<br>\r\nGil strips off his shorts and underwear, standing naked in front of Pete saying \"Yep, what do you think?\"<br>\r\nPete stands back and admires Gil's naked body and bare feet.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1541739600,
            "id":2575523,
            "title":"Pete gives Drew a coupon for having to wait for..."
        },
        "141232":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Pete gives Steve a great body and foot massage",
                "Steve gets excited and explodes",
                "Steve loses the bet walking out barefoot to the lobby"
            ],
            "content":"<div class=\"\"><div> <span>A while later a barefoot Gil emerges from the back hallway carrying his shoes. He pay at the front counter and gives a tip to Pete.<br>\r\nSteve comes up to him and looks down at his bare feet saying \"What is with everyone getting a massage from Pete coming back barefoot?\"<br>\r\nGil replies \"He's a great foot massager! My feet and toes feel wonderful! I dare you to try him\". Steve and Gil shake hands and Steve follows Pete back to the massage room.<br>\r\n<br>\r\nNow Steve is a well built, slender and sandy blonde youth wearing a football jersey, shorts with basketball shoes and red socks. Pete instructs him to take a seat on the table as he stoops down to untie his shoes. Steve lets him untie his shoes and pull them off, but moves his stocking feet back as Pete tries to peel his socks off. <br>\r\nSteve shouts out \"I want to keep my socks on my feet dude. I'll take off everything else, but not the socks\". Steve begins to pull off his jersey and shorts, then hops up on the table and lays down on his stomach. <br>\r\nPete says \"If you want some oil with my massage, I'd suggest removing your boxers too\". Steve sighs and lifts his butt and pulls down his boxers off his legs, letting them fall to the floor. <br>\r\nAfter Pete works in the oil all over Steve's backside, he moves down to his stocking feet and begins to rub them. Steve sighs and slightly moans, wiggling his toes. Pete says \"Come on Steve, lose the socks and let me really massage these bare feet of yours\". <br>\r\nSteve hesitates saying \"I, well...ah, go ahead. No use keeping hidden any longer\". Pete smiles and peels off Steve's red socks revealing two semi-tan, semi hairy bare feet with slender, pedicured toes and pinkish smooth soles. Pete begins to knead and press on all areas of each bare foot admiring his big toes as Steve moans loudly.</span></div></div>",
            "created":1541739600,
            "id":2575622,
            "title":"Steve goes against his wishes and gets Pete to ..."
        },
        "1412321":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Henry tries Pete's fantastic foot massage",
                "A few days later, Drew uses his free massage coupon",
                "Pete makes a house call to Kevin's house"
            ],
            "content":"<div class=\"\"><div> <span>Pete finishes giving a fantastic foot massage that makes Steve fall asleep. He takes Steve's two big toes and engulfs them into his mouth and sucks on them while tickling Steve's bare soles. Pete can see that Steve is enjoying it seeing the smile on his face and the moaning coming from his mouth. He lets go of Steve's big toes and carefully rolls Steve's body over onto his back. <br>\r\nSteve has a massive hard-on that Pete quickly notices. Before finishing the front side of Steve, Pete relieves Steve. He pours oil onto his pole and slowly strokes it until a gusher erupts all over his chest. Steve's toes splay in ecstasy.<br>\r\nAfter cleaning Steve's body and finishing the massage, Pete nudges Steve to wake up.<br>\r\nPete says \"Okay Steve, I'm done. You can get dressed now\". Steve slowly awakens saying \"Oh my gosh, Gil was right. My body and especially my feet feel great\". <br>\r\nSteve looks down at his bare feet and wiggles his toes. He slowly gets up and begins to dress as Pete tidies the room. <br>\r\nPete exclaims \"Do you need help putting on your shoes and socks?\" Steve shakes his head, puts on his football jersey, tucks his socks inside his shoes and walks out barefoot.<br>\r\nA moment later, Steve walks out barefoot into the lobby where Gil and some other friends are waiting. Gil smiles as he sees Steve still barefoot. Gil says \"See, I told you, you'd come out in your bare feet. I won the bet!\" Steve shakes his head in disappointment.<br>\r\nGil helps Steve sit down and begins to put Steve's socks on his bare feet. Another guy friend, Henry, helps them with Steve's shoes.<br>\r\nThey wait as Steve pays for his massage and tips Pete. </span></div></div>",
            "created":1541826000,
            "id":2575739,
            "title":"Pete gives Steve a great body and foot massage"
        },
        "14123211":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Pete locks the door and has his way with Henry's body",
                "Henry's bare feet are pleasured making him excited",
                "Pete lifts Henry's bare feet on to his shoulders and mounts him"
            ],
            "content":"<div class=\"\"><div> <span>Henry, a sandy-blonde haired slender youth with a tan body is dressed in a polo shirt, khaki shorts with sneakers and white socks.<br>\r\nPete invites him back to the room and excuses himself for a moment to use the restroom. Pete watches Henry walk toward the table and gives him the once over.<br>\r\nHenry says as he sits down \"Do you want me to undress completely or just wait?\" Pete replies \"Uh, just take your shoes off for now. I don't want you to get cold\". Pete leaves and Henry kicks off his shoes leaving them where they land. He wiggles his stocking toes.<br>\r\n<br>\r\nA moment or so later, Peter enters and finds Henry laying down on the table on his back with his eyes closed. He sees that his shoes are already off and his stocking feet are hanging over the edge of the table. Pete asks \"Henry, you okay?\" <br>\r\nHenry replies \"Yeah, I just have a headache\". Pete walks over and takes hold of Henry's stocking feet and gives them a little rub. <br>\r\nPete says \"Mind if I take off your socks? I do a better massage with bare feet\". Henry replies \"Go ahead, just don't tickle them. I'm have very ticklish toes\".  Pete smiles as he pulls off Henry's two socks revealing two hairless, unblemished, soft, tan bare feet with slender, pedicured toes. Henry splays his toes in relief of being bare.<br>\r\nPete begins his foot massage twisting Henry's toes and prodding his bare soles. Henry moans a little and sighs saying \"Oh that feels good\".<br>\r\nPete concentrates on Henry's big toes, massaging all around them. He looks up and sees that Henry's eyes are still closed, so he softly engulfs Henry's left big toe into his mouth and swirls his tongue around it. Henry moans louder and splays all his toes again.<br>\r\nPete lets Henry's toe free and begins massaging his bare legs tugging down his baggy shorts and underwear in the process. Henry is soon completely naked and has a nice package for Pete to ponder on.</span></div></div>",
            "created":1541998800,
            "id":2576791,
            "title":"Henry tries Pete's fantastic foot massage"
        },
        "14123212":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Drew tells Jace to try Pete as his masseuse next time",
                "Both boys are told to leave the mall since they are barefoot by security",
                "Jace's mom picks up both Drew and Jace from the mall"
            ],
            "content":"<div class=\"\"><div> <span>Drew is seen walking up to the store front with a slight limp and asks Mr. Peabody if Pete is working today.<br>\r\nHe is wearing a basketball jersey, baggy shorts with white basketball shoes and socks.<br>\r\nMr. Peabody replies \"Pete should be here soon. Why don't you sit down here until he gets here? I do have other masseurs available\".<br>\r\nDrew exclaims \"Oh, Pete's the best. I'll wait for him. I screwed up my ankle playing basketball and hope Pete can relieve the pain\".<br>\r\nDrew sits down and rests his right foot on a side chair and sighs.<br>\r\n<br>\r\nA few moments later, Pete walks in from the back entrance and smiles as he notices Drew. <br>\r\nPete exclaims \"Drew my boy, what brings you back so soon?\" Drew replies \"Well, I messed up my ankle playing basketball today and was wondering if you could possibly work your magic on it?\"<br>\r\nPete smiles and helps Drew back to the back massage room.<br>\r\n<br>\r\nAs they enter the room, Pete helps Drew to the end of the table and helps him sit up on it. Drew leans back onto his shoulders as Pete unties his basketball shoes and pulls them off.  Drew sighs saying \"It's only my right foot Pete, but thanks for taking both of my shoes off. It feels good\". Pete smiles as he continues by peeling both of Drew's socks off exposing his bare beauties once more. Drew stretches out his bare toes as Pete brushes off the sock lint and says \"I thought you'd like to have both of your feet bare Drew\".<br>\r\nPete takes hold of Drew's right bare foot and begins to tweak and press around the ankle. Drew gasps and winces saying \"Pete, that really hurts. Do you think I sprained it?\"  Pete studies Drew's foot for a moment then compares it with Drew's other foot.<br>\r\nHe replies \"Well, it is a bit swollen, but there's no apparent bruising. You better have your doctor look at it just for safe measures\".<br>\r\nPete continues \"I can put some ice around it and give you a complimentary massage if you wish?\" Drew nods his head replies \"Yes, that would be great! (begins to take off his jersey shirt) Do you want me to strip all the way?\" <br>\r\nPete replies \"Might as well, the icing process should be on your ankle for at least a half hour\". Pete walks out of the room to get some ice bags and wraps. Drew throws his jersey shirt over to a chair, then slides his baggy shorts and underwear off. He tosses them over his shirt. He lays back on his back naked with no draping.<br>\r\nPete returns moments later and wraps the ice around Drew's right ankle. He tickles Drew's left bare sole to lighten the mood. <br>\r\n\"Why don't you nibble on them like you did a few days ago? I felt you take my socks off and fondle my bare feet, then suck on my toes\". <br>\r\nPete replies \"Like this...(he stoops down and engulfs Drew's left big toe into his mouth and begins to suck on it)\". Drew begins to moan and his manhood begins to stir. Drew's right big toe is also inserted as Pete sucks on both of them at the same time. This drives Drew crazy and causes him to become more erect. Pete takes Drew's toes out and begins to nibble on each little toe and lick Drew's bare soles. Drew winces and groans even more saying \"Oh my gosh...I'm going to explode!\" Drew splays all of his toes and shoots a gusher all over his stomach and chest, then collapses. Pete kisses Drew's toes before cleaning up the mess.<br>\r\nA few moments later, Drew comes to and feels Pete massaging his chest and stomach. He checks on the ice wrap on Drew's ankle.<br>\r\n\"Feeling better?\" Pete asks Drew. Drew replies \"Much better and my ankle doesn't hurt as much\". Pete states \"Let me finish up here and I'll help you get dressed. I have an ace bandage for your ankle too\". Drew closes his eyes as Pete finishes the massage.<br>\r\nA moment later, Drew is dressed except he is still barefoot. Pete wraps the ace bandage around Drew's right ankle then tries to put the sock over it. \"Your ankle is still too swollen for a sock or shoe on it. Might as well stay barefoot\". Drew smiles as Pete kisses his big toes and helps him out of the room.<br>\r\nAs they walk out, Drew sees one of his friends, Jace, exiting the shower room with only a towel around his waist. Jace's bare feet are slender and hairless with has pedicured, slender toes. He wiggles them as his masseur guides him back to the room.<br>\r\n<br>\r\nA few moments later, Drew is seen sitting on a bench outside in the mall. Jace comes walking out and sits down next to him. He notices Drew barefoot and asks \"Hey Drew, how come your barefoot?\" Drew replies \"I sprained my ankle and my sock and shoe won't fit on my swollen foot. I decided just to stay barefoot and let my feet breathe\". <br>\r\nJace looks down at Drew's bare feet and toes and decides to bare his feet. He quickly kicks off his shoes and peels off his socks and stretches out his slender tan toes next to Drew's bare feet.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1541826000,
            "id":2575756,
            "title":"A few days later, Drew uses his free massage co..."
        },
        "141232123":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Drew's older brother Chad barges in his room and causes chaos ",
                "Jace applies lotion to his bare feet since he has dry skin",
                "Drew offers Jace a preview of the foot massage Pete gave Drew"
            ],
            "content":"<div class=\"\"><div> <span>Drew's mom texted Drew to come out to the parking lot. She is surprised to see him walking barefoot along with his barefoot friend Jace. As the boys walk toward the car, Drew tells Jace about his two terrific massages he has received from Pete. <br>\r\nDrew continues by saying \"...and he works wonders on your bare feet, though he might ask you to wash them first since he hates dirty feet\". Jace replies \"I usually don't walk around barefoot like this, so my feet will be clean if I see him\". <br>\r\nThe boys get in the car, Drew in the front seat and Jace in the back. Both boys throw their shoes and socks in the back. As Drew's mom drives off she asks Drew \"Why are you two barefoot?\"<br>\r\nDrew explains \"I messed up my ankle and a friend put an ace bandage on it and now my shoe and sock won't fit. I decided just to go all barefoot\".<br>\r\nJace pipes in \"Yeah and I joined him in baring my feet too\". Drew's mom looks at her son's bare feet and Jace's bare feet and says<br>\r\n\"Well when we get home, please wash them before going inside the house! The bottoms of both of your feet are almost black and I don't want it tracked on my clean carpet!\"<br>\r\nDrew looks back at Jace and says \"We have a no shoe rule at my house, but I just go barefoot all the time. We can use the outside shower to wash our feet\". Jace smiles and wiggles his toes.<br>\r\n<br>\r\nA while later, the boys are seen washing their bare feet off in an outside shower on the side yard. Drew scrubs Jace's soles as Jace does the same for Drew. They rinse their feet off and dry them with a couple towels before coming inside. They leave their shoes and socks in the car. The boys run barefoot up to Drew's room to play video games. Drew's mom yells \"Boys, dinner will be ready soon. Drew, let your friend Jace borrow a pair of socks before coming down for dinner\".<br>\r\nDrew explains to Jace \"My mom dislikes anyone barefoot at the dining table. You can borrow some socks and then take them off when dinner is over\". </span></div></div>",
            "created":1541826000,
            "id":2575856,
            "title":"Drew's mom picks him up and drives both boy..."
        },
        "1412321231":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Drew's mom calls them for dinner",
                "Jace kisses Drew's toes",
                "Drew kisses Jaces' toes"
            ],
            "content":"<div class=\"\"><div> <span>The boys are laying on the carpet with their bare feet in the air playing video games on Drew's TV. Jace's right bare foot and Drew's left bare foot play footsie. <br>\r\nDrew's older brother Chad, dressed in a football jersey, baggy shorts and black ankle socks sneaks in on his hands and knees and carefully moves closer to the boys. He uses his two index fingers to tickle Drew and Jace's bare feet that are playing together on their bare soles. Each boy's bare foot twitches along with their toes. <br>\r\nDrew says \"Jace, quit tickling my foot with your toes\". Jace replies \"You quit tickling my foot with YOUR toes!\"<br>\r\nThey both stop and turn around as Chad attacks them and their bare feet. He quickly pins the boys down on the floor on their backs and begins to torture both of their bare feet and toes.<br>\r\nDrew tries to get up and get back at his brother, but Chad attacks his younger brother's bare soles making Drew go ballistic. <br>\r\nDrew yells to Jace \"Get my brother's socks off and tickle them. His feet are more ticklish than mine!\" As Drew and Chad wrestle, Jace manages to break free and attack Chad's legs and feet.<br>\r\nChad's stocking feet are seen thrashing as Jace moves in and pins them down, then quickly pulling off both of Chad's ankle socks. He begins to tickle his bare soles and tender toes. Chad begins to laugh uncontrollably.<br>\r\nJace yells out \"Drew, I got them down and tickling them\". Drew yells back \"Stick his big toe in your mouth and that will calm him down!\" Jace yells back \"What, that's gross!\"<br>\r\nDrew yells out again \"I know, but it's the only way to make my brother relax. I would, but he has me pinned!\" Jace looks down at Chad's flexing toes and moves his mouth closer to Chad's right big toe. He holds onto Chad's foot and other toes and inserts Chad's big toe in his mouth and begins to suck on it. Jace begins to enjoy it as Chad begins to relax and lets his brother go. Drew quickly grabs Chad's other barefoot and sticks his big toe in his own mouth. Chad moans and collapses on the ground.<br>\r\n<br>\r\nA while later, Chad awakes tied to Drew's bed clad only in his speedos. His own socks are stuffed in his mouth and his wrists and ankles are tied down using Drew's socks from his dresser drawer. Jace and Drew laugh as Chad tries to break free. <br>\r\nDrew says \"Sorry Jace for having to suck on my brother's toe. He has disgusting, smelly feet, but I found out it's the only way to really subdue him. I overheard his girlfriend and him in his room talking and peeked in. She had just taken his shoes off and about to peel off each of his socks. Chad was laying on his bed enjoying it. She peeled off both socks and stuck both of his big toes in her mouth at the same time. Chad moaned loudly and passed out\".<br>\r\nJace looks down at Chad's bare toes wiggling as Chad glares at both of them. <br>\r\nDrew continues saying \"While he was out, she stripped off the rest of his clothes and kissed his whole naked body. You should have seen the boner he had!\"<br>\r\nJace replies \"Well, we can again\". He stoops down near Chad's bare feet and begins to lick and suck on his toes and soles. Drew laughs as Chad begins to grow a bulge in his speedo. Drew grabs his pocket knife and cuts the speedos releasing Chad's stiff manhood. Chad is moaning and thrashing around at the same time. Jace nibbles on Chad's toes, then sucks on his big toes again.<br>\r\nChad's toes splay as he moans loudly and erupts. He collapses and passes out again. <br>\r\nJace takes his toes out of his mouth and helps Drew clean his brother up.<br>\r\nJace says \"Wow, that was some erection your brother had\". Drew replies \"Yeah, I hope I can get one as big one day!\"<br>\r\nDrew puts his brother's clothes back on his brother after untying him. Jace puts Chad's ankle socks back on his feet after kissing Chad's big toes. <br>\r\nJace says \"My mom used to do that to my feet\". Drew looks at Jace weird.<br>\r\n</span></div></div>",
            "created":1541998800,
            "id":2576715,
            "title":"Drew's older brother Chad barges in his roo..."
        },
        "14123212312":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Jace tells his story",
                "Drew listens with intent wiggling his toes",
                "Chad comes to and runs out."
            ],
            "content":"<div class=\"\"><div> <span>Jace sits Drew down and lifts up both of Drew's bare feet and begins to nibble on his bare toes. He kisses his big toes causing Drew to sigh.Jace exclaims \"I sorta have a foot fetish. Asking me to suck on your brother's toes made me lose it. I've had a crush on your bare beauties ever since health class last year (smells Drew's toes). Remember when the teacher ask you to be the patient and you had to lay on the table?\"</span></div></div>",
            "created":1541998800,
            "id":2576793,
            "title":"Jace kisses Drew's toes"
        },
        "141232123121":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "During dinner, Jace uses his foot to slip off Drew's socks under the table",
                "Drew plays with Jace's stocking feet underneath the table",
                "Jace takes his own socks off and slips off Drew's socks under the table"
            ],
            "content":"<div class=\"\"><div> <span>Jace sets Drew's bare feet on his lap and continues to tell his story...\"It was in early summer and you were wearing just a t-shirt, shorts and sports shoes with no show socks. I'd hope you had been wearing flops, but you didn't. Anyway, the teacher had you took off your t-shirt and hop up on the table. He listened to your heart and felt your back and stomach. He then had you lay down and untied your shoes, pulling them off one by one. Seeing you shoe-less, made me want more. I couldn't wait until he pulled those socks off your feet, so I raised my hand and asked if I could help him. The teacher called me up and I ran up smiling.\"<br>\r\nDrew looks down at his own bare feet in Jace's lap.<br>\r\nJace continues saying \" I immediately went toward your stocking feet, but didn't want to startle you, so I just admired them. I put my hands on your warm socks and lightly caressed them. As the teacher talked, I was able to slip one of your socks off from the heel. I tugged on the toe end and off it came. Your toes wiggled, glad to be free, that I immediately tugged off the other sock. Your beautiful, unblemished bare feet and toes were finally exposed!\" Drew wiggles his toes as Jace grabs hold of his toes with his hands.<br>\r\nDrew pipes in \" I do remember that. I love going barefoot when I can, but my mom won't let me wear flops to school. After the teacher took my shoes off, I'd hope he would take my socks off too, but he didn't. It felt great when you tugged them off finally.\"<br>\r\nJace smiles and says \" I just wish I could have played with them a little. All I did is wrap your ankle. At least I got to touch your golden toes\".<br>\r\n<br>\r\nJust then Drew's mom calls from downstairs \"Dinner is ready, make sure to put some socks on your feet. Drew, let your friend Jace borrow some socks of yours\". Drew replies \"Okay mom, we'll be down in a minute\".<br>\r\nDrew gets up and retrieves two pairs of socks from his dresser drawer. He hands a pair to Jace. Jace puts them on his feet as Drew sits down to put his socks on. Jace stops him saying \"Allow me!\" He takes the socks from Drew's hand and puts the socks on Drew's bare feet. Jace continues saying \"Too bad they have to get covered up. They're coming off after dinner!\"<br>\r\nThe boys run downstairs to dinner.</span></div></div>",
            "created":1541998800,
            "id":2576865,
            "title":"Jace tells his story"
        },
        "1412321231213":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Chad and Jace have sex in Drew's room",
                "Drew is taken advantage of when he returns to his room by Jace",
                "Jace and Chad have sex in the bathroom's shower"
            ],
            "content":"<div class=\"\"><div> <span>During dinner with Drew, Drew's parents and older brother Chad, Jace can't wait to see Drew barefoot again. Unknown to anyone, he slips off his borrowed socks with his toes and tucks them under the chair. He stretches out his own slender toes on the carpet. As they all continue to eat. Drew and Chad are sitting across from Jace, his parents on each end. <br>\r\nDrew says \"Hey mom, can Jace spend the night? We want to go to the beach early tomorrow\". His mom looks at him and says   \"Well, what about a change of clothes for him?\"<br>\r\nDrew replies \"I can throw them in the wash tonight for tomorrow\". Drew's mom thinks then says \"Okay, I guess. Jace, are you okay wearing just a bathrobe while your clothes are being washed?\" <br>\r\nJace nods his head as his barefoot tries to find Drew's stocking feet. Instead of Drew's feet, Jace finds Chad's stocking feet and ends up pulling off both of his socks together.<br>\r\nChad looks over at Jace and smiles and mouths \"Thank you...(smiling)\". Jace is startled and tries again, this time getting his bare feet around Drew's stocking feet and pulls off both socks.<br>\r\nJace then begins to use his bare toes to play with Drew's bare toes.<br>\r\nA moment later, Drew's parents excuse themselves and walk into the living room with coffee. The three barefoot boys are left at the table. Chad darts underneath the table and begins to play with Jace's bare beauties. He sticks Jace's two big toes into his mouth causing Jace to go ballistic. Drew pushes Chad off of Jace's toes and the two run up the back stairs to Drew's room. Chad tries to follow, but is called by his parents to talk with them.<br>\r\nIn Drew's room, Jace strips off all of his clothes so they can be washed. Drew throws him a towel which Jace discards and stays buck-naked. Drew takes Jace's clothes down to the basement to be washed. Jace sits on Drew's bed and watches TV.</span></div></div>",
            "created":1541998800,
            "id":2576948,
            "title":"Jace takes his own socks off and slips off Drew..."
        },
        "14123212312133":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "In the morning, Jace wakes up Drew by tantalizing his bare feet and toes",
                "Jace wakes up in the night and has his way with a sleeping Drew",
                "In the morning, Drew wakes up first and kisses Jace's toes and soles"
            ],
            "content":"<div class=\"\"><div> <span>As Drew is busy putting his friend Jace's clothes in the washer, Chad sneaks into his brother's bedroom again and surprises Jace.<br>\r\nChad is also surprised that Jace is completely naked, so he quickly covers Jace's mouth with one hand and picks him up and throws his bare legs over his shoulders. He carries him to his bathroom and walks inside, locking the door.<br>\r\nChad puts Jace down into the shower stall and turns on the water. He quickly strips naked and joins Jace in the shower. Chad begins to lather Jace up with soap all over getting Jace excited. Jace returns the favor by sudsing up Chad's bare body. <br>\r\nChad bends down and lathers up Jace's bare beauties and sticks his fingers thru his toes. Jace leans back and moans in delight.<br>\r\nJace's legs are then thrown over Chad's shoulders as Chad inserts his member into Jace and pumps away. Jace's toes splay as he groans and Chad thrusts harder.<br>\r\nA moment later, Chad climaxes all over Jace's chest. He takes hold of Jace's two big toes and nibbles on both of them. Jace explodes in ecstasy and collapses. Chad finishes rinsing off Jace and himself and turns the shower off. He dries off Jace's body, particularly Jace's bare toes and soles. He carries Jace, while still dripping wet, back to Drew's room and lays him on the bed. He kisses his toes before leaving.<br>\r\nDrew walks into his room a moment later and sees his naked friend on his bed. He admires Jace for a moment before taking a closer look at his slender, bare toes. He notices that he must have taken a shower since his toes had wrinkles. He looks up at Jace asleep, then takes his left big toe and engulfs it into his mouth. Drew swirls his tongue around his friend's big toe, sighing and watching Jace's reaction. Jace's other toes splay a little as he moans. After a few moments, Drew finishes tantalizing Jace's toes and covers Jace up with a blanket. He strips down to his underwear and climbs underneath the covers next to Jace and quickly falls asleep. </span></div></div>",
            "created":1542085200,
            "id":2577155,
            "title":"Jace and Chad have sex in the bathroom's sh..."
        },
        "141232123121331":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Drew's mom gives Jace a blow-job after kissing him all over.",
                "Drew's mom sucks on Jace's toes and licks his bare soles",
                "Jace lets Drew's mom have sex with him"
            ],
            "content":"<div class=\"\"><div> <span>As morning comes, an exposed naked Jake lays on his back with a semi erection, stretches his bare toes and sits up. He notices Drew asleep next to him and cautiously pulls back the bed covers that cover Drew exposing his underwear-clad only body. <br>\r\nJace makes his way down to where Drew's bare feet are and begins to softly kisses his toes. Drew's toes splay in reaction and he moans, still fast asleep. <br>\r\nJace grins as takes Drew's big toes into his mouth and swirls his tongue around both of them. He begins to notice the bulge in Drew's underwear and decides to relieve him. He lifts Drew's bare feet onto his shoulders after pulling Drew's underwear off. Jace inserts his member into Drew and begins to slowly pump away. Drew's toes splay in ecstasy as Jace kisses his bare soles. It doesn't take long for Jace to climax, erupting all over Drew's chest. He carefully let's Drew's legs down and cleans him up. Drew is still fast asleep.<br>\r\nJace grabs a bath towel, wraps it around himself and walks out to get his clothes. <br>\r\n<br>\r\nAs he walks down the hall, Drew's mom startles him walking around a corner. He trips and falls to the floor losing his towel covering. <br>\r\nDrew's mom smiles as she looks down upon Jace's naked exposed body.<br>\r\nShe says \"Oh my Jace, I'm so sorry. (looks down at his manhood and then down to his bare feet) Did you sleep in your birthday suit last night?\"<br>\r\nJace looks up at her saying \"Uh, yes mam. I fell asleep after taking uh, uh a shower on Drew's bed.\" Jace gets back up on his feet, using his hands to cover his semi-erect manhood.<br>\r\nDrew's mom replies \" No need to do that Jace, I've seen my sons' penises lots of times. I must say you have a nice one too. What beautiful bare feet you have Jace...you sure take good care of them. Last night, I watched you slip your socks off your feet. (hands him his socks). Do you need a foot massage?\"<br>\r\nJace nervously says \"Uh, not really mam. I just need to get my clothes and get dressed.\" Jace tries to take the towel from Drew's mom, but she doesn't let go. She instead follows him to the basement and pushes him down on the sofa and begins to tantalize his naked body. Jace is to flabbergasted to try and get away. He lays back and begins to enjoy it.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1542171600,
            "id":2577558,
            "title":"In the morning, Jace wakes up Drew by tantalizi..."
        },
        "1412321231213312":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Jace and Drew awake suddenly, not knowing it was all a bad dream",
                "Jace and Drew put towels around their waists and walk upstairs",
                "Drew's mom fixes them breakfast allowing them to stay barefoot"
            ],
            "content":"<div class=\"\"><div> <span>She takes hold of Jace's two bare feet and nibbles on each bare toe causing Jace to squirm. Drew's mom then engulfs Jace's two big toes into her mouth, swirling her tongue around both of them. Jace moans and says \"Mam, oh gosh, that feels so good. (splays toes in ecstasy) I'm going to explode!\" <br>\r\nDrew's mom \"Jace, call me Agnes. I just love your slender toes and your smooth, soft bare soles. (kisses his soles) I can just eat you up. (moves up and begins to lick his manhood and then suck on it) <br>\r\nJace's body shivers and his toes splay even more as he explodes a huge gusher into Drew's mom' mouth. Jace lets out a big moan and collapses. Drew's mom picks Jace's limp body up and carries him to the basement bathroom. She gets him to lean against the shower stall as she turns on the water and begins to wash and scrub his whole body beginning with his bare beauties. Jace slurs his words and lets her wash him all over. <br>\r\nAs she finishes drying him off, Drew surprises them both walking in the bathroom with just a towel around his waist.<br>\r\nDrew shocked says \"Mom, what are you doing? Why is Jace all naked and such? What's wrong with him?\" Drew tries to shake his friend, but Jace literally starts to fall over. <br>\r\nDrew's mom replies \"Oh Drew, uh Jace got lost and I found him knocked out down here. I, uh, thought I'd throw him the shower to wake him up\". Drew yells back \"Mom, he's naked! Stark naked! Did you strip his clothes off him?\"<br>\r\nHis mom replies \"No, he was uh already naked! Barefoot and naked!\" Jace begins to awaken and is startled to see Drew and his mom standing over him. He quickly grabs Drew's towel off him and covers his semi erection. Drew steps back and covers his manhood.<br>\r\nDrew's mom laughs saying \"Honey, I've seen you naked nearly all your life. No need to cover your pee pee!\"  Jace sits back and slowly removes his towel exposing his manhood.<br>\r\nShe continues \"There we go...that's more like it Jace. Two young naked studs with beautiful bodies, pee pees and elegant, exquisite bare feet\". Jace and Drew look down at their own bare feet and wiggle their toes.<br>\r\n<br>\r\nA moment later, the scene dissolves into Drew's and Jace's bare feet dangling over the bed intertwined.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1542171600,
            "id":2577960,
            "title":"Drew's mom sucks on Jace's toes and lic..."
        },
        "14123212312133121":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Chad plays footsie with Jace's bare feet",
                "Drew answers the front door to let his friend Spencer in",
                "They all eat breakfast barefoot."
            ],
            "content":"<div class=\"\"><div> <span>Both boys sit up in Drew's bed and rub their eyes. They look around the room and then at each other. Drew is under the sheet and Jace has a blanket over him. Drew looks down at their bare feet intertwined and pulls his bare feet away.<br>\r\nDrew says \"Whoa dude, do you have a foot fetish? Playing footsie with my feet?\" Jace smiles and wiggles his toes.<br>\r\nJace replies \"No way my friend! I just hate wearing socks to bed. Your feet were warm and they needed some warmth\". <br>\r\nDrew looks under his sheet and notices he is at least wearing underwear. Jace pulls back his blanket and is shocked to see that he's completely naked.<br>\r\nJace exclaims \"Where's my clothes dude? Why am I naked in your bed...next to you?\" Jace jumps out of bed and covers his manhood with part of the blanket.<br>\r\nDrew laughingly says \"Don't you remember me taking your clothes and putting them in the washer last night? After dinner, we came up to my room and you stripped off all of your clothes including my borrowed socks and underwear. I took them all to the washer, as you took a shower.\"<br>\r\nJace replies \"Really? The last thing I remember is playing video games with you. I peeled off my socks after a while because my feet were hot and you tickled them after you won the last game before dinner.\" He looks down at his bare feet and stretches his bare toes.<br>\r\nDrew says \"You forgot about slipping in the hallway, hitting your head and passing out? Chad and I carried you back to my bed. He helped me take your clothes off since you needed them washed. Chad even tickled your toes and you moaned.\"<br>\r\nJace walks over to Drew's dresser drawer and sees his clothes folded in a stack. He quickly puts on his clothes, but decides to stay barefoot. Drew gets dressed and stays barefoot also. Both boys come downstairs for breakfast .<br>\r\n<br>\r\nThey notice Chad already sitting at the table wearing a polo shirt, baggy shorts and is barefoot. He smiles as they sit down across from him.<br>\r\n<br>\r\n</span></div></div>",
            "created":1542249900,
            "id":2577967,
            "title":"Jace and Drew awake suddenly, not knowing it wa..."
        },
        "141232123121331212":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Agnes invites all the boys into the backyard for a snack break",
                "Kevin stubs his big toe on a rock and Agnes cares for it",
                "Chad steps barefoot on a dead bee and his bare foot swells up"
            ],
            "content":"<div class=\"\"><div> <span>The doorbell rings and Drew gets up and walks barefoot to answer it.<br>\r\nMeanwhile, Chad and Jace eat cereal across from each other. Chad uses his bare toes to tease Jace's bare feet and legs. Since Drew's mom (Agnes) is in the kitchen, Jace only stares at his perpetrator and moves his bare feet away. Chad tries to pry his toes near Jace's seat and Jace quickly takes hold of Drew's left big toe and hold onto it. Jace tugs and pops it before letting go of it. Chad winces and withdraws his bare feet.<br>\r\n<br>\r\nA moment later, Drew and his friend Spencer walk in. Spencer is a sandy-blonde haired youth, the same age as Drew, that is slender built wearing a half-football shirt exposing his tan, six-pack abs. He is also wearing baggy shorts and basketball sneakers with white socks. Drew introduces Spencer to everyone.<br>\r\nAgnes says \"Hi Spencer, nice to meet you. If you wouldn't mind taking your shoes off and placing them at the front door. We have a no shoes in the house rule. Drew should have asked you before you came in.\" She stares at Drew.<br>\r\nDrew replies \"Sorry mom!\"<br>\r\nSpencer says \"Sorry about that mam!\" Agnes replies \"That's okay dear, you can take your socks off too if you wish since everyone else is barefooted.\"<br>\r\nDrew stoops down and helps Spencer untie his shoes and take them off his stocking feet. As Drew begins to peel off Spencer's socks, Spencer stops him saying \"I'll keep my socks on for now Drew. They're kind of sunburned from last weekend.\" Drew takes the shoes back to the front door.<br>\r\nAgnes says \"Take a seat Spencer. I've got some special aloe I use for sunburns. Let me get it.\" She leaves the kitchen momentarily. Spencer replies \"Uh, that's okay mam. You don't have to get it. My feet are okay.\"<br>\r\n<br>\r\nJace, Chad and Drew all laugh as Drew picks up a bowl of cereal for him and Spencer. As the boys begin to eat, Agnes comes back into the kitchen from a side room carrying a small bottle. She walks over to where Spencer is sitting and says \"Hon, please turn around so I can put this aloe on your poor feet.\" <br>\r\nSpencer replies \"Uh, I really don't need it mam. My feet feel fine.\" Agnes pipes up saying \"Nonsense dear, sunburns are serious.\" <br>\r\n<br>\r\nShe moves Spencer's chair toward her and stoops down to Spencer's stocking feet. She tugs off both of Spencer's socks together in one swift action revealing two pinkish-red topped, hairless bare feet with slender, trim-nailed toes. Spencer's two middle toes on his right foot are webbed together as are the pinkie toe and fourth toe on his left foot, but not all the way.<br>\r\nAgnes overlooks his defects and applies the aloe all over the tops of his bare feet. Spencer wiggles his toes and tries to hide his webbed toes from his friend and company. Drew, Jace and Chad stare at Spencer's bare feet and webbed toes grinning.<br>\r\nAgnes says \"Now doesn't that feet better Spencer? You've got some unique toes there. I think your bare feet look great.\" <br>\r\nSpencer blushes and gets up and hugs Agnes crying on her shoulder. She comforts him and leads Spencer into another room.<br>\r\n<br>\r\nIn the living room, Agnes sits Spencer on the couch and places his bare feet in her lap. She begins to massage them with here soft hands saying \"Spencer, you have beautiful feet, don't worry about what your toes look like and what other people think! Like I said they are unique and special (presses Spencer's bare soles and tugs on each toe). I used to give my sons foot massages, but they think they don't need them anymore. Didn't your mom massage your feet?\"<br>\r\nSpencer replies \"When I was really young, but not now. She tells me to get my toes fixed before she'll massage them again.\" <br>\r\nAgnes says \"You mean an operation? That's silly (takes hold of the two webbed toes). These are exclusive that makes you something special. Don't change a thing!\"<br>\r\nSpencer replies \"You really think so? (sniffs and splays his toes)\".<br>\r\nJust then Chad, Jace and Drew walk in, still barefoot and apologize for staring.<br>\r\nDrew says \"Sorry Spencer, I didn't know you had webbed toes. This is the first time I saw your feet bare.\" Drew gives him a hug.<br>\r\nJace pipes in saying \"Yeah, your feet look better than mine. My toes are plain and normal.\" He gives Spencer a fist bump.<br>\r\nChad even pipes in saying \"Man, I'm sorry for staring. Even my bare feet aren't normal. I have flat feet.\" Chad smiles at him.<br>\r\n<br>\r\nAgnes kisses Spencer's big toes before taking them off her lap. She gives him a hug and says \"Boys, why don't you all go outside and play. It's a beautiful day to throw the frisbee around barefoot (winks at Spencer).\" <br>\r\nSpencer is helped up by Drew and all four boys run out to the front yard to toss the frisbee. Spencer hesitates at the front door, looking down at his shoes, but the boys gently nudge him past them. He steps onto the soft green grass and digs his toes in.<br>\r\nAgnes looks through the kitchen window as she cleans up the breakfast dishes.<br>\r\n<br>\r\nA few moments later, Kevin and some other friends stop by and join in on the frisbee game. Kevin pauses and kicks off his shoes and peels off his socks and throws them by the front porch. He runs barefoot back to his spot. Some of the other friends do the same and soon there is a pile of discarded shoes and colored socks on the porch.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1542292680,
            "id":2578184,
            "title":"Drew answers the front door to let his friend S..."
        },
        "1412321231213312122":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Kevin can't believe what Chad has just told him",
                "Agnes walks in and gives Kevin a snack",
                "Chad takes a second look at Kevin's bare foot and kisses his big toe"
            ],
            "content":"<div class=\"\"><div> <span>Agnes finishes up the kitchen dishes and walks out to the front porch to watch the boys play frisbee. She notices the pile of shoes and socks and looks out to see all the barefoot boys. One boy catches her eye, Kevin, who is one of Chad's friends. She looks down and sees his big, tan bare feet which she has seen before. <br>\r\nShe instituted the no shoe rule in her house so she could hopefully see some of her sons friends' bare feet. Kevin and Chad use to be close friends a few years ago, but now are just friends. He used to come over almost everyday, take off his shoes and socks at the door and walk in barefoot. She found out he loves being barefoot, but his mom doesn't allow him to wear flops. He would stay barefoot even outdoors while at Chad's house. <br>\r\n<br>\r\nAgnes remembers caring for Kevin's foot once when he stepped on a bee while in the backyard a while back. She was able to get the stinger out from the bottom of his foot. His foot had swollen a little, but she massaged it with some ice. Kevin's slender, tan toes, she remembers, were exquisite. Agnes washed his bare feet and toes afterwards and applied lotion to his toes and soles.<br>\r\nAs she was day-dreaming, she hears a painful cry and looks out to see Kevin sitting on the ground, holding his big toe. She runs out and comforts him. All of the other boys come racing over barefoot. Agnes is able to look around and see all of the boys' bare feet up close. All the different shapes, colors, sizes intrigues her. <br>\r\nKevin screams \"Ahh...my toe is broken! Help me up.\" Chad and Spencer help him up and assist him to the front porch. Agnes retrieves a first aid kit from the front closet and cleans Kevin's big toe. She says \"It's not broken, but I'll have to put a sock on your foot to protect it. I know you hate wearing socks, but it needs to heal without getting infected.\" Agnes finds his socks from the pile and puts them on his bare feet after cleaning the bottoms of both of his bare feet. She continues saying \"You boys can all go in the backyard for a snack, please wash off your feet in the outdoor shower before you come inside.\" All of the boys follow Drew except for Chad who helps Kevin walks inside. <br>\r\n<br>\r\nHe helps him to the recliner in the living room and reclines the chair back. He places a pillow underneath Kevin's injured foot. <br>\r\nKevin says \"Thanks Chad, that feels better. Could you, uh take my other sock off my other foot? You know I hate wearing socks.\"<br>\r\nChad looks down at Kevin's reclining stocking feet and sighs. He takes hold of the toe of the sock on Kevin's uninjured foot and tugs it off. Kevin wiggles his bare toes saying \"Thanks friend! I could sure use a foot massage like the one Pete gave me last week.\"<br>\r\nChad pipes in saying \"No way dude, I'm not massaging your bare foot! I remember last year when we came home a little drunk from that party and you asked me to stay the night. You fell into your bed and passed out while I pulled your shoes off. Your feet reeked as I peeled your socks off. I found a bottle of foot spray and sprayed the heck out of both your bare feet. You then slurred your words asking for a foot massage and began to laugh hysterically. I hesitantly began to massage your bare soles and toes with my fingers. You stopped laughing and began to moan. I did something that I regret even to this day.\" Kevin replies \"Did what?\" <br>\r\nChad continues \"I sucked on your big toes which caused you to stop moaning.\"<br>\r\n </span></div></div>",
            "created":1542300660,
            "id":2578222,
            "title":"Kevin stubs his big toe on a rock and Agnes car..."
        },
        "14123212312133121221":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Pete pays a home visit to an injured Kevin at Chad's house",
                "Chad invites Kevin to stay the night",
                "Drew, Jace and Spencer visit the mall's massage place"
            ],
            "content":"<div class=\"\"><div> <span>\"You sucked on my big toes?\" Kevin replies to Chad. Kevin continues by saying \"What kind of friend sucks on their friend's big toes? Chad, I can't believe your telling me this now. Do you have a foot fetish or something?\"<br>\r\nChad pulls up a chair next to where Kevin is reclined and begins to softly rub the top of Kevin's bare foot. He softly says \"Kevin, I must confess. We've been friends for a while, but lately our friendship has grown apart. Ever since that night when I sucked on your toes, my friendship with you went astray. I thought my foot fetish addiction was gone, but as I pleasured your toes, it snuck back in my mind. I thought staying away for a while would help too, but I saw you take off your shoes and socks a while ago and then stub your big toe, it all came back.\"<br>\r\nKevin replies \"So you actually have a foot fetish for my bare feet?\" <br>\r\nChad nods his head saying \"Do you remember when we both went hiking a couple years ago and we sat down and relaxed by that stream? We took our shoes and socks off and stuck our bare feet into the water. Your wet bare feet in the water with the sunlight hitting it was a magnificent sight in my eyes. Do you remember being my partner in health class and we were practicing first aid? (Kevin thinks and then nods) I played the first responder and you were the victim. We had to practice wrapping each other's ankle, hand, foot and arm. I tried wrapping your ankle with your shoe on, but the teacher told me to take your shoe and sock off first. There I was with your foot resting on my lap. I pulled your shoe off and peeled off your sock exposing your bare foot. I remember brushing off the sock lint from the bottom of your foot causing you to laugh.\"<br>\r\nKevin wiggles his toes as Chad's hand brushes against them. Chad continues saying \"I wrapped your ankle leaving your toes exposed as instructed so I could test for circulation. The teacher checked us off, but instead of putting your shoe and sock back on, you stayed barefoot. We switched positions and you wrapped my foot.\"<br>\r\nKevin replies \"Didn't I take off your shoe and sock too? You have good looking bare feet Chad, but I don't have a foot fetish.\"<br>\r\n<br>\r\nChad's hand begins to play with Kevin's toes as he says \"You did take my shoe and sock off and brushed off the sock lint from the bottom of my foot. I didn't react since my feet aren't ticklish. Can we keep my fetish our secret? I promise not to admire your bare feet in public.\" Kevin replies \"Well, I don't know. I don't want to turn this into a sexual thing. I love foot massages, but don't jack off or explode in my presence...understand! (Chad nods and smiles) Now how about a nice foot massage?\"<br>\r\nChad grabs some lotion from a nearby drawer and puts it on Kevin's bare foot and works it in. Kevin splays his toes as his foot is massaged. Kevin says \"Oh, that feels so good (leans back). Please work on my toes a little more (splays his toes).\"<br>\r\nChad replies \"With pleasure, uh, I mean, yes sir!\" Chad takes hold of Kevin's toes and inserts his fingers in between each toe and applies pressure causing Kevin to moan and wince.<br>\r\n<br>\r\nAgnes walks into the living room, bringing a snack to Kevin. She is taken back as she sees her son Chad massaging his friend's bare foot. She says \"That's what I like to see, true friendship! I thought you two were best friends...what happened?\" Chad and Kevin look at each other, then Chad says \"We had a talk and made amends (winks at Kevin).\" Kevin smiles and wiggles his toes.</span></div></div>",
            "created":1542320100,
            "id":2578326,
            "title":"Kevin can't believe what Chad has just told..."
        },
        "141232123121331212213":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Jace explodes almost immediately",
                "Spencer takes his time getting aroused, but eventually explodes too",
                "Both boys rave about the massage to their friends."
            ],
            "content":"<div class=\"\"><div> <span>Drew tells Jace and Spencer all about his wonderful massage that he was given, not once, but twice. Drew says \"...and he gives wonderful foot massages too. Pete doesn't miss a spot.\"<br>\r\nSpencer replies \"Do you have to get naked?\" Jace perks up saying \"Yeh, of course you do. That's the only way to have a good massage...no clothes...and bare feet!\" <br>\r\nDrew laughs saying \"Well I was hesitant at first, but Pete did everything for me when it was time. He's great!\" Jace replies \"Mind if I go first? My feet are killing me after this long walk.\"<br>\r\nAll of them arrive at the mall and walk inside. They notice a big line in front of the massage store, so Drew tells them to wait while he tries to find Pete.<br>\r\nA while later, Drew motions for Spencer and Jace to follow him thru another side entrance. Pete is standing in the back hallway smoking a cigar. He says \"Hi boys...just taking a break. Drew told me he brought you two in for one of my foot massages.\" Jace exclaims \"He sure did and I would like to go first!\" Pete replies \"Well actually, you and your friend Spencer can go in together. I have two tables. I can actually work on your feet at the same time if you wish?\"<br>\r\nSpencer smiles and walks up the hallway with Jace to Pete's room. Drew walks into the front lobby to wait for his friends. <br>\r\n<br>\r\nJace and Spencer enter the room followed by Pete. They sit at the foot of each table and lean back. Spencer asks \"Hey Pete, I don't have to get naked for this do I? Pete laughs and replies \"Well not now, the foot massage is only the first part. I'll only take your shoes and socks off now and the rest of your clothes later. Did you guys take a shower?\" Spencer and Jace nod with Jace saying \"My body and feet are clean.\" Jace kicks off his shoes and wiggles his socked toes.<br>\r\nPete looks down at Jace's socks, grabs hold of them and pulls them off Jace's feet saying \"Oh very nice, you do take good care of them.\" He lightly massages Jace's bare toes and soles. <br>\r\nPete reaches over and unties Spencer's shoes and pulls them off along with both socks. He admires them for a moment, then says \"My your feet are fine too! Unique and fine (lightly massages his bare toes and soles). Your webbed toes are cute.\" Spencer blushes.<br>\r\nPete is able to work on both pairs of bare feet at the same time. Both Spencer and Jace relax, laying back on the tables. A while later, Pete takes off Spencer's shirt, shorts and underwear leaving him stark naked and exposed. His manhood his flaccid, but becomes a little erect as Pete massages his chest. Spencer moans and splays his toes.<br>\r\nHe stops and undresses Jace completely and begins to massage the front side of his body.<br>\r\n<br>\r\n</span></div></div>",
            "created":1542382380,
            "id":2578598,
            "title":"Drew, Jace and Spencer visit the mall's mas..."
        },
        "1412321231213312122131":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Spencer walks out barefoot with Jace in tow to the front lobby",
                "Jace takes his shoes and socks off and walks barefoot with Spencer ",
                "Pete is given a big tip by Spencer and Jace before the boys leave"
            ],
            "content":"<div class=\"\"><div> <span>Pete spreads the warm oil all over Jace's front side and begins to rub it in. Jace's penis begins to rise becoming erect in a matter of seconds. It doesn't take long at all for Jace's manhood to pulsate as Pete massages his bare toes and soles. He moans, splays his toes and explodes all over his chest. <br>\r\nSpencer looks over and can't believe seeing Jace completely naked and his erection. Pete cleans him up and covers his waist with a towel. He comes back over to Spencer and sees him tearing up. Pete asks \"What's wrong Spencer?\" <br>\r\nSpencer replies in a tearful voice \"My dick is so small compared to Jace's, what's wrong with me?\" Pete asks \"You've never had a wet dream or become erect and explode?\" Spencer shakes his head and says \"Not really. When you massaged my feet just now, my penis got a little excited, but shrank again.\"<br>\r\nPete whispers in his ear saying \"I'm not supposed to do anything like this, but you seem like a young man who want tell anyone. I can give you an experience you will never forget. This is just between us, okay?\" Spencer looks up and nods.<br>\r\nPete locks the door and turns the light down low. He lightly wands his hands all over Spencer's front side from his toes to his chest. Pete wipes the excess oil from Spencer's bare toes and soles and then spreads more oil all over his front side including Spencer's penis. He takes Spencer's two big toes and engulfs them into his mouth and begins to slowly suck on them. At the same time, he reaches up and massages Spencer's legs and thighs. Spencer begins to moan and his penis begins to grow larger and larger. Pete takes the big toes out of his mouth and begins to kiss and nibble on Spencer's other toes and soles. He lifts each leg and places it over his shoulders, then wraps his hand around Spencer's erection and slowly begins to stroke it. Spencer's toes splay in delight as he moans louder with every stroke.<br>\r\nPete then inserts Spencer's penis into his mouth and sucks on it. A split moment later, Spencer lets out a load groan and explodes into Pete's mouth. His toes splay and legs flay as Pete doesn't miss a beat. Spencer collapses and faints as Pete lets his legs down. He kisses Spencer's big toes once again and cleans him up.<br>\r\nA few moments later, both boys are still out, but are dressed. Pete finishes putting on Jace's right sock and shoe, but kisses his big toe beforehand. Spencer wakes up as Pete finishes putting on socks and begins to put on his shoes.<br>\r\nSpencer says \"Pete that was absolutely wonderful. Don't bother with putting on my shoes. My feet feel so free. Take my socks off so I can stay barefooted.\" Pete pulls Spencer's socks back off his feet and Spencer wiggles his toes and smiles.<br>\r\n</span></div></div>",
            "created":1542635400,
            "id":2579577,
            "title":"Jace explodes almost immediately"
        },
        "14123212312133121221312":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Jace slips and falls onto the wet floor and sprains his ankle",
                "Spencer dries his feet and puts on his shoes and socks",
                "Drew helps Jace up and looks at his ankle after taking off Jace's sock"
            ],
            "content":"<div class=\"\"><div> <span>Spencer gets off the table and thanks Pete. Jace looks down at Spencer's bare feet and immediately kicks off his shoes and peels off his socks, wiggling his freed toes and says \"I'm staying barefoot as long as you are. Pete, my feet feel great...thanks.\" Both boys walk barefoot down the hall to the front lobby where Drew is waiting for them. Drew looks down at his barefooted friend and smiles saying <br>\r\n\"I told you Pete would be good and that you'd come back barefooted...everyone always does.\" Pete comes out a moment later and both Spencer and Jace give him a well deserved tip. Pete gives Drew a referral bonus card entitling him to a sixty-minute massage of his choice complete with a table shower. Drew thanks Pete and smiles saying \"I'll save this for the next rainy day.\"<br>\r\nDrew, Jace and Spencer walk thru the mall, Jace and Spencer carrying their shoes and socks in hand. <br>\r\nA security guard stops them and says \"Boys, no bare feet allowed in here. Gotta put those shoes on your feet to protect them!\" <br>\r\nJace and Spencer grumble as they sit down on a bench. \"My feet are all dirty from walking on this filthy floor\" says Spencer. \"Where's the bathroom so I can clean them before putting my socks and shoes back on?\" <br>\r\nDrew looks around and says \"Follow me.\" Jace and Spencer follow Drew to the bathroom where they clean their bare feet from the dirt on their soles and toes.<br>\r\nSpencer lifts his right bare foot into the sink and scrubs the dirt off his sole with soap. Jace does the same.<br>\r\n<br>\r\n</span></div></div>",
            "created":1542672600,
            "id":2579764,
            "title":"Jace takes his shoes and socks off and walks ba..."
        },
        "141232123121331212213121":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Jace can't help but notice Joey driving barefoot",
                "Drew offers to buy everyone some ice cream on the way home",
                "Joey drops Drew and Jace off at Jace's house before going home"
            ],
            "content":"<div class=\"\"><div> <span>As Spencer finishes rinsing off his bare feet and drying them off. Jace finishes washing his other bare foot. As he lifts his foot out of the sink, he looses his balance and slips on the floor and falls down. He winces out in pain and grabs his right ankle saying \"Awww...I think I broke it. Awww...(rubs his ankle), my mom's going to kill me.\"<br>\r\nDrew comes over and helps him to a chair and looks at his ankle saying \"It is swollen, but I don't think it's broken. Spencer, get your shoes and socks on and go and find some help.\"<br>\r\nSpencer quickly puts on his socks and shoes and runs out of the bathroom. Drew rubs his friend's ankle as Jace begins to tear up.<br>\r\nDrew says \"I've messed up my ankle before. Pete did something to make it feel better, but don't say anything to anybody okay?\" <br>\r\nJace sniffs and nods saying \"What are you going to do?\" Drew lifts up Jace's bare foot and carefully begins to nibble on Jace's toes. He goes further and sticks Jace's big toe into his mouth and sucks on it, while massaging his bare sole. <br>\r\nJace sits back and soon forgets about the pain, slightly moaning. <br>\r\nA moment later, they hear people coming toward the bathroom and Drew quickly lets go of Jace's bare foot. Two paramedics come in with Spencer and tend to Jace's ankle. They wrap it up and place Jace in a gurney. Drew grabs Jace's shoes and socks and walks out with Spencer in tow.<br>\r\n<br>\r\nA while later, the boys are seen coming out of the mall's security office. Jace is on crutches with an ace bandage around his ankle with his bare toes exposed. He is wearing his other shoe and sock on his other foot. Drew is holding on to Jace's one shoe and sock. Spencer calls his brother to pick them up using his cell phone. They all walk outside to wait.<br>\r\nAfter waiting a while, a car comes up to the curb and honks it's horn. The boys look up to see an older version of Spencer get out of the car and walk toward them. He is wearing a t-shirt, black shorts and flops on his golden-tan, hairless bare feet with slender tan, pedicured toes. Spencer says \"Thanks Joey for picking us up!\" Joey replies \"Not a problem bro. I just got out of the shower and threw some clothes on. My feet love wearing flops for once.\" <br>\r\nDrew and Jace look down at Joey's bare feet and smile at each other. Jace is helped into the car in the front seat. Drew and Spencer get into the back seat as Joey gets into the driver's seat. He kicks off his flops and drives barefoot back to his house.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1542812100,
            "id":2580247,
            "title":"Jace slips and falls onto the wet floor and spr..."
        },
        "1412321231213312122131213":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Drew gives Billy's big toes a nice, slow sucking",
                "Billy tantalizes Drew's bare feet and then his manhood",
                "Drew and Billy tantalize each other all over each other"
            ],
            "content":"<div class=\"\"><div> <span>Joey does Jace a favor and drops him and Drew off at Jace's house because of his ankle. Drew helps Jace out of the car and up to the front porch. They wave to Joey and Spencer as they drive off.<br>\r\nJust then, a young man walks up from the sidewalk and intercepts Drew and Jace. He is sandy blonde haired youth with a boyish face wearing a t-shirt, blue jeans and high-top white sneakers. Jace says \"Hey Billy, what's up?\"  Billy replies \"Hey Jace, what happened to you? (fist-bumps Drew) Hi Drew, nice to see you again.\" Drew smiles saying \"Jace just twisted and sprained his ankle at the mall. He'll be okay.\"<br>\r\nBilly says \"Jace, do you need some help into the house?\" Jace replies \"Uh, sure, what did you come over for?\" Billy helps Drew carry Jace into the house says \"Well, I wanted to know if I could use your jacuzzi? All the long days on the set of General Hospital has had a toll on my back and feet. Your mom said I could come over as long as someone was home.\"<br>\r\nJace replies \"Well, I was going to soak in it myself, but the doctor said my ankle needs cold wraps not hot immersions. Didn't you bring a suit?\"<br>\r\nBilly laughs replying \"Suit, I never wear a suit except my birthday suit.\" Drew looks at Jace and then at Billy saying \"That's the best way to enjoy it! Mind if I join you?\" Billy looks at Drew replies \"Uh sure, there's enough room for two people.\" <br>\r\nJace says \"Well at least grab some towels before going out back. The nosy neighbors like to spy on me. I sometimes purposely run around the yard naked as a jaybird to give them a show (laughs).\" Jace sits down and rests his ankle on the arm rest of the sofa.<br>\r\nJace continues \"Hey Billy, can you do me one favor before you and Drew hit the water?\" Billy responds \"Yeah, what?\"<br>\r\nJace says \"Can you take off my shoe and sock from my other foot? I like going barefoot, but the guard at the mall told me I had to wear shoes.\" Billy replies \"Sure...(walks over to where Jace is laying and tugs off his shoe and peels off his sock from his foot). At least your foot doesn't smell...(tickles his bare sole).\" Jace jerks his foot and splays his toes.<br>\r\n<br>\r\nA moment later, Drew and Billy walk into the backyard thru the backdoor. Billy walks over and uncovers the jacuzzi as Drew turns it on. Drew quickly begins to strip off his clothes. He kicks off his shoes and socks as he pulls off his shirt and soon is stark naked. Billy is awestruck seeing Drew naked and stepping into the bubbling water. Billy takes his time and unties his sneakers and pulls them off. Drew says \"Hurry up Billy, the water feels great! Your bare feet and back will love it.\" Billy lifts off his t-shirt revealing his semi tan and hairless bare chest. He has six-pack abs which makes him physique. Drew can't help but look Billy's chest. <br>\r\nBilly stoops down and peels off his socks exposing his semi-tan, hairless bare feet with slender, pedicured toes. He pauses to stretch them out as he unbuckles his belt and pants. They are pulled off quickly along with his underwear leaving him stark-naked on the deck. Drew is awestruck at seeing Billy completely naked and seeing his bare beauties. As Billy walks up the steps, Drew can't help but notice Billy's semi-erect, six inch penis. Billy steps into the water and sits across from Drew. Drew feels Billy's bare feet by his hands and takes hold of his toes, lifts them up and tickles them. Billy's toes splay in delight.<br>\r\n<br>\r\n</span></div></div>",
            "created":1542836940,
            "id":2580368,
            "title":"Joey drops Drew and Jace off at Jace's hous..."
        },
        "14123212312133121221312131":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Jace's older brother opens the back door and peeks out",
                "Jace's older brother Zack walks outside wearing only a speedo",
                "Jace comes out to see his friends in the hot tub"
            ],
            "content":"<div class=\"\"><div> <span>Billy tries to pull his bare feet away, but Drew instead holds onto them tight. He slips Billy's right big toe into his mouth and begins to suck on it. Billy moans and uses his other barefoot to rub Drew's bare chest as he uses his hands to find Drew's left foot and begins to massage his toes and sole. Billy slips Drew's big toe into his own mouth, exciting Drew. <br>\r\nDrew says \"Billy, that feels so good and your bare toes taste so good! You really take good care of your feet!\"<br>\r\nBilly replies \"You do too Drew, your big toe is so smooth and tasty. I must confess I have a foot fetish.\" Billy takes Drew's other bare foot and sticks the slender big toe into his mouth. Drew groans as his erection breaks the surface of the water. Billy is shocked, but at the same time intrigued. He takes Drew's toe out of his mouth and goes down on Drew's erected penis. <br>\r\nA moment later, he lifts Drew's legs out of the water and onto his shoulders and thrusts his erected member into Drew and pumps away. Drew splays his toes as Billy thrusts harder and nibbles on Drew's bare soles and toes.<br>\r\n<br>\r\nSuddenly, they both hear a noise. Billy quickly sets Drew back down into the water and moves to the opposite side.</span></div></div>",
            "created":1542980760,
            "id":2580916,
            "title":"Drew gives Billy's big toes a nice, slow su..."
        },
        "141232123121331212213121312":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Zack awakes later laying on the sofa with a towel around his waist",
                "Billy, Drew and Jace are watching TV; Billy and Drew are still barefoot",
                "Zack pleads with Billy and Drew not to mention this incident to his girlfriend"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey guys, what's going on?\" Zack says as he walks toward the jacuzzi. \"Mind if I join you?\" Zack asks Billy. <br>\r\nBilly replies \"Sure Zack, just to let you know we're naked in here, so you can lose the speedos.\" Zack smiles and immediately pulls off his speedos exposing his semi-erect manhood. Drew and Billy grin as Zack steps into the water sitting next to Billy. He sighs and lifts his bare feet above the surface of the water and wiggles his toes.<br>\r\nDrew is memorized by the sight of Zack's slender, pedicured toes peeking above the water. He slowly grabs hold of Zack's right bare foot and begins to massage it. He comes closer and begins to nibble on Zack's toes and licking his bare soles. Zack closes his eyes and moans. Billy moves close to Drew and takes hold of Zack's left bare foot and tantalizes it like Drew. <br>\r\nZack says \"Oh my, that feels so good (splays toes). My girl likes to do the same thing to my bare toes. She loves taking my shoes and socks off and bathing my toes with her tongue, but she sometimes does it at the most inappropriate times.\" <br>\r\nBilly takes his tantalizing a bit further by engulfing Zack's big toe into his mouth. Zack reacts with a wince and louder moan.<br>\r\nDrew replies \"Your toes do taste wonderful Zack (kisses his big toe). What do you mean inappropriate times?\" Drew engulfs Zack's other big toe into his mouth. <br>\r\nZack flinches and says \"Ohhhh...(splays toes making Drew and Billy smile). She once took my shoes and socks off while we were on a roller coaster ride. She kissed my toes until we got to the top. I ended up losing both socks and one shoe from all the whips and turns. The ride attendants gave me a weird look as I got off and walked barefoot to the exit.\" Zack moans a bit more than continues \"She even took my dress shoes and socks off during church once. We were sitting in the second level and she thought no one would notice. She got them off and began to play with my bare toes when the pastor called on me to come down to the front. I didn't have time to put my shoes and socks back on, so I walked nervously barefoot to the front. Everyone laughed at me being barefoot. He asked me why I was barefoot and I cracked a joke saying back to him that people in the Bible went barefoot a lot. Let's just say I didn't get a huge reaction. My girl smiled and held up my socks.\" Billy takes Zack's big toe out of his mouth and says \"I played a Roman guard one time in a play. They ran out of sandals, so I went barefoot. I loved it until I stepped on a rock and got a big cut (lifts right foot and shows the scar on his sole). My foot bled like anything (laughs).\"<br>\r\nZack replies \"How many stitches did you end up getting?\" Billy replies \"About fifty.\" Zack grabs hold of Billy's barefoot and looks closely at his sole.<br>\r\nBilly tries to stick his big toe into Zack's mouth, but Zack pulls back saying \"Hey, I'm not into that. I like getting my feet done, but don't do it in return. I'm straight and got a girl.\" Billy replies \"Uh, is that why you have a boner from your toes being sucked on? Come on Zack, my toe will taste wonderful in your mouth (moves his bare foot closer to Zack's face and wiggles his toes).\"<br>\r\nDrew takes Zack's other toe out of his mouth and begins to nibble on all of Zack's toes. Zack splays his toes and moans. He finally gives up and engulfs Billy's big toe into his mouth and sucks on it. Billy sighs and goes down on Zack's erect member underwater.<br>\r\nZack begins to thrust, moan and suck harder and louder and soon erupts and collapses. Billy resurfaces with a smile on his face.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1543327920,
            "id":2582630,
            "title":"Jace's older brother Zack walks outside wea..."
        },
        "1412321231213312122131213123":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Lucas finally breaks free and runs out the door in his underwear",
                "Billy, Drew and Zack chase after him"
            ],
            "content":"<div class=\"\"><div> <span>Later on, all three boys are inside watching TV dressed back in their regular clothes including shoes and socks. Zack asks Billy and Drew to keep their encounter in the jacuzzi a secret. Billy and Drew look at each other a smile.<br>\r\nJust then, Jace's younger brother Lucas comes into the room reading a script. He is wearing a red t-shirt, shorts with sports shoes and white socks.<br>\r\n\"Hey guys, guess what, I got a part in a play and need to study my lines\" he says to them.<br>\r\nZack replies \"What's the play?\". Lucas says \"Tom Sawyer! I play one of Tom's friends\". Drew pipes in \"That's cool Lucas, you all get to go barefoot on stage right?\"<br>\r\nBilly adds \"Yeah, you better toughen up those dainty feet of yours soon!\". Lucas replies \"What are you talking about? My feet aren't dainty!\"<br>\r\nZack laughs and grabs hold of Lucas' right arm and pulls him over on his lap. Catching Lucas off guard, Zack is able to pin his younger brother with ease and begins to tickle his bare legs. Lucas begins to laugh hysterically dropping his script on the floor.<br>\r\nZack says \"He is really ticklish, especially his bare feet! (grabs hold of Lucas' shoes and pulls them off quickly along with both socks) Gitchee, Gitchee, goo! (tickles the bottom of both bare soles of Lucas' bare feet)\". <br>\r\nLucas squirms and splays his tan, slender and pedicured toes. Zack takes hold of both of Lucas' big toes saying \"He hates this too! (sticking both toes into his mouth)\".<br>\r\nBilly and Drew grow interested in Lucas' bare beauties and begin to each tickle one barefoot. Lucas squirms even more and thrashes to get loose. <br>\r\nSoon Lucas's shirt and shorts are off, leaving him in his speedo underwear. Billy tickles his tan, hairless bare chest while Drew and Zack continue the tickling on Lucas' bare beauties.<br>\r\n</span></div></div>",
            "created":1544454540,
            "id":2587838,
            "title":"Zack pleads with Billy and Drew not to mention ..."
        },
        "14123212312133121221312131231":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Lucas takes a shower and washes his bare feet",
                "Lucas, after taking a shower, accidentally bares all in front of the whole group"
            ],
            "content":"<div class=\"\"><div> <span>Lucas distracts his brother and friends and is able to break free and run out the back door barefoot. One thing Lucas has is that he's fast on his feet...his bare feet especially.<br>\r\nZack tries to grab Lucas' leg, but misses and tumbles to the ground. He says to Drew and Billy \"Get him you two, he's fast on his feet, so you better run fast!\" Drew quickly takes off his own shoes and socks and runs out of the house barefoot saying \"Billy, cut him off by the park...and take your shoes and socks off! You'll run faster.\"<br>\r\nBilly kicks off his shoes and socks and runs barefoot out the front door. Zack stays at the house.<br>\r\nLucas is seen running thru the country streets, not worrying about being clad only in his speedos. His thin, tan body and fast bare feet deflect the wind resistance. He quickly climbs a tree and hides behind some thick branches. He sees Drew run right past him, then climbs higher to get a view of the park. Lucas spots Billy running barefoot across the grass to the sandlot meeting up with Drew.<br>\r\nDrew says \"Billy, didn't you see him?\" Billy shakes his head replying \"No, I thought you might have seen him.\" They both look around the park and playground. <br>\r\nMeanwhile, Lucas climbs down from the tree and is startled by a few of his fellow classmates. There are about five in all, two boys and three girls. <br>\r\nOne girl named Meg says to him \"Lucas, my oh my, are you practicing for the play already? You really have to tough'in up those bare feet of yours (looks down at Lucas' bare feet).\"<br>\r\nOne of the boys named Ian says to Lucas \"Yeah, you've got pansy feet. Here, look at my tough feet (quickly takes off his shoes and socks). These babies are going to make people gag (wiggles his toes). Ian's bare feet are hairy and are only lightly tan. His toes aren't pedicured and need serious attention.<br>\r\nAnother girl laughs as she looks at Ian't ugly bare feet saying \"Eewwwh, Ian, your feet are disgusting. You need a pediucre!\" Ian replies \"Pedicures are for girls, not for boys!\"<br>\r\nThe other boy standing there, Brennan replies \"Hey Ian, I get pedicures all the time. My mom owns a beauty salon. She says that pedicures are for both boys and girls. Look at mine...\" Brennan sits down on the grass and pulls off his shoes, then peels off each sock revealing two tan, unblemished and golden bare feet with slender, pedicured bare toes. He wiggles his toes as he stands up and brushes them across the grass blades. The two other girls, Rachel and Suzy sigh and gaze upon Brennan's bare beauties.<br>\r\nJust then, Lucas spots Billy and Drew running toward the group. He hides behind a bush with Brennan standing barefoot in front of it. He glances down at Brennan's bare feet and reaches out and tickles his bare toes. Brennan kicks his hands away using his bare feet saying \"Lucas, stop it or I'll tell them where you are!\" Lucas stops.<br>\r\nThe others tell Billy and Drew that Lucas ran by them a while ago and points in the direction. As they run off, Meg invites everyone into her house for some lemonade.<br>\r\nLucas thanks them saying \"That was close, thanks for throwing them off my trail.\"<br>\r\nThey all walk inside Meg's house with Ian and Brennan leaving their shoes and socks at the front door and walking in barefoot.<br>\r\n</span></div></div>",
            "created":1544541600,
            "id":2588137,
            "title":"Lucas finally breaks free and runs out the door..."
        },
        "141232123121331212213121312312":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Lucas wakes up later wearing a borrowed bathing suit.",
                "Lucas wakes up and sees Brennan getting his bare feet massaged by Meg."
            ],
            "content":"<div class=\"\"><div> <span>The whole gang are sitting out on the back screen porch drinking lemonade. Lucas comes out of the bathroom after taking a shower with a towel wrapped around his waist. As he steps out and down onto the porch, his towel gets snagged on the door hook and gets pulled away from his waist. <br>\r\nLucas stands there completely naked with his semi-erect manhood fully exposed. He tries covering it up, but he is well-endowed and his penis pokes through. Instead of covering himself up, he just sits down naked.<br>\r\nThe girls perk up and stare at Lucas' package while Brennan and Ian try not to stare. Lucas says \"Being naked really doesn't bother me. Did I ever tell you the story of me being abducted by a UFO?\"<br>\r\nBrennan wiggles his propped toes and replies \"Yeah right Lucas. You got abducted?\" Lucas nods his head and wiggles his toes resting on the ottoman and says \"I went camping one weekend with my cousins about a year ago and that's when it happened. I got lost from the group and thought that they were playing games with me. I walked over a ridge and startled what I thought were dwarfs. Well, they in fact were not dwarfs, but aliens. I tried to turn and run, but was stunned and carried to a cave nearby.\"<br>\r\nRachel and Suzy sigh and Ian rolls his eyes.<br>\r\nLucas continues saying \"I was placed on a makeshift table and secured by invisible straps so I couldn't move anything. These little aliens had weird shaped heads, long slimy fingers and scaly bodies. They all began to touch me all over my body and then began to pull off all of my clothing. After two of them pulled my shoes and socks off, they began to play with my bare feet and toes with their bony fingers which really tickled.\" Lucas splays his toes.<br>\r\nMeg pipes in \"Were your feet clean like they are now?\" Lucas replies \"They were a bit sweaty from hiking, but it didn't seem to bother them (wiggles his toes again). The other four aliens tore off my shirt, shorts and underwear leaving me like I am now...naked. I couldn't move a muscle as they touched me all over including my penis. One alien actually held it with their fingers and began to stroke it. The two aliens playing with my feet began to lick my bare soles with their slimy green tongues. One of them actually sucked on my big toes...it felt weird and sticky. I began to moan unable to control my now erect penis and shot a big load over my chest and the alien's fingers. My toes splayed and I collapsed into unconsciousness. I woke up a while later under a tree, naked and cold. My clothes and shoes were no where to be found, so I got up and walked naked thru the woods. I came across a young couple asleep in some lounge chairs with a fire pit nearby. I snuck up and grabbed a towel to cover my waist and some bread to eat. The guy seemed to have the same foot size as I do, so after eating, I carefully took off both of his boots, then peeled off his socks. His bare feet looked good, but his toes were long and hairy...yuk. I hate seeing hairy toes, sorry Ian.\" Ian shrugs his shoulders.<br>\r\nBrennan says \"I wax my feet and toes every week for water polo (wiggles his tan, hairless toes).\" Lucas continues his story saying \" I put the guy's socks and boots on my feet and was able to swipe a pair of swim trunks hanging on a clothes line. I began my quest to find my cousins and after an hour was able to locate them. My uncle took me to a nearby hospital to get checked out and also to the ranger station to tell my story.\"<br>\r\nIan says \"I thing its a bunch of bull if you asked me. Those aliens must have looked at your naked scrawny body and tossed you out after you collapsed.\" Logan stands up and says \"I'm telling you the truth Ian and I don't have a scrawny body (flexes), look at my muscles (holds up arms and twists showing his abs).\" <br>\r\nMeg, Rachel and Suzy giggle as Suzy whispers \"I like that one muscle of his (giggles).\" Ian tears off his shirts and shorts and begins to flex his own muscles along side Lucas. Ian is not as tone or tan as Lucas and his bare feet are not anything like Lucas' bare feet. Lucas and Ian begin to wrestle on the floor which cause the girls to go wild. It doesn't take long for Ian to pin Lucas to the ground. All three girls jump up and help Ian out by holding his thrashing legs and body around. Meg brushes her hand across Lucas' bare chest as Rachel and Suzy take hold of each of his bare feet. Ian gags Lucas by stuffing part of his shirt in his mouth. Brennan takes out his iPhone and begins to take pictures and video. Suzy takes Lucas' right bare foot and begins to kiss and nibble on his bare sole and toes. Rachel takes hold of Lucas' left foot and sticks his big toe into her mouth which cause him to go wild.<br>\r\nIan gets off Lucas and sees his erect penis sticking up. He laughs begins to poke at it with his bare foot. He changes his position with Meg as she smiles at Lucas. His words are mumbled as Meg begins to suck on his erection. A moment later, Lucas' toes splay and he erupts inside Meg's mouth. He collapses and the girls and Ian let go of him. Meg on the other hand, continues to pleasure an unconscious Lucas. Suzy begins to massage Lucas' bare feet and toes.<br>\r\n<br>\r\n</span></div></div>",
            "created":1544804280,
            "id":2589045,
            "title":"Lucas, after taking a shower, accidentally bare..."
        },
        "1412321231213312122131213123122":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Ian rubs Jace's bare foot to make it feel better",
                "Lucas leaves and sneaks back to his house"
            ],
            "content":"<div class=\"\"><div> <span>Lucas sits up after laying on the couch unconscious for a while. He looks around the room and notices only Meg and Brennan sitting across from him on a 2-person couch. Brennan has his bare feet up on Meg's lap getting massaged by Meg's soft hands.<br>\r\nBrennan whispers \"Oh Meg that feels so good. My feet and toes are tingling (splays toes).\" Meg replies \"Brennan, your bare feet are so soft and toes are so, so...(takes hold of his right big toe and nibbles on it before sucking on it). <br>\r\nBrennan leans back and moans wiggling his other toes. Lucas looks down at his toes which are wrinkled from all the attention they received. He looks under the covers and sees that he is wearing his speedos and borrowed shorts. He says to Brennan \"What happened to me? The last thing I remember is wrestling with Ian and getting tickled.\"<br>\r\nMeg smiles and replies \"So you don't remember what I did to you?\" Lucas shrugs his shoulders and says \"No, what?\" <br>\r\nMeg chuckles and says \"Let's just say I left a smile on your face!\" Brennan pipes in saying \"Yeah, I got it all on my iPhone! She sure did a number on your...\" Meg interrupts saying \"uh your bare feet and toes, especially your big toes!.\" She glares at Brennan and squeezes his big toes. Brennan winces and splays his toes.<br>\r\n<br>\r\nA while later, Jace and Ian return with some In n Out Burgers for an early dinner. Lucas borrows a shirt from Jace to wear along with some flops for his bare feet. Brennan has put his shoes and socks back on and is sitting with Meg at the table. Rachel and Suzy bring in some plates and drinks from the kitchen. Jace is feeling better, but still rests his hurt bare foot on a pillow.</span></div></div>",
            "created":1544928180,
            "id":2589584,
            "title":"Lucas wakes up and sees Brennan getting his bar..."
        }
    },
    "info":{
        "author_id":"futureboy",
        "author_name":"Futureboy",
        "brief_description":"Teenage Boys & Girls need massages too. A new place has opened up in the local mall.",
        "created":1541792640,
        "description":"<td align=\"left\" class=\"norm\">Only rules are:<br>\r\n* No death<br>\r\n* No blood</td>",
        "id":2174250,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1544928180,
        "modified":1544928180,
        "pretty_title":"Massage My Way"
    }
}