{
    "chapters":{
        "1":{
            "author_id":"enderginger",
            "author_name":"John Smith",
            "choices":[
                "A giantess?",
                "A tiny visitor of the park?",
                "An employee?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do u want to play as...</span></div></span></div>",
            "created":1530468240,
            "id":2513799,
            "title":"First off..."
        },
        "11":{
            "author_id":"enderginger",
            "author_name":"John Smith",
            "choices":[
                "Liz",
                "Skylar",
                "Hannah",
                "Sarah",
                "Lindsey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which giantess?</span></div></span></div>",
            "created":1530468300,
            "id":2513800,
            "title":"A giantess?"
        },
        "111":{
            "author_id":"enderginger",
            "author_name":"John Smith",
            "choices":[
                "Take one tiny to play with privately",
                "Take a handful of tinies to play with privately",
                "Play with all the tinies right here"
            ],
            "content":"<div class=\"\"><div> <span>You walked around in your enclosure as you waited for the first people to come to the park to come and see you. You were the main event of the park! You’re the prettiest, biggest, and curviest of all the giantesses. As civilians began to stare into you enclosure from all sides you knew it was time to escape. You could’ve easily escaped this cage all along but you and the other giantesses waited until there were people to play with. As it got to the busiest time of day, when there were over 500 people watching you, you slammed your fist into the glass dome enclosing you, breaking it instantly. Many tried to flee but one of the other giantesses had pressed the button to lock the whole park down, and then destroyed it, trappping all of the people. You stood up to your full height, towering over all the other giantesses and civilians. To you, the people were less than an eight of an inch tall. Your big toe towered over all of them. It alone was over 500 times their size! The next biggest giantess barely came up to your waist. You decided that first you should___________</span></div></div>",
            "created":1530468960,
            "id":2513803,
            "title":"Liz"
        },
        "1111":{
            "author_id":"enderginger",
            "author_name":"John Smith",
            "choices":[
                "Brought him to my mouth",
                "Shove him into my boob",
                "Rub him along my ass"
            ],
            "content":"<div class=\"\"><div> <span>(Gonna start writing in Liz’s perspective)<br>\r\nI squatted down to get a better look at the tiny people. I then grabbed one tiny man between my pointer finger and thumb and walked back into my own private giantess den where me and the tiny could be alone. I closed the door behind me and sat down. I allowed the tiny man to fall from my fingers and tumble down into the middle of my cupped palm. I held him up to my eye as I listened to his pleas, “Please don’t hurt me! I’ll do anything! Please!” I smiled at the tiny guy and licked my lips, and then____________</span></div></div>",
            "created":1530469260,
            "id":2513807,
            "title":"Take one tiny to play with privately"
        },
        "11111":{
            "author_id":"enderginger",
            "author_name":"John Smith",
            "choices":[
                "Swallow him",
                "Spit him out"
            ],
            "content":"<div class=\"\"><div> <span>I brought my hand closer and closer to my mouth. To me, the man was only an eighth of an inch tall. That’s not even half an ant! I stopped a half inch from my mouth and whispered to the tiny man, “You should’ve never come here. Now you’re nothing more than my tiny toy to do with as I please. We can have more fun if you survive, but I’ve always wondered what you taste like.” I smirk as I see the tiny man try to run from my massive lips. “Awe! You’re trying to run away. How cute.” I bring my tongue down on my palm and start to drag it towards the guy. My tongue catches the man and he is instantly stuck to it as I slide it off my palm. I bring my tongue back into the cavern of my mouth. I close it and start to swish him around my mouth. My tongue pushes him against the roof of my mouth, and then pushes him up against my cheek. Then I </span></div></div>",
            "created":1538877120,
            "id":2560161,
            "title":"Brought him to my mouth"
        }
    },
    "info":{
        "author_id":"enderginger",
        "author_name":"John Smith",
        "brief_description":"A giantess park... gone wrong",
        "created":1530468120,
        "description":"<td align=\"left\" class=\"norm\">Lab workers have created 5 giantess exhibits in the brand new Giantess Park! What was once an entertainment idea is now horror for all in the park, as the giantess(es) break free. The giantesses are as follows:<br>\r\n1. Sarah:  Blonde hair, blue eyes, 13 years old, B cup bra, skinny, very playful and teasing. Wears leggings with a tight fitting tank top that shows her stomach. Very pretty, as they all are. 100 feet tall.(the smallest)<br>\r\n2. Hannah:  Brunette hair, hazel eyes, 16 years old, D cup bra, controlling personality, has a small waist with a big butt and has a near perfect figure. Also beautiful. Wears jean shorts that cut off at the top of her thigh and a sports bra. 500 feet tall.<br>\r\n3. Skylar:  Black hair, blue eyes, 25 years old. C cup bra, likes to mess around. Also has near perfect figure. Very pretty. Wears tight jeans and a t shirt. 1000 feet tall.<br>\r\n4. Lindsey:  Brown hair, brown eyes, 10 years old. B cup, loves messing with humans. Wears tights and a t shirt. Beautiful young face. 1500 feet tall.<br>\r\n5. Liz:  Blonde hair, blue eyes, 18 years old. GG cup bra, has the best ass you’ve ever seen. Wears a bikini. The most astounding and astonishing girl you’ve ever seen. 3000 feet tall.<br>\r\nHow was it a good idea to try to contain them? Please add to this story and help build it up! Have fun! Welcome to giantess park!</td>",
        "id":2162412,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1538877120,
        "modified":1538877120,
        "pretty_title":"Giantess Park"
    }
}