{
    "chapters":{
        "1":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "A Hotel ",
                "A Coffee Shop ",
                "Department store"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Kyle Blunt and you were bored. You were at work and finding it excessively dull as always when you suddenly gain the power to swap bodies with anyone simply by focussing on them while saying their name.<br>\r\n<br>\r\nThe first question is, where do you work?</span></div></div>",
            "created":1280379600,
            "id":926681,
            "title":"A tiring day about to change"
        },
        "11":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Suzanne Herman",
                "Marcie Granger",
                "Mildred Polaski",
                "Emma Edwin"
            ],
            "content":"<div class=\"\"><div> <span>You were standing by the front door of the hotel where you worked hoping for the day to end. Your job was to open the door for guests and help them unload their bags from their cars. Today was a slow day.<br>\r\n<br>\r\nLooking around you see Suzanne Herman helping some guests at the front desk. Over by the elevators you saw Marcie Granger on her way up to the pool deck for lifeguard duty. In the business centre you saw that Mildred Polaski was helping an elderly gentleman send a fax. Finally there was Emma Edwin, puffing on a cigarette outside during her break from serving tables in the hotel restaurant.<br>\r\n<br>\r\nAs Marcie's elevator arrived and she was whisked off to her job you rolled your eyes. Today was just such a dull day.<br>\r\n<br>\r\n\"Hell, even _______ is having a better day than me,\" you exclaim.</span></div></div>",
            "created":1280379600,
            "id":926682,
            "title":"Doorman at a hotel... not for long!"
        },
        "111":{
            "author_id":"loginplz",
            "author_name":"AnonCanon",
            "choices":[
                "Try to figure out what happend",
                "Go to your original body",
                "Leave the front desk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were suddenly \"transported\" to the front desk of the hotel.Suddenly you notice, huge balls? when you look down.\"Holy shit.\" You look over to the front door, seeing your body, shocked.</span></div></span></div>",
            "created":1483706820,
            "id":2259850,
            "title":"Suzanne Herman"
        },
        "112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "One of the younger, buff male guests",
                "A pair of little kids playing tag",
                "An elderly lady with a walker"
            ],
            "content":"<div class=\"\"><div> <span>Marcie had been stepping out of the elevator when you shouted out her name. Suddenly you found yourself standing on the hotel's rooftop plaza. You wonder how you got up there so fast when someone suddenly collides with you...<br>\r\n<br>\r\nThe person who just collided with you was...</span></div></div>",
            "created":1280379600,
            "id":926694,
            "title":"Marcie Granger"
        },
        "1121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "The guest asks again if you are alright",
                "Feel yourself up, right then and there",
                "do something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! Watch it!\" you exclaim, not noticing Marcie's voice coming from your lips.<br>\r\n<br>\r\nThe young man turns to face you and apologizes. As he stands there after asking if you were alright you felt strange. Your mind was still angry but your hormones were sending all the wrong signals. You felt a moistness in you crotch and thoroughly disgusted that you'd just jizzed over a boy, turn to run back into the elevator when you come face to face with the full length reflection of Marcie in the Elevator's chrome door. It was then that you realized why your hormones seemed to be sending the wrong messages as well as where exactly the moistness was. Your new reflection blushes.</span></div></div>",
            "created":1280379600,
            "id":926700,
            "title":"One of the younger, buff male guests"
        },
        "11213":{
            "author_id":"145spartan",
            "author_name":"The Dragon",
            "choices":[
                "Take off your clothes and continue exploring your new body.",
                "You think of Megan Fox and say her name."
            ],
            "content":"<div class=\"\"><div> <span>       You suddenly stop and hurry out of the enterence and rush to a bathroom and lock the door behind you. You walk over to the mirror and see that your that sexy lifeguard Marcie. Your eyes dart to the skin tight outfit that you are wearing and you realize that you have the perfect body. You start to get a dry mouth, and you place your hands on Marcie's enormous breats, and start to squeeze them.Your stop and then you...  </span></div></div>",
            "created":1374037200,
            "id":1629502,
            "title":"do something else"
        },
        "112131":{
            "author_id":"145spartan",
            "author_name":"The Dragon",
            "choices":[
                "Become Kate",
                "Become one of Kate's friends "
            ],
            "content":"<div class=\"\"><div> <span>You quickly strip out of you tight life guard uniform and your breasts fall into their natural position. You bring you hands up to them and feel them, squeezing them and pressing them together. Bring one of your new breasts up to your mouth you start to lick the nipple and feel a sensation as you feel you tongue wet the nipple and have the nipple start to harden as you keep doing it. After a couple minutes you come out of the bath room to see that Kate Thomson, a girl you have had a crush on since high school, is staying at the hotel and is her with some of her girlfriends. Seeing as this could be a great oppertunity for you, you decide to...</span></div></div>",
            "created":1375074000,
            "id":1636562,
            "title":"Take off your clothes and continue exploring yo..."
        },
        "1122":{
            "author_id":"bobross74",
            "author_name":"Brandon",
            "choices":[
                "Both boys ",
                "Both girls ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What gender</span></div></span></div>",
            "created":1581373080,
            "id":2785530,
            "title":"A pair of little kids playing tag"
        },
        "113":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "read mildred's stories",
                "go play flash games",
                "do something else"
            ],
            "content":"<div class=\"\"><div> <span>Just as you shouted out your frustration, the gentleman that Mildred had been helping was leaving the business centre. And so, just as you shouted out her name Mildred was unlocking the screen of her computer.<br>\r\n<br>\r\nSuddenly you found yourself standing behind a desk, looking at a computer screen. Peering out of the corners of your eyes you recognize where you are standing as the hotel's business centre. You then look down and see the usual Hotel uniform hugging your body. You look down again and bug out your eyes at what you'd failed to notice before, the bulge out at the front of the uniform. You reach behind your ears and feel the silky texture of shoulder length straight hair. You finally spot the glasses on your nose and realize just whose body you now found yourself in.<br>\r\n<br>\r\n\"Holy fuck I'm Mildred!\" you blurt out, mixed emotions at the change bouncing through your mind. Firstly you were uncomfortable to be in the body of a coworker, a girl coworker in particular but then realized one thing. \"I'm not the doorman anymore! Hell yeah!\" you shout out with a fiendish grin on your new face.<br>\r\n<br>\r\nYou look back down at the computer and decide that while normally finding yourself in the body of a girl would be terrifying, escaping from your dull job was worth it in the short run. You bring up the web browser and find it showing the webpage for an online writing site. In fact it looked like Mildred had been in the middle of editing a chapter of a story.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1280379600,
            "id":926689,
            "title":"Mildred Polaski"
        },
        "1133":{
            "author_id":"3oct1111",
            "author_name":"Wendy",
            "choices":[
                "Help another costomer",
                "Try to figure out how this happened",
                "Mildred in your body comes over"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you do?</span></div></span></div>",
            "created":1283144400,
            "id":947242,
            "title":"do something else"
        },
        "11333":{
            "choices":[
                "She looks amazed by it.",
                "She looks angry about it."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before you can do anything, Mildred in your body comes over to you. But what is the expression on her face?</span></div></span></div>",
            "created":1504099620,
            "id":2377128,
            "title":"Mildred in your body comes over"
        },
        "114":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "try to switch back",
                "stay as Emma for awhile,try later"
            ],
            "content":"<div class=\"\"><div> <span>You start coughing because you just inhaled smoke from a cigarette.You look at your hand and see it is now dark and feminine.You are dressed in a waitress uniform.You realize you have somehow switched bodies with Emma!You always found the tall, thin black woman with the British accent to be attractive. A guy who looks exactly like you is staring at you in shock inside the hotel.You wave him over.He approaches and takes the cigarette from you and takes a drag.\"What the bloody hell is going on?\"Emma asks.She scrunches her nose not liking the taste of the ciggie in your body.'I have no idea.\"you answer truthfully with an English accent.She hands the smoke back to you.\"I wondered what it was like to be a guy before but never thought it could happen.\"Emma says.\"Well I guess your going to find out.\"you say taking a puff on the cigarette.You find this time more pleasant than the last.\"We'll talk later.I better get back over there.\"Emma says and goes back inside to your spot.You think about what it is going to be like as an immigrant,female waitress.A single mother too you remember.You recall what happened right before the exchange.You believe you may have caused it when you said her name and looked at her.</span></div></div>",
            "created":1286859600,
            "id":973697,
            "title":"Emma Edwin"
        },
        "12":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Ashley Twist",
                "Marsha Mallard",
                "Donna Melonworth",
                "Kathy Nod"
            ],
            "content":"<div class=\"\"><div> <span>You were standing behind the counter at the coffee shop where you worked, bored out of your mind. While it wasn't a slow day you were tired of the slow, repetitive and regular routine your job revolved around. Looking at the next customer in line you saw that it was one of the regulars. You take their money and give them their coffee, having already prepared it from when they'd entered the shop. As you were serving the next customer you realized that the last customer had forgotten their purse at the counter so you call out to them.<br>\r\n<br>\r\nWhich one of the regular's had forgotton their purse?<br>\r\n<br>\r\nAshley Twist:<br>\r\nA College student who was majoring in fine arts<br>\r\n<br>\r\nMarsha Mallard:<br>\r\nThe veterinarian from down the street<br>\r\n<br>\r\nDonna Melonworth:<br>\r\nManager of a local grocery store<br>\r\n<br>\r\nKathy Nod:<br>\r\nAspiring Actress and daughter of your boss</span></div></div>",
            "created":1280379600,
            "id":926706,
            "title":"A Coffee Shop clerk... soon to be no longer"
        },
        "121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "no-one, Ashley fainted and is on the ground behind the counter",
                "Ashley, trying her best to pretend to be you",
                "Ashley, freaking out in your body"
            ],
            "content":"<div class=\"\"><div> <span>You suddenly found yourself seated at one of the tables by the front window, a cup of coffee in one hand and a laptop open in front of you. You clothes felt a bit strange, adding to the oddness of your sudden move. Looking down you were shocked to discover that you were wearing a tight fitting turtleneck sweater. Not only did the sweater surprise you but the two mounds whose contours it highlighted were something of a shock as well. Looking across the room at a mirror you saw the face of Ashley Twist, one of your regular customers, staring back at you.<br>\r\n<br>\r\nYou glance back at the store's counter and see...</span></div></div>",
            "created":1288414800,
            "id":983824,
            "title":"Ashley Twist"
        },
        "1212":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Go talk to Ashley in your old body",
                "Pretend to be Ashley"
            ],
            "content":"<div class=\"\"><div> <span>What shocked you more than suddenly being in Ashley's body was that your old body seemed to be acting relatively normally. Turning back to the laptop in front of you, you wonder if you should confront your old body about what happened or try to pretend to be Ashley.</span></div></div>",
            "created":1288414800,
            "id":983828,
            "title":"Ashley, trying her best to pretend to be you"
        },
        "12121":{
            "choices":[
                "Stay as Ashley",
                "Explore your powers"
            ],
            "content":"<div class=\"\"><div> <span>You get up only to discover that you are wearing 5-inch heels and you realize that you are going to face some difficulties just getting to the counter. Sighing, you walk to the counter, realising that you're walking as though you'd done it all your life, not to mention the excessive swaying of you hips and constant eye battering. You realize that being Ashley would be hard, especially with her very feminine traits. You happily realize that you don't have her personality inside, however. You can't control you actions as you brush the hair out of your face in a very female manner.<br>\r\n    <br>\r\n   When you reach the counter you don't have time to speak as your old body smiles at you and says, \"Ashley, you forgot your purse!\" You realize that your old body had no memory of ever being Ashley. You say, \"Thankyou, Kyle.\" You then walk, in that uncontrollable feminine way, back to the table. As you pack away the laptop you realize that it must have been the mention of Ashley's name that caused you to switch. What do you do, with this information?</span></div></div>",
            "created":1324530000,
            "id":1244340,
            "title":"Go talk to Ashley in your old body"
        },
        "121211":{
            "choices":[
                "Go to class.",
                "Go home. "
            ],
            "content":"<div class=\"\"><div> <span>You decide to stay as Ashley for now. Who knows, you can always swap with someone else by just saying their name. For now you are curious what the life of Ashley will be about. You pick up your backpack with your laptop inside it, not wanting to attract any attention by loitering around there anymore, and hurry out of the shop. You feel a wind blowing in your face and brush the hair out of your face again, ready to begin your new life.<br>\r\n<br>\r\nWhat you knew from Ashley was that she had classes right after she would pick up her coffee. You always wanted to visit university. However you could also go back to Ashley's place, hang out, get to know her better. <br>\r\n<br>\r\nWhere do you want to go?</span></div></div>",
            "created":1456433220,
            "id":2109475,
            "title":"Stay as Ashley"
        },
        "1212111":{
            "choices":[
                "\"Hey Amy.\" (you immediately swap with her)",
                "\"Hey friend.\" (you don't swap with her."
            ],
            "content":"<div class=\"\"><div> <span>If this was going to be your life, you better not screw it up by not keeping to Ashley's schedule. You make your way to the bus stop where you wait for the bus that takes you directly to university. While you were waiting you notice the people staring at you. The boys staring at your hips and ass, girls looking at you and whispering about with their friends. You meanwhile pretend not to notice and go over Ashley's purse. In her purse she keeps the usual things a girl keeps: a stick of gum, a small compact case, condoms (gross) and her cellphone. Luckily for you her cellphone is only fingerprinted protected. As you go through Ashley's phone the bus arrives. You careful try to step inside the bus but the heels are a little hard to walk in. You trip forward but the bus driver quickly grabs hold of you, a little too much looking at his pervert gaze of your chest. You thank him of course and sit down. <br>\r\n<br>\r\nWhen you're at the right stop, you step outside and make your way to the building where Fine Arts is located. You already went through Ashley's schedule and saw she had drawing lessons. You're a little bit worried about the subject itself, it wasn't like you were good at drawing. In front of the classroom you look at your phone deep in your thoughts, when you suddenly feel someone touching your shoulder. \"Hey Ashley.\"<br>\r\n<br>\r\nYou look up and see the face of Amy, a friend of Ashley. What do you say to her? </span></div></div>",
            "created":1483475220,
            "id":2258639,
            "title":"Go to class."
        },
        "12121111":{
            "choices":[
                "She realizes she's in her friend's body.",
                "She doesn't realise it."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before you realize what you are saying, you suddenly find yourself standing opposite Ashley, seeing her wearing the sweater, jeans and heels you were wearing earlier. However does Amy realize she's in her friend's body or not?</span></div></span></div>",
            "created":1490631420,
            "id":2295522,
            "title":"\"Hey Amy.\" (you immediately swap with her)"
        },
        "12122":{
            "author_id":"spiderboy27",
            "author_name":"Mr.Writer27",
            "choices":[
                "Find a way to get back to normal ",
                "Go after Kyle "
            ],
            "content":"<div class=\"\"><div> <span>While ashley was in my body, I calmly got up grabbed what was my new purse and took out the door. I put a pair sunglasses on I found in her purse and as I was walking down the street I pressed my lips together as if I was about kiss someone. I finally heard Simons called out \"ashley! Ashley! Over here\" I walked I've to the group of women that were shouting a me. One was a tall brunette, another was small blonde and the last was a tall blonde with a gorgeous breasts. I finally smiled and asked what they were doing. They were doing yoga and asked i wanted to join them. I courage sky said yes and enters the gym. Ashley back in Kyles body was still in shock at what she has see. She just got her body stolen. </span></div></div>",
            "created":1363150800,
            "id":1549161,
            "title":"Pretend to be Ashley"
        },
        "124":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "\"Uh good.... dad\"",
                "\"Whats going on\"",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>You look down and see that the last customer had forgotten her purse, you look at the name tag and \"Kathy Nod! Your pur--\" you never finish as you feel yourself get sucked out of your body and into a new one that feels...feminine. You  look down and don't see your boting old work uniform anymore that was the good news, the bad news was you had boobs now! You heard your body say \"Kathy Nod again but now you're confused if you were here then who was over there giving out coffees?<br>\r\n<br>\r\nYou hurried over to collect the purse though as to not draw too much attention to yourself.....which immediately failed since you realized where you had heard her name from.... she was the bosses beautiful daughter. \"Sugarcube! How are you?\" You here your boss say to you.</span></div></div>",
            "created":1542167340,
            "id":2577483,
            "title":"Kathy Nod"
        },
        "13":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Trinity Fushia",
                "Mark Wolfen",
                "Lily Zhang"
            ],
            "content":"<div class=\"\"><div> <span>As you sat at the customer service desk in the electronics sections your mind began to wander. You had had no customers all morning so far and were bored out of your mind. You needed something to focus on to stop from falling asleep so you decided to see what was going on elsewhere in the store.<br>\r\n<br>\r\nLooking out across the sales floor you saw Trinity Fushia trying hard to pay attention to a customer's question. The problem was that she was easily distracted and could be somewhat absent minded sometimes. As the customer stormed away from her after a few more minutes you shook your head. You felt bad for Trinity because she really was trying hard to be more helpful but the store manager had said that one more customer complaint and Trinity would be out of a job.<br>\r\n<br>\r\nThe next person you spotted was Mark Wolfen. Mark was one of the stores most memorable regular customers. He would come in once a week to buy some groceries and always made sure to comment to the manager on the helpfulness of the employees. His comment on Trinity's helpfulness was rumoured to be the only reason Trinity had not been fired a week earlier. Mark was always happy and seemed to enjoy his weekly trips to the store so much that his mood tended to soften the edges of some of the other customers.<br>\r\n<br>\r\nLily Zhang caught your eye next. She was hurriedly working the till, her shift nearly at an end. She was never very talkative around the other employees and would disappear for home the instant her shift ended. The few times you'd seen her outside of work you saw that she was a friendly person. Unfortunately your other coworkers thought very poorly of her, thinking her to be stuck up due to her non-speaking state at work. She was also the fastest cashier anyone had ever seen and as a result the other cashiers disliked her even more. Today she was the only cashier with a lineup and was working so quickly that she'd be done her ten customers before the rest were done with their second customers.<br>\r\n<br>\r\nAs you sat there, you shook your head and spoke the name of one of the above-mentioned people. Suddenly you were no longer seated and found yourself in the body of...</span></div></div>",
            "created":1287896400,
            "id":980608,
            "title":"Department store"
        },
        "131":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Act like Trinity, don't want to make anyone wonder what's up",
                "Be the best lingerie sales associate you can be, help Trinity keep her job",
                "Do something else"
            ],
            "content":"<div class=\"\"><div> <span>You were shocked to find yourself standing up, reaching out you steady yourself on a sales rack. Looking up you discover yourself to be standing in the middle of the store's lingerie section. Blinking in confusion you wonder how you got all the way over here. Looking to your left you see Trinity standing beside you, her pose seemingly mirroring your own.<br>\r\n<br>\r\n\"Uh...\" Trinity mumbles in sync with your thoughts.<br>\r\n<br>\r\nYou straighten your poster and Trinity does the same. You drop your shoulders and roll your eyes as Trinity mirrors your every move. You turn and take a step back towards the electronics section but something isn't right. You stumble again due to a strange centre of gravity your body seemed to now have. Catching yourself again you Look back at Trinity only to realize now that you'd been looking at a mirror. Snapping upright you drop your jaw in shock. As Trinity's chest heaves with your every breath you realize that somehow you were now in the body of Trinity Fushia, the easily distracted sales associate for the lingerie department.<br>\r\n<br>\r\nIn the mirror you see a customer come up to you. The customer is a young woman in her thirties and she is holding a bra in one hand. The customer taps you on the shoulder with her empty hand and says, \"Excuse me...\"<br>\r\n<br>\r\nYour mind races! What are you going to do. Since you are in Trinity's body everyone will think you <u>are</u> Trinity. So, what do you do?</span></div></div>",
            "created":1287896400,
            "id":980615,
            "title":"Trinity Fushia"
        },
        "1312":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "\"36B\"",
                "\"Could you take my measuments? I want to make sure to get the right size...\"",
                "\"32B, which is what this is but it is too small...\""
            ],
            "content":"<div class=\"\"><div> <span>Realizing that this is a great opportunity to help out Trinity you slap on your best smile and turn around to face the customer.<br>\r\n<br>\r\n\"Yes? How may I help you?\" you ask.<br>\r\n<br>\r\n\"Do you have this in my size?\" ask the customer, motioning towards the bra she is carrying.<br>\r\n<br>\r\n\"And what size would that be?\" you ask back.<br>\r\n<br>\r\nThe customer responds...</span></div></div>",
            "created":1287896400,
            "id":980619,
            "title":"Be the best lingerie sales associate you can be..."
        },
        "13121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Coming face to face with your boss",
                "returning to the customer"
            ],
            "content":"<div class=\"\"><div> <span>You have no idea where the different bras in the lingerie section are located so you ask, \"And where did you find that bra?\"<br>\r\n<br>\r\nThe customer leads you over to a rack of bras, most of them seeming to match the one in her hand. You then pause for a moment, exhale quietly and rifle through the rack, looking for the requested size. You certainly had not expected to be rifling through a bunch of bras today, that was for certain.<br>\r\n<br>\r\nWhen you fail to find the desired size bra you turn to the customer and say, \"One moment, I will go see if we have any in stock.\"<br>\r\n<br>\r\nYou then take the bra the customer had been holding and go over to the nearest store terminal. Not knowing Trinity's access code you enter in your own and bring up the store inventory. Reading from the label you enter a search for the bra and see that a new shipment had just come in that morning. You return to the customer you tell her that you will be right back with a bra for her before heading into the back room. On your way into the back room you smile at your boss as she speaks with a customer. Once the doors to the back room flap shut behind you, you exhale sharply and lean against a shelf.<br>\r\n<br>\r\n\"So far so good,\" you say, struggling to keep hold on the freak out you have been fighting since your initial discovery of the swap.<br>\r\n<br>\r\nYou then rush off to the right place in the back room and find the boxes of bras. Opening a box you quickly select the correct bra before turning around sharply and...</span></div></div>",
            "created":1287896400,
            "id":980707,
            "title":"\"36B\""
        },
        "131211":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Melissa asks you to take a seat",
                "You swap bodies with Melissa Melvin"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly finding yourself facing your boss you jump back and drop the bra. You boss rolls her eyes and picks up the bra. She then tosses it back into the box it came from.<br>\r\n<br>\r\n\"Trinity! My office! Now!\" snaps your boss.<br>\r\n<br>\r\n\"But... I've got a customer waiting...\" you mutter back.<br>\r\n<br>\r\n\"And let me guess, this customer needed you to come back here for that bra?\" retorts your boss.<br>\r\n<br>\r\n\"Yes, actually...\"<br>\r\n<br>\r\n\"Fine, take the bra to your customer and then I will see you in my office. If you are not there in two minutes you can kiss your job goodbye,\" replies your boss before spinning on her heel and marching off.<br>\r\n<br>\r\n\"Woah! That's harsh!\" comes the voice of Harold, the stockroom manager.<br>\r\n<br>\r\nYou grab the bra from the box again and run off, Trinity's adrenaline rushing through your veins and helping to keep your mind off of the strange sensations caused by your now longer hair and bobbing breasts. Snapping a smile back onto your face you slow to a walk just on the edge of the lingerie department.<br>\r\n<br>\r\nGoing over to the customer you say, \"36B, there you are. Is there anything else I can help you with?\"<br>\r\n<br>\r\n\"No, that's all! Thank you very much!\" replies the customer.<br>\r\n<br>\r\n\"No problem,\" you reply as the customer turns and walks to the registers.<br>\r\n<br>\r\nThe adrenaline kicks in again and you race to your boss' office, sliding to a stop just outside the door. You then take in a few deep breaths, nervously straighten Trinity's hair and knock on the door.<br>\r\n<br>\r\n\"Come in.\"<br>\r\n<br>\r\nAs you step inside the room you find your boss, Melissa Melvin, sitting at her desk. In a glance you see that the forms on the desk are employee records  and by the picture on one of them, they are Tinity's records.<br>\r\n<br>\r\n\"Am I late?\" you ask, \"If so then I am so sorry! I came as soon as I could! I just wanted to see to the customer.\"<br>\r\n<br>\r\n\"I'm certain I'll be hearing from them later,\" replied your boss.<br>\r\n<br>\r\n\"I wouldn't know about that Mrs. Melvin, ma'am,\" you say.<br>\r\n<br>\r\nWith those words leaving your mouth...</span></div></div>",
            "created":1287896400,
            "id":980719,
            "title":"Coming face to face with your boss"
        },
        "1312111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Go over to your old body",
                "go straight back to the lingerie section"
            ],
            "content":"<div class=\"\"><div> <span>\"Now I should not have to remind you of the many complaints I have gotten from customers about you...\"<br>\r\n<br>\r\n\"Uh, no ma'am,\" you reply nervously.<br>\r\n<br>\r\n\"I also hope I need not remind you what I told you this morning...\"<br>\r\n<br>\r\n\"No, I think I can guess... erm, remember,\" you reply, knowing that this morning was when Trinity received her ultimatum.<br>\r\n<br>\r\n\"Then it should not be surprising when I say that we will likely have to let you go.\"<br>\r\n<br>\r\n\"Ma'am?\" you ask, panicked as though it was your job on the line.<br>\r\n<br>\r\n\"I received a complaint just a few minutes ago about your behaviour. It was the same story as always. You were inattentive and forgetful, apparently ignoring everything the customer said to you and not even paying attention to them when they walked away.\"<br>\r\n<br>\r\n\"I'm sorry about that, I really am! I'm sure I can do better. Heck, I just did better!\" you blurt back in defence.<br>\r\n<br>\r\n\"I know you just did better, I watched on the security cam's. I just do not think that one good encounter should be given more weight than the dozens of negative encounters you have had just this month alone,\" retorts your boss, motioning at the open file in front of her.<br>\r\n<br>\r\n\"Just give me one more day,\" you plead, \"I'll do better! I'm sure of it.\"<br>\r\n<br>\r\n\"Fine, but if one customer leaves and encounter with you at all upset then I expect you to turn in your uniform at the end of the day and to not expect any further chances!\" she declares.<br>\r\n<br>\r\n\"I understand.\"<br>\r\n<br>\r\n\"Do you?\" demands Mrs. Melvin.<br>\r\n<br>\r\n\"Yes. I do,\" you reply stiffly.<br>\r\n<br>\r\n\"Then get out of my office and get back to work!\"<br>\r\n<br>\r\nAs you rush back out onto the sales floor you steal a peek towards electronics. There you see your old body staring idly at the counter in front of it.</span></div></div>",
            "created":1287896400,
            "id":980725,
            "title":"Take a seat..."
        },
        "13121111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "approach and try to help the customer",
                "move on to something/one else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey!\" you say, causing your old body to jump.<br>\r\n<br>\r\n\"You're me!\" says your old body, in apparent shock.<br>\r\n<br>\r\n\"Yes, and you are me,\" you reply.<br>\r\n<br>\r\n\"That explains it!\" says Trinity.<br>\r\n<br>\r\n\"Good to know you have figured it all out. Now I need to talk to you for a few moments okay. Then I'll go back to Lingerie and keep on working to let you keep your job,\" you explain.<br>\r\n<br>\r\n\"If I am you, then don't I have your job now?\" asks Trinity.<br>\r\n<br>\r\n\"Just focus, okay! And maybe by the end of the day neither of us will be out of a job!\" you blurt back.<br>\r\n<br>\r\n\"Okay!\"<br>\r\n<br>\r\nYou then quickly explain the bare minimum required to do your job, jotting down point form notes on a pad to help Trinity remember.<br>\r\n<br>\r\n\"Now if you just do what I've said then we should be fine at least until the end of the day. Now I'm trusting you with this. Do you think you can do it?\" you ask.<br>\r\n<br>\r\n\"You're trusting me?\" asks Trinity, suddenly shocked for no apparent reason.<br>\r\n<br>\r\n\"Yes, I am.\"<br>\r\n<br>\r\nTrinity takes in a deep breath and says, \"I won't let you down Kyle!\"<br>\r\n<br>\r\n\"Thanks! Now I'd better get back to lingerie before Melissa gets pissed off again!\" you reply before jogging back off towards lingerie.<br>\r\n<br>\r\nAlmost as soon as you enter the lingerie department again do you find a male customer holding up a pair of bras, a look of confusion on his face. Not entirely sure what to do you...</span></div></div>",
            "created":1287896400,
            "id":980733,
            "title":"Visiting Trinity in Electronics"
        },
        "131211111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "someone asks you a question",
                "he calls you over for more help"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello sir, can I help you with anything?\" you ask.<br>\r\n<br>\r\nAt first the guy blushes a bit before sighing and saying, \"Yes.\"<br>\r\n<br>\r\n\"What can I do for you then?\" you query.<br>\r\n<br>\r\n\"Well, I am trying to buy my girlfriend a something for her birthday and I thought that maybe a bra and panties would be nice but I'm afraid I'm at a bit of a loss...\" explains the customer.<br>\r\n<br>\r\n\"How so?\"<br>\r\n<br>\r\n\"I'm just not sure what kind to get her!\" he says, \"You're a girl! What would you like?\"<br>\r\n<br>\r\nYou blush a bit at the comment but take a deep breath and reply, \"Well, what I would like may not be what your girlfriend would like.\"<br>\r\n<br>\r\n\"I suppose...\"<br>\r\n<br>\r\n\"Why don't you tell me a bit about your girlfriend first then. Maybe we can figure something out...\"<br>\r\n<br>\r\n\"Okay... Well, she works for this law firm downtown as a secretary, you know and she is studying to be a lawyers at school. I don't really know how much use that is in picking lingerie though...\" mutters the customer.<br>\r\n<br>\r\n\"Anything else you can tell me?\" you ask, not any more clear on what to tell the customer either.<br>\r\n<br>\r\n\"Well, she likes to run in the mornings and during the summer she goes on lots of long bike rides. I used to try to keep up with her but she is just way to hard core on the bike for me!\" grins the customer, \"On the weekends I do go running with her sometimes though...\"<br>\r\n<br>\r\n\"How about a good sports bra then,\" you reply, glancing around in search of where the sports bras could possibly be located.<br>\r\n<br>\r\n\"Hey! That sounds like a great idea!\" smiles the customer.<br>\r\n<br>\r\nYou just then spot the sign for sports bras and lead the customer over to them.<br>\r\n<br>\r\n\"Here we go,\" you say, pointing at the rack of bras.<br>\r\n<br>\r\n\"Thanks!\" replies the customer, putting the bras he'd been holding before down on top of a nearby rack.<br>\r\n<br>\r\n\"Here, I'll go put these back and be right back to help you, okay?\" you ask, picking up the discarded garments.<br>\r\n<br>\r\n\"Sure, no problem,\" he replies.<br>\r\n<br>\r\nYou quickly put the bras back on the rack near where you'd first found the customer and were about to return to him when...</span></div></div>",
            "created":1287896400,
            "id":980741,
            "title":"approach and try to help the customer"
        },
        "1312111111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "\"yes. There are just so many kinds...\"",
                "\"no. I found a couple of pairs that should do. Thanks!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Excuse me! Where is the electronics section?\" asks a middle aged customer.<br>\r\n<br>\r\n\"Over there,\" you point, hoping that Trinity can manage to deal with them without trouble as the customer heads for the destination you pointed out.<br>\r\n<br>\r\n\"Thanks,\" calls back the customer.<br>\r\n<br>\r\nYou then go over to the male customer from before and find him still staring at the rack of sports bras.<br>\r\n<br>\r\n\"Is there anything else I can help you with?\"<br>\r\n<br>\r\n\"Actually...\"</span></div></div>",
            "created":1287896400,
            "id":980742,
            "title":"Directions to Electronics..."
        },
        "13121111112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "find another customer to help",
                "do something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As the customer walked off you decided to...</span></div></span></div>",
            "created":1288069200,
            "id":981817,
            "title":"Thanks and departure"
        },
        "131211111122":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "see if you can learn more about how to do well at Trinity's job",
                "do something else"
            ],
            "content":"<div class=\"\"><div> <span>Turning for a moment to see how Trinity is doing in your body you see her talking with the customer you had sent her way. She looked like she was actually trying hard to focus on what the customer was saying and as you watched for a few moments, she did not seem to slip up much.<br>\r\n<br>\r\nTurning your attention back to Trinity's, currently your, assigned portion of the store you decide to...</span></div></div>",
            "created":1288069200,
            "id":981826,
            "title":"Another thing to do..."
        },
        "1312111111221":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "learn locations",
                "learn specifics"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Let's see, I could either try to memorize where everything is located first or look up online the knowledge needed to answer more precise questions about the different items...\" you ponder to yourself.</span></div></span></div>",
            "created":1288069200,
            "id":981831,
            "title":"see if you can learn more about how to do well ..."
        },
        "13121111112211":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "You swapped with Christina",
                "You fetch the bra"
            ],
            "content":"<div class=\"\"><div> <span>You go over to one corner of the area and start reading/examining the names of the items on each of their different racks, paying special care to remember where each item is located. Just as you reach the halfway mark of the area you decide to take a break, the overflow of information being a bit much for you.<br>\r\n<br>\r\n\"Haven't they fired you yet?\" came a snarky comment from behind you.<br>\r\n<br>\r\nTurning around you come face to face with your older sister Christina, shaking her head at you. She then wanders off to a nearby rack. You were so taken aback by her behaviour you did not follow her at first but then you saw your boss looking in your direction from the other end of the store.<br>\r\n<br>\r\n\"Damn!\" you murmur before slapping back on the smile and following after your old body's sister.<br>\r\n<br>\r\nAs you catch up with your old sister you say politely, \"Is there anything I can help you with?\"<br>\r\n<br>\r\n\"You? No. Someone else? Maybe,\" was the flat response.<br>\r\n<br>\r\nYou had never known your sister to be so rude to someone other than family before and even then she was usually quite nice and polite.<br>\r\n<br>\r\n\"I'm sorry if I provided bad service before but I've been trying to be better at my job. I think I've really improved!\" you say, defending Trinity (and currently yourself) from your sister's unusually rude attitude.<br>\r\n<br>\r\n\"Alright then, let's see if you can find something,\" smirks Christina, \"Bring me a size 28B white Maidenform push-up bra.\"<br>\r\n<br>\r\n\"At once Christina!\" you chirp back, remembering exactly where the item she asked for was, thanks to your recent memorizing.</span></div></div>",
            "created":1288069200,
            "id":981850,
            "title":"What is where?"
        },
        "131211111122111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "walk off, leaving Christina to freak out in Trinity's body alone",
                "try to comfort Christina"
            ],
            "content":"<div class=\"\"><div> <span>You change of perspective was jolting to say the least but nothing prepared you for the headache. Twinging under the pain you see that Christina is freaking out now that she finds herself in Trinity's body.<br>\r\n<br>\r\n\"Wow! I knew you had bad migraines but fuck!\" you blurt out in Christina's voice.<br>\r\n<br>\r\nLooking back at Christina you see that she is shaking and in tears. Quickly looking around you see that Melissa had moved on to survey elsewhere so you...</span></div></div>",
            "created":1288069200,
            "id":981925,
            "title":"You swapped with Christina"
        },
        "1312111111221112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "She realizes you aren't Trinity",
                "She continues to think you are Trinity"
            ],
            "content":"<div class=\"\"><div> <span>Stepping forward you put your older sister's arms around the body you had just inhabited until a few moments ago. Holding Christina tightly you feel her shaking subside as her tears soak into the blouse she had put on that morning and which you were now wearing. Once she stops shaking you hear a few gasping breaths before she punches you in the gut, causing you to fall back against a rack of swimsuits. You grab at your arm, knowing that it will bruise and wishing that the headache would just go away already!<br>\r\n<br>\r\n\"What the fuck have you done?\" hissed Christina through Trinity's lips.<br>\r\n<br>\r\n\"What do you mean?\" you ask.<br>\r\n<br>\r\n\"How the fuck did you swap me into your fucked up little body, bitch?\" she hissed back.<br>\r\n<br>\r\n\"I have no idea,\" you reply, truthfully.<br>\r\n<br>\r\n\"Like hell you don't!\" she retorted, backing away clumsily.</span></div></div>",
            "created":1288069200,
            "id":981933,
            "title":"try to comfort Christina"
        },
        "13121111112211121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Christina stops and a look of realization flashes across her face.<br>\r\n<br>\r\n\"How did you know about my headaches?\" she asked.<br>\r\n<br>\r\n\"Uh,\" you reply, surprised by her sudden calmness.<br>\r\n<br>\r\n\"Holy fuck! Kyle?\" exclaims Christina, \"Is that you?\"</span></div></div>",
            "created":1288069200,
            "id":981934,
            "title":"She comes to a Realization"
        },
        "13121111112211122":{
            "author_id":"bigdipper",
            "author_name":"Writer404",
            "choices":[
                "Go back and try to help Trinity",
                "Try to figure out how you are switching bodies",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Christina please calm down.\" You say to her as slowly try to comfort her. You begin to approach her, when she slaps you and screams, \"Get away from me you bitch!\"<br>\r\n<br>\r\n\"Trinity!\" You both turn to see your boss Melissa storming towards you. You begin to panic when she grabs your sister in Trinity's body, \"Go get your things! You're fired!\" Christina completely shocked that she is being yelled at, runs to the back of the store. Now standing alone with your (former body's) boss she turns to you, \"I'm terribly sorry that happened to you please on behave of the store except this coupon for 55% off your next purchase.\"<br>\r\n<br>\r\nUhh.......thank you.\" You feel terrible about what just happened and turn towards electronics where you can see your former body staring towards the back room with tears in his eyes. Out of nowhere your head begins to hurt again so you quickly exit the store. Once outside you find a pair of sunglasses and some aspirin in the purse hanging under your arm. You take a couple pills, and put the sunglasses on. What do I do now? I should try to figure out how I am switching bodies with people. I should also try to help Trinity in any way I can. This is really all my fault.</span></div></div>",
            "created":1532577120,
            "id":2524745,
            "title":"She continues to think you are Trinity"
        },
        "131211111122111222":{
            "author_id":"bigdipper",
            "author_name":"Writer404",
            "choices":[
                "Tell your sister, in Trinity's body, the truth",
                "Play the part of Trinity's boss"
            ],
            "content":"<div class=\"\"><div> <span>Okay, let me go get a cup of coffee, and try to process what has happened. Still dealing with your sister's pounding headache you make your way to the nearby coffee shop and order an iced caramel latte. Sitting down at a table and sipping your coffee you begin to think about your day.<br>\r\n<br>\r\n\"Okay so I was thinking about trinity right before the first swap. Is that all it took? No it can't be because I wasn't thinking about that when Christina was in the store. All I did then was say her name..........is that it? You begin to look over your shoulder to make sure nobody is watching you. You close your eyes and whisper the name, \"Melissa Melvin.\" Suddenly you realize you're standing up. You open your eyes and see Trinity's body crying in front of you. You quickly look around the room and recognize it as you're bosses office you were just in. <br>\r\n<br>\r\n\"Please lady you have to believe me I'm not Trinity! I don't even know how I got here. One second I was talking to this bitch, and next thing I know we switch bodies! Please you have to believe me!\"<br>\r\n<br>\r\nOkay, so I have a couple options here. I can tell Christina the truth and try to fix everything, or I can play the part of Melissa Melvin.</span></div></div>",
            "created":1532577600,
            "id":2524746,
            "title":"Try to figure out how you are switching bodies"
        },
        "1312111111221112222":{
            "author_id":"bigdipper",
            "author_name":"Writer404",
            "choices":[
                "Swap with your original body",
                "Swap with someone else",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>I think I can fix this situation without having to tell my sister the truth. She was really mean to me when I was Trinity, and she deserves to spend a little time dealing with this. \"Trinity, enough with this stupid story of switching bodies. We both know that it isn't possible, and honestly is a really poor excuse for what you did to that woman. Now I was able to hear what she was saying to you, and I understand that she was being very rude. I'm sure you thought you were just acting in self defense.\"<br>\r\n<br>\r\n\"Wha-\" she began to say when you cut her off, \"--Do not interrupt me. I am going to give you another chance Trinity. Compose yourself, and go back out there and sell some clothes. Okay? Don't make me ask again. I'm being very generous here.\"<br>\r\n<br>\r\nChristina, in Trinity's body quickly scrambled out of the room, very confused at the sudden change in tone the apparent Melissa Melvin just had. You smile to yourself glad to have saved Trinity's job. Now you think to yourself what to do with this power, since you figured out how it works.<br>\r\n<br>\r\nA light bulb goes off in your head and you begin your plan....</span></div></div>",
            "created":1532578140,
            "id":2524747,
            "title":"Play the part of Trinity's boss"
        },
        "13121111112211122221":{
            "author_id":"bigdipper",
            "author_name":"Writer404",
            "choices":[
                "Celebrity",
                "Family Member",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>After you say the name you find yourself back in electronics. You look down and see you are back in your body. Quickly you start running towards Melissa's office in the back. On the way you pass Christina in Trinity's body as she is trying to sell a bra to who appears to be a soccer mom. You get to the office and open the door to see your boss touching her boobs.<br>\r\n<br>\r\n\"Trinity, It's me I switched with Melissa to give you your job back, and then I got an idea to let you be the boss. I felt really bad for almost getting you fired today, so now you are the one with all the power.\"<br>\r\n<br>\r\n\"Really? Thank you so much! I don't know what to say! Um......my first act as manager is to give you a raise for all that you've done for me.\"<br>\r\n<br>\r\n\"Oh...thank you, but I can't accept. We can't let the other employees see the boss all of a sudden have favoritism. I just wanted to let you know what was going on. Have fun.\"<br>\r\n<br>\r\nYou walk out of the office happy with your decision. Curious about what else you can do you say another name and swap with......</span></div></div>",
            "created":1532578500,
            "id":2524751,
            "title":"Swap with your original body"
        },
        "131211111122112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "A customer with a question",
                "A guy with a pick up line"
            ],
            "content":"<div class=\"\"><div> <span>Coming back to Christina with the requested item you say, \"Here you go. Is there anything else I can help you with?\"<br>\r\n<br>\r\nYour old sister smirks before rattling off a list of half a dozen items she wants you to get her. Once you have delivered every item, having to search a bit for those you had not memorized yet, Christina nods her head.<br>\r\n<br>\r\n\"Anything else?\" you pant, Trinity's body being apparently unused to the rapid dashes you had just performed in and about the lingerie department.<br>\r\n<br>\r\n\"I'm done, thanks!\" replied Christina, selecting one or two of the items she requested and placing them in a shopping basket before handing the rest back to you.<br>\r\n<br>\r\nYou pause for a moment to catch your breath as Christina walks off, smiling to herself. The next thing you do is return the items Christina rejected to their proper places. As you lean against a pillar to rest for a moment someone comes up to you.</span></div></div>",
            "created":1288069200,
            "id":981892,
            "title":"Playing fetch"
        },
        "1312111111221121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Lily Zhang, after her shift of working the registers",
                "Harold Thomas, pushing a dolly with fresh stock"
            ],
            "content":"<div class=\"\"><div> <span>Christina's little trivia session having helped you to learn most of the rest of the lingerie section you dispatch the customer easily and with them most pleased with your help. You then experience a lull in questions and customers during which time one of the other employees comes over to you. The person in question was...</span></div></div>",
            "created":1288069200,
            "id":981897,
            "title":"A customer with a question"
        },
        "13121111112211212":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Take Trinity's coffee break",
                "Return the dolly to Harold"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello Tri,\" greets Harold, stopping the dolly at your feet.<br>\r\n<br>\r\n\"Hey Harold,\" you reply, leaning on top of the pile of boxes.<br>\r\n<br>\r\n\"Uh, where do you want this?\" asks Harold, backing up a step.<br>\r\n<br>\r\nLooking quickly at the boxes you then point towards a nearby set of shelves, \"There should be fine.\"<br>\r\n<br>\r\nAs Harold wheels the dolly over to the shelves you follow him.<br>\r\n<br>\r\n\"That's everything I guess,\" says Harold, strangely anxious to depart.<br>\r\n<br>\r\n\"Can't you stick around?\" you ask, \"I don't get to see you on the floor too often!\"<br>\r\n<br>\r\n\"Oh, uh... I... I'll just be going then!\" mutters Harold, taking off back for the back room.<br>\r\n<br>\r\n\"Hey! You forgot your Dolly!\" you call out after him but he is already gone.<br>\r\n<br>\r\nShaking your head you turn back to the dolly and begin stacking the boxes on the shelves. After nearly an hour longer of no customer questions you decide to...</span></div></div>",
            "created":1288069200,
            "id":981905,
            "title":"Taking stock"
        },
        "131211111122112121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "the staff room",
                "electronics"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Deciding to take the allotted 15 minute coffee break since there were no customers you go over to...</span></div></span></div>",
            "created":1288069200,
            "id":981911,
            "title":"Gimme a break..."
        },
        "1312111111221121211":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Melissa Melvin, day manager and yours and Trinity's boss",
                "Nancy Piltdown, the store's oldest staffmember by age and  time working there"
            ],
            "content":"<div class=\"\"><div> <span>In the staff room you found...<br>\r\n<br>\r\nPo Tzu, newest member of the staff and always curious<br>\r\n<br>\r\nNina Bollock, the excessively nervous and beautiful pharmacist<br>\r\n<br>\r\nJohn Bold, one of the Cashiers and minor daredevil<br>\r\n<br>\r\nAmanda Ana-Marteau, Night shift manager and asleep on a stool in the corner<br>\r\n<br>\r\nand...</span></div></div>",
            "created":1288069200,
            "id":981923,
            "title":"the staff room"
        },
        "13121111112211212111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "swallow your pride, go back to work",
                "insist on your right to a coffee break"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello Trinity,\" greets your manager, \"Given up on your job already?\"<br>\r\n<br>\r\nYou feel all eyes turn to focus on you (except Amanda's as she was still asleep in the corner).<br>\r\n<br>\r\n\"No ma'am,\" you reply, \"I'm just taking my break.\"<br>\r\n<br>\r\n\"And I suppose if any customers show up in lingerie while you are out they'll be helped by... who? Not you certainly as you'll be up here,\" returns Mrs. Melvin.<br>\r\n<br>\r\n\"I'm allowed to take a fifteen minute coffee break. Store policy,\" you reply.<br>\r\n<br>\r\n\"It is also store policy to fire employees after they rake in 50 serious complaints over the course of a month. Now I suggest you head back out there in case any customers show up and leave dissapointed,\" retorts Melissa.<br>\r\n<br>\r\nYou clench your fists and decide to...</span></div></div>",
            "created":1288414800,
            "id":983709,
            "title":"Your boss is there too"
        },
        "131211111122112121111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "They have a few questions",
                "It isn't a customer but is Trinity's little sister"
            ],
            "content":"<div class=\"\"><div> <span>You turn on your heel and march down the hall and back out onto the sales floor. Seething a bit from Melissa's unfair and stubborn attitude you make your way back over to lingerie where you find, to your slight dismay, a young girl looking around as though in search of an employee. Swallowing hard you try to bring a smile back onto Trinity's pretty face before stepping up to the girl and asking, \"Is there anything I can help you with?\"</span></div></div>",
            "created":1288414800,
            "id":983711,
            "title":"swallow your pride, go back to work"
        },
        "1312111111221121211112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "A customer arrives in need of help",
                "You are left with time to think about the girl's revelations"
            ],
            "content":"<div class=\"\"><div> <span>The girl turns around and her face brightens.<br>\r\n<br>\r\n\"Hey Trinity! How's work?\" smiles the girl.<br>\r\n<br>\r\n\"Fine, I guess,\" you reply, unsure who the girl is.<br>\r\n<br>\r\n\"I was just shopping with my friends and I figured I'd pop over here and see how things were going for you!\" says the girl happily.<br>\r\n<br>\r\n\"Thanks,\" you reply, still in the dark as to who the girl is.<br>\r\n<br>\r\n\"So do you get to keep your job?\" asked the girl.<br>\r\n<br>\r\n\"We'll see,\" you reply, \"I hope so!\"<br>\r\n<br>\r\n\"That's good! Anyways, I'd better be going then!\" grins the girl, jumping upon you in a hug. As she releases you she says, \"Oooh! Looks like Kyle's taken an interest in you Trinity!\"<br>\r\n<br>\r\n\"What?\" you ask, shocked and looking back over at electronics.<br>\r\n<br>\r\n\"Maybe he's got a crush on you too!\" smirks the girl.<br>\r\n<br>\r\n\"Uh...\"<br>\r\n<br>\r\n\"See! I told you he didn't think you were useless!\" smiled the girl, \"You just gotta have more faith in yourself sis!\"<br>\r\n<br>\r\nYou finally realized who you were talking to.<br>\r\n<br>\r\n\"Well, see you later Trinity! I hope you can keep your job!\" waves the girl before running off.<br>\r\n<br>\r\nYou wave back at the girl before turning to look back at electronics where you see your original body looking back at you, blushing slightly.</span></div></div>",
            "created":1288414800,
            "id":983722,
            "title":"It isn't a customer but is Trinity's li..."
        },
        "13121111112211212111121":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "buying a training bra for her daughter",
                "choosing the right swimsuit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The customer needs help with...</span></div></span></div>",
            "created":1288414800,
            "id":983738,
            "title":"A customer arrives in need of help"
        },
        "131211111122112121111212":{
            "choices":[
                "the one-piece.",
                "the bikini.",
                "the tankini (not what she picked, but you think it would look great)"
            ],
            "content":"<div class=\"\"><div> <span>\"I was wondering if you could help me decide which swimsuit to wear?\" The woman asks you as she holds two different swimsuits up. I'm not really sure. <br>\r\n<br>\r\nThe woman was in her forties, blond and rather plain looking but a big pair of breasts by the looks of the bulges of her sweater. You check out the differences between the two swimsuits the woman is holding up. The left one is a one-piece, in a light blue color with pink stripes. The right one was a bikini with small blue and green flowers decorating it. <br>\r\n<br>\r\n\"My daughter thinks I should wear a bikini, but I'm not sure it would suit me. What do you think?\" The woman asks you.<br>\r\n<br>\r\nYou ponder and tell her to pick...</span></div></div>",
            "created":1448168400,
            "id":2065456,
            "title":"choosing the right swimsuit"
        },
        "1312111111221121211112123":{
            "author_id":"clockworange",
            "author_name":"Clockworange",
            "choices":[
                "You switch back with Trinity",
                "You can't swap back for some reason!",
                "Trinity pleads with you to stay swapped for the night."
            ],
            "content":"<div class=\"\"><div> <span>Stalling for time, you ask the forty-something woman, \"Can you describe your style a bit more to me? Are you planning to go on holiday, or is this for more around-the-pool wear?\"<br>\r\n<br>\r\n\"Actually, I'm hoping to surprise my husband for our anniversary this weekend.\" She blushes, describing the naughty things they plan to do while their children are with a sitter. You've heard that women can get really raunchy and talk about all sorts of sexually eyebrow-popping things without a man around, but you can't believe your ears.<br>\r\n<br>\r\nThe woman continues to prattle away about her husband, his cock, and all the things she'd like to do with it, while you sift through a rack of swimsuits. Deciding enough is enough, you spot a tankini that's about her size and pull it off the rack. You beam, \"I think this little number would do wonders to complement your figure.\"<br>\r\n<br>\r\n\"You really think so?\" The woman glances into a nearby mirror, holding the garment in front of herself.<br>\r\n<br>\r\n\"Absolutely! This model is in vogue this season. It's modest yet supportive.\" You gush. \"Your husband won't be able to take his eyes off you in one of these.\"<br>\r\n<br>\r\nThe woman spins around in the mirror vainly while you retrieve other tankinis of the same size but with different patterns and colours. You point her to the dressing room, and she thanks you profusely after selecting a handful to take with her to try out.<br>\r\n<br>\r\nSighing, you glance up at the clock and wait for Trinity's shift to end. The next hour passes by in a blur as you tend to a horde of women stopping by the department store after their own professional jobs are over. Most of them are older women, like the one asking about the swimsuit, and you don't get much titillation looking at their age-worn, flabby, sagging busts.<br>\r\n<br>\r\nTrinity's shift is finally over and your feet are killing you. Having to stand on that sales floor for the past nine hours, without any breaks courtesy of Miss Melvin, wearing Trinity's leather zip-up ankle boots. You feel what might be a blister beginning to form on your heel.<br>\r\n<br>\r\nGingerly, you trudge over to the electronics section and see Matt, the evening customer service representative who relieves you after your own shift ends.<br>\r\n<br>\r\n\"Hi Matt, have you seen Kyle around?\" You ask him.<br>\r\n<br>\r\n\"Heya Trin, he clocked out about ten minutes ago. I think he went over to the break room; might still be there if you catch him.\" Matt drawls lazily, leaning back in his chair behind the booth with his arms spread wide and his hands cradled behind his head. \"You still working here? I thought Miss Melvin fired you after getting too many complaints.\"<br>\r\n<br>\r\n\"Yes, I am still working here!\" You huff defensively. \"And don't you worry, things are gonna be different from now on. I'll make sure of it.\"<br>\r\n<br>\r\nMatt rolls his eyes and returns to reading his magazine. So even the night shift knows about Trinity's incompetence? Gossip spreads quickly, you groan, as you head over to the break room.<br>\r\n<br>\r\nInside the break room, Trinity sits at the table next to Amanda Ana-Marteau, the night shift manager.<br>\r\n<br>\r\n\"Hi Trinity,\" Amanda yawns, sipping a cup of coffee. She pulls on her company vest and takes out a compact mirror, looking over her appearance. If the day shift manager, Melissa Melvin, is the wicked witch, then Amanda is the good witch. If it didn't mean prowling around the department store on the graveyard shift like a ghost at three o'clock in the morning, you would work for her instead of Melissa. <br>\r\n<br>\r\n\"How was work today hon? I heard Melissa got on your case again.\" Amanda adds, as you sit at the table across from Trinity in your body. She stares at you uneasily.<br>\r\n<br>\r\n\"I talked her into giving me one more chance. No more screwups.\" You assert.<br>\r\n<br>\r\nAmanda doesn't seem to buy it, however, as she replies, \"That's wonderful, Trinity. You remember the offer I made to you last week, right dear? I might be able to switch you over to the night shift over in Appliances now that Lisa quit.\"<br>\r\n<br>\r\n\"I'll think about it, thanks for the kind offer Miss Marteau.\" You smile. <br>\r\n<br>\r\n\"Don't think too hard about it,\" She says and closes her compact, standing up and fluffing out her wavy brunette hair. The way she said it strikes you as condescending, but you ignore it. \"That position won't be open forever. Let me know!\"<br>\r\n<br>\r\nShe leaves to begin her own shift, leaving you and Trinity alone in the break room.<br>\r\n<br>\r\n\"Appliances isn't a bad gig, you know...\" You begin awkwardly, straightening out your hair. \"At least it gets you away from Miss Melvin and the stick up her ass.\"<br>\r\n<br>\r\n\"I know...\" She nods demurely.<br>\r\n<br>\r\n\"So why not give it a try?\" You ask.<br>\r\n<br>\r\nTrinity sighs, \"I don't really know much about televisions, dishwashers, toasters, and all that junk.\"<br>\r\n<br>\r\n\"You seemed to do fine with my job in Electronics today.\"<br>\r\n<br>\r\nShe grabs her arm and rubs it as if stung by your helpful reproach. \"Actually... I don't think I helped anyone today. I got a couple of complaints logged this afternoon. I'm sorry. I guess I'm just not very smart. I forget things a lot. But I don't mind working in Lingerie since I wear it all the time!\"<br>\r\n<br>\r\nYou shift uncomfortably in your seat. Trinity <i>does</i> seem to be one of the duller tools in the shed. But she's always been nice to you, and her little sister's comment still hangs unresolved in your mind: <i>Maybe he's got a crush on you <b>too</b></i>. Her last word implying a lot more than you were initially aware of about Trinity.<br>\r\n<br>\r\n\"Okay,\" You say gently, moving over to place your arm around Trinity's shoulders. \"All we need to do is get some customers to leave positive feedback about you and that will get Miss Melvin off your case for a while.\"<br>\r\n<br>\r\n\"But how are we gonna do that?\" She shoots you a questioning glance.<br>\r\n<br>\r\n\"Easy... I call up a few friends, you call a few friends, and they buy some lingerie at the store after you help them out.\" You explain slowly. \"I've got my Mom, my sister, my girlfriend...\"<br>\r\n<br>\r\n\"Your girlfriend?\" Trinity repeats, her face falling.<br>\r\n<br>\r\nYou nod. \"Yes... not to mention anyone you know who might need a new bra or panties. So whattya say?\"<br>\r\n<br>\r\n\"I guess that could work.\" She murmurs. \"Hey... do you know why we switched bodies? And can we get back to normal?\"<br>\r\n<br>\r\n\"Yeah, earlier this morning I was bored and all of a sudden this voice popped into my head. It said I can swap bodies with whoever I want; all I need to do is say their name while focusing on them.\" You explain. \"You're the only person I've tried this out with.\"<br>\r\n<br>\r\n\"I see.\" She looks down at your body, then at hers, and adds, \"I never realised how cute I look.\"<br>\r\n<br>\r\n\"I doubt <i>anyone</i> can look cute dressed in these bulky corporate uniforms...\" You grumble. She orders you to stand up, and she slowly walks around your body examining it from all angles, making you feel like you're on display.<br>\r\n<br>\r\n\"This is so funny!\" She giggles, raising your voice an octave higher with a feminine lisp. She claps her hands. \"It's like having... um... an out of body experience or something. Like Freaky Friday!\"<br>\r\n<br>\r\n\"Right,\" You agree. \"Can we swap back now? This body really needs to pee and I've been holding it in for a while.\" You press your thighs together, noting the distinct void between your legs now.<br>\r\n<br>\r\n\"Why didn't you just go?\" Trinity asks curiously.<br>\r\n<br>\r\n\"Because it's your body... a girl's body!\"<br>\r\n<br>\r\n\"So what? I went in your body earlier today,\" She replies, then gets an odd smirk on her face, \"It was really weird peeing while standing up and using one of those wall toilets, y'know? But in a good way I mean.\"<br>\r\n<br>\r\nYou frown. \"Whatever! Let's just swap back already.\"<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1541000940,
            "id":2571159,
            "title":"the tankini (not what she picked, but you think..."
        },
        "13121111112211212111121231":{
            "author_id":"clockworange",
            "author_name":"Clockworange",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You focus on your old body and say the name, \"Trinity Fushia,\" but nothing happens. Your heart plummets, but upon saying \"Kyle Blunt,\" everything swirls around and you feel like falling until the next moment... when you're back in your own body.<br>\r\n<br>\r\n\"Whew! Glad that worked.\" You pat your flat chest. Unfortunately you had been so busy helping out Trinity and stopping her from getting fired that you didn't take time to feel up her body. You might get another chance later.<br>\r\n<br>\r\n\"Home sweet home,\" She checks herself out in the break room mirror, striking a few poses and sticking out her tongue playfully. \"Oh my! You really did have to use the toilet, didn't you?\"<br>\r\n<br>\r\n\"Yeah, sorry!\" You laugh nervously.<br>\r\n<br>\r\nTrinity walks up to you and throws her arms around you, hugging you tightly. \"Thanks for saving my job, Kyle. It's really sweet of you to do all this for me.\"<br>\r\n<br>\r\nYou can feel her large breasts mashing into your chest. Her long, blonde hair smells nice as well.<br>\r\n<br>\r\nFinally you push her away. \"I need to head back to my place. It's getting pretty late.\"<br>\r\n<br>\r\n\"Okay,\" Trinity's smile fades. \"Hey... you have another shift with me tomorrow, right? Do you... Do you mind if we... y'know... switch bodies again so you can do my shift for me?\"<br>\r\n<br>\r\n\"Sure, why not?\" You shrug. \"Let's meet up behind the building to make the switch.\"<br>\r\n<br>\r\n\"Thank you!!!\" She squeals, wanting to hug you again but instead you point to the restrooms, and she remembers and hurries down the hallway.<br>\r\n<br>\r\nGetting into your car, you can't believe everything that happened today. A voice gave you a wonderful power to switch bodies by saying that person's name (their body's name, as it turns out). You used it to trade places with an absentminded, ditzy coworker who may be carrying a torch for you. You did a decent job impersonating her while assisting customers find women's lingerie, making sure she wouldn't get fired today. And now you've got a plan to help her out over the long term.<br>\r\n<br>\r\nWhat could go wrong?<br>\r\n<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\nYou pull the car into the parking lot of a suburban apartment complex. This is where you and your girlfriend, Emily, have lived together for the past six months. Your wages from the department store and Emily's wages as a part-time university tour guide are enough to pay rent, food, utilities, with a modest amount left over for savings. You and Emily shared the car; it was a gift from her parents. <br>\r\n<br>\r\nEmily is laying on the couch watching Netflix when you get home. She's dressed in a cotton t-shirt (one of yours, in fact), which drapes over her arms and waist. Beneath that is a beige 32B bra and matching panties; she isn't wearing any trousers. A small drum of ice cream lays on the table next to her.<br>\r\n<br>\r\n\"Tough day at university boo bear?\" You guess correctly, taking off your uniform and hanging it up in the closet.<br>\r\n<br>\r\nEmily frowns, \"How can you tell?\"<br>\r\n<br>\r\nYou pull her close and run your hand along her back. Your hand sweeps lower and lower until you grab her bum; she grabs your wrist and pulls it away for a moment.<br>\r\n<br>\r\n\"Uh uh... not tonight lover,\" She can't help but smile, breathing into your neck.<br>\r\n<br>\r\n\"Why don't you tell me about your day?\" You ask, deciding to postpone telling her about your amazing new powers for now. \"Are you hungry? I can cook up some chicken on the stove tonight.\"<br>\r\n<br>\r\n\"That sounds wonderful.\" She coos, and as you turn around she taps your butt playfully. She turns off the TV and closes the windows.<br>\r\n<br>\r\nSighing, she begins, \"So after my classes I go into the student union to set up some tables and organize the job fair. Now, I'm not required to do this, since I was just covering for Jenna since she had a date with Mark. You've met Jenna before, haven't you sweetie?\"<br>\r\n<br>\r\n\"I think so, yeah.\" You grunt, setting the pan to simmer and adding some chopped vegetables and spices.<br>\r\n<br>\r\n\"So Jenna is supposed to be at the cine with her date watching <i>Loving You Twice</i>. And she texts me telling me he's getting really hot and handsy. So I text her back and I'm like, 'Work it girl!' And then she tells me to cover for her a while longer because this date could lead to something more at his place.\"<br>\r\n<br>\r\n\"Let me guess...\" You interject, thawing out a chicken breast before throwing it on the pan. \"She and Mark went back to her apartment and she left you to do all of her work at the job fair?\"<br>\r\n<br>\r\n\"Exactly!\" Emily complains. \"That two-faced cunt totally hung me out to dry. And she knew I had an important examination to make up later that day. She <i>knew</i> I couldn't cover for her as well as retake my test. I bet she did this because of what Charlotte said about me to her yesterday after our yoga class.\"<br>\r\n<br>\r\n\"So what did you do? About the double booking, I mean.\" You ask, trying to follow one story line at a time.<br>\r\n<br>\r\nEmily continues to blow off steam while you flip and sear the chicken in the pan. You tune her out and occasionally agree with her or reinforce some notion she has about one of her friends or classmates. Girls can be so petty to each other sometimes.<br>\r\n<br>\r\n\"Supper's ready, babe.\" You announce to her finally, and she sets some plates and silverware on the kitchen table.<br>\r\n<br>\r\nEmily's mood improves after a good meal; she doesn't eat when she gets stressed out which usually makes things worse. You're just happy to have some peace and quiet. <br>\r\n<br>\r\nYou both watch a new TV series on Netflix to pass the time after dinner. She's laying on top of you on the couch, snuggled up in your arms as you caress her hair.<br>\r\n<br>\r\nThen you're reminded of Trinity.<br>\r\n<br>\r\n\"Hey babe,\" You ask your girlfriend, \"Would you do me a favour please?\"<br>\r\n<br>\r\n\"Of course, Kyle, what do you need?\" She cranes her head upward to meet your eyes.<br>\r\n<br>\r\n\"There's this coworker of mine at the department store... her name is Trinity.\" You begin. \"She's really nice but kind of forgetful. Anyways, she's having a hard time at work and asked for my help. I told her I'd try to get you and Christina and maybe my mother to buy some lingerie from the store and give her positive reviews so her boss won't fire her.\"<br>\r\n<br>\r\n\"That was nice of you to suggest that,\" Emily smiles. \"But I already have all the lingerie I need.\"<br>\r\n<br>\r\n\"Just humour her, will you?\" You plead earnestly. Seeing her noncommittal, you add, \"Consider it an early birthday gift. I know it isn't till next month, but why don't you pick out anything you like? I'll pay for it.\"<br>\r\n<br>\r\nHearing that, Emily closes her eyes. \"Now that you mention it... there is this frilly, lacy, g-string I've been aching to get and try on for you.\"<br>\r\n<br>\r\nYour heart skips a beat, picturing your girlfriend in a racy, revealing thong. Most of her underwear being comfortable, full-seated, and utilitarian rather than sexy.<br>\r\n<br>\r\n\"You really mean it babe?\" You ask, kissing her.<br>\r\n<br>\r\nShe scoffs, \"Dream on, loverboy! I'll do that if you replace all of your boxers with speedos and banana hammocks.\"<br>\r\n<br>\r\nYou grimace. \"Point taken. Can you at least do it for Trinity then? Her name is Trinity Fushia, she works in the Lingerie section.\"<br>\r\n<br>\r\n\"What does she matter to you?\" Emily asks, more suspiciously.<br>\r\n<br>\r\n\"Her? Nothing!\" You blink. \"I just thought it would be nice to help her keep her job. Because if she gets fired, then they might move me out of Electronics and make me sell women's undies.\"<br>\r\n<br>\r\nEmily laughs. \"Now that's a funny thought! You don't know a thing about women's clothes, much less bras and panties! I'd kinda like to see you try though.\" She teases you but ultimately agrees to help.<br>\r\n<br>\r\n\"Thanks babes, I promise you won't regret it.\" You declare.<br>\r\n<br>\r\n</span></div></div>",
            "created":1541025360,
            "id":2571296,
            "title":"You switch back with Trinity"
        },
        "131211111122112121111212311":{
            "author_id":"clockworange",
            "author_name":"Clockworange",
            "choices":[
                "You switch with Trinity and do each other's shifts.",
                "Trinity insists on handling things herself.",
                "Trinity doesn't show up for work?"
            ],
            "content":"<div class=\"\"><div> <span>Later that evening, as Emily takes a shower to get ready for tomorrow, you give your older sister Christine a call. You're still confused about why she treated you (as Trinity) so rudely. You also make it an opportunity to get her to help you out as well.<br>\r\n<br>\r\nThe phone rings a few times, but thankfully she picks up.<br>\r\n<br>\r\n\"Hi Christine! How's my favourite sister tonight?\" You lean over the table and speak into your cell phone.<br>\r\n<br>\r\n\"Hello Kyle!\" She chirps on the other line. \"You caught me at a good time. Evan tucked the babies in and I just got back from my jog.\"<br>\r\n<br>\r\nYour older sister got married two years ago to a guy named Evan. They're both very active, outdoorsy people and are perfect for each other. It wasn't long before Christine had their first child, soon after followed by a second child... Irish twins basically. They take up most of their time nowadays, with Christine acting as the stay-at-home mom.<br>\r\n<br>\r\n\"That's good. Hey, I wanted to ask you a question.\" You begin. \"Is everything okay? I mean, are you doing alright?\"<br>\r\n<br>\r\n\"Sure, Kyle. Why wouldn't I be?\" Christine chuckles.<br>\r\n<br>\r\n\"It's just... Trinity told me you came to the store earlier today.\" You reply. \"She said you acted pretty rudely to her.\"<br>\r\n<br>\r\nYou can hear her scoff on the phone. \"So she put you up to this, Kyle? What does that bimbo want from me?\"<br>\r\n<br>\r\nYou steel yourself and continue, \"She just wanted to know, that's all. She sounded upset when she told me about it later.\"<br>\r\n<br>\r\nSure that was a lie. And sure, the real Trinity never talked to your sister today. But your sister is a sucker for guilt and you figure it might be an effective way to get her back into the store and make amends by giving Trinity a positive review.<br>\r\n<br>\r\nChristine sighs. \"It would take too long to tell you the story between us, Kyle.\"<br>\r\n<br>\r\n\"You mean you've known her before? How long?\" You ask intrigued.<br>\r\n<br>\r\n\"Like I said, that's a conversation for another day. It's pretty late.\" Christine said. \"... Let's just say that I <i>used</i> to know her. We went to the same school together several years ago. But she was too stupid to handle it so she dropped out.\"<br>\r\n<br>\r\n\"Okay, I won't press the matter.\" You reply. \"Just promise me you'll come back to the store tomorrow and leave her a glowing review? It might mean preventing her from getting fired. Do it for me, as your little brother, will you please?\"<br>\r\n<br>\r\nThere's a pause. Finally, she sighs, \"Okay. Fine. I'll come back tomorrow. But only for you, Kyle. Not for that bitch.\"<br>\r\n<br>\r\n\"Fine! Thanks!\" You hang up the phone. Shortly thereafter, you go to bed with Emily.<br>\r\n<br>\r\nTomorrow morning before your shift begins...<br>\r\n</span></div></div>",
            "created":1541025480,
            "id":2571299,
            "title":"Calling Christine."
        },
        "1312111111221121211112123111":{
            "author_id":"clockworange",
            "author_name":"Clockworange",
            "choices":[
                "Swap with Melissa Melvin and access yours and Trinity's employee files.",
                "Stay as Trinity for now and continue her shift.",
                "Swap with someone else entirely."
            ],
            "content":"<div class=\"\"><div> <span>Sniffing the crisp morning air, you look at your wristwatch. <br>\r\n<br>\r\nTen minutes until your and Trinity's shift is supposed to begin, but she hasn't arrived at the department store yet. <br>\r\n<br>\r\nYou're leaning against the brick wall behind the building, in the alley next to the dumpsters and power generators. Harold Thomas, the stockroom manager, sits on a wooden crate, taking a drag on a cigarette. He had finished restocking the shelves earlier that morning.<br>\r\n<br>\r\n\"Want a smoke?\" He asks you, patting a pack of menthols in his palm.<br>\r\n<br>\r\nYou shake your head. \"Emily would kill me if I start smoking again.\"<br>\r\n<br>\r\nHarold gets a wry grin. \"Emily, huh? How's she doing lately? She still going to university?\"<br>\r\n<br>\r\n\"Yeah. She graduates next year.\"<br>\r\n<br>\r\n\"That's good. You're a lucky guy to have someone like her in your life.\" He takes another drag, causing the tip to flare up orange for a moment.<br>\r\n<br>\r\n\"Thanks, man.\"<br>\r\n<br>\r\nHarold nods and blows the smoke out of his nostrils.<br>\r\n<br>\r\n\"You got anybody special in your life?\" You ask, feeling the cold bricks against your back.<br>\r\n<br>\r\nHarold takes a few seconds to answer, but eventually he mutters something you can't hear. When you ask again, he replies, \"Nothing. There is this one girl I like... but I don't think anything's gonna happen between us.\"<br>\r\n<br>\r\n\"You don't know that for certain,\" You reassure him. \"What's her name?\"<br>\r\n<br>\r\nHarold shakes his head slowly. \"Never mind.\"<br>\r\n<br>\r\nDeciding not to pry into another person's personal affairs, you simply let it go. \"Alright Harold... I won't ask for details. For what it's worth, I used to feel the same way before I sacked up and asked Emily out. She had just started university when we met, and I couldn't afford to go, so I thought she was out of my league. Anyways, I didn't know she secretly liked me too, so we hit things off immediately... been that way ever since.\"<br>\r\n<br>\r\n\"What's your point?\" He asks sullenly.<br>\r\n<br>\r\nYou think he knows already, but a part of you just wants to kill some time talking while you wait for Trinity. \"So approach her with confidence, man. Talk her up. You've got interests, you're not a boring person. If she's not into you... fine, no more doubt. But if she likes you, then that's your chance to do something together.\"<br>\r\n<br>\r\n\"I'll think about it, Kyle.\" He mumbles, before stubbing out his cigarette with his shoe. He puts his mittened hands in his coat pockets. \"What are you doing out here this morning, anyway?\"<br>\r\n<br>\r\n\"Just killing time before my shift starts.\" You lie, glad to see Harold nod casually as he re-enters the building. You didn't want him there to witness your swap with Trinity.<br>\r\n<br>\r\nSpeaking of which, you finally see her car swing into the parking lot.<br>\r\n<br>\r\nAs Trinity emerges, you gaze over her body in a different light. Sure, you admire her strawberry blonde hair, carefully straightened and thickened as it seems to shine in the early morning sunlight. And sure, you like the way her hourglass figure seems to bounce and wiggle in all the right places as she sashays toward you. Even if her mouthwatering curves are mostly hidden in the gauche uniform you're all required to wear out on the sales floors.<br>\r\n<br>\r\nBut this time you know you'll be inhabiting her form, wearing her body, literally stepping into her shoes. Briefly you wonder if she's looking at you now in the same way.<br>\r\n<br>\r\nEven Emily noticed how long you took to get ready for work this morning. You threw on your best white button-up dress shirt, which you had ironed the night before. You combed your hair and used an extra dollop of hair gel; in addition, you flossed your teeth and rinsed with mouthwash. And for once, Emily was the one banging on the bathroom door waiting for her turn to get ready for university.<br>\r\n<br>\r\nLike cleaning house in anticipation of a guest, you tried to make yourself nice and presentable for Trinity when you switch with her. You regret not going to the gym as often as you could, as you had appraised your own figure in the mirror earlier that morning. But by most accounts you consider yourself in reasonably good shape. Not too thin. Tall and fit enough for a guy your age. Not really possessing the ability to stand apart and judge yourself from someone else's eyes... until yesterday.<br>\r\n<br>\r\nSo you wonder what Trinity must be thinking as she approaches and softly greets you in the alleyway.<br>\r\n<br>\r\n\"Good morning, Kyle.\" She smiles, looking up at you.<br>\r\n<br>\r\nYour heart thumps in your chest. \"Hey Trinity! Glad you could make it. We don't have much time before our shifts begin.\" You point to your wristwatch.<br>\r\n<br>\r\n\"Sorry about being a little late.\" She clasps her hands apologetically.<br>\r\n<br>\r\n\"Don't worry about it.\" You fold your arms. \"So did you convince your friends to come visit you today and leave some positive feedback? You know... to improve your reputation with Miss Melvin?\"<br>\r\n<br>\r\nShe stares at you with a blank expression before finally pounding her hand. \"So <i>that's</i> what I forgot to do! Frick!\" She shows you her index finger, which has a white string tied around it. \"I was racking my brains all morning trying to remember why I had this little thing around my finger. I usually do this when there's something important but I must have misplaced the note I had written when I got home yesterday. Stupid, stupid!\"<br>\r\n<br>\r\nShe shakes her head, and you place your hands on her shoulders. \"Calm down, Trin.\" You order. \"And don't worry! I know a couple of people who plan to come in sometime today to help out.\"<br>\r\n<br>\r\n\"Oh, thank you so much!\" A wave of relief passes over Trinity's face.<br>\r\n<br>\r\n\"So... are you ready to swap?\" You give a sidelong glance in the alley, still finding it empty except for you two.<br>\r\n<br>\r\n\"Yes.\" She bites her lip nervously.<br>\r\n<br>\r\nYou grab onto her hands and stare intensely into her eyes. Her dazzling, baby blue eyes.<br>\r\n<br>\r\n\"Trinity Fushia...\"<br>\r\n<br>\r\nA split second later, the world shifts and tumbles leaving you disoriented. As quickly as it begins it stops. And you find yourself gazing upwards at your old body.<br>\r\n<br>\r\nYou've become Trinity again!<br>\r\n<br>\r\n\"Wow! This is incredible!\" Trinity says, letting go of your hands and using her own to pat herself down. She looks at her new arms, chest, and legs. \"Mmm... you smell nice today.\"<br>\r\n<br>\r\n\"Uh, thanks, it's a new cologne.\" You murmur in Trinity's syrupy voice. Then, feeling obligated to return the favour, you add, \"I like your hair, is this your natural colour?\"<br>\r\n<br>\r\nTrinity giggles, sounding overly effeminate. \"Don't you mean <i>your</i> hair now? And... wow! Your thingy has a mind of its own down here!\"<br>\r\n<br>\r\nShe draws your attention to her trousers, as a noticeable bulge protrudes from her fly. It twitches a little, and you step back awkwardly.<br>\r\n<br>\r\n\"Thanks for sharing,\" You deadpan, \"Now control yourself please! We only have a couple minutes until we have to go inside.\"<br>\r\n<br>\r\n\"Ohmigosh, do boys have to deal with this all the time??\" She lisps in your voice.<br>\r\n<br>\r\n\"Just think about something else... anything else will do.\" You grow frustrated. You're not sure whether Trinity can capably impersonate you for the entire day. She might have handled being you for a few hours yesterday, but someone is bound to notice something weird eventually unless she focuses. Which, it turns out, seems to be a tall order for a scatterbrain like Trinity.<br>\r\n<br>\r\nYou open the back door and head to the employees' office, a shared space with sets of lockers for storing valuables in between shifts. Trinity follows close behind, even though your car keys, wallet, and cell phone fit conveniently in her pockets. <br>\r\n<br>\r\nYou, on the other hand, have to deposit Trinity's purse into a locker. You use her key and swing open Trinity's locker, stuffing her purse inside where it sits along with a few other sundry items (a box of pain relievers, a tube of lip balm, a charging cord, among other things).<br>\r\n<br>\r\nTanya Wessing, a middle-aged woman who works on the Maternity/Baby sales floor which is next to Lingerie, smiles politely at you as you walk on by. She's overweight but has a heart of gold. Her husband passed away several years ago and her adult children have moved out, so she works here mainly for something to do.<br>\r\n<br>\r\nBut you don't feel like talking to her, not yet anyways. Your eyes briefly make contact with Miss Melvin, whose gaze seems to sear into you like a hot iron. But she doesn't say anything, perhaps still thinking Trinity is on thin ice and waiting for just one more complaint to do her in.<br>\r\n<br>\r\nYou're still not going to give her that chance.<br>\r\n<br>\r\nFor a moment you consider swapping into Miss Melvin's body and using her authority as the day shift manager to erase the bad parts from Trinity's employee file. But that would mean putting her into Trinity's body. You're not sure Trinity would like that, and you wouldn't want that bossy woman occupying your own life either. <br>\r\n<br>\r\nBut it's an interesting idea. And it gives you the chance to test whether you can swap with another person while already swapped with someone else. You still don't know much about this amazing power and to what limits, if any, you can use it.<br>\r\n<br>\r\nWhat do you decide to do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1541218140,
            "id":2572230,
            "title":"You switch with Trinity and do each other's..."
        },
        "1312112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "there was a knock on the door.",
                "your boss awoke in Trinity's body"
            ],
            "content":"<div class=\"\"><div> <span>You suddenly found yourself seated and strangely lacking the adrenaline high you'd worked up due to stress in Trinity's body. Not only that but you were looking up at the terrified body you had just been the owner of.<br>\r\n<br>\r\nTrinity's body, meanwhile, was backing up in terror.<br>\r\n<br>\r\n\"What happened?\" asked Trinity's body, \"Who am I?\"<br>\r\n<br>\r\nTrinity's body then looks down at itself and shrieks.<br>\r\n<br>\r\n\"Oh no!\" mutters your boss through Trinity's lips before fainting.<br>\r\n<br>\r\nYou lean forward and peer over your boss' desk at Trinity's body. Leaning back again you find yourself in slight shock. Turning your head you see your Boss' computer is on and logged in. As you stare at it, all the panic you'd been fighting back while trying to help out Trinity came to the surface in the form of tears. You sat there weeping for a few moments before</span></div></div>",
            "created":1287896400,
            "id":980722,
            "title":"Becoming your Boss"
        },
        "13121122":{
            "author_id":"kevinb1",
            "author_name":"kevinb1",
            "choices":[
                "You had the realization",
                "Your boss had the realization"
            ],
            "content":"<div class=\"\"><div> <span>your boss awoke in Trinity's body and when she did one of you two had a realization.<br>\r\n<br>\r\nYou may have realized that this was your chance to give Trinity some revenge on Mrs. Melvin, pretend to be Trinity maybe even tell her you did this to her to let her see how it would be like to have the shoe on the other foot, to be a lingerie salesperson working the floor and having a boss that constantly looks over your shoulder, watches your every move. <br>\r\n<br>\r\nOn the other hand maybe it was Mrs. Melvin that came to the realization that this was great. It was why she was so hard on Trinity, she had a body she'd kill for, a body she watched everyday for hours on the store's security camera, the big breasted blond haired beauty, and now she had it. She'd be the one the customers always ogle, leer at and the other employees sneaking glances at instead of the one being ignored by customers and feared by employees in her smaller skinnier curly haired 45 year old b cup size frame. The one getting the hunks flirting with them in the store dating them, like Mark, god how she wished that so many times watching the cameras, instead of going home to her almost bald headed glasses wearing husband even though he did love her, they had a great relationship with two kids in college, but watching the other men leer and flirt with Trinity she couldn't help but want more, and now she had it.</span></div></div>",
            "created":1324530000,
            "id":1244495,
            "title":"your boss awoke in Trinity's body"
        },
        "131211222":{
            "author_id":"kevinb1",
            "author_name":"kevinb1",
            "choices":[
                "Make a deal, a bet",
                "Pretend to be Trinity"
            ],
            "content":"<div class=\"\"><div> <span>As she stared at her old reflection, her dream finally came true, seeing her old face looking back with that shocked expression was just how she imagined it would be every time she had Trinity alone in her office. Now she just had one issue to deal with walking out of her office as Trinity, but that was a small issue being that she was twice as intelligent as any of these peons, however she did have to decide how she was going to play it. <br>\r\n<br>\r\nShe could just make a bet, a deal one of course she’d win, sealing her fate as Trinity, on the other hand she knew enough about Trinity, her mannerisms, her talk, her style, from studying, watching, observing her each and every day, to just pretend to be her, as if everything is perfectly normal. <br>\r\n<br>\r\nShe decides to...</span></div></div>",
            "created":1332306000,
            "id":1299345,
            "title":"Your boss had the realization"
        },
        "133":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "fainting",
                "ringing through the customer's items",
                "excusing yourself"
            ],
            "content":"<div class=\"\"><div> <span>In the blink of an eye you found yourself standing behind one of the checkout counters, a bottle of shampoo in one hand and the other hand perched on the keypad of the computer. In shock at the sudden change of location you look up at the face of a young woman, holding out her credit card to you. The woman shakes her hand, motioning for you to take her card to swipe it. Still stunned you take the card and turn to the computer. After swiping the card the computer processes the information and then prints out a receipt. Still in shock from your strange arrival behind the checkout counter you hand the card and receipt to the customer. She signs the receipts and hands a copy back to you. She then takes the shampoo you had failed to bag, places it with her other items and walks off.<br>\r\n<br>\r\nYou try to take a moment to figure out what had happened to land you at one of the cashier's stations but are stopped by the next customer stepping forward.<br>\r\n<br>\r\n\"Well,\" ask the customer when you don't move to start scanning their items.<br>\r\n<br>\r\nYou hear a snort come from the next cashier. Looking over at them you see that it is Laura Thomm. You then realize something and look down to confirm it. What you see does not relieve you. Below your neck you see a foreign body. Despite still wearing the store's uniform you could tell you were no longer yourself by the breasts you now sported beneath said uniform. Looking up at the security mirror you see the shocked reflection of Lily Zhang staring back at you. You start to shake a bit as the full extent of your situation sinks in and your new knees weaken slightly.<br>\r\n<br>\r\n\"Ahem,\" affirms the customer, pointing at the items they wish to purchase.<br>\r\n<br>\r\n\"Uh,\" you gasp in Lily's voice before...</span></div></div>",
            "created":1288328400,
            "id":983548,
            "title":"Lily Zhang"
        },
        "1331":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "\"I guess so.\"",
                "\"I don't know.\"",
                "\"What happened?\""
            ],
            "content":"<div class=\"\"><div> <span>Gasping for air you return to consciousness. After opening your eyes you find yourself looking up at the face of Dr. Bilbeau, the family doctor from across the street.<br>\r\n<br>\r\n\"Easy now,\" he says to you, helping you to a seated position.<br>\r\n<br>\r\nAt first thinking that you'd just imagined being in Lily's body you thank his help only to discover your mistake when you look down at your female body. Running Lily's fingers through your hair you look back up at the security mirror and see your unwelcome reflection again.<br>\r\n<br>\r\n\"Are you feeling alright now?\" asks the Doctor, taking your wrist and checking your pulse.<br>\r\n<br>\r\nYou reply...</span></div></div>",
            "created":1288328400,
            "id":983552,
            "title":"fainting in Lily's Body"
        },
        "1333":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Electronics section where Lily waits in your body",
                "Public restrooms",
                "Staff locker room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Excuse me for a moment,\" you uneasily murmur to the customer before quickly walking away from Lily's cash register.<br>\r\n<br>\r\nAfter a short distance you come to the...</span></div></span></div>",
            "created":1288328400,
            "id":983554,
            "title":"excusing yourself"
        },
        "13331":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "All the customers but one have changed checkouts",
                "Your lineup is longer than ever"
            ],
            "content":"<div class=\"\"><div> <span>\"And just what do you think you're doing?\" demands Lily as you approach.<br>\r\n<br>\r\n\"But... I...\" you stammer back in Lily's voice.<br>\r\n<br>\r\n\"Get back to work Kyle. If you need time to freak out, do it in twenty minutes when my shift ends!\" retorts Lily.<br>\r\n<br>\r\n\"But I'm you! And... and... and you're a girl! And... I...\" you reply incoherently.<br>\r\n<br>\r\n\"Not right now you aren't!\" snaps Lily through your voice, \"Now get back to work at my checkout before anyone starts to wonder what's up!\"<br>\r\n<br>\r\n\"But...\"<br>\r\n<br>\r\nLily grabs you by your shoulders, squeezing her old arms with your old hands and whispers, \"Listen, I know you are freaking out a bit right now but I really need you to go back to work. In twenty minutes when my shift is done you can come over here and we can figure out what to do. In the meantime I'll do your job and you do mine. That is all I'm asking. Is that alright with you?\"<br>\r\n<br>\r\n\"I guess,\" you whisper back.<br>\r\n<br>\r\nLily then releases you and you go back to her checkout, rubbing your new arms where she had grabbed you.</span></div></div>",
            "created":1288414800,
            "id":983713,
            "title":"Electronics section where Lily waits in your body"
        },
        "133311":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Lily's shift is over so you are free to go",
                "He tries to ask you out on a date"
            ],
            "content":"<div class=\"\"><div> <span>\"Nice of you to return,\" says the customer sarcastically, \"Now can we please get on with this?\"<br>\r\n<br>\r\n\"Sure, sorry...\" you apologize, still not comfortable with hearing Lily's voice to your words.<br>\r\n<br>\r\nAs you start scanning the items you see that a line has reformed at your till. You start to work faster when you see the other cashiers rapidly working through their lines. Bagging the last of the first customer's items you ring up the total and they pay you in cash with a pair of 100$ bills. Popping open the cash drawer you figure out the change for the customer and hand it to them. Then the next customer steps up and you ring through their items, still aware that you are moving far slower than Lily's usual service.<br>\r\n<br>\r\nThe following customer you try to speed it up a bit but make a few mistakes, causing extra delay as you attempt to correct them. You then return to your previous speed and work slowly through the rest of the customers, aware that you were currently the slowest cashier of the lot. Finally the lineup dries up and you are left with no customers. Leaning back against the counter you sigh, letting Lily's shoulders drop. After a few moments you shake your head and look up to see another customer waiting. After ringing through his order...</span></div></div>",
            "created":1288414800,
            "id":983716,
            "title":"All the customers but one have changed checkouts"
        },
        "1333111":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "your new bladder demands emptying",
                "Someone comes up to you"
            ],
            "content":"<div class=\"\"><div> <span>Noticing the time you turn your till to closed and are about to leave when you remember that cashiers need to count up at the end of their shifts. Turning back to the till you pop open the money drawer and stumble through counting, thankful for the list of cash purchases Lily had kept beside the till. Finally you were done Lily's responsibilities and locked up the till. After taking a few steps towards electronics where Lily was waiting in your body...</span></div></div>",
            "created":1288414800,
            "id":983717,
            "title":"Lily's shift is over so you are free to go"
        },
        "13331112":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Insist you need to go do something first",
                "Go with the girl"
            ],
            "content":"<div class=\"\"><div> <span>\"So, is your shift done?\" asks a girl from behind you.<br>\r\n<br>\r\nTurning around in shock you see a girl that had often shown up at the store near the end of Lily's shifts. You did not know her name as she never spoke with any of the other employees aside from Lily.<br>\r\n<br>\r\n\"Yeah,\" you reply, uneasily.<br>\r\n<br>\r\n\"Well then come on! Let's blow this joint!\" exclaims the girl.</span></div></div>",
            "created":1288414800,
            "id":983723,
            "title":"Someone comes up to you"
        },
        "133311122":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "ask the girl some questions",
                "start changing"
            ],
            "content":"<div class=\"\"><div> <span>As you follow the girl out of the store you begin to worry slightly. You knew little to nothing about Lily and her life outside the store. Nevermind the fact that you knew little to nothing about her in the store either. And with every step you were farther away from the only person capable of clearing things up for you.<br>\r\n<br>\r\n\"So, do you want to drive or should I?\" asked the girl, holding up the keys to a new BMW.<br>\r\n<br>\r\n\"You.. you drive!\" you reply, knowing full well that not knowing where to go would bring up too many questions if you drove.<br>\r\n<br>\r\n\"Good idea! After all, you still need to change!\" replies the girl, unlocking the car using the remote, \"Your change of clothes are in the back seat!\" She then opens the back door for you and motions for you to get in.<br>\r\n<br>\r\nYou hop into the car and in moments are pulling out of the parking lot and onto the street.<br>\r\n<br>\r\n\"Well, Get a move on! You've only got 15 minutes to change Lil!\" remarks the girl, speeding up to match traffic.<br>\r\n<br>\r\nLooking nervously across the car at a duffel bag you...</span></div></div>",
            "created":1288414800,
            "id":983725,
            "title":"Go with the girl"
        },
        "1333111222":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Sports Bra, T-shirt, shorts and running shoes",
                "Formal satin blouse and skirt with matching pair of heels"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pulling the bag over to your side of the car, you open it and discover it contains...</span></div></span></div>",
            "created":1288414800,
            "id":983726,
            "title":"start changing"
        },
        "13331112222":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "At a park, where they are holding a wedding",
                "At an office building"
            ],
            "content":"<div class=\"\"><div> <span>Pausing for a moment you pray that this is all nothing more than a very strange dream. As the car goes over a bump you bang Lily's head and realize, thanks to the pain, that this is very much real. You then reach up and start unbuttoning Lily's work shirt, nervous about the violation of her privacy you were forced to commit.<br>\r\n<br>\r\nOne the shirt was unbuttoned and off you force your eyes to look down, a tough moment for your conscious. What you find is a white bra clasp around Lily's tanned breasts. Feeling a bit more comfortable about things now, you slip into the blouse and then start to work on changing Lily's pants for the skirt. You soon find yourself dressed in the blouse, skirt and heels, oddly finding yourself more comfortable with your new body. You conclude that this comfort is likely due to the fact that you'd already been in Lily's body for a while and that once you had stripped off her clothes it was easier to see the bare body parts below you as your own, despite their foreign forms. Even though you were now a bit more at ease, you still were uncomfortable with your strange and unexplained adoption of Lily's body just half an hour before.<br>\r\n<br>\r\nThe car pulls into a parking lot and stops. The driver then turns around and gestures for you to lean towards her. You do and she applies some lipstick and a light dusting of makeup from her purse. She then gets out of the car. When you join her outside you see that you were now...</span></div></div>",
            "created":1288414800,
            "id":983732,
            "title":"Formal satin blouse and skirt with matching pai..."
        },
        "13332":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Go for the last stall",
                "Go to the mirror"
            ],
            "content":"<div class=\"\"><div> <span>Walking up to the door to the mens room you pause just before entering. Looking down the hall at one of the many security mirror you see your new reflection, complete with long, silky hair held up by a hair clip. Stepping back you turn on your heel, nearly losing your balance in the process, and enter to women's restroom. As you take the first step through the door you see that all the stalls are full, save the handicapped stall, and a pair of teenagers gossiping while examining their reflections in the mirror.<br>\r\n<br>\r\nGoing the rest of the way inside you...</span></div></div>",
            "created":1288328400,
            "id":983557,
            "title":"Public restrooms"
        },
        "133321":{
            "author_id":"mystarfleet",
            "author_name":"Federation",
            "choices":[
                "Lily (you) are paged to come to the checkouts",
                "Lily (in your body) storms into the restroom"
            ],
            "content":"<div class=\"\"><div> <span>Strutting over into the last remaining stall you close an lock the door behind you. At last having some level of privacy you let your panic surface, clutching your hands tightly together and against your new bosom. Blinking away tears you wrack your brain for how you could have wound up in Lily's body. As your panic starts to make you shake you grab tight hold on the door and bight your lip, tasting Lily's lip gloss with your tongue.<br>\r\n<br>\r\nIt only takes a few moments to gather yourself together again and you release the door and back against the wall, ready to try some rational thought. Just as you are about to recommence your pondering...</span></div></div>",
            "created":1288328400,
            "id":983560,
            "title":"Final call for the stall"
        }
    },
    "info":{
        "author_id":"mystarfleet",
        "author_name":"Federation",
        "brief_description":"Kyle Blunt is bored and gains the power to swap bodies by saying peoples names.",
        "created":1280447580,
        "description":"<td align=\"left\" class=\"norm\">Your name is Kyle Blunt and you were bored. You were at work and finding it excessively dull as always when you suddenly gain the power to swap bodies with anyone simply by focussing on them while saying their name.<br>\r\n<br>\r\nBasic rules:<br>\r\n-use good grammar<br>\r\n-no personality changes<br>\r\n<br>\r\nPlease add chapters and have fun!</td>",
        "id":1694528,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1581373080,
        "modified":1581373080,
        "pretty_title":"Say a name and swap away"
    }
}