{
    "chapters":{
        "1":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Yugi Muto",
                "Jaden Yuki",
                "Yusei Fudo",
                "Yuma Tsukumo",
                "Another Hero"
            ],
            "content":"<div class=\"\"><div> <span>A magical deck of Duel Monsters cards finds it's way into the world, and a lucky hero stumbles onto it!  Cards with varying effects, which don't seem to work for the game itself, but rather alter the woman the user targets.<br>\r\n<br>\r\nThe cards in question are...<br>\r\n<br>\r\nTotal Control - Places the subject into a blank trance. The subject then mindlessly follows any commands given<br>\r\n<br>\r\nBody Control - The subject enters a trance but remains conscious. Their body obeys all commands despite their mind's struggles<br>\r\n<br>\r\nCompliant Control - The subject retains her personality, and willingly does anything the user of the card demands<br>\r\n<br>\r\nAware Trigger - The subject is given a trigger phrase that, when said, causes them to take a specific action tied to the phrase. However they will be aware that they are doing it<br>\r\n<br>\r\nUnaware Trigger - The subject is given  a trigger phrase that, when said, causes them to take a specific action tied to the phrase. They will not realize they are doing it, nor will they remember doing it<br>\r\n<br>\r\nReprogram - Changes the subject’s personality into another the user specifies<br>\r\n<br>\r\nModify - Changes a person’s appearance to match the current effect.  Reprogramming a girl to be a maid, for example, would give her a maid uniform. Changing her attire while instructed to clean would do the same, but change her clothing back once the task was completed or changed.<br>\r\n<br>\r\nIQ Up - Raises the IQ of the target<br>\r\n<br>\r\nIQ Down - Lowers the IQ of the target<br>\r\n<br>\r\nWorld Changer - Allows the user to make a large scale change to the world. However it can only be done once.  (Changes include making the user into a wealthy businessman, making all girls have to obey all guys, etc)<br>\r\n<br>\r\nWith this deck here, and the world full of lovely ladies ready for some controlling, the only thing left to wonder is… who finds the deck?<br>\r\n</span></div></div>",
            "created":1563241440,
            "id":2687352,
            "title":"The Cards Arrive"
        },
        "11":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Use the World Card to make a big change",
                "Invite Tea over so he can test the cards",
                "Invite Mai over so he can test the cards",
                "Invite Ishizu over so he can test the cards",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Yugi Muto, the champion of the Duelist Kingdom and Battle City tournaments, and left alone without the Pharaoh as his guide, found himself a little lost.  <br>\r\n<br>\r\nThere were very few worthy opponents to face anymore, and without his Millennium Puzzle and the Pharaoh he was, frankly, bored.<br>\r\n<br>\r\nAs he entered the lobby of his Grandfather's card shop he saw something strange sitting on the counter, something unusual, a stack of unprotected, unpackaged cards.<br>\r\n<br>\r\n\"Grandpa! Grandpa are you okay?\" he called out, but he was met with no reply.  <br>\r\n<br>\r\nAs he walked to the counter he saw a note...<br>\r\n<br>\r\n\"Stepped out for lunch, Yugi! Please keep the shop safe\" was all it said.<br>\r\n<br>\r\nWith curiosity and desire to keep his Grandpa's business afloat, Yugi grabbed the cards from the counter to put them away but... they caught his attention. He began to skim through them and was, frankly, unfamiliar with every one of the cards here. And the language of the card effects were even more confusing to him. <br>\r\n<br>\r\nAs he reached the final card, one called \"The world\", a series of memories flooded into his head.<br>\r\n<br>\r\nThese cards... had the power to influence the women around him or, in one case, the very world itself. <br>\r\n<br>\r\nYugi smiled to himself, THIS was the chance he needed to finally start having some fun again!  So he decided to...</span></div></div>",
            "created":1563241980,
            "id":2687353,
            "title":"Yugi Muto"
        },
        "111":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Option 1: Card Summoner",
                "Option 2: Yugi; the Businessman",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Yugi, deciding to go big, clutched the World card in his hands and decided to make a major change to the world. He closed his eyes and grinned as he made his modification which was...<br>\r\n<br>\r\nOption 1: Yugi can bring Duel Monster cards into the real world<br>\r\n<br>\r\nOption 2: Yugi is a world famous businessman looking to hire some lovely young ladies to work for him</span></div></div>",
            "created":1563242400,
            "id":2687354,
            "title":"Use the World Card to make a big change"
        },
        "113":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "One of the control cards (RC which)",
                "One of the Trigger cards (RC which)",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Yugi decided that it may be fun to test these new cards out on Mai Valentine, the busty blonde who had been Joey's rival for some time.<br>\r\n<br>\r\nHe knew it wouldn't be hard to get her to show up, so he gave her a call<br>\r\n<br>\r\n\"Hey, Mai?\"<br>\r\n<br>\r\n\"Yugi? What do you want?\" Mai said with some surprise<br>\r\n<br>\r\n\"Grandpa got a new shipment in of some really cool cards, and a lot of them seem to fit your deck's theme. I figured you'd want to check them out!\" he lied<br>\r\n<br>\r\n\"That's... wow that's considerate Yugi. I'll be right over\" she added with genuine astonishment.<br>\r\n<br>\r\nYugi smiled to himself, plotting as he waited for Mai to arrive.<br>\r\n<br>\r\nAfter about a half an hour, Mai entered the shop.<br>\r\n<br>\r\n\"Hey Yugi. So, where are these cards?\" she said with a smile, giving Yugi a flirty wink.<br>\r\n<br>\r\nYugi went behind the counter and grabbed the cards, before showing her...</span></div></div>",
            "created":1563259320,
            "id":2687486,
            "title":"Invite Mai over so he can test the cards"
        },
        "12":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Used the World card for a major change",
                "Went to find Alexis and use the cards on her",
                "Went to find Jasmine and use the cards on her",
                "Went to find Mindy and use the cards on her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jaden stumbled out of the Slifer Red dorm and yawned, ready to start his day.<br>\r\n<br>\r\nHaving dealt with the Shadow Riders and the Society of Light, Jaden was finding his days becoming dull. Class after class, night after night, and nobody really left around his dorms he called a friend.<br>\r\n<br>\r\nSyrus had moved up. Bastion was still on another part of the island. Chazz wanted nothing to do with him. And Alexis was, more often than not, hanging with the other girls.<br>\r\n<br>\r\nBut then... he saw something. Looking towards the shoreline he saw some cards washed up on the beach<br>\r\n<br>\r\n\"Ah! No way!\" he boomed before sprinting down to the sand and quickly scooping up the cards, taking them back to his dorm and looking them over.<br>\r\n<br>\r\nThese cards were... strange. Unlike anything he had seen before. And frankly they were confusing to him. However as he skimmed over the final card in the stack a revelation came to him. Suddenly he knew... these cards could control not the tide of battle; but other people. Specifically women. And the World card could make major changes to the world itself.<br>\r\n<br>\r\nFinally looking to, and able to, have some fun, Jaden....</span></div></div>",
            "created":1563242820,
            "id":2687356,
            "title":"Jaden Yuki"
        },
        "121":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Option 1: Headmaster Yuki at Duel Academy",
                "Option 2: Girls as Assistants",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jaden had decided that a big change may be the best option for him.  Many ideas came rushing through his mind, but finally he settled on...<br>\r\n<br>\r\nOption 1: Jaden becomes the Headmaster of Duel Academy<br>\r\n<br>\r\nOption 2: Jaden makes it so women at Duel Academy were paired up with a male student, and were expected to be their personal assistants</span></div></div>",
            "created":1563243300,
            "id":2687358,
            "title":"Used the World card for a major change"
        },
        "122":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "One of the control cards (RC which)",
                "One of the trigger cards (RC which)",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jaden knew his best option was probably to go after Alexis. She'd be the most fun for him, and with how she'd been so distant recently it'd be a good way to get a little bit of playful payback.<br>\r\n<br>\r\nHe searched the island for her, checking first the Obelisk Girls' dorm but finding no sign of her, then the main school building, before finally making his way to the hot springs.<br>\r\n<br>\r\nAs he entered he saw Alexis sitting in the water, clad in a blue bikini, laying back in relaxation.<br>\r\n<br>\r\n\"Oh. Hey Lex!\" he boomed, acting as though this meeting was coincidental<br>\r\n<br>\r\n\"Jaden?\" she inquired \"What are you doing here?\"<br>\r\n<br>\r\n\"Well I just got a new deck sorted out and figured I'd come here to relax!\"<br>\r\n<br>\r\nAlexis sat a moment, looking down into the water as Jaden took off his jacket, acting like he intended to get into the water<br>\r\n<br>\r\n\"Did... you happen to bring the deck with you? I'd love to see it. Just in case I end up playing against you\" she said with a sly smile.<br>\r\n<br>\r\n\"Oh I did! Let me show you the star attraction!\" he snickered as he reached into his deck box which hung on his belt and pulled out a card, which was...</span></div></div>",
            "created":1563259620,
            "id":2687488,
            "title":"Went to find Alexis and use the cards on her"
        },
        "1221":{
            "author_id":"cdani4213",
            "author_name":"cdani21",
            "choices":[
                "A sexy command!",
                "A funny command!",
                "Something else,or does he has another card?"
            ],
            "content":"<div class=\"\"><div> <span>The Total Control Card! He showed it to Alexis,and her eyes went blank and she stood at attention.<br>\r\nJaden smiled. It worked! Alexis was under his control. At least,he thought so. But first he had to test it.<br>\r\n \"Alexis,\" he said. \"Uh,act like a chicken!\"<br>\r\n \" Yes,Mater, \"she said,folding in her arms and strutting around.<br>\r\n\" BWAAAK! BUK-BUK-BUK!BU-GAWK! \"she hollered,now totally convinced she was a chicken.<br>\r\nJaden grinned. It did work!<br>\r\nWhat to do with Alexis now?</span></div></div>",
            "created":1582944840,
            "id":2794571,
            "title":"One of the control cards (RC which)"
        },
        "12211":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "option 1",
                "option 2",
                "option 3"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright then... Alexis take off your skirt and panties, and start twerking.\"<br>\r\n<br>\r\nAlexis pulled down her panties and skirt, and like Jaden told her she started twerking her butt. Jaden was liking this. He wondered what to do next.<br>\r\n<br>\r\n<br>\r\noption 1: he continues with the total control<br>\r\noption 2: he tries another card(RC on what)<br>\r\noption 3: he decides to expand his power</span></div></div>",
            "created":1582951740,
            "id":2794599,
            "title":"A sexy command!"
        },
        "122111":{
            "author_id":"cdani4213",
            "author_name":"cdani21",
            "choices":[
                "Program her with a trigger card(RC which)",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jaden,wanting to know exactly how far he could take this,decided to give Alexis a command and would never do on her own. He pulled down his pants and revealed his prominent boner.<br>\r\n \"Okay,Alexis,\" he said with a sly grin. \"Give me a blowjob.\"<br>\r\n Alexis got on her knees and began to suck Jaden's dick. Jaden was in total bliss as the pleasure continued. Eventually,he was ready to cum.<br>\r\n \"Alexis,I'm going to cum on your face,\" he said. \"I want you to leave it on all day today,even when I awaken you from this trance.\"<br>\r\n He then shot his load onto Alexis's face,coating it in white.<br>\r\nWhat does Jaden do next?</span></div></div>",
            "created":1582980180,
            "id":2794693,
            "title":"option 1"
        },
        "13":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Used the World card to make a major change",
                "Called Akiza over to test the cards",
                "Called Luna over to test the cards",
                "Called Sherri over to test the cards",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Yusei Fudo, after defeating the Dark Signers and dealing with many, MANY tournaments, found himself in his apartment, just milling around.<br>\r\n<br>\r\nHe knew that it was unlikely to stay boring forever, but for now he had very little to do outside of working on his bike and trying out some new duel strategies.<br>\r\n<br>\r\nAs he made himself some tea and prepped to sit down for some work, an envelope slipped into the door of his place. He gave it a curious look before moving over to it. He didn't remember ordering anything...<br>\r\n<br>\r\nHe opened the envelope and found some cards within. After scrolling through them, he realized they weren't any ordinary cards. These cards had an effect on the real world, not the playing field of Duel Monsters. <br>\r\n<br>\r\nA wave of strange mischievousness overtook him as he decided to use these cards for his own entertainment.  As such he...</span></div></div>",
            "created":1563244260,
            "id":2687364,
            "title":"Yusei Fudo"
        },
        "131":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Option 1: The Racer's Harem",
                "Option 2: Revved Up Racers Restaurant ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Yusei decided that it was best to take his chances and use the biggest, most potent card available first, and grabbed the world card.<br>\r\n<br>\r\nHe expended its power by...<br>\r\n<br>\r\nOption 1: Creating a Racer Harem for successful Duelists. Any Duelist with a successful dueling career in the races would be granted a Harem<br>\r\n<br>\r\nOption 2: Made himself the head of an adult restaurant that employed women to serve there.</span></div></div>",
            "created":1563244500,
            "id":2687365,
            "title":"Used the World card to make a major change"
        },
        "1311":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Yusei decides to talk to his new harem",
                "Yusei decides  to duel each girl to see have good they where",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Yusei decided he wanted a harem, but not just a normal harem. Yusei wasn't the kind of guy who just sat around with several scantily clad women, serving him. No, he his dream harem was one full of female turbo duelists. As he thought about it he got an idea, every top turbo duelist should get a harem. Then the card started glowing and the released a bright flash of light. <br>\r\n<br>\r\nYusei covered his eyes, luckily the flashed end in seconds. He blinked, what just happen he thought, then suddenly his phone rang. Yusei hurry up and answered it.<br>\r\n<br>\r\n\" Hello ?\" Answered Yusei, curious as to who was calling him.<br>\r\n<br>\r\n\" Is this Mr. Yusei Fudo ?\" Asked a female voice. Yusei said yes.<br>\r\n<br>\r\n\" Good, my name is Jessica. I'm from the Turbo Duelists Harem organization. I'm here to inform you that your lastest victory had qualified for a Turbo Harem.\" Said the female voice, Yusei blushed.<br>\r\n<br>\r\nIt worked he thought, he smiled, he wonder who would be in his harem.<br>\r\n<br>\r\n\" You can pick them up, at eight A.M. tomorrow morning.\" Said The female voice, then she told the address to pick them up.<br>\r\n<br>\r\nYusei could barely get to sleep that night, he couldn't stop thinking about what he would do with his harem.<br>\r\n<br>\r\nThe next morning, Yusei woke up and got ready. He made it to the address right on time. He entered the building, since he was the first person to show up. He was told to go to room one, the five girls who will make up his turbo harem where waiting for him.<br>\r\n<br>\r\nYusei made his way to room one, he was still wondering who was going to be in his harem. He reach room one, he took a deep breath and open the door.<br>\r\n<br>\r\nSeating on couches where five women, all wearing a skin tight leather catsuit, each a different color. <br>\r\n<br>\r\nYusei smiled, the five girls in the room. Where the ones he always wanted.<br>\r\n<br>\r\nFirst was Akiza Izinski, she was wearing a red and black catsuit.<br>\r\n<br>\r\nNext was Sherry LeBlanc, she was wearing a white and black catsuit.<br>\r\n<br>\r\nThen there was Carly Nagise, she was wearing a black and orange catsuit.<br>\r\n<br>\r\nThen was Misty Tredwell wearing a blue and green catsuit.<br>\r\n<br>\r\nLastly was Setsuko Izinski, Akiza's mother. This stunned Yusei, he didn't think Setsuko was a duelist, but she was a MILF. She was wearing a black and red catsuit.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1564206360,
            "id":2692926,
            "title":" The Racer's Harem"
        },
        "14":{
            "author_id":"mindcollector",
            "author_name":"Mindcollector",
            "choices":[
                "Used the World card for a major change",
                "Called Tori over to test the cards on her",
                "Found his sister Kari and used the cards on her",
                "Found his mother Mira and used the cards on her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>With the world saved yet again, and Astral gone, Yuma found himself back home. Weeks went by and nothing of interest really happened. For the first time in a long time life seemed almost normal and Yuma didn't know what to do with himself. <br>\r\n<br>\r\nBut suddenly something happened. A flash of light blinded Yuma briefly and as it faded a small stack of cards appeared before him. He began to scan them, curious about what this could all be about.<br>\r\n<br>\r\nAs he finished looking over the cards, he realized they were unlike anything he had seen before and had a strange feeling that perhaps they weren't intended to work in game, but rather in the real world.<br>\r\n<br>\r\nWhatever it was, something deigned to give these cards to him, and he wasn't going to let the opportunity go to waste!<br>\r\n<br>\r\nAs such Yuma...</span></div></div>",
            "created":1563247680,
            "id":2687393,
            "title":"Yuma Tsukumo"
        },
        "15":{
            "author_id":"starfighter364",
            "author_name":"Starfighter364",
            "choices":[
                "Yuya Sakaki",
                "Yusaku Fujiki",
                "Atem (I'm surprised this wasn't on here before)",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which hero?</span></div></span></div>",
            "created":1564960320,
            "id":2697193,
            "title":"Another Hero"
        }
    },
    "info":{
        "author_id":"mindcollector",
        "author_name":"Mindcollector",
        "brief_description":"The Heroes of Yu-Gi-Oh stumble on a very special deck which controls the minds of women!",
        "created":1563241320,
        "description":"<td align=\"left\" class=\"norm\">My fifth Hypnosis-Based story. This time in Yu-Gi-Oh! Please check out my other stories (And yes, I plan to make more!)<br>\r\n<br>\r\nRWBY: <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://www.writing.com/main/interact/item_id/2168279-Hypnotic-Adventures-in-RWB...\" target=\"_blank\">https://www.writing.com/main/interact/item_id/2168279-Hypnotic-Adventures-in-RWB...</a><br>\r\nDragonball: <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://www.writing.com/main/interact/item_id/2169849-Dragonball-Yamchas-Hypnoti...\" target=\"_blank\">https://www.writing.com/main/interact/item_id/2169849-Dragonball-Yamchas-Hypnoti...</a><br>\r\nMy Hero Academia: <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://www.writing.com/main/interact/item_id/2194167-My-Hypno-Academia\" target=\"_blank\">https://www.writing.com/main/interact/item_id/2194167-My-Hypno-Academia</a><br>\r\nPokemon: <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://www.writing.com/main/interact/item_id/2168408-Ash-and-the-Hypnos-Pendant\" target=\"_blank\">https://www.writing.com/main/interact/item_id/2168408-Ash-and-the-Hypnos-Pendant...</a><br>\r\n<br>\r\nRules:<br>\r\n- No Death, Gore, BDSM, Vore, Scat, peeing, Malesub, M/M or Pregnancy.<br>\r\n- Always leave a \"something else\" option.<br>\r\n- Please refrain from using small chapters UNLESS it's a choice chapter.<br>\r\n- Don't end a story-line unless there is a VERY good reason<br>\r\n<br>\r\nI may add more rules later if I think of them but for now... have fun! Feel free to add! Additions are more than welcome!</td>",
        "id":2195819,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582980180,
        "modified":1582980180,
        "pretty_title":"Yu-Gi-Oh! Cards of Control!"
    }
}