{
    "chapters":{
        "1":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "A Child (5-12)",
                "A Teen (13-19)",
                "A Young Adult (20-39)",
                "Middle-Aged (40-64)",
                "A Senior Citizen (65+)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's begin. Which age group will you begin with?</span></div></span></div>",
            "created":1340427600,
            "id":1365650,
            "title":"Beginning"
        },
        "11":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Begin",
                "Begin",
                "Begin",
                "Begin",
                "More beginnings"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your exact age and animal species is up to you.</span></div></span></div>",
            "created":1340427600,
            "id":1365666,
            "title":"A Child (5-12)"
        },
        "111":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Salty Dog.",
                "Max the Dog.",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>Okay here's some 5-12 year old fat furry creatures you can choose from.<br>\r\n<br>\r\n1. Salty Dog is a 5 year old male anthropomorphic 1500 LBS dog who loves to surf near blubber belly island, and constantly eats each day growing bigger and fatter on the island itself.<br>\r\n<br>\r\n2. Max the dog from the Grinch who Grinches the cat in the hat cartoon is also a 5 year old anthropomorphic 1500 LBS dog who of course loves to eat and dreams of being the island's biggest creature ever seen.<br>\r\n</span></div></div>",
            "created":1401685200,
            "id":1806361,
            "title":"Begin"
        },
        "12":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Begin",
                "Begin",
                "Begin",
                "Begin",
                "More beginnings"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your exact age and animal species is up to you.</span></div></span></div>",
            "created":1340427600,
            "id":1365663,
            "title":"A Teen (13-19)"
        },
        "121":{
            "author_id":"vault-dweller",
            "author_name":"Demon-Lord-Raiju",
            "choices":[
                "yes",
                "No.",
                "other no"
            ],
            "content":"<div class=\"\"><div> <span>Sarah is a 19 year old Fox girl, with pure black fur and dark blue eyes. weighing in at roughly 120 pounds. she has a pretty average figure.<br>\r\nshe likes to read, write and play video games, and by a bizarre coincidence, she won an all expense paid trip to the island of Adiposia.<br>\r\n<br>\r\ndo you pick her.?</span></div></div>",
            "created":1360731600,
            "id":1531380,
            "title":"Sarah the vixen."
        },
        "1212":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Sarah, the growing queen",
                "Megan, the secret hunter",
                "Someone else on the island"
            ],
            "content":"<div class=\"\"><div> <span>How about these?<br>\r\n<br>\r\nSarah is an eighteen year old dragon-wolf hybrid, a drawolf. She weighs six hundred and six pounds and stands six foot four inches tall. Despite her age and only arriving on the island less than a year ago, she has been able to become queen of a decent sized territory, but she is still looking into expanding.<br>\r\n<br>\r\nMegan is a seventeen year old Clydesdale weighing three hundred and four pounds, standing seven feet and one inch tall. Very muscular with a plus covering, she willingly journeyed to the island only a few days ago and has so far avoided drawing too much attention to herself. How long will this last with her knowing the location of a great secret on the island though?</span></div></div>",
            "created":1475816400,
            "id":2220304,
            "title":"More female anthro teenagers"
        },
        "122":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "The boat",
                "The island"
            ],
            "content":"<div class=\"\"><div> <span>You are Dakota, an 18 year old chubby 250lbs male fox of average height  with shaggy brown hair to accompany his orange fur, and with most of the weight accumulating in his butt, hips, and thighs. Dakota is lazy and quite voracious, regularly going to buffets and stuffing himself silly, he also enjoys video games and other sedentary hobbies. He was hurting for money one day and entered an eating contest hoping that there would be a cash prize, but it turns out the prize was for a ticket to an island resort. Even though he didn't win any money, Dakota decided it couldn't hurt to go on a trip so he boarded the ship the next day...little does he know, his life will change forever. <br>\r\nWe begin the story on...</span></div></div>",
            "created":1460350800,
            "id":2131560,
            "title":"Dakota the Fox"
        },
        "1222":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "A maid",
                "The owner of the resort"
            ],
            "content":"<div class=\"\"><div> <span>After about a week at sea, the boat finally arrives at the island resort and with a rather plump fox on board. This fox is Dakota, a chubby fox with bright green eyes and shaggy brown hair. Dakota weighs at least 250lbs and has a slight double chin developing, he also has a pudgy stomach that spills slightly over his underpants and also has a set of small, soft moobs...however that pales in comparison to his lower region. His chunky bubble butt is his largest feature, with it jiggling with each step he takes. His butt is also accompanied by wide hips and thunder thighs. <br>\r\n<br>\r\nAs Cody's ship docks, he can't help himself to just look out his window and marvel at the beauty of this island <br>\r\n<br>\r\n\"Wow! This place looks amazing.\"Cody said admiring the white beach and colorful flora.<br>\r\n<br>\r\nHello? Is this the winner of our eating competition.\" A voice spoke from behind his door.<br>\r\n<br>\r\n\"Huh...oh yeah! Yep that's me, Dakota Fox.\"<br>\r\n<br>\r\n\"Oh wonderful! If you let me in I can take your bags and show you to your room.\"<br>\r\n<br>\r\n\"Uh hold in let me get dressed.\"<br>\r\n<br>\r\nDakota's clothing isn't anything special, consisting of a blue t-shirt and some khaki shorts. His shirt fits normally, only being kind of snug around his belly, and his shorts are tight around his butt and hips, giving them a nice shape. After putting on his clothes, Dakota opened the door to find...<br>\r\n</span></div></div>",
            "created":1461128400,
            "id":2136309,
            "title":"The island"
        },
        "12221":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Normal room",
                "Penthouse suite"
            ],
            "content":"<div class=\"\"><div> <span>Dakota opens the door to find a beautiful cat dressed in a French maid outfit. She has tan fur with a white muzzle, she also has long brunette hair and stunning yellow eyes. After what seems like forever, Dakota manages to tear his eyes away from her beautiful face long enough to get a good look at her body. She's rather plump, with large breasts, wide hips, a bubble butt to match her bust, and a small belly. Her outfit also seems a size too small as it hugs her body tightly.<br>\r\n<br>\r\n\"Wow...\"<br>\r\n<br>\r\n\"Heh heh, thanks. I'm Catherine, your maid.\"<br>\r\n<br>\r\n\"Wait... I have a maid?\"<br>\r\n<br>\r\n\"Yes, you won my service along with the trip to our resort. Shall I take you bags?\" <br>\r\n<br>\r\n\"Yeah...sure.\" Dakota said with a sheepish smile.<br>\r\n<br>\r\n\"Thank you, Dakota.\"<br>\r\n<br>\r\n\"Wait, how do you know my name?\"<br>\r\n<br>\r\n\"Well, I'm paid to know everything about you.\"<br>\r\n<br>\r\n\"So you know everything about me?\"<br>\r\n<br>\r\n\"Yes. You like video games and lazing about, you're a glutton who loves to eat, and you like bigger women. Is that everything?\" Catherine said in mocking tone.<br>\r\n<br>\r\n\"Y...yeah that's me...\" Dakota said in embarrassment.<br>\r\n<br>\r\n\"Great, know lets get you to where you'll be staying.\" Catherine said as she took Dakota bag.<br>\r\n<br>\r\n-------------------------------------<br>\r\n<br>\r\nAfter an hour Catherine finally got Dakota to the resort.<br>\r\n<br>\r\n\"Wow this place is amazing! It's so big.\"<br>\r\n<br>\r\n\"Yep it's pretty cool isn't it. Know lets get you to your room.\"<br>\r\n<br>\r\nDakota and Catherine them head inside to get Dakota to his room.<br>\r\n<br>\r\nAs they start heading towards one of the elevators, Dakota notices something odd with the people here.<br>\r\n<br>\r\n\"Hey Catherine why is everyone overweight?\"<br>\r\n<br>\r\n\"This is just a resort that larger people like. I thought you would know that coming here.\"<br>\r\n<br>\r\n\"I'm not that big!\" Dakota said defensively.<br>\r\n<br>\r\n\"Oh...well I guess you weigh less than you look.\"Catherine said sarcastically.<br>\r\n<br>\r\nDakota's face turned bright red after Catherine's remark, and he stayed silent through the elevator ride to his room. The silence is then broken by the elevators buzzing.<br>\r\n<br>\r\n\"Alright Dakota, here we are at your...</span></div></div>",
            "created":1462683600,
            "id":2144879,
            "title":"Catherine"
        },
        "123":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "I'm just leaving towards the docks",
                "I'm on the ship to Blubber Belly Island",
                "Just Arrived At Immigration-&-Customs On Blubber Belly Island "
            ],
            "content":"<div class=\"\"><div> <span>Hi, my name is Damien Silvermane, I’m an 18-year-old wolf anthro. Let me tell you a bit about myself, I’m a thin-as-a-rail slacker who is surprisingly creative regardless of slothful attitude. My favorite artworks involve paintings, &amp; modeling for paintings. Granted I never had a buff body, but my classmates loved my portraits of buff bodybuilders, &amp; that’s what mattered most. I used to make paintings for other guys at my school, before I felt myself fall into a creative rut of sorts.<br>\r\n<br>\r\nI plateaued and desperately needed some inspiration, so I figured why not build up my body image like the bodybuilders I used to work for. So that’s why I’ve been hitting the gym to build body strength over the past year, right after middle school. The progress would have been slow, so I went to a company called AgriGrowth, and tested out a new product of mass gaining, which was experimental. The process worked wonderfully at first giving me energy, but then it started to fade away within a few days leaving me more exhausted after workouts than ever before. To top it off, due the defective mass gainer product also worked in tandem with my genetics, &amp; caused me to gain an enormous amount of weight. I’m now obese with little musculature underneath to support it, &amp; there is no chance of losing the weight anytime soon. The mass gainer’s products side-effects would take years to lose even with correct dieting &amp; liposuction.<br>\r\n<br>\r\nI was originally 120 lb., then I set myself a limit of 200 lb. regardless of whether it was all muscle or not. However, the mass gainer I bought was so fast-acting, that even after I stopped taking the daily medications (of which I bought in bulk for a whole year) I was still growing at an alarming 10 lb. a week at least even with a limited amount of calories &amp; greasy/sugary/fatty foods. Now I’m up to 420 lb. &amp; it is almost exclusively fat.<br>\r\n<br>\r\nMy parents couldn’t take it anymore. Once I reached 18, they disowned me for going behind their back to test out a life altering medicine, one that was now eating them out of house &amp; home &amp; finance. My parents heard of this place called Blubber Belly Island, where obese furs &amp; scalies like myself could live out the rest of their lives peacefully gaining, without worrying about finance, if they stay there on the island without causing any trouble. Being sent to Blubber Belly Island was a small compensation to say the least, but at least my parents had enough dignity to send me somewhere where I could make a fresh start. Where does that leave me now?</span></div></div>",
            "created":1503551040,
            "id":2373790,
            "title":"Damien Silvermane, the Wider than Wide Wolf"
        },
        "1233":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "I Smelled A Delicious Aroma From the Kitchen (Food + Robotic Feeding Machine)",
                "I Saw A Huge Flatscreen TV Turn On W/ A Video Playing (Mental Adjustment)",
                " I Heard Smacking & Thumping Coming From the Basement (Roommates + Sex)"
            ],
            "content":"<div class=\"\"><div> <span>Well here I am; my new home, Blubber Belly Island. It looks so much bigger up close than I thought it would be. I was just getting off the boat when I noticed that the entry port to immigration-and-customs was packed, while the exit port was all but empty. That exit port seemed suspicious, but what did I know; I was the one being forced to move here by my parents.<br>\r\n<br>\r\nThe line was short, but most of the other passengers who had been onboard with me were way bigger than even I could have imagined with the smallest furries and scalies being between 380 lbs. to 420 lbs. However, the bigger furries and scalies were between 800 lbs. to 1000 lbs. Boy were these people huge. The passengers I met were of many species, ethnicities, and sizes, but one thing remained the same: they were colossal. Most of the passengers had on too tight shirts and vests that left little to my imagination, while others decided to forgo clothing and let their fat cleavage hang out all loose like the fluffy top of a cupcake with frosting.<br>\r\n<br>\r\nBoy was I turned on. Even though I had no idea who these people were or even what gender or sexuality they were, I didn't care. I had learned a lot about myself within the past year of hiding my gains and medications, including being more accepting of different types of sexualities considering how gender meant little to nothing with bodies this bulky and amorphous.<br>\r\n<br>\r\nThere was little room on the deck to stand and pace around. This was mostly because the ship was cheap, small, and we were given very few commodities, except the essentials. The other reason for the lack of standing room was much more obvious: we were huge and it was difficult to stand around on such a small ship. But I digress.<br>\r\n<br>\r\nI had finally arrived on Blubber Belly Island, and the scenery, for what it's worth, was beautiful and exotic. The island was made up of a vast  jungle environment with a barren mountain (hopefully not a volcano, but who knows) in the center of the island, and the main areas of commerce and residence were built with sleek and efficient highways and sidewalks that were just the right size for fatties like us. When I looked toward the base of the mountain, I noticed a beautiful looking town that, despite the lack of tourism, seemed to overflowing with its own niche culture and fast paced transit.<br>\r\n<br>\r\nBefore I could continue to take in the scenery, the boat had officially finished with the docking procedure and allowed us to get off. I grabbed my suitcase of essentials, my passport, ID, smaller versions of my art equipment, some money, and my cell phone. I also had a few other amenities such as toiletries, my game system, a couple of different porn magazines, condoms, and a jumbo-sized bottle of lube. What? I figured if I'm gonna spend the rest of my life here, I might as well try to get laid with the right guy, or girl if you catch my drift.<br>\r\n<br>\r\nBack to the matter at hand. I was getting off of the ship and into customs when I noticed my first obstacle in transferring here: the bureaucracy, specifically the lines for government identification and whatnot. The lines were short getting in, at least at first glance, since there weren't a lot of passengers arriving today at this port. The real problem, however, was that every single passenger's process took a lot longer than I thought as each passenger was huge and probably brought a lot more luggage than I had, or had never traveled farther than their hometown before. We were ushered into cramped rooms to take photos for identification, answer a few basic questions, X-rays, metal detectors, pat-downs, the whole shebang. It took nearly 45 minutes of waiting in line and trudging along at a snail's pace before I started my process.<br>\r\n<br>\r\nBoy was I hot, tired, sweaty, horny, and hungry, especially hungry. I was horny because there was little to no personal space for me in this line as my belly, butt, legs, feet and hips kept getting frayed and jiggled by every other passenger's body I made contact with. I was hot enough as is; even though I took my vest off and my shirt was breathable, the weather was tropical, yet sublimely dry - or at least not as moist as I though it would be - despite being on an island. The contact was making my FUPA tight as it engorged itself on hormones and blood flow to give me a hard-on, coupled with the heat which exacerbated my fatigue.<br>\r\n<br>\r\nI almost didn't realize it was my turn as my stomach was grumbling. I felt like my brain was on autopilot as I took my picture. My snapped out of my trance when I felt hooves at my hips; I almost yelped in confusion.<br>\r\n<br>\r\n\"Sorry about this Mr. Silvermane. We are just following protocol for this pat-down. Now please refrain from moving your body as we finalize this inspection,\" a hefty horse anthro explained.<br>\r\n<br>\r\n\"Right, just get on with it.\" I don't know what came over me, but while the pat-down was happening, I realized that the hefty horse  and bulky bull were taking a little too much pleasure in their pat-down as I was fondled and groped in other newly-formed erogenous zones on my torso and hips, and what I swore must've been my ass cheeks. When that embarrassing experience was over, I was officially done, though part of me felt a little bit unsatisfied as I was directed to my new house.<br>\r\n<br>\r\nThe island was flattened to a steady incline once you get past the jungles and head towards the beach. And there smack-dab in the middle of town was where my new home was located. I settled in to my spacious new home, when something strange occurred...</span></div></div>",
            "created":1547433480,
            "id":2603153,
            "title":"Getting Settled In on Blubber Belly Island"
        },
        "124":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Begin with this scenario.",
                "Begin with a different scenario.",
                "Begin with another scenario."
            ],
            "content":"<div class=\"\"><div> <span>Vincent is a 19-year-old tiger anthro who's had a fat fetish and a desire to become a big, fat blob of a tiger for as long as he can remember. Now that he's graduated from high school, he's decided to move out of his parents' house and onto Blubber Belly Island and live out his fantasies for the rest of his life.<br>\r\n<br>\r\nHis parents were surprisingly cool with his decision to do that, saying, \"If that's how you want to live your life, then do it; just be sure to call us every once in a while.\" He chose to wait until after spending his 19th birthday with them, as he knew that he'd likely never see them in person again. After a tearful good-bye, he boarded the boat to Blubber Belly Island, eager to begin his new - and bigger - life.</span></div></div>",
            "created":1586735400,
            "id":2817823,
            "title":"New Beginnings"
        },
        "1241":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Vincent and Shannon get to know each other.",
                "Suddenly, the door opens. Another cabin mate?",
                "Skip to arriving at the island."
            ],
            "content":"<div class=\"\"><div> <span>          Vincent stood outside the door to his cabin, wiping away the tears left over after tearfully saying goodbye to his parents. Sure, he would miss them dearly, but the boat had already departed, so it was too late to turn back. After his tears had been fully dried, he opened the door and got a good look at his cabin.<br>\r\n<br>\r\n          The room's size was clearly made with large passengers in mind as it was at least 15 ft. long and 15 ft. wide. There was a pair of bunk beds on either side of the room, both of which were big enough to hold at least 5 people of Vincent's size and and still have room to spare. The bunk beds also appeared to be made out of metal that Vincent could only assume was titanium. All in all, the room was clearly designed to hold 4 incredibly obese passengers and still have room to spare. <i>Given where this boat is going, it doesn't surprise me that the rooms are designed to hold fatties,</i> he thought. <i>I can't wait until I fat enough to fit in a bed that big.</i><br>\r\n<br>\r\n          \"You just gonna stand in the door and stare at the room all day?\"<br>\r\n<br>\r\n          That voice startled Vincent, who promptly looked for the source of the voice. Then he found it; a monkey woman who appeared to be in her early-to-mid 20s was inside the room looking right at Vincent. She had beautiful, soft-looking brown fur that complimented her flowing brown hair, and bright green eyes. She also had a decently sized ass and bust that, when displayed alongside her otherwise slender figure, looked bigger than they actually were. Her cute, smiling face was probably Vincent's favorite thing about her. It seemed that she had started putting her luggage away when Vincent opened the door.<br>\r\n<br>\r\n          \"S-sorry about that,\" Vincent said, embarrassed. \"I guess I was just awestruck by the size of the room. I was so distracted by it that I didn't even notice you were here.\"<br>\r\n<br>\r\n          \"I can't say I blame you; the room is pretty big.\" The woman giggled a bit at Vincent's embarrassment. \"I'm Shannon. What's your name?\"<br>\r\n<br>\r\n          \"I'm Vincent,\" Vincent replied. \"I guess you and I are cabin mates for this voyage, eh?\"<br>\r\n<br>\r\n          \"I guess so,\" Shannon nodded. \"I wonder if it'll be just the two of us, or if some other passengers will be joining us. Anyway, let's put our luggage away so we can relax.\"<br>\r\n<br>\r\n<div align=\"center\">~~~</div><br>\r\n<br>\r\n          \"Alight, I think our luggage is secure,\" Vincent said, wiping some sweat from his brow. \"I didn't really pack much; just a few clothes, my computer, and my games and gaming systems. How about you?<br>\r\n<br>\r\n          \"Pretty much the same thing as you: clothes, games, game systems, and my computer,\" Shannon replied. \"If what the brochure said about clothes being optional on Blubber Belly Island is true, then I might not need the clothes I've packed, but better safe than sorry.\"<br>\r\n<br>\r\n          \"I think it probably is true.\" Vincent pulled his brochure out of his pocket. \"People supposedly get too fat to find clothes that fit, so they just made clothing optional.\" Vincent then laid down on the bed his chosen bed. \"I think I'm gonna take another look at the brochure, then we can get to know each other.\" Shannon nodded, pulled her own brochure out of her pocket and laid down on her chosen bed.<br>\r\n<br>\r\n          According to the brochure, Blubber Belly Island, also known as \"Obesia,\" was a place magical island; quite literally, as many things about the island could only be explained supernaturally. Among its magical properties were what the brochure called \"food plants.\" Many of the plants native to the island grew fully prepared meals; from cheeseburgers to pizzas to bowls of pasta, just about any food in existence not only grew on plants, but instantly regrew after being picked. And if that wasn't bizarre enough, all it took to grow one of these plants was to bury some food in the dirt and a new plant would almost instantly grow. For example, if someone were to bury a cake in the dirt, a plant would almost instantly sprout up, grow to full size, and have a cake exactly like the one planted ready for picking. This essentially meant that there was no need for money on the island, as food was always readily available.<br>\r\n<br>\r\n          The \"food plants\" weren't the only magical plants on the island. There were also the \"blue fruits,\" so named because they were all blue. Not only that, but they caused varying alterations - some temporary and some permanent - to the bodies of anyone who ate them. These alterations included: making the consumer 40 lbs. fatter; giving the consumer a pear-shaped figure and causing future weight gain to focus on the consumers hips, thighs and ass; increasing the endowment size of males and bust size of females; doubling future weight gained; turning humans into an anthropomorphic animal of their choosing; making the consumer incredibly horny; and various other things. There was also a special silver fruit that not only reversed the effects of the blue fruits, but also returned the consumer to the average weight for their species; perfect for island visitors who wish to return to normal size before going home, or for permanent residents wishing to gain tremendous amounts of weight from a normal size all over again.<br>\r\n<br>\r\n          The plants weren't the only magical thing about the Blubber Belly Island. According to the brochure, space was distorted in ways that caused buildings which appeared small on the outside to have unbelievable amounts of space within. For example, a building that appeared to be as big as tool shed could have an entire stadium's worth of space withing. This essentially meant that the island would virtually always have room for more residents.<br>\r\n<br>\r\n          Clothing was indeed optional on the island; the brochure said that residents and visitors alike gain so much weight that they very rapidly outgrow their clothes. Materials to make fabric need to make clothes that would fit them grew at the same speed as all the other plants on the island (i.e. instantly), so they could easily get clothes that fit, but most people didn't bother with clothes at all. Nudity was very common on the island, and almost all the beaches were nude beaches. Because of the near constant nudity, those under the age of 18 were not allowed to visit or move to the island unless accompanied by a legal guardian.<br>\r\n<br>\r\n          The very last thing the brochure mentioned was that there was a tribe of natives that lived in a village in the center of the island. The native tribe was a very friendly and peaceful one. Meeting them was a popular activity for visitors and residents alike.<br>\r\n<br>\r\n          And with that, the brochure was done. Vincent and Shannon both put their brochures away and looked at each other...</span></div></div>",
            "created":1586747040,
            "id":2817924,
            "title":"The start of a new life."
        },
        "13":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Begin",
                "Begin",
                "Begin",
                "Begin",
                "More beginnings"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your exact age and animal species is up to you.</span></div></span></div>",
            "created":1340427600,
            "id":1365659,
            "title":"A Young Adult (20-39)"
        },
        "131":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your gender</span></div></span></div>",
            "created":1401685200,
            "id":1806322,
            "title":"Begin"
        },
        "1311":{
            "choices":[
                "23 year old buff tiger named Zan",
                "27 obese native dragon who is king of a city on the island",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose an age and species</span></div></span></div>",
            "created":1401685200,
            "id":1806325,
            "title":"Male"
        },
        "13111":{
            "choices":[
                "At the end of the city",
                "In the middle of the city where all the action is"
            ],
            "content":"<div class=\"\"><div> <span>As the boat set sail for Jumploosa a buff 23 year old tiger looked out into the sunset. His name is Zan Shimmers and he's a professional wrestler. After winning the title he decided to move to Jumploosa so his fans wouldn't try breaking into his house at night and also to prep up for the next tournament. He heard that many of the residents were very obese and that their cities are huge. There's also rumors that every year the entire island expands to keep up with the increase in population, but despite that he's heard that the population is in top physical condition despite their size. Ironically Zan had always wanted to move up a weight class or two so none of his opponents could one-up him. Thoughts of yesterday's match proved that his opponent almost managed to win if it wasn't for Zan's tail. Yet Zan knew that in order to stay king of the ring he would have to kiss his 8-pack abs good-bye and welcome a muscle-gut. Zan then goes to bed for the night thinking about how he'll fit in to his new home.<br>\r\n<br>\r\nThe next morning the boat had reached Jumploosa better known as Blubber Belly Island. When Zan stepped outside the boat he noticed that the obesity rate on the island was 100% or 99.9% since he just arrived. Zan pulled out a map to locate the mansion that he just bought, unfortunately he was confused just due to the fact that ordinary houses looked like mansions. A 300 lb. tigress approaches him and who next to him was one of the slimmest residents of the island.<br>\r\n<br>\r\n\"You must be Zan Shimmers. You're a lot thinner than expected.\" said the tigress.<br>\r\n<br>\r\n\"I'm actually looking for the mansion I purchased and hopefully I can start bulking up for the next wrestling tournament that I got.\" said Zan.<br>\r\n<br>\r\n\"That's wonderful! I'll show you to your new home.\"<br>\r\n<br>\r\nZan then carries his luggage and follows the tigress.<br>\r\n<br>\r\nWhen he arrives he sees that his new home is...</span></div></div>",
            "created":1401771600,
            "id":1806791,
            "title":"Zan the wrestler"
        },
        "131112":{
            "choices":[
                "gets a gym membership",
                "decides to work out at home and go out for some grub"
            ],
            "content":"<div class=\"\"><div> <span>When he arrives he sees that his mansion is in the center of town. He was absolutely dumbfounded that he was in the center of town. That made going shopping easier yet the only thing he couldn't buy at the moment was new threads since most of the clothing would be too big for him.<br>\r\n<br>\r\n\"This is awesome. I can't wait to get unpacked!\" said Zan.<br>\r\n<br>\r\n\"Don't worry every house has robotic butlers and maids. All you need to do is enjoy yourself.\" said the tigress.<br>\r\n<br>\r\n\"I will. I need to find the gym so I can get a good workout before I start bulking up.\" said Zan.<br>\r\n<br>\r\n\"There's several good gyms in town. Let me show you around town while your butler finishes your unpacking. \" said the tigress.<br>\r\n<br>\r\nSo Zan and his tour guide explore the city and check out the sites. Zan was actually impressed. He never saw really obese people do a lot of heavy lifting except if they were in top physical condition. He also noticed that the fatter someone was the more celebrated they are as a celebrity. Though Zan was famous he would have to work his way up to be famous on Jumploosa. The next day Zan...</span></div></div>",
            "created":1402462800,
            "id":1810573,
            "title":"In the lap of Luxury"
        },
        "1311121":{
            "choices":[
                "Is extremely fat",
                "Not only is the bear fat, but he has some incredible muscle definition"
            ],
            "content":"<div class=\"\"><div> <span>The next day Zan decided to get a gym membership. The primary motivation was to increase his speed, strength, and endurance as he packs on the pounds. Currently Zan was 7'2\" and weighed 325 lbs. with 320 lbs. being pure muscle. The gym Zan was planning on joining was called Maximum Weights Fitness Center. This gym was the closest to Zan's home and the biggest gym in Bulkia City, the second largest city in Jumploosa. When Zan entered through the double doors Zan was amazed at what he saw.<br>\r\n<br>\r\nThe whole place was filled with fat furs exercising on various machines specifically designed for extremely obese people. If he thought the regular towns folks were strong, then these guys and gals were fat fitness gods and goddesses. Zan watched in awe as a humongous wolf bench pressed an impressive 4,000 lbs. and the guy looked to be at least a thousand pounds or more. He then noticed a fat cheetah woman gracefully jumping over hurdles on the track and she was roughly 700 lbs.<br>\r\n<br>\r\n\"Whoa... How are feats of strength and dexterity even possible at incredible sizes like those?\" Zan asked himself in awe.<br>\r\n<br>\r\n\"So you want to know how people at my gym are fat and fit?\" A deep masculine voice replied.<br>\r\n<br>\r\nZan turns towards the front desk and sees a huge black bear. When Zan sees the black bear he sees that the black bear...</span></div></div>",
            "created":1472619600,
            "id":2204318,
            "title":"A new Gym. A new Training Regimen"
        },
        "13111212":{
            "choices":[
                "The same wolf he had seen before bench pressing. He's bigger than Zan thought",
                "A different species altogether"
            ],
            "content":"<div class=\"\"><div> <span>When Zan sees the black bear he sees that the black bear is not only fat, but he has some incredible muscle definition. Unlike other members of the gym his body was more solid looking, but it is clear that the bear has more body fat than muscle on his extremely girthy frame. The bear emerges from the double doors that lead to the front desk. Up close the bear easily dwarfed Zan by a few feet and that the bear was wearing gym clothes that clung to his thick body.<br>\r\n<br>\r\n\"The name's Maximilian Ursanate. How could I help you little man?\"<br>\r\n<br>\r\n\"The name's Zan. I was hoping to get a gym membership. I recently moved here and I hope I can move up into the heavyweight weight class. I'm a wrestler who wrestles for FWE.\"<br>\r\n<br>\r\nMaximilian looks at Zan and scratches his chin before answering. \"So you're an FWE wrestler and you want to be a heavyweight. To be a heavyweight you need to put on a hundred pounds, assuming that you're 250 lbs. which is middleweight for your species. Every species has different weight requirements, yet yours shouldn't be hard to meet. A month or so from now you'll start looking like a Blubber Belly Island local. Alright, I can help ya out. Just enter your name on this tablet and I'll see that we get you started.\"<br>\r\n<br>\r\nZan signs the tablet. After signing the tablet Zan hands it back to Maximilian.<br>\r\n<br>\r\n\"You're now an official member of Maximum Weights Fitness Center. I'll go get your personal trainer. I would help ya myself, but I have a BBI wrestling match I need to get ready for. If you stop by tomorrow I can give you fitness tips, considering your trainer doesn't give them to you first,\" said Maximilian.<br>\r\n<br>\r\nMaximilian scans the room and finally spots someone who just seems to be working out.<br>\r\n<br>\r\n\"Bruno! I have a new client for ya. He just moved into town yesterday!\"<br>\r\n<br>\r\n\"Another client, eh. I'll be right there boss!\"<br>\r\n<br>\r\nLoud footsteps could be heard as huge figure slowly makes his way towards the front. Unlike Maximilian who is awfully light on his feet for a bear of his size, the figure had a heavier footstep. As Bruno approached Zan saw that Bruno was...</span></div></div>",
            "created":1472792400,
            "id":2205332,
            "title":"New Gym and Training Regimen part 2"
        },
        "131112121":{
            "choices":[
                "Bruno's size or larger",
                "Smaller than Bruno, but not by much"
            ],
            "content":"<div class=\"\"><div> <span>As Bruno approached Zan saw that Bruno was the same wolf he had seen before bench pressing. Now that Zan got a closer look at the large canine he should have added at least another hundred or so pounds to his guess. Zan also noticed that Bruno was shirtless, barefooted, and only wore a pair of workout pants that looked a little loose on his robust figure.<br>\r\n<br>\r\n\"So you're the new client? I thought I spotted someone new while I was bench pressing. How much do you weigh?\" Bruno asked.<br>\r\n<br>\r\n\"I weigh 325 lbs.\" Zan replied.<br>\r\n<br>\r\n\"That sounds about right.\"<br>\r\n<br>\r\n\"You're heavier than I thought. How could have I gotten your weight wrong?\"<br>\r\n<br>\r\n\"Boss, I think it's because of your numerous members. Each different species has a different build and each species packs on weight differently.\"<br>\r\n<br>\r\n\"That makes sense. I guess I had another client on my mind. I believe he was a wolf. Believe it or not we occasionally get people who wash up on the shores across the island. But we can go over that later. See ya later.\"<br>\r\n<br>\r\nMaximilian exits the fitness center. While Zan was try trying to process the randomness of the conversation he sees that Bruno was waiting.<br>\r\n<br>\r\n\"Hey tiger! What's your name?\"<br>\r\n<br>\r\n\"It's Zan.\"<br>\r\n<br>\r\n\"Zan, eh. I think I saw one of your matches on TV the other day. You may be a superstar on the main land, but on Blubber Belly Island you're just some rich and skinny tiger who just moved here. It's my job that you pack on the weight effectively. Sure you could be like everyone else and be a butterball that only has enough muscle to avoid being immobile, yet it's pretty impossible to get immobile nowadays though. After living on this island for three months the muscles of the body begin adapting to the environment.<br>\r\n<br>\r\nSure there's places around the world where there are immobile fat furs, but here the average person is strong enough to carry their own weight. The only difference is how lazy they are. Even the fattest inhabitant on Jumploosa has enough strength to walk around the island without getting winded.\"<br>\r\n<br>\r\n\"So wait a moment. People here get stronger if they get fat here?\" Zan asked.<br>\r\n<br>\r\n\"That's what I got done telling ya. I don't know the main cause, but I have been living here long enough to know that the body adapts to being heavier. Jumploosans have been reported as the healthiest in the world, and yet fat shamers from the mainland try to insult us. Now let's get you started. We have to make your body work before we can reward it with the most succulent dishes.\"<br>\r\n<br>\r\nBruno takes Zan by the arm and has him work out like no tomorrow. The exercises weren't that too different than what Zan was used to, but the weights were slightly heavier to lift. After two hours Zan was exhausted.<br>\r\n<br>\r\n\"Good work, Zan. Now let's reward that stomach of yours. I know I'm going to treat myself to a larger lunch than usual for breaking my record on how much I could lift. After lifting 4500 lbs. a handsome, plush, and good looking wolf like myself needs to maintain and grow his figure.\" Bruno said as he flexed.<br>\r\n<br>\r\nAs Bruno flexed his body jiggled. It was clear that Bruno had a high percentage of body fat when compared to his muscle mass, but it's clear that his fat generously coats his muscles. If Bruno was his size and somewhere else he would already be immobile. Yet here he was admiring himself. Zan wasn't sure if Bruno was prideful or was gay for himself, in other words, he's interested in being married to himself, but was clear that Bruno loved his body.<br>\r\n<br>\r\n\"Hey Zan, wanna grab a bite to eat? They say eating with friends is a good way to gain weight, especially if those friends are fat.\"<br>\r\n<br>\r\n\"That sounds rad.\" Zan replied.<br>\r\n<br>\r\n\"That's awesome little man. I'll go get a few of the guys and gals. If you hang with us you'll be a big tiger in no time.\"<br>\r\n<br>\r\nAfter texting his buddies, Bruno puts on a large black shirt and a pair of shoes that imitated actual bare feet.<br>\r\n<br>\r\n\"My friends are going to meet us at Mandarin BBQ. Follow me.\"<br>\r\n<br>\r\nZan follows Bruno to Mandarian BBQ. Once he follows Bruno to the table he see that Bruno's friends are...</span></div></div>",
            "created":1472878800,
            "id":2205615,
            "title":"New Gym and Training Regimen part 3"
        },
        "1311121211":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Zan ate all the food and wanted more to eat",
                "Zan ate half the food and was stuffed"
            ],
            "content":"<div class=\"\"><div> <span>Bruno’s friends are around the same size as Bruno and some he noticed are larger than the huge wolf. <br>\r\n<br>\r\n\"Bruno, glad to see you could make it. You came late, so we thought you didn’t want free food,\" said a loud booming voice as Bruno and Zan saw a group of large animals around a large table.<br>\r\n<br>\r\n\"Sorry I'm late; I had to bring my new client,\" said Bruno as both took an empty seat at the tables next to Bruno’s large friends. <br>\r\n<br>\r\n\"New client then we better introduce ourselves,\" said one of the large men. <br>\r\n<br>\r\n\"My name's Larry, but you can call me 'Large Larry,'\" said a huge, fat water buffalo wearing a security guard uniform. He looked like he weighed about 2,000 pounds.<br>\r\n<br>\r\n\"Look runt, the name’s Gus, but you can call me 'Gigantic Gus,'\" said a hefty Rhino wearing a baker’s outfit. He was easily the largest of Bruno’s friends, looking like he was 4,000 pounds. <br>\r\n<br>\r\n\"So Bruno got a new disciple. Any disciple of Bruno is a friend of mine. My name's Joe, but friends call me 'Jumbo Joe,'\" said a large Hawk wearing a mailman uniform. He looked like he weighed around 2,500 pounds. Zan wondered if and how the Hawk could fly.<br>\r\n<br>\r\n\"You look so small, but call me if you need help. My name is Tory, but friends call me 'Titanic Tory,'\" said a fat lion wearing a construction outfit. He looked like he was at least 3,000 pounds. <br>\r\n<br>\r\nZan gulped as both men sat down and he was dwarfed by the sheer size of Bruno’s friends as he was shocked how Bruno is so big when meeting him. <br>\r\n<br>\r\n\"So Zan, that's your name right? Bruno told us earlier about getting a new client. So what brings a small guy like you to our city,\" said Gus as he glared down at Zan as he easily towered over the rest of the restaurants patrons? <br>\r\n<br>\r\n\"Lay off of him Gus. He just moved here and he's hopping to become a big wrestling star here,\" said Bruno as he reached for a drink brought by a waitress who gave the tables a large pitcher of beer. Zan nodded and he noticed that the rhino backed off and Zan could see the warmth in the rhino’s eyes.<br>\r\n<br>\r\n\"So you want to be a wrestler, eh? Well then, you better eat and workout a lot; there are little kids who are bigger and stronger then you, but with Bruno teaching you will be a force to reckon with in the ring,\" said Tory.<br>\r\n<br>\r\n\"Don’t be a stranger; call us if you helping eat or working out,\" said Larry.<br>\r\n<br>\r\n\"All right, enough with the talk about Zan; all of your girths are making the poor kid nervous,\" said Bruno with a cheeky grin. His friends rolled their eyes and saw their order came.<br>\r\n <br>\r\nBruno whisper to Zan that Gus knew the owner and are good friends. The owners would give Gus and his friends free food on the house after teaching the owner’s niece how to bake. <br>\r\n<br>\r\nSeveral waitresses came with huge dishes with fried rice and noodles, boatloads of chicken, beef ribs and pork dumplings. Altogether, Zan guessed that the total weight of the food was around half of his own weight.<br>\r\n<br>\r\nZan saw Bruno and his friends and chow down and he was amazed at how they started to demolish the food.<br>\r\n<br>\r\n\"Don’t just sit there, dig in! If you want to achieve your dream, then start eating. You need to grow just to make the lightest weight class,\" said Bruno as he passed Zan a huge plate filled with a large portion from each dish.<br>\r\n<br>\r\nZan nodded and ate with a motivation. He found the food incredibly tasty as his stomach growled with hunger and greed for the food.<br>\r\n</span></div></div>",
            "created":1485855060,
            "id":2271564,
            "title":"Bruno's size or larger"
        },
        "13111212111":{
            "choices":[
                "The next day",
                "2 weeks later",
                "One month later"
            ],
            "content":"<div class=\"\"><div> <span>After finishing up his food Zan licked his lips as he saw Bruno and his friends consume their meals. Normally Zan would of felt full consuming all the food he had, but he felt hungrier than when he first arrived at the restaurant.<br>\r\n<br>\r\n\"That was good. I have to have more!\" Zan said.<br>\r\n<br>\r\nBruno and his friends were too busy eating to notice Zan's eagerness, however a waitress heard exactly what Zan had said. The waitress gracefully makes her way over to the table.<br>\r\n<br>\r\n\"Hello there boys. Did I just hear someone request more food?\" The waitress asked.<br>\r\n<br>\r\nBy then Bruno and his friends had finished eating.<br>\r\n<br>\r\n\"Of course we would want more food.\" Bruno replied.<br>\r\n<br>\r\n\"I know that you hunky wolf. I just happened to notice that your new tiger friend seems to love Marissa's cooking. She spends valuable time adding in her secret spices. With dedication like that he'll be one big and cute tiger if he's this hungry.\" The waitress replied.<br>\r\n<br>\r\nZan than noticed the waitress's species. She was apparently a tigress like the other tigress he met yesterday. In fact she looks like she may be related to the other tigress, except a lot fatter. Just one hundred pounds thinner than Bruno.<br>\r\n<br>\r\n\"Alyssa, if you think that someone as thin as Zan is still hungry than bring out the second course!\" Gus yelled.<br>\r\n<br>\r\nAs if on cue Alyssa whistled. Within moments several waitresses brought out twice as much food as before. As soon as the food reaches the table the men eagerly pile their plates with food. Zan fills his plate with twice as much as before. After a good hour Zan finished his plate. He would have eaten more, but he was stuffed. The meal alone added another five pounds to his muscular frame.<br>\r\n<br>\r\n\"That was great. I don't think I could eat another bite. At this rate I'll meet my goal in no time. Within a month I should qualify for the heavyweight division in the FWE. And I should have a better time defending my title. Yet I should compete in the BBI and test my prowess. If I can compete in the BBI that would be great.\"<br>\r\n<br>\r\n\"I'm sure you'll make it Zan. If you stick to my regimen you'll be unstoppable in the ring.\"</span></div></div>",
            "created":1485913020,
            "id":2271847,
            "title":"A Growing Hunger"
        },
        "131112121112":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Alyssa",
                "his agent",
                "one of Bruno's friends"
            ],
            "content":"<div class=\"\"><div> <span>The next two weeks of Zan working out and binge eating under Bruno’s every watchful eye. Zan could feel that his body has put on both muscle and fat, mostly fat though. The tiger saw his muscle definition start to get buried under his new fat, but he could still feel them under that small layer of fat, they already felt bigger.<br>\r\n<br>\r\nZan was currently working out at the gym under Bruno’s watch when, a big fat shark came up to Bruno and whispered into his ear and then nodded to Bruno and left. <br>\r\n<br>\r\n“Stop with the weightlifting, before you pull something. Take a break. I will be back in ten minutes. They need me up in front to help some idiot who collapsed and fell on one of our new treadmills. Why would an eight-ton elephant be allowed on a new treadmill meant for smaller speedy animals is beyond me. “said Bruno as the hefty wolf left Zan to take a break.<br>\r\n<br>\r\nZan stop lifting the heavy weight as he felt his muscles scream with pain and exhaust. He heard his cell phone ring and he pulled it out and answered it.<br>\r\n<br>\r\n“Hello” answered Zan talking to his phone.<br>\r\n<br>\r\n“Zan, is this a bad time to call you?” said the person on the other end of the line.<br>\r\n<br>\r\nZan instantly recognized the voice as it belongs to<br>\r\n</span></div></div>",
            "created":1519373280,
            "id":2456383,
            "title":"2 weeks later"
        },
        "1311121211122":{
            "choices":[
                "One month later",
                "Two months later"
            ],
            "content":"<div class=\"\"><div> <span>The voice on the other end of the line was his agent, David Kingsley. David Kingsley is a former wrestler who convinced Zan to become a wrestler right out high school. David always calls Zan if an event comes up.<br>\r\n<br>\r\n\"Not at all, David. I'm just taking a short break from my workout,\" Zan said.<br>\r\n<br>\r\n\"That's good to hear. I just found out the wrestling federation is hosting a special premiere tournament before the spring season starts. It's in two months from now. I'm well aware that you're trying to move up a weight class or two. This may be the best opportunity to show off the new and improved you.\"<br>\r\n<br>\r\n\"Sounds interesting. I'll definitely be there, David.\"<br>\r\n<br>\r\n\"That's great to hear Zan. I'll see you in two months.\" David said.<br>\r\n<br>\r\nZan then hung up and noticed that Bruno was finished attending to the broken treadmill.<br>\r\n<br>\r\n\"I just finished looking into the treadmill. It sucks that I'm going to have to replace it. In five minutes well resume working out and then get something to eat. My girlfriend Macy just opened a new buffet.\"<br>\r\n<br>\r\n\"Sounds good, Bruno. I want to make sure I'm ready for a special event on the mainland within two months. My agent just called and told me about it.\" Zan said.<br>\r\n<br>\r\n\"If that's the case then we better continue your training regimen.\"</span></div></div>",
            "created":1519420800,
            "id":2456790,
            "title":"his agent"
        },
        "13113":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Sibos- the muscular wolf from a country farm",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sibos a muscular wolf in his early thirties from a country farm who got a new job in the big city.</span></div></span></div>",
            "created":1468818000,
            "id":2182341,
            "title":"More"
        },
        "1312":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Skye the aspiring magician",
                "Hannah the chess master",
                "No good, got anyone else?"
            ],
            "content":"<div class=\"\"><div> <span>Skye Holland is a twenty one year old black dragoness born and raised on BB Island. The most striking part about the over four hundred pounds of dragoness is her snow white hair. Throughout her childhood, Skye heard stories about great magical power hidden away beneath the island. Most dismissed it as a fairy tale, but Skye believes it with all her heart. She is going to find the power and make it her own. But is she meddling with something beyond her control?<br>\r\n<br>\r\nHannah Young is a twenty five year old snow leopard. A recent arrival to the island, she has taken to the bountiful amounts of food with gusto and is already pushing past three hundred pounds with no signs of stopping or even slowing down. Shrewd and calculating, she is always looking to improve her standing and gain more power. Hannah is unaware that a rival is working on something to take the leopard down a peg. Will Hannah be able to overcome the threat and continue to expand her power and her waistline?</span></div></div>",
            "created":1568092860,
            "id":2716007,
            "title":"Young adult females"
        },
        "13121":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "She’s hit with a surge of power flowing into her.",
                "Her smile fades she realizes she’s growing uncontrollably.",
                "Skye is left wondering as the feeling passes and nothing happens."
            ],
            "content":"<div class=\"\"><div> <span>Cobwebs choked the passage before her, a sign that no one had been down here in ages. Skye proved undaunted by this, in fact, this spurred her on even more. She had pieced together fragments of tales and stories, following in the steps of those that walked this forlorn path before her. None of her predecessors had succeeded, but she hoped with all her heart that she would be the first.<br>\r\n<br>\r\nThe dragoness stumbled every few steps as the rough stone floor beneath her caught her feet, or a loose piece shifted beneath her weight. She pressed on anyways, buoyed by what she hoped to find. She scowled a bit as her stomach growled in anger. Despite the second breakfast she had gulped down that morning, her weighty body was already demanding the first lunch. She dug a bag of chips from her bag and scarfed it down, followed soon after by a second and a third. Not quite enough, but they would have to do for the moment.<br>\r\n<br>\r\nDistracted by her still protesting stomach, the doughy dragoness almost ran nose first into an old wooden door. The hinges creaked, but wouldn’t budge. Shoving her shoulder against the door, it started to open, but not all the way. Putting her considerable weight to task, the wood groaned before a sharp snap proved the only sign as the door gave way. She hacked and coughed at the clouds of dust kicked up by the impact. She bared her teeth as she felt an ache start in her belly from how she landed on it.<br>\r\n<br>\r\nWobbling to her feet, she found her flashlight nearby and cast its glow around as she swiped at the cloying dust that clung to her. Several tables lay scattered about, their tops littered with tools and moldering books. She even saw a couple spots where tables once stood, but they had rotted away over the years, leaving behind only scraps.<br>\r\n<br>\r\nHer flashlight flickered, and she scowled as she shook it. It lit up again, before flaring bright and going dark. She growled and hit the tube against her other hand several times, but it remained unlit. She froze when she saw that there was still a pale glow in the room. Feeling her way through the gloom – tripping over some of the decayed leftovers along the way – she came to a curtain covering an opening in the wall. She could see the glow leaking around the edges. Throwing the curtain back, she found a staircase cut into the stone, spiraling down out of sight.<br>\r\n<br>\r\nFollowing the stairs down, she came to another large chamber. She shivered, and rubbed her arms, and now realized that she could see her breath puffing in little clouds. Looking up, she gasped and froze. A huge crystal floated in the middle of the chamber, one point almost touching the floor, while the other was almost at the ceiling. The glow she had been following came from within, but down here it was somewhat painful to look it. She couldn’t resist though. She continued to stare through eyes screwed almost shut.<br>\r\n<br>\r\nWith a jolt, she realized that she had wandered close to the stone. Her hand was up and almost touching. She drew it back. Some of the fragments she had encountered warned of grave danger should the crystal be touched without proper protection. Setting her bag on the floor, she pulled out the ingredients she had collected. Before long, a collection of small bags and glass bottles surrounded her. She still felt amazement at how almost everything she needed was present here on the island; it was as if some force tied the island and the crystal together. The only thing that wasn’t native to the island was the roses brought by some of the later occupants of the island. From those, she had several handfuls of petals.<br>\r\n<br>\r\nWith everything set out, the dragoness plopped down on her considerable rump and set to work. She mixed some of the powders together before spreading them in circle around her. Next came the liquids, these she poured into set spots in the powder circle, watching as the reactions happened each time. Then she pressed candles against the stone outside those spots, lighting them each in turn. She spread the rose petals throughout the interior of the circle as the second to last step. At last, she unstoppered the bottle containing water from a specific spring and doused her hands with the water before dribbling the rest down over her heart.<br>\r\n<br>\r\nThe air seemed to grow even more still, as if anticipating what was to come. Skye couldn’t stop the shiver that passed down her spine and along her tail. Others had tried similar combinations of these ingredients, and met with failure at best. She hoped beyond all belief that she was the one to get it right.<br>\r\n<br>\r\nHefting her bulk to her feet, she reached out for the glowing crystal. A tingle spread from the tips of her fingers up her arms as she paused with her fingers a hairsbreadth away. Then with a final gulp, she pressed her hands forward that final gap. An electric shock launched up her arms and into her body as an icy chill settled in her gut. She felt torn between excitement and fear, not sure whether it was working or not. A smile started to form on her face as she felt…<i>something</i> happening.</span></div></div>",
            "created":1576179840,
            "id":2758743,
            "title":"Delving deep"
        },
        "132":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "They get separated.",
                "They were ambushed.",
                "Something else happens."
            ],
            "content":"<div class=\"\"><div> <span>The sun, with a few wispy clouds in the bright blue sky, shined brightly on the isolated paradise. The waves rolled along the shore, leaving a wet trail as it retracted back into the ocean.<br>\r\n<br>\r\nA few feet away was a lush, tropical forest, and the sounds of chattering monkeys, squawking parrots, and other exotic animals came from within.<br>\r\n<br>\r\nStanding on the prow of a large ship, Mina, a catgirl with a long, black hair and brown fur, gazed upon this island through a pair of binoculars with interest.<br>\r\n<br>\r\n\"Are you sure that this is the right one?\" asked Sam, a chubby, short, arctic fox.<br>\r\n<br>\r\n\"Of course it is!\" she exclaimed, taking her eyes off the binoculars, \"All of the information we've gathered pointed directly to these sets of islands.\"<br>\r\n<br>\r\nThey've been on this case for months now. Blubberbelly Island, a small piece of land surrounded by miles of Pacific Ocean, was rumored to be a society created by the government, a place that they would use to dump off extremely obese and overweight people.<br>\r\n<br>\r\nWhat happened to them was a mystery, a mystery that Mina, a journalist, and Sam, a cameraman, would uncover.<br>\r\n<br>\r\nShe'd payed a captain of this boat to take them to these sets of islands, spent at least a few days sailing these seas, searching for this fabled island.<br>\r\n<br>\r\n\"Okay,\" said Sam, sounding nervous, shrinking away a little, \"But I'm still saying that this is a bad idea.\"<br>\r\n<br>\r\nMina rolled her eyes. It wasn't the first time her companion said this. Ever since they began this search Sam had whined endlessly, telling the catgirl how she felt a ominous presence nagging on her.<br>\r\n<br>\r\n\"We can't turn back now,\" said Mina, turning her attention back to the island, \"It would be a gigantic waste of time and money if we do.\"<br>\r\n<br>\r\n\"Fine,\" said the fox, folding her arms, \"But do we really have to go off alone; it could be dangerous doing that.\"<br>\r\n<br>\r\nShe was right. The plan was to row the two of them to shore, climb off, and begin their search. The ship would stay on the waters for at least a week, enough time to do their research.<br>\r\n<br>\r\nBut there was still the possibility that the they could run into trouble: they could sustain an injury, or be bitten by a poisonous animal, or the natives they were on a hunt for might prove very dangerous. <br>\r\n<br>\r\nBut ten spite the endless amount of horrible scenarios, Mina was still determined.<br>\r\n<br>\r\n\"Yes,\" the catgirl said, \"I'm positive that this is a good idea.\"<br>\r\n<br>\r\n\"Alright then,\" was only thing Sam said.<br>\r\n<br>\r\nAs planned, they were taken ashore by a skiff. Running aground, Sam and Mina, dressed in green safari clothing, jumped off the small boat.<br>\r\n<br>\r\nThe catgirl waved goodbye as the skiff returned back to the ship, but Sam was struggling, for she was burdened carrying their heavy backpack full of supplies and the camera.<br>\r\n<br>\r\n\"Let's go,\" said Mina, gesturing with her hand.<br>\r\n<br>\r\n\"Right behind you,\" said Sam, grunting as she began to walk, following the catgirl into the jungle.<br>\r\n<br>\r\nBut what happened while they were exploring the jungle?</span></div></div>",
            "created":1485119220,
            "id":2267458,
            "title":"Blubberbelly Island."
        },
        "1321":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Stay with Mina.",
                "Switch to Sam.",
                "Perhaps follow both at the same time."
            ],
            "content":"<div class=\"\"><div> <span>The leaves grew so thick that it shield out the bright rays of the dun, rendering the tropical forest's floor in a perpetual shade. But ten spite the lack of sunshine, the undergrowth grew extremely thick, and the two explorers had to fight endlessly to get past it.<br>\r\n<br>\r\nThe warm and damp air was making Sam feel hot and uncomfortable, and, due to not being in the best physical condition and carrying a heavy weight, she was panting and sweating, falling behind Mina at least ten feet every ten seconds.<br>\r\n<br>\r\n\"Hey!\" she finally cried, when she saw how far the catgirl was from her, \"Wait for-\"<br>\r\n<br>\r\nShe could not get the last word out, for Sam 's foot caught in a root of some random tree, and the fox went toppling over, falling face down in the mud.<br>\r\n<br>\r\nShe groaned when she finally roused to her feet, rubbing her brushed head, her beautiful white fur caked with dirt.<br>\r\n<br>\r\nWhen she finally regained her composure, Sam saw that her companion was no where in sight, and she cursed to herself. She was just about to run off and catch up to her companion when she heard the bushes nearby rustle.<br>\r\n<br>\r\nHer blood ran cold. She waited for it to happen again, but after a few moments passed that made it evident that it would not, Sam nervously continued her journey.<br>\r\n<br>\r\nSuddenly there was loud howling all around her, and tall, wide black figures jumped in her way with heavy thuds, surrounding her at all sides.<br>\r\n<br>\r\nSame gave a small yelp when sharp javelins thrust towards her, stopping inches away from penetrating her soft flesh.<br>\r\n<br>\r\nGingerly she raised her eyes away from the deadly points and to the looming black figures, saying nervously: \"H-hi.\"<br>\r\n<br>\r\nMeanwhile, Mina was walking down a pathway she just now discovered, oblivious to Sam's distress. It was only when the catgirl turned around to ask the fox if she had the camera on and ready that she saw that her companion was missing.<br>\r\n<br>\r\n\"Sam!\" she called, \"Where are you?\"<br>\r\n<br>\r\nShe received no answer, and Mina was growing worried. She backtracked, but due to the jungle's size and the fact that everything looked the same, Mina took a few wrong turns and ended up completely lost.<br>\r\n<br>\r\n\"Okay, calm down, girl,\" she told herself, \"You can get yourself out of this mess.\"<br>\r\n<br>\r\nShe tried retracing her steps, but she took a wrong turn again, walking straight into a trap. On the ground, covered by green leaves, was a net.<br>\r\n<br>\r\nWhen Mina stepped on it, the trap activated, and the next thing the catgirl knew was that she was surrounded by rope, suspended three feet high in the air.<br>\r\n<br>\r\nShe kicked and thrust around, but all her effort only left her out of breath and no less trapped.<br>\r\n<br>\r\nThe bushes rustled nearby. Emerging from them were two tigers. Mina gasped when she saw them: they were both seriously fat, supporting huge, overhanging bellies and large moobs, dressed in nothing but a pair of beautifully decorated loincloth, their flaps to long that it almost dragged across the ground.<br>\r\n<br>\r\nIf she could guessed, from this uncomfortable angle, that the two felines must be at least six to seven feet tall. Aside from their natural black stripes, colorful patterns, red, blue, green, yellow, most of them in a spiral shape, covered their well-fed bodies.<br>\r\n<br>\r\nWhen they laid eyes on Mina, their eyes grew wide with surprise.<br>\r\n<br>\r\n\"It would seem that we caught something that's anything but edible, Tom,\" said the first tiger, studying Mina.<br>\r\n<br>\r\n\"Yes,\" agreed the second tiger, \"It's a female. Do you think it comes from the Northern part of the island, Tim?\"<br>\r\n<br>\r\nThe first tiger known as Tim shook his head. \"No,\" he said, \"She's far too thin and strangely dressed.\"<br>\r\n<br>\r\n\"Do you think she comes from the dreaded Main Land?\" asked Tom.<br>\r\n<br>\r\n\"Most likely,\" said Tim, \"Which means that we should probably take her to the chief.\"<br>\r\n<br>\r\nThey both nodded, and Tom grabbed the net, cut it loose with his sharp claw, and carried her so easily that Mina guessed she weighed as much as a ragged doll to them.<br>\r\n<br>\r\nThe catgirl begged and pleaded for them to let her go, but they ignored her. Soon she gave up, allowing herself to be taken away.<br>\r\n<br>\r\nBut should we stay with Mina? Or should we switch to Sam?</span></div></div>",
            "created":1485119460,
            "id":2267464,
            "title":"Split up and captured."
        },
        "133":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Jessie's beach blowout",
                "Trisha's nature run",
                "Rita's shopping spree"
            ],
            "content":"<div class=\"\"><div> <span>The giggling of three 21 year old girls start to erupt from the boat as the trio comes off. These girls had planned to go to an island resort for some time and would hurry to drop their stuff off at the hotel they would rest at for the time being. The more effeminate of the three, a blonde greyhound named Jessie dressed in mostly a pink skirt and matching tank top, opened the hotel door and tossed her bag on the bed. \"This one is mine. I called it.\" <br>\r\n<br>\r\nThe second bed would be shared by the next two girls. They were a more athletic, but shorter, doberman with short black hair and sweats named Trisha and a lightly tubby, artsy sabertooth tiger with dyed blue bangs and loose clothing named Rita. <br>\r\n<br>\r\nThe girls unpacked clothes while keeping small bags and money just in case they saw souvenirs to buy. They also planned to split up and scout for interesting places and things to do. Jessie jumped on the idea of heading to the coast, already changing into a red bikini. Trisha decided to check more close to the jungles and hiking trails to save Rita from doing a lot of hiking herself, leaving her with the commercial shopping and dining areas.</span></div></div>",
            "created":1534404720,
            "id":2534340,
            "title":"Spring break"
        },
        "134":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "His now overweight mother",
                "A couple of chubby greeters",
                "A female fox android guide"
            ],
            "content":"<div class=\"\"><div> <span>The dark brown furred, lanky otter had recently been given his twenty first birthday by his friends with strippers booze and such, but a card from his mother, who had not been seen in a while, popped up with a ticket to some Blubber Belly Island. He didn't know this place, but after asking his dad he figured out this was one of the places his mom owned. <br>\r\n<br>\r\nSince she never answered calls or emails, Damian could finally see her. He got on a boat and headed out while doing any research he could on his phone. This place is pretty obscure with stuff mentioning obesity and some sort of resort. He shrugged it off and was soon on his way to BB Island. He saw the single large tower near the center of the island as it came up, but the rest were smaller buildings that were most likely 50% residential and 50% tourist stuff. <br>\r\n<br>\r\nThe boat docks with a decent greeting from...</span></div></div>",
            "created":1513835160,
            "id":2430878,
            "title":"Damian the 21 year old otter"
        },
        "135":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Begin",
                "Begin",
                "Begin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More beginnings for you.</span></div></span></div>",
            "created":1567876320,
            "id":2714679,
            "title":"More beginnings"
        },
        "14":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Begin",
                "Begin",
                "Begin",
                "Begin",
                "More beginnings"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your exact age and animal species is up to you.</span></div></span></div>",
            "created":1340427600,
            "id":1365658,
            "title":"Middle-Aged (40-64)"
        },
        "15":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "Begin",
                "Begin",
                "Begin",
                "Begin",
                "More beginnngs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your exact age and animal species is up to you.</span></div></span></div>",
            "created":1340427600,
            "id":1365655,
            "title":"A Senior Citizen (65+)"
        }
    },
    "info":{
        "author_id":"dbzfan123",
        "author_name":"Logan",
        "brief_description":"Exactly what it says on the tin.",
        "created":1340472300,
        "description":"<td align=\"left\" class=\"norm\">Like the story Blubber Belly Island <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1484991-Blubber-Belly-Island\" target=\"_blank\">http://www.writing.com/main/interact/item_id/1484991-Blubber-Belly-Island</a> only with furries, anthros, whatever you call them. Pokemon anthros are also allowed. Digimon are also allowed. Sex is not only allowed, but it's also highly encouraged (as long as the characters are at least 18).<br>\r\n<br>\r\nOnly 4 rules:<br>\r\n1: No sex involving characters under the age of 18; chapters that violate this will either be edited or deleted.<br>\r\n2: No scat or watersports. Let's keep that stuff out of this story. Any chapters involving scat or watersports WILL BE DELETED.<br>\r\n3: No death, or obesity-related illnesses. We shall imagine that the inhabitants are immortal and that being fat is healthy for you.<br>\r\n4: Please use Spell Check. I will try to fix grammatical and spelling errors, but please be as grammatically correct as possible; don't make things hard for me.<br>\r\n<br>\r\nOther than that, go nuts.<br>\r\n<br>\r\nEDIT 2/13/13: If you're offended by any of the material in this story, turn away... Or, better yet, don't complain and go along with it &gt;:3<br>\r\n<br>\r\nUPDATE 4/12/20: I am making three changes to this story:<br>\r\n<br>\r\n1: I have recently learned that the original Blubber Belly Island story has either been deleted or made private. In light of this, I am now allowing humans characters in this story. However, please remember to include furries alongside any humans; \"Furry version\" is in the title for a reason.<br>\r\n<br>\r\n2: This is somewhat related to the previous change, but with <i>Animal Crossing: New Horizons</i> being released last month (at the time of writing, at least), I am allowing you to include your favorite <i>Animal Crossing</i> characters if you so wish.<br>\r\n<br>\r\n3: I am now allowing other fetishes to be included in this story. Feel free to add inflation, vore (with reformation; remember that death is not allowed), transformation, macro/micro, etc., but remember that weight gain is the focus of this story.</td>",
        "id":1875442,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586747040,
        "modified":1586747040,
        "pretty_title":"Blubber Belly Island, Furry version"
    }
}