{
    "chapters":{
        "1":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                "Aw Right! Let's Dive Into The Story ..."
            ],
            "content":"<div class=\"\"><div> <span>Latushin is a continent surrounded by ocean. It's shaped more-or-less like a rectangle, though there are irregularities, as on any coastline: Inlets, bays, rock formations jutting from the land, and other geological oddities. The ocean has no name; as far as the inhabitants know, it's the only ocean there is, so there is no need to distinguish it from other oceans. They do refer to it as the \"north ocean\" or the \"east ocean\" depending on what side of Latushin they're talking about.<br>\r\n<br>\r\nLatushin is approximately the size of Utah, Colorado, Arizona, and New Mexico put together. Not big as continents go, but remember, the inhabitants don't have self-propelled vehicles, and only the wealthy ride horses. It's plenty big enough to intimidate travelers on foot.<br>\r\n<br>\r\nThe NoTell Mountains run west to east along the entire width of Latushin, a few miles from its southern edge. The narrow strip of land to the south of the NoTell mountains is called the UnKnown Land. None of the characters have ever been there, though some have speculated about what lies there. The NoTell Mountains are so named because no one who tried to cross them into the UnKnown Land has ever returned to <i>tell</i> what's there.<br>\r\n<br>\r\nThe country of Goerthe covers eighty percent of the inhabited part of Latushin, that is, north of the NoTell Mountains. Boutland is small country occupying the northwest corner of the continent. The terrain of Boutland is mostly tundra. It is less than desirable for farming or raising livestock, but the hardy Boutlanders have managed to make do over the centuries.<br>\r\n<br>\r\nBoutland came into existence three hundred years ago when a wizard named Elshin petitioned the King of Goerthe for a permanent sanctuary for his followers. A religion called Diaballicism had taken hold in Goethe. The Diaballicans believed, among other tenets, that magic was the devil’s work and corrupted those who practiced it.<br>\r\n<br>\r\nElshin considered magic a tool, neither evil nor virtuous. He believed some people had inherent magic ability, in the same way some men have physical strength or some women possess graceful beauty. He also thought those born with magic ability had to practice it continually, else their skills withered. And he would have all children taught magic, because even those with no inherent ability could learn some practical spells. <br>\r\n<br>\r\nThe Diaballicans persecuted Elshin as only those consumed with religious fervor can. They pushed to have all wizards executed. The King, who had benefited from magic throughout his career, dismissed that demand. But the Diaballican priests whipped the populace into such an anti-magic frenzy that Elshin feared for the safety of all wizards, and even non-wizards who employed magic. He asked the King for permission to found a separate country. The Diaballicans by that time had influence at all levels of government and the economy, and fought the King. The King had just enough power to provide safe passage for Elshin’s band to Boutland and declare it an autonomous country.<br>\r\n<br>\r\nOver the years, relations between Goerthe and Boutland have run hot and cold. Goerthe, of course, has the military might to wipe out Boutland, but no particular reason to do so. A few years ago, there was an incident at a town called Delta, a seaport at the mouth of the Riparian River. A Goerthe family was massacred, and evidence pointed to magic ritual. No one was ever formally accused, but since then, travel between the countries is restricted.<br>\r\n<br>\r\nThe Riparian River runs from south to north almost the entire length of Latushin. It’s not quite in the middle of the continent, but more westerly. The northern part of it forms a border between Goerthe and Boutland. Neither country has a navy or merchant marine of any consequence, but Boutland has begun building warships since political relations with Goerthe appear headed downhill. They are also beefing up their meager army.<br>\r\n<br>\r\nThe Goerthe capital city of Zormine is a port on the Riparian farther south than the point it becomes the border. The only other cities of any size in Goerthe are Effluent, near the eastern sea, but somewhat inland, and Delta, at the mouth of the Riparian. <br>\r\n<br>\r\nThe Boutland city of Delta is across the river from its counterpart. It’s one place on Latushin where citizens of both countries mix freely, in spite of the tragic murder of the Goerthe family. Taverns and merchants on one side of the river accept currency from the other.<br>\r\n<br>\r\nA smaller river, the Polona, runs easterly through Boutland and joins the Riparian near the country’s southern border. Boutland’s largest city, Robles, is on the Polona, about midway between the Riparian and the western ocean.<br>\r\n<br>\r\nOf course, hamlets and villages dot both countries, especially along trade routes, the coast, and the rivers.<br>\r\n<br>\r\nThe largely unexplored Xemolene Forest covers most of the eastern part of Goerthe, from the NoTell Mountains to just south of Effluent. It’s a mountainous area, and few people live near it. Those that do seem superstitious - They report strange, screeching noises from the woods, and tell of hunters who wandered into the forest and were never seen again.<br>\r\n<br>\r\nTo the northwest of Xemolene Forest lies SinkMore Swamp. It’s a dangerous place both because of the alligators and because it’s impossible to tell exactly where the land ends and the water begins. There are verified stories of people near the swamp suddenly disappearing into a sinkhole. In addition to the alligators, there may be … Other creatures. <br>\r\n<br>\r\n<b> Introducing The Cast</b><br>\r\n<br>\r\n<b>Goethe</b>:<br>\r\n<br>\r\nBrothgard: King - A conscientious man who tries to rule wisely, but suffers from human frailty.<br>\r\nWilsa: Queen - A strong woman with a forceful personality.<br>\r\nStigson: Their teen-age son - He’s … Well, he’s a teenager.<br>\r\nTreela. Stigson’s twin sister. She is the elder by a few minutes.<br>\r\n<br>\r\nXflan: A Diaballican priest. He conducts services at the chapel in Castle Essenmore, where the royal family resides.<br>\r\nCopam: Another Diaballican priest and frequent companion of Xflan. <br>\r\n<br>\r\nMoggerrod (AKA Moggy): The court jester. Does a mean stand-up routine. Books and coordinates entertainment at Castle Essenmore. Is there more to him than meets the eye?? <br>\r\n<br>\r\nNezcur: A brooding, secretive man who lives on the edge of Xemolene forest.<br>\r\nCattatonia: Nezcur’s significant other.<br>\r\nHiss: Cattatonia’s pet snake.<br>\r\n<br>\r\n<b>Boutland</b>:<br>\r\n<br>\r\nJemmer: A caribou rancher living near the northern edge of Boutland, in the village of Der Foon<br>\r\nBaxlana: His wife.<br>\r\nArwell: Their son. <br>\r\n<br>\r\nGreena: Deputy Governor of the northern part of Boutland.<br>\r\nPhleeben: Greena's assistant. An ambitious young man.<br>\r\nProfessor Homby: An instructor of magic at Der Foon School, and occasional advisor to Greena.<br>\r\n<br>\r\nIn addition, we have two characters whose location is unknown:<br>\r\n<br>\r\nDread: A mythical creature who, according to legend, shows up at random times in random places. Sometimes he helps people, but more often brings terror and destruction.<br>\r\nPuma: Dread’s pet cat.<br>\r\n<br>\r\nOK, let’s see … We’ve got characters and location. What next?? Oh, of course! We need plot and conflict.</span></div></div>",
            "created":1227950220,
            "id":614354,
            "title":"The Where And The Who"
        },
        "11":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                "One Month Later ..."
            ],
            "content":"<div class=\"\"><div> <span>“Tea?” offered Xflan.<br>\r\n<br>\r\n“Sure,” agreed Copam. “Green Lion, if you’ve got it.”<br>\r\n<br>\r\nXflan filled two cups with water from a large urn. He placed his hands over the and started to chant the heating incantation, but then caught movement out of the corner of his eye. ”You idiot!” he hissed at Copam. “Close that door.”<br>\r\n<br>\r\n“Oh, sorry,’ Copam hurriedly complied, and made sure it was locked. “Thank you,” he said as Xflan set the steaming hot cup in front of him. Xflan had summoned Copam to his quarters on the fourth floor of Castle Essenmore. He politely sipped his tea, waiting for the other priest to say what was on his mind.<br>\r\n<br>\r\n“Boutland is sending missionaries throughout Goerthe, trying to convince citizens to use magic in their everyday lives,” said Xflan.<br>\r\n<br>\r\nCopan waved a dismissive hand. “They’ve been doing that for years. And they aren’t exactly missionaries. They don’t preach any religion or moral code.”<br>\r\n<br>\r\n“I know. That’s what makes them dangerous. They go into a village, maybe show dairy farmers how magic can increase milk yield, or tell homesteaders where to dig their wells. If somebody’s kid has the galloping crud, they cure it, then they go on their way.”<br>\r\n<br>\r\n“Yes.” Copam nodded. “What’s wrong with that? Magic is not outlawed, you know.”<br>\r\n<br>\r\n“It’s a threat to us, that’s what’s wrong with it.” Xflan pressed his thin lips together. “We - I mean we Diaballicans - Have spent centuries weaning the people off magic. Our religion prohibits magic.” He stood up, waving his arms. “Listen, Boutland is seeking to undermine our authority in Goerthe. Mark my words, Copam, their goal is to turn our own citizens against us. To reintroduce widespread magic and position themselves as leaders to whom the people turn in times of trouble.”<br>\r\n<br>\r\n“Aren’t you a bit melodramatic,” asked Copam. “True, we haven’t been able to make Diaballicism the only legal religion of Goerthe, but we call the shots. King Brothgard won’t blow his nose without asking your permission.”<br>\r\n<br>\r\n“I don’t have as much influence over him as you think,” said Xflan. “When I bring up the possibility of outlawing magic, he tells me to forget it.”<br>\r\n<br>\r\n“Hmm. And I suppose it’s no use telling him Boutland is a threat to us and, therefore, to him?”<br>\r\n<br>\r\n“Oh, he wants to cozy up with Boutland,” Xflan said in disgust. “He’s invited a delegation to come stay at Essenmore for the feast of Axeshame next month.”<br>\r\n<br>\r\n“The feast of Axeshame? Boutland won’t send a delegation to celebrate the main holiday on the Diaballican calendar.” Copam picked up his teacup.<br>\r\n<br>\r\n“Oh yes they will,” corrected Xflan. “The Assistant Governor is coming, along with several other dignitaries and their entourage.”<br>\r\n<br>\r\n“Really? Odd,” observed Copam.<br>\r\n<br>\r\n“Not odd. Those Boutland warlocks plan to turn Brothgard’s head with a few parlor tricks. They want him to take restrictions off magic and diminish the Diaballican influence.”<br>\r\n<br>\r\n“That is bad. Once the people have free access to magic, there’ll be no way to stop it from spreading.” Copam pondered a moment. “We’ll look like fools and despots for having preached against magic for so long.”<br>\r\n<br>\r\n“That’s what I’ve been trying to tell you.” Xflan raised his voice. “’Scuse me, old friend.” He pointed to the empty cups and saucers, which lifted off the table and deposited themselves gently in the sink. “But if the Boutland necromancers were to tip their hand, to reveal their true intentions, Brothgard would crack down on magic. He would either destroy Boutland, or at least seal their border so no magician could work his nefarious evil in Goerthe.” <br>\r\n<br>\r\nCopam frowned. He doubted anybody from Boutand would commit any blatant acts against Goerthe or the Diaballican Church.<br>\r\n<br>\r\n“Furthermore, if he were to suffer a personal tragedy, he would turn to his Diaballican pastor for comfort.” Xflan nodded apparently satisfied with his reasoning. “When we have firmly reestablished ourselves as the power behind the throne, <i>we</i> will introduce magic to Goerthe again. On <i>our</i> terms.” He nodded again, and candles around the room sprung to life against the encroaching darkness.  <br>\r\n<br>\r\nCopam, perhaps not the sharpest knife in the drawer, did not see where Xflan was headed with this.</span></div></div>",
            "created":1228038360,
            "id":614130,
            "title":"A Conspiracy Of Priests"
        },
        "111":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                "Arwell Leaves To Join His Squadron",
                "Arwell Opts To Stay Home"
            ],
            "content":"<div class=\"\"><div> <span>Arwell got dressed silently in the morning chill and built a fire in the hearth. By the time Mom and Dad woke up, the house would be above freezing, if not exactly toasty warm. Shivering, he grabbed the two large pails and headed for the well. The pails full, he attached one to the hook above the fire. Most of their neighbors heated water with a simple magic spell. It was fast and reliable, and the family had enough hot water for a full day of bathing, washing and cooking. Dad refused to use magic, save in the most dire circumstances.<br>\r\n<br>\r\nSchool was not in session just now, since Professor Homby had accompanied Deputy Governor Greena to the Feast of Axeshame in Zormine. Arwell had all morning to finish his chores, but was used to getting them done before breakfast. He checked the wagon, applying grease to one of the wheels. He dropped several bales of hay from the loft onto the wagon. Those caribou are spoiled, he muttered to himself. Before we came, they got by in the winters with nobody bringing them hay. Of course, he reminded himself, before we came, they didn’t get slaughtered every year either.  <br>\r\n<br>\r\nMom made griddlecakes with caribou sausage for breakfast. Arwell dug in like a trencherman. <br>\r\n<br>\r\n“Learned any magic at school?” asked Dad around a mouthful of cake.<br>\r\n<br>\r\n“A little,” replied Arwell. “I could heat a few liters of water in the mornings. Make it easier for Mom to get started cooking and do laundry.”<br>\r\n<br>\r\n“No, son. We’ve talked about this. I’m glad you’re studying magic, but I want you - I want all of us - To learn to survive without it. Who knows what the future holds? Maybe you’ll end up in Goerthe, where the Diaballicans will ride you out of town on a rail for practicing magic.”<br>\r\n<br>\r\n “I wish Greena and Homby hadn’t gone to that Diaballican festival in Zormine,” put in Mom. “Those people <i>hate</i> us. Why should our leaders associate with them at all?”<br>\r\n<br>\r\n“I think it’s a good idea,” said Arwell. “The reason they hate us is because they don’t know us. Once the Goerthens learn we’re regular folks, like them, they won’t be so hostile.”<br>\r\n<br>\r\n“Aye,” agreed Dad. “The tension between our countries is growing. If we don’t try to defuse it, who knows what might happen?”<br>\r\n<br>\r\n“Arwell, do you have cadet training this afternoon?” asked Mom. All persons, male and female, between fourteen and twenty had to participate in the military, either as reserves or full time soldiers. Baxlana was very aware that her son might someday have to march to battle against the superior Goerthe army.<br>\r\n<br>\r\n“Yes. School’s closed, but we’re still working on <i>Old Frigate</i>.” Arwell had finished basic training and applied to serve in Boutland’s fledgling navy. Problem was, Boutland had no war ships of any kind. <i>Old Frigate</i> was a freight ship, hauling mostly lumber from inland forests down the Polona to growing communities along the Riparian. Arwell and his squad spent their three hours a day rigging the schooner as a fighting vessel. <br>\r\n<br>\r\n A sharp rap came from the door. All three family members stopped chewing and looked at each other. They seldom had company, and never at breakfast time. Dad got up and opened the door.<br>\r\n<br>\r\nPhleeben stood there. A slight, sandy-haired man, he appeared the same age as Arwell, though he was nearly thirty. He wore only a light cloak over the traditional Boutland toga, his magic obviously keeping him warm. Arwell’s first thought was a twinge of jealously that the man used magic so freely. His second was: Governor Greena’s  assistant <i>here</i>?<br>\r\n<br>\r\nDad held the door wide. “Please come in, Assistant Phleeben.”<br>\r\n<br>\r\n“Thank you, Jemmer, but no time. Prince Stigson was assassinated last night. Evidence points to a member of Governor Greena’s traveling party. There may be war.” He looked past Dad, to the two people sitting at the table in obvious astonishment. “Cadet Arwell, we are mobilizing your unit. Please report for duty immediately.”<br>\r\n<br>\r\n“NO!” cried Mom. “He’s too young!”<br>\r\n<br>\r\nPhleeben stepped back from the door. “I have other households to notify. Good day to you.”<br>\r\n<br>\r\nArwell wasn’t so ravenously hungry anymore. He sat staring at the table, trying in vain to speculate on his fate. Somebody murdered the heir to the throne of Goerthe? What could Greena, or anybody in Boutland for that matter, gain by such violence? Would they launch <i>Old Frigate</i> against Goerthe? Since the ship wasn’t ready and her crew not trained, would they transfer him to the infantry? <br>\r\n<br>\r\n“Arwell,” said Mom sharply, “you must not go. We can plead hardship. Your father cannot handle the caribou herd without your help.”<br>\r\n<br>\r\nThat wasn’t quite factual. Dad already did pretty much everything except the few chores Arwell did before breakfast. Still, Arwell told himself, he’d be aiding the war effort if he stayed here. After all, <i>somebody</i> had to provide food and leather goods to the fighting men.<br>\r\n</span></div></div>",
            "created":1228093260,
            "id":613855,
            "title":"Breakfast Interrupted."
        },
        "1111":{
            "choices":[
                "Go see the situation in Goerthe.",
                "What is the Priest up to?",
                "Continue with Arwell."
            ],
            "content":"<div class=\"\"><div> <span>Arwell shook his head, his stomach rebelling wildly against the choice he had made. \"Mom, we knew this was going to happen some day. I work as a soldier to help protect you and dad. And my unit needs me. I'd let them down.\" He stood, walking back towards his room to pack his gear.<br>\r\n<br>\r\nBaxlana's face drained of color and she leaped towards her son, grabbing the back of his shirt, nearly tripping him. \"No! Please, Arwell, you mustn't! You can't! You'll die! Those barbarians will chop you to bits and leave you dead on some battle field in Goerthe! I'll - I'll never-\"<br>\r\n<br>\r\nArwell spun around, shaking. He was scared and angry and the choice was hard enough without his mother crying. \"This isn't the time to be a coward mom! It's now or never! If I don't go we might all get massacred here!\" Leaving that as his final word on the matter, he stormed back to his room and began shoving his uniform and other supplies into a rucksack given to all recruits for just such and occasion. Through the thin door he could hear his mother and father arguing.<br>\r\n<br>\r\n\"Jemmer, how can you just sit there!? He's going off to die! What happens if you hurt yourself?! Or if you get sick?! I don't want to be left alone out here on this blasted farm all alone!\" She sounded as if she were a moment from tears.<br>\r\n<br>\r\n\"I know 'Lana, I know. But the boy's determined. If he says he going we have no way to stop him. It's the law. He has to go.\" His father's voice, too, sounded strained, as if he were fighting back some sort of guttural scream of protest.<br>\r\n<br>\r\nSomething wet dropped onto his hand and Arwell looked down in surprise to see a tear drop on his hand. Quickly wiping his eyes, he stood up, closed his bag, and steeled himself for the journey ahead. It would not be an easy one. <br>\r\n<br>\r\nHe opened his door and walked back to the kitchen. His mother stood in a corner, hugging her arms around herself, trying to hold back tear. His father still sat at the table, his eyes down cast, every muscle in his body tense. <br>\r\n<br>\r\nArwell went to his mother first, his heart tight in his chest. He gave her a hug and a kiss as she tried even harder not to cry. He then went over to his father. All those years watching him, and copying him. Doing everything just like him. And now for once he had to go where his father had not gone before. <br>\r\n<br>\r\n\"G'bye, dad...\" He muttered. He wanted to say more, but the words were caught in his throat. He couldn't lose control in front of them. That would only break their hearts. So he said the rest as he placed a strong hand on his fathers shoulder. He turned to leave and found that the man had grabbed his arm.<br>\r\n<br>\r\n\"Dad?\" He asked. \"I have to-\"<br>\r\n<br>\r\nJust then Jemmer stood, and pulled his son into his arms. Arwell returned the embrace. They broke apart, and Arwell couldn't help but feel a little bit better about leave. More confident. More... ready. <br>\r\n<br>\r\nHe strode to the front door where moments before his destiny had been announced. He opened it onto the cold mornings he was so used to. He pulled his jacket tightly around him and tied his scarf tightly against his neck. He looked back once more at his family and smiled.<br>\r\n<br>\r\n\"I promise, I'm coming back. I'd miss your cooking too much, mom.\" And with that he left, ready to face the future. </span></div></div>",
            "created":1271014860,
            "id":866382,
            "title":"Arwell Leaves To Join His Squadron"
        },
        "11111":{
            "author_id":"kristanigrad",
            "author_name":"kristanigrad",
            "choices":[
                "Morning in Goerthe",
                "Returning to Boutland"
            ],
            "content":"<div class=\"\"><div> <span>\"...and there was blood everywhere.\" Guardsman Thatch concluded grimly. The cloaked figure reclining in a chair grunted. Thatch regarded the other man with his sharp blue eyes. He never felt entirely comfortable around Cobalt, which was bizarre, considering Thatch was a seasoned veteran of the Effluent Guards, thirty-six years old with twenty hard years of service to the King. Whereas this kid had never even seen so much as a bar-fight, to Thatch's knowledge. He'd lived locked up in a monastery for his life, being taught who knows what, then thrust into the real world to serve in a special role Thatch had never even heard of. He had no experience of the real world, Thatch felt, all the stuff the priests had been putting into his head would get him nowhere, except perhaps killed.<br>\r\n<br>\r\nMaybe it was Thatch's paternal instinct, unused since his sons had been sent up to Zormine. At any rate he felt strangely responsible for the kid, even if he wasn't all there, filled with the fancy notions of Diaballicism, clearly vain in his appearance with his sweeping grey cloak, expensive grey gloves. He thought himself a warrior-monk, fighting for the cause of Goerthe against the evil corrupting influence of magicians. He fancied he had an air of mystery about him, which Thatch saw through immediately. Being kept in the monasteries had done him no good. He ought to have been out fighting and playing with kids in the city, getting real life skills. Instead the poor lad was shy and bereft of people skills, and he covered this up by trying to appear mysterious and superior.<br>\r\n<br>\r\nAnd he was nineteen! At his age, Thatch could wield a broadsword and best many a muscle-clad brawler. All he could do, to Thatch's knowledge, was pray, and perhaps display a little aptitude with bow and sword.<br>\r\n<br>\r\nAnd so here they were, in a small, lantern lit room above a tavern, Thatch still in his guardsman uniform, Colbalt lazing in a chair, a book of meaningless scrawls (or so it appeared to the guardsman) lying open on a basic wooden table.<br>\r\n<br>\r\n\"There could be war, you know.\" Thatch tried, to get a reaction from the lad.<br>\r\n<br>\r\nNo response.<br>\r\n<br>\r\n\"Do you know what that would mean?\"<br>\r\n<br>\r\nAfter a pause, the youth replied.<br>\r\n<br>\r\n\"Yes, it would mean an end to the spread of evil in Latushin, a setting to rights of all the evildoers and finally the reabsorbtion of Boutland.\"<br>\r\n<br>\r\nThatch sighed inside his head, \"A lot of innocent blood would be spilled.\"<br>\r\n<br>\r\n\"Granted, but it would be for the cause of Diaballicism, and innocent souls would be granted eternity in Heaven.\"<br>\r\n<br>\r\nThe guardsman gave up, he didn't know why he tried. The kid needed some experience of the real world.<br>\r\n<br>\r\n\"Well,\" Thatch said after another pause, \"I'm on duty in quarter of an hour, goodnight Cobalt.\"<br>\r\n<br>\r\n\"Goodnight, Guardsman Thatch\" Thatch paused imperceptibly at the door, then set off down the landing, stout boots causing floorboards to creak.<br>\r\n<br>\r\nThere was the sound of rain against the dark windows.<br>\r\n<br>\r\nCobalt turned his attention to the book beside him, and turned the page.</span></div></div>",
            "created":1271018280,
            "id":866406,
            "title":"Go see the situation in Goerthe."
        },
        "111111":{
            "choices":[
                "Scry/Converse with Professor Homby",
                "Scry Frillan"
            ],
            "content":"<div class=\"\"><div> <span>Deputy Governor Greena was livid. Locked in her quarters she was completely shut off from the happenings outside, something she should be readily involved with. She should be defending her people, especially Frillan. The young guard had been nothing but a joy to travel with, always keeping the mood light when tensions rose. He was an earnest fellow and one of the better students at the Academy. She hated this waiting around, not knowing what was happening to him. <br>\r\n<br>\r\nMainly she hated waiting. And then also, there was the fact that she was greatly unused to having doors closed on her ever since her appointment to office. <br>\r\n<br>\r\nGreena had always sought information and knowledge, even when she was too young to grasp what she learned. She rose quickly through the academy ranks, Professor Homby's star pupil at Der Foon. She had hated waiting to gain access to the higher level spell books, and had always been scolded when she was found reading them in obscure nooks of the Library. She had been intensely fascinated by the conflict between Goerthe and Boutland, and thus her political drive was established. She was appointed as Deputy Governor six years ago, the youngest in the Nation's history. <br>\r\n<br>\r\nAnd she had thought that her waiting for information was over. Indeed!<br>\r\n<br>\r\n\"Excuse me!\" She announced loudly, her hand cupped around her mouth and pressed to the door. \"But, really, I am the Deputy Governor of Boutland, and it is <i> my </i> guardsman that is ridiculously being accused of this terrible atrocity, and I would very much appreciate being allowed to leave this room!\"<br>\r\n<br>\r\nNo response came from the other side of the heavy oak doors. Frustrated, Greena attempted to pull them open, but the handles were indeed still locked. Normally she would have been able to simply unlock them with a flick of her finger, but she had promised to refrain from magic while inside the castle walls on the request of some of the Priests. She doubted using them to escape from her room would engender any sympathy towards her party or her people who were already under quite enough meaningless suspicion as it was. <br>\r\n<br>\r\nShe sat down in a huff on the edge of her bed, biting her lip in concentration. As long as she was locked in this room, she had to find <i> something </i> to do. Sitting and twiddling her thumbs was not how she had become the youngest Deputy Governor in history. She looked around the room, weighing her options. She was locked away from anyone and everyone. No one could get to her, locked away as she was. Which meant... if she chose to use a little magic <i> inside </i> the room, no one would be the wiser. She could use a listening spell, though she might pick up meaningless chatter since she knew not where they were holding Frillan. <br>\r\n<br>\r\nThen the was the option of scrying. A thin smile appeared and Greena nodded to herself in satisfaction. Much more appropriate, not only would she be able to hear what was happening to Frillan, she would be able to (somewhat) determine where he was. She stood and made her way across the room to the pitcher and wash bin sitting on the bureau. She poured the water from the pitcher liberally into the bowl, removing the towel from it so that the water would settle still and flat. She checked her appearance briefly in the mirror as she summoned up the spell in her minds eye. Just as she was about to begin to chant she fell silent, unsure. <br>\r\n<br>\r\nShe looked back down at the still water, now thinking of her elderly mentor and advisor, Professor Homby. Should she attempt to contact him first, and get his opinion on the matter? Or should she check on Frillan first, who was more likely in greater peril?</span></div></div>",
            "created":1271031840,
            "id":866534,
            "title":"Greena's Irritation"
        },
        "1111112":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                "Greena attempts to get to the bottom of the trumped-up accusations.",
                "See what Arwell is up to in Boutland."
            ],
            "content":"<div class=\"\"><div> <span>Professor Homby, Greena concluded, was likely confined to quarters like herself. She wanted - she <i>needed</i> - his advice, but better to learn what she could about Frillan and the rest of their party before consulting him. She put a couple of pillows on her chair so she could sit comfortably and gaze into the water without craning her neck. Given time, she could zero in on Frillan's essence, but it would be far easier if she knew exactly <i>where</i> in this enormous castle he was.<br>\r\n<br>\r\nShe let her mind roam as it would. Frillan was not on this, the third floor, nor the one above, the royal family's living quarters. Something tugged at her mind. Not Frillan; rather something intense but unfocused. A man – Definitely a man – with great but untrained magic. Greena leaned forward now, seeing into a dark room. A man wearing the robes of a Diaballican monk sat reading a thick book by the light of a single candle. <i>He doesn't know. Potentially the most powerful wizard in the history of Latushin, and he doesn't know he has magical ability</i>. She filed that information away. Who knew, perhaps he would be an ally if the Boutlanders could teach him to channel and control his power. He certainly wouldn't learn it from the Diaballicans!<br>\r\n<br>\r\nGreena mentally left the monk's room. She sensed a large gathering of people on the ground floor. Was Frillan there? No way to tell with the essences of so many people assailing her mind. She “entered” the room, looking down on the scene as if she were on the ceiling. It was the Great Hall, where King Brothgard and his family had received the Boutland traveling party two days before. Now it had been partitioned into a kind of courtroom, Greena saw. Spectators filled two thirds of the hall. Guards and a rope barrier kept them from the other third, where Frillan sat at a table with another man. Frillan's hands were shackled to his waist.<br>\r\n<br>\r\nTwo other men sat at another table, also facing the front of the room. Yet another table was at the front of the room. It was elevated slightly, and a stern-looking man wearing a black robe faced the back of the room. King Brothgard sat off to the side beside his wife and daughter. Brothgard's glare took in the entire room, but settled on Frillan. Queen Wilsa had a protective arm around Princess Streela, who dabbed at her eyes with a dainty handkerchief.<br>\r\n<br>\r\nAs Greena watched a young man wearing the uniform of the elite Effluent Guard detached himself from the spectators and stepped over the rope barrier into the section where Frillan sat looking around in wide-eyed panic. The man in black, apparently the judge, said something to the Guardsman. Greena couldn't make out the words. The judge pointed to a chair beside his own but not elevated.<br>\r\n<br>\r\nAs the guardsman sat, a man rose from the table opposite Frillan's. “Guardsman Thatch,” said the man. “You were on duty last night at the royal family's quarters?”<br>\r\n<br>\r\n“Yes, Sir. I was at my post, near the top of the stairway. Everything was quiet, normal, till about two hours past midnight.”\t <br>\r\n<br>\r\n“And what happened at that time?” asked the man. Greena assumed he was the prosecutor.<br>\r\n<br>\r\n “I heard a scream from down the hall,” said Thatch. “Not articulate – Just a noise, no words.”<br>\r\n<br>\r\n“Could you tell <i>who</i> was screaming?”<br>\r\n<br>\r\n“No. It sounded male, but I couldn't even be sure of that.”<br>\r\n<br>\r\n“You investigated?” prompted the Prosecutor.<br>\r\n<br>\r\n“Immediately, Sir,” said Thatch earnestly. “The moment I started down the hall, Prince Stigson's bedroom door opened. A man came into the hall, walking unsteadily, reeling, I should say.”<br>\r\n<br>\r\n“Were you able to see who the man was that emerged from the Prince's bed chamber?”<br>\r\n<br>\r\n“Yes, Two torches burn all night in the hall, and candlelight spilled out from the Prince's open door.”<br>\r\n<br>\r\nThe Prosecutor put his hands behind his back and looked at the floor, as though deep in thought. After a few seconds, he raised his eyes to Thatch and asked, “Who was the man?”<br>\r\n<br>\r\nWith no hesitation, the Guardsman pointed to Frillan, “The defendant.”<br>\r\n<br>\r\nFrillan jumped to his feet. “I don't know how I got there. I was sound asleep and I woke up on my feet in a strange bed chamber.” He was shouting now. “Prince Stigson was half in the bed and half on the floor. He was covered with ...” The other man at Frillan's table pulled him back to his seat rather roughly.<br>\r\n<br>\r\n“I'll not tolerate another outburst, Mr Frillan,” said the judge. “You'll have a chance to speak.” He glared at the spectators till the buzz quieted down.<br>\r\n<br>\r\nThe Prosecutor turned to face Thatch again. “Guardsman Thatch, how could this young man have gained access to the royal family's living quarters with <i>you</i> on duty?” Thatch seemed to mumble something. The prosecutor said, “I can't hear you.”<br>\r\n<br>\r\n“I don't know, Sir.” This time Thatch's voice was loud and clear.<br>\r\n<br>\r\n“Well, I <i>do</i> know how.” The Prosecutor addressed his words to the judge. “Your Honor, Subsequent witnesses will testify that the witches and warlocks from Boutland are quite capable of spiriting an assassin past even so vigilant a sentinel as Guardsman Thatch.” He walked to Frillan's table and glowered down at him. “Don't worry, Mr. Frillan, I know you didn't concoct this murderous plot yourself. Oh, you'll hang for it, but you won't hang alone. Who ordered you to kill the heir to the Goerthe throne?” <br>\r\n<br>\r\nFrillan sunk lower in his chair, shaking his head. Greena thought he was weeping. <br>\r\nThe Prosecutor was wound up now. “Who translocated you to Prince Stigson's sleeping quarters? That Greena woman? The old man, Homby?” He stepped back, glanced briefly at the judge and Thatch, then turned to address the spectators. “I <i>will</i> find out who murdered your beloved Prince, and why.” He looked back at Frillan. “By the time I'm finished with him, this cutthroat punk will <i>beg</i> to tell me everything he knows.”<br>\r\n<br>\r\nGreena sat back, trying to make sense of the scene she had witnessed. Some individual or faction inside the Goerthe government was setting up the Boutland traveling party. But why? Who stood to gain from the execution of the Boutlanders? <br>\r\n<br>\r\nGreena only knew one thing for certain: She couldn't stay cooped up in this room any longer.</span></div></div>",
            "created":1271661240,
            "id":870156,
            "title":"CourtRoom Drama"
        },
        "11111121":{
            "choices":[
                "During Moggy's comedy show Professor Homby spots a peculiar cat",
                "Let's see how Arwell is doing"
            ],
            "content":"<div class=\"\"><div> <span>Governor Greena had to get to the bottom of these absurd accusations. She knew that Frillan was innocent. She knew that the Diaballicans were self-serving hypocrites who only cared about power. She doesn't know if anyone in Goethe is secretly practicing magic, but if she could find the real culprit then that may help. Yet, there was one thing that bugged her and she was afraid to consider that <i>he</i> may be involved.<br>\r\n<br>\r\nJudging by how Frillan was spotted in Prince Stigson's chambers late at night and with no memory confirmed that either Frillan was under a trance or possessed by some creature. In her studies she has learned of a creature called Dread. According to the myths he is the bringer of death and destruction. Sometimes he helps people, only if it isn't their time to die. Still she would have to look at all possible suspects, even traitors from Boutland. If her list of suspects runs short she'll have to assume that Frillan was possessed by Dread.<br>\r\n<br>\r\nNormally if someone is possessed by Dread they are usually sound asleep and have no memory of what they did while possessed. Once Dread possesses a person he makes them do anything that would throw nations in chaos, such as killing a princess. In short, Dread can be described as something akin to to Grim Reaper, but not exactly one himself. Myths describe him as an ageless young man who has lived for centuries with his cat Puma. The only way to know if Dread is nearby is if Puma, a black female cat with blue eyes, appears by Dread's intended target.<br>\r\n<br>\r\nGreena considered using magic, but that might only make matters worse. Fortunately there was a knock on the door. This may be the chance that Greena has to save Frillan's life and perhaps offer her own insight on the situation. If she could find the perpetraitor then Frillan would be free and war will not devestate the kingdoms.<br>\r\n<br>\r\n\"Govenor Greena, you have been summoned by King Brothgard,\" said a female voice.<br>\r\n<br>\r\nThe voice belonged to Sister Nuemora, a priestess who is exceedingly loyal to the Diaballican church. Like Cobalt and every other acolyte she was indoctrinated by the church to despise magic. Like other children she was taught that the words from Pope Agithalia were words of righteousness, despite how hateful they were. The pope herself was the third pope to be inaugurated. Greena has heard of the Diaballican popes. It seemed that each new pope was more corrupt than the last.<br>\r\n<br>\r\nThe doors to Govenor Greena's room opened. Before her stood Nuemora, a twenty year old woman with red hair and grey eyes. She was wearing a grey dress and gray gloves like most priestesses. Over her dress she wore a grayish-blue satchel adorned with a blossom; the number of blossoms on a priestess's satchel indicated her standing and dedication to the Diaballican church. Priests and monks rarely wore satchels since they were considered equals to the priestesses in almost everything. Greena follows Nuemore to the Great Hall.<br>\r\n<br>\r\nOnce she was in the Great Hall, Greena was escorted to an empty chair. After taking a seat the Prosecutor proceeded to ask Greena questions.<br>\r\n<br>\r\n\"Govenor Greena, how long were you plotting to murder the late prince?\"<br>\r\n<br>\r\n\"What kind of question is that. I would never play a part in something as diabolical as that.\"<br>\r\n<br>\r\n\"If that is the case then should we assume that your mentor plotted this heinous crime all along?\"<br>\r\n<br>\r\nHaving had enough of the Prosecutors questions, Governor Greena couldn't contain her anger any longer.<br>\r\n<br>\r\n\"Your Honor, none of us here are guilty for the murder of the prince. We will gladly resurrect the heir to the Goethe throne, but I believe that Mr. Frillan was either under a trance or possessed when Prince Stigson was murdered.\"<br>\r\n<br>\r\n\"Objection!\", Nuemora yelled. \"How do we know that this isn't some ploy to let the blasphemers of the Holy Mother go? For all we know that witch could be plotting to destroy our fair nation!\"<br>\r\n<br>\r\n\"Overruled! My younger brother may have been murdered, but we should not dismiss Governor Greena. Wouldn't you agree father?\"<br>\r\n<br>\r\nGreena was shocked to hear that coming from Princess Treela, but she could tell that Princess Treela wasn't as quick to jump to conclusions like some of the others present in the Great Hall.<br>\r\n<br>\r\n\"Um... I'm not really sure what to say,\" replied King Brothgard. \"Even if we did consider that Mr. Frillan was not in control of himself at the time no one here would be satisfied until they see him hang. I wish I knew what to say, but I don't want the city to erupt into a civil war.\"<br>\r\n<br>\r\n\"Oh for crying out loud! Now's not the time not to have a spine! We should definitely have the Governor resurrect our son and find the perpetrator. If no perpetrator is found or if she and all in her company try to escape before the perpetrator is found, then they shall be severely punished!\"<br>\r\n<br>\r\nGreena looked at Queen Wilsa with awe. It was clearly obvious that Wilsa always trumped her husband when making decisions. No one in the room dared to speak against the queen. It made sense that Treela would acquire her disposition from her mother. Greena may have spotted her crying earlier, but she seemed to have quickly moved past that and is determined to find the real killer herself.<br>\r\n<br>\r\n\"The Queen has spoken. The accused have to resurrect Prince Stigson and find who among them has entranced Mr. Frillan into murdering the prince or if there may be any traitors within our walls. They will have two weeks before they will have to report to the Great Hall with their findings. Failure to find any leads warrants death. Court dismissed!\"<br>\r\n<br>\r\nEveryone leaves except the royal family, Guardsman Thatch, Frillan, and Governor Greena. Princess Treela speaks up after a few moments of silence.<br>\r\n<br>\r\n\"Governor Greena, do you have any ideas on how you can find my brother's murderer?\"<br>\r\n<br>\r\n\"I do, but we'll be required to use magic in order to do so. My theory is that someone in the Goethe is responsible. I am also considering that a creature that has no ties to this kingdom may have also been involved. To find out if this creature is responsible we'll have to resurrect the prince.\"<br>\r\n<br>\r\n\"Your idea may have some validity to it. There was no way that anyone from Boutland could know where Prince Stigson's chambers were. I bet it could of been one of the priests or maybe Moggy. Those would be my prime suspects,\" Guardsman Thatch replied.<br>\r\n<br>\r\n\"Did someone mention my name?\"<br>\r\n<br>\r\nMoggerod comes cartwheeling into the Great Hall. Once in the Great Hall he takes a few bows before speaking. Clearly the jester enjoyed putting on quite a show.<br>\r\n<br>\r\n\"I've heard that there was quite a commotion and I had to come see for myself. I then overhear that you suspect me of murdering our fair prince. To set matters straight I was up all night trying to think of some new material for tonight's show.\"<br>\r\n<br>\r\n\"Is that so Moggy? Do you know anything that may be helpful?\", asked King Brothgard.<br>\r\n<br>\r\n\"I may, but I won't tell anyone yet, unless our guests attend tonight's show. I have some juicy secrets regarding some of the clergy. Whether I tell you is up to our guests. Trust me, this information I have may condemn a few priests and maybe the Holy Mother herself.\"<br>\r\n<br>\r\n\"Very well, we shall see your show tonight,\" Greena said.</span></div></div>",
            "created":1450597140,
            "id":2076869,
            "title":"Getting to the Bottom of Things"
        }
    },
    "info":{
        "author_id":"moonmoth",
        "author_name":"MoonMoth",
        "brief_description":"An exercise in straight storytelling. Help me create an epic, heroic-quest adventure",
        "created":1227940020,
        "description":"<td align=\"left\" class=\"norm\">Have you despaired of ever finding an interactive story that concentrates on character development and plot?? Are you tired of women twenty feet tall and boys ballooning to a thousand pounds?? Are you sick of characters from a video game you never heard of?? Are you fed up with lazy typists and/or morons who use `your’ as a contraction for `you are??’ <br>\r\n<br>\r\nWell, <i>Latushin</i> is for you! A traditional fantasy story, whose plot flows from intriguing characters in a pre-industrial society where magic somewhat compensates for lack of technology. At least, that’s my vision at this time.<br>\r\n<br>\r\nAnyone is welcome to read <i>Latushin</i>, and leave comments or reviews. I ask, however, that only those who seriously want to stay in the spirit of the narrative contribute chapters. I don’t want any time machines showing up, or Super Mario chasing Pokemon into Goerthe. Please check your spelling and grammar. I make typng misteaks two, so I won’t automatically delete a chapter that has `there’ when the writer meant `their,’ but I’d appreciate it if you take care.<br>\r\n<br>\r\nLet's try to keep the story GP rated. We can do without explicit, orifice-by-orifice descriptions of sexual activity. Please avoid preaching. We want to entertain, not expound on the joys of socialism. We're aiming toward a `young adult' audience. <br>\r\n<br>\r\nWrite in the third person. I prefer a limited-knowledge third person narrator, and I always stick with one Point Of View character for an entire chapter. By limited knowledge, I mean the reader can know the POV character's thoughts and emotions, but only the actions of other characters. In other words, if the POV character can deduce that another character is angry, jealous, evil, or whatever, we can share that info with the reader. I'm not a fan of omniscient narrator, but I can live with it.<br>\r\n<br>\r\nI am going to start off the story with quite a bit of detail. I have my own ideas about the physical features of the Latushin continent, the political and social customs, and the individual characters. Please try to stay within the parameters I’ve established. I’ll leave you guys with enough characters, locations, and situations to get the story off to a good start. Please do not introduce a new major character right away. And please do not steer the story into something that does not fit the Heroic Quest-medieval fantasy genre. Sure, we’ll have men who ride horses and tend cattle. We may (Or may not) have indigenous peoples struggling to find their place in a society that is passing them by. We will NOT have cowboys and Indians. <br>\r\n<br>\r\n(Later) I've changed my mind about you not adding characters. We need a variety of characters, both major and minor. If the situation calls for a new character, introduce him or her. If you think the character might play a significant role, tell us a bit about him <br>\r\n<br>\r\nThe first chapter describes the land and characters. We’ll start the story proper in the second chapter.<br>\r\n</td>",
        "id":1500091,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1450597140,
        "modified":1450597140,
        "pretty_title":"Latushin - A Fantasy For Grown-Ups"
    }
}