{
    "chapters":{
        "1":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "high school  boy",
                "high school girl",
                "7-8th grade boy",
                "7-8th grade girl",
                "other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you?</span></div></span></div>",
            "created":1359349200,
            "id":1519060,
            "title":"Start"
        },
        "11":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "you wake up normal",
                "you wake up in Cassandra's room",
                "you wake up with long brown hair",
                "you wake up shorter"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Joseph and you are a 16 year old. You go to Rinderville High School and have a sister named Cassandra, who goes to Rinderville Middle School and is in eighth grade. You are in tenth grade and you have a mediocre life, but your sister is miss popular. You are bored one day and see her having fun, so you wish to be her. You feel tired and take a nap, but before you fall asleep you here Cassandra come in from outside.</span></div></div>",
            "created":1359349200,
            "id":1519071,
            "title":"high school  boy"
        },
        "112":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "go to your old body",
                "explore your new body",
                "faint"
            ],
            "content":"<div class=\"\"><div> <span>You feel groggy as you wake up, and just by opening your eyes, you know something is off. First off, you are in Cassandra's room, and secondly, as you look at the room, you feel a slight weight on your chest and something tickling your neck and back. You look down and, to your shock, see the body of your little sister. The weight you felt on you chest was her newly developing breasts, which were held in place by a training bra. The tickle was her long, smooth brown hair, which flows to about waist length. You also see her, well your, virgin pussy, and you feel yourself getting wet there from the excitement. You are now Cassandra, so you...</span></div></div>",
            "created":1359349200,
            "id":1519077,
            "title":"you wake up in Cassandra's room"
        },
        "1122":{
            "choices":[
                "Your Parents walk in",
                "Cassandra in your body walks in",
                "everyone walks in"
            ],
            "content":"<div class=\"\"><div> <span>Unable to suppress the urge, you allowed you hand to travel down your body, quickly digging into your new pussy. Biting down on your lip, you suppress the need to moan. Before long you allowed your other hand to travel to your chest and beneath the training bra, and began to tweak your nipples. No longer able to suppress it, you let out  a rather large moan. Before long</span></div></div>",
            "created":1536555600,
            "id":2545700,
            "title":"explore your new body"
        },
        "11222":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Pissed",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The second she enters your new room, she is...</span></div></span></div>",
            "created":1539417360,
            "id":2563118,
            "title":"Cassandra in your body walks in"
        },
        "112222":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Embarrassed?</span></div></span></div>",
            "created":1539417360,
            "id":2563119,
            "title":"Other"
        },
        "1122221":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Because you were masterbating in her body",
                "Because she has a crush on you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why was Cassandra embarrassed?</span></div></span></div>",
            "created":1539417960,
            "id":2563122,
            "title":"Embarrassed?"
        },
        "11222212":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "She fingered you before you can react",
                "She forced herself onto you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>“Wow. That...was embarrassing.” Cassandra stated.<br>\r\n<br>\r\n“Sorry. I...couldn’t help myself.” You admitted.<br>\r\n<br>\r\n“I...can help you with that.” She offered.<br>\r\n<br>\r\n“What?” You asked, shocked.<br>\r\n<br>\r\n“I said I can help you with your arousal.” She repeated.<br>\r\n<br>\r\n“....how?”</span></div></div>",
            "created":1570973340,
            "id":2732236,
            "title":"Because she has a crush on you"
        },
        "112222122":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "“Yeah. Let’s not let this be the last time, but keep it a secret.”",
                "“It felt amazing, but we can’t let it happen again.”",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Cassandra suddenly grabbed you and began kissing you. “Hey!” She started fingering your pussy, making your knees weaken as you fall into her arms. You tried to push yourself away from her, but she groped your small, developing breasts, causing you to lose more strength as your new body betrayed you.<br>\r\n<br>\r\nAs you gave in to your new hormones, Cassandra took off her clothes, as well as yours, and started fiercely kissing you all over your new body. Eventually, she inserted her new genitalia into yours, causing you to feel immense pain, before it slowly gave way to pleasure. It was a greater pleasure than you had ever felt before. You were both virgins so you had nothing to compare this new experience to, but it was so immense, you lost yourself in the pleasure and even began kissing Cassandra back.<br>\r\n<br>\r\nLater, you woke up to find your former body, still laying naked next to you. You look down at yourself and saw you were also still naked. You blushed fiercely as you realized you just had sex with your former body, while in your younger sister’s body, which meant you just committed incest. Even though Cassandra initiated the act, you eventually gave in and participated in it yourself. As you thought about what you did, Cassandra, in your body, woke up. “That was amazing, bro. Or should it be sis now?”<br>\r\n<br>\r\n“Uh, listen...” You start.<br>\r\n<br>\r\n“I know what we just did is frowned upon, but I’ve been wanting to do that for a long time. But from the other side if you catch my meaning.” She admitted.<br>\r\n<br>\r\n“...yeah. I get your meaning.” You said. “But it was wrong.”<br>\r\n<br>\r\n“I know. But I think it was worth it.” She smiled. “Don’t you?”<br>\r\n<br>\r\nYou couldn’t help but think about how pleasurable the experience was. Eventually, you answered her with: </span></div></div>",
            "created":1570974300,
            "id":2732238,
            "title":"She forced herself onto you"
        },
        "1122222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she wants to join you</span></div></span></div>",
            "created":1540118220,
            "id":2566649,
            "title":"No"
        },
        "11222221":{
            "author_id":"copperman",
            "author_name":"copperman",
            "choices":[
                "Take off your pants too",
                "Keep fingering yourself",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You keep fingering Cassandra's pussy while she walks to your bed. She rips off your shirt and unhooks your training bra as you play with her body's nipples. She's right on top of you, humping your wet pussy with her hard dick. <br>\r\nShe leans in and sticks her tongue between your young, fat lips, making out intensely with you.<br>\r\nWhile both of you are horny as hell, she take off her shirt and starts to unzip her pants. What do you do?</span></div></div>",
            "created":1540236300,
            "id":2567182,
            "title":"yes"
        },
        "112222211":{
            "author_id":"copperman",
            "author_name":"copperman",
            "choices":[
                "Comply",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>A throbbing dick is pulled out by Cassandra, and she shoves it in your mouth. Your mouth waters as the flavor of the first dick in Cassandra's mouth overtakes you. You wrap your lips around the dick and use your tongue to get all of it's irresistible taste.<br>\r\nDespite not doing this before Cassandra's body gets down on knees on instinct and you start sucking hard. You take off your pants an slide your finger yourself even harder while thrusting your mouth up and down Cassandra's dick.<br>\r\nCassandra grabs you and throws you on the bed. She tells you to point her body's developing ass to her and for you to get on your knees. What do you do?</span></div></div>",
            "created":1540250160,
            "id":2567259,
            "title":"Take off your pants too"
        },
        "1122222111":{
            "author_id":"copperman",
            "author_name":"copperman",
            "choices":[
                "Next..."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra takes your body's dick and shoves it up her body's vagina. You are caught off guard by the feeling of penetration - It's Cassandra's first time! She is barely a teenager, growing up to be a woman, and now her first time is yours. The adrenaline and  primal instincts for sex overtake you while a brother's dick is being thrusted on to a sister's not-anymore innocent and pure body.<br>\r\nYou and your sister both start moaning uncontrollably as you feel a hot cream pie fill up your pussy.<br>\r\nBoth panting, you flip over Cassandra crawls on to you, giving you one last, deep kiss.<br>\r\nBeing your teenage sister has been amazing. No longer innocent, you going to now live a life of sex and pleasure. Your going back to school and are going to fuck every boy there with Cassandra's body.<br>\r\n</span></div></div>",
            "created":1540250820,
            "id":2567270,
            "title":"Comply"
        },
        "11222221111":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Giving birth",
                "Years later, the life of a teenage mother",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>After a while, you start feeling sick in the morning. Worried about what it meant, you took a home pregnancy test, and the results were positive. Even though you started having sex with boys from Cassandra’s school, you knew this baby, growing inside you, was conceived by you and your sister. A baby, proof of your incest. Which wasn’t a one time thing. Despite sleeping around your new school, you also continued secretly having sex with your younger sister-turned-older brother. Months pass, and when you can no longer hide your pregnancy, you tell everyone the father is one of the boys from school, but you don’t know which one.</span></div></div>",
            "created":1570974780,
            "id":2732239,
            "title":"Next..."
        },
        "1123":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "explore your new body",
                "go to sleep until morning for school"
            ],
            "content":"<div class=\"\"><div> <span>You are so shocked by the change you pass out. When you come to, you are in the living room, on the couch. Your mom walks in and asks if you are ok, you tell her you are fine, but your voice sounds wierd. Then you remember the change and wonder how it happened. Then you remember that you had wished to be little miss popular before you went to sleep. Your wish has come true. Your mom leaves you alone after walking you to 'your' room, so you...</span></div></div>",
            "created":1359435600,
            "id":1519926,
            "title":"faint"
        },
        "11232":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "It's the real Cassandra",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up and everything that's happened comes back to you, you slowly stand up, still half asleep, and decide on your next course of action.<br>\r\n<br>\r\nSuddenly you realize you're not alone in your... your sisters room.</span></div></span></div>",
            "created":1425358800,
            "id":1943232,
            "title":"go to sleep until morning for school"
        },
        "112321":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Yes, She's you",
                "Nope, She's still her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is She in your body?</span></div></span></div>",
            "created":1425358800,
            "id":1943236,
            "title":"It's the real Cassandra"
        },
        "1123211":{
            "choices":[
                "Crossdressing on the date? (Tomboy clothing)",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>You look over and see your old body standing there, you jump out of bed forgetting you are naked as you where so tired yesterday you just stripped and got into bed.<br>\r\n<br>\r\nYour sister smiled and said nice body Bro or should I call you sis now.<br>\r\n<br>\r\nYou expected to see some reaction from her but you didn't that shocked you a little.<br>\r\n<br>\r\nRight I think we should get you dressed lucky for you I'm a tomboy. Although I do have some nice dresses that I wear sorry you wear some times.<br>\r\n<br>\r\nYour sister looked out the window and gets a boner, you look to and realised she looking at a guy.<br>\r\n<br>\r\nYou look outside and then at her and the shock hit you, although you sister is in your body she is still a girl and likes boys.<br>\r\n<br>\r\n\"shit\" this means your gay now, well your sister anyway, she looked at you and smiled.<br>\r\n<br>\r\nSo are you ready? For what? The double date tonight I set up tonight.<br>\r\n<br>\r\nWho with? That guy outside and his twin brother, but one of them is gay, and... You can't.<br>\r\n<br>\r\nI can't, I can and I will Bro. I maybe gay now but I'll make sure you don't try anything lesbian in my body your a girl, I'm straight and your not spoiling my reputation at all.<br>\r\n<br>\r\nWhat about my body? What about it it's my body now and I'm your older brother and older brothers look after there little sister's and make sure they don't do anything stupid.<br>\r\n<br>\r\nWhat happens if we end up at there house? Don't worry there rooms are next door the each other.<br>\r\n<br>\r\nHow do you know that? I was there yesterday, what do you mean yesterday? She smiled, you didn't, I did and I enjoyed every second apart from when he first entered me that hurt.<br>\r\n<br>\r\nYou mean you the girl or the relationship? Yes and, and what? You'll find out tonight.<br>\r\n<br>\r\nWhat does she do tonight?</span></div></div>",
            "created":1463288400,
            "id":2148421,
            "title":"Yes, She's you"
        },
        "112322":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cssandra's boyfriend?</span></div></span></div>",
            "created":1536981360,
            "id":2547878,
            "title":"Someone else"
        },
        "1123222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cssandra's girlfriend?</span></div></span></div>",
            "created":1537165800,
            "id":2548754,
            "title":"no"
        },
        "113":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Scream",
                "Faint",
                "Try to pinch yourself awake"
            ],
            "content":"<div class=\"\"><div> <span>You start to slowly open your eyes and notice hair. Long brown hair hanging over your eyes to be precise. You look around thinking your sister must have been laying on you, but you don't see her. Instead, you see a boy her age walk into the living room.<br>\r\n\"Hey sis.\" He says to you.<br>\r\n<br>\r\n\"Sis?\" You think. Realization hits you as you start towards the bathroom. On the way there, you feel a weight on your chest, but you fight the urge to look, fearing what you'd find. Once in the bathroom, you look into the mirror and see a girl that looks a lot like you. After seeing this, you hesitantly move your hand down to your chest and feel two large mounds sticking out. This gives you all the information you need, so you don't even try to find your little friend between your legs. Even mediocre, you are pretty smart, so you quickly determine that you switched genders with your sister, possibly more, and, judging by what the boy you assume is your sister called you, your the only one that knows you weren't a girl before. How do you react to this information?</span></div></div>",
            "created":1391922000,
            "id":1742382,
            "title":"you wake up with long brown hair"
        },
        "12":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Go onto Internet, find site that transforms you...",
                "Make a wish",
                "Find a magical ring",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Breanna, 12 year old 7th-grader, stormed home.  Upset with her day at school.  She was embarrassed, again, by her arch-nemesis Gloria in front of the whole school.  It wasn't fair that she was getting picked on all the time by Gloria for nothing at all. Breanna was smart, funny, and pretty, what else would people want.  IF only she could find some way to get back at her.  Maybe, do something to Gloria like get back at her some how.  Pick on her, hit her, tons of thoughts raced through Breanna's mind.  <br>\r\n<br>\r\n<br>\r\n\"If only I could be bigger than her then I can do something about her,\" thought Breanna as she slammed the door to her room shut....<br>\r\n</span></div></div>",
            "created":1546554720,
            "id":2598404,
            "title":"high school girl"
        },
        "13":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Mike finds a swapping remote",
                "Magically swap with one of sisters",
                "Dad makes a swapping machine, Mike makes trouble with it",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You're name is Mike Jones,  you are a 13 year old 8th grade boy.  Having two older sisters, a 15 year old sister and an 18 year old sister, is really annoying.  They keep telling you what to do and how to act in front of girls.  Both of them go to the local high school, both are on the cheerleading team.  Kelly, the 15 year old is more the popular brain cheerleader, where as, Ashley, the 18 year old is the ditzy cheerleader.    All three of you live with your parents, Karen (mom 42), and Kevin (dad, 45) in a middle class neighborhood.  </span></div></div>",
            "created":1546110540,
            "id":2595560,
            "title":"7-8th grade boy"
        },
        "15":{
            "author_id":"bustie",
            "author_name":"MRBustin",
            "choices":[
                "College age guy",
                "College age girl",
                "Late 20's guy",
                "Late 20's girl",
                "More choices "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these</span></div></span></div>",
            "created":1482123600,
            "id":2252250,
            "title":"other "
        },
        "155":{
            "choices":[
                "10 year old Twins",
                "20 year old guy",
                "20 year old woman "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about?</span></div></span></div>",
            "created":1536901200,
            "id":2547529,
            "title":"More choices "
        },
        "1551":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Male.",
                "Female.",
                "Fraternal."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">Are the twins male, female or fraternal?</font></span></div></span></div>",
            "created":1570918320,
            "id":2732000,
            "title":"10 year old Twins"
        }
    },
    "info":{
        "author_id":"thonan",
        "author_name":"thonan",
        "brief_description":"You somehow become your sibling of the opposite gender",
        "created":1358781840,
        "description":"<td align=\"left\" class=\"norm\">You are a teenage boy or girl who swaps with your brother or sister somehow</td>",
        "id":1914597,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1570974780,
        "modified":1570974780,
        "pretty_title":"Sibling swap"
    }
}