{
    "chapters":{
        "1":{
            "author_id":"smallspider",
            "author_name":"smallspider",
            "choices":[
                "Delta squad is on a single moms lawn and only has daughters",
                "Delta squad is on the beach",
                "Delta squad on the grounds of an all grils school"
            ],
            "content":"<div class=\"\"><div> <span>As the dropship was landing Delta squad and the crew of the dropship shrunk and landed. The ship shrunk to about 3 inches in height and makes the crew and the delta's about 1 inch tall. They landed in a heavily grassed area and begun a sensor search to locate the needed equipment to rebuild the hyperdrive. As the pilot was looking into the screen to continue the search. The delta's loaded up. and set there blaster's and checked there shields and all was looking good. As they were about to leave the ship. They heard and thunderous sound followed by earth quakes. Where are the Delta's located.      </span></div></div>",
            "created":1135987500,
            "id":313063,
            "title":"And so the battle begins"
        },
        "11":{
            "author_id":"smallspider",
            "author_name":"smallspider",
            "choices":[
                "The mother is greating her 10 year old daughter",
                "the mother is greating her friend"
            ],
            "content":"<div class=\"\"><div> <span>It was in the early spring day the weather was warming up and it had just finished raining. when the dropship was making it's final approach. The engines were on the brink of shut down to stop the decent to the surface. The Delta 38 was claim as can be like always and talking to 40 (A.K.A. Fixer) about how they were going to get out of the mess they were in. While delta 07 (A.K.A. Sev) and delta 62 (A.K.A. Scorch) were making jokes like always. It wasn't as claiming for the pilots though there were trying to get a hold of command and trying to keep the ship in one piece. <br>\r\n<br>\r\n  They finally made it to the surface when the engines let go as soon as that happened the delta's got there blasters and there attachments for there guns and went to the doors waiting for them to be open. The pilots opened them and what they saw wasn't grass on the ground but dirt when they around and noticed that the grass was bigger the the ship they started to worry a bit. Delta 38 took point in told his men to form up and be alert for anything that could be dangerous. <br>\r\n<br>\r\n  Then it happened the earth started to quake and the grass begins to sway. The was thunderous sounds coming from 2 directions. behind them and in front of them. the men took their blasters in the ready position and prepared for anything. Delta 38 noticed that a shadow was staring to engulf them and looked up. He saw a beautiful women in her mid 30's and had a black sweater on a pair of blue jeans and then the worst part was on her feet was a pair of deadly sweater clogs on her feet the ones with a 3 inch thick sole on them. Delta 38 orders the squad to prepare for the worst. Then she stops just inches from the squad. The delta's forgot about the the other person coming who is it.</span></div></div>",
            "created":1144732980,
            "id":313014,
            "title":"And so it begins"
        },
        "111":{
            "author_id":"smallspider",
            "author_name":"smallspider",
            "choices":[
                "The mother and daughter start stomping in the grass",
                "The mother and daughter run in the house afraid of what is attacking her child"
            ],
            "content":"<div class=\"\"><div> <span>  As the delta's look behind them they see the mother's child she's about 10 years old and looks just as deadly as her mother. She has red hair in pigtails. she is wearing a pink t-shrit with a girls rule emblem on it. Further down she has on a pair of jean shorts and on her feet are a pair of deadly well worn pink flip flops. She starts to wave at her mom and walks slowly to her after a long day at school.  <br>\r\n<br>\r\n  The delta's see that she is coming slowly but right at them and they don't want them to end up just another stain on the well soiled flip flops soles. So Delta 38 orders Sev to break formation and get into a sniping position and aim for her toes while the other delta's get into a flanking position. Sev makes it to the position and shes about half way to them. 38 fixer and scorch are in position and waiting to ambush her. The ground quakes rumbles as she comes into range. that's when 38 orders sev to start firing and the others are being the attack. <br>\r\n<br>\r\n  As the first sniper round hits her big toe she lets out a small screech and looks at the ground and sees the beams of light from the blasters but doesn't know what the heck it is. Just then the mother looks down and see a bunch of little beams of light coming at her daughter and doesn't know what it is. what will happen to the delta and the attack.      </span></div></div>",
            "created":1145079960,
            "id":319764,
            "title":"A slow walk up the the house"
        },
        "1111":{
            "author_id":"smallspider",
            "author_name":"smallspider",
            "choices":[
                "Scorch and 38 run and find a worm hole and jump in",
                "The rest of the delta get squished"
            ],
            "content":"<div class=\"\"><div> <span>  As Sev fired rounds from the sniper rifle at the toes of the daughter toes it felt like little mosquito's were attacking. The mother yelled at her child again to see if she was ok. She replied quickly said \"yeah mom it doesn't hurt but I wasn't sure what was hitting my toes.\" The daughter looked down and saw where the beams of light were coming from.  The grass was tall so both the women and the girl couldn't exactly know where the beams were coming from. <br>\r\n<br>\r\n  \"The attack failed sev\" 38 screamed in is comm so the men could know what the situation was. \"Sir I think we better regroup and make a run for the house.\"  Fixer commented. \"Oh Yeah this is going to end well.\" Scorch said. \"Alight squad lets regroup and get moving. yelled 38. As the squad was regrouped they saw the giantess looking around trying to find out where the attack was coming from. Finally back in formation the Delta's were on the move to get away from the women and the girl and were headed for the house. As the delta were running for the huge structure sev fell down and tried to get up but his ankle was sprained sev calmly ask fixer to help him out. Fixer and the others stopped and 38 told fixer to help him up get and keep moving. While Fixer was helping sev up an electrostatic charge detonator fell from sev pouch and was counting down for 5 seconds. <br>\r\n<br>\r\n  Fixer looked up and yelled for help. 38 and Scorch stopped and started to back track but it was to late the charge went off. The charge is to take out electronic enemies so it won't kill the men but it's loud and bright and it will take down their small shields and hurt them. As 38 and Scorch got within 60 feet to them it went off and they heard them screaming out as their shields were being taken out. <br>\r\n<br>\r\n  The mother and daughter heard little bang and saw what looked like electricity from the ground. \"Over there the daughter said and was running to light and so was her mom. The tremor caused by there massive feet knocked the delta's off their feet. Sev and Fixer were already down on the ground because of the charge and were hurting. The daughter got there first and saw a small clearing where the charge went off and saw 2 small bugs the mother got there in a couple of seconds later and saw the 2 bugs as well. <br>\r\n<br>\r\n  With a look of descuss the child lifted her flat soled extremely stained flip flop slowly over the two bug and was bringing it down to squish them. 38 and Scorch saw this but was to far away to help them. Sev and Fixer saw the girl towering over them with a look of descuss and lifting her foot up slowly and set her heel down on the ground and was slowly coming down. 38 yelled for them to get out of there but no response was made. The radios must have been knocked out. Scorch said and they ran to help them. <br>\r\n<br>\r\n  Boom was 38 and Scorch her then the sound of crushing bones and armor then saw the flip flop rise up and they saw the blood and gut of what used to be Sev and Fixer. The girl put her foot down and felt the tiny bugs squish under her flip flop and was glad to get rid of the her attackers. SQUISH she said as she lifted up her foot and set it down. The mother was proud that her daughter got the bugs that were attacking. <br>\r\n<br>\r\n  NOOOO Scorch screamed aim his blaster at the daughter and fired. 38 saw Scorch lifting his gun but couldn't stop him in time and he knew that it would give there position away. The mother saw more beams of light and was angry because there must have been more.  The daughter saw the beams as well and said it's your turn mommy and she looked at her nodded and was stomping toward them.   </span></div></div>",
            "created":1148056860,
            "id":319690,
            "title":"Casulties Of War"
        },
        "11111":{
            "author_id":"smallspider",
            "author_name":"smallspider",
            "choices":[
                "Scorch holds up untill they leave goes into there house and starts to rain havok",
                "Scorchs last stand and his death"
            ],
            "content":"<div class=\"\"><div> <span>      Scorch fired his rifle until  it went dry and finally realizing he just gave there position away. Boss(38) got to him and grabbed him by his shoulder armor screaming to him we have to move before we share there fate. let's go you fool. Snapping back Scorch nodded and ran with his commander. BOOM BOOM BOOM. The sounds of the mothers feet were shaking the ground the delta's running on. She stopped where she saw the last beams of light but they seem to have stopped and not being able to see them because of the tall grass. She had to look for them very carefully. As delta's notice the ground stopped shaking for a moment and looked up however they didn't stop running. \" Hey Boss looks like she can't see us what do you think we should do.\" Scorch said. \"Keep moving we need to find some cover before they catch sight of us you got that delta.\" Boss relied. ROGER THAT SIR said Scorch. \"Sir over there... there's hole in the ground at 11 O' Clock we can get some cover in there. scorch good eyes sounds like a plan let's move. <br>\r\n<br>\r\n      The mother was still looking around the area for the bugs and starting to get frustrated. Her daughter caught up to her and was looking around as well. If you see them let me know ok honey said the mother. Ok mommy I will replied her daughter. With both of them looking it would be only a matter of time before the deltas are spotted and exterminated. After looking for 5 mins the both of them were getting furious they couldn't find there prey. Hey mom I have an idea lets just stomp all over the place and we'll check our shoes after ten stomps and see if we got them. Great idea honey shall we begin. YAY LET'S START STOMPING.<br>\r\n<br>\r\n      Just as the delta's heard that there hearts sank and knew they don't have much time to get to the hole. They only had 30 more yards to go and already fatigued and losing speed they knew that time isn't on there side. \"It's now or never Boss\" Scorch said. \"Yeah we have to make it to the hole \" replied Boss. KABOOM, KABOOM KABOOM. \"SHIT THERE STARTING TO STOMP EVERYWHERE BUT WE ARE NEATLY THERE.\" said Boss. Scorch got a little burst of speed from the adrenaline rush from the fear of being Squished and passed Boss and got to the hole and dove for the hole and made it in. Right behind him Boss dove in as well just as the mother had made her tenth stomp and stopped. The daughter had 2 more stomps left when felt something give way on the ninth stomp. Her eyes lit up and an evil smile formed from her lips. I THINK I GOT EM  MOMMY. Her mothers eyes looked towards foot as she lifted her leg and turned her foot to see if she got what they were stomping for. The mangled remains of beetle were stuck to the bottom of her flip flop and she noticed it wasn't the bugs they were looking for.  Her mother saw that it was a beetle as well and looked even more mad that they missed the bugs and now they could be anywhere. <br>\r\n     <br>\r\n      What are we going to do Boss. asked Scorch. We wait until they leave and try to find a way to get our comms to work. said Boss. The boom stopped and the earth stopped shaking. They must have left I'll Check it out Scorch you get some rest we'll need it. Boss got up and started to climb back up to see it they were gone. When he got up he saw that the daughter had stomped on a beetle and she lifted her foot up and he saw the remains stuck to the sole of her flip flop. NOPE MOMMY I DIDN'T GET THEM. The mother looked down and noticed that there was a white bug near a hole it looked like it wasn't paying attention to her and it was facing her daughter. An evil smile formed from her lips and lifted her foot and positioned it over the bug and stomped her foot down. Hearing a faint crunch a menacing laugh followed and she knew she got the bug. DID YOU GET THEM MOMMY. I GOT ONE OF THE HUN TAKE A LOOK. She lifted her massive sweater clog and turned the sole of her clog toward her daughter and she laughed. WOW MOMMY YOU GOT HIM GOOD. YES I DID SWEETHEART. <br>\r\n<br>\r\n      Scorch jumped up when he felt the ground shake and the massive boom from another stomp. Scorch screamed for Boss and when he didn't reply back realized that is commander had been crushed. He looked up to opening of there makeshift bunker and had to switch his night vision sensor on his hud. because the mothers clog was on the opening. When she lifted her foot up scorch  climbed up and saw that 38 the boss had been stomped on so hard that his armor was flattened and blood all over the flat sole of her clog. NOOOOOOO you bitch you'll pay for that. <br>\r\n<br>\r\n      <br>\r\n<br>\r\n      WHAT WIl HAPPEN TO SCORCH?  WILL HE MAKE BE ABLE TO MAKE IT OUT OF THIS ALIVE?    </span></div></div>",
            "created":1255272480,
            "id":774151,
            "title":"Scorch and 38 run and find a worm hole and jump in"
        },
        "1112":{
            "author_id":"smallspider",
            "author_name":"smallspider",
            "choices":[
                "They make there way to the house with some help",
                "They encounter another giantess the mothers 18 year old daughter"
            ],
            "content":"<div class=\"\"><div> <span>  As the daughter was getting attacked she got scared and was running for her mother. The mother was seeing the beam lights but couldn't understand was it was so she yelled at her daughter to run to the house. Her screaming voice echoed through the sky and ground rattling the delta's heads and eardrums. The daughter ran to her mother and she grabbed her hand and they ran to the house. During their run the delta's were shaken up a bit because of the heavy footsteps from  them. After the got to the house the delta 38 ordered them to get in formation. Sev complied and the others followed in suit as they gathered. 38 told them to take a rest a bit. The men knelled down and 38 told them they did an extremely good job and that the can't rest for to long. <br>\r\n<br>\r\n  Sev said it was easier then taken down a rancor. Scorch looked at Sev and told him for a psychopath with a sniper rifle attachment anything is easy. Sev just laughed and said that he's jealous. 38 and a Fixer were talking how to get the stuff they need to get back to there own galaxy. Fixer scanned the area and found that there was a lot of material they need in the giantess house and if they wanted to go back to the republic they needed to go in the house. Scorch looked worried and so did Sev. 38 told them to relax and said they needed the parts so lets go they picked up there gear and made the long trip to the house and hopefully not get into another battle between the people.</span></div></div>",
            "created":1145123340,
            "id":319574,
            "title":"The Attack Worked"
        },
        "11121":{
            "author_id":"smallspider",
            "author_name":"smallspider",
            "choices":[
                "The mother decides to squish them",
                "The mother decides to leave them alone not knowing what kind of bugs they are"
            ],
            "content":"<div class=\"\"><div> <span>  As the delta's gathered the rest of their gear and regrouped they decided that the best way of entering the huge home was to wait until the cover of darkness. Knowing that it could be to dangerous to travel the whole distance at night 38 told them that to get going and find a place to hide until sunset and find a way inside the home when it was completely dark. As the continued there march to the home 38 sev scorch and fixer were marveled after seeing how huge the home look and they were even near the place yet. scorch was a little concerned about how they were going to get up the stairs and asked sev what he thought about his troubles sev looked as scorch and answered with a firm that's not our problem right now and to think about getting up there when we get there.  <br>\r\n<br>\r\n  When the delta's got about half way there which to about 3 hours they heard what sounded like a Bantha herd marching with a band of sand people. But on this planet they probably weren't any. As they continued getting closer to the sounds they didn't know what could make all this racket and fixer didn't want to find out. 38 was the only one out of the 4 that was interested about the new creators and what this planet had in it that was smaller then the giantess's. All of a sudden an ant walked right past 38 and startled him and the others. The ants were just a little bit smaller than a bantha but black and had no fur and a weird looking head. <br>\r\n<br>\r\n  Sev looking away from his better judgment and his legs were really tried ran up and mounted the big ant and calmed him down soon 4 more ants came into view of the squad and looked at the bug sized solders but didn't attack. 38 of coarse was yelling at sev to get off but finally realized that it would be a good idea to ride the ants to the house and it would take them a lot less time the going on foot all the way. Sev was a natural born rider but the other were having a tough time mounting up and setting in on them. It took the others a couple of minutes to get used to it but once they didn't the made a bee line to the house. <br>\r\n<br>\r\n  Four hours later all the men were at the base stairs and look up and were thinking of a way to get up there. That is when 38 remember about the grappling hook and tow cables that they had if they needed to get to high place. 38 ordered the other to take the out and put the beginning of the hook in their pistol and aim with accuracy at the top of the stair and make sure to hold tightly. The men shot with great accuracy and made the climb up quick and uneventful. When they got up there it was just getting dark and the sun was just below the horizon. <br>\r\n<br>\r\n  The men regrouped and at the top and saw that the ants were following them. Scorch looked at that he rode and took out some rations out of his pack and gave his ant some food. The others look out scorch and asked what he was doing? he answered right back with a little sarcasm said if you just had someone ride you all the way up here wouldn't you expect something back in return the other ant made it back up and the men took some of there rations and gave it to the ants.  After their meals were eaten the ants had their fill as well they took a break. <br>\r\n<br>\r\n  After about 30 minutes is was completely dark the men gathered their gear and was walking toward the door when a blinding light came on and the delta's scattered towards the massive all and tried to get the ants over to them. The ants were to tried to move and that is when the massive door opened and the mother was in the doorway still wearing the same thing earlier and the deadly flat soled sweater clogs. Looking out at the yard the mother didn't understand were the blue lights that was coming from the ground and how it was hurting her daughter. She looked down and saw four little ants and thought they were going to enter her nice clean home. With that in mind she decided better to take these little pest out of this world now so she doesn't have to worry about them later took a step down out of the doorway and then slowly lift her massive clog over there little head and make them into goo beneath her soles.  <br>\r\n<br>\r\n  Crunch is all the Delta's heard then the scraping sounds just to make sure that her pray was dead. Lifting up her foot to see her handy work looked around for any more just in case there was more. The mothers eyes looked around and saw 4 more bugs but these ones were white and never saw anything like it before. That is when the delta squad's heart sank into there chest when they her looking right at them. They wanted to scream but knowing it wouldn't do any good the readied their blasters and 38 put his anti-armor attachment on and told them to them get ready to fire. <br>\r\n<br>\r\n  </span></div></div>",
            "created":1147713180,
            "id":319511,
            "title":"The fight is never over"
        },
        "12":{
            "choices":[
                "Delta Squad climbs the giantess",
                "One of her friends arrives",
                "Delta Squad approaches another girl"
            ],
            "content":"<div class=\"\"><div> <span>The Delta Squad's ship had slammed onto a surface composed of innumerable grains of sand, which luckily, had reduced a significant amount of damage sustained to the vehicle.  The squad plops onto the ground, carefully wading through the warm sand of what is concluded to be a beach.  Footsteps thunder and colossal figures stomp pass the ship along with the squad, Delta 40 is almost squashed underfoot by a bikini-clad titan.<br>\r\nNot too far, a mighty sea foams and froths with immense power.  Scattered all over the beach are the immense figures, most of them are girls of varying ages enjoying a sunny day.  The squad scatters, attempting to avoid being crushed by the giantesses.  They land on a soft surface, a blanket, a giant girl in her 20s lays peacefully with her eyes shut and her body still wet from an afternoon dip in the ocean.  The blonde goddess, clad in a black bikini, wears her sunglasses and doesn't notice the specks gathering at her feet.</span></div></div>",
            "created":1145172960,
            "id":313267,
            "title":"The beach"
        },
        "121":{
            "author_id":"engineering",
            "author_name":"Spencer",
            "choices":[
                "They all started to stomp the squad",
                "They realized the \"bugs\" were humans",
                "The Delta Squad ran away"
            ],
            "content":"<div class=\"\"><div> <span>Thinking everything but rational thoughts, the Delta Squad scaled the ankle of the beautiful giantess laying on the towel before them. They do to each side of the woman and begin to grab her skin, then pull themselves up to the top of her leg. The climb was long and tiring but they felt it was necessary despite actual probably of danger. <br>\r\n<br>\r\nUpon reaching the top, the force took a minute to take in the land in which they were trapped at. There were many women laying on the beach and swimming. To the normal man, the sight would be spectacular but to the Delta Squad, it was a matter of dieing beneath any part of those women. <br>\r\n<br>\r\nThe woman they were standing on hadn't moved for a while. She laid very still which wasn't a bad thing for them in the aspect of moving on her but in the idea of her being there for a while, she could be nearing the end of her time at the beach which will pose a huge problem for the Delta Squad. But, one thing that couldn't be mistaken was the woman was very pretty. She had a perfect body, proportional all the way around. For lack of better terms, hot.<br>\r\n<br>\r\nThe squad made their way up to her face. They scaled her legs up towards her chest area. Her breathing was very slow and rhythmic. The squad felt no fear for danger as they came closer to her face. But then, much to their dismay, the beautiful giantess started to move. The Delta Squad was now located on her chest when her eyes opened up. Her head leaned up, her eyes fulling upon the squad. Suddenly she screamed at what she though was bugs.<br>\r\n<br>\r\nThe squad quickly dashed back towards her feet trying to escape the giantess. Other women looked over at her. She began to stand up, the squad falling the rest of the way to the blanket.<br>\r\n<br>\r\n\" Damn bugs!\" she screamed.<br>\r\n<br>\r\nOther women began to come over to the blanket...</span></div></div>",
            "created":1249450260,
            "id":739100,
            "title":"Delta Squad climbs the giantess"
        },
        "123":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "The charge works",
                "The girl notices!"
            ],
            "content":"<div class=\"\"><div> <span>Delta squad started running in the direction of the water, they soon approached a huge girl, about 7 years old, standing next to her sand castle. Sev reached for his DC-17 Sniper attachment to get the girl's attention. Fixer knocked sev's gun out of his hands. \"watch it 07, we don't want to attract attention.\" Fixer warned. 38 followed up by saying \"get to the sand castle, it has to provide some shelter.\" delta squad ran up stealthly to a wall and planted a breach charge...</span></div></div>",
            "created":1150698780,
            "id":325216,
            "title":"SHELTER !"
        },
        "1232":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "the girl knocks down the castle",
                "a younger kid comes"
            ],
            "content":"<div class=\"\"><div> <span>Right as soon as 38 set the charge, the little girl noticed the \"bugs\" at her castle. she freaked out and proceeded to stomp on the ground around the structure. Delta 62 went off screaming away from the girl. Fixer and Sev grabbed their anti-armor attachments and started firing. 38 went after scorch to get him to join in the fight. good thing he ran.<br>\r\n<br>\r\nThe girl went on a rampage, crushing Sev in the process. Fixer went to retreve his fallen comrade but his fate was sealed as the girl lifted her foot above him. 38 heard a sharp scream and a crunching sound. either way he went to find 62. leaving his best sniper and tech expert behind. Boss soon finds 62 inside the \"castle\" crouching behind a wall, loading his DC-17 rifle attachment and taking aim at the little girl...</span></div></div>",
            "created":1150758720,
            "id":325353,
            "title":"Death of friends"
        }
    },
    "info":{
        "author_id":"smallspider",
        "author_name":"smallspider",
        "brief_description":"You are the Delta 38 with his commando's shrunk on earth",
        "created":1135986600,
        "description":"<td align=\"left\" class=\"norm\">You are Delta 38 with Delta's 62,40,07. Your squad was going back to the planet of Geonosis while in hyperspace to return the the large battle agianst the droids when there was a malfuntion on the dropship. The ship ended up entering a wormhole in space and entered the milkly way galaxy which is where Earth is located. The pilot lost the hyperdrives and was forced to land on the planet that had the most avalaible parts to rebuild the hypedrive. Earth was that planet but they didn't realize that as they were landing the ship was shrinking along with all the commando's and the crew. The pilot found and nice place to land in what was the United States  <br>\r\n<br>\r\nRules no one or two sentaced chapters. NO MALES ALLOWED OR I WILL DELETE IT ALSO THERE WILL BE NO SHOVED IN THERE BUTTS PERIOD. and if you want to add kids i am ok as long as it's not like the girls put the delta's in they're underwear or bra. Also animals can't kill deta squad and no size changing. And on a second note the blaster can't kill humans but they can sting badly. the blasters can kill animals.       </td>",
        "id":1051419,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1255323540,
        "modified":1255323540,
        "pretty_title":"Tiny Republic Commando's On Earth"
    }
}