{
    "chapters":{
        "1":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "\"Big!\"",
                "\"Small!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, so I tell him to go get me another drink and he's like why?\" Claire said to her friend Kate. Both girls were dressed in bikini and lounging in the backyard. A few feet away sat a  boy dressed in swim shorts , messing with toy pistol. Claire was babysitting Toby. His parents were off on a trip and the blonde was happy to take care or of the boy till they got back. Not because she adored the kid, nope just for the paycheck she'd receive afterwards.<br>\r\n<br>\r\n\"Should he be playing with a gun. Isn't that like bad for a boy his age?\" Kate brushed away a lock of her raven black hair from her face and nodded in Toby's direction. Claire looked over her shoulder.<br>\r\n<br>\r\n\"Guess you're right,\" she adjusted her bikini top and turned towards the boy.<br>\r\n\" Hey! Stop playing with that thing!,\" she was very subtle.<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\n\"I'm bigger than you that's why!\"<br>\r\n<br>\r\n\"But everything else is boring.\"<br>\r\n<br>\r\n\"I dunno, go play in the pool or something!\" she pointed at the rainbow color inflatable kiddy pool.<br>\r\n<br>\r\n\"It's for little kids!\"<br>\r\n<br>\r\n\"That's right,\" she laughed and went back to her conversation.<br>\r\n<br>\r\nToby gave her an angry stare. He looked down at his gun, which was in truth a self developed size ray. It took him months to make the device, in secret without his parents knowing.  <br>\r\n<br>\r\nHe turned the dial on the side and grinned. He ran up to his babysitter and her friend.<br>\r\nThe girls were so busy in their conversation they only noticed Toby when he was already standing at the feet of their lounge chairs.<br>\r\n <br>\r\n\"What?\" Claire said, frowning.<br>\r\n<br>\r\n\"You're right, you're big and I'm small. I'll change that!\"<br>\r\n<br>\r\n\"Okay...good for you\" Claire said as she watched the boy skipping onto the grass and still holding the gun. <br>\r\n<br>\r\n\"What was that?\" Kate said.<br>\r\n<br>\r\n\"Whatever, the kid is a freak.\"<br>\r\n<br>\r\nToby seemed to ignore their comments, he grabbed the gun with both hands and yelled...</span></div></div>",
            "created":1549515600,
            "id":2614102,
            "title":"Boring"
        },
        "11":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...run",
                "...try to calm him down"
            ],
            "content":"<div class=\"\"><div> <span>\"Big!\" Toby yelled at the top of his lungs as he aimed at himself and pulled the trigger. <br>\r\n<br>\r\nThere was a minute of quiet, a cricket chirped. Claire broke the silence, she was slowly clapping. \"Very impressive little weirdo, now go play something that's nice and quiet\" she was ready to continue her talk with Kate.<br>\r\n<br>\r\nMeanwhile the boy started to doubt himself. Did this even work? All of a sudden he began to feel warm all over. His breathing quickened. He closed his eyes. It was happening, it was really happening!<br>\r\n<br>\r\n\"Uhm, Claire,\" Kate pointed towards Toby. He was visibly shaking, it seemed if he was having some sort of seizure.<br>\r\n<br>\r\n\"Great, did you give him something with peanuts?,\" the blonde adjusted her bikini top and hopped off the chair.<br>\r\n<br>\r\nWhen she made her way up to Toby she noticed something was off. It almost seemed if he was already standing a foot away from her. He was still on the middle of the lawn. As she got closer she noticed his bright blue swim shorts, they looked so tight. She remembered the legs going down to his knees, not high up to his crotch.<br>\r\n<br>\r\nToby opened his eyes and smiled. It was working, his surroundings were slowly moving downwards. He watched amused as his babysitter hurried towards him. A stern look on her face, though that changed as she got closer. <br>\r\n<br>\r\n\"He...he...is getting bigger!?,\" Kate watched from a distance as the little boy on the lawn continued to grow.<br>\r\n<br>\r\nClaire stared in awe as the small figure in front of her expanded. Toby just enjoyed the ride. He laughed, his voice getting deeper with every inch he gained. His shorts were getting stretched to the limit.<br>\r\n<br>\r\n\"Oh gawd!\" Kate gasped as the shorts ripped from Toby's frame. He stopped growing at twice his height. Still clutching the size ray with his enlarged hand. The boy was huge, including his now exposed cock. It looked like he was more than a little excited about his new situation.<br>\r\n<br>\r\nThe girls...</span></div></div>",
            "created":1570770000,
            "id":2731277,
            "title":"\"Big!\""
        },
        "111":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "Kate couldn't help herself",
                "Toby decided to get bigger"
            ],
            "content":"<div class=\"\"><div> <span>The girls did the only sensible thing, run! Claire was first to react, the moment she realized she was no longer in control it was time to leave. On her way down to the terrace she dragged her friend with her.<br>\r\n<br>\r\n\"So big,\" Kate was still staring blankly at the nude boy. Though more particular to a specific part of this new grown boy. <br>\r\nToby didn't move, he just watched amused as the teens ran away from him. He was just starting.<br>\r\n<br>\r\nClaire slammed the backdoor, grabbed the key to lock it, looked in Toby's direction and then proceeded to move as much furniture as she could find to block the door.<br>\r\n<br>\r\n\"W-we have to do something,\" Kate said, just staring as her friend was busy.<br>\r\n<br>\r\n\"What? Call the cops? I'm sure they'll come right away if we tell him we're being chased by a giant eight year old!\"<br>\r\n<br>\r\n\"H-He's just standing there, maybe we can just-\"<br>\r\n<br>\r\nJust then Toby took a step towards the house, and another. He slowly strolled over to the house, still smiling. In his right hand his size gun, while his left hand slowly stroked his dick. It felt so good being big.<br>\r\n<br>\r\n\"N-no! He's coming for us!\" Kate said wide eyed as she watched the small giant approach.<br>\r\n<br>\r\n\"Shut up! Come here!,\" Claire pulled her friend over to the side. From there Toby wouldn't be able to see them.<br>\r\nThere was a knock on the door a minute later.<br>\r\n<br>\r\n\"Girls, please let me in. I'm big now, big enough to play with you two,\" the boy leaned over and put his face against the glass.<br>\r\n<br>\r\n\"Come on, I want to play. Claire you said I should play something else,\" Toby got up and began pushing his enlarged cock against the glass door. Kate squealed as she noticed.<br>\r\n<br>\r\n\"You know I asked nicely, but I think I can get in if I want to. Or maybe you think I'm not big enough yet?\" both girls swallowed at the thought of him growing even bigger.</span></div></div>",
            "created":1570770000,
            "id":2731278,
            "title":"Run For It"
        },
        "1111":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...herself by accident",
                "...Toby, but Kate as well",
                "...the boy, before things got out of hand"
            ],
            "content":"<div class=\"\"><div> <span>\"I want it!\" Kate ran past her friend towards the door. Claire didn't have time to stop her. The raven haired teen girl began to shove away furniture at a frantic pace.<br>\r\n<br>\r\n\"Stop! What are you doing!\" Only now did Claire realize her friend was breaking away their barrier. Any argument was futile, Kate kept pushing away chairs. With the blockade removed she began to pull at the door. A huge cock was pressed up on the glass just inches from her face. She kept trying to get the door open.<br>\r\n<br>\r\n\"Looking for this?\" Claire said behind her, she was dangling the key from her fingers.<br>\r\n<br>\r\n\"Yes! Give it to me!,\" Kate looked at her wide eyed. It was then Claire realized how little her friend was thinking straight.<br>\r\n<br>\r\n\"Kate please we can't-\" Claire didn't see it coming. The blonde got tackled by her best friend, who quickly snatched the key from her hands.<br>\r\n<br>\r\n\"I'm coming!,\" Kate fiddled with the key, nearly dropping it, then finally turned it over. <br>\r\n<br>\r\nAs she opened the door, she was hit in the face by a giant meaty dick. Turned out the door went inward. She recovered quickly and began stroking the huge penis with her hands.<br>\r\n<br>\r\n\"Kate what are you- Whoa!\" Toby was surprised by this sudden turn of events. He took a step back, the horny teen followed.<br>\r\n<br>\r\nThe boy tripped over one of the lounge chairs, due to his increased height he barely felt anything as he landed on his back. Kate licked her lips and got down on her knees. She was entranced by this 8'5\" giant, especially his huge cock. Some primal need took control over her, she wanted him. She wanted him now!<br>\r\n<br>\r\nClaire groaned as she recovered, her friend really got her good. When she crawled up she realized she was still in the same nightmare. In fact the nightmare got worse. Kate just took off her top, revealing her ample perky breasts. She was reaching for her bikini briefs.<br>\r\n<br>\r\nToby was having the time of his life. First he grew into a giant and now this girl older than him was taking all her clothes off. She was also obsessed with his penis, stroking and squeezing it every opportunity she got. <br>\r\n<br>\r\n\"Kate! What the fuck!\" Claire yelled, but she knew that face. Her friend wouldn't listen now. She had to stop this, and fast. She adjusted her bikini top, then  noticed Toby's toy gun next to the door frame, he must have dropped it. As she picked it up she got an idea, if this thing grew Toby it should be able to shrink him too.<br>\r\n<br>\r\nThe blonde quickly brought the device up. Positioned herself and squeezed the trigger.<br>\r\n<br>\r\nShe shrunk...</span></div></div>",
            "created":1570770000,
            "id":2731288,
            "title":"Kate Can't Help Herself"
        },
        "11111":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "Kate",
                "Toby"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes!\" Claire balled her fist. She knew she just saved the day. Toby would shrink down, Kate would realize how stupid she was and Claire would rub in her face.<br>\r\n<br>\r\nThe change wasn't instantly though. The boy wasn't getting smaller yet, and her friend finished taking off her last piece of clothing. She admired Kate's body, not in a sexual way. She was just proud to have such sexy friends. She gained some weight though. Claire hadn't noticed before, but Kate looked bigger. Bigger face, bigger tits, bigger hips. She'd tell her to cut down on fries when this was all over. Couldn't have her best friend looking like a pig right?<br>\r\n<br>\r\nShe rubbed her forehead, it sure was warm. The gun in her hand felt heavy, she put it down on the still standing lounge chair. She proceeded to adjust her bikini top, it slipped right down again. She sighed and tried again, again and again.<br>\r\n<br>\r\nIt wasn't working, and to make matters worse her panties weren't staying on as well. Then she began to doubt herself. She glanced at the nude couple. Toby looked huge, much bigger in fact. What amazed her the most though was the sight of her friend. Kate was also huge!<br>\r\nAt first she thought Toby had infected Kate with his gigantism. When her panties slipped down her legs she realized her mistake. She hadn't used the device properly, Claire was shrinking! <br>\r\n<br>\r\nShe had held the size ray the wrong way. That didn't matter though, she had to fix this. She turned back to the lounge chair. It was still there, just huge as all things surrounding her. She got rid of her bikini top as it was dragging her down.<br>\r\nAs she reached the chair she tried to climb up the leg. She immediately slid back down again. The steel legs were too slippery for her, there was no way to reach the top.<br>\r\n<br>\r\nA thundering moan caught her attention, she turned around. Her friend, who now looked like the 50ft woman to her, was giving titan Toby a blow job.<br>\r\n<br>\r\nClaire had no choice, these two giants were her only hope.<br>\r\n<br>\r\nShe tried to get help from...</span></div></div>",
            "created":1570770000,
            "id":2731289,
            "title":"Shrinking Herself"
        },
        "11112":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...mess with their sizes some more",
                "...play with them"
            ],
            "content":"<div class=\"\"><div> <span>\"Take that Claire, I'm going to fuck the biggest dick in town!\" Kate took off her bikini briefs and without looking away from her price threw it away. She got down and planned to straddle the monster in front of her.<br>\r\n<br>\r\nToby staring down at Kate had no clue what she was planning, but heard good things about it. He overheard the girls talking about giving several guys the time of their lives. He couldn't wait to experience this. He put his hands behind his head and leaned back. All of a sudden his eyes went wide.     <br>\r\n<br>\r\n\"Don't know hon, looks like the tiniest dick on this planet,\" a loud voice said. A giant hand grabbed onto one of Toby's arms and pulled him from under the baffled teen girl. Before her eyes could follow a strong force grabbed her legs and hovered her upwards.<br>\r\n<br>\r\n\"No!\" Kate yelled as she stared upside down into the face of her blonde friend. Claire looked like a giantess, however things weren't what they seemed. Although the girl had successfully shrunken Toby, an added bonus was Kate shrinking with him. The boy was about a foot tall, her friend a few inches less.<br>\r\n<br>\r\n\"Thanks kid, you made this whole babysitting affair much more enjoyable,\" Claire smiled at the sobbing boy in her other hand. \"Not such a big bad boy now, huh?\" <br>\r\n<br>\r\n\"Please Claire! I'm sorry, please make me big again!.\" Toby said.<br>\r\n<br>\r\n\"Oh no, no more big boys. As for you Kate, you freaking tackled me. Your best friend!\" as if to strengthen her point she moved her hand up and down. Making Kate groan as she was used as a human yo yo. \"No way you're talking your way out of this one.\"<br>\r\n<br>\r\n\"I think I'm going to have some fun myself, considering I'm the one in charge now!\"<br>\r\n<br>\r\nShe decided to...</span></div></div>",
            "created":1570770000,
            "id":2731290,
            "title":"Bringing Down The Frisky Couple"
        },
        "1112":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...looks for his tiny babysitters",
                "...just enjoys himself"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, you're right. I'm not big enough,\" Toby sighed, though it didn't sound too convincing.<br>\r\n<br>\r\n\"He can't get any bigger right?\" Kate looked at her friend.<br>\r\n<br>\r\n\"How should I know! For all I know he can do anything!,\" Claire peeked around the corner.<br>\r\n<br>\r\nThe boy made his way back to the lawn, from the corner of his eye he noticed his babysitter. He grinned, she will enjoy the next part.<br>\r\n<br>\r\n\"What is he doing?\" Kate nudged her friend.<br>\r\n<br>\r\n\"He's sitting down, holding his toy gun. The gun! That must be the thing growing him! If we're quickly we can-\"<br>\r\n<br>\r\n\"Giant!\" Tony yelled firing a strong burst at himself. Both girls looked at each other, eyes wide.<br>\r\n<br>\r\nThis time it didn't take long for the growth process to set in. The boy instantly began to gain height. A tingling sensation ran through his body, it felt so good. He closed his eyes again. His tablet slipped from his fingers and his hands went for his growing erection. The girls had left their hiding spot and looked out at the horrific sight of the growing boy. Toby was gaining feet instead of inches now. He already doubled in height and was still going. His limbs bumped into garden furniture, a tree that began to look small next to him, the fence which went over as if it was made of paper. All the while Toby moaned, stroking his expanding member. It was as if the growth came right from his own actions, as every stroke made him grow bigger and bigger.<br>\r\n<br>\r\nInside the house, everything went dark as the shadow of the enlarged boy fell over the building. The girls didn't speak, both of them just stared as Toby filled up the backyard.<br>\r\n<br>\r\nFinally done growing, there was no way of knowing how big the boy really was. One thing was sure, there was no way to keep him outside now. The giant relaxed, his hands freeing his giant cock. Claire and Kate watched the wobbling organ and the giant hairless balls. The dick was huge, big enough to ride like a horse. Which wasn't a comforting thought.<br>\r\n<br>\r\nGiant Toby...</span></div></div>",
            "created":1570770000,
            "id":2731280,
            "title":"Toby Decided To Get Bigger"
        },
        "11121":{
            "author_id":"atomsize",
            "author_name":"Tinkerbellâ\u0080\u0099s Lover ",
            "choices":[
                "Makes out with them",
                "Takes off their bikinis",
                "Humps them"
            ],
            "content":"<div class=\"\"><div> <span>Toby didn’t wanna wait. Being so big he ripped out the glass door pulling it straight off. The two bikini clad teen girls were paralyzed in fear as the giant 8 year old boy grinned at them. <br>\r\n<br>\r\n“There you guys are. Let’s play!”<br>\r\n<br>\r\nClaire and Kate tried to run away screaming in terror but Toby easily snatched them in the same hand. They appeared as Polly Pockets to Toby, who smiled as he had his beautiful babysitters where he wanted them.<br>\r\n<br>\r\n“Hey guys! You look so small!”<br>\r\n<br>\r\n“Claire, I’m scared” Katie said<br>\r\n<br>\r\n“Tttt..Toby, please put us down. We’ll be nice to you.”<br>\r\n<br>\r\nToby smiled as he looked into the eyes of the helpless 17 year old blonde.<br>\r\n<br>\r\n“We ARE going to play Claire. You’re both so pretty. I can’t wait to have fun with you now that I’m the big one”<br>\r\n<br>\r\nWhat does Toby do to the girls?</span></div></div>",
            "created":1578114000,
            "id":2769222,
            "title":"Looks For His Tiny Babysitters"
        },
        "12":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...two foot tall",
                "...a foot tall",
                "...six inches tall"
            ],
            "content":"<div class=\"\"><div> <span>\"Small!\" Toby yelled at the top of his lungs as he aimed at the girls and pulled the trigger.<br>\r\n<br>\r\nThere was a minute of quiet, a cricket chirped. Claire broke the silence, she was slowly clapping. \"Yes you're small you little weirdo, now go play something nice and quiet\" she was ready to continue her talk with Kate.<br>\r\n<br>\r\nMeanwhile the boy started to doubt himself. Did this even work? He looked at his babysitters and smiled. The girls were too occupied to notice, but Toby saw slight changes in their physique. Claire kept pulling the strap of her bikini top, while Kate couldn't keep her sunglasses on her nose.<br>\r\n<br>\r\n\"Uhm, Claire,\" Kate watched as a nipple slipped out of her friend's bikini top. She pointed it out and her friend, face flustered, adjusted the strap once more.<br>\r\n<br>\r\n\"What is going on? I could swear these were tight fitting this morning,\" the blonde hopping off the lounge chair. \"I should have brought one of those tops you're wearing.\"<br>\r\n<br>\r\nKate's top was also a tight fit, however it was starting to look big on her.<br>\r\n\"Seriously? Why did I get the wrong size?\" Claire was fiddling with her sandals, which were way too big for her. In fact they seemed to get spacier with every second.<br>\r\n<br>\r\n\"Did you feel that?\" Kate pulled up her shoulders.<br>\r\n<br>\r\n\"What?\" the blonde didn't look up, too busy with her growing footwear.<br>\r\n<br>\r\n\"It's getting a bit chilly, I think—\" Kate stepped of her chair. Which was weird. \"These chairs are huge\" She walked over to the side table, grabbing a towel, which was as big as a table cloth.<br>\r\n<br>\r\nThey stop shrinking at...</span></div></div>",
            "created":1580320560,
            "id":2780087,
            "title":"\"Small!\""
        },
        "121":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...are easily caught",
                "...manage to close the door"
            ],
            "content":"<div class=\"\"><div> <span>\"Something is wrong here. Toby!\" Claire immediately turned towards Toby, knowing he had something to do with this.<br>\r\n<br>\r\nThe boy was still on the middle of the lawn, though she could swear he was standing further away. Toby whistled a tune and slowly made his way over to his babysitters.  As he got closer the girls started to panic. He was a small giant! <br>\r\n<br>\r\nIt was then they realized what was happening, Toby wasn't bigger. No, the girls were shrinking.<br>\r\n<br>\r\n\"Run!\" Claire yelled as the boy approached, her bikini briefs slipped down her legs.<br>\r\n<br>\r\n\"Wait for me!\" Kate, still holding the 'table cloth' towel, ran after her. She was lucky that her clothing was still on her, however it was slowing her down considerably. <br>\r\n<br>\r\nToby smiled as he watched the teen girls run from him. It was working, his babysitters were slowly shrinking. He watched amused as Claire hurried towards the back door. Her cute butt-cheeks jiggling with every step.<br>\r\n<br>\r\n\"Come on Kate! Hurry!,\" the blonde yelled as her friend struggled to catch up to her. Kate still had her bikini on, but it was pushing her down to the pavement. <br>\r\n<br>\r\nAlthough she was a lot smaller now, Claire could still reach the doorknob. She quickly went inside and waited for her friend. When she looked back she swallowed hard. Toby was huge, almost twice her size. She estimated she was barely two foot tall. The boy could easily overpower them.<br>\r\n<br>\r\nThe girls...</span></div></div>",
            "created":1580320680,
            "id":2780089,
            "title":"Two Foot Tall Teens"
        },
        "1211":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...the kiddy pool ",
                "...the lounge chairs"
            ],
            "content":"<div class=\"\"><div> <span>\"Got you!\" Toby smiled as he grabbed hold of Kate. The shrunken teen screamed as the boy pulled her close.<br>\r\n<br>\r\n\"Kate!\" Claire yelled as she watched her friend get taken by the small giant. She planned to run up and help her, but thought better of it as the boy could easily overpower her as well. Instead she ran inside and began to push her back against the door.<br>\r\n<br>\r\n\"Claire! Don't leave me!\" Toby had pocketed the size ray in his swim trunks and proceeded to strip the shrunken teen in his hands.<br>\r\n<br>\r\nInside, the blonde was cursing herself for being such a coward. But she was seriously afraid what the boy might do to her. She hadn't been the babysitter, and he might punish her for that.<br>\r\n<br>\r\n\"Hey Claire, come play with us,\" Toby said as he threw Kate's bikini to the side and softly squeezed the shrunken teen's bum. She flinched at first, but the boy was being gentle and actually enjoyed Toby's touch. She purred as his other strong hand massaged her shoulder.<br>\r\n<br>\r\nMeanwhile inside, Claire was starting to feel worse about her decision to abandon her friend. Who knows what Toby is doing to her. He might even kill her!<br>\r\n<br>\r\n\"Come Claire, come out and—\" the boy didn't finish his sentence. The eight year old watched as his shrunken babysitter came out, hands over her head.<br>\r\n<br>\r\n\"Please Toby! Don't hurt Kate!\" the blonde teen said as she walked up to them. \"I'll doing anything, just don't hurt her.\"<br>\r\n<br>\r\n\"Anything?\"<br>\r\n<br>\r\n\"Y-yes anything\"<br>\r\n<br>\r\n\"Cool!\" Toby grinned. He put a hand on each girls' shoulder and gently lead them away from the back door.<br>\r\n<br>\r\n\"Are you okay?\" Claire looked to the side at her friend, who had her eyes closed.<br>\r\n<br>\r\n\"Mmh...mmh...\" Kate said enjoying the slight squeeze Toby gave her shoulder.<br>\r\n<br>\r\nThe boy lead the girls to...</span></div></div>",
            "created":1580323500,
            "id":2780123,
            "title":"Easy Catch"
        },
        "1212":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...is the first place he looks",
                "...is the only place he doesn't think to look"
            ],
            "content":"<div class=\"\"><div> <span>\"Why is this happening?!\" the dark haired girl said as she struggled with her clothes.<br>\r\n<br>\r\n\"Not now! Help me!\" Claire had taken her top off, which was useless at this size anyway. Kate helped her to tie the straps around the doorknob. Just in time as Toby caught up with them.<br>\r\n<br>\r\n\"Hey! Let me in!\" the boy pulled the doorknob, but realized the door wouldn't budge.<br>\r\n<br>\r\n\"We have to hide,\" Claire said, although she was nude now the teen girl didn't care. She had different priorities now. She didn't want to become Toby's plaything. <br>\r\n<br>\r\n\"Oh my gawd! Claire put some clothes on!\" Kate's face went red as a beet as she saw her naked friend.<br>\r\n<br>\r\n\"Grow up! Come on!\" the blonde strolled out of the room. Kate followed, but first made some clothing adjustments. She realized Toby would easily catch her if she kept everything on, so she opted to wear her panties as a makeshift leotard. It was surprisingly efficient.<br>\r\n<br>\r\n\"Do you really think he won't get to us?\" Kate said as she followed her friend to the kitchen. <br>\r\n<br>\r\nThe room looked like a dining hall to the two foot tall girls. They were both in awe at the size of the furniture and objects around the room. A 'Thud' in the other room woke them immediately.<br>\r\n<br>\r\n\"Hurry! Let's hide in there!\" Claire ran over to the small closet under the sink.<br>\r\n<br>\r\n\"No way! He'll find us!\" Kate said shaking her head.<br>\r\n<br>\r\n\"You can stay and wait for him if you want!\"<br>\r\n<br>\r\nThe dark haired teen followed her nude friend and they closed the closet door. Right on time as Toby stepped into the room.<br>\r\n<br>\r\n\"Where are you little girls? Come out, come out, wherever you are,\" the boy said smiling.<br>\r\n<br>\r\nThe closet under the sink...</span></div></div>",
            "created":1580322000,
            "id":2780110,
            "title":"Hiding In The Closet"
        },
        "123":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Toby approaches them with a smile ",
                "The girls jump off the chairs and run",
                "They hear another person approaching "
            ],
            "content":"<div class=\"\"><div> <span>The two girls continue to shrink down in size rapidly, they were unable to see what was happening around them due to their bra and panties piling on top of them. The feel themselves stop shrinking at six inches tall, the perfect size for a doll. Katie and Claire climb out form underneath their clothes and look around their giant surrounds. They squeal and do their best to cover their naked forms with their own hands. <br>\r\n<br>\r\n\"What the fuck just happened?!\" Claire screams. <br>\r\n<br>\r\n\"I don't know.\" Katie whimpers. <br>\r\n<br>\r\nKatie and Claire just stand there trying to process everything that had just happened, a couple of minutes ago they were just relaxing and now they are no bigger than dolls. <br>\r\n<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1582320900,
            "id":2790833,
            "title":"Two Six inch Girls "
        },
        "1233":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Kate’s 12 year old sister",
                "A classmate of theirs",
                "Sophie, Claire’s creepy lesbian neighbour "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just as all the excitement was getting a bit too much for the shrunken teens, another character entered the fray.<br>\r\n<br>\r\nThis one was:</span></div></span></div>",
            "created":1582538220,
            "id":2792061,
            "title":"A saviour?"
        },
        "12331":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "“Heyyy, toys!”",
                "“Kate? Is that you?”",
                "\"The fuck?!\""
            ],
            "content":"<div class=\"\"><div> <span>Cold and shivering, two shrunken teenagers were soon discovered.<br>\r\n<br>\r\n“Huh?” A familiar voice mumbled. “What’s with all the clothes? Where are your people?”<br>\r\n<br>\r\n“That’s...!” Kate gasped, dashing out from cover.<br>\r\n“Kate, wait!” Claire tried to stop her but got dragged out with her.<br>\r\n<br>\r\n“Chloe!” Kate called up to the gargantuan tween. “Heyyy!”<br>\r\n<br>\r\nThe dark haired giantess reacted to her voice. “Hunh? Who said that?”<br>\r\n<br>\r\nChloe was dressed in jean shorts and a dark shirt. Her hair reached her shoulders and the lower half was dyed a bright red.<br>\r\n<br>\r\n“Down here!” Kate shouted at her feet.<br>\r\n<br>\r\nChloe eventually looked down and noticed the two doll sized girls at her feet.</span></div></div>",
            "created":1583180700,
            "id":2795693,
            "title":"Enter, sister "
        },
        "123313":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...easily takes the gun from Toby",
                "...gets shrunk while holding the two teens",
                "...teams up with Toby"
            ],
            "content":"<div class=\"\"><div> <span>\"No fucking way!\" Chloe reached down to grab her sister.<br>\r\n<br>\r\nKate was relieved that her little sister noticed her, but seeing her giant hand reaching for her was pretty scary. She wanted to run, but was frozen in fear. The large digits curled around her body and began to lift her. She noticed Chloe's black painted nails, nails as big as trays.<br>\r\n<br>\r\n\"Even better!\" the tween grinned as she noticed Claire a few inches away from her shrunken sister.<br>\r\n<br>\r\n\"No  stay away!\" Claire began to run, but she didn't even manage to cross the tile she was on. Chloe easily caught her and hovered her up in the air.<br>\r\n<br>\r\n\"Please Chloe! You have to help us!\" Kate said looking up at her sister's billboard face.<br>\r\n<br>\r\nThe tween just stared at them both. She couldn't believe she was actually holding her big sis and her stupid friend in her hands.<br>\r\n<br>\r\n\"Hey!\" Claire yelled as Chloe used her thumb to rub the shrunken teen's breasts. The blonde was helpless to do anything as the tween's other fingers were holding her arms to the side.<br>\r\n<br>\r\nChloe had no love for her sister's friends. She thought they were all just dumb bimbo's and she couldn't believe Kate hung out with them. Claire especially, as she always acted all high and mighty. Not so much now.<br>\r\n<br>\r\n\"Stop playing with us!\" <br>\r\n<br>\r\n\"Or what? Looks to me like you're not in a position to make demands 'boobs',\" the tween laughed. She loved every second of this.<br>\r\n<br>\r\n\"Who are you?\"<br>\r\n<br>\r\nChloe turned around and saw a young boy, dressed in swim trunks and holding a ray gun. She wasn't stupid, and put two and two together straight away. This boy shrunk the two teens.<br>\r\n<br>\r\n\"Hey there, what's your name?\" the tween put both girls in one hand. <br>\r\n\"Toby, what are you doing here?\" the boy frowned.<br>\r\n<br>\r\n\"I am Chloe, Kate's sister. My mom told me to go hang out with Kate and Claire,\" she took a step closer to Toby, \"I don't like Claire very much, I bet you don't like her too?\"<br>\r\n<br>\r\n\"Uh-huh,\" the boy seemed to hold his size ray a little tighter.<br>\r\n<br>\r\nShe knew it, no one likes Claire.<br>\r\n<br>\r\nChloe...</span></div></div>",
            "created":1583234520,
            "id":2795968,
            "title":"Tween Has Teens In Her Hands"
        },
        "1233131":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...in perfect proportion with the girls",
                "...much smaller than Claire and Kate",
                "...twice as large as the two teens"
            ],
            "content":"<div class=\"\"><div> <span>Toby was planning to use the gun on this new girl, but before he could Chloe was onto him. She reached out her free hand and easily snatched it from his hand.<br>\r\n<br>\r\n\"I'll take that,\" the tween said.<br>\r\n<br>\r\n\"Hey give that back it's mine!\" the boy frowned and began to reach for her hand.<br>\r\n<br>\r\n\"Oh no! Toby you'll overpower me!\" Chloe could easily hold the gun out of his reach.<br>\r\n<br>\r\n\"Uh-huh! You'll be sorry! I'll shrink you!\" the eight year old boy said triumphantly.<br>\r\n<br>\r\n\"Oh really? Like this?\" the twelve year old girl squeezed the trigger. Seeing as Toby was standing in front of her he was an easy target.<br>\r\n<br>\r\n\"Noooo!\" Toby screamed as the energy coursed through his body. He slowly began to dwindle. His swim trunks began to look baggy on him. He had to get away.<br>\r\n<br>\r\nChloe stopped firing and just watched amused as the shrinking eight year old tried to get away. The boy stumbled over his far too big swim trunks. The tween didn't even have to take two steps to catch up to him. She pocketed the size ray and reached down.<br>\r\n<br>\r\nShe hovered the shrunken boy out of his oversized cloth and walked over to the lounge chairs. She sat down on the chair and put Toby, her sister and Claire down on the small side table. She watched excited as the naked teens saw the freshly shrunken nude boy. Toby stared at Claire and his small dick began to throb.<br>\r\n<br>\r\n\"Well, well, it looks like you like Claire a lot!\" Chloe laughed as she noticed his little boner. <br>\r\n<br>\r\nThe funny thing, the boy was...</span></div></div>",
            "created":1583235780,
            "id":2795986,
            "title":"Takes The Gun From Toby"
        },
        "12331313":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...you to blow that huge dick\"",
                "...you two to show 'big' Toby here a good time\"",
                "...to play\""
            ],
            "content":"<div class=\"\"><div> <span>\"Oh wow,\" Chloe only now noticed that Toby was twice the size of her sister and her bimbo friend. \"This must be awkward for you guys.\"<br>\r\n<br>\r\nBoth Claire and Kate swallowed hard as they realized what she was referring to. The boy was as a small giant to the two six inch tall teens. Chloe hadn't fired long enough on him and he ended up a foot tall. Toby smiled, he didn't like that he was shrunk by his own size ray, but seeing as he still was bigger than the teens excited him.<br>\r\n<br>\r\n\"Hey Claire, I'm curious. You're a slut right? Tell me, have you ever seen such a big dick?\" Chloe said.<br>\r\n<br>\r\n\"What!?\" the shrunken teen replied.<br>\r\n<br>\r\n\"I mean you're constantly boasting about doing all these guys. I guess judging cocks is just routine for you. Now be honest is Toby's dick big?\" <br>\r\n <br>\r\n\"P-please Chloe, this isn't funny,\" Kate said, trying to control her sister. Though she had trouble keeping staying calm herself. The dark haired teen kept eyeing the boy's junk. <br>\r\n<br>\r\n\"Seriously, answer the question,\" the tween said, staring down at Claire.<br>\r\n<br>\r\n\"Yes it's freaking huge! Is that what you wanted hear!? Now stop messing with us and grow us back!\" the blonde teen yelled up at her. <br>\r\n<br>\r\n\"I don't think so, at least not yet,\" the twelve year old put a finger to her lip, seemingly thinking.<br>\r\n<br>\r\n\"You know, first I want...</span></div></div>",
            "created":1583243520,
            "id":2796051,
            "title":"Twice As Large"
        },
        "123313131":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...decided Claire should be smaller first",
                "...thought her sister could do a better job",
                "...watched the show as Claire gave Toby a blowjob"
            ],
            "content":"<div class=\"\"><div> <span>\"What!?\" Claire couldn't believe her ears.<br>\r\n<br>\r\n\"You heard me,\" Chloe said.<br>\r\n<br>\r\nThe shrunken blonde looked in Toby's direction. Due to her being half his size she was eye level with the one eyed monster that's Toby's cock. <br>\r\n<br>\r\n\"C-Chloe, you can't be serious?\" Kate looked up to her sister's face. She couldn't believe her little sister would suggest such a thing.<br>\r\n<br>\r\n\"I am, Claire can't shut up about dicks. It's only fair she gets to suck him off,\" the tween grinned. Her shrunken sister looked disgusted, but also disappointed.  <br>\r\n<br>\r\n\"I'm his freakin' babysitter!,\" Claire yelled. <br>\r\n<br>\r\n\"Oh come on, from what I've heard it's not the worst thing you've done,\" Chloe said.<br>\r\n<br>\r\n\"Wait did you...,\" the blonde turned towards her friend.<br>\r\n<br>\r\n\"Hey! Big people talking here,\" the tween raised her voice, \"Now why don't you get started, we haven't got all day.\"<br>\r\n<br>\r\nClaire thought for a second. Most of her boasting was just lies. She did have fun with a few guys, but not as much as she told everyone. Plus, not nearly the number of times others thought she did. That one time was just to raise her grades. She glanced at the boy's cock one last time.<br>\r\n<br>\r\n\"You'll grow us back if I do this?\" the blonde asked. Chloe didn't say anything and just smiled. \"Alright.\"<br>\r\n<br>\r\nChloe...</span></div></div>",
            "created":1583243640,
            "id":2796052,
            "title":"Blow It"
        },
        "1233131313":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...Chloe decided it took too long",
                "...Claire finished the job",
                "...Kate managed to get to the size ray "
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry,\" Kate said as her friend walked over to Toby. <br>\r\n<br>\r\n\"So am I,\" Claire replied. As soon as this was over she'd have a talk with her friend. Apparently she shared a little too much about her private life. She'd make sure to punish Toby for shrinking her in the first place and definitely take down Chloe and make her suffer. Before anything of that could happen she had to do this awful task.<br>\r\n<br>\r\n\"Toby, your babysitter is going to make you feel good. I want you to just relax and let her do her job,\" Chloe said. She had her hands under her chin and was watching her shrunken pets.<br>\r\n<br>\r\n\"Oh gawd,\" Claire was now face to face with the boy's cock. It was even bigger up close. He obviously was an early bloomer, but due to him being none less than a ten foot giant to her his member was the size of a ruler and really thick at that.<br>\r\n<br>\r\n\"Clock is ticking,\" the tween above her reminded her, \"You don't want to keep your audience waiting.\" The twelve year old reached down with her pointy finger and gave the six inch blonde a push.<br>\r\n<br>\r\n\"Fuck!,\" Claire felt the massive organ rub against her face. It left a wetness on her cheek, which to her disgust was Toby's pre-cum. Above her the boy giggled as the teen's hair brushed up against him.<br>\r\n<br>\r\n\"P-pull yourself together, we have to do this,\" the blonde told herself and grabbed hold of the shaft. She stared at the huge dick with disgust for another second. Then the teen slowly opened her mouth and brought the tip in.<br>\r\n<br>\r\n\"Mmwwwaawhh...\" Toby groaned as his babysitter began to lick. He never felt this good before, he actually was glad the girl had shrunken him. Otherwise he would've missed this. <br>\r\n<br>\r\nThen...<br>\r\n</span></div></div>",
            "created":1583243820,
            "id":2796053,
            "title":"She Does As She's Told"
        },
        "12331313131":{
            "author_id":"littleexplorer",
            "author_name":"Biggerthanbig",
            "choices":[
                "...for the next assignment",
                "...to change some sizes",
                "...to wash up  "
            ],
            "content":"<div class=\"\"><div> <span>\"Is that all you got?\" Chloe watched as Claire kept working on the tip of Toby's cock. She'd seen blow jobs before and this wasn't at all how she imagined it to be in real life. \"Let me help you.\"<br>\r\n<br>\r\nThe twelve year old used one hand to grab hold of Toby with the other she carefully pinched Claire's head. The shrunken blonde started to panic and wanted to get away, but found her head being pushed further towards the boy. Toby's whole dick pushed into her mouth to the back of her throat. She was about to gag when Chloe began to slowly pull the shrunken boy back and forth. Doing so made Toby moan. Meanwhile Claire's mouth was invaded again and again by the giant prick.<br>\r\n<br>\r\n\"What is...aaahhHHH!,\" it didn't take long before Toby reached his breaking point. Chloe smiled, she pulled him back away from Claire just a little. However, she made sure the shrunken teen got most of the load inside. Claire's cheeks puffed up as her mouth filled with cum, when the tween pulled Toby out and let the tiny teen go there was plenty left to cover the shrunken teen's chest.<br>\r\n<br>\r\n\"Y...you...bit..-cough-,\" Claire tried to talk, but kept coughing up white goo. Kate rushed over to her friend, but kept a safe distance. Toby lay on his back enjoying the afterglow of his orgasm.<br>\r\n<br>\r\n\"C-Chloe can grow us back now?\" Kate asked.<br>\r\n<br>\r\n\"And here I was thinking she likes to swallow!\" her sister laughed.<br>\r\n<br>\r\nTime...  </span></div></div>",
            "created":1583243940,
            "id":2796054,
            "title":"Not Good Enough"
        },
        "123313133":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Plaything.”",
                "Lover.”",
                "Slave.\""
            ],
            "content":"<div class=\"\"><div> <span>“But enough about Toby.” Chloe literally just threw Toby away, where he landed in the pool with a splash and a yelp, “because I’ve got two sluts to play with right here.”<br>\r\n<br>\r\n“...wait, two?!” Kate shrieked up at her. “Exactly what do you plan on doing?”<br>\r\n<br>\r\n“Depends, little Kate,” Chloe leered at her. “You going up or down?”<br>\r\n<br>\r\nKate grimaced, and looked her giant sister up and down.<br>\r\n<br>\r\n“Uh, we’re sisters?”<br>\r\n<br>\r\n“And?” Chloe grinned. “Last I checked, tinies didn’t have rights. You’re not my sister any more, far as I care.”<br>\r\n<br>\r\n“Then... what am I?” Kate’s voice quivered.<br>\r\n<br>\r\nChloe’s smile widened.<br>\r\n<br>\r\n“You’re my...”</span></div></div>",
            "created":1583275980,
            "id":2796219,
            "title":"Playtime With Chloe."
        },
        "1233131332":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "“My boobs need attention.”",
                "“I wonder what Claire tastes like.”",
                "\"I always wanted to be bigger.\""
            ],
            "content":"<div class=\"\"><div> <span>Lovers.”<br>\r\n<br>\r\n“Lovers?!” Kate cried, as Chloe slowly dragged the tiny teen’s naked body across her own. With a grin she forced herself between Kate’s knees and slathered a long tongue across most of her tiny sister’s middle, prompting another yelp. Kate flailed and punched for all she was worth, but couldn’t stop her sister’s enormous tongue from probing her every crevice.<br>\r\n<br>\r\nMeanwhile Claire wasn’t forgotten in her other hand. Struggling against the iron grip, Chloe squashed the tiny girl against her stomach and pushed her downwards under the waistband of her panties. Claire screamed as her body was thrust against Chloe’s throbbing pussy, ground against the slippery, itchy mass helplessly. <br>\r\n<br>\r\nChloe sucked on her sister’s middle, and then just let her rest, legs splayed, across her mouth.<br>\r\n<br>\r\n“Aren’t you glad you went up, little slave?”<br>\r\n<br>\r\n“I’m not your slave I’m your sister dammit!” Kate cried, kicking her legs out in every direction.<br>\r\n<br>\r\n“Careful now, I might just have you switch places.” Chloe winked. “Speaking of which...”</span></div></div>",
            "created":1583335800,
            "id":2796584,
            "title":"Little Lovers"
        }
    },
    "info":{
        "author_id":"littleexplorer",
        "author_name":"Biggerthanbig",
        "brief_description":"Toby has a size ray that can grow and shrink people.",
        "created":1549563420,
        "description":"<td align=\"left\" class=\"norm\">Claire - age 17. Likes to be the centre of attention.<br>\r\nKate - age 16. Follows her friend Claire everywhere she goes. <br>\r\nToby - age 8. Keeps to himself most of the time. Very knowledgeable for his age.<br>\r\n<br>\r\nToby has a size ray that can grow and shrink people. <br>\r\n<br>\r\nIf you add, please try to write at least a few sentences.<br>\r\nThings that are frowned upon: animals, killing, scat. <br>\r\n<br>\r\n<u>This story has interactions with young characters, if this offends you, please stop reading and leave quietly.</u></td>",
        "id":2182052,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1588185780,
        "modified":1588185780,
        "pretty_title":"Size Fun Babysit - Boy Genius"
    }
}