{
    "chapters":{
        "1":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "A Whole Team!",
                "Just one person..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should a whole team be abducted, or an individual? </span></div></span></div>",
            "created":1366866000,
            "id":1578454,
            "title":"Who Should be Abducted?"
        },
        "11":{
            "author_id":"vilecreatin",
            "author_name":"FireDragon14",
            "choices":[
                "Team 7",
                "Team 8",
                "Team 9 (bushy brows)",
                "Team 10 (InoShikaCho)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which team?</span></div></span></div>",
            "created":1372568400,
            "id":1620370,
            "title":"A Whole Team!"
        },
        "111":{
            "author_id":"vilecreatin",
            "author_name":"FireDragon14",
            "choices":[
                "Before time skip",
                "After time skip (Sasuke is still part of the team)",
                "After timeskip (Sai replaces Saskue)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this before the timeskip or after? Meaning are the Genin 12-13 years old or 15-16 years old?</span></div></span></div>",
            "created":1372568400,
            "id":1620372,
            "title":"Team 7"
        },
        "1111":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "They arrive at the crash site ",
                "At the crash site something emerges ",
                "another story line"
            ],
            "content":"<div class=\"\"><div> <span>Team Seven is waiting for Kakashi outside of Konoha when they see a large object fall out of the and land several miles away from them.<br>\r\n   <br>\r\n\"What was that!\" Screamed Sakura in surprise as she watched the large object fall to the ground.<br>\r\n    <br>\r\n\"I don't know Sakura-chan lets go check it out! Screamed an excited Naruto.<br>\r\n   <br>\r\n\"Shut up Dobe we should wait for Kakashi. Said Sasuke.<br>\r\n   <br>\r\n\"Who are you calling a Dobe Teme! What are you Chicken! Naruto taunted.<br>\r\n  <br>\r\n \"Fine\" replied an annoyed Sasuke. \"But we are only taking a quick look.\"<br>\r\n <br>\r\n \"Whoopee!\" Naruto yelled excitedly.<br>\r\n  <br>\r\n\"Are you guys sure we shouldn't wait for Kakashi.\" Sakura said nervously. <br>\r\n  <br>\r\n\"Come on Sakura-chan it'll be fun.\" Naruto said.<br>\r\n <br>\r\n \"Okay fine I'll come.\" She replied. <br>\r\n<br>\r\nThe Three young ninjas then began to sprint towards the crash site.     <br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1455166800,
            "id":2102723,
            "title":"Before time skip"
        },
        "11111":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "One of the Wasp guards attacks Team Seven and stings someone",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>After a few minutes of sprinting through the forest Team Seven arrived at the crash site. The Team was shocked to find that instead of a crater there was a massive structure that looked like a massive wasp nest, it was dotted with numerous holes all around it. The structure also seemed to be partially made out of advanced machinery. What surprised Team Seven the most though was the different creatures that were emerging from the structure. All of the creatures seemed to be insectoid in makeup but their body structures greatly differed. The first creatures were like wasps but were about the size of a horse. The Wasps seemed to be flying patrols around the nest. The next group were humanoid wasps who walked upright. They seemed to be the ones who were giving commands. The final group was the strangest and most shocking to Team Seven. These creatures seemed to be the different then the Wasps and the Masters. While they had the same chitonous skin and arthropod eyes they came in all different shapes and sizes. Some of them even looked human like. All of them were naked, but their sex organs were hidden behind the chiton. These creatures were working and being commanded by the Masters in a Slave-like manner. Many of the Slave creatures also had bulging stomachs. Just then one of the human-like Slave creatures with the largest bulge stopped working and bent squatted over a patch of grass. The Team was horrified to see the chiton over its groin open revealing an insect-like penis and vagina. They were even more horrified when the Slave began to squirt out an organic substance that looked like the organic part of the hive all over the ground using it's cock and pussy. After covering several yards with the organic material it then began to lay a dozen baseball sized grey eggs. After the process was done one of the Wasps flew down, picked up the Slave, and carried them back into the Hive. The Team noticed that this process was being repeated all over the clearing until much of the area was covered in the same material that made up the Hive. The Team was so engrossed in what they were seeing they didn't noticed something creeping up behind them. </span></div></div>",
            "created":1455166800,
            "id":2102763,
            "title":"They arrive at the crash site "
        },
        "111111":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "Sakura",
                "Sasuke"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which member of Team Seven gets stung by the Wasp? What happens?</span></div></span></div>",
            "created":1455166800,
            "id":2102767,
            "title":"Who gets stung?"
        },
        "1111111":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "They go After Sakura",
                "They Head back to the village"
            ],
            "content":"<div class=\"\"><div> <span>  Naruto and Sasuke jumped up in shock when one of the Wasps swooped down from the trees above them and stung Sakura in her back. Sakura screamed as she was stung and then began to convulse for a few seconds before going completely still the pupils in her eyes going wide and blank. The Wasp then picked her up and started to flay towards the Hive. <br>\r\n   \"Sakura!!\" Screamed Naruto in anguish as the Wasp carried her into the Hive.<br>\r\n    \"Shut-up Dobe! Do you want to get us taken to!\" Whispered Sasuke in anger. <br>\r\n    \"We have to go after her Sasuke!\" We can't let them take her.\" Naruto exclaimed.<br>\r\n   \"No Naruto. We have to head back to the village and get help.\" Said Sasuke.<br>\r\n  \"She's are teammate Sasuke! We have to Save her!\" Shouted Naruto.</span></div></div>",
            "created":1455166800,
            "id":2102789,
            "title":"Sakura"
        },
        "11111111":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "Sakura has been converted into a Slave",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Sasuke knew that Naruto was right and that they had to go after Sakura before something bad happened. After Sasuke told Naruto this they used the teleportation jutsu to bypass the Wasp sentries and enter the Hive. Inside the Hive was a maze of tunnels full of Slaves, Wasps, and some Masters. The duo had to use all their skill in stealth to ensure they were not detected. After several minutes of walking in circles they came upon a massive chamber filled with green tinted pods. Naruto then spied Sakura unconscious inside one of the pods.<br>\r\n   \"Sakura!!\" Naruto screamed in both relief and worry as he ran towards her.<br>\r\n   \"Shut up Dobe.\" Scolded Sasuke.<br>\r\n   \"Come on Sasuke we have to get this thing open.\" Naruto said frantically<br>\r\nJust then Sakura's pod began to fill with a dark green liquid that in a few seconds completely submerged Sakura. Naruto and Sasuke frantically tried to pry the pod open but it would not budge. All of a sudden they heard a large mass enter the chamber behind them they turned around in shock to find a massive Wasp-like creature, most likely the Queen of the Hive. Naruto and Sasuke prepared to fight, but the Queen did not move towards them. All of a suddenly Sakura's pod opened releasing torrents of green liquid and revealing that Sakura had been....  </span></div></div>",
            "created":1455166800,
            "id":2102831,
            "title":"They go After Sakura"
        },
        "111111111":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "Sasuke",
                "Naruto"
            ],
            "content":"<div class=\"\"><div> <span>Naruto and Sasuke looked on in horror as a changed Sakura emerged from her pod. The first thing that they noticed was that she was naked her cloths having dissolved in the pod. They quickly forgot about that when they noticed that much of Sakura's skin had been replaced with chiton. The chiton was concentrated around her back, groin, shoulders, hips, breasts, stomach, and neck. The skin that had not turned into chiton had become a dull green. Sakura's hair had remained pink, but her face had become a dull green, she had two antenna poking out from her forehead her eyes had become arthropods like insects. Sakura had gained small mandibles on the sides of her mouth and her teeth had sharpened. The most disturbing thing was what happened to her arms and legs. They had become segmented like an insect and were covered in green chiton. Each arm had two fingers and one thumb while the legs each had two toes in the front and one in the back. The duo was horrified of what happened to their friend. \" Sakura\" Naruto said nervously looking around as more creatures gathered. \"Are you okay?\"<br>\r\n<br>\r\n  The creature that had become Sakura stood there. First looking at the pair, then towards the Queen, then back towards Naruto and Sasuke. \"<span class=\"clgreen\"><i>I'm Fine Naruto, better then fine now that I've been Converted</i></span>.\" Chittered Sakura in an unnatural voice that sounded like a combination of a human and an insect. <br>\r\n   <br>\r\n\"What happened to you Sakura! What did they do to you! Screamed Naruto in anguish. <br>\r\n<br>\r\n<span class=\"clgreen\"><i>\"I have become one with the Hive and have been Converted into a form and mentally rewired in a way that better suits the needs of the Hive and of my Queen.\"</i></span> Chittered a joyous Sakura. <span class=\"clgreen\"><i>\"My Queen has come to this planet to colonize it and to Convert its inhabitants into Slave workers, warriors, and breeders like myself.</i></span><br>\r\n    \"Sakura you have to help us stops this!\" Screamed Naruto.<br>\r\n<span class=\"clgreen\"><i>\"No Naruto, Conversion is the only future for lesser beings like you, Sasuke and every lesser creature on this planet</i></span>\". Chittered Sakura with joy. <span class=\"clgreen\"><i>\"Don't worry soon you will both be thanking me for the gift of joining the Hive and serving the Queen as her Slaves.\"</i></span><br>\r\n<br>\r\nJust then the Chiton covering Sakura's groin burst open revealing not only her mutated pussy, but also an erect insect-like cock tipped with barbs. Suddenly the mutated Sakura jumped onto....<br>\r\n<br>\r\n  </span></div></div>",
            "created":1455166800,
            "id":2102889,
            "title":"Sakura has been converted into a Slave"
        },
        "1111111111":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "Naruto becomes lost in the endless maze of tunnels ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Sasuke yelped in surprise as the newly Converted Sakura pounced on him. He shouted for help, but Naruto was frozen in shock, overwhelmed by what was happening. Sakura and Sasuke struggled on the ground for a few seconds before Sasuke was quickly subdued thanks to Sakura's new strength.<br>\r\n <br>\r\n<span class=\"clgreen\"><i> \"Don't worry Sasuke. You'll thank me after this is all done.\"</i></span> Sakura excitedly chittered. The Sakura ripped off Sasukes shorts and underwear and impaled him with her mutated insect cock. \"<span class=\"clgreen\"><i>My new cock ejaculates an aphrodisiac.\"</i></span> said Sakura <span class=\"clgreen\"><i>\"It should make you more agreeable.\"</i></span><br>\r\n<br>\r\n\"Uh uh uh.\" panted Sasuke in both pleasure and pain as he felt for the first time in his life, a penis penetrate his anus. Sasuke then began to feel a large amount of liquid enter his ass. Sasuke's mind began to go blank and fuzzy as he was overwhelmed by the pleasure he was receiving from Sakura's mutant cock. \"Yes, Yes!! I want more! Please Sakura fuck me more! Sasuke screamed, swamped by the pleasure that Sakura's mutated cock was giving him.<br>\r\n <br>\r\n<span class=\"clgreen\"><i>\"Yes Sasuke. Soon you will have endless pleasure as one of the Hive's Slaves!\"</i></span> Exclaimed Sakura. <span class=\"clgreen\"><i>'Our Queen will breed us both and we will have the pleasure of birthing her spawn and being her loyal pets and slaves.\" </i></span><br>\r\n<br>\r\n\"Yes Sakura! More Pleasure! Please! Yes Yes YES!!\" Screamed Sasuke as he experienced an earth-shattering orgasm. Sasuke then laid there on the floor unmoving, his mind blank with pleasure.<br>\r\n<br>\r\n<span class=\"clgreen\"><i>\"Shh Sasuke.\"</i></span> Sakura whispered <span class=\"clgreen\"><i>\"Soon you will have endless pleasure as soon as you are Converted. But first...\"</i></span> Sakura said as she turned toward the shell shocked and silent Naruto <span class=\"clgreen\"><i>\"My Queen has commanded me to allow you a chance to escape so that her warriors can gain some practice for the coming invasion. I suggest that you start running.\" <br>\r\n</i></span><br>\r\nNaruto, horrified by what he had just witnessed sprinted towards the exit. Glancing back only to see Sakura place Sasuke into one of the pods, and a large swarm of Wasps starting to fly toward him.   </span></div></div>",
            "created":1455253200,
            "id":2103047,
            "title":"Sasuke"
        },
        "11111111111":{
            "author_id":"genocide67",
            "author_name":"Naruko lover",
            "choices":[
                "Naruti gets turned into a quuen",
                "Naruto gets turned into a slave"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh fuck I'm lost\" says naruto as the wasps catch up to him.</span></div></span></div>",
            "created":1599588840,
            "id":2899565,
            "title":"Naruto becomes lost in the endless maze of tunn..."
        },
        "11111111112":{
            "author_id":"deathokami",
            "author_name":"DeathOkami",
            "choices":[
                "turn him into the next queen",
                "turn him into a breeder"
            ],
            "content":"<div class=\"\"><div> <span>Naruto is running thru the maze like corridors like a mad man to find the exit in fact he got closer than any man before him but the warriors grab him \"aww shit\" said naruto <span class=\"cbgreen\">\"your coming with us\"</span> said random warrior 1 and they knock him out and...</span></div></div>",
            "created":1473224400,
            "id":2207216,
            "title":"Something else"
        },
        "111111111122":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Stay with our Team 7 breeders",
                "See what's up in the village"
            ],
            "content":"<div class=\"\"><div> <span>Naruto felt nothing but a warm bliss. There was an occasional pinch, maybe a little sting, but that meant nothing when you felt so warm and happy. Next came the dreams, happy dreams where his belly was filled with the beautiful babies of the hive. As a breeder he had nothing to do but lay in sweet honey and let his belly grow and grow, until, well, it hurt a little as the he pushed the eggs out of him, but it didn't matter, because soon those eggs would hatch, and his babies would become workers for their hive. Maybe they would be strong workers? Dedicated warriors? Happy breeders like him? And he would be bred again, his belly would grow, and he would lay happily in the sweet honey...<br>\r\n<br>\r\nThe liquid of the pod was drained away, and Naruto awoke from the deep slumber, but the warmth and happiness remained. He felt a little dizzy and unsure in his new form, but even that was secondary to the bliss and happiness of being a breeder for his hive. He needed a cock in him, he needed his belly to grow with the hive's young.<br>\r\n<br>\r\nSakura and Sasuke didn't notice him; they were too busy fucking and rolling around on the sticky, honey covered ground. Naruto once thought it was mucus, but now he knew that it was honey made by the workers. It was sweet and made your skin tingle. Sakura and Sasuke were impaled on the other's cock, groaning and moaning as one would thrust into the other, before the other would thrust out...In and out...<br>\r\n<br>\r\nNaruto wanted to be fucked.<br>\r\n<br>\r\n<span class=\"cbgreen\">Naruto</span>, Sakura said as if just noticing him. Sasuke arched as she took herself out of him, but he didn't get up. <br>\r\n<br>\r\n<span class=\"cbgreen\">Isn't it wonderful, Naruto?</span>, Sakura said as she advanced towards him. <span class=\"cbgreen\">We're breeders!</span><br>\r\n<br>\r\nShe grabbed his segmented arm and, without another word, impaled herself into Naruto's dripping vagina. Without thinking, Naruto did the same to her. They fell to the floor and rolled on the ground, the honey sweet and tingly and warm like their semen. <br>\r\n<br>\r\nSoon, they would give birth, and then be bred again, and again...<br>\r\n<br>\r\nDo we stick with our Team 7 breeders, or should we head to the village?</span></div></div>",
            "created":1481950800,
            "id":2251120,
            "title":"turn him into a breeder"
        },
        "1111111111222":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "They are getting search parties together...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The village is worried sasuke has gone missing. </span></div></span></div>",
            "created":1508302800,
            "id":2403275,
            "title":"See what's up in the village"
        },
        "11113":{
            "author_id":"marten",
            "author_name":"marten",
            "choices":[
                "yes",
                "another story line"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><b><font class=\"size35\" style=\"\">What if Abathur (from starcraft 2 <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.starcraft.wikia.com/wiki/Abathur\" target=\"_blank\">http://www.starcraft.wikia.com/wiki/Abathur</a>)kidnaps team 7 and <br>\r\nturns them into the next Zerg queens or uses them to mass produce a zerg/shinobi hybrids? </font></b></span></div></span></div>",
            "created":1521867600,
            "id":2468846,
            "title":"another story line"
        },
        "111131":{
            "author_id":"marten",
            "author_name":"marten",
            "choices":[
                "Zerg queens",
                "Hybrid mothers "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><b><font class=\"size35\" style=\"\">Alright then, what use does team 7 have for Abathur?</font></b></span></div></span></div>",
            "created":1521867600,
            "id":2468847,
            "title":"yes"
        },
        "112":{
            "author_id":"vilecreatin",
            "author_name":"FireDragon14",
            "choices":[
                "Before Timeskip",
                "After Timeskip",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this before the timeskip or after? Meaning are the Genin 12-13 years old or 15-16 years old?</span></div></span></div>",
            "created":1372568400,
            "id":1620373,
            "title":"Team 8"
        },
        "12":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "A Guy!",
                "A Pretty Girl!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Gender Should That Person Be?</span></div></span></div>",
            "created":1366866000,
            "id":1578455,
            "title":"A Boy or a Girl?"
        },
        "121":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Naruto!",
                "Sasuke!",
                "Other!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Guy Should It Be?</span></div></span></div>",
            "created":1366866000,
            "id":1578460,
            "title":"A Guy!"
        },
        "1211":{
            "author_id":"omaly",
            "author_name":"Omaly",
            "choices":[
                "Fuse him with alien DNA",
                "Plant an alien baby in him",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do the aliens do to Naruto?</span></div></span></div>",
            "created":1370062800,
            "id":1601310,
            "title":"Naruto!"
        },
        "12111":{
            "author_id":"redfox1234",
            "author_name":"DashingDarkness",
            "choices":[
                "\"By having him fuck us of course!\"",
                "\"Sending him back down to his planet to create more of us!\""
            ],
            "content":"<div class=\"\"><div> <span>Naruto awoke to the sounds of clicking and muttering. Tiredly, he tried to open his eyes, but only darkness greeted him on that front. A machine started beeping faster, parallel to what he felt in his heartbeat, and the lights suddenly turned on. Whatever it was that had captured him - they knew he was awake.<br>\r\n<br>\r\nNaruto couldn't focus his vision - despite the light his eyesight swam and convulsed about him. He had no idea if there were people in the room, but right now, he was hopped up on something serious. <br>\r\n<br>\r\n\"Human.\" He heard - a deep, guttural, almost metallic voice hailed him. \"Welcome to our humble abode.\"<br>\r\n<br>\r\nFinding the words to come out rather easily, he spoke back. \"Whatever your humble abode is, I can't see anything.\"<br>\r\n<br>\r\nThe other person seemed to agree. \"We had it that way, while your body adapted to the changes we made.\"<br>\r\n<br>\r\nNaruto tried to sit bolt upright, but found himself restrained. \"What changes?!\" Now that his adrenaline was pumping, Naruto found his vision was coming back to him. He could make out his captor, and a he was surprised, shocked, and scared, for it was nothing he had ever seen before.<br>\r\n<br>\r\nThe creepy monster before him - one that he found strangely attractive, was somewhat humanoid in stature. Its skin was silver, like its surroundings, and it stood at over seven feet in height. It was definitely feminine in shape. Naruto tried to avert his gaze from the eight massive breasts on its - no, her - chest, each of which put even Tsunade's bust to shame. The alien laughed, a strange yet somewhat pleasing sound.<br>\r\n<br>\r\n\"Silly human, we have no need for your kind's petty customs here. Among my species, our sexuality is embraced, not hidden away. Indeed, look at yourself, you are not clothed either.\"<br>\r\n<br>\r\nNaruto looked down at his body, and indeed, he was naked as the day he was born, but there was something else that bothered him. \"Augh! I'm different!\"<br>\r\n<br>\r\n\"I believe I mentioned that before.\" The alien commented. \"You have been engineered to be the progenitor of the new Kalapos race.\" The bonds on him came undone, and she directed Naruto to a mirror in another room.<br>\r\n<br>\r\nNaruto looked at himself - he had been fused, in a way, with the alien species that he was talking to - only he was still distinctively male. His skin tone had changed slightly, becoming a bit grayer, but the skin itself was much thicker and armor-like, despite being as elastic as human skin. His muscles had all expanded to the point where there was toned and corded muscle everywhere, from the twelve-pack abdominals on his belly to his rather large biceps, he could see every detail on pretty much every muscle in his body. It wasn't a terrible look, if he did say so himself. Looking down further, he noticed something very different. <br>\r\n<br>\r\n\"I have four cocks?!\" From his hips hung four massive, veined manhoods, each one hung over his huge balls and straight down past his knees. Speaking of which, he now seemed to have eight balls as well, each of them just over the size of a basketball, and all of them hanging perfectly in one sack. How did he not notice all of this weight he was carrying over here?<br>\r\n<br>\r\n\"You are the progenitor - it is only right to have you be as efficient as possible in sexual matters. That is why we picked you, of course. Out of all of the humans, you were the most endowed, despite your age, which is an interesting matter in itself.\"<br>\r\n<br>\r\n\"It is most likely due to that foreign energy we read in his body.\" Another voice arrived, and Naruto turned to see another alien enter. She was similar in height to the first, but she only had four breasts instead of her partner's eight. Also, looking down, Naruto noticed that she had two cocks as well, though they were not as big as any of his cocks, and below that cock was a vagina, indicating her gender. \"I am Lana, by the way.\" She said. Naruto looked to the other one.<br>\r\n<br>\r\n\"And I am Ana - I apologize for not introducing myself earlier.\"<br>\r\n<br>\r\n\"That's fine.\" Naruto said. Now that he thought about it, his voice seemed incredibly deep and guttural as well, yet it still retained its human smoothness. \"Well, what are you going to do with me now that I'm here?\"<br>\r\n<br>\r\nThe two alien girls looked at each other - he was cutting to the chase now. \"Our race, the Kalapos, perished two millennia ago. We are the only survivors. As two females of the Kalapos race cannot reproduce - yes, even a hermaphrodite like me cannot reproduce with a female - our only choice was to create a new male. Since there were no more males left, we would have to create a new race based on a fusion of the male gender of one race and our DNA. After much deliberating, we chose your humans.\"<br>\r\n<br>\r\n\"Meaning that every woman I have children with - they'll come out like me?\" Naruto asked, looking at his new body.<br>\r\n<br>\r\n\"That's the plan.\" Ana said. \"In fact, you humans have some perks of your own, such as your inherent energy inside of you.\" Naruto assumed she was talking about chakra. \"That will remain unchanged.\"<br>\r\n<br>\r\n\"Interestingly, you are the second four-set Kalapos to occur in over ten millennia. The first is standing right next to me.\" Lana spoke.<br>\r\n<br>\r\nAna waved. \"A four-set Kalapos has four sets of their sexual organs. It's very rare, and it was an accident in you. A two-set, like Lana, is much more common.\"<br>\r\n<br>\r\nNaruto only nodded. \"Are you sure this isn't a dream?\"<br>\r\n<br>\r\nThe two girls laughed. \"Yes, we're sure.\" Ana reassured.<br>\r\n<br>\r\n\"Should we test him now?\" Lana asked.<br>\r\n<br>\r\n\"Yes.\" Ana answered. \"That would be ideal. But how?\"<br>\r\n<br>\r\nLana said...</span></div></div>",
            "created":1375851600,
            "id":1642198,
            "title":"Naruto, the Xenonin"
        },
        "121112":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "The best women to breed with first, starting with a Tsunade Senju...",
                "Other... "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They aliens drop Naruto back in his apartment with modified clothes and a not. What does the not tell Naruto?</span></div></span></div>",
            "created":1508302800,
            "id":2403277,
            "title":"Sending him back down to his planet"
        },
        "12112":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Naruto groaned as he awoke. He felt dizzy, and the whole room was nothing but a blur. Finally, it settled, and Naruto gasped. It was silvery, and slippery looking as quicksilver. He was on some kind of bed which, despite looking metallic, felt soft and spongy. He was wearing a white night-gown that went to his knees, but he distinctly remembered falling asleep in the forest with the rest of Team 7. <br>\r\n<br>\r\nWas he alone in the room? </span></div></div>",
            "created":1370149200,
            "id":1602063,
            "title":"Wake Up Call"
        },
        "121122":{
            "author_id":"omaly",
            "author_name":"Omaly",
            "choices":[
                "The other person was going to get impregnated too.",
                "The aliens were going to impregnate Naruto with that person?!?"
            ],
            "content":"<div class=\"\"><div> <span>There was a figure that he could barely make out on the other side of the room. It seemed female to him, though very hard to determine who it was. His focus changed to the aliens in the room, unable to understand what they are saying. Though based on their gestures it seemed something was about to be involved with this other person.</span></div></div>",
            "created":1371877200,
            "id":1615560,
            "title":"No"
        },
        "1211221":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Sasuke",
                "Sakura"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And who is Naruto's pregnancy buddy?</span></div></span></div>",
            "created":1371877200,
            "id":1615586,
            "title":"The other person was going to get impregnated too."
        },
        "12112211":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "...heard a strange sound.",
                "...smelled a strange smell."
            ],
            "content":"<div class=\"\"><div> <span>Naruto scooted closer to the limp figure. While it looked strongly feminine from afar, he gasped he saw it was Sasuke. <br>\r\n<br>\r\n\"Sasuke!\" <br>\r\n<br>\r\nHe rushed closer, grabbing his shoulder and shaking as hard as he could. <br>\r\n<br>\r\n\"Wake up!\"<br>\r\n<br>\r\nSasuke's eyes fluttered open and he warily turned his head in Naruto's direction.<br>\r\n<br>\r\n\"Stop it, you idiot,\" he said slowly. He pushed Naruto's hand away before slowly pulling himself up into a sitting position.<br>\r\n<br>\r\n\"Where are we? What am I wearing?\"<br>\r\n<br>\r\n\"I don't know. Hey, do you remember anything weird?\"<br>\r\n<br>\r\nSasuke shook his head.<br>\r\n<br>\r\n\"I remember falling asleep, but that's it.\"<br>\r\n<br>\r\n\"It's weird. I just woke up too. I wonder where Sakura-Chan and Kakashi-sensei are?\"<br>\r\n<br>\r\nJust then, they stopped. They...</span></div></div>",
            "created":1371877200,
            "id":1615877,
            "title":"Sasuke"
        },
        "121122111":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>The sound was so low, yet it hummed. It was soft, like a blanket that wrapped around them. Their eyes grew blank, half lidded. The sound was so nice. It drove away all thought, all want or need. All that mattered was the sound.<br>\r\n<br>\r\n\"It's so pretty...\" Naruto said, his voice light and airy, as if he were in a dream.<br>\r\n<br>\r\n\"It feels nice,\" Sasuke said.<br>\r\n<br>\r\nA door slid open, a door they hadn't noticed before. Both boys silently wandered through it, their arms limp and their legs unsteady. The cooridors were silvery and shiny and all the same, but they didn't care. The sound was so wonderful...<br>\r\n<br>\r\nFinally, a door opened. Was the room occupied?</span></div></div>",
            "created":1371877200,
            "id":1615880,
            "title":"...heard a strange sound."
        },
        "1211221111":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Kakashi",
                "An alien"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was in the room?</span></div></span></div>",
            "created":1384491600,
            "id":1694791,
            "title":"Yes"
        },
        "12112211112":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>The room was dim and dark, and yet to Naruto and Sasuke, drunk off of the pleasant sound, it smelled sweet and heavenly. They walked in very quickly, their minds too dazed to know any better. <br>\r\n<br>\r\n<i>Come to me, my sweets...Come to your master...</i><br>\r\n<br>\r\nYes, that was right. <br>\r\n<br>\r\nNaruto and Sasuke stepped in closer to the middle of the room. They felt something slick slip up their gowns and fondle their genitals. <br>\r\n<br>\r\n<i>Good pets...Let me feel you...</i><br>\r\n<br>\r\nThey felt more of the slick <i>things</i> rub them, but it felt so nice.<br>\r\n<br>\r\n\"More...\" Sasuke whispered. It felt so good! He swayed slightly as he shivered with pleasure.<br>\r\n<br>\r\n\"Good...\" Naruto slurred. His hands went to lift up his shirt to better feel himself, but then the things-they felt like slimy snakes, stopped him.<br>\r\n<br>\r\n<i>Let me help you...</i><br>\r\n<br>\r\nThe rubbing increased. Sasuke moaned as his legs lost control and he fell back onto his back. He arched his back as he felt one of the things slide into his entrance, but it didn't hurt. He felt another slide past his lips. It tasted like the smell, sweet and good. He suckled slowly, savoring the taste.<br>\r\n<br>\r\nNaruto giggled as he too fell back. The floor felt so soft! And the rubbing only got better. He felt himself grow hard as more of the things rubbed his genitals and moved inside of him. Soon one was in his mouth too and he moaned at the wonderful taste. Sasuke's moans were getting to him too, though he really didn't remember him at all. All that mattered were the wonderful smells and feelings. <br>\r\n<br>\r\n<i>Good...now...</i><br>\r\n<br>\r\nSomething <i>popped</i> inside of their bodies and the rubbing increased. Sasuke groaned as he felt himself cum, and Naruto screamed. <br>\r\n<br>\r\nThey fell back, dead asleep.<br>\r\n<br>\r\nWhen they wake up, do they remember the night?</span></div></div>",
            "created":1384491600,
            "id":1694800,
            "title":"An alien"
        },
        "121122111121":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "...hungry",
                "...horny"
            ],
            "content":"<div class=\"\"><div> <span>Naruto awoke in a much different room than the one before. He was laying on a large, comfortable bed, big enough for two. Sasuke was still asleep to his left. They were both snuggled tight under their covers, their heads resting on the most comfortable pillows either had ever experienced. Naruto looked around the room; it was all white, with a white couch sitting in front of what looked like a very thin and very large TV. Off to the right was a small kitchen and dining area, and off to the left was a small door which he supposed would lead to a bathroom. <br>\r\n<br>\r\nNaruto smiled as he leaned back into a sleeping position. This wasn't so bad, really. The pleasure had been so intense and wonderful, and now here they were, in a beautiful room, laying in a warm bed. <br>\r\n<br>\r\n<i>Master treats us very well</i>, he thought. He didn't find the thought strange at all. It only seemed right. <br>\r\n<br>\r\nHe yawned as he felt Sasuke stir and awaken.<br>\r\n<br>\r\nNormally, he would have said something to antagonize Sasuke, especially with it so early in the morning. But not today. No, today he simply felt like laying in the comfortable bed...<br>\r\n<br>\r\nSuddenly, he heard a ringing. He began to feel very...</span></div></div>",
            "created":1384923600,
            "id":1696760,
            "title":"Pregnancy"
        },
        "1211221111211":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "...watch TV.",
                "...have sex."
            ],
            "content":"<div class=\"\"><div> <span>...hungry. He didn't really want to get up, but he felt so hungry. <br>\r\n<br>\r\n\"I feel funny,\" he heard Sasuke say beside him.<br>\r\n<br>\r\n\"I feel hungry,\" Naruto said.<br>\r\n<br>\r\nThey slid out of their warm covers. They were surprised that the tile floor was not cold, but warm and comfortable. Not that they thought anything of it as they walked to the fridge. <br>\r\n<br>\r\n\"What do you think is in the fridge?\" Sasuke asked, rubbing his belly through his white nightgown. <br>\r\n<br>\r\nNaruto shrugged as he opened the door. Inside where twenty or so small containers. Naruto did not hesitate to open one, nor did he turn away in disgust when he saw the thick, green liquid it contained. He quickly drank it.<br>\r\n<br>\r\n\"How does it taste?\" <br>\r\n<br>\r\n\"Good,\" he said. And it did. It tasted sweet, good, like Master.<br>\r\n<br>\r\nSasuke also drank one of the containers. It did taste good. <br>\r\n<br>\r\nAfter drinking five of the containers, they decided to...</span></div></div>",
            "created":1391922000,
            "id":1742814,
            "title":"Hungry"
        },
        "12112211112111":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "...giving birth.",
                "...being milked."
            ],
            "content":"<div class=\"\"><div> <span>TV sounded like a good idea. He didn't know if anything would be on, but TV sounded like a good idea. Sasuke made his way to the couch first. He curled up beside the arm-rest. Naruto did the same on the opposite side. The couch was so comfortable that Naruto didn't think of turning the TV on, though he was not surprised when the machine seemingly turned on on its own. <br>\r\n<br>\r\nThe constant humming that filled the room grew a little louder. <br>\r\n<br>\r\n\"M'head feels funny...\" Sasuke's voice sounded slurred and far-away. <br>\r\n<br>\r\nBut Naruto really didn't listen. The TV show was interesting. There was a woman, a very pretty woman, heavily pregnant and naked. She was lying on a big, white bed, rubbing her large, swelled belly. She was humming...<br>\r\n<br>\r\nBoth boys were unaware as they rubbed their full bellies, it was nice to rub their bellies where Master's babies were growing. <br>\r\n<br>\r\nThe scene changed. Master was rubbing the woman now. Master was rubbing her with his long tentrils, rubbing her swollen and wet pussy, her large belly and breasts. She was moaning, kissing the tendril that touched her lips. <br>\r\n<br>\r\nShe moaned again as she climaxed and the scene changed. Now it was a funny scene. The woman was...</span></div></div>",
            "created":1392008400,
            "id":1743656,
            "title":"...watch TV."
        },
        "121122111121111":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Naruto wakes up with only Sasuke",
                "There is another person in the room when they wake up."
            ],
            "content":"<div class=\"\"><div> <span>...giving birth. She was on her back, moaning meekly as she pushed. Master's tendrils were in her pussy, moving around and around, as if loosening whatever was inside her large belly. <br>\r\n<br>\r\n\"Master!\" she moaned as Master went deeper inside of her. <br>\r\n<br>\r\n\"Master...\" Sasuke slurred. His voice sounded funny, and it made Naruto laugh. His head felt so light now, and his hands felt so good even through the cloth of his shirt. He could feel the little bump just beginning to rise on his lower belly. <br>\r\n<br>\r\nFinally, Master began to draw his tendril away from the woman. Her breathing quickened, and her legs trembled. In his hazed mind, it seemed to Naruto that it took forever. <br>\r\n<br>\r\n\"Long...Master is so long,\" Naruto giggled. Sasuke giggled, along with him.Master was long.<br>\r\n<br>\r\nFinally, Master pulled out completely. Wrapped in his grasp was a wiggling little thing. It looked like a starfish, but it was a dark green, and had far many legs. In his hazed mind, Naruto couldn't count how many legs it had.<br>\r\n<br>\r\n\"It's her baby,\" Sasuke said. \"It's so cute...\"<br>\r\n<br>\r\n\"Yeah...\"<br>\r\n<br>\r\nThe video cut to black.<br>\r\n<br>\r\n\"Sasuke, is that what our babies look like?\"<br>\r\n<br>\r\n\"I think so. We're gonna get so big,\" he giggled. The he yawned, and snuggled deeper into the couch. Naruto yawned as well, and soon he too was fast asleep. </span></div></div>",
            "created":1423890000,
            "id":1933723,
            "title":"...giving birth."
        },
        "1211221111211112":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Sakura?",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1423890000,
            "id":1933859,
            "title":"There is another person in the room when they w..."
        },
        "12112211112111122":{
            "author_id":"gekigao",
            "author_name":"gaogeki78",
            "choices":[
                "Yep!",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Kiba abducted as well?</span></div></span></div>",
            "created":1494046800,
            "id":2315736,
            "title":"Kiba"
        },
        "121122111121112":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "They have been turned into girls",
                "They are both much farther along in their pregnancies"
            ],
            "content":"<div class=\"\"><div> <span>...being milked. Master was rubbing her breasts, hard. She was on her hands and knees as, moaning, as the milk was pumped out of her and into waiting buckets. The angle changed; now you could see Master rubbing her engourged pussy as another tendril pushed itself in and out of her. <br>\r\n<br>\r\n<i>Master is good to his mothers...</i><br>\r\n<br>\r\n\"Master is good...\" Naruto felt more than heard himself say.<br>\r\n<br>\r\n\"Hm, Master is good...\"<br>\r\n<br>\r\nThe humming grew louder.  Both boys found themselves humming along, their eyes cloudy as they watched the woman come again and again...<br>\r\n<br>\r\n<div align=\"center\">XXX</div><br>\r\n<br>\r\nNeither remember falling asleep, but it wasn't so surprising to wake up back in their bed. They had to rest, for Master and their babies...<br>\r\n<br>\r\nHas anything changed since they fell asleep?</span></div></div>",
            "created":1392181200,
            "id":1744766,
            "title":"...being milked."
        },
        "1211221111211121":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "They notice",
                "They don't notice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do they realize these changes? Or is it perfectly natural to them?</span></div></span></div>",
            "created":1423890000,
            "id":1933727,
            "title":"They have been turned into girls"
        },
        "1211221111211122":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "8 months",
                "4 months"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They awoke to a change, though it was not so unexpected. Their bodies had changed during the night. How far along did they look?</span></div></span></div>",
            "created":1423890000,
            "id":1933726,
            "title":"They are both much farther along in their pregn..."
        },
        "12112211112111221":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "The humming grew louder",
                "They went into labor "
            ],
            "content":"<div class=\"\"><div> <span>Their bellies were big and round. Naruto had never felt so heavy and slow, but it wasn't so bad. Beside him, Sasuke was already awake and lovingly rubbing his belly. <br>\r\n<br>\r\n\"We're so big,\" Naruto said. Under the humming in his head, he felt amazed at how big he was, how...he could feel them, moving...<br>\r\n<br>\r\n\"Can you feel them too?\" Sasuke asked. \"They're so active. Our babies are so active.\"<br>\r\n<br>\r\n\"My back hurts...\" Naruto said, but he supposed that was normal given how their bellies took up so much of their bodies. Naruto wasn't even sure they could leave their bed now. \"What if we need to get up?\"<br>\r\n<br>\r\n\"Oh, Naruto,\" Sasuke said, rolling his eyes a little at what he must have thought was a silly question. \"Master takes care of us. We don't need to do anything but wait here until we have our babies.\"<br>\r\n<br>\r\n\"And then what?\"<br>\r\n<br>\r\nSasuke shrugged. \"We can have more babies. We'll just keeping giving Master more babies. It'll be nice!\"<br>\r\n<br>\r\nSasuke's smile was serene and perfect, his eyes dim with the Master's happiness. Naruto wished she could feel like that, but something was bugging him, and it only grew as he felt a small pinch where one of their babies \"kicked\" him.<br>\r\n<br>\r\nSuddenly...</span></div></div>",
            "created":1481950800,
            "id":2251123,
            "title":"8 months"
        },
        "121122111121112211":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Master is alone",
                "Master is with someone"
            ],
            "content":"<div class=\"\"><div> <span>The humming, the constant humming, grew louder. It was hard to think. Sasuke even stopped rubbing his belly; they each stared ahead, awaiting for the humming to tell them what to do.<br>\r\n<br>\r\nIt wanted them to get up and go to Master, but could they stand? Without thinking they tried. It was difficult at first, their bellies so big and heavy, but Master didn't mind if they took their time. Master loved them.<br>\r\n<br>\r\nThe to Master's chamber was slow and long, but neither minded. Walking was funny, their bodies so different that they had to waddle. By the time they reached the door to Master's chamber, they were exhausted and tired, but that was fine. <br>\r\n<br>\r\nIs someone with Master?</span></div></div>",
            "created":1482555600,
            "id":2253965,
            "title":"The humming grew louder"
        },
        "1211221111211122111":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "Nope"
            ],
            "content":"<div class=\"\"><div> <span>Master was alone. Master's tentacles guided them into the room and to the floor by Master's bulk. They were happy to be off their feet and sitting with Master, against Master as he rubbed their large bellies. Naruto giggled, while Sasuke seemed too blissed out to do more than stare off. Life was lovely here, Naruto decided. Sasuke was right, they just needed to stay here and be breeders for Master.<br>\r\n<br>\r\nDoes he remember life in the village at all?</span></div></div>",
            "created":1489122000,
            "id":2287745,
            "title":"Master is alone"
        },
        "1211221111211122112":{
            "author_id":"kinghtofsprite",
            "author_name":"Knightofsprite",
            "choices":[
                "Guy?",
                "Girl?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it a guy or girl?</span></div></span></div>",
            "created":1484715600,
            "id":2265776,
            "title":"Master is with someone"
        },
        "1211222":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "The gas effects their Hormones and they get horny"
            ],
            "content":"<div class=\"\"><div> <span>\"You ok kid?\" the person in the other bed asked.<br>\r\n<br>\r\nWhatever these aliens had done to him had caused his skin to turn pure white, with black \"x\"-shaped mark scars on his arms that went from his forearms to just under his shoulders. His hair had turned purple-black and his eyes now had purple irises that glowed a faint blue against red sclera. At least that's what she had seen when they had brought him in.<br>\r\n<br>\r\nNow he wore something that had formed over his skin less than an hour ago: a skintight full-body jumpsuit that was primarily black and dark blue in color with skeletal features, along with dark orange Phazon energy markings, suggesting his suit had more organic components than hers. This all made him look quite menacing. Yet it also had clawed fingers and small hooks or claws on the forearms, curved scallop blades reminiscent of Metroid 'teeth' or the hooks on the arms of the Chozo; it also had three small purple spheres on the middle of the upper back where his shoulder were that were similar to a Metroid's internal nuclei.<br>\r\n<br>\r\nAll in all, Samus found it looked like a cross between her Zero Suit, Fusion Suit, and that Phazon-generated clone of her's, Dark Samus.<br>\r\n<br>\r\nLikewise, the boy seemed to study her. <br>\r\n<br>\r\nShe was a fair-skinned woman had blond hair that was up in a short ponytail, with two front bangs reaching her shoulders and fraiming her face. Her eyes were blue-green and she wore a skintight full-body jumpsuit made out of material that looked to be some sort of firm polymer, or latex, something that allowed her to stretch in different positions, but still hold together. Her outfit didn't have any zippers or belts on it, making how she got into and out of it a mystery, it had a few symbols on it that were all light pink outlined with darker pink that was almost red. Four rectangular lights exist on the back, surrounding a middle circular one. Next, a symbol was on the back of her left hand, and a symbol on her left breast. The one on her hand resembled a circle with two points protruding from the top and bottom, four rectangular lines circling it, and a zig-zag pattern on the circle. The breast sigil featureed a triangle pointing diagonally right down, with lines running be<br>\r\nlow it, and another triangle pointing to the left. She had an empty holster on her thigh, clearly her weapon, if she'd had one, had been taken from her. <br>\r\n<br>\r\nThe aliens seemed to notice the two were awake and began jabbering in their native language. They sounded excited from the way they were yammering. <br>\r\n<br>\r\nNaruto tried to sit upright, but was forced back down by one of the aliens. He could make out his captor, and he was surprised, shocked, and scared, for it was nothing he had ever seen before.<br>\r\n<br>\r\nThe creepy monster before him - one that he found strangely attractive, was somewhat humanoid in stature. It's skin was silver, like its surroundings, and it stood at over seven feet in height. It was definitely feminine in shape. Naruto tried to avert his gaze from the eight massive breasts on it's - no, her - chest, each of which put even Tsunade's bust to shame. The alien seemingly laughed, a strange yet somewhat pleasing sound. Looking at the rest of the extraterrestrials, Naruto noted they were ALL female.<br>\r\n<br>\r\nThe one holding him down then grabbed him and brought him over to the woman and slammed him onto the bed next to her, grabbing his face and turning it to look at her, before resuming speaking.<br>\r\n<br>\r\nNaruto tried to froce the alien off of him, but needless to say, it was at least a hundred times stronger than Tsunade was. \"I can't understand what you're saying!\" he snapped.<br>\r\n<br>\r\nSamus narrowed her eyes, while she was likewise unable to understand the aliens that had abducted her and the young man, apparently, the survey team had recorded the native language - or languages - of the male's homeworld, because her translator implant allowed her to understand him. That was something, at least.<br>\r\n<br>\r\nThe alien woman seemed to stop at his words, if she didn't understand them, then she understood the meaning. Letting him go, the aliens left through a door they hadn't noticed before and it slammed shut after the female aliens left. Trapping the two in the room.<br>\r\n<br>\r\nSamus looked around, No windows, and the door control was most likely on the other side of it, or the technology responded to mental commands from the native race. She turned to her cellmate. <br>\r\n<br>\r\n\"Samus Aran.\" she said, then resumed looking around for a way out.<br>\r\n<br>\r\nNaruto was confused for a second and he then realized that what she said was actually her name<br>\r\n<br>\r\n\"I'm Naruto Uzumaki\" he answered her introduction in kind. <br>\r\n<br>\r\nSamus' musings were interrupted, as Naruto tapped her shoulder. \"Hey, are you a ninja?\"<br>\r\n<br>\r\nSamus raised an eyebrow. \"A what? I haven't the slightest idea what you're talking about.\"<br>\r\n<br>\r\nNaruto frowned. \"Lady, you been living under a rock or something? Everyone knows about ninja...\"<br>\r\n<br>\r\nSamus shrugged. \"There are no ninja where I come from - There are warriors, certainly, and hunters. I'm a hunter.\"<br>\r\n<br>\r\nNaruto raised an eyebrow. \"A hunter? What do you mean?\"<br>\r\n<br>\r\n\"I'm a bounty hunter. People post bounties, usually for criminals, and I find them, for a price. Some hunters will go after anyone if the price is right, but I only track crooks.\"<br>\r\n<br>\r\nNaruto nodded. \"So...what do you think these aliens want with us?\" he asked.<br>\r\n<br>\r\nSamus shrugged \"No idea.\"<br>\r\n<br>\r\nNaruto looked himself over and was, needless to say, shocked. \"Wha...?\"<br>\r\n<br>\r\n\"I can hazard a few guesses as to why you're like that, but we need to get out of here first.\" Samus said offhandedly.<br>\r\n<br>\r\nNaruto nodded at that. \"Just so long as there's no probing.\" he muttered. Samus nodded. She had never encountered this race before. So she had no idea what they wanted the two for.<br>\r\n<br>\r\nNaruto nodded. Then froze. \"Gas!\" he shouted.<br>\r\n<br>\r\nSamus froze at that and sure enough, she heard a faint hissing sound and looked up to see what looked like the utters of a cow hanging from the ceilling releasing a steady stream of pink vapor into the room. She couldn't afford to be impressed that this Naruto kid obviously had training to do things like enhance his senses, meaning that whatever he was, a 'ninja' as he called the word, he was soldier. The gas took up too much of her concern for that.<br>\r\n<br>\r\nNaruto took a deep breath and held his nose shut before Samus did the same. The room quickly filled up compleatly and the pair's hungs started to hurt. They gasped as they could no longer hold their breath and  instinctively tried to refill their lungs, taking in the gas.<br>\r\n<br>\r\n\"Huh?\" Samus said, blinking in surprise \"It's not toxic?\" If anything, it smelled like thick perfume.<br>\r\n<br>\r\nNaruto scrunched up his nose \"Dosen't make sense...are we supposed to be labrats or something?\" he said.<br>\r\n<br>\r\nSamus shrugged and they looked at one another.<br>\r\n<br>\r\nTHAT was a mistake because...</span></div></div>",
            "created":1380776400,
            "id":1673785,
            "title":"The Shinobi and the bounty hunter"
        },
        "12112221":{
            "choices":[
                "ignores it and continues to undress her",
                " grabs it and finds out that its a large phallus withlemonsized balls"
            ],
            "content":"<div class=\"\"><div> <span>as they look at each other they can't help but get horny as the gas has made them so they start kissing each other while Naruto starts undressing samuswhen he sees something on samus that in't normally on a female he notices the bulging shape and?</span></div></div>",
            "created":1473138000,
            "id":2206824,
            "title":"The gas effects their Hormones and they get horny"
        },
        "12113":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Naruto comes from aliens?!",
                "another idea"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>perhaps they reveal to him that the reason the Uzumaki jinchuriki can survive longer without their biju is because the Uzumaki clan is actually an ancient race of aliens.</span></div></span></div>",
            "created":1411275600,
            "id":1859762,
            "title":"Something else?"
        },
        "121132":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Naruto, alien sex slave",
                "another idea"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>perhaps the race is a very perverted race of aliens from a planet with nothing but females, and they travel the galaxy finding men to use as toys, and Naruto's their next target</span></div></span></div>",
            "created":1411275600,
            "id":1859765,
            "title":"another idea"
        },
        "1211322":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "Yes Alien Slavers ",
                "no something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> A group of Aliens have decided to brainwash and enslave humanity into their loyal pets, and breeders. Naruto is their first victim. </span></div></span></div>",
            "created":1455166800,
            "id":2102807,
            "title":"Alien Slavers"
        },
        "12113221":{
            "author_id":"nooks",
            "author_name":"Nooks",
            "choices":[
                "Naruto finds himself strapped to an operating table, naked",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Naruto was practicing his Shadow Clone jutsu outside the walls of the Leaf Village. Team Seven had just returned from their mission in Wave Country and Naruto wanted to become stronger so he could protect his team and the people he cared about, and eventually become Hokage. Unknown to Naruto something was watching him. After several hours of practice Naruto decided to head home for the night. As he turned around though there was a blinding light and everything went white.</span></div></div>",
            "created":1455166800,
            "id":2103021,
            "title":"Yes Alien Slavers "
        },
        "121132211":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Just bright lights above...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does he see.</span></div></span></div>",
            "created":1508302800,
            "id":2403291,
            "title":"Naruto finds himself strapped to a table."
        },
        "121132212":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "A cage",
                "An auction block",
                "A cargo hold",
                "The dungeon of an arena ",
                "A research laboratory "
            ],
            "content":"<div class=\"\"><div> <span>Naruto groaned as he awoke, rubbing his head.<br>\r\n<br>\r\nWhat had that been?<br>\r\n<br>\r\nAs he started to try and get his bearings back, two creatures walked by. They looked like hairless, yellowish-green-skinned humanoids with short, wiry limbs and green blood. Their heads were disproportionately large, with round, heavy-lidded, solid black eyeballs with no discernible iris or pupil; a thin, toothless mouth with green tongue, and two pairs of small holes where ears and nostrils would be. They lacked opposable thumbs, each hand having three long, tentacle-like fingers with large suction cups at each fingertip that allow them to manipulate objects.<br>\r\n<br>\r\nSeeing him starting to awaken, the creatures looked at one another and chattered to one another in a language that he didn't understand. Then looked at him critically.<br>\r\n<br>\r\nAs they did, Naruto finally realized something.<br>\r\n<br>\r\n\"What the....?! Hey! Where am I?!\" He demanded, seeing he was in...</span></div></div>",
            "created":1602174300,
            "id":2917540,
            "title":"Abduction"
        },
        "12113222":{
            "author_id":"deathokami",
            "author_name":"DeathOkami",
            "choices":[
                "xenomorphic anthro queen",
                "bee anthro queen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The turn naruto into there xenomorphic anthro queen or there bee alien queen</span></div></span></div>",
            "created":1473224400,
            "id":2207211,
            "title":"a new queen"
        },
        "1213":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Neji",
                "Gaara",
                "Shikamaru?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other guys?</span></div></span></div>",
            "created":1403326800,
            "id":1815550,
            "title":"Other!"
        },
        "122":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Sakura?",
                "Hinata?",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Girl?</span></div></span></div>",
            "created":1366866000,
            "id":1578456,
            "title":"A Pretty Girl!"
        },
        "1221":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "\"Begin the insemination!\"",
                "\"Begin the brain drain!\"",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sakura awoke to a bright, blinding light that slowly receded to a more comfortable glare. She groaned as she tried to fall back to sleep, but couldn't. She tried to move her hands and knees, but found they were held down. She heard a voice:</span></div></span></div>",
            "created":1371963600,
            "id":1616384,
            "title":"Sakura?"
        },
        "12211":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "She wakes up in her room",
                "She wakes up in a hospital room"
            ],
            "content":"<div class=\"\"><div> <span><i>What..?</i><br>\r\n<br>\r\nHer thoughts felt so slow, everything felt so slow. Suddenly, her legs felt as if they were being spread. Cold air hit her, but she couldn't think. She just wanted to go back to sleep. Suddenly, she felt something warm and wet...she felt warm and wet. She moaned as she felt something warm touch her and slide something into her. It began to vibrate, sending low, constant vibrations through her body. It felt good, so good...<br>\r\n<br>\r\nA strange feeling spread through her body, a deep pressure in her body. It felt warm and hard, like a deep pressure. She tried to move, to squirm just a little bit, but the little bit of movement tired her out.<br>\r\n<br>\r\n\"OOOhhhhh...\"<br>\r\n<br>\r\n\"Begin Phase Two.\"<br>\r\n<br>\r\nThe vibrations increased, sending shockwaves through her body. She gasped as she felt the pressure increase, and increase-<br>\r\n<br>\r\nThere! Oh! Right there! <br>\r\n<br>\r\nMore warmth flooded her body, sending shivers down her spine. She felt some of it drip down her thigh, which felt so good...<br>\r\n<br>\r\nLazily, she felt herself fall back to sleep...<br>\r\n<br>\r\n\"Insemination complete!\"</span></div></div>",
            "created":1403326800,
            "id":1815566,
            "title":"\"Begin the insemination!\""
        },
        "122111":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Changes...",
                "Changes over time."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She wakes in her room back home, thinking is was an amazing dream. Are there any changes she notices, or do they happen over time?</span></div></span></div>",
            "created":1508302800,
            "id":2403279,
            "title":"She wakes up in her room"
        },
        "12212":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Sakura falls asleep",
                "Sakura hears another voice"
            ],
            "content":"<div class=\"\"><div> <span>She tried to struggle as she felt something be secured over her head. It was not uncomfortable. It felt padded and warm, like a nice hat. However, it seemed to get warmer...and warmer...<br>\r\n<br>\r\nShe screamed. A painful burning in her skull...she felt confused and weak and she wanted it to stop-!<br>\r\n<br>\r\nBut then the pain webbed away...the warm felt nice, cozy...<br>\r\n</span></div></div>",
            "created":1392267600,
            "id":1744939,
            "title":"Silly Bimbo"
        },
        "122121":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Horny?",
                "Blank?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When she wakes up, how does she feel?</span></div></span></div>",
            "created":1403326800,
            "id":1815557,
            "title":"Sakura falls asleep"
        },
        "1221212":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she remember who she is?</span></div></span></div>",
            "created":1423890000,
            "id":1933861,
            "title":"Blank?"
        },
        "12212121":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "To be a slave",
                "To be a mother"
            ],
            "content":"<div class=\"\"><div> <span>She awoke to a white room. The walls were white, the floor was white, the clothes she wore were white, the bed was white. White.<br>\r\n<br>\r\nSakura supposed she she have felt scared, or angry, but she didn't. She felt nothing. She did not even feel numb, she decided. She felt nothing. She did not even feel like getting up from the bed. <br>\r\n<br>\r\nA ring, like a bell. She sat up, and walked to an outline on the wall farthest from her bed. It slid open to a long hall. <br>\r\n<br>\r\nAnother ring, like a bell. She walked along the hall, pasts other outlines on walls. She turned left down, then right, then left again. <br>\r\n<br>\r\nRing.<br>\r\n<br>\r\nShe stopped outside of an outline, which slid open like the one in her room did. Inside the room was a chair. It was white, like the walls and everything else.<br>\r\n<br>\r\nRing.<br>\r\n<br>\r\nShe sat in the chair. <br>\r\n<br>\r\nRing.<br>\r\n<br>\r\nShe faced a television. She did not know where it had come from, but she did not have the curiosity to think of where it had come from. <br>\r\n<br>\r\nRing.<br>\r\n<br>\r\nOn the television's screen were words. They came and left so fast she couldn't read them. And then the ringing, only this time it was constant and did not stop, though she felt nothing for it. <br>\r\n<br>\r\nSakura did not know how long she sat there, but she did find it funny. Suddenly, the words began to make sense. <br>\r\n<br>\r\nWhat do they tell her?</span></div></div>",
            "created":1423890000,
            "id":1933867,
            "title":"Yes"
        },
        "122121211":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Send her back...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her job is to serve her alien captors and then be transported back like nothing happened and transmit the dna her captors have infused her with after her brain drain to help their species grow on here but first giving them more slaves and breeders.</span></div></span></div>",
            "created":1508302800,
            "id":2403280,
            "title":"To be a slave"
        },
        "1222":{
            "author_id":"vilecreatin",
            "author_name":"FireDragon14",
            "choices":[
                "She tries to struggle free but, it fails.",
                "The second voice gently tells her it's time to stop fainting sleep.",
                "She opens her eyes to see the changes have already been made to her."
            ],
            "content":"<div class=\"\"><div> <span>As Hinata returned to consciousness she immediately knew that something was wrong. Her training took over instinctively as she forced herself to calm her breathing and keep her eyes closed. Despite how groggy and confused she felt, Hinata quickly started assessing her situation. She subtly tried to move her arms and legs so as not to let anyone know that she was waking. She felt a jolt of fear however as she found her limbs where shackled down by metal restraints. Pushing past the fear and the grogginess, Hinata forced her hearing to its max in order to find any indication of where she was. What she heard surprised her.<br>\r\n<br>\r\n\"You sure this is the best option?\" She heard a voice not to far off ask. It was a strange sounding voice. It held a clear tone of femininity to it but, it just sounded... wrong. Whoever was speaking was clearly not use to the language if the odd accent was anything to go by. \"I know that our species is dying but, must we real sink to such lows to insure some form of survival?\" Hinata wondered what this person meant by their species dieing. Last she remembered the human race was doing just fine.<br>\r\n<br>\r\n\"We have been over this countless times my friend.\" said another voice that held a slightly different quality to its voice yet, still sounded very much like a female. \"There are no fertile males left of our species and despite our best efforts no child born from a female coupling has lived long enough to reach proper breeding age.\" Though confused Hinata couldn't help but feel rather sad for whoever these people where. For all she knew, this was the last remnant of some old clan that was dying out. That still didn't explain why she was here, or what they planned to do with her.<br>\r\n<br>\r\n\"I understand that but, why these creatures? Why theses... 'Humans'? I know that they look very similar to use but, we've already tried breeding with them. You saw it yourself that we can not interbreed.\" Now Hinata was very curious. These people spoke like they weren't human. That also made her feel rather scared as well. \"It is true that we can't interbreed naturally but, that isn't because we are compatible. Neither body can support the growth simply due to a lack of proper understanding of the genetic differences. We have seen however that we can merge some of our genes to their bodies, creating an artificial hybrid. This hybrid could then produce children with both us and the humans.\" Hinata was stunned by that. She clearly understood what they wanted with her now. They planned to turn her into some kind of Hybrid without even asking for her consent.<br>\r\n<br>\r\n\"But why this one? We had plenty of others we could have used. And what about that male we have been observing? The one with the hair of this systems star and eyes like the liquid that covers much of this world. The one from the very place we took this one from. Wouldn't a male hybrid have been better choice? They could have simply impregnated us and been done with it.\" Hinata felt anger and fear blossom in her breasts. She knew of only one boy in Konoha with sun-kissed hair and clear ocean blue eyes. \"We have no fertile males to use as gene donors, so we will need to hope the process for converting a male into a hybrid that we plan to encode into her genes works right. As for why this one, she holds the best chance of accepting our genes successfully... And she appears to hold feelings for the very male you are speaking of.\" The owner of the first voice seemed to consider this before speaking again. \"You plan for her to seek that male out as her other don't you? You plan for her to take him inside herself and change him into the first male hybrid before using him to produce many children.\" The last part wasn't a question but, a statement. And it was one that chilled Hinata to the bone.<br>\r\n<br>\r\n\"The girl will take a long time before she can birth her children but, yes. I fully expect her and the male to become the progenitors of a new race. A race that will have the qualities of both our own and these humans.\" Answered the second voice. \"It's only a shame that we couldn't figure out some way to fix the genistation period. How a creature can carry child for so long is beyond me and these changes will sadly only increase the time till birth comes.\" \"How long?\" Asked the first. \"Normal humans carry for nearly 9 of their 'months?' Anyway, the time will likely increase to anywhere from one of their planets star journeys to up to three of them. The fact that unlike her children, this one will have three birthing caverns; one of which will be occupied for a time as she makes the changes to her chosen mate and that alone could take up to a half of their planets star journey. We can only hope that she will not be miserable while carrying other lives inside her for so long.\" Hinata heard as the sound of the voice grew closer and closer as it spoke.<br>\r\n<br>\r\nHinata tried her hardest to not respond as she felt something brush against her cheek in an almost loving manner. \"These 'Humans' are so odd yet, so beautiful in their own way. And this one is a perfect example of the beauty the female half hold. It is a shame that we can't properly breed naturally for I would have gladly taken this one as my bond mate if we could. And if she had brought the male one back with her it would have given a chance for a big family to form.\" Hinata heard the longing and sadness in the odd voice but, made sure to not response despite the gentle touches that stroked her skin in such a loving and fond manner. \"How you could have fallen for being not even of your species is beyond me. I admit that this one is pleasant on the eyes, even if she is rather small by our standards in the feeding glands. However the curves are more pronounced and would bet that they offer as good handles during intercourse and wouldn't have been against having some fun with her.\" Hinata felt slightly sickened by the first voices comment, not to mention annoyed at being told she had small breasts if that is what they meant by feeding glands. She was after all quite a bit larger then even the older girls. She was soon brought out of her thoughts by more of those gentle touches from the second voices owner and tried to keep from shivering at how pleasant the touches were. \"Yes, I can see that. Now please put your pleasure shaft away. We don't need it hitting something it shouldn't.\" Chided the second voice. \"Don't be so uptight. You seriously need a good fuck to relieve yourself and mine is already out and waiting for use.\" Hinata felt more then heard the second move away and could swear she heard a soft 'my quarters later' whispered to the first. Hinata could only think that she needed to get out of here before they changed who she was.</span></div></div>",
            "created":1391403600,
            "id":1738170,
            "title":"Hinata, Captured by Kinky Aliens!"
        },
        "12223":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "...beautiful.",
                "...hideous."
            ],
            "content":"<div class=\"\"><div> <span>She couldn't help herself.<br>\r\n<br>\r\nShe was naked, but she had known she would be. She was naked and was lying flat on her back. In front of her were two huge breasts. She couldn't see her feet or anything else below them for that matter. <br>\r\n<br>\r\n\"M-M-My-!\"<br>\r\n<br>\r\n\"Oh, you're awake,\" there was that gentle voice again. Hinata turned her head a bit too fast and made herself dizzy, but she felt faint when she saw her captor. She was...</span></div></div>",
            "created":1391922000,
            "id":1742985,
            "title":"She opens her eyes to see the changes have alre..."
        },
        "122231":{
            "author_id":"vilecreatin",
            "author_name":"FireDragon14",
            "choices":[
                "Hinata awakens back in the village and looks for Naruto.",
                "Continue watching the aliens as they observe Hinata."
            ],
            "content":"<div class=\"\"><div> <span>Hinata couldn't help but, gasp at seeing such a beautiful creature. From their own remarks they did indeed look strikingly a human. There where however, enough differences for a person to realize that they where anything but. Letting her eyes travel up and down the being before her, she took note of its long and strong legs, which were not overly muscled and held gentle curves to them. The legs lead to a set of amazingly wide hips that looked as though they'd be perfect for bearing offspring. It's waist was thin but, clearly muscled and the chest it had clearly out did her own without looking out of proportion to the rest of its body. Deceptively thin arms lead to hands with amazingly only three fingers. Each finger was larger, then Hinata's own, allowing the creature full use of its hands much like a humans would. On its neck was an intricate yet somehow, simple looking set of tattoos that spread out over its neck in a manner reminiscent to a flower and it's vines. The face however is what really surprised her. All in all, it looked like a normal human face with lightly tanned skin and soft curves of the cheeks, full kissable lips, a small nose and two eyes and a head full of shoulder length black hair that reminded her greatly of her own teachers hairstyle. The pointy ears would where even miss due to Hinata's fascination with its eyes that seemed to glow a memorizing silver. It wore loose cloth and long flowing fabrics that reminded Hinata of the dancing gypsies see had meet once on her way back home.<br>\r\n<br>\r\n\"Hello dear. How do you feel?\" It asked in the same voice as the one that had been lovingly creasing her skin earlier. Finally seeing the creature and hearing its voice at the same time caused something to stir inside of her. A desire, or even a need to feel this creatures body against her own and a need for physical pleasure. Hinata if course blushed so much she wouldn't be surprised if her whole body was flushed. She tried to push out the desire she felt and answer but, only succeeded in sputtering stupidly as she continued to practically eye hump this creature. \"Don't worry child. The lust you feel is due to your new hormones balancing out as we finish the last change. Before that though, please take a look at this picture.\" An image suddenly sprang to life in front of her eyes and what it should made her moan in want and lust. An image of her beloved Naruto was before her and she wanted nothing more then to rip off his clothes and ride him till his hips snapped. There was another feeling though. This one confused her to no end. She wanted Naruto inside of her but, not in the sexual way. No, she wanted him completely inside of her body. She could feel her love juices leaking out of her at an amazing rate as she thought on this.<br>\r\n<br>\r\n\"Subject is responding positively in all areas! Her body is producing high levels of the human sexual stimulating hormone and the encoding seems to be working fine.\" She heard, snapping Hinata from her thoughts at the sound of that first voice. \"And what of the birthing chambers?\" Asked the creature of beauty standing near her. \"Her primary chamber appears to be producing the enzymes need to create the change in the male once she traps him inside it for a time. Amazingly, the other two seem to be doing the same but, not quite on the same level. She could effectively convert three humans into hybrids allowing a much greater chance of a population boom... Pending she captures and changes another bonded pair that is.\" \"Perfect! This is beyond expectations.\"<br>\r\n<br>\r\nThe beautiful creature, that now thinking on it looked a lot like the elves from the old stories her mother use to read her, turned back to her and started caressing her cheek with its hand. It was so soft and left a wonderful tingling in her body. \"Now child. I know this all very hard to take in but, I need you to listen closely. I'm sure you've notice that your body has undergone some physical changes.\" She accented that statement by fondling one of her newly enlarged and apparently sensitive breasts. \"Not much has change of your outward physical appearance. Only the increase to your feeding glands and the widening of your... 'Hips' I think you call them. This is done so you will have the room needed to bare lots of young and so you can take your chosen mate into yourself so your body can make the necessary changes to him. Such changes will that time of course but, that is to be expected. Your body is much stronger now then ever before and any wounds you take will heal amazingly quickly. Not only that but, your stamina has been greatly increased from the change, though that is for something other then fighting.\" The being paused  for a moment to make sure Hinata was listening. \"Now the first thing I want you to do when you wake back up is to find your chosen and claim him. Then stay safe as you wait for you body to slowly make the changes to him. Next, once he exits you, you are to start producing young as quickly and numerously as possibly with him.\" Hinata suddenly found herself feeling very sleepy. \"Remain safe child. And raise the new species well.\"</span></div></div>",
            "created":1392008400,
            "id":1743087,
            "title":"Beautiful alien woman."
        },
        "1222312":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "\"...carrying capacity.\"",
                "\"...milk production.\""
            ],
            "content":"<div class=\"\"><div> <span>The female caressed the girl's cheek as her eyes closed and her breathing evened out. <br>\r\n<br>\r\nYes, this girl will be a perfect mother, she thought as she tested the girl's soft feeding gland. <br>\r\n<br>\r\n\"When will send her out?\" her companion asked.<br>\r\n<br>\r\n\"After she's rested. How is the other one doing?\"<br>\r\n<br>\r\nShe turned to look at the girl in the bed beside Hinata's. Sakura, as she knew her from her files, was not quite as advanced as Hinata. Her breasts and hips just weren't as big, and she was not as likely as to be able do a full conversion to her intended. The girl was sleeping peacefully as they pumped more of the hormone into her through a tube that went up to her womb. <br>\r\n<br>\r\n\"Her hormones are not yet stabilized. I think we may need to run a few tests to check her...\"</span></div></div>",
            "created":1392181200,
            "id":1744770,
            "title":"Sakura the Breeding Machine"
        },
        "12223122":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Large amount of milk surprising the aliens that she soon starts to pass Hinata",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A milking comes from the roof to check her milk capacity.</span></div></span></div>",
            "created":1508302800,
            "id":2403286,
            "title":"Milking Machine"
        },
        "1223":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Ino?",
                "Tenten?",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other lovely lady?</span></div></span></div>",
            "created":1366866000,
            "id":1578459,
            "title":"Other?"
        },
        "12233":{
            "author_id":"tobi02",
            "author_name":"no one",
            "choices":[
                "Anko",
                "Konan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who, then?</span></div></span></div>",
            "created":1451192400,
            "id":2079841,
            "title":"Other?"
        },
        "122332":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Stick with Konan",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But there are still more options.</span></div></span></div>",
            "created":1507957200,
            "id":2401026,
            "title":"Konan?"
        },
        "1223322":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Tayuya",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Tayuya</span></div></span></div>",
            "created":1507957200,
            "id":2401027,
            "title":"someone else"
        },
        "12233222":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Tsunade Senju...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tsunade Senju is abducted.</span></div></span></div>",
            "created":1508302800,
            "id":2403288,
            "title":"Tsunade Senju"
        },
        "122332221":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "There’s an enormous machine drifting into view, needles glinting in the light.",
                "A very different looking orb replaces the reddish one, filling her gaze.",
                "*Cosmic reset: alternate version of this scenario.*"
            ],
            "content":"<div class=\"\"><div> <span>Tsunade drifted through the shadowy limbo between the light of consciousness and the darkness of unconsciousness. Fragments of images, feelings, and sensations flit through the murky edges of her mind. Slowly, the kunoichi managed to piece together a portion of what had befallen her to put her in this situation. She remembered being alone in bed late at night. Something had awoken her. She tried to remember what it was, but could only come up with a deep droning noise that she had felt more than heard and a blinding light before her room had vanished around her and everything had gone dark.<br>\r\n<br>\r\nDimly, she became aware of a nagging pain in her extremities. Forcing the sensation aside to try and concentrate on the situation proved fruitless. The ache soon spread up her arms and legs and into her torso. Soon enough, the feeling dragged her up into the light and she awoke. The pain was even worse now, a constant torment that made her want to retreat back to unconsciousness to get away from it. But the peace would not come. Steeling herself, she tried to gain some information about what was happening in the hopes of improving the situation.<br>\r\n<br>\r\nA dim reddish orb floated above her, where she laid prone. Everything beyond the scope of the light spilling from the orb was lost in shadows, but she could tell that there were things hidden in the darkness even if she couldn’t tell what was out there. Fighting against the pain, she tried to rise, but found that she couldn’t. Craning her head, she managed to make out small circular bonds extending out of the table she was apparently lying on. Gritting her teeth, she tried her best to tear through the small amount of crystalline material, but was surprised that even her considerable strength had no effect on what was holding her down. Judging from how she couldn’t move her legs either, she assumed that her ankles were likely similarly held.<br>\r\n<br>\r\nThe orb above suddenly flared brighter for a moment, and she cried out in pain as a sharp spike of agony drove between her eyes. Then the spike seemed to shatter within her head sending flaming shards into every corner of her mind. The shock almost made her slip back into oblivion, but something fought against it and dragged her back up out of the blissful darkness.<br>\r\n<br>\r\nIt was several moments before Tsunade realized that the pain had stopped, not only the one in her head, but also the one that had filled the rest of her body. Above her, the orb had dimmed again, releasing so little light that she could barely even see her bust as it rose and feel with her breath. She could somewhat make out the sheen of sweat that had broken out there as well as across most of her body as the movement caught what little light there was. She lay there, letting her eyes drift shut and savoring the peace that spread throughout her body.<br>\r\n<br>\r\nChittering noises made her snap her head to the side to try and see where it came from. There, barely visible in the darkness, she could see a shape moving slightly. A vague shape beside it moved then, adding another set of chittering almost as if in conversation. Several more back and forth noises came from the two shapes. One of the shapes then seemed to turn around but she couldn’t be sure. A loud clanking noise above her made her tear her gaze away from what laid beside her to what was moving around above her.</span></div></div>",
            "created":1544418000,
            "id":2587745,
            "title":"Tsunade trapped"
        },
        "1223322211":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "She finds herself in a forest, but unlike any that she has seen before.",
                "She’s still in that dark room but is no longer restrained.",
                "She’s back home in bed almost as if nothing had even happened."
            ],
            "content":"<div class=\"\"><div> <span>In the light of the orb still hanging above her, she saw a roughly angular shape in the center with many arms radiating out and connected to other arms. Scattered along the length were quite a few half foot long needles. The one right in the center was different though, almost twice as long and looking thicker than the others. Again, the blonde haired kunoichi tried to break free, but it was futile. Another string of chittering come the direction of those two shapes. She didn’t look over though, too intent on the machine hovering above her ominously. Some small part of her mind noted that the arms and needles weren't even connected to each other or the center part. Instead they were all free floating without anything visible between them.<br>\r\n<br>\r\nA deep thrumming noise similar – but not quite the same – to what she remembered from before started up. Along with the noise, so did a pulsing violet glow within the center device. The arms shifted around. She saw with mounting fright that they were aligning the needles with points along her body. As quick as could be, needles started dropping from their positions. As they hit, they pierced her body in many spots. Around each location, a blazing heat started to build within her muscles and bones. It felt like fire was being driven right into her veins, flowing outward from the injection points. It took much of her willpower to resist screaming as the pain streamed through her body. It became too much when the largest needle finally plunged into her, straight into her heart. She started to scream but it cut off. She finally received the release she had been wanting and passed out completely.<br>\r\n<br>\r\nShe had no idea how much time passed, but when she awoke again, the pain was gone. In its place, she had an unclear sense that her body felt…<i>different</i>. It was the only way she could describe it, she wasn't able to place how though. Her throat felt rough and parched. She found herself coughing for several seconds. When the fit passed, she opened her eyes and took in her surroundings.</span></div></div>",
            "created":1544590800,
            "id":2588558,
            "title":"Being penetrated"
        },
        "12233222111":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Her stomach lets out a grumble, she’s ravenously hungry.",
                "A strange sensation spreads throughout her body.",
                "The snap of a branch comes from the other side of the water."
            ],
            "content":"<div class=\"\"><div> <span>Sunlight filtered through the leaves above. A great tree trunk rose behind her high into the sky supporting the leafy canopy. Glancing around, Tsunade saw numerous other trees looking much the same, as well as other more slender trees. Looking back up at the leaves, she now saw that something wasn’t right here. Purple leaves with black veins waved in the wind, while over there was a tree with blue leaves. The grass beneath and around her was off colored as well. Purples and blues splattered along the length of the waist high blades. Sitting up, she saw that all the plants around her were unlike anything she had ever seen before.<br>\r\n<br>\r\nWith some caution, she rose to her feet, unsure of what had been done to her. She paused when she saw she wasn’t wearing her usual sleeping outfit any longer. In its place was a skintight outfit that ran from her shoulders down to her knees, as well as leaving her forearms exposed. The material was odd as well, nowhere near anything she knew of. She also noted that most of the material was transparent, only a few patches weren’t to preserve a minimum of modesty.<br>\r\n<br>\r\nChecking her exposed limbs, as well as peeling back the outfit, she saw no sign of where the needles had driven into her. Her fair skin was completely unmarked. She was puzzled by this because there was no sign of anything being done to heal the wounds that she should have received. It was just another in a long list of oddities she had encountered since this all started…whenever that was.<br>\r\n<br>\r\nLooking around again, she called out for anyone but received no answer at all. Behind the tree she had been lying beneath, she saw some water. Setting off towards it, she had the sense that she was being watched, but could find no sign of whomever or whatever was observing her. She kept her senses trained in the hopes of spotting an ambush just in case.<br>\r\n<br>\r\nThe odd grasses grew right up to the edge of the water. This almost completely hid the muddy shore that lay beneath. Stepping carefully, she managed to get close enough to get a good view without losing her footing. Nothing seemed off about the water, but considering everything else around her… She shook her head, despite the risk, she was obviously thirsty and getting dehydrated wouldn’t do her any good. She just hoped that if there was anything wrong with the water that she could counteract it.<br>\r\n<br>\r\nAfter a tentative sip to test it, she gulped down several handfuls of water before her throat was finally soothed enough. Stepping back from the water, she cast another glance around the strange environment, wondering what she had been brought here for.</span></div></div>",
            "created":1544678820,
            "id":2588581,
            "title":"Lost in the woods"
        },
        "122332221111":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Another hungry rumble sends her looking for more food.",
                "Rather than drifting off, she wanders back to the water to clean up.",
                "She falls asleep, unaware of what is happening to her."
            ],
            "content":"<div class=\"\"><div> <span>The suddenness and ferocity of the hunger pang made her clutch her stomach and double over. It soon eased, but not completely. She knew she would have to get something to eat, but with how odd everything was around her, what were the odds of finding something edible? Eyeing the water behind her, she amended her thoughts that maybe she would be able to find something after all. A sudden whiff of something sweet caught her nose. Realizing that she had no better idea for now, Tsunade set off towards where the delicious smell seemed to have come from.<br>\r\n<br>\r\nSoon enough, she came to a bush clustered around the base of one of the thinner trees. Peeking out from under the oddly colored leaves were something that somewhat resembled berries. Like almost everything else she had seen though, they weren’t like anything she knew of. In shape, they looked a bit like blueberries, but they were clustered more like a grape. The biggest difference though was that each berry was nearly the size of an apple.<br>\r\n<br>\r\nA cautious sniff revealed that the berries were indeed the source of the smell. Despite how appetizing they looked, the blonde hesitated just on how abnormal they looked as well. Grasping one of the berries, she gave it a squeeze. In response, it all but exploded. A wave of even sweeter smelling juice flowed across her hand and dripped to the forest floor. Another even stronger hunger pain dispelled her uncertainty. Before she realized what she was doing, she plucked the cluster off of the bush and bit into one of the berries.<br>\r\n<br>\r\nThe juice filled her mouth and washed over her tongue. The flood of juice washed away the last of her willpower. Berry after berry was wolfed down without a thought. A small portion of Tsunade’s mind was concerned over this. The vast majority however was too intent on the wonderful flavor filling the hungry void in her stomach.<br>\r\n<br>\r\n Eventually, she flopped down on the ground and let out a ringing burp. Her mouth and chin were stained with the dark berry juice, as was both of her hands and arms nearly to her elbows. Even the “cloth” covering her torso was wet and sticky from the overflow, outlining her breasts and the slight bulge of her filled stomach beneath. <br>\r\n<br>\r\nAs she was licking her fingers and lips to try to get some more of the taste, she realized that she hadn’t stopped because she was full. She thought she should fell sick from how much she had eaten, but there was merely a satisfied pressure instead. She had actually stopped because she had picked the entire bush clean of the berries. Only a few wrinkled and withered stragglers remained in the dirt surrounding the roots.<br>\r\n<br>\r\nHer eyelids grew heavy as her brown eyes became unfocused. Despite the situation, she felt content for now.</span></div></div>",
            "created":1544778480,
            "id":2588987,
            "title":"A new taste sensation"
        },
        "1223322211112":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "…Hinata Hyūga.",
                "…Sakura Haruno.",
                "…someone else."
            ],
            "content":"<div class=\"\"><div> <span>Shaking her head and gritting her teeth, she shook off the dark shroud that threatened to drag her under. The juice staining her was already starting to dry, becoming stickier and even a bit irritating where it soaked her skin. Hopping up from the bush, Tsunade turned around before quick stepping back to the pond. Kneeling down at the edge again, she plunged her hands into the cool water before rubbing her hands over her arms. Scooping up more, she turned her attention to her face and her outfit.<br>\r\n<br>\r\nAs the ripples in the water faded away, she looked over her reflection. A quick nod followed due to her satisfaction in on cleaning up as best she could. She then started scooping up further handfuls of water and slurped them down one after another. The cool weight flowed down around and through the stomach load of berries, further bloating her stomach with each gulp.<br>\r\n<br>\r\nWhen she lay back in the multicolored grass with a satisfied sigh, she let her hands idly rub her rounded belly. Some portion of her mind screamed that she should have been more concerned about this. A far larger part focused instead on the pleasure and relief that flooded her body. Wherever here was, she felt more at peace than she had in a long time.<br>\r\n<br>\r\nTsunade woke with a jolt. Fear flooded her mind upon seeing the unfamiliar surroundings before it faded away to the background. She still had no idea where she was or what had happened to her, but the peace fogging her mind seemed even stronger than before. She soon came to think that being far away from anything she had ever known was a blessing.<br>\r\n<br>\r\nThe sun had dipped lower in the sky, casting long shadows and putting a slight chill in the air. Sitting up, the blonde yawned and stretched her arms up high. An idle scratch down across her stomach caused a frown to cross Tsunade’s face. Looking down over her bust, her frown deepened as she saw that her belly was no longer bloated. Instead, it looked a bit soft. It felt more than a little soft too. As did her whole body. It was hard for her to say for sure, but even her breasts little a hair bigger as well.<br>\r\n<br>\r\nThat small portion of her mind yelled that something was wrong here, but it drowning it out was a larger portion saying that it was fine. The more she thought about it, the more she came to realize that she shouldn’t be worried about it. Why shouldn’t she enjoy herself after everything she had gone through?<br>\r\n<br>\r\nWith a slight grin on her face, she hopped to her feet. After gulping down several more handfuls of water, she turned back to face the strange trees. Wandering under the strange colored boughs, she soon came across another enticing scent. This one was more savory than the sweetness of the berries. It triggered another hungry grown in her stomach, and she licked her lips in anticipation.<br>\r\n<br>\r\nFollowing the scent deeper into the forest, she found a tree that had vines thicker than her forearm covering it. Dotted along the lengths were small violet flowers and seemed to somewhat glow. Far more interesting were the orbs that looked somewhat like melons. Each was larger than her head, and the biggest at the bottom of the vines looked to be twice that. The tough and rough filling skin was striped blue and gold, and as she touched one her nose was overwhelmed with that savory smell. There was a subtle sweetness to it as well, but it was almost hidden by the stronger part.<br>\r\n<br>\r\nTsunade’s hesitation lasted for only a moment. She grasped one of the higher melons and plucked it from the vine. She licked her lips again before digging her thumbs into the side. Almost immediately, a flood of thick fluid welled up from the opening. Before she realized what she was doing, she tipped the melon up over her face and guzzled down the ooze, finding it to be rather tasty. As the flow slowed to a trickle, she resumed breaking apart the melon. The flesh inside was deep blue and still leaking plenty of the fluid, but not for long as she lapped it up. She then turned her attention to the flesh itself. It was even more savory than the smell had been. It tasted almost like meat but with a definite more fruit-like texture. She had her face buried in a second one when a gasp coming from behind her made her freeze. Turning around, she saw…</span></div></div>",
            "created":1567668720,
            "id":2713545,
            "title":"Giving in"
        },
        "12233222111121":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Tsunade gives in, kissing Hinata.",
                "Tsunade resists and instead leads Hinata back to the water.",
                "Before she can decide, that blinding light and deafening noise surrounds them."
            ],
            "content":"<div class=\"\"><div> <span>Crouched down in the shadow of a neighboring tree, a bush concealing her partway, Hinata stared at Tsunade. Her pale featureless eyes stared unblinking at her leader. Dark hair spilled down to her lower back around a very similar outfit, right down to the positioning of the barely there opaque patches.<br>\r\n<br>\r\n“Ts-ts-Tsunade-sama?” she managed to stammer.<br>\r\n<br>\r\n“Yes, Hinata. They got you too?” the busty blonde responded after gulping down her latest mouthful.<br>\r\n<br>\r\nHinata only nodded before looking around with more than a little fear in her eyes. “Whatever they are, they…they…they did things to me. My head hurt and they stabbed me with needles…” her voice trailing off as she shuddered with the memory.<br>\r\n<br>\r\nTsunade nodded and remarked that their captors did the same to her. “But enough of that, why don’t you come here and eat with me? You must be famished.”<br>\r\n<br>\r\n“Shouldn’t…shouldn’t we be seeing about a way out of…wherever here is?” Hinata stammered.<br>\r\n<br>\r\n“We can worry about that later,” Tsunade said with a dismissive wave of her hand. “We should keep our strength up in the meantime though, shouldn’t we?” she continued while holding another of the melons out to the other.<br>\r\n<br>\r\nHinata glanced around the strange forest again, her eyes flicking to and fro searching for their captors. \"I suppose so,” she muttered, those it was obvious that she wasn’t convinced.<br>\r\n<br>\r\nDespite her apprehension and fear, Hinata slipped from the cover of the brush and sat down beside Tsunade. The youngest of the pair frowned as she looked over the melon. Tsunade then took the lead, jabbing a thumb through the thick skin and letting the ooze well up again. She then upended the melon over Hinata’s mouth and let it dribble down the other’s throat. The effect was immediate. Her pale eyes snapped wide open and she snatched the melon from Tsunade’s grasp before sucking down as much of the goo as she could. She then tore into the melon itself, and started devouring the wet flesh within. Tsunade returned to her own melon and finished it off in no time at all.<br>\r\n<br>\r\nThe sun was brushing the horizon when the pair of woman laid back in the strange grass, each of them letting out a satisfied sigh. Hinata’s face crumpled for a moment before she let out a loud burp. She clapped a hand slick with melon goo to her mouth, her cheeks blazing bright red. Tsunade grinned and let out a laugh before an even louder belch burst from her guts. Hinata let her hand loosen a bit and gave a little chuckle as the blush started to recede.<br>\r\n<br>\r\nHinata’s embarrassment returned with a vengeance as her stomach let out a hungry grumble. “H…how…? I shouldn’t be hungry…not after…after all that.” She stared down at the bump of her belly, worry puckering her face.<br>\r\n<br>\r\n“Don’t worry about that, I ate plenty of these berry things earlier. Then I found these things, and we split them, so you being hungry again isn’t that bad,” Tsunade said. She grunted a bit as she got her feet under her and she hoisted her own bulging stomach. Sniffing the air, “Ooh, speaking of the berries, I think there must be some around here.” She licked her lips in anticipation as she wondered off, following the scent.<br>\r\n<br>\r\n“B…bu…but, we ate…” she trailed off as she watched Tsunade continue hunting the berries. A quiver passed down Hinata’s frame before she struggled to her feet and trailed after the older woman.<br>\r\n<br>\r\nTheir journey took them only a short way further. In an instant, Tsunade plopped down in front of the thick bush around the base of another tree, and started plucking the enormous berries from it. She scarfed down some of them before holding the rest of the bunch out for Hinata. The younger woman took a step backwards, fear again washing over her, making her already pale skin blanch further.<br>\r\n<br>\r\nTsunade wasn’t having that though. “Come now, Hinata, if you thought those melons were tasty, they’re nothing compared to these. Try one, go on, try it,” starting to add a bit more force to her voice.<br>\r\n<br>\r\nHinata stepped backwards again, but ran right into another tree. “N-n-no, something is wrong here. We should…I should—“<br>\r\n<br>\r\nTsunade forced one of the berries into her mouth cutting off the rest of whatever Hinata was trying to say. The juiciness exploded in that instant, drops running down her chin and onto her outfit. Another berry followed the first, as did another, and another. Hinata tried to push Tsunade away, and then tried to get away herself. Tsunade was too strong for Hinata though. Before long Hinata’s mumbled protests and futile struggling became half-hearted, and then stopped completely.<br>\r\n<br>\r\nWhen that bunch was packed away in their stomachs, Tsunade grabbed Hinata’s wrist and led them back to the bush. Their feast resumed, and while Tsunade still ate quite a few of the berries, she let Hinata take the lion’s share.<br>\r\n<br>\r\nIn the end, Hinata slumped back from the bush cradling her rock hard gut and panting and gasping for breath. Her tongue darted in and out still, lapping at every gooey remain of the berries and melons that clung around her mouth and to her hands.<br>\r\n<br>\r\nTsunade leaned back onto her arms, starring down at Hinata. Strange thoughts started to whirl through her head. She couldn’t stop her eyes from tracing the swell of Hinata’s breasts stretching the shear sections of her body suit. Nor the bulge of her stomach below. One of the few times she could tear her eyes away, she found herself drawn towards those pale orbs. Looking deep in them, Tsunade thought she could see a hint of desire there. <i>No, that’s absurd. There’s no way Hinata thinks of me that way</i> Tsunade chided herself. And yet, trapped together in this strange place, perhaps their relationship could become something more.</span></div></div>",
            "created":1568529780,
            "id":2718421,
            "title":"Two’s company"
        },
        "122332221111213":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are they afraid?</span></div></span></div>",
            "created":1568681340,
            "id":2719334,
            "title":"The noise and light"
        },
        "1223322211112132":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Option 1",
                "Option 2",
                "Option 3",
                "Option 4",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The light was blinding, the noise like the hum of a million bees. It came on very suddenly and quick, with no warning or alert. And yet Tsunade couldn’t find it in her to be afraid. Instead, she felt calm, relaxed and, why, just a little sleepy. She felt that she could just fall asleep right there, upright and in this strange forest. She suddenly felt her legs begin to move; it took her sluggish mind a moment to realize that she was walking somewhere. It didn’t bother her that she really didn’t know where she was walking. She didn’t even really care if Hinata was coming along, though she assumed that she probably was.<br>\r\n<br>\r\nAs she walked, Tsunade did fall asleep. It was so easy, even though she was upright and walking. When she awakes, where is she?<br>\r\n<br>\r\nOption 1) She awake somewhere else in the forest. She and Hinata are surrounded by a group of curious aliens who want to ask them questions.<br>\r\n<br>\r\nOption 2) A clean white room. Hinata isn’t with her.<br>\r\n<br>\r\nOption 3) A stable-like room where she and Hinata wait on their hands and knees.<br>\r\n<br>\r\nOption 4) Back in the village</span></div></div>",
            "created":1571152800,
            "id":2733322,
            "title":"No"
        },
        "12233222111121321":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "They keep asking questions",
                "They alter Tsunade and Hinata",
                "They lead the women away to another place",
                "They command them to act out their sexual fantasies ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>And then Tsunade was awake. She stood beside Hinata and a group of...people stood in front of her. They were very pale and hairless. There were six of them and they all wore long white robes that reminded Tsunade somehow of garments doctors might wear.<br>\r\n<br>\r\n“19 deckkodes is how long it took for them to cross 20 miconods,” one said. <br>\r\n<br>\r\n“Very good considering how much they ate,”said another. <br>\r\n<br>\r\n“Very eager girls,” said one closest to Tsunade. This lifted his hand and petted her face, along her cheek and jaw. “I think we have a good pair here.”<br>\r\n<br>\r\n“We will see. Let us begin the questioning.”<br>\r\n<br>\r\n“Yes, subject one,” the one who was petting her spoke to her. Tsunade knew that she was subject one. “Did you like the fruit you consumed?”<br>\r\n<br>\r\n“Yes, very much,” she wasn’t surprised to hear herself say. She knew that lying wasn’t good, she couldn’t lie. Why would she lie?<br>\r\n<br>\r\n“Which was your favorite?”<br>\r\n<br>\r\n“The berries...I loved the berries. I loved how they felt in my mouth.”<br>\r\n<br>\r\n“Good, very good, subject one. Let us see, subject two,” he turned to Hinata. Tsunade actually felt a little sad when he took away his hand, “did you enjoy the fruit?”<br>\r\n<br>\r\n“Yes...” Hinata’s eyes were far away and calm, her shoulders limp and she slouched slightly.<br>\r\n<br>\r\n“But you seemed hesitant to eat? Why is that?”<br>\r\n<br>\r\n“I was afraid, I didn’t know what was happening and Tsunade was acting odd.”<br>\r\n<br>\r\n“But you liked the fruit after you tried it?”<br>\r\n<br>\r\n“Yes...”<br>\r\n<br>\r\n“Such a good girl you are,” he said as he lifted his hand to pet Hinata the same way he had done with Tsunade. Hinata’s face changed ever so slightly. She seemed happier, a slight smile to her lips.<br>\r\n<br>\r\n“This is for subject one,” another said. “Do you notice any changes to your body?”<br>\r\n<br>\r\n“My belly feels bigger.”<br>\r\n<br>\r\n“And you, subject two?” <br>\r\n<br>\r\n“My belly feels tight. I feel good.”<br>\r\n<br>\r\n“And subject one, how do you feel about subject two?”<br>\r\n<br>\r\nTsunade couldn’t lie.<br>\r\n<br>\r\n“Hinata is very pretty. Her breasts are very nice and I love how her belly is poking out.”<br>\r\n<br>\r\n“Same question, subject two.”<br>\r\n<br>\r\n“I have always admired Tsunade. I was afraid when we first started eating, but now I think she looks beautiful.”<br>\r\n<br>\r\nThe people seemed pleased. Now what?</span></div></div>",
            "created":1571154780,
            "id":2733335,
            "title":"Option 1"
        },
        "122332221111213212":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Option 1",
                "Option 2",
                "Option 3",
                "Option 4",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>How are they altered?<br>\r\n<br>\r\nOption 1) Their breasts, hips, and butts are enlarged.<br>\r\n<br>\r\nOption 2) They are de-evolved and act much less intelligent <br>\r\n<br>\r\nOption 3) They are brainwashed to be sexually attracted to someone <br>\r\n<br>\r\nOption 4) They are impregnated then and there<br>\r\n</span></div></div>",
            "created":1571701860,
            "id":2736476,
            "title":"They alter Tsunade and Hinata"
        },
        "1223322211112132122":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes, they also begin to look like cave-women",
                "They look like monkey-women",
                "No, just their brains",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How are they de-evolved? Do they look like cave-women?</span></div></span></div>",
            "created":1575387300,
            "id":2754912,
            "title":"Option 2"
        },
        "12233222111121321223":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Yes",
                "No, she’s made even dumber",
                "The aliens decide to leave her alone ",
                "She’s only made a bit dumb",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Everything seems in order,” the person nearest to Hinata said. “Let us begin with subject two.”<br>\r\n<br>\r\nHe pulled a gun-like object from his pocket. “We will set the device to 98-ninotrupes-“<br>\r\n<br>\r\n“Could we maybe not change their bodies? Just their brains.”<br>\r\n<br>\r\nThe others nodded in agreement.<br>\r\n<br>\r\n“Fine, just their brains. That shouldn’t change the experiment too much,’ he fiddled with the device’s settings. <br>\r\n<br>\r\nTsunade felt no alarm when he pointed the device at Hinata’s forehead.<br>\r\n<br>\r\n“Subject two, please begin counting for as long as you can.”<br>\r\n<br>\r\n“1, 2, 3, 4, 5-“<br>\r\n<br>\r\nHe pulled the trigger and a blue light zapped into Hinata’s forehead. She blinked, but did not stop her counting.<br>\r\n<br>\r\n“...9, 10, 11, 12, 13...umm, 14...15...”<br>\r\n<br>\r\nThe gaps between the numbers got bigger. Even her steady gaze grew a bit dim as her posture changed. She began to slouch and slur her words.<br>\r\n<br>\r\n“...18? 18...18...19...ummm...2? 3, 4, 5...9? 19?”<br>\r\n<br>\r\n“That is fine, subject two, you did very well.”<br>\r\n<br>\r\nHinata seemed quite pleased. She gave him a huge lopsided grin and giggled stupidly.<br>\r\n<br>\r\n“Now for subject one, also at 98-ninotrupes-“<br>\r\n<br>\r\nDoes Tsunade get the same treatment as Hinata?</span></div></div>",
            "created":1575387960,
            "id":2754914,
            "title":"No, just their brains"
        },
        "122332221111213212232":{
            "author_id":"rickroll10000",
            "author_name":"Lovergurl",
            "choices":[
                "Pre-school level dumb with house training?",
                "Kindergarten level dumb?",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How dumber?</span></div></span></div>",
            "created":1599640020,
            "id":2899878,
            "title":"No, she’s made even dumber"
        },
        "12233222111123":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Yes...",
                "No...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Ino?</span></div></span></div>",
            "created":1567797660,
            "id":2714254,
            "title":"Ino Yamanaka"
        },
        "12233222113":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "She has cock and balls imstead of her pussy?",
                "A slow decent to a whore/bimbo?",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What has been done to the voluptuous hokage?</span></div></span></div>",
            "created":1544720340,
            "id":2588783,
            "title":"She’s back home in bed."
        },
        "122332222":{
            "author_id":"cookiecat1234",
            "author_name":"Cookiecat1234",
            "choices":[
                "Temari",
                "Shizune",
                "Naruko",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which other lovely lady?</span></div></span></div>",
            "created":1542690000,
            "id":2580018,
            "title":"Other..."
        }
    },
    "info":{
        "author_id":"rosebunse",
        "author_name":"Rosebunse",
        "brief_description":"The ninja if Naruto get abducted by kinky, sexy aliens! You decide what happens!",
        "created":1366933680,
        "description":"<td align=\"left\" class=\"norm\">The ninja of Naruto are abducted by aliens! From there, anything goes! Anything! </td>",
        "id":1930572,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602174300,
        "modified":1602174300,
        "pretty_title":"Naruto: Kinky Ninja Alien Abduction!"
    }
}