{
    "chapters":{
        "1":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Hufflepuff",
                "Ravenclaw",
                "Slytherin"
            ],
            "content":"<div class=\"\"><div> <span>Harry Potter just enjoyed chatting with Ron Weasley and Hermione Granger on the Hogwarts Express Train. He felt that maybe they could be friends there at Hogwarts- maybe. Anyway, Harry was glad to get away from living in the Dursley's house. He felt that Hogwarts could not be any worse. In fact, maybe it could be better for him.<br>\r\n<br>\r\nHarry even saw Hagrid again after he left the train to get into the boat to go to Hogwarts.<br>\r\n<br>\r\n-flash forward to the Sorting Hat-<br>\r\nHe watched several people being sorted. Weasley and Granger both was in Gryffindor. Malfoy was in Slytherin.<br>\r\nWhen the Hat was placed on his head, Harry had second thoughts.....Where do I really belong? I do not deserve being in Gryffindor. The Hat thought for a minute and asked Harry a question. When Harry replied, the Sorting Hat cried out</span></div></div>",
            "created":1314766800,
            "id":1178721,
            "title":"The Sorting Hat"
        },
        "11":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Harry Potter began to eat right away",
                "Harry spoke to a Hufflepuff student to his left.",
                "Harry spoke to the House Ghost The Fat Friar."
            ],
            "content":"<div class=\"\"><div> <span>Harry said that he felt rejected by many in life. He just wanted to be accepted for who he was. The Hat knew that the Fat Frair was willing to take anyone in Hufflepuff even the 'nobodies' as well as the somebodies.<br>\r\n<br>\r\nThe Hat cried out HUFFLEPUFF!<br>\r\n<br>\r\nThe crowd in HUFFLEPUFF cheered ' We got Harry Potter!'   Malfoy glared at Harry while Hermione gave him a polite applause. Harry Potter smiled while he watched the rest of the group was sorted.<br>\r\n<br>\r\nAfter Dumbledore gave the short speech and rules, he clapped his hands and an enormous meal appeared on the table.</span></div></div>",
            "created":1314766800,
            "id":1178731,
            "title":"Hufflepuff"
        },
        "111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Hermione Granger (she was sitting across from him)",
                "Professor Sprout of Herbology",
                "a  skinny huffflepuff student named Bill Clanton"
            ],
            "content":"<div class=\"\"><div> <span>His aunt and uncle never fed him this much or well. Harry never seen that much food in his life. And the food smelt so good. Harry grabbed a chicken leg and took a bite. He smiled. He devoured it in less than a minute. Then he ate some mashed potatoes next, Harry did not realize that he was eating way too fast.<br>\r\n<br>\r\nThen he heard a voice behind him saying. 'It might be more polite to slow down on your eating'. The voice was not harsh but it was firm. Harry turned around to see who was speaking..  It was....</span></div></div>",
            "created":1315458000,
            "id":1183644,
            "title":"Harry Potter began to eat right away"
        },
        "1113":{
            "author_id":"merecat",
            "author_name":"black",
            "choices":[
                "Harry talks to other people",
                "Harry keeps to himself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're right. What's your name?<br>\r\nBill Clanton <br>\r\nHarry kept eating but more slowly this time.</span></div></span></div>",
            "created":1339477200,
            "id":1358111,
            "title":"a  skinny huffflepuff student named Bill Clanton"
        },
        "12":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Harry meets his new Ravenclaw roommate",
                "Harry explores the Ravenclaw Tower for the first time",
                "Harry meets the ghost of Rowena Ravenclaw",
                "Harry becomes friends with the boys on the Ravenclaw Quidditch team"
            ],
            "content":"<div class=\"\"><div> <span>Harry gulped for a moment as the room went silent. The Sorting Hat thought for a moment, as it pondered where Harry was about to be sorted. Then, it made a decision, and blurted out the answer that everyone had been waiting for.<br>\r\n<br>\r\n\"Ravenclaw!\"<br>\r\n<br>\r\nHarry let out a deep sigh of relief. He was sorted in the House of Ravenclaw!<br>\r\n<br>\r\n\"Congratulations, Harry!\" Hagrid smiled, as the Sorting Hat was removed from his head while Harry slowly got up from the stool. \"That is a great house to be sorted in, you know?\"<br>\r\n<br>\r\n\"Really?\" Harry asked his big bearded friend.<br>\r\n<br>\r\n\"Ravenclaw is the house of intelligence, wit, wisdom and creativity, my boy!\" Hagrid cheered. \"All the smart kids go there!\"<br>\r\n<br>\r\nHermione walked up to them and joined in on the conversation.<br>\r\n<br>\r\n\"Very good, Harry! You'll like it in Ravenclaw! Garrick Ollivander came from there, you know that?\"<br>\r\n<br>\r\n\"Who?\" Harry wondered.<br>\r\n<br>\r\n\"He was a famous wandmaker! He attended the House of Ravenclaw! Plus, they got some wicked Quidditch players!\"<br>\r\n<br>\r\n\"Yeah... but none as powerful as OUR team!\" Malfoy sneered. \"Nobody can beat the Slytherin team!\"<br>\r\n<br>\r\n\"Go away, Draco!\" Hermione hissed. \"We're not talking about you!\"<br>\r\n<br>\r\nMalfoy quietly turned around and walked away, with an evil smirk on his face, as Hermoine and Harry just stared at each other.<br>\r\n<br>\r\n\"You'll become very good at answering riddles...\" she added.<br>\r\n<br>\r\n\"Riddles?\"<br>\r\n<br>\r\n\"You need to answer riddles, rather than provide passwords, in order to gain access to the rooms in the Ravenclaw Tower!\" Hermione explained. \"You'd better get used to that!\"<br>\r\n<br>\r\n\"Oh boy...\" Harry sighed. \"Well, that can't be so bad... I hope the other guys in Ravenclaw will like me!\"<br>\r\n<br>\r\n\"Don't worry... These are all the smart kids... You'll fit right in! There are some of them, standing in the corner over there!\" she said, pointing to a small group of boys who were huddling in the corner of the room.<br>\r\n<br>\r\nHarry turned around and decided to join the Ravenclaw group so he could introduce himself as the newwest member of the house...<br>\r\n</span></div></div>",
            "created":1319000400,
            "id":1209709,
            "title":"Ravenclaw"
        },
        "121":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Defense Against The Dark Arts class",
                "Herbology class",
                "Potions class"
            ],
            "content":"<div class=\"\"><div> <span>There was a gentle tap on Harry's shoulders. Harry turned to his right and noticed a young boy with curly brown hair that was a little bit long. <br>\r\nHe said to Harry. <b>Hello, my name is John Lennon Sanders. Pardon my unusual name. My parents named me after that Beatles guy with the weird round glasses. I think that I am your roommate here at Hogwarts.</b><br>\r\n<br>\r\nHarry smiled a little bit and thought to himself that John's name would not be hard to forget. He also replied<b> 'Well, welcome to Hogwarts. Hope that I am as smart as the Hat think that I am.'</b><br>\r\n<br>\r\nThen they ate the meal together with the other Ravenclaws. Harry noticed Hermione Granger at the Gryffindor's Table. Some on the Ravenclaw's Table was somewhat surprised that the Hat chose her for Gryffindor but reluctantly accepted it.<br>\r\n<br>\r\nAfter the meal, the 1st year Ravenclaw group departed for the first class....</span></div></div>",
            "created":1320123600,
            "id":1216422,
            "title":"Harry meets his new Ravenclaw roommate"
        },
        "1211":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Harry pointed out the raven to the professor.",
                "Harry focused his attention back on the class",
                "Harry walked to the window to see the raven closer."
            ],
            "content":"<div class=\"\"><div> <span>Harry walked into the DADA's classroom where Professor Quirrell(sp?) was teaching. The professor was wearing a turban and had a major stuttering problem. Harry wondered why he was so nervous about teaching.<br>\r\n<br>\r\nAfter a while during class, Harry noticed something flying outside the classroom. It was fast so Harry was not sure what it was. A few minutes later, Harry noticed it again. He wondered ' Was It a raven'?</span></div></div>",
            "created":1325307600,
            "id":1250271,
            "title":"Defense Against The Dark Arts class"
        },
        "12112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Harry and John make and test a muscle growth spell",
                "Harry and John make and test the shrinking and growth spell"
            ],
            "content":"<div class=\"\"><div> <span>The professor continued his lecture about countering the dark spells, specifically the transformational spells.<br>\r\n<br>\r\n\"In this class, we will p-p-p-practice several spells to c-c-c-counter transformations, like shrinking, weakening, and age regression.\" the professor explained. <br>\r\n<br>\r\nHarry smiled as he turned to face John. <br>\r\n<br>\r\n\"Oh, this sounds like fun!\"<br>\r\n<br>\r\n\"Yeah, we'll get to practice shrinking and growth spells, muscle growth, and age change spells and try them out on one another!\"<br>\r\n<br>\r\n\"Yeah... What shall we make first?\" Harry asked John. <br>\r\n</span></div></div>",
            "created":1326085200,
            "id":1255284,
            "title":"Harry focused his attention back on the class"
        },
        "121121":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Harry's biceps was now 14 inches",
                "Harry's biceps was now 19 1/2 inches"
            ],
            "content":"<div class=\"\"><div> <span>John said <b>' Hey, Let us try muscle growth spells.  It would be fun if we were strong enough to face werewolves and beat them up senselessly. Using a wand is OK but being a superman is even better'<br>\r\n</b><br>\r\nHarry replied <b>'Well, we do not know how much better or stronger the spell would make us. We still need to be safe just in case. We need to go to the library to find out how strong werewolves are and how fast they are. First, we DO need to practice our spells. Do you want to be first to be strong or do you want me to go first to be strong?'</b><br>\r\n<br>\r\nJohn said with a grin ' Let me make YOU strong first. I am sort of used to being a sidekick'  John waved his wand and concentrated hard. Then he said something in Latin. A blue light went from John's wand and ''hit\" Harry Potter.<br>\r\nWithin a minute, muscles started to grow all over Harry. Although Harry was not overly huge, Harry looked much better. His arms, legs, and abs was much better. John asked Harry to flex his biceps for him to measure. Harry complied but felt a bit embarrassed. He did not want to show off in front of the girls. His face revealed his embarrassment. John found a tape measure and said ' Don't worry. I think most of the class is too busy practicing the spells to notice us.'</span></div></div>",
            "created":1326430800,
            "id":1257603,
            "title":"Harry and John make and test a muscle growth spell"
        },
        "1211211":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "The Defense Arts Professor saw them on the floor.",
                "A nerdy girl in Ravenclaw saw them on the floor."
            ],
            "content":"<div class=\"\"><div> <span>At first, Harry knelt down on the ground along with John to keep hidden from the rest of the class. Then Harry flexed his biceps to show an impressive 14 inches for someone his age. John was impressed with the success of his spell. He said quietly -<b>Wow, imagine what we could do to dragons and werewolves. They would be scared of us now..</b><br>\r\n<br>\r\nHarry still was a bit embarrassed. He was concerned that people would be scared of him and stopped flexing. Harry said to John 'We better get back up on our feet before someone notice us on the floor'<br>\r\n<br>\r\nBut someone did see them on floor. </span></div></div>",
            "created":1330923600,
            "id":1289422,
            "title":"Harry's biceps was now 14 inches"
        },
        "12112112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Sherry drinks the potion and Hulks out permanently!",
                "It's like Jekyll and Hyde: Sherry becomes muscular and shrinks back later"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! What are you two guys doing down there?\"<br>\r\n<br>\r\nHarry and John looked up to see Sherry looking down at them \"Whoa! Harry! I didn't know you worked out in the gym!\"<br>\r\n<br>\r\nThe two boys quickly stood back up and then sat down at their desks as Sherry pulled up her chair and joined them at their desks.<br>\r\n<br>\r\n\"We... We made a muscle growth formula!\" John whispered to the nerdy girl.<br>\r\n<br>\r\nSherry had long red hair and glasses but she was really smart and even a little shy.<br>\r\n<br>\r\n\"Really? Ohhhh That is so cool! Does it only work on guys?\" she asked them.<br>\r\n<br>\r\nHarry turned to John before he answered.<br>\r\n<br>\r\n\"It works for guys and girls...\" he replied, as he filled a cup with the remaining formula and handed all of it to Sherry. \"Here... Drink it all up! Finish it!\"<br>\r\n<br>\r\n\"Are you serious? You want me to drink all of that?\" she asked him.<br>\r\n<br>\r\n\"Yeah!\"<br>\r\n</span></div></div>",
            "created":1343710800,
            "id":1394156,
            "title":"A nerdy girl in Ravenclaw saw them on the floor."
        },
        "121121122":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Sherry suddenly grows twice as muscular as before!",
                "Sherry's muscles shrink back to normal after 30 minutes! "
            ],
            "content":"<div class=\"\"><div> <span>John stared at Harry with a surprised look on his face.<br>\r\n<br>\r\n\"What are you doing?\" he whispered to his partner in his ear.<br>\r\n<br>\r\n\"We know the potion works because I tried it! But, we don't know if it works on girls... Or how it will affect her... If it will even work on her at all!\" Harry whispered back.<br>\r\n<br>\r\n\"Ohhh... Clever!\" John replied.<br>\r\n<br>\r\n\"Is... Is there a problem?\" Sherry wondered.<br>\r\n<br>\r\n\"No! None at all!\" John said, as he handed Sherry the cup containing the potion. \"You can have it... All of it!\"<br>\r\n<br>\r\nSherry placed the edge of the cup against her lips and tipped it over, drinking the entire contents in one big gulp, licking her lips after she finished. <br>\r\n<br>\r\n\"That was delicious!\" she said with a smile. \"I... I wanna hang out with you guys... If you don't mind...\"<br>\r\n<br>\r\n\"No... Not at all!\" Harry affirmed as he shrugged. \"We'd love to have a girl on our team!\"<br>\r\n<br>\r\nThen, Sherry let out a soft burp, while covering her mouth with her hand. A moment later, her chest started to bulge!<br>\r\n<br>\r\n\"Whoaaa!\" she gasped.<br>\r\n<br>\r\nHer legs quickly followed, inflating to hugely muscular proportions! Her calves became enormous while her quads exploded until they were twice as wide and twice as thick as before!<br>\r\n<br>\r\n\"Holy cow! I'm STRONG!\" Sherry shouted.<br>\r\n<br>\r\nHer torso widened as her abdominal muscles became very defined while her lats, her delts, and her triceps popped up from her huge, broad shoulders, making her look like a large, female bodybuilder!<br>\r\n<br>\r\n\"Wow! Sherry! You look... fantastic!\" John grinned.<br>\r\n<br>\r\n\"Astounding!\" Harry cheered.<br>\r\n<br>\r\nBoth boys couldn't help but admire the shy red-haired girl, who now sported over 200 pounds of muscle...<br>\r\n</span></div></div>",
            "created":1345698000,
            "id":1411870,
            "title":"It's like Jekyll and Hyde: Sherry becomes m..."
        },
        "1211211222":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Sherry suddenly grows twice as muscular as before!",
                "Sherry grows muscular and taller at the same time!"
            ],
            "content":"<div class=\"\"><div> <span>Professor Snape just walked by the large table where Harry and John were seated. Now, Sherry had joined the two boys. She had removed some of her clothing, leaving just her shirt and shorts, due to her bulging muscles, and left the rest of her robes hanging from her seat back.<br>\r\n<br>\r\n\"Miss Sherry... I see that you have removed some of your robes?\" Snape wondered.<br>\r\n<br>\r\n\"Yes, sir! I had tried some of Harry's potion and I had to remove my robes because I started to outgrow them!\" she replied.<br>\r\n<br>\r\n\"Outgrow... Your robes?\" Snape sneered.<br>\r\n<br>\r\nSherry stood up and revealed her bulging, muscular arms.<br>\r\n<br>\r\n\"I see... Very good! I believe that proves that Mr. Potter's muscle growth potion works as expected!\"<br>\r\n<br>\r\nBoth boys nodded.<br>\r\n<br>\r\n\"Now, you must document your findings in a neatly typed manuscript of five pages minimum! You must write how you created the potion, what effects it has, who you tested it on, and how it has benefited your test subject! I want this paper on my desk by Friday!\" Snape instructed.<br>\r\n<br>\r\nAs the boys packed their books and Sherry started to put her books and papers in her bag, she was overcome by that weird tingling sensation again! Then, before their eyes, her muscles began to dwindle! They deflated until she was back to normal!<br>\r\n<br>\r\n\"Guys! Look! Look at me! My big muscles! They're gone!\" she gasped out loud.<br>\r\n<br>\r\n\"Quick! Let's go to my place so we can examine you more closely!\" Harry suggested.<br>\r\n<br>\r\nHarry and John led Sherry into their dorm room at the Ravenclaw house, where Sherry, sat down on the bed for a few minutes, when...<br>\r\n<br>\r\n</span></div></div>",
            "created":1345957200,
            "id":1413902,
            "title":"Sherry's muscles shrink back to normal afte..."
        },
        "12112112221":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "decided to write about the muscle growth now ",
                "took their wands and headed into the forbidden forest."
            ],
            "content":"<div class=\"\"><div> <span>Sherry was not sure what happened this time so she jumped from the bed and ran into the Ravenclaw Common Room. She quickly casted a spell on her robes to make it more indestructible.  <i>After all, the robes are not cheap to buy.</i><br>\r\n<br>\r\nAfter a few seconds, she slowly gave a grateful smile. Her muscles growth came back much better than before. She wondered if she could be able to wrestle trolls and werewolves now. However Sherry's logical mind decided that none of them knew the average strength of a troll or werewolf. That might have to come later, if they wanted to play it safe.<br>\r\n<br>\r\nSherry had an idea on what to do next. She called the boys over and said <b> I feel much smarter now too and can write more clearly for mean o' Snape. But I feel like killing a troll or werewolf in the Forbidden Forest. We can take our wands too. I do not think anyone will try to stop us.</b> After a few seconds, they</span></div></div>",
            "created":1345957200,
            "id":1414196,
            "title":"Sherry suddenly grows twice as muscular as before!"
        },
        "121121122211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Harry, John and Sherry wander into a nightclub in town",
                "Harry, John and Sherry walk into a local gym"
            ],
            "content":"<div class=\"\"><div> <span>\"Wow, Sherry! You look amazing!\" John smiled.<br>\r\n<br>\r\n\"Totally smashing!\" Harry exclaimed.<br>\r\n<br>\r\nSherry flexed her huge biceps as she raised up both arms, causing her insane biceps to pop up! They were bigger than bowling balls!<br>\r\n<br>\r\n\"Uhh, guys... If we knock out the paper for Professor Snape, then we'll be free for the rest of the week! Especially now that we have all the ingredients for the serum fresh on our minds!\" John noted.<br>\r\n<br>\r\n\"Oh yes! Here is my list of the ingredients....\" Harry said, as he pulled out a sheet of paper from his notebook with a list of about eight ingredients.<br>\r\n<br>\r\n\"Now we need to write out how we created the serum using those ingredients...\" John said. \"I hate writing papers like these... My handwriting is terrible!\"<br>\r\n<br>\r\n\"I'll do it!\" Sherry shouted. \"I have very pretty handwriting! Plus... I'm part of the team, now!\"<br>\r\n<br>\r\nThe super-muscular girl sat down at John's desk and took a pen in her hand.<br>\r\n<br>\r\n\"Okay... Let me dictate...\" Harry said out loud, while looking at the list of ingredients for the serum.<br>\r\n<br>\r\nJohn and Harry dictated out loud as Sherry wrote out a draft of the instructions fro creating the serum. Once she was done, she re-wrote it, so it was easier to read.<br>\r\n<br>\r\n\"Now, we need to say how the serum was a benefit to you, Sherry!\" Harry wondered.<br>\r\n<br>\r\n\"Well, nobody will bully me anymore, now that I'm big and muscular! Plus, I'm super strong! I can run faster, jump higher, and I can lift heavy stuff! Plus, I can help you guys with just about anything!\" Sherry cheered.<br>\r\n<br>\r\n\"Well, you can be our muscle-girl!\" Harry laughed.<br>\r\n<br>\r\n\"You got that right! I got you guys to thank for these awesome muscles!\" Sherry laughed.<br>\r\n<br>\r\nWithin minutes, they were finished writing the paper! It looked beautiful since it was written in Sherry's magnificent handwriting.<br>\r\n<br>\r\n\"Now... How about the three of us go out?\" Sherry suggested. \"Don't worry... I'll protect you guys!\"<br>\r\n<br>\r\nHarry and John just looked at each other and smiled...<br>\r\n</span></div></div>",
            "created":1345957200,
            "id":1414268,
            "title":"decided to write about the muscle growth now "
        },
        "1211211222112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Sherry began to lift it easily, using just one hand than the other hand.",
                "Draco noticed the trio at the other end and shouted....."
            ],
            "content":"<div class=\"\"><div> <span>John said that there was a new local gym now in the town of Hogsmeade and wanted to check it out. He continued ' After all, we can get our passes from the Headmaster of this school. Hopefully nobody got into trouble this week.'<br>\r\n<br>\r\nBoth Sherry and Harry shook their heads <b>NO</b>.---- After they received their passes, they headed to the Gym. When they arrived, the place did not have too many people there except for a few guys working out. One of them looked remarkably similar to the unpopular and rude student in Slytherin. - Draco Malfoy.  He was bragging that working out all summer and taking a strength potion to enhance it slightly made him stronger. He flexed a fairly good sized bicep for someone his age. Draco did look great for a serious athlete. However Sherry's muscles looked far greater than Draco's muscles.<br>\r\n<br>\r\nSherry sighed, remembering all the nasty things he said to her.  He even pulled a few minor practical jokes too at that time. At that time, John said <b>' Uh oh, is that Draco. We better be careful.'  </b>-- Harry said <b>' But remember Sherry got her muscles too and it is prettier too.'</b><br>\r\n<br>\r\nSherry blushed slightly. She did not want John or Harry frightened of her. She said to them in a singsong voice... Let's go to that weight machine on the other side of the gym. I do not want Draco to see me now.<br>\r\nHer voice was so enticing that they simply nodded and followed her to a bench pressing machine. Sherry got underneath it and asked the boys - Can you tell me me how much I will be lifting?  They looked at it and Harry said ' It is not much yet.. 150 lbs.'<br>\r\nSherry said ' <b>Well, I will go ahead and do this lighter one now- maybe really fast.'</b></span></div></div>",
            "created":1346475600,
            "id":1418410,
            "title":"Harry, John and Sherry walk into a local gym"
        },
        "1213":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Harry and John create the muscle growth potion",
                "Harry and John create the shrinking potion",
                "Harry and John ask Snape if they can pick another potion to try out instead"
            ],
            "content":"<div class=\"\"><div> <span>John and Harry sat next to each other in the potions class. They tried their best to pay attention as Prof. Severus Snape explained a new potion in class.<br>\r\n<br>\r\n\"A potion that causes a transformation is truly revolutionary!\" he said. \"Transformations are the backbone of magic... To cause a physical change in another person is not only exciting, but it's a thrill for the person experiencing the change as well. The person administering the potion sees the person change before his or her eyes, but the person who is actually changing gets to experience life in a whole different form, as a different being or animal, or as a thing,or at a different age or size, or stronger or weaker!\"<br>\r\n<br>\r\n\"Wow...\" several students gasped all at once.<br>\r\n<br>\r\n\"So, we will be broken up into groups of two, where you will pick a transformation potion. Then, you will look up the recipe and the ingredients for that potion using the spell and potions books. You will create the potion and an antidote as well. Finally, you will choose which one of you will drink the potion.\"<br>\r\n<br>\r\nSnape walked around the large lecture hall and assigned the students into pairs, usually assigning the students as they were seated.<br>\r\n<br>\r\n\"Potter... You will work together with Mr. Sanders, who is seated next to you.\" Snape said to him. \"You will create a potion together and try it out. You may choose one from the following. Whichever one you don't choose now, you'll create next week instead. So, you may pick from either a muscle growth potion or a shrinking potion. Which one would you like to try first?\" <br>\r\n<br>\r\nHarry and John talk it out before deciding on creating...<br>\r\n</span></div></div>",
            "created":1336798800,
            "id":1335802,
            "title":"Potions class"
        },
        "12131":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Neville Longbottom (who was usually insecure)",
                "Hermione Granger ( it can be useful to her too)"
            ],
            "content":"<div class=\"\"><div> <span>Harry and John studied the textbook carefully. They wanted to be sure to make it correctly. Snape was a moody professor who can barely tolerate students in other Houses. He seem to enjoy deducting points from other Houses when things go wrong or they say something snarly back to Professor Snape.<br>\r\n<br>\r\nHarry and John whispered quietly as they compared notes. They were so nervous that they made two potions exactly the same.  John said to Harry. ' Hide that in your backpack. We might give that potion to someone who could use it.'  Harry nodded and complied. Fortunately Prof. Snape did not appear to see them do it.<br>\r\n<br>\r\nThe Muscle Growth potion would be just temporarily effected---usually around 30 minutes for a good one. When Harry and John were ready, John waved for Prof. Snape to come over to watch. Snape then told them to choose one of them to drink it and just to take a sip so it would last 2 or 3 minutes. John nodded for Harry to drink the potion.  Harry drank just enough for about 3 minutes work. It was a successful potion. His biceps grew about 9 inches. If Harry had drank the whole thing, it would have lasted about 30 minutes. Harry felt far more alert than he had been feeling in days. Sadly the effect wore off and his bicep returned to the size of an average boy.<br>\r\n<br>\r\nThen Professor Snape told them to pour the rest of the potion down the drain NOW. Sadly they complied. Then he said 'well, unfortunately you did Well since both of you are in Ravenclaw. 2 points to your House. Consider yourself lucky that I even gave you points. Now, sit there until class is over.'<br>\r\n<br>\r\nFinally class was over and they had a break. John had an idea and told it to Harry.  He said ' Hey, Let us go to the General Recreation Room where all the Houses meet. Let us find someone that can have the strength potion.' Harry nodded. He thought that it would be fun.<br>\r\n<br>\r\nWhen they arrived , only one person was there and that person was feeling sad. Harry had the potion in his hand and said  \"This is a Muscle Growth/Strength potion. It would last about 30 minutes. We would like for you to have it.\"<br>\r\n<br>\r\nThe sad person's expression changed into a small smile. That person was feeling a bit better and took the potion. But that person wondered on whether or not to drink it. Harry and John just gave the MG potion to ____<br>\r\n<br>\r\n</span></div></div>",
            "created":1339390800,
            "id":1357867,
            "title":"Harry and John create the muscle growth potion"
        },
        "121311":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Neville returns to normal",
                "Uh oh! Neville grows even MORE muscular!"
            ],
            "content":"<div class=\"\"><div> <span>Neville was feeling kinda sad. The boys were playing Quidditch and he was never asked to play along because he was too slow, too clumsy and too insecure. He was short and uncoordinated.<br>\r\n<br>\r\nHarry and John approached him, with Harry holding a small bottle in his hand.<br>\r\n<br>\r\n\"Hey Neville? Would you mind trying this potion we created? It will give you some more confidence!\" John said to him.<br>\r\n<br>\r\n\"Yeah... It will make you feel great!\" Harry added.<br>\r\n<br>\r\n\"Oh alright... Considering I'm feeling bummed right now...\" he sighed, as he stood up and took the small bottle.<br>\r\n<br>\r\n\"You better remove your coat and shirt!\" John suggested.<br>\r\n<br>\r\nNeville removed the coat and tie, now only wearing his undershirt and shorts.<br>\r\n<br>\r\nHe took the bottle and removed the cap, placing it at his lips and drinking the entire contents of the bottle in one big gulp!<br>\r\n<br>\r\n\"Ahh... That tasted like orange juice!\" he said, as he handed the bottle back to John.\"So, how long does this last?\"<br>\r\n<br>\r\n\"Thirty minutes... If we made the potion right... We're just not sure...\" Harry sighed.<br>\r\n<br>\r\n\"Ohh wow... Well, hope it works... Uhh...\" Neville groaned, as he was overcome by a rumbling feeling coming from deep within his body.<br>\r\n<br>\r\nSuddenly, all his muscles stiffened up. Neville took a step back, not knowing what was happening to him. Then, every single muscle in his body started to inflate like a balloon! His calves grew bigger and rounder; his quads became wider and thicker; his arms thickened with muscle; his biceps hardened and bulged; his pectorals pushed outwards and sideways; his abdominal muscles became more defined and his torso widened suddenly... All at once!<br>\r\n<br>\r\n\"Look at him! It worked!\" John cheered.<br>\r\n<br>\r\n\"How do you feel, Neville?\" Harry asked his muscular friend.<br>\r\n<br>\r\n\"Wow! Holy smoke! I--- I...\" Neville gasped, as he flexed his arms, allowing big biceps to pop up on his arms. \"I feel strong!\"<br>\r\n<br>\r\n\"You should revert back to normal in a few minutes...\" John said, looking at his watch....<br>\r\n</span></div></div>",
            "created":1339477200,
            "id":1358246,
            "title":"Neville Longbottom (who was usually insecure)"
        },
        "1213111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Harry said ' Let us find Hermione. Maybe she can improve it.' ",
                "Harry said ' Let us go see Hagrid.  Maybe he will help. '"
            ],
            "content":"<div class=\"\"><div> <span>Neville sadly said ' I do not want to revert back to normal so quickly. Hopefully it would last the whole 30 minutes' John said in an understanding voice ' We will see. Maybe it will last more than a few minutes. Do a few more flex. Just enjoy it while you can. We can try to make more later.'<br>\r\n<br>\r\nNeville nodded and flexed it a few more times and felt the hardness of the biceps. Neville realized that it would be easier to fight trolls and werewolves in a fistfight, not just using a wand.<br>\r\n<br>\r\nAbout 23 minutes later, his biceps and other muscles slowly began to shrank back to normal. He was a little bit sad but was appreciative for the short lived privilege to have some muscles. Neville said to Harry and John  'Well, what is next?'  <br>\r\n<br>\r\nNeville tried to sound cheerful but he wasn't. Harry thought about either seeing seeing their intelligent classmate Hermione even though she was in Gryffindor. Or they could go see Hagrid, the half giant who also was the school Care of Magical Animals and Creatures Professor. Maybe he might know something too. Hagrid seem likable enough for  Harry and John.<br>\r\n<br>\r\n( I accidentally wrote Ron instead of John. I had to edit it back correctly. Sorry)</span></div></div>",
            "created":1345611600,
            "id":1410816,
            "title":"Neville returns to normal"
        },
        "12131112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "They find a skinny, young boy to give the formula to",
                "They find a skinny, young girl to give the formula to"
            ],
            "content":"<div class=\"\"><div> <span>Harry and John stared at the flask containing the formula which they worked so hard on that now only worked partially on their friend Neville Longbottom. It had made him muscular for only a few minutes, and then it reverted him back to normal.<br>\r\n<br>\r\n\"I think the formula needs some work...\" John sighed. \"But I don't know how to fix it!\"<br>\r\n<br>\r\n\"We can start with Hagrid! he can give us some suggestions!\" Harry announced, as the two boys then got up and started walking to Hagrid's room on the other end of the tower.<br>\r\n<br>\r\nWhen they arrived there, they knocked on the large wooden door using the metal knocker. They had to get on their toes to reach it, since the door was very high up. No wonder, since Hagrid was such a big guy after all!<br>\r\n<br>\r\n\"Come in!\" was the gruff voice that responded to the knock.<br>\r\n<br>\r\nJohn pushed the big, heavy, wooden door open as Harry held on to the glass bottle.<br>\r\n<br>\r\n\"Hagrid? Sorry for bothering you this afternoon... But, we created this potion in Professor Snape's class and...\" John began.<br>\r\n<br>\r\n\"A potion?\" Hagrid spoke up.<br>\r\n<br>\r\nThe boys approached the imposing oak desk and sat down on the two leather chairs.<br>\r\n<br>\r\n\"We created a muscle-growth potion, Hagrid, but it only works for a little while! Can you help us improve it?\" Harry asked him.<br>\r\n<br>\r\n\"Very interesting! That would be a worthwhile endeavor!\" the giant man grinned, as he took the bottle and examined the strange contents. \"We should test it on someone short and skinny, just for fun!\"<br>\r\n<br>\r\nHagrid then poured a drop of the potion in another bottle, which had just water in it. Then, he grabbed several other bottles from a large, glass cabinet, which was located behind him, in his office. <br>\r\n<br>\r\n\"If you add some extract of herbs to the potion, you might increase the duration of the formula!\" he said to them. \"But you don't know that until you let someone else drink some of it! Can you create more of this potion for me?\"<br>\r\n<br>\r\n\"Yes! We have the recipe written down!\" Harry explained. \"I have it right here!\"<br>\r\n<br>\r\nHarry gave Hagrid a sheet of paper containing the ingredients to his potion and the instructions for creating the right mixture for the magic solution which would cause muscular growth in anyone who would drink from it.<br>\r\n<br>\r\n\"Wonderful! Just add thyme and cilantro extract, which are very common herbs and spices, and the effects of your formula should be extended tremendously!\"<br>\r\n<br>\r\n\"Sweet! Thank you, Master Hagrid!\"  Harry smiled.<br>\r\n<br>\r\nHagrid supplied some extract from the spices in a separate bottle, before mixing them with the original formula in the flask that the boys had given them. Then, he wrote down the modified formula on their sheet of paper. <br>\r\n<br>\r\n\"Now, go find someone to grant bigger muscles to and try it out!\" Hagrid grinned. \"Then, tell me if it worked or not!\"<br>\r\n<br>\r\n\"Thank you, Hagrid!\" John and Harry smiled, as they got up and left the room with the flask containing the newly improved muscle potion and the sheet of paper with the modified formula.<br>\r\n<br>\r\n\"Awesome! First, we test this on a few people! Then, we make more if this!\" John smiled.<br>\r\n<br>\r\n\"Yes, but first...\" Harry said. \"Who shall we test this on?\"<br>\r\n<br>\r\n\"We need to find the shortest, smallest, and weakest person in Hogwarts to give the formula to! Maybe a boy and a girl?\"<br>\r\n<br>\r\n\"Let's go and find our victims!\" Harry smiled, as they wandered around the halls of Hogwarts for two lucky people to muscle up...<br>\r\n<br>\r\n</span></div></div>",
            "created":1355461200,
            "id":1488014,
            "title":"Harry said ' Let us go see Hagrid.  Maybe h..."
        },
        "121311121":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Sure I will take a drink.'",
                "But I want some Pepsi instead.'"
            ],
            "content":"<div class=\"\"><div> <span>Harry and John commented that Hagridt knew a lot of Potions in spite of him being the Care of Magical Creatures and Animals Professor. John commented that it was neat having Hagrid in a custom-made office now. They did not have to go out to his large hut out in front.  Even though Hagrid was not a giant but a half giant can have its own advantages and disadvantages.<br>\r\n<br>\r\nBut now both Harry and John was searching for someone to test it, they almost went back to Neville again. But this time, they wanted to find someone new.  John suggested going back to their Ravenclaw Common Room to see if anyone was there. When they arrived back, they found a skinny 2nd year boy named Wally Wimble. And he looked weak- smart, yes, but weak.<br>\r\n<br>\r\nHarry said 'Hello Wally, Do you want to try a new drink, it is a nutritious drink--Good for your Health.' John simply nodded.<br>\r\n<br>\r\nWally said ' Well, I am thristy.________'</span></div></div>",
            "created":1355634000,
            "id":1489262,
            "title":"They find a skinny, young boy to give the formu..."
        },
        "1213111211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Growth spurt! Wally gains 50 pounds of muscle!",
                "Wally grows more muscular AND a foot taller as well!"
            ],
            "content":"<div class=\"\"><div> <span>\"Wally!\" Harry said to the boy. \"We created this cool, new drink, and... We needed someone to test it for us!\"<br>\r\n<br>\r\n\"Yeah... To see if it worked...\" John added.<br>\r\n<br>\r\n\"Ohh...\" Wally smirked, as he glanced at the bottle containing the weird liquid. \"So... I'm some kind of Ginuea Pig?\"<br>\r\n<br>\r\n\"Test Subject is a better word!\" John responded.<br>\r\n<br>\r\n\"Or... Two words, rather.\" Harry corrected.<br>\r\n<br>\r\n\"You guys aren't gonna make me drink something that will kill me or make me sick, right?\" Wally wondered.<br>\r\n<br>\r\n\"No! No-no-no-no!\" Harry assured him. \"Not at all!\"<br>\r\n<br>\r\n\"Wally! On the contrary! This potion will make you feel strong!\"<br>\r\n<br>\r\n\"Super strong!\"<br>\r\n<br>\r\n\"Super-duper strong!\" John confirmed.<br>\r\n<br>\r\n\"Ohhh Really?\" Wally said, as he took the bottle in his hand and unscrewed the cap. He took a whiff from the top of the bottle.<br>\r\n<br>\r\n\"This will inflate your muscles!\" Harry grinned. \"Go ahead and drink it!\"<br>\r\n<br>\r\n\"Ohh... what do I got to lose? Bottoms-up!\" Wally sighed, as he placed the bottle against his lips and gulped down the contents in one big gulp.<br>\r\n<br>\r\n\"Ahhh... That wasn't bad!\" he smiled as he handed the empty bottle to Harry.<br>\r\n<br>\r\n\"Uhh Wally, you better take off your shirt!\" John suggested.<br>\r\n<br>\r\nWally then pulled his t-shirt over his head and held it in his hand, revealing his skinny, slender chest and torso. He had skinny short arms and legs with no muscle at all.<br>\r\n<br>\r\n\"Now what?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1355634000,
            "id":1489283,
            "title":"Sure I will take a drink.'"
        },
        "12131112112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Wally says \"I need bigger clothes!\"",
                "Wally says \"I'm really hungry now!\" and grows even MORE after he eats!"
            ],
            "content":"<div class=\"\"><div> <span>Harry and John just stared at Wally; all three of them standing in the large Common Room which was located near the entrance to Ravenclaw House. Wally had just removed his shirt, so he was starting to get uncomfortable. <br>\r\n<br>\r\nJohn and Harry couldn’t help but feel sorry for the second-year Hogwarts student who was standing before them. Wally didn’t look very impressive. He was skinny and short, with short black hair and boney legs and arms. He didn’t have any muscle on him at all. Even though Wally seemed to be very smart and aced all his tests in all his classes, he was never picked to play on the Quidditch team because he was too slow and too weak. <br>\r\n<br>\r\nPoor Wally started to become awkward, standing there in the large room without his shirt on while Harry and John were staring at him.<br>\r\n<br>\r\n“Okay, this is getting really awkward… Is something supposed to happ---“he said, when he suddenly leaned forward, groaned loudly and placed both hands over his abdomen! “Uuuuurrrrhhh!!”<br>\r\n<br>\r\nNext, Wally made fists… Both hands, and extended both arms fully sideways, exposing his chest and torso completely so Harry and John could see all the changes. Every muscle in his body tensed up all at once! His face tensed up as well, as he let out a loud roar!<br>\r\n<br>\r\n“YYYYEEEEOOOOOOOORRRWWWWRRRRR!!!!” he growled out loud, as his pectorals ballooned outward and sideways, all at once, and his abdominal muscles grew into powerful ridges covering his flat stomach in a matter of seconds!<br>\r\n<br>\r\n“Look! Look at him!” Harry exclaimed, witnessing the amazing transformation.<br>\r\n<br>\r\nThen, Wally’s arms and legs began to expand in every direction, growing thicker, longer and becoming stronger, all at the same time! His legs lengthened considerably while his quadriceps expanded with multiple layers of mighty muscles, mushrooming out of his flesh. His calves suddenly blew up like pumped up balloons which were attached to an air pump, growing into powerful, mighty muscles the size of soccer balls. Thick mounds of concrete football-shaped lumps of muscle, divided by a deep crevice, formed over the back of his legs and below his knees.<br>\r\n<br>\r\nNext, his biceps and triceps inflated as his arms grew longer, keeping up with all his other muscles! Thick veins covered his arms and legs as big, round spheres of muscles filled out his arms, his legs, and his mighty, broad shoulders. He began to resemble a cross between a gymnast and a weight lifter and a bodybuilder as his longer legs and arms forced the boy to not only grow more muscular, but almost a foot taller as well!<br>\r\n<br>\r\nWhen the incredible growth spurt finally came to an abrupt ending, it left a huge, super-muscular young boy, standing in the middle of the Ravenclaw Common Room, with huge muscles covering his enormous body!<br>\r\n<br>\r\nWally finally relaxed his arms as he stood there, panting and gasping for air, following the most incredible growth spurt he had ever felt in his life! Huge drops of sweat poured down his face, as the hulking boy tried to make sense of what had just happened to him!<br>\r\n<br>\r\n“What… What happened?” Wally gasped, as he looked down at his amazing body. Towering almost 6 foot 4 inches tall, Wally almost lost his balance as he slowly too a step forward, feeling the need to adjust to his new weight, height, and size. “What… What have you guys done to me?”<br>\r\n<br>\r\nAs Wally raised his arms, he noted the large rows of bulging muscle on his arms and the thick muscles on his chest and legs. Wiggling the fingers and raising his arms caused biceps and triceps and forearms to flex as well. <br>\r\n<br>\r\nJohn and Harry slowly walked up to the boy, who was now towering over them by more than 8 inches in height!<br>\r\n<br>\r\n“Wow, Wally! Look who’s the big guy now!” Harry grinned, looking up to the muscle kid.<br>\r\n<br>\r\nWally looked down at Harry and John with a smile, for just a moment, until he realized that he was now faced with a new problem…<br>\r\n<br>\r\n</span></div></div>",
            "created":1355720400,
            "id":1489903,
            "title":"Wally grows more muscular AND a foot taller as ..."
        },
        "121311121121":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "chopping down some firewood for the cold winter.",
                "killing that pesky spiked dragon in the Forbidden Forest"
            ],
            "content":"<div class=\"\"><div> <span>Harry Potter laughed and replied ' You do not need to buy new clothes.  I have an idea.'  Harry opened a closet  where some school outfits was hanging.  First Harry looked at Wally and looked at one of the outfits.  Harry pulled out his wand and cast a spell on two of the outfits to make it grow to fit Wally's new size.<br>\r\n<br>\r\nHarry tossed the outfits to Wally and said 'Hey, try these on.' Wally caught it and tried it on. It fit almost perfectly. It was just slightly loose.  Wally smiled ' Hey, thanks guys. Is there anything I can do for you. I am fit enough to help.'<br>\r\n  <br>\r\nHarry and John pondered a moment and discussed it quickly. Harry  then suggested....</span></div></div>",
            "created":1356066000,
            "id":1492121,
            "title":"Wally says \"I need bigger clothes!\""
        },
        "1213111211211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "The boys run into Draco, just as Wally has another growth spurt!",
                "Wally grows bigger as soon as he returns to his room!"
            ],
            "content":"<div class=\"\"><div> <span>John and Harry took Wally into their bedroom which they shared at Ravenclaw house together. In fact, Wally had a room which was just down the hall from the two boys. Everywhere he went, everyone just gasped at his new bulk, since they were so used to seeing Wally as a short, scrawny kid. Now that he was big and buff, people had a lot more respect for him!<br>\r\n<br>\r\nWhen Wally walked back to Harry's room, he found the boys almost shivering from the cold.<br>\r\n<br>\r\n\"Man... We need more firewood, dude!\" John said to Harry. \"It's freezing in here!\"<br>\r\n<br>\r\n\"We should ask Hagrid!\" Harry sighed. \"He'll get us some more firewood for the fireplace.<br>\r\n<br>\r\n\"I dunno, Harry... Hagrid's so busy these days... It will take him three days to get us firewood! We'll freeze to death by then!\" John groaned.<br>\r\n<br>\r\nThen, both John and Harry turned and spotted Wally, who towered over them with his broad shoulders and his thick, muscular legs.<br>\r\n<br>\r\n\"Hey! Can't Wally do it?\" John asked.<br>\r\n<br>\r\n\"Do what?\"<br>\r\n<br>\r\n\"Chop down a tree in the woods outside and then bring us some firewood?\" Harry pointed out.<br>\r\n<br>\r\n\"Uhh... I guess so! I should be strong enough by now to carry an axe!\" Wally shrugged.<br>\r\n<br>\r\n\"Let's get an axe from the tool shed outside and get us some firewood!\" John stated. \"Hercules over here can then chop down a tree for us!\"<br>\r\n<br>\r\nThe three boys wandered out the door and walked out to the back yard, crossing the huge back lawn behind the Hogwarts castle. From there, they approached a small shed, located near the far end of the lawn. John opened the door of the shed, where he discovered a large assortment of equipment and tools, neatly bolted to a large metal rack on the wall.<br>\r\n<br>\r\n\"Oh! Here! Here's an axe!\" John said, pointing to the wooden handle which had a sharp metal blade on the other end.<br>\r\n<br>\r\nWally reached over with his two muscular arms, grabbing the handle and holding it with a firm grip, before lifting it off the metal hooks.<br>\r\n<br>\r\n\"Hmmmph!\"<br>\r\n<br>\r\n\"Is it heavy?\" John asked the muscle boy.<br>\r\n<br>\r\n\"A little... But I'm still strong enough to carry it!\" Wally smiled.<br>\r\n<br>\r\n\"Okay! Let's find us a nice tree to chop down!\" Harry suggested.<br>\r\n<br>\r\nThe boys wandered into the woods behind the tool shed, with Wally trailing behind, carrying the axe in his hands. The stopped before a tall, thin tree near the outer row of trees by the forest.<br>\r\n<br>\r\n\"Here we go! Chop it down and then chop it into small pieces!\" John ordered.<br>\r\n<br>\r\nWally set the axe down for a moment. Then he pulled his sweatshirt over his head.<br>\r\n<br>\r\n\"I don't want my sweatshirt to get all sweaty!\" the muscle boy said, as he tossed his sweatshirt at John. Removing the sweatshirt now revealed Wally's muscular chest and abdominal muscles. \"Here! Hold this!\"<br>\r\n<br>\r\nWally then lifted the axe by the handle and started to swing it, with the blade pointing towards the stump of the tree, as hard as he could.<br>\r\n<br>\r\nTHUNK!  THUNK!  THUNK!  THUNK!  THUNK!<br>\r\n<br>\r\nWith every swing, the groove in the side of the tall, narrow tree got deeper and deeper! Wally started breaking out in a sweat as he worked his bulging muscles. After two-dozen swings of the axe against the side of the tree, the groove in the tree had gotten deep enough, that it had now covered almost half the depth of the tree already! The tree started to sway a little, with every swing of the axe!<br>\r\n<br>\r\n\"Uhh... Wally... I think the tree is about to come down, big guy!\" Harry said.<br>\r\n<br>\r\nWally's neck, his face, and his bulging chest was now covered in sweat. He was panting briefly, like he had just come from a serious work-out in the gym! He set the heavy axe on the ground, before he casually walked over to the side of the tree. Then he extended his muscular arms and pressed up against the tree, letting out one more roar of victory.<br>\r\n<br>\r\n\"HHHHRRRAAARRHH!!!\"<br>\r\n<br>\r\nThen, with a mighty crash, the tree came falling down on one side, cashing down onto a large, open field!<br>\r\n<br>\r\n\"YES! I did it! I chopped down my first tree!\" Wally cheered, raising his mighty arms in victory.<br>\r\n<br>\r\nThen Wally took his axe and walked over to the tree, chopping it into four smaller pieces. He stacked the four pieces together before lifting them over his shoulders.<br>\r\n<br>\r\n\"I got your firewood!\" he smiled. \"Let's go home!\"<br>\r\n<br>\r\nThe three boys then turned around and walked back home, happy that they could light a fire in their rooms. And they didn't even have to bother Hagrid for the firewood now that they got their own muscle boy to get the firewood for them!<br>\r\n<br>\r\n</span></div></div>",
            "created":1356152400,
            "id":1492717,
            "title":"chopping down some firewood for the cold winter."
        },
        "12131112112111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Hagrid gives Wally some bigger clothes",
                "Hagrid has a spell for enlarging clothes"
            ],
            "content":"<div class=\"\"><div> <span>John, Harry and Wally walked back into the Hogwarts School, with Wally walking behind them carrying four large logs on his shoulder for the fire! It was such an impressive site seeing the big muscle boy hauling the big wooden logs on his large, broad shoulders! It was an amazing feat of muscular strength!<br>\r\n<br>\r\nOnce inside, Harry and John went ahead to their rooms as Wally carried the logs to the fire place in the main lounge at the reception hall of the Ravenclaw House. The fire had all but burned out and it was getting quite chilly in the room. So, Wally placed one log in the fire place while he set the other three on the metal rack next to it for future use. He then started lighting the log on fire, while John and Harry were busy walking towards their rooms.<br>\r\n<br>\r\nWhile John and Harry were walking down the hall, another door opened, and a boy wearing a white shirt and black pants came walking out. He had blond hair and blue eyes and a smirk on his face when he saw Harry approaching him.<br>\r\n<br>\r\n“Well, well… if it isn’t Harry Potter!” <br>\r\n<br>\r\nJohn and Harry looked up. <br>\r\n<br>\r\n“Oh… Hi there, Draco!” Harry said. “What brings you to the Ravenclaw House?”<br>\r\n<br>\r\n“Well, since you need to know, Potter… I was visiting with Neville, who is a friend! And I see that you were walking around with John over here! I heard that you two have been working on some sort of secret potion? Hmm?” he sneered.<br>\r\n<br>\r\n“Uhmm… Yeah… It’s some sort of a size-changing formula… We’re still… refining it…” John responded.<br>\r\n<br>\r\n“I see!” Draco replied, as he examined John and Harry from head to toe.<br>\r\n<br>\r\n“Well, you two certainly don’t look any bigger… Or smaller… So did you test it on anyone yet?” Draco asked them. “Because you are only allowed to test the portions you make on someone who lives within your own house! If you test it on someone outside of your house, then you are in violation of Professor Snape’s class rules and I must report your violation to him!”<br>\r\n<br>\r\nSuddenly, there was a tap on Draco’s shoulder, from behind.<br>\r\n<br>\r\n“Yes, Neville, what is it? I am talking to Potter! Don’t interrupt me!” Draco sneered.<br>\r\n<br>\r\nThere was another tap on his shoulder.<br>\r\n<br>\r\n“Didn’t you hear me? I said---“<br>\r\n<br>\r\nDraco turned around and found himself staring at a wall of muscles… Wally’s abdominal muscles!<br>\r\n<br>\r\nThen, a large hand reached down and grabbed hold of Draco’s shirt collar, lifting Draco off the floor and holding him suspended above the ground.<br>\r\n<br>\r\n“Are you bothering Harry and John?” Wally said to Draco in an angry, threatening tone, while holding Draco three feet above the ground.<br>\r\n<br>\r\n“What in blazes…. Who…. WALLY?” Draco stuttered, as he looked the giant muscular boy in the eye. “H-h-how d-d-did you get so b-b-big?”<br>\r\n<br>\r\n“John and Harry did this to me… And I LIKE it! Now…” Wally said, as he forcefully set Draco back on the ground… “Get out of here! GO AWAY!”<br>\r\n<br>\r\nDraco turned around and RAN…. Leaving John and Harry laughing out loud as Draco rushed down the staircase of the Ravenclaw House!<br>\r\n<br>\r\nJohn and Harry looked over at Wally. They were so proud of him. After all, the big boy was practically their creation!<br>\r\n<br>\r\n“Thanks, big guy! You were great in getting rid of that pest!” Harry smiled.<br>\r\n<br>\r\n“Oh it was easy!” Wally smiled as he flexed his mighty arms.<br>\r\n<br>\r\n“Let’s go to my room!” John suggested.<br>\r\n<br>\r\n“Sure… Uhh…” Wally groaned.<br>\r\n<br>\r\nJust then, John and Harry witnessed Wally as he experienced a small growth spurt! His biceps swelled a little more as his pectorals pushed out by another two inches! His calves inflated a bit and so did his quads! Wally suddenly looked a little MORE muscular than he was just a minute earlier!<br>\r\n<br>\r\n“Dude! Did you just get bigger?” John asked him.<br>\r\n<br>\r\n“Uhh… Yeah!” Wally replied. “I think so!”<br>\r\n<br>\r\n“Come! Let’s get some clothes from Hagrid!” Harry suggested.<br>\r\n<br>\r\nThe boys then ran down the hall to Hagrid’s office…<br>\r\n</span></div></div>",
            "created":1356757200,
            "id":1497720,
            "title":"The boys run into Draco, just as Wally has anot..."
        },
        "121311121121111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Wally has another growth spurt!",
                "Draco shows up and taunts Wally over his size!"
            ],
            "content":"<div class=\"\"><div> <span>Harry and John finally reached the office of the biggest guy at Hogwarts, other than their friend Wally, who was now towering over them at 6 foot 7 inches in height and over 300 pounds of pure rock-hard muscle.<br>\r\n<br>\r\nAll the hulking boy had to wear was a pair of shorts which were starting to get much too small for him, so they urgently needed to get him some bigger clothes.<br>\r\n<br>\r\n\"Come in!\" the gruff voice of Rubeus Hagris resounded from the large wooden door.<br>\r\n<br>\r\nThe boys opened up and spotted Hagrid sitting behind the large oak desk. The big man stood up, revealing his impressive bulk, standing a large 8 foot 6 inches tall, still over 2 feet taller than Wally.<br>\r\n<br>\r\n\"What have we here?\" Hagrid said when Wally finally entered the office.<br>\r\n<br>\r\n\"Hagrid... Here is Wally... Obviously, he's gotten bigger since you last saw him...\" Harry explained.<br>\r\n<br>\r\n\"No kidding!\" Hagrid cheered. \"Finally, a student at Hogwarts who knows whet it's like to be BIG!\"<br>\r\n<br>\r\nHarry got up and walked over to the muscular boy and practically enveloped him in a huge bear hug.<br>\r\n<br>\r\n\"Soon, you'll be as big as me!\" Hagrid grinned from ear to ear.<br>\r\n<br>\r\n\"Uhh, Hagrid... In the meantime... He needs something to wear!\" John said.<br>\r\n<br>\r\n\"No problem!\" Hagrid said as he walked to a big door behind his desk, which had shelves and shelves of clothing neatly folded behind him. \"I got tons of old clothes he can try!\"<br>\r\n<br>\r\nHagrid tossed a few shorts and slacks on the desk and Wally tried them on until he found something that fit him.<br>\r\n<br>\r\n\"Perfect!\" he smiled. \"This will work... Until the next growth spurt!\"<br>\r\n<br>\r\n\"We'll have more clothes waiting for ya!\" Hagrid said, pointing to the large closet. \"I got hundreds of articles of large clothing in here!\"<br>\r\n<br>\r\n\"Thanks, Hagrid!\"<br>\r\n<br>\r\nThe boys turned around and walked out, thanking Hagrid for his generosity.<br>\r\n<br>\r\nNo sooner had they left and returned to the Ravenclaw house, when...<br>\r\n</span></div></div>",
            "created":1358744400,
            "id":1513187,
            "title":"Hagrid gives Wally some bigger clothes"
        },
        "1213111211211112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "and threatened him to stop the namecalling.",
                "and tossed him on a high tree branch and continued on to the castle.."
            ],
            "content":"<div class=\"\"><div> <span><b> ( ooc: Let us not try to make Wally too big if that is OK)<br>\r\n</b><br>\r\n<br>\r\nHarry, Ron, and Wally haven't yet entered the the Ravenclaw room. They were excitedly talking about Wally's growth spurt. Wally spotted Draco at a distance and gave a slight moan said quietly said ' Oh no, Draco's coming'<br>\r\n<br>\r\nDraco was somewhat intoxicated from some beer he drank. Otherwise he may not have been that daring to the trio. His accomplice Crabb was with him that day. At first, Draco could not believe that Wally could have grown that big so soon But he still sneered at Wally saying some degrading things about his growth spurth in height. Draco continued on saying that he could just find some smaller Gryffindor or Hufflepuff student to pester. He said ' I could intimidate that Hermione mudblood or that insecure Neville Longbottom.<br>\r\n<br>\r\nAt first, Wally maintained his cool. But when Draco said ' Know what, Hagrid is an idiot' Wally grabbed Draco and picked him up by the collar. Draco was now hanging 4 feet in the air. By this time Crabb ran away in fear. Now, Draco was beginning to be scared. Now, Wally had some confidence </span></div></div>",
            "created":1358917200,
            "id":1515106,
            "title":"Draco shows up and taunts Wally over his size!"
        },
        "12131112112111121":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Hermione creates teleportation rings for Wally, Harry and John",
                "Hermione enchants a special necklace for Wally with teleport powers"
            ],
            "content":"<div class=\"\"><div> <span>Wally lifted Draco just above his head, making Draco's feet dangle almost five feet above the ground!<br>\r\n<br>\r\n\"You b-b-better p-p-put me down, you overgrown l-l-lug!\" Draco spat at him.<br>\r\n<br>\r\n\"I'm just protecting my friends! So, you need to stop calling them bad names!\" Wally shouted at Draco as he shook his body like a little rag doll while holding him up in the air with just one hand.<br>\r\n<br>\r\n\"Yeah, whatever... HIC!\" Draco groaned while half-drunk. \"You can't be everywhere at the same time!\"<br>\r\n<br>\r\nJust then Hermione came walking into the Ravenclaw lounge where she overheard the conversation while she spotted John and Harry standing on the other side of the room.<br>\r\n<br>\r\n\"You're disgusting! Get outta here!\" Wally growled as he threw Draco to the floor.<br>\r\n<br>\r\nDraco quickly got on his feet and stumbled out of the room while Hermione ran over to where Harry and John were standing.<br>\r\n<br>\r\nShe began to discuss an idea with them...<br>\r\n</span></div></div>",
            "created":1359262800,
            "id":1518068,
            "title":"and threatened him to stop the namecalling."
        },
        "121311121121111211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Harry runs into Draco in the Slytherin lounge...",
                "John runs into Draco in the cafeteria "
            ],
            "content":"<div class=\"\"><div> <span>Hermione had witnessed the entire exchange between Wally and Draco and she figured out a cool way to keep Draco on his toes.<br>\r\n<br>\r\n\"Guys!\" she said to the three boys, while standing in the center of the Ravenclaw Lounge. \"I got something for you!\"<br>\r\n<br>\r\n\"What is it?\" Harry asked her.<br>\r\n<br>\r\n\"This is a cool new spell I've been working on, but I think our big friend Wally over here can actually be my first test subject!\" Hermione grinned.<br>\r\n<br>\r\n\"Me?\" Wally wondered.<br>\r\n<br>\r\nHermione took one golden ring and three silver rings out of her pocket. <br>\r\n<br>\r\n\"Wally! Put this ring on your finger!\" she instructed the muscle boy. <br>\r\n<br>\r\nWally put the golden ring on his ring finger. As soon as he put it on, the ring got smaller so it fit nice and tight around his finger.<br>\r\n<br>\r\n\"Now, we wear the silver rings!\" Hermione said, giving Harry and John each one silver ring. She placed one silver ring around her own finger as well.<br>\r\n<br>\r\n\"Now, put our hands with the rings together!\" she said.<br>\r\n<br>\r\nAll four of them placed their hands on top of each other while Hermione used her other hand to wave her wand over their hands as she spoke a magical verse.<br>\r\n<br>\r\n\"Okay! The ones with the silver rings can summon the golden ring to appear before them in time of need!\" Hermione explained.<br>\r\n<br>\r\nHarry walked to the other side of the room and turned around.<br>\r\n<br>\r\n\"Wally, Come to me!\" he whispered.<br>\r\n<br>\r\nInstantly, Wally disappeared from where he was standing, and re-appeared again, standing right in front of Harry!<br>\r\n<br>\r\n\"Whoa!\" the big muscle boy exclaimed. \"You teleported me!\"<br>\r\n<br>\r\n\"It worked!\" Hermione grinned. \"John, Harry and I can teleport Wally when we need the big muscle-guy!\"<br>\r\n<br>\r\n\"Awesome!\" John smiled. He couldn't wait to run into Draco again...<br>\r\n</span></div></div>",
            "created":1359262800,
            "id":1518124,
            "title":"Hermione creates teleportation rings for Wally,..."
        },
        "12132":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "6 inch tall",
                "2 ft tall."
            ],
            "content":"<div class=\"\"><div> <span>Harry and John did not want to make a Muscle Growth potion. They feared that Snape or a bully could snatch it away from them. They both briefly imagined that it would be great if Hermione from Gryffindor got a hold of one. Harry smiled at what she could do to Draco Malfoy.  But she was in a different House and not in that particular class right now. Quickly they shook their head and concentrated the task at hand.<br>\r\n<br>\r\nJohn Lennon Sander focused on making the actual potion while Harry focused on making an antidote. They checked each other notes and progress to be sure that they are making both potions correctly. Being in Ravenclaw helped since most of them are book smart and can retain knowledge. After about 20 minutes of preparing the potions, both John and Harry was ready to test it.<br>\r\n<br>\r\nThey waved at the stern -faced Snape to let him know they were ready.<br>\r\nSlowly he walked over  and said - 'Remember, one of you need to drink the potion, I am not going to decide for you. If you do not decide I will reduce 10 potions from your house.<br>\r\n<br>\r\nQuickly Harry decided that he would be the one to drink it. Harry grabbed the potion before John Sanders said anything. Before the results occured, Harry told John  \"Remember , I am taking the greater risk.'  <br>\r\nJohn replied '...but you are going to experience the greater thrill'<br>\r\n<br>\r\nThe potion was successful as Harry Potter shrink down to </span></div></div>",
            "created":1337144400,
            "id":1338999,
            "title":"Harry and John create the shrinking potion"
        },
        "121322":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "I want to explore that mouse hole first.",
                "I want to see if I can sneak over and untie someone's shoelaces"
            ],
            "content":"<div class=\"\"><div> <span>Harry Potter said in a normal voice <b>WOW, it worked successfully, John!</b>  But John could not hear Harry due to Harry's much smaller size. So John knelt down to the floor to ask Harry if he was OK.<br>\r\n<br>\r\nJohn asked Harry ' Hey, are you okay Looks like the potion worked. '  Harry shouted at the top of his lungs ' Yes, this is cool!' and gave John a Thumbs Up signal to further show that him was OK. Harry meanwhile was looking around the classroom to see what he could do now: explore a mouse hole, untie a student/prankster 's shoelaces or simply stay put where it was safer.<br>\r\n<br>\r\nMeanwhile John waved to Professor Snape to see their successful experiment. When Snape came over, Professor Snape was totally surprised at how easy and well the boys managed the first part. Professor Snape actually smiled for a second before returning to his usual stern expression. Snape then simply said to both Harry and John.  ' You need to return Harry to his normal size first before I can give you two a grade.  ' Then Professor Snape returned to his desk.<br>\r\n<br>\r\nMeanwhile Harry had other ideas.  Harry motioned to John for him to kneel again. Harry had something to say. John thought that Harry was read to return to his normal size. John retrieved his potion so Harry could return his normal size. At least, that was what John thought. But Harry had something else on his mind. Harry shouted to John....</span></div></div>",
            "created":1338699600,
            "id":1351795,
            "title":"2 ft tall."
        },
        "1213221":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "found a  small bottle of a potion.",
                "found a silver key."
            ],
            "content":"<div class=\"\"><div> <span>Harry said to John <b> I want to explore that mouse hole first. Don't worry. I will be OK. If Professor ask where I am. Simply say that I shrank.</b> John nodded while he watched Harry scampered into the mouse hole. John held his wand in case Harry was in trouble in the hole.<br>\r\nMeanwhile Professor Snape was reviewing his notes and the other students' work.<br>\r\n<br>\r\nHarry looked around the mouse hole which seemed abandoned. He wondered if there was something interesting in it or not. Within a few seconds, Harry </span></div></div>",
            "created":1341723600,
            "id":1374284,
            "title":"I want to explore that mouse hole first."
        },
        "12132211":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Speed of 100 miles per hour and Increased Energy",
                "Tiger Transformation"
            ],
            "content":"<div class=\"\"><div> <span>Harry walked up to it to examine it. It was a blurry orange color. The writing on the bottle  seemed to written in Medieval English But Harry was not sure..  Since Harry was much smaller - 2 inches, it was hard to carry out of the hole. But Harry managed it. Harry did wonder where that mouse went during the day. He also wondered if the mouse was aware that the bottle was there or not.<br>\r\n<br>\r\nJohn saw Harry trying to carry the bottle and carefully picked them both up and went back to the work table. John placed the bottle on the table and placed Harry back on the floor. He then gave Harry the antidote to the shrinking potion. When Harry returned to normal, they both went to Snape's desk for a grade. Snape gave them merely passing grade for some strange reason. But they did not complain.<br>\r\n<br>\r\nHarry made sure to bring the mystery potion with him when they returned to their Commons. They wanted to know what was in the potion.  Harry noticed some smaller letters along with a few numbers under the title. John went through some potion textbooks to see if he could find what the potion would do if one drank it. After 15 minutes of research, John smiled and said ' Hey, I found the reference to this mystery potion. If one drink it, it give the drink temporary</span></div></div>",
            "created":1359867600,
            "id":1523444,
            "title":"found a  small bottle of a potion."
        },
        "121322111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "the boy in the room. (reserved for Rex/Scriptboy)",
                "the girl in the room."
            ],
            "content":"<div class=\"\"><div> <span>Neither Harry nor John really wanted to be the first to try out the drink unless nobody showed up with a hour in the House Commons Room. Fortunately someone did show up with a few minutes, both a boy and a girl. Harry and John decide to give their speed-enhancement potion to:</span></div></div>",
            "created":1360299600,
            "id":1527522,
            "title":"Speed of 100 miles per hour and Increased Energy"
        },
        "1213221111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "continue chapter - Ricky intro"
            ],
            "content":"<div class=\"\"><div> <span>John scanned the words on the page of the large, thick book which lay on the table before him. He could feel the excitement build as he read more and more about this weird potion, which was in the small bottle that Harry was currently holding in his hand.<br>\r\n<br>\r\n“Did you find anything at all?” Harry asked him, as he sat down next to his friend. Both boys sat at a table in the corner of the Ravenclaw Common Room, right by the fireplace.<br>\r\n<br>\r\n“Yes! I got it!” John cheered quietly. “I found it!”<br>\r\n<br>\r\nJohn pointed his finger at the text which explained the effects of the potion, the ingredients needed to create the potion, and how to make the potion stronger so that its effects lasted longer.<br>\r\n<br>\r\n“Harry! Look! This potion might only last for a day or so! However…” John read out loud, “When mixed with the right ingredients, the effects of this potion can be prolonged from just a few days to weeks or even months! Not only that, if you add stronger herbs and spices, the effects can last up to a whole year!”<br>\r\n<br>\r\n“A whole year?” Harry wondered. “But… What are the effects then?”<br>\r\n<br>\r\n“Depending on the mixture of three or four key ingredients, and the age, height, weight and body type of the person who receives the potion, that person’s metabolism is increased so high that he or she becomes filled with energy! The recipient of the potion gains the ability to move at increased speeds, especially if the recipient takes a small doze of the potion at the same time every day!” John read out loud. “The recommended dosage is one teaspoon mixed with a glass of cold water. An athletic person will gain the ability to run anywhere from fifty to over one-hundred miles per hour!”<br>\r\n<br>\r\nHarry almost dropped the bottle when he heard the last sentence.<br>\r\n<br>\r\n“Say WHAT!?”<br>\r\n<br>\r\n“You heard me! An athletic person will gain the ability to run anywhere from fifty to over one-hundred miles per hour!” John repeated.<br>\r\n<br>\r\n“But… But, John! That is insane! Can you imagine anyone running that fast?” Harry gasped.<br>\r\n<br>\r\n“Harry! We gotta give it to someone who likes to run! Somebody who’s active in sports!” John whispered back.<br>\r\n<br>\r\n“Yeah…” Harry said, as he looked up. There were constantly people walking in from the front door to the hallway which lead to the sleeping quarters. Everyone had to pass through the Common Room where John and Harry were sitting, so the location they had chosen to sit was excellent.<br>\r\n<br>\r\n“Let’s sit on the big couch, right between the front door and the hallway!” John suggested. “That way we can spot every single person coming into Ravenclaw!”<br>\r\n<br>\r\nHarry and John got up and sat on the long, comfortable couch, opposite the fireplace. They each grabbed a book to read and they occasionally looked up when the door opened and somebody walked in.<br>\r\n<br>\r\nAfter about ten minutes, Rachel, one of the girls had walked in. She was wearing jeans and a t-shirt and high heels. <br>\r\n<br>\r\n“Hi guys!” she smiled as she walked past John and Harry.<br>\r\n<br>\r\n“Hey Rachel! Do you like to go running?” John asked her.<br>\r\n<br>\r\n“Umm… Not really. I just go to the gym to lift weights!” she responded. “But, thanks anyway!”<br>\r\n<br>\r\nA few minutes later, Kevin came walking by. He was about to go outside, wearing a big backpack strapped around his shoulders.<br>\r\n<br>\r\n“Hey Kevin!” Harry shouted.<br>\r\n<br>\r\n“Hey, guys!”<br>\r\n<br>\r\n“What’s going on?” John wondered.<br>\r\n<br>\r\n“I’m going out!” Kevin replied. “Going camping for a few days in the woods. I just love the outdoors!”<br>\r\n<br>\r\n“Oh! Do… Do you like to go running?” Harry asked him.<br>\r\n<br>\r\n“No… I like to climb mountains and walk along trails!” Kevin replied. “No running for me!”<br>\r\n<br>\r\nThen Kevin turned around and walked out the door, with the big backpack strapped around the shoulders showing his sleeping bag and tent neatly packed up for the night under the stars in the woods.<br>\r\n<br>\r\n“Darn! I hope we can find someone in Ravenclaw who could try our super-speed potion! I would hate to have to give it to somebody in another house!” John grumbled. “There must be a few guys in our house who like sports or running or something!”<br>\r\n<br>\r\nThen, about five minutes later, it happened just like an answered prayer! The front door to the house opened up and a short, skinny boy walked in. He was completely drenched in sweat. He had short, spiky black hair and brown eyes. He was skinny but not too thin either. He seemed rather athletic. In fact, he wore black cleats, white long socks, black shorts and a white jersey with a number and a logo on it. Clearly, the boy had just come from playing soccer since he was holding a soccer ball in his left hand and an empty water bottle in the right.<br>\r\n<br>\r\n“Hey guys!” Ricky said as he walked up to the water cooler and filled it up with water. Then, he stood there, and drank from the bottle. He was clearly very thirsty!<br>\r\n<br>\r\n“Where did you come from?” John asked.<br>\r\n<br>\r\n“Soccer practice!” Ricky said. <br>\r\n<br>\r\nRicky’s full name was Richard, but since he was a first year student and among the youngest kids at Hogwarts, everybody called him simply Ricky. He was short but stocky, although he wasn’t exactly fat. He had some muscle on him, especially in his legs, most likely from all the running on the soccer field.<br>\r\n<br>\r\nThen Ricky sat down on the couch right between Harry and John. <br>\r\n<br>\r\n“Man… I’m so thirsty from running up-and-down that soccer field, I could drink a gallon of water right now!” Ricky sighed.<br>\r\n<br>\r\nHarry and John just stared at each other and gave one another huge smiles. <br>\r\n<br>\r\n“So, Ricky… Do you run a lot?” Harry asked him.<br>\r\n<br>\r\n“Why of course!” Ricky laughed out loud. “I’m always running! Why do you think I’m always feeling tired and wet and sweaty and stinky all the time?”<br>\r\n<br>\r\n“How about… How about we give you something that could make you run… FASTER?” John asked him.<br>\r\n<br>\r\n“Uhh… How much faster?” Ricky wondered.<br>\r\n<br>\r\n“A LOT faster!”<br>\r\n<br>\r\nRicky stared at the two boys in complete disbelief.<br>\r\n<br>\r\n“You’ve got to be kidding, right? This is a joke, right?”<br>\r\n<br>\r\n“Give me your water bottle!” Harry said calmly.<br>\r\n<br>\r\nRicky handed Harry the bottle which was still mostly full of cold water.<br>\r\n<br>\r\n“But… Why are you guys doing this? What are you guys gonna gain from this?” <br>\r\n<br>\r\n“We found this cool potion that raises your metabolism and makes anyone who drinks it able to run at great speed, up to one-hundred miles per hour! But, we have never tested it before! So, we need someone who likes to run to test it for us!” Harry explained.<br>\r\n<br>\r\n“Not only that, but the potion is temporary so you have to come here and drink it every day around this time. We want to tweak the potion until we can create a version that lasts over a year, rather than just a day or just a few weeks!” John added.<br>\r\n<br>\r\n“So… You mean… If I drink it… I could be running really fast… For over a YEAR?” Ricky asked them.<br>\r\n<br>\r\n“Yeah, or even longer if you help us develop the potion!” Harry instructed.<br>\r\n<br>\r\n“Wow… I would be the fastest kid in Hogwarts…” Ricky pondered out loud. “I would be the fastest kid on the planet!”<br>\r\n<br>\r\n“You got that right, hot-shot!” Harry said, as he poured the contents of one-teaspoon of the potion in Ricky’s water bottle and then shook the bottle a few times so that the potion had enough opportunity to mix with the water.<br>\r\n<br>\r\n“Here! Drink up! All of it! Quickly!” Harry ordered, as he handed the bottle to the soccer player.<br>\r\n<br>\r\n“It… It’s not gonna hurt or make me sick or anything, right?” Ricky asked cautiously.<br>\r\n<br>\r\n“No! You got nothing to worry about! It will only make you do everything faster!” John laughed.<br>\r\n<br>\r\n“Oh okay…” Ricky said as he looked at the water bottle, which he was holding in his hands. “I guess this is my last moment of normalcy! Bottom’s up!”<br>\r\n<br>\r\nRicky closed his eyes as he craned his head backwards while placing the spout of his water bottle between his lips. He then started gulping down the cold water, which was mixed with the super-speed potion, which Harry had poured into the bottle just moments before. After a minute, he had finished every drop of water in the bottle!<br>\r\n<br>\r\n“Whew! I’m no longer thirsty!” Ricky said.<br>\r\n<br>\r\n“Well… Do you feel anything?” John asked the boy.<br>\r\n<br>\r\n“I got more energy! I feel more awake! I feel like I can do more things! I can do stuff faster!” Ricky said excitedly. “Like I just gulped down a really intense energy-drink!”<br>\r\n<br>\r\n“Let’s go outside and see how fast you can run!” Harry suggested.<br>\r\n<br>\r\n“Sure! But then I need to take a shower and study! I have math homework!” Ricky said sadly.<br>\r\n<br>\r\n“Dude! You’ll do everything really fast! Including your homework!” John laughed as the three boys walked out the front door of the Ravenclaw House. They stared out the courtyard and looked out over the road and the vast, expansive lawn before them. Far off in the distance, at the end of the road, they saw the mailbox at the gate to the entrance of the house.<br>\r\n<br>\r\n“Ricky! Go ahead and run to the mailbox and back!” John suggested. <br>\r\n<br>\r\n“Okay!” Ricky said as he turned around and started running. <br>\r\n<br>\r\nAt first, it seemed like he was running at normal speed. But as the seconds ticked off the clock, it appeared as if he was running faster and faster! Then, it seemed like Ricky arrived at the mailbox in no time at all! He opened the box and checked for mail before he ran back, this time increasing his overall speed again! This time he came back even quicker than before and appeared standing before Harry and John in just under ten seconds.<br>\r\n<br>\r\n“Wow! That was great!” Ricky said, as he ran about thirty yards to the mailbox in three seconds and he did not even seem tired.<br>\r\n<br>\r\n“Darn! That was fast!” John exclaimed.<br>\r\n<br>\r\n“We’ll test you again, after you had another dosage tomorrow!” Harry said.<br>\r\n</span></div></div>",
            "created":1360299600,
            "id":1527807,
            "title":"the boy in the room. (reserved for Rex/Scriptboy)"
        },
        "12132211111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Ricky uses his super speed in class the next day",
                "Ricky meets up with Harry and John for his second dosage the next day"
            ],
            "content":"<div class=\"\"><div> <span>Then the boys went inside where Ricky took his shower. Again, he ran into the shower and showered very quickly. Then he dried off and got dressed. Finally, he sat down at his desk and opened his math book and his notebook. When he took his pencil in his hand, he started writing the problems in his notebook. He noticed how he was writing much faster than before! Then, he started working the problems he had completed over 50 math problems in twenty seconds!<br>\r\n<br>\r\n“Oh man! I did all my homework in less than one minute! I like this!” Ricky grinned, since he now had the rest of the evening to watch TV and play video games before he went to sleep.<br>\r\n<br>\r\n</span></div></div>",
            "created":1360299600,
            "id":1527814,
            "title":"continue chapter - Ricky intro"
        },
        "121322111111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Ricky reads and writes.... at super speed in class",
                "Ricky goes to Gym class, and does everything faster!"
            ],
            "content":"<div class=\"\"><div> <span>Ricky lay in bed the following morning when the owl in the cage woke him up with its hoots. <br>\r\n<br>\r\n\"Uhhmmm morning already?\" the boy groaned, as he slowly got up and pulled the curtains away from covering the window, revealing the first rays of sunlight which illuminated the room.<br>\r\n<br>\r\n\"Great! Time to shower and get dressed!\"<br>\r\n<br>\r\nBut Ricky was no longer like any other ordinary student of the Ravenclaw House at Hogwarts School of Wizardry and Magic. No, thanks to Harry and John's potion, he was able to do everything much faster!<br>\r\n<br>\r\nRicky got out of bed and raced to the dresser at blinding speed. He opened the large drawers and pulled out his shirt, his socks, his underwear and he found his shoes. He tossed everything on the bed, which he made in a fraction of a second. Then, his body practically transformed into a blur as he ran out the bedroom and down the hall, beating out all the other boys in the House and being the very first in line for the showers. He turned on the water and showered, enjoying the nice hot water. He covered his body with soap at amazing speed, but he had to wait for the water to rinse him off. Once he was done, he leaped out of the shower and grabbed a dry towel and dried himself in just two seconds. Finally, he raced back into his bedroom, just as the other boys were barely making it into the bathroom. After another five seconds, Ricky was completely dressed, his teeth brushed and his hair combed, and he ran as fast as the wind down to the large dining hall, beating out everyone.<br>\r\n<br>\r\n\"Darn! I'm the first one here!\" he grinned, as he looked around the large, empty room. \"I get to pick the best seat, at the head of the table! Ha!\"<br>\r\n<br>\r\nRicky ran over to the large counter where food was being served, and he got his plate with pancakes and syrup. He also got his glass of juice and a bowl of fruit. He sat down and started eating, just as the other students from the Ravenclaw House started trickling down from the rooms.<br>\r\n<br>\r\n\"I like this! It only took me a few seconds to shower and to get dressed! Awesome! I do everything faster than everybody else!\" Ricky grinned, as he saw the other students come down and get their plates with food. <br>\r\n<br>\r\nThen, as he watched everybody come down and eat, he just kicked back and relaxed, as he waited for the time to come to go to class....<br>\r\n<br>\r\n</span></div></div>",
            "created":1362286800,
            "id":1542890,
            "title":"Ricky uses his super speed in class the next day"
        },
        "1213221111111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                " work on another potion for someone.",
                "try out the Tiger Transformation potion on someone."
            ],
            "content":"<div class=\"\"><div> <span>Ricky went to the Charms class where Professor Flitwick was teaching. In that class, he was explaining on how to leviate  things.  He was instructing them carefully to be sure that the students can perform the spells correctly. Ricky restrained from using his speed during that time. He managed to levitate a feather well. Professor Flitwick smiled at his succesful spell and said ' Great job, Rick. 10 Points to the Ravenclaw House.' <br>\r\n<br>\r\nThen it was time for the class to do their own individual study in the Thicker Texbook. Ricky tried not to read too fast but he could not help himself. He was reading it in superspeed. In fact, Rick read it through 3 more times to be sure that he retained what he learned. Then he started writing it in his quill. The quill actually broke once because he wrote too fast. The second time, Rick managed to slow down slightly due the the spell slowly wearing off. Finally, he wrote 10 pages of essay. Smiling, he dotted the final period when the bell rang for the class dismissal.<br>\r\n<br>\r\nRick met with Harry and John in the hallway after class. He wanted to know what they wanted to do later after school was over for the day. They met back in their common room looking at the Tiger Transformation potion. After some discussion, they decided to__________</span></div></div>",
            "created":1364274000,
            "id":1558089,
            "title":"Ricky reads and writes.... at super speed in class"
        },
        "1213221111112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "The Coach took Ricky out of the game!",
                "The boys from Slytherin used some magic of their own"
            ],
            "content":"<div class=\"\"><div> <span>Harry and John showed up for Gym class at the field, along with all the other student in their class. The students were all dressed in shorts and polo shirts displaying the emblem of their respective houses. Today was a great day for a football (soccer) game, and Coach Johnson had all the students get on to the field as he rolled several balls on to the field.<br>\r\n<br>\r\n\"Alright! Ravenclaw against Slytherin!\" the Coach shouted. \"Ravenclaw in red jerseys and Slytherin in black jerseys!\"<br>\r\n<br>\r\nAll the students were there except one... Suddenly there was a red and black blur... and Ricky appeared out of nowhere, running on to the field at super speed.<br>\r\n<br>\r\n\"Hi guys!\" Ricky grinned, as he appeared standing next to Harry out of nowhere.<br>\r\n<br>\r\n\"Ohmygosh! Ricky is playing for Ravenclaw! We will win for sure!\" John cheered.<br>\r\n<br>\r\nThe coach blew the whistle and the Ravenclaw boys started kicking the ball towards the Slytherin goal.<br>\r\n<br>\r\nSuddenly, Ricky charged towards the ball, kicking the ball towards the goal and then firing the ball into the goal so fast, that the Slytherin goalie didn't even have time to react! Suddenly, the goaly saw a blur... The ball was kicked passed him... he turned around... he saw the net move... and there was the ball... IN THE GOAL!<br>\r\n<br>\r\n\"GOALLLLL!!!!\" the boys from Ravenclaw cheered.<br>\r\n<br>\r\nRavenclaw scored within 8 seconds after the whistle was blown, thanks to Ricky!<br>\r\n<br>\r\n\"This is gonna be an easy game!\" Harry grinned.<br>\r\n<br>\r\n\"Yeah... very easy...\" John laughed.<br>\r\n<br>\r\nAll the Slytherin players just stared at each other, just dumbfounded. What happened? How could somebody run so fast?<br>\r\n<br>\r\nAfter 12 minutes, Ricky had scored 7 goals. The score was 7-0 for Ravenclaw.<br>\r\n<br>\r\nThen....<br>\r\n<br>\r\n</span></div></div>",
            "created":1364619600,
            "id":1561111,
            "title":"Ricky goes to Gym class, and does everything fa..."
        },
        "12132211111121":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "The game is tied, and the players go home.",
                "Ravenclaw wins, and Ricky is very happy after all. "
            ],
            "content":"<div class=\"\"><div> <span>Harry and John figured that the game was going to be a snap. The Coach of the Slytherin team, however, had other plans.<br>\r\n<br>\r\nDuring halftime, the Slytherin Coach walked over to the head referee  and started to complain about the Ravenclaw team having a player like Ricky, who was able to run so fast. He said that the Ravenclaw team had an unfair advantage and demanded that Ricky be removed from the game. The referee caved and demanded that Ricky be barred from playing the second half of the game.<br>\r\n<br>\r\n\"Guys! We can STILL beat them, even without Ricky!\" Harry told John and the rest of the boys. \"Let's show them who we are!\"<br>\r\n<br>\r\nThe boys played their hearts out and tried to play their best defense the whole time. The Slytherin players managed to score three goals in a row, when John was able to kick the ball away from their own goal on the fourth attempt of the Slytherin players to score. The game got more intense, but Ravenclaw refused to give up. In the meantime, Ricky was sitting on the bench, feeling angry and disappointed that he was not allowed to play because he was just too fast for the team! So, what happens?</span></div></div>",
            "created":1365829200,
            "id":1570963,
            "title":"The Coach took Ricky out of the game!"
        },
        "121322111111212":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "the dinky pub - The Hog's Head",
                "Honeydukes, a shop that sell sweets and other candies."
            ],
            "content":"<div class=\"\"><div> <span>Slytherin finally scored another goal, making the game 7 - 4. But the game was still in favor of Ravenclaw. During the last 5 minutes, one of the Slytherin players felt dehydrated and left the game. His substitute player filled in for him. Sytherin scored another goal, making it 7 - 5 in favor of Ravenclaw. <br>\r\n<br>\r\nThen Slytherin got too careless at the last 40 seconds. A player named Jerry scored for Ravenclaw. That boosted the confidence of Ravenclaw so much that they prevented Slytherin from scoring again.The game ended in victory for Ravenclaw.. The Ravenclaw teammates cheered for both Ricky and Jerry and went out to celebrate that weekend.<br>\r\n<br>\r\nThat weekend, they went to the town of Hogsmeade. Harry and John wandered the streets to see where to go first.<br>\r\n (go to <a rel=\"nofollow\" href=\"http://harrypotter.wikia.com/wiki/Hogsmeade\" target=\"_blank\">http://harrypotter.wikia.com/wiki/Hogsme...</a> for more reference if you wish to learn more. My two choice is taken from the link.).  </span></div></div>",
            "created":1365915600,
            "id":1571804,
            "title":"Ravenclaw wins, and Ricky is very happy after a..."
        },
        "1213221111112122":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "The boys try out some chocolates when Hermione walks in",
                "The boys try other favors when Draco walks in"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, do you guys want to go to Hogsmeade?\" Harry asked John and Ricky. \"We can go by the candy store at Honeydukes if you like!\" <br>\r\n<br>\r\n\"Oh! Let me go check out what they got!\" Ricky said, before he changed into a blur and raced over to the town at super speed. <br>\r\n<br>\r\n\"Wait! Oh darn he's fast!\" John sighed. \"We're supposed to give him his final dose of the super speed potion tonight!\"<br>\r\n<br>\r\nWithin a second, Ricky appeared standing next to John. <br>\r\n<br>\r\n\"Oh yeah, I need my potion tonight!\" The fast boy said. <br>\r\n<br>\r\n\"Are you sure you want to give him one more dose of it?\" Harry asked. \"He can already run at super speed!\"<br>\r\n<br>\r\n\"If my calculations are correct, this final dose will make him so fast that he'll be able to teleport anywhere he wants to!\" John announced as he pulled the small vial out of his jacket.<br>\r\n<br>\r\nBefore Harry could say anything, Ricky grabbed the vial and drank the last remaining potion in the vial, handing the empty vial to John. <br>\r\n<br>\r\nThen Ricky vanished right before their eyes!<br>\r\n<br>\r\n\"Where did he go?\"Harry asked.<br>\r\n<br>\r\n\"Right behind you!\"<br>\r\n<br>\r\nHarry turned around and saw Ricky standing behind him!<br>\r\n<br>\r\n\"See you guys at Honeydukes!\" Ricky grinned, before he vanished again.<br>\r\n<br>\r\nJohn and Harry walked over to Honeydukes where they spotted Ricky wandering around, sampling the chocolates. They decided what to get...<br>\r\n<br>\r\n</span></div></div>",
            "created":1366002000,
            "id":1572242,
            "title":"Honeydukes, a shop that sell sweets and other c..."
        },
        "12132211111121222":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Harry and his friends just ignored Draco's comments.",
                "Harry challenged Draco to a duel outside with their wands."
            ],
            "content":"<div class=\"\"><div> <span>Harry, John, and Rick was careful to just take no more than two samples of chocolate and other candies that interested them. They were not about to pig out on samples and make a bad impression on the store owner there.<br>\r\n<br>\r\nFinally, each one of them bought a  tiny bag of coconut/chocolate blend that was shaped like a wizard' s hat. They sat down at a nearby table and started nibbling on one of them. While they were trying the flavor of that that,  Draco walks in and saw them.  He gave them a mischievous grin and said  ' Hey you all,  If you eat that, OINK OINK OINK OINK. Your belly is going to get fat fat fat.'  Then he started laughing at them.</span></div></div>",
            "created":1367038800,
            "id":1579458,
            "title":"The boys try other favors when Draco walks in"
        },
        "121322111111212222":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Draco confronts Ricky at Hogwarts that evening",
                "Draco complains to Snape about Ricky"
            ],
            "content":"<div class=\"\"><div> <span>Harry tried at first to ignore Draco and his snotty, insulting comments, hoping that Draco would just stop teasing him, John and Ricky, but Draco just continued heaping the insults on top of each other.<br>\r\n<br>\r\n\"Why, these losers just come in here to buy candy so they can share them with all the other guys at Hogwarts, considering that nobody ELSE wants to be friends with them!\" Draco stated out loud, so that everybody in Honeydukes could hear it.<br>\r\n<br>\r\n<br>\r\nThis was the final straw for Harry, who had now heard enough.<br>\r\n<br>\r\n\"Alright, Draco! Enough!\" Harry shouted as he stood up and faced his rival. \"I'll duel you with my wand outside... Now!\"<br>\r\n<br>\r\nBoth Ricky and John gasped when they heard it. Harry rarely got angry but when he did... It meant business!<br>\r\n<br>\r\n\"Well, well, well... I guess Potter wants to play?\" Draco sneered, as he slowly got up, looking like he was in no hurry at all to walk outside. <br>\r\n<br>\r\nDraco slowly walked through the door of Honeydukes and pulled out his wand as Harry, John and Ricky walked outside after him. Then, Harry faced him with a slight grin on his face.<br>\r\n<br>\r\n\"Well, what are you waiting for, Potter? Pull out your wand, you idiot!\" Draco hissed.<br>\r\n<br>\r\n\"Oh... I don't need my wand for this!\" Harry grinned. \"I have the greatest trick ever!\"<br>\r\n<br>\r\n\"Oh yeah? Well, I'm getting old by waiting, Potter!\" Draco spat.<br>\r\n<br>\r\n\"Good! I can make Ricky disappear, without even using my wand!\" Harry grinned.<br>\r\n<br>\r\nRicky smiled. He knew what Harry was doing.<br>\r\n<br>\r\n\"Oh really? Well How about I send a lion to chase after the little twerp? That will also make Ricky disappear just as fast as you--\" Draco began, when Ricky suddenly vanished before his very eyes! \"HEY! WHERE DID HE GO???\"<br>\r\n<br>\r\nDraco looked around everywhere. Ricky was GONE!<br>\r\n<br>\r\n\"Where did he go? WHERE IS HE?\" Draco shouted.<br>\r\n<br>\r\n\"Right behind you, you doofus!\" Ricky said calmly.<br>\r\n<br>\r\nDraco gasped as he turned around and saw the boy standing behind him.<br>\r\n<br>\r\n\"HEY! How did you get behind me that quick--...\" Draco spoke when Ricky vanished again!<br>\r\n<br>\r\nDraco became angry and frustrated! He turned to face Harry, and pointed his wand straight at him.<br>\r\n<br>\r\n\"Okay! ENOUGH of this nonsense! Bring Ricky back or else I will turn you into a frog!\" Draco threatened.<br>\r\n<br>\r\nSuddenly, a white-and-blue blur flashed before Draco, a gust of wind followed it, and something fast... something REALLY FAST snatched Draco's wand out of his hand!<br>\r\n<br>\r\n\"MY WAND!\" Draco gasped, as he stared at his empty hand which was fully extended and still pointing at Harry.<br>\r\n<br>\r\n\"Are you looking for this?\"<br>\r\n<br>\r\nDraco looked up and saw Ricky standing next to Harry... with HIS wand in his hand!<br>\r\n<br>\r\n\"GIMME BACK MY WAND... YOU THIEF!!!!\" Draco screamed as he ran towards Ricky, who vanished again.<br>\r\n<br>\r\n\"HARRY! MAKE HIM STOP!!! RIGHT NOW!!!\" Draco cried out.<br>\r\n<br>\r\n\"You asked for it, Malfoy!\" Harry said calmly. \"You wanted trouble... You got trouble!\"<br>\r\n<br>\r\nRicky appeared standing next to John, tossing Draco's wand in the air and catching it with his hand.<br>\r\n<br>\r\n\"I'm going home. Meet me at Ravenclaw tonight if you want your wand back, Draco!\" Ricky said, before he vanished again.<br>\r\n<br>\r\n\"I have never been so HUMILIATED and INSULTED in my LIFE!\" Draco growled. <br>\r\n<br>\r\n\"Serves you right for all the insults you fired at US in Honeydukes, Draco!\" John shouted, as Draco turned around and started walking back to Hogwarts.<br>\r\n<br>\r\n\"Come on, I'm thirsty now!\" Harry said, as he and John went back inside. No sooner had they returned to Honeydukes, when Ricky popped up again.<br>\r\n<br>\r\n\"Hahaha! That was fun! I can use some lemonade now!\" Ricky grinned.<br>\r\n<br>\r\nJohn and Harry laughed as they sat at the table with their super-speed friend. <br>\r\n<br>\r\n\"Draco will be watching out for you now, speedy!\" John warned him.<br>\r\n<br>\r\n\"He can't do squat without THIS!\" Ricky said, pulling out Draco's wand.<br>\r\n<br>\r\nThe three boys laughed out loud, knowing they got Draco good that day...<br>\r\n</span></div></div>",
            "created":1367038800,
            "id":1579490,
            "title":"Harry challenged Draco to a duel outside with t..."
        },
        "1213221111112122221":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Ricky shows off his flying powers to Harry",
                "Ricky flies around the Hogwarts dining hall"
            ],
            "content":"<div class=\"\"><div> <span>When Harry got home after visiting Honeydukes, he went straight to bed since he was so tired. John was thinking about a new potion, and he went into the Ravenclaw lab in order to try out some mixtures. He got some new herbs and spices and mixed them with some other chemicals. Using the knowledge he gained from creating the super-speed formula which he had given to Ricky, he took notes and jotted down the ingredients and the results of the formula and its effects.<br>\r\n<br>\r\n\"Since Ricky can now run fast and teleport, all I need to do is just make small changes to this formula, and I could give him other cool powers as well!\" John realized. \"I have the basic foundation for super powers already, I just need to make small modifications and then I can create a formula to give anyone another cool superpower!\"<br>\r\n<br>\r\nJohn stayed up all night long while Ricky and Harry slept. Even the next day, while everyone was having breakfast, John was working hard in the lab.<br>\r\n<br>\r\nHarry and Ricky were eating breakfast in the large dining hall, when Harry prepared a plate with some peanut butter and jelly sandwiches for John. he gave the plate to Ricky.<br>\r\n<br>\r\n\"Ricky! Find out where John is and give him this for him to eat!\" Harry instructed the super-fast boy.<br>\r\n<br>\r\nRicky grabbed the plate and teleported to the rooms, the lounge, the patio, the classrooms, the library, until he popped up in the lab and found John, working on the new formula!<br>\r\n<br>\r\n\"There he is! Dude! You gotta eat!\" Ricky said, as he gave John the plate with the sandwiches.<br>\r\n<br>\r\n\"Ohh good... I was starving!\" John said, as he quickly wolfed down the food. \"I made you another potion! I want you to try it!\"<br>\r\n<br>\r\n\"What? Really? What does it do?\" Ricky wondered. <br>\r\n<br>\r\nJohn poured a glass of the red liquid from the beaker into a glass and presented it to the boy. \"Drink this! It will give you the ability to FLY!\"<br>\r\n<br>\r\n\"Are you serious?\" Ricky wondered. \"But... I can already run fast and teleport!\" <br>\r\n<br>\r\n\"I know! You're becoming the superhero of Hogwarts! So, drink it!\"<br>\r\n<br>\r\nRicky just downed the entire glass and put the glass down. <br>\r\n<br>\r\n\"Let's go outside...\" John said, as he opened the door to the lab. \"Now, leap into the air!\"<br>\r\n<br>\r\nRicky ran three steps and extended his arms before he took off, soaring through the air like a real superhero!<br>\r\n<br>\r\n\"Whaaaaaahh!\" he cheered, as the boy was flying through the air!<br>\r\n<br>\r\nRicky now flew a wide circle over Hogwarts, before landing in front of John.<br>\r\n<br>\r\n\"AWESOME!\" Ricky cheered. \"This is freaking awesome!\"<br>\r\n<br>\r\n\"Alright, Ricky! WHERE IS MY WAND!???\" someone shouted.<br>\r\n<br>\r\nRicky and John turned around and spotted Draco Malfoy staring at them, with an angry look on his face.<br>\r\n<br>\r\n\"Oh, hold on!\" Ricky grinned.<br>\r\n<br>\r\nSuddenly, Ricky disappeared, and popped up again, holding the wand in his hand. \"You want... THIS?\"<br>\r\n<br>\r\n\"GIMME THAT!\" Draco sneered as he ran towards Ricky and tried to snatch it out of his hand, but Ricky moved out of his reach.<br>\r\n<br>\r\n\"Over here!\" Ricky laughed, popping up a few yards away.<br>\r\n<br>\r\n\"GIMME MY WAND!\"<br>\r\n<br>\r\nThen Ricky leaped in the air and started flying over Draco's head.<br>\r\n<br>\r\n\"Better catch me!\" Ricky teased.\"John, go inside!\"<br>\r\n<br>\r\nThen Ricky tossed the wand to Draco, before he teleported away, leaving Draco very angry. Draco caught the wand just in time!<br>\r\n<br>\r\n\"I'll get you for this!\" Draco shouted, as he walked back to Hogwarts...<br>\r\n</span></div></div>",
            "created":1369276920,
            "id":1595359,
            "title":"Draco confronts Ricky at Hogwarts that evening"
        },
        "12132211111121222211":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Draco pushing Neville Longbottom into the lake.",
                "a dragon threatening a scared lost sheep"
            ],
            "content":"<div class=\"\"><div> <span>Ricky went to find Harry but Harry already left the dining room. Another student told Ricky that Harry was in a nearby garden practicing his broom flying. Ricky  walked to the garden and saw Harry flying his broom performing good moves for someone in his first year.<br>\r\n<br>\r\nRicky hollered out to Harry  <b>\"Harry, Hello, it is me, Ricky!!!' </b><br>\r\n<br>\r\nHarry could not hear Ricky at that moment. So Ricky stepped back 5 steps and starting running and then leaped into the air. Ricky was flying without the use of the broom. Ricky came up to Harry and waved. Harry was amazed at what he was witnessing.  Harry blurted out  ' Ricky, You're Flying...and no broom???'<br>\r\n<br>\r\nRicky said ' Yeah, John discovered another potion or something for me. Come on, let's do some flying.'<br>\r\n<br>\r\nHarry and Ricky  was having some fun flying in the air. Harry was on his broom and Ricky did not need one<br>\r\n<br>\r\nAfter some flying, Harry said ' I see something near that lake down there. Let us check it out' <br>\r\nThey flew there just in time to see<br>\r\n</span></div></div>",
            "created":1371058740,
            "id":1609808,
            "title":"Ricky shows off his flying powers to Harry"
        },
        "121322111111212222111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Ricky rescues Neville from the lake",
                "Harry uses his broom and wand to rescue Neville from the lake"
            ],
            "content":"<div class=\"\"><div> <span>Neville and Draco were standing at the edge of the pier over the small lake just outside of Hogwarts where they were arguing over the potions that John and harry have been making lately.<br>\r\n<br>\r\n\"Okay... I wanna know what John and Harry have been making! Didn't they give you a shrinking potion?\" Malfoy asked Neville Longbottom.<br>\r\n<br>\r\n\"No! I swear! I just tried one potion that gave me super strength and it wore off!\" Neville pleaded.<br>\r\n<br>\r\n\"Listen here you BIG BUFFOON!\" Draco growled as he grabbed Neville by the shirt collar. \"What OTHER potions have they made? Huh?\"<br>\r\n<br>\r\n\"I don't know! I swear! They gave them to Ricky!\"<br>\r\n<br>\r\n\"What kind of potions did they give Ricky?\" Draco hissed.<br>\r\n<br>\r\n\"Something about giving him super speed... and making him teleport... and making him fly... I dunno... I mean... You can see it! He runs super-fast and he flies and he teleports all over the place!\" Neville said sadly.<br>\r\n<br>\r\n\"WHY did they give all these potions to Ricky anyway?\" Draco interrogated Neville.<br>\r\n<br>\r\n\"Because he was so skinny and small... They decided to make him some sort of super-Ravenclaw-kid... I dunno!\"<br>\r\n<br>\r\n\"That's ALL you can tell me????\" Draco roared. \"You must be JOKING!!!! You are USELESS!\"<br>\r\n<br>\r\nWith that, Draco shoved Neville Longbottom off the pier and into the water before turning around and walking back to the schoolhouse while Neville remained splashing around in the water.<br>\r\n<br>\r\n\"HELP! HELLLLP! I CAN'T SWIM!!!!!\" Neville screamed as he splashed around in the water....<br>\r\n<br>\r\nRicky and Harry spotted the indident from a distance and they flew towards the lake...<br>\r\n<br>\r\n</span></div></div>",
            "created":1373237880,
            "id":1624421,
            "title":"Draco pushing Neville Longbottom into the lake."
        },
        "1213221111112122221111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "John and Harry start working on a new super-strength formula",
                "John and Harry started working on another new formula..."
            ],
            "content":"<div class=\"\"><div> <span>Ricky suddenly leaped into the air and flew over to the lake, just as he saw Malfoy walking away from the pier. Ricky was about to fly after him in anger, when another person's voice made him change his mind.<br>\r\n<br>\r\n\"HELP! HEEEELLLLPPPP!!!!\" <br>\r\n<br>\r\n\"Oh gosh darn... Neville!\" Ricky shouted, as he stopped flying after Malfoy and turned back towards the lake. <br>\r\n<br>\r\nHe spotted Neville splashing around in the water, gasping for air as he tried desperately to paddle his way back to the pier. Luckily, it was his mass that was keeping him afloat like a buoy.<br>\r\n<br>\r\n\"I'm here, Neville!\" Ricky shouted as he hovered above him before diving into the water.<br>\r\n<br>\r\nSuddenly, Neville felt two hands pushing against his back, forcing his body to float closer to the pier. Finally, after a few minutes, he got to the ladder, which he grabbed hold of quickly. Neville slowly climbed up the ladder, which was hard, since his clothes where soaking wet.<br>\r\n<br>\r\n\"Uhhh... I'm c-c-cold...\"<br>\r\n<br>\r\n\"Just get out and stand on the pier!\" Ricky ordered. <br>\r\n<br>\r\nAs soon as Neville made it on the wooden deck, Ricky appeared standing next to him. He took hold of Neville's hand, teleporting both of them back to the Ravenclaw House where Neville was able to take a nice, hot shower.<br>\r\n<br>\r\nHarry and John saw that the two boys had disappeared and they quickly ran into the house as well.<br>\r\n<br>\r\nOnce inside, John, Harry, and Ricky met up in the Ravenclaw lounge to discuss what Malfoy had done... In the meantime, John had started working on a new potion which he could only trust Ricky to test!<br>\r\n</span></div></div>",
            "created":1379640960,
            "id":1665906,
            "title":"Ricky rescues Neville from the lake"
        },
        "12132211111121222211112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Hear your thoughts",
                "Make you very popular."
            ],
            "content":"<div class=\"\"><div> <span>John and Harry worked on it for a couple of hours until they got a lucky break on an ingredient.  In the meantime, Neville went back to his House after the shower.<br>\r\n<br>\r\nHarry held up the potion to John.  \" I think that we made a new potion. We can find a volunteer later.\"<br>\r\n<br>\r\nJohn nodded.  The duo just made a potion that can</span></div></div>",
            "created":1379692200,
            "id":1666132,
            "title":"John and Harry started working on another new f..."
        },
        "121322111111212222111121":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Ricky teleports to Draco's room and hears his thoughts while hiding",
                "Ricky wanders around Hogwarts and hears someone's secret thoughts"
            ],
            "content":"<div class=\"\"><div> <span>John was working long and hard in the small room, which he and Harry had converted into their lab. They had beakers, measuring cups, numerous instruments, an old oven and a freezer at their disposal. They also had small trays in a closet containing hundreds of different herbs and spices and chemicals all stored in different bottles. These were the ingredients which were used to mix together and create new potions.<br>\r\n<br>\r\n\"Mixing these ingredients together will affect the neuro-sensors in the human brain... Depending on the ingredients and the mixure, this can do anything from making someone smarter to increase someone's senses!\" he reasoned.<br>\r\n<br>\r\n\"Let's do the safest.... We don't want to hurt anyone!\" Harry stated. \"We don't want to cause someone to go into a coma!\"<br>\r\n<br>\r\n\"Well, either this works... Or it doesn't... If I got my calculations right...\" John whispered as he studied the three different vials as they slowly poured their contents into one large plastic container. <br>\r\n<br>\r\n\"What is the expected result of this potion?\" Harry whispered.<br>\r\n<br>\r\n\"This increases a person's brainwaves... He or she then picks up the mental thoughts of other people within a few feet... So the person's brain becomes a receiver of thoughts coming from other people, like a portable radio!\" John grinned.<br>\r\n<br>\r\n\"Uhh... can he turn this on or off?\" Harry wondered.<br>\r\n<br>\r\n\"Not really... whover drinks this will hear the thoughts of the person standing close to him or her... There is no way of suppressing it...\"<br>\r\n<br>\r\nHarry let out a sigh. <br>\r\n<br>\r\n\"Okay... Who will test it?\"<br>\r\n<br>\r\n\"I was gonna give it to Ricky...\" John shrugged. \"It would interact well with his teleportation powers!\"<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\n\"He can hear when we think of him... Then he can teleport where we are in order to meet us!\" John reasoned.<br>\r\n<br>\r\nJust then, Ricky appeared out of nowhere.<br>\r\n<br>\r\n\"Hey!\"<br>\r\n<br>\r\n\"Dude! You wanna try a new potion?\" Harry asked him.<br>\r\n<br>\r\n\"Uhh sure... What does it do?\"<br>\r\n<br>\r\n\"It lets you read other people's thoughts... if it works!\" Harry explained.<br>\r\n<br>\r\nJohn handed Ricky the cup containing all of the new potion. Ricky closed his eyes and gulped down all of the potion in one big gulp.<br>\r\n<br>\r\n\"Ugh... This stuff tasted terrible!\" Ricky groaned as he handed the empty cup back with an ugly expression on his face. <br>\r\n<br>\r\nJohn and Harry just stared at each other without saying anything.<br>\r\n<br>\r\n\"So... What now?\" Ricky shrugged. <br>\r\n<br>\r\nSuddenly, Ricky started hearing voices in his head... John and Harry's voices... He was hearing their thoughts!<br>\r\n<br>\r\n\"You... What do you mean... Can I hear this... Can I hear what?\" Ricky suddenly said to Harry.<br>\r\n<br>\r\n\"IT WORKS!\" Harry cheered.<br>\r\n<br>\r\nRicky suddenly disappeared and popped up, right behind John.<br>\r\n<br>\r\n\"What are you doing?\" Harry asked him.<br>\r\n<br>\r\n\"I teleported behind John!\" Ricky smiled.<br>\r\n<br>\r\n\"Because he asked me to!\"<br>\r\n<br>\r\n\"He didn't say anything!\" Harry said out loud.<br>\r\n<br>\r\n\"But... I thought it!\" John laughed.<br>\r\n<br>\r\nThey grinned at the same time. Ricky could now hear their thoughts!<br>\r\n</span></div></div>",
            "created":1387140900,
            "id":1708095,
            "title":"Hear your thoughts"
        },
        "1213221111112122221111211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Draco spots Ricky in one of his classes",
                "Draco spots Ricky in the dining hall"
            ],
            "content":"<div class=\"\"><div> <span>A light was burning above the desk in the corner of a medium-sized bedroom which was located in the Slytherin Hall at Hogwarts. One boy was sitting there, writing in a notebook while reading through an old, thick book which sat on the old, wooden desk before him. <br>\r\n<br>\r\nThe boy looked up after there was a knocking on the door.<br>\r\n<br>\r\n\"Yes!\"<br>\r\n<br>\r\nIt was Montford, one of the other boys in the house.<br>\r\n<br>\r\n\"Draco! Do you have the notes from Professor Snape's class?\"<br>\r\n<br>\r\n\"Yeah! Why?\"<br>\r\n<br>\r\n\"I missed class today and I was wondering--\"<br>\r\n<br>\r\n\"Absolutely NOT!\" Draco hissed. \"You cannot copy MY notes! You may get them from somebody else or just tell Snape that you missed class!\"<br>\r\n<br>\r\n\"But... I let you copy my notes last week and--\"<br>\r\n<br>\r\n\"HUSH, ALRIGHT!\" Draco shouted as the blond boy rose up from his chair and marched over to the shorter boy.<br>\r\n<br>\r\n\"But...\"<br>\r\n<br>\r\n\"GET OUT! OUT! OUT!\" Draco shouted, as he shoved Montford out the door and slammed the door shut behind him.<br>\r\n<br>\r\n\"I'm not sharing my notes with ANYONE!\" Draco grumbled as he sat down on his chair.<br>\r\n<br>\r\nThe nerve of the guy! Draco was fuming. How dare they ask HIM for his precious notes? Next time he would write falso class notes and hand those out, just so they would get bad grades in class. That would show them!<br>\r\n<br>\r\nDraco was unaware that a figure had teleported into his room.<br>\r\n<br>\r\n\"Ohhhhh you EVIL BOY!\"<br>\r\n<br>\r\nDraco gasped as he turned around and saw Ricky standing in his room.<br>\r\n<br>\r\n\"Hey... What... How... How did you get in my room?\" Draco asked as he got up from the chair.<br>\r\n<br>\r\n\"Making false notes to give to the other students? That is so EVIL!\" Ricky shouted.<br>\r\n<br>\r\n\"I didn't say anything to you about me making false notes!\" Draco argued.<br>\r\n<br>\r\n\"No... But you were gonna do that next time Monford were gonna ask you for the notes to Professor Snape's class!\" Ricky responded as he leaned against the bed with his arms folded.<br>\r\n<br>\r\n\"WHAT? HOW DO YOU KNOW THAT?\" Draco screamed.<br>\r\n<br>\r\n\"I can teleport... And read your mind, Draco!\" Ricky responded calmly.<br>\r\n<br>\r\n\"WHAT! DON'T YOU DARE TELL ANYBODY!!\" <br>\r\n<br>\r\n\"Well you'd better behave from now on or else I'm gonna tell everybody about your--\" Ricky began, but Draco had already run towards him and tried to jump on top of him when Ricky had to teleport to get out of the way!<br>\r\n<br>\r\nDraco missed tackling Ricky and ended up landing on the bed!<br>\r\n<br>\r\n\"ARG! Where are you?\" Draco shouted.<br>\r\n<br>\r\nHe looked around and saw Ricky standing by the door.<br>\r\n<br>\r\n\"Over here!\"<br>\r\n<br>\r\nDraco got up and ran full-speed towards Ricky, only to crash into the large wooden door!<br>\r\n<br>\r\nCRASH!!!!<br>\r\n<br>\r\n\"Oaauuwwwww....\" he moaned, since every bone in his body was hurting.<br>\r\n<br>\r\nWhen he turned around, he saw Ricky standing by his desk, reading his notes.<br>\r\n<br>\r\nDraco quietly snuck up on Ricky before he reached over and wrapped his arms around Ricky's neck. For a moment it seemed like he had him! He had the smaller boy in a choke hold, when Ricky vanished into thin air!<br>\r\n<br>\r\n\"NOT AGAIN!\" Draco spat, as he realized he was holding on to nothing.<br>\r\n<br>\r\n\"Well, I gotta go, Draco...\" Ricky said, standing on his bed again. \"I'll pop in from time to time... Adios!\"<br>\r\n<br>\r\n\"COME BACK HERE YOU WIMP!\" Draco shouted as he jumped on the bed, only to see Ricky vanish before his eyes.<br>\r\n<br>\r\n\"I'll get you next time, you little twerp!\" Draco groaned...<br>\r\n<br>\r\n</span></div></div>",
            "created":1392244620,
            "id":1744763,
            "title":"Ricky teleports to Draco's room and hears h..."
        },
        "12132211111121222211112111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Draco orders his friends to spy on Harry and John",
                "Ricky tells Harry and John what Draco has done to him"
            ],
            "content":"<div class=\"\"><div> <span>Draco was about to leave his potions class when he spotted someone of interest enter the empty classroom. Draco quickly stepped into the storage closet near the back of the empty classroom as the boy walked in and sat down near the front of the room. What a golden opportunity!<br>\r\n<br>\r\nLike a lion stalking his prey, Draco peered through the opening of the storage closet door so he could see where the other student was seated. He quietly opened the door further and he managed to sneak out, walking up to the boy from behind. Then, he wrapped his arm around the boy’s neck while sticking a knife against the boy’s neck.<br>\r\n<br>\r\n“Okay dude… One peep and you’re DEAD, you hear me?” Draco hissed. “How did you get these powers? Why is it you can teleport, run and fly? And why can you read my mind?” <br>\r\n<br>\r\n“I… I drank… some… potions…” Ricky gasped, while Draco’s arm was tight around his neck. <br>\r\n<br>\r\n“WHO made these potions?” Draco shouted. “TELL ME!”<br>\r\n<br>\r\n“Harry… and… John…” Ricky uttered, just before Draco released his prisoner and stepped back from the chair where the boy was seated.<br>\r\n<br>\r\nIn an instant, Ricky turned around, picked up his bag, and he vanished!<br>\r\n<br>\r\n“Unbelievable!” Draco whispered. “I need to get someone from Slytherin to drink those potions!” <br>\r\n<br>\r\nDraco grinned with a smirk. <br>\r\n<br>\r\n“Someone like… ME!”<br>\r\n</span></div></div>",
            "created":1396834800,
            "id":1774433,
            "title":"Draco spots Ricky in one of his classes"
        },
        "1213221112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "she saw some antelopes running a race in the hills.",
                "she saw Draco steal someone's bag of lunch ."
            ],
            "content":"<div class=\"\"><div> <span>ooc: Hope my grammar and spelling are correct. :)<br>\r\n<br>\r\nHarry and John both helped themselves to some hot tea while they waited. Both of them were hesitating to tinker or modify the potion right now. Harry especially did not want anything to go wrong even if they did research right now. He felt uncomfortable even trying a modified version of it on a live human. But this potion was already approved for human use.<br>\r\n<br>\r\nThen George and Laura walked in. Laura was holding on to George's arm when they came in. Laura also had a slight limp as she walked. Laura smiled at George as she took a seat near Harry Potter. She replied 'Thank You, George, for walking me in.'  Draco was a jerk for pushing me aside like that and causing me to fall down. I do not want to keep you from your studies. Go ahead and go to the library. I will be OK here.'    George nodded as he left.<br>\r\n<br>\r\nHarry angrily to her said ' Is Draco still acting like a jerk. How dare he ! '  Laura said ' Relax, I already been to the Hogwarts Infirmary and Pomfrey treated me. It was successful that I was just there for maybe 15 minutes. I just need to take it easy for a few hours before I can starting jogging....I do like to jog a lot. It helps release my stress here.'<br>\r\n<br>\r\nHarry and John looked at each other and winked at the same time. John held out a potion and said 'This approval potion can help you with your speed---temporarily. Maybe you would like to enjoy being much faster temporarily.'<br>\r\n<br>\r\nLaura's face beamed in excitement. She exclaimed ' Yes, I realize that. It can make one gain an additional 50 to 100 MPH while running, depending on the strength of the potion. And it will last from about 3  to 6 hours too. One should not take more than 2 spoonfuls--otherwise there can be unfortunate side effects, espcially more than 3 spoonfuls.'<br>\r\n<br>\r\nJohn then replied ' Well, then one should not take more than 2 spoonfuls right now. Come on outside with us. We want you to take it. Besides it is a minor healing potion for slightly sprained ankles and tendons in the legs,<br>\r\n<br>\r\nSlowly they helped her out of the castle. Then outside, Laura smiled and said ' I am ready for my 1 spoonful. I want to be careful this time. ' Then they carefully pour the potion on her spoon and into her mouth. They they waited briefly to see if Laura felt any differently.<br>\r\n<br>\r\nLaura adjusted her school cap on her head and commented 'Well, it did taste like lemon juice but.....'  But, at the moment,  a gust of wind blew her cap off her head and sent it sailing down the long school yard. Laura said with a wink 'Guess I better get it back.. first, I better be sure to see if my shoes are tied....Yep, it is tied. Then she gave a wink and took off in a flash.' ZOOOM  <br>\r\n<br>\r\nLaura was running really fast now. John estimated that she was running about 75 mph. She retrieved her cap and placed it back on her head. And she had a big smile on her face. Then she noticed something far in the distance. Both of them were even farther from where she first started chasing her cap.</span></div></div>",
            "created":1360386000,
            "id":1528199,
            "title":"the girl in the room."
        },
        "12133":{
            "choices":[
                "Yes",
                "Next..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Harry and John create the potion of giant growth?</span></div></span></div>",
            "created":1347512400,
            "id":1426576,
            "title":"Harry and John ask Snape if they can pick anoth..."
        },
        "121332":{
            "choices":[
                "YES!",
                "Next..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Harry and John create a potion that is combined with the following two:<br>\r\n<br>\r\nPotion of Muscle Growth + Potion of Giant Growth = Potion of Muscle Growth Giant!</span></div></span></div>",
            "created":1347512400,
            "id":1426577,
            "title":"Next..."
        },
        "1213321":{
            "choices":[
                "Harry",
                "John"
            ],
            "content":"<div class=\"\"><div> <span>Snape was rather intrigued by the choice of the two students to create a potion that combines the effects of growth and muscular giant. - Well guys! If you can accomplish a remarkable way, will assign extra points to the house of Ravenclaw! - Having said that, Snape let Harry and John began to prepare the potion. Harry took care to prepare the potion of giant growth, while John miscelava that increase muscle. After both boys had finished their potions in small cauldrons, mixed them together in a pot of lead bigger. The potion was presented as a liquid, green and glowing. - I think the potion is ready! - John said as he poured a small portion of the infusion in a glass beaker. - You just have to decide who will try this brew! - Added Harry!</span></div></div>",
            "created":1356152400,
            "id":1492683,
            "title":"YES!"
        },
        "13":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Anger",
                "Sadness",
                "Shock",
                "Joy"
            ],
            "content":"<div class=\"\"><div> <span>Harry didn't really trust Draco Malfoy at all. He thought that he was a jerk. However Harry Potter wanted to trust the Sorting Hat...even though he did not like the idea of Slytherin being his house. The Sorting Hat told him that he could do great things in Slytherin. Even though Harry sometimes had a major disregard for the rules, Harry still wondered if he was a best fit in Slytherin.<br>\r\n<br>\r\nHarry almost said  'Anywhere but Slytherin' but finally decided to trust the Hat in spite of his personal feelings.<br>\r\nHe simply nodded and thought silently <i> If I am the best fit for Slytherin and that I could do well as a wizard, OK...are you sure?</i><br>\r\n<br>\r\nThe Hat shouted SLYTHERIN finally. Many students in the Hall was stunned and the rest of them were sad or mad. Only maybe 2 or 3 were perhaps happy about it.<br>\r\n<br>\r\nHarry Potter sat down next to another 1st year Slytherin boy, Crabb.  But Harry did not look at him. <br>\r\n<br>\r\nHarry glanced at Professor Snape. For a brief moment, Harry noticed the true reaction of Snape before Snape showed a poker expression on his face. The expression was one of:</span></div></div>",
            "created":1318222800,
            "id":1204134,
            "title":"Slytherin"
        },
        "133":{
            "choices":[
                "Ron: Gryffindor ",
                "Hermione: Ravenclaw",
                "Neville: Huffelpuff"
            ],
            "content":"<div class=\"\"><div> <span>Snape was not the only many of the instructors even Professor Dumbledore were shocked when the Sorting Hat placed Harry in Slytherin.  The Sorting continued with Draco Malfoy and as soon as the Hat touches Draco's head the it shouts out GRYFFINDON! which caused even more shock at the Slytherin table especially the boy sitting next to Harry who's mouth dropped open in surprise.  Next up was...</span></div></div>",
            "created":1387171260,
            "id":1708480,
            "title":"Shock"
        },
        "1332":{
            "author_id":"mindlessdog",
            "author_name":"Draxus",
            "choices":[
                "Ravenclaw",
                "Slytherin",
                "Hufflepuff"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ravenclaw or one of the other two?</span></div></span></div>",
            "created":1590855420,
            "id":2843235,
            "title":"Hermione: Ravenclaw"
        },
        "134":{
            "author_id":"robbie014",
            "author_name":"Sapphire",
            "choices":[
                "How can you smile, you are in Slytherin?  Good luck to you!",
                "Congratulations maybe some time we could hang out?",
                "I wanted to be in Slytherin Harry can you ask Snape to let me in?"
            ],
            "content":"<div class=\"\"><div> <span>After the sorting was complete Snape came over to Harry and patted him on the back and said \"you will do great things in this house Potter.\"  Snape winked and Harry felt that he was in the correct house and just maybe is life as a Slytherin would be fulfilling and good fortune would come his way.  Other Slytherin members came over and said hello to Harry and with sort of evil smiles welcomed him to their house.  Even Malfoy came over and look Harry up and down and said, \"well Potter, we may as well be friends if we are going to be in the same house.\"  \"Lets rule this place!\" <br>\r\n<br>\r\nHarry was now smiling feeling welcomed to his new house.  As the students headed back to their common rooms Hermonie came over to Harry looked him in the eye and said.......</span></div></div>",
            "created":1368334800,
            "id":1588546,
            "title":"Joy"
        },
        "1342":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "I  do not know yet. Ask me in a week.",
                "Maybe you could tutor me in the libray if I am struggling in Potions.",
                "(something else)"
            ],
            "content":"<div class=\"\"><div> <span>She did feel uneasy talking to Harry now since Harry was in Slytherin. But Hermione felt that Harry would remember her repairing his glasses on the train from Platform 9 1/2. She even said ' Hope your glasses are secure to your ultimate satisfaction. She tried to sound welcoming as possible to hm but not too friendly.<br>\r\n<br>\r\nHarry touched his glasses and said ' It is OK so far.'  Then he whispered in a low voice ' Thanks' <br>\r\n<br>\r\nHermione then said again to Harry  ' so how about hanging out sometimes'  Harry shuddered at what his fellow Slytherins might think of him. But Harry almost was beginning to like her. Harry paused a minute. Nobody seemed to be around except for a wandering cat that did not seem to be lost.<br>\r\n<br>\r\nThen Harry replied to her</span></div></div>",
            "created":1368575280,
            "id":1590058,
            "title":"Congratulations maybe some time we could hang out?"
        },
        "13422":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Vincent Crabbe staring at Harry curiously.",
                "Peeves the poltergeist writing on the wall."
            ],
            "content":"<div class=\"\"><div> <span>Hermione said ' That is fine with me. I like going to the library. You do know that Snape like to verbally ask questions to students in class to see how much he or she knows.'<br>\r\n<br>\r\nHarry was perplexed ' He does?'<br>\r\n<br>\r\nHermione: Yes, He does, especially to Gryffindors like me. But I could use a study partner now. Hope you do not mind studying with someone from another House.<br>\r\n<br>\r\nHarry:  I am not sure how much I could help but I will try<br>\r\n<br>\r\nThen Harry and Hermione sat at a nearby table to review the first chapter in Snape's main textbook. They even reviewed material from an article that Snape wrote in the Daily Prophet.<br>\r\n<br>\r\nHarry had to admit to himself that Hermione was smart and somewhat cute in her curly hair. He was learning much more from her than she was learning from him.<br>\r\n<br>\r\nSoon they realized that they spend a couple of hours in the library. Harry said to Hermione ' It may be time for me to go now. Snape must like you since you know so much about Potions already.'<br>\r\n<br>\r\nHermione sighed with a tear. ' I doubt it. For some reasons, he does not like Gryffindors at all.  If we can't be friends, I do not want us to be enemies.'<br>\r\n<br>\r\nHarry looked into Hermione's eyes. It showed an expression of worry.<br>\r\n<br>\r\nHarry replied ' I doubt that we will be enemies. I am learning a lot from you so quickly. I better be on my way back to my own Common Room.<br>\r\n<br>\r\nThen they departed from the library. When Harry arrived back into his Common Room, he saw_______<br>\r\n<br>\r\nIf our readers do not know who the two characters, they can check and read about them in Harry Potter Wiki.<br>\r\n<a rel=\"nofollow\" href=\"http://harrypotter.wikia.com/wiki/Vincent_Crabbe\" target=\"_blank\">http://harrypotter.wikia.com/wiki/Vincen...</a>  <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://harrypotter.wikia.com/wiki/Peeves\" target=\"_blank\">http://harrypotter.wikia.com/wiki/Peeves...</a></span></div></div>",
            "created":1370130000,
            "id":1601547,
            "title":"Maybe you could tutor me in the libray if I am ..."
        },
        "134221":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Did you go to the library with one of those dumb Gryffindors",
                "(He says something else)"
            ],
            "content":"<div class=\"\"><div> <span>Harry ignored him at first but Vincent continued to stare at Harry without saying a word. Finally Harry snapped at Vincent and asked him ' What is wrong, stop staring at me.'<br>\r\n<br>\r\nVincent then tried to  barely apologize for the staring. But Vincent said that he was beginning to be suspicious of Harry.<br>\r\n<br>\r\nHarry asked ' Why, this school year is barely just beginning. Why ?'<br>\r\n<br>\r\nVincent replied:</span></div></div>",
            "created":1373056380,
            "id":1623064,
            "title":"Vincent Crabbe staring at Harry curiously."
        },
        "1342211":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "I could find a better tutor for you in our own House.",
                "Well, don't get too friendly with her."
            ],
            "content":"<div class=\"\"><div> <span>Vincent replied \"Did you go to the library with one of those dumb Grffyfindors?\"<br>\r\n<br>\r\nHarry was annoyed at Vincent. He replied: I was with one but not a dumb one. It was one that knows a lot about potions. Do you want me to do well or NOT in Potions. It is NOT like she and I are going to be pals,\"<br>\r\n<br>\r\nVincent sighed. He was suspicious of Hermione. He replied</span></div></div>",
            "created":1389651420,
            "id":1727085,
            "title":"Did you go to the library with one of those dum..."
        },
        "13422112":{
            "author_id":"mindlessdog",
            "author_name":"Draxus",
            "choices":[
                "You are in Slytherin now",
                "Gryffindor can't be trusted"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Vincent sighs disapointedly. \"Well, don't get too friendly with her.\" Harry raises an eyebrow. \"Why not?\" Vincent smiles slightly, seeing an opportunity to manipulate Harry. He responds \"because...\"</span></div></span></div>",
            "created":1590855720,
            "id":2843238,
            "title":"Well, don't get too friendly with her."
        }
    },
    "info":{
        "author_id":"hawksoup",
        "author_name":"Moe",
        "brief_description":"Let us suppose that he was not in Gryffindor but in one of the other Houses? \r\n",
        "created":1314839160,
        "description":"<td align=\"left\" class=\"norm\">What if Harry was in another House at Hogwarts? What would life be like there? Let us be creative but remember that this is rated PG13 (not one of the R rated stories). So no sex. gore, incest, or foul language allowed in this one. Also please no transgender swap or gender transformation.<b> Animal transformation is OK</b>.Keep it similar to what you may have seen in the first 3 or 4 movies) Keep this one from a G up to a PG13. There are others with more liberal ratings to write if you wish. <b>Make this one more family friendly</b>. <b>Harry Potter, Ron Weasley, and Hermione Granger can not die</b>.  <span class=\"cindigo\"><b>Note: Muscle Growth is OK to use here. </b></span>  Since Harry is not in Gryffindor, he may or may not be friends with the canon friends from the book. But Harry should stay somewhat within his usual character. If I need more explanation, let me know. <br>\r\n(Adding new characters is OK if you wish)----- <b>Update: Please if you do use Height growth, make your character no bigger than Hagrid. He is a Half-Giant.</b>  Okay? :)<br>\r\n<br>\r\n( I do not own any of the Harry Potter characters and this is just for fun. No money is made in this roleplaying story)</td>",
        "id":1806774,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/101806.jpg",
        "last_full_update":1590855720,
        "modified":1590855720,
        "pretty_title":"A Different Harry Potter story"
    }
}