{
    "chapters":{
        "1":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Anthros",
                "Ferals"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You’re a 17-26 male and you’ve found yourself shrunken to 3 inches in TLK.<br>\r\n<br>\r\nWho would find you? Anthros or Ferals?<br>\r\n<br>\r\n(Note: Good chapters will be sent coins.)</span></div></span></div>",
            "created":1594870080,
            "id":2869430,
            "title":"Intro"
        },
        "11":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "TLK 1",
                "TLK 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright. Are you in TLK 1 or TLK 2?</span></div></span></div>",
            "created":1594870200,
            "id":2869431,
            "title":"Anthros"
        },
        "111":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Before ",
                "During"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pre or During Scar’s reign?</span></div></span></div>",
            "created":1594919820,
            "id":2869806,
            "title":"Before or During Scar’s kingdom."
        },
        "1111":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Pridelands",
                "Elephant graveyard ",
                "The Jungle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where have you found yourself shrunken?</span></div></span></div>",
            "created":1594920300,
            "id":2869816,
            "title":"Where are you?"
        },
        "11111":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Mufasa walking around the pridelands with Sarabi.",
                "Scar’s Den.",
                "A den full of sleeping lions but you’re trapped in a lioness’s palm."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You’re 3 inches and stuck in the pridelands. But who’s around you or where are you?</span></div></span></div>",
            "created":1594921380,
            "id":2869824,
            "title":"Pridelands"
        },
        "111111":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Yes. You make it and you’re standing right next to his rear.",
                "Nope. You don’t make it and you are right up against his smelly anus.",
                "Nope. You don’t make it and you’re trapped under his musky sack."
            ],
            "content":"<div class=\"\"><div> <span>You wake up from a long sleep and you are very hot almost as if you had slept outside in the hot sun. You open your eyes to see that it was exactly what happened!<br>\r\n<br>\r\nYou panicked and jumped up to see that you were on a mountain?! This seemed impossible as you looked around and saw it was most flat on top. You looked below and knew there was no way you could get down without falling and becoming a red stain upon the ground.<br>\r\n<br>\r\nYou watch the surrounding around the rock and see huge grass that were the size of buildings. You begin to figure it out. You’re surrounding weren’t giant.... you were tiny! You figured you at to be at least 2-4 inches. At this you began to panic more before you notice two ginormous creatures begin to walk up to the rock. They were humanoid lions! One was a muscled male that had golden fur with a bright auburn mane and a large cock that you could see peeking from his loin cloth that had a small satchel tied to it. The other was a dark tan lioness who also had a bit of muscle with large tits to match. You screamed out of fear and the female seemed to hear you. You quickly hid behind a stone. She looked around but could not find you. <br>\r\n<br>\r\nYou then heard the male speak. “Is something wrong, Sarabi?”.<br>\r\nThe lioness shook her head. “I thought I heard a high pitched scream coming from one of those two boulders. Must have been my imagination. Why don’t we sit down?”.<br>\r\n<br>\r\nThe male nodded his head and had a small smile. “Of course.”<br>\r\n<br>\r\n“They must be mates..” you whispered to yourself.<br>\r\n<br>\r\nYou see the lioness sit down upon the boulder next to yours and you gulp as you see the large male begin to sit on yours. You saw his gigantic ass and you could see his hot pink anus come upon you.<br>\r\n<br>\r\nCan you jump out of the way?</span></div></div>",
            "created":1595447040,
            "id":2873200,
            "title":"Royal Walk."
        },
        "1111113":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "“Don’t worry, Little one. I will not be hurting you.”",
                "“You caused this problem and now you must fix it. Get to rubbing!”",
                "“Perhaps a trip to my stomach will be in order.”"
            ],
            "content":"<div class=\"\"><div> <span>You look up at the male and see that most of your exits are blocked and you be either crushed under his meaty ass or stuck against his smelly anus. You certainly didn’t want that so you quickly jumped but you had failed to think that his ass wasn’t the only thing you had to worry about as you were soon squished by his hot and very musky sack and his large cock. The fur that covered his balls were covered in sweat and the sweat droplets fell upon your tiny form and made you smell of his musk.<br>\r\n<br>\r\nYou involuntary try to get up and you struggle against the sack for several minutes before you notice his large cock is now up and erect do to your struggling. Mufasa finally noticed the struggling and lifted up his sack and picked you up before you could run away. The male chuckled as he brought you up to his face. The blood drained from your face and you went pale as he sniffed at you. The female also looked at you with a curious expression before a smirk was shown upon her face.<br>\r\n<br>\r\n“Don’t kill me please! I didn’t mean to go under you! I wasn’t able to get out of the way!” You cried to the beast. <br>\r\n<br>\r\nThe male then smiled and told you..</span></div></div>",
            "created":1595559000,
            "id":2873912,
            "title":"Trapped under the musky sack."
        },
        "11111131":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "“I will have to mark you as mine. To let others know to not harm you.”",
                "“Let us get to know one another.”",
                "“It felt nice when you were struggling under my sack.”"
            ],
            "content":"<div class=\"\"><div> <span>The gigantic golden lion only smiled down upon your tiny form. “Do not worry, my little one. I will not be harming you.” He told you with a gentle smile that was meant to help calm you but as you looked at the large sharp teeth you felt a pit in your stomach.<br>\r\n<br>\r\nHe then brought you up to his nose as he held you with two of his long fingers. He sniffed at your tiny form. His nose almost seemed like it was about to suck you up like it was a vacuum. You knew he was sniffing up all of his musk from you being trapped under his sweaty sack. <br>\r\n<br>\r\nThe large beast then put on a stern expression which scared you but he comforted you by laying your tiny body on his large palm and he patted your small head with the top of one of his fingers. You looked at his sharp claws and knew he could just impale you with them if he had ever wanted to.<br>\r\n“Now. Tell me what brought you to my lands. I have never seen a creature like you come here.” He asked you.<br>\r\n<br>\r\nYou gulped before answering. “I have no idea, sir. I was at my home and I just woke up here. I didn’t mean to intrude. I am very sorry and I’ll leave.” You shakily told him.<br>\r\n<br>\r\nMufasa then smiled. “Call me Mufasa, little one. You are very welcome here and you do not have to worry about leaving. As I am the king of the lands, I shall make you my personal guest.” He told you with a proud smile.<br>\r\n<br>\r\nYou tried to speak but the words would not come out. He then showed you to his mate. She warmly smiled and looked upon your tiny form. “Call me Sarabi, little one.” She told you before she laid her palm down under Mufasa’s and motioned for you to climb down. You shakily did so and she let out a small chuckle. “Now what is your name?” She asked you.<br>\r\n<br>\r\nYou cleared your throat before speaking. “My name is Edgar.” You told her. At this he smiled and petted your tiny form. “You seem to be young, my little Edgar.” She told you. You nodded your head. She looked at your tiny form. “I’m very happy that you will be our guest. As a Queen it is my duty to take care of our guest and make him welcome.” She told you with a smile.<br>\r\nYou started to breathe fast before you looked up at her. Hopefully she wouldn’t take this the wrong way.<br>\r\n<br>\r\n“I-It’s alright. Please, there is no need for me to be your guest. I will try to find my way home. I do not wish to burden you.” You told her. “Please don’t be mad..” you muttered to yourself quietly. <br>\r\n<br>\r\nShe then looked upon you with a comforting expression. “Do not worry. You will be no burden and you will be a wonderful guest.” She told you with a smile. You couldn’t tell if it was an order or a request.<br>\r\n<br>\r\nSarabi looked at her mate who was also wearing a comforting smile. “We will take very good care of you.” He told you.<br>\r\n<br>\r\nMufasa then opened his satchel on his belt. “We need to get going since it is almost dinner time and Sarabi needs to lead the hunt.”<br>\r\nSarabi smiled as she petted your head one last time. “I will see you after the hunt and we can eat together.” She told you before slipping you in the pouch. You gasped as you fell into it and you wanted to yell wait as Mufasa closed the satchel leaving you in darkness.<br>\r\n<br>\r\nThe two then began walking home. After awhile they both get pack to pride rock and Sarabi with her hunting party leave. Mufasa takes you out of the satchel making you gasp and laid you on his palm once more as he sat down on his stone throne. There was a zebra hide covering the seat and the back of the chair for comfort.<br>\r\n<br>\r\nHe smiled upon you and sits you on his large muscled thigh. You can smell his musk from there.<br>\r\n<br>\r\nHe then looks upon you with his large smile.</span></div></div>",
            "created":1597336380,
            "id":2885089,
            "title":"Gentle Giants."
        },
        "11111133":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Nope. He decides you’re his snack.",
                "Yes. But you now have to be his sex pet.",
                "He gives you over to Sarabi and let’s her decide."
            ],
            "content":"<div class=\"\"><div> <span>The gigantic beast had a large grin as you were in his grasp, pale and terrified. <br>\r\n<br>\r\n“You have touched the kings royal sack and I believe a trip to my stomach will be in order, little one. You have not only decided that you wanted to touch my warm sack it appears you have also been living in my lands without my knowledge. How do you plead?”<br>\r\n<br>\r\nThe started to cry and you yelled at the beast. “Please, no! It’s not like that! I couldn’t move out of the way and I just woke up here and I have no idea how I got here! Please don’t eat me!”<br>\r\n<br>\r\nThe lion looked at you quizzically before he began to rub his chin in thought.<br>\r\nDoes he believe you?</span></div></div>",
            "created":1595647980,
            "id":2874495,
            "title":"Snack or Salvation?"
        },
        "111111331":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "content":"<div class=\"\"><div> <span>“I have decided that you are not telling the truth. Therefore I will be eating you. But do not worry too much as I will just swallow you.” The lion told you as he made up his mind.<br>\r\n<br>\r\nYou began to cry and plead but he only ignored you before he opened his hot maw and brought you up to it. Strands of saliva covered the insides of his maw as he opened it and you could feel the immense heat.<br>\r\n<br>\r\nHe then threw you into it and closed his maw surrounding you in darkness. The smell was horrible. It was a combination of morning breath, rotten meat and a little bit of blood. His tongue licked at your tiny naked body as you cried and pleaded once more. He chuckled as he licked you all over covering you in his smelly saliva. The King then swallowed his prey. You screamed as you were forced down the dark smelly throat. You were still alive and he could feel your squirming in his stomach. He smiled and patted his muscular stomach before turning back to his  mate and continued discussion while you were being digested. You were now just going to become some of the king’s muscular ass fat.</span></div></div>",
            "created":1595648580,
            "id":2874499,
            "title":"Nope. He decides you’re his snack."
        },
        "12":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Pre and in Pridelands",
                "During and in Pridelands",
                "Pre and in elephant graveyard ",
                "During and in the jungle with Timon, Pumbaa and Simba.",
                "Right after but before TLK 2, in Pridelands."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright. Is this pre Scar’s reign or during? And are you in the Pridelands or Elephant Graveyard?<br>\r\n</span></div></span></div>",
            "created":1595423280,
            "id":2873068,
            "title":"Ferals"
        },
        "121":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "On a rock that is about to be passed by Mufasa and Sarabi taking a walk.",
                "You’re at the watering hole with a young Simba, Nala and Zazu,",
                "Scar’s Den."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you find yourself tiny?</span></div></span></div>",
            "created":1595424720,
            "id":2873076,
            "title":"The Mighty Pridelands."
        },
        "1212":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Simba",
                "Nala",
                "Zazu"
            ],
            "content":"<div class=\"\"><div> <span>Your morning began when you abruptly woke up from your slightly uncomfortable slumber and found yourself aching in pain with a giant headache. You weren't sure exactly what caused it; maybe it was the cheesecake you ate before bed that was just slightly off or maybe it was the drinks that made you oh so ever tipsy after drinking too much of it. It didn't matter anyway because as you regained consciousness, your eyes send a signal to a brain prompting a new question you needed to answer.<br>\r\n<br>\r\n<i>\"Where the heck am I?\"</i><br>\r\n<br>\r\nYou were definitely sure you weren't hallucinating but you saw yourself stare into a large lake, surrounded by tall grass and jagged rocks alongside some of the edges. Soon, your body began to notice the intense humidity that resonated in your body; it was fricken hot! However, that alone wasn't the strangest occurrence that you noticed while all of this was happening. You looked around your surroundings and immediately noticed that everything around you was massive compared to what you were used to. Tall blades of grass partially obstructed your view of the area and the fish you saw swimming in the water were almost the same size as you.<br>\r\n<br>\r\nUnfortunately for you, there was no time to think as to the left of your position, three certain animals were hanging out and drinking water from the watering hole... and one of them just happened to spot you. But who?</span></div></div>",
            "created":1595426520,
            "id":2873080,
            "title":"The Watering Hole"
        }
    },
    "info":{
        "author_id":"insanehatter",
        "author_name":"InsaneHatter ",
        "brief_description":"You’ve found yourself shrunk in TLK. Who will find you?",
        "created":1594869900,
        "description":"<td align=\"left\" class=\"norm\">You’re a male ages 17-26 and you find yourself shrunken at 3 inches  in the Pridelands or Outlands.<br>\r\n<br>\r\nAll characters from TLK can find you shrunken. Male or Female.<br>\r\nThere will be a choice in the beginning for if you want feral or anthro.(anthros are tribal.)<br>\r\n<br>\r\nFetishes that are very welcome: Scat, piss, All Vore, farts, paws, musk.<br>\r\n<br>\r\nFetishes that are not welcome: balloons, slime, absorption and other fetishes like that.<br>\r\n<br>\r\nI would not prefer death but it is allowed but only after a long series of chapters.<br>\r\n<br>\r\nMacros may be nice or mean. Pridelanders could be more maternal/paternal or loving if they decide to adopt your tiny form as a pet or cub while the hyenas or the outlanders could be more sexually devious.<br>\r\n<br>\r\nChapters must he at least a paragraph. It keeps the story nice to read and interesting.<br>\r\n<br>\r\nHave fun!</td>",
        "id":2226952,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597336380,
        "modified":1597336380,
        "pretty_title":"Shrunk in The Lion King"
    }
}