{
    "chapters":{
        "1":{
            "author_id":"yusih2e",
            "author_name":"dinosaurs are awesome",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or Female?</span></div></span></div>",
            "created":1360105620,
            "id":1525202,
            "title":"what gender are you"
        },
        "11":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Rocky and friends from Nickelodeon's Paw Patrol TV show.",
                "Free Choice.",
                "Free Choice.",
                "Free Choice.",
                "Free Choice."
            ],
            "content":"<div class=\"\"><div> <span>Name: Rocky<br>\r\nSpecies: animated mixed breed<br>\r\nSize: 100 ft tall.<br>\r\nWeight: enormously fat.<br>\r\nAge: 6 <br>\r\nClothes: none<br>\r\nWhere does he live: in a castle that happens to be located right outside of a modern day town.<br>\r\nCompanions: Marshall Chase Rubble Zuma and Tracker who also happen to be enormously fat bare butt naked giants that live with Rocky in his castle.<br>\r\nDiet: greasy fast food along with sweets and desserts including Dunkin Donuts as well.<br>\r\nPersonality: Clever and friendly.<br>\r\n<br>\r\n</span></div></div>",
            "created":1490838960,
            "id":2296863,
            "title":"Male"
        },
        "112":{
            "author_id":"thefireofice",
            "author_name":"Fire of life",
            "choices":[
                "Yes let go",
                "How bout his brother",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>Name: Mathew dreanout ( mat for short )<br>\r\nSpecies: half giant half demon<br>\r\nSize: 600 feet<br>\r\nWeight:15000 lbs of muscle<br>\r\nAge: 23<br>\r\nClothes: a loin cloth<br>\r\nLocation: he tend to move around a bit but his favorite place to spend time is in the mountains where there the most trees<br>\r\nFriends: his s younger brother who is 13 and the wild life<br>\r\nDiet: he'll eat anything he not pick but his favorite thing to eat is human tho he tries not to because he might be found out<br>\r\nPersonality: he cocky mischievous but smart and powerful<br>\r\nLooks: is hairy and has a bead blue eyes and brown hair</span></div></div>",
            "created":1496881920,
            "id":2332782,
            "title":"Mathew"
        },
        "113":{
            "author_id":"shayna01",
            "author_name":"Mary shrink",
            "choices":[
                "go to collect from the villages",
                "a day relaxing at home",
                "another choice"
            ],
            "content":"<div class=\"\"><div> <span>Name: Mandrake Clubhammer (Drake for short)<br>\r\n<br>\r\nHair: black with a faux-hawk and a reseeding hairline at the temples, and short beard along his jaw. <br>\r\n     - body hair: tuffs of thick hair on his chest, armpits, and back. and hair on his arms and legs<br>\r\n<br>\r\neyes: grey-green and slitted like a lizard<br>\r\n<br>\r\nSpecies: giant horn troll, with 3 nubby horns going back from his temples<br>\r\n<br>\r\nSize: 100ft<br>\r\n<br>\r\nweight: powerful muscles, covered in thick layers of fat with a big giggling belly and butt<br>\r\n<br>\r\nAge: 54 (though he looks and acts 21)<br>\r\n<br>\r\nClothes: a tight leather vest, leather waist apron loincloth, and a leather thong<br>\r\n<br>\r\nHome: a stone castle/house up in the mountains a little ways. A valley (Siege Valley) full of human settlements, woodlands, and one big lake near by and surrounded by the mountains he lives in with only one opening for people and giants to come through. (he bathes in the lake once a month and rinses in a mountain waterfall every few days)<br>\r\n<br>\r\nJob: he guards the valley and settlements from monsters and invaders. in exchange, he is given tribute once a week from each of the settlements. mostly food and other useful goods, but sometimes the towns folk will come up short and he'll smash one of the houses at random and take whoever's inside. (he does his job well, even if he lords it over others)<br>\r\n<br>\r\nCompanions: Mio (a 18 year old village boy who's been coming to visit Drake for years), Caden (a giant Drake grew up with who comes to visit sometimes from his own valley), Torben (an enormassly fat and hairy ogre giant who came to crash at Drake's place when his swamp got taken over by a group of powerful witches -he's held a grudge against witches ever since-), and Bobin (a giant cyclops who comes to visit on occasion, doesn't know that Drake has a human friend and doesn't like humans)<br>\r\n<br>\r\nDiet: anything the villagers give him in tribute, mostly meat, and humans who taste very delicious (though he has potions that can make it safe to swallow someone and not digest them)<br>\r\n<br>\r\nPersonality: very full of himself most of the time, large and in charge, can be nice when he chooses, a heavy fighter who does his job well, he likes playing the big bad giant, but he also likes playing with his little human friend, can be very protective when needed, very gruff, not very tidy, doesn't mind being a slob in the comfort of his own home.</span></div></div>",
            "created":1601495460,
            "id":2913062,
            "title":"Mandrake Clubhammer, the protector of Siege Valley"
        },
        "12":{
            "author_id":"yusih2e",
            "author_name":"dinosaurs are awesome",
            "choices":[
                "Loner",
                "Schoolgirl",
                "Eater",
                "Friend",
                "Boss"
            ],
            "content":"<div class=\"\"><div> <span>Name: Amber<br>\r\nSize: 1000000000000000000000 ft tall<br>\r\nAge: 15<br>\r\nLives: at a cave<br>\r\nCompanion: A microscopic boy around amber's age and who likes her. his name is Max<br>\r\nDiet: Mountains and Islands<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nPossible storylines:<br>\r\n<br>\r\n<br>\r\nC1: Amber lives alone until she meets Max<br>\r\nC2: Amber Goes to school and meets Max<br>\r\nC3: Amber Is eating a mountain when she meets max<br>\r\nC4: Amber is at her house when she sees max spying on her<br>\r\nC5: Max Goes to a new work  which Amber is the owner of<br>\r\n</span></div></div>",
            "created":1360108920,
            "id":1525247,
            "title":"Female stats"
        },
        "121":{
            "author_id":"yusih2e",
            "author_name":"dinosaurs are awesome",
            "choices":[
                "say you will take of the boy",
                "take him to the nearest town"
            ],
            "content":"<div class=\"\"><div> <span>Amber was one of the last titans alive and because she was She spent most of her time in her titanic cave because she knew humans were scared of titans one day she was eating an island when a hand knocked on her door it was strange though because it was very faint she walked to the door and opened the door but there appeared to be no one there  but amber heard a very very faint voice it was saying down here so amber looked down but saw no one so she got a magnifiying glass got on her knees and squinted to see still nothing so she got a microscope zoomed it all the way and finally saw a  very tiny boy that looked to be about ambers age amber put her pinky down and the microscopic boy jumped on it amber lifted her pinky up and walked into her cave where she put her pinky down and the microscopic boy jumped off it.Amber said why are you here human the tiny boy said i am not human i am a tiny Amber said your not safe here little tiny boy. the boy said but i dont have a family.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nwhat do you do now</span></div></div>",
            "created":1360111500,
            "id":1525308,
            "title":"One is the only number"
        },
        "1211":{
            "author_id":"yusih2e",
            "author_name":"dinosaurs are awesome",
            "choices":[
                "Likes mike",
                "hates him"
            ],
            "content":"<div class=\"\"><div> <span>You think about it for a minute then say fine since you dont have any family i will become your guardian the micro boy yells hurray! then suddenly you hear another knock at the door you go over and open it to see another boy who also is your age and he is bigger than max but still way smaller than since he doesnt even reach up to the top of your toe. he says i'm looking for amber my sister you think this must be your long lost brother you say i'm amber welcome home brother your brother runs over to you when he slips and bangs into your toe you pick him up and say are you ok mike he says yes amber you decide to introduce mike to max so you put mike on your shoulder and walk over to max. you say to max max this is my brother mike.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nwhat does he say</span></div></div>",
            "created":1360119540,
            "id":1525423,
            "title":"2 is better and 3 is a crowd"
        },
        "123":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Amber and Max chat",
                "Mountain with a cure sort of!",
                "Naughty day! Self pleasure with an island!"
            ],
            "content":"<div class=\"\"><div> <span>Amber was once a normal girl until one day some crazy scientific organization kidnapped her and subjected her to various experiments.<br>\r\nUnfortunately 2 of their experiments had an unintended effect.<br>\r\n<br>\r\n<br>\r\nAmber had begun to have growth spurts.<br>\r\nIt started out manageable but in the days that followed even after capturing the guilty parties a reversal wasn't forthcoming.<br>\r\n<br>\r\n<br>\r\nAmber in week outgrew most buildings.<br>\r\nIn 2 weeks she outgrew cities<br>\r\nIn the 4th week when it seemed her growth spurts would never end they did.<br>\r\n<br>\r\n<br>\r\nNow Amber is beyond enormous. In fact Amber is so large she can pick up mountains and islands with ease. To her they are bite sized snacks and make up most of her diet. One day while eating a mountain she was given the green light to eat she'd met a boy named Max.<br>\r\n<br>\r\n<br>\r\n<br>\r\nUnfortunately given her size a relationship was next to impossible at least the kind she longed for.<br>\r\nThe government continued to seek a cure for her.<br>\r\nUnfortunately Amber was too big for any clothing.<br>\r\n<br>\r\n<br>\r\nThere were few things for Amber to do at this size tho<br>\r\n<br>\r\n<br>\r\n<br>\r\nYour options are <br>\r\n<br>\r\n1 &gt; chat<br>\r\n<br>\r\n<br>\r\n2 &gt; Magical hot springs of shrinkage<br>\r\nAmber unwittingly snacks on an island and volcano home to a mysterious springs that could cure her.<br>\r\nThe unfortunate rub at her size the effects will be delayed and there's not enough to work completely in short Amber will only shrink down to a building sized giantess still taller than many buildings <br>\r\n<br>\r\n<br>\r\n3 &gt; Human needs and a substitute for sex <br>\r\nIsland sized pleasure toy<br>\r\n</span></div></div>",
            "created":1490562060,
            "id":2295174,
            "title":"Eater"
        }
    },
    "info":{
        "author_id":"yusih2e",
        "author_name":"dinosaurs are awesome",
        "brief_description":"Be a giant",
        "created":1360105260,
        "description":"<td align=\"left\" class=\"norm\">no sex</td>",
        "id":1917644,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601495460,
        "modified":1601495460,
        "pretty_title":"Life of a giant"
    }
}