{
    "chapters":{
        "1":{
            "choices":[
                "7 year old boy in diapers",
                "7 year old girl in diapers",
                "7 year old boy in pullups",
                "7 year old girl in pullups",
                "other ages and ways you are padded"
            ],
            "content":"<div class=\"\"><div> <span>You have been bullied your whole life, and there is literally no safe zone. your family teases you, your peers tease you, your teachers and principal tease you, and everyone who meets you teases you. You have had enough. One day, you feel something flowing through your body. Something...Cosmic. Something...powerful. Something...Life-changing.<br>\r\n<br>\r\nWho will you get revenge on first? <br>\r\nPerhaps your mean sibling. Maybe the older sister who treats you like a baby, and parades you for her friends entrainment? Or the annoying younger brother, who laughs at you and refuses to except that your the older?<br>\r\nCould it be the popular kids who humiliated you at school?<br>\r\nOr perhaps the special teacher whose made it there life mission for every day of your life to be worst than the last?<br>\r\nOr could it be someone else all together? Some one you've always longed for revenge on? Someone who want to see suffer more than the others?<br>\r\nSo many options, so many choices. Which to chose? They all deserve to be given a large slice of Karma.<br>\r\n<br>\r\nThe world will pay for making fun of you for being a...</span></div></div>",
            "created":1390971600,
            "id":1735067,
            "title":"the beginning"
        },
        "11":{
            "choices":[
                "just pee uncontrollably",
                "just mess uncontrolably",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of incontinence do you have?</span></div></span></div>",
            "created":1390971600,
            "id":1735071,
            "title":"7 year old boy in diapers"
        },
        "113":{
            "choices":[
                "at home",
                "somewhere at school"
            ],
            "content":"<div class=\"\"><div> <span>you are Geo, or as known by everyone you meet, \"little mister accident.\" you were given this nickname for two reasons. one: your insides never \"aged\" correctly, so you can't control when or where you pee or poop. 2: you were highly accident prone, always tripping or crashing into things. the worst part is, every time you get impacted, your bladder and/or bowels always seem to be full! but today was different. today, a new strentgh flowed through you. today was when you got your well-deserved REVENGE! Where do you start?</span></div></div>",
            "created":1390971600,
            "id":1735079,
            "title":"pee and mess uncontrolably"
        },
        "1131":{
            "choices":[
                "you are being changed",
                "you are watching tv",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what is happening?</span></div></span></div>",
            "created":1395032400,
            "id":1761933,
            "title":"at home"
        },
        "11311":{
            "choices":[
                "you",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>changed by who?</span></div></span></div>",
            "created":1395032400,
            "id":1761939,
            "title":"you are being changed"
        },
        "113111":{
            "choices":[
                "you hear a voice",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you finish diapering yourself, you have had to learn how to in order to not get mocked. all of a sudden...</span></div></span></div>",
            "created":1395032400,
            "id":1761944,
            "title":"you"
        },
        "1131111":{
            "choices":[
                "your mom",
                "something much stranger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what was it?</span></div></span></div>",
            "created":1395032400,
            "id":1761945,
            "title":"you hear a voice"
        },
        "11311112":{
            "choices":[
                "go in the bathroom, you must know who this voice is.",
                "ignore it and hope it goes away."
            ],
            "content":"<div class=\"\"><div> <span><i>\"Geo...\"</i> a deep voice echoes in your head, soft at first, then steadily louder.<i> \"Geo...\"</i> \"who...who's there? I'm warning you, I took a week of karate!\" <i>\"ha ha ha. such a brave soul. rare in the bullied. but then, you are an exceptionally rare person. I will reveal myself, since you asked. go somewhere more private. I cannot make myself known in public.\"</i> \"can I have a name first?\" <i>\"...you may call me Karm. Now, I will explain everything when we get some privacy.\" what do you do?</i></span></div></div>",
            "created":1395032400,
            "id":1761975,
            "title":"something much stranger"
        },
        "113111121":{
            "choices":[
                "on your parents",
                "on your siblings"
            ],
            "content":"<div class=\"\"><div> <span>You tell \"Karm\" its okay to come out. a bright flash of light blinds you momentarily, then a perfect copy of you appears in front of you, except with a glowing line surrounding his outline, and his eyes keep changing color. when he speaks this time, it is in your voice, but with a strange deep echo. <i>\"Geo. You have been tormented by everyone, with no one to look to. your life is an eternal mocking, and all because you were born differently.\"</i> \"The story of my life. What does this have to do with you?\" <i>\"Everything, Geo. I am the voice of Karma.\"</i> \"Karma? that thing I put on my ice cream?\" <i>\"that's caramel. Karma is the force that punishes those who do wrong, and rewards those who do good. It also helps those who have suffered greatly, but have no power to change things. The last part is known to many as the 'fantasy effect.' Since you have suffered all your life, you are being granted power to last until you have evened the score and make it last. You just have to think of a person, and Karma will change them. The rules are, you can't undo or end life, (no unbirthings or age to death) and you cannot target yourself with these powers. You can change people's age (making them younger or older), change their continence (make them need diapers/pullups/toilet) or you can make people think they have changed in that way, without them actually change. and finally, you can change reality so that these changes will be normal to everyone other than you and the target. I bestow upon you the magical eye of Karma!\"</i> A bright light flashes, and you are momentarily blind in your left eye, then everything goes multicolor. <i>\" with this eye, you have the power I just explained to you. You can also call me at any time. Good luck, young one.\"</i> With that, your doppelganger disappeared, and you decide to test out your new power. But where?</span></div></div>",
            "created":1395032400,
            "id":1761977,
            "title":"go in the bathroom, you must know who this voic..."
        },
        "1131111212":{
            "choices":[
                "1-3",
                "4+"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how many siblings do you have?</span></div></span></div>",
            "created":1396242000,
            "id":1771300,
            "title":"on your siblings"
        },
        "11311112121":{
            "choices":[
                "Hazel",
                "Crystal or Peter"
            ],
            "content":"<div class=\"\"><div> <span>here are the stats for your siblings<br>\r\n<br>\r\nHazel<br>\r\n17 years old<br>\r\n6 feet tall<br>\r\n\"c\" cup<br>\r\ndirty blonde hair<br>\r\nmocks you by pantsing you in public places, and changes you in the baby changing table in most bathrooms<br>\r\n<br>\r\nPeter<br>\r\n4 years old<br>\r\n3'10\"<br>\r\ndiaper wearer<br>\r\ndirty blond hair, though sun bleached from spending too much time in he sun watching Barney<br>\r\nsecretly looks up to you, and sees you as a rebel for using diapers in public, but in front of others, uses his diaper and says you did it<br>\r\n<br>\r\nCrystal<br>\r\n7 years old<br>\r\n4'2\"<br>\r\nyour identical twin, older than you by 20 minutes<br>\r\ndark brown hair<br>\r\nthough you are twins, your sister is almost your polar opposite when there is anyone in the room other than you or Peter, but secretly has a diaper fetish and gets turned on by you when you have no pants on, thanks to Hazel, who hides your pants from your drawers.<br>\r\n<br>\r\nwho do you focus on?</span></div></div>",
            "created":1396242000,
            "id":1771304,
            "title":"1-3"
        },
        "113111121211":{
            "choices":[
                "soils herself",
                "gets younger"
            ],
            "content":"<div class=\"\"><div> <span>you decide on Hazel, just as she comes in and takes a few more pics of you in your diaper, and you wet yourself in response. She laughs and takes more pics, and you are helpless to stop her. she laughs again, and goes off, probably to upload them to the internet. you get angry, and decide to use your Karma's Eye on her. you run over to her, and focus. suddenly, a burst of rainbow light emits from your left eye, and you watch as she____ before your very eyes</span></div></div>",
            "created":1396242000,
            "id":1771316,
            "title":"Hazel"
        },
        "11311112122":{
            "choices":[
                "Peter or Crystal",
                "Jake or Hazel"
            ],
            "content":"<div class=\"\"><div> <span>here are the listings for your siblings:<br>\r\n<br>\r\nJake<br>\r\n13 years old<br>\r\nabout 5'3<br>\r\nmuscular<br>\r\ndark brown hair<br>\r\nmocks you by putting a bib on you during meals, and forces you into a highchair as well<br>\r\n<br>\r\nHazel<br>\r\n17 years old<br>\r\n6 feet tall<br>\r\n\"c\" cup<br>\r\ndirty blonde hair<br>\r\nmocks you by pantsing you in public places, and changes you in the baby changing table in most bathrooms<br>\r\n<br>\r\nPeter<br>\r\n4 years old<br>\r\ndiaper wearer<br>\r\ndirty blond hair, though sun bleached from spending too much time in he sun watching Barney<br>\r\nsecretly looks up to you, and sees you as a rebel for using diapers in public, but in front of others, uses his diaper and says you did it<br>\r\n<br>\r\nCrystal<br>\r\n7 years old<br>\r\nyour identical twin, older than you by 20 minutes<br>\r\ndark brown hair<br>\r\nthough you are twins, your sister is almost your polar opposite when there is anyone in the room other than you or Peter, but secretly has a diaper fetish and gets turned on by you when you have no pants on, thanks to Hazel, who hides your pants from your drawers.<br>\r\n<br>\r\n<br>\r\nwho do you focus on?</span></div></div>",
            "created":1396242000,
            "id":1771303,
            "title":"4+"
        },
        "113111121221":{
            "choices":[
                "Peter",
                "Crystal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1400648400,
            "id":1800056,
            "title":"Peter or Crystal"
        },
        "1131111212212":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "Change how people see her?",
                "Put her in a diaper/ lose control of bladder and/or bowels?"
            ],
            "content":"<div class=\"\"><div> <span>(Just a quick note, I think it would be best if she wasn't 'turned on by diapers' instead to 'really interested in diapers'  due to being 7 years old and unable to actually have any parts to actually be in such a state, at least that's what I want but if you want it to be the other way just tell me)<br>\r\n<br>\r\nYou were getting revenge on Crystal, you have to admit she isn't all bad, when your alone with her she's nice and you actually have nice conversations with her... Buy you get the feeling she thinks your really weird or something because whenever your with her and other people she teases you too, she also just keeps giving strange looks whenever she sees your diaper, probably just looking at it like its an alien device or something. <br>\r\n<br>\r\nWhenever you feel you can get along with her she will change in front of others just to show you two are not close, it's stuff like that makes you feels betrayed and hurt that she does this to you. So it's time for revenge!<br>\r\n<br>\r\nRight now she's probably watching tv with mom, they both liked this tween as they called it so it looks like its a good time to strike. Will you...</span></div></div>",
            "created":1436763600,
            "id":2007631,
            "title":"Crystal"
        },
        "11311112122122":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "Ruin her bladder/bowels",
                "Put her in a diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You think the best course of action is to put her in a position where she can see things in your point of view, but how should he go about that?</span></div></span></div>",
            "created":1437800400,
            "id":2012104,
            "title":"How would Crystal like to be in your position?"
        },
        "113111121221221":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "Bladder",
                "Bowels/Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It would  probably give her the best experience if you ruin a bit of her potty training, but what should you get rid of.</span></div></span></div>",
            "created":1437800400,
            "id":2012106,
            "title":"Ruin her bladder/bowels"
        },
        "1131111212212211":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "She messes herself (What, you didn't even cause that, did she do that herself?)",
                "You decide to leave for now and think about what to do next."
            ],
            "content":"<div class=\"\"><div> <span>You decided to take away her ability to pee, you decided to try to watch the event unravel. You sneak to their room and hide next to the entrence to their room. You stick your head out to see them still watching that tween show, Crystal is laying on your mother's lap.<br>\r\n<br>\r\n\"I love how realistic this show is.\" Your mother says \"I'm telling you I have been in this kid's situation plenty of times\"<br>\r\n<br>\r\nYou rolls your eyes at your mother's statement. You put your focus on Crystal and see a wet spot coming out from her dress.<br>\r\n<br>\r\n\"Sweetly did you spill your drink?\" Your mother looks at her daughter and they both noticed she wet herself. \"Oh my Crystal did you wet yourself!?\" Your mother asked alarmed. <br>\r\n<br>\r\nYou can see your sister looking red as an apple seeing this. \"I didn't even notice mommy, I'm sorry about doing this.\" She said looking really upset.<br>\r\n<br>\r\n\"Ok look Crystal, it was only a one time thing. Why don't you get some more cloths from the clean laundry and no one needs to find out.\" Your mother tells Crystal.<br>\r\n<br>\r\nNow you were jealous, why would your mother let her off like that. Well to be fair your mother doesn't try to announce your state of diaper all the  time but when everybody knows or you two are alone, she babies you real bad.<br>\r\n<br>\r\n\"Wait mommy I ah don't know if I will be be able to control myself, what if I make another wet wet... Or worst.\" She said looking ready to cry.<br>\r\n<br>\r\nYou were surprised at this, she looked like she was worried about making a mistake. It was something you weren't expecting her to be aware she will make another wet stain.<br>\r\n<br>\r\n\"Aww don't cry... Ok there is something else we can do... But you may not like it...\" She said and went to a closet. You hear plastic ripping and then your mother came back with one of your diapers. \"Look we can just do this until you feel you won't be ruining anything, it can be our little secret.\" Your mother said walking toward her daughter while speaking in a soft voice.\" <br>\r\n<br>\r\n\"Well... If you think it will help I guess we could try.\" Your sister tells your mom unsure.<br>\r\n<br>\r\n'Wow' you thought to yourself 'Did she just sort of have your mom diaper her, and you only ruined only bladder control. This all happened in about 10 minutes too. <br>\r\n<br>\r\nYour mother puts Crystal in a diaper and they go back to watching TV. You start to get board until...</span></div></div>",
            "created":1437800400,
            "id":2012138,
            "title":"Ruin her Bladder"
        },
        "113111121222":{
            "author_id":"vokoth",
            "author_name":"Sotekh",
            "choices":[
                "Choose Jake. ",
                "Choose Hazel. "
            ],
            "content":"<div class=\"\"><div> <span>You emerge from the bathroom, a strange feeling filling you. Confidence, an emotion not often felt by those in your position. Revenge is close at hand, and indeed, your victims quickly reveal themselves. Jake sits nearby in his room, his door open as he lifts weights, while Hazel, the eldest of your siblings walks past you with a scowl, chuckling to herself as she spies your diapered form. </span></div></div>",
            "created":1508376660,
            "id":2403343,
            "title":"Jake or Hazel"
        },
        "1131111212221":{
            "author_id":"vokoth",
            "author_name":"Sotekh",
            "choices":[
                "Change his age.",
                "Change his continence. "
            ],
            "content":"<div class=\"\"><div> <span>You strut into Jake's room, feeling braver than you ever had before. Only when you close the door behind you does he take notice. He looks up at you, his thick, bullish face forming a smirk as you enter. He's clearly well built, as his musculature proves, and his walls are lined with posters depicting video game characters and scantily clad women. His hair is short and dark, a grimy brown, while his eyes are a cold, almost malicious grey. <br>\r\n<br>\r\n\"What do you want, Diaper Boy?\" He asks, attempting to deepen his voice to sound older. <br>\r\n<br>\r\nSmiling to yourself, your left eye begins to glimmer with a malefic light, and strange energy takes hold of your tyrant brother. <br>\r\n<br>\r\nWhat will you do to him?</span></div></div>",
            "created":1508377020,
            "id":2403347,
            "title":"Choose Jake. "
        },
        "11311112122211":{
            "author_id":"vokoth",
            "author_name":"Sotekh",
            "choices":[
                "Turn him into a baby. ",
                "Turn him into a toddler. "
            ],
            "content":"<div class=\"\"><div> <span>Jake's eyes widen as his muscles become loose and he drops the barbell he had been holding. Looking up at you angrily he attempts to stand, but is held down by the arcane forces acting upon his person, and as he attempts his defiance, his body begins to change... </span></div></div>",
            "created":1508377140,
            "id":2403349,
            "title":"Change his age."
        },
        "113111121222111":{
            "author_id":"vokoth",
            "author_name":"Sotekh",
            "choices":[
                "Change his diaper.",
                "Turn his room into that of a baby."
            ],
            "content":"<div class=\"\"><div> <span>Defiance turns to fear in Jake's eyes as he feels an odd, warm feeling engulfing him. As you watch, a smile forming on your face, he begins to shrink, slowly at first, then faster. His muscles, carefully honed over these recent months rapidly leave him, and his bulky face loses its bullish shape. He speaks, anger in his voice, poisoned by a tinge of fear. <br>\r\n\"Stop this, stop it now!\" <br>\r\nWith his final word, his adam's apple receded back into his throat, as every vestige of puberty left him. His once muscled chest was left hairless, and the fear on his face became more tangible, as realisation gripped him. By this point, his height began to jerk down spasmodically, his massive growth spurts fading away, leaving him as a boy but a few inches taller than yourself. His track bottoms, which had as yet been unaffected by the transformation, barring their decrease in size, finally began to change, crawling up his legs in a most unnatural manner and growing thinner, eventually forming a pair of white briefs around him. At this point tears began filling his eyes as he finally became younger than you, <br>\r\n\"Please, Geo, stop, I promise I won't insult you ever again!\"<br>\r\nYou could only smirk as he fell further in years, reaching toddlerhood, his briefs thickened, and colourful patterns covered them, until finally they became a thick pull-up. Your smile widens as his face rounds out with baby fat, and his body becomes even smaller, his feet having long since left the carpeted floor. <br>\r\n\"Pwease, me no wanna be bab- Agh.. Wah!\" <br>\r\nHis cries for mercy devolved into a pathetic cry as his transformation was finally completed, his pull-up thickening into a pampers diaper, he grew silent, looking at his once muscled, now chubby arms, prior to looking down. Suddenly, his diaper began to thicken and turn yellow, filling up with urine, as the last energy drinks of his now lost teenhood filled his diaper to capacity. Still he did not cry, for suddenly he looked up at you, his eyes filled with tears as a great fart sounded its horn through the room, and he filled his large diaper with an amount of poo that a 13 year old would expel. He is held aloft slightly, his full diaper squishing and forming a seat beneath him.<br>\r\n<br>\r\nIt was then, all of his pride, dignity, and strength gone, that he fully gave in to his infantile urges, his intelligent mind trapped within an infant's body.<br>\r\n<br>\r\nYou looked at him, and relished the moment, saying but one thing.<br>\r\n<br>\r\n\"Who's the diaper boy now?\"</span></div></div>",
            "created":1508378220,
            "id":2403358,
            "title":"Turn him into a baby. "
        },
        "1132":{
            "choices":[
                "the nurse's office, getting changed",
                "the lunchroom, being pantsed",
                "the classroom, being laughed at by a teacher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where in school?</span></div></span></div>",
            "created":1393390800,
            "id":1751749,
            "title":"somewhere at school"
        },
        "11321":{
            "choices":[
                "the bell rings",
                "you hear a voice"
            ],
            "content":"<div class=\"\"><div> <span>\"there. all fixed up. again. for the third time in twenty minutes. now, there was some leakage, so I'll have to wash your pants. since you have an- unusual- size, we couldn't find you any pants that would come within three sizes of you. Geo, you are going to have to go back to class without pants.\" you knew this was a lie, because you were in first grade, but had a pre-k size. this wouldn't matter, but you were in a school with all grades from preschool to eighth grade, so there were plenty of pants in your size. she just wanted to humiliate you by forcing you to expose your diaper. \"Okay, you should head back now.\" \"okay dr. white.\" \"see you in five minutes when you need another change, assuming you don't soil yourself on the way back.\"<br>\r\n<br>\r\nYou move to head back to class when...</span></div></div>",
            "created":1394168400,
            "id":1756901,
            "title":"the nurse's office, getting changed"
        },
        "113211":{
            "choices":[
                "you hear a voice",
                "someone sees you!"
            ],
            "content":"<div class=\"\"><div> <span>you freeze. the bell rang, and this was the worst time of the day if you don't want to be seen, since this is the period where half the school comes from the cafeteria, and the other half to the cafeteria. you try and hide, but you know its pointless, and you end up wetting yourself. Then...</span></div></div>",
            "created":1394254800,
            "id":1757258,
            "title":"the bell rings"
        },
        "1132111":{
            "choices":[
                "someone called you.",
                "something much stranger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what happened?</span></div></span></div>",
            "created":1394773200,
            "id":1760229,
            "title":"you hear a voice"
        },
        "11321111":{
            "choices":[
                "good",
                "bad"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was it good or bad?</span></div></span></div>",
            "created":1395032400,
            "id":1761859,
            "title":"someone called you."
        },
        "11321112":{
            "choices":[
                "go in the bathroom, you must know who this voice is.",
                "ignore it and hope it goes away."
            ],
            "content":"<div class=\"\"><div> <span><i>\"Geo...\"</i> a deep voice echoes in your head, soft at first, then steadily louder. <i>\"Geo...\"</i> \"who...who's there? I'm warning you, I took a week of karate!\" <i>\"ha ha ha. such a brave soul. rare in the bullied. but then, you are an exceptionally rare person. I will reveal myself, since you asked. go to the bathroom behind you. I cannot make myself known in public.\"</i> \"can I have a name first?\" <i>\"...you may call me Karm. Now, I will explain everything when we get some privacy.\"</i> what do you do?</span></div></div>",
            "created":1394773200,
            "id":1760231,
            "title":"something much stranger"
        },
        "113211121":{
            "choices":[
                "the classroom",
                "other places"
            ],
            "content":"<div class=\"\"><div> <span>You decide going in private would be better than staying out here where you could get seen and humiliated further, so you run into the nurse's office, grab a clean diaper, and go into the bathroom, locking the door behind you. You change yourself before you tell \"Karm\" its okay to come out. a bright flash of light blinds you momentarily, then a perfect copy of you appears in front of you, except with a glowing line surrounding his outline, and his eyes keep changing color. when he speaks this time, it is in your voice, but with a strange deep echo. <i>\"Geo. You have been tormented by everyone, with no one to look to. your life is an eternal mocking, and all because you were born differently.\"</i> \"The story of my life. What does this have to do with you?\" <i>\"Everything. I am the voice of Karma.\"</i> \"Karma? that thing I put on my ice cream?\" <i>\"that's caramel. Karma is the force that punishes those who do wrong, and rewards those who do good. It also helps those who have suffered greatly, but have no power to change things. The last part is known to many as the 'fantasy effect.' Since you have suffered all your life, you are being granted power to last until you have evened the score and make it last. You just have to think of a person, and Karma will change them. The rules are, you can't undo or end life, (no unbirthings or age to death) and you cannot target yourself with these powers. You can change people's age (making them younger or older), change their continence (make them need diapers/pullups/toilet) or you can make people think they have changed in that way, without them actually change. and finally, you can change reality so that these changes will be normal to everyone other than you and the target. I bestow upon you the magical eye of Karma!\"</i> A bright light flashes, and you are momentarily blind in your left eye, then everything goes multicolor. <i>\" with this eye, you have the power I just explained to you. You can also call me at any time.\" </i> with that, your doppelganger disappeared, and you decide to test out your new power. but where?</span></div></div>",
            "created":1395032400,
            "id":1761814,
            "title":"go in the bathroom, you must know who this voic..."
        },
        "1132111212":{
            "choices":[
                "the nurse's office",
                "the lunchroom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where then?</span></div></span></div>",
            "created":1395032400,
            "id":1761816,
            "title":"other places"
        },
        "11321112121":{
            "choices":[
                "age",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the nurse is back, and you use your new powers on her immediately. you focus on making her _________ change and a blast of rainbow light shoots out from your left eye. You smiled as you powers changed the nurse by changing her_____.</span></div></span></div>",
            "created":1395032400,
            "id":1761855,
            "title":"the nurse's office"
        },
        "113211121211":{
            "choices":[
                "older",
                "younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was she older or younger?</span></div></span></div>",
            "created":1395032400,
            "id":1761856,
            "title":"age"
        },
        "1132111212112":{
            "choices":[
                "major, lost more than 30 years",
                "minor, lost only a few years."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was it a minor of major change?</span></div></span></div>",
            "created":1395032400,
            "id":1761857,
            "title":"younger"
        },
        "11321112122":{
            "choices":[
                "the older kids who have bullied you",
                "the younger kids who use your smaller size against you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you finally have the power to get revenge on your bullies from all grades, an you have the eye to prove it. You grab your now clean clothes and go down to the lunchroom. you target...</span></div></span></div>",
            "created":1395032400,
            "id":1761817,
            "title":"the lunchroom"
        },
        "113211121221":{
            "choices":[
                "2nd-5th",
                "6th-8th"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what grade?</span></div></span></div>",
            "created":1395032400,
            "id":1761818,
            "title":"the older kids who have bullied you"
        },
        "1132111212211":{
            "choices":[
                "2nd-3rd",
                "4th-5th"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which grade group?</span></div></span></div>",
            "created":1395032400,
            "id":1761820,
            "title":"2nd-5th"
        },
        "11321112122111":{
            "choices":[
                "2nd",
                "3rd"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which grade?</span></div></span></div>",
            "created":1395032400,
            "id":1761821,
            "title":"2nd-3rd"
        },
        "113211121221111":{
            "choices":[
                "yes",
                "no, they are jerks because of age/size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761822,
            "title":"2nd"
        },
        "113211121221112":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761827,
            "title":"3rd"
        },
        "11321112122112":{
            "choices":[
                "4th",
                "5th"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which grade?</span></div></span></div>",
            "created":1395032400,
            "id":1761828,
            "title":"4th-5th"
        },
        "113211121221121":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761829,
            "title":"4th"
        },
        "113211121221122":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761830,
            "title":"5th"
        },
        "1132111212212":{
            "choices":[
                "6th",
                "7th-8th"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which grade group?</span></div></span></div>",
            "created":1395032400,
            "id":1761831,
            "title":"6th-8th"
        },
        "11321112122121":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761832,
            "title":"6th"
        },
        "11321112122122":{
            "choices":[
                "7th",
                "8th"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which grade?</span></div></span></div>",
            "created":1395032400,
            "id":1761833,
            "title":"7th-8th"
        },
        "113211121221221":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761834,
            "title":"7th"
        },
        "113211121221222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761835,
            "title":"8th"
        },
        "113211121222":{
            "choices":[
                "k-1st",
                "pre-k"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which grade group?</span></div></span></div>",
            "created":1395032400,
            "id":1761836,
            "title":"wuss."
        },
        "1132111212221":{
            "choices":[
                "k",
                "1st"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which grade?</span></div></span></div>",
            "created":1395032400,
            "id":1761837,
            "title":"k-1st"
        },
        "11321112122211":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761838,
            "title":"k"
        },
        "113211121222111":{
            "choices":[
                "yes",
                "no/potty training"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are they potty trained?</span></div></span></div>",
            "created":1395032400,
            "id":1761841,
            "title":"yes"
        },
        "1132111212221112":{
            "choices":[
                "diapers",
                "pullups"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1395032400,
            "id":1761842,
            "title":"no/potty training"
        },
        "113211121222112":{
            "choices":[
                "yes",
                "no/potty training"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are they potty trained?</span></div></span></div>",
            "created":1395032400,
            "id":1761843,
            "title":"no"
        },
        "1132111212221122":{
            "choices":[
                "diapers",
                "pullups"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1395032400,
            "id":1761844,
            "title":"no/potty training"
        },
        "11321112122212":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761845,
            "title":"1st"
        },
        "1132111212222":{
            "choices":[
                "yes",
                "no/potty training"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do they know you are diapered?</span></div></span></div>",
            "created":1395032400,
            "id":1761846,
            "title":"pre-k"
        },
        "11321112122222":{
            "choices":[
                "diapers",
                "pullups"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1395032400,
            "id":1761854,
            "title":"no/potty training"
        },
        "113211121222222":{
            "choices":[
                "age",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you smile. the little ones may be the smallest in school, but when they find an advantage, like your small size, they use it. they sat on you and used their pullups until they couldn't any more, and that was a lot. you could have your revenge, starting small and working your way up. you go in and everyone their age laughs at you. you get angry and focus on the group. a wide wave of rainbow light burst from your Karma's Eye, enveloping the entire pre-k population in a shining glow. you focus on their...</span></div></div>",
            "created":1395032400,
            "id":1761860,
            "title":"pullups"
        },
        "1132111212222222":{
            "choices":[
                "continence",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you focus on their...</span></div></span></div>",
            "created":1395032400,
            "id":1761862,
            "title":"other"
        },
        "12":{
            "choices":[
                "just pee uncontrollably",
                "just mess uncontrolably",
                "pee and mess uncontrolably"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of incontinence do you have?</span></div></span></div>",
            "created":1390971600,
            "id":1735075,
            "title":"7 year old girl in diapers"
        },
        "123":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "At home",
                "At School",
                "At the mall"
            ],
            "content":"<div class=\"\"><div> <span>You had been teased for as long as you could remember. You were stuck in diapers for the rest of your life, ever since a disease utterly destroyed the nerves allowing you to old it. You are a 7 year old girl, Jessica Winters, and you were currently....</span></div></div>",
            "created":1409461200,
            "id":1849909,
            "title":"pee and mess uncontrolably"
        },
        "1232":{
            "choices":[
                "Normal school.",
                "A daycare, where your mom has insisted on them treating you like a toddler.",
                "Some other school"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In the car, you realized that you could start to have fun with your powers when you arrive at school. You smile inwardly as your mom dropped you off at...</span></div></span></div>",
            "created":1454531700,
            "id":2098869,
            "title":"On the way to school"
        },
        "12322":{
            "choices":[
                "baby (1-3 year olds)",
                "toddler (4-5 year olds)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Mom, we passed my school.\"<br>\r\n<br>\r\n\"Babies who need diapers like you don't go to school until they are old enough to be out of diapers. I'm dropping you off at the local daycare, under the____ group.\"</span></div></span></div>",
            "created":1456345860,
            "id":2109056,
            "title":"A daycare, where your mom has insisted on them ..."
        },
        "13":{
            "choices":[
                "in the classroom",
                "at home",
                "in the nurses office",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You are Tomas, also known by every second grader in your school, \"little mister wettums.\" this was given to you because you still wear pull-ups thanks to an infection on your bladder. But today was different. The power now flows through you, like a raging river. you can finally have your revenge! Where do you start?</span></div></div>",
            "created":1390971600,
            "id":1735077,
            "title":"7 year old boy in pullups"
        },
        "131":{
            "choices":[
                "just the teacher",
                "just the students",
                "everyone in the class"
            ],
            "content":"<div class=\"\"><div> <span>you are in the classroom, sitting in your new seat. you used to have a normal seat among the other classmates, but you made the mistake of asking for a new seat. the day after you asked, your seat and desk was replaced by a highchair. All of a sudden, you feel a strange, deep echoing voice in your head. \"<i>I am the voice of Karma. Geo, you have suffered seven long years of torment because of your infection. I am here to make things right. For the next 14 years, you will have the power to make things the way they should be.\" How?</i> you ask. <i> \"I am giving you the power of Karma. You now have the power to alter ages or continence, or how people perceive that person's age or continence. this works for anyone other than you, because Karma can only work on others.\" AWESOME! How does it work? \"simply think, and it shall be done. Just remember. You may not use this power to kill or cause something to kill because of your power.\" Okay. let's test it. but who to choose...</i></span></div></div>",
            "created":1393390800,
            "id":1751758,
            "title":"in the classroom"
        },
        "14":{
            "choices":[
                "at home",
                "at school",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you are jasmine, or as you are called by everyone, \"little miss wettums.\" You were given this name because you are a 7-year-old who stuck in pull-ups for the rest of her life, due to a bladder infection. But today is different. You have a new power, and it flows through you rapidly. Where is your first target?</span></div></div>",
            "created":1390971600,
            "id":1735145,
            "title":"7 year old girl in pullups"
        },
        "143":{
            "author_id":"elmo86",
            "author_name":"windelfan",
            "choices":[
                "Your ballet school",
                "At a playground",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe here?</span></div></span></div>",
            "created":1404277200,
            "id":1821296,
            "title":"other"
        },
        "1431":{
            "author_id":"elmo86",
            "author_name":"windelfan",
            "choices":[
                "You are among toddlers and preschoolers",
                "You are the only one in pullups",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Every Tuesday after school you are going to a ballet dance school.<br>\r\nYou love dancing, even the group you are attending has a big con.<br>\r\n<br>\r\n(Option 1: You are in a toddlergroup for little girls, 3 to 5 years old, the good thing is you are not the only one in pullups, but the oldest one)<br>\r\n(Option 2: You are in a schoolage group for girls from 6 to 10 year olds, but your the only one in pullups)</span></div></div>",
            "created":1404277200,
            "id":1821298,
            "title":"Your ballet school"
        },
        "14311":{
            "author_id":"elmo86",
            "author_name":"windelfan",
            "choices":[
                "Make Veronica wet herself",
                "Make Veronicas coach punish her when she tease you again"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nIts allways a ambivalent feeling for you when you have your dance classes.<br>\r\n<br>\r\nYou are in a small group with just 5 other girls, so your coach Ms Green has allways time for all of you to show you things, and she one of the few persons who is nice to you.<br>\r\nEven you feel often underchallengend is it a good feeling that you know you are by far the best in your group.<br>\r\nOf course you dont like it to wear tight leotards where your pullups are so visible, but at least in your group a two other in pullups and one, the youngest is even still in diapers, while just two are not padded.<br>\r\n<br>\r\nThe wors thing is that at the time your dance lessons are, the other group including some girls from your schoolclass too have also their practices, the gymhall is just seperated with some benches, and every time you are near enough to the middle of the gym and one of the older class is seeing you they start to tease you.<br>\r\nEspecially Veronica is mean. She teases you in school, she teases you here plus she is the biggest talent in balett - you hate her.<br>\r\n<br>\r\nBut maybe now with your new powers you finaly can get your revenge.<br>\r\nWhile your warm up you think about how you can try out your powers </span></div></div>",
            "created":1404363600,
            "id":1821981,
            "title":"You are among toddlers and preschoolers"
        },
        "1432":{
            "author_id":"cdg17",
            "author_name":"Charles17",
            "choices":[
                "The girl",
                "The boy ",
                "Or other?"
            ],
            "content":"<div class=\"\"><div> <span>Your on a swing by yourself. You can feel your wet pull-ups between your legs. But you want to use your knew power that you have. So you look around to see if you can find any one. <br>\r\nYou see a girl that is in your glass talking in a gruop. You also see a few boys playing in the sand box. <br>\r\n<br>\r\nSo the question is how do you want to use your power on first?</span></div></div>",
            "created":1451192400,
            "id":2079840,
            "title":"At a playground"
        },
        "15":{
            "choices":[
                "10 year old boy in diapers",
                "10 year old girl in diapers",
                "10 year old boy in pullups",
                "10 year old girl in pullups",
                "other ages and ways you are padded"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Something...Cosmic. Something...powerful. Something...Life-changing. The world will pay for making fun of you for being a...</span></div></span></div>",
            "created":1390971600,
            "id":1735068,
            "title":"other ages and ways you are padded"
        },
        "151":{
            "choices":[
                "just pee uncontrollably",
                "just mess uncontrolably",
                "pee and mess uncontrolably"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of incontinence do you have?</span></div></span></div>",
            "created":1391058000,
            "id":1735366,
            "title":"10 year old boy in diapers"
        },
        "1513":{
            "choices":[
                "home",
                "to school",
                "somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>you are Jack, or as the entire 5th grade population (including adults) calls you, \"Jack the accident.\" you earned this nickname thanks to your small size and the fact that your parents never potty trained you just so they could make fun of you. As such, you are diaper bound for life. But today would be different. You knew this when you got...</span></div></div>",
            "created":1393390800,
            "id":1751759,
            "title":"total incontinence"
        },
        "15132":{
            "choices":[
                "teacher",
                "student"
            ],
            "content":"<div class=\"\"><div> <span>You are in the classroom, sitting in your new seat. you used to have a normal seat among the other classmates, but you made the mistake of asking for a new seat. the day after you asked, your seat and desk was replaced by a highchair. All of a sudden, you feel a strange, deep echoing voice in your head. \"<i> Jack, I am the voice of Karma. You have suffered ten long years of torment because of your infection. I am here to make things right. For the next 30 years, you will have the power to make things the way they should be.\" How?</i> you ask. <i> \"I am giving you the power of Karma. You now have the power to alter ages or continence, or how people perceive that person's age or continence. this works for anyone other than you, because Karma can only work on others.\" AWESOME! 'how does it work? \"simply think, and it shall be done. Just remember. you may not use this power to cause death, or reverse life. Life is sacred, I am only here to encourage the good and turn the bad away.\" thanks. now... who to choose.</i></span></div></div>",
            "created":1393390800,
            "id":1751760,
            "title":"to school"
        },
        "151321":{
            "choices":[
                "regress him",
                "change his continence"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide the teacher was as good a first target as any. you tell the voice that you want to</span></div></span></div>",
            "created":1393390800,
            "id":1751762,
            "title":"teacher"
        },
        "1513211":{
            "choices":[
                "early potty training",
                "a toddler/baby"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><i>\"as you wish. How much do you want me to regress him for you?\" please regress him into </i></span></div></span></div>",
            "created":1393390800,
            "id":1751764,
            "title":"regress him"
        },
        "15132111":{
            "choices":[
                "the teacher asks for your help with the diaper",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span><i>as you wish.</i> suddenly, a ray light flashes from your classroom window and shines on your teacher. his voice gets higher as he drops years faster than a cloud drops hail. \"so, if we divide x by 9, we see dat x becomes da same as thwee!\" his clothes changed too, making him incredibly funny to look at. the light made it so that your teacher who was about 30, became three. his tan suit and red tie became a blue cookie monster shirt and a buzz lightyear pull-up, as his pants had completely disappeared. you then noticed that his pull-up became a lot larger-no wait. that look of relief on his face said he was peeing. the wetness symbol disappeared, and the teacher turned dark red. \"ummm...wun moment pwease!\" he toddled over to your bag, grabbed a diaper from out of it, and went to the bathroom to change himself. You could only barely keep your laughter in, while the rest of the class as dumbfounded as to what just happened. What happens now?</span></div></div>",
            "created":1393390800,
            "id":1751766,
            "title":"early potty training"
        },
        "1513212":{
            "choices":[
                "toddler/baby, total incontinence",
                "little kid, partial incontinence"
            ],
            "content":"<div class=\"\"><div> <span><i>\"of course. to what level shall I reduce his continence?\" \"reduce his continence to ________ please.\" \"as you wish.\" you get a headache, and then a beam of light shoots out one eye, enveloping your teacher. He stopped and looked down as he began ______ing himself, as he had the continence of a ______. you and the entire class laugh at your teacher.</i></span></div></div>",
            "created":1395205200,
            "id":1762984,
            "title":"change his continence"
        },
        "151322":{
            "author_id":"blaze2468",
            "author_name":"O.E",
            "choices":[
                "the main bullies",
                "all the students"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Any student in particular? How about the bullies at school who always makes fun of you? Or all the students, because everyone makes fun of you?</span></div></span></div>",
            "created":1470608640,
            "id":2192535,
            "title":"student"
        },
        "1513221":{
            "author_id":"blaze2468",
            "author_name":"O.E",
            "choices":[
                "Make John's group wet themselves",
                "Make John's group cry loudly"
            ],
            "content":"<div class=\"\"><div> <span>The group that bother you the most at school are four kids who hang out together and are in your class.<br>\r\n<br>\r\n- John (leader)<br>\r\n- Josh (leaders best friend)<br>\r\n- Robert<br>\r\n- Lee<br>\r\n<br>\r\nStarting with these four as a test will give you ideas for what to do to other people. You get to school and go to your locker when someone pulls your pants back looking at your diaper, you turn to see John and his gang<br>\r\n<br>\r\n\"Awe, dows da wittle baby need a change?\" coos John<br>\r\n<br>\r\n\"Shut up John! You'll get what's coming to you\" you say<br>\r\n<br>\r\n\"Sure I will baby, see you class loser\" he says walking away<br>\r\n<br>\r\nYou head to your class and your first period is Math. The teacher is giving a lesson. Time to test this power out</span></div></div>",
            "created":1470609180,
            "id":2192542,
            "title":"the main bullies"
        },
        "15132211":{
            "author_id":"blaze2468",
            "author_name":"O.E",
            "choices":[
                "make the teacher spank them in front of the whole class",
                "make the teacher call the nurse and diaper them"
            ],
            "content":"<div class=\"\"><div> <span>\"All right class what is the answer to- huh!\" says the teacher gasping \"John, did you wet yourself in my class?\"<br>\r\n<br>\r\n\"What no! Of course not I-\" says John looking at his pants<br>\r\n<br>\r\n\"And Josh, Lee and Robert\" says the teacher shocked, then she corrects herself \"up to the front of the class now, all of you\"<br>\r\n<br>\r\nThe gang walks up to the teachers desk<br>\r\n<br>\r\n\"I am ashamed of you boys! You are all in big trouble\"'<br>\r\n<br>\r\nUse your powers again...</span></div></div>",
            "created":1470609600,
            "id":2192545,
            "title":"Make John's group wet themselves"
        },
        "151322112":{
            "author_id":"blaze2468",
            "author_name":"O.E",
            "choices":[
                "all students",
                "just you watching this"
            ],
            "content":"<div class=\"\"><div> <span>The teacher makes a special request to the nurse, due to your powers, and she enters with a pack of diapers, a mat and baby diaper supplies. She puts all the boys on the floor, strips them, and diapers them all in front of the students. You use your powers again to make the rest of the day go like this. Choose for all students to be there and watch or just you</span></div></div>",
            "created":1470611100,
            "id":2192565,
            "title":"make the teacher call the nurse and diaper them"
        },
        "1513221122":{
            "author_id":"blaze2468",
            "author_name":"O.E",
            "choices":[
                "spanking time",
                "sleep time"
            ],
            "content":"<div class=\"\"><div> <span>You use your powers and all the kids leave and go to their other classes, you stay in this room and watch what is happening to the gang, but before you do you make other nurses come into the room and install a few things. Soon the classroom is a full time nursery and you are standing beside the door invisible because of your powers and watch as the bullies get humiliated<br>\r\n<br>\r\n\"I think the babies need to use their diapers instead of their underwear \"am I right?\" she says to the four boys standing in diapers<br>\r\n<br>\r\n\"Y-y-yes m-miss\" they say</span></div></div>",
            "created":1470611340,
            "id":2192568,
            "title":"just you watching this"
        },
        "152":{
            "choices":[
                "can't control pee",
                "can't control mess",
                "both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of incontinence do you have?</span></div></span></div>",
            "created":1391317200,
            "id":1737429,
            "title":"10 year old girl in diapers"
        },
        "153":{
            "choices":[
                "home",
                "school",
                "somewhere else?"
            ],
            "content":"<div class=\"\"><div> <span>you are Mike, and you have lived a very sad decade. due to an undersized bladder, your entire life has been one big wet spot, and as such, you still have to wear pullups, because your parents are mean enough to make you potty train for the rest of your life, insisting you can do it, when you know from eavesdropping that they are just doing it to torment you. You teachers have made it worse, checking you every five minutes, and making you go in a plastic potty instead of the toilet. today is different. you have power like no other. you start at:</span></div></div>",
            "created":1395118800,
            "id":1762339,
            "title":"10 year old boy in pullups"
        },
        "154":{
            "choices":[
                "your mom (you are at home)",
                "the teacher (you are at school)"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Jasmine Bolveat. You are the average 10-year-old girl, with short black hair that curves at the bottom, pale skin, hazel eyes, and (unfortunately) a pullup. When you were born, the doctor couldn't quite grasp you, and you fell from his hands, the umbilical cord yanking on your stomach. You were lucky to have survived, but it did leave your bladder torn beyond repair, so the best they could do was remove the destroyed bladder and put in a medical pipe. however, since there was no way to stop the flow of urine, you could only be half potty trained, leaving you bladder incontinent. You were lost in thought when you felt a warm sensation below your legs. You had peed yourself again! You had to ask to get it changed from the nearest adult, which was... </span></div></div>",
            "created":1400648400,
            "id":1800052,
            "title":"10 year old girl in pullups"
        },
        "155":{
            "choices":[
                "15 year old boy in diapers",
                "15 year old girl in diapers",
                "other ages and ways you are padded"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Something...Cosmic. Something...powerful. Something...Life-changing. The world will pay for making fun of you for being a...</span></div></span></div>",
            "created":1390971600,
            "id":1735069,
            "title":"other ages and ways you are padded"
        },
        "1551":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Just no bladder control",
                "Just no bowel control",
                "No bladder and bowel control at all."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of incontinence do you have?</span></div></span></div>",
            "created":1390971600,
            "id":1735099,
            "title":"15 year old boy in diapers"
        },
        "15511":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "At home.",
                "Somewhere at school."
            ],
            "content":"<div class=\"\"><div> <span>We all know that the life of a 15 male teenager without even a tiny bit of bladder control sucks. But being you sucks even more. For example your cruel older sister makes you wear the thickest and most embarrassing pink princess diapers for someone your size, even while you would only need simple pull-ups to manage you problem, just to humiliate you even further and since she spikes your drinks with very strong laxatives you end up messing your diapers every day. Off course nobody believes you when you tell them the truth, and what's more the permanent laxatives usage damaged your bowel control so badly, that you are now almost constantly messing your diapers.<br>\r\n<br>\r\nBut today was different. Today, a new strentgh flowed through you, today was when you got your well-deserved Revenge <br>\r\nWhere do you start?</span></div></div>",
            "created":1391058000,
            "id":1735434,
            "title":"Just no bladder control"
        },
        "155112":{
            "choices":[
                "in the classroom",
                "somewhere else at school"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where in school?</span></div></span></div>",
            "created":1393477200,
            "id":1752188,
            "title":"Somewhere at school."
        },
        "1551122":{
            "choices":[
                "the nurse's office, getting changed",
                "the lunchroom, being pantsed and mocked"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where, then?</span></div></span></div>",
            "created":1393477200,
            "id":1752189,
            "title":"somewhere else at school"
        },
        "15513":{
            "author_id":"blaze2468",
            "author_name":"O.E",
            "choices":[
                "You were walking in the halls between classes when you feel something strange",
                "You are in the middle of a class when you feel something strange"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have no bladder or bowel control which just makes you an easier target to get bullied</span></div></span></div>",
            "created":1470608460,
            "id":2192533,
            "title":"No bladder and bowel control at all."
        },
        "1552":{
            "choices":[
                "can't control pee",
                "can't control mess",
                "both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of incontinence do you have?</span></div></span></div>",
            "created":1391317200,
            "id":1737521,
            "title":"15 year old girl in diapers"
        },
        "15521":{
            "author_id":"cdg17",
            "author_name":"Charles17",
            "choices":[
                "AT school ",
                "AT home"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Samantha or Sam for short. You are 5'10\". You have red hair and green eyes. You have a every slim body and every boy would want to be your boyfriend. But unlucky for you can't control your pee. It started when you where 7 but it was only at night. Then when you hit 12 you started to wet yourself bring the day time. Your mom makes you wear goodnites all the time. (they look like this <a rel=\"nofollow\" href=\"http://dev-kotex-ext.organic.com/img/product/features/butterfly.jpg\" target=\"_blank\">http://dev-kotex-ext.organic.com/img/pro...</a>). But your big sister makes you wear diapers( they look like this <a rel=\"nofollow\" href=\"https://c1.staticflickr.com/5/4103/5053908978_991a5954ce_z.jpg\" target=\"_blank\">https://c1.staticflickr.com/5/4103/50539...</a> ) when your dad and mom are out of the house for a long time. <br>\r\n<br>\r\n<br>\r\nNow where are you right now?</span></div></div>",
            "created":1418187600,
            "id":1900573,
            "title":"can't control pee"
        },
        "155211":{
            "choices":[
                "the goodnites",
                "the diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you wearing right now?</span></div></span></div>",
            "created":1418187600,
            "id":1900575,
            "title":"AT school "
        },
        "1552112":{
            "author_id":"cornsnake",
            "author_name":"Scare Jules",
            "choices":[
                "Messy",
                "Clean"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Were they wet and dirty or clean?</span></div></span></div>",
            "created":1515177540,
            "id":2437096,
            "title":"the diapers"
        },
        "155212":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "Your whole family",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were at home.  It was a Friday night.  You were at home with...</span></div></span></div>",
            "created":1455843840,
            "id":2106197,
            "title":"AT home"
        },
        "15522":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "of under developed muscles",
                "something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You needed diapers because you couldn't control your messes.  You couldn't control them because...</span></div></span></div>",
            "created":1453611600,
            "id":2093773,
            "title":"can't control mess"
        },
        "155221":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "get breakfast.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>You needed diapers because you couldn't control your messes.  This was caused by under developed muscles.<br>\r\n<br>\r\nThis caused you to wear diapers all the time.  Being in them your whole life, it felt very normal being in them.  Sometimes, you even used the diapers for convenience sake.<br>\r\n<br>\r\nAt the moment, you were sitting on the bed.  You had on one of your night diapers.  The diaper was very messy, and wet.  You also had on pajama pants.  You had on a tank top, and no bra.<br>\r\n<br>\r\nYou decided to get out of bed.   You went to... </span></div></div>",
            "created":1456447920,
            "id":2109574,
            "title":"of under developed muscles"
        },
        "15523":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "of under developed muscles",
                "something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You needed diapers because you were completely incontinent.  This meant you couldn't control your bladder or bowels.<br>\r\n<br>\r\nYou can't control them because...</span></div></span></div>",
            "created":1453611600,
            "id":2093910,
            "title":"both"
        },
        "1553":{
            "choices":[
                "15 year old boy in pullups",
                "15 year old girl in pullups"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Something...Cosmic. Something...powerful. Something...Life-changing. The world will pay for making fun of you for being a...</span></div></span></div>",
            "created":1390971600,
            "id":1735070,
            "title":"other ages and ways you are padded"
        },
        "15531":{
            "choices":[
                "home",
                "school"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">Well, your life has never been easy. Due a birth defect you always had and always will have a weak bladder. But is this a reason the world is treating so bad? Not really! You accept and understand that you have to wear pullups at daytime and diapers to bed, but since you are of above normal intelligence, you can't understand why everyone is treating and telling you are a little boy - you are 15 for gods sake!<br>\r\n<br>\r\nThere is your mom: She loves you..but why cant she see that you are almost completely grown up?<br>\r\nIt already started when you came to that age to begin with school.<br>\r\nWhen you were six, she didn't think you were ready for first grade -even though you were two grades ahead of the rest of your class. So she made a appointment at the local school board to tell them you need more time before grade school classes.<br>\r\nSo you came to first grade when you were already 9 years old, which made you always the oldest one with now 15 years you are just a 6th grader, yet you are smaller than the majority of them! She never was discreet with your condition: she checked on you in public or even in front of classmates, which made it nearly, if not completely impossible for you to make friends, she hires babysitters, orders a 6:30 bedtime for you, etc...<br>\r\n<br>\r\nThen there is your little healthy brother Jim, he is 10 years old. He often tease you and often brags with his potty training and is also making fun of you in front of his friends and many more, and sometimes uses your pullup as a toilet when no one else is looking.<br>\r\n<br>\r\nSchool is even more worse for you, especially since you came to middle school.<br>\r\nThere you have 3 major enemies.<br>\r\nChelsea, a 13 year old popular girl who always picks on weaker students like you.<br>\r\n<br>\r\nMrs Miller, your teacher for math, science and homeroom, who barely left out a opportunity to remind the class what dumb little girl you are and that you are a shame for the whole school, and she even added a new unit: regression, just to have you for the perfect volunteer.<br>\r\n<br>\r\nMrs Moore the school nurse. When you had to go to her to get a new pullup and sometimes fresh pants after your pullups had leaked she always said that if she would be keen about helping kids with accidents she had applied at a primary school or daycare.<br>\r\n<br>\r\n<br>\r\nThere are a lot more people who picked on you..but with your new powers you finally can get your revenge!<br>\r\nBut where do you want to start?</span></span></div></div>",
            "created":1396501200,
            "id":1772937,
            "title":"15 year old boy in pullups"
        },
        "15532":{
            "author_id":"elmo86",
            "author_name":"windelfan",
            "choices":[
                "At home",
                "At school"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nWell, your life has never been easy.<br>\r\nDue a birth defect you always had and always will have a weak bladder.<br>\r\nBut is this a reason the world is treating so bad? You think: No!<br>\r\nYou accept and understand that you have to wear pullups at daytime and diapers to bed, but since you are normal intelligent you cant understand why everyone is treating and telling you are a little girl - you are 15 for gods sake!<br>\r\n<br>\r\nThere is your mom: She loves you..but why cant she see that you are a allmost grown up?<br>\r\nIt allready started when you came to that age to begin with school.<br>\r\nWhen you was six, she didnt thought you were ready for first grade -even you already could count, read and write a bit. So she made a appointment at the local school board to tell them you need more time before grade school classes.<br>\r\nSo you came to first grade when you were already 8 years old which made you always the oldest one..with now 15 years you are just a 7th grader.<br>\r\nShe never was discreet with your bladder conditions: she checked on you in puplic or even in front of classmates and peer group which made it hard for you to make friends, she hires babysitters, orders a early bedtime for you, etc, etc...<br>\r\n<br>\r\nThen there is your little healthy brother Jim, he is 10 years old. He often tease you and often brags with his potty training and is also making fun of you in front of his friends and many more.<br>\r\n<br>\r\nSchool is even more worse for you, especialy since you came to middle school.<br>\r\nThere you have 3 major enemies.<br>\r\nChelsea a 13 year old popular girl who always picks on weaker students like you.<br>\r\n<br>\r\nMrs Miller your teacher for math and science who barely left out a opportunity to remind the class what dumb little girl you are and that you are a shame for the whole shool.<br>\r\n<br>\r\nMrs Moore the school nurse. When you had to go to her to get a new pullup and sometimes fresh pants after your pullups had leaked she allways said that if she would be keen about helping kids with accidents she had applied at a primary school or daycare.<br>\r\n<br>\r\n<br>\r\nThere are a lot more people who picked on you..but with your new powers you finaly can get your revenge!<br>\r\nBut where do you want to start?</span></div></div>",
            "created":1391317200,
            "id":1737123,
            "title":"15 year old girl in pullups"
        },
        "155321":{
            "author_id":"elmo86",
            "author_name":"windelfan",
            "choices":[
                "Let your mom embarass Jim in front of his friends",
                "Let your mom stop treating you like a little kid"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nIt started on a normal Thursday afternoon at home. At least everone else would think it was a normal day, but you, with your new powers knew it would became a very interesting day.<br>\r\nYou are sitting in your room, thinking about how to use your powers.<br>\r\nOf course you are wearing your pullups under your casual clothes but your happy they are still dry.<br>\r\n<br>\r\nSusan, your mom is probably in the living room watching some stupid tv shows and might think that you are playing with dolls or doing other childish things.<br>\r\nSoon, you are sure, she will came to you and check if you are dry and to remind you to go potty -thats her usual routine she did arround any full hour.<br>\r\n<br>\r\nJim is in his room with two friends, Carl and Michael. You can here them loudly how they are playing. From the noises they make you assume that they are playing out <i>Star Wars</i> with simulated light saber sounds.<br>\r\n<br>\r\nNow you finaly have an idea how to use your powers for the first time!<br>\r\n<br>\r\n</span></div></div>",
            "created":1391403600,
            "id":1737887,
            "title":"At home"
        },
        "1553211":{
            "choices":[
                "alter perception of him so that he appears to be an infant to all but you two",
                "other humiliations"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how will you do it?</span></div></span></div>",
            "created":1396501200,
            "id":1772927,
            "title":"Let your mom embarass Jim in front of his friends"
        },
        "1553212":{
            "choices":[
                "altering her continence",
                "other ways of getting out of this"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you suddenly remember when you got your powers, you received a warning that these powers cannot be used on yourself directly. but, you can still make your mom stop treating you badly by...</span></div></span></div>",
            "created":1396501200,
            "id":1772930,
            "title":"Let your mom stop treating you like a little kid"
        },
        "155322":{
            "choices":[
                "your teacher",
                "the students"
            ],
            "content":"<div class=\"\"><div> <span>you are Alexa, and you are in math, in your \"new seat.\" you asked for one away from the rest of the class, and when you walk in, you see that the \"new seat\" was a highchair. you are trying to listen to Mrs Miller talk about quadratic equations, you can't afford to fail a class again, entering as late as you did. you hear a strange deep voice in your head. \"Alexa...I am the Voice of Karma...You have suffered great torment from your family...from your peers...from your teachers...and from your doctors who diagnosed you...I am here to make things right...Since you have suffered 15 years of torment......I will give you 45 years of Power. All you have to do is think about either regressing or progressing someone else's age as long as you don't kill or reverse their lives...think about changing someone else's continence...or think about changing the public's perception of someone else's age or continence...The power will not work on you, as one selfish move with Karma is enough to kill you...So be careful...\" And with that, the voice vanished. Who is the first target?</span></div></div>",
            "created":1393477200,
            "id":1752194,
            "title":"At school"
        }
    },
    "info":{
        "author_id":"fivefooteight",
        "author_name":"tom darcenn",
        "brief_description":"Everyone always bullied you for wearing Diapers, now its there turn.",
        "created":1391033520,
        "description":"<td align=\"left\" class=\"norm\">(This story is solely the idea of the user MANatee, who asked me to create it for them as they were unable. All credit goes to them.)<br>\r\n<br>\r\nUp to now your life hasn't been easy. Due to a condition you still have accidents, as such you've been forced to spend your life in either Diapers or Pull ups (which one is up to you). And believe me, no ones made it easy for you, not your peers, not your family, no one. Everyone's bullied you, teased you, laughed at you, humiliated and embarrassed you, time and time again, without a single break.<br>\r\n<br>\r\nBut perhaps there is some justice in this universe. Perhaps someone has been watching your plight and wants to help. For now you have the power to get the justice you deserve. Where it came from? You have idea. How it works? You don't know. But regardless you now have it. What are these great powers you know possess? Well:<br>\r\n<br>\r\nYou can control others Age's, able to make them either older or younger at will.<br>\r\nYou can control there level Continence ranging from absolute, to the occasional accident, to completely incontinent and anything in between.<br>\r\nYou can also control people's Perception's of others and yourself. You can for example make an adult appear a tiny baby. And once you've altered this perception, reality will alter around them, to make it seem this new perception is real. For instance if you made a son appear to be a baby his mother, then his mother would be able to carry him as if he was a baby and easily force him into things that only a baby could fit into.<br>\r\nYou can also make any of your changes reality, so it seems its always been that way, with only yourself and anyone you chose, remembering the truth.<br>\r\nYou can also undo any changes you make, nothing you can do is irreversible.<br>\r\n<br>\r\nThey all thought it was funny to humiliate you, now lets see how funny they think it is when the roles are swapped.<br>\r\n<br>\r\nHere are the rules:<br>\r\nno swearing.<br>\r\nno killing off the characters.<br>\r\ncharacters have sex (does not extend to minors), but not to extremes.<br>\r\nkeep the language PG13.<br>\r\nspell out everything (no saying \"u\" instead of \"you\").<br>\r\nno one-choice only chapters.<br>\r\nno unbirthing or ageing people to dust, no using age modifications to make them die, whether it be directly or indirectly.<br>\r\nno sudden plot changing (if you must change the plot, then change it over a minimum of 10 chapters, none of which can be 'option' chapters).<br>\r\nthe only short chapters (3 or less sentences) I will allow are 'option' Chapters.<br>\r\nonly the transformations described in the introduction (Age Regression, Age progression, Continence Change, and Perception) are allowed, all others aren't.<br>\r\nno 'reader's choice' chapters.<br>\r\nPlease rate and review<br>\r\nAnd have fun!</td>",
        "id":1974495,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1515177540,
        "modified":1515177540,
        "pretty_title":"Revenge is a Dish Best Served Padded"
    }
}