{
    "chapters":{
        "1":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Luke is mysteriously shrunk at Han's house",
                "Leia is mysteriously shrunk at Annie's house",
                "Luke is shrunk through a different means at Han's",
                "Leia is shrunk through a different means at Annie's",
                "Flurgh."
            ],
            "content":"<div class=\"\"><div> <span>Luke<br>\r\n<br>\r\nYou excitedly pack your clothes into a blue duffel bag. Your parents are leaving for a week! At first, you'd thought you would have been left alone, but it turns out you're just going to stay with Han the whole time. Han is almost eighteen, and his parents are also away. You didn't tell this to your mother, of course.<br>\r\n<br>\r\nFinally, you're ready for your night over. During the day, you will do whatever you want, and at night, you'll just hop over to Han's house. What a week it'll be!<br>\r\n<br>\r\n______________________________________________________________<br>\r\n<br>\r\nLeia<br>\r\n<br>\r\nYou calmly place your belongings into your pink duffel bag. It just isn't fair that your parents have to leave town. Why couldn't they just leave you in charge? You're much more responsible than your twin brother, Luke. Well, at least you'll be at Annie's house. You can do all sorts of things, like shopping! Annie was a shop-a-holic, and sometimes she literally dragged you out to the car to go to the mall near your neighborhood. What a week this will be!</span></div></div>",
            "created":1277096400,
            "id":903340,
            "title":"The Sleepover"
        },
        "11":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Han comes in and instantly spots you",
                "Han gets up from where he'd been searching for something in the room",
                "Han stands up and looks around for you, thinking you're normal size",
                "Han walks in, grunts, and leaves, no doubt to take a shower.",
                "Flurgh."
            ],
            "content":"<div class=\"\"><div> <span>You wake up with a pounding headache. Man, Han had better get a nicer, softer bed than this. God, what a headache. And why is the wind blowing? I thought I had the window closed...<br>\r\n<br>\r\nYou sit, bolt upright. You're sitting on an expanse of sheets in a plateau that seems miles wide. What's going on? Turning, you see the clock is far, far away from where you are. You shrank! But where is Han? Maybe he can help.<br>\r\n<br>\r\nStanding up, you look around. You are well-built and tall for your age, and right now you are only wearing boxer shorts and a plain white T-shirt, the clothes you slept in. You were about to sleep nude like you usually do, but for God's sake, Han was sleeping in this bed last night.</span></div></div>",
            "created":1277096400,
            "id":903342,
            "title":"Luke is mysteriously shrunk at Han's house"
        },
        "111":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "A chemical imbalance is righteed by the mix",
                "nothing happens. ",
                "Eww...I'm not eating that!"
            ],
            "content":"<div class=\"\"><div> <span>Han walks in, fresh from his shower, and instantly spots you sitting on the bed.<br>\r\n<br>\r\nHan is well-built and slightly above average in pretty much everything -- except bodybuilding. He's an easy gainer, the type that pack muscle on extremely quickly, and he's been an amateur bodybuilder for a few years now. His muscles stand out as he dashes over to the bed, accidentally dropping his towel from his side in the process. You can't see below his waist, but that's not your concern.<br>\r\n<br>\r\n\"How did you get this size?\" asks Han breathlessly.<br>\r\n<br>\r\n\"I don't know!\" you reply. \"I woke up this way and I don't know how to get back!\"<br>\r\n<br>\r\n\"Don't worry!\" he says. \"I have a plan!\"<br>\r\n<br>\r\n\"What kind of plan?\"<br>\r\n<br>\r\n\"The kind that works! Now shut up!\"<br>\r\n<br>\r\nHan reaches into a drawer and pulls out a small packet of drink mix for one of his bodybuilder protein shakes. Pouring out the packet in front of you, he tells you to eat.</span></div></div>",
            "created":1277111220,
            "id":903397,
            "title":"Han comes in and instantly spots you"
        },
        "1111":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "You could ride on my...you know...",
                "I'll go get something to put you on!",
                "Flurgh."
            ],
            "content":"<div class=\"\"><div> <span>After eating the nasty stuff, you wait a minute, then double over in pain.<br>\r\n<br>\r\n\"Oh, God, Han, it hurts! Make it stop! I'm growing too fast!\"<br>\r\n<br>\r\nHan can see you are a little bit taller than before. He gets excited, but scowls when he sees you're really doubled over with laughter. You settle down off your tiptoes and look at him.<br>\r\n<br>\r\n\"Did you really expect that to work? It isn't a magic growth mix, ya know.\"<br>\r\n<br>\r\nHan is crestfallen, and you begin to feel a little sorry for him. He did try his hardest.<br>\r\n<br>\r\n\"But get some clothes on, please! This is, if I do say so myself, rather awkward.\"<br>\r\n<br>\r\nHan brightens up and searches in his drawer. His face says more than any words he could say. No-underwear-sorry is about to come out of his mouth. His mouth opens and you stop it by talking.<br>\r\n<br>\r\n\"No. You know what? I really don't care. Now, I want to go on the Internet; maybe there'll be something there.\" Han seems to think so, too. He starts to pick you up, but stops. Oh, great. Now what?<br>\r\n<br>\r\n\"It could hurt,\" explains Han. \"I don't want to crush you.\" One look at his biceps explains his concern. Then, he brightens up. Oh, no. You know that look well; Han's about to suggest a brilliant idea you won't like, and you can't help but go along with it because you know it's a good idea.</span></div></div>",
            "created":1286245860,
            "id":968954,
            "title":"A chemical imbalance is righted by the mix"
        },
        "11111":{
            "choices":[
                "He's your best buddy, after all...",
                "HAIL no!!! He's your best buddy!!!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\"><span style=\"font-family:comic sans ms, cursive\"><span class=\"cblue\"><br>\r\n<br>\r\nHan grins and cocks his head to the right. \"You could ride on my...you know...\" He cocked his head <br>\r\n<br>\r\nto the right again.<br>\r\n<br>\r\nYou gasp. \"Dude! Gross!\"<br>\r\n<br>\r\nHan blinks at you and points at his right shoulder. You feel the heat rise in your face.<br>\r\n<br>\r\n\"Oh. Sure, I guess that could work.\"<br>\r\n<br>\r\nHan scoops you up (with softer hands than you'd think, and smelling vaguely of Vasoline) and puts <br>\r\n<br>\r\nyou on his shoulder. You hold his ear to steady yourself, and he walks down the stairs.<br>\r\n<br>\r\n\"I left my laptop in the den.\" He turns down the hallway, past the kitchen, past the windows <br>\r\n<br>\r\noverlooking the street (you notice a passing soccer mom hit a curb watching him) and into the den. <br>\r\n<br>\r\nYou see his laptop sitting on the big couch. He plops down with one leg under him. The force jerks <br>\r\n<br>\r\nyou away from his ear. You slide down his chest onto his thigh.<br>\r\n<br>\r\n\"WHOA. Are you okay?\" he asks.<br>\r\n<br>\r\nYou sit up and take a breath. \"Yeah. Let's look and hope we can fix this damn thing.\"<br>\r\n<br>\r\nHan clicks it on and clicks the Internet browser. You slide down his thigh and sit on the edge of the <br>\r\n<br>\r\nlaptop. You lean back against the shin of the leg he's sitting on. It's a good spot.<br>\r\n<br>\r\nThe homepage loads. A blonde is getting it both ways from two well-endowed guys.<br>\r\n<br>\r\n\"What the FUCK?\"<br>\r\n<br>\r\nHan chuckles nervously. \"What can I say? I like to start my searches off on the right foot.\"<br>\r\n<br>\r\nHe doesn't click it away. You don't really mind. Small as you are, and large as the video is, it's kind of <br>\r\n<br>\r\nmesmerizing. You feel yourself stiffen. You relax even more and get into the action. It's quite some <br>\r\n<br>\r\ntime before you realize you're not holding your head up anymore. You feel around and realize you're <br>\r\n<br>\r\nleaning your head back on something soft and spongy.<br>\r\n<br>\r\nYou slowly sit up and turn. Yep, it was his penis. It's erect and pointing straight at you.<br>\r\n<br>\r\nHe looks at you. You're not sure how you feel about that glow in his eyes.<br>\r\n<br>\r\nHe tries to speak, and eventually manages, \"That felt kind of nice.\"<br>\r\n<br>\r\nYou aren't disgusted. You aren't really thinking about much right now. You both are caught in a weird <br>\r\n<br>\r\nsort of daze. You calmly ask, \"What do you mean?\"<br>\r\n<br>\r\n\"It just felt...good. Could...could you do it again?\"<br>\r\n<br>\r\nHe asks so sincerely that you oblige without question. You rub the back of your head on the end of his penis. His eyes roll back a little.<br>\r\n<br>\r\nYou step back and look up at him. He looks down at you with a begging look in his eyes.<br>\r\n<br>\r\n\"Please. Could...could you......could you rub it?\"<br>\r\n<br>\r\nYour heart picks up speed. \"What?\"<br>\r\n<br>\r\nHan blushes. \"I dunno, I guess I got a dwarf fetish or something, but...oh, please, I can't explain, I just <i>want it...</i>\"<br>\r\n<br>\r\nThe desperation is thick in his voice. It almost makes you feel for him.</span></span></font></span></div></div>",
            "created":1288836660,
            "id":986383,
            "title":"You could ride on my...you know..."
        },
        "1112":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Online",
                "To the gym",
                "Han bought some without thinking, but never used it."
            ],
            "content":"<div class=\"\"><div> <span>Scooping up the powder, in granules the size of your fingernails, you stuff it into your mouth. However, you collapse, sick, in a moment and nothing has changed.<br>\r\n<br>\r\n\"Do you have anything immediate?\" you ask queasily.<br>\r\n<br>\r\n\"Nope. Not even a weight to lift. I go to the gym for everything.\" he says glumly.<br>\r\n<br>\r\n\"Well, maybe we could try anabolic steroids or something.\"<br>\r\n<br>\r\nHan looks shocked. \"Those things mess you up really bad!\"<br>\r\n<br>\r\nYou give him a withering glare. \"Do you really think I care about that right know?\"<br>\r\n<br>\r\nHan realizes what he's talking about. \"I suppose it's only once,\" he mumbles.</span></div></div>",
            "created":1277111520,
            "id":903402,
            "title":"nothing happens. "
        },
        "11123":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Bulk up to massive proportions but only gain about six inches in height",
                "Bulk up a bit and grow back to normal"
            ],
            "content":"<div class=\"\"><div> <span>Han looks embarrassed and won't meet you eyes.<br>\r\n<br>\r\n\"Han, have you been using steroids?\" you ask accusingly.<br>\r\n<br>\r\n\"No. It's just...ah...a moment of...er...weakness...oh, come with me.\"<br>\r\n<br>\r\nHan sets down his hand next to you and you climb on. Han walks down to the basement and into his rec room. His parents gave it to him to practice his bodybuilding, but he only uses it for hanging out -- not that they'd ever gone in there to find out. Han lifted away a faux bodybuilding machine and put it to one side. Behind it was a false panel in the wall. Han pushed the panel and it slid upwards and out of sight. Reaching his hand into the gap, Han pulled out a syringe and a few vials of liquid.<br>\r\n<br>\r\n\"Han!\"<br>\r\n<br>\r\n\"It's not what you think! I bought some when I just started bodybuilding, but then I learned what would happen if you used them!\" He looked down at his sack and shuddered. Setting you down on a flat table, you saw him disinfecting the needle and putting the steroids in it. This was going to hurt.<br>\r\n<br>\r\nHan brings the needle gently into your arm. At this size, it would take a miracle to hit the vein, but Han attaches a weird clamp to your arm that drives the needle in gently and accurately, loaded with 20cc of the drug. Instead of merely clinging to a spot on your arm, it encircles it, but the job is done nonetheless. You get up and instantly...</span></div></div>",
            "created":1277112060,
            "id":903411,
            "title":"Han bought some without thinking but never used it"
        },
        "111231":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Another six inches and multiplied muscle",
                "Balls to normal!"
            ],
            "content":"<div class=\"\"><div> <span>You feel a bit dizzy, and totter around. After all, you've just been filled with a drug, and you're feeling a bit bloated. When the drug takes effect, though, it'll be quite an effect at your small size. You flex your muscles, already imagining what you'll look like when you're done. It's then that you notice the counter moving away.<br>\r\n<br>\r\nYou look down at your abs and see them start to poke out. All traces of fat vanish, and your pectorals bulge out until they're like breasts, only more square. Your body starts small but muscular at the head, then thickens out to huge at the shoulders. It tapers to a point at your waist, but widens up below that, then narrows to broad, muscular feet. Your penis grows, but your balls start to shrink. Han has a solution for that, too. Another needle in...</span></div></div>",
            "created":1277112420,
            "id":903413,
            "title":"Bulk up"
        },
        "1113":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You look at the powder in front of you, and say \"... No, man, I don't trust that stuff!\"<br>\r\n<br>\r\n\"Don't you wanna get buff like me?\"<br>\r\n<br>\r\n\"Definitely, but I want to do it the natural way!\"<br>\r\n<br>\r\nHan scoffs \"natural smatural! Look man, this stuff will get you there faster!\"<br>\r\n<br>\r\n\"Ugh, fine!\" You hesitatingly take a bite, getting some of the powder in your mouth; it tastes chalky. You look up at him and say \"happy?\" You then feel dizzy, and pass out.<br>\r\n<br>\r\nWas he tricking you?</span></div></div>",
            "created":1448917200,
            "id":2068519,
            "title":"Eww...I'm not eating that!"
        },
        "113":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Yell louder! Be annoying!",
                "Cross the bed and hope you make it!",
                "Bah humbug. Wait for him to notice you."
            ],
            "content":"<div class=\"\"><div> <span>A full head of spiky orange hair pops up into view, and you see with relief that it's Han. He's wearing his own boxers and T-shirt, and right now he's looking for you.<br>\r\n<br>\r\n\"Luke? Where did you go?\" he calls, poking around. <br>\r\n<br>\r\n\"Right here!\" you yell, but your voice is too high-pitched and quiet for him to hear, especially when he's looking around for things.</span></div></div>",
            "created":1277264700,
            "id":904678,
            "title":"Han stands up and looks around for you, thinkin..."
        },
        "114":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "God, this is boring."
            ],
            "content":"<div class=\"\"><div> <span>Han enters the room groggily. Not noticing you, he scratches his stomach through his red T-Shirt and his crotch through his matching boxers, then grunts like a gorilla and heads sleepily for the bathroom to take a shower. You fruitlessly attempt to catch him before he leaves, but you can't even reach the edge of the bed before the shower door closes. Oh well. You'll get him when he comes back.</span></div></div>",
            "created":1277096400,
            "id":903344,
            "title":"Han walks in, grunts, and leaves, no doubt to t..."
        },
        "1141":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Turn away -- and fast!",
                "Too slow! You're best friends, anyway...and who's to know?"
            ],
            "content":"<div class=\"\"><div> <span>You can hear the sounds of Han taking a shower through the thin walls of Han's bedroom. It takes an eternity, but the water sounds cease and you hear thunderous footsteps come slowly to the door. It's Han, and he locks the door behind him.<br>\r\n<br>\r\nHan is about six foot three, one of those tall, beefy Asian guys that pretty much got out of the lucky end of the gene pool. Despite his name, he's South Korean, and fiercely patriotic. He's been an amateur bodybuilder for three years now, and his body has most people green with envy. His biceps move underneath his tan skin as he turns the lock in the doorknob, and his torso unconsciously flexes again as he turns to get clothes from the drawer. Suddenly, you realize that Han hasn't seen you yet, and he's about to go in the buff -- right in front of you! You're pretty close friends, but this is taking it too far. What to do now?</span></div></div>",
            "created":1277096400,
            "id":903348,
            "title":"God, this is boring."
        },
        "11412":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "You! Your cover's blown!",
                "Your duffel bag sitting in the corner."
            ],
            "content":"<div class=\"\"><div> <span>You realize that he's really gonna do it just as he does it. Han drops the towel from around his waist and rummages around the cabinet in search of underwear. The sight of his naked, buff body sets you off, even though you're straighter than a set of parallel lines. The shrinking must have played with your mind a bit. Hopefully, that'll end when you're back to normal size.<br>\r\n<br>\r\nHan finishes his search -- there are no underpants left in his drawer. Suddenly, he looks up and spots...</span></div></div>",
            "created":1277096400,
            "id":903352,
            "title":"Too slow! You're best friends, anyway..."
        },
        "114121":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "...Hungry...",
                "No! Get me back, and quickly!"
            ],
            "content":"<div class=\"\"><div> <span>Han looks squarely at you. Walking over, his quest for pants totally forgotten, he walks over to you curiously. The sight of his naked body and pretty darn large penis mesmerize you and you can't move until he's come close to you and is staring at your tiny size.<br>\r\n<br>\r\n\"Luke? Is that you?\"<br>\r\n<br>\r\n\"No, it's some other guy who looks like me. Yes, of course it's me!\" you say, somewhat sarcastically.<br>\r\n<br>\r\n\"How did this happen?\" he continues, ignoring the jibe. \"Do you know?\"<br>\r\n<br>\r\n\"Nope,\" you answer, \"no idea whatsoever.\"<br>\r\n<br>\r\n\"Well, it's time for breakfast. Nobody's home, and as another guy, I don't think you care if I'm naked, so let's just go eat. My laundry's empty, in case you haven't noticed.\"</span></div></div>",
            "created":1277096400,
            "id":903354,
            "title":"You! Your cover's blown!"
        },
        "1141211":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "You tell him about your boxers.",
                "Nah...this is rather mesmerizing..."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm starving, Han! Let's eat. Maybe food will change me back, eh?\"<br>\r\n<br>\r\nBy the third bit of sausage, it is quite clear that eating will most definitely not change you back.<br>\r\n<br>\r\n\"I'm full now. My stomach is so tiny, I think that bit of sausage caused it to burst.\" You pat your swollen belly and grin weakly. Han digs in. He's hungry, you see with some version of grossed-outness, and you hope there's enough food for a week in his refridgerator. He can hardly go out to buy food; that would be streaking in a public place, if the man can't find any underwear.<br>\r\n<br>\r\nBut there is, you remember suddenly, and you know where to find it. Normal sized undies, waiting just for you! The kind your folks don't swipe while they're on their six-week vacation.</span></div></div>",
            "created":1286242500,
            "id":968933,
            "title":"...Hungry..."
        },
        "114122":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Collapses onto the bed",
                "Stomps out of the room"
            ],
            "content":"<div class=\"\"><div> <span>You hadn't packed any underwear in there -- you wear clean underwear during the night, so you don't have to change in the morning -- and Han grunts in frustration. You aren't sure if he cares about being naked, but you are aroused as all heck. Oh, lordy. What a mess.<br>\r\n<br>\r\nYou jump up and down, trying to get his attention, but he doesn't seem to notice. Finally, he grunts in frustration and...</span></div></div>",
            "created":1277096400,
            "id":903363,
            "title":"Your duffel bag sitting in the corner."
        },
        "1141221":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Your clothes begin to grow back to normal",
                "Han shifts in his sleep"
            ],
            "content":"<div class=\"\"><div> <span>Whew, that was close.<br>\r\n<br>\r\nHan fell on the side of the bed opposite from where you were. From where you were standing, it was a simple matter to climb onto his crotch, unfortunately about the only place you could reach, and haul yourself up to Han's flat stomach. As you were climbing through his legs, however...</span></div></div>",
            "created":1277096400,
            "id":903366,
            "title":"Collapses onto the bed"
        },
        "11412211":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Kick him in the chin",
                "Thump his chest!"
            ],
            "content":"<div class=\"\"><div> <span>As you pull yourself up and are standing next to Han's now-enormous penis, you feel the elastic band around your waist start to loosen. As it grows to your height, you realize that it's growing back to its normal size. If Han sees it, he'll put it on and leave. You can't risk that! Ripping off your trousers, you tossed the growing ball of cloth over the edge of the bed, unnoticed by the sleeping Han. At that moment, you feel your shirt begin to grow, too. As much as you hate to do this, you muster up your courage and throw that away, too. Standing naked next to Han's penis is more than a little weird, and you hurry away from it as fast as you can, feeling the beginnings of a boner.<br>\r\n<br>\r\nClambering over Han's washboard abs is challenging but doable and actually quite fun. His wildly moving pecs are difficult, too, but they are expansive even at your normal size, and you don't fall off. Finally, you reach his throat.</span></div></div>",
            "created":1277109360,
            "id":903371,
            "title":"Well, this is awkward."
        },
        "114122112":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "The stench is VILE.",
                "Han wakes up. Mission accomplished...and awkward."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh God!\" You've just realized the futility of your actions. He's not a small person even at normal size, but at four or five hundred feet tall, compared to you, he'd never realize you're there, even if you bounced on his nose. Still, you feel obligated to try.<br>\r\n<br>\r\nChest is no good. Han is particularly proud of his chest, which he sculpted almost exclusively through his training. It's about as hard as you are; despite all your efforts, you can't make any progress on that paragon of gym training. That leaves...<br>\r\n<br>\r\nThe throat is too wide, and too curving. You simply can't get across to his face, that smooth, tan, Asian face, marked with the beginnings of stubble and just now appearing to be the most wonderful place to sit in the entire world. There's no way you'd make a dent in his abdomen, either, or his armpits, or pretty much anywhere else, except...<br>\r\n<br>\r\nYou've been dreading this moment, the part of the show where you step on someone's balls to wake them up. How are you going to explain this? You're naked, and tiny. Who's to say you aren't making a legitimate move on him? Unfortunately, there's no other option. Climbing back over his tumultuous upper body, you hold your breath and jump on.</span></div></div>",
            "created":1286241960,
            "id":968923,
            "title":"Thump his chest!"
        },
        "13":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Sit down",
                "Gesture for him to sit down",
                "Avoid sitting down.",
                "See something strange.",
                "Flurgh."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Han!\"<br>\r\n\"Hey, Luke!\"<br>\r\nYou have arrived at Han's, where you'll be spending the week. Tossing your bag to one corner of the room, you slap Han on the back and follow him in. Han is an amateur bodybuilder, and works out every day for an hour after school. He isn't that big compared to, say, a comic book superhero, but he's pretty darn well-muscled. His spiky orange hair bobs as he shows you to the room you'll be staying in. After that, he opens the door to the basement, and you see a strange weight-lifting machine in the middle of an expansive space. Han's family included a laboratory space for him, but he never used it. You were surprised to see the lonely-looking machine just sitting there. Suddenly, Han moves over to it and gesture for you to sit down. You...</span></div></div>",
            "created":1277265240,
            "id":904685,
            "title":"Luke is shrunk through a different means at Han's"
        },
        "131":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Han gets smaller",
                "Han gets bigger",
                "Flurgh."
            ],
            "content":"<div class=\"\"><div> <span>You are slightly confused, but you follow his instructions and set yourself on the cushioned black seat. Suddenly, Han walks over to a computer terminal you hadn't seen before. As you watch, he pushes a button and the machine changes shape to form a sort of cocoon around you, sliding cleverly on hidden hinges. Little green lights wink at you, and you find that moving your hands causes a window to move. You slide the window towards Han, and watch as he pushes another button. The little green lights flash red, and get a lot closer. Soon, they've adapted to the shape of your body. After that...</span></div></div>",
            "created":1277265420,
            "id":904689,
            "title":"Sit down"
        },
        "1311":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "You were about eight feet tall",
                "You were about ten feet tall",
                "You were over twenty feet tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you watched, the window began to shrink, as did Han and the terminal. The world was getting smaller!<br>\r\n<br>\r\nAfter a minute or so, Han pushed a tiny button and the walls of the cocoon began to retract. You saw that...</span></div></span></div>",
            "created":1277265540,
            "id":904692,
            "title":"Han gets smaller"
        },
        "13112":{
            "author_id":"blurghy",
            "author_name":"Blargh",
            "choices":[
                "Pick Han up!",
                "Put me back!"
            ],
            "content":"<div class=\"\"><div> <span>Raising your palm, you saw that it was enormous and thick, totally opposite from your average fingers and slim build. Your chest must be at least eleven feet around, judging from how wide it is, and your pectorals are larger than Han is. Your abs are probably the size of Han's enormous pecs, and your arms are as long and thick as you were. Your thingie is covered by your pants, but you can see a strange bulge in your crotch and you can feel skin down you your massive knees. You'd pulled off your shirt to see your growth, and you could see that you were now probably the tallest, strongest, and overall bestest guy ever. But what could you possibly do with it?</span></div></div>",
            "created":1277271780,
            "id":904760,
            "title":"You were about ten feet tall"
        }
    },
    "info":{
        "author_id":"blurghy",
        "author_name":"Blargh",
        "brief_description":"A little adventure.",
        "created":1277106240,
        "description":"<td align=\"left\" class=\"norm\">I am dissatisfied with the sheer amount of stories centered on fanfiction. First of all, Pikachu was never, ever meant to do that.Secondly, shrinking stories always end badly. So, I'm going to start one of my own and it'll help a bit. Hopefully. If you want to randomly find it, just type in \"flurgh\" -- I set that as one of the tags and I somehow doubt anyone else used that as a tag for their story. Give them a cookie if they did.<br>\r\n<br>\r\nYou are a teenager staying over at a friend's house. The first post will include both POV's, then ways for your chosen character to shrink. Two are for female character, one is for male character, and the last one is simply labeled \"flurgh\". Try to keep that one unwritten and maybe I'll tell everyone what it means another time.<br>\r\n<br>\r\nThe male main character is named Luke. He'll be at a sleepover with his friend Han. Luke and Han are both seventeen; Luke is Caucasian and Han is Asian. Luke has sandy blond hair, and Han has spiky orange hair (hint: he's a rebel).<br>\r\n<br>\r\nThe female main character is named Leia. So I'm not original. She's staying with her friend Annie. Leia has brown hair, tied up into coiled pigtails, and Annie has shoulder-length blond hair. They are both seventeen as well.<br>\r\n<br>\r\nWell, I'll start the narrative and we'll go forward from there.<br>\r\n<br>\r\nMay the Force be with you!</td>",
        "id":1683922,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1448917200,
        "modified":1448917200,
        "pretty_title":"Squirt"
    }
}