{
    "chapters":{
        "1":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Let him go get the Captain",
                "Don't let him go get the Captain"
            ],
            "content":"<div class=\"\"><div> <span>Catalina aboards her family's ship. Just getting done with college to become a teacher, she's now on her way back to the United States. Her parents want her to become a school teacher, but she would rather\r<br>\nwrite stories and poems. \r<br>\n\r<br>\nThe bright sunshine shown through her bedroom\r<br>\nwindow. She sat up on her cot and looked at\r<br>\nthe mohagany desk to her right. She hurried to get dressed. Today she would have lunch with Thomas Kellinger, the Captain's assistant, and also a crush of hers. She gets\r<br>\ninto her best dress, and shoes and heads to the deck. Of course, she must have breakfast.\r<br>\n\r<br>\nSitting on deck, and letting the sun shine down on you, and letting the wind blow through your hair is the best way to enjoy the day. Your black curly hair hangs to your lower back. You took it out of your bun so that the wind could blow through it. \"You know, I believe you're the first girl I've ever met who has dark hair with bright blue\r<br>\neyes,\" Thomas said coming up to the front of\r<br>\nthe ship with you. \"Thank you Thomas,\" feeling flattered. \"Are you ready for lunch?\"\r<br>\nThomas asked. \"Almost. I would just like to rest on the deck if you don't mind,\" You reply politely. \"That's fine with me,\" he replies leaning against the railing. \"What is\r<br>\nthat?\" You ask looking far off into the distance? \"I'm not sure. Let me go get the captain,\" Thomas replied.</span></div></div>",
            "created":967698000,
            "id":3636,
            "title":"Homeward Bound"
        },
        "11":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "go run and hide",
                "stay and see what happens",
                "go with thomas to the captains cabin"
            ],
            "content":"<div class=\"\"><div> <span>You stare worriedly into the distance, a pirate ship? God forbid!  As you think back of all the pirate stories you've ever heard, how entire ships are set aflame with the crew on board, and how other crews have been killed through torture, the only remaining traces being a floating body part here or there, what the sharks didn't get, you nervously begin to bite your finger nails. Then remind yoursef of that you promised to give that habit up three years ago.\r<br>\n\r<br>\nYou look around, where is Thomas?  You wish that he, or the captain, or anyone for that matter would come up deck near you to inform you of what is going on.  \r<br>\n\r<br>\nThe ship has drawn nearer during the passing time.  You now are able to observe the lack of a flag flying- not a good sign.  \r<br>\n\r<br>\nYou sigh and look around.  Surprisingly, the deck is deserted.  There isn't a soul around.  Alone, and feeling alone, on deck you stand and watch the approaching ship with dread wishing you could melt into the boards or sink beneath the waves.  </span></div></div>",
            "created":967698000,
            "id":3646,
            "title":"worried anticipation"
        },
        "111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Go and see if anyone can help you",
                "Go back to the closet"
            ],
            "content":"<div class=\"\"><div> <span>You run and hide inside a closet. A storage\r<br>\ncloset. One used by the spit crew. The people\r<br>\nwho clean the decks. You slide to the bottom,\r<br>\nand cover yourself with the mops. They smell\r<br>\nmucky, and like mildew. You hear voices out-\r<br>\nside. They are all muffled, so you can't hear\r<br>\nwhat anyone is saying. \r<br>\n\r<br>\nSoon, everything is quiet. You open the door,\r<br>\nand you don't see anything. You turn left and\r<br>\nwalk back on deck. The ship is still there to\r<br>\nyour ship, so you crawl on your hands and knees so that they won't see you. Your fear\r<br>\nis so strong inside of you, that in a way,\r<br>\nyou wish you were dead.</span></div></div>",
            "created":968475600,
            "id":3649,
            "title":"Quiet"
        },
        "1111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Go and see who that other body is",
                "Keep going"
            ],
            "content":"<div class=\"\"><div> <span>You begin to crawl towards the captain's cabin. There is no whisper, no noise what-\r<br>\nso-ever. You peek in, and you see two bodies.\r<br>\nThey are laying face down on the floor. You\r<br>\ncan tell one is the captain's, but you can't\r<br>\ntell who the other body is. A chill creeps\r<br>\nup your spine. A feeling you've never had\r<br>\nbefore. </span></div></div>",
            "created":968475600,
            "id":3650,
            "title":"The bodies"
        },
        "11111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Stay there",
                "Kick him and run"
            ],
            "content":"<div class=\"\"><div> <span>You crawl up to the body to see who it is. You go onto the other side. You lift the head and gasp. Tears build up in your eyes.\r<br>\nYou put your head down and cry. It was Thomas. Your love, your crush, your sweety.\r<br>\nYou just wanted to crawl up and die somewhere. \r<br>\n\r<br>\nYou hear something. It sounds like footprints. You crawl and hide underneath\r<br>\nthe bed. You slide and hide near the wall.\r<br>\n\"Tylas, come here! I think I heard something\r<br>\nin here! It sounded like crying!\" exclaimed\r<br>\na voice. You hear another set of footprints.\r<br>\nThis time they sounded like they were running. \"What Hugo? What did you hear?\" asked Tylas. \"Sounds like cryin! What ever\r<br>\nit was, it didn't leave this room!\" Hugo\r<br>\nexclaimed. \"Start searchin!\" Tylas replied.\r<br>\n\r<br>\nYou are so scared. You aren't sure what these\r<br>\npeople were going to do to you. You've heard\r<br>\nall kinds of stories, of what pirates did\r<br>\nto people. \"What was that?\" Tylas asked.\r<br>\n\"What?\" Hugo asked. \"I think it came from\r<br>\nunder there,\" Tylas replied. Hugo kneeled on\r<br>\nthe floor. He looked under the bed and spots\r<br>\nyou.</span></div></div>",
            "created":968475600,
            "id":3652,
            "title":"Being Spotted"
        },
        "111111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Stand up against them",
                "Remain quiet"
            ],
            "content":"<div class=\"\"><div> <span>You stay there in total shock. He reaches\r<br>\nhis hand underneath, trying to reach your\r<br>\nfoot. He grabs it and begins to pull you out.\r<br>\n\r<br>\nWhen you are fully out from under the bed,\r<br>\nthe men stare at you. \"Who are you, and what\r<br>\nare you doing under there?\" One man asks.</span></div></div>",
            "created":975214800,
            "id":13896,
            "title":"Out in The Open"
        },
        "1111111":{
            "author_name":"Aisuru",
            "choices":[
                "Story continues"
            ],
            "content":"<div class=\"\"><div> <span>You look up at the pirates from your position on the floor.  One of the pirates standing over you appears to be on the young side.  The arrogant snarl on his face and the muscular arms fisted on his hips leave you no doubt that the innocence of youth had been replaced with the necessity to be tough and perhaps cruel to survive as a pirate.  The other man is a bit older, broad in the shoulders and chest, his chocolate-brown hair tied at the nape of his neck with a piece of twine.  His expression is unreadable.  \r<br>\n\r<br>\nYou try to regain some of your dignity by standing, only to find that the older pirate still hasn't let go of your ankle.  Irritation at his familiarity momentarily overcomes the mingling fear and sorrow you had been feeling moments before.  \"Unhand me, you brute!\" you exclaim, kicking yourself free of his grasp.  His eyes narrow, but he releases you and you jump to your feet.  \r<br>\n\r<br>\nYou make a show of brushing the dust bunnies off of your skirts as if this task is more important than addressing the pirates in front of you.  The older one stands with an annoyed sigh, towering over you.\r<br>\n\r<br>\n\"Your name,\" he repeats.\r<br>\n\r<br>\nYou look up at him, masking your fear and pain with the cool, collected, upper-class, snobby look you saw so often in England.  \"My name is Catalina Sherwood.  You, of course, may call me Miss Sherwood.\"\r<br>\n\r<br>\n\"So, *Miss* Sherwood,\" he begins, stressing the Miss in a mocking tone, \"What is a fine *lady* such as yourself doing on a little boat in the middle of the Atlantic Ocean?\"\r<br>\n\r<br>\nYou manage to mask your surprise at your father's finest ship being called a little boat.  \"Why, this is my father's *little boat* and I have finished my college education in England and am returning home to the United States,\" you reply, keeping your eyes cool, your spine straight, and your head held high.  \r<br>\n\r<br>\n\"You mean you *were* on your way to the United States,\" the younger pirate interrupts.  \"Hey, Hugo, what do you say we leave this little *lady* here, finish taking over the ship, and then come back for a little fun!\"\r<br>\n\r<br>\nOne look at the leer on the young pirate's face and you are certain you aren't interested in the *fun* he is suggesting.  You try to suppress the shudder of revulsion and fear that ripples through you.  \r<br>\n\r<br>\n\"I agree with that part about leaving her here for now,\" the pirate named Hugo starts, \"but I think you'll be leaving this one untouched.  If this really is her father's ship, she could be of value for ransom.  I can't imagine she'd be of much use after you and your friends would get through with her.\"\r<br>\n\r<br>\nThe younger pirate actually smiles proudly as if Hugo has given him a great compliment.  This time you can't fully suppress your shudder when he turns to look at you.  \"Your loss, my pretty little lady,\" he taunts, undressing you with his eyes.  \"I'm sure me and the boys could have shown you a real good time before we slit your throat!\"\r<br>\n\r<br>\nHugo's expression remains unreadable.  \"Why don't you get us some rope,\" he says instead.  Without warning, Hugo picks you up, tossing you over his shoulder like a sack of potatoes, and walks across the Captain's cabin.  Your struggling, but your aren't even sure if Hugo notices.  \r<br>\n\r<br>\nTo your disgust, he steps over the body of your beloved Thomas as if he wasn't there.  Looking down at Thomas' lifeless body from the height of the pirate's shoulder, the sadness wells up inside you anew.  By the time you have been uncerimonially tied into the captain's chair, the tears are flowing freely down your face.  'So much for my brave front,' you think in self-disgust.\r<br>\n\r<br>\nYour position in the captain's chair gives you a clear view of Thomas.  His head is still turned to the side, and his open unseeing eyes are facing you.  For the first time you realize that he is lying in a pool of blood and gore.  Images from the fun weeks on the boat with Thomas flash through your mind.  It seems so unfair that sweet Thomas would end up as such.  The injustice brings a fresh flood of tears.\r<br>\n\r<br>\nHugo seems to notice your distress.  He bends down and closes Thomas' eyes, and then pulls a blanket off of the Captain's bed, covering the still bodies of Thomas and the Captain.  Hugo then turns and faces you.  \"If I were you, Miss Sherwood,\" he says in an voice unusually void of emotion, \"I would be more worried about your fate than that of your father's men.\"  \r<br>\n\r<br>\nAnd then he is gone.</span></div></div>",
            "created":975474000,
            "id":14397,
            "title":"Meeting the pirates"
        },
        "11111111":{
            "author_name":"Aisuru",
            "choices":[
                "Scream for Hugo or one of your father's men to save you",
                "Say that you think you contracted the plague in England and they should keep bac"
            ],
            "content":"<div class=\"\"><div> <span>With the immediate threat of the pirates gone, you test the ropes binding you into the Captain's chair.  It is as you expected: if anyone could tie strong knots, it would be a man of the sea.  The silence is suffocating, and you find yourself dwelling on the hopelessness of your situation.  Your father was losing a great deal of his personal savings in the loss of this ship an his men.  It was not guaranteed that he could even come up with whatever ransom the pirates would demand.  Even if he could, how much time would go by before the exchange could take place?  It would be weeks before anyone even realized the boat hadn't docked on schedule, perhaps weeks later before word would arrive to her father that she was being held for ransom and was not just the victim of a sunken ship.  'This is foolishness,' you try telling yourself.  'You aren't even sure the pirates are going to succeed in taking over the ship!'  \r<br>\n\r<br>\nYou chance a glance at the blanket-covered bodies of your beloved Thomas and the Captain.  The cold blood is seeping into the blanket, and the darker spots are widening as the fluid bleeds into the fabric.  \r<br>\n\r<br>\nTrying to distact yourself from such a gruesome sight and the bodies you know lie beneath the blanket, you force yourself to look at the surface of the Captain's desk in front of you.  The surface of the wood is rich and costly.  An elegant map lies partially unrolled, showing the intended course of the voyage.  Elegant fountain pens sit on the desk, along with an ink well.  You start to remember the last letter you had penned to your family: your father, your mother, your kid sister, Mary.  You had been so satisfied.  You had accomplished the goals your parents had laid out for you -- good education at an English school so she could be not just a school teacher but an elegant school teacher, proper, polite, and neat.  More importantly, her parents had hoped that her skills in conversation, music, and culture would make her qualified to be the wife of an upper class man.  Her family was, after all, new money, and she had not been raised in the richer class her sister Mary now enjoyed.\r<br>\n\r<br>\nYour train of thought is interrupted when you notice a note on the table.  You are surprised you didn't notice it earlier.  Neat but definately masculine handwriting states the following, obviously refferring to you:  \"This captive is claimed by me and should be considered under my protection.   Abuse her and forfit your life.  -Hugo\"\r<br>\n\r<br>\nYou are still sitting there in stunned silence when the first sounds of fighting reach your ears.  First there are the bone-chilling cries of the pirate crew as they rush onto your father's ship.  There are shouts as your father's crew rush out of their hiding places to meet the attack.  Then the shouts are joined by the sounds of metal hitting metal in sword and knife fighting and the occasional explosions from guns.  You realize that these sounds are all being muted by the strong wooden walls of the Captain's cabin and that they must be deafening on the deck.\r<br>\n\r<br>\nThe cries of the injured and dying are chilling to you, and you are just starting to find yourself thankful for your relative safety of the Captain's cabin when the door is opened.  The sounds of the battle are louder, and the brighter light from the deck spills across the floor.  As your eyes adjust you see two of the ugliest men you have ever seen.  \r<br>\n\r<br>\nIt is obvious to you that they are pirates.  One of them leers at you.  \"Look what someone left for us!\" he cries.\r<br>\n\r<br>\nThe other is also undressing you with his eyes.  \"Tylas was right.  It would be a waste to leave a pretty little thing like this to Hugo and his ransoming idea.  Much less trouble to get her value out of her here and now!\"  He starts to approach you, and his intent is clear.</span></div></div>",
            "created":975474000,
            "id":14403,
            "title":"All Tied Up"
        },
        "111111111":{
            "author_id":"february20",
            "author_name":"Run Jena Run",
            "choices":[
                "You're taken aboard his ship."
            ],
            "content":"<div class=\"\"><div> <span>As soon as the men take their first steps toward you, you feel a cry rushing to your lips. But instead of the name of one of your father's sailors, you feel another name escaping your body and mingling with the chaotic noise on deck: \"Hugo!\"<br>\r\n<br>\r\nThe name sounds foreign coming from your mouth, and both you and the pirates are fazed for a moment. Unfortunately, the pirates recover first. More hastily than ever they approach you, and within a second they're towering over your helpless bound figure. One takes a moment to give a wretched smile before pinching your waistband with a thumb and forefinger and raising a mean-looking dagger to cut it--and the rest of your clothes--from your body, without much regard for how much skin will get slashed in the process. You close your eyes tight, regretting deeply that you were stupid enough to call for a pirate's help...<br>\r\n<br>\r\nBut instead of the feel of a blade sweeping down across your stomach, a loud gurgling shriek startles you into opening your eyes. The pirate with the dagger slumps onto the floor, blood pouring from a fresh cut across his throat. Hugo and the other pirate wrestle above the body, and after a quick struggle your other attacker also falls to the floor, wounded although not mortally. His adrenaline spent, Hugo turns to you and quickly cuts you from your bonds and just as quickly captures your wrists in his hands.<br>\r\n<br>\r\n\"Obviously I have to keep an eye on what's mine.\" You look at him, infuriated, and he knows exactly what you're thinking. \"My money, I mean. You're coming with me. You have no choice.\" Though his grip is tight as iron cuffs, Hugo's voice is nonchalant. With a harsh tug he leads you out into the sunlight.</span></div></div>",
            "created":1087621200,
            "id":203922,
            "title":"A close call"
        },
        "1111111111":{
            "author_id":"eternalheart",
            "author_name":"spazmom",
            "choices":[
                "My new quarters",
                "meeting the crew"
            ],
            "content":"<div class=\"\"><div> <span>\"Why did you call for me?\" he asked, his expression giving nothing away as he pulled her up off the chair.<br>\r\n<br>\r\n\"I-I don't know,\" I answered shakily, reeling from the death of the crewman who had almost molested me.  The other crewman lay on the floor moaning.<br>\r\n<br>\r\n\"You hamstrung me!\" he cried, holding his leg and rolling from side to side.<br>\r\n<br>\r\n\"Served you right, ya scum!\" was Hugo's sharp answer.  \"You knew she was under my protection!\"<br>\r\n<br>\r\n\"I was just trying to have a little fun!\" he whined, and Hugo kicked him in the other leg.  <br>\r\n<br>\r\n\"Shut up!\"  He turned and looked at me, realizing I hadn't said anything further.  I looked up at him with dazed and fearful eyes, not sure I hadn't traded one set of lecherous hands for another.  \"Are you alright?\"  His tone of voice was odd, coming a touch gentler than his speaking to the man rolling around on the floor.<br>\r\n<br>\r\nI felt my stomach clench in nerves and fear, and tried to nod at the same time.  He shook his head at me and pulled me along after him.<br>\r\n<br>\r\n\"I should have put on board the Northern Star the minute I laid eyes on ya,\" he muttered, his grip rough against my soft skin.<br>\r\n<br>\r\nI stumbled over the legs of the now dead crewman, and cast a last look at Thomas where he lay under the blanket with other dead men.  <i>How many had died this day?  And for what?  What would my father think?  Would I ever see my family again?</i><br>\r\n<br>\r\nAll the questions going through my mind sent me reeling as we stepped out into the clear bright day.  For some reason I thought it would be dark and foggy and a nightmare outside as it had been inside.  But it was not.  The wind whipped my hair out of it's combs and I looked up at the snapping of the sails.<br>\r\n<br>\r\nThere were no men tending them, and they were flapping loose and the ship was listing.  Little as I knew of the sea from my short voyage, I knew that they were scuttling the ship and leaving on their own.  I thought of the cargo in the hold that had been intended for American shores.  It would never see the light of day.<br>\r\n<br>\r\nHugo walked quickly, despite the heaving deck, and I was suddenly faced with the prospect of crossing over the waves on a slim board lashed between them.  <br>\r\n<br>\r\n\"I can't go on that!\" I cried, my fears overcoming my silence.<br>\r\n<br>\r\n\"You can if you want to live,\" was the deep answer, and before I could voice another objection, he picked me up in his arms like a bolt of cloth, and twisting a rope around his other hand, was quickly up and over the board, putting me down on the other heaving deck as if it had been a jump over a barrel.  <br>\r\n<br>\r\n\"Welcome to the Northern Star, Miss Sherwood,\" he drawled, handing me over to a dark skinned man with dreadlocks hanging past his shoulders.<br>\r\n<br>\r\nI promptly fainted.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1170046800,
            "id":377681,
            "title":"Welcome to the Northern Star"
        },
        "111111112":{
            "author_name":"Aisuru",
            "choices":[
                "Try to untie the ropes again (yeah, right!)",
                "Wait patiently for either the pirates or your father's men to enter."
            ],
            "content":"<div class=\"\"><div> <span>You doubt that the sounds of your screams could even be heard over the sounds of the battel, so you decide to handle this situation as logically as possible.  \r<br>\n\r<br>\n\"Wait, don't come any closer...\" You start the warning, and then let loose a well-faked fit of coughing.  \"I don't want... you to get... sick too...\" you gasp out between coughs.  \"Everyone dying... please... no more deaths because of me...\"\r<br>\n\r<br>\nThe looks on the pirates' faces turns quickly from leers to fear.  They look hesitantly at each other, wondering if a quick good time at your expense is worth whatever illness you might be harboring.\r<br>\n\r<br>\nYou decide to take this bluff all the way.  \"I've been in England...\" you wheeze out.  \"The plague...\"\r<br>\n\r<br>\nThese words are all that are required.  The men rush out of the room, slamming the door behind them.\r<br>\n\r<br>\nYou tell yourself that you would probably feel quite clever for pulling off that scam if you weren't tied to a chair by the bodies of your sweetheart and the Captain of your father's ship while the rest of your father's men battle attacking pirates.  Then you realize that the sounds of fighting have faded, and instead you hear the sounds of the cheering of the victors.  The question is, who won?</span></div></div>",
            "created":975992400,
            "id":15521,
            "title":"The Sickness"
        },
        "1111111121":{
            "author_name":"Aisuru",
            "choices":[
                "Describe the two men and what they said Tylas had said",
                "Describe the two men but forget to mention Tylas."
            ],
            "content":"<div class=\"\"><div> <span>Feeling a sudden rush of anxiety over the uncertainty of your situation, you try once again to free yourself from the ropes.  Your legs are tied at the ankles to the legs of the chairs, and your wrists are tied behind your back with the rope twisted around the wooden slats making up the back of the chair.  The struggling with the ropes, which starts tentatively, becomes frantic as frustration at your helplessness sets in.  When Hugo walks into the room you are in a frenzy, twisting uselessly in your chair as you try to free your hands.\r<br>\n\r<br>\n\"Miss Catalina Sherwood,\" he says in the tone one would use to warn a naughty child.  You jump up, startled.  You hadn't even heard him enter the Captain's cabin.  \"You wouldn't be trying to escape, would you?\"  He steps towards you, stepping over the bodies on the floor and reaching you in a few paces.  He tips a finger under your chin and lifts your face up so your eyes meet his.  His are cold and expressionless, and a chill runs through you.  \"I told you that you were valuable to me for ransom.  If you had managed to escape and ran into the other pirates, I doubt you would be valuable to me anymore when they would get through with you.  So you see, Miss Sherwood, it is in both my best interest and your best interest that you do whatever I say, do you understand?\"\r<br>\n\r<br>\nYou give a frightened nod.  You hate being intimidated and useless like this, but he does have a point.  You are safer if you stick with this Hugo pirate, who sees you as useful, than you would be to the likes of the other pirates.  Especially if they were all like those two you had scared off.  But your pride refuses to let you be so easily tamed.\r<br>\n\r<br>\nYou shake your head defiantly, making his finger slip away from your chin.  \"Yes, I saw the note you left on the table.  I am supposedly under your protection now.  I have to wonder, though, how good that protection is going to be?\"\r<br>\n\r<br>\nHis eyes narrow at you in what you might interpret as anger if his face wasn't so irritatingly unreadable.  \"You're still alive, so my protection is working wonders,\" he says cooly.\r<br>\n\r<br>\n\"Yes, I suppose I am...\" you start, letting the expected 'but' hang in the air for a moment.  \"But is it weren't for my own quick wit I would be of no use to you at all right now.  While you were off *murdering* my father's men,\" you are forced to swallow back the sudden lump that enters your throat at the the thougth of those dear men being murdered, \"two of your *pirate friends* were in here pondering how much bearing your *claim* of me had on their right to *have a little fun.*\"\r<br>\n\r<br>\nNow the anger in his face in unmistakable.  \"Who?\" he asked.\r<br>\n\r<br>\n\"Who?\" you ask in return.\r<br>\n\r<br>\n\"Yes, who?  Who dared to doubt my claim?\"</span></div></div>",
            "created":975992400,
            "id":15525,
            "title":"Protection?"
        },
        "11111111211":{
            "author_id":"february20",
            "author_name":"Run Jena Run",
            "choices":[
                "Be taken aboard the pirate ship."
            ],
            "content":"<div class=\"\"><div> <span>\"They were two of the ugliest men I've seen in my life,\" you say, disgusted. \"One all in green with a puckered scar across his nose, and one with a blonde beard and breath reeking of fish. They said Tylas was right, that there was no reason I needed to be spared for ransom.\" You spit the words out, remembering their look of pure lechery, and a shiver runs down the back of your neck. Hugo takes everything in ... even the shudder.<br>\r\n<br>\r\n\"Tylas, then. Well well, my own right hand stabs me in the back. He'll see what that gets him soon enough. And the others would be Orrin and Edric, may they rot in hell.\" You both take some satisfaction in the curse, but you quickly remember that Hugo wouldn't care a bit for your life or your safety if you were just a poor sailor like Thomas. You look into Hugo's blank brown eyes coldly as he pauses to consider you.<br>\r\n<br>\r\n\"Well, I suppose I'll have to invest a little in your security, with treacherous bastards like Tylas running loose,\" he says briskly. Pulling a dagger from its sheath at his hip, he cuts your bonds before grabbing your wrists, holding you where you are. He leans in until his face is an inch from yours, and for the first time you see a bit of fire in his mysterious eyes. \"But first things first. You *will* obey me, if you want to live and live well. I didn't kill any of your men, not yet, my job is to find the spoils and you're it. So don't be stupid and try to avenge their deaths by scorning me and ruining your only chance at life, got it, girl?\"<br>\r\n<br>\r\nYou nod, the only thing you can think to do with his eyes so close to your own, and the next thing you know you're being pulled up and out onto the disturbing calm of the bloody deck.</span></div></div>",
            "created":1087621200,
            "id":203925,
            "title":"Naming Tylas"
        },
        "111111112111":{
            "choices":[
                "Slap him",
                "Keep going with no reply"
            ],
            "content":"<div class=\"\"><div> <span>It didn't matter that *he* didn't kill and of your men, but *his men* must have.  You look in horror as you see all of the bodies, some of them pirates.<br>\r\n<br>\r\n\"Don't look,\" Hugo whispers into your ear, dangerously close, \"or you'll just get more upset.\"<br>\r\n<br>\r\nAs if you could get more upset!  You keep your face forward and walk at a measured pace.  You don't answer and try to fight tears.<br>\r\n<br>\r\n\"That's a girl,\" Hugo whispers into your ear again.  \"You just be a good girl and don't give me any trouble and things will always go this nice.\"</span></div></div>",
            "created":1206680400,
            "id":513960,
            "title":"Be taken aboard the pirate ship."
        },
        "11111111212":{
            "choices":[
                "He carries you and the chair to your new room on his ship and locks the door.",
                "He leaves you there and says you can fool them again."
            ],
            "content":"<div class=\"\"><div> <span>You explain to him their descriptions, and tell him about the *plague* you had picked up in England that had saved your life.<br>\r\nHe murmurs something to himself and then speaks clearly to her. “Did they say anything else?” Tylas seems a threat to mention but you shake your head and hold your tongue. “Well that's good I'll make sure these two men clean up the *plagued* bodies and then slit their throats.” he turns toward the door and you cry out.<br>\r\n“Shouldn't I be placed some where else in case they don't believe it a second time?” you ask mainly from the sickening thought that Thomas was still there dead under the sheets which has barely kept you from seeing all the blood.<br>\r\n“Perhaps.”</span></div></div>",
            "created":1346689200,
            "id":1419883,
            "title":"Describe the two men but forget to mention Tylas."
        },
        "111111112121":{
            "choices":[
                "the other ship is sinking.",
                "the ship your on is sinking"
            ],
            "content":"<div class=\"\"><div> <span>He effortlessly lifts you and your chair up and carries you out the door. No one else appears aborad your ship you notice as he carries you across a plank that connects the ships. Other men keep their heads down obviously eye contact must have been deadly on his ship. He carries you down an array of halls until he reaches a room with several windows and a main bed and several dozen treasure chests. You guess his quarters, he side steps and enters a small room with a cot and a small porthole he places you and the chair down and smiles. You trying to gain back any dignity you have left and look away from him and keep your gaze out the window on looking your ship.<br>\r\n\"I suggest you forget about going back there no ones going to save cargo.\" he slams the door abruptly and you hear him walk off. You feel the tears overflow again and let the sobs come through terrified to what was to be your fate.<br>\r\nThe thoughts immediatly stop for there is a huge explosion, that shakes the ship.</span></div></div>",
            "created":1349478660,
            "id":1441135,
            "title":"New cargo"
        },
        "1111111122":{
            "author_name":"gothictrash17",
            "choices":[
                "Let Hugo kiss you",
                "Move around so he can't be able to"
            ],
            "content":"<div class=\"\"><div> <span>You wait there for a few minutes now. You hear footsteps toward the door. And Hugo has come in \"Sorry Miss, but we have just won this ship over\" a tear comes out of your eye. \"No worries Miss we will take care of you now...Hahahahaha\" He comes close to you eye to eye as if he was going to kiss you.</span></div></div>",
            "created":1059109200,
            "id":167501,
            "title":"Kiss of Fate"
        },
        "1111112":{
            "author_name":"Aisuru",
            "choices":[
                "You decide to impress him with your real name and status, hoping to keep yoursel",
                "You decide to give a false identification and to try to impress upon the pirates"
            ],
            "content":"<div class=\"\"><div> <span>When you are fully out from under the bed, \r<br>\nthe men stare at you. \"Who are you, and what \r<br>\nare you doing under there?\" One man asks. \r<br>\n\r<br>\nYou look up at the two men from your position on the floor, but you don't really see them.  You had heard before that sometimes, in a really traumatic experience, a person will seem to leave their body, to witness their life as if they were only an outsider and not a participant.  As you look through the pirates, you find yourself marveling at the irony -- your parents had tried so hard to set your future in stone, even going so far as to send you to England to teach you to be a proper, polite, and neat school teacher.  You meekly followed the course they charted for your life, studying hard to be both the perfect teacher and the model upper-class daughter.  You could take tea with the best of them; you knew the geography of all territories of interest to the United States and England; you could play the sweetest melodies on the violin and write elegantly in flourished handwriting.  And now you are on your father's boat in the middle of the Atlantic Ocean, all of your protectors have been killed, and your desitny is in the hands of a bunch of pirates.  You want to both cry and laugh at the irony.\r<br>\n\r<br>\nYou must have smiled wryly during your mental monologue, because when you refocus your eyes on the pirates, they are looking at you as if you are quite daft.  You decide that is just as well.  'Maybe if they think you are daft you will have a better chance of planning an escape,' you wonder, 'If they don't kill you right now,' you add to yourself.  \r<br>\n\r<br>\nOne of the pirates is standing, and you notice that he is younger than you would have expected, muscular in the arms but quite a bit narrower in the chest and shoulders than a full-grown man.  His clothing are a bit on the ratty side.  You can't help but notice the blood splattered on his shirt, and vagely wonder if it is his.  The other pirate is definately a full-grown man, with longer black hair tied back at the nape of his neck.  His face is obscured by a thick black beard.  His eyes, a piercing blue in the rich tan of his face, are watching you closely.  He is squatting down near your feet.  Finally you notice that this pirate, the one that so effortlessly extracted you from your hiding place under the bed, is still holding your ankle.  \r<br>\n\r<br>\nThis seems to snap you back into reality.  You kick reflexively, freeing your ankle from his grasp, which had grown slack during your extended contemplation.  'Thomas!' you remember suddenly.  \r<br>\n\r<br>\nIgnoring the pirates again, you half crawl and half stumble across the room towards the bodies.  'Thomas really is dead!' you force yourself to admit.  Still crawling on the floor, you go behind the captain's desk, retrieving from a drawer a small pair of scissors and a little glass vial with a cork.  You kneel in front of Thomas, your dearly beloved and now dearly departed friend, and cut one of the golden-brown locks of hair, putting the strands in the jar and carefully replacing the cork.  'I will put it in a piece of jewelry,' you think, placing the vial in the pocket bag tied to the sash of your dress.  Then you sit on the floor, still looking at his body.\r<br>\n\r<br>\nYou can feel the eyes of the pirates watching you.  Suddenly the most important thing is survival.  It occurs to you that they are waiting for you to say something.  'Quick!' you command yourself, 'Think of something to say!  Something important!  Some reason that they should let you live, and, more importantly, let you live unmolested.'\r<br>\n\r<br>\n\"I can play the violin,\" you hear yourself say in a very small, childish voice.\r<br>\n\r<br>\nThe dark man looks at you oddly.  \"Who are you?\" he repeats.</span></div></div>",
            "created":975387600,
            "id":14270,
            "title":"The Long Quiet"
        },
        "11111121":{
            "author_name":"Aisuru",
            "choices":[
                "Hugo will cut your throat if you try that again!",
                "Hugo thinks it is funny how weak you are."
            ],
            "content":"<div class=\"\"><div> <span>\"Catalina Sherwood,\" you reply.  \"Umm, are you going to kill me?\"\r<br>\n\r<br>\nThe smaller of the pirates looks surprised at your bluntness, but the handsome pirate begins to laugh.  \"Now, why would I want to kill a cute little thing like you?\" he asks.\r<br>\n\r<br>\nYou pause for a moment, trying to calm your nerves so your voice won't tremble, but pretend that you are really thinking about an answer.  \"Well, you killed everyone else, didn't you?\"\r<br>\n\r<br>\n\"Did you hear that, Hugo?\" the smaller pirate said with a laugh.  \"She thinks YOU killed everyone.\"\r<br>\n\r<br>\n\"I'm flattered, little girl,\" Hugo responds to you, \"but I can't take all of the credit myself.\"\r<br>\n\r<br>\nWith a foolish courage fueled by your anger at the loss of all of your friends, you struggle to your feet and punch Hugo as hard as you can.  Of course, it doesn't hurt him.  He grabs both of your wrists in one of his meaty hands so you can't repeat the action.</span></div></div>",
            "created":1001480400,
            "id":75702,
            "title":"Honesty?"
        },
        "111111211":{
            "author_id":"february20",
            "author_name":"Run Jena Run",
            "choices":[
                "Trust Hugo",
                "Demand to know the plan"
            ],
            "content":"<div class=\"\"><div> <span>With your hands immobile in Hugo's grip, you realize that your initial urge to rebel is completely foolish. \"Careful,  girl!\" he hisses, loud enough for the other pirates to hear. They snigger at your helplessness. \"You don't fling yourself at men with   knives, hasn't anyone ever told you that?\" For the first time you notice the mean-looking dagger on Hugo's left hip ... and even more upsetting, the long-barrelled pistol on his right. Hugo could easily kill you at any range if he was inclined.<br>\r\n<br>\r\nUnexpectedly, Hugo switches his grip on your wrists and spins you around so you're facing the other pirates. As you turn you hear his voice in your ear, quiet and warm this time:<br>\r\n<br>\r\n\"Don't fight, I have a plan.\"<br>\r\n<br>\r\nAnd then, in the voice he used before, he booms, \"Why don't you take care of the stragglers on deck? I'll take care of this one!\" His companions laugh and take their leave, thinking they know what he means. </span></div></div>",
            "created":1087794000,
            "id":204102,
            "title":"Don't struggle"
        },
        "1111112111":{
            "author_name":"teddybear",
            "choices":[
                "Hugo has his \"merry way\" with Catalina",
                "Hugo begins to explain his plan"
            ],
            "content":"<div class=\"\"><div> <span>Hugo's hold on Catalina tightened, and he gave a gutteral laugh that was echoed by the rest of his crew. <br>\r\n\"My , but ye are a comely wench!\"He boasted loudly , as he pushed her though his cabin door. He gestured triumphantly to the lustful crew, and shut the cabin door to a volley of lewd catcalls.<br>\r\nCatalina fell backwards sprawled across his bunk.<br>\r\nShe raised a hand in front of her to ward him off. Hugo grinned devilishly and walked toward her. \"Well my fair lady,\"he began.....</span></div></div>",
            "created":1088830800,
            "id":205812,
            "title":"Hugo's Captive"
        },
        "111111212":{
            "author_name":"Aisuru",
            "choices":[
                "Accept your fate, hoping Hugo will protect you.",
                "Decide to escape from Hugo as soon as possible."
            ],
            "content":"<div class=\"\"><div> <span>\"Well, the little kitten has a temper!\" Hugo laughs, mocking your name as you struggle to free your hands from his grasp.  He pulls you closer, your back to his front, and wraps his free arm around you.  Trapped in his arms like this, you feel about as defenseless as a kitten.  His broad chest is hard behind your back, as if you were being held to a velvet-covered rock.\r<br>\n\r<br>\n\"Don't call me that!\" you scold, annoyed at your position.\r<br>\n\r<br>\n\"She spits like a kitten, too,\" Hugo continues, talking to the other pirate as if you aren't even there.  He seems almost oblivious to her struggling.\r<br>\n\r<br>\n\"So, what do you think we should do with her?\" the other pirate asks.\r<br>\n\r<br>\nHugo looks down at you in his arms.  \"I don't want to kill this little spitting kitten,\" he says.  \"I think I'll claim her as my share of the spoils this attack.\"\r<br>\n\r<br>\nCatalina is stunned at the idea of being considered a spoil.  \"I'll not go with you!\" she exclaims, increasing her struggling.\r<br>\n\r<br>\nHugo adjusts his hold so Catalina's struggles are even more futile.  \"That won't be easy,\" the other pirate stated, \"Unless you're willing to share her...\"\r<br>\n\r<br>\nCatalina can feel Hugo tighten his grip on her and shake his head.  \"I'll not share this little kitten with anyone!\"</span></div></div>",
            "created":1001480400,
            "id":75703,
            "title":"Spoils?"
        },
        "1111112121":{
            "choices":[
                "...and hear the sounds of a scuffle abruptly erupt over the victory of the spoil",
                "...and hear absolutely nothing."
            ],
            "content":"<div class=\"\"><div> <span>You realize that a fight just may take place if you keep struggling so, so you only slightly hesitantly limpen. You feel Hugo relax in return, in acceptance of your surrender, and you hope you have made a wise decision in choosing him as your new protector. Helplessly, you look on, trusting Hugo's burly arms alone to shield you from the remainder of his pack, as each face off directly over the bodies of your fallen comrades. Alone, helpless, and frightened out of your wits, you shut your eyes tight to the horrid display before you...</span></div></div>",
            "created":1086757200,
            "id":202459,
            "title":"Fight"
        },
        "11111121212":{
            "author_id":"february20",
            "author_name":"Run Jena Run",
            "choices":[
                "Go with Hugo",
                "Question him first"
            ],
            "content":"<div class=\"\"><div> <span>Apparently the other pirates accepted Hugo's claim. You watch them slink off onto deck, wondering at Hugo's reputation that he doesn't even have to prove himself. Is it possible to trust someone even pirates don't dare challenge?<br>\r\n<br>\r\n\"Come with me. You want to stay alive? You'll need food and a place to stay.\"</span></div></div>",
            "created":1087794000,
            "id":204104,
            "title":"Reputation"
        },
        "11111122":{
            "choices":[
                "Tell the pirates your real identity",
                "Keep saying that you're big bird"
            ],
            "content":"<div class=\"\"><div> <span>You smile up at the pirates. \"I am Big Bird!\" you say, \"and you let me go so I can return to Sesame Street.\" The pirates look at you for a long time before they burst out laughing. You are insulted by their laughter and try to convince them that you are Big Bird, but they don't believe you.</span></div></div>",
            "created":991198800,
            "id":77240,
            "title":"Big Bird"
        },
        "111111222":{
            "author_id":"february20",
            "author_name":"Run Jena Run",
            "choices":[
                "Challenge them",
                "Try to charm Hugo"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm ... Big Bird...\" you continue to protest, but your voice gets weaker.<br>\r\n<br>\r\n\"Don't know what in the bloody hell you're talking about,\" one of them chuckles, \"but you're a pretty little thing and good for shits and laughs ... what do you think, Hugo?\"<br>\r\n<br>\r\nThe largest pirate flashes a charming grin. \"Aye, let's keep her.\"</span></div></div>",
            "created":1087794000,
            "id":204106,
            "title":"Keep her"
        },
        "111112":{
            "choices":[
                "Faint, as week as a kitten.",
                "Fight with all the strenght of a mountain lion."
            ],
            "content":"<div class=\"\"><div> <span>Kicking the pirate, you flee from under the bed, heading for the doorway.  \"Catch her!\"  The pirate whom she'd kicked cried.\r<br>\n\r<br>\nFrom behind her, as she flew up the stairs to the deck, she feels a pair of arms come about her waist, stilling her flee for freedom and assured death and torture lay in waiting for her death.</span></div></div>",
            "created":968648400,
            "id":3658,
            "title":"Caught!"
        },
        "1111122":{
            "author_name":"Celestialsplendor",
            "choices":[
                "faint over come with heat and emotion",
                "stay awake and plan your escape."
            ],
            "content":"<div class=\"\"><div> <span>The arms holding you send you into a blind rage.  You kick and cream, twisting one way then flinging yourself the other.  You try to scratch your attacker and he soon le`'s go.  You blindly run in a direction.  YOur thoughts are on flight.   Suddenly you hit a hard chest.  Stunned you look up.  You see a blond tanned man staring down at you.  \r<br>\nSuddenly facing one of your attackers takes all the fight out of you.  You take a step backwards and he follows.  He lets out a holler and soon the other guy is behind you.\r<br>\n\"Look here boys! We got our selves a real wild cat here.  Well better take  her with us.  It would hardly be right to just leave her here now would it?\"  He  Picks you up and throw you over his shoulder like a potato sack.  Strangely your not just terrified by the fact that you are been taken by pirate, you seem to be excited by the fact that this is an adventure.  And as you hop from one boat to the next you...</span></div></div>",
            "created":975992400,
            "id":15586,
            "title":"Potato sack"
        },
        "11111221":{
            "author_name":"Phoenix",
            "choices":[
                "You push the hatch open, satisfied that no one will catch you",
                "Suddenly you hear footsteps and a key turns in the lock below"
            ],
            "content":"<div class=\"\"><div> <span>You awaken lying on the hard wooden planks of the pirate ship. Sitting up you see a few barrels and rope strewn around the small room. There are no windows and the only door appears to be locked. Scared you realise that these pirates are capable of anything. Your life is in their hands. Perhaps it would be better you were dead than to be used anyway these thugs saw fit. On your feet now you stare around your small prison.  Searching for anything that may help you escape either the ship or this unfortunate fate. There appears to be no way out. The door refuses to budge, the floor beneath you is probably the only thing stopping you from sinking into the oceans depths. You sink back down to your knees. \"It's useless,\" you think to yourself. You raise your eyes to the roof above you and begin to pray to the God's to keep you safe when you notice that some of the boards are different. In fact, taking a better look you see hinges. \"Thankyou,\" you whisper, smiling in disbelief as you realise that it is a trap door to the deck. \r<br>\nUnable to reach the roof on your own, you roll one of the large empty barrels directly under the hatch. Once in position you climb on to the barrel and listen out for any noises coming from on the deck.</span></div></div>",
            "created":980658000,
            "id":25773,
            "title":"On board"
        },
        "111112212":{
            "author_name":"Celestialsplendor",
            "choices":[
                "Listen to him",
                "Ignore him"
            ],
            "content":"<div class=\"\"><div> <span>The tinkling of keys as they turn in a lock makes you stop your escape.  You freeze like a deer caught in the headlights (lantern light?).  The ship is struck by a harsh wave and you are thrown off the barrel.  Just in time though, since the door is thrown open.  Standing there is your great pirate of before.  His blond hair is a mess and his clothes are drenched.  This is when you notice that the room you are in is tilting and moving in a truly nausous manner.  Your face turns green as you try to hold in your supper.  Thankfully your previous time spent on ships has gotten you used to it and you don't make a complete ass of yourself and vomit all over this pirate's feet.  Not that he doesn't deserve it!\r<br>\n\r<br>\nHis tall frame enters the room.  He has a lantern and holds it out in front of him to be able to see you.  Quickly he spots you... Not that hard since you are sprawled across the floor.  Quickly you rush to right yourself.  No way is some ruffian going to see you with your petticoats a mess!\r<br>\n\r<br>\nSeeing your angry blush in the soft, dim light he smiles down at you.  \r<br>\n\"Hmmmph!\"  Is all you make and lift your nose in a haughty manner.\r<br>\n\"I see...  I suppose you don't want out of here, huh?  Then again by the looks of things you don't need my help in that department...\"\r<br>\n \r<br>\n\r<br>\n</span></div></div>",
            "created":994136400,
            "id":61182,
            "title":"The Proposition"
        },
        "11111222":{
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Surprising the pirates do not lock the room that theyput you in. You guess that they don't believe you capable of trechoury or escape.\r<br>\n\r<br>\nThat night you sneak up to the deck,, trying not to make a sound,  The guard on watch, who was actually the tanned blond man who'd carried you to this ship, saw you but made no move to stop you, cocky in his belief you could not escape.\r<br>\n\r<br>\nThe waters of the ocean beckoned you as it had never done before.  You could sense the different creatures below, the barnacles clinging to the ship, the dolphins trying to keep up with it, playful in the race they were confident they could win.\r<br>\n\r<br>\nWithout another thought, you fling yourself over board.</span></div></div>",
            "created":976338000,
            "id":16420,
            "title":"Beckoning"
        },
        "111112221":{
            "content":"<div class=\"\"><div> <span>As the waters enfold you, you are at peace.  You go to join the creatures of the deep, and your love, who was tooken from you.  No more would you have to worry about what others though.  The creatures of the ocean accept you as you are.  No more will you have to restrain from spanking a kid who was bad, here, there are no snot nosed aristocratic brats.  You do feel a moments remorse, wondering if your family will be able to get over your loss, but that is all eclipsed by the new wonderful sensations brought on by the waters and their dependents.\r<br>\n\r<br>\nYou are at peace</span></div></div>",
            "created":976338000,
            "id":16421,
            "title":"Going Home"
        },
        "1112":{
            "author_name":"jessicae97",
            "choices":[
                "Does she smile and try to relax and then attempt to slide free of his hold?",
                "Does she reach up and slap his handsome face for taking such liberties with her?"
            ],
            "content":"<div class=\"\"><div> <span>She is hiding under the disgustingly stinky mops, when she suddenly lets out a vicious sneeze.  She cowers down afraid that someone heard her.  Just when she starts to relax again, the closet door flies open and a huge hand reaches in for her.  Catalina blinks as she is pulled violently out into the bright daylight.  Her hair blows around in the breeze and she is momentarilly blinded.  The small glimpse she had of the man told her he was a brutish creature.  As quickly as she was grabbed, she was released.  Catalina stumbled and  fell to her knees on the deck of the ship.  When she finally managed to pull her hair away from her face she looked up and blinked.  A very large, handsome man was blocking her view.  He towered over her small form, but didn't give off the menacing presence the other man had.  She slowly quieted and managed to gain back a little of the dignity she had sacrificed being pulled from the closet like an old coat.  The pirate stood there taking in the view of her bosom heaving, and appreciating every moment of it.  \r<br>\nCatalina tried to gain her footing, but her skirt got caught as she rose and she tripped towards the pirate.  He caught her in his masculine arms.  When she looked up at him with her shocked expression, it was to see him laughing and smiling down at her.    </span></div></div>",
            "created":975819600,
            "id":15202,
            "title":"The Undignified Meeting"
        },
        "11121":{
            "author_id":"lisanoe",
            "author_name":"Lisa Noe Kittyluv um Puppyluv",
            "choices":[
                "They meet with other pirates to sell her",
                "the handsome man calls her to his bed chamber",
                "you choose which way to go"
            ],
            "content":"<div class=\"\"><div> <span>She is very shy and afraid, she looks at the man with her heart thumping so hard in her chest that she fears she may faint dead away.  The man speaks to her:<br>\r\n\"Well then, what do we have here,\" he looked her up and down while holding both of her hands out in front of him.<br>\r\n\"turn around\" he commanded.  She hesitantly turned in fear of what he may do otherwise.  she saw bodies of the crew lying around and she began to whimper. \"You've killed the crew, she screamed.\"  <br>\r\n\"ah tis the way of war on the high seas my dear, they would have gladly killed me so we do as we must.\"<br>\r\n<br>\r\nshe turned as if to run away from the man only he grabbed the tale end of her dress ripping it partially off of her,  She was now in a very short dress, exposing her thighs. <br>\r\n<br>\r\n\"oh I think you will make a marvelous prisoner my dear.\" <br>\r\n<br>\r\n\"Please don't hurt me\" she pleaded with the man<br>\r\n<br>\r\n\"I shouldn't hurt you my dear, you are very valuable.<br>\r\nI can sell you to other pirates... Or I could keep you all to my self, It gets awful lonely on the ocean at night.\"<br>\r\n<br>\r\nShe began to cry, silently as the man told the other pirate to take her to the ship.  The pirate roughly grabbed her arm and placed her on their pirate ship.<br>\r\n</span></div></div>",
            "created":1462376520,
            "id":2143096,
            "title":"Does she smile and try to relax and then attemp..."
        },
        "11122":{
            "author_name":"Lelia187",
            "choices":[
                "Slap him again and storm off",
                "Beg forgiveness"
            ],
            "content":"<div class=\"\"><div> <span>Catalina slapped him across his face, hard. \"If I am going to die, at least I am going to get a couple shots in myself.\" she thought staring stonily at the pirate. \r<br>\n\"Fiesty, aren't you?\" he asked smiling charmingly, disarming her for a moment. \r<br>\nCatalina stared into his eyes for a brief moment, then managed to tear her eyes away from his.\r<br>\n\"Why are you hiding in here?\" he asked \r<br>\n\"Why not. Pirates attacking my ship, what am I supposed to do? Wait for you to kill me?\" snapped Catalina. \r<br>\n\"I am sure that no pirates would kill you. We can find uses for women.\" he said smugly. </span></div></div>",
            "created":981349200,
            "id":27449,
            "title":"The Meeting"
        },
        "111221":{
            "choices":[
                "Bash in the door, it's only wooden with a spy hole",
                "Stay there until the pirates come back for her"
            ],
            "content":"<div class=\"\"><div> <span>\"Excuse me but I am from a wealthy family and I will not have a...a...a pirate like you taking liberties. Now I, I demand you take me back to my home!\" The pirate laughed and smiled. <br>\r\n\"Sorry lass, no can do,\" The pirate laughed as he pulled her across deck and through her back inside the closet. \"You can stay there until the pirates have their lunch. None of that sex stuff though you got it I'll get in trouble with the Cap'in if ya do. Just a bit o' dancing 'ill do okay?\" He laughs softly and walks back down deck. She shudders in fear.</span></div></div>",
            "created":1170046800,
            "id":377632,
            "title":"Pirate capture"
        },
        "112":{
            "author_name":"katie",
            "choices":[
                "you decide to follow through, there's no turning back",
                "you plead fear to the captain to avoid going up."
            ],
            "content":"<div class=\"\"><div> <span>This is your father's ship you remember.  You have  a duty to fulfill.  Run and hide, ridiculous!  A true Sherwood would never do so.  You push your doubts aside and hold your head up, staring into the wind, facing the oncoming ship.\r<br>\n\r<br>\nThe ship stops about forty feet distant.  A cannon is set off, vibrating the air, causing your heart to beat violently.  You realize from where you are standing in the shadow of the cabin, and the position of the pirate vessel, you are not easily seen and your ship appears deserted.  Perhaps they will believe the entire crew has suffered some disease you think, but quickly brush that thought aside.  \r<br>\n\r<br>\nKeeping to the shadows, you slip down to the captain's quarters where Thomas and the captain and talking in angry tones debating what is to be done.  You hesitate outside the door a moment and enter without knocking.\r<br>\n\r<br>\nThey stop at your appearance.  You've never come to the captain's quarters uninvited before.  \r<br>\n\r<br>\n\"What do they want?\" you ask. \r<br>\n\r<br>\n\"Right now, they are waiting for someone to appear up top,\" the captain replied with the dignity due to the daughter of the ship's owner. \"Thomas here wants to attack now, while they are unprepared, which is folly.  They'd  cut us to piece in minutes.\"\r<br>\n\r<br>\n\"There's always a chance,\" Thomas spoke up.\r<br>\n\r<br>\n\"Pirate ships are well armed, always\", you speak up attempting to speak with authority. \"We will go speak with them and seek their demands.\"\r<br>\n\r<br>\nThomas and the captain look at you.  \"I'll follow in a minute,\" the captain says gruffly after a pause.  \"Wait in the hall.\"\r<br>\n\r<br>\nAs you close the door you hear the concersation resume with a different topic.\r<br>\n\r<br>\n\"You can't mean to let her go with you!\",  you hear Thomas cry greatly agitated.\r<br>\n\r<br>\n\"Having her up there may be the only card we have, of course, I'll let her go.\"\r<br>\n\r<br>\nYou realize the captain is not thinking at all of your safety, or where you position should have placed you- firmly under guard- but is only thinking of his survival.  That's alright, you tell yourself, you have the same thing in mind, but perhaps going up with the captain in full light isn't the best idea.</span></div></div>",
            "created":968475600,
            "id":3651,
            "title":"a duty to follow"
        },
        "1121":{
            "author_name":"katie",
            "choices":[
                "do you allow the pirates to board",
                "do you continue in this banter"
            ],
            "content":"<div class=\"\"><div> <span>You bravely without a word to the captain, follow him up the poorly built stairs.  Three steps up, you turn and look at Thomas, his worried countance, with a glance of apology before continuing.  \r<br>\n\r<br>\nHe's waiting for you where you had stood to watch the ship approach.  You step up next to him and continue by his side with him into the sunlight that hurts your eyes, causing you to blink several times and squint.\r<br>\n\r<br>\nA lone man is standing on the deck. \r<br>\n\r<br>\nYou swallow, and call out, \"What is it that you want?\"\r<br>\n\r<br>\nHe starts and peers intently at hearing a woman's voice. \r<br>\n\r<br>\nYou remain motionless waiting for a reply, allowing him to get over his shock.  \"What is it that you want?\" you repeat when he doesn't answer.\r<br>\n\r<br>\n\"Who are you?\" a harsh, but faintly gentile did answer.\r<br>\n\r<br>\nYou hold your head up with family pride, \"I am the daugher of the owner of this ship, and who are you and what is the purpose of your ship in hindering my father's ship in it's journey to America?\"\r<br>\n\r<br>\n\"I am Hugo of the BlackLonder's Ship, he replied. We wish to board your ship.\"\r<br>\n\r<br>\nYou notice the captain who has yet to speak has begun to look worried perhaps at your boldness, your defiance, his lack of authority in this exchange, or perhaps at the entire situation.</span></div></div>",
            "created":968562000,
            "id":3653,
            "title":"exchanging greetings"
        },
        "11211":{
            "author_name":"Sabrecat14",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>let them aboard! are you crazy</span></div></span></div>",
            "created":979016400,
            "id":22225,
            "title":"idiot!"
        },
        "11212":{
            "author_name":"diva",
            "choices":[
                "continue to yell about women's rights",
                "let the captin talk"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you plan on doing if I let you board? I'm quite curious.\" you ask. it is difficult not to stare at his shirtless chest.\r<br>\n\r<br>\n\"What do I plan to do? Who are you to ask? I am a man you a women. I don't understand why you are talking to me!\" he shout at you. \r<br>\n\"Well!\"\r<br>\n</span></div></div>",
            "created":969339600,
            "id":3662,
            "title":"a women"
        },
        "112121":{
            "author_name":"Stori-Kitten",
            "choices":[
                "Grab a sword and try to fight them off",
                "Run and hide like the other ladies"
            ],
            "content":"<div class=\"\"><div> <span>The nerve of that man! you think to yourself.\r<br>\n\"I am aloud to talk to you if i wish!\" She screamed at the pirate.\r<br>\n\"How dare you talk to me that way!\" He shouts Angrerly.\r<br>\n\"how dare you shout at a lady!\" She yelled just as feircly.\r<br>\nThe captain hurried toward them\"Stop it , both of you!\" he shouted.\r<br>\n\"Now,\" The captain said calmly.\"Why do you wish ti board our ship?\"\r<br>\nThe pirate didnt anser.\r<br>\nSuddenly, the pirates ship comes up close to the ship. Lots of pirates start jumping on to the boat. What should you do?</span></div></div>",
            "created":969512400,
            "id":3667,
            "title":"Attack!!"
        },
        "1121211":{
            "author_name":"Alysha",
            "choices":[
                "You follow his orders to board his boat",
                "You refuse to board his boat and joint the rest of the crew"
            ],
            "content":"<div class=\"\"><div> <span>One of the pirates lunges at you.  Skillfully you doge, thanking daddy for the many years of ballet.  The man keeps coming at you but all you can do is doge.\r<br>\n\r<br>\nMeanwhile, the captian and Thomas were not so sucessful.  The two were immeadately captured and shoved in to a small wooden hole leading to the cargo deck.  After those two were taken care of, the pirates went after the rest of the crew.\r<br>\n\r<br>\nUgh, the stupid pirate won't give up on you!  You doge and give a few karate kicks that you learned in self defense.  The pirate often gives you a crazy look like you were a wild animal.\r<br>\n\r<br>\n\"What are you doing?\" Hugo asked.  He was directing the rest of the pirates where to put the crew.\r<br>\n\r<br>\n\"I'm tryin' to get her but she's too slippery,\" the pirate replied.\r<br>\n\r<br>\n\"Fine, leave her to me.\"  \r<br>\nWith this the pirate turns around.  You grab his sword out of the belt.  Unsteadly, you hold up the heavy sword.\r<br>\n\r<br>\nHugo laughs and walks calmly twords you.  He raises his sword and knocks it out of your hand.  Pointing the sword at your throat, he backs you against a wall.  \r<br>\n\r<br>\nHe comes close to your face and smiles.  Strangely you can't help but be turned on by this but you don't let him know.\r<br>\n\"Now be a good girl and do as I say,\" Hugo demanded.\r<br>\nYou look straight into his blue eyes fearfully and knod.\r<br>\n</span></div></div>",
            "created":979016400,
            "id":22248,
            "title":"Deadly Waltz"
        },
        "11212111":{
            "choices":[
                "you give in and kiss him back",
                "you push him away in disgust and try to run"
            ],
            "content":"<div class=\"\"><div> <span>He grabs you by the back of the neck and you are suprised by the tenderness of his hand as he leads you onto his boat.  You always though that pirates were murderous villans, but this mans hand feels so gentle..so right.  You snap back into reality as you realize that you are stepping aboard a pirate ship.  Hugo puts his hand around your waist as you walk over the ramp that leads from his boat to yours.  You brace yourself so that you'll be ready if he tries to spring anything on you, but he dosn't and you begin to relax in spite of yourself.  Come, he tells you, and he leads you don't below the ship.  As you go below deck he grips onto your arm and you struggle to get away from his firm grasp.  Just then he pushes you against the wall and presses his warm, moist lips against yours.  He looks into your eyes and they are warm and seductive.  You try to resist because you know that to kiss him would be to give yourself over to the enemy.</span></div></div>",
            "created":989989200,
            "id":49621,
            "title":"Forbidden kisses"
        },
        "112121111":{
            "choices":[
                "Keep kissing",
                ""
            ],
            "content":"<div class=\"\"><div> <span>She felt as if she couldn't hold out anymore, and knew she'd burst into frenzied tears if she didn't calm down.\r<br>\n\"Please, don't, I...\" she moaned, starting to give in. He didn't obey.\r<br>\nFinally, in a hard burst of emotion, she kissed him back.</span></div></div>",
            "created":995605200,
            "id":64740,
            "title":"Oh no"
        },
        "1121211111":{
            "choices":[
                "Ignore Him and keep kissing Hugo",
                "Seperate yourself from Hugo and blush in embarasment"
            ],
            "content":"<div class=\"\"><div> <span>Surprised by your burst of emotion Hugo backs away slightly.  You look into his eyes and see that his eyes have glazed over in want. He approaches you in a matter of seconds and his lips are on yours. You sigh into the kiss as his hand rest on your hips and you wrap your arms around his neck. <br>\r\n<br>\r\nHe breaks the kiss.<br>\r\n\"I believe that you didn't give me your name Miss......?\"<br>\r\n<br>\r\n\"Catalina.....Catalina Sherwood\" you answer quietly, still lost in his eyes.<br>\r\n<br>\r\n\"Cata-Getting to know our captive are we, Hugo?\"<br>\r\n<br>\r\nYou both turn as you see another man with a captains hat on.</span></div></div>",
            "created":1274590800,
            "id":888157,
            "title":"Keep kissing"
        },
        "11212111112":{
            "choices":[
                "Ran into the room and locked the door",
                "opened the weaponry closet and armed herself"
            ],
            "content":"<div class=\"\"><div> <span>Catalina stuttered over her words, \"Oh no! Heaven's no! I was merely attempting to choke him when he tried to kiss me...i would never!\" Hugo shot back in shock, \"Yeah well you were doing a pretty good job at keeping me from breathing without your hands.\" Catalina slapped Hugo, \"Pig!\" And she turned and faced away from Hugo.<br>\r\n<br>\r\nThe man cleared his throat, \"Anyway...my name is Captain DeVorte'. Hugo there is one of my best men and it would be wise of you to know your place.\" Hugo huffed and began to leave the room, \"Indeed it would be.\" He exited in a hurry. Catalina turned to Devorte' with confusion in her eyes, \"I demand to be let go!\" DeVorte' laughed and snatched at her wrist, \"I dont think so. Besides we have a special surprise tonight.\" Catalina struggled to get away, \"Well i'll take no part in this-this surprise!\" DeVorte' stared at her with anger, \"Oh trust me, when you see what it is...i'm pretty sure you'll be interested.\" <br>\r\n<br>\r\nCatalina suddenly snatched away from DeVorte' and ran down out the room. She tried to get away however she could! Suddenly, she saw a door to her right and a weaponry closet to her left. She had to think quick so she...</span></div></div>",
            "created":1278824400,
            "id":916145,
            "title":"To lust...or disgust??"
        },
        "112121111122":{
            "choices":[
                "Open door and attack Devorte'",
                "Drop weapons and surrender"
            ],
            "content":"<div class=\"\"><div> <span>Catalina ran into the weaponry closet and shut the door. After locking the door, she hurriedly grabbed a knife from a shelf, and a small pistol from another shelf. <br>\r\nShe could hear Devorte' grumbling outside, and smiled despite herself. <br>\r\n \"If you value your fingers, you'll open this door!\" Devorte' says.<br>\r\n  Catalina looked around the room, there weren't any other ways out. She hefted the knife and pistol up and walked towards the door..</span></div></div>",
            "created":1328908860,
            "id":1274266,
            "title":"opened the weaponry closet and armed herself"
        },
        "1121211111221":{
            "choices":[
                "Put on dress and wait",
                "try to escape"
            ],
            "content":"<div class=\"\"><div> <span>Catalina slowly unlocked the door, and gripped the nob. Devorte' chuckled from outside the door.\"Finally coming out, eh?\" He asked.<br>\r\nWith a wild cry, Catalina yanked open the door and slashed out with the knife. Devorte' easily dodged the attack and grabbed her wrist, twisting it so that she had to drop the knife. Catalina brought up the pistol, but Devorte' knocked the heavy weapon out of her hand. He then backhanded her across the face, sending Catalina into the wall, and making her taste blood. <br>\r\n\"Feisty one, aren't you?\" Devorte' mocked. He grabbed her wrist once more and yanked her up. \"If I was you, I wouldn't try that again. not unless you want to get hit even harder.\" He pulled her down a corridor, and into a room. Devorte' tossed her onto the floor and walked out. \"You'll find a dress in the closet, I expect it to be on by the time I come to get you for the...surprise.\" He says before he leaves. Catalina hears the door lock. She looks around the bedroom, a small desk, bed, and closet are the only furnishings.<br>\r\nCatalina opens the closet, inside is a dark green dress, long-sleeves and way too low neck line. Catalina is repulsed by the idea of wearing it.</span></div></div>",
            "created":1328910000,
            "id":1274275,
            "title":"Open door and attack Devorte'"
        },
        "112121112":{
            "author_name":"Genophore",
            "choices":[
                "tell the pirate your name",
                "ask the pirate what he plans to do with you"
            ],
            "content":"<div class=\"\"><div> <span>\"Get away from me, vermin!\" You cry as you shove Hugo aside.\r<br>\nYou attempt to run, but Hugo grabs your arm and forces you to keep still. Hugo smiles wickedly, as if to somehow imply that the fact that you are weaker than he is amuses him.\r<br>\nLooking into the pirate's face, you realize that you will never be able to escape him by fighting him alone, he is much too strong and could easily break your neck. You realize that your cunning, however, just might save you.\r<br>\nAfter a moment has passed, Hugo releases your arm. \"Are you quite through now?\" he asks you mockingly.\r<br>\nYou rub your arm where the pirate had so harshly grabbed it. \"Yes sir,\" you reply softly. You look up into his face and smile sweetly.\r<br>\nHugo is taken slightly aback. Just a moment ago this woman had been clawing at him like a cat, and now she was acting as coy and innocent as a kitten? Hugo sensed that something was up.\r<br>\nYou realize that Hugo is surprised by your reaction, and you silently applaud yourself for this very cunning move. Now, if you could only decide what to do next..... </span></div></div>",
            "created":997765200,
            "id":69318,
            "title":"A Cunning Move"
        },
        "1121211122":{
            "author_name":"drjones",
            "choices":[
                "grope around in the dark for something sharp",
                "grope around in the dark for a light"
            ],
            "content":"<div class=\"\"><div> <span>\"What exactly do you want with me? Where is the rest of my ship?\" you demand defiantly looking Hugo straight in the eye. <br>\r\n<br>\r\nHe shrugs indifferently, \"After my men get done taking what they want, especially from the woman, they'll burn the ship.<br>\r\n<br>\r\n\"NO!\" you cry out before you can stop yourself. You internally berade yourself for showing weakness as a smug smile crosses your face.<br>\r\n<br>\r\n\"As for you, my fair lady, I was going to use you for my own personal needs.  But you are too arrogant for a lady. I'll sell you as a slave and be done with you.\" he says in that same tone.<br>\r\n<br>\r\n\"You pig. I will kill you before you see land again.\" you say. At this, Hugo throws back his head and lets a large pirate worthy laugh.  You spit at his face and in one swift movement he backhands you and you go flying into some crates.<br>\r\n<br>\r\n\"That'll teach you your place wench.\" he says before turning away and going back up to the deck.  You hear the door lock and there's complete darkness. <br>\r\n<br>\r\n\"I'll show you my place, you sorry s.o.b\" you mutter.  </span></div></div>",
            "created":1059109200,
            "id":167440,
            "title":"Prisoner"
        },
        "11212111221":{
            "author_id":"phayes",
            "author_name":"spiderfingers88",
            "choices":[
                "you strike up a deal with Hugo, so the crew won't tease him.",
                "You drop the sword and reach up to feel the cut on his arm, hugo winces from the"
            ],
            "content":"<div class=\"\"><div> <span> Unlike other young ladies of your station. who were Learning to play the piano, and quote sonnets, you were learning the art of self defense. You were never happier about this, then at this moment. You reach to the left and feel something sharp, yes, it is the tang of a sword! You reach up and grab the handle, and wield it across on front of you, unfortunately it is so dark that you cannot see. Hugo lets out a manly scream. Yes, you have hit him, but how badly?<br>\r\n\"My your a feisty one!\" He says, his voice is gruff.<br>\r\n\"Put down the sword and I'll let you live.\"<br>\r\n\"You'll let me live? I beg to differ, it is I who hold your life in the balance.\"<br>\r\n<br>\r\nYou, think about swinging the sword again but something stops you. Your breathing becomes heavier, a feeling of fear suddenly emerges, you are not as brave as you thought. You squash the feeling, and swipe the sword again, this time you hear a loud thud, you have hit a wooden pole. You feel Hugo's hand grab your upper arm, you wince and prepare for him to twist, but instead he simply grabs it firmly.<br>\r\n\"Look I really don't wish to hurt you, but if I go above and the rest of the crew see this cut on my arm there going to think I've gone soft.\"<br>\r\n<br>\r\n </span></div></div>",
            "created":1172034000,
            "id":383745,
            "title":"sword play"
        },
        "11212111222":{
            "author_id":"iamwhoiam",
            "author_name":"mARi♥SigShopOpen",
            "choices":[
                "you woke up & find yourself in a small clinic with your wound bandaged up..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size5\" style=\"\"><span class=\"cblack\">Chapter 11: Wounded<b></b></span></font><br>\r\n<br>\r\nFinally, you found a match somewhere in the pile of broken crates where you have been sent flying into. You tried lighting it but with no luck, you found it was wet.<br>\r\n<br>\r\n\"Ugh! I'll get that blasted pirate if it's the last thing I do!\" you shouted.<br>\r\n<br>\r\n'Throwing me off like that... He doesnt seem to have respect for women at all!' you were thinking.<br>\r\n<br>\r\n\"Ouch!\" you said and winced in pain, you touched your back and found that you were bleeding. It was probably because of the sharp broken woods from the crates where you landed, ungraciously before.<br>\r\n<br>\r\nSuddenly, all thoughts of escaping lost you. You are filed with worry thinking of worst possible scenarios. Dying there because of blood loss without anyone noticing (and not that they would care anyway, you were thinking).<br>\r\n<br>\r\n\"I guess dying here would at least save my pride... Not like how I would feel being sold as a slave...\" you said in a low, hopeless voice.<br>\r\n<br>\r\nAll traces of the strong girl you just showed them a while ago are gone now. And you started feeling really tired and sleepy with all that fighting (and not to mention your current condition).<br>\r\n<br>\r\n\"Father...\" you whispered before you drifted off to sleep...</span></div></div>",
            "created":1201842000,
            "id":493044,
            "title":"grope around in the dark for a light"
        },
        "11212112":{
            "author_name":"Lelia187",
            "choices":[
                "Catalina runs",
                "Catalina stands her ground"
            ],
            "content":"<div class=\"\"><div> <span>You walk to the railing of the boat and pretend to be scared. You weren't the star of every play for nothing. You act like you are frozen in fear. \r<br>\n\"I am afriad of heights.\" you stutter helplessly. As soon as Hugo gets close enough you trip him and send him flying over the rail into the water. Cold and wet he clambers into the boat below the ship and begins to climb the rope up to the ship. You begin to back away from the rail.</span></div></div>",
            "created":981349200,
            "id":27456,
            "title":"Revenge"
        },
        "112121122":{
            "author_name":"Lelia187",
            "choices":[
                "You run below the deck into the darkness"
            ],
            "content":"<div class=\"\"><div> <span>He approaches you dripping wet and angrily. You stand your ground, prepared to face your doom. \r<br>\n\r<br>\n\"Well, like father always said. Go out with a bang.\" you mutter to yourself\r<br>\n\"How dare you treat me this way,\" he growls. \r<br>\n\"No, How dare you treat me this way.\" you say angrily and begin to spout your femenist ideals. \r<br>\n\r<br>\n\"I am so sick of you men acting so superior, you are nothing but big babies. If I am going to die I am at least going to get my revenge!\" you cry in defiance\r<br>\n\r<br>\n\"I like a woman with spirit.\" he said leering at you. \r<br>\n\"You wish, I would kill myself before I would let any of you have your way with me.\" you mutter angrily. \r<br>\n\r<br>\n\r<br>\n</span></div></div>",
            "created":981349200,
            "id":27458,
            "title":"Defiance"
        },
        "1121211221":{
            "choices":[
                "Wake to find yourself in a cage",
                "Awaken to find yourself laying in the arms of a stranger"
            ],
            "content":"<div class=\"\"><div> <span>You run belong deck. The darkness surrounds you. Bottles of rum clink there. You pull one off it's place and begin to drink. You'd rather be taken or killed by pirates drunk that admit you lost soberly. You drink until the room is spinning and just as you're about to fall unconscious you see the pirate pluck you over his shoulder and carry you back out into the light.<br>\r\n<br>\r\nDead bodies everywhere. Black out.</span></div></div>",
            "created":1170046800,
            "id":377633,
            "title":"Black out drinking"
        },
        "112122":{
            "author_name":"cloud",
            "choices":[
                "Catalina decides to escape from the cabin",
                "Catalina decides to swoon for convenience"
            ],
            "content":"<div class=\"\"><div> <span>\"there's no need to get all ruffled up, good sir..... I'm merely asking your reason to step onto my father's ship\", Catalina asks Hugo, the pirate captain, coolly. Hugo is somewhat taken aback by the cool composure of this lady standing afore him. And not too bad a beauty as well..... too bad we have to do this, Hugo mumurs to himself.\r<br>\n\r<br>\n\"Good lady\", Hugo shouts back, \"We have come from afar to here for one reason only. We have come to take over your father's ship!\"\r<br>\n\r<br>\nCatalina gasps and involuntarily glances on the lower dock where the captain's best man looks up at her. Her eyes widen in unknown terror. She cannot believe her ears ... she's to ...... Suddenly, the captain voice rings out \"All men to the cannons! We're going to blast these dastardly dogs away!\"\r<br>\n\r<br>\nWith a sudden push, Catalina finds herself falling to the lower deck. Confused and terrified, she manages to make her way to the barrels and hides behind them.\r<br>\n\r<br>\nEyes fiercely shut, cannons boom and guns ring all around her. She pries her eyes open at intervals and watch the men fight. For every 3 ship's men that falls, only one pirate falls in return. Closing her eyes again, Catalina is aware of being watched. She opens her eyes and sees the pirate captain staring intently at her - right into her blue eyes. With a shudder, she watches as he fends himself against the sword thrusts of the captain and the captain's best man. Catalina cant bear it anymore and feels herself go blank.\r<br>\n\r<br>\nCatalina's eyes open.. she's in the captain's cabin..... she doesnt know where she is .... snatches of memories come back to her and suddenly remembers the pirate invasion. With a start, she sits up and finds herself looking into the dark eyes of the pirate captain.</span></div></div>",
            "created":975387600,
            "id":14284,
            "title":"The Invasion"
        },
        "1121221":{
            "author_name":"BubblePoet",
            "choices":[
                "you glare right back and ask why you're here",
                "lower your eyes and surrednder your attemots to free your self"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Catalina decides that she willl not be a prisoner so she decks the captian and runs for the main deck.On her way there thopugh she is caught and brought back to the Captian's quarters where he is looming in the doorway glaring hard at you.</span></div></span></div>",
            "created":977374800,
            "id":18796,
            "title":"ummm"
        },
        "11212211":{
            "author_name":"the_webster",
            "choices":[
                "You try to talk your way out of it.",
                "You go quietly."
            ],
            "content":"<div class=\"\"><div> <span>          'I demand to know why I am being held hostage here!\" Catalina snapped.\r<br>\n          \"You would be wise not not take that tone and countenance when dealing with people who have your life in their hands,\" the captain replied coolly.\r<br>\n          \"I think I have a right to know what you plan to do with me.\"\r<br>\n          \"Bargaining material, of course.  Your father is a rich man.  He would pay well to have his daughter safely returned to him, would he not?\"\r<br>\n          The Captain turned to the pirate who was holding Catalina by the arm.  \"Hugo, take our fiery little prisoner to the cell we have reserved for prisoners.\"</span></div></div>",
            "created":995950800,
            "id":65365,
            "title":"Caught!"
        },
        "112122111":{
            "author_name":"ManniesPaw",
            "choices":[
                "Oh...",
                "NO, don't think so..."
            ],
            "content":"<div class=\"\"><div> <span>(first person)<br>\r\n\"Please don't.\" I look into his eyes and I think about what will happen to me if I get stuck in a 'cell' and I dont like being told where and what to do. This, ofcourse, is protrade in my eyes and on my face.<br>\r\nThe pirate holds onto my arm tightly, thinking that I will try to escape. The captain studies me and replies, \"Have no fear, you will not be harmed in anyway and i also assure you that the accomidations are quite exceptable.\"<br>\r\n<br>\r\nHe looks at the pirate and the pirate nods. I think to myself, what did i get myself into??<br>\r\n<br>\r\nI'm then dragged down the hallway.</span></div></div>",
            "created":1064466000,
            "id":174174,
            "title":"Begging"
        },
        "112122112":{
            "author_name":"Tye",
            "choices":[
                "Does he kiss her again?",
                "Or send her back down?"
            ],
            "content":"<div class=\"\"><div> <span>(Note to Author: I'm sorry about this but I can't write in the manner that you have started but would like to write an add on to this story, so I will write it in the way that I am used to, please except it.)<br>\r\n<br>\r\nJerking hard against my arm, he lead me toward the bottom of the ship. Before he opened the door, he spun me around to face him.<br>\r\n<br>\r\n\"If I had it my way, I'd do what I wanted then be rid of ya.\" He told me, breath as bad as a rotten egg, I turned my face to keep from smelling it, but was jerked back around to face him. \"But seeing that your of use to us, Maybe we can have our fun later.\" He put his hand on my leg and I shoved it off.<br>\r\n<br>\r\n\"Pig.\" I stated, He opened the door and shoved me inside. <br>\r\n<br>\r\n\"Until later luv.\" He grinned and shut the door, laughing as he walked away.<br>\r\n<br>\r\nI stood there a little releaved that I was away from him, but not sure of what else I was in store for, I turned around to see two other men, one that was badly hurt and the other who looked scared to death. I walked over to them.<br>\r\n<br>\r\n\"David?\" I asked touching his shoulder, he jerked out of his trance and stared at me. <br>\r\n<br>\r\n\"Miss Sherwood?\" he asked, \"Your alive, I was so worried that they had killed you.\"<br>\r\n<br>\r\n\"No I'm alright, but what about him?\" I asked looking at the other man laying there. David moved closer to him.<br>\r\n<br>\r\n\"I don't think he's going to make it miss.\" He told me. \"They really beat him, I couldn't stop them, and now they are going to kill us all.\"<br>\r\n<br>\r\n\"I don't think so David, they need me alive to get a ransom from my father.\" I told him as I stood up and walked back over to the door. \"Until my father pays, I'm safe, after that...\"<br>\r\n<br>\r\nOn top in the captains room Hugo was looking over the charts as Jacob walked in, his right hand man.<br>\r\n<br>\r\n\"She's down with the rest Captain.\" He told him.<br>\r\n<br>\r\n\"I've told you before not to call me that, I'm not your bloody Captain.\" Huga stated as he glared at him. \"Do it again and you'll find yourself over board with the sharks, got that?\"<br>\r\n<br>\r\n\"Alright, alright.\" Jacob nodded, then changed the subject, \"So what's the plan, I know you want a ransom for the filly, but how are you going to go about getting it?\"<br>\r\n<br>\r\n\"Send a message to the girls father.\" Hugo told him than sat down in the big chair. \"Let him know that if he doesn't pay we'll chop his daughter and fly her skin from the crows nest, only a fool will not pay.\" He smiled at him.<br>\r\nJacob returned the smiled and left the room, Hugo sat there thinking about Catalina for a few minutes then reached for a quil and began to write out what was needed to get the attention of her father. When he was satisfide with what he wrote he got up and headed outside on deck.<br>\r\n\"Jacob take us out to sea, You there,\" He pointed to another man, \"Get this message off as soon as possable, make it quick, then meet us in Port Castings due west.\" He smiled, the man took off and head out on the other ship. <br>\r\n<br>\r\nAfter what seemed forever, the door was opened again and there stood Jacob once more.<br>\r\n\"Your wanted by Hugo.\" He told me. \"Come along and don't put up a fight, I'd hate to have to take you there dead.\" He grinned. I sighed and stood up going out of the room after taking a quick glance toward David. Heading back up to the captains chamber, I went inside with Jacob standing behind me.<br>\r\n<br>\r\n\"Leave us Jacob.\" Hugo told him, he smiled and patted my backside, I quickly shoved his hand away. \"Your diffently a fisty one.\"<br>\r\n<br>\r\n\"Why are you doing this?\" I asked him as he stood up and walked around the desk toward me.<br>\r\n<br>\r\n\"Why do you think?\" he asked in return.<br>\r\n<br>\r\n\"Because your a cold hearted bastard.\" I stated when he stopped in front of me.<br>\r\n<br>\r\n\"I'm not as cold hearted as you may think, I do have a soft side.\" He told me, \"If I didn't, you would be dead right now, so think about that.\" <br>\r\n<br>\r\nMy life my have been in danger but my mind couldn't keep from thinking about how deep blue his eye's were and how the curve of his chin made me feel deep inside. His shirtless chest wasn't helping me at that point, my mind kept wandering as he stood so close to me that I could feel his every breath. He turned and walked away, Leaving me time to breath again and to keep from thinking the thoughs that I was having of him at the moment.<br>\r\n<br>\r\n\"When your father receives the message of your capture, they will bring down every ship that they have for your safe return.\" He smiled, \"How much does your father really love you?\"<br>\r\n<br>\r\n\"As much as any other father.\" I told him.<br>\r\n<br>\r\n\"I guess your the lucky one, I never knew my father.\" He walked back toward me and slowly circle around, touching my hair with his hand as he spoke. \"Maybe that's why I turned out this way. Maybe if things had been different, I wouldn't be standing here right now.\" He stopped behind me as he picked up a lock of my hair and smelt it, taking in the sweet scent, then letting it drop back down. \"But then again maybe I would.\" he came around to face me once more.<br>\r\n<br>\r\n\"Why do you do this?\" I asked.<br>\r\n<br>\r\n\"Profit my dear, it all boils down to money, that's every pirates dream, to make that big score, then go for another.\" He smiled. \"Your my big score on this one, I'm sure your father will pay hamsomly to get you back, and with a ship this grand, it can only mean that your swimming in wealth and I want a chunk of it.\"<br>\r\n<br>\r\n\"I'll give you a chunk of something.\" I stated then rushed toward him, he grabbed me and slammed me down on top of the desk. \"let me go.\" I yelled.<br>\r\n<br>\r\n\"This is going to be an interesting trip.\" He grinned then bent down forcefully kissing me, I pushed at his chest then weaked for a single moment as I took the kiss he was giving me, when he eased up, I shoved him backwards standing up as I did.</span></div></div>",
            "created":1026968400,
            "id":112484,
            "title":"The Kiss"
        },
        "1121221121":{
            "author_name":"BubblePoet",
            "choices":[
                "He sends back to her cell wiht no food",
                "He teases her a bit with the implication of worser measures"
            ],
            "content":"<div class=\"\"><div> <span> He leaned back down and kissed her again then jerked back with a cry of pain.<br>\r\n \"I have had quite enough of you seaborn thieves kissing me!\" Catalina spat,\"I'm tired of being treated as if I'm a little amusement to tide you over until you get your filthy hands on some money.\"<br>\r\n  Hugo brought a hand to his lip and felt the wound inflicted by her teeth. He wondered about that comment about the other pirates. <br>\r\n  \"You'll be treated as your posistion befits,if it befits you being treated badly then so be it.\"Hugo retorted with just as much venom.<br>\r\n  \"Now how am I to punish you for that bit of foolishness?\" he mermured.</span></div></div>",
            "created":1028178000,
            "id":114771,
            "title":"Watch Your Mouth"
        },
        "1121221122":{
            "author_id":"no2freakshow",
            "author_name":"Puckboy",
            "choices":[
                "Hugo brings her back down to be with her shipmates",
                "The captain wants to interrogate her"
            ],
            "content":"<div class=\"\"><div> <span>Hugo's once-clear blue eyes clouded over.  His jaw set and he grabbed Catalina's arm.  Before she could cry out, he said to her, \"Let me show you something, Miss Moneyknickers.\"<br>\r\n<br>\r\nShe could feel the strength in his iron grasp as he led her up the stairs, to the portside deck.  She knew he could grip her with much more force, if he wanted.  His hands were hardened with a lifetime of callouses from hard work.  He held her just tightly enough; she wasn't going anywhere.<br>\r\n<br>\r\nThe sun was sharp and hot on her fair face as they reached topside.  The first thing Catalina noticed as her eyes adjusted was how utterly calm the seas were.  the second thing she noticed was how quiet the pirate's ship was.<br>\r\n<br>\r\nAs if reading her thoughts, Hugo asked, \"Hear that, Miss Spoiled?  No?  Then let's take you closer to all the action.\"<br>\r\n<br>\r\nHe bustled her around the corner, as if she were weightless, towards the bow of the ship.  There, she could see her beloved ship listing severely to the starboard side.  The once-beautiful boat was shattered and smoldering.  Catalina remained quiet, but tears filled her own blue eyes as she thought of the crew -- her friends.  How many lay dead or dying onboard?<br>\r\n<br>\r\nShe could see a dozen or more pirates throwing objects overboard, to be caught by the greedy scoundrels in the rafts below.  It was a pillage most thorough.<br>\r\n<br>\r\n\"Gideon's Osprey,\" she whispered, \"may she and her crew rest in peace.\"  Catalina closed her eyes and bowed her head in prayer.<br>\r\n<br>\r\n\"Aye,\" Hugo said somberly, and let his own head fall, \"'twas a fair ship, with a goodly crew.  Tis a pity.\"<br>\r\n<br>\r\nCatalina gave the savage renegade a sideways glance; how odd it was for him to say such a thing.  Maybe he wasn't completely vulgar, after all.<br>\r\n<br>\r\nHer momentary lapse in hatred for this man was dispelled when her held her shoulders and looked into her eyes from a scant breath away, \"Now listen to me, lass.  Ye may not like me, and you'd be surely right to fear me, but this doesn't have to be as god-awful as ye might think.  After Daddy gives us your weight in gold, we'll be happy to plop you on any dock of yer choosin'.  Then ye can be off to bathe in satin and pearls, or whatever it is rich girls do these days.  But know ye this:  you'd be wise to respect us, for any lip you give will likely get fattened.\"<br>\r\n<br>\r\nAt any other time, Catalina might have bristled at being threatened, pirate or not, but the day had brought too much violence and misery upon her.  She nodded silently and cried.<br>\r\n<br>\r\nHugo watched her a moment, then made sure the captain wasn't watching.  He lifted her quivering chin with one grubby thumb and whispered, \"You'll be fine.\"</span></div></div>",
            "created":1147669200,
            "id":318842,
            "title":"Topside"
        },
        "1121222":{
            "author_name":"Sabrecat14",
            "choices":[
                "stay in the captains quarters with Hugo",
                "search the ship"
            ],
            "content":"<div class=\"\"><div> <span>Catalina stares into the deep brown eyes and promptly falls back on the couch where she is lying. When she once again wakes up she looks around and finds Hugo sitting at the Captain's desk, looking proud. \"You're awake I see\" He chuckled like he had a secret. \"What has happened to my fathers crew?\" Catalina demands \"We killed them\" Hugo answers like it was no big deal. Catalina gasped but she had already guessed that was what had happened and she tossed it from her mind. \"Why do you look so happy?\" she demanded \"You were yelling my name in your sleep\" He laughed \"Of course! In fear\" Catalina retorted but she vaugly remembered a dream and it hadn't been about fear, she knew Hugo knew it too. \r<br>\n      Hugo was staring at her intently \"What is it now??\" Catalina questioned \"You want me, and I find it fascinating\" He now had his gaze directed at her chest and she crossed her arms over it to block his view. \"I DO NOT desire you, in the least\" Catalina said defiantly, but she knew she was saying a lie. \"You shouldn't, My mates and I killed your crew, but you still do\" Hugo was feeling very good about himself right now. Catalina stared at Hugo, he was now rummaging through the captains desk, which was now his own and pulled forth and bottle of brandy \"care for a drink?\" he said \"Ladies do NOT drink\" Catalina retorted \"Why not what pride have you got to keep, sitting there in your petticoats\" Catalina screamed \"You foul BEAST how dare you undress me!\" Hugo looked stricken \"I didn't, I thought you did. You burst in here in your petticoats and fell asleep on the couch there. You woke up and fainted again\" Hugo explained, he looked hurt that Catalina had accused them \"I don't believe you\" Catalina mumbled but she didn't bring up the subjet again. She took the drink from Hugo and sipped it looking beaten. To her surprise the brandy was very good and she soon emptied her glass and held it out again to Hugo. \"I thought ladies didn't drink\" He said mockingly as he refilled it \"there's a first time for everyting\" she slurred slightly as she drained her second brandy.</span></div></div>",
            "created":979016400,
            "id":22207,
            "title":"A dream"
        },
        "11212221":{
            "author_name":"Sabrecat14",
            "choices":[
                "she ripps off the choaker and flees the room",
                "she stays with Hugo and gets to know him better"
            ],
            "content":"<div class=\"\"><div> <span>Hugo sat on the couch next to Catalina. Her vision was slightly blurring but she could still see the handsome shirtless man beside her. She reached out her hand to touch his arm but her aim was off and she layed her hand on his chest. It was hard and sculpted He took her hand in his and placed it gently on her own leg. Then  he let go, standing up he returned to the desk and got a beautiful diamond choaker from a sharkskin sack that lay on the floor. He brought it over to Catalina and put it in her hand \"I got this when we robbed one of her majesties royal ships.\" He said with pride \"I think it will look nice on you\" He added hopefully. If Catalina had not been drunk she would have never accepted a gift from a perate that had killed her fathers crew, but she WAS drunk so she took the choaker and draped it over her neck. She was having trouble with the clasp. Their faces were very close and Catalina was beginningo feel uncomfortable when Hugo fasened the necklace and stepped back. Catalina straightened and stumbled over to a mirror where she gazed at the delicacy on her long slender neck. The choaker fit perfectly and the diamonds shone in the evening sun that came through the windows. \"Thank you\" She managed to stutter amazed by the beauty of the gems. Suddenly, as if by a switch, she snapped out of her drunken stupor and realizing what was happening</span></div></div>",
            "created":979016400,
            "id":22208,
            "title":"The Choaker"
        },
        "112122212":{
            "author_name":"Sabrecat14",
            "choices":[
                "Hugo follows her out",
                "she meets Tylus and 2 other pirates"
            ],
            "content":"<div class=\"\"><div> <span>Catalina sat down next to Hugo again and said \"I shouldn't drink anymore. It made me blurry-eyed and confused\" Hugo was once again staring, but this time at her neck, as if it was and object he desperatly wanted to have but couldn't reach. \"I wish you wouldn't stare at me like that, it's unnerving\" she mumbled, looking down at her hands which were resting on her lap. \"You are very beautiful\" he said as if it was an astounding discovery \"um thank you I guess.\" suddenly she realized that she was still in petticoats \"I must go change into something proper, no matter how I got into this state.\" She said and jumped to her feet and began to walk to the door \"I did it\" Hugo shouted after her, trying to make her come back \"But only because you were uncomfortable\" he winced as she turned on him with dark eyes. Catalina stood before him \"what do you mean?\" she demanded \"You were trying to sleep in your dress and you kept whining from the buttons digging into your skin. Besides!\" Hugo stood up suddenly remebering he was the pirate and she was the maiden \"What would you do to stop me !\" Catalina slapped him hard across the face and he sat down again \"that\" she said stomping out of the room </span></div></div>",
            "created":979016400,
            "id":22209,
            "title":"The petticoats"
        },
        "1121222121":{
            "author_name":"Sabrecat14",
            "choices":[
                "They kiss again",
                "Hugo pulls away"
            ],
            "content":"<div class=\"\"><div> <span>Hugo jumped up and followed Catalina out of the cabin. He didn't want her to meet up with Tylus and not be protected. He caught up with Catalina but stayed behind her so she couldn't see him. Sure enough Catalina turned a corner and Tylus and another pirate by the name of Jake. Hugo stayed behind a pile of boxes to see what would happen. \"Well look what we have here,\" said Tylus \"The American girl. What say we take her down to the mess hall and see how loose those petticoats are?\" He chuckled \"Get out of my way\" demanded Catalina but she was scared and wished Hugo was there with her. \"I don't think so little miss, you're coming with us\" Jake snarled and leaned into Catalina's face. She slapped him and Tylus was just about to grab her neck when Hugo jumped out and said \"hands off, or face your death\" Tylus looked up sharply and let go of Catalina's neck. Then he said \"Of course Hugo, what were we thinking Jake?\" He was acting sorry but Catalina could see his hand reaching for a dagger behind his back. Catalina screamed \"look out Hugo!\" Hugo whipped around and moved just in time. The dagger flew past and embedded itself in the ship. \"Mutany!\" He bellowed and sunk his sword deep into Tylus's stomache. \"Jake!\" He yelled \"go to the hold and lock yourself into the prison cell. If I see you about later on you too will die\" Hugo took Catalina's hand and led her back to the captains hold \"Thank you\" said Catalina and kissed him lightly. Hugo was taken aback but returned the kiss strongly. Catalina pulled away and sat down on the couch again. She was surprised, she had only be kissed by her family and Tomas before and it was never like this. Tomas had been polite and light in his kisses never as strong and meaningful as Hugo's kiss. She decided she liked Hugo's kiss better and stood up to kiss him again. Hugo accepted a second kiss but then said \"that's enough, I don't want you falling in love with a pirate like me\" Hugo laughed but to his, and Catalina's surprise she said \"Too late\"  </span></div></div>",
            "created":979016400,
            "id":22210,
            "title":"Too Late"
        },
        "11212221211":{
            "author_name":"Sabrecat14",
            "choices":[
                "see what Catalina's father does",
                "back to Catalina and Hugo (after they get it on)"
            ],
            "content":"<div class=\"\"><div> <span>Catalina pulled herself toward Hugo and put her hands on his bare chest. He slowly put his arms around her and undid her corset strings. He pulled it off and they fell together on to the couch. Catalina was new at this though she found it easy to do. She ran her hands throught his dark hair and rubbed his back, which was scarred and very tan. Hugo, unsurprisingly was not new at this. He kissed her passionatly and began to pull down her petticoats. Meanwhile (we'll leave Catalina and Hugo to their business) Catalina's father was worried about the ship. It was supposed to have docked in America 3 days ago. This was not surprising, ships were often late. It's just that no one had seen a ship flying the American flag for a long while. He was soon put out of his misery, only to be thrust directly into another one. A message came from an English ship that his ship had been seen flying the pirate flag, a skull and croosbones. He was now very worried about Catalina and her soon to be husband (he hoped) Thomas. He gave up any hope that they had escaped and almost all hope of them being alive when another message came saying a young girl had been spotted leaning over the rails of the ship kissing a ragged Pirate. Catalina's father was both relieved and terrified. What had those awfull pirates forced her little girl to do? The thought was horrible and he thrust it from his mind. He made plans to arm a ship and send it out to search the area where the pirate ship ahd last been seen. He must save his dear child from those terrible disgusting pirates!</span></div></div>",
            "created":979016400,
            "id":22223,
            "title":"My poor baby!"
        },
        "112122212112":{
            "author_name":"Sabrecat14",
            "choices":[
                "They go and find Catalina some clothes",
                "They go down to the mess hall for some food"
            ],
            "content":"<div class=\"\"><div> <span>The pirate crew had heard the shaking and uh other *sounds* coming from the captains quarters and when the *noises* stopped they gave a loud cheer. Hugo heard them and got up, pulling his sharkskin pants as he walked to the door \"Go back to work and give a man some privacy you bloody fools\" He yelled but he flashed a Ivory-toothed grin at them to show he was very pleased. He went back inside the cabin and kissed Catalina lightly on the cheek. She got up and got fully dressed which took a while because of the amount of garments a well-bred lady wore back then. Hugo looked at her and said \"We need to get you some real clothes\" Catalina looked down at her soft yellow dress and pure white apron \"These are real clothes you big goof\" She laughed but Hugo's face was twisted in thought. \"I mean real clothes for a pirate lass\" he said without looking up. Catalina had almost forgotten that her fathers crew had been killed by her lover and his friends. She had never thought that she would have to rob and kill alongside her love \"But I'm not a pirate lass!\" She stammered Hugo was taken aback \"You are my woman and I am a pirate\" He explained \"Yes that is true but does that mean I must be bloodthrirsty and ruthless?\" Catalina was yelling now and Hugo was looking forlorn \"How else can you be my girl?\" Hugo asked \"Can't I be a teacher and you still be my man?\" Catalina whined but she knew it was futile. She must either become a pirate or never see her true love again. \"please stay with me Catalina\" Hugo murmered and Catalina was stuck with a feeling of awful lonelyness. She knew she could never leave Hugo and survive but she would die of sorrow if she became a rebel and an outlaw. She decided to go along with the pirate act untill she could think of a proper answer. \"I will never ever ever leave you\" She whispered to Hugo and kissed his neck slowly. She went along with Hugo to find her some \"proper\" clothes. Hugo was whistling and Catalina had pushed the horrible thoughts from her mind was hanging on his arm which seemed to make his happiness rise even higher. The pirates they passed were raising their hats at Catalina and winking knowingly at Hugo. They all seemed to have become accustomed to Catalina and no longer treated her as a captive but as a member of the crew. She guesses that sleeping with the captain was reason to respect a woman. </span></div></div>",
            "created":979016400,
            "id":22227,
            "title":"to love or not to love"
        },
        "1121222121121":{
            "author_name":"Sabrecat14",
            "choices":[
                "Back to Catalina's father"
            ],
            "content":"<div class=\"\"><div> <span>Hugo led Catalina to a small storage room where the pirates had loaded boxes into. Hugo opened a crate by crashing his fist into the lid. He rummaged around a bit and then pulled out three garments and held them up for Catalina to see. The top which he held up was what we would now call a ver revealing bikini top. In those days it would be called a scrap of cloth not fit to put on your sock. The pants (Catalina only wore dresses) were very small and had a lot of rips in them. The rips had been covered in baggy pieces of expensive looking translucent silk in all different colors. The third garment was a thin silk scarf to be tied around the neck. The bikini top (as we will call it) was deep crimson red, the pants were black and the scarf was a shiny silver color. Catalina looked at the \"clothes\" and then down at her dress, with it's high collar and sleeves and skirt that showed neither her wrists nor ankles as was proper. She took the clothes only out of kindness to Hugo and stood behind some crates to change. When she got them on she discovered that the clothes fit perfectly. She looked down at herself and gasped the Bikini left her stomache bare and the tops of her breasts emerged over it. The pants were very tight on the legs and buttox but luckily they covered her ankles (thank god) They hung low on her hips and her belly botton showed inched above where the pants commenced. The scarf hung down just over the bikini top and seemed to make the outfit more scarce than it already was. she stepped out from behind the crates and shyly stood in front of Hugo. his jaw dropped and his eyes rolled (let me explain, Catalina had a body that would make Britany Spears break down crying) Catalina burst out in tears \"It's hideous isn't it\" she sobbed into her hands \"no no no you misunderstood me. You are the most dazzlingly beautiful person I have ever seen\" Hugo gazed at her longingly \"really? but my arms are bare and my stomache and look at my chest!\" Hugo was thinking \"You don't have to tell me to\" but he said I would be honored if you chose to wear this in my presensce\" He knelt down and kissed her hand. Catalina wiped away her tears \"ok I will wear it. On one condition. If any of your men touch me because of this outfit I will never wear anything you give me again\" She said this with a defiance that meant she was talking business. \"If any of my men, even think about touching you I will lock them in the cell and feed the key to the sharks. Catalina nodded and Hugo opened the door. Catalina held on to his arm and rested her head on his shoulder as the walked out into the sunshine. As they walked back to the captains quarters the other pirates bowed and smiled to Catalina. What she did not know was that they were bowing so they could look under her bikini top. Hugo knew this but he let it go. He was too happy to care.   </span></div></div>",
            "created":979016400,
            "id":22231,
            "title":"New Clothes?"
        },
        "11212221211211":{
            "author_name":"Sabrecat14",
            "choices":[
                "See if it will approach them",
                "attack!"
            ],
            "content":"<div class=\"\"><div> <span>Catalina's father of course nevr even thought that she might be kissing a pirate on her own free will and he was still determined to rescue her from them before they hurt her too badly. He had seven ships brought to him and he gave each a crew. Soon after they set off to search for the pirate ship that held his beloved daughter. after 2 months of sailing the Atlantic the lookout of one ship spotted the pirate flag waving on the horizon. \r<br>\n      During the 2 months Catalina was on the pirate ship she became (almost) a true pirate. She was stong and brave (and still very good-looking) She had her own sword and could easily fight off any pirate on the ship that attempted to harrass her. She found that her new clothes were very usefull, and much more comfortable than her thick cotton dress and petticoats. (They were also much easier to take off, when the mood struck Hugo and she) Catalina could climb and swing from the riggings and she could out-dance any lady she would come across (though she never did come across another lady) Though Catalina's new style of dancing was quite diffferent than that of a well-bred lady because it consisted of some very *revealing* moves. \r<br>\nAnyway, Catalina had been up in the crows nest and she spotted her fathers ship, though she did not know it was his at that time. The pirates had not looted or killed in the past 2 months because of the great ship they had just attained. They were taking a rest. Catalina was therefore surprised to see another ship. She hopped out of the crows nest and climbed quickly down the rigging. (much to the sadness of some pirates who had been looking up her shirt from below.) She ran straight to Hugo's cabin (which they now shared) and told him of the ship flying american colors \r<br>\n </span></div></div>",
            "created":979102800,
            "id":22358,
            "title":"Spotted!"
        },
        "11212221212":{
            "author_name":"Sabrecat14",
            "content":"<div class=\"\"><div> <span>Hugo stepped back \"what?\" he said puzzled \"I said, I already love you\" Catalina replied she was startled by her own composure. \"You can't love me! I'm a pirate and you're a young lady, a well-bred young lady\" Hugo was stammering but he soon broke out in a smile \"there's a first for everything I guess\" he said and embraced Catalina again \"I guess I love you too\" he said. and he did love her. The lay on the couch together and the sun fell beneath the horizon and the sky turned black. </span></div></div>",
            "created":979016400,
            "id":22212,
            "title":"Love at long last"
        },
        "113":{
            "author_name":"Strawberry7989",
            "choices":[
                "Catalina goes to see whats happening",
                "Catalina stays where she is, frozen with fear"
            ],
            "content":"<div class=\"\"><div> <span>\" Thomas! Thomas! wait up!\" Catalina shouts.\r<br>\n\r<br>\n SUddenly there is screaming and yelling, guns being fired and--Catalina stays frozen for about 5 minutes while all this is going on. Then she realizes wiht terror that the pirate ship must have attacked the ship. suddenly, all is silence. </span></div></div>",
            "created":968562000,
            "id":3656,
            "title":"Terror"
        },
        "1131":{
            "author_name":"Celestialsplendor",
            "choices":[
                "Do you not make it in time to save Thomas",
                "Do you throw yourself in front of Thomas"
            ],
            "content":"<div class=\"\"><div> <span>YOu run towards the sound of the gun shot.  Pushing the door open with all your might you arrive just in time to see the ship's captain crumple onto the floor.  A pirate stands next to your dear Thomas.  A Sword is held at his neck.  Another pirate notices you.  He goes to grab your arm.  Just then you see that the other one is going to... Good lord he is going to run your precious Thoams through!!! </span></div></div>",
            "created":975992400,
            "id":15664,
            "title":"Discovery"
        },
        "11311":{
            "author_name":"Celestialsplendor",
            "choices":[
                "Is he just nicked",
                "Is he mortally injured"
            ],
            "content":"<div class=\"\"><div> <span>Your mouth opens to screech out a yell.  You reach out to Thomas but that blasted pirate grabs your arm and you are forced to watch Thomas get run through.  He arches his back as the sabre plunges into him.  Blood is already coloring his shirt front.  You let out a yelp as the pirate twists your arm. </span></div></div>",
            "created":975992400,
            "id":15667,
            "title":"Dear Thomas"
        },
        "113111":{
            "choices":[
                "hugo dodges ",
                "thomas nicks hugo"
            ],
            "content":"<div class=\"\"><div> <span>   You scream, wretch, and pull against your capter. Thomas lays on the ground motionless. Tears spill, bluring your vision.<br>\r\n   Another pirate walked over to Thomas and neals on his hinges. His hair, a messy brunet mop, could use a wash, and his cloths consisted of a loose fitting, half unbuttoned off white shirt, baggy brown pants, tied at the waist with a blood red sash, tucked into his boots. He glanced back at you, giving a flash of deviouse brown eye's. <br>\r\n   Just then, Thomas jumps up, a dagger in his hand. </span></div></div>",
            "created":1298587020,
            "id":1059988,
            "title":"Dead for Dead to be alive  "
        },
        "113112":{
            "author_name":"liz",
            "choices":[
                "You bang on the door for someone to help you",
                "You quietly sob"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You gasp as Thomas falls to the floor in a pool of his own blood. You are too scared to cry. One of the pirates grabs your arm and leads you to the pirate ship where he locks you in a small room.</span></div></span></div>",
            "created":980658000,
            "id":25770,
            "title":"Poor Tom"
        },
        "1131121":{
            "author_name":"liz",
            "choices":[
                "Stay where you are and go to sleep",
                "Try to escape"
            ],
            "content":"<div class=\"\"><div> <span>After a few hours, someone opens the door. The sun is too bright and all you can see is the sillouette of a tall, cut man. He looks at you for a moment and picks you up. You are too exausted to struggle. He brings you to a large room and sets you down on a soft bed. He overs you with a blanket and walks out of the room without saying a word.</span></div></div>",
            "created":980658000,
            "id":25771,
            "title":"Oh la la"
        },
        "11311211":{
            "author_id":"february20",
            "author_name":"Run Jena Run",
            "choices":[
                "It's the mysterious pirate who put you to bed.",
                "It's a random pirate with wooden teeth and a gleam in his eye."
            ],
            "content":"<div class=\"\"><div> <span>Exhausted with the emotions of the day, you fall asleep on the bed, lulled by the sound of the pirate ship cutting through the water.<br>\r\n<br>\r\nWhen you awake, the light coming from the doorway is soft and black, and you realize you've slept until the early hours of the morning. Creeping from the bed, you stand in the doorway. Above you the night is clear and the moon is full; a million stars are visible from horizon to horizon. The ocean air is crisp and a little cold, so you hold your arms against your chest and decide to venture out onto the deck. The only sounds are the creaking of the ship and the light break of wind against your face. It doesn't seem that anyone is awake. But someone must be ... someone has to be steering the ship.<br>\r\n<br>\r\nRight before you reach the rail overlooking the water, a masculine presence behind you clears its throat. Startled and frightened, you force yourself to turn around to face him.</span></div></div>",
            "created":1087621200,
            "id":203920,
            "title":"Night on the ship"
        },
        "11311212":{
            "author_name":"Peachesncreme",
            "choices":[
                "you go back out where everyone's at.",
                "You decide to stay in the room and plan an escape"
            ],
            "content":"<div class=\"\"><div> <span>  You wait a while, Unsure of your future but sudently you bring yourself to get up and try to escape. You slowly walk to the door but just as you tap the door nob to see if it is unlocked a man walks in apparently a  pirate and he has a golden feather on his hat. You think perhaps this may be the captain. As you bring yourself to realize what is happening you realize he's actually cute.\r<br>\n  Afraid and desperate of dying like Thomas you senselessly kiss the pirate suprisingly he doesn't pull away. You find your self having passionate thoughts and he and you sway towards the bed on which you were laying on before.\r<br>\n\r<br>\n     You take off his shirt and for the next 20 minutes you had passionate and good sex.\r<br>\n Then you relize that you have a bad pain down there because this is the day you lost your virginity.\r<br>\n\r<br>\n   After sex you fell asleep when you wake up you realize he's not here anymore and slowly you rap a sheet around you and creep out side to see that the pirates has rampaged another yet ship.\r<br>\n\r<br>\n   And that there is a woman kissing passionetly the same pirate you lost you virginity. Furious and confused you fade away before any one can see you , and bewildered why but you cry . I guess it was just lust , or was it?</span></div></div>",
            "created":984286800,
            "id":35494,
            "title":"Supringly But True"
        },
        "1131122":{
            "author_name":"CChatgurl",
            "choices":[
                "A young pirate"
            ],
            "content":"<div class=\"\"><div> <span>You sob and sob inside the cabin and tell yourself that crying won't be of much use. You look around in the familiar cabin and find nothing. You peek out the little window and see a really young and pretyy girl crying over Thomas's body. She strokes hiw blood covered body gently. SHIT You slam your fist on the stupid desk and curse silently. The door suddlenly opens and you see \r<br>\n</span></div></div>",
            "created":989989200,
            "id":49622,
            "title":"TRAITOR"
        },
        "11311221":{
            "author_name":"CChatgurl",
            "choices":[
                "Jason",
                "Han"
            ],
            "content":"<div class=\"\"><div> <span>MAN!!! Woo! You're standing right in front of a <i>really </i> hot pirate. He smiles at you and says, \"come with me\" he jerks his head to the right. You frown. He shruggs, \"captain's orders.\" You certainly DON'T want to go with a bunch of pirates. \"Or else what?\" You chanlenge.\r<br>\n\"Well, the captain says he'll have your head blown off if you don't come. And I happen to like that beautiful head of yours just where it is.\" He says with his heart stopping smile. You close your eyes and think.\r<br>\n\r<br>\n\r<br>\nThat asshole Thomas's body just wants to make you cry. If you go witht he pirates, you get to be with this hot guy. But then again....you'll never see home. You think of when you left home for college and you left college to get a job...your parents said that from now on, choices are made by only you. You frown and make up your mind, \"ok, in one condition.\"\r<br>\n\"What's that?\" the guy says.\r<br>\n\"What's your name?\" You say and smiles widely.\r<br>\n</span></div></div>",
            "created":989989200,
            "id":49627,
            "title":"Oooo. Hot-guy"
        },
        "11312":{
            "author_id":"kalikohmotta",
            "author_name":"Kaliko M~Reaching for Truth~",
            "choices":[
                "Do you try to fight",
                "Stay put for now"
            ],
            "content":"<div class=\"\"><div> <span>You twist your arm out of the grasp of the pirate and run toward Thomas. It is only a few short strides toward Thomas, as you reach the pirate and Thomas, you throw your hands in front of you and grab the sword's blade. The pirate tries to correct his sword, but it is too late, your forward momentum from running is too much to fight, and you manage to wrest the sword from his hands, saving Thomas.<br>\r\n<br>\r\nUnfortunately the forward momentum that helped you rescue Thomas also causes you to stumble to the floor as you trip on the captain's sword, lying on the ground, and the pirate's sword goes flying. Your world goes black for a minute.<br>\r\n<br>\r\n\"Little wench! I'll kill you right now!\" The pirate that you escaped from screams. He raises his blade and prepares to run you through. You cover your face and throat with your hands in a last desprate attempt to shield your self, you close your eyes, preparing for the worst.<br>\r\n<br>\r\n\"Get off her you no good lout!\" A voice cries.<br>\r\n<br>\r\nThomas, you think, he must have gotten hold of a sword.<br>\r\n<br>\r\nYou open your eyes to see the flat of a sword hit the side of the pirate's face, knocking him over.<br>\r\n<br>\r\n\"Are you ok miss?\" the second pirate asks. You nod dazed and confused as to why this pirate rescued you. <br>\r\n<br>\r\n\"YOU BLOODY IDIOT! WE DON\"T KILL WOMEN! THE CAPTAIN WOULD HAVE US BOTH BLOODY HUNG!\" shouts your unlikely savior.<br>\r\n<br>\r\nJust then another pirate enters the room.<br>\r\n<br>\r\n\"Captain!\" says the would-be killer.<br>\r\n<br>\r\nThe Captain, although as harsh as any seaman, seems to have a little more class than his crew. He takes in the whole room, and then, strangely, comes over to you.<br>\r\n<br>\r\n\"Are you ok madame?\" you look from him to the pirate who saved you and then, as any woman would do, faint.<br>\r\n<br>\r\nYou wake up to the face of a rather dashing young man, tending to you. <br>\r\n<br>\r\n\"Just be calm miss, I'm to take care of you. Captain's orders.\" he says.  </span></div></div>",
            "created":1202101200,
            "id":494569,
            "title":"Do you throw yourself in front of Thomas"
        },
        "113121":{
            "choices":[
                "Drop the gun ",
                "Look for Thomas"
            ],
            "content":"<div class=\"\"><div> <span>\"Get away from me!\" You shove the man.  <br>\r\n<br>\r\n  Yelping, he teeters back, then, with the help of the tossing ship, falls to the plank floor. His head bangs loudly against the wall of the small cabin, and for a moment you feel guilty. Then you see the flintlock pistol in his belt, and the hate returns. You grit your teeth, determined not to let the fear gnawing at your gut control you, and spring forward. You surprise him and yourself by swiping the weapon from his side, cocking it and putting it to his handsome brow.   <br>\r\n<br>\r\n  \"Huh...\" Somehow the man manages a nervous smile, making your wrath only grow hotter.    <br>\r\n<br>\r\n  \"Where's Thomas?!\" you say dangerously quiet.   <br>\r\n<br>\r\n  \"Thomas?\" He blinks, confused.   <br>\r\n<br>\r\n  \"Yes. Thomas! He was on the ship with me. You know, the one you blaggarts attacked! What did you do with him?\"    <br>\r\n<br>\r\n  He stares a moment longer, then his lips peal back in a charming smile. \"Ah, yes, Thomas. The chap you saved. Don't worry, he's fine.\"  <br>\r\n<br>\r\n  \"Where. Is. He?\"    <br>\r\n<br>\r\n  \"Don't think you're going to go all hero, miss, cause I can tell you for sure these sea dogs wont have a problem with shooting a pretty girl like you down before you can scream properly.\"   <br>\r\n<br>\r\n  Pretty?! You hate that he complemented you--you hate even more that's he's trying to help you...</span></div></div>",
            "created":1206507600,
            "id":513176,
            "title":"Do you try to fight"
        },
        "113122":{
            "choices":[
                "A knock on the door disturbs you",
                "You start to talk more"
            ],
            "content":"<div class=\"\"><div> <span>You sit there staring at him.<br>\r\nHe gives you a confused look.<br>\r\nHe only looks 3 years older than you.<br>\r\nYou start to talk, \"Whats your name?\"<br>\r\n\"Brayden...\"<br>\r\nYou go quiet unsure of what to do.<br>\r\nAs you feel the throbbing of your fingers, you see that they were sliced in the middle of each finger and across.<br>\r\nYou quickly hold your hand in fear of what happened.<br>\r\nBrayden holds your hand aswell.<br>\r\n\"Your gonna be fine it's not that deep...\"<br>\r\nYou stammer, \" oh, okay... thanks.\"<br>\r\nYou feel lonely, scared and emabarressed.<br>\r\nYou dont know what to do and not thinking twice you grab the back of Braydens head, held gentley with your un-wounded hand you kiss him.<br>\r\nTo suprise he starts kissing you back.<br>\r\nHe slowly pushes you back onto the bed your on.<br>\r\n<i>I dont even know this guy... hmmm doesnt matter I will know him well soon! </i>You think as he is kissing you.<br>\r\nAs the day turned into night your still there with him on the bed.<br>\r\nUnder the sheets with him u feel on the top of the world.</span></div></div>",
            "created":1298180280,
            "id":1057181,
            "title":"Stay put for now"
        },
        "1132":{
            "author_name":"Tatijuana",
            "choices":[
                "Go with the handsome pirate, sounds fun",
                "Turn and run, like I am going to trust a pirate"
            ],
            "content":"<div class=\"\"><div> <span>Catalina stood there is straight fear. \r<br>\n\r<br>\nHearing the screams of her fathers crew members, she wanted with all her might to be able to run. She tried to run, her brain said to move but her feet refused to follow instructions. \r<br>\n\r<br>\nThis is her fathers ship, how can this be happening? She has heard many the tails about pirates, and what they do to folk she is used to being around. \r<br>\n\r<br>\nHer thoughts were interruped but a strong arm jerking her up and into his full grasp. She couldn't see his face, but who ever this pirate was, he wasn't letting go. She started to kick and scream when she was released. She stood face to face with her capture. He was a VERY handsome man with amazing blue eyes.  \r<br>\nHe had brought her to the side of the boat. \r<br>\nThe fighting seemed to be settled and bodies lay everywhere. \r<br>\n\r<br>\n\"You are comming with me.\" His voice was rough when he spoke, but it was a strong and warm type of voice. \r<br>\nShe very much wanted to go with him, it was a journey, and he was exiting. But all common since in her told her that she has get out of there, and onto a pirates ship is the LAST place you should be.</span></div></div>",
            "created":977202000,
            "id":18456,
            "title":"her  capture"
        },
        "11322":{
            "author_id":"no2freakshow",
            "author_name":"Puckboy",
            "choices":[
                "Catalina escapes below deck",
                "Not so fast"
            ],
            "content":"<div class=\"\"><div> <span>Catalina's fine upbringing had steered her every choice in life away from altercations of all sorts; usually there were men around to take care of the unmentionable things outside of her realm -- men paid by Daddy.  Catalina looked wildly from her left to her right, hoping to catch sight of Daddy's men rushing to her aid.<br>\r\n<br>\r\nThe only thing she saw was a cloud of flaming debris that filled the air as another cannon blew apart some of the mast.  Those bloody heathens were destroying Daddy's ship!<br>\r\n<br>\r\nCatalina heard the terrible sounds of battle wash over her: the blasts of gunfire, the crash of the cannons, the shrill ringing of swords that clashed for control of the small ship.  But most importantly, and sounds that would be ingrained into Catalina's memories for all time, she heard the screams of men dying.  It was almost as if their last breaths took away hers as well.  It was all too clear to the young heiress that there would be no men to rescue her.<br>\r\n<br>\r\nShe was on her own.<br>\r\n<br>\r\nPrisoner aboard a pirate vessel was an image that also took the air from her lungs.  How many weeks -- or months -- would she be trapped, adrift, until her father's men could track her down and pay the inevitable ransom?  Or better yet, rescue her and set the brigand ship ablaze to watch it sink to the bottom of the ocean?  A shudder coursed through her skin as she reckoned what those filthy bastards would do to her in the meantime.<br>\r\n<br>\r\n\"Unhand me,\" she tried to yell but fear had constricted her vocal cords to a whisper.  She could smell this beastly man's slimy sweat on her cheek and in her hair.  She wanted to cry but was unable to find the tears.  Instead she stomped her heeled shoe down into the pirate's instep, making him yelp and flinch enough to give Catalina the instant for which she'd been waiting.  She threw herself from the blue-eyed man's grasp and dashed along the wet and smoking topside deck, away from him.</span></div></div>",
            "created":1362539820,
            "id":1544637,
            "title":"Turn and run, like I am going to trust a pirate"
        },
        "113222":{
            "author_id":"no2freakshow",
            "author_name":"Puckboy",
            "choices":[
                "Her assailant becomes her lord & master",
                "Her assailant becomes cannon fodder"
            ],
            "content":"<div class=\"\"><div> <span>Catalina knew the layout of the ship and thought that would give her an advantage over the attackers so she might stay a step ahead of them, and -- hopefully -- stay alive.  But her eyes were useless in the heavy black smoke that seeped from below decks like blood through a bandage.  Her ship was dying surely enough, and it seemed destined to take her down with it.  Her shoes: good, sensible shoes befitting an educated young lady such as herself, were ill-suited for a death race aboard a listing ship, and twice her feet slid out from under her and she crashed into debris strewn about the ship.  Finally Catalina grit her teeth and pulled the shoes from her sore and bleeding feet and got to running once more.<br>\r\n<br>\r\nBut running to where?  What would she do when she reached the rear of the ship?  Or the bow?  Or below decks?  There was really nowhere to hide, but to her terrified mind there was only one solitary thought of which she was consciously aware: RUN!<br>\r\n<br>\r\nAnd run she did -- right into the chest of a half-naked, creosote-covered black-heart that knocked her again to her backside with a jarring THUMP!  Her teeth snapped closed, narrowly missing her tongue, and her eyes wandered as her dizzy head spun like a top inside her skull.  Catalina was just clearing the cobwebs when the brute closed one massive paw along her jawline and picked her up to peer into her face.<br>\r\n<br>\r\nHe exposed all three remaining teeth when he sneered, \"Hey!  What's dis then?  HA!  A woman!\"<br>\r\n<br>\r\nCatalina still clutched both of her shoes in her hands, and the soles of them, she knew, were as deadly as any weapon ever wielded by any man.  She spread her arms wide, and this unexpected maneuver made the damned pirate pause to look at her actions with two dimwitted eyes, right before she swung her arms together as if she were crashing a cymbal instead of a man's skull.<br>\r\n<br>\r\nHe cried out and threw Catalina down, whereupon she landed hard against a large piece of railing.  It did not puncture her back and embed itself into her kidneys like the pain indicated it had, but it was certainly enough to forcibly drive the air from her lungs in a sickly wheeze.  There appeared to be two of him as she looked up, and neither was any better looking than the other.</span></div></div>",
            "created":1362541980,
            "id":1544663,
            "title":"Not so fast"
        },
        "1132222":{
            "author_id":"no2freakshow",
            "author_name":"Puckboy",
            "choices":[
                "The first bloke saves her",
                "She saves herself"
            ],
            "content":"<div class=\"\"><div> <span>Catalina had spent much of her life ensconced in the thick, dusty books of her tutelage, and as such, never had the opportunity to experience an explosion of any sort with any kind of proximity.  So when the next cannon ball tore through the main mast and skipped off the deck before striking the man in front of her and sending his body into the sea, she was amazed at the power of the concussion of air as the enormous projectile passed by.  The displacement of which twisted her lungs and made Catalina involuntarily retch.  Thousands of deadly wood splinters tore through the air in search of something soft to pierce.  She wanted to duck but her world seemed oddly lacking in gravity, or a clearly defined sense of up and down for that matter, and instead her head lashed uncontrollably from one side to the other as wooden shrapnel pelted her.<br>\r\n<br>\r\nHad she hit her head?  Why was she unable to focus?<br>\r\n<br>\r\nCatalina fought the nausea to see the huge main mast twisting free of the ship not twenty feet to her right.  And though it occurred to her that she needed to roll or crawl away as it teetered above her, her ragged body was too wobbly to react.  She could only keep still on her back and watch as the giant wooden cylinder broke free of the myriad of rigging that temporarily slowed its free fall and would soon become her tomb.</span></div></div>",
            "created":1362543540,
            "id":1544688,
            "title":"Her assailant becomes cannon fodder"
        },
        "11322221":{
            "author_id":"no2freakshow",
            "author_name":"Puckboy",
            "choices":[
                "Catalina succumbs to the action & passes out",
                "She thanks the pirate for saving her life"
            ],
            "content":"<div class=\"\"><div> <span>And just like that her swirling world upended and her body felt weightless.  The vertiginous feeling was gone, replaced only with a strong sensation of floating.<br>\r\n<br>\r\nHad she died?  Had the main mast crushed her so thoroughly that she never felt any pain, and was currently on her way to the afterlife?<br>\r\n<br>\r\nThe answer was a resounding NO as her limp little body crashed back to the deck with something heavy wrapped around her.  She rolled over some rope, which burned her shoulders, and a random nail came perilously close to her eyes, but Catalina had no time to register this because it was at that very instant when the mast crashed into the deck with a destructive force a hundred times that of the cannon ball just a few moments ago.  It tore into the ship and crashed through the decks on its way through the hull and, eventually, to the very bottom of the ocean.  The ship screamed as the structural integrity gave out and the vessel suddenly turned on itself, collapsing inwardly as water surged upwards through the boat with great tenacity and inevitability, causing the ship's screams to turn to groans, almost as if it were aware of its fast-approaching demise and accepted it with little more than sad moans.<br>\r\n<br>\r\n\"Girl!\"<br>\r\n<br>\r\nWhat?  What was that?<br>\r\n<br>\r\n\"Girl!  Are you injured?\"<br>\r\n<br>\r\nSuddenly, Catalina's strained consciousness allowed her to focus on her surroundings once again, and she realized she was wrapped in the protective cover of two masculine arms.  She wriggled free and fell to her chin.  When she looked up, she stared again into the bluest eyes she had ever seen, the eyes of the first pirate that she'd stomped.<br>\r\n<br>\r\n\"You!\"<br>\r\n<br>\r\nHe sat up and quickly looked around.  Catalina's ship was breaking apart and already the frothy sea was coming up to meet them through the extensive damage of the boat.  \"Are you injured?\" he asked.<br>\r\n<br>\r\n\"I don't, I don't --\"<br>\r\n<br>\r\n\"Can you walk?\"<br>\r\n<br>\r\nAgain, her mouth betrayed her with unintelligible stutters, \"I, I don't --\"<br>\r\n<br>\r\nThe man clenched his jaw beneath his lips and swooped one arm around Catalina's waist as if her were carrying a puppy.  He sprinted over flaming wreckage as easily as one might skip across the sidewalk on a lovely spring day, only with a hundred-pound girl on his hip.  He got to the remains of the outer rail and put one shiny boot on it.  He leaned over and shouted, \"McShay!  McShay, throw me a line, for the love of God!\"<br>\r\n<br>\r\nCatalina's dazed state kept her from knowing the precise actions of her savior, but there was a thump as he caught something in his chest.  Rope, maybe?  Then the weightless feeling returned as the man swung them across to the other boat, the sinister one, whereupon they were pulled from the air by rough hands, one of which found Catalina's breast.</span></div></div>",
            "created":1362545820,
            "id":1544703,
            "title":"The first bloke saves her"
        },
        "12":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Go into your room and hide",
                "Stay here on deck and see what happens",
                "Go tell Thomas and the Captain",
                "Jump over board and hope for the best",
                "Go down into storage and hide inside of a crate"
            ],
            "content":"<div class=\"\"><div> <span>\"There is nothing to worry,\" You tell Thomas.\r<br>\n\"It could be pirates, then we will be in trouble!\" Thomas exclaims. Pirates had been\r<br>\nlurking in the water, and since it is only 1783, pirates seemed to own the sea. \r<br>\n\"Pirates? Are you serious Thomas? Who are they going to hurt?\" You ask. Not knowing of\r<br>\nthe real harm pirates could do to you. \"You\r<br>\nare seriously a crazy woman. I'm going to tell the Captain if you like it or not,\" Thomas said rushing down to talk to the Captain.\r<br>\n\r<br>\nIt had been around fourty-five minutes before\r<br>\nthe thing they had seen was a hundred yards\r<br>\naway. \"It is a pirate ship!\" You exclaim. Feeling frightened and scared, you aren't sure of what to do. </span></div></div>",
            "created":968389200,
            "id":3635,
            "title":"The Pirate Ship"
        },
        "121":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Scream! Hopefully someone will hear you",
                "Keep quite and duck to the end of the bed and hope no one will see you"
            ],
            "content":"<div class=\"\"><div> <span>You run into your room, and hide underneath\r<br>\nyour bed. You are scared to find out what happens. You hear the shipmates yelling \r<br>\n\"Pirate!\". Your scared, and you slide farther\r<br>\nback until you are against the wall. A pirate\r<br>\nwalks into your room. You see he has black boots. He's kneeling on the floor, and your\r<br>\nafraid he's going to look down at you.\r<br>\n\r<br>\n\"Hugo! Hurry up! We got what we want! Let's go! Everyone's not going to be leaving this ship. Hurry, we're going to shoot the bottom of this ship and let it sink to the bottom!\"\r<br>\nsays another pirate from the top deck. \"Wait\r<br>\na minute, I'm checking this room first!\" Hugo\r<br>\nyells.</span></div></div>",
            "created":968389200,
            "id":3637,
            "title":"Hugo: The Pirate"
        },
        "1211":{
            "author_name":"aliora_18",
            "choices":[
                "Struggle and try to kick him away.",
                "Wait and watch what will happen and hope for the best."
            ],
            "content":"<div class=\"\"><div> <span>You are grabbed by your your ankle, which was sticking out, and are jerked up to stand face to face with your captor.  Your heart catches in your throat.  You are staring into the sparkling eyes of beautiful light blue... you look into his face.  He is ruggedly handsome with a trimmed black beard that went well with his shoulder length unruly black hair.  Your eyes widen and you pay too much attention to to his teasing smile to notice two other pirates run inside.\r<br>\n\"Alec!  They're all dead, we've got their cargo, let's go!\"\r<br>\nI gulped.  Alec.</span></div></div>",
            "created":976338000,
            "id":16433,
            "title":"Alec"
        },
        "12111":{
            "author_name":"Nina",
            "choices":[
                "Be taken to the pirates ship."
            ],
            "content":"<div class=\"\"><div> <span>Everyone is dead? My dear Thomas tooken away from me by heartless pirates as these. You start to scream \"Get away from me!\" However, as if your resistance and screams meant nothing they laugh. \"They got what they deserved!\" exclaimed Hugo. With the heat intensity and your mind in a race you become dizzy, and before you realize it you've fainted in Hugo's manly,firm, yet gentle arms.</span></div></div>",
            "created":980658000,
            "id":25764,
            "title":"Why?"
        },
        "121111":{
            "author_id":"goldentales",
            "author_name":"PreciousWords",
            "choices":[
                "pretend to be dead so that he will throw you out."
            ],
            "content":"<div class=\"\"><div> <span>You were gagged and your wrists and ankles are tied in the hardest rope.You tried to move,but could not. You were thrown to the room and locked inside. You are hungry after a few hours,and started to scream. <br>\r\n 'What happened?\" yelled the pirate.<br>\r\n  </span></div></div>",
            "created":1299150420,
            "id":1063894,
            "title":"Be taken to the pirates ship."
        },
        "1212":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Run like hell out of there and find somewhere else to hide",
                "Let him take you"
            ],
            "content":"<div class=\"\"><div> <span>You duck, hiding in the dark. Hugo leans over and looks under the bed. He spots you and smiles. \"Well, well. What do we have here? A young, beautiful, maidan!\" Hugo sneers. He reaches under and pulls your leg.\r<br>\n\r<br>\nWith great stregnth, he yanks you out from underneath your bed. \"Let me go! You fien! You theif! Let me go!\" You scream. You hope\r<br>\nThomas will come charging through the door, and save you. You hope and hope, but nothing\r<br>\nhappens. \"Come hear darlin! You're comin\r<br>\nwit me!\" Hugo exclaims. You are fully out from underneath the bed and you are sitting there, as he looks down at you.</span></div></div>",
            "created":968389200,
            "id":3638,
            "title":"Being Discovered"
        },
        "12121":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "It's Thomas",
                "It's another crew mate"
            ],
            "content":"<div class=\"\"><div> <span>You get up and run, and Hugo just laughs. \r<br>\n\"You aren't going to find a place to hide\r<br>\nDarlin! One of the other pirates will find you and bring you along!\" He exclaims as you\r<br>\ndash from the room and out into the small hallway. There is a door that leads to the cargo room that is on the bottom of the boat.\r<br>\nYou know its a stretch, but you head for it\r<br>\nanyway.\r<br>\n\r<br>\nAs you are about there, a strong arm pulls \r<br>\nat your arm and lifts you onto his shoulder.\r<br>\nA pirate. You scream, and you kick, and you\r<br>\npunch. You are trying anything at this moment\r<br>\nbecause you can't do anything else. You see\r<br>\nthe bright sun, but you also see bodies.\r<br>\nTons of bodies. You are brought around to where the captain's cabin is. You see the captain lying on the floor, along with another body.</span></div></div>",
            "created":968389200,
            "id":3639,
            "title":"The Bodies"
        },
        "121211":{
            "choices":[
                "The pirate helps her escape",
                "The pirate convinces her to go with him"
            ],
            "content":"<div class=\"\"><div> <span>Struggling violently you are able to free yourself, falling ungraciously to the floor with a hard THUD! With tears streaming down your face you crawl over to the other body. Reaching out, your fingers trembling, you turn the head towards you and stare into the lifeless face of Thomas.  \"NO! THOMAS!\" Crying as you cradle his head in your lap,  \r<br>\n\r<br>\nTurning abruptly you glare at the pirate. Lowering Thomas' body back to the floor she charged the pirate, her fists pummeling his massive chest. Unable to help himself he wrapped his arms around her, holding her close while she cried. He kept saying it was to protect himself, but he knew as he held her, felt her heart pounding in her chest,  that it was much more than that.</span></div></div>",
            "created":968475600,
            "id":3640,
            "title":"Awakenings"
        },
        "1212111":{
            "choices":[
                "2 years later..."
            ],
            "content":"<div class=\"\"><div> <span>You don't know what's come over you, but without conscious thought you continue to beat at the man, screaming as though the devil were at your heels. The pirate seems lost for words, or acts. As you cry you glare up into his face and his eyes catch yours. You are startled to see, not a wild-eyed, scratchy-stubbled, scar-faced loony, but steady, wide blue eyes, cloudy like the sea after a storm. He raises his hands to clasp your forearms, not gruffly, but firm. Your breath catches in your throat and you stop moving, unable to tear your eyes from his. <br>\r\n<br>\r\nYou aren't aware of it yet, but he is moving, taking you with him but not dropping his gaze. Before you know it, you are leaning against a wall and you close your eyes, hoping that if he rapes you, that he kills you afterward; you cannot go home with that sort of shame. To your suprise, he speaks.<br>\r\n<br>\r\n\"Listen to me, girl,\" his voice is low, but heavy with emotion. \"I am going to hit you, and it's going to hurt-you will pass out. When you awaken, you are not to move from where you are.  Do not call for help, and do not scream. Do you understand me?\"<br>\r\n<br>\r\nNo, you don't understand him, but you nod anyway, unable to do anything else. The pirate raises his hand. You feel a sharp pain on your neck, his face swims before you, and his lips are moving but you can't make out his words. Everything goes black. </span></div></div>",
            "created":1086670800,
            "id":202322,
            "title":"The Reluctant Reverser"
        },
        "12121111":{
            "choices":[
                "A voice calls your name",
                "You spot the merchant vessel"
            ],
            "content":"<div class=\"\"><div> <span>You cannot believe it has been two years since that day on the Maestro, yet you stand on the edge of the dock, your eyes searching the sea beyond for a glimpse of the ship that will bear you home. After the massacre aboard that ship, you awoke in the kitchen, your head swimming with hazy memories. A voice called out in the din. You tried to answer but your voice seemed lost. A British naval ship had arrived. <br>\r\n<br>\r\nIt seemed as though the pirate you had come in contact with had rendered you unconscious and left you for dead below deck. When the soldiers brought you out, fallen sailors littered the starboard side as other British servicemen piled them high. You did not see Thomas's body. The fleet sailed straight back to London and from there you sent a letter home. For safety precautions, you remained in London, serving as a governess for a local merchant's children. <br>\r\n<br>\r\nNow, however, your family considered it safe to return to the States, and you calmly await the vessel that will bear you hence. <br>\r\n<br>\r\nMany changes...You remember a time when appearances and stature mattered to you, only 2 years ago. Now, even as a proper teacher for proper English children you find yourself drifting from the everyday and gazing back to the sea, remembering the day you started to believe in fate.<br>\r\n<br>\r\n</span></div></div>",
            "created":1086670800,
            "id":202325,
            "title":"Dry Docked"
        },
        "121211111":{
            "choices":[
                "Caleb gives you a gift",
                "Caleb asks you to marry him"
            ],
            "content":"<div class=\"\"><div> <span>You break your gaze with the sea and cock your head to the side as you hear a familiar voice call your name. <br>\r\n<br>\r\n\"Oiy! Catalina, and where dew ya think yar goin'?\"<br>\r\n<br>\r\nYou smile as you recognize Caleb O'Sullivan's jaunty call. <br>\r\n<br>\r\n\"Far and away, Caleb, far and away,\" you sigh as you turn to face him.<br>\r\n<br>\r\nCaleb was the soldier who had found you in the ship's kitchen that terrible day. A career soldier and sailor, Caleb had been your best friend for the last 24 months and despite everyone's best wishes that the two of you wed, the relationship stayed strangely platonic. <br>\r\n<br>\r\n\"Yar no thinkin' 'o goin' back out dere, are ya?\"<br>\r\nCaleb jokingly asked, nudging your shoulder.<br>\r\n<br>\r\n\"What? And leave you to all these poor barmaiden's? Not on your life, Irish!\"<br>\r\nYou quip, snatching the sailor's hat off his head and placing it on yours.<br>\r\n<br>\r\n\"Now Cat, ah know yer family wants ya ta come home and awl, bet ah still think it's no safe,\"<br>\r\nhe says seriously, leaning against the railing and looking sharply at you.<br>\r\n<br>\r\n\"I highly doubt those same pirates are in any way after me, Caleb,\" you reply, \"Besides, he left me for dead. Do you really think I even matter to them? For God's sake, Irish, I'm just one girl out of a million they've terrified.\"<br>\r\n<br>\r\n\"Ya are one in 'o million, Cat,\" Caleb said, looking out at the ocean. \"Yar ma best friend, and ah don't wan ana-thing ta happen to ya.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1086670800,
            "id":202326,
            "title":"Far And Away"
        },
        "1212111111":{
            "choices":[
                "On The Ship",
                "Other passengers"
            ],
            "content":"<div class=\"\"><div> <span>You run your fingers through his red hair.<br>\r\n<br>\r\n\"You know well that I can take care of myself, Caleb,\" you say.<br>\r\n<br>\r\nCaleb nods. \"Yah, after ya learned from the best!\"<br>\r\n<br>\r\nHe stands tall and preens himself. <br>\r\n<br>\r\n\"I always said that your only fault was that you were too inclined to give yourself airs,\" you laugh, adjusting the hat on your head.<br>\r\n<br>\r\nCaleb then leans back in toward you, closer than is considered proper and whispers in your ear,<br>\r\n\"Remember what ah taught ya, and keep this close.\"<br>\r\n<br>\r\nHe then slips something solid into your hands before kissing your cheek. Curious, you slowly unwrap the item from the snatch of rigging canvas it's wrapped it. It's a broad, sharp, newly cut dagger, its handle engraved with a tiny mermaid. You run your index finger along the blade till you reach the tip. You shift as the blade nicks your skin and a bright drop of blood runs to your palm. <br>\r\n<br>\r\n\"Thank you, Caleb. It's beautiful,\" you smile, rewrapping it and slipping it into your pocket. <br>\r\n<br>\r\nCaleb places his hands firmly on your shoulder's and looks you squarely in the eyes.<br>\r\n<br>\r\n\"Remember, it's no tha weapon thas impartant, but the one who wields et,\" he says.<br>\r\n<br>\r\nYou nod and wrap your arms around his waist, laying your head on his chest as he follows suit.<br>\r\n<br>\r\n\"I will remember,\"<br>\r\nyou promise. <br>\r\n<br>\r\nCaleb holds you for a moment longer, despite the stares of other passengers and sailors, then releases you, patting the hat on your head.<br>\r\n<br>\r\n\"Keep a sharp eye,\" <br>\r\nhe mutters, bowing deeply before dashing off the dock towards the fort.</span></div></div>",
            "created":1086757200,
            "id":202330,
            "title":"Sharp Blades And Sharper Eyes"
        },
        "12121111111":{
            "choices":[
                "In your cabin",
                "Dinner with the Hart's"
            ],
            "content":"<div class=\"\"><div> <span>You spend the next couple hours leaning over the starboard side, squeezing your eyes shut and swallowing hard. After 2 years of only being on pleasure boats in the bay with Irish, she hadn't quite gotten her sea-legs yet, or for that matter, stomach. She wasn't alone however; most of the other passengers on the Saint Cleary were English patrons who'd never sailed in their lives, and were equally wrong-footed. <br>\r\n<br>\r\n\"You don't look half as ill as the rest of us,\"<br>\r\na groggy voice commented as you raised your head from over the side. <br>\r\n<br>\r\nA girl with stringy blond hair, a couple years your senior smiles tremulously at you, slightly green. You chuckle.<br>\r\n<br>\r\n\"Well, I've learned to keep it down,\"<br>\r\nyou reply, wiping your sweating forehead.<br>\r\n<br>\r\n\"Saw you with that soldier back there on the deck-is he your man?\"<br>\r\nShe asked.<br>\r\n<br>\r\nYou can't help but laugh. <br>\r\n\"No, he's not my...he's naught but a very good friend of mine,\" you muse. \"He's been taking good care of me these last years. Are you always so observant?\"<br>\r\n<br>\r\n\"Usually,\" she shrugged,\"but only when it comes to things of that nature. The name's Katherine Hart.\"<br>\r\n<br>\r\n\"Catalina Sherwood.\"<br>\r\n<br>\r\n\"Sounds like a rich, red wine. Anyone ever tell you that?\"<br>\r\n<br>\r\n\"Many, considering that's what my father named me after. Said my momma drank so much of it, was bound to be born looking like this,\" you said, running your fingers through your damp red curls.<br>\r\n<br>\r\nKatherine smiled wryly. Suddenly, she was all business.<br>\r\n<br>\r\n\"They say it'll be a long trip, couple weeks to a month. What say you to being my company?\"<br>\r\nShe asked, kind of shyly but still confident.<br>\r\n<br>\r\nYou pretend to mull it over for a moment. Then you grin.<br>\r\n<br>\r\n\"Why not? Two young girls like ourselves should not be left alone for such a time,\" you remark, preening importantly.<br>\r\n<br>\r\n\"Good. Well, I'm going to get ready for dinner. Meet me there? You can meet my family, then.\"<br>\r\n<br>\r\n\"Alright. See you there, Miss Hart.\"<br>\r\n<br>\r\nAnd she left with a flounce of skirts and wiggling of her fingers. Your smile faded as you turned and looked out to sea. A faint spot on the horizon, near the setting sun, caught your eye. You blink, then eye it suspiciously. </span></div></div>",
            "created":1087275600,
            "id":203238,
            "title":"Sea-Side Meet & Greet"
        },
        "121211111111":{
            "choices":[
                "Katherine wakes you",
                "Shouting..."
            ],
            "content":"<div class=\"\"><div> <span>The sun was set, and dinner was served. You spent your time there eating sparingly, for the feeling chewing up your insides was not hunger. Plus, you could tell that despite your excellent references as a schoolmarm, Katherine's rich and hoity-toity family did not care for you. You stayed for only 20 minutes before retiring to your cabin.<br>\r\n<br>\r\nAs you sat on the bed, you reached into your pocket and retrieved your soldier's parting gift. It really was a very well-made blade, and you shuddered to think what he paid to get it to you. No matter, it was for use. Hoping dearly you wouldn't need to use it anytime soon, you slipped it under your pillow and lay down in your clothes, one eye open towards the sea out your port window...</span></div></div>",
            "created":1087275600,
            "id":203243,
            "title":"Suspicion"
        },
        "1212111111112":{
            "choices":[
                "Up on deck",
                "Captain's office"
            ],
            "content":"<div class=\"\"><div> <span>A shout and a piercing scream ripped through your foggy dreams as your suspicions were confirmed. Quietly you slipped your dagger from under your pillow and slid it into your boot. You headed for the door, and as you wrenched it open, another scream echoes through the hall and someone goes rushing past, pursued by another. The pursuer stops suddenly and whirls at you. Steeling your nerves, you face the sweaty, unshaven mass that is indeed a pirate. He grins sichophantically at you as he advances to your door. You stand still, hoping he cannot hear your beating heart through your breast. He makes to grab your arm...<br>\r\n<br>\r\n...when your knee suddenly connects with his groin, and moaning he sinks to the floor, woozy, but still alert. He growls, but your fist plows into his face. His eyes whirl for a moment, then close as he passes out before you. You purse your lips as you dash from your cabin and out into the hall, following the shrieks and clanging metal. </span></div></div>",
            "created":1087275600,
            "id":203247,
            "title":"Attack"
        },
        "12121111111121":{
            "choices":[
                "You are grabbed from behind",
                "You turn..."
            ],
            "content":"<div class=\"\"><div> <span>Squinting through the hazy fog that seems to have followed the pirates onboard, you silently climb the stairs to top deck. Sounds of metal on metal, and dying groans meet your ears. The terrified scream blasts the din once more and you can make out the forms of people running across the deck. <br>\r\n<br>\r\n\"Get the women below, Jeremy, hurry!\" <br>\r\nA commanding voice cried.<br>\r\n<br>\r\nAs you hurry towards the voice, something heavy lands at your feet. A sailor, more than likely this Jeremy, the firstmate, lies bleeding from the head and unmistakably dead. Silently praying for his immortal soul, you gank the short-sword from his cold fingers and peer across the deck.<br>\r\n<br>\r\n\"Catalina! Run!\"<br>\r\nA terrified shriek...Katherine Hart.<br>\r\n<br>\r\nA greasy, scabby-looking toughie has his arm around her neck and a blade to her side. Growling with anger, you charge at him. He looks quite surprised, but pushes Katherine aside, raising his sword. As he raises it high, you dive low and force your blade into his thigh, a low blow, but a lifesaving one for him. He drops his sword as he howls with pain, and you uppercut, slamming your elbow into his chin and he falls back against the bow, tumbling over with a small splash. </span></div></div>",
            "created":1087275600,
            "id":203257,
            "title":"Testing The Waters"
        },
        "121211111111212":{
            "choices":[
                "Bitch her overboard",
                "take her below"
            ],
            "content":"<div class=\"\"><div> <span>Smiling to yourself, you adjust your stance and look down at Katherine. But she is not looking to you, instead her eyes are fastened on a point behind you. Slowly, you turn around. Out in the fog, about mid-deck, another pirate appears before you, but he is not fighting, his eyes are on you. Your hand clutches the sword tighter as your eyes adjust to the dark, and suddenly, to your horror, you recognize him...<br>\r\n<br>\r\n...Eyes as blue as the sea after a storm. The pirate who, to be quite honest, had saved your life. That meant, however, that these were the same pirates who attacked the Maestro, leaving everyone aboard dead. The pirate looked just as shocked to see you as you did him, especially at the sight of you holding a sword. You shake yourself out of your reverie and grab Katherine's arm. If you don't get her off this ship, she will surely die. <br>\r\n<br>\r\nEyes still on the pirate, you whisper to her.<br>\r\n\"Katherine, I want you to do exactly as I say and do nothing different, do you understand?\"<br>\r\n<br>\r\nA whimper assurred you her unwavering obedience. You watched the pirate warily, but he did nothing to stop you. Indeed, he seemed to be motioning to the ocean behind you with his beautiful blue eyes. </span></div></div>",
            "created":1087275600,
            "id":203265,
            "title":"Recognition"
        },
        "1212111111112121":{
            "choices":[
                "climb to the crow's nest",
                "keep running"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, as if a candle had been lit in your brain, an idea surfaces. <br>\r\n<br>\r\n\"Katherine, can you swim?\"<br>\r\n<br>\r\n\"W...well enough, when called upon,\"<br>\r\nshe stammered.<br>\r\n<br>\r\n\"Good.\"<br>\r\n<br>\r\nYanking her by the arms, you shove her against the bow.<br>\r\n<br>\r\n\"When you get down there, don't move, stay in the shadows,\" you instruct her.<br>\r\n<br>\r\n\"When I get where, Catalina?\"<br>\r\n<br>\r\n\"Good question.\"<br>\r\n<br>\r\nWith one forceful shove, you tossed Katherine Hart overboard. Her scream was alerted other pirates ondeck to your presence however, so there was little time to celebrate. With a shout of triumph, three raggedy thieves charged at you, swords flying. Time to run now. You hurl yourself out of the line of fire, rolling to a stop near the prow. </span></div></div>",
            "created":1087275600,
            "id":203267,
            "title":"Sea Saves Another"
        },
        "1212112":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Go",
                "Go down with the ship"
            ],
            "content":"<div class=\"\"><div> <span>\"Come with me. This ship is going to sink! If\r<br>\nyou don't come now, you will go down with the ship! Is that what you want?!\" The pirate\r<br>\nasks. You slide to the floor and look in the\r<br>\ncaptain's cabin, and see Thomas lying in a \r<br>\npool of blood. You turn the other way, not\r<br>\nknowing what to do. </span></div></div>",
            "created":968475600,
            "id":3641,
            "title":"Go or Not To Go, that is the question"
        },
        "12121121":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Stay in the room and wait for Tylas to come back with food",
                "Run and see if someone will help you"
            ],
            "content":"<div class=\"\"><div> <span>You stand up and you nod to the pirate. He\r<br>\npicks you up and sets you on his shoulder. \r<br>\n\"You have made a good descision,\" The pirate\r<br>\nsays picking up speed to jump off the boat.\r<br>\n\r<br>\nHe lands of the deck of his ship, and then\r<br>\nwalks past some other pirates. You feel like\r<br>\nan idiot being carried the way you are. He\r<br>\nwalks into a hall, and down another hall. He\r<br>\ncomes to a door, and knocks. \"Come in you\r<br>\nbafoon!\" Calls a voice inside. He opens the\r<br>\ndoor and then shuts it quickly behind him.\r<br>\nYou look around, and notice there are large\r<br>\ncrates and bags littering the floor. \r<br>\n\r<br>\n\"We found her aboard the ship. She was the \r<br>\nonly woman on board captain,\" The pirate replied. \"Well Tylas. I see you did. Why\r<br>\ndidn't you kill her like we had planned?\"\r<br>\nThe captain replied. \"Well, we didn't know \r<br>\nshe was on board. Hugo found her, but she\r<br>\nhad ran away. I found her, but the ship was\r<br>\nalmost sunk. We had no other choice,\" Tylas\r<br>\nlied. \"Well, go give her a room on the other\r<br>\nside of the ship. Give her a meal, and then\r<br>\nleave her alone. Tell everyone else to leave\r<br>\nher alone as well. Including Hugo!\" exclaimed\r<br>\nthe captain. Tylas nodded and then picked you\r<br>\nup again.\r<br>\n\r<br>\nYou walk down many more halls before coming\r<br>\nto your room. It's empty besides a bed and a\r<br>\ndesk. He sets you on the bed then leaves. You\r<br>\nare totally alone inside a room that you've\r<br>\nnever been before. Tears build up in your\r<br>\neyes. You can't hold them back anymore. Just\r<br>\nthis morning, life couldn't get any better, when the pirates come in and murder everyone.\r<br>\nYou should have gone with him when he went\r<br>\nto tell the captain, you think to yourself.</span></div></div>",
            "created":968475600,
            "id":3642,
            "title":"Inside the ship"
        },
        "121211211":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Throw the food out the window",
                "Eat the food"
            ],
            "content":"<div class=\"\"><div> <span>It's had been fourty-five minutes before\r<br>\nTylas had come back with some food. A biscut,\r<br>\na chicken wing, and a potato. \"Here, and a \r<br>\nglass of water for you,\" Tylas replied. \"If you need anything, I will be back in a couple\r<br>\nhours,\" He adds. He walks towards the door, and then leads. He comes back in with a lantern. \"This is for light. It will be dark\r<br>\nsoon,\" Tylas replied sitting it down on the\r<br>\ndesk, which is next to your bed. \"Thank you,\"\r<br>\nYou say. He nods and then leaves. </span></div></div>",
            "created":968475600,
            "id":3643,
            "title":"Food and a lantern"
        },
        "1212112112":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Dream...",
                "Wake up because you hear a noise"
            ],
            "content":"<div class=\"\"><div> <span>You take a bite of the chicken wing. Since\r<br>\nit had been so long since you had had something to eat, you were starving. The \r<br>\nchicken tastes so good. With all of the spices and juices, you can't get enough of it. It is gone before you know it. You eat\r<br>\nthe buscuit next, once you put the butter on,\r<br>\nthe butter seems to melt within seconds. You\r<br>\ntake a bite, and you feel as though your in\r<br>\nheaven. You take a couple drinks of water. \r<br>\n\r<br>\nBy the time you reach the potato, you can not\r<br>\nfinish it. You save it though. You put it inside a dresser drawer. You put the plate on the floor as with the glass. You take your\r<br>\nshoes off, as with your dress. Your slip is\r<br>\nunderneath. You figure you will use this as\r<br>\nyour bajamas. You slip into bed, and the bed\r<br>\nis quite comfortable. The sheets are soft, as\r<br>\nthough they were made of silk. Before you know it, you are asleep.</span></div></div>",
            "created":968475600,
            "id":3644,
            "title":"Delicious Food"
        },
        "12121121122":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Go over and talk with him",
                "Wait and see if he'll come over"
            ],
            "content":"<div class=\"\"><div> <span>A loud bang bounds outside. Your eyes flash\r<br>\nopen, and bright lights are outside. You sit\r<br>\nup in bed, and put on a dress that they had\r<br>\nlaid out for you. It was very elegant, and\r<br>\nlooks expensive. You put it on, and it fits\r<br>\nperfectly. You put on the shoes they also\r<br>\nlaid out. They are perfect size. You feel weird that everything fits perfectly. \r<br>\n\r<br>\nYou open the door of your cabin, and walk out\r<br>\ninto the hallway. You turn left and down the hall, then right and down that hall. You turn\r<br>\nright, and down into the main hall. The main\r<br>\nhall is empty. Everyone must be outside, you\r<br>\nthink. You open the door to the top deck.\r<br>\nEveryone is dancing, and laughing, and drinking. Including the cute, beardless pirate you had seen earlier. He glances over\r<br>\nat you, and smiles. He has dark hair, dark\r<br>\neyes, and dark skin, with large muscles.</span></div></div>",
            "created":968562000,
            "id":3657,
            "title":"The Party"
        },
        "121211211222":{
            "author_name":"Smiley",
            "choices":[
                "dance with him",
                "politely decline"
            ],
            "content":"<div class=\"\"><div> <span>As he walks toward you you realize what a handsome man he is.  First you notice how his eyes seem to burn with meekness.  He has big shoulders and very well defined muscles.  You notice that he is a natural leader and you see great power and passion in him, but you also see that he has master his great power and passion.  It is this meekness or power under controll that causes your body temp. to rise and your cheeks to turn red.  Then you remember he is a pirate and you want to get away from him as soon as possible.  He extends his hand and askes you to dance.  </span></div></div>",
            "created":968821200,
            "id":3660,
            "title":"here he is"
        },
        "1212112112221":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Tell him",
                "Don't tell him, let him figure it out"
            ],
            "content":"<div class=\"\"><div> <span>You take his hand and he pulls you close to him. He smells like sweet spices. You look up\r<br>\nat him, and notice he is looking down at you.\r<br>\n\"Hugo right?\" You ask. He nods. \"Don't you speak?\" You ask wondering why he doesn't speak. \"Of course I speak,\" He replies in a deep, sexy voice. \"What is your name?\" He asks.</span></div></div>",
            "created":969080400,
            "id":3661,
            "title":"Dancing"
        },
        "12121121122211":{
            "author_name":"Shae",
            "choices":[
                "Listen to him...",
                "ignore his warning and beg him to stay with you."
            ],
            "content":"<div class=\"\"><div> <span>\"It's Catalina.\"  You don't say your last name, don't really feel the need.  \"Where are we?\"  You look around trying to look for clues, but only see the endless horizen of ice blue water.  \r<br>\n\"Some where in the Atlantic, geography isn't really my job.  You should ask one of the captains scribes that.\"  You marvel at his charm, the way he smiles and jokes with the other pirates.  You begin to think that maybe he isn't so bad, then just as quickly as you thought it you dismiss the idea, yet it sticks in the back of your mind.\r<br>\n\"Captain!\"  A young man scambles down from the crows nest and scurries to the captain who is sitting in a throne like chair at the head of the deck.  \"Captain!  Straight ahead, it a British fleet, four, maybe five ships.\"\r<br>\nYou watch in amasement as the men move about quickly, working in considerable ease, as if they had done it a million times.  She nearly giggled at that thought, of course they had done this a million times, it was their job.  When they began to load the cannons, wheeling them around to face the opposing ships, she began to get frightened.  Just them you see a black ball flying towards you.\r<br>\n\"Catalina!\"  Hugo grabs your arm and wisks you out of harms way.  You are breathing hard, holding onto his shoulders for support.  \"Get to your cabin!\"\r<br>\n</span></div></div>",
            "created":969685200,
            "id":3668,
            "title":"The dance"
        },
        "121211211222111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "The doorknob jingles"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay. But please promise you'll return to\r<br>\nme,\" You beg. He is silent for a moment. \"I'm\r<br>\nnot sure I can promise, but I promise,\" Hugo\r<br>\nreplies. \"Now, you better go see what the\r<br>\ncaptain wants you to do,\" You say holding his\r<br>\nhand. He smiles at you. \"I'll be back before\r<br>\nyou know it,\" He says. He smiles one last\r<br>\ntime, then closes the door from behind you.\r<br>\n</span></div></div>",
            "created":975214800,
            "id":13903,
            "title":"He Leaves"
        },
        "1212112112221111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "They take you aboard their ship"
            ],
            "content":"<div class=\"\"><div> <span>After the door opens, two pirate men are\r<br>\nstanding in the doorway. These aren't the \r<br>\npirate men that belong to the group of\r<br>\npirates that Hugo belongs too. \"Well, this\r<br>\nmight not be such a total loss,\" said the\r<br>\none on the left. \"She's quite a catch ain't\r<br>\nshe,\" says the other one. You are in total\r<br>\nfear, and aren't sure what you should do.\r<br>\n\r<br>\nYou back up as far as you can. \"Matisa, go\r<br>\nget the others. Round them up, tell them\r<br>\nwe don't have to take anything. We got what\r<br>\nwe want,\" said the pirate with some teeth\r<br>\nmissing. Matisa left. But before he did, he\r<br>\nsaid, \"Remile, are we going to take any\r<br>\ngold?\" Remile stood quiet before answering.\r<br>\n\"If you find any while you are rounding up\r<br>\nthe men, then yes, if not then no,\" Matisa\r<br>\nnodded and then left.</span></div></div>",
            "created":975214800,
            "id":13906,
            "title":"Going With Them"
        },
        "12121121122211111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "The Next morning...",
                "Later that night..."
            ],
            "content":"<div class=\"\"><div> <span>Remile grabs your arm and pulls you out of\r<br>\nyour cabin. No one seems to notice you as\r<br>\nyou walk by. They are all fighting, and you\r<br>\nsee Hugo's pirates fighting the other pirates. They continue to pull on you.\r<br>\n\r<br>\nOnce you are aboard their ship, the fighting\r<br>\nstops. \"Let's leave! Hurry, before they find\r<br>\nout that we've taken her,\" Remile screems.\r<br>\n\r<br>\nYou manage to escape from Remile's grip, and\r<br>\nrun to the edge. \"Hugo! Help! Hugo!\" You\r<br>\nscream. Hugo looks up and spots you. His\r<br>\nface is now lined with fear. \"Catalina!\"\r<br>\nHugo exclaims. You hold out your hand as\r<br>\nthough he's going to reach up and grab him,\r<br>\nbut Remile pulls you back.</span></div></div>",
            "created":975214800,
            "id":13919,
            "title":"You are taken Away"
        },
        "121211211222111111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Try to break down the door",
                "Just sit in the opposite corner, and see what happens next"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Matisa comes in, and gives\r<br>\nyou food. You won't eat it. Even though your\r<br>\nhungry. You are going to protest, even if it\r<br>\nmeans you will die. He just shrugs and walks\r<br>\noff. All you could think about was Hugo. \r<br>\nYou and him had been getting along rather well since you've come aboard their ship.\r<br>\nHis captain must except you, for he has done\r<br>\nnothing to either Hugo or yourself. You don't\r<br>\nthink he would've done anything anyways, and\r<br>\nwonder why you thought such a thing.\r<br>\n\r<br>\nYou get up, and walk to the window. It's about noon, and you wish you had Hugo to hold\r<br>\nyou right now.\r<br>\n\r<br>\nAt that same moment, something knocks the ship. You fall to the floor and slide all of\r<br>\nthe way to the opposite wall. \"Oh God All Mighty!\" You exclaim. You have no clue to what could have happened. You get up, and\r<br>\nwalk to the door. The door is locked. You\r<br>\nbegin to hear a sound of running water. You are on the bottom of the ship. You wonder why\r<br>\nthey put windows on the bottom part if you\r<br>\ncan't even see out them except water. \r<br>\n\r<br>\nYou look down, and notice some water coming\r<br>\nbetween the wall and the bottom of the floor.\r<br>\n\"Oh no! This ship is going to sink!\" You exclaim. </span></div></div>",
            "created":976942800,
            "id":17835,
            "title":"The Ship is Sinking!"
        },
        "1212112112221111111":{
            "author_name":"Celestialsplendor",
            "choices":[
                "Chance it...",
                "Accept defeat and curl into a ball on the bed."
            ],
            "content":"<div class=\"\"><div> <span>You satre around you trying to find a something to bash it in.  Histeria is creeping into your throat.  This is the first time you have to do something on your own.  You only have yourself to depend on.  You throw yourself on the door and attempt to bang on it.  You scream hoping to attract some one so they can come and and set you free.  As you do this the water is rising.  It's over your knees.  Your dress is heavy from the water and floats around you.  YOur eyes are starting to tear up as you realise that no one is coming.  Suddenly your face is turned to the window.. could it be big enough?\r<br>\nYou go to stand next to it, water is pushing on you but you realise that it could be big enoogh for you to swim through!</span></div></div>",
            "created":977029200,
            "id":17913,
            "title":"Help?"
        },
        "12121121122211111111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Find out who it is..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You try to break the window, but it won't\r<br>\nbreak, and you are a little afraid that the\r<br>\nwater that would come from the window would\r<br>\ndrown you. You look towards the door, and the\r<br>\ndoor opens. Your mouth hangs open</span></div></span></div>",
            "created":977029200,
            "id":18013,
            "title":"The Savior"
        },
        "121211211222111111111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "See what happens next"
            ],
            "content":"<div class=\"\"><div> <span>Hugo! \"Catalina?\" He asks. \"Hugo! I'm here!\"\r<br>\nYou exclaim, as you try to wade through the\r<br>\nwater which is now up to your chest. \"Come\r<br>\nwith me Catalina. I have you,\" He replies,\r<br>\ngrabbing hold of you, and pulling you out into the hallway. The water is a little lower, but still has hard to get through.\r<br>\n\r<br>\nThere's a crack, and the sound is of splitting wood. The top of the ship breaks\r<br>\naway from the bottom half, which is totally\r<br>\nfull with cold water. \"Hugo! What's going to\r<br>\nhappen?\" You ask with fear. You are now totally soaked. \"Just hold on to me, and I'll\r<br>\nget you out of here,\" Hugo said. His grip\r<br>\naround you tightens. \r<br>\n\r<br>\nThe suction of water from the top of the ship, to the bottom, sucks the both of you\r<br>\nunder water. You hold onto Hugo as though\r<br>\nhe's your only life source left. Which in\r<br>\ntruth, he really is. From all of the suction,\r<br>\nand the water pounding on your head. You\r<br>\nblack out.</span></div></div>",
            "created":977029200,
            "id":18016,
            "title":"The Ship Goes Under"
        },
        "1212112112221111111111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "He tells you now",
                "He tells you later"
            ],
            "content":"<div class=\"\"><div> <span>When you wake up, your in a bed. Your vision\r<br>\nis blurry, and you see only a few dark blurry\r<br>\nspots. Closing your eyes and then opening\r<br>\nthem helps. \"Catalina? You awake?\" A voice\r<br>\nasks. You nod. It's Hugo. \"How long have I\r<br>\nbeen out?\" You ask. \"A couple of days. The suction pushed a lot of pressure onto your\r<br>\nhead Catalina,\" Another man said, who was\r<br>\nthe doctor aboard the ship. His name was Jefferson Millego.\r<br>\n\r<br>\nA pirate named Gramm came in with some food.\r<br>\n\"Are you hungry Catalina?\" He asked. He set\r<br>\nthe tray on the side table. \"Oh yes Gramm! I\r<br>\ndidn't eat when I was on that ship!\" You\r<br>\nexclaim. You grab a piece of toast and eat it\r<br>\nuntil it's all gone. \"Didn't they feed you?\"\r<br>\nHugo asked. \"Yes, but I was so angry at them\r<br>\nthat I didn't dare eat their food,\" You reply. Hugo looked up at Gramm. Gramm looked\r<br>\ndown at you. He was an older pirate, around\r<br>\nhis mid-fifties. He was very kind, not like\r<br>\nmost of the other pirates who were mean and\r<br>\ncruel.\r<br>\n\r<br>\nHugo got up and went to one of the windows.\r<br>\nHe looked out for awhile before you spoke.\r<br>\n\"What's wrong Hugo? Are you mad because I\r<br>\ndidn't eat? If you are, I'm sorry, I guess I\r<br>\ndidn't really thi-\" \"No, I'm not mad at you.\r<br>\nI- well, we have something to tell you Catalina,\" Hugo replied. \"What is it Hugo?\r<br>\nWhat?\" You ask.</span></div></div>",
            "created":980485200,
            "id":25212,
            "title":"You come to"
        },
        "12121121122211111111111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Back on the ship"
            ],
            "content":"<div class=\"\"><div> <span>\"What is it Hugo? Please tell me,\" You plead.\r<br>\n\"Well..we've all decided that it would be\r<br>\nbetter to let you go. We've got nothing to\r<br>\ndo with you anymore. We're going to send you\r<br>\nback to the states,\" Hugo said softly. \"What\r<br>\nif I don't want to leave?\" You wonder. \"It\r<br>\ndoesn't matter, we're going to take you back.\r<br>\nThat's where you belong,\" You get out of bed.\r<br>\n\"How would you know where I belong? Huh? What\r<br>\nif I said I don't belong in the United States, but with you? What would you say to\r<br>\nthat?\" You exclaim. \"Then...I would say your\r<br>\na fool,\" He said sternly. \"I'm a fool? You\r<br>\nknow Hugo, I thought you were different then\r<br>\nthe others. I thought you had a little decency in your heart,\" You say with tears\r<br>\nbeginning to form in your eyes. \"Then you\r<br>\nwere wrong,\" Hugo said staring into you.\r<br>\n\"You're damn right I was. I was so far from\r<br>\nthe truth, it's not even funny,\" You start\r<br>\nto cry, and then you leave the room. \r<br>\n\r<br>\nYou run to your room, and take all of your\r<br>\nstuff. You shove it into a bag, and run out\r<br>\nonto the deck. There is a small boat attached\r<br>\nto the deck. Tears are streaming down your\r<br>\ncheeks, but you are so angry, sad, and confused that you don't notice.  You get into\r<br>\nthe boat, and pull the strings down, until\r<br>\nyou reach the water. You cut the strings with\r<br>\na knife you had stolen from Hugo. The oars\r<br>\nare at your feet, and you begin to paddle.\r<br>\n\r<br>\nYou don't know where your headed, and you\r<br>\ndon't care, you just don't want to go home,\r<br>\nand you don't want to see Hugo ever again.</span></div></div>",
            "created":980485200,
            "id":25214,
            "title":"Misunderstood"
        },
        "121211211222111111111111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Someone tells him about Catalina",
                "He finds out for himself"
            ],
            "content":"<div class=\"\"><div> <span>Hugo went back to staring out the window\r<br>\nonce Catalina left. \"Why did you do that? I\r<br>\nthought we decided on telling her once she\r<br>\nwas well?\" Gramm demanded. \"Because, I couldn't tell her later. Every time I look into her eyes, it's like she has casted a spell over me. It would get harder and harder\r<br>\nevery time I looked into them, and I would never be able to,\" Hugo replied. \"Why haven't\r<br>\nyou just told her that you love her?\" Gramm\r<br>\nasked. Hugo moved from the window to the bed.\r<br>\nHe sat there with his hands in his lap.\r<br>\n\"Because...because I know she would never love me. It's only lust. That's how it has\r<br>\nalways been with a woman, and that's how it\r<br>\nwill continue to be,\" Hugo said getting up.\r<br>\nHe went to the door, and looked back at Gramm. \"Why can't I just find someone who\r<br>\ntruely loves me?\" Gramm just smiled back. \"I\r<br>\nthink you did Hugo, and I think you just let\r<br>\nher go,\"</span></div></div>",
            "created":980485200,
            "id":25217,
            "title":"His True Feelings"
        },
        "1212112112221111111111112":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "The storms a comin"
            ],
            "content":"<div class=\"\"><div> <span>He wanted to apologize to her. Tell her that\r<br>\nit's for the best, and that she'd thank him\r<br>\nlater. But who was he kidding. He didn't want\r<br>\nto see her leave. He was just afraid to love\r<br>\nher if she didn't love him in return. \r<br>\n\r<br>\nWhen he got to her door, he found it open.\r<br>\n\"Catalina? You..okay?\" He asked. He lit a\r<br>\nlantern, and found the room empty. The dresser drawers were open and empty. Her bag\r<br>\nwas gone. She was gone.\r<br>\n\r<br>\nHe ran up to the top deck crying her name.\r<br>\nThe saftey boat was gone. The ropes had been\r<br>\ncut, and the boat was gone. Off in the distance, he thought..could it be? It was the\r<br>\nboat. And he could just barely see her. Thunder boomed off in the distance to the\r<br>\nsouth. \"God no! If that storm comes right\r<br>\nover the top of us, she'll be gone in a few\r<br>\nseconds,\" Hugo exclaimed. Kelive came over to\r<br>\nhim. \"What's wrong Hugo?\" He asked. \"Kelive,\r<br>\nwe have to get over to her,\" Hugo pleaded.\r<br>\nWho Hugo? Catalina? Isn't she in the doctor's\r<br>\nroom?\" Kelive asked. \"If she was, do you think I would be asking you to turn the ship\r<br>\ninto that direction?\" Hugo exclaimed. \"We\r<br>\ncan't man, if we do, we'll be off coarse, and\r<br>\nwith that ship, we'll never get to the United\r<br>\nStates,\" Kelive said sternly. \"Do we have another safe boat?\" Hugo asked. \"Yes, on the other side. Why? Are you going to go after her? Are you nuts? That storm is coming right\r<br>\nover us. In a few minutes the waves will be\r<br>\nup to the deck,\" Kelive yelled. \"I know, I\r<br>\nguess I am nuts, but I at least half to try,\"\r<br>\nHugo replied. He ran to the other side, and\r<br>\ngot into the safe boat. He started reeling it\r<br>\ndown. \"Please Hugo, reconsider! She's just\r<br>\na girl. There'll be more of them!\" Kelive\r<br>\nexclaimed as Hugo reeled himself down. \"Not\r<br>\nlike her Kelive! Not like her!\" </span></div></div>",
            "created":980485200,
            "id":25219,
            "title":"Going after Catalina"
        },
        "12121121122211111111111121":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Back to Catalina...",
                "The storm gets stronger..."
            ],
            "content":"<div class=\"\"><div> <span>As the storm headed towards Hugo's direction, the waves picked up, and rocked the little boat Hugo was in. He tried to call out to Catalina, hoping that with some hope, she'd hear him. She didn't. \"Catalina! Please hear me!\" He exclaimed, and rowed his boat quicker and quicker, hoping to reach her in time, before the waves got to strong, and knocked her little boat over. He hoped that if something happened, she'd be able to cling to the boat, that was, if it was still intact.\r<br>\n\r<br>\nShe seemed that to his every stroke of his oar, she became smaller, as if to his every stroke, she was two ahead. He cried her name out several times more, but to no avail, she didn't hear him. Fear built up inside of him, and it felt as though it was twisting his intestines. Crunching them up into a small ball. \r<br>\n\r<br>\nEven though his arms began to get tired, he kept going. If something happened to Catalina, he would never be able to live with himself. He'd believe it was his fault that she had died- <i>What are you doing Hugo? Are you letting your guard down? For that stupid chick? You used to be the best and meanest pirates alive, and since you've met her, you've become soft. Weak.</i> Said a voice inside his head. He almost had the instant reaction of turning back around, but his heart told him to keep going. While his mind told him to turn around, his heart told him to go. To go after the one who truely did love him. For who he really was, instead of what she had heard, and believed, she had let him into her heart.  </span></div></div>",
            "created":989989200,
            "id":49612,
            "title":"Second Thoughts?"
        },
        "121211211222111111111111211":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Find what happens next...."
            ],
            "content":"<div class=\"\"><div> <span>Tears were still running-racing down her cheeks. Her arms were tiring, but she couldn't stop, not with this storm worsening. She pushed and pushed, feeling the muscles in her arms tensing, tightening. She almost cried over the pain she was begining to feel in her arms. For a few minutes, she wanted to rest her arms, just so she could get the strength back in her arms.\r<br>\n\r<br>\nHow could he do this to me? She asked herself. It was a question she had been asking herself. How could he just send me off like that? Just treat me like a piece of shit? Huh? Who the hell did he think he was?\r<br>\nShe thought to herself. \r<br>\n\r<br>\nShe didn't even know how much the waves had grown, they were jerking the boat, and some water had even begun to gather in the boat. When some had splashed onto her legs, she finally seemed to come back to reality, and focus on the water, and her rowing. \"Oh my God! God help me! Please! Oh God!\" She exclaimed. All she could think of was to keep rowing. \"Must keep rowing, must keep rowing!\" She muttered to herself. She felt as the boat tipped to the side, but it would come back, then tip to the other side.\r<br>\n\r<br>\nAfter a few minutes, of trying to control the boat enough to keep rowing, one of the oars was jerked from her hand, and it flew out to the ocean. She tried to row with only one oar, but it became an exremely difficult, to the point where it became almost impossible to row. Finally, the waves took the other oar, and it broke into two, after a waved crashed upon it. Waves splashed on her, soaking her. Upon being scared, she was freezing, and she began to shiver. She rubbed her arms, hoping it would help some, but it didn't. She was alone on the ocean. Freezing and petrified.</span></div></div>",
            "created":989989200,
            "id":49615,
            "title":"Freezing Fear"
        },
        "1212112112221111111111112111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Back to Hugo"
            ],
            "content":"<div class=\"\"><div> <span>As the boat rocked violently, almost to the point of where she figured any minute, the boat would tip over, Catalina got sick. Her insides had been twisted, and wound around, and she nor her insides could handle it. Her shivering became more stronger, and her fear had increased to the point where she <i>knew</i> she was going to die. There was no point in changing her mind. She almost wondered if she should have done this at all. I should've just stayed there, and let them take me home. At least I would've known I'd be safe. She thought.\r<br>\n\r<br>\nIt seemed as though that thought was not over for a few seconds, when a large, strong wave toppled her boat, crashing it to bits.\r<br>\nTerrified, screaming on the top of her lungs, and thrashing about, Catalina struggled to stay at the surface, but the waves kept crashing on her, shoving her under, and she almost feared they <i>were</i> trying to drown her. \r<br>\n\r<br>\nAs she screamed, water filled her mouth, and she almost choked. Great! I'm most likely going to die, and here I am choking on water! What a great way to die! She said. She began to shiver tremendously in the water.  She tried to get ahold of a piece of wood, to keep herself afloat, but none of the pieces were strong enough to hold her, once she leaned on them, they would break. Oh God why is this your way of taking me out of this world? I could've at least died in my sleep! She though angerly to herself.</span></div></div>",
            "created":989989200,
            "id":49618,
            "title":"In the water"
        },
        "12121121122211111111111121111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "See what happens...."
            ],
            "content":"<div class=\"\"><div> <span>As the waves crashed over and into him, he continued. The distance between him and Catalina was shrinking. He seemed to be no more than one thousand feet from her, when he didn't see a boat. \"Catalina!\" He exclaimed. \"Catalina! Please! If you can hear me! Say something!\" He yelled over the waves. Once he shut his mouth, he heard a faint screaming over the noise of the waves.  \"Oh God! Thank you! She's alive!\" He exclaimed to himself and to the skies above. He rowed quicker, and found bits of Catalina's boat. Some bits had found their way into his boat, transported by means of the waves. \"Catalina?\" He exclaimed. He had no longer said those words, when her body came into view...</span></div></div>",
            "created":989989200,
            "id":49620,
            "title":"She's Alive"
        },
        "121211211222111111111111211111":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "The Ship is right behind them",
                "Night is setting...."
            ],
            "content":"<div class=\"\"><div> <span>As he closed in on her, fear that had been built up, finally surged through his body, as he saw Catalina's lifeless body floating as waves crashed around them. He got the boat\r<br>\nas close as he could, and reached down and pulled her up. Her body was so cold, it felt as though- No! She wasn't! She couldn't possibly be! He erased the horrible thought from his mind, and felt for any sinds of life. He heard her heart beating, and soft long breaths were escaping from her nostrils. \"You're alive!\" He exclaimed with joy, as he held her tight against his body. He jerked the boat around, and began to head towards the ship.</span></div></div>",
            "created":989989200,
            "id":49625,
            "title":"Victory!"
        },
        "1212112112221111111111112111112":{
            "author_name":"Princessskylar",
            "choices":[
                "She awakens in the morning wrapped around him",
                "She still sleeps in silence as he awakens"
            ],
            "content":"<div class=\"\"><div> <span>  Looking to her she notices the large gash over her left eyes and the fact that she shivers violently even under the one signal blanket he didimanage to recover. He looked back to the ship seeing it was to far to get to at this point and she needed to get warm quickly .He knew of only two way and both  where impossible right here. As night began to enter the skies  he worked the   boat back around and headed for shore.\r<br>\n\r<br>\n  The tiny island looked deserted as she lifted her still lifeless body up into his arms . Cradling her against his chest tenderly and laying her in the soft sand up from the beach . Only leaving her long enough to gather wood to build a firethey both needed. \r<br>\n\r<br>\n  Soon the flames licked back to the drift wood as he cradled her within her arms he to shaking from the chill in the night air seeming to envelope them both.   He reached up  a soft hand to her brow feeling the woman burning  up with fervor already ,he knew he still  needed to get her warm .Even  in his arms she still shivered and moaned yet still did not wake up. He   did one of the last things he  could think  of. Stripping off both his and her clothes she laid them across a make shift line to dry and snuggled under the remaining dry blanket  with her near the flames in hope that their body heat would warm the other.</span></div></div>",
            "created":991285200,
            "id":53203,
            "title":"What Must be done"
        },
        "12121121122211111111111121111121":{
            "author_id":"msbiggs",
            "author_name":"Bernie",
            "choices":[
                "Fixing breakfast",
                "Heading back to the ship"
            ],
            "content":"<div class=\"\"><div> <span>The sunlight had waken her, and she opened her eyes. She noticed two things as she awoke. One, she was wrapped in the arms of Hugo, and second, she was alive.\r<br>\n\r<br>\nThe last thing she had remembered was a piece of her boat clonking her in the back of the head as her boat got ripped apart by a wave. Her head still hurt, and her body felt stiff, but she felt warm and safe, and those two things were the most important. Even if the man holding her, was the man who had said that he didn't love her anymore and didn't want her aboard the ship.\r<br>\n\r<br>\nShe snuggled closer to him and breathed in his scent. She could hear his heart beating its rythmic sound against her ear, and she almost fell back asleep, when she felt him move. He was awake.</span></div></div>",
            "created":1005886800,
            "id":81708,
            "title":"Warm and Safe"
        },
        "121211211222111111111111211111211":{
            "author_name":"Princessskylar",
            "choices":[
                "she sits up her head pounding as she asked him to hand her her own clothes",
                "he  fixes breckfast as he notices the ship gone"
            ],
            "content":"<div class=\"\"><div> <span>He yawned and looked down at her was she awake he thought to himself as her looked down at her?  It was kind of hard to see her she was clinging to his chest like a life raft. Yet really he didn't mind, he rather enjoyed her warm and her touch. He leaned down and kissed the top of her head as she stared to roll over to fix breakfast for the two of then when he hear her voice.\r<br>\n\r<br>\n\"Hugo ... where are we, what happened?\" she blinked a few time as her sight cleared.Then she snuggled even closer to his then she felt it.Her eyes widen  in shock almost afraid to look down ,but she couldn't help herself. Her head shot low to look under the covers seeing both three naked body pressed boldly against one another and he was obviously pleased with the situation, do to the start of his body pressed against hers.\r<br>\n\r<br>\nShe jumped back almost pulling he covers free from him. \"Hugo ... what happened? I mean the last thing I remember was the boat and I... I ... umm how did we get like ...\" she stumbled on her words and turns a scarlet red all over her cheeks. He swore it went to her toes as he laughed almost tempted to look himself.\r<br>\n\r<br>\n\"Cat.. calm down girl .We where both soaked I came after you just in time to save your blooming neck ,and about got my broke in the process . So I  brought you   here and took your clothes off   with mine there over there.\" he pointed to the line they hung on as he shook his   head. \"Bbody heat girl.. that was all that  happened last night. nothing  more.\"\r<br>\n\r<br>\n He pulled the covers back and stood to stretch .she turned her head  not staring to him as he again laughed and when to grab his pants then started breakfast.</span></div></div>",
            "created":1005973200,
            "id":81781,
            "title":"The Naked Truth"
        },
        "1212112112221111111111112111112111":{
            "author_name":"Princessskylar",
            "choices":[
                "She gets up and gets them herself",
                "villigaers attack the two"
            ],
            "content":"<div class=\"\"><div> <span>She turned and looked up to him slowly as she heard the rattling of things in camp. Looking out to the ocean it was a clear blue sky the ocean was amazingly calm after last night episode she did how ever notice the ship no where in sight. And she looked back to him and her clothes on the line.\r<br>\n\r<br>\n\"Hugo may I have my clothes please she asked pulling the blanket up to her neck with a hand out stretched. He looked up as he loped of the top of two coconuts drinking the milk from one.\r<br>\n\r<br>\n\"Do I look like a bloody cabin boy Cat?  You arm aren't broke get up and get them yourself.\" He smirked sitting back and watching her.\r<br>\n\r<br>\nHer eyes when wide as she looked at him the blanket was bulky and it she stood it would surly fall down but he had already seen her he undressed her but     now she was a wake she tilted her head to the side and tired to sweet talk him into getting her clothing for him.\r<br>\n\r<br>\nHe stood his ground and drank from the coconut \"ifin ye wish them clothes girl, you best be getting them your self. I am enjoying the show to stop .\"he laughed as he leaned back watching her. Your breakfast is here when you ready.</span></div></div>",
            "created":1007442000,
            "id":83665,
            "title":"The morning dinner show"
        },
        "12121121122211111111111121111121111":{
            "author_id":"phoenixsden",
            "author_name":"JPhippen",
            "choices":[
                "Insist on returning to the ship",
                "Decide to stay a little longer. It's such a pretty island."
            ],
            "content":"<div class=\"\"><div> <span>Catalina sat there for a little longer, glaring at Hugo. He simply smiled playfully back at her. She accepted the challenge. <br>\r\n   With a deep breath, she let the blanket fall and got to her feet. Fearing to look at Hugo's face, she held her head high and and walked over to the clothes line. She grabbed her undergarments and quickly pulled then on, her back to Hugo. When she turned around, fully clothed, Hugo was holding out some food for her. She took it and sat down on the opposite side of the fire. <br>\r\n   \"Now is that any way to treat the man you spent the night with?\" he said, grinning from ear to ear.<br>\r\n   \"You said...!\" Catalina cried, jumping to her feet.<br>\r\n   \"I was only playing with you!\" Hugo laughed. \"Please, sit down. Nothing happened, I promise,\" he put his hand on his heart. Catalina was strangely aware of the fact that he was half-naked. She pulled her eyes away from him and back down to her food. <br>\r\n   \"What about the ship?\" Catalina asked after a long silence.<br>\r\n   \"It's waiting offshore,\" he pointed, and surely enough, there it was, its anchor thrown into the now calm sea. \"When we are ready to go, we may rejoin the crew. It's all up to you, my lady.\"</span></div></div>",
            "created":1171947600,
            "id":383506,
            "title":"Breakfast"
        },
        "121211211222111111111111211111211112":{
            "author_id":"phoenixsden",
            "author_name":"JPhippen",
            "choices":[
                "Ask him.",
                "Don't ask him."
            ],
            "content":"<div class=\"\"><div> <span>   Catalina gazed at the ship, then back at Hugo. \"I haven't even finished my breakfast yet.\"<br>\r\n   \"Of course, my lady,\" Hugo smiled knowingly.<br>\r\n   As Catalina ate her food, her memory slowly came back. Her last conversation with Hugo. He had intended to send her back to America. He had decided to leave her. Anything that she thought he might have felt...<br>\r\n   She glanced up at him. He was focussed on eating his food, but his brow was creased, as if he were thinking the same thoughts as she. She had gotten into that boat with the intention of never seeing him again, of forgetting about him. But could she? There he was, so incredibly carefree, so full of life. He seemed to know more of life then anyone she knew. Part of her wanted to know what he knew, to become a part of this life. But she also had duty, to her father, she had responsibilities. <br>\r\n   \"When we do get back aboard the ship, will you send me back to America?\" she asked.<br>\r\n   Hugo looked up at her, his eyes clouded. \"If that's what you want, then yes, we will.\"<br>\r\n   \"What do you mean, if that's what I want?\"<br>\r\n   He shrugged. \"If you want to return to your old life, then I won't be the one to stop you.\"<br>\r\n   \"Of course I do, why would I want to stay?\" Catalina replied hastily. <br>\r\n   Hugo looked hurt, but just nodded. Catalina wondered if she should ask him if there was a reason she should stay. </span></div></div>",
            "created":1171947600,
            "id":383508,
            "title":"Should I stay or should I go?"
        },
        "121211211222111112":{
            "author_name":"Celestialsplendor",
            "choices":[
                "Do you trust him",
                "or scream"
            ],
            "content":"<div class=\"\"><div> <span>You fallen asleep.  As much as you tried the days events had completly drained you and you fell asleep.  You awake to a barely audible squeak of a floor board.  Your body is tense as the realisation that you are not alone.  You open your eyes just enough to see through your lashes.  A large body looms above you.  \r<br>\nYou jump up and try to run to the open door behind him.  An arm Is rapped around you and your mouth is covered.\r<br>\n\"Don't...  move.\"  That VOICE!!!  It's Hugo.  You slump on to his strong frame.  You turn in to his arms and just hold onto him.  He whispers some words but you don't understand them...  all you can think is your safe now.  wait a minute!  He is a pirate too!  Down the hall you can hear someone coming... </span></div></div>",
            "created":977029200,
            "id":17915,
            "title":"Savior or not"
        },
        "1212112112221111121":{
            "author_name":"viola06",
            "choices":[
                "The door opens..."
            ],
            "content":"<div class=\"\"><div> <span>You don't care if he's a pirate too. He's so warm and protective with his arm around you and you wish you could lose yourself in his arms. You snuggle up to Hugo and listen fearfully as footsteps pace outside your door.\r<br>\n\r<br>\n\"Where could that bitch have gone?!?\" A voice. Evil and, almost worried, but no quite. It takes a minute but soon you know, Remile. Hate boils up in your chest and you squeeze Hugo's hand, tight. The footsteps come closer. Hugo pulls you under some crates but you know you arn't safe. \r<br>\n\r<br>\nShivers race through your body and you're paralized with deep, horrible fear. The door creaks and sliver of light peirces the darkness of the room. Hugo pulls you closer and you both try to become invisible.   </span></div></div>",
            "created":980398800,
            "id":25099,
            "title":"Traped"
        },
        "12121121122211111211":{
            "author_name":"viola06",
            "choices":[
                "Let him catch you",
                "Try to excape"
            ],
            "content":"<div class=\"\"><div> <span>As the room becomes illuminated you notice a notch in the floor under Hugo. You nudge him gently and he looks back, relization clouding the fear in his eyes. He puts his finger to his lips and starts to push the trapdoor down. It lets out an audible, \"crrieeek\" You gasp with suprise. You hear Remile's breathing, it's heavy and you know he's found you.      </span></div></div>",
            "created":980398800,
            "id":25100,
            "title":"The trapdoor."
        },
        "121211211222111112112":{
            "author_name":"viola06",
            "choices":[
                "Pass out"
            ],
            "content":"<div class=\"\"><div> <span>You freeze with fear, but Hugo is strong, brave. As Remile comes closer, step by step you can not move. Hugo jumps, his whole weight lands on the door and with one great noise, it goes. You feel the whoosh of wind and the smell of soild air. With Hugo's arms around you, strong and good, you fall.</span></div></div>",
            "created":980398800,
            "id":25101,
            "title":"Excape"
        },
        "12121121122212":{
            "choices":[
                "It is Hugo and he loves you too.",
                "It's..."
            ],
            "content":"<div class=\"\"><div> <span>He glares at you hard. \"Suit yourself.\" he says and walks away. He goes over and asks a dark-haired lady with hazel eyes to dance with him. \"She is much prettier than I am.\" you think with a pang of regret. \r<br>\nSuddenly you tune into the pirates conversation. \"Yup, and that Dee sure is a purty lady. Though she don't ever let me touch her. She's had the hots for Hugo ever since we got her.\" you hear one say. \r<br>\n\"Yeah, and from the look of it he's just as hot for her too.\" says another brown-haired one as he downs some brandy. (His name is James.) He wipes his mouth with his hand. \"But I'll say, that new captive don't look half so bad either.\" James says and the pirates all leer at you. \r<br>\nYou run to your room and fall on your bed crying. You fail to understand why you are crying. Hugo is a pirate and he killed your friends. You ought to despise him but you don't. \"I love him.\" you say aloud in suprise and then you are even more suprised to hear a knock at the door.</span></div></div>",
            "created":991717200,
            "id":77241,
            "title":"Suit yourself"
        },
        "121211211222122":{
            "author_name":"Genophore",
            "choices":[
                "say yes",
                "say no"
            ],
            "content":"<div class=\"\"><div> <span>.....only one of the captive women, who saw you run into your room, apparently very upset. The woman is slightly shorter and a little rounder than you are, but she has a sweet face and dark hair wrapped in a french twist, though not quite as dark as yours. The woman steps forward.\r<br>\n\"My name is Katrina,\" she says politely.\r<br>\n\"I'm.....Catalina,\" you reply.\r<br>\n\"Well, Catalina, what is it that troubles you?\" Katrina asks.\r<br>\nWeeping softly, you tell her of your hopeless love for Hugo. Katrina looks carefully into your face.\r<br>\n\"Are you saying that you are in love with that....that....mongrel?\" Katrina asks you, anger filling her voice.\r<br>\n\"Yes,\" you reply, \"he killed everyone that I hold dear to my heart, yet I still love him......I cannot explain it!\"\r<br>\nKatrina sighs and sits beside you on the bed. \"Catalina, you would not say this if you truly knew Hugo. He is an evil, evil man. I was abducted by Hugo and his band of pirates four years ago; they made me watch as they slit the throats of my father and brothers, raped and killed my mother, and carried off my two sisters. They then raped me and forced me to travel on their ship, making me their servant girl and sex slave. I do not know what became of my sisters, but I know for certain that they are either captives such as myself or dead; either way, I eternally weep for them, and I curse Hugo and his band of pirates to hell!\"\r<br>\nYou look at Katrina with astonishment. You suddenly realize that all along you had loved a heartless, cold-blooded murderer! Anger suddenly fills your heart.\r<br>\nKatrina notices this, and she says \"Now that I have you on my side, I have a plan. Tonight after Hugo has gotten drunk and slept with his woman for the night, I will sneak into his quarters and stab the mongrel to death. Your job will be to keep watch to make sure no one enters the chamber while I am inside. Will you do this for me?\"</span></div></div>",
            "created":997765200,
            "id":69327,
            "title":"The Plot"
        },
        "1212112112222":{
            "author_name":"martini268",
            "choices":[
                "\"No, just leave  me alone!\" and run off to your room",
                "\"I think so. I guess I owe you that dance now......\""
            ],
            "content":"<div class=\"\"><div> <span>\" No thank you. I'm not really in the daning mood.\"You shy away from him but he notices the dirty look you flash him. He lets out a laugh. \r<br>\n\"Did they teach you those manners in refining school?\" You just look at him blankly. What are you suppossed to do. You dont know when your going to get off this god forsaken ship, you dont know if you ever will. You swallow the lump that forms in your throught.\r<br>\n\"Well the name's Hugo if ya need anything.....anything at all\" He grins at you before turning away leaving you standing alone.\r<br>\nJust than a big fat bearded man wraps an arm around you. \"well hey there little missy. How about you and me go ....for a little ....hmmmm..walk\" He said in a slurred voice. He leaned all his body weight on you as he could not hold himself up. He smells of alchohal and body order.\r<br>\nYou try to slip away from him. \"No thank you sir.\" You try to be polite but fear creeps up inside you. \r<br>\n\"Awww come on. Come give ol Petey some company.\" He pressed her up against the wall.\"\r<br>\n\"No. Leave me alone.\" you try to push him away but he's too big. Just than Hugo pulled Pete off of you.\r<br>\n\"NOw come on Pete, leave the lady alone.\"\r<br>\n\"Hugo, this aint your business.\" Pete shot back. Hugo gave him a warning look. \r<br>\n\"I think I told you to leave the lady alone. Now get away you fat pig before I throw you overboard.\"  Pete opened his mouth to say something but instead turned and walked away with a grumble. Hugo turned to you with a half smile.\r<br>\n\"You alright?\" He asked. You say....  </span></div></div>",
            "created":1014872400,
            "id":94200,
            "title":"Pete"
        },
        "121211212":{
            "choices":[
                "Hugo takes her side",
                "Hugo ignores her request"
            ],
            "content":"<div class=\"\"><div> <span>Catalina sat still on the bed for awhile, taking in all that had happened to her in such a short period of time. Her life was now in danger and she knew that, if she were to survive, it would be completely up to her and how cunning she could be. But she was only a twenty year old girl, a teacher. How would she be able to come up with something clever enough to outwit a gang of pirates?<br>\r\n<br>\r\nAs she looked around the room she noticed that the door was slightly ajar and led out into the now empty hallway. She wondered if, in a ship full of blood thirsty pirates, she would be able to find someone who could sympathize with her situation. There had to be someone on this humongous ship who had a heart.<br>\r\n<br>\r\nSlowly, carefully, she made her way towards the door and pushed it open even farther. It made a loud creaking noise and she froze in fear for a moment. When no one came running, she slipped out into the hallway and started to make her way up the stairs. <i>I'm almost there,</i> she thought. <i>Just up these stairs and maybe I'll be able to find some help.</i><br>\r\n<br>\r\nCatalina stopped when she reached the top of the stairs. The door in front of her led to the deck, where all the pirates were probably lounging. If she were to open the door and start pleading her case, one of them might feel sorry for her. Or, they might all hate her and decide to kill her right then. She had to make a decision now, or else wait and let her fate rest in the hands of these grungy pirates.<br>\r\n<br>\r\nShe swung open the door and gasped when she saw the pirate called Hugo standing there with his arms folded across his chest staring straight at her. His gaze sent shivers up her spine, but she refused to look weak. Holding her head high, she addressed him in as calm and strong a voice as she could muster. \"I would like to go with you.\"<br>\r\n<br>\r\n\"Excuse me?\"<br>\r\n<br>\r\n\"You heard me, I'd like to go with you wherever it is you are going.\"<br>\r\n<br>\r\nA smirk spread across Hugo's face and Catalina realized just how handsome he actually was. Dark hair and dark eyes framed his tan skin and she also couldn't help but notice how muscular he was and how wonderfully his barely-there shirt looked on him. She swallowed hard and made herself look the handsome pirate in the eye.</span></div></div>",
            "created":1027659600,
            "id":113806,
            "title":"The Dawning"
        },
        "12121122":{
            "choices":[
                "Takes her and joins the rest of his mates.",
                "Takes her onto a lifeboat of their own."
            ],
            "content":"<div class=\"\"><div> <span>\"You tell me to choose between death or a life with your kind?\" Her eyes full of hatred, shooting daggers at him. Mustering up the last of her strength she spat in his face, the warm fluid running down his cheek, getting lost in the stubble on his face.  \"I'll drown first.\"   \r<br>\n\r<br>\nThe silence that filled the cabin was louder than even the most grand of street fairs. Then tension so thick it could have been cut with a butter knife. He had never met anyone that affected him in this way. She angered him, insulted him, but damnit if she wasn't the sexiest of creatures he had ever laid his eyes upon. However, the ship was sinking, and the puddle of water around his ankles hinted that it was sinking very rapidly.  Mustering all the nerve he had he whispered harshly \"You'll thank me for this later.\" just before his hand shot out striking her jaw.  Falling in his arms as limp as a ragdoll he picked her up making his way out of the captains quarters.\r<br>\n</span></div></div>",
            "created":968475600,
            "id":3645,
            "title":"Down With The Ship"
        },
        "121211222":{
            "choices":[
                "Makes it to land with his captive",
                "Gets attacked by former pirate family"
            ],
            "content":"<div class=\"\"><div> <span>Picking her up her tossed her haphazardly over his shoulder, noticing how very light she was, the way his hands could span her tiny waist...\"STOP IT!\" he harshly whispered to himself as he shook his head. This was not the time nor the place for thoughts he was having. \r<br>\n\r<br>\nCarefully opening the door he peeked out. There was little time and he had to be quick. Hurrying down the hall he came out ont he deck of the ship, tossed her in the life boat and began to slowly lower it. Just as the bottom of the boat touched the sea he jumped over the railing and easily pulled himself inside with her.  If they were caught there was no question what would happen to them. He would be killed on the spot and she...she would be used until they needed her no longer and then killed. For some reason the thought of his fellow pirates, his \"family\", having anything to do with this beauty angered him. Picking up the oars he took his frustrations out on the seas, rowing for all he was worth.  What was he doing? Had he lost his mind? </span></div></div>",
            "created":968821200,
            "id":3659,
            "title":"Carried to Sea"
        },
        "1212112222":{
            "author_name":"Mad cow",
            "choices":[
                "do you get a rush of adrenaline and kill them all with your friend's pistol?",
                "jump in the water and leave your friend for the pirates to torture?"
            ],
            "content":"<div class=\"\"><div> <span>The ship almost becomes a mere speck ont he orizon when suddenly you see a boat rowing towards you five times as fast as you are going! In no time they are 10 feet from your boat (although you don't know since you are still unconcuious) The pirates draw their weapons, as your pirate friend does. they begin to shoot at him and you, yet, he shields you with his body. the sea mist awakens you and you open your eyes just in time to see a bullet rip through his cheast and splatter blood all over the place. You start to scream, and begin to see things in slow motion. a pirate aims his revolver at you, and starts to  pull the trigger...</span></div></div>",
            "created":969339600,
            "id":3663,
            "title":"Attacked!"
        },
        "12121122221":{
            "author_name":"Mad cow",
            "choices":[
                "Do you drop him, and kill him with you improvised knife?",
                "Do you feel sorry for him, and tell him not to apologize?"
            ],
            "content":"<div class=\"\"><div> <span>You grab the pistol and start firing, standing up in the rocking boat, you dress is in tatters and ships in the wind, miraculously you kill all but three, who row off screaming about the devil witch. You see an island a long way off and row for it. when you arrive you quickly build a shelter and drag your friend in. As you are collecting food, you weave flowers into your hair and collect bullrushes for baskets.\r<br>\nYou get back to your hut to find your friend sitting up, wincing, and breathing harshly.\r<br>\nyou drop the food and rush over to him. you cradle his head in your arms as he apologizes for everything he has done to you. </span></div></div>",
            "created":969339600,
            "id":3664,
            "title":"Seriously pissed off."
        },
        "121211222212":{
            "author_name":"Mad cow",
            "choices":[
                "Do you stop and run away?",
                "Keep on, but move into the jut, night has fallen."
            ],
            "content":"<div class=\"\"><div> <span> \"No, no!\" you begin to cry, \"If you didn't I never would have found you!\" He strokes your face gently and you are suprised at his hands. You look deep into his beautiful eyes and kiss his mouth. He pulls you closer and kisses you hard. you yield to his firey passion , and he rubs your neck. You stop kissing and lift your head. he begins softly kissing your neck, his hands tracing down your shoulders to your breasts, which he gently holds. you hum and let it roll down your throat, enhancing his kiss. You twist so you are lying on top of him.</span></div></div>",
            "created":969339600,
            "id":3665,
            "title":"Sorry?"
        },
        "12122":{
            "author_name":"BullersAngel",
            "choices":[
                "Thomas comes to your rescue",
                "Thomas freezes  and turns to run"
            ],
            "content":"<div class=\"\"><div> <span>You stare back defiantly, fear swollowed for the time being.  You can see by his face, he is waiting for you to up and run, a sneer appears,,,as you casually stand, smoothing down your gown and hair,,and then look him in the eye.  His sneer turns to a puzzled smile when he realizes your not going to run.  \"Just what do you intend to do with me?\" you ask, your voice suprisingly steady.  \"Well darlin, i'll let you know when i decide, but for now.....\" he stood to one side so i could pass him, out of my cabin.  He walked very closely behind me, i could feel his hand brush my back.  Then Thomas appeared.  \"Help me!\" I screamed.</span></div></div>",
            "created":975992400,
            "id":15713,
            "title":"Bravado"
        },
        "122":{
            "author_name":"TigerLily",
            "choices":[
                "Catalina stays until the pirate ship arrives",
                "Catalina injures herself on the rigging and has to return to her quarters"
            ],
            "content":"<div class=\"\"><div> <span>The pirate ship was approaching fast. Catalina was afraid, but also felt a wild kind of excitement. What would happen next? <br>\r\n  The captain bellowed, \"All hands on deck!\" He noticed Catalina and said, \"This is not a time for ladies to be taking a stroll on deck. You need to be in your quarters. I don't need a fainting woman on my hands.\"<br>\r\n  Catalina indignantly placed her hands on her hips, her eyes blazing as she snapped a reply, \"I am NOT a fainting woman. I'll thank you not to judge a person's character just by glancing at them.\"<br>\r\n  The captain viewed Catalina with less contempt, but not quite the respect she was demanding. \"Spitfire, aren't ya. Well, it'll do you no good with those pirates. They favor the spirited ones - more fun in a challenge.\"<br>\r\n  Catalina pretended to be shocked as the captain moved down the deck towards his crewman. But secretly, she felt a little thrill at the thought of fighting off a deadly pirate and winning. <br>\r\n  The captain turned back around. \"If you stay, you'll have to help with the rigging - I can't have a useless body flapping about the deck.<br>\r\n  Catalina's temper flared. \"Show me what I need to do.\" Her anger giving her strength, she stormed over to a grab a rope from a surprised sailor and worked with the men to get another sail up. <br>\r\n  The captain chuckled. \"That's a woman like I've never seen.\" <br>\r\n</span></div></div>",
            "created":1027659600,
            "id":113851,
            "title":"The Pirate Ship Approaches"
        },
        "1222":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "Whilst being carried, the ship is attacked by a cannon",
                "The carpenter tries to retrieve the splinter."
            ],
            "content":"<div class=\"\"><div> <span>The ship approached, cutting through the waves with the ease and grace of a swan on water. Down below the crew were springing into action, each with their specific duty and zigzagging around the other comrades as they hurriedly readied the ship for battle.<br>\r\n<br>\r\nGlancing over to the advancing frigate the deck was empty. There was not the hustle and bustle of their own ship but an eerie stillness.<br>\r\n<br>\r\nEntranced by the crew-less ship Catalina overlooked the urgent shouts of the men above her and with a fleeting look upwards, recognised the yardarm falling towards her. She swang out of the way but too late, the wooden beam came crashing to the deck, with a startled Catalina entangled in the splintered timber and frayed ropes.<br>\r\n<br>\r\n'Catalina?' Thomas was at her side almost immediately, concern filled his eyes.<br>\r\n<br>\r\nShe could just about make out his brown mop of hair framing his face but he grew dimmer and the reply wasn't able to leave her lips.<br>\r\n<br>\r\n'Catalina,' he repeated, 'Keep calm, you've sustained a wound to your leg.'<br>\r\n<br>\r\nA wound? Looking down she could see the shard of the yardarm sticking out of her leg and her head began to swim.<br>\r\n<br>\r\n'Catalina! Stay with me now.' Thomas urged, 'You there! Jim, Garrett! Take this girl to the carpenter's cabin. She'll need this out before infection. Quick!'</span></div></div>",
            "created":1206939600,
            "id":514775,
            "title":"Man Down"
        },
        "12221":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "to give over all goods aboard the ship",
                "to swear allegiance to their Pirate Captain and become part of their crew."
            ],
            "content":"<div class=\"\"><div> <span>Whilst being carried to the carpenter’s quarters, the judder of cannon fire threw Catalina from the arms of her carriers, once again knocking her out cold.<br>\r\n<br>\r\nUpon opening her eyes, she immediately became aware of the agonizing pain shooting down her leg. Glancing around for help, she could see the lifeless body of Jim to her left, lying in a pool of blood and shattered ship. Neither Garrett nor Thomas, or any other living soul, were to be seen beyond the many more bodies that were strewn across that deck. That was when the smell of battle reached Catalina. The foul, sticky mix of blood, gunpowder and tar burned her nostrils and the salt, sea air bit at her leg wound. She soon realised that she was alone on the Quarter Deck, alone with only the pain and ghostly silence to comfort her.<br>\r\n<br>\r\nUsing all the upper body strength she could muster, she hauled herself towards the steps that led to the main deck. Once near the top she realised that she was wrong in her assumption of being alone on the ship for, standing there on the deck was at least two boarding party’s worth of pirates surrounding the surviving remainder of her crew. Scanning the faces she recognised Thomas’ and a few other survivors and let loose a sigh of relief. This feeling of relief was to be short-lived as the broadswords, held firmly in the hands of the marauding buccaneers, were being forcefully thrust towards the crewmembers. Straining to hear what was being said, she heard an order for the Captain of the ship to be brought forward. Glowing with pride, Catalina watched as the crew remained silent, unwilling to fulfil this heathen’s request. Movement below her redirected her attention and she watched with sorrow as her Captain was brought in front of the pirates. Once again Catalina’s heart swelled with pride by the Captain’s dignified approach, not once did he appear to have any fear in his heart. Calmly, he addressed the pirates, “I command, as Captain of this ship, that you release my crew immediately and disembark from this vessel to the one from which you came, leaving at once.” At which the pirates exchanged amused glances and sniggered. A cold, evil laugh that sent chills right through Catalina’s body. It was a sound that would haunt her until the end of her days. Sniggering over, the pirates jabbed their swords towards the crew again and issued their commands. Unable to hear well enough, Catalina edged forward, unaware that she was becoming increasingly visible in the sight of the pirate gang.<br>\r\n<br>\r\nThe commands declared by the pirates were</span></div></div>",
            "created":1249362000,
            "id":738625,
            "title":"The Boarding Party"
        },
        "122212":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "Catalina stays on the burning ship",
                "Catalina boards the pirate ship"
            ],
            "content":"<div class=\"\"><div> <span>Holding tightly to the railings at the top of the steps, Catalina could just make out the words being spat from the pirate crew. She was surprised to learn that they had no interest in robbing their cargo, which was actually nothing more than food and supplies for the British army that had recently been evacuated from the American Colonies. She had only ever known of pirates thieving from merchant ships and couldn’t fathom what other possible reasons they would have for their boarding. With her head through the banister she could just make out the voices of the trespassing pirates.<br>\r\n“You have two options. One, you join our crew and become a pirate, or we send you down to the locker. What’ll be?”<br>\r\nCatalina was puzzled by this demand. Judging by the number of pirates currently aboard her ship, she wouldn’t have expected them to be short of hands, especially as there were bound to be more still lurking on the vessel alongside them. Casting a glance over the rail confirmed that there were indeed a handful of men still aboard the offensive ship.<br>\r\n<br>\r\nA sudden scuffle below on the main deck reminded Catalina of the present situation. Much to her dismay, some of her crew had refused to become part of such a crew and had been thrown overboard. Those left on deck became much more nervous and she could see that a few of them had been press-ganged already. Once the crew had realised that the threats were real, more agreed to the pirate’s demands and were escorted onto the corrupt ship. The last pirates who left lit torches and threw them towards the remaining crew members, of which there were not many but did include both the Captain and Thomas in their group.</span></div></div>",
            "created":1274590800,
            "id":887844,
            "title":"Re-recruitment"
        },
        "1222121":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "Catalina gets a place on the lifeboat",
                "She gets left on the ship"
            ],
            "content":"<div class=\"\"><div> <span>Once the pirates had left and their ship began retreating, Catalina was once again reminded of the agonising pain in her leg. Her gaze turned distractedly to the main deck where the last members of the crew were busily falling back under the command of the Captain and attempting to salvage what they could of the burning ship. From her position above the deck, Catalina could see the fire was spreading ferociously without a hope of the crew stopping it or even merely containing it to the deck, it was quickly devouring everything on board, reaching into the cabins and climbing the masts. It was a devastating sight.<br>\r\n<br>\r\nCaptivated by the sight of the fire and the crew frantically trying to control it, Catalina felt helpless, unable to move, let alone assist them. It was then that the main mast was conquered. She could hear the wood splitting as the flames devoured it. Calling out to the crew, drawing their attention to it, Catalina warned the men below just in time before it came crashing to the deck, taking with it a large chunk of the starboard side.<br>\r\n<br>\r\nHer shouts also alerted Thomas to her position and he joined her within seconds.<br>\r\n“Catalina? Come, on. Let’s get you off this ship. There’s no saving her now.” The sorrow in his voice was not hard to miss. Thomas had been on the Curious Jane since he’d been a boy of 12, working his way up through the ranks on the modest merchantman, earning the respect of his crewmates and the approval of the Captain. Catalina knew this from their many conversations of their after-dinner stroll across the decks. It had been six days since they had left the English harbour of Portsmouth and in this time, Thomas had opened up to her, as she had done to him. She knew he aspired to follow in the footsteps of his father and own his own trading company but she also knew that he loved this, now weakening, ship as his home, as it had been for the past 11 years, and that this was to be the present Captain’s final voyage before commencing his retirement. Thomas was to get the ship and subsequently be able to follow his dream. A dream that was now going up in smoke.<br>\r\n<br>\r\nIt was a sombre moment as he carried Catalina down the steps to the main deck. To her dismay, she realised there was only the one remaining lifeboat that was still sea-worthy, the rest lost to the flames. The crew gathered round and it was clear they would not all be able to cram into the small craft.</span></div></div>",
            "created":1297227600,
            "id":1050704,
            "title":"The Lat Boat"
        },
        "12221211":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "Thomas stays on the ship",
                "Thomas accepts a place on the lifeboat"
            ],
            "content":"<div class=\"\"><div> <span>Thomas lowers Catalina into the lifeboat and turns to the other crew members who now realise that some of them will have to be left aboard the burning ship.<br>\r\nShock soon turned into panic as they all tried to beat each other to the remaining seats on the lifeboat. Thomas attempted to take control.<br>\r\n<br>\r\n“Gentlemen, now is not the time to panic. Let’s decide this in a fair manner.” Reluctantly the crew obeyed the order, for although Thomas was not the most senior of officers present, he had the respect of the crew and of the Captain, which made him important enough in the eyes of the regular crew members.<br>\r\n<br>\r\nMuch to the dismay of the survivors, the lifeboat left undamaged was one of the smaller that the <i>Curious Jane</i> carried, one of a pair that carried only eight men, compared to the larger pair which held double that each. Thomas looked around the deck, making a quick headcount – from the crew of forty six that they had left Portsmouth with, thirteen men now stood before him.<br>\r\n<br>\r\n“Captain Rogers, sir. Would you care to climb into the lifeboat, while I take charge here, I...”<br>\r\n“No, Thomas. I won’t be getting into the lifeboat.”<br>\r\n“But you’re the Captain, sir. You get priority over...”<br>\r\n“No. I receive no priority here. It is my duty as Captain to ensure the safety of my crew and I have failed that duty. Over half my crew lie dead across my boards, I shall not run to safety and allow another of my men to die while I live in his place. I will go down with this ship and with my men. Thank you, Thomas but my place remains here, you will take over the command of these men.”<br>\r\n“Very well, Captain. I understand. I too will remain on board, alongside you, sir, as I have always done.”<br>\r\n“No, Thomas, these men need someone to lead them once you have reached land, I trust it to you to honour this position, as will they. You have served me well, these long years, now, it’s your turn to take command.”<br>\r\n“Captain, I...”<br>\r\n</span></div></div>",
            "created":1310482920,
            "id":1146113,
            "title":"Captain's Orders"
        },
        "122212111":{
            "choices":[
                "Fainted clean away",
                "Regained her senses"
            ],
            "content":"<div class=\"\"><div> <span>Thomas stepped next to the Captain, a look of dignity and pride on his face. He also looked frightened. Catalina reached out her hand. \"Thomas,\" she called. \"You have to try to get off!\" Thomas looked into her eyes. She took a deep breath when he said, \"No, Catalina. My place is here.\" He turned to a sailor, pointing a Catalina. \"Make her life more valuable than yours.\" He pushed the sailor into the lifeboat. Catalina let out a sob as the crew pushed away from the sinking ship. Thomas stood tall and strait by the Captain. As the boat got farther away, smoke wrapped around the ship, blocking all from view. Catalina felt herself becoming faint. She grabbed the wrist of the sailor who'd been ordered to take care of her. She gasped for breath and......</span></div></div>",
            "created":1349728260,
            "id":1442805,
            "title":"Thomas stays on the ship"
        },
        "123":{
            "author_id":"athena",
            "author_name":"Madeleine goes to Brown",
            "choices":[
                "Wait for help"
            ],
            "content":"<div class=\"\"><div> <span>You run to Thomas. He was right and he should know it. You make it to the Captain's cabin and knock on the door. Thomas opened it. <br>\r\n<br>\r\n\"It is a pirate ship.\" You announce proudly. Unconciously you have placed your hands behind your back in the old school way. \"It's got that flag, the... oh, what's it called?\"<br>\r\n<br>\r\n\"I told you she was, sir.\" Thomas isn't even looking at you. \"She's a black hull too, meanin' she's likely the Avenger, and that means Gerry's the Cap'n.\"<br>\r\n<br>\r\n\"I know the Avenger.\" The Captain says coldly. \"Miss Sherwood are you sure you saw the Skull and Crossbones?\"<br>\r\n<br>\r\n\"That's it. Yes, quite sure.\" Then you hear the first blast. \"What's that?\"<br>\r\n<br>\r\n\"Everyone down!\" A cry comes.<br>\r\n<br>\r\nSuddenly you are thrown off of your feet and into the passageway. You stand up and pull down your skirt indignantly. \"Thomas!\" You run through the passage again and shriek, grabbing behind you for the floor. You've fallen through a cannon hole and all that is below you is rushing sea water. \"Help! Help!\" You cry.</span></div></div>",
            "created":1051851600,
            "id":155863,
            "title":"Cannons"
        },
        "1231":{
            "author_id":"athena",
            "author_name":"Madeleine goes to Brown",
            "choices":[
                "Grab the Captain's Corpse...",
                "Fall into the foaming water..."
            ],
            "content":"<div class=\"\"><div> <span>Help is not forthcoming. And, as you hang there, you realize that you will have to do something or you'll fall. You swing your legs delicately, determined not to look down at the rushing water. And a shoe catches... and slips. But there's hope. There must be a kind of shelf or ripped wood, some kind of ledge. You swing your legs again, now with purpose and when that doesn't work you realize that you have to look down. You gulp, take a deep breath and let your eyes fall.<br>\r\n<br>\r\nYou scream. There, beneath you, where your legs caught is the captain's body. His eyes stare lifelessly up your skirt and your scream makes you teeter and fall. You are falling towards the rushing and foaming water and when your hand catches something that is fast growing cold, waxy, and stiff you have to make a choice, in an instant...</span></div></div>",
            "created":1058245200,
            "id":165986,
            "title":"Disgusting and Distressing Decisions"
        },
        "124":{
            "author_name":"katie",
            "choices":[
                "you give up- and wait for them to reach you, it's inevitable",
                "you decide to go down now rather than chance it with the pirates"
            ],
            "content":"<div class=\"\"><div> <span>A pirate ship you realize it definately is.  And with not allowing Thomas to go for the captain immediately, you realize that you wasted precious time.  The pirate ship will definately be capable of capturing your father's small, poorly armed, vessel.   Your panic is increasing.  \r<br>\n\r<br>\nYou decide that you want to do something while you still can control fate.  You quickly move to the far side of the ship and hoist yourself onto the rail.  \r<br>\n\r<br>\nYou look around quickly to observe no one is watching.  You are certain they will assume that you have taken to hiding in your stateroom and will not bother with you during the emergency.    You see the ship nearing.  You are able to make out the port holes and metallic gleams from within- guns.\r<br>\n\r<br>\nYou hesitate no more as you push yourself over the side into the Atlantic. \r<br>\n\r<br>\nMy god! You repeat some of the crew's language that you never should have heard.  You had forgotten how icy cold the Atlantic could be.  No matter, you've chosen now and there is no turning back.  \r<br>\n\r<br>\nYou know you need to get as far from the ship as possible.  The last things you want are to be spotted or to be able to hear the cries of the crew as they are tortured and then killed.  Your own suffering will be enough to bear.  You strike out away from the ship slowly with your skirts hampering you.\r<br>\n\r<br>\nAfter a few minutes of swimming as you quickly become tired, you realize you aren't alone in the water.  There is a small craft approaching you.  \r<br>\n\r<br>\nYou realize they have spotted you and you are their intended target.</span></div></div>",
            "created":968475600,
            "id":3647,
            "title":"swimming for life. or death"
        },
        "1241":{
            "author_name":"katie",
            "choices":[
                "do you approach him to ask?",
                "do you keep to the back hoping he'll forget?"
            ],
            "content":"<div class=\"\"><div> <span>The craft is approaching and it is filled with unkept men.  In the front directing operations is swarthy dark pirate. \r<br>\n\r<br>\nThe site of him fills you with fear and you turn and attempt to swim farther away.  Never! You wouldn't want to chance it with the likes of them.\r<br>\n\r<br>\nWith sudden speed you feel the iron grip of a hand along your collar, wrenching you out of the water.  You struggle, kicking and flailing with all your might. Screaming is pointless, there is no one to hear you, and it would only waste energy.\r<br>\n\r<br>\nHe drags you onto the boat.  You lie in the water collected in the bottom, exhausted,  looking up at your captor.  You feel annoyed with yourself because you know how weak you seem, drenched, shivering which he'll certainly mistake for shaking, with fear filled eyes.\r<br>\n\r<br>\nHe's staring rudely at youbemused.  There's a the beginning of what could possibly be a small smile playing on his face. You feel even more ridiculous than before.  To him you're only a game.  \r<br>\n\r<br>\nHe leans down running his large, calloused hand from your brow down to your chin  and tilting your chin up staring into your face.\r<br>\n\r<br>\nYou have the sudden realization he might be about to kiss you.  You stare back at him, waiting, your pulse racing.\r<br>\n\r<br>\nHe presses his thumb to your lips parting them slightly.  You hold your body rigid to prevent your body from betraying your thoughts, fears, and emotions.\r<br>\n\r<br>\nSuddenly he drops your head, which thumps into the rough board on the bottom, back into the puddle of water.  You realize what an awckward position that was for your neck.  You want to gingerly rub it, but you don't want to move.\r<br>\n\r<br>\n\"Back to the ship,\" he issues an order to the men.  These are the first words spoken the entire time. \r<br>\n\r<br>\nLying there helpless you anayse his voice.  Although it was gruff as you expected it.  He had spoken english and not some savage language.  There was also something gentile about it.\r<br>\n\r<br>\nHe pays no more attention to you, instead peering at the ship they are nearing.   You want to look up, but decide that might not be wise. \r<br>\n\r<br>\n...\r<br>\n\r<br>\nYou've reached the ship now.  There is a big jolt and crew on board begins to pull the boat in.  This is the first boat to return.  You sit up with your knees together, and pointing one way, your feet the other, leaning back on your hands, resting your head and back  against the side.\r<br>\n\r<br>\nAs the boat finishes its journey, the rowers begin to disembark.  New hands reach in and take ahold of you roughly.   You feel ashamed at their vulgar touch, very much unlike his touch, and feel your face glow.\r<br>\n\r<br>\nYour pulled roughly to your feet onboard.  You wonder what is to become of you.  You note that he seems to have forgotten about you.\r<br>\n\r<br>\n</span></div></div>",
            "created":968475600,
            "id":3648,
            "title":"first encounter"
        },
        "12412":{
            "author_name":"katie",
            "choices":[
                "do you talk to the captain, confronting him?",
                "do you leave without a word?"
            ],
            "content":"<div class=\"\"><div> <span>You stand there, shivering.  You don't feel ready for another encounter with him.  You aren't sure of how you'd react.  Your arms are crossed holding your elbows.  Your head is tilted slighly down, subdued, your eyes are watching, if not alertly, the activities aboard, the men moving back and forth in set patterns like a dance.  \r<br>\n\r<br>\nYou feel the eyes of someone else on you.  You look up to see he is watching you.  When he catches your eyes, he motions without a word for you to follow him.  Wordlessly you weave through the men, falling in line behind him, to enter the darkness of the ship beneath.\r<br>\n\r<br>\n....\r<br>\n\r<br>\nHe takes you to the captain's quarters.  Or what you assume at least are the captain's quarters.  He bids you to remain in the outer room and he enters into the inner room. Alone you look around.  The room is basically bear.  One port hole provides the dingy light.  You see now where to sit, so you remain standing, slighly off the center of the room starting a puddle on the floor.\r<br>\n\r<br>\nInside you hear another voice, this one less gentile, but at the same time less harsh begin to yell.  All you can make out that it is at your captor for apparently not obeying orders to board the ship, instead choosing to go after you.  \r<br>\n\r<br>\nAt that moment, a greasy appearing, small man of no distinguishable age, bent over due to the brutality the years had shown him with greedy beady eyes appeared beckoning you to follow into the room.\r<br>\n\r<br>\nYou shudder at his appearance, but follow his command.  Entering you hear, the last of your captors speech.  \"There is something to her, something making her more than the wife of a crew member, she will be worth the cost of her trouble, a heavy ranson could be had for her.\"  You realize he must have seen you the entire time, the heedless flight off your father's ship which now you greatly regret.\r<br>\n\r<br>\nYou are aware of the captain looking you over.  The conversation in the room has died out and an awkward silence has taken over.  He is examining you.  Your drowned rat appearance, your stylish clothes, your miskept, snarled hair, your figure.  He's peering into you, behind the outer layer, you realize.  Not into you, he isn't capable of that, but you realize he's attempting to do so.  \r<br>\n\r<br>\nYou refuse to look down.  You meet his stare, if not exactly, looking directly at him, at least you don't turn away, and you feel shame mount on your face as he picks each part of you to pieces, mentally feasting on you.  Oddly enough, at least compared to standing up on deck, you are relieved your captor has remained in the room.  You would never want to be alone with the captain and his steward for fear of that harm that could befall you.\r<br>\n\r<br>\n\"Take her to a far room\" the captain announces.  \r<br>\n\r<br>\n</span></div></div>",
            "created":968562000,
            "id":3654,
            "title":"boarding the new ship"
        },
        "124122":{
            "author_name":"katie",
            "choices":[
                "do you attempt to prepare yourself for you first visitor?",
                "do you remain facing the wall and pretend to still be asleep?"
            ],
            "content":"<div class=\"\"><div> <span>You leave, following your captor,  relieved to be out the presence of the captain and his helper.  You wonde what he means by the far room, what sort of room it is and thankfull realize it's probably far from the captain's quarters.\r<br>\n\r<br>\nWithout a word he shows you to a room, opening the door for you.  You enter having no other sensible choice.  The room is dark.  Behind you, you hear the door closing and the sound of the key in the locker, trapping you in your new quarters. Before the door closes completely you see a bed, more like a bunk, built low, into the wall and floor on the left against the outer wall with a port hole a few feet from it.  The room isn't large; it's very small. The right side of the room is bare, and just to your left along the door-wall is a trunk with what appears to be a pillow and two blankets.\r<br>\n\r<br>\nYou fumble through the dark to the trunk and grab a blanket wrapping it around yourself for warmth and cast yourself on the bed.\r<br>\n\r<br>\n....\r<br>\n\r<br>\nYou awake.  It is still dark.  However, there is a strange flickering orange light coming in. With the blanket still around you, you stand up, tripping over your shoes where you had kicked them off and make your way to the port hole.\r<br>\n\r<br>\nThe orange light dancing vaguely through the room you realise are flames- flames from the burning mass of a nearby ship- your father's ship.  You stand watching the  flames.  Drifting in and out of sleep.  Soon a faint haze of light pink light appears on the horizon.\r<br>\n\r<br>\nYou return to the bunk and fall asleep again.\r<br>\n\r<br>\n...\r<br>\n\r<br>\nYou are awakened when it is much lighter by the sound of a key gratjng in the lock.</span></div></div>",
            "created":968562000,
            "id":3655,
            "title":"new quarters"
        },
        "1241222":{
            "author_name":"Renee Pierce",
            "content":"<div class=\"\"><div> <span>Hugo walked in the door. He exhaled at the sight of her figure on the small cot. Her body was perfectly curved. He recalled how it had felt to pull her out of the water into his arms. He closed his eyes remembering the intoxicating smell of her.<br>\r\n<br>\r\nHis skin tingled as he felt his need of her grow. To run his hands against that smooth skin, To run his finger threw her hair his urges were undeniable as he strood to the bed to wake her.He strooked her cheek, and began to run his finger down to her breast.<br>\r\n<br>\r\nReality gripped him, making his hand draw back. He was being foolish. Hugo convinced himself it was simple infatuation and nothing else. I mean when was last time he had been with a woman? too long. And what about her feelings? He knew that he shouldnt care about what she thought but something deep inside of him could not bring himself to use her to his pleasure.<br>\r\nAngered by his conflicting feelings, Hugo left the room with a slam of the the door </span></div></div>",
            "created":1064034000,
            "id":173651,
            "title":"Conflicting feelings"
        },
        "1242":{
            "choices":[
                "You try to get away again",
                "You give in to the pirates and go with them"
            ],
            "content":"<div class=\"\"><div> <span>You duck under the water and manage to swim a few minutes before you feel the need to come up for air.  Your head feels blurry and you arn't thinking clearly.  You panic as you take a breath of salty ocean water and it seeps quickly into your lungs.  You give into the strong current of water that if forcing you down, down, down.  Suddenly you feel yourself being lifted, and you body goes limp as the strong arms of a man lift you from an otherwise watery grave and hold you close to them, and you can feel there heart beating against the warmth of your cheek.  You are too weak to move but you peek up at the man that is holding you.  He is dark and very hansome, with black hair and dazzling green eyes.  He looks down at your shaking wet body against his and almost smiles but you are too cold and afraid to smile back.  The rocking of the boat lulls you gently to sleep as you row.  Then, with a jult, you realize that you are in a rowboat with the very pirates that you were running away from.  Yet, you're not sure if they will harm you or not, for you are some comfortable and you feel so safe in the arms of the dark pirate.</span></div></div>",
            "created":989989200,
            "id":49637,
            "title":"The rescue"
        },
        "125":{
            "author_name":"Celestialsplendor",
            "choices":[
                "Do you go investigate",
                "Or stay and wait for some sign."
            ],
            "content":"<div class=\"\"><div> <span>You race down into the hull.  It's dark and you barely see an open crate in the dim darkness.  You rush over and pull the top of it over you.  It's small and the air gets really warm so you take off all the clothes you can (within deascency levels).  Sweat is sarting to fall down your face.\r<br>\nSilently you wait for what seems like forever.  It very cramped in the crate and your body is starting to ache.  Up on deck you can hear the beginings of fighting.  You hold your breath and pray to the Lord that your father's men can hold thir own against the pirates.  Your heart is pounding and you are trembling dispite the heat.  Shortly it's over.  All is quiet.</span></div></div>",
            "created":976078800,
            "id":15854,
            "title":"Damn it's hot"
        },
        "1251":{
            "author_id":"campwbook",
            "author_name":"Iris",
            "choices":[
                "Knee him in the Privates :)",
                "Pray that he'll show mercie",
                "Offer him something if he'll let her live"
            ],
            "content":"<div class=\"\"><div> <span>Slowly, she crept out of the crate that had become her savior. Drenched in sweat, she gulped in the sea air as soon as the lid was removed. She briefly considered putting her clothes back on, but decided that her undergarments would have to do, for it was difficult to be stealthy in a petticoat. <br>\r\nCrawling up the stairs, she heard the muffles sounds of celebration and laughter. But which side had won? There was only one way to find out. Gently, she lifted the trap door that led to the deck, only to have it smashed down heavily by someone's foot. She waited a minute, holding her breath until the footsteps faded away, and then she tried to open the hatch again. <br>\r\nThis time she met no resistance, and dared to peek out of the small space. <br>\r\nThe victors were dumping bodies overboard, inspecting cabins and cheering. The pirates had won. Dismay crossed the young girl's face as she saw the captain's corpse fall into the sea, pushed by two ruthless men wearing ripped pantaloons and wide, V necked T shirts. She had never seen pirates before today, and despite her disgust at all that was happening, she was curious of what these people were like. They all dressed alike, wearing bright colors and thick buckled boots. Most of them wore head dressings such as bandannas, though some were bald. Catalina couldn't help but notice that all of these men wore an extensive amount of Jewelry, usually gold bands with a precious gem in the middle. There were also necklaces, bracelets, and earrings, all gold and silver. Catalina could have sworn that she even saw a glimmer of gold in a man's mouth, posing as a tooth!   <br>\r\nHer studies were suddenly interrupted by the appearance of two pirates coming from the captains quarters. The first thing that she noticed was that both of these men wore black, although the taller one was distinguished by a typical captain's hat and cape. The next thing that she noticed was that they were heading right for her below deck! In a panic, she dropped the trap door and bolted down the stairs. Leaping over her deserted attire, she clambered back into her original hiding place. <br>\r\nAfter carefully putting the lid back on the crate, she tried to calm her breathing down in order to hear.  <br>\r\nThe hatch opened, and she heard a voice say:<br>\r\n\"No, Crimby, I want you to see if the ship still has some cargo in it. They might have picked up some merchandise in the last port, unlikely though it may be.\"<br>\r\n\"As you wish, Captain.\" a deeper voice replied. <br>\r\nShe heard one pair of footsteps stomp down the stairs, and then a pause as i reached the bottom.. The silence lasted a full two minutes, and Catalina began to panic. Shifting slightly, she was able to see through a minuscule hole on the side of the crate. <br>\r\nThere was one of the darkly dressed men, standing as still as a statue except for his head, which revolved slowly around the room, surveying as if looking for a good hiding place. Catalina could hardly guess his actions until her eyes rested on the floor, where she had left-<br>\r\nOh gods! The dress!<br>\r\nShe must have emitted a small gasp because suddenly the man charged towards the crate, and drew a wicked looking dagger from his belt.  He pulled the lid off with little effort, and yanked Catalina out of her sanctuary roughly. <br>\r\n\"Please! She screamed. \"Please, don't kill me!\" But he already had the dagger to her throat, and she feared for the worst. <br>\r\n   </span></div></div>",
            "created":1322151060,
            "id":1228190,
            "title":"Do you go investigate"
        },
        "1252":{
            "author_name":"Celestialsplendor",
            "choices":[
                "Do you let out a yell to get them to get you out of the crate",
                "Do you wait and pray they take you"
            ],
            "content":"<div class=\"\"><div> <span>Curled up in your crate you to stay where you are.  Lord knows what could happen.  If only you knew for sure that your father's men had one.  YOu decided tho pray some more...  Suddenly you hear someone coming down the stairs.  You start to panic and you try to turn yourself to wards a tiny holl in the crate.  There you see someone you've never met before.  He comes stumbling down and spotting the loot let's out a howl.  Soon many, perhaps even all, of the pirates come down. \r<br>\nA tall blond one shakes his head.\r<br>\n\"Well we can't take it all... Besides half this stuff wouldn't be sellable, guess well have to burn the ship with most of it on.\"\r<br>\nWait a minute that means you!!!</span></div></div>",
            "created":976078800,
            "id":15855,
            "title":"Between a hard place and a rock"
        },
        "12521":{
            "author_name":"little lady",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n    As soon as Catalina hears the pirate, her life flashed before her eyes and she felt sick at the bottom of her stomache. She can hear them shuffling around, and cusing that there was nothing here and the only option was to burn the place.   <br>\r\n<br>\r\n   The attackers started up the stairs, and with every step Catalina's impending fate became all the more real. After a few seconds she could no longer take it and she jumped up and screamed \"Lord don't let me die!\" <br>\r\n<br>\r\n<br>\r\n  <br>\r\n<br>\r\n </span></div></div>",
            "created":1027573200,
            "id":113768,
            "title":"Don't  take me now...."
        },
        "125211":{
            "author_name":"wish",
            "choices":[
                "she starts with it?",
                "she runs?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>  they see her and the main 1 starts feelin hot regarding her he taked her out and tries to do sex with her..she rufuses but she have to other wise he ll kill her..</span></div></span></div>",
            "created":1086757200,
            "id":202369,
            "title":"continue"
        },
        "1252111":{
            "author_name":"wish",
            "choices":[
                "she stays there?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>it was her dream?yes..she was dr4sming then she felt a bit better </span></div></span></div>",
            "created":1086930000,
            "id":202686,
            "title":"here"
        },
        "1252112":{
            "author_name":"wish",
            "choices":[
                "she runs?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and she's awken by the noise and she founds out tht it was her dream she was still there...alla lone they have gone to the deck</span></div></span></div>",
            "created":1086930000,
            "id":202685,
            "title":"con"
        }
    },
    "info":{
        "author_id":"msbiggs",
        "author_name":"Bernie",
        "brief_description":"A girl falls in love with a pirate. Is it a true love?",
        "created":968463300,
        "description":"<td align=\"left\" class=\"norm\">Catalina Sherwood, just a normal twenty year old coming back from England, and is on her way back to the United States. Her parents had sent her to a college in England. They want her to be a school teacher. Someone who is very proper, polite, and neat. On her way home, she has a run in with a ship full of pirates. They attack her ship, and kill everyone on board, except for her. When she comes out of hiding, she spots a very handsome pirate.\r<br>\n\r<br>\nShe goes onto their ship and through all of the terror aboard ship. She begins to have feelings for this mysterious pirate. Is it really just true love? Or just lust?\r<br>\n\r<br>\n--------------------------------------------------\r<br>\nATTENTION!: I would like to explain somethings before you continuing reading. I've seen you add in that Hugo is the captain. He's NOT a captain, just a pirate. I would also like to add that there shouldn't be any rape or kinky sex. If you'd like, you can put in sexual acts, but don't get graphic. I'll edit or delete chapters that don't specifically address this. I hope that you will follow the two things I've asked of you. Please don't blow the story out of proportion, or I'll add more regulations to this story!</td>",
        "id":100322,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1462376520,
        "modified":1462376520,
        "pretty_title":"Pirates Love"
    }
}