{
    "chapters":{
        "1":{
            "author_id":"dragonbard2372",
            "author_name":"The writing lizard.",
            "choices":[
                "Meia Gisborn",
                "Dita Liebely",
                "Jura Basil Elden",
                "Barnettte Orangello",
                "Another lady, perhaps?"
            ],
            "content":"<div class=\"\"><div> <span>Greetings, and welcome inside the Paksis.<br>\r\n<br>\r\nI am your guide, to allow you to experience the potentials of selection that can occur within the bounds of this machine. Please note that your experiences will be from the 3rd person, as placing you inside the head of another could have side-effects. Additionally, the Paksis system has restricted you to females due to number ratios.<br>\r\n<br>\r\nTo begin with, why not choose a subject to follow?</span></div></div>",
            "created":1365707580,
            "id":1569876,
            "title":"Paksis Selection system, activated."
        },
        "11":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "A knocking at her door. Who is it?",
                "Her stomach growls. Time to head to the mess.",
                "Time to inspect the new Dread cadets.",
                "A voice from behind the door. It's familiar too!",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span>It has been several months since the war between the human factions of the galaxy united against the Earth-based Harvesters, and in the end, man prospered against the tyrants. As the factions rejoiced, two superpowers got together in order to better relations with one another.<br>\r\n<br>\r\nTaraak, the planet of Man. Mejere, the world of Woman.<br>\r\n<br>\r\nThe two planets once bitter enemies, have decided to return back to the age old custom of intergrating their genders back together. And so, Project Eden was formed.<br>\r\n<br>\r\nThe space station 'Gardenia' where the co-existing would take place between Taraakite males and Mejereian females orbited a desert planet below, which also served as a way to help terraform the planet and make it greener and more habitable for life.<br>\r\n<br>\r\nAnd here our heroine Meia Gisborn sits in her office looking over the dossier of the resident in Gardenia Station.<br>\r\n<br>\r\nEngineers, social organizers, mechanics, technicians, many people of different professions have gathered here at this station, and she set the dossier down,looking out into space.<br>\r\n<br>\r\n'How is everyone on the Nirvana doing nowadays...' She pondered.</span></div></div>",
            "created":1365712680,
            "id":1569897,
            "title":"Meia Gisborn"
        },
        "113":{
            "author_id":"dragonbard2372",
            "author_name":"The writing lizard.",
            "choices":[
                "Received a urgent summons from the base's command personnel",
                "Ran into a stranger hurrying the other way",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>A small beeping went off, snapping Meia from her reverie. Collecting her thoughts, she realized what was causing the noise: the station's comm-link. Taking time for a small sigh, Meia quickly answered.<br>\r\n<br>\r\n\"Meia here.\"<br>\r\n<br>\r\n\"Ma'am, This is Sgt. Connor Sinclair, your acting XO until you have had time to assign your crew. We're forming up now for inspection, as per Taraakite custom. You requested to be notified before we were due to commence.\"<br>\r\n<br>\r\nMeia's mind quickly recalled the information from the young man's dossier, which she had head shortly before reminiscing about her time on the Nirvana. <br>\r\n<i>Connor Sinclair, Male, mid-20s. Grey hair, red eyes. Solid commander, actually holds a rank of Lieutenant in the Taraak military. As part of the rank reshuffling for Project Eden, he was made Sgt for this station. His skills as a leader from the Damocles training exercise were primarily responsible for his assignment here. The men look up to him, while the women are sometimes in awe of him. Caution required when handling him: could prove dangerous if treated in a way he's not expected to be...</i><br>\r\n<br>\r\n\"Understood, Sgt. Sinclair. I will be along presently. Tell everyone that they should be prepared for a training exercise.\"<br>\r\n<br>\r\n\"Ma'am!\" With a quick salute that, while proper, held a small tinge of irony and resentment, Sinclair cut off the feed before Meia could respond further.<br>\r\n<br>\r\n\"That man will be a problem. But not as much as the dossier I read before him...\"<br>\r\n<br>\r\nTaking a break from what would otherwise prove a bleak review, Meia quickly dressed in her standard flight suit from her time as a Dread pilot. essentially, this was simply a custom-designed vest or jersey which went on over her standard jumpsuit to provide additional warmth and comfort while piloting.<br>\r\n<br>\r\nAs she began heading to the main hall, Meia...</span></div></div>",
            "created":1365771480,
            "id":1570277,
            "title":"Parade inspection."
        },
        "1132":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Ritz offers to escort Meia to the mess for some Brunch",
                "Duty calls. Meia will hold off and speak with Sinclair on duty and matters",
                "A voice from down the hall calls out Meia. She recognizes that voice!"
            ],
            "content":"<div class=\"\"><div> <span>Meia walked out of the door and into the main hallway until she was bumped on the shoulder. She turned her head, peeved at being ran into.<br>\r\n<br>\r\n\"Watch where you are-\" She was cut off at the sight. Below her was a man on his knees searching the ground for something.<br>\r\n<br>\r\n\"My glasses! Oh come on I can't be any late that I am right now!\" Said the young man, probably a teenager and younger than her by about a year or two. He had blonde yellow hair, reminding her of Jura in a sense. His body was lithe and slender as he finally found his glasses and put them on, turning around and showing his green eyes. His face lit up, recognizing her.<br>\r\n<br>\r\n\"Ah! Captain!\" He stood right up, saluting. Judging by his clothes he doesn't look military, but he has a nametag indicating he works on this station.<br>\r\n<br>\r\nAssistant Chef Risu McCarian.<br>\r\n<br>\r\n\"Chef McCarian. At ease.\" Meia brushed herself. \"Why the rush? Are you late to the mess?\"<br>\r\n<br>\r\n\"Yeah...\" He rubbed the back of his head. \"I overslept thanks to <i>him</i>. This is my first day and I'm afraid I'm going to be late!\"<br>\r\n<br>\r\n\"Him? Someone made you stay up?\" Asked the bluenette.<br>\r\n<br>\r\n\"Yes. Down in the residential quarters in the floor above me, someone was playing their music too loudly. I originally planned to put in a complaint but...\"<br>\r\n<br>\r\n\"But what?\" Her eyes narrowed. \"Who did it?\"<br>\r\n<br>\r\n\"It was a guy. Sinclair I think? He was a sergeant from Taraak.\"<br>\r\n<br>\r\n'Sinclair huh? I'm going to have a talk with him about this...' \"I see. I'm glad you brought this to my attention. What made you hesitate Chef Risu?\" Risu's face blushed a little more.<br>\r\n<br>\r\n\"Ummm...permission to speak Captain Gisborn?\"<br>\r\n<br>\r\n\"Granted.\"<br>\r\n<br>\r\n\"Can you call me Ritz? It's what I prefer to be called.\" Meia nodded.<br>\r\n<br>\r\n\"Very well, Chef Ritz. I will inform Sgt. Sinclair about this matter. Maybe he can use headphones to lull himself to sleep. In the meantime-\"<br>\r\n<br>\r\nShe was cut off from a growling from her tummy, now it was her turn to have some pink on her cheeks. Ritz perked up.<br>\r\n<br>\r\n\"Oh. Are you hungry at all Captain?\"<br>\r\n<br>\r\n\"Well...I do admit I haven't had time for breakfast this morning.\"</span></div></div>",
            "created":1374349140,
            "id":1631246,
            "title":"Ran into a stranger hurrying the other way"
        },
        "11321":{
            "author_id":"dragonbard2372",
            "author_name":"The writing lizard.",
            "choices":[
                "\"... I'd be delighted.\"",
                "\"... I'll have to take a raincheck.\""
            ],
            "content":"<div class=\"\"><div> <span>\"With respect, Captain, skipping breakfast is an absolutely terrible thing to do, especially for soldiers! Skipping breakfast is a potential malnutrition factor and can ccause terrible morale and health issues if done repeatedly - it also expresses a lack of trust or faith in those who have made the meal...\" Ritz looked down slightly shame-facedly at this part part of his remark - feeling he'd crossed a line in voicing his opinions and concerns on breakfast-skipping.<br>\r\n<br>\r\nMeia, noticing the young chef's downcast look, seeing something in it that reminded her of Dita on the few occasions when her former Vandread squad-mate had spoken hr mind on issues which troubled her. 'I see that morale is an issue in every facet of a team, regardless of one's role or station...'<br>\r\n<br>\r\n\"There's no need to feel ashamed, Ritz - you're quite correct to admonish me for skipping breakfast. A good soldier should remember to keep themselves well-fed in order to have energy for any situation in times of conflict. My apologies for missing breakfast - I was unaware of the time having been so focussed on reading through the dossiers of the personnel whose safety I'm now responsible for.\"<br>\r\n<br>\r\nRitz brightened up at Meia's words - they may have only been sentiments, but the smile that came with them was slightly sheepish and altogether incredible. \"I-if you like, Captain, I'm heading to the mess to prepare for my shift today - I c-could prepare some b-b-brunch for you if you'd like to come w-with me?\" Meia noted the blush on the young chef's cheeks, and felt it slightly mirrored in her own.<br>\r\n<br>\r\n\"Chef Ritz...\"</span></div></div>",
            "created":1374416040,
            "id":1631651,
            "title":"Ritz offers to escort Meia to the mess for some..."
        },
        "113211":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "They found the door leading into the mess hall",
                "Someone who recognizes Meia? Who is it?"
            ],
            "content":"<div class=\"\"><div> <span>Ritz beamed. \"Well...i-in that case, come right this way Captain!\" Smiled the blonde as he walked alongside her. He noticed how taller she was, about 5 foot 5 compared to his 5 foot 3. Her breasts were very modest yet supple, but her hips and legs were her most defining feature of all. They were so...<br>\r\n<br>\r\nRitz snapped back in front of him. Wouldn't want to provoke her ire by oogling at her.<br>\r\n<br>\r\n\"So Ritz, what type of cuisine do you make?\" Asked Meia as she walked in pace with him in the hallway.<br>\r\n<br>\r\n\"Well...I am still leanring the Mejerian cookbook, while the Taraakite cookbook is very bland. Thankfully, the other planets are consulting with us. They're more experience of male and female relationships.\" He looked back at her. \"Though I am able to say that the 'Asian', 'Mexican', and 'Italian' are the ones I have most trouble with. 'Traditional' I am good at, but hey, so is any other cook. I'm still learning I guess.\"<br>\r\n<br>\r\n\"I don't mind that all. I'm an experienced Dread pilot, but that never means your perfect. When you sortie, you're learning how to adapt to any situation thrown your way,\" commented the bluenette. \"Like the old syaing goes: you learn something new everyday. The same applies to piloting and in your case, cooking.\"<br>\r\n<br>\r\nRitz blinked, impressed by Meia's wisdom. \"Wow...when you put it like that...Ah! We're almost here.\" And they turned the corner and...</span></div></div>",
            "created":1374439080,
            "id":1631837,
            "title":"\"... I'd be delighted.\""
        },
        "1132112":{
            "author_id":"dragonbard2372",
            "author_name":"The writing lizard.",
            "choices":[
                "Misty Cornwell! How'd she get here?",
                "Or is it somebody else?"
            ],
            "content":"<div class=\"\"><div> <span>\"Meia? Is it really, you?\" A voice calls out, stopping both Meia and Ritz in their tracks.<br>\r\n<br>\r\nSuddenly, Meia is crash-tabled in a glomping bear-hug by a figure that barrels almost out of nowhere, intent on giving her the biggest hug they could.<br>\r\n<br>\r\nOnly one question enter's Ritz's mind: 'Who IS this crazy person?'<br>\r\n<br>\r\nAnd a good question indeed. Who is it?</span></div></div>",
            "created":1380208260,
            "id":1670004,
            "title":"Someone who recognizes Meia? Who is it?"
        },
        "11321121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "They arrive at the mess hall. Time for Misty's training!",
                "Something else happens?"
            ],
            "content":"<div class=\"\"><div> <span>\"M-Misty!?\" Said Meia in surprised as she regained her footing. Wrapped around her waist in a bear hug is Misty Cornwell, a fellow ex-crew member of the Nirvana and dear friend of the bluenette. She was slightly shorter than the captain and had darker blue hair, but her disposition was as bright as the sun.  Her auburn-red eyes were beaming with joy.<br>\r\n<br>\r\n\"It's been so long Meia!\" She said hugging tighter. \"How have you been!\" She stepped back, hands behind her back in her blue shirt-skirt outfit. Her dear slime alien friend, Q-Chan, was hovering over her shoulder and was shaped like a heart, making a cute sqweak showing his own joy for seeing Meia again. Then again, Misty personality and Q-Chan's shape and demeanor was correlated. <br>\r\n<br>\r\n\"Umm...I've been alright. How about you Misty. What are you doing here on Gardenia Station?\"<br>\r\n<br>\r\n\"Oh nothing. The big wigs of this station figured they needed someone who can help teach you guys how to live together. Since I'm from Pluto, I can help in that regard!\" She turned her head, seeing the perplexed blonde male. \"Oh? Who's he?\" Q-Chan shifted into a Question mark.<br>\r\n<br>\r\n\"Oh! Ummm...Risu McCarian. I'm a chef here on this station. But call me Ritz. It's what I prefer to be called,\" said the blonde teen. Misty smiled.<br>\r\n<br>\r\n\"Ah! So you can cook?\"<br>\r\n<br>\r\n\"Well...yeah. I'm still learning though and-\"<br>\r\n<br>\r\n\"Then come on!\" Misty marched forward and grabbed his hand. \"I'll go and teach new recipes and cooking tricks. I happen to be a pro!\" And Ritz couldn't object because the hyperactive bluenette was tugging him along.<br>\r\n<br>\r\nMeia sighed but smiled. \"Somethings never change.\" And she followed the Genki girl and the overwhelmed blonde.</span></div></div>",
            "created":1380310500,
            "id":1670720,
            "title":"Misty Cornwell! How'd she get here?"
        },
        "113211212":{
            "author_id":"dragonbard2372",
            "author_name":"The writing lizard.",
            "choices":[
                "\"Let's see some space fighting Action!\"",
                "\"I'll play it safe - post-battle, please.\""
            ],
            "content":"<div class=\"\"><div> <span><b>\"ALERT! ALERT! Scramble all Dreads and Vanguards! All non-essential personnel are to proceed to Landing Bay #27 for immediate evacuation! This is not a drill! I Repeat: This is not a drill!\"<br>\r\n</b><br>\r\n<br>\r\nHearing the alert blaring over the loudspeakers, Meia gave both Rits and Misty a quick hug before she took off for where her Dread was located, only pausing to shout back \"Stay Safe, you two!\" as she raced for the battle, knowing that either her pre-arranged 'emergency test' had triggered early or that they were really under attack!<br>\r\n<br>\r\nAs Rits and Misty moved to Landing Bay #27, Rits could only hope that Meia would come through this okay...<br>\r\n<br>\r\n<u>Hey-o! It's your friendly neighbourhood Paksis guide here! Normally, I wouldn't interrupt a story like this, but there's a few g-glitches with the upcoming sections. The wonders of di-di-di-di-di-di-di-di-digital technology, I guess.<br>\r\n<br>\r\nAnyway, to try and smooth things over, I'm allowing a choice - for those who have no desire to risk the g-glitches, you can skip to after the battle, as that's where the damaged code seems to be. For those who would rather take a chance and see some action, you can jump right into the battle too.<br>\r\n<br>\r\nSo, which is it to be?</u></span></div></div>",
            "created":1381143420,
            "id":1675623,
            "title":"Sirens blaring!"
        },
        "1132112122":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "It was Meia returning...and hungry.",
                "Who is it this time?"
            ],
            "content":"<div class=\"\"><div> <span>Ritz and Misty stayed together as the two of them left the evacuation lifeboats. The Station had a run in with pirates that attacked the sector, and thankfully they were destroyed. Seeing the masses huddling about and being organized in single file, they went back into the station.<br>\r\n<br>\r\n\"Thank goodness for the Dreads...\" Sighed Ritz. Misty giggled.<br>\r\n<br>\r\n\"That's Meia for ya! Captain of the Dreads and the best big sis ever!\"<br>\r\n<br>\r\n\"Best big sis?\"<br>\r\n<br>\r\nBefore Misty could reply what a 'sis' was, a voice called out to them.</span></div></div>",
            "created":1381510500,
            "id":1677489,
            "title":"\"I'll play it safe - post-battle, pleas..."
        },
        "11321121221":{
            "author_id":"dragonbard2372",
            "author_name":"The writing lizard.",
            "choices":[
                "\"I'll make her a nice, big meal!\"",
                "\"I'll wait for her to wake up and tell her...\""
            ],
            "content":"<div class=\"\"><div> <span>\"Are you two alright?\" Meia asked, knowing that even though they may well be, she was not.<br>\r\n<br>\r\n\"I'm okay, Ma'am - just a little scared by what's happened.\" Ritz replied. Misty, however, was not so subtle - running up and glomping Meia and giving her a big bear-hug.<br>\r\n<br>\r\n\"Misty.. don't...\" Meia was feeling woozy - something was seriously wrong, and she could tell Rtiz could see it. <br>\r\n<br>\r\nUnfortunately, Ritz's face was the last thing she saw before she collapsed. Hearing Misty's screams for help, a few of the nearby paramedics who had journeyed with the non-combatants to see to their safety picked her up, put her on a stretcher and carried her directly to the infirmary, Ritz following as closely as he could with a distraught Misty clinging to him and babbling her hopes Meia would be okay.<br>\r\n<br>\r\n<b>4 Hours later...</b><br>\r\n<br>\r\nMisty had been given a sedative to get her to relax, and was currently in a bed beside Meia's own hospital bed, drugged into a sleep so she wouldn't interfere with the doctors' examination. Ritz just refused to leave her side - but was smart enough to not get in the doctor's way. Meia was the closest thing to a friend he currently had - and he wasn't going to give up on her.<br>\r\n<br>\r\nFinally, the doctor finished his examinations. \"You came in with her, right, kid?\" Even though he'd normally take offense to being called a kid, Ritz nodded - to this doctor, a man nearing his retirement years - almost everyone would be a kid. seeing Ritz was keeping his mouth shut, the old doctor pressed on. \"It's alright, son - I've already written to the kitchens and had you excused from duty today. It's lucky she collapsed when she did - otherwise she could well be dead or beyond our help. A combination of Malnutrition and being stubborn as a mule led to her not eating at all for the better part of 5 days - she'll have hell to pay for it now, though. She's grounded under medical over-rides until she stabilizes and her blood tests show she's healthy enough to be discharged. As you're a cook, I'm entrusting her dietary care to you, son. Get her healthy and she'll be allowed to resume combat duties. For now, a minimum grounding of 3 months stands - it's not good for an officer to starve themselves like this.\"<br>\r\n<br>\r\nWith that, the doctor left to see to other patients. But what would Ritz do?</span></div></div>",
            "created":1381513920,
            "id":1677513,
            "title":"It was Meia returning...and hungry."
        },
        "113211212211":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Let's go over his cooking process!",
                "Skip that, he returns with a feast fit for a village for Meia and Misty."
            ],
            "content":"<div class=\"\"><div> <span>\"I'll make her something nice...something big too so she can catch up,\" said the blonde youth as he sat by her bed. \"Will you watch her while I bring her food?\"<br>\r\n<br>\r\nThe doctor nodded. \"Yes, she is in good hands. When you return I'll wake her up.\"<br>\r\n<br>\r\n\"Thank you.\" He stood up and offered his hand. \"Name's Risu McCarian, but call me Ritz!\"<br>\r\n<br>\r\n\"Izvald Jennings.\" The old man shook in return. \"Now you bring Meia that food.\"<br>\r\n<br>\r\nHe nodded and ran off, determined to cook Meia a nice large tasty lunch when she would reawaken.</span></div></div>",
            "created":1381700340,
            "id":1678567,
            "title":"\"I'll make her a nice, big meal!\""
        },
        "114":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Harem mate Dita",
                "Harem mate Jura",
                "Her husband Hibiki"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1452880200,
            "id":2089584,
            "title":"A voice from behind the door. It's familiar..."
        },
        "12":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Hibiki likes fat girls",
                "overeat",
                "next",
                "next",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does she gain?</span></div></span></div>",
            "created":1453226160,
            "id":2091402,
            "title":"Dita Liebely"
        },
        "15":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Misty Cornwell",
                "Parfait Balbair",
                "Paiway Underberg",
                "Erza Veil",
                "More ladies!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other ladies you seek make gain more?</span></div></span></div>",
            "created":1365708420,
            "id":1569882,
            "title":"More ladies!"
        }
    },
    "info":{
        "author_id":"dragonbard2372",
        "author_name":"The writing lizard.",
        "brief_description":"Space girls of Vandread learning causality: eating too much hits your waistline...",
        "created":1365707340,
        "description":"<td align=\"left\" class=\"norm\">At a request from a friend of mine, I decided to start this interactive. Before we begin, a few ground rules.<br>\r\n<br>\r\nFrist, this is a WG interactive fic: don't like, don't take part.<br>\r\n<br>\r\nSecond, please keep the rates at which the girls gain realistic (no gaining 400lbs in 40 seconds, and so on)<br>\r\n<br>\r\nPregnancy, body expansion and inflation are allowed, as long as you can explain it clearly.<br>\r\n<br>\r\nSex and nudity are allowed, but only if it fits with the story arc.<br>\r\n<br>\r\nScat and blood are out of bounds. Entries of this nature will be removed.<br>\r\n<br>\r\nWith that, story arcs are free for you to establish, though I would prefer you didn't go too OOC. Enjoy and have fun!</td>",
        "id":1928502,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1453226160,
        "modified":1453226160,
        "pretty_title":"Vandread WG Interactive"
    }
}