{
    "chapters":{
        "1":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "family",
                "wait for school",
                "mall or somewhere else",
                "fictional charaters",
                "something happens"
            ],
            "content":"<div class=\"\"><div> <span>one day you are looking through your room and find a strange box labeled to you from you birth parents . you open it to find a white plastic mask with a note stating once put on a another person it will absorb said person and create a mask of the person that will transform you into them. it also can get fictional characters turned into masks.  you now wonder who to use it on.</span></div></div>",
            "created":1366261200,
            "id":1574493,
            "title":"the white mask"
        },
        "11":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "mom",
                "dad",
                "sarah",
                "carly",
                "extended famly"
            ],
            "content":"<div class=\"\"><div> <span>you decide on your family but who to go after. you know it would be fun to be ether you mom or Sarah. you could turn into your dad just to have sex with your mom or get one of his female co workers. the carly could get you to some of the other hot moms of her friends. </span></div></div>",
            "created":1366261200,
            "id":1574496,
            "title":"family"
        },
        "112":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "go bang you mom (aka your new wife)",
                "go targtet one of your female coworkers ",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>you decide to go after your dad. so you walk down into the basement where you dad's lab/ office is.when you reach the bottom step you see your dad lounging on the couch looking at his laptop. you walk up to him and say hey dad i found this mask in the attic from the left over things the last people who had this house could you look at it to see if it would go somewhere good to mount it. your dad then looks up from the computer and said sure (insert your name here) had it over so i can look at it.you had it over to your dad who fully examines it and puts close to his face. the mask then glows brightly making you dad look at it with increased curiosity. then the mask flashes bright enough to blind you. when the light dies down you see the mask changed into a mask form of your dad's face. you then put the mask on which a bright lit envelops you. you feel you body change and hear bones crack and reshape. when the light dies down the mask falls down off you face returning to it's normal appearance. you then walk over to the mirror you dad had in the lab and saw you dad looking right at you. you then walkover to the mask and see a letter which instructed that to return to normal put the mask back on or just put the mask on someone else if you want to change into someone else. you now ponder what to do next    </span></div></div>",
            "created":1366347600,
            "id":1574951,
            "title":"dad"
        },
        "114":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "explore your new body",
                "go after Carly's firends mothers at the sleep over",
                "go after someone else"
            ],
            "content":"<div class=\"\"><div> <span>you decide on Carly because even with her genus level intelligence she looked up to as her big brother. so you walk into her room which was a standard yellow colored room for a little girl except with a few tools laying around an work table and a desktop computer she made herself, with the addition of soundproofing to the room which all the rooms in the house had sound proofing to not disturb the neighbors and each other. you look at the computer where Carly was typing things she was currently wearing a yellow shirt and a white skirt with her hair up in a pony tale.Carly turns around from her computer and said hi big bro what can i do for you. hey Carly do you wan tot try on this mask i found you said as you close the door behind you as yo walked up to her. sure Carly said with a glint of childish glee in her eye. you hand it over to Carly which she perceived to put it on. when she put it on the mask glowed and started to float off her face which go a curious looks from both of you. the the mask glowed brighter as it stated to pull Carly into it by her legs. she started screaming as she slowly got absorbed by the mask. the mask absorbs her after a 3 minutes go by and reshapes into Carly's face. you now put the mask on which gave you a sudden tingling sensation all over your body. the first thing to change was your cloths turn into Carly's and then you shrunk down slowly to Carly's height. next thing you feel is your dick receding into you body and changing into a vagina while your inside adjust to accommodate you new female organs. next the mask fuses with you face giving you your sisters face as you hair grew lone and change into your sisters red hair. when the change subsided you walk over to the mirror in the room and see you Carly looking back at you. wow you said in Carly's voice. you suddenly get a wave of memory's which tells you Carly is going over to a friends house to sleep over at. you now wonder what to do next</span></div></div>",
            "created":1366261200,
            "id":1574518,
            "title":"carly"
        },
        "1142":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "Mary's house",
                "Jenney's house",
                "Amy's house"
            ],
            "content":"<div class=\"\"><div> <span>you decide to go after one of Carly's friends mothers at a sleep over. but who is hosting the sleep over?<br>\r\nMary king: same age as Carly has blond hair blue eyes her mother is Karen King. Karen King: age 32 has blond hair brown eyes, she has ee cup breasts and a hourglass figure. <br>\r\njenny fuller:brown hair green eyes her mother is Lina fuller. Lina fuller: age 32 has brown hair brown eyes, she has dd cup breasts and huge shapely ass/hips.<br>\r\nAmy Rich:black hair her mother is Melissa Rich. Melissa Rich:black hair red eyes, she has g cup breasts and a hourglass figure.  </span></div></div>",
            "created":1368162000,
            "id":1587505,
            "title":"go after Carly's firends mothers at the sle..."
        },
        "11421":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "explore your new body",
                "more choices"
            ],
            "content":"<div class=\"\"><div> <span>you now looking into Carly's memory more and find the sleepover is at Mary's house. which means you will go after Mary's mom. after packing all the things you needed for the sleep over a sudden flash of images pop in your head which was how to take the mask off and to return Carly back to normal except she won't remember what happened with the mask and she will have the certain memories that you chose on what happened during your time as her. also the mask showed you another ability it has which was the ability to make  you invisible so you can put the mask on people without being seen. you hear your mom call you (aka Carly who you are currently)that it's time for you to go to Mary's house. so you grabbed the backpack that had all of the things your sister needed for the sleepover when you return her to normal during it to go after Mary's mom. you arrive at Mary's house and are greeted by her. after putting your sister's things in Mary's room you go to the bathroom and return to normal. you then use the mask's ability yo turn you invisible then returned Carly to normal. she and Mary walked out of Mary's room talking about what they were going to do tonight with you fallowing them out of the room.then you go looking for Carly's mom were you see her taking a bath in her bathroom. so you walk over to Mary's mom and put the mask on her face and watch as she was sucked into it and the mask reform into her face. you then put it on as a tingling sensation washes over you body.  you feel you body crack and reshape and you dick recedes into you body forming a pussy. you hair changes color and lengthens. the mask then fuses into you face and reshapes it into Mary's mom's face. the final thing that happened is your chest erupts into Mary's mom's ee cup breasts. you then turn to see the changes have finished and see Karen King's (Mary's mom) stunning form in the mirror. you now smile and think about all thhings you could do now but what will it be?    </span></div></div>",
            "created":1368248400,
            "id":1587946,
            "title":"Mary's house"
        },
        "114212":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "get dressed and act like Karen",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are some more choices.</span></div></span></div>",
            "created":1368248400,
            "id":1587947,
            "title":"more choices"
        },
        "1142122":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "karen's husband comes into the bathroom",
                "reader's choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are the last choices</span></div></span></div>",
            "created":1368248400,
            "id":1587948,
            "title":"more choices"
        },
        "115":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "one of your grandparents",
                " one of your aunts and uncles",
                "one of your cousins"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are you choices. </span></div></span></div>",
            "created":1374728400,
            "id":1634230,
            "title":"extended famly"
        },
        "12":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "office",
                "library",
                "lunch room",
                "certain teachers",
                "parents of others or visitors tha came for the day"
            ],
            "content":"<div class=\"\"><div> <span>you decide to wait for school. you wake up in the morning do you normally thing when you wake up. before you leave you notice another note in the mask which states while holding onto the mask people will not notice you which make you able to put it on them with no negatives what so ever.  you hop on the bus and enjoy the ride to school.after 30 min you arrive at school which caused you to think where to go to get your targets. </span></div></div>",
            "created":1366347600,
            "id":1574789,
            "title":"wait for school"
        },
        "13":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "mall",
                "pool",
                "beach",
                "theme park",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>you decide to go to the mall or somewhere else. you before you left you room you see another note which states while holding onto the mask people will not notice you which make you able to put it on them with no negatives what so ever. now where will you go</span></div></div>",
            "created":1366261200,
            "id":1574539,
            "title":"mall or somewhere else"
        },
        "131":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "white",
                "black",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide to go to the mall. you arrive there to see a women of what ethnicy?</span></div></span></div>",
            "created":1366693200,
            "id":1577277,
            "title":"mall"
        },
        "1311":{
            "author_id":"alfrado",
            "author_name":"Bic",
            "choices":[
                "open it its one of the workers",
                "open it its the girls friends",
                "one minute"
            ],
            "content":"<div class=\"\"><div> <span>You arrive at the mall looking around to see who would be your first test subject to try the mask on. As your looking you see a girl walking with her friends into Victoria Secret. The girl was white, blond hair, brown eyes, and C size breast. \"She could be a good test subject\" you thought to yourself. You walk into the store and follow her while hiding at the same time. Eventually her friends walk a different direction, so it gave you a better chance to put the mask on. She grabs a couple of things she wants to try on and heads to the dressing room. \"Here's my chance \" you said. You open the door and quickly go in and shut the door behind you. \"Ahhh who the hell are you\" the girl screamed. To avoid anyone hearing her you quickly put the mask on her face. You watch in amazement as the mask glows and floats off her face into the air, it then begins to suck her in by her face first. She uses her feet to grab onto one of the rails in the dressing room as she is already being sucked in by the waist. You grab her feet and take them off the rain and the mask sucks her in completely. There is a bright flash, as you regain your vision you see the mask on the floor instead of it being all white it was in the form of the girls face. \"Dam this is like some Majoras mask kind of stuff\" you said. You pick up the mask and look at it for about a minute, \"well here I go\" saying to yourself. You put on the mask and immediately you feel the changes happen your bones start to crack and reshape, your body starts getting taller, your hair grows out more and changes to a blonde color, your penis reforms into a vagina, tits start forming on your chest, and your clothes change into the bra and underwear the girl was trying on. You look in the mirror in the dressing room and see the girl staring back at you. \"It worked I'm the girl\" you say with her voice. Just then there's a knock on the dressing room door.</span></div></div>",
            "created":1461777480,
            "id":2140037,
            "title":"white"
        },
        "13113":{
            "author_id":"alfrado",
            "author_name":"Bic",
            "choices":[
                "go with Ashley's friends",
                "Im not feeling well"
            ],
            "content":"<div class=\"\"><div> <span>\"Um one minute please\" you say. You take off the bra and underwear that she was wearing revealing her perfect tits and vagina, you whistle at yourself while looking in the mirror. You put back on her normal underwear and bra, her skin tight jeans, her low cut shirt revealing her bellybutton piercing, and you put back on her black and white stripe socks and white converse. You grab the bra and underwear and open the the dressing room door to see a lady standing right there. \"Oh sorry I didn't mean to frighten you I just heard a scream a scream are you okay\" the lady ask. \"Yeah yeah I'm fine just thought I saw something in there silly me haha\" you said. You quickly walk past the lady and drop the bra and underwear somewhere random and walk out the store. You look into the memories of the girl you are now and find out her name is Ashley Miller , age 21, in collage, lives in apartments near her collage. You hear voices behind you calling out your, you turn around and see its Ashley's friends. \"Were did you go we were looking for you in the store\" one friend said. \"Um I couldn't find anything so I though just to wait for you guys out here\" you said. Both friends looked at each other in confusion, \"okay well were going to get our nails and hair done you coming\" they said.</span></div></div>",
            "created":1461784080,
            "id":2140065,
            "title":"one minute"
        },
        "1312":{
            "author_id":"mrwhite.13",
            "author_name":"mrwhite.13",
            "choices":[
                "it works and fun is to be had",
                "works but something is off",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>At the mall you notice an attractive, athletic black woman who appears to be in college, she's wearing a blue sports bra, jeans hugging her nice looking rear end and long legs, a pair of black high top chucks, she has toned arms with muscle showing as well as a toned tummy showing a six-pack abs, she's very beautiful, and sitting alone after walking with a book and a purse. You walk over from behind and slip the mask over her face, holding the mask over her face and has no resistance as she is pulled into the mask and becomes the mask, no one noticed what you did. You smile and look over the mask and put it on, you feel the change happen as you age to 22, you gain knowledge of the person you will become, your skin is getting darker and stopping at a light/medium skin tone, your body is slimming down and gaining muscle your waist is shrinking from a 38 mens to a womans size 4, your belly fat is gone, as well as most of your fat in your body, skinny with muscle is building all over. Your body hair is gone from below your neck line as well as your facial hair, your smooth, and your muscle is showing as your wearing her/your clothes, male clothes are gone as you walk around to the other side of bench to sit down your hair is now black and at your shoulders straightened, you feel a calm wash over you, and smile as your new life and adventure awaits, as your now Evelynn Marie Spencer, age 22 a er nurse at the local hospital, and bi sexual, you will do fine you smile to youself</span></div></div>",
            "created":1375506000,
            "id":1639712,
            "title":"black"
        },
        "13121":{
            "author_id":"mrwhite.13",
            "author_name":"mrwhite.13",
            "choices":[
                "goes as planned",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Now sitting, opening your purse, you look and find your blackberry and check for any texts, and answer them as if you know what's going on. Then it rings, you answer, a change in your schedule you have this weekend off, \"sweet\" in your head, it's Friday, a weekend off, right after you fire off a text to Maria, your on/off lover, about having the weekend off, she answers back with getting together tonight, and you have a date tonight, you feel yourself getting wett at the thought of later</span></div></div>",
            "created":1388293200,
            "id":1716622,
            "title":"it works and fun is to be had"
        },
        "1313":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "asian ",
                "latina",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are some more choices.</span></div></span></div>",
            "created":1366693200,
            "id":1577279,
            "title":"more"
        },
        "13132":{
            "author_id":"mrwhite.13",
            "author_name":"mrwhite.13",
            "choices":[
                "you are her for now or longer",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Looking around you see a beautiful latina, she is wearing dark blue scrubs, white socks and white leather sneakers, a medium black coach purse is by her side, she looks to be in her early 20's possibly late teens, and with an athletic build, she is texting on her blackberry, she takes off her glasses, looking around she sees a few hot girls and a few guys, thinking she's just right for you to become. You are smiling as you walk over unnoticed and slip the mask on her face, and look as she is gone and only the mask is in your hand, you slip the mask on and the feeling over takes you as your new height is now 5'7\", your body is energized as muscle is overtaking you your going to be in real good shape, you feel your abs form into a 6-pack, your arma and legs are toned with muscle, your feet shrink, your skin is now soft and smooth from below your neck. Your hair is now shoulder length black with bangs, your face is now hers including her memories and who she is, who you are now. Your clothes are gone, your now in a brown thong, and a black sports bra, as you are in the same dark blue scrubs, socks and white converse sneakers. <br>\r\n<br>\r\nLooking and finding your purse you pick it up, you are now Amilie Linette Sanchez an Nurse in the local emgency room age 23, and have a good life ahead of you for now</span></div></div>",
            "created":1378184400,
            "id":1656923,
            "title":"latina"
        },
        "131321":{
            "choices":[
                "Head to Amile's home ",
                "Head to Amile's work "
            ],
            "content":"<div class=\"\"><div> <span>You exit the mall, pausing for a moment taking a deep breath and letting it out, a huge smile spreading across your face. You use Amile's memories to remember where you parked, finding a slightly used Ford truck, your smile growing even wider as you take the keys out of your purse and unlocking the car door. You start up the car, looking in the rear view mirror and seeing Amile's hazel eyes, her tanned skin, kissable lips and high cheekbones framed in her black hair as your own. </span></div></div>",
            "created":1383627600,
            "id":1689760,
            "title":"The New Miss Sanchez "
        },
        "1313211":{
            "author_id":"mrwhite.13",
            "author_name":"mrwhite.13",
            "choices":[
                "she has a good nap, when her girlfriend calls for more fun",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Once home, she gets out, looking at her ford, and says to herself why would I drive a ford, a sub par truck, she decides she wants and should drive a newer truck, maybe a used Chevy Colorado crew cab, Amilie goes to her home and checks out her place it's modest, she's off for 2 days and takes off her clothes to see her body in the first person, looking at who she is and smiles, gently touching her toned in shape body, she's turned on and get off with finding her toys, once she's sated she takes a quick nap.</span></div></div>",
            "created":1383886800,
            "id":1691274,
            "title":"Head to Amile's home "
        },
        "13132111":{
            "choices":[
                "Dress up and wait for Christie ",
                "Make dinner"
            ],
            "content":"<div class=\"\"><div> <span>You hear your cell phone ringing in the other room as you rush out of your bedroom into the small living room to answer it. <br>\r\n<br>\r\n\"Hello?\"<br>\r\n<br>\r\n\"Hey, babe.\" Suddenly a flashback enters your mind, Amile is dating another Nurse named...Christie. You remember the very awkward sexual tension between you two at work, the first date that was so amazing and the the first time you feasted your eyes on the toned, sexy form of Christine. You were a beautiful woman in a relationship with another beautiful woman! You feel relieved, happy even as you find yourself comforted in Amile's emotions, feeling safe and even walking on air at the very sound of Christie's voice. <br>\r\n<br>\r\n\"Hey, when are you getting off work tonight?\" You ask, excited to see your new significant other, talk and if the situation arises relieve this massive sexual urge you have right now. <br>\r\n<br>\r\n\"I'm heading home now babe. They sent everyone home, it's a pretty quiet night tonight. They'll call me in if they need me.\" You nearly jump up, a strange reaction for someone you've never met before. <br>\r\n<br>\r\n\"I'll leave the door unlocked.\" <br>\r\n<br>\r\nYou walk back into the bedroom and think to yourself, should I dress up so whenever Christie comes home I can seduce her? Or should I make dinner and maybe talk for a bit before possibly getting it on?</span></div></div>",
            "created":1383886800,
            "id":1691377,
            "title":"One for my Baby "
        },
        "13133":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "indian ",
                "native american"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is the last choices.</span></div></span></div>",
            "created":1366693200,
            "id":1577280,
            "title":"more"
        },
        "131332":{
            "choices":[
                "The Transformation ",
                "Something Else "
            ],
            "content":"<div class=\"\"><div> <span>You enter the mall scouting for possible subjects to try the mask on and find a late teens maybe early 20's woman sitting alone in the corner reading a book. She is of Native American stock, her black hair in a ponytail, black glasses on her beautiful face. She is dressed rather modestly, with a blue jean skirt, although her powerful calf muscles are still able to be seen. Along with her skirt she is wearing a t shirt and vest, as she is probably trying to underplay her appearance once again, although her natural beauty still shines through. Despite looking around as several other candidates, you found yourself still drawn to this woman and you quietly sat down with a clear line of sight to her. <br>\r\nAs she got up, you followed her into a employee hallway of the mall, and you try to quickly rush behind her as quietly as possible forcing her face into the mask as she tried to scream, then it a muffled scream, then nothing as her face became nothing more than a mask in your hand. You then continue walking down the hallway trying to act as normally as possible as you luckily find the unoccupied woman's restroom. You duck into a stall locking it behind you. </span></div></div>",
            "created":1383627600,
            "id":1689767,
            "title":"Native American"
        },
        "1313321":{
            "choices":[
                "Out in the world ",
                "Something Else "
            ],
            "content":"<div class=\"\"><div> <span>You breathe in slowly preparing for the process which you think would be instantaneous. <br>\r\n<br>\r\nIt isn't.<br>\r\n<br>\r\nAnd for a moment you find yourself feeling rather silly, sitting in a ladies restroom with a mask on your face, still very much a man. And for a second you say to yourself \"screw this,\" and attempt to pull off the mask, but you find that the mere mask that seemed to be easily detachable not even a few minutes ago has now latched itself to your face. You pull and begin feeling numbness down your back and left arm. \"Maybe if I continue to struggle it'll speed up the process,\" you think to yourself continuing to make an effort to tug at the mask. Soon your entire body is numb and you feel as if you are dozing off at one moment, then feel the adrenaline pumping through your veins as your heart is beating double time through your chest. <br>\r\n<br>\r\n\"Wait? What? Ahhh!,\" is the thought that rushes through your mind as you gain your bearings realizing that was the last thing your victim thought before you became her. Bethany.....Bethany Crowe is the name that resounds through your mind as you remember a life lived on the reservation, your loving family that struggled to make ends meet, your moving out here and working at the local library. Then you think, my body!<br>\r\n<br>\r\nYou look down and find the breasts that had hidden were much larger than what you expected, you feeling the bra struggling to restrain them under your shirt and vest. You feel the your heart thumping quickly as your hands go down your body, feeling the hairless, muscular legs that are now yours. Your long black hair still tickling your shoulders even as it is fashioned in a bun. You feel your soft, tan skin, your muscular legs flexing under you as you stand up and prepare to leave. <br>\r\n<br>\r\nYou catch a glimpse of your new appearance, the naturally beautiful face hidden under a pair of glasses. You smile and realize you are now a woman who could easily stop traffic if she did not hide her beauty. </span></div></div>",
            "created":1383800400,
            "id":1690854,
            "title":"The Transformation "
        },
        "132":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "the mother",
                "teenager",
                "the tanner or the lifeguard"
            ],
            "content":"<div class=\"\"><div> <span>you decide on the pool so you walk there.you arrive at the pool. you look around and spot a few potential targets.the first target was a mother with her child. she had brown hair blue eyes. she had h cup breasts and a average ass/hips. she was wearing a yellow bikini with a necklace with a ruby cross on it and a pair of diamond earrings. the second potential target was a teenage girl with black hair green eyes. she had e cup breasts with an huge ass.she was wearing a blue bikini with a pair of huge hoop shaped earrings. the third target was a women tanning she had blond hair and red eyes. she had a f cup breasts with and ass/hips that are proportion with her breasts to form a hourglass shape. she is wearing a black bikini that is barely containing her breasts.the final target the life guard she had red hair grey eyes. she had e e cup breasts. wearing a white bikini with brass necklace and a pair of sapphire earrings. you wonder who to target.</span></div></div>",
            "created":1366347600,
            "id":1574787,
            "title":"pool"
        },
        "133":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "nude",
                "normal",
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide to go to the beach but what type of beach will it be?</span></div></span></div>",
            "created":1366606800,
            "id":1576682,
            "title":"beach"
        },
        "1331":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "the mother",
                "the little girl",
                "the tanner or the lifeguard"
            ],
            "content":"<div class=\"\"><div> <span>you decide on a nude beach so you make it the beach. you walk around and you see a few things. the first thing you see is a very sexy women sun tanning. she has blond hair with red highlights hair but you can't tell her eye color due to her sun glasses. she had a f cup breasts with a nice ass and hips. the thing you see is a little girl with her mom walking on the beach.the mother had red hair with blue eyes.she had an e cup breasts and her ass and hips filling out making her have a hourglass shape. the mother was wearing a necklace with a heart on it and two big gold hoop earrings. the little girl you can tell really started her breast development early as she has c cup breasts and you see more curve development around her body. the little girl had her blond hair with red ends in pigtails with red eyes. the final thing you see is the life guard on duty she had black hair green eyes. she had a h cup breasts with a shapely ass and hips. she had a pare of peal ear ring on. now you ponder who to go after </span></div></div>",
            "created":1366606800,
            "id":1576814,
            "title":"nude"
        },
        "135":{
            "author_id":"kdude",
            "author_name":"kdude",
            "choices":[
                "Put the mask on Lea",
                "Wait for now",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You are totally stumped for who to use this mask on. You definitely want to try being a chick, but you don't want to feel up your own sister's body. You needed to find a better subject to impersonate with the white mask. After a few hours of thinking, you decide to head over to your best friend Andre's place. Andre was your smartest friend by far. If anyone could think of a good use for the mask, it was him.<br>\r\n<br>\r\nBut when you drove to Andre's house, you found he was already expecting company. You had to park across the street when you saw his girlfriend Lea park in your usual spot in front of the house. You had nothing against Lea. In fact, you were the one who set her up with Andre. That was back when Megan was still dating you. Back when she's still return your calls. But now you were single again. And the sight of the happy couple made you remember what you lost a few months ago. Lea was a stunner. She was team captain for the Volleyball team and definitely had the body to prove it. Her well-tanned skin was earned from weeks of practice, not any cancer salons. Her brown hair, once long and epic, was now short and really framed her sexy 'come hinter' smiles she'd shoot your best friend when they thought you weren't paying attention.<br>\r\n<br>\r\nLea saw you park and walked to greet you.<br>\r\n<br>\r\n\"Hey you!\" Lea beamed her pearly whites, \"Andre didn't say anything about you joining our action movie marathon! I hope you brought enough booze.\"<br>\r\n<br>\r\n\"I brought something special.\" You smirked, thinking of the white mask in your backpack. \"I'm sure Andre will love to see it.\"<br>\r\n<br>\r\n\"Oh, is it a birthday present?\" Lea asked. \"I'm still lost on what to give him. It's a week away and I haven't ordered anything. Some girlfriend I make.\"<br>\r\n<br>\r\n\"I think you make a fine girlfriend.\" You laugh. \"At least Andre's raving adorations of you gave me that sort of impression.\"<br>\r\n<br>\r\n\"You know it!\" she teased in reply. Andre was a huge sap, but that's why you both loved him so much. \"Shall we go in?\"<br>\r\n<br>\r\nYou thought of the mask in your backback. You could use it right now to become Lea or trick Andre into becoming Andre. Or you could wait to show Andre &amp; Lea how it worked.</span></div></div>",
            "created":1366261200,
            "id":1574641,
            "title":"Best Friend's House"
        },
        "14":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "movies ",
                "anime/ manga",
                "video games",
                "comics and cartoons",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide on fictional characters from anywhere. now where will they come from?</span></div></span></div>",
            "created":1366261200,
            "id":1574572,
            "title":"fictional charaters"
        },
        "141":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "scooby doo(live action)",
                "pirates of the carribean",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide on movies but which ones?</span></div></span></div>",
            "created":1366261200,
            "id":1574575,
            "title":"movies "
        },
        "1411":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "velma",
                "daphnie or mary jane",
                "shaggy with a female body form neck down from the second movie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide on the live action scooby doo's. which character will it be </span></div></span></div>",
            "created":1366261200,
            "id":1574578,
            "title":"scooby doo(live action)"
        },
        "14111":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "explore your new body or find someone to have sex with",
                "reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>you decide on Velma so you pop the scooby doo DVD in you player. you forwarded to then paused at the part where Velma just regained her body from the monster. you hold the mask up to the screen right on Velma's face which caused the mask to flash which blinded you. when the light form the flash died down you see the mask turn into Velma's face and she was not on the screen anymore. you then put the mask on which made you entire body feel a huge jolt of multiple sensations going through it. you feel you cloths change into the cloths Velma had on at that part of the movie. next then that happens is the mask and cloths glow which envelopes you.you feel your entire body changing with bones cracking, muscles dissolving and remolding, you dick destroyed with a brand new vagina replacing it, and finally you feel a huge amount of pleasure come out of all the other sensations as you grow Velma's d cup breasts on your chest which you feel the weight they carry. when the light dies down you go over to the bathroom and see Velma's face and body greeting you sight. you then cup you breasts with a smile of pleasure as you feel their softness with a hint of firmness as the pleasure of grabbing them washes over you body. you now wonder what to do next.</span></div></div>",
            "created":1366693200,
            "id":1577340,
            "title":"velma"
        },
        "141112":{
            "choices":[
                "Force yourself to dismask.",
                "Decide you're Velma for life."
            ],
            "content":"<div class=\"\"><div> <span>Thrilled as you are with being the beautiful Velma, you find yourself thinking like her. Not like the actress who played her -- Lisa? Linda? some Italian sounding name you can't recall -- but like Velma, as if Velma is real. You take off your glasses and examine them: you really need them, and they'd be thicker but the lenses are a high-index plastic...<br>\r\n<br>\r\nYou didn't know about that kind of lenses when you were the usual you. You were an ignorant kid. Now you're smarter and better-read and, thanks to Hollywood making you sexy and casting a fantastic-looking actress as you, a very beautiful woman.  And you prefer being who you are now, Velma Dinkley. A real, live Velma Dinkley.</span></div></div>",
            "created":1374901200,
            "id":1635141,
            "title":"Velma's self-control"
        },
        "1411122":{
            "choices":[
                "a local address.",
                "somewhere far away."
            ],
            "content":"<div class=\"\"><div> <span>You say, aloud but softly, \"I am Velma Dinkley. For the rest of my life.\"  Your Velma voice gives you a thrill. It's a little pedantic (before becoming Velma you wouldn't have known the word) but entirely that of an alluring woman.<br>\r\n<br>\r\nOn the floor near you is your purse.  It wasn't there moments ago. The boy you used to be wouldn't have recognized it as your purse, or even thought about whether you carry a purse or not. Perhaps your declaring your new identity out loud brought your purse into existence.  You pick it up and get out your wallet and look at your driver's license. Your Velma face looks back at you from the picture.  The address on the license is</span></div></div>",
            "created":1377752400,
            "id":1653557,
            "title":"Decide you're Velma for life."
        },
        "14111221":{
            "choices":[
                "on a street across town.",
                "the address where you are now."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So despite your transformation into Velma Dinkley you still live in the same town. The address on your driver's license is</span></div></span></div>",
            "created":1377752400,
            "id":1653563,
            "title":"a local address."
        },
        "141112212":{
            "choices":[
                "try to become your original self again.",
                "go see if the others are home."
            ],
            "content":"<div class=\"\"><div> <span>You realize that you still live here as Velma, and now realize that this is still your bedroom, but it's changed to be a bedroom suitable for your Velma self!  Also that you live here with Fred, Daphne, Shaggy, and Scooby-Doo, and that they used to be members of the family you had as a boy!<br>\r\n<br>\r\nFred used to be your Dad Dan, and Daphne your Mom Jenna. Shaggy used to be your sister Sarah, and Scooby your sister Carly.  You don't know how you know this, but you're sure of it.  You also have the impression that they're happy being who they are now, just as you're happy being Velma Dinkley.<br>\r\n<br>\r\nYou wonder if this is what your former family really wanted. Even if they truly are happy this way, have they been magically brainwashed into that?  Have you been?  After a bit of thought, you</span></div></div>",
            "created":1377752400,
            "id":1653619,
            "title":"the address where you are now."
        },
        "1413":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "who framed roger rabbit",
                "lord of the rings",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are more movies</span></div></span></div>",
            "created":1366347600,
            "id":1574955,
            "title":"more"
        },
        "14131":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "jessica rabbit",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you chose who framed roger rabbit now which character will it be?</span></div></span></div>",
            "created":1366606800,
            "id":1576842,
            "title":"who framed roger rabbit"
        },
        "141311":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "You try it out and become a cartoon sex symbol. Wow!",
                "Before you can your sister Sarah bursts in being bratty as usual."
            ],
            "content":"<div class=\"\"><div> <span>Seriously, who else? Eyeing a photo in an old magazine of a semi-photorealistic version of Jessica you just can't resist and put the mask down ontop of the picture. For a moment you bite your lip, waiting for some glorioius special effects or something, but nothing happens.<br>\r\n<br>\r\n\"Dang! What a waste of t...\"<br>\r\n<br>\r\nSuddenly the mask twitched, seemed to twinkle, then the image of Jessica was sucked off the page, leaving the scene on the picture clear, as if Jessica had never been in the frame. You'd expected there to be a white outline or something there, but there's no trace Jessica was ever in the image!<br>\r\n<br>\r\nWith an odd wriggle the mask shifted, twisted almost, and suddenly you were looking at a perfect image of Jessica Rabbit's face, with eye and mouth holes and no hair, but looking just like her!<br>\r\n<br>\r\nNervously you pick the mask up and turn it over. The inside is still pure white, but the outside looks exactly like Jessica. Can this really work? Would you really turn into her if you put it on?</span></div></div>",
            "created":1368853200,
            "id":1592534,
            "title":"Jessica Rabbit"
        },
        "1413111":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "A black smudge appears over your naked chest. Toon Censors!?! Argh!",
                "Stripping you play with your agonizingly sexy body. But do Toon physics apply?"
            ],
            "content":"<div class=\"\"><div> <span>Licking your lips nervously you lift the mask, the lifelike rendition of Jessica rather eerie with the holes for eyes and mouth. You turn it over a few times in your hands, putting off the obvious. I mean, seriously this can't work... can it?<br>\r\n<br>\r\nSlowly, almost flinching away from it, you lift the mask to lay the white inside against your face.<br>\r\n<br>\r\n\"Here goes no...\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nSlowly you blurrily recover, shaking your head and feeling rather dizzy. You're leaning against the wall and feel a little numb, like you're whole body went to the dentist or something. Gradually it begins to recede and you feel your extremities again. Your vision is a little blurred, but that seems to come back quicker. Shakily, feeling rather odd, you stagger over to your wardrobe mirror... and goggle.<br>\r\n<br>\r\nYou are Jessica Rabbit! The likeness is stunning!<br>\r\n<br>\r\n\"Oh... My... God!\" you gasp, and are amazed to hear Kathleen Turner's voice too. Even your clothes are gone, changed into Jessica's glittery red, one piece dress that literally seems painted onto your anatomically impossible, overly sexy body. Speaking of which...<br>\r\n<br>\r\nLong, nervously twitching fingers that are unfamiliar to you, reach up at your command and trace a line across the massive bulges that stick out in front of you. Yup, you can feel them! Your sense of touch as almost completely returned now and they do feel magnificent! Those graceful fingers trace slowly down, following the shape of your chest, abs, impossibly thin waist, and overly curvy hips.<br>\r\n<br>\r\n\"Wow!\" you whisper hoarsely. \"Just... wow!\"<br>\r\n<br>\r\nYou blush at the thought of what you've become and can't resist. You slide fingers into the top of your dress and gently pry it away from your hefty bosom.</span></div></div>",
            "created":1368853200,
            "id":1592626,
            "title":"Meet Jessica."
        },
        "14131112":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "No Toon Physics, though you are far more stretchy than a normal human.",
                "Oh yes, but now to find out which of those things works!"
            ],
            "content":"<div class=\"\"><div> <span>It takes you ten heartstoppingly agonizing minutes to peel that dress off yourself with you practically drooling into your mirror as you uncover yourself. Then you spend another ten minutes just gaping at it from every angle, unable to even bring yourself to touch it. Finally you get the courage and find the skin soft and yielding as real skin, but overly... 'boingy'. definitely toon like... but how far does that go?<br>\r\n<br>\r\nToons are different. They defy the laws of physics in so many ways. Basically things work as long as they are thematically correct. If it fits the 'plot' and the character it happens. Toons regularly ignore gravity (the 'running off the cliff shtick'), confuse illusions with reality (painting a tunnel on a wall shtick and making it real), moving at impossible speeds (ie Speedy Gonzalez or Road runner), survive being flattened into paste by heavy objects with little inconvenience, regularly can change appearance (the 'zipper gag' shtick), and of course can fit impossible things into small places (like pulling huge mallets out of tiny handbags or swallowing huge items with barely a bulge showing), not to mention dozens of other impossible things they can do.<br>\r\n<br>\r\nCould it be possible that any of those work for you now? Could you be effectively invulnerable? Defy gravity? Be a real quick change artist? Hmm, if it DOES work it'd be dependent on Toon laws of Physics. Things only seem to work if it seems... well, either funny or 'right'. Like it was meant to happen in the script? Hmm, you aren't really sure of the details but you should try things out at least. You might only look like Jessica, you might not be able to do any of that stuff... or only some of it.</span></div></div>",
            "created":1368853200,
            "id":1592630,
            "title":"Examining possibilities."
        },
        "141311122":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Maybe painting things real? Or perhaps Jessica's super sex appeal?",
                "Could try the Zipper gag, or maybe the huge things in small packages?"
            ],
            "content":"<div class=\"\"><div> <span>It takes quite a few goes standing on the bed, attempting to look straight ahead and walk off the bed, but finally... you look down to find yourself in midair and just can't help yourself. You smile up at yourself in the mirror and give a faint wave, just before falling to the floor. Heh, maybe it only worked because you were about to do the wave at the end to make it funny? You aren't sure. You pick yourself up, rubbing a bruised butt, and wonder what you could try next?<br>\r\n<br>\r\nPainting something and trying to make it real? Hmm, might be dangerous if it even works. Plus you aren't the worlds best artist! Maybe art ability comes with the Jessica character? Who knows!<br>\r\n<br>\r\nThe idea of finding a heavy weight and dropping it on yourself to see if you survive and end up as a human pancake is not one you want to attempt really, but you guess it's an option. Maybe next year sometime.<br>\r\n<br>\r\nSuper abilities like speed that some cartoons do usually are to do with their characters. You doubt you could emulate the Road Runner, but maybe you can come up with something suitable for your Jessica alter ego? What... hmm, you can't sing, but she could. Not sure that really qualifies as a toon power exactly. Maybe sex appeal? In the movie she certainly had guys falling for. Well, mostly Roger, but still... worth thinking about.<br>\r\n<br>\r\nThe zipper gag is definitely something you might be interested in. Then you could literally pull down a zipper and unfold your current skin to reveal whatever you wanted yourself to look like inside. Presto chango! Hmm, you have no clue how to choose what your new form would be even if you could get it to work. Guess just try to focus on an image before you try it?<br>\r\n<br>\r\nLastly, fitting big things into small places. Heh, girls in cartoons often fit giant mallets into their cleavage (OK, that's mostly Anime!), or eat huge meals, or even people, with no sign of them after they're inside. Could you do that?<br>\r\n<br>\r\nYou ponder the possibilities and try to decide.</span></div></div>",
            "created":1369371600,
            "id":1596265,
            "title":"Totally Toon."
        },
        "1413111221":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Paint to reality",
                "Sex appeal."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, you still aren't sure about your skill with a paint brush. On the other hand you really aren't into boys either, even as Jessica... though you could try to see if her sex appeal works on girls? Lesbians anyone?</span></div></span></div>",
            "created":1369371600,
            "id":1596268,
            "title":"Decisions decisions. Paint or sex?"
        },
        "1413111222":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Zipper Gag.",
                "Big things in small places."
            ],
            "content":"<div class=\"\"><div> <span>The Zipper Gag is one you definitely want to try if you can find out how to pick who you turn into... then again, if you do that could you even take the mask off afterwards? Maybe that would stick it till you put the original 'Jessica' suit back on? Who knows?<br>\r\n<br>\r\nThe fitting huge things into tiny spaces is also interesting. Yes, handbags and cleavage is interesting, but there is also the aforementioned mouth, and also other body openings. Oh the possibilities!</span></div></div>",
            "created":1369371600,
            "id":1596271,
            "title":"Decisions decisions. Zipper or swallow?"
        },
        "14131112221":{
            "choices":[
                "another toon.",
                "what seems to be the usual you."
            ],
            "content":"<div class=\"\"><div> <span>Well, you could just as well be another toon in a perfect Jessica Rabbit suit as Jessica herself, so you decide to try the Zipper Gag. Now, where to feel for a concealed zipper pull?  The comic effect might be maximized if your zipper runs from the center of your hairline to your crotch, but it would be a nicely balanced mixture of comical and creepy if it started under your chin and you had to pull off a full Jessica head to reveal the toon beneath. You make sure your clothes and hair are in place -- the Zipper Gag looks best if the toon is perfectly his or her usual self to look at -- and started to feel under your chin with your gloved fingertips. The gloves are so much a part of being your Jessica Rabbit self that they don't blunt your sense of touch in the least.<br>\r\n<br>\r\nThere's an unexpected twinge of pain as the zipper pull pops out of the perfect skin between your chin and your neck, and you give a sexy little gasp. Suddenly you don't want to stop being Jessica Rabbit, but you grasp the zipper pull with your gloved left hand and unzip skin and dress to almost your crotch. You're someone else in a Jessica suit now. With hands gloved with that suit, you pull the elastic and hollow Jessica head off, revealing:</span></div></div>",
            "created":1374901200,
            "id":1635138,
            "title":"Zipper Gag."
        },
        "14133":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "starwars",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more.</span></div></span></div>",
            "created":1366606800,
            "id":1576828,
            "title":"more"
        },
        "141332":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Choose Zootopia characters",
                "Choose another movie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You did remember that Disney animated movie you sa yesterday:Zootopia.You loved the story and the characters</span></div></span></div>",
            "created":1460091600,
            "id":2129693,
            "title":"more"
        },
        "1413321":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Choose Judy Hopps",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character then?Which one do you want to turn into?Maybe Judy Hopps,the optimistic rookie bunny cop?</span></div></span></div>",
            "created":1460178000,
            "id":2130097,
            "title":"Choose Zootopia characters"
        },
        "14133212":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Choose Nick Wilde",
                "Pass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Nick Wilde the con artist fox?</span></div></span></div>",
            "created":1460178000,
            "id":2130099,
            "title":"No thanks"
        },
        "142":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "Bleach",
                "Naruto",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide on anime/ manga. so what will be the lucky series </span></div></span></div>",
            "created":1366347600,
            "id":1574957,
            "title":"anime/ manga"
        },
        "1421":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "orihime",
                "rangiku",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide on bleach characters now who will it be? </span></div></span></div>",
            "created":1366606800,
            "id":1576650,
            "title":"Bleach"
        },
        "14213":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "yoruichi or kukaku shiba",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577394,
            "title":"more"
        },
        "142132":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "nelliel or tier",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577395,
            "title":"more"
        },
        "1421322":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "nemu or milla rose",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577397,
            "title":"more"
        },
        "14213222":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "zampacto spirts?",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577398,
            "title":"more"
        },
        "142132222":{
            "author_id":"everton",
            "author_name":"mr. r",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Rukia?</span></div></span></div>",
            "created":1367298000,
            "id":1581575,
            "title":"more"
        },
        "1422":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Naruto",
                "Sasuke",
                "Other secondary characters"
            ],
            "content":"<div class=\"\"><div> <span>You noticed a manga book on your desk near your bed.It was a copy of Naruto vol 72,The final Naruto volunme.You ask yourself:Maybe it would be awesome to be a ninja.To be one of the characters from the manga.Maybe with their powers,you can make the world of better place.But you start to think again.Which character should I turn into?</span></div></div>",
            "created":1460091600,
            "id":2129692,
            "title":"Naruto"
        },
        "14222":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Young Sasuke(Part 1)",
                "Post part 2 Sasuke(Chapter 699)"
            ],
            "content":"<div class=\"\"><div> <span>You start to think which character to turn into while looking through the pages of the final Naruto volume.You look through the first pages of chapter 699,and read the part about Sasuke Uchiha leaving the village once again,but this time for a journey of redemption.You thought about it.\"Maybe it would nice to be in Sasuke's shoes.But you started to think about which version of Sasuke you wanted to become.</span></div></div>",
            "created":1460178000,
            "id":2130107,
            "title":"Sasuke"
        },
        "142222":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "It slammed on your face",
                "Your mom calls you.Dinner is ready"
            ],
            "content":"<div class=\"\"><div> <span>You decide to become the post part 2 Sasuke.He was the same age as you and if his mind was to take over yours,you didn't want to be corrupted by his former ideals of revenge and hatred.You took the mask and focused.<br>\r\n-----------------------------------------------<br>\r\nMeanwhile,in another dimension,most precisly the Land of Fire in the world of the Shinobi,a 17 year old Sasuke Uchiha had started his journey of redemption around the world of the shinobi.It's been a day since he left the village and said goodbye to his firends.He suddently felt Dizzy.\"Maybe I should rest abit.\" He said to himself.He sat down near a tree,but noticed his right hand becoming transparent.His whole body was starting to vanish.He lost conciousness before to fully dissapear.<br>\r\n-------------------------------------------<br>\r\nYou looked at the transformed mask.The once white mask was now different.It now displayed Sasuke's facial features as well as having his black bangs framed on the forehead and each sides of the cheeks.<br>\r\nThe mask was ready,you brought it closer to your face and...</span></div></div>",
            "created":1460178000,
            "id":2130121,
            "title":"Post part 2 Sasuke(Chapter 699)"
        },
        "1422221":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "You become yourself again.",
                "You now hold the mask...of your former self?"
            ],
            "content":"<div class=\"\"><div> <span>The mask slapped on your face,as if it had a mind of it's own.The mask now on your face you felt it starting to merge with it.The mask itself became flesh and the frammed hair became organic and was now over your eyes.Your eyes changed from green to onyx,but the left one changed again becoming purple with ripple patterns:The familiar Rinnegan.The back of your head changed as well,the rest of your hair turining black and growing spikier.The rest of your body was now affected by the transformation,your bone and muscle structure rearanging themselves and your skin tone turning paler.Your clothes howrever were spared by the transformation.When it ended.You looked at your new self in the Mirror.But it wasn't you anymore,but Sasuke Uchiha,in your clothes.<br>\r\n\"Awesome\" you said to yourself,only to notice that your voice changed as well.<br>\r\nYou hear your mom calling you downstairs,telling you that dinner was ready.\"Better remove this mask.\" you say to yourself.<br>\r\nAs you sucessfully remove the Sasuke mask...</span></div></div>",
            "created":1460178000,
            "id":2130127,
            "title":"It slammed on your face"
        },
        "14222212":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Telling your family about your new self.",
                "Keep quiet..for now"
            ],
            "content":"<div class=\"\"><div> <span>The touch the new face and feel it reverting to a normal mask and the rest of your body turing back to normal,but when you hold it once again..you notice something odd.The mask changed and now features your normal facial features and normal borwn hair framed on it,You looked at yourself in the miror,only to notice that you were still in Sasuke's form.What just happened? Did putting on the Sasuke mask,reversed your real and disguised self?IYou felt Sasuke's personality and memories sharing spaces with your own in your mind.<br>\r\nIt was official,you were now stuck as Sasuke,body and soul,while your real self was now a mask,that you could only use as a secret indetity for the outside world,like a super hero.You heard your mom call you again.You put on the mask of was once you and it changes you into your real self once again.You head for the dinning room,while thinking about what to do.</span></div></div>",
            "created":1460178000,
            "id":2130132,
            "title":"You now hold the mask...of your former self?"
        },
        "142222121":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Of course,despite the new you,you are still our son",
                "I think it's time you should know about when we found you."
            ],
            "content":"<div class=\"\"><div> <span>During dinner time,you were lost into thoughts.You had to tell your parents about this new form.You woudn't keep that secret from them,even if they were your adoptive parents.<br>\r\n\"Is something wrong? You didn,t eat anyhting.\" said Jenna,your adoptive mother.You sighed.\"Well,do you know about that mask my birth parents gave to me?\"<br>\r\n\"We do,when we found you,we found this box as well.\" said your father.You explained about the mask and it's power that you tried it.\"It succeded,but when I removed it to return back to normal,it went backwards.My true self is the mask now.\"<br>\r\nYou grabbed the corner of your face where your mask should be and started to pull it.Your face turned to a plastic mask once again and demerged from your new face as you turned back to your new self as Sasuke Uchiha.<br>\r\nYour familiy looked shocked,and confused,but Sarah and Carly looked in awe.<br>\r\n\"There you have it.\" you said with Sasuke's voice.\"Do you still acept me as your son,despite this new form. Your father looks at you and says...</span></div></div>",
            "created":1460431200,
            "id":2131608,
            "title":"Telling your family about your new self."
        },
        "1422221211":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Go back to your room and rest",
                "Train in using your newly gained powers."
            ],
            "content":"<div class=\"\"><div> <span>\"That mask might have changed you perminantly,but insdie,you're still our son.\" said your mother.\"You really mean it?\" you asked.\"Of course we do,and so do I.\" said your father.\"But what about when I go outside? I can't be seen like this.\" you said.\"Well,you changed back into the former you when you putted on the mask,right? You can use that.\" said your father.<br>\r\nYou nodded.\"Thanks.\"<br>\r\nAs you went back to eat,while in your new form,you thought of what to do afterwards.</span></div></div>",
            "created":1460687040,
            "id":2133081,
            "title":"Of course,despite the new you,you are still our..."
        },
        "1422221212":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Use the portal and go to the world of the shinobi",
                "Stay home for awhile.You are my family after all."
            ],
            "content":"<div class=\"\"><div> <span>\"Son,I think it's time you should know about when we found you.\" said your father.After dinner you followed him in his laboratory room.He led you to what seemed like a large portal.\"17 years ago I've been working on this \"dimensional portal,believing that it was possible to travel through other worlds.I failled any time,until one day,the door opened and we found a baby boy,with a box near him,and a letter attached to it.It explained that due to what happened in your original world,you were sent here by your birth parents for safety,and that your original form was sealed in this white shape shifting mask,while you were in the appearence we found you.\" he explained.\"You must have though of your original self.That's why your identities switched with the mask when you wore it.\"<br>\r\nYou looked shocked.\"I just though he was a fictional character,from a fictional world!\"<br>\r\n\"I never thought it could be real,let alone I could be the real Sasuke Uchiha.\" you said.<br>\r\n\"So,whatt will you do now son?\" your father asked.</span></div></div>",
            "created":1460686620,
            "id":2133078,
            "title":"I think it's time you should know about whe..."
        },
        "142222122":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "You read the letter,which reveals the truth",
                "Carly comes inside and catches you in your new form."
            ],
            "content":"<div class=\"\"><div> <span>During dinner time you thought about taking and revealing your new self to your parents but decided against it.\"Sweetie,are you alright?\" your mother asked.\"You barely touched your food.\" \"I'm not that hungry mom.\" you lie.\"And I'm fine.\"you added,before starting to eat again.After you finished and got up,returning to your room,your mother stopped you once again.<br>\r\n\"Do you want some dessert I made a chocolate cheesecake,your favorite.\" she said.<br>\r\n\"No thanks mom.Don't have a sweet tooth.\" you replied.<br>\r\nIs was odd.Usually you would have acepted and would have eaten two pieces.But you were becoming less like yourself.<br>\r\n---------------------------------<br>\r\nOnce back in the room,you sat down and started to think about what happened.Wasn't that mask supposed to transform you,and not turn the real you into the mask while your self became your transformed self.<br>\r\nThe only way to find one was to remove the mask once again.<br>\r\nYou put an hand on your face once again as you pull it.It turns into a mask once again and you turn into Sasuke,but this time,you felt like your personality was sucked toward the mask and was replaced with the one of your new form,Sasuke's memories re emerged in your mind and this time,your clothes transformed.You now wore a blue shirt with a large collar and the Uchiha crest on the back,black pants,sandals,a kunai and shuriken bag and your old Konoha headband on your belt.You put the mask on the table and grab the small box which contained it.There was a letter inside.You decided to read it.</span></div></div>",
            "created":1460178000,
            "id":2130267,
            "title":"Keep quiet..for now"
        },
        "1422221222":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Cast a genjutsu to make her forget.",
                "Explain to her."
            ],
            "content":"<div class=\"\"><div> <span>As you were about to read the letter,you hear a familliar voice.<br>\r\n\"Big brother? You're really Sasuke?!\" You turned to come face to face with Carly,your little sister.She even noticed the mask.\"That's so cool!\"<br>\r\nThis is bad.What will you do now?</span></div></div>",
            "created":1460178000,
            "id":2130404,
            "title":"Carly comes inside and catches you in your new ..."
        },
        "14223":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Let try it out",
                "Choose another character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Madara Uchiha? One of the vilains in the series?Isn't that risky?</span></div></span></div>",
            "created":1460178000,
            "id":2130269,
            "title":"Other secondary characters"
        },
        "142231":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "It slammed on your face on it's own.",
                "Your dad enters the room."
            ],
            "content":"<div class=\"\"><div> <span>You search though your entire collection of Naruto manga for the perfect character to turn into.One of the book drops on the floor and opens at a certain page.<br>\r\nYou pick up the book,which is vol 59 of Naruto and it reveals the first appearence of a resurected Madara Uchiha.<br>\r\nYou started to think about it.Sure Madara was powerful,but you feared to lose control if you turned into him.Howrever you decided to take a chance.<br>\r\nYou grabbed the mask and putted over the page showing Madara.<br>\r\nThe mask started to glow.Strangely,the image of Madara vanished from the page.<br>\r\nThe mask started glowing showing that it transformed.It now represented Madara's face,with his ebony bangs framed on it.<br>\r\nYou signed and slowly put the mask on your face.</span></div></div>",
            "created":1460178000,
            "id":2130274,
            "title":"Let try it out"
        },
        "1422311":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Remove the Madara mask before it's too late.",
                "Don't remove the mask and fully become Madara"
            ],
            "content":"<div class=\"\"><div> <span>The mask slammed on your face,as if it had a life and mind of it's own.You try to remove it,but it stayed glued to your face.<br>\r\nIt slowly merged with your face as a familiar voice was heard in your mind.<br>\r\n\"Why are you reisisting? You are the one who summoned me in this realm.Trapped me in this mask,to be my host.\" said the voice of Madara Uchiha.<br>\r\n\"Let the merge be complete.We will be one.You will gain power.And I will gain a new body.Be thankful that will allow you to keep a part of your will.\"he said.<br>\r\nThe transformation continued anf the mask turned to flesh.He bangs bacame soft and organic and the rest of your hair on the back on your head turned black as the night and grew,until they were long and spiky,reaching your back.<br>\r\nYou felt every bone in your body cracking and changing,making you grow.Muscle structure rearanged itself,making you muscular then before.<br>\r\nYour clothes changed.You now wore blue robes  with an large collar and the Uchiha clan's crest on the back,red armor on your chest,over your shoulders and legs,and a scythe and gunbai fan materialised on your back.<br>\r\nYour eyes first turned from green to onyx black.As the transformation ended,you looked at your new self.<br>\r\nYou were now Madara Uchiha,in the flesh.\"So,that's what this mask can do.\" you said,only to notice that your voice had changed,matching the one you heard in your mind earlier.<br>\r\nUnfortunatly,the changes started to affect your mind.You started to reject your true self and embrace Madara's ideals and power.It was starting to corrupt you.What will you do now?</span></div></div>",
            "created":1460178000,
            "id":2130393,
            "title":"It slammed on your face on it's own."
        },
        "14223112":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "You went to meet your mother in the kitchen.",
                "Ignore your mother and head in the living room instead."
            ],
            "content":"<div class=\"\"><div> <span>\"Why should I remove that mask and become my weaker former self again?\" you said.\"That power...\" you looked at your new self in the mirror.Your eyes turned into Madara's familliar Eternal Mangekyo Sharingan.But all of this was interupted by your mother calling you.<br>\r\nSince Madara's own will was stronger,you refused to remove the mask and instead use the transformation jutsu to temporarilly become your former self again.\"Let's see what this world has to offer.\" you said as you headed downstairs,to find your mother.</span></div></div>",
            "created":1460429040,
            "id":2131589,
            "title":"Don't remove the mask and fully become Madara"
        },
        "142232":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Itachi Uchiha,Sasuke's older brother?</span></div></span></div>",
            "created":1481158980,
            "id":2247080,
            "title":"Choose another character"
        },
        "1422321":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "It slamed on your face",
                "Your mom called you."
            ],
            "content":"<div class=\"\"><div> <span>You looked at a page of the manga showing the picture of Sasuke's older brother,Itachi Uchiha.He was your favorite character.You putted the mask on the book.Something strange started to happen.The image of Itachi dissapears from the book and white mask started to change.Itachi's familiar traits formed on the mask:the facial lines over his nose,his ebony bangs framed on the edges of the mask. and the scared Konoha headband.<br>\r\nA unknown force hurged  you to put the mask on.But as you putted it closer to your face...</span></div></div>",
            "created":1481759760,
            "id":2249988,
            "title":"Itachi Uchiha"
        },
        "14223211":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "You take off the mask,reverting to normal.",
                "The mask won't come off!"
            ],
            "content":"<div class=\"\"><div> <span>It slammed on your face.Your felt the material of the mask merged with your face's skin,as it became organic,the black bangs detached and also became organic,hanging over your new face,you now felt the fabic and some of the cold metal of the Knooha headband on your forehead.The back of your hair started to grow and turn black,forming into a ponytail.Your body transformed as well,as your bone and muscle struvture arranged itself,and your clothes changed into Itachi's Anbu uniform.<br>\r\nWhen the transformation ended,you looked at your new body in the Mirror.<br>\r\n\"Have I...really become Itachi?\" you asked,yourself,only to be surprised that you now sounded like him as well.\"This is cool.\"<br>\r\nYour heard your mother calling you ,saying that dinner is ready.<br>\r\n\"Well,better get this mask off.\" you said.<br>\r\nYou reached an hand on your new face</span></div></div>",
            "created":1484494320,
            "id":2263832,
            "title":"It slamed on your face"
        },
        "1423":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "history's strongest discple",
                "pokemon",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366520400,
            "id":1576084,
            "title":"more"
        },
        "14233":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "sekirei or rosario + vampire",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366520400,
            "id":1576086,
            "title":"more"
        },
        "142332":{
            "author_id":"everton",
            "author_name":"mr. r",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Sailor moon?</span></div></span></div>",
            "created":1367298000,
            "id":1581574,
            "title":"Sailor moon"
        },
        "1423322":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok how about Sora no Otoshimono?</span></div></span></div>",
            "created":1368421200,
            "id":1589650,
            "title":"no"
        },
        "14233222":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Eiken? There's plenty of good choices in the Manga.</span></div></span></div>",
            "created":1370494800,
            "id":1605878,
            "title":"Eiken "
        },
        "142332222":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Kampfer/to-love-ru",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What anime/manga?</span></div></span></div>",
            "created":1411880400,
            "id":1863536,
            "title":"Something else"
        },
        "1423322221":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Kampfer",
                "To-Love-Ru"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1411880400,
            "id":1863543,
            "title":"Kampfer/to-love-ru"
        },
        "14233222211":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Fem Natsuru",
                "somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character?</span></div></span></div>",
            "created":1411880400,
            "id":1863544,
            "title":"Kampfer"
        },
        "142332222111":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Explore your body",
                "Find somebody to have sex with"
            ],
            "content":"<div class=\"\"><div> <span>you decide on fem natsuru so you pop in the kampfer DVD in you player. you forwarded to then paused at the part where Natsuru woke up when he noticed he has a female body and heard Harakiri Tora's voice. you hold the mask up to the screen right on Natsuru's face which caused the mask to flash which blinded you. when the light form the flash died down you see that the mask turned into Natsuru's face and she was not on the screen anymore. you then put the mask on which made you entire body feel a huge jolt of multiple sensations going through it. you feel your clothes change into the clothes Natsuru had on at that part of the show. next then that happens is the mask and clothes glow which envelopes you. You feel your entire body changing with bones cracking, muscles dissolving and remolding Natsuru's dd cup breasts on your chest which you feel the weight they carry. when the light dies down you go over to the bathroom and see Natsuru's face and body greeting you sight. you then cup you breasts with a smile of pleasure as you feel their softness with a hint of firmness as the pleasure of grabbing them washes over you body. you now wonder what to do next, when you came to a decision of what to do.</span></div></div>",
            "created":1411880400,
            "id":1863555,
            "title":"Fem Natsuru"
        },
        "1423322222":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Yes, Dragonball Z.",
                "No, more."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Dragonball Z?</span></div></span></div>",
            "created":1439096400,
            "id":2019101,
            "title":"Dragonball Z?"
        },
        "14233222221":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Bulma",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character from the show do you want to test the mask on?</span></div></span></div>",
            "created":1439096400,
            "id":2019102,
            "title":"Yes, Dragonball Z."
        },
        "142332222212":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Chi-Chi?</span></div></span></div>",
            "created":1439096400,
            "id":2019104,
            "title":"More"
        },
        "1423322222122":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Sure",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or how about Videl?</span></div></span></div>",
            "created":1439096400,
            "id":2019105,
            "title":"No"
        },
        "14233222221222":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Definitely.",
                "Definitely not."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Android 18, then?</span></div></span></div>",
            "created":1439096400,
            "id":2019106,
            "title":"Nope"
        },
        "14233222222":{
            "author_id":"videoshards",
            "author_name":"Video",
            "choices":[
                "Yes",
                "Next please!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Highschool DxD?</span></div></span></div>",
            "created":1460264400,
            "id":2131150,
            "title":"No, more."
        },
        "142332222221":{
            "author_id":"videoshards",
            "author_name":"Video",
            "choices":[
                "Rias Gremory",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who it it be?</span></div></span></div>",
            "created":1460264400,
            "id":2131153,
            "title":"Yes"
        },
        "142332222222":{
            "author_id":"nick8714",
            "author_name":"lui",
            "choices":[
                "sure, why not?",
                "nahh, next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So will you choose Ranma 1/2. bring in some of that Takahashi goodness?</span></div></span></div>",
            "created":1466103600,
            "id":2165236,
            "title":"Decisions decisions"
        },
        "143":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "super mario",
                "dead or alive",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide on video game characters. now which game will you choose.</span></div></span></div>",
            "created":1366520400,
            "id":1576215,
            "title":"video games"
        },
        "1433":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "street fighter",
                "soul calber",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are some more.</span></div></span></div>",
            "created":1366606800,
            "id":1576676,
            "title":"more"
        },
        "14333":{
            "author_id":"thecanadian",
            "author_name":"Canadian",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Halo? Probably one of the newer ones for the sake of apperance quality</span></div></span></div>",
            "created":1366952400,
            "id":1579139,
            "title":"Halo?"
        },
        "143331":{
            "author_id":"thecanadian",
            "author_name":"Canadian",
            "choices":[
                "Cortana?",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who do you make a mask of?</span></div></span></div>",
            "created":1366952400,
            "id":1579140,
            "title":"Halo!"
        },
        "143332":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "darkstalkers",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about this?</span></div></span></div>",
            "created":1370754000,
            "id":1608242,
            "title":"No"
        },
        "1433322":{
            "author_id":"thatguy1997",
            "author_name":"Potatoman",
            "choices":[
                "The Legend of Zelda",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the Legend of Zelda?</span></div></span></div>",
            "created":1460430480,
            "id":2131602,
            "title":"How was this not here sooner"
        },
        "14333222":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Yes?",
                "No?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Final Fantasy series? But which game? How about Final Fantasy XV?</span></div></span></div>",
            "created":1504044720,
            "id":2376815,
            "title":"Something else "
        },
        "143332221":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Become Noctis",
                "Choose another character?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character from FFXV would you like to become? How about the main character, Noctis Lucis Caelum? He's a prince and a cool and handsome guy, with cool powers.</span></div></span></div>",
            "created":1504044840,
            "id":2376820,
            "title":"Yes?"
        },
        "1433322212":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Choose Prompto",
                "Next character?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about his best friend Prompto Argentum? He's friendly and lovable.And skilled in both photography and firearms.</span></div></span></div>",
            "created":1504044900,
            "id":2376822,
            "title":"Choose another character?"
        },
        "144":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "danny phantom",
                "batman",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide on comic and cartoons. which of the certain cartoons or comics will you choose? </span></div></span></div>",
            "created":1366347600,
            "id":1574958,
            "title":"comics and cartoons"
        },
        "1441":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "maddy  phenton",
                "paulina",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which Danny phantom character will it be?</span></div></span></div>",
            "created":1366520400,
            "id":1576087,
            "title":"danny phantom"
        },
        "14413":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "jazz",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577377,
            "title":"more"
        },
        "144132":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "desiree",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577381,
            "title":"more"
        },
        "1441322":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "spectra",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577382,
            "title":"more"
        },
        "14413222":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "ember",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577383,
            "title":"more"
        },
        "144132222":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "kitty",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577384,
            "title":"more"
        },
        "1441322222":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "valerie",
                "reader's choice of charater"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577389,
            "title":"more"
        },
        "1443":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "farly odd parents ",
                "superman",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is more.</span></div></span></div>",
            "created":1366347600,
            "id":1574959,
            "title":"more"
        },
        "14431":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "timmy's mom",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you chose the fairly odd parents. which charter will it be?</span></div></span></div>",
            "created":1366347600,
            "id":1574961,
            "title":"farly odd parents "
        },
        "144312":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "brittney brittney",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577370,
            "title":"more"
        },
        "1443122":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "tooth fariy",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more.</span></div></span></div>",
            "created":1366693200,
            "id":1577371,
            "title":"more"
        },
        "14431222":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "vicky",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more.</span></div></span></div>",
            "created":1366693200,
            "id":1577372,
            "title":"more"
        },
        "144312222":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "wanda",
                "reader's choice of charater"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is some more</span></div></span></div>",
            "created":1366693200,
            "id":1577375,
            "title":"more"
        },
        "14433":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "dexter's lab or powerpuffgirls",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is more.</span></div></span></div>",
            "created":1366347600,
            "id":1575022,
            "title":"more"
        },
        "144331":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "dexter's lab",
                "powerpuffgirls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you narrow your choice down to ether Dexters lab or powerpuffgirls. which one will it be ?</span></div></span></div>",
            "created":1366520400,
            "id":1576081,
            "title":"dexter's lab or powerpuffgirls"
        },
        "1443311":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "dexter's mom",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which Dexters lab character?</span></div></span></div>",
            "created":1366520400,
            "id":1576083,
            "title":"dexter's lab"
        },
        "1443312":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "miss bellum",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you chose the powerpuffgirls so what charter will i tbe</span></div></span></div>",
            "created":1366606800,
            "id":1576698,
            "title":"powerpuffgirls"
        },
        "144332":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "totally spys",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is another.</span></div></span></div>",
            "created":1370754000,
            "id":1608029,
            "title":"more"
        },
        "1443322":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "king of the hill",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is another</span></div></span></div>",
            "created":1371445200,
            "id":1612723,
            "title":"more"
        },
        "14433222":{
            "author_id":"scp-914",
            "author_name":"SCP-914: The Clockworks",
            "choices":[
                "Let's check out Disney Cartoons",
                "Let's move on to Nick Cartoons"
            ],
            "content":"<div class=\"\"><div> <span>How about Disney cartoon shows? There have been a number of them over the years including Talespin, Darkwing Duck, The Little Mermaid (animated series and comics), and Aladdin (Animated series and comics). If not, we can move on to Cartoons on Nick like T.U.F.F. Puppy, Dreamworks Kung Fu Panda Legends of Awesomeness.</span></div></div>",
            "created":1425272400,
            "id":1942505,
            "title":"Disney Cartoon shows"
        },
        "145":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Books",
                "TV",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these areas?</span></div></span></div>",
            "created":1439096400,
            "id":2019111,
            "title":"something else"
        },
        "1451":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "A Harry Potter book",
                "A Twilight novel",
                "Another book"
            ],
            "content":"<div class=\"\"><div> <span>You think that by pressing the mask against the page of a book, it might transform you into one of the characters inside. It's a bit riskier than the other methods of transformation, because there's multiple characters on a page, but you think it might work. Which book do you attempt to use the mask on?</span></div></div>",
            "created":1439096400,
            "id":2019112,
            "title":"Books"
        },
        "1452":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Arrow",
                "Doctor Who",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which TV show?</span></div></span></div>",
            "created":1439096400,
            "id":2019119,
            "title":"TV"
        },
        "14523":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Big Bang Theory",
                "Another"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this?</span></div></span></div>",
            "created":1439096400,
            "id":2019120,
            "title":"More"
        },
        "145231":{
            "author_id":"dlockwood",
            "author_name":"Dlockwood",
            "choices":[
                "Random guy",
                "Guy friend "
            ],
            "content":"<div class=\"\"><div> <span>You decide that you want to be penny from the Big Bang theory. <a rel=\"nofollow\" href=\"https://www.google.com/search?q=penny+big+bang+theory&amp;rlz=1C9BKJA_enUS715US715&amp;hl=en-US&amp;prmd=ivn&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ved=0ahUKEwirlMf06ZjTAhWD4IMKHcJxDekQ_AUIBygB&amp;biw=1024&amp;bih=653#hl=en-US&amp;tbm=isch&amp;q=penny+big+bang+theory&amp;chips=q:penny%20big%20bang%20theory,g_4:bra&amp;imgrc=Djm9FZun2N_xVM:You\" target=\"_blank\">https://www.google.com/search?q=penny+bi...</a> pause the show at a point where she looks really sexy. You put the mask up to the tv, she is sucked out of the tv and into the mask. All that is left is a mask that looks like her face. You put the mask on and you feel yourself change, you look down and you are wearing a red tanktop without a Bra. You take off you shirt and reveal your c cup brreasts. You play with them for a while and then you pull off hour pants and undies. You feel your perfect begins and stick your fingers in, you are in love with the sensation but want more. <br>\r\n<br>\r\n1. Do you find a random guy to have sex with<br>\r\n2. Do you go to see one of your guy friends<br>\r\n3. Do you head to the beach in a bikini </span></div></div>",
            "created":1491795180,
            "id":2302510,
            "title":"Big Bang Theory"
        },
        "145232":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Velar morghulis",
                "Pass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How would you like Game of Thrones?</span></div></span></div>",
            "created":1439096400,
            "id":2019121,
            "title":"Another"
        },
        "1452322":{
            "author_id":"karriden",
            "author_name":"Karriden",
            "choices":[
                "Sure",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, how about New Girl?</span></div></span></div>",
            "created":1439096400,
            "id":2019122,
            "title":"Pass"
        }
    },
    "info":{
        "author_id":"pss15",
        "author_name":"Pss",
        "brief_description":"white mask + a person = mask of said person",
        "created":1366332300,
        "description":"<td align=\"left\" class=\"norm\">one day you are looking through your room and find a strange box labeled to you from you birth parents . you open it to find a white plastic mask with a note stating once put on a another person it will absorb said person and create a mask of the person that will transform you into them.<br>\r\nthe mask can also bend reality to be used on fictional characters for you to change into.<br>\r\nmain characters: you-current age 17 and adopted by your current family at age 5 the same year you Jenna had out of collage and Married Dan. an average intelligence and very hormonal right now but holds it in with out showing it. <br>\r\nJenna Martian- your mom age 35, has long red hair with green eyes and an hourglass figure with a sizable ee cup breasts. she is also considered a genus finishing collage at the age of 18  <br>\r\nDan Martian-you dad age 39, has brown hair with grey eyes and is would renown inventor/ genus <br>\r\nSarah Martian-your 14 year old sister, blond hair with blue eyes and an hourglass figure with dd cup breasts borderline e cups. she is an avrage intelligence with a bubbly personality <br>\r\nCarly Martian- your 5 year old sister, red hair with grey eyes and she takes after you parents in their intelligence but stays back to get some more time to mature.<br>\r\nmore characters will be added depending on the chapters that are added so add if you want </td>",
        "id":1929702,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1504044900,
        "modified":1504044900,
        "pretty_title":"masks of changing"
    }
}