{
    "chapters":{
        "1":{
            "author_id":"misterwoman",
            "author_name":"Mr.Woman",
            "choices":[
                "Chelsea is in the kitchen",
                "Chelsea is still asleep",
                "Chelsea is lying on the couch"
            ],
            "content":"<div class=\"\"><div> <span>     Your name is Jason. The last thing you remember is lying in bed with your girlfriend, Lauren. Lauren is a hot, DD-cup, black haired girl. You look around at your surroundings and notice everything around you is gigantic. You then realize that you shrunk. You then look to your side and see Lauren lying next to you, shrunk as well. You try to remember what happened last night. Lauren had invited you to her sorority. Her sorority is basically a home where Lauren and five other hoy chicks live. Uh-oh, you think as you remember how all the other girls are lesbian perverts. You look around at your surroundings again. You notice you are still in Lauren's bed. The only problem is that Lauren sleeps in the same room as Olivia, a hot D-cup redhead. You know that can't be good. You then suddenly hear a noise. You look over to see Olivia getting dressed. At the moment she was naked. As she is putting her bra on, she looks at Lauren's bed.<br>\r\n     \"Thats funny, I always wake up before Lauren.\" She said.<br>\r\n     She started walking towards Lauren's bed. You have to wake up Lauren. Frantically, you start shaking her.<br>\r\n     \"Jason,\" she mutters, half asleep, \"Whats going on.\"<br>\r\n     \"All I know is we shrunk.\"<br>\r\n     \"What?...\" She responds still half asleep.<br>\r\n     At that moment Olivia had gotten over to the bed.<br>\r\n     \"Well what do we have here?\" She said.<br>\r\n     She then picked up you and Lauren.<br>\r\n     \"Hello sleeping beauty and sleeping beauty's boyfriend.\"<br>\r\n     \"Olivia?\" Lauren asked.<br>\r\n     \"Yes?\"<br>\r\n     \"How are you so big?\"<br>\r\n     \"No how are you so small?\"<br>\r\n     At this point you interrupted them saying, \"Olivia, can you help us?\"<br>\r\n     Olivia thought about that for a moment before saying, \"No.\"<br>\r\n     \"What, why?\"<br>\r\n     \"Because, I'm tired of miss sleeps-a-lot being the most popular girl in the sorority.<br>\r\n     \"But then what will you do with us?\" Lauren asked.<br>\r\n     \"I'm sure Chelsea will have an idea.\" Olivia said.<br>\r\n     Oh great, you thought. Chelsea is the biggest Lesbian pervert here.<br>\r\n     Olivia then opened up her bra, put you and Lauren in each side, and walked off. You can't say you didn't enjoy the trip. Being right up against Olivia's boob did turn you on. As you bounced around you thought about what might happen to Lauren.<br>\r\n   </span></div></div>",
            "created":1307946300,
            "id":1124799,
            "title":"Waking Up"
        },
        "11":{
            "author_id":"misterwoman",
            "author_name":"Mr.Woman",
            "choices":[
                "She wants seconds.",
                "Time to play."
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden Olivia stops. You hear a quiet noise that sounds like Olivia talking to someone else. After a quick conversation, Olivia open her bra, revealing you and Lauren. You look up to see Chelsea, only wearing an apron, cooking breakfast.<br>\r\n\"Oh, there so cute!\" Chelsea says.<br>\r\n\"I know,\" Olivia responds, \"I found them in Lauren's bed this morning.\"<br>\r\n\"Well, what are you going to do with them?\"<br>\r\n\"I'm giving Lauren to you, and keeping her little bf.\"<br>\r\n\"Oh why thank you.\"<br>\r\nYou look over at Lauren, who looks a little nervous. All of a sudden, a hand reaches down and grabs you and Lauren. The hand sets you down and you see that it was Chelsea's reaching in to grab you too.<br>\r\nOlivia then closes her bra, not knowing that Jason is missing, and walks off.<br>\r\n\"Hey you two,\" Chelsea says, \"want some eggs?\"<br>\r\nShe lifts the two of you up again and shows you the eggs she is cooking.<br>\r\n\"You know what goes great with eggs? Little teenage bitches!\"<br>\r\nShe then gets a plate down from the cub-board and puts Lauren on it. She then takes her spatula and covers Lauren in eggs.<br>\r\n\"Who knows, maybe eggs are good for the skin.\"<br>\r\nShe then goes and eats all the eggs, but leaves Lauren behind. She picks up Lauren, and moves her towards her mouth. She opens her mouth and drops Lauren in. You can see the bulge where Lauren is lying in her cheek. She then swallows and you see the bulge move down into Chelsea's throat and keep going down. Soon enough you can't see it.<br>\r\n\"Mmm, that was a good breakfast.\"</span></div></div>",
            "created":1309505400,
            "id":1138289,
            "title":"Eggs for breakfast."
        },
        "112":{
            "author_id":"misterwoman",
            "author_name":"Mr.Woman",
            "choices":[
                "Give it a try",
                "I'd rather not..."
            ],
            "content":"<div class=\"\"><div> <span>\"I think that I'm gonna play for awhile,\" Chelsea says.<br>\r\n<br>\r\nYou try to argue but you realize your voice is shot from when you yelled at Olivia earlier.<br>\r\n \"I'll tell you what,\" she says, \"I want to play a little game. If you win, you'll get your girlfriend. If not, I get you.\"<br>\r\n<br>\r\n\"The game is butt crawl. I'll give you 30 minutes to crawl through my intestinal track before I shit you out. If you win, you'll make it to my stomach and get Lauren.\"</span></div></div>",
            "created":1313286840,
            "id":1167604,
            "title":"Uh-oh"
        },
        "12":{
            "author_id":"misterwoman",
            "author_name":"Mr.Woman",
            "choices":[
                "Down she goes",
                "Wait a minute"
            ],
            "content":"<div class=\"\"><div> <span>     Olivia walked into Chelsea's room. Chelsea was still asleep in her bed. Chelsea is a brunette with a DD-cup. She has been known for putting anything she can find in her vagina. As Olivia went over to Chelsea, she saw that Chelsea was still asleep. This must've happens before because Olivia immediately grabbed a role of duct tape that was sitting on Chelsea's nightstand and wrapped Chelsea's hands and feet up. She then took a red marked and made a circle around her vagina. At this point Chelsea was waking up.<br>\r\n     \"Olivia, what are you doing?\" Chelsea asked.<br>\r\n     \"I have a present.\" Olivia responded.<br>\r\n     She then taped Chelsea to the bed. She then put a piece right over Chelsea mouth.<br>\r\n     \"Guess what I found this morning.\" Olivia said.<br>\r\n     She then pulled out the now shrunken Lauren from her bra. Chelsea's eyes went wide.<br>\r\n     \"Yep, thats right. And guess where she's gonna go.\"<br>\r\n     She then took some oil stuff and rubbed it all over Chelsea's vagina with her free hand. Then she went and left the room. Olivia walked into the kitchen and grabbed a banana and came back. She then peeled the banana and held it over Chelsea's vagina.<br>\r\n     \"First lets start with a warm-up though.\"<br>\r\n     She then went and started jamming the banana into Chelsea's vagina. After a few minutes of trying to get it all the way in, she stopped.<br>\r\n     \"Something must be blocking it.\"<br>\r\n     She then reached into Chelsea's vagina. She then grabbed something and pulled it out. It was an entire beer bottle.<br>\r\n     \"Has someone been drinking again. Oh well.\"<br>\r\n     She then took Lauren and held her over Chelsea's vagina.</span></div></div>",
            "created":1307947800,
            "id":1124814,
            "title":"Early wakeup"
        },
        "121":{
            "author_id":"misterwoman",
            "author_name":"Mr.Woman",
            "choices":[
                "Go in and find Lauren",
                "Go explore the house."
            ],
            "content":"<div class=\"\"><div> <span>The next thing you see out of Olivia's bra is Lauren being shoved into Chelsea's vagina. Chelsea moans as Olivia's hand goes in deeper and deeper into Chelsea. Chelsea must have had a very deep pussy because before you know it, Olivia's up too her elbow in Chelsea's vagina. You figure that Lauren is currently in Chelsea's womb or some area around that.<br>\r\n\"You ready for some more Chelsea?\", Olivia asks.<br>\r\nBefore you know it Olivia takes her arm out of Chelsea, with no Lauren on it, and removes the bra you are in. She throws you and the bra off to the side and starts playing with Chelsea's breasts. Chelsea can't do anything about it, being wrapped in duct tape, so she just goes with it.<br>\r\nAfter awhile of that, Olivia stopped and put her bra back on. Luckily you got out of it while she was playing with Chelsea. You watch as Olivia goes and unwraps Chelsea, completely forgetting about you, and lets her go back to sleep in peace. The only problem is that Lauren is currently inside of Chelsea.</span></div></div>",
            "created":1309419540,
            "id":1137599,
            "title":"Didn't come back up."
        },
        "1211":{
            "author_id":"tntlost",
            "author_name":"Tlost",
            "choices":[
                "Chelsea doesn't remember that you're inside her",
                "Lauren desides to explore more of Chelsea ",
                "Olivia puts some more items inside Chelsea"
            ],
            "content":"<div class=\"\"><div> <span>Standing at the foot of the bed staring down Chelsea's legs towards her tight fitting panties. Surely its bad for Lauren &amp; Chelsea's health to leave them like this, fortunately for you Chelsea fell asleep lying on her back. You begin walking down the valley between her toned thighs towards her light pink underwear, slipping round you present yourself with the lips of her vagina, there's a light smell of alcohol and soap coming from her pussy, possibly from the prior stored beer bottle. <br>\r\n<br>\r\nPushing your hands lightly between her folds they adjust softly around you, crawling down the deep fleshy tunnel of Chelsea's vagina. From crawling around Chelsea's privates the world around you rotates as your host changes sleeping position, nothing too problematic currently anyways. <br>\r\n<br>\r\nContinuing deeper into Chelsea you eventually reach the end of her vagina to her Cervix, fortunatly Olivia's hand left a small gap to crawl through. Inside Chelsea's womb is both tight and dripping thick sticky goo. Laurn calls you from across Chelsea's insides \"Lost property?\" she inquires<br>\r\n</span></div></div>",
            "created":1487631120,
            "id":2280066,
            "title":"Go in and find Lauren"
        },
        "12111":{
            "author_id":"tntlost",
            "author_name":"Tlost",
            "choices":[
                "Disappear of inside your bladder",
                "Go recover them"
            ],
            "content":"<div class=\"\"><div> <span>#Chelsea's POV<br>\r\n<br>\r\nWaking up after a good nights drinking is always a killer you think to yourself as you stretch you arms over your head. <br>\r\n\"Hrrrm, why do I feel so tingly\" you say to yourself prodding your stomach. Heading downstairs to eat, you swear that you can feel something moving somewhere deep inside you. <br>\r\n<br>\r\nSitting down with the family you begin to tuck into your food. Shifting in your chair, something is certainly moving around inside you, what ever it is, its currently crawling round inside your vagina.</span></div></div>",
            "created":1487634000,
            "id":2280087,
            "title":"Chelsea doesn't remember that you're in..."
        },
        "121111":{
            "author_id":"tntlost",
            "author_name":"Tlost",
            "choices":[
                "Revenge insertation",
                "Deal with them later"
            ],
            "content":"<div class=\"\"><div> <span>Trying not to alert your family of your predicament, stand up to head to the bathroom. But not before you feel the occupants of your pussy pushing through a tight ring of muscle up into your 'pipes'. <br>\r\n<br>\r\nyou sit yourself down on your toilet to focus on the position of the invaders. <br>\r\n<br>\r\nFiguring the only way to shift them from your insides is to masturbate, rubbing the tips of your fingers over your lips before plunging them into yourself, shortly you can feel the contractions inside you pushing the occupants down into your more spacious vagina. <br>\r\n<br>\r\nLooking down towards your hands you can just about make out the faces of your friend, and her boyfriend</span></div></div>",
            "created":1487634480,
            "id":2280092,
            "title":"Disappear of inside your bladder"
        },
        "12112":{
            "author_id":"tntlost",
            "author_name":"Tlost",
            "choices":[
                "Climb inside",
                "Push olivia inside"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Jason, you want to try and learn some more 'biology' lessons?\" Olivia inquires, to which you nod. <br>\r\nOlivia begins to lead you towards one of the two tubes deeper inside, \"Here, follow me down here\" she says before crawling into one of Chelsea's tubes, Outside Chelsea begins to blush in her sleep feeling her two occupants crawling around inside her. <br>\r\n<br>\r\nOnce you have reached the larger section of Chelsea you stand next too Olivia who is currently arm deep in Chelsea's ovaries. \"Here, feel this. its really odd feeling!\".<br>\r\nsticking your hand inside the soft and warm ovaries you can feel all of Chelsea's developing cells.<br>\r\n</span></div></div>",
            "created":1487710620,
            "id":2280397,
            "title":"Lauren desides to explore more of Chelsea "
        },
        "12113":{
            "author_id":"tntlost",
            "author_name":"Tlost",
            "choices":[
                "How much can Chelsea hold",
                "Go back in to get them out"
            ],
            "content":"<div class=\"\"><div> <span>Whilst you and Lauren are planning your next move when a few muffled squeals are heard and then some squelching down below. Before you know it Chelsea's vagina is filled with ping pong balls trapping you inside!<br>\r\n<br>\r\nYou look at Lauren and she looks at you, \"Jason, with these here we can't get out. We're going to have to shift them somewhere?\". Looking uncomfortable at your girlfriend an lean in close to her ear \"Well, here's my plan\" <br>\r\n<br>\r\nMeanwhile on the outside Chelsea and Olivia are eating breakfast.  <br>\r\n<br>\r\n\"Man, I can feel them tickling on my womb walls as they mov-\" cut of short with a puckered up face<br>\r\n\"What's the matter Chelsea?\" Olivia inquires? <br>\r\n\"I feel funny, I think they're doing something inside me\" <br>\r\n\"Well lift up your top and let me have a look at your stomach\" <br>\r\nChelsea obediently lifts up her shirt to reveal small blobs of flesh moving upwards before disappearing back into Chelsea's depths, Curious Olivia probes Chelsea's insides with a finger before returning with 2 tiny teens in her hand \"Did you just shift those ping pong balls into Chelsea's womb?\"  <br>\r\n <br>\r\n</span></div></div>",
            "created":1487633220,
            "id":2280079,
            "title":"Olivia puts some more items inside Chelsea"
        }
    },
    "info":{
        "author_id":"misterwoman",
        "author_name":"Mr.Woman",
        "brief_description":"Jason and his girlfriend are shrunk",
        "created":1307945160,
        "description":"<td align=\"left\" class=\"norm\">You are Jason. Jason and his girlfriend end up shrunk at his girlfriend's sorority. The only only problem is that the sorority is filled with hot lesbian perverts. Is that good or bad its up to you.<br>\r\n<br>\r\nRULES:<br>\r\n<br>\r\nNo short paragraphs (at least 2-3 sentences)<br>\r\n<br>\r\nPlease use correct grammar<br>\r\n<br>\r\nNo male interactions<br>\r\n<br>\r\nNo furries or morphing or stuff like that.<br>\r\n<br>\r\nDon't kill off Jason or Lauren<br>\r\nUnbirthing, vore and anal vore are allowed</td>",
        "id":1784783,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1487710620,
        "modified":1487710620,
        "pretty_title":"Shrunken with your Girlfriend"
    }
}