{
    "chapters":{
        "1":{
            "author_id":"darkwing387",
            "author_name":"Darkwing387",
            "choices":[
                "Explore the resort",
                "Find some food.",
                "Animal transformation",
                "Age regression",
                "Decide on the transformation "
            ],
            "content":"<div class=\"\"><div> <span>Jason and Samantha have been planning this for a while and where excited to finally have arrived at their destination. Samantha had invited her sister and friend along thinking they are closet nudists as well and would enjoy it. What she hadn't told them that it was a special nudist resort. Jason and her want to surprise them when they got there. They parked the car and checked in. \"Ok our room is 209\" Jason tells them. After about 5 mins they find their suite. \"Wow this is nice\" Haley says. \"Says here if we want to walk around the resort we must remove our clothes before doing so. Thats kind of obvious don't you think?\" Samantha laughs. \"What this bit about transformation?\" Kelsey asks her. \"That's the surprise Jason and I where going to show you. Along with this being a nude resort it's a transformation resort as well. We can turn into animals, become younger or older, shrink, or change sex\" she explains to Haley and Kelsey. They both looked confused after they heard this. \"Thats impossible\" Haley laughs. \"Oh is it?\" her sister smiles to her. Samantha put the dvd provided with the instructed in the dvd player. After 10 minutes of watching it Haley and Kelsey where awestruck. \"Wow I cant believe this is possible\" Kelsey said excitedly. \"I know right?\" Jason says. \"and as you can see from the video it's an easy process. All we have to do is type in what change we want in the computer and for how many people. Then coffee looking machine next to the computer makes the potion for each person that wants to change\" Jason continued. \"Ok, how about we get undressed and figure out what we're doing\" Samantha said.</span></div></div>",
            "created":1367985900,
            "id":1586281,
            "title":"Arriving"
        },
        "13":{
            "author_id":"darkwing387",
            "author_name":"Darkwing387",
            "choices":[
                "Me",
                "Jason",
                "Haley",
                "Kelsey"
            ],
            "content":"<div class=\"\"><div> <span>\"I was thinking maybe we could do a cat transformation first\" Jason says as he removes his shirt. \"That sounds like a good idea\" Kelsey says letting her dress fall to the ground. \"We could be like Baxter!\" Haley exclaims and smiles at her sister. They unhook their bras and let they fall to the floor. Their breasts jiggle slightly as they're freed. \"Sounds like a plan then\" said Jason. \"Although I don't want to hear anything from you 3 when you're growing hair and losing your womanly assets\" Jason laughs at the 3 topless women as they remove their panties and thongs. \"Oh, don't you worry hun we won't. Plus we'll have 3 extra sets of teats to make up for it\" Samantha says with a smirk as she watches her boyfriend pull his underwear down. Jason sticks his tongue out and smiles at her. \"Ok, now that we have our clothes off who wants to go first?\" Haley ask as she walks over to the computer. \"Hmm, how about....\" Samantha starts to say.</span></div></div>",
            "created":1391889660,
            "id":1741677,
            "title":"Animal transformation"
        },
        "14":{
            "author_id":"darkwing387",
            "author_name":"Darkwing387",
            "choices":[
                "8 years younger",
                "10 years younger",
                "12 years younger",
                "14 years younger",
                "16 years younger"
            ],
            "content":"<div class=\"\"><div> <span>\"I was thinking maybe we could an age regression first\" Jason says as he removes his shirt. \"That sounds like a good idea\" Kelsey says while pulling her dress off. \"We could be kids again!\" Haley exclaims and smiles at her sister. They unhook their bras and let they fall to the floor. \"Sounds like a plan then\" said Jason. \"Although I don't want to hear anything from you 3 when you lose your womanly assets\" Jason laughs at the 3 topless women as they remove their panties and thongs. \"Oh, don't worry hun we won't. Plus you'll be losing some of your manly assets\" Samantha says with a smirk as she watches her boyfriend pull his underwear down. Jason sticks his tongue out and smiles at her. \"Ok, now that we have our clothes off how much younger should we make ourselves?\" Haley ask as she walks over to the computer. \"Hmm, how about....\" Samantha starts to say.</span></div></div>",
            "created":1381875660,
            "id":1679717,
            "title":"Age regression"
        },
        "142":{
            "author_id":"darkwing387",
            "author_name":"Darkwing387",
            "choices":[
                "Haley",
                "Jason",
                "Kelsey"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm, how about we do 10 years younger?\" Samantha tells her sister. \"Sounds good\" Haley replies. She then types in the amount of years they wanted to regress and the machine makes 4 potions for them. \"Guess I'll be the only one not in grade school\" Jason laughs as the pick up their cups. \"So who should go first?\" Kelsey asks. </span></div></div>",
            "created":1381886340,
            "id":1679809,
            "title":"10 years younger"
        },
        "1421":{
            "author_id":"darkwing387",
            "author_name":"Darkwing387",
            "choices":[
                "Samantha",
                "Kelsey is missing",
                "Jason"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll go first\" Haley says excitedly. \"I can't wait to be 9 and a kid again\" she continues. They watch her drink down the potion. Her change was almost instant. She had already shrunk a couple inches only a few seconds in. \"Wow, this is cool feeling\" Haley says noticing her voice starting to get higher. \"You look like you're about 16 sis\" Samantha tells her. Her breasts had already shrunk to an AA and they continued to shrink and rise on her chest. At the same time her hips had compressed some and her ass had shrunk some giving her a more adolescent look. \"This is so weird feeling, but its cool as hell\" Haley tells them. At this point she had lost over 6 inches in height. She looked in the mirror and saw how young her face looked and thought she couldn't be any older then 14. \"Looks like you've lost you're womanly curves\" Kelsey laughs. \"You will too in a few minutes Kels\" Haley laughs back. BY now her breasts where nothing but cones on her crest as she starts to enter the other side on puberty. \"whelp there goes my teenage years\" Haley though as she watched as the cones on her chest become small bumps, her hip and ass lose the little curves they have on them, and her pubes suck back into her body. \"Looks like you're almost done Hal\" Samantha tells her. They watch as her change completes. The small bumps on her chest shrink to nothing and she stops shrinking when she reaches 4'. \"Holy crap I'm 9 again!\" Haley says excitedly in her kids voice. \"Im so small, smooth and innocent looking\" she laughs. \"So who's going next?\" she says as she looks at the others.</span></div></div>",
            "created":1381888440,
            "id":1679819,
            "title":"Haley"
        },
        "14213":{
            "choices":[
                "10 years younger",
                "even younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'd like to go next,\" Jason replied.<br>\r\n<br>\r\nHe decided that he'll be....</span></div></span></div>",
            "created":1391326620,
            "id":1737072,
            "title":"Jason"
        },
        "142131":{
            "author_id":"darkwing387",
            "author_name":"Darkwing387",
            "choices":[
                "Kelsey",
                "Samantha "
            ],
            "content":"<div class=\"\"><div> <span>\"Being 14 again should be\" Jason said as he drank his potion. The potion took an instant effect. At first only his muscle tone seemed to lessen, but once his age dropped under 20 the changes became more drastic. \"It looks like your facial hair is thinning out hun\" Samantha tells her boyfriend. \"I can't be any older the 18\" he tells them as he looks at himself in the mirror. He watches as his body hair starts to thin out as well. Jason also could tell that he had lost a couple of inches too. \"You're almost down to my size\" Kelsey laughs at him. \"Yea well that won't last long\"  he says as his voice sounded a little higher and was cracking a little. By the time Jason reach 16 his facial hair was all but gone and he was almost an inch shorter then Kelsey. \"Looks like your change is almost done\" Samantha say. They watch as he shrinks a couple more inches. When he finally reaches 14 he's only 5' 4\" and the only body hair he has is the little amount under his arms and groin. \"Wow that has a rush\" his voice cracks. \"All right which one of you 2 wants to be 10 years younger next?\" 9 year old Haley asks them. </span></div></div>",
            "created":1391898660,
            "id":1741838,
            "title":"10 years younger"
        },
        "142132":{
            "choices":[
                "14 years younger",
                "even younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jason decided to be.....</span></div></span></div>",
            "created":1391326740,
            "id":1737073,
            "title":"even younger"
        },
        "1421321":{
            "choices":[
                "Kelsey ",
                "Haley"
            ],
            "content":"<div class=\"\"><div> <span>\"Fourteen years younger.\" Jason said, drinking the potion, \"Let's go all the way on the other side of puberty.\"  Kelsey, Haley, and Samantha all watched eagerly as he drank the position, and he began to shrink in size.  The hair on his chest and belly vanished, and as the years melted away, so did the hair on his arms and legs.  In seconds, years passed by and his armpit and pubic hair were all gone.  A few extra seconds, and his penis and balls shrank back up to his prepubescent body.<br>\r\n<br>\r\n\"Well---\" he began laughing at how high pitched his voice was, \"I guess I'm done, who's next?\"  He said as he look around at the girls who were now taller than his little 10 year old body.</span></div></div>",
            "created":1541588820,
            "id":2574319,
            "title":"14 years younger"
        },
        "1421322":{
            "choices":[
                "19 years younger",
                "even younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jason decided to be....</span></div></span></div>",
            "created":1391326860,
            "id":1737076,
            "title":"even younger"
        },
        "14213222":{
            "choices":[
                "22 years younger",
                "23-24 years younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'd like to be really young, young enough to be in diapers even,\" Jason declared.<br>\r\n<br>\r\n\"What!?\" His friends yelled.<br>\r\n<br>\r\nJason smirked. Now he knew he wanted to be....</span></div></span></div>",
            "created":1391326980,
            "id":1737077,
            "title":"Toddler/Baby days"
        },
        "142132221":{
            "choices":[
                "continue the regression with Kelsey",
                "Explore the resort"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go for two years old,\" Jason proclaimed. <br>\r\n<br>\r\n\"Alright, if you really want to be a baby,\" Haley said as she had the machine increase the potion's strength.<br>\r\n<br>\r\nShe handed Jason the potion, and they all watched as Jason began to regress. They gazed with intent as his manly features shrink inch by inch along with the rest of his body. His regression finally stopped when he was a two year old baby boy. He smiled up at everyone.<br>\r\n<br>\r\n\"Me smaww,\" Jason squeaked.<br>\r\n<br>\r\nSamantha walked to the newly regressed Jason and knelt down to the boy's level.<br>\r\n<br>\r\n\"Yes you are, sweetie, and really adorable,\" Samantha cooed to Jason.<br>\r\n<br>\r\nShe picked him up and held him close. Jason hugged Samantha and smiled. <br>\r\n<br>\r\n\"Me caww you mama?\" Jason inquired.<br>\r\n<br>\r\nSamantha was a bit hesitant about this. Was it truly right to treat Jason, her friend, like her son?  Why was Jason even asking this?<br>\r\n<br>\r\nHowever, the hesitant feeling didn't last long.<br>\r\n<br>\r\n\"Sure, my littlle boy,\" She replied.<br>\r\n<br>\r\nJason smiled and snuggled Samantha.<br>\r\n<br>\r\n\"Mama.\"<br>\r\n<br>\r\nSuddenly, Jason began to pee on Samantha.Samantha sighed and held Jason away from her.<br>\r\n<br>\r\n\"Jason..gross!\"<br>\r\n<br>\r\nJason giggled at Samantha's reaction. Finally, Jason was finished peeing, and Samantha held him close to her once again. She smiled and stroked his hair.<br>\r\n<br>\r\nHaley and Kelsey stared at the situation at hand. Their friend chose to be regressed to a toddler. Why he chose to do they don't know. They did know, however, that Samantha probably didn't want to regress now. Both of them decided too...<br>\r\n</span></div></div>",
            "created":1392085560,
            "id":1743565,
            "title":"Two Years Old"
        },
        "1421322212":{
            "choices":[
                "The beach",
                "Pool",
                "Some orher activity"
            ],
            "content":"<div class=\"\"><div> <span>Samantha set Jason down and held his hand.<br>\r\n<br>\r\n\"Why don't we go explore the resort some more and show this cutie off?\" Samantha proposed.<br>\r\n<br>\r\n\"Sure.\" Kelsey replied.<br>\r\n<br>\r\n\"Don't you mean <i>these</i> cuties?\" Haley said jealously.<br>\r\n<br>\r\nSamantha looked over at the nine year old and chuckled.<br>\r\n<br>\r\n\"Right. <i>these</i> cuties.\" Samantha replied.<br>\r\n<br>\r\nJason giggled and sucked his thumb. He was excited at the thought of exploring the resort with the eyes of a toddler. The world seemed  much <i><b>much</b></i> bigger to him, so it was one enormous playground. <br>\r\n<br>\r\n\"Wet's go!\" The toddler squealed.<br>\r\n<br>\r\n\"Alright, my baby.\" Samantha held his hand in hers and began walking out the door, the others following behind. First, they decide to visit....</span></div></div>",
            "created":1526425560,
            "id":2493672,
            "title":"Explore the resort"
        }
    },
    "info":{
        "author_id":"darkwing387",
        "author_name":"Darkwing387",
        "brief_description":"Jason, Samantha, Haley & Kelsey are on vacation at a nudist resort with a twist.",
        "created":1367983560,
        "description":"<td align=\"left\" class=\"norm\">Jason, his girlfriend Samantha, her sister Haley and her friend Kelsey are on vacation at a unusual nudist resort.<br>\r\n<br>\r\n<u>Jason</u><br>\r\nAge: 24<br>\r\nHeight: 5' 10\"<br>\r\nWeight: 158 lbs, <br>\r\nHair: Short Brown<br>\r\nBody Hair: Chest, Stomach, Arm, Leg, Pubic, Arm Pit<br>\r\nEyes: Blue<br>\r\nDescription: Jason is your everyday nerd, he's very easy going and rarely gets mad over stuff. He does everything he can to make sure Samantha is happy.  <br>\r\n<br>\r\n<u>Samantha</u><br>\r\nAge: 22<br>\r\nHeight: 5' 5\"<br>\r\nWeight: 153 lbs<br>\r\nChest: 36C<br>\r\nHair: Medium Red<br>\r\nBody Hair: Trimmed Pubic<br>\r\nEyes: Green<br>\r\nDescription: Samantha like Jason is a nerd, but more of a computer nerd. She tends to get stressed more easily then Jason. Even though she's a little pudgy she's very comfortable with her body.<br>\r\n<br>\r\n<u>Haley</u><br>\r\nAge: 19<br>\r\nHeight: 5' 4\" <br>\r\nWeight: 122 lbs<br>\r\nChest: 34B<br>\r\nHair: Long Black<br>\r\nBody Hair: Trimmed Pubic<br>\r\nEyes: Green<br>\r\nDescription: Haley loves the outdoors and is a self proclaimed nudist. She has a very outgoing personality and at times isn't afraid to let her opinion be know. <br>\r\n<br>\r\n<u>Kelsey</u><br>\r\nAge: 21<br>\r\nHeight: 5' 7\" <br>\r\nWeight: 171 lbs <br>\r\nChest: 42DD<br>\r\nHair: Medium Brown<br>\r\nBody Hair: Trimmed Pubic<br>\r\nEyes: Hazel<br>\r\nDescription: Kelsey has know Samantha since the 3rd grade. She's a quite person by nature and is a little self conscious towards her weight. Even though see may hate her body sometimes, she's a closet nudist. Whenever she can she loves walking around her apartment naked. <br>\r\n<br>\r\nAnimal transformation, Age Progression, Age Regression, Shrinking, Transgender only.<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1932454,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1541588820,
        "modified":1541588820,
        "pretty_title":"Transformation Nudist Resort"
    }
}