{
    "chapters":{
        "1":{
            "author_id":"enderman",
            "author_name":"shadow writer",
            "choices":[
                "Story after book one",
                "Story after book two",
                "After day of black sun",
                "Ten years later",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is an interactive to further explore the world of Avatar </span></div></span></div>",
            "created":1196485200,
            "id":470997,
            "title":"Start The Story"
        },
        "12":{
            "author_id":"3ragnu3",
            "author_name":"coldsnap",
            "choices":[
                "Aang",
                "Katara",
                "Sokka",
                "Toph",
                "Zuko"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will our story focus on first?</span></div></span></div>",
            "created":1334552400,
            "id":1317093,
            "title":"Story after book two"
        },
        "121":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Romance (Katara)",
                "Romance (Other)",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what will it be?</span></div></span></div>",
            "created":1530162000,
            "id":2512875,
            "title":"Aang"
        },
        "1212":{
            "author_id":"hptheb",
            "author_name":"HPB",
            "choices":[
                "Toph?",
                "Azula?",
                "Ty Lee or Mai?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else would it be with?</span></div></span></div>",
            "created":1604277540,
            "id":2932897,
            "title":"Romance (Other)"
        },
        "1213":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Adventure",
                "exploring in his spirit form",
                "no something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what else?</span></div></span></div>",
            "created":1530162000,
            "id":2512884,
            "title":"something else"
        },
        "12132":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "During his coma at the start of Book Thee",
                "no different start"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which start should we start with</span></div></span></div>",
            "created":1530162000,
            "id":2512886,
            "title":"Which start should we go with"
        },
        "121321":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Fire nation palace ",
                "no someother place"
            ],
            "content":"<div class=\"\"><div> <span>Aang didn't know where to begin.<br>\r\n<br>\r\none moment he was in his Avatar state in the Earth kingdom city of Ba-sing-sa, and now he was drifting in the void.<br>\r\n<br>\r\nHe remember the paralysing pain that coursed through his body and he remembered Roku's words about what happens should he die in the Avatar State, yet as he drifts he thought that since he's the avatar that he shouldn't even be existing or feeling anything in his blue glowing form.<br>\r\n<br>\r\nso what was he now.<br>\r\n<br>\r\na spirit, and if so where was the spirit world.<br>\r\n<br>\r\nbefore he think more about it, a bright light swallowed his being, Aang was blinded for a moment before it all cleared up and when it did he found himself in...<br>\r\n<br>\r\nWhere was he.</span></div></div>",
            "created":1530162000,
            "id":2512962,
            "title":"Spirit form exploration"
        },
        "1213211":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Azula",
                "no someone else"
            ],
            "content":"<div class=\"\"><div> <span>Aang found himself surrounded by red tapestries with the familiar, fear educing symbol that has haunted him everywhere he goes.<br>\r\n<br>\r\nFire nation symbols and fire symbols surrounded him along with some armour, \"I'm in the fire nation!\" he exclaimed before noticing a large bed behind him \"but where in fire nation am I?\" he asked himself before hearing  footsteps approach.<br>\r\n<br>\r\nThe doors to the room opened to reveal.<br>\r\n<br>\r\nwho was it?</span></div></div>",
            "created":1530162000,
            "id":2512964,
            "title":"Fire nation palace "
        },
        "12132111":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "he is possesses her",
                "no something else"
            ],
            "content":"<div class=\"\"><div> <span>Azula, The Fire nation Princess and Zuko's little sister had just entered the room.<br>\r\n<br>\r\nAang was overcome by paraslying fear as he saw the crazy powerhouse that was Azula stroll in, she didn't even notice him as she strolled pasted which was a relief as he remembered that no one can see him in spirit form except for other spirits.<br>\r\n<br>\r\n\"Honestly, the look on Zuzu face was priceless when Father thought he had killed the Avatar.\" Azula laughed out in her cold fashion that sent chills down his spiritual spine. she fell back into the bed sighing in exhaustion \"Finally! After all time, searching for Zuzu, The Avatar and taking the earth kingdom. it's all over.\" she breathed out before unhooking her Fire nation armour.<br>\r\n<br>\r\nAang blushed and tried to avert his eye's but couldn't so he was forced to watch as she disrobed. Aang got a hard on as he saw the evil and phychotic princess strip naked before him.<br>\r\n<br>\r\nHer pale un-scarred skin gleamed in the sunlight, her C-cup breasts hanged free from the constricting armour, her tight rounded buttocks and tone thighs looked luscious.<br>\r\n<br>\r\nAang couldn't help but feel aroused from the sight. his desired to feel such skin was so overwhelm that he unconsciously approached her, his hand extended towards her until  it was inches away and when it did touch her, something unexpected happened.<br>\r\n<br>\r\nwhat happens next? <br>\r\n</span></div></div>",
            "created":1530217980,
            "id":2512999,
            "title":"Azula"
        },
        "121321112":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "invisible Aang",
                "no something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about he can physically touch the Fire nation princess.</span></div></span></div>",
            "created":1530218100,
            "id":2513000,
            "title":"he can touch her?"
        },
        "1213211122":{
            "author_id":"hptheb",
            "author_name":"HPB",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Can she see him?</span></div></span></div>",
            "created":1604619900,
            "id":2935227,
            "title":"She sees him"
        },
        "122":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Romance (Aang)",
                "Romance (other)",
                "more options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which of these do you pick</span></div></span></div>",
            "created":1530298860,
            "id":2513268,
            "title":"Katara"
        },
        "1223":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "adventure",
                "Avatar Katara",
                "more options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>option 1 something happens in her adventure.<br>\r\n<br>\r\nOption 2 Katara is the Avatar</span></div></span></div>",
            "created":1530298980,
            "id":2513270,
            "title":"more options"
        },
        "12231":{
            "author_id":"thegoodman",
            "author_name":"thelastdoctor",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Option:<br>\r\nKatara is captured by the fire nation, during their escape from Ba Sing Se.</span></div></span></div>",
            "created":1586416920,
            "id":2815985,
            "title":"adventure"
        },
        "123":{
            "author_id":"3ragnu3",
            "author_name":"coldsnap",
            "choices":[
                "Romance (with Toph)",
                "Romance (other)",
                "Adventure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of story should we start with?</span></div></span></div>",
            "created":1334552400,
            "id":1317097,
            "title":"What Path?"
        },
        "1231":{
            "author_id":"3ragnu3",
            "author_name":"coldsnap",
            "choices":[
                "Toph asks Sokka why he opened up like that to her.",
                "Escaped Earth Kingdom slaves run into the \"gaang\"",
                "Toph apologizes for the loss of Sokka's mother"
            ],
            "content":"<div class=\"\"><div> <span>Sokka approached Toph. While she never got along too well with Katara their fight had been especially brutal that day. As he and Aang had both found from experience, Tom foolery had done little to lighten the mood. Being in Fire Nation territory made this kind of a fight much more serious. His steps were surprisingly quiet, but it didn't make a difference. She might be blind, but it didn't matter.<br>\r\n<br>\r\nShe could sense him.<br>\r\n<br>\r\nShe didn't turn and he didn't care. \"Come on. We need to talk.\" And with that he walked past her. He heard Toph sigh, but she followed him without voicing her complaints. After a minute or so they reached the cliff's edge and sat down. He was sure that the river below was a beautiful sight, but there was no way it could compare with the sun setting behind the waterfalls on the horizon. He silently wondered why he so rarely took the time to appreciate these picturesque views.<br>\r\n<br>\r\n\"So let me guess,\" Toph began. \"You brought me out here to tell me your sister's not as annoying as I make her out to be?\"<br>\r\n<br>\r\n\"Nah,\" he said casually. \"She's pretty much a pain. She's always got to be right about everything and she gets all bossy and involved and in your business.\" <br>\r\n<br>\r\n\"Yeah.\" Toph chimed in. \"I don't know how you can deal with it.\"<br>\r\n<br>\r\nHe leaned forward, resting his elbows on his knees. \"Actually, in a way, I rely on it.\"<br>\r\n<br>\r\nToph still sat there, staring into nowhere with her blind eyes. \"I don't understand.\"<br>\r\n<br>\r\nOpening up from his comedic side was tough, but Sokka went through with it. \"When our mom died, that was the hardest time in my life. Our family was a mess...But Katara, she had so much strength She stepped up and took on so much responsibility. She helped fill the void that was left by our mom.\"<br>\r\n<br>\r\nShe crooked her head slightly to the side, turning her head towards him. \"I guess I never thought about that.\"<br>\r\n<br>\r\nThere was a good chance that he'd regret saying this, but it was too late to turn back now. \"I'm gonna tell you something crazy. He started. \"I've never told anyone this before, but honestly: I'm not sure I can remember what my mother looked like. It really seems like my whole life, Katara's been the one looking out for me. She's always been the one that's there. And now when i try to remember my mom, Katara's is the only face I can picture.\"<br>\r\n<br>\r\nToph was looking fully in his direction now. Suddenly, Sokka felt awkward. opening up to anyone in a serious way was <i>not</i> his strong suit.<br>\r\n<br>\r\nToph filled in the silence. \"The truth is, sometimes Katara does act motherly, but that's not always a bad thing. She's compassionate and kind and she actually cares about me.\" She rubbed at one of her eyes. A tear? \"You know- the real me. That's more than my own mom...\" For a brief moment, she was quiet, was she about to cry? She hauled off and punched his arm. \"Don't <i>ever</i> tell her i said any of this!\"<br>\r\n<br>\r\n\"Hey,\" He said defensively. \"My lips are sealed.\"<br>\r\n<br>\r\nThey both walked back as the sun set. With at least one of the girls in a calmer state, Sokka decided that it would probably be a good idea to let them come to terms on their own. <br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1334552400,
            "id":1317145,
            "title":"Romance (with Toph)"
        },
        "124":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "weight gain ",
                "muscle growth",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will it be?</span></div></span></div>",
            "created":1444885200,
            "id":2047676,
            "title":"Toph"
        },
        "125":{
            "choices":[
                "  Romance (with Katara)",
                "  Romance (other) ",
                " Adventure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of story should we start with?</span></div></span></div>",
            "created":1338440400,
            "id":1349520,
            "title":"Zuko"
        },
        "1252":{
            "choices":[
                "Zuko tell her the turth",
                "Jin walks in on him fire bending",
                "everything go normally in the jade dragon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if Zuko got away with Iroh so Azula was unable to take over Ba Sing Se. So Zuko work with his Uncle in his tea shop so she was able to date Jin who Iroh hired to help with his new tea shop.</span></div></span></div>",
            "created":1356066000,
            "id":1492195,
            "title":"  Romance (other) "
        },
        "1253":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Yes adventure",
                "no Azula",
                "no someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you sure you want to go with Adventure or to pick another character from the Series</span></div></span></div>",
            "created":1530298800,
            "id":2513267,
            "title":"are you sure?/ more characters"
        },
        "13":{
            "choices":[
                "Aang ",
                "Katara",
                "Zuko",
                "Sokka",
                "Toph "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will our story focus on first?</span></div></span></div>",
            "created":1356066000,
            "id":1492168,
            "title":"After day of black sun"
        },
        "132":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "What if Katara mastered blood bending?",
                "next",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what will happen?</span></div></span></div>",
            "created":1453179600,
            "id":2091386,
            "title":"Katara"
        },
        "134":{
            "choices":[
                "What if Sokka didn't lose his sword.",
                " Romance (with Toph)",
                "Romance (other)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of story should we start with?</span></div></span></div>",
            "created":1356066000,
            "id":1492169,
            "title":"Sokka"
        },
        "14":{
            "author_id":"enderman",
            "author_name":"shadow writer",
            "choices":[
                "I have been buliding a force of my own ",
                "I have joined a new leader "
            ],
            "content":"<div class=\"\"><div> <span>It had been ten years since the end of the war most of the nations come to trust the fire nation under the rule of Zuko and with the help of the Avatar. With the Earth King missing after the war nobody took central command of the earth kingdom. Aang had been busy traveling the globe trying to find any remaining air benders so the earth kingdom had divided into several different Kingdoms ruled by different lords many problems arose from this. The southern water tribe had grown strong once gain with many water benders from the north coming down and aiding the southern tribe. Aang decided to travel to the earth kingdom to see how things are doing he found the problems and decided to travel to Omashu to see his friend Bumi to understand more of the problems. <br>\r\n<br>\r\n\"I am here to see King Bumi\"<br>\r\n\"Yes of course Avatar\" the young aide led Aang to Bumi's chambers<br>\r\n\"good to see you young Avatar\"<br>\r\n\"Nice to see you old friend\"<br>\r\n\"How is the rebuilding of the southern air temple that is what i heard you were doing last I heard\"<br>\r\n\"It is going well I have been trying to find possible new air benders throughout the three other nations\"<br>\r\n\"Well trying to rebuild your people things have gone into chaos here into the earth kingdom it seems with no one ruling the capital many war lords have shown up leading the small regions of the earth kingdom I have managed to keep the southern region under my control but it seems several warlords have been waring in the western region i would be fearful of one his name is Lord Chin he commands many deadly force of earth benders recently he has convinced the Dai Lee to join him with them at his disposal he has taken over much of the western region. At the moment he is building his new city he has protected several important families that has led him to bringing in new industry he has contacted the fire nation and they have been trading greatly.\"<br>\r\n\"What is the condition of Ba Sing Se\"<br>\r\n\"Without the royal family to rule a man named lord Chu has taken command he has no ambition he has continued to keep the caiptal defensive up but other then that the capital is doing nothing Lord Chu feels it is not his job to rule the earth kingdom he is waiting for a member of the royal family to appear or for a suitable replacement. if that replacement were to appear im sure that these small wars would be over the Ba Sing Se they still have there armies in place but currently not doing anything.\"<br>\r\n\"I will confront travel to the western region and end Lord Chin's expansion\" <br>\r\n\"Goodbye my young friend\"<br>\r\n\"thank you for the information, good bye old friend\" Aang's journey was quick and easy he approached the growing city he went into the building and went directly to the palace he recognized the Dai lee agents guarding the palace he was approched by several people but his range quickly led him into the center chamber<br>\r\n\"Are you lord chin\"<br>\r\n\"yes you must be the avatar\"<br>\r\n\"I am asking for you to end the warring in this nation peacefully now or else\"<br>\r\n\"or else what young Avatar\"<br>\r\n\"You do not want to challenge me It will only end in your losing and more violence\"<br>\r\n\"how will you defeat me young avatar you have no army you are powerful i admit but can you defeat an entire army\"<br>\r\n\"You do not want to know the lengths of my power\"<br>\r\n\"If you defeat what then defeat all the war lords trying to grab power\"<br>\r\n\"I am warning you to stop your actions or else the sitution will end in your defeat i must go now\"<br>\r\n\"good bye young avatar\" Aang traveled to the north eastern area of the earth kingdom he heard an old friend was preparing forces there <br>\r\n\"hello Haru\"<br>\r\n\"Aang great to see you what seems to be the problem\"<br>\r\n\"this warring in the earth kingdom\"<br>\r\n\"I agree that is why\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n   <br>\r\n</span></div></div>",
            "created":1258866000,
            "id":795338,
            "title":"Ten years after the war "
        },
        "15":{
            "author_id":"enderman",
            "author_name":"shadow writer",
            "choices":[
                "Book Four ",
                "Before the start of the series ",
                "Distant future ",
                "Distant Past ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here a list of other possibilities </span></div></span></div>",
            "created":1258952400,
            "id":795791,
            "title":"Other"
        },
        "152":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Obese Katara",
                "Earthbender Katara",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Here a two What if chapter in before the start of the series.<br>\r\n<br>\r\n1. What if Katara was eating a food and turn her into a obese girl and waterbender and unable to lose weight?<br>\r\n<br>\r\n2. What if Katara was a Earthbender instead Waterbender?</span></div></div>",
            "created":1312520400,
            "id":1162093,
            "title":"Before the start of the series "
        },
        "1521":{
            "choices":[
                "Zuko.",
                "Suki ",
                "Toph "
            ],
            "content":"<div class=\"\"><div> <span>Katara was in the kitchen of the house on Ember Island. When she found a weird fruit she never seen before growing off a dying tree. The fruit looked good so she thought she would pick it and get a better look at it. She turned it in her hand and put it up to her noise and sniffed at it. Smelled great there was no way she could split this fruit six way for everyone to share and it was the last one on the tree. She took a bite out of it it was the greatest thing so sweat and tasty she about to take another bite when someone walks in and its...</span></div></div>",
            "created":1354942800,
            "id":1483768,
            "title":"Obese Katara"
        },
        "15211":{
            "choices":[
                "She falls on top of Zuko",
                "Zuko tryed to help her get use to get new body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She shoves the rest of the fruit in her mouth. It was too late Zuko was about to say wait but she swallowed then her body started to swell she got wider and wider and her belly grew out.</span></div></span></div>",
            "created":1354942800,
            "id":1483777,
            "title":"Zuko."
        },
        "1523":{
            "author_id":"hybhyb",
            "author_name":"wellgreens‏",
            "choices":[
                "blood bending katara.",
                "toph can see.",
                "next."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what if katara already knew blood bending? <br>\nwhat if toph wasn't blind?</span></div></span></div>",
            "created":1316062800,
            "id":1187692,
            "title":"Next"
        },
        "15233":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Katara has a mom.",
                "scarless Zuko"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if Katara's mom lived?<br>\r\nWhat if Zuko wasn't scarred?</span></div></span></div>",
            "created":1330664400,
            "id":1287917,
            "title":"next."
        },
        "152332":{
            "author_id":"bigboy420",
            "author_name":"bigboy320",
            "choices":[
                "Scarless Zuko",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The last option didn't give you an other option so here's one</span></div></span></div>",
            "created":1599060900,
            "id":2896179,
            "title":"Continue with scarless Zuko?"
        },
        "153":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The Avatar of the 1940s, fighting Hitler in the Avatarverse WWII. ",
                "The Avatar of the twenty-first century, trying to revive tradition and save us.",
                "The modern Avatar of the far fututre, pure scifi action."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some future Avatar stories to choose from.</span></div></span></div>",
            "created":1330664400,
            "id":1287911,
            "title":"Distant future "
        },
        "154":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The Avatar before Yangchen.",
                "The First Avatar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are your optins.</span></div></span></div>",
            "created":1330664400,
            "id":1287906,
            "title":"Distant Past "
        },
        "1542":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Male.",
                "Female."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it male or female?</span></div></span></div>",
            "created":1330837200,
            "id":1289093,
            "title":"The First Avatar"
        },
        "15421":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Air Nomads",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What nation was he from?</span></div></span></div>",
            "created":1330837200,
            "id":1289094,
            "title":"Male."
        },
        "154212":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Water Tribe,Earth Kingdom,or Fire Nation?",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1330837200,
            "id":1289096,
            "title":"Other."
        },
        "1542122":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about,he has no nation and was a spirit to begin with?</span></div></span></div>",
            "created":1330837200,
            "id":1289100,
            "title":"Other."
        },
        "15422":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "She is an Air Nomad.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is she a member of the four nations or something else.</span></div></span></div>",
            "created":1331010000,
            "id":1290309,
            "title":"Female."
        },
        "155":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Yes",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if Someone places a Blueberry Curse on Katara thath will turn Katara into a Blueberry Katara?</span></div></span></div>",
            "created":1312520400,
            "id":1162089,
            "title":"Blueberry Curse on Katara"
        },
        "1552":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Sumo Katara and Toph",
                "Sumo Suki",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Here a two what if? chapter on Katara and Toph and Suki.<br>\r\n<br>\r\n1. What if Katara and Toph fell into a magic lake and turn Katara into a Sumo Obese Katara and turn Toph into a Sumo Obese Toph?<br>\r\n<br>\r\n2. What if Suki become a Sumo Suki?</span></div></div>",
            "created":1312520400,
            "id":1162095,
            "title":"Next"
        },
        "15523":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Evil Water tribe.",
                "Toph the girly girl."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a mirror-verse story?<br>\r\n1. The evil water tribe is attacking the world and Aang is found by Zuko and Azula.<br>\r\n2. toph is the uber girly daughter of wild Earthbending parents</span></div></span></div>",
            "created":1330664400,
            "id":1287922,
            "title":"Next"
        },
        "155231":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Evil Water tribe.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I realize I should have left more options,so I will.</span></div></span></div>",
            "created":1337317200,
            "id":1340046,
            "title":"Evil Water tribe."
        },
        "1552312":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Sure.",
                "Nah."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay,since the Avatar universe recently got expanded with \"the Legend of Korra\",how bout a crossover between the two series?</span></div></span></div>",
            "created":1337317200,
            "id":1340050,
            "title":"Other."
        },
        "15523121":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Korra back in time.",
                "Past Meets present."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay,how will it go? Will Korra visit her predecessor in the past or will the Gaang be sent to the future?</span></div></span></div>",
            "created":1337317200,
            "id":1340052,
            "title":"Sure."
        },
        "155231211":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Book 1:start at the begining!",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which period will Korra visit?</span></div></span></div>",
            "created":1337317200,
            "id":1340055,
            "title":"Korra back in time."
        },
        "1552312112":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The Promise trilogy.",
                "The time of Yukone"
            ],
            "content":"<div class=\"\"><div> <span>Okay,since going straight through the original series doesn't work for ya, how about the newly released \"Promise\" Trilogy that bridges the two series together? Korra might be of help there. Or how about the recently mentioned battle between an adult Aang and someone called Yukone? Korra's having visions of it recently so why not experience it for herself? </span></div></div>",
            "created":1337317200,
            "id":1340069,
            "title":"Something else."
        },
        "15523121122":{
            "author_id":"bigboy420",
            "author_name":"bigboy320",
            "choices":[
                "Lets keep going with Yukone",
                "Yeah lets go with book two or three"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Continue with Yukone or travel back during the events of book two or three</span></div></span></div>",
            "created":1599061980,
            "id":2896186,
            "title":"Or..."
        },
        "155231211222":{
            "author_id":"bigboy420",
            "author_name":"bigboy320",
            "choices":[
                "Sometime during book two",
                "Sometime during book three"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one then</span></div></span></div>",
            "created":1599062040,
            "id":2896187,
            "title":"Yeah lets go with book two or three"
        },
        "155232":{
            "choices":[
                "Girly girl",
                "Sensitive boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I like the idea...but What about, now what if Toph was actaully born a boy? And a sensitive one at that?</span></div></span></div>",
            "created":1509166800,
            "id":2407935,
            "title":"Toph the girly girl."
        },
        "1552321":{
            "author_id":"bigboy420",
            "author_name":"bigboy320",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So is Toph the only one who had their personality reversed or was it the whole gaang.</span></div></span></div>",
            "created":1599061440,
            "id":2896182,
            "title":"What about everyone else"
        },
        "15523212":{
            "author_id":"bigboy420",
            "author_name":"bigboy320",
            "choices":[
                "That sounds good",
                "No I think I have a better idea"
            ],
            "content":"<div class=\"\"><div> <span>So this is what I think their personalities reversed should look like<br>\r\n<br>\r\n<br>\r\nKatara - Tomboy (Pretty much just acts like toph)<br>\r\n<br>\r\nToph - Girly Girl (like katara but times 300)<br>\r\n<br>\r\nSokka - sensitive and shy<br>\r\n<br>\r\nAang - Pretty much always in a bad mood and very serious</span></div></div>",
            "created":1599061740,
            "id":2896185,
            "title":"Does this sound good"
        },
        "1552322":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "continue",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is this the idea you want to go with?</span></div></span></div>",
            "created":1558747260,
            "id":2663775,
            "title":"Sensitive boy"
        },
        "15523222":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "young azula",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what if one of the spiritual powers that Aang learn allows him to regress people and he uses it to regress Azula?</span></div></span></div>",
            "created":1558747560,
            "id":2663778,
            "title":"something else"
        }
    },
    "info":{
        "author_id":"enderman",
        "author_name":"shadow writer",
        "brief_description":"story based upon show avatar the last air bender. made up stories ",
        "created":1196555160,
        "description":"<td align=\"left\" class=\"norm\">keep to main story line have fun</td>",
        "id":1355821,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604619900,
        "modified":1604619900,
        "pretty_title":"Avatar the last air bender what if story"
    }
}