{
    "chapters":{
        "1":{
            "author_id":"eragon97",
            "author_name":"Weezy",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Kalen walked down the grassy path of the forest, sword-in-hand. He payed careful attention to anything-- or anyone who might want to attack him. Suddenly:<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<i>NOW ITS YOU TURN! CLICK CONTINUE AND CONTINUE THE STORY!/i}</i></span></div></div>",
            "created":1305754140,
            "id":1108399,
            "title":"Kalen"
        },
        "11":{
            "author_id":"belarch",
            "author_name":"Ere",
            "choices":[
                "You pay the fine ",
                "You say \"heck no!\" and pull out your sword to fight the troll"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A troll jumps out at him. It is short with a pig snout and has long sharp claws. It says \"Hehehe, I won't let you pass until you pay the fine- 500 gold pieces\" in a scratchy, nasal voice. </span></div></span></div>",
            "created":1305777420,
            "id":1108747,
            "title":"continue"
        },
        "112":{
            "author_id":"sakuracute13",
            "author_name":"Shizuka Mai",
            "choices":[
                "You arrived a a nice hut.",
                "There where flowlers and viens blocking your path.what now?"
            ],
            "content":"<div class=\"\"><div> <span>Calen smirks and then says. \"heck no!\" he pulls out his sword and then. gets into his stance,his family where good swords men so he had a chance with fighting and he wasnt going to lose to a troll ever! he ran towards the troll and went behind him as the troll tryed to smash him with his large wodden stick...<br>\r\n<br>\r\n\"you suck!\" callen yells and starts climbing his back slowly so he dosent notice. \"why you little!\" the troll said as he turned around looking for the man. \"where are you!?\" he roared and looked around as he started climbing his back when he got to his eye he stabed him. and jumped off. he ran passed him as quick as he could and ran for his next place.</span></div></div>",
            "created":1355496300,
            "id":1487954,
            "title":"You say \"heck no!\" and pull out your sw..."
        },
        "1121":{
            "choices":[
                "Befriend the Woman and Chat with her!",
                "Cut her down with your sword and plunder her corpse and hut!"
            ],
            "content":"<div class=\"\"><div> <span>          Calen cleaned his sword from the Troll and ventured forth. The forest went slightly uphill towards a clearing. Occasionally a bird was heard somewhere around. Calen had seen a hut here when he climbed the tree to finish off the Troll and now was his chance to investigate. <br>\r\n<br>\r\n          Calen sheathed his sword, holding the scabbard with his left hand though, in case he had to quick-draw the blade again. Vigilant and relaxed he advanced towards the hut. The small building was weather-worn and no sound could be heard. Calen approached the door carefully. <br>\r\n<br>\r\nJust as he stretched-out his right arm to open the door, it was opened from within! Calen looked at a young, copper-haired woman of mystifying beauty. The woman stared back at him with a slight smile on her lips. Sensing no danger Calen decided to:<br>\r\n<br>\r\n</span></div></div>",
            "created":1355936040,
            "id":1491037,
            "title":"You arrived at a nice hut."
        }
    },
    "info":{
        "author_id":"eragon97",
        "author_name":"Weezy",
        "brief_description":"Write short S+S story, and pass the blade,so next person continues story.1000 gps per add!",
        "created":1305687600,
        "description":"<td align=\"left\" class=\"norm\">      You write a short sword and sorcery story, and pass the blade, so the next person can continue the story. When you make a chapter, for choices just put one: write \"continue\". 500-2000 gps per addition. Enjoy!<br>\r\n rules: <b> Keep it 16+</b>(You can kill people, etc.)<br>\r\n <b>Keep it sword and sorcery</b><br>\r\n <b>DO NOT kill the character</b> (Unless he comes back to life)<br>\r\n Rate and Review and tell other people about this please! (Please I'm a newbie I will love and consider any thoughts, comments, and suggestions!)<br>\r\n</td>",
        "id":1777231,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1355936040,
        "modified":1355936040,
        "pretty_title":"Sword and Sorcery: Pass the Blade"
    }
}