{
    "chapters":{
        "1":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Angie",
                "Carmen",
                "Max",
                "George",
                "These Are not enough choices!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, so this is a third person story, so first pick you first character, btw, 1 on 1 romances at least at first.</span></div></span></div>",
            "created":1265605200,
            "id":832936,
            "title":"The Choice Part 1"
        },
        "11":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "George",
                "Max",
                "Carmen",
                "Copy of Herself? Whatever you say dude, not my story",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So ya picked Angie, and who do you want her to be with.</span></div></span></div>",
            "created":1265605200,
            "id":832946,
            "title":"Angie"
        },
        "113":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Breast",
                "Long smooth hot legs",
                "Butt or Feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mother daughter Latina couple, i can see you obviously have good taste. So tell me, What part of Carmen's Body does Angie have a Craving for.</span></div></span></div>",
            "created":1265605200,
            "id":832954,
            "title":"Carmen"
        },
        "1133":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Feet",
                "Butt",
                "Neither, she likes her charming face."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now now, you have to be a little more specific exactly which one does she like better?</span></div></span></div>",
            "created":1265605200,
            "id":832955,
            "title":"Butt or Feet"
        },
        "11331":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Angie notices Carmen looking at her feet constantly.",
                "Angie Keeps flirting with Carmen.  (Slower progression but better story)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ahh so you that type of person, ok that's cool, so tell me how do they start all of this?</span></div></span></div>",
            "created":1265605200,
            "id":832961,
            "title":"Feet"
        },
        "113311":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Carmen starts making out with her mother passionatly.",
                "(Two other choices)"
            ],
            "content":"<div class=\"\"><div> <span>Angie walked into Carmen room to talk with her about school.  Angie had been over obsessing over Carmen's feet lately, she had secret pictures of them hidden under her bed. Angie was barefoot with panties and a bra own since it was around bedtime.  Angie sat down on the bed beside Carmen who was also in her bra and panties.  \"Carmen, what has been going on at school, you have been acting up and bugging max all the time, are you okay?\" Carmen look up at her mother, \"Yes mom i'm fine, i've just been having these weird thoughts lately.\"  \"Carmen, what weird thoughts, you can tell me anything honey.\"  Angie said trying to be caring.  Carmen look up at her mother and said, \"Mom, i have been thinking about feet, like they, um.. arouse me.\"  Carmen said looking back down in embaressment.  \"Oh, Carmen it's okay, that's a family trait, all the woman in our family do that honey.\"  Carmen looked up at her mother, \"No, i like womens feet, specifically yours.\"  Carmen now overly embaressed looked down blushed red.  \"Carmen, i don't now how to say this, I....\"  Angie put a hand on her daughter's smooth leg and rubbed it gently to calm Carmen.  \"I think you feet are amazing, and since you said you like mine and i like yours we could well....\" Angie said. Carmen looked up at her mother, \"I know it is illegal and all, but one time can't hurt can it?\"  Angie said looking at Carmen hoping to get a good response........<br>\r\n<br>\r\nWhat does Carmen do?</span></div></div>",
            "created":1265605200,
            "id":832970,
            "title":"Angie notices Carmen looking at her feet consta..."
        },
        "1133111":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "They want to experiment around with their feet.",
                "They just want to press each other's feet to their vaginas till they finish off."
            ],
            "content":"<div class=\"\"><div> <span>Carmen looks up a her mother and smiles.  She leaps forward pushing Angie back onto the bed and begins kissing her passionately.  She forces her tongue in and licks around.  Angie meets this with her tongue, this is exactly what she wanted.  There smooth legs were on top of each other rubbing softly as they kissed.  Angie placed her hands on Carmen's back and Carmen placed her hands in Angie's silky hair.  As they continued to make sucking sounds with there mouths, Angie went down with her hands until she reached Carmen's panties, she slipped her hands under the seams of the underwear to feel a wonderful butt, so firm and clean.  She squeezed and slapped it, making Carmen moan as they kissed.  Carmen sat up and unclasped her bra and through it to the side revealing her b cup breasts, the nipples were dark, but her skin was so light, like the rest of her body.  She ripped Angie's bra off to reveal her C cup breasts.  \"Oh god this is gonna be good.\"  Carmen said and went back down to make out with her mother, Angie replaced her hands in Carmen's panties.  There nipples strained against each other causing both of them to moan.  They were so attracted to each other that it was amazing.  Angie stopped kissing Carmen so she could kiss on her neck, making Carmen moan with pleasure.  Angie pushed Carmen off of her and got on top of her and continued to make out, Carmen rubbed her hands down her mother's back into her panties, she felt the most big and full butt.  Carmen felt as if she had won the lottery.  Angie got up, \"Ok...\" She said out of breath, \"Not that this isn't great but i think we both know what we really want.\" <br>\r\n<br>\r\nWhat do the REALLY want?</span></div></div>",
            "created":1265605200,
            "id":832989,
            "title":"Carmen starts making out with her mother passio..."
        },
        "11331112":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "The story continues to their wedding.",
                "Nah, i'll end it here."
            ],
            "content":"<div class=\"\"><div> <span>Carmen pushed Angie off of her.  Carmen laid back on her back.  Angie got in front of Carmen's feet on her knees.  She picked up Carmen's left foot and looked at it with lust.  \"I've wanted this so long\" Angie said, Carmen looked on as her mother said this.  Carmen never knew her mom could want something so badly, She was glad that it was at least her she wanted.  <br>\r\n     Angie lifted the big toe into her mouth and sucked gently, moving her tongue around on the toe.  Carmen began moaning at the sensation, as was Angie from sucking this delicate object.  She released it with a pop.  She then took here heel and licked up from her heel to her toes.  She took her other foot and repeated the process.  Angie stood up on the bed and took her panties off revealing her tight vagina.  This was the first time she saw her new lover naked fully.  She got back down on the bed, then turned around with her butt facing Carmen and got into a doggy position.  \"Carmen, I want you to press your feet against my vagina until you see water flying out okay, honey.\"  Angie said, still trying to be like a mother.  \"You don't have to treat me like a child anymore, i know what it is.\"  Carmen said acting grown up, for a 16 year old she was still a witty one.  She placed her left feet's toes in her mother's hole.  She moved her toe around is circles while taking her other foot and rubbing her clitoris.  \"Oh, Carmen...\"  Angie moaned as her daughter pleasured her.  She moved her toe in and out while toying with Angie's clit.  \"God Carmen, don't stop please.\"  Angie moaned as she began to sawy back and forth so she could ride the toe.  Carmen took one foot and began to simulate Angie butt hole.  This drove her wild, She began rocked fast and screaming wanting more and more.  \"Oh Carmen, don't stop, don't stop, i'm Cumming!!!!!!\" Angie screamed.  Carmen felt it tighten until she pulled out.  Angie fell down in disipointment.  Carmen ripped her panties off and threw them to the side.  She turned her exhausted mother over so she could scissor grind her.  She put her feet in Angie's face and she took Angie's in her's.  She began to grind as she sucked on her mother's toes and licked the precious sole.  \"ooo, ooo, oo, ahhh.\"  Carmen moaned with the beat.  Angie was just screaming, only wanting to cum.  \"God Carmen, Ah, oh honey, oh sweety, ahhhh!!!!!!!!\"  Carmen continued as she began to grind hard, their pussies kissed against each other.  \"I'm cumming Carmen!!!\"  Angie screamed, Carmen quickly jumped down to Angie's vagina and began to pump her fingers in and out until the cum sprayed on her face.  Angie's hands were in Carmen's hair as her body flowed to a stop.  Carmen turned around and stuck her butt out.  \"Finish me.\"  She said.  Angie quickly pressed her feet onto Carmen's clit. \"Oh God mommy, please don't stop ahhh.\"  She softly moaned.  Angie then decided to get up and bury her face in her daughter;s back end, licking and fingering her daughter's vagina.  Angie's hands were on Carmen's butt, keeping her in place.  \"Here it comes, her it comes!!!!!!\"  Angie felt the vagina tighten against her tongue until a blast of juice came out on her face. \"Ahhhhh ooooooo god!\"  Carmen fell on the bed exhausted, they fell asleep naked together.</span></div></div>",
            "created":1265778000,
            "id":834267,
            "title":"They just want to press each other's feet t..."
        },
        "113311121":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "content":"<div class=\"\"><div> <span>So soon after their sexual encounter, Angie informed George of her relationship with Carmen.  A divorce came and went.  George ended up getting married to some other hot Latina chick named Constance Marie, whoever that was.  Although it was said she looked just like Angie.  Everyone else supported them being together, even Max.  Angie got down on her knees to propose to Carmen on their family trip to Disney world.  Carmen said yes, crying the entire way home from being so happy.  From that point they lived the rest of their lives together, having sex at least 3 times a day.  They adopted 3 Children naming them, Cli, Tor, and Is.  They lived happily ever after for the rest of time.</span></div></div>",
            "created":1265864400,
            "id":834523,
            "title":"The story continues to their wedding."
        },
        "113311122":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, you asked for it.</span></div></span></div>",
            "created":1268088780,
            "id":848073,
            "title":"Nah, i'll end it here."
        },
        "1133112":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Carmen gets up and walks out.",
                "She asks her mother if they could do some foot play."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two more choices for the previous chapter.</span></div></span></div>",
            "created":1265605200,
            "id":832973,
            "title":"(Two other choices)"
        },
        "115":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                " Veronica",
                "Victor",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok here are some more for you.</span></div></span></div>",
            "created":1265605200,
            "id":832947,
            "title":"More "
        },
        "1153":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Ernie",
                "Benny",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More and more and more, you do understand i have to do this to every character right?</span></div></span></div>",
            "created":1265605200,
            "id":832949,
            "title":"More"
        },
        "11533":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                " Linda(george's sister)",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some more of more and more.</span></div></span></div>",
            "created":1265605200,
            "id":832950,
            "title":"More"
        },
        "115332":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                " Gina",
                "Jason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok dude, here is more</span></div></span></div>",
            "created":1265605200,
            "id":832951,
            "title":"More"
        },
        "13":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Angie",
                "Carmen",
                "Another Version of himself",
                " George",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is max going to be with.</span></div></span></div>",
            "created":1265864400,
            "id":834528,
            "title":"Max"
        },
        "131":{
            "author_id":"venomrocks",
            "author_name":"venomrocks",
            "choices":[
                "Breasts",
                "Butt",
                "Whole body and curves"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Max love about his mom?</span></div></span></div>",
            "created":1317698100,
            "id":1200436,
            "title":"Angie"
        },
        "1313":{
            "author_id":"venomrocks",
            "author_name":"venomrocks",
            "choices":[
                "It worked!!",
                "Somebody else walked in the way."
            ],
            "content":"<div class=\"\"><div> <span>Angie walks into the kitchen and goes over to wash some dishes. She's wearing black skinny jeans and a blue t-shit that's kinda tight. Max was busy doing his homework but when his mom walked in he was completely distracted by her. He just couldn't stop staring. Max has wanted his mom for some time now but he has an idea that could really be fun. He found this remote on the way home from school that has a bunch of different functions. A body swap function in particular is the one he wanted to try. So Max eagerly pulls out the remote and fires away at his mom.</span></div></div>",
            "created":1317855300,
            "id":1201348,
            "title":"Whole body and curves"
        },
        "132":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                " Breast",
                "Long smooth hot legs",
                "Butt or Feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, brother/sister, maybe it is me, but this is gonna be hot.  What does he like about her.</span></div></span></div>",
            "created":1265913720,
            "id":834538,
            "title":"Carmen"
        },
        "1322":{
            "author_id":"gun5ling3r",
            "author_name":"Blackknight57",
            "choices":[
                "Strip her fully",
                "Tickle her somewhere else "
            ],
            "content":"<div class=\"\"><div> <span>One day Max and Carmen were home alone. Carmen was taking a nap and Max decided to have some fun. He quietly stripped her into bra and panties,then he tied her up. He grabbed a feather duster, an electric toothbrush, and some baby oil. He then started to lightly tickle her feet to wake her up. \" Max what are yooou haha doing.\" Getting some revenge\" Max replied. He then proceeded to tickle Carmen's feet. \"Hahahahahaha Max Stooooop or I swear I'll Hahahahahahahaha\". \"What was that I couldn't hear you over your laughter\" said Max with an evil grin.\" He then picked up the feather duster and tickled Carmen's legs. At this point she couldnt do anything but laugh. He then decided to?</span></div></div>",
            "created":1399750860,
            "id":1794431,
            "title":"Home Alone."
        },
        "1323":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Butt",
                "Feet",
                "Beautiful face."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whice one specifically?</span></div></span></div>",
            "created":1265913780,
            "id":834539,
            "title":"Butt or Feet"
        },
        "13231":{
            "author_id":"mrwoodson",
            "author_name":"mrwoodson",
            "choices":[
                "fuck her pussy",
                "fuck her ass"
            ],
            "content":"<div class=\"\"><div> <span>Max walks up behind carmen in order to unbutton her jeans and pull down the zipper, when carmen notices what he did she tries to pull them back up. Max says just step out of them sis, now and slaps her ass hard.<br>\r\nCarmen steps out of her jeans as she was demanded to , and what now max . Max lay down on the bed carmen,  you can't do this max says carmen . The hell i can't and then max fucks slowly fucks carmen up the ass . max stops and thinks what now</span></div></div>",
            "created":1462648920,
            "id":2144459,
            "title":"Butt"
        },
        "13232":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Max doesn't know what he wants, he just 12.",
                "Max knows what he wants, Carmen;s Feet!!!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok so how does this start</span></div></span></div>",
            "created":1265914080,
            "id":834544,
            "title":"Feet"
        },
        "132322":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "She shoves her feet down his throat.",
                "She rubs her feet all over his erect penis."
            ],
            "content":"<div class=\"\"><div> <span>Max walked out of his room to go bug Carmen.  He always bugged her, but secretly he liked her.  However he really liked her feet.  He spent all day dreaming about his penis touching the soles of her feet.  He had pictures of her feet that he secretly took, under his bed.  It was the one and only thing he masturbated to.  It didn't have anything to do with the smell or feeling of feet.  Just the pure look of them, and Carmen's had a very pure look.  He wasn't sure why he liked them, but he did, so he didn't really care.  He had heard of incest and such, but it didn't normally seem that bad, if someone loved someone what did it matter if they were related.  \"Max, get out of my room!\"  Carmen yelled, she was wearing pajamas and a extremely tight shirt for bed as usual.  Of course no shoes or socks.  \"No, give me your perfume!\"  Max took Carmen's perfume and ran around her room while Carmen chased him.  \"Max, quit it, now!\"  Carmen said running into Max pushing him down on the floor.  She fell on her back and her feet fell on Max's face.  Max couldn't help it, he instantly got a boner.  Carmen quickly got up and onto to Max trying to attack him.  She paused looking at Max with wide eyes, she felt something straining against her abdomen, she knew it was his penis.  She quickly got up to realizing this would be a perfect time to take advantage of her brother.  Plus she was always turned on by the idea of incest.</span></div></div>",
            "created":1266111120,
            "id":835732,
            "title":"Max knows what he wants, Carmen;s Feet!!!!!"
        },
        "1323222":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Pound her feet.",
                "Get scared and run."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Max, I know what you want.\"  Carmen said.  Carmen sat down and placed her feet in front of Max's face making him harder.  She then took then and hovered them over his erect penis.  He was wearing pants.  \"Carmen, no!\"  But before Max could stop her, she was rubbing her feet all around his pants.  Max laid his head back in agony.  The pleasure this was causing him was unparalell to anything he could describe.  \"I know how to make it feel even better.\"  Carmen said in a naughty voice.  Carmen was 16 and Max was 12.  She pulled his pants and boxers down in a swift motion to reveal his penis.  Carmen came over and placed her mouth over the erect object, consuming it into her mouth.  She moaned to make it feel even better.  \"Oh God!\"  Max yelped.  After Carmen made sure it was good and wet she ripped her clothes off in a fast manner.  Revealing her body to Max.  \"Oh my god!\"  Max said so surprised at his sister.  She came over and began to rub her bare feet all over his penis.  She then took then and began to jack Max off with her soles.  \"Oh  yes!\"  Max yelled.  Carmen had red nail polish on by the way.  Max stood up and looked at Carmen.  He is gonna.....</span></div></div>",
            "created":1266285540,
            "id":836979,
            "title":"She rubs her feet all over his erect penis."
        },
        "13232221":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "They go get married",
                "The end."
            ],
            "content":"<div class=\"\"><div> <span>Max put Carmen's back on the floor.  He lifted her feet up to her face, she was very flexible.  He put his penis close to Carmen's face.  Carmen reached down to her vagina to finger herself.  Max took her soles and placed them on his penis and he began to pound her feet hard.  Carmen was moaning as she fingered herself.  She was so turned on with her brother's penis in her face.  Max groaned and groaned.  \"Oh god Max, let me have it.\"  Max pounded harder and harder until the cum began to shoot onto Carmen's face.  Carmen closed her eyes and moaned as she cummed as well.  Max fell onto his sister as they went unconscious.    </span></div></div>",
            "created":1266286020,
            "id":836984,
            "title":"Pound her feet."
        },
        "132322211":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "content":"<div class=\"\"><div> <span>So it wasn't to long before it was found out that Carmen was pregnant.  And guess who the father was?  So George and Angie gave them consent to marry.  They waited until Carmen was 18 and they moved out.  They had many children after that.  They lived happily ever after and never fought again.</span></div></div>",
            "created":1267665780,
            "id":845593,
            "title":"They go get married"
        },
        "135":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                " Veronica",
                " Victor",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more choices for you.</span></div></span></div>",
            "created":1265864400,
            "id":834530,
            "title":"More"
        },
        "1351":{
            "choices":[
                "Body and Breasts",
                "Butt",
                "Feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Max love most about her ?</span></div></span></div>",
            "created":1371103740,
            "id":1610214,
            "title":" Veronica"
        },
        "1353":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Ernie",
                "Benny",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more choices for you.</span></div></span></div>",
            "created":1265864400,
            "id":834531,
            "title":"more"
        },
        "13531":{
            "choices":[
                "sniffs and licks.",
                "licks his balls and up his shaft."
            ],
            "content":"<div class=\"\"><div> <span>everyone is sitting at the table playing cards when Max slips down below the table and scoots over to where Ernie was sitting and then someone asked where Max had gone, someone said they think to the bathroom and as Max hears this he reaches up and fumbles with ernies button and zipper, when ernie looks down he sees max and he is shhhhing him, then drops back down and freed ernies cock.<br>\r\n<br>\r\nErnie is shuffling in his seat until his pants were down to his knees and Max then picks up his semi hard cock and ...</span></div></div>",
            "created":1437506820,
            "id":2010765,
            "title":"Ernie"
        },
        "135311":{
            "choices":[
                "engulfs his huge cock, as much as he can.",
                "starts stroking his daddy."
            ],
            "content":"<div class=\"\"><div> <span>Once Max freed Ernies cock he starts to sniff his balls and then licks them, Ernie is having trouble keeping still .... then Max starts licking up his shaft and ernies hand then comes down on Max's head and keeps him licking on his cock.<br>\r\n<br>\r\nMax was not satisfied with just licking and follows up ernies big cock until his small mouth was at the head and Max fills up his mouth with as much of ernies cock as he could get, ernie closes his eyes and when he opened them George was looking at him knowing something was going on, Lucky for ernie that no one else noticed his situation but geroge.<br>\r\n<br>\r\nGeorge then accidently dropped one of his cards on the floor and bends down to pick it up and see's his young son with ernies cock in his small mouth .... George then sits back up but his hands were under the table unbuttoning his pants and pulling down his boxers, George then kicks max under the table, when max feels his dad kick him he is startled and looks over and sees his dads cock out.<br>\r\nMax quickly stops sucking ernie and quickly scoots over to his dads cock and ....</span></div></div>",
            "created":1438592220,
            "id":2015981,
            "title":"sniffs and licks."
        },
        "13533":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Gina",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are the last few. </span></div></span></div>",
            "created":1265864400,
            "id":834534,
            "title":"more"
        },
        "135332":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                " Linda",
                " Jason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the last of it.</span></div></span></div>",
            "created":1265864400,
            "id":834536,
            "title":"more"
        },
        "15":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Veronica",
                "Victor",
                "Ernie",
                "Benny",
                "Damn it man, more!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok you picky picky man/woman, here are four more.</span></div></span></div>",
            "created":1265605200,
            "id":832939,
            "title":"These Are not enough choices!"
        },
        "155":{
            "author_id":"jjj5543",
            "author_name":"Zeztymon",
            "choices":[
                "Linda(george's sister)",
                "Gina",
                "Jason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok Fine! Here are some more! But this is it!</span></div></span></div>",
            "created":1265605200,
            "id":832941,
            "title":"Damn it man, more!"
        }
    },
    "info":{
        "author_id":"jjj5543",
        "author_name":"Zeztymon",
        "brief_description":"Love stories with pairings of ANY characters, i'm talking anything goes.",
        "created":1265673180,
        "description":"<td align=\"left\" class=\"norm\">Ok so, you may do any pairing of any sort, i don't really care how vulgar or it is or what direction it goes in, i'll be making a lot of the paths, my fav is Angie/Carmen in my opinion it is the best pairing EVAR. So enjoy</td>",
        "id":1643991,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1462648920,
        "modified":1462648920,
        "pretty_title":"George Lopez: Love Games"
    }
}