{
    "chapters":{
        "1":{
            "author_id":"dawoolf989",
            "author_name":"Dawoolf",
            "choices":[
                "Jeanne Lieve",
                "James Lieve",
                "Cheryl Bridges",
                "Frankling Jerricho",
                "Danielle Lianna"
            ],
            "content":"<div class=\"\"><div> <span>Marble city, a great place of innovation and freedom that many people here share while also having to deal with big companies, tricksters, and accidental reality bending, but that is all for a later time.  For now picking out the focus of traveling the city will be the start.<br>\r\n<br>\r\n-Jeanne Lieve:  A black furred rabbit with small white spots around the midsection and thighs that stands 5'7\" tall.  Jeanne's ears drape down her back reaching right under her shoulders.  Has shoulder length hair which is naturally a black color, but is currently died a dark red color.  Her body is rather slim not having any noticeable curves and is rather flat chested only being an A cup.<br>\r\n<br>\r\n    Jeanne has lived in Marble City her whole life currently held up in a small one bath one bed apartment as she prefers smaller spaces to live in.  She works as a manager in her fathers comic shop 'Hero's Comics'  That she plans on taking over when Henry Lieve eventually decides to retire.  Jeanne has a twin brother named James Lieve who ended up taking after his mother as a university professor, but the two enjoy each others company well enough.  Her whole family consists of nerds from simple video gaming to collections and conventions and Jeanne is pretty close to the convention part of that scale.  Jeanne herself is a rather monotone speaking woman who tends to be very sarcastic (Especially speaking to someone she doesn't like), but still can be cheery and enthusiastic when the situation calls for it.  Is currently 22 years old.<br>\r\n<br>\r\n-James Lieve:  A white furred rabbit with small black spots around the midsection and thighs that stands 5'8\" tall.  James's ears drape down his back reaching right under his shoulders.  Has short black hair that he prefers keeping it short rather than growing it out.  He has a slim body with slight traces of athleticism, but still overall unimpressive, and wears a pair of rectangular glasses.  Is currently 22 years old.<br>\r\n<br>\r\n   James has lived in Marble City his whole life and currently lives in a shared apartment space of 3 bed and 1 bathroom with two roommates.  He works as a teachers assistant and a tutor as he works through college to earn his masters.  Has a twin sister that is mentioned above and has no bad blood with her or any of his family.  Is very into board games, table top games, and writing, especially big on dungeons and dragons.  James himself is a rather cheery person, but tends to get embarrassed easily if teased, he also is a very generous person having worked on community and charity projects before and plans on too in the future.<br>\r\n<br>\r\n-Cheryl Bridges: A cherry red furred cheetah with black spots that stands at 5'10 tall.  Cheryl has black hair that is tied into a pony tail at most times  that reaches past her shoulders.  Has a rather athletic body due to her daily exercise routine that is used to counter balance her sweet tooth habits, but still sports a pair of sizeable breasts.<br>\r\n<br>\r\n   Cheryl moved to Marble city shortly after turning 18, is currently 24 years old now, to advance her career as a photographer as she had gotten a job at a local magazine 'Marble Marvels' shortly after school.  Currently lives in a 2 bed and 2 bath apartment shared with one roommate.  Is very much into her work as a photographer, but also enjoys books, and many of the MMORPG's if she has spare time for them.  Cheryl herself is a rather happy go lucky personality with a real knack for being energetic all the time and always friendly to start conversations.<br>\r\n<br>\r\n-Franklin Jerricho:  A swamp green colored Saltwater Crocodile that stands at 10'11\" tall.  Franklin has dark ridges on his head that would boast the same spot as hair.  Has a rather fat body with most of it focused on his middle, but still with thick arms, legs, and chest with a round face.<br>\r\n<br>\r\n   Franklin moved to Marble City with his family at the age of 16 quickly getting into work as a security guard which he currently holds to this day working outside of 'Reality CO'.  During that time as a very stationary security guard his weight skyrocketed as he stayed at that position until he was 24 years old where he currently has applied for an indoor position.  Currently he lives in a studio apartment by himself that he rather enjoys since its less doors he has to worry about squeezing through.  Franklin himself is very much a gentle giant outside of work, but still keeps his security job seriously when on duty.<br>\r\n<br>\r\n-Danielle Lianna:  An arctic white wolf that stands at 6'0 tall.  Danielle has very long lower back length white hair.  Has a rather blessed curvaceous body with her breasts being a massive medicine ball sized with a just as heavy rear with wide hips and thick thighs to match.<br>\r\n<br>\r\n   Danielle has lived in Marble City her whole life having been born to a clan of magic wielding wolves that were all born with their own unique talent in magic.  Danielle's specific talent had to do with the body, being able to change and shape herself and others with a wave of a wand, and to this day its unknown if her body was changed to the blessed curves she has or if its all natural.  Currently she owns a body mod shop, a small one at the end of a strip mall named 'The Magic Shape' that gets enough business to keep her living.  Danielle lives in a small space above her store so she is almost always close to work, unless she decides to go out for the day.  Danielle herself is a very friendly, but very strait forwards as she doesn't believe in subterfuge.</span></div></div>",
            "created":1556170260,
            "id":2649965,
            "title":"Where it all begins."
        },
        "12":{
            "author_id":"dawoolf989",
            "author_name":"Dawoolf",
            "choices":[
                "\"New mall opening?  I have some extra cash\"",
                "\"What's this strange app?  I don't remember downloading it\"",
                "\"I have a package waiting for me?  I wonder who sent me something\""
            ],
            "content":"<div class=\"\"><div> <span>The sound of a loud thump followed by a crashing noise was what woke James up this morning, but as usual it was always a loud sound that ended up waking him up this early in the morning.  Grumbling to himself about noisy people he slowly dragged himself out of bed and stumbled slowly out of his room to find that one of his room mates, Ryan Troy a tall athletic lion, had knocked over the coffee machine onto the floor which currently sat in many pieces.<br>\r\n     \"Again?\"  James asked noticing the broken appliance on the floor as the split coffee spread across the tiled floor.<br>\r\n     \"Listen its okay, I can fix it!\"  Ryan assured, a little panic was noticeable in his voice as he knelt on the ground trying to pick up the pieces, \"Okay I can buy a new one.\"  The lion eventually admitted with a nervous smile and a shrug.<br>\r\n<br>\r\nJames took a closer look at his roommate the tall lion was a good guy at heart, but definitely a muscle head and an as graceful as a semi truck trying to do ballerina.  His thick muscles stretched out the red tank top he wore and his black sports shorts showed that he had just come back from his morning run.<br>\r\n<br>\r\n     \"Its fine man I didn't plan on coffee this morning anyways I don't have to be anywhere.\"  James admitted before heading into the bathroom to get ready for his morning.  A shower, oatmeal, and a fine choice in a white button up shirt with a pair of jeans later he was ready to set off for the day, but he still hadn't figured out what he was going to spend his day on as he looked at his phone to see if anyone had contacted him.</span></div></div>",
            "created":1556171040,
            "id":2649973,
            "title":"James Lieve the male nerdy rabbit."
        },
        "122":{
            "author_id":"dawoolf989",
            "author_name":"Dawoolf",
            "choices":[
                "Wealth",
                "Fertility",
                "Charisma"
            ],
            "content":"<div class=\"\"><div> <span>     \"Genie?  What kind of game is this?\"  James asked as he sat down on his bed examining his smart phone tapping on the app.  After short load and a very stereotypical genie was waiting for him on the screen, blue skin, wearing a turban, and his lower half was leading into a brass lamp that was pictured on the screen.  His upper half was resembling a wolf anthro with a big smile on his face as he held up a circle that read 'Daily Wish' On it.  James's curiosity got the better of him as he hit the button figuring if it was malware it had already installed itself on his phone so it was to late to prevent it from doing anything.<br>\r\n<br>\r\nThe screen filled with a dark blue smoke before slowly revealing three options before him \"Wealth, Fertility, or Charisma?\"  The rabbit asked himself as he stared as the options, \"What is all of this about?\" He asked as is finger hovered over the...</span></div></div>",
            "created":1556171580,
            "id":2649976,
            "title":"Genie in a phone."
        },
        "1222":{
            "author_id":"dawoolf989",
            "author_name":"Dawoolf",
            "choices":[
                "James suddenly looked pregnant.",
                "Ryan suddenly looked pregnant.",
                "Ryan and James suddenly looked pregnant."
            ],
            "content":"<div class=\"\"><div> <span>James tapped the fertility option mostly out of curiosity in what would happen as he wasn't expecting to suddenly get money, or become more social if he went for the other two.  The genie appeared once again on the screen slowly drifting down from the top until he was on center with the text bubble reading 'Wish Granted' then a little animation of him snapping.  James felt a small shock coming from his phone causing him to drop it on the bed as he shook his hand.<br>\r\n<br>\r\n     \"Are you kidding me?  It just turned my phone into a stun gun.\"  James complained as he stood up from the bed and paced a few times back and forth as he shook his hand trying to shake the pain out of it.  The rabbit soon walked up to the bed and gingerly touched his phone again to make sure it didn't shock him once more, but thankfully it was back to normal.  He soon picked up his phone and pocketed it thinking how much of a waste of time that was as he ventured out of his room once again thinking a trip to 'Hero's Comics' would get him in a better mood.  As he stepped out into the kitchen which was a necessary stop if he wanted to leave his apartment through the front door, he spotted Ryan putting the finishing touches on cleaning the broken coffee pot and the coffee.<br>\r\n<br>\r\n     The lion looked up to James \"Oh hey!  Just finishing up.\"  He assured sweeping the last bits of glass into the dust bin and pouring it into the trash before setting the broom and bin down, dusting his hands off, and looking at the rabbit again with a big smile on his face, \"If you're heading out somewhere I can come with and get us some lunch.  You know as a way for making up with the coffee... Again.\"  He mentioned wrapping his arm around rabbit in a friendly gesture as he was used to doing at this point.  At the moment of contact James felt the same numbness from getting shocked by his phone suddenly came back as the strangest thing happened.</span></div></div>",
            "created":1556172420,
            "id":2649980,
            "title":"Fertility"
        },
        "12221":{
            "author_id":"dawoolf989",
            "author_name":"Dawoolf",
            "choices":[
                "Held hands the whole way more contact=more kids.",
                "Made it to Jacks Burgers with no issue.",
                "Saw a familiar face on their walk to the resturant."
            ],
            "content":"<div class=\"\"><div> <span>James felt the numbness in his middle which soon lead to feeling nauseous as he placed his hands on his stomach.  Though the usual flat mid section he was expecting was different as he looked down to see that it was sticking out, and as he watched it was swelling bigger as well.<br>\r\n<br>\r\n     James was a little more than surprised at the sight as he jumped startled, and gave a small yelp \"Ah! what is happening?\"  His hands continued to feel around his middle as it started stretching out the buttoned shirt he had on and soon enough *PING*  the lowest button popped off and hit something metal in the kitchen.<br>\r\n<br>\r\n     \"What the little guy giving you trouble?\"  Ryan asked as he knelt down next to the rabbit and placed both of his large hands on the swelling middle and placed his ear up to it as if James was always like this.  The rabbit stared a bit in disbelief as this happened and not even sure what to make of the situation.  He was a guy and he was getting pregnant?  Another button popped off as he got much closer to looking like he was full term at this point.  That's when James felt the first kick just a little tap against his side that caused his heart to flutter, but not with fear rather something joyous.  A smile slowly took over the panic and confusion on his face as he was rather calmed by the sensation.  Another button popped off letting his gravid belly grow unhindered at this point as he was starting to reach full term with twins size.  Ryan continued to rub large circles on his belly as he looked up at James, \"I bet they are just hungry.  Come on lets go get some food.\"  Ryan suggested as he got back to his feet with a massive grin on his face clearly happy about the situation.<br>\r\n<br>\r\n     \"Yeah just... Let me get changed.\"  James had replied slowly stepping back to his room as he had to figure out how to walk now with such a heavy weight in front of him now.  Staring into the long mirror that was in his room he saw himself with the large gravid middle pressing out of his ruined shirt.  The sight of it got him flustered as he actually enjoyed the feeling, the look of it, \"Oh god this is amazing.\"  He muttered to himself as he rubbing his belly slowly.  Remembering his phone he pulled it out of his pocket and saw the app was still open and it read 'The powers of the wish vanish by 8:30 tomorrow'  With the genie saying it in a speech bubble.  At this time James realized that the wish had come true, and it turns out he was enjoying it way more than he thought he was as he covered his face embarrassed for the moment before taking a deep breath and returning to the living room wearing the same shirt still wanting to have his middle exposed, \"Alright lets go to Jacks then.\"  James suggested as the two started leaving the apartment.  Ryan taking a hold of James hands as the walked, something that James could quite get used too as he squeezed his hand in return.</span></div></div>",
            "created":1556174280,
            "id":2649994,
            "title":"James suddenly looked pregnant."
        },
        "122211":{
            "author_id":"dawoolf989",
            "author_name":"Dawoolf",
            "choices":[
                "The genie app had given him a message, \"Watch this ad for a free daily wish\"",
                "His sister messaged him asking where he was at the moment.",
                "Work was giving him a message confirming the maternity leave."
            ],
            "content":"<div class=\"\"><div> <span>As he was leaving, James started having strange visions in his mind which soon turned out to be memories, a whole other life flooded into his vision for a moment as he remembered dating Ryan shortly after becoming roommates and soon figuring out that James had Seahorse Syndrome which is why he's pregnant now.  This strange new reality though seemed more happy in the rabbits mind as he was slowly tug along by the lion as they made their way slowly  down the sidewalk.  Their simple hand holding had a certain effect on James though as the two stayed in contacted it seemed to add to his litter swelling past twins into triplets, then quints.  As the growth continued the rabbits waddle become wider and slower as he had to compensate for the sudden weight.  James felt his jeans feeling tighter as well as his hips widened, as ass plumped up and his thighs thickened as his body was taking a much more maternal shape as the lithe rabbit was no more.<br>\r\n<br>\r\n     \"We are almost there, do you need a break?\"  Ryan asked slowing down to a stop as had one hand on the rabbits large middle now which only made the swelling worse, but like last time the lion didn't seem to notice.  The white furred sphere that was James's belly continued to grow larger surpassing the size of a yoga ball as Ryan continued to give his middle affection, and he was loving every second of it.<br>\r\n<br>\r\n     \"N-no I'm fine I can see Jacks from here.\"  The rabbit assured as he continued waddling with one hand holding the Lions hand and the other rubbing his own massive belly feeling it swell against his fingers.<br>\r\n<br>\r\nSoon the two finally arrived at Jacks, a simple burger joint that had been in the city for as long as James could remember as he always came here as a kid.  The glass double doors were held open for him by Ryan as he waddled on through and seeing the black and white tiled floors, the neon signs, and the 80's memorabilia really brought a smile to the rabbits face.   They picked a table and sat down with James sitting sideways to the table as his belly would get in the way of food and drink.  The rabbit could actually feel his widen hips and ass spill off the sides of the chair he sat in which brought a blush to his face.  Ryan on the other hand sat right in front of James's massive belly always giving it rubs and attention while they waited on someone to hand them a menu continuing the rabbits growth.  James was all to happy to continue his growth rather enjoying the size, the feeling of life in him his attention was brought back to reality as his phone began to ding, someone was messaging him.  Pulling out the phone he saw...</span></div></div>",
            "created":1556260560,
            "id":2650455,
            "title":"Hand holding so lewd."
        },
        "123":{
            "author_id":"dawoolf989",
            "author_name":"Dawoolf",
            "choices":[
                "Change himself",
                "Change his roommate",
                "Change a female friend"
            ],
            "content":"<div class=\"\"><div> <span>James certainly didn't order anything, or at least anything he would remember and he hasn't gone drinking in a good few months.  His apartment had a convenient system that would send him a text message when ever a package in his name showed up.  Heading out of his room and passing the kitchen he saw the lion trying his best to clean up the broken glass with a brush and dust pan, <br>\r\n\"Make sure you clean up the coffee you spilt too.\"  James mentioned as he passed.<br>\r\n  A quick trip downstairs and seeing the plan brown package waiting for him oddly it had no return address or any other name other than his own, but curious he opened the box there and then to find what appeared to be a small black device about the shape and weight of a brick with a trigger on the side and a speaker on the front.<br>\r\n\"Recorder?  But why?\"  The rather confused rabbit asked to himself under his breath as he clicked the button on the side setting it up to record, \"Big plate of waffles.\"  He mentioned before stopping the recording.  A moment later he chuckled to himself, \"I think it works.\"  Before he could hit the playback button he suddenly found himself carrying a serving tray of waffles which shocked him a little causing him to drop it onto the floor in panic, \"What?  When?\"  He started asking before his eyes went back to the recorder in his other hand and seeing the label on the front of it, \"Dictaphone huh?  I wonder what else you can do.\"  James said as he started walking away, but stepped on one of the dropped waffles, \"Oh right, the carpet on the first floor is completely clean.\"  He spoke into the Dictaphone which soon mirrored reality as the mess of waffles disappeared as well as the brown carpet getting a freshly installed look to it.<br>\r\n<br>\r\nMaking his way up stairs and quickly back to his room he closed the door gently behind him so he wasn't disturbed as he looked at himself in the standing mirror in his room, \"Now what first?\"</span></div></div>",
            "created":1559023920,
            "id":2665174,
            "title":"\"I have a package waiting for me?  I wonder..."
        }
    },
    "info":{
        "author_id":"dawoolf989",
        "author_name":"Dawoolf",
        "brief_description":"Pick the choices of 5 different fur's in this city adventure.",
        "created":1556167260,
        "description":"<td align=\"left\" class=\"norm\">This interactive story takes place in Marble City, and this city has many powerful businesses, hidden magic, and advanced technology all in once place.  The population of the city are anthro's of all shapes, sizes, and species and you will making choices for one of 5 of them.  Now as for the story itself it will include things like weight gain, inflation, growth, hyper, pregnancy, or any combination of those in what ever colorful format you would like, but description would be necessary if you wanna post a story on here.  Nothing like toilet stuff, gore, uncleanliness please.  Also please when making choices do not give the freedom of making something up as I don't want an infinite line of trying to get something set up, but nothing actually happening.</td>",
        "id":2189232,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1559023920,
        "modified":1559023920,
        "pretty_title":"Marble City (A Furry Story)"
    }
}