{
    "chapters":{
        "1":{
            "author_id":"scotland1983",
            "author_name":"Scotland1983",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you start off as</span></div></span></div>",
            "created":1241931600,
            "id":689064,
            "title":"gender start"
        },
        "11":{
            "author_id":"scotland1983",
            "author_name":"Scotland1983",
            "choices":[
                "4 year old girl",
                "7 year old girl",
                "15 year old girl",
                "21 year old girl ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you suddenly are</span></div></span></div>",
            "created":1241931600,
            "id":689069,
            "title":"Male"
        },
        "111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "\"I dont know\"",
                "\"Yay im older now!\"",
                "*Laughs*"
            ],
            "content":"<div class=\"\"><div> <span>You're Matthew Johnson, a 16 year old High School sophomore. You had just gotten out of school, and were walking home. You were walking up your street to your house, not paying much attention to anything, when suddenly you run into someone or something, and lose consciousness.<br>\r\n<br>\r\nYou come to about 5 minutes later, and see that everything seems smaller to you. You sit up, and suddenly realize that, instead of wearing your jeans and tank-top, you're suddenly wearing a dress. You feel different, you are smaller, laying in front of you is yourself. You ask what hapend it replies</span></div></div>",
            "created":1311742800,
            "id":1155942,
            "title":"4 year old girl"
        },
        "1112":{
            "choices":[
                "You search for clues about how she did this to you.",
                "You start thinking like a little girl now. ",
                "Something else unexpected suddenly happens .....?"
            ],
            "content":"<div class=\"\"><div> <span>You ask your old body what's going on. And instead of answering, your male teenage body starts jumping around and dancing like a little girl.<br>\r\n<br>\r\n\"Yay, I'm older now!\" says your body. <br>\r\n<br>\r\n\"Hey, I don't want to be a little girl!\" you say. <br>\r\n<br>\r\n\"Neither did I,\" says your old body, sticking its tongue out at you. \"But now you are a little girl. And your mommy makes you always wear frilly dresses and skirts. And you're not potty trained yet, so you're still stuck wearing pull ups. See how miserable your life is? I couldn't wait to escape and become somebody older!\"<br>\r\n<br>\r\n\"But how did you do this?\" you ask. <br>\r\n<br>\r\nInstead of answering, your old body just giggles and walks away leaving you trapped like this.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1447995600,
            "id":2064666,
            "title":"\"Yay im older now!\""
        },
        "11121":{
            "choices":[
                "before your \"parents\" come in",
                "after your \"parents\" step aside to talk to your real parents"
            ],
            "content":"<div class=\"\"><div> <span>You are now in \"your\" room looking for the way you were switched. \"Bianca\" That must be you, \"Yes.\" You reply. \"Honey, can you come here and get ready I need to go to the store.\" \"No thank you I will stay here.\" \"Absolutely not young lady, get down here now.\" You forgot you were only four and had to play this up now. \"But, Mom!\" \"Bianca Michelle, get down here now!\" Played it up too much time to run. You bolted down stairs now force to go to the damn store. You spend an hour at the store with you \"Mother\" and while there you actually see your real mother. Both your mother and your \"mother\" begin talking. Your mother begins talking about how you, the girl that took over you body, is not acting right. You are watching baby shows, you are talking like you are 4, you even asked what that thing between your legs were, and craziest of all he peed himself. That is when you began forming a plan, \"Mo-Mrs. Johnson.\" Your mom and you \"mom\" look at you. \"Matty earlier was walking down the street on his phone and ran into me and it looked like he hit his head, but he got up and ran away yelling, 'I am no longer a little girl, Yay!' so I thought he was just being silly.\" Your mother looked horrified, \"Oh my god my son has a concussion.\" \"You might also want to call his girlfriend, she's nice and might help him remember that he is a boy.\" Your mom, \"That is a really good idea sweetie.\" \"Thank you Mrs. Johnson.\" You returned home with your mom and you ran upstairs to continue looking for how to change back. Your \"dad\" came home and your \"mom\" explained the whole situation with him about your \"neighbor\" Matt. You walked up and pushed up some tears, Your dad sees you and says, \"honey what wrong, is it Matt, he will be ok.\" You say, \"B-but if I said something sooner he would be better.\" Your dad, already hearing that side of the story, says, \"Oh, you didn't know, plus, in telling what happened you might have helped him get better sooner.\" \"Can we see him.\" \"Aw, sure, but tomorrow, he probably needs his rest.\" You smile, a cunning smile knowing that he will get no rest if they think he has a concussion and said, \"Okay tomorrow.\"<br>\r\n<br>\r\nThe next day </span></div></div>",
            "created":1473483600,
            "id":2208599,
            "title":"You search for clues about how she did this to ..."
        },
        "111211":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Act like a 4 year old, the best you can",
                "Act normally (as yourself) but if anyone asks say you are four",
                "Tell everyone you are really Matt."
            ],
            "content":"<div class=\"\"><div> <span>You had to wait until tomorrow.  There was nothing you could do but pretend to be a little girl as much as you could.  You went to your room and laid upon your bed and tried to think of what to do.  But there was nothing.  You didn't want to play with toys, you couldn't watch TV because people would expect you to watch kiddie shows.  So you sat and waited for tomorrow to arrive.<br>\r\n<br>\r\nA while later, you new mom came to the room.  \"Honey do you need to go potty?\"<br>\r\n<br>\r\n\"No, I don't think so.\"<br>\r\n<br>\r\n\"Let's try anyway.  Trying is the only way you will learn.\"<br>\r\n<br>\r\nYou protested, but you mother would have none of it.  She made you go to the bathroom, then she pulled down your pullups, lifted your skirt and had you sit on the potty.  You didn't know what to do, you didn't have to go.  \"I don't have to.\"<br>\r\n<br>\r\n\"Just sit there, you will.\"<br>\r\n<br>\r\nThen she turned on the water.  The sound of running water sometimes made you have to do when you were yourself.  But you didn't have to go anyway.  You didn't know how long you had to wait with your pullup at your ankles and your mother staring you you saying to just relax.  After ten or fifteen minutes, she gave up.  You got up and your mother pulled the diaper back into place.  \"OK, we'll try again in a hour,\" she said.<br>\r\n<br>\r\nSince you tried every hour eventually you did go and you mother was overjoyed or so it seemed.  You could have just told her when you needed to go and it wouldn't have been a problem.<br>\r\n<br>\r\nAt night you mom put you to bed, read you a story and and did Bianca's usual nighttime ritual.<br>\r\n<br>\r\nThe next day you said you wanted to see Matty.  But your father told you, \"Matty is sick.  They took him to a place to make him well.  You can't see him until he gets back.\"<br>\r\n<br>\r\n\"What do you mean sick?\"<br>\r\n<br>\r\n\"You wouldn't understand.\"  You couldn't get your father to tell you what happened.  You didn't know if he went to a regular hospital or the nut house.  Until you could get to your body, you knew there was nothing you could do.  You were stuck this way.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1508648400,
            "id":2405093,
            "title":"Your body is gone."
        },
        "1112111":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You confide in your parents",
                "An adult sees you, says she is Bianca",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You knew that telling your parents the truth wouldn't help.  You had to bide your time, not make any waves and then wait until you could get your body back.  This meant you had to act like a little girl as best you could.  You had to pretend to play with dolls and toys, watch a lot of Sesame Street and shows like that and spend a lot of time 'learning' how to potty.  The problem was that you kept having small accidents since your muscles weren't strong enough.  But it was more like a few drop here and there.<br>\r\n<br>\r\nWhenever you asked about Matt your parents would say he is away and they are trying to make him better.  One day you heard 'your parents' talking.<br>\r\n<br>\r\n\"I just got off the phone with Carol (Matt's mother) and it's not going well,\" your new mom said.<br>\r\n<br>\r\n\"What is happening?\"<br>\r\n<br>\r\n\"Well they took him to the hospital and took an MRI.  There doesn't seem to be anything physically wrong with his brain, but he has regressed.  He is acting like a little kid.  They don't know why.  He said he is OK but he isn't acting like a teen.  They caught him sucking his thumb and he keeps turning on cartoons on his TV.    He can't seem to control himself so they had to put him into a diaper.\"<br>\r\n<br>\r\n\"Really?\"<br>\r\n<br>\r\n\"Yes.  The psychiatrists don't know what to do.  So they tried hypnosis.  It was then that he said he wasn't a boy at all.  He said he was really a little girl.\"<br>\r\n<br>\r\n\"A little girl?\"<br>\r\n<br>\r\n\"Yeah.  The doctors don't want to reinforce his delusion so they tried to treat him just like a teen.  But It isn't working.  The more they try and treat him like a teen, the worse it gets.    Finally he said he was fine and wanted to go home.<br>\r\n<br>\r\nThe doctors said they couldn't let him and he had, I don't know how else to describe it but as a tantrum.  He started crying and kicking and screaming saying he wanted to go home.  They had to sedate him to quiet him down.\"<br>\r\n<br>\r\n\"Oh my god.\"<br>\r\n<br>\r\n\"Then one night, he left his room and they found him trying to leave the hospital.  Someone saw him and brought him back to his room, when he tried again they had to restrain him.  They have him tied to the bed so he can't leave.  They just don't have the staff to watch him full time.\"<br>\r\n<br>\r\n\"I feel sorry for the boy.\"<br>\r\n<br>\r\n\"Me too, but it gets worse.\"<br>\r\n<br>\r\n\"How could it get any worse?\"<br>\r\n<br>\r\n\"Well  all of a sudden he doesn't say he is a little girl anymore.\"<br>\r\n<br>\r\n\"That's better, isn't it?\"<br>\r\n<br>\r\n\"No now he says he is an adult.  he says he is one of the nurses.\"<br>\r\n<br>\r\n\"One of the nurses?\"<br>\r\n<br>\r\n\"Yes, that is what he said.\"<br>\r\n<br>\r\n\"What are they going to do about it?\"<br>\r\n<br>\r\n\"Well they are going to try hypnosis again.  But this time they are going to do it in combination with a drug that makes the hypnosis more effective.  They are going to try and convince him of who he is.\"<br>\r\n<br>\r\n\"Do they think it'll work?\"<br>\r\n<br>\r\n\"They hope so.  They are going to try it with the strongest drugs they have.\"<br>\r\n<br>\r\n\"I hope they can help him.\"<br>\r\n<br>\r\n\"Me too.\"<br>\r\n<br>\r\n\"Let's not tell Bianca about him.  It'd just upset her.\"<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1508734800,
            "id":2405348,
            "title":"Act like a 4 year old, the best you can"
        },
        "111212":{
            "choices":[
                "That afternoon",
                "A week later"
            ],
            "content":"<div class=\"\"><div> <span>Girl I am smarter than you, tell me how to change it back before you learn the hard truth about how hard your life is about to get. She or more accurately he said, \"I was cursed to spend a year in a boy's body to learn how to treat people with kindness. You left, shocked, and decided to make the best of your year as a young girl.</span></div></div>",
            "created":1473829200,
            "id":2210244,
            "title":"after your \"parents\" step aside to talk..."
        },
        "11122":{
            "author_id":"berttyu",
            "author_name":"Ben",
            "choices":[
                "Balla",
                "Your old house"
            ],
            "content":"<div class=\"\"><div> <span>Where my leratsared you said I need makeup momy a new pullup dools princess coustome and poop where do you poopo oh what you already pooped in your pullup and you start thinking like a little girth now you have a lisp \"wherth me mommy me needs mommy\" you said your new mommy came in she told you she did this but you are wondering what she did it turns out that you have only 1 more hour till you go full little girl and she is also a vampire where do you go</span></div></div>",
            "created":1454648400,
            "id":2100065,
            "title":"You start thinking like a little girl now. "
        },
        "1113":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Wet you pull-up",
                "Try to find a bathroom"
            ],
            "content":"<div class=\"\"><div> <span>It just laughs.<br>\r\n<br>\r\n \"Why are you laughing?\" <br>\r\n<br>\r\n\"Cause your stuck in my body\" She laughs more<br>\r\n<br>\r\n\"Why is that funny?\"<br>\r\n<br>\r\nShe smiles \"Cause now YOU have to wear Pull-ups!\"<br>\r\n<br>\r\nYou hadn't realized it before but when you pulled up your dress you see a pink pull-up. You are shocked and begin crying. The girl whos in your body just walks away. Your new mother comes up to you. <br>\r\n<br>\r\n\"Hows my little girl doing?\"<br>\r\n<br>\r\nThen it hits you: your your 4 year old neighbor! Her mom walks to into your house. All of a sudden you have to go to the bathroom, you...</span></div></div>",
            "created":1311742800,
            "id":1155946,
            "title":"*Laughs*"
        },
        "11132":{
            "choices":[
                "You find it just in time!",
                "Oops. Couldn't hold it any longer. "
            ],
            "content":"<div class=\"\"><div> <span>You find yourself speechless with a mixture of confusion and shock as your new mother ushers you into the house next door. You've never been inside this place before. It all looks unfamiliar, and from your tiny new perspective, the rooms all seem like gigantic cathedrals and audience halls. <br>\r\n<br>\r\nThis can't really be happening, you think. People don't really switch bodies like this! These kinds of crazy things only happen in stories, right? <br>\r\n<br>\r\nUnfortunately, you are snapped out of your dazed thought process by the sudden and immediate sense of hydraulic pressure below your waist.<br>\r\n<br>\r\nOh, no! You have to pee … but you're trapped in the body of this stupid little girl, and … what did she say about wearing a pull-up? She must have been having trouble being toilet trained, so her mom is keeping her in these stupid things. That would explain <i>why</i> she stole your body. It would still be nice to know <i>how</i>. Then maybe you could undo this mess and get back to being a sixteen year old boy instead of a four year old girl.<br>\r\n<br>\r\nBut first things first, you need to find a bathroom. You start padding along in your tiny, girly shoes through unfamiliar rooms. Your legs are quivering now. It's getting hard to hold it in. And you refuse to give in to the indignity of wetting yourself. You tug urgently at the hem of your small pink and white cotton dress. Don't these stupid people have a bathroom in their home?<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1349845200,
            "id":1444087,
            "title":"Try to find a bathroom"
        },
        "111322":{
            "author_id":"berttyu",
            "author_name":"Ben",
            "choices":[
                "Shit",
                "Poop diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pee pee in diaper</span></div></span></div>",
            "created":1458104400,
            "id":2118610,
            "title":"Oops. Couldn't hold it any longer. "
        },
        "1113222":{
            "author_id":"berttyu",
            "author_name":"Ben",
            "choices":[
                "Poop in doaper",
                "Get chqnged"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You poop Ind iaper</span></div></span></div>",
            "created":1458104400,
            "id":2118611,
            "title":"Poop diaper"
        },
        "112":{
            "choices":[
                "What happened?",
                "It worked.  I'm keeping this body.",
                "give me back my body."
            ],
            "content":"<div class=\"\"><div> <span>You're Matthew Johnson, a 16 year old High School sophomore.  You had just gotten out of school, and were walking home.  You were walking up your street to your house, not paying much attention to anything, when suddenly you run into someone or something, and lose consciousness.<br>\r\n<br>\r\nYou come to about 5 minutes later, and see that everything seems smaller to you.  You sit up, and suddenly realize that, instead of wearing your jeans and tank-top, you're suddenly wearing a pink dress.  You look closer, and see that your in a ballerina outfit.  Then, it hits you as to who you might be.  The only ballerina in your neighborhood was Amber Sullivan, a 7 year old girl who lives up the street.<br>\r\n<br>\r\n\"Oh god!!  I'm a 7 year old girl,\" you pause, \"Wait, if I'm in Amber's body, then she must be in mine.  Where is my body?\"<br>\r\n<br>\r\nYou stand up, and spot your unconscious body lying a few feet away.  You run over, and try to wake it up.  \"Amber?  Are you there?\"<br>\r\n<br>\r\nShe slowly wakes up, and looks at you.</span></div></div>",
            "created":1243918800,
            "id":701509,
            "title":"7 year old girl"
        },
        "1121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You go 'home'.",
                "You try to run.",
                "A random swap occurrs!"
            ],
            "content":"<div class=\"\"><div> <span>\"What happened?\" Panicked, Amber asked in your voice. \"Why am I in Matt's body?\"<br>\r\n<br>\r\n\"That's a good question.\" Shaking, you asked.<br>\r\n<br>\r\n\"It's because you asked for it... Amber.\" Giggling, a voice replied.<br>\r\n<br>\r\nYou and Amber looked up to see your mothers walking up to you with a smile on their faces. \"What on Earth are you talking about, Ms Sullivan?\" Confused and shaken, you asked.<br>\r\n<br>\r\n\"That's mom to you, young lady.\" Lightly scolding, Ms Sullivan corrected. \"At least for the next six months, anyway.\"<br>\r\n<br>\r\n\"Six months?\" Startled, Amber asked. \"What did you do to us?\"<br>\r\n<br>\r\n\"Well, you wanted to be older and have more responsibilities.\" Smiling, Ms Sullivan said.<br>\r\n<br>\r\n\"You wanted to be younger and have less responsibilities.\" Smiling at you, mom added. \"So, we decided to grant both your wishes by swapping your bodies with a special device we borrowed from a friend of ours who dabbles in high tech gadgets.\"<br>\r\n<br>\r\nAmber began to cry and you saw mom help him to his feet. \"It's not forever; we're not <i>that</i> mean.\" Comforting him, she said. \"You two will switch back, regardless of where you are, in exactly six months time and we will all have a long talk.\"<br>\r\n<br>\r\n\"For now, we had better get you home... Amber.\" Grinning, Ms Sullivan said.<br>\r\n</span></div></div>",
            "created":1412139600,
            "id":1864931,
            "title":"You asked for it."
        },
        "11212":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You are still defiant",
                "Go with the program",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You try and make a run for it.  You didn't know where you were going to run, but the flight-or-fight instinct took over.  It didn't work, your new Mother, Ms Sullivan grabbed you by the arm and hauled you to her house.  On the way she gave you a swat on the butt.  It stinged.  You stopped struggling let her escort you inside.<br>\r\n<br>\r\n\"Now, young lady, go up stairs to your room.  Get out of those things, I am going to give you a bath.\"<br>\r\n<br>\r\n\"A bath??? I'm old enough to take a bath by myself.  Besides it's the middle of the day.\"<br>\r\n<br>\r\n\"You're not old enough anymore.  You only turned seven two weeks ago.  You just got back from dance class.  You are all sweaty.  You need a bath before dinner.  Now scoot before I'll give you a spanking.\"<br>\r\n<br>\r\nYou walked up the stairs, not knowing where your room was.  You had never been in this house before.  But once you got there, it was obvious which room must be yours.  The bed with the Powerpuff girls bed sheets was the big give away.  Entering the room, you sat down and tried to figure out what to do.  Things didn't look good for you.  You were now a seven year old girl and there were few options.  Who would help you?  Even your mother was in on it.<br>\r\n<br>\r\nIt didn't take long before Ms Sullivan entered.  She looked in the drawers and found a pair of panties, a short sleeved t-shirt that said 'Girl Power' on it and some matching knit pants.  \"Now what about that bath?\" she asked.<br>\r\n<br>\r\n\"I'm old enough to take my own bath.\"<br>\r\n<br>\r\n\"Not anymore,\" she said.  \"There are lots of things that you aren't old enough for now.\"<br>\r\n<br>\r\n\"Like what?\"<br>\r\n<br>\r\n\"Well you will never be left alone for one.  There will always be an adult with you like me or a babysitter.  You can't cross the street or walk in a parking lot without holding my hand.  You have to sit in the car seat in the back of the car from now on.  There are lots and lots of things.  Tomorrow you and I will wait for the bus to take you to first grade\"<br>\r\n<br>\r\n\"That was for Amber, but I'm not really a little girl.  Not inside.\"<br>\r\n<br>\r\n\"You are a little girl inside and out.  Now strip.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1508648400,
            "id":2405053,
            "title":"You try to run."
        },
        "112121":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "In the bath",
                "Biding your time",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Look, I might have to take a shower, but I can do it myself.\"<br>\r\n<br>\r\n\"Nope, too young for showers.  You'll take a bath and I'll give it to you.  I have to watch and see you don't get hurt.\"<br>\r\n<br>\r\n\"This is silly.  I'm in the tenth grade.  I just look like this.  But I am me inside.\"<br>\r\n<br>\r\n\"Oh really?\"<br>\r\n<br>\r\n\"Do you know your ABCs?\"<br>\r\n<br>\r\n\"Of course I do.\"  You recited them in the sing song voice like they do on Sesame Street.<br>\r\n<br>\r\n\"Very good, now can you count to twenty?\"<br>\r\n<br>\r\n\"! 2 3 4 5 ...20.  See no problem.\"<br>\r\n<br>\r\n\"Those were easy.  Can you by threes starting at 1?\"<br>\r\n<br>\r\n\"What do you mean?  I mean 1...4...7... continue from there.\"<br>\r\n<br>\r\n\"Let's see, you started at one to get a running start, you repeated the 1, 4, 7, then after a moment you can to 10, then you had to count on your fingers to come up with thirteen, by once you got to sixteen (you weren't a hundred per cent sure about sixteen) you were lost, you guested twenty.  See I did it, you said hopefully.\"<br>\r\n<br>\r\n\"That wasn't right.  Should I go on?\"<br>\r\n<br>\r\n\"What do you want from me?\"<br>\r\n<br>\r\n\"I told you strip off all your clothes so I can give you a bath.\"<br>\r\n<br>\r\n\"Fine,\" you said and you tried to get out of your clothes.  The first thing was the leotard.  You weren't concentrating and started by trying to pull it over you head which was clearly impossible.  Then to took it off like a pair of pants.  You knew this was going to be a long six months.<br>\r\n<br>\r\nMs. Sullivan said six months, but that wasn't true.  She had alternate plans.  By the time the six months was up, you wouldn't remember being a boy at all.  With Ms. Sullivan's guidance you would be the sweetest, most cheerful and especially obedient little girl a mother could hope for.  She had plans for you, you were already in dance and obviously the first grade, but she would make sure you are also in girl scouts.  She would see to it that you would be in beauty pageants.  She would make sure you were so busy you didn't have time to do anything but just do as you were told.<br>\r\n<br>\r\nShe would keep on you until you were who she wanted you to be.  By that time, there would be nothing you own mother could do about it.  It was so easy to trick your former mother.  Let her deal with that little hellion, Amber.<br>\r\n<br>\r\nMs. Sullivan is a sick puppy.</span></div></div>",
            "created":1508648400,
            "id":2405061,
            "title":"You are still defiant"
        },
        "1121211":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "I'm a pony tain",
                "I'm an elaborate braid",
                "Lots of curls",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You took off your clothes, this was the first time you saw yourself naked. You look down and saw your bare chest small flat stomach. The skin was smooth but not too different then it had been. The only real difference what's the lack of muscles.<br>\r\n<br>\r\nCan you look down past your stomach and saw you're flat hairless crotch. Between your legs there was a small slit. You knew that there should be something else there, but you couldn't remember what it was or what it was for. You thought it was important, but you didn't know why.<br>\r\n<br>\r\nYou brought your hands down to the slit. Your new mother  seeing you were doing slapped your hand away.<br>\r\n<br>\r\n\" Good girls don't  touch themselves over there,\" she told you.  \" if I see you touching yourself over there again, you will stay a little girl longer. You will stay this way until you learn how to be a good little girl.\"<br>\r\n<br>\r\nAs you didn't know what you were missing or what it was for, you didn't know why. You determined that it was best to just do what she wanted you to do until you were returned to normal.<br>\r\n<br>\r\nThe tub was filled with water with white soap bubbles on top. You stepped into the tub enjoying the feel of the warm water.<br>\r\n<br>\r\n\" Close your eyes,\" the new mother said.<br>\r\n<br>\r\nYou did as asked. A moment later warm water was scooped the tub in a cup and then dumped on top of your head. Your mother was  wetting your hair to wash it. You opened your eyes when you felt the soapy shampoo on your scalp. Your mother was massaging the shampoo into your hair. After a while she told you to close your eyes again. Then she used the soapy lotion from your hair to wash your face. Soon she was  rinsing your hair with water. When she was done she told you you could open your eyes now.<br>\r\n<br>\r\nShe then gave you a floaty toy to play with while she cleaned the rest of your small body.   Your mind was too filled with questions to want to play with any toy.<br>\r\n<br>\r\n\" Play with your toy. That is what little girls do,\" your mother  informed you.<br>\r\n<br>\r\nYou feigned playing with the toy, but your heart wasn't into it. You were thinking about what happened to you and what  to do next. You knew but your mind have been  altered but you didn't know how.<br>\r\n<br>\r\nYou knew but you should know math and what was between your legs but you obviously did it. If other knowledge was missing there  wasn't anyway were you to know what it was. You tried to think of what you should know, but you didn't know where to start. How were you to know the things you didn't know? That was clearly impossible.<br>\r\n<br>\r\nWhen the bath was over, you exited the tub and your mother dried you with a big towel. She then put you into a pull-up and told you \" I'm going to dry and style your hair now.\"<br>\r\n<br>\r\nHow does she style you hair?</span></div></div>",
            "created":1565116380,
            "id":2698111,
            "title":"In the bath"
        },
        "11212112":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You wet your pull up",
                "The start of a new day",
                "You hear your mother's plans",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You were led to what was obviously your bedroom. Your mother  indicated that you should sit down. You did as biden.  You were wearing nothing  but a girl's pull up. You look down wondering why you weren't in panties. The idea of wearing panties was strange to you, but it was better than  wearing diapers.<br>\r\n<br>\r\nYou didn't know what to call your mother. You decided the calling her mommy would be your best option.<br>\r\n<br>\r\n\" Mommy, can I ask you a question?\"<br>\r\n<br>\r\n\" Sure honey.\"<br>\r\n<br>\r\n\" Why am I wearing a diaper?\"<br>\r\n<br>\r\n\"  it's not a diaper, it's a pull up. Well it's almost bedtime, and you sometimes with the bed.\"<br>\r\n<br>\r\n\" I never went to bed!\"<br>\r\n<br>\r\n\" I'm sorry honey, but sometimes you do. We can't take that chance. But if you could stay dry for a month,  then I will let  you sleep in big girl's panties.\"<br>\r\n<br>\r\nYou kept your head down while your mother was drying your hair. You could see the diaper covering your crotch. You knew that there should be something in your diaper but you didn't know what. All memories of your penis and penises in general were gone from your mind. As 7 year old girl you had never seen a real penis. Even if you had you didn't know what a penis was for.<br>\r\n<br>\r\nWhen your hair is dry enough, your mother started to braid your hair. She parted your hair in the middle and started a braid on the left side first. Since the noise from hair dryer was gone she started speak to you. She addressed you the tender tones that she would use for her own daughter.<br>\r\n<br>\r\n\"Amber I know but you are afraid, but don't be. You are going to have lot of fun. I promise. First of all, you are now in the first grade.\"<br>\r\n<br>\r\n\" But I know everything that's in first grade.    It'll be very boring\"<br>\r\n<br>\r\n\" You don't know what there is to learn in the first grade anymore.\"<br>\r\n<br>\r\nYou try to remember everything you had learned in school. But you couldn't. You didn't even know what grade you had been in.    You resigned yourself to being in first grade.<br>\r\n<br>\r\n\" Okay I guess.\"<br>\r\n<br>\r\nContinuing your mother said with enthusiasm, \" And after school, you will have so many fun activities. You already know about dance class. But you also will have Girl Scouts and piano lessons. There is also a fashion class you're taking. Plus on Sundays we get dressed up and go to church. After church is Catholic School. You are also signed up to do a beauty pageant in 4 months.<br>\r\n<br>\r\n\" I can't do all those things.\"<br>\r\n<br>\r\n\"  You are only doing the things that is part of your normal Schedule.\"<br>\r\n<br>\r\nWhat your mother said was it true. The original Amber did not do all these activities. But your new mom was determined to make you the sweetest, most behaved, best little girl possible.<br>\r\n<br>\r\nThe original Amber would never stand to do all these activities. She would cry, and fight, and scream. But you couldn't do that. All your new mother how to do I was threatened you with more time before  you swapped back. With that threat, you had to do anything she asked. As long is there was hope but you could return to normal you couldn't defy her.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1565126700,
            "id":2698232,
            "title":"I'm an elaborate braid"
        },
        "112121121":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Getting ready for school",
                "You see your old body waiting for the bus",
                "Sublimins start to effect you",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Your mother finished braiding your hair. She tied off the ends with rubber bands. Then she went to the drawer and got a nightgown for you to wear. She handed it to you and you dutifully put it on. It fell to the top are your ankles.<br>\r\n<br>\r\n\" Tomorrow will be your first full day,\" your mother said. She didn't complete the sentence.    So you didn't know what she was referring to. Did you mean  tomorrow would be your first full day as Amber. Or did she mean tomorrow will be a first full day the girl. You nodded regardless.<br>\r\n<br>\r\nContinuing your mother said, \" You are in class 107.   That is a first grade class. Your teacher is Miss Davis.  Line up with all the other students and be a good girl at school.\"<br>\r\n<br>\r\n\" Okay.\"<br>\r\n<br>\r\n\" After school you will be going to Girl Scouts. I'm sure you'll have a lot of fun there.\"<br>\r\n<br>\r\nAgain you said, \" Okay.\"<br>\r\n<br>\r\n\" Now I want you to get good night sleep because tomorrow is a big day.\"<br>\r\n<br>\r\nYou got into bed expecting your mother to leave. But instead, she picked out book from a  shelf  and sat  on the bed beside you.    She then began to read a bedtime story.<br>\r\n<br>\r\nWhen the story was over, your mother turned on some soothing music. You had no way of knowing that under the music subliminal messages were being sent. Due to these messages, when you woke up in the morning in a wet pull up you weren't surprised.</span></div></div>",
            "created":1565146620,
            "id":2698328,
            "title":"You wet your pull up"
        },
        "1122":{
            "choices":[
                "Ballet"
            ],
            "content":"<div class=\"\"><div> <span>Amber (in your old body) sat up and looked at you.  \"YES!! It worked,\" seeing your confused look, she explains, \"You see Matt, I'm incredibly smart, and I got tired of people not paying attention to me as a 7 year old girl.  So I found a magic spell that would cause me switch bodies with the next person that I ran into.\"<br>\r\n<br>\r\nEnraged, you say.  \"\"WHAT!!  Give me back my body.  I don't know anything about being a 7 year old girl.  I'll stick out like a sore thumb!\"<br>\r\n<br>\r\nChuckling, 'Matt' said, \"Oh don't worry about that.  By tomorrow you'll think and act just like I did.  You'll even have my memories.\"<br>\r\n<br>\r\nYou start cry.  \"Give me back my body, you big meanie,\" realizing what you just said, you say.  \"Oh no!! It's started.\"<br>\r\n<br>\r\n'Matt' turns and starts walking away.  You call after 'him.'  \"Where are you going?\"<br>\r\n<br>\r\n\"I'm going to my house to do my homework.  Amber, you might want to get home soon to, or your mom might get worried.\"<br>\r\n<br>\r\nYou just sat there, watching Amber walking away with your body and your life.  Not knowing what to do, you get up and walk to your new home.  Moments later, you walk inside.  \"Mommy! I'm home.\"<br>\r\n<br>\r\nYour 'mom' peaks around the corner, and says to you.  \"Oh good timing.  Time to go to ballet.\"</span></div></div>",
            "created":1244005200,
            "id":701520,
            "title":"It worked.  I'm keeping this body."
        },
        "11221":{
            "choices":[
                "Surrender to the Inner Amber in you and dance the best you can.",
                "You're a boy named Matt, remember? You don't know ballet!"
            ],
            "content":"<div class=\"\"><div> <span>You try to tell Amber's mom what's happened and that you're NOT going to ballet class. But instead, different words come spilling out of your mouth, “Yippee! I love ballet.”<br>\r\n<br>\r\n“I know, honey,” says Amber's mom with a warm smile. “Now come along, Amber. Let's not be late.”<br>\r\n<br>\r\nWhy did you say you love ballet, you think to yourself during the car ride. It's just as the real Amber said. By tomorrow you'll be thinking and acting just like a seven-year old girl. You have to act quickly and do something if you're going to have any hope of escaping this fate. But what can you do?<br>\r\n<br>\r\nYou sit and stare at your feet, wearing tiny pink ballet slippers. Your legs are sheathed in opaque, pink tights, and you've got a matching pink, ruffled tutu on the rest of your body.<br>\r\n<br>\r\nAgainst your will, you start daydreaming about being a grownup woman someday: a beautiful and famous ballerina, of course!<br>\r\n<br>\r\nFinally you arrive at the dance studio. Holding your mother's hand, you enter the building and file past other young girls dressed similar to your outfit. Part of you is eager and excited to show off to your teacher how much you've been practicing, how graceful and talented you are! But part of you is disgusted by this turn of events and just wants to discover how Amber made this switch happen and how you can undo it!</span></div></div>",
            "created":1315976400,
            "id":1187243,
            "title":"Ballet Class"
        },
        "112211":{
            "choices":[
                "Go home to dinner and lose more of your memories and personality.",
                "Something happens to restore part of your identity!"
            ],
            "content":"<div class=\"\"><div> <span>If only you could figure out how Amber did this, then you could change back to being … to being … who did you used to be anyhow?<br>\r\n<br>\r\n“Ladies, let's please pay attention!” said the dance instructor. <br>\r\n<br>\r\nThe room full of giggling girls grew silent and respectful. A classical melody began playing over the speakers, and the instructor started leading the girls in their ballet routine.<br>\r\n<br>\r\nYou find yourself just “going with the flow.” <br>\r\n<br>\r\nHey, it's easier than fighting against it!<br>\r\n<br>\r\nBesides, the music is rather enjoyable. And you're proud of how graceful and agile you are. In fact, you note with a grin of pride on your face that you're the only one in the line of girls who has thoroughly mastered this particular dance routine. You didn't miss the tiniest bit of choreography, unlike most of the girls who missed a step or two here or there.<br>\r\n<br>\r\nAt the end of the lessons, the instructor praised you.<br>\r\n<br>\r\n“Amber Sullivan, that was fantastic!” she said.<br>\r\n<br>\r\nYou beamed with pride.<br>\r\n<br>\r\n“The rest of you girls should take note of Amber's dedication,” continued the instructor. “Why, Amber if you keep up this level of attention to detail in your studies, you really will become a professional ballerina someday. Mark my words, ladies: you will see Amber as a professional dancer. Wouldn't the rest of you like to achieve that as well?”<br>\r\n<br>\r\nSome of the other girls gave you jealous looks, but you still felt pretty happy about the day. The only thing really bothering you was the name “Matthew Johnson.” Why was that name important? Something about it seemed crucial. It worried and nagged you that you couldn't make heads or tails of this strange urgent need to find “Matthew Johnson” and … and what? <br>\r\n<br>\r\nAsk him some questions you supposed. But questions about what? What would a dumb, stinky boy now about ballet?</span></div></div>",
            "created":1349845200,
            "id":1444056,
            "title":"Surrender to the Inner Amber"
        },
        "1122112":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Amber shows up in your room",
                "Grounding lifted",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The rest of the day passed 'normally'.  The class ended you got home, you played with your dolls, but somehow they didn't seem that fun.  At 8:30 your mom said it was bed time and you got ready to go to sleep.<br>\r\n<br>\r\nYou woke up early and realized what had happened.  You were trapped in this girl's body and you needed to get back to your own body and your own life.  You didn't want to be a little girl of any age.  What you wanted to do was to be left alone so you could think of a plan to get back to being you.  The only way for that to happen was for you to meet your old body.  You weren't sure what you would do once you met yourself, but that had to be the first thing you did.<br>\r\n<br>\r\nYou laid in bed trying to think of something to do.  Amber's mother came into your bed, \"Rise and shine sleepyhead,\" she said cheerfully.  She didn't notice that you were already up.<br>\r\n<br>\r\n\"I'm up.\"<br>\r\n<br>\r\n\"Good, now get dressed for school.  Here is what I want you to wear,\" she said as she took an outfit from the closet and other clothes from the drawers.  Get dressed quickly and come to breakfast.  Don't forget to brush your teeth.\"<br>\r\n<br>\r\n\"I don't want to go to school.\"<br>\r\n<br>\r\n\"Are you sick?\"<br>\r\n<br>\r\n\"Yeah, I'm sick.\"<br>\r\n<br>\r\n\"You don't look sick.\"<br>\r\n<br>\r\n\"I tell you I'm very sick.  You don't know how sick I really am.\"<br>\r\n<br>\r\n\"I think you are just trying to skip school it won't work.\"<br>\r\n<br>\r\n\"I'm not going to school.\"<br>\r\n<br>\r\n\"Yes you are.\"<br>\r\n<br>\r\n\"I'm not.\"<br>\r\n<br>\r\n\"If you don't get a move on then you will be grounded.\"<br>\r\n<br>\r\n\"I don't care.\"<br>\r\n<br>\r\n\"That's it you are grounded.\"<br>\r\n<br>\r\n\"OK, but I\"m not going to school.\"<br>\r\n<br>\r\nThis went on for a while, but when Amber's mom, lifted you out of bed and gave your butt three hard slaps, you realized that this was a losing battle.  You would have to go to school.  Besides how would you find 'yourself' if you couldn't leave the house.   You relented and got dressed.  You put on whatever your mom left for you.  There were panties of course, but you had a girl's body so what did it matter.  Other than that what you wore was definitely for a girl but it wasn't too girlie.  It was just a pair of jeans with a t-shirt with capped sleeves and a butterfly decal, anklet socks and slip on sneakers.  <br>\r\n<br>\r\nYou ate your breakfast and then your mother escorted you to the school bus stop.  She waited for you to get onto the bus and off to school you went.  The work seemed pretty easy, but you weren't sure if it was because it was because you should obviously know everything in the first grade, or that you just knew what Amber did and she was a very good student.<br>\r\n<br>\r\nAfter school you came straight home.  You hoped to find your body, but you couldn't do it.Your mother wasn't going to let a seven year old go anyplace alone.  Besides you were grounded, you had to stay in your room.  You weren't allowed to play with your toys, which suited you just fine.<br>\r\n<br>\r\nThere was certain things you had to do and there was no getting around it.  There was of course school everyday, you had to go.  You had to go to ballet practice three days a week and girl scouts two days a week.  Other than that you were grounded.</span></div></div>",
            "created":1508734800,
            "id":2405444,
            "title":"Something happens to restore part of your ident..."
        },
        "11221121":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Amber leaves you think about what your life will be",
                "After seeing Amber, her mom starts to wonder if you are too tomboyish",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You were sitting on the floor in Amber's room.  You were wearing a long sleeves wool blend navy blue sweater that had a line of pink whales across the chest over light blue waves.  Under that you wore a pair of girl's relaxed skinny jeans with a faded finish and no pockets.  The jean ended at your upper calf.  You didn't wear any socks or shoes.  The outfit wasn't too girlie, but it didn't matter, you wore whatever you mom set out in the morning.  It was easier that way.  Your grounding had finally been lifted and you were allowed to play with your toys again.<br>\r\n<br>\r\nIt looked like you were playing with your dolls, but that wasn't what you were doing.  You were trying to hatch a plan to get to Amber in your real body.  Everyone thought you were seven and you were watched like a hawk to prevent you from scampering away and getting into trouble like any seven year old could.  You couldn't leave the house alone, the doors all had safety locks on them that you couldn't open.<br>\r\n<br>\r\nYou had several dolls, each representing a different person.  One for you, one for Amber's mom, one for amber's dad, one for the occasional babysitter.  You would try things out one by one to see if they would work.  Your intense concentration made you look like you were having a lot of fun.<br>\r\n<br>\r\nYour focus was so intense that you didn't notice anything going on around you.  Amber in your body entered the room.  \"Guess you didn't expect to see me here?\" she said.  Amber was wearing, a v-neck tee made out of a ribbed fabric in a light purple color (it was lavendar but you didn't know that name).  The shirt hung loosely over a pair of white skinny jeans.  She wore them with matching white canvas sneakers.<br>\r\n<br>\r\nShe was dressed in 'girls' clothes but you were too preoccupied to say anything about that.  \"Now switch us back.\"<br>\r\n<br>\r\n\"I know I said I wouldn't do that, but I was kidding.  We'll swap back.\"<br>\r\n<br>\r\n\"So swap us now!\"<br>\r\n<br>\r\n\"No, not just yet.  I've got to tell you what happened.  But i have to be quick before you mother gets back.\"  Amber had come to the house asking if Amber's mother had a certain thing.  Amber knew she had it stored in the attic and it would take some time to get it.  This was the time she was using to talk to you.<br>\r\n<br>\r\n\"OK,\" you said impatiently.  There was no need to anger her.  There was nothing you could do.  You didn't know how to swap back and you were just seven you couldn't overpower her.<br>\r\n<br>\r\n\"Well after we swapped, it was so nice to be able to do what I wanted without anyone telling me what to to do.  Mom, is always around, I can't do anything without her knowing.  Nothing at all.<br>\r\n<br>\r\nWhen I was alone in your house, I decided to play dressup with your mother's clothes.  I put on all sorts of things.  I tried on one of her bras and stuffed it with some socks or something.  Then I put on this pretty dress and her shoes.  I looked at myself in the mirror and decided I needed some makeup.  I was putting some on and your mom came back and caught me.\"<br>\r\n<br>\r\n\"Oh My God!!!\" you exclaimed.<br>\r\n<br>\r\n\"She asked me what I was doing.  I told her I have always wanted to wear pretty things.  Which was true.\"<br>\r\n<br>\r\n\"You told her that?  She must think I'm a sissy.\"<br>\r\n<br>\r\n\"She was very nice and said that she would get me my own pretty clothes if I didn't wear any of hers.\"<br>\r\n<br>\r\n\"I hugged her.\"<br>\r\n<br>\r\n\"Then we talked a while and she said I really screwed up the makeup.  Well she is going to teach me how to put on makeup.  I am learning right now.  My mom won't teach me, she says I am too young.  When I know everything then we'll switch back.\"<br>\r\n<br>\r\n\"You are learning how to put on makeup in my body?\"<br>\r\n<br>\r\n\"Yes, it is so much fun.  But even before that we went off to buy a few things.  Look at what I am wearing, isn't it pretty?\"<br>\r\n<br>\r\nYou didn't know what to say, you didn't want to get her mad at you.  You wanted your body back.<br>\r\n<br>\r\nContinuing she said, \"But before we went to get the clothes, your mom made an appointment with a doctor.  he asked me a lot of questions about if I liked being a girl.  I told him lots of stuff.  After that we bought lots of new clothes.  We started the makeup lessons too.  Tomorrow I am going to get my hair cut at your mom's stylist.  She says I can get any style I want.  I might even color my hair too.\"<br>\r\n<br>\r\n\"You have to stop that,\" you said in a panic.  \"You don't know what you are doing to me.\"<br>\r\n<br>\r\n\"It'll be OK, once I learn makeup we can switch back and you can just tell her you have changed your mind.\"<br>\r\n<br>\r\nYou were sick, what life would you have after you returned to your body.  Would you have any friends left?  Would you be considered a sissy?  Could she do anything that couldn't be put back the way it was?  You didn't know?<br>\r\n<br>\r\nAmber's mom finally returns and gives hat she found to Amber.  After Amber leaves, 'your mom' says, \"I don't want you to be around that boy.  he is acting strange.  I don't think he knows how a boy is supposed to act.\"<br>\r\n<br>\r\nWhat happens next.</span></div></div>",
            "created":1508734800,
            "id":2405446,
            "title":"Amber shows up in your room"
        },
        "112211212":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Your plan isn't going to work",
                "Amber's mom makes you see a doctor",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Once Amber leaves it starts to hit you.  You were so consumed about getting to see her so you could swap back that you hadn't considered what she was doing with your life.  The good news was that she said she was going to swap back but the bad news was that by that time your life would be ruined.<br>\r\n<br>\r\nIt had only been a week and she was already starting to wear girl's clothing in your body.  She even convinced your mother that that is what you wanted.  The worst part if you could believe Amber was that your mother was accepting it.<br>\r\n<br>\r\nYou went over her story and it all seemed to make sense.  How could a little girl make up such a story.  She said she went to a doctor.  She must mean a psychiatrist.  It was a psychiatrist that you saw when you wanted to have a sex change? right?  She said she went to him and then after that she went to buy girl's clothes?  She must have convinced the doctor.  She was going to wear girl's clothing full time?  What would your friends think?  Would you even have any friends by the time she is through with you?  <br>\r\n<br>\r\nAll your friends would think you were queer.  How could you face them after you get your body back?  Would you want to?  You couldn't tell them that you had switched bodies with a little girl.  No one would believe that.  Even if you said it was a terrible mistake, they would always in the back of their mind remember the time you said you wanted to be a girl.  You would never live it down.<br>\r\n<br>\r\nAt least, you thought, nothing she is doing can't be reversed.  She could cut your hair, but that grows back and you could always get regular (meaning male) clothes again.  But she couldn't have your penis cut off.  That took a year before they did that.  Then you remembered she said she went to a doctor.  What if the doctor prescribed some female hormones?  You might start developing tits.  You didn't think your voice would get higher, but your butt and hips would swell.  Your body would become girlie and that would be permanent.  Your face might also change too becoming more feminine.  What would you do then?  You might need surgery to fix those things.  OK, if you needed surgery you would have surgery.<br>\r\n<br>\r\nWith that resolved, sort of, you moved from scared to mad.  How dare her screw with your life.  It wasn't right that she could do what she wanted and you would do nothing.  She could return to her life and it would be the same, while yours would be ruined.  You decided that if she was going to screw with your life, you were going to screw with hers.<br>\r\n<br>\r\nYou were going to tell Amber's mom that you didn't want to dance anymore.  You knew that Amber liked that.  You would also quit girl scouts.  You would cut your hair short.  You would break all of her dolls and stop doing anything girlie.<br>\r\n<br>\r\nYou would tell Amber's mom that you wanted to play baseball and do other boyish things.  You would make Amber into the biggest tomboy there is.  This was your plan.  </span></div></div>",
            "created":1508734800,
            "id":2405517,
            "title":"You worry and then make a plan."
        },
        "1122112122":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Doctor says nothing is wrong with you",
                "Doctor says you aren't right in the head",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Your plan didn't really work.  Amber's mother doesn't mind that you quit ballet and girl scouts.  She thought you liked them and if you don't that was OK with her.  Although she did think you did have an aptitude for dance.  Forcing it on you wouldn't make you like it any more.  As far and taking up tee-ball and other sports at age seven lots of girls play on the teams with the boys.<br>\r\n<br>\r\nPlaying sports was the one pleasure you now had in your new body.  But this wasn't ruining Amber's life, You had to try something else.  Then you thought of it, it was hard to do although you thought it would be easy.  You purposefully wet the bed.  It wasn't natural for you to relax in that position and let yourself go.  You had grown used to peeing like a girl, in the past couple of weeks, but that didn't mean you could pee while wearing clothes and lying down in a bed.<br>\r\n<br>\r\nIt took some effort but you finally did it.  Now what?  Should you go back to sleep and wait for Amber's mom to notice?  Should you tell her right now?  You weren't sure what to do.<br>\r\n<br>\r\nBut after a short time the decision was made for you. The pee started to stink which you could handle.  But your wet panties were starting to get uncomfortable.  You ran out of bed and told Amber's mom what happened.  You said you were asleep and then woke up to a wet bed.<br>\r\n<br>\r\n\"Don't worry honey, it happens to everyone,\" she tried to comfort you.  She washed you up and put you into new clothes before replacing the bed sheets.  You would wet the bed every night until she would have to put you into diapers.  You didn't know how long it would take but she couldn't have you wet the bed every night forever before doing something.<br>\r\n<br>\r\nIt didn't take long before she had you wear goodnights to bed.  This wasn't good enough for you, you wanted to soak them so she would have to put you into regular diapers with tabs.  It would be hard to do, because after a while your mom made sure you went to the bathroom before going to bed.  She waited for you to pee.<br>\r\n<br>\r\nWhat she also did was take you to the doctor.  (Right after putting you into goodnights.)  At first she took you to an MD, but he said that there was nothing wrong with you.  Then she took you to a psychiatrist.</span></div></div>",
            "created":1508734800,
            "id":2405548,
            "title":"Amber's mom makes you see a doctor"
        },
        "112212":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "The teacher calls your name 'Amber'",
                "You try the new dance",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You stand in a line with the other girls.  Everyone was waiting for the teacher.  You didn't want to talk with anyone and luckily no one was talking to you.  You had to figure a way out of this, but even if you could, you couldn't do anything here.<br>\r\n<br>\r\nIt didn't take long before your dance teacher entered the room, \"Position one young ladies,\" she said.<br>\r\n<br>\r\nYou knew what that meant.  You put your heels together and pointed your toes in opposite directions.  It was easy for you.  You couldn't have done such a thing in your old body, your feet didn't turn like that.<br>\r\n<br>\r\nLooking ahead you could see your dance teacher.  She was a knock-out especially in that leotard and tights.  She had long legs, she might be five-foot ten or eleven.  It was hard to tell since you were so much shorter now.  You didn't even know your own height.  She also had C-cup breasts which was probably why she was a dance teacher and not a ballerina.  But you didn't care, you loved her relatively over-sized tits on her small frame.<br>\r\n<br>\r\n\"Now ladies,\" she continued.  \"I am going to show you the first few steps of this new dance.  It isn't too different that the last dance we learned.  \"OK, now you start with...\"  The teacher gave the technical names for each step as she demonstrated the dance.  You noticed than the teacher wasn't wearing a bra.  (You were the only student who would notice such things, as the other students were six and seven years old.)  Her boobs jiggled to and fro as she went from leap to leap.  You were mesmerized.<br>\r\n<br>\r\nWhat happened next?</span></div></div>",
            "created":1508648400,
            "id":2405067,
            "title":"You're a boy named Matt, remember? You don&..."
        },
        "1122122":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You decide, maybe staying a little girl for a few days isn't too bad",
                "Amber tells you something",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Once the teacher showed everyone what to d, the students tried it.  the teacher would demonstrate in front of you and you tried to follow along.  You didn't pick it up very quickly though.  This was probably because you were spending more time looking at your teacher than listening to what she was saying.  The teacher had such long shapely dancers legs in wonderful white tights.  She had a small frame, but her boobs were enormous by comparison.  You were also smaller which made the legs look even longer and the boobs more pronounced.  They were certainly twice the size of your hands now.<br>\r\n<br>\r\nIt was a beginning class and this was a new dance so the teacher wasn't too disappointed that you didn't pick it up right away.  The class flew by and in a strange way you enjoyed it.<br>\r\n<br>\r\nAfter class, you went to the locker room to retrieve your stuff.  You didn't have to change, you could change when you returned home, but you did have to put on a pair of pants and a t-shirt over your dance costume.  But the older girls who were also in the locker room were changing out of their street clothes into their leotards and tights right in front of you.  These weren't little girls like 'yourself' but these were teenaged girls.  The got naked right in front of you to get into their tights and leotards.  Some girls either didn't wear bras or swapped their daytime bras for sport bras.  You stood there and stared at the naked girls.  No one gave you a second thought though.  Not only were you a girl, but you were (as far as the teens knew) just seven years old.<br>\r\n<br>\r\nYour father arrived at the dance school and after a while sent a girl into the locker room to fetch you.<br>\r\n<br>\r\nHe drove you home.  When asked how dance class was today, you answered quite truthfully, \"It was great!\"<br>\r\n<br>\r\nWhat happens next.</span></div></div>",
            "created":1508734800,
            "id":2405388,
            "title":"You try the new dance"
        },
        "1123":{
            "choices":[
                "Amber's friends come along and drag you away to play with them.",
                "Your old friends arrive and drag Amber (in your body) off to the mall. ",
                "Something else unexpected suddenly happens .....?"
            ],
            "content":"<div class=\"\"><div> <span>\"Give me back my body!\" said your own body with Amber Sullivan now inside of it.<br>\r\n<br>\r\n\"I wish I could!\" you say. \"But I don't know how this happened.\"<br>\r\n<br>\r\n\"Well, I don't know how it happened either,\" she says. \"And I don't want to be in the body of a stinky, dumb boy.\"<br>\r\n<br>\r\n\"You think I want to be trapped as a seven year old girl?\" you shriek. \"We have to find a way to switch back.\"<br>\r\n<br>\r\nBut before either of you can do anything, something happens...?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1447995600,
            "id":2064668,
            "title":"give me back my body."
        },
        "11231":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Amber follows you to Rachel's house",
                "Why isn't playing dolls fun?",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Rachel, one of Amber's friends came to you.  Amber was actually with Rachel when she bumped into you.  Rachel and Amber had been racing down the street.  She lost her shoe and that is why she was way behind.  But it didn't take too long for her to put her shoe back on and catch up.<br>\r\n<br>\r\n\"Come on Amber,\" she said pulling you away from the scene.  \"My mom is waiting.\"<br>\r\n<br>\r\nYou were confused for a moment.  Something was wrong but you didn't know what exactly.  \"Sure thing,\" you said and you and Rachel started skipping towards her house.  When you had gotten far away so as not to be heard Rachel asked,\"What did the man want?\"<br>\r\n<br>\r\n\"I don't know,\" you said.  Something about not wanting to be a stinky boy.\"<br>\r\n<br>\r\n\"Why would he say that?\"<br>\r\n<br>\r\n\"Maybe he wished he was like us.  We have it all over stinky boys.  I hate all boys, not just stinky ones!\"<br>\r\n<br>\r\n\"Me too.\"<br>\r\n<br>\r\nRachel's house was only a few houses down so it took no time to get there.  Rachel's mother was indeed waiting at the door.  She saw what had happened.<br>\r\n<br>\r\n\"Amber, you didn't hurt yourself, did you?\" Mrs. Clapton (Rachel's mom) said.<br>\r\n<br>\r\n\"No, I am alright.\"<br>\r\n<br>\r\n\"Let's play dolls,\" Rachel said.  You go with her.  You knew something wasn't quite right, but you didn't know what.</span></div></div>",
            "created":1508648400,
            "id":2405079,
            "title":"Amber's friends come along and drag you awa..."
        },
        "113":{
            "choices":[
                "What happened?",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>You're Matthew Johnson, a 16 year old High School sophomore. You had just gotten out of school, and were walking home. You were walking up your street to your house, not paying much attention to anything, when suddenly you run into someone or something, and lose consciousness.<br>\r\n<br>\r\nYou come to about 5 minutes later, and see that everything seems a little smaller to you. You sit up, and suddenly realize that, instead of wearing your jeans and tank-top, you're suddenly wearing a skirt and spaghetti-strap. You look closer, and see 2 breast protruding from your shirt. Then, it hits you.  \"Oh god!! I'm a girl.\"<br>\r\n<br>\r\nYou stand up, and spot your unconscious body lying a few feet away. You run over, and try to wake it up. \"Wake up!!  Excuse me!<br>\r\n<br>\r\nThe person in your body wakes up, and looks at you.</span></div></div>",
            "created":1244955600,
            "id":708296,
            "title":"15 year old girl"
        },
        "1131":{
            "choices":[
                "Home twenty minutes later being yourself, a boy in a girl",
                "Next day home acting female",
                "You wake up next day to go to school and act female"
            ],
            "content":"<div class=\"\"><div> <span>\"what happened... Oh.   My.... God... It worked!!!\" the new Matt said<br>\r\n<br>\r\n\"what worked?\" you asked<br>\r\n<br>\r\n\"the swap spell! Yesterday, when I learnt I was pregnant, I decided to have this baby but I didn't want to be the mother, I wanted to be the father, Jess! Remember that party where we had sex, this baby is yours too, well, mine too 'cause it's sure you're it's mother, you're carrying it. By the way, having an abortion is impossible for you, the fetus will reappear with a clone of itself, twins, quads, octuplets etc.\"<br>\r\n<br>\r\n\"you mean that we are going to have a baby? But I'm no girl! I'm Matt not Jessica! I don't want to have a baby!\" you scream as you try to fight your laughing ex-body<br>\r\n<br>\r\n\"don't worry, tomorrow, you will know HOW to act like a teenage girl, you will still be able to be like right Now but a pregnant tomboy isn't really... Well you know what I mean!\"<br>\r\n<br>\r\nyou start crying and say \"god, I'm already acting like a girl!\"<br>\r\n<br>\r\n\"yeah, oh and our parents already know about our baby to come, they are proud of you to keep the baby and to become grandparents. just for your information!\" </span></div></div>",
            "created":1272862800,
            "id":877442,
            "title":"What happened?"
        },
        "11311":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "You check out your new body",
                "Your mother comes in to talk to you"
            ],
            "content":"<div class=\"\"><div> <span>The new Matt smiles at you, \"Here, let me walk you home. You will get more used to the body faster that way.\"<br>\r\n<br>\r\nYou feel strange as you walk, following his lead. You can feel the breasts on your chest bouncing, and the way the jeans you are wearing fit snugly to your crotch feels just as odd. You look up at him, \"You had no right to do this to me.\"<br>\r\n<br>\r\nHe grinned, \"No? Maybe not. But it is done. Besides, do you remember what you did to me? How you said you would use a rubber, but then when you had me too hot to say no, you promised to pull out in time?\" He paused and you feel your face burn. \"Yeah, that's right. You never even tried. You dumped your whole load inside of me, which is what you intended from the start. Am I wrong?\"<br>\r\n<br>\r\nYou burn in shame as you shake your head no. You had thought it would be cool to get a girl knocked up. The new Matt said so. \"Yeah. I thought so. You hoped to get me knocked up. Well, it worked, only now you are the one who is knocked up, and you get to live the consequences.\" He paused with you outside of what is now 'your' home. \"Just in case you get the idea of ruining my reputation by doing some bad or illegal stuff, don't bother. The swap is permanent, so feel free to live your new life in whatever way makes you happy. I will stop by tomorrow to talk to you some more.<br>\r\n<br>\r\nYou stand there looking at him with no idea what to say. Does it matter anyhow? You turn and numbly walk up to the door of Jessica's house. Well, no, it is your house now. You turn to see him standing there watching you. At lat you say, \"If I am going to have our baby, shouldn't my family meet the father?\"<br>\r\n<br>\r\nHe smiles, \"Yes, but not yet. Take care Jessica.\"<br>\r\n<br>\r\nYou walk into the house, only now realizing that you don't even know where your own bedroom is! You hear someone in the living room watching TV, so you quietly go upstairs. You find on room that has to be your parent's room. Then a bathroom, then at last, this must be your room!<br>\r\n<br>\r\nYou just sat on the bed to relax when a boy walks in. You recognize him as Paul, Jessica's brother. He is 18, so three years older than you are now. He looks upset, \"Okay sis! I don't know what you are doing in my room, but go to your own! I don't like it when you invade my space!\"<br>\r\n<br>\r\nYou realize your mistake too late! You were in a boy's room, and it felt right because you are still a boy on the inside, regardless of your body on the outside. You stutter, \"Sorry Paul. I was spaced out and just needed to sit down. I'm leaving.\"<br>\r\n<br>\r\nYou wander into the only room you had not checked out. The feminine nature of everything there confirms that this has to be your room now. Just great! What next?</span></div></div>",
            "created":1401339600,
            "id":1804186,
            "title":"Home twenty minutes later being yourself, a boy..."
        },
        "113112":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "I am sorry, but it really is permanent",
                "We can switch back, but there is a catch"
            ],
            "content":"<div class=\"\"><div> <span>You get acquainted with your new room. As you go through a drawer full of panties of all styles and colors, and bras and other feminine intimates, you think of how thrilled you would have been an hour ago to see Jessica's private stuff like this. But now this is your stuff, and you will need to wear it!<br>\r\n<br>\r\nThe clothing is much the same. Jessica's mother insists on a level of femininity for her daughter. You sigh as you realize that, until you are out of her house, you will not be able to dress much less feminine.<br>\r\n<br>\r\nSuddenly there is a knock on the door. You pause, then here 'your' mother's voice, \"Jessie, please let me in. I have important news, and I don't want to shout it through the door.\"<br>\r\n<br>\r\nYou sigh. You know that you need to let her in. You walk over, unlock the door, then walk back to your bed without opening it. As you sit down, she opened the door and comes in. You wonder as you see her smiling as she closes the door. She comes over and sits next to you on the bed.<br>\r\n<br>\r\n\"Sweetie, I have great news for you!\" She hugs you tightly, \"I told you going to the doctor was the right thing. Those home pregnancy tests can be wrong.\"<br>\r\n<br>\r\nYour heart beats faster, \"What…. what are, are you.\" It is hard to breath, \"What are you trying to tell me mom?\"<br>\r\n<br>\r\nShe is tearing up, \"The doctor's office just called. The tests came back negative.\"<br>\r\n<br>\r\nYou hold your breath, but you don't get it, \"Negative?\"<br>\r\n<br>\r\nHe hugs you tightly, \"You are not pregnant honey! You just had a mild flu and it threw you off and gave you some symptoms. The doctor said you will confirm it for yourself soon. He figures your period will start like normal next week.\"<br>\r\n<br>\r\nYou are shocked. You know your mom expects you to be happy, but how can you be? Jessica swapped with you for nothing! If this is really permanent, you were stuck as a girl for no reason!<br>\r\n<br>\r\nYou mother is confused, \"Honey? I thought you would be excited.\"<br>\r\n<br>\r\nWhat do you say? 'I am mom, except your daughter swapped bodies with me and now she is a guy.' Yeah! Right! At least you can still think quickly as a girl. Your tears are real, but not for the reason she might be thinking. \"I am glad mom. I didn't want to have a baby at my age. It is just that I had just gotten used to the idea. Now it feels funny. I don't feel like myself.\"<br>\r\n<br>\r\nShe hugs you. \"I understand honey. I will leave you alone to take it in. Supper will be in an hour.\"<br>\r\n<br>\r\nAs she leaves, you realize you have to contact Matt. You find Jessica's cell phone in your purse and call him. After convincing him to listen to you, you finally get out, \"You don't understand, you are not pregnant! I mean I am not! I mean, this body is not! Whatever!\"<br>\r\n<br>\r\nThere is silence. You add, \"I want my body back! You have no reason to punish me now!\"<br>\r\n<br>\r\nAfter a few moments he says...</span></div></div>",
            "created":1403413200,
            "id":1815859,
            "title":"Your mother comes in to talk to you"
        },
        "1131121":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Your friend Ashley comes over and begs you to go on a double date",
                "You learn what it is like being a girl at school"
            ],
            "content":"<div class=\"\"><div> <span>After a few moments, Matt says, \"I am sorry Jessica, what I said before is true, this cannot be reversed, ever.\"<br>\r\n<br>\r\nYou feel yourself boil on the inside. Finally you say, \"Okay MATT. So this is my life for good, then let me make one thing clear. I never want to see you or talk to you again. You stuck me with this life, so stay out of it!\" He started to protest, but you hung up. You ignored is attempts to call you back.<br>\r\n<br>\r\nYou walked over to the full-length mirror and looked at yourself. You are no raging beauty, and not one of the popular girls in the school. On the other hand you are not ugly. You remember picking Jessica out at the party because she had a nice body and a simple girl-next-door look. At that time, you thought her breasts were on the small side, but now those B-cups felt huge to you. As you hefted your breasts, you did not like having these things hanging on your chest.<br>\r\n<br>\r\nDamn! If she had to swap your bodies, why couldn't the spell make you at least like being a girl? You really wondered how long it would take you to get used to being female, let alone accepting it! As you looked around at the posters on the wall, you realize that Jessica liked boys, but at the moment, liking boys felt wrong. On the other hand, if you continued to like girls, you would be a lesbian, and that felt wrong too. You finally gave up. For now you needed to let it go. No matter what path you mind took on that subject, it felt wrong. You would just have to wait and see how you felt after you were more used to this body.<br>\r\n<br>\r\nBefore going down to 'meet' you new family, you needed to pee. That turned out to be the most frustrating thing of all, because you realized you were stuck sitting down to pee for the rest of your life! It was so strange to see female parts there too. Would you ever get rid of the feeling that something was missing?<br>\r\n<br>\r\nAfter eating with your new family, and doing your best to act happy, you retreated back to your room. It helped to be happy about not being pregnant. Back in your room you thought about how you were spared the decisions of what to do about school and whether to keep the baby or try to raise it. After thinking a long time about it, part of you actually felt guilty about your attitude before the swap.<br>\r\n<br>\r\nYou realized that the things you were thinking about were things you ignored before. As a male, knocking a girl up was a perverted show of your manhood. As a girl though, you had to deal with the thoughts of what it meant to be pregnant and single. Dealing with being pregnant for nine months, then making serious decisions about the life of a baby, and all that at the age of fifteen. And even if you ended up liking boys, and getting married some day, you would be the mother, and still have to think about those things. You couldn't just put a baby out of your mind. Not if you loved it as you know your old and your new mother loved you.<br>\r\n<br>\r\nYou changed for bed and went to sleep, determined to find you way out of this body. But if you did get your old body back, Jessica succeeded in one thing. You would never treat girls the same again!<br>\r\n<br>\r\nThe next morning...</span></div></div>",
            "created":1404968400,
            "id":1825486,
            "title":"I am sorry, but it really is permanent"
        },
        "11311211":{
            "choices":[
                "Tell Amanda the truth when she comes over",
                "Call Jessica for advice"
            ],
            "content":"<div class=\"\"><div> <span>You woke up groggy and sore. It took a long time to fall asleep in your new skin, with every part of Jessica's body tingling as you rolled around in bed looking for a comfortable position. You settled with lying on your side, where your breasts wouldn't get squished and your underwear wouldn't climb up your butt as you pushed it into the mattress. After you finally drifted off, you slept a dreamless, restless sleep, waking up every two hours.<br>\r\n<br>\r\nIf Jessica's window didn't directly face the sun, you would have stayed in bed even longer. You closed the curtains and passed in front of the mirror on the way to your closet. A dim outline of Jessica appeared next to you in the frumpy blue-stripped pajamas you had selected for her, cotton button-up shirt and loose pants with laces to tighten them. They were the most modest clothing you'd been able to find. They were also the least comfortable.<br>\r\n<br>\r\n\"Do I have school?\" you wondered, dreading the thought. Then you remembered: it's Saturday! Yesterday, you had walked home from school thinking about the party you'd go to that night. You thought that maybe you'd score with another girl, maybe someone hotter than Jessica, who you could discreetly impregnate. \"If they sleep around, they won't notice,\" you'd reasoned. You thought bitterly about your former life when you thought that the height of masculinity. If you hadn't been so obsessed with being macho in high school - after a rough, bully-filled tenure in elementary and middle school - maybe you'd still be male.<br>\r\n<br>\r\nYou slowly get dressed. With your eyes closed, you removed Jessica's panties and put on another pair; it was only when the fabric slipped between your butt cheeks that you realized you've accidentally put on a thong. You slid them off, disgusted, and switched them out for something plainer. You didn't bother changing your bra after that.<br>\r\n<br>\r\nIn jeans and a dark green-and-gray t-shirt, you trudged from your room to the kitchen. Your mom was up frying eggs and blending a vegetable smoothie of some kind. You turned it down when she offered, and were glad when she shrugged, as if Jessica didn't care for the drink either.<br>\r\n<br>\r\n\"Paul said you've been going into his room,\" your new mom said offhandedly while you were eating. \"In order to think, was it?\"<br>\r\n<br>\r\nYou blushed. The incident when you first entered Jessica's house rushed into your mind. \"It was only one time,\" you said, \"and I spaced out. It's no big deal.\"<br>\r\n<br>\r\n\"Well, you know how he gets,\" she said. Paul walked in just then, and you walked right out, hoping to avoid a confrontation.<br>\r\n<br>\r\nBack in your room, you thought, \"I need to get out of here.\" A faint hope crept in: \"Maybe I will find a way to change back. Just because Jessica told me I can't doesn't mean there's a loophole, or, something she's kept secret!\"<br>\r\n<br>\r\nAs you dreamt about the possibility, Jessica's phone buzzed on top her bed. You picked up instinctively and answered. \"Hello?\"<br>\r\n<br>\r\nIt was Jessica's best friend, Amanda, who you'd met at the same time as Jessica at the party where the seeds of this mess had been planted.<br>\r\n<br>\r\n\"How are you doing?\" she asked straight away in her most concerned voice. \"I know you said you were going to confront Matt yesterday... is everything all right?\"<br>\r\n<br>\r\n\"Matt?\" You realized she was talking about the pregnancy. \"Oh! I did, and, I told him how angry I was and I'd never want to talk to him again. But you know that won't be a problem now, because I found out I'm not even pregnant!\"<br>\r\n<br>\r\nThere was a sigh of relief. Amanda said, \"That's fucking awesome!\" in her loudest voice. You smiled, thinking that Jessica at least had a good friend to support her.<br>\r\n<br>\r\n\"You couldn't ask for more. Your life's back to normal and you don't have to deal with that slimy douchebag anymore.\" Amanda's tone turned acidic. \"God, I hope he's impotent and his dick shrivels til it falls off.\"<br>\r\n<br>\r\nYou giggled even though she was talking about you. You had to admit that you deserved the ribbing.<br>\r\n<br>\r\n\"Anyway, that makes the news even better!\" she said.<br>\r\n<br>\r\n\"News?\" you said. \"What news?\"<br>\r\n<br>\r\nAmanda could barely contain her excitement. \"That we're going on a double date tonight!\" she exclaimed. \"You know how I told you I was going to find a nice guy who'd be okay raising a baby? I found the perfect guy. He's the sweetest boy you'll ever meet, and now that pregnancy's a non-issue, there's even less pressure! It's just a night on the town now. What do you say? Come on. I'll come over to your place and we can plan it out, okay? I'll see you soon.\"<br>\r\n<br>\r\nYour stomach sank. Oh Jesus Christ, you thought, does the fun never end?</span></div></div>",
            "created":1405573200,
            "id":1828998,
            "title":"Saturday Night Date"
        },
        "113112111":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Calm down, change into something comfortable and relax",
                "Go up to Jessica's room"
            ],
            "content":"<div class=\"\"><div> <span>You think to yourself \"Why am I going on a date tonight? I'm not even a girl plus I'm in another persons body! I can't go on this date tonight, I gotta tell Amanda the truth when she comes over. About ten minutes later Amanda gets to your house.<br>\r\n<br>\r\n<br>\r\nAmanda: \"Jessica I'm here! You better be ready for this date tonight!\"<br>\r\nYou: \"Listen Amanda, we can't go on this date tonight.\"<br>\r\nAmanda: \"Umm why not?\"<br>\r\nYou: \"Cause I'm Matt\"<br>\r\nAmanda: \"Wait what?\"<br>\r\nYou: \"Yes I was walking home from school yesterday then I passed out, next thing I know I'm in Jessica's body. She used some type of Swap Spell.\"<br>\r\nAmanda: \"Wow that's freaky! Listen I will walk back down the street to my house. Act like Jessica for the rest of the day and come down to my house tonight and sleepover. I might now the spell so I can swap you with a different person or get you in your original body.\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1405573200,
            "id":1829037,
            "title":"Tell Amanda the truth when she comes over"
        },
        "1131121111":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "Do as much as you can with your girl body before you turn back ",
                "Falls I sleep until you have to go"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You take off her bra and threw on the floor. “ Stupid thing“ and you Put on a sweater. You then turn off your panties and put on yoga pants. You says “ahh Feels much better . This body almost feels really comfy.” you lay on your bed and ...</span></div></span></div>",
            "created":1593544920,
            "id":2859234,
            "title":"Calm down, change into something comfortable an..."
        },
        "113112112":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "There was a secondary spell, you were now deeply in love with Brad",
                "There was a secondary spell, you now would automatically become his ideal girl"
            ],
            "content":"<div class=\"\"><div> <span>You grab your cell phone and start calling Jessica, but before you actually go through with it, you stop. Taking a few deep breaths, you rethink that idea. First, you just got done telling 'Matt' that you never wanted to talk to him again, and for good reason! You are Jessica now. You are not even sure if you are, or are not, attracted to guys, but something in you tells you that you don't feel like being a lesbian, which is the only other choice as you are seeing it. Maybe you should at least give dating a male a try.<br>\r\n<br>\r\nGetting yourself ready as a girl was a huge pain! You had to fuss with your hair, makeup, and try to find something you hoped that the guy you haven't met yet thinks is nice, but not too nice to give him any wrong ideas. It doesn't even seem odd to you that you are thinking like that. You are almost ready when you hear the door bell. You hear your mom let Amanda in and then hear her coming up the steps.<br>\r\n<br>\r\nShe doesn't knock as she comes right in. \"Hey girl! You almost ready?\"<br>\r\n<br>\r\nYou were about to put a top on, so you are standing there in just a bra.\"Yep!\" It is funny that, since you are both girls, you don't feel the least bit self-conscious about being partly undressed in front of her. \"Um, are you really sure about this?\"<br>\r\n<br>\r\nShe hugs you, \"Look, I know you are nervous after what you when through with that rat Matt.\" She giggled, \"Hey! That rhymes! Rat! Matt!\" She laughed, \"We have us a new nickname for him!\"<br>\r\n<br>\r\nYou couldn't help laughing with her. After all, you were not Matt anymore, and you hoped that your old reputation would follow the old Jessica for what she did to you.<br>\r\n<br>\r\nAmanda gets control of herself, \"And seriously, this guy is great! His name is Brad, and besides, Tom and I will be there with you. If you feel uncomfortable, just say the word and we will bail you out.\"<br>\r\n<br>\r\nYou finish dressing, \"Thanks Mandy! How do I look?\"<br>\r\n<br>\r\nShe grins, \"As great as always!\"<br>\r\n<br>\r\nYou look shyly at her, \"Sooooo, what can you tell me about Brad before the boys come?\"<br>\r\n<br>\r\nShe tells you what she knows. You stare at her a while. \"Wait! A FARM BOY? Seriously?\" You see her look sad, \"Oh, okay. I will keep an open mind. I promise!\" You hugged her.<br>\r\n<br>\r\nWhen the boys got there, you nervously followed Amanda down the steps. When they opened the door, you saw him for the first time. He was very tall, broad shouldered, and, well, handsome! If the tingle you felt running through your body meant anything, it answered the question of whether you were attracted to boys or not! He was seventeen, so two years older than you. You heard Amanda introducing you, and somehow you managed to smile shyly and say, \"Hello Brad.\"<br>\r\n<br>\r\nThe four of you went out to eat, then decided to go skating together. You were not even sure at what point Brad skated up next to you and took your hand, but you were amazed at how hard it was, and yet he was being gentle. It was funny to you, but, as Jessica, you were small, even by female standards, and felt weak and intimidated around most guys now. Especially knowing what was on the mind of most of them, and what that meant for you now. But around Brad, you felt, well, secure. He was such gentleman! He seemed to enjoy being around you as much as you enjoyed him.<br>\r\n<br>\r\nWhen the night was over, Brad looked at you and said, \"Jessica. May I take you home?\"<br>\r\n<br>\r\nYou tried not to blush as you said, \"Yes. I would like that very much.\" You wished Mandy would stop poking you in the ribs and saying, 'I told you so!'<br>\r\n<br>\r\nWhen Brad did take you home, and walk you to your door, you really wondered. Not only what would happen, but what did you really 'want' to happen? He smiled at you, \"Thank you for a great night Jessica. You are a great girl. Would you be willing to go out with me again? Just the two of us?\"<br>\r\n<br>\r\nThis time you did blush, \"I enjoyed myself too Brad. I would be glad to go out with you.\" With that, he leaned over and kissed you. You felt your body react, but then some strange tingle happened in your head.</span></div></div>",
            "created":1470805200,
            "id":2194112,
            "title":"Call Jessica for advice"
        },
        "1131121121":{
            "author_id":"dragon47",
            "author_name":"Dragon47",
            "choices":[
                "2nd date with Brad",
                "8 years later; your wedding day"
            ],
            "content":"<div class=\"\"><div> <span>As you felt some strange tingle in your head, you couldn't help but kiss Brad back.  In fact you scoot in closer to him, in which he responds by wrapping his arms around your waist.  You then proceed to wrap your arms around his neck.  You have no idea why you are doing this but you don't care.  It feels so good.<br>\r\n<br>\r\n5 minutes later<br>\r\n<br>\r\nAfter y'all's lips finally seperate, you couldn't help but smile at Brad as you gaze at his face, as does he to you.  After another minute of just being in each other's arms, Brad says \"this weekend fine?\".  You nod as you continue to smile at him.  After the two of you say goodbye and goodnight to one another, you start to think about what just happened as you watch his car leave.<br>\r\n<br>\r\n1 hour later<br>\r\n<br>\r\nThe kiss has been on your mind as you lie in your bed in your pajamas.  Then a thought occurs to you \"Could it be\".  You gey out your phone as you reluctantly call 'Matt'.<br>\r\n\"Hello?\" A voice responds<br>\r\n\"Hey\"<br>\r\n\"Thought you never wanted to talk to me again\"<br>\r\n\"I don't.  And don't even think I have or ever will change your mind.  The only reason I am calling you is because I think you had cast a different spell on me.\"<br>\r\nNo response <br>\r\n\"You did, didn't you?  Perhaps some kind of spell to make me fall deeply in love with the first boy who kisses me?\"<br>\r\nFew seconds pass when you finally hear a response <br>\r\n\"That was meant to make you reliant and loyal to me.\"<br>\r\nYou hang up on him.<br>\r\nSo basically not only did 'Matt' permanently turn you into a girl but he has also permanently altered your mind.  Though honesty you weren't so much angry at him at the moment as you found yourself thinking about Brad again.  </span></div></div>",
            "created":1500267600,
            "id":2355073,
            "title":"These new feelings......."
        },
        "11311212":{
            "choices":[
                "Yes? she comes into her old room with you after school",
                "No? you try to figure it out yourself"
            ],
            "content":"<div class=\"\"><div> <span>You got changed for school and after some time managed to put a bra and looked inside Jessica's draws and found a pair of plain black panties and then found the standard school skirt, blouse and stockings and put them on, then left and went strait out off the house with out saying bye to anyone there as you didn't know anyone.<br>\r\n<br>\r\nyou got to school and noticed the boys where looking at you ass and that made you feel very uncomfy, you walked into school and went to class the bad thing is that Jessica is in your class and she sat next to you.<br>\r\n<br>\r\nshe started talking, look Matt i'm really sorry about yesterday and wish i could change what i did to you, you look at her and smile, i'm still pissed off with you and i didn't know what to do.<br>\r\n<br>\r\ni don't know how to be a girl in anyway? well if you want Matt i can try to help you if you want, look on the plus side I'm a tomboy and the only girly things i own is this uniform and a black dress my mum got for me that i never wear or should i say your mum.<br>\r\n<br>\r\nLook i understand why you did it but i don't know if i can live in this body? well you'll have to and plus it inn't that bad, what do you mean not that bad? i had boys looking at me and it felt very uncomfy, you know how most girls feel now.<br>\r\n<br>\r\ndo you take her offer to help? </span></div></div>",
            "created":1430974800,
            "id":1974781,
            "title":"You learn what it is like being a girl at school"
        },
        "113112121":{
            "choices":[
                "Walking in heels?",
                "She teaches you something else?"
            ],
            "content":"<div class=\"\"><div> <span>School finished and then you wait for Jessica outside the school gate as you wait you suddenly see her in your body (to your shock) kiss one of the football players good bye on the lips.<br>\r\n<br>\r\nJessica then came up to you and then you both started walking home to get old house.<br>\r\n<br>\r\nSo Jessica, \"I think we should keep with our names\" so Matt what's with you and Will? She smiled and said well we are dating now.<br>\r\n<br>\r\n\"WHAT\" well I am a girl the only difference is I'm now in your old body Matt, so your telling we your sexuality hasn't changed? That's right I'm still into guys and..... and what Jessica? I shaved your my body hair off.<br>\r\n<br>\r\nAnyway we are here, you both go into Jessica's old house and into her room.<br>\r\n<br>\r\nRight you wanted my help sit down, you say down, right first when you sit keep your legs togeather, why? Because if your wearing a skirt or dress no pervert boy will see your underwear.<br>\r\n<br>\r\nRight stand up and did down again Matt, can I take this bloody uncomfortable uniform off first, \"No\" why because I want you to sit probably first so I can't see you knickers.<br>\r\n<br>\r\nAfter 15 minutes you get it and then Jessica says, riht next lesson?</span></div></div>",
            "created":1473915600,
            "id":2210583,
            "title":"Yes? she comes into her old room with you after..."
        },
        "1131121211":{
            "choices":[
                "Go for a walk with your new gay friend?",
                "Say good bye get a shower and bed?"
            ],
            "content":"<div class=\"\"><div> <span>Right get changed Matt, you look a Jessica... What remember I'm homosexual so seeing you naked or in you underwear is nothing to me.<br>\r\n<br>\r\nYou take of the skirt, blouse and tights and your standing there in your knickers and bra.<br>\r\n<br>\r\nJessica walked up to you and say what have you done and straightened up you bra and puts it on the right clip, there Matt that should be more comfortable for you.<br>\r\n<br>\r\nWow it is, what did you do? You had it on the first clapsed it should be on the second darling.<br>\r\n<br>\r\nBut it was so difficult to put on this morning Jessica, right Matt quick tip for begingers when you do a bra up do it backwards, what? when you put it on the cups should on your back and then the clapsed should be in front of you then then you can see what your doing and after you have clipped it together swivel it around and put it into posison.<br>\r\n<br>\r\nThank you Jessica right here put these jeans and top on and then these heels.<br>\r\n<br>\r\nWhy do or did you have heels your a tomboy they go with the dress my sorry your mum got for you, fair enough.<br>\r\n<br>\r\nAfter an hour you finally get it then take them off and put some trainer's on.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1473915600,
            "id":2210593,
            "title":"Walking in heels?"
        },
        "1131121212":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "Skip 10 years (your an adult women)",
                "Skip to your first date as a girl"
            ],
            "content":"<div class=\"\"><div> <span>She put on him her leggings and told him to walk. And when he did she say “good your hips have a nice swag to them and your butt shakes and jiggles nicely. But I think if you put a lot more swag into it you’ll be turning head left and right.” He said “what?! I’m not trying to look sexier” she said “oh I thought you wanted to attract guys. So what do you wanna know” he said “ I don’t wanna do this feminine stuff so can you teach me tips and tricks?” She agreed. And she taught him how to pee standing up . How to minimize his hips swag. What to do during a period without using a tampon. How to fix his hair easily. And I told him he didn’t have to wear bras panties jewelry make up or nail polish. You told her “thanks” and...</span></div></div>",
            "created":1593546240,
            "id":2859249,
            "title":"She teaches you something else?"
        },
        "113112122":{
            "choices":[
                "Try to adjust to being Jessica on your own now.",
                "After a few hours, you change your mind and call her for advice. "
            ],
            "content":"<div class=\"\"><div> <span>\"With all due respect, you did this to me. And it was all for no good reason,\" you say to Jessica. \"I'm not pregnant, so there was no reason for you to do this to me.\"<br>\r\n<br>\r\n\"Matt, I already said I'm sorry,\" answers Jessica. \"Don't you want my help? I understand if you want to break up with me. But can't we at least be friends and help one another adjust to living in each other's bodies like this?\"<br>\r\n<br>\r\n\"No,\" you tell your old body. \"Maybe in a little while I'll cool off and think differently. But right now, I just don't want anything to do with you. It's your fault I'm wearing a school skirt and stockings right now!\"<br>\r\n<br>\r\n\"But I can help you,\" she starts to say.<br>\r\n<br>\r\n\"No,\" you interrupt her. \"I'm the new Jessica now. And I guess I just have to figure things out on my own.\"<br>\r\n<br>\r\n\"If you change your mind, please call me!\" she says. <br>\r\n<br>\r\n\"Sure thing, Matt!\" you say sarcastically.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1447995600,
            "id":2064663,
            "title":"No? you try to figure it out yourself"
        },
        "1131121222":{
            "author_id":"anjalishree",
            "author_name":"Anjali Shree",
            "choices":[
                "you decided to learn more ",
                "this lesson is more than enough!"
            ],
            "content":"<div class=\"\"><div> <span>After an hour I called her... and asked her to teach and help how to be a girl!<br>\r\nshe Agreed to help me , finally she(Matt) arrived to my living room!<br>\r\nhi Jessica(me) I am really happy with yours decision...<br>\r\nnow only you are my girl ...<br>\r\ncarefully listen to my words Jessica now you are in my body as a 15 years old cutest girl!<br>\r\nfirst I will teach you how to sit as a girl<br>\r\n1.Ease into your chair with your knees together<br>\r\n2.Place your hands in your lap. (Once you are seated, fold your hands and place them on your lap between your legs. Maintain this placement when your hands are not in use. This position will also weigh your skirt down, preventing you from flashing your undergarments while crossing your legs.)<br>\r\n3. Maintain a straight line with both legs. Your right and left calves should remain as parallel and as closely lined up to each other as possible. Be sure that your legs remain firmly together while you sit. Keep your toes pointed downward. <br>\r\nRemember to always sit up with your torso straight...<br>\r\ntoday's lessons are over tomorrow I will teach...if you want<br>\r\nand she went from my home...<br>\r\nI was so interested to her lesson now I am enjoying but I don't know why...<br>\r\nand that day I practiced how to sit as a girl </span></div></div>",
            "created":1453352400,
            "id":2092101,
            "title":"After a few hours, you change your mind and cal..."
        },
        "11311212221":{
            "choices":[
                "She wanted to be friends?",
                "She wanted Matt to be her girlfriend?"
            ],
            "content":"<div class=\"\"><div> <span>The next day Jess(Matt) got up and did you morning routine and got dress.<br>\r\n<br>\r\nHe put on a dress and felt self conscious about it, anyway he went downstairs and sat like Matt (Jess) showed him yesterday.<br>\r\n<br>\r\nJessica's mom look and said glad you saying properly now darling, Matt then had breakfast and then walked into town on the way Matt was still feling pretty much naked in the dress so he checked Jessica's bank and took some money out.<br>\r\n<br>\r\nHe then went in to a bear by shop and bought himself a 5 pairs of jeans:<br>\r\n2 pairs of skinny jeans,<br>\r\n2 pairs of boyfriend jeans<br>\r\n1 pair of high waisted jeans<br>\r\nand some tank tops then put some on.<br>\r\n<br>\r\nActs he had them he went into a changing room in the shop and took the dress off and then put on a pair on jeans that took him 5 minutes to get on as he putting on the skinny jeans and then the tank top.<br>\r\n<br>\r\nHe looked into a mirror and started feeling better and less naked.<br>\r\n<br>\r\nThen his phone rang and he answered it, it is Matt (Jessica) she wanted to meet up with you.<br>\r\n<br>\r\nHe said ok, but why?</span></div></div>",
            "created":1473051600,
            "id":2206355,
            "title":"you decided to learn more "
        },
        "113112122211":{
            "choices":[
                "Yeah ok?",
                "No I need to meet your mum she taking me to the salon?"
            ],
            "content":"<div class=\"\"><div> <span>Matt (Jessica) met Jessica  (matt) in a local cafe Matt sore Jessica look at him as he walked in and Jessica said I nether height of wearing jeans when I was in that body, but you look very nice and your pulling the tomboy look off.<br>\r\n<br>\r\nYou say down the started to talk the Jessica who is in your body and chatted away and you both talked for around an hour and a half and decided to be freinds and nothing more just friends.<br>\r\n<br>\r\nJessica looked at you and said you know you do look good but I've realised that I'm not attracted to girl's I'm still attached to boys.<br>\r\n<br>\r\nYou smiled and said yeah well that understandable Jessica, look poelpe are looking I think we should use our names for the bodies we are in, you agree.<br>\r\n<br>\r\nMatt (Jessica) said look Jess  (Matt) I still feel feminine and I thought I would ask if I could wear girl's clothing, you look at her and say I guess if I say no you'll do it anyway so I'm but please try to keep it as boyish as possible so a tomboy male.<br>\r\n<br>\r\nJessica smiled and hugged you then said thank you Matt without thinking.<br>\r\n<br>\r\nShe looked at you and said do you want to help me pick some new outfits out?</span></div></div>",
            "created":1477890000,
            "id":2230877,
            "title":"She wanted to be friends?"
        },
        "113112122212":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>Matt met up with Jessica at a coffee shop although Matt didn't realise that Jessica had alternative ideas.<br>\r\n<br>\r\nAs soon as Matt entered the coffee shop Jessica grabbed hold of him and out of nowhere kissed him in the middle of the café.<br>\r\n<br>\r\nShe then let go and said \"hello Jess\" you froude at her mainly in shock. <br>\r\n<br>\r\nYou look around and noticed nothing no one looking at you or anything like that. <br>\r\n<br>\r\nYou returned to looking at Jess and said \"So Matt... Want do you want?\" well you know we are in a relationship right? You don't want to cause a scene, so you grit your teeth and say \"yeah what about it\".<br>\r\n<br>\r\nWell are we still going on that date tonight? You look around again and see Mike and Sarah and they heard everything. <br>\r\n<br>\r\nThey came over and said \"so you two are dating now even after the pregnancy scare? \"Yeah\" </span></div></div>",
            "created":1543135080,
            "id":2581692,
            "title":"She wanted Matt to be her girlfriend?"
        },
        "1131121222121":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>Jess said \"although originally it was a one night stand that resulted in the pregnancy scare, me and Jess realised we had feelings for each other\".<br>\r\n<br>\r\nYou looked at her and she realised your getting very pissed off but was keeping it together so not to cause a scene. <br>\r\n<br>\r\nShe continued to talk and said \"we decided to try the relationship thing and see how it goes\".<br>\r\n<br>\r\nMike looked at Matt and said \"so Jass I suspect you wanted to chop off Matts balls when you through you were pregnant\" what makes you think I still don't want too! Mike stopped in his tracks but Sarah started laughing and that set you off.<br>\r\n<br>\r\nAfter some time you all went your separate ways, you and Jessica walked into town and you said \"how the fuck could you do that now our friends think we are in a fucking relationship\"... </span></div></div>",
            "created":1543136520,
            "id":2581693,
            "title":"Continue "
        },
        "11311212221211":{
            "author_id":"bruno2008",
            "author_name":"folha",
            "choices":[
                "Okay....",
                "Never!!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...since we're Since we are both in this situation ... don't you think it would be better if we ...? Jessica said. A blush appeared on his face.<br>\r\n<br>\r\nMatt noticed the blush on Matt's face \"Are you serious?!\"<br>\r\n<br>\r\nJessica nodded \"Matt...i still like you...okay? And I think it will be easier for us to get used to it.......What do you think about it?\" He asked<br>\r\n<br>\r\n \"Jess.......\"<br>\r\n</span></div></div>",
            "created":1594292460,
            "id":2864648,
            "title":"Continue "
        },
        "113112122212111":{
            "author_id":"bruno2008",
            "author_name":"folha",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay..\"I will be your boyfriend....\" Matt (In Jessica's body) said<br>\r\n<br>\r\nJessica (In Matt's body) \"No...you will be my girlfriend!\" He said as he kissed his old body again!<br>\r\n<br>\r\n\"H-HEY!!\" Matt exclaimed \"Don't do that things right now!\"<br>\r\n<br>\r\nJessica giggled  \"Okay, okay .... maybe a kiss is too much for you\" He said \"So...do you want to come to my-i mean-your house tomorrow? ' Jessica asked<br>\r\n<br>\r\n\"Why do you want me to come to my house tomorrow?\" Matt asked<br>\r\n<br>\r\n\"I just think you would be happy if you saw your family, you must be missing them ....\" Jessica said<br>\r\n<br>\r\n\"Yeah...\" Matt said saddly.<br>\r\n<br>\r\n\"Matt. I'm really sorry about the body swap...\" The former girl said<br>\r\n<br>\r\n\"It's okay....\" Matt said...\"I will come to YOUR home tomorrow\" She said<br>\r\n<br>\r\n</span></div></div>",
            "created":1594724940,
            "id":2868308,
            "title":"Okay...."
        },
        "1131122":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "I only know how to swap lives back, you’ll have to  be a girl for a while ",
                "I’m inexperience so somethings meant carryover"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Yeah we can switch bad but there is one little problem” and you said “what is The problem” <br>\r\nShe said “...</span></div></span></div>",
            "created":1593543420,
            "id":2859228,
            "title":"We can switch back, but there is a catch"
        },
        "1132":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "somebody comes around",
                "you go home",
                "the party"
            ],
            "content":"<div class=\"\"><div> <span>\"It worked!!!\" the new Matt heard a voice from out of nowhere. He didn’t see anybody….<br>\r\n<br>\r\n\"what worked?\" you asked and wondered still where this voice is coming from…<br>\r\n<br>\r\n\"the gender and life swap spell! Yesterday, when I learnt witchcraft, I decided to have this gender and life spell to be proofed on someone! My name is Jess!” And with that suddenly a young woman appeared and told you that you just are a girl now based on her spell. She will release it after a while.<br>\r\nYou protested and wanted her to release it right now, you don’t want to be a girl!<br>\r\nBut she declined and left you alone with another message that she will show up tomorrow again for sharing some experiences you will have…<br>\r\nYou wanted to hold her back or chase her, but this was impossible you are left alone here now..<br>\r\n<br>\r\nYou just sit down on some bench to reflect your fate and suddenly you remember that tonight there will be the big party where everyone who is cool and has a name at school will be present.<br>\r\nYou were expecting to get some sex there, since always some willing girls will be around at such parties…<br>\r\nYou shiver at the idea that you will be a girl there tonight, and you worry, because you have no clue at all  HOW to act like a teenage girl<br>\r\nAt least you will still be able to be there at the party, but most properly it will not be like it should be…<br>\r\n... Well you know what I mean!\"<br>\r\n<br>\r\nyou start crying and say \"god, I'm already acting like a girl!\"<br>\r\n</span></div></div>",
            "created":1565090760,
            "id":2697974,
            "title":"suddenly a girl"
        },
        "114":{
            "choices":[
                "You are, I mean was transexual, and switched bodies with your neighbor",
                "Your neighbor is, I mean was transexual, and switched bodies with you",
                "Random events that defy yesterday's logic"
            ],
            "content":"<div class=\"\"><div> <span>You are Bradwick Collinsworth X, a generally happy man, except one thing, you are no longer Bradwick Collinsworth X, you are a woman. You don't know it yet, because you are sleeping, but you are a woman. The real question is, why are you a woman?</span></div></div>",
            "created":1473138000,
            "id":2207074,
            "title":"21 year old girl "
        },
        "1141":{
            "choices":[
                "5 ft 9 in, 125 lbs, b cup breasts, brown hair, brown eyes, olive toned skin,",
                "5 ft 2 in, 200 lbs, ee cup breasts, redish-blonde hair, blue eyes, white,",
                "6 ft 6 in, 400 lbs of muscle, aa cup breasts, black hair, green eyes, black,"
            ],
            "content":"<div class=\"\"><div> <span>You wake up not noticing a thing yet. You always kept a slimmer figure so you could barely feel the different between your old body and your new one. The phone rang you answer it, your voice was higher than normal but not noticeable, you always tried to keep a higher voice, you just thought your still sleepy vocal cords cause a higher pitch, it was a man on the phone saying however you are give me back my damn body. You just said, I don't want your body, I can barely stand my own. You didn't notice that the voice was your own manly voice because you always forced a higher pitch. You got another hour of sleep before the doorbell rang, you ignored it thinking it was those damn westboro baptist freaks again telling you that God hated you cuz' \"God hates fags\" and all that shit. Then your phone rang. You answer it, it was the same male voice telling you they are outside and come out before they call the police on you. You called the police. A minute later the police came and you heard a scuffle and the man saying, this is my house though the person inside somehow broke in. The damn doorbell again, you slid out of bed, feeling wobbly, your balance is off, must be the sleep, and you walking through your bedroom which you knew so well you could traverse it with your eyes closed, YOU TRIPPED, WHAT THE HELL. You open your eyes and for the first time notice something's a miss. You are not in your room and you just ran into a dresser against the wall. You find your way downstairs and to the front door to the house that you were sleeping in, still not noticing your body due to looking up to admire the home. You open the door and the officers say, \"Hello Ma'am.\" \"Ma'am I must be getting really good with the trans thing if people are mistaking me for a girl.\" \"Yes officer.\" \"This man says he lives here.\" The man look just like you. The officer took your shocked look as a confession to the contrary and said, \"Do you know this man, ma'am, and can you prove you live here.\" \"Officer, I don't know why but I am not feeling myself today, I swear to you, I don't remember moving into this house, or ever living here, and that man looks just like me as you can probably tell.\" The police woman behind the police man who was talking to you looked at both of your and said, \"Miss, are you on drugs?\" You look at her and say, \"I am most definitely not on drugs I am Bradwick Collinsworth X, I might look feminine due to the fact that I am Transgendered but I am who I am, I don't live here, I look like him, in fact he might very well live here. Officer, \"So you have proof of identification, because he is Bradwick Collinsworth X. You looked shocked and said, \"I can most definitely prove I am the man I claim to be, unfortunately. You stumbled around the house trying to find your purse with your wallet and you figure that somehow you must have lost it and told the officers, \"This man must have taken my purse with my id because I can't find it anywhere.\" Officer, \"There is a purse right here ma'am.\" \"But that is not mine.\" \"Then you stole it?\" \"No, I just, I don't know, it's not mine, just like this house.\" Police woman, \"She is definitely on drugs.\" Police man, \"This id has you on it, miss Genevieve Brooknell. \"Genevieve, no I am.\" \"Yes we know, take them both in, we will get this shit straight.\" You look at the picture on the id and it is not a person you have ever seen. This must be a prank. They handcuff you and take you out to the car, on the way you pass a mirror and see the woman on the id. You sit there in the backseat next to what you can only assume was is your real body. You are both taken in and upon being told to change into prison garb you see your new body.</span></div></div>",
            "created":1473915600,
            "id":2210548,
            "title":"You are, I mean was transexual, and switched bo..."
        },
        "11411":{
            "choices":[
                "your first day as a girl",
                "a week later"
            ],
            "content":"<div class=\"\"><div> <span>\"I am petite, I am beautiful, I am perfect! Yay!\" The police woman looks and says, \"Yeah I think your just crazy, not even the druggies are that happy to be in prison.\" You look at her and say, \"Oh, no, I am quite perturbed by the situation, it's just, I noticed I had finally, lost the little bit of weight I was trying to lose.\" She looks at you and says sarcastically, \"Well congratulations, now put on the damn jumpsuit and get in the prison.\" It took a couple hours and finally you were released, but so was you body. You and 'he' have a talk and decide that until you figure this shit out it is best to live each other's lives, so you give each other a list of your personal day to day things and go on you way.</span></div></div>",
            "created":1475557200,
            "id":2219033,
            "title":"5 ft 9 in, 125 lbs, b cup breasts, brown hair, ..."
        },
        "114111":{
            "choices":[
                "wolf whistles and guys never leaving you alone",
                "sneers, and jeers from discusted women calling nasty names"
            ],
            "content":"<div class=\"\"><div> <span>You were ecstatic, skinny dipped in \"your\" pool, then took a shower, masturbated. Then you decided to go out in the town, that is when some of that magical feeling began wearing off when you, still thinking like a person interested sexually in women and therefore dressing like your fantasy of how women dress, dressed accidentally sexual. Thus bringing the plague of...</span></div></div>",
            "created":1477371600,
            "id":2228058,
            "title":"your first day as a girl"
        },
        "1141111":{
            "choices":[
                "The next day",
                "The next friday"
            ],
            "content":"<div class=\"\"><div> <span>You couldn't walk two feet without hearing a whistle and a, \"Damn girl you looking fine today.\" Worst off if you even looked at a guy wrong for harassing you, it was met with, \"Probably on her period.\" or \"Probably a Lesbian.\" Well you got home and took a long look in the mirror. You changed into something more decent, no change, it must be your body, you feel ashamed of it now. You decided to meet up with some of your body's friends at a bar, and you cannot get a second to yourselves. Finally a guy walks up, a real manly man too, and kisses you and says, \"Hey sweetie I haven't heard from you all day, you avoiding me or something?\" You say, \"No, just doing stuff, didn't really think about it.\" He looks at you and says, \"Okay well, I don't wanna bother your night out. Just wanted to say hi. Bye.\" You say bye as your girlfriends say, \"Bye, Ben.\" This will make day to day easier.</span></div></div>",
            "created":1481259600,
            "id":2248068,
            "title":"wolf whistles and guys never leaving you alone"
        },
        "11411111":{
            "choices":[
                "bondage fetish",
                "petplay fetish"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You and Ben were talking about what to do. You decided to experiment with a </span></div></span></div>",
            "created":1490331600,
            "id":2294357,
            "title":"The next day"
        },
        "1141112":{
            "choices":[
                "That weekend",
                "The next morning"
            ],
            "content":"<div class=\"\"><div> <span>You couldn't walk two feet without hearing a, \"Damn girl have some decency.\" Well you got home and took a long look in the mirror. You changed into something more decent, no change, it must be your body, you feel ashamed of it now. You decided to meet up with some of your body's friends at a bar, and you cannot get a second to yourselves. Finally a guy walks up, a real manly man too, and kisses you and says, \"Hey sweetie I haven't heard from you all day, you avoiding me or something?\" You say, \"No, just doing stuff, didn't really think about it.\" He looks at you and says, \"Okay well, I don't wanna bother your night out. Just wanted to say hi. Bye.\" You say bye as your girlfriends say, \"Bye, Ben.\" This will make day to day easier.</span></div></div>",
            "created":1505710800,
            "id":2387782,
            "title":"sneers, and jeers from discusted women calling ..."
        },
        "114112":{
            "choices":[
                "her stash of \"toys\"",
                "her secret life"
            ],
            "content":"<div class=\"\"><div> <span>It took a week to figure out the basics. Some of these basics are, don't dress how you envision you would dress as a woman, because that is most likely based off how you learned to over sex women from media, you are looked upon as less due to lingering sexual stereotypes so you have a fine line to tread between ignored and bitchy, women, unlike men, feel temperature at skin level, due to an extra layer of thin fat between skin layers to better regulate internal temperature, something important in fetal health, and therefore you fluctuate quickly between 'I'm hot' and 'I'm cold', and that extra weight on your chest hurts your back.<br>\r\n<br>\r\nThat is, however, when you made a very interesting discovery about your new body.</span></div></div>",
            "created":1478667600,
            "id":2234784,
            "title":"a week later"
        },
        "1141121":{
            "choices":[
                "the normal vibrating kind",
                "the kind to more 'extreme' fetishes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of toys</span></div></span></div>",
            "created":1478754000,
            "id":2235273,
            "title":"her stash of \"toys\""
        },
        "11411212":{
            "choices":[
                "playing like a pet",
                "bondage"
            ],
            "content":"<div class=\"\"><div> <span>Your heart fluttered, and you felt warm down below. You always wanted two things sexually, to dominate a woman, consensual of course, and to be put in a submissive position as a woman. In a way this is kinda both, you are still unattached to you body enough to feel it is a stranger, but also you will feel the bonds/collar on you own skin. You decide to strip down naked and begin playing out your, and Genevieve's, fetish of...</span></div></div>",
            "created":1480050000,
            "id":2241625,
            "title":"the kind to more 'extreme' fetishes"
        },
        "114112121":{
            "choices":[
                "Gene, Sweetheart, what is this?",
                "Buttercup, daddy's home! Come here and get your collar on!"
            ],
            "content":"<div class=\"\"><div> <span>It was a warm spring day so you knew you didn't have to worry about freezing. You noticed that \"you\" had installed a device on the door that with the push of a paw the door would open, as long as the door was unlocked. You unlocked the door and went into the kitchen, where you placed a two bowls, on you filled with water, the other you would have to cheat and make food like a person when that time of the day came. Then you went up stairs and took your pajama shirt off and placed it in the hamper, your phone beeped, it was your boyfriend texting you. You ignored it and took off your pajama shorts and placed them in the hamper too. You admired your naked body and looked at your phone to see what Ben had said, \"Whacha doing 2day?\" You thought hard about your response, you decided to just leave it at, \"Thinking of having some fun. With you it would be funner. Use your key.\" You placed the phone down and ran to your room and grabbed the collar and placed it next to the door with a note that said, \"You doggy needs dressing.\"<br>\r\n<br>\r\nBen came in the door and saw the collar, \"Oh, that kind of fun.\" This was the moment of truth, you weren't sure if the previous Gene shared her kink with Ben but she sure was. The collar said, \"Buttercup\" on it, her dog name. Her question was answered when Ben said, \"_\"</span></div></div>",
            "created":1489122000,
            "id":2287677,
            "title":"playing like a pet"
        },
        "1141121211":{
            "choices":[
                "Ben sneaks in and locks you out, then burglarizes your house",
                "You lock yourself out, petplay turns to ENF"
            ],
            "content":"<div class=\"\"><div> <span>Gene crawled down to her man, \"Woof.\" Ben, \"Oh, shit, your naked and why are you acting like a dog?\" Gene sighs and stands up, \"I was playing a sexy little game.\" Ben, \"Sexy? You get turned on by acting like a dog?\" Gene, \"Dogs, Cats, I dream about being locked in a giant hamster cage and playing hamster, horses, things not real but moves like real animals,\" Ben, \"Okay, stop, just stop. Why?\" Gene shrugs, \"Guess I thought animals were cute as a young girl.\" Ben, \"But how the fuck does animals turn you on.\" Gene, \"It doesn't! I'm not a bestiality freak!\" Ben, \"There's no difference between that and what your doing. Let me guess you act like an animal, I act like you pet, then I fuck you as said animal?\" Gene, \"You wouldn't fuck me as an animal, unless you were an animal too.\" Ben, \"You're a perv and I'm leaving you.\" Gene, \"You know what! Fine! If you can't accept me as I am then get out of my house, I'll play by myself.\" Ben, \"Go ahead and play with yourself then.\" Slams the door. Gene, \"Fucker.\" She quickly goes on a fetish dating site and updates her profile, wait a minute, this is the body's profile which means you can access her memories. You switch yourself to single and close it out, you wanna play and you don't have the time to await a real master. You put on your collar and go outside. That is when something unexpected happens.</span></div></div>",
            "created":1492405200,
            "id":2306573,
            "title":"Gene, Sweetheart, what is this?"
        },
        "11411212111":{
            "choices":[
                "First play session with Mo",
                "Your honeymoon play session with Mo"
            ],
            "content":"<div class=\"\"><div> <span>You went out and peed in the woods. Then you found a spot elsewhere and pooped. You used the hose to wash yourself off and played around outside. You then acted like you heard your owner and crawled back into the house. The door was locked. You could have sworn you left it unlocked. You used your key pad number to unlock the door, it worked. You walked inside to see your whole house empty except a note that said, \"Took all the human shit since you like being an animal. -Ben\" You decided you needed to talk to a neighbor and to make Ben look worse. You ran full force into the wall. You laid there in pain on your floor for about 30 seconds and got up. The mirror in your bathroom showed an open wound on your cheek, wouldn't scar, but looks nasty. Bruises formed all over your body and you legitimately cried in pain. You ran next door and got your neighbors attention. He came to the door and you cried, \"Help Ben beat me up and robbed me of all my possessions.\" He called the police and gave you some of his wife's clothes to put on, she didn't mind. The police came and questioned you and Ben was swiftly taken to jail. He claimed he didn't beat you but none of your neighbors had seen you and he did have all your stuff. He was sent to jail for 6 years, one for assault and battery and five for grand theft. By this time you happened to stumble upon a man who shared your fetish and you moved in with him. His name was Mo.</span></div></div>",
            "created":1505710800,
            "id":2387798,
            "title":"Ben sneaks in and locks you out, then burglariz..."
        },
        "11411212112":{
            "choices":[
                "\"we're moving to the penthouse above the club.\"",
                "\"I've sold your house.\""
            ],
            "content":"<div class=\"\"><div> <span>You went out and peed in the woods. Then you found a spot elsewhere and pooped. You used the hose to wash yourself off and played around outside. You then acted like you heard your owner and crawled back into the house. The door was locked. You could have sworn you left it unlocked. You used your key pad number to unlock the door, it didn't work, fuck Ben changed it yesterday and was coming over to tell you the new code. You decided you needed to talk to a neighbor. You ran full force across the yard and got your neighbors attention. He came to the door and you cried, \"Help I, ah, somehow locked myself out.\" Jeff just stood there, \"Don't lie to me, I'm not stupid. come in.\" She stepped in and Jeff closed the door and just said, \"What's the problem? Use your key pad.\" \"Ben changed it and never told me the code, then he broke up with me and I locked the door.\" Jeff said, \"I'll call Ben.\" \"No! I mean let me talked to him.\" but Jeff was already on the phone. \"Yeah, hey Gene's been locked out what's the code. K thanks bye.\" Then Jeff grabbed a leash and said, \"Let's get your back home, poor little puppy.\" Gene started, \"W-what no what are you,\" clip, she forgot about her collar. He tugged towards the backdoor and said, \"C'mon buttercup out back so no one else see's you.\" He led you back home and took you to the backyard. Then he closed the door and it took you a second to notice that the leash had no tension on it. You didn't want to go out front but Jeff had just left you. He went around to the side door and let himself in. In about a minute he came out back and walked onto the deck. You ran up to your neighbor but one look from him made you stay quiet. He pushed you to your knees and said, \"I've seen you every-time you played pet. You like to act like dogs, cats, bunnies, horses. You fantasize about being other animals. Ben broke up with you because he doesn't understand your fetish. I do understand, I run a club,\" hands her a card, \"It is a place where little pets like you can play with other pets. The patrons have noticed that I have not had a pet since Laurie. How would you like to be my little pet-girl?\" Gene shook her butt and barked excitedly. He smiled and said, \"You know since Ben had been paying your rent your homeless, unless you move your stuff to my house. But you will have to sell some stuff and of course the money would go to me as your fee for saving you. You will be my pet always unless I ask you to not be so, what animal will change with my whims and honestly, I'll own your stuff and you and will deal with selling what I feel you don't need. Do you consent to be my pet in totality?\" Gene could barely contain her excitement and she jumped up on Jeff and began licking him. \"Good. Go home.\" You looked at Jeff's house and ran home. The next day some people came and took out Gene's stuff. She was curious how much of her life would be sold. Jeff came back with her fetish stuff and left again. The mover's came and went and came again and went again. finally they left fully and Jeff came back empty handed. She didn't have anything but her pet stuff. He took her to the club and they had everything, a pen for pets to play, kennels for when masters/mistresses needed to leave town, outside play area for pets to play together, and best of all adult sized play-tubes so she could play hamster. He let her go and said, \"The whole club is yours to play with all your new friends.\" That night you were super tired and fell asleep on the way home. The next morning she got up and went in the kitchen for breakfast. Jeff had left for work and gave you rein of the house. You had fun and when he came home Jeff told you,</span></div></div>",
            "created":1505710800,
            "id":2387841,
            "title":"You lock yourself out, petplay turns to ENF"
        },
        "1141121212":{
            "choices":[
                "Ben's friends. Ben said she was away and decided to have a party",
                "Ben brought home another woman, your memories said were cuckold when a pet"
            ],
            "content":"<div class=\"\"><div> <span>Gene crawled down to her man, \"Woof.\" Ben, \"Oh, baby, your naked did I forget your collar?\" Gene barks and crawls in a circle, he puts on her collar and says, \"Lets play outside\" They played ball and went inside. Gene ate lunch out of the bowl on the floor and Ben went out to the store. Gene looked outside the window, some older people walked by, Gene got scared she'd been spotted when a delivery woman drove up. Gene hid and waited for her to leave. She went back to her perch and looked out again, \"Ben is taking a long time.\" thought Genevieve. Then it hit her, lunch. She pranced over to the device but forgot Ben had disengaged the machine because he was playing with her. She then decided to cheat, but the doors were locked, obviously she'd cheated before and he took precautions. She then laid on her perch waiting impatiently for her salvation. Eventually she knew she had to be a bad dog and potty on the floor. Ben came home about a half an hour after she made a mess and was not happy. \"Buttercup!\" She slinked up and he grabbed her and actually stuck her nose in it and spanked her. Then he threw her into a cage and locked it. He cleaned up her mess and said, \"You know what baby. I am not letting you out tonight, good night, see you tomorrow.\" and went home.<br>\r\n<br>\r\nThe next morning Gene woke up cold and still in dog mode. Ben came back over but she heard someone else...</span></div></div>",
            "created":1493096400,
            "id":2310933,
            "title":"Buttercup, daddy's home! Come here and get ..."
        },
        "114112122":{
            "choices":[
                "\"Honey who did this?\" and ran up to you, seeing the note",
                "\"Oh, that kind of fun!\" and closed the door"
            ],
            "content":"<div class=\"\"><div> <span>It was a warm spring day so you knew you didn't have to worry about freezing. You noticed that \"you\" had installed multiple inconspicuous devices around the house so that you could have fun anywhere. You chose where and how you were going to first tie yourself up. Then you went up stairs and took your pajama shirt off and placed it in the hamper, your phone beeped, it was your boyfriend texting you. You ignored it and took off your pajama shorts and placed them in the hamper too. You admired your naked body and looked at your phone to see what Ben had said, \"Whacha doing 2day?\" You thought hard about your response, you decided to just leave it at, \"Thinking of having some fun. With you it would be funner. Use your key.\" You placed the phone down and ran to tie yourself up, now in visible range of the door with a note next to you saying, \"I'm ready for anything!\"<br>\r\n<br>\r\nBen came in the door and saw you, This was the moment of truth, you weren't sure if the previous Gene shared her kink with Ben but she sure was. Her question was answered when Ben said, \"_\"</span></div></div>",
            "created":1489122000,
            "id":2287679,
            "title":"bondage"
        },
        "1141121221":{
            "choices":[
                "You were tied up and dumped leaving you until a friend came home",
                "You were tied up by a boyfriend that loves you fetish"
            ],
            "content":"<div class=\"\"><div> <span> \"Honey who did this?\" and ran up to you, seeing the note. Gene looked up cheerfully and said, \"Hn!\" Ben, \"Oh, shit, your naked and why are you tied up? Willingly!\" Gene sighs and mumbles, \"Hm whf plhnnng h fmxn lnttlm ghmm.\" Ben, \"What?\" He removes the gag, \"I was playing a sexy little game. Now put the gag back in\" Ben, \"Sexy? You get turned on by acting out criminal activity?\" Gene, \"It's not criminal if we role-play that it's consentual\" Ben, \"Okay, stop, just stop. Why?\" Gene shrugs, \"I guess I get turned on by the idea of trusting someone enough to let them put me in a helpless situation and knowing they would let me out\" Ben, \"There's other ways of doing that shit.\" Gene, \"Yeah but this way makes me feel goo\" Ben, \"You know what no! There's no difference between this and sexual abuse. How do I know I won't one day wake up tied up and being raped by you or tied up non-concentually if I piss you off or that this is just your way of getting me in a situation where you tie me up and rob me, or kidnap me, or rape me, you know I've been raped by a woman when I was a kid. I'm sensitive to this shit. I will not engage in your sick fetish!\" unties Genevieve. Gene, \"We can create scenario we want. I will always be concentual and I will never tie you up without your consent. Ben please.\" Ben, \"You're a perv and I'm leaving you.\" Gene, \"You know what! Fine! If you can't accept me as I am then get out of my house, I'll play by myself.\" Ben, \"Go ahead and play with yourself then.\" Slams the door. Gene, runs outside, \"I'm sorry I'll change!\" Ben, \"No you won't, this is part of you.\" and drives off. She quickly goes on a fetish dating site and updates her profile, wait a minute, this is the body's profile which means you can access her memories. You switch yourself to single and close it out, you wanna play and you don't have the time to await a real master. plan out a new game.</span></div></div>",
            "created":1492405200,
            "id":2306585,
            "title":"\"Honey who did this?\" and ran up to you..."
        },
        "11411212211":{
            "choices":[
                "A neighbor saw her and wished to become her master, with her consent of course",
                "When Ben mentioned the situation a friend grew interested and became you new bf"
            ],
            "content":"<div class=\"\"><div> <span>This all plays out in Gene's head.<br>\r\n<br>\r\n<br>\r\n\"Honey who did this?\" and ran up to you, seeing the note. Gene looked up cheerfully and said, \"Hh!\" \"Oh, shit, your naked and why are you tied up? Willingly!\" Gene sighs and mumbles, \"Hm thhd mhslh uh.\" Ben, \"What?\" He removes the gag, \"I was playing a sexy little game. Now put the gag back in\" Ben did and Gene mmphed incoherently for about 15 minutes. Ben then grabbed Gene's bank card and said, \"I'm going out to get food, you want any?\" \"Yehs cld uu het mm somhhih.\" \"What, never mind I see your tied up. I'll be back.\" She struggled for another 30 minutes when Ben came back, again, just in her head. \"Bhn, mhshher.\" He ignored her and ate, she struggled for another 15 minutes. After an hour of struggling she grew tired and wrapped up the game.<br>\r\n<br>\r\nBen walked towards the door. Gene called out and he just said, \"I can't date a girl who is a perv, we are through, but thanks for the lunch. Oh and I'll call one of you neighbors to untie you, sometime this week.\" and closed the door. She struggled again and 'eventually' escaped her easily undone self-bondage. Unbeknownst to her...</span></div></div>",
            "created":1507784400,
            "id":2400414,
            "title":"You were tied up and dumped leaving you until a..."
        },
        "11411212212":{
            "choices":[
                "Your first date",
                "After you got married"
            ],
            "content":"<div class=\"\"><div> <span>You used ropes to tie your feet to the foot of the bed, you grabbed the toy handcuffs and locked both cuffs on one wrist, tested the release, it worked, and then assured you could escape when ready you locked a cuff to that wrist again. You shoved a lubed dildo in your vagina and set it for timed start. You blindfolded yourself, gagged yourself with a microfoam tape gag, then wrapping the chain of the cuffs around a pole in the head board locked your other wrist in. The buzzing of the dildo began and you had a wonderful day with your \"boyfriend\". You fell asleep and awoke the next morning sore from being left in bondage, which you played up in your imaginary scenario. You untied yourself and went about your day. At the store you met a cute guy you saw you on kinktastic dating and you two started a simple relationship.</span></div></div>",
            "created":1506056400,
            "id":2389349,
            "title":"You were tied up by a boyfriend that loves you ..."
        },
        "1141121222":{
            "choices":[
                "The next weekend",
                "Date night"
            ],
            "content":"<div class=\"\"><div> <span>\"Honey who did this?\" and ran up to you, seeing the note. Gene looked up cheerfully and said, \"Hn!\" Ben, \"Oh, baby, you should have waited, safety first.\" Gene sighs and mumbles, \"Hm gnhw hhw th tnm mnfmlf hp, fnlln.\" Ben then said, \"You want anything to eat?\" Her response, \"Hnln nhhr dngg.\" Ben looked at her, \"No dick for you yet, only if you're a good girl.\" \"Bht mhftmr, Hm hm h ghhd gnrl. Dhn't mhgm mm phht.\" Ben ordered silence and ate lunch, then went out to the store. Gene was left right in front of the window. Some older people walked by, Gene got scared she'd been spotted when a delivery woman drove up. Gene sat perfectly still. The woman left. She went back to pondering, \"Ben is taking a long time.\" thought Genevieve. Then it hit her, she was hungry, horny, and now has to go potty. She tried to escape but couldn't, she was too good. Eventually she knew she had to potty on the floor. Ben came home about a half an hour after she made a mess and was not happy. \"What the fuck!\" She cowered and said, \"Hm ghhldn't hhld Hmt Mhftmr, Hm'm fhrrn, dhn't phnnfh mm.\" he grabbed her and spanked her. Then he moved her into the laundry closet and left her in the dark. He cleaned up her mess and said, \"You know what baby. I am not letting you out tonight, good night, see you tomorrow.\" and went home.<br>\r\n<br>\r\nThe next morning Gene woke up cold, sore and still tied to a chair. Ben came back over and untied her.</span></div></div>",
            "created":1493182800,
            "id":2310940,
            "title":"\"Oh, that kind of fun!\" and closed the ..."
        },
        "1141122":{
            "choices":[
                "a criminal",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>that being a secret life as</span></div></span></div>",
            "created":1478667600,
            "id":2234785,
            "title":"her secret life"
        },
        "11412":{
            "choices":[
                "follow one",
                "follow both"
            ],
            "content":"<div class=\"\"><div> <span>You thought, 'This is amazing!\" You spend about an hour in the cell and you both are checked for drugs. Bradwick is still erratic about the situation and afterwards the two of you begin talking. It is made clear to him that as far as you know this is irreversible. You both give each other a list of all the information the other should know about their new body. As you walk back in your new house and begin getting used to it. There is a knock at the door, you look and see a man of about 75 out there with Brad and you crack open the door. He asks if he can come in and you ask why at which he responds, to tell you about how this happened to you. You begin talking to him and he tells you both that this is a science experiment gone wrong and that they can reverse it if you wish. Brad yells quickly that he would but you hesitate, for obvious reasons. You finally admit that this is everything you ever wanted and that you hoped to never find the reason for this \"accident\". Bradwick begins yelling at you and screaming, and crying for that fact. The situation is dire, you try to tell Bradwick that since he was a trans he could continue doing girly things without anyone batting an eye, but of course he said that he didn't want to pretend he actually wanted to be a woman and you respond, so...did...I, until this miracle happened. You ask for at least a month with this, to see what it's truly like to be a woman, and at the end of that month you would tell him your thoughts and he would tell you his. If they both feel it is for the best they would switch back and at least you would have a month in a body you love. Bradwick consented.<br>\r\n<br>\r\n(I feel it is best to follow both at the same time seeing how both fare with their new lives, however, I also want to give the option so...)</span></div></div>",
            "created":1475298000,
            "id":2217535,
            "title":"5 ft 2 in, 200 lbs, ee cup breasts, redish-blon..."
        },
        "114121":{
            "choices":[
                "Bradwick's body",
                "Geneveive's body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>that one being...</span></div></span></div>",
            "created":1475298000,
            "id":2217538,
            "title":"follow one"
        },
        "1141211":{
            "content":"<div class=\"\"><div> <span>Brad's body<br>\r\nHe began getting used to his new body. Despite being girly you were still a well built man. He decided to go out not in drag. He also decided to spend the month muscling up, if he wanted to stay, he's handsome, if not, the manly body will drive the real Brad insane.<br>\r\n<br>\r\nThey met at the gym. Brad look like hell, as a woman he never worked out, and the body was only used to working out enough to stay thin. He saw his old body and realized that Brad was about to do what you never found the patience to do, get fit. Genevieve's body saw her old body and waved, then proceeded to run for as long as she could on the treadmill. Afterwards both met up and had a salad together for lunch. Gene admitted that being a man was nice, woman looked but never made a fuss over you, men only looked at you in competition, and best off, she didn't have to worry about all the bullshit involved with being a woman, the shaving her legs, and arms, and crotch, just on the off chance that some guy sees her, likes what he sees, and ruin's her day by pestering her until she threatens to call the police. She liked not having to spend sooooooooo much time putting on make up, and of course she couldn't reasonably stop shaving and using make up, the world would look at her as a freak. Her natural lazy attitude was just enough to be a productive man, she could focus on the important stuff, like working, finding a mate to have fun with, and all that jazz, and it seemed that her old body had found a soul that fit it better, a man who spent his whole life wishing to wake up one day and be able to put on makeup, shave his crotch, legs, and arms, and walk out into the world bold and beautiful. A man that even would suffer the tinge of pain every 28 days as he bled from his new vagina, suffer the wonderful pain of pushing a human out of himself, a man that could and would walk into a room and demand respect and know how to do it without being, \"that bossy bitch\". That is when Genevieve realized that the world may be better if some men were women and women, men. Then she realized that both of them were happier in their new bodies and she said, \"Genevieve.\" Her body looked up and said, \"Yeah.\" and he said, \"I want to stay in this body, if you don't find any reason after this month to change I want to stay, you belong in that body and I belong in this one.\"<br>\r\n<br>\r\nAt the end of the month<br>\r\n<br>\r\nDespite the physical and cultural hardships she faced the former Brad was glad stay Genevieve. Brad never saw her old body again. He kept up with her but he now had a wife and children to care for, yeah not giving birth was a bullet dodged. He was happy and healthy for the rest of his life.</span></div></div>",
            "created":1490418000,
            "id":2294655,
            "title":"Bradwick's body"
        },
        "1141212":{
            "choices":[
                "gay making her now straight",
                "straight making her now gay"
            ],
            "content":"<div class=\"\"><div> <span>Gene's body<br>\r\nShe began getting used to her new body. Despite being girly as a man you were still a little uncomfortable being a woman. This is real, REAL. You really could go out in a dress and makeup without stares, well, that is, if you can rid yourself of about 100 pounds, you were obese. She also decided to spend the month getting fit, if she wanted to stay, she's beautiful, if not, the well toned womanly body will hopefully be a nice reward for the real Genevieve.<br>\r\n<br>\r\nThey met at the gym. Brad look like hell, as a woman he never worked out, and the body was only used to working out enough to stay thin. He saw his old body and realized that Brad was about to do what you never found the patience to do, get fit. Genevieve's body saw her old body and waved, then proceeded to run for as long as she could on the treadmill. Afterwards both met up and had a salad together for lunch. Gene admitted that being a man was nice, woman looked but never made a fuss over you, men only looked at you in competition, and best off, she didn't have to worry about all the bullshit involved with being a woman, the shaving her legs, and arms, and crotch, just on the off chance that some guy sees her, likes what he sees, and ruin's her day by pestering her until she threatens to call the police. She liked not having to spend sooooooooo much time putting on make up, and of course she couldn't reasonably stop shaving and using make up, the world would look at her as a freak. Her natural lazy attitude was just enough to be a productive man, she could focus on the important stuff, like working, finding a mate to have fun with, and all that jazz, and it seemed that her old body had found a soul that fit it better, a man who spent his whole life wishing to wake up one day and be able to put on makeup, shave his crotch, legs, and arms, and walk out into the world bold and beautiful. A man that even would suffer the tinge of pain every 28 days as he bled from his new vagina, suffer the wonderful pain of pushing a human out of himself, a man that could and would walk into a room and demand respect and know how to do it without being, \"that bossy bitch\". That is when Genevieve realized that the world may be better if some men were women and women, men. Then she realized that both of them were happier in their new bodies and she said, \"Genevieve.\" Her body looked up and said, \"Yeah.\" and he said, \"I want to stay in this body, if you don't find any reason after this month to change I want to stay, you belong in that body and I belong in this one.\"<br>\r\n<br>\r\nAt the end of the month<br>\r\n<br>\r\nDespite the physical and cultural hardships she faced the former Brad was glad to say, \"I am a woman, call me Genevieve.\" Brad never saw her old body again. He tried to keep up but couldn't. Gene now her life is a story. She was a woman that knew what a man wanted, and wanted those same thing too. For things first, getting a better job. She became a business owner. Her company made millions in the first year. She, however, on purpose was a good but not great leader. So it was no surprise when she asked for a buyout and took her millions and retired.<br>\r\n<br>\r\nNext step find a mate. When she was Brad she was</span></div></div>",
            "created":1490418000,
            "id":2294661,
            "title":"Geneveive's body"
        },
        "11412121":{
            "choices":[
                "made a baby",
                "you relaxed for the first time in years"
            ],
            "content":"<div class=\"\"><div> <span>You started dating and you loved it. You weren't obligated to pay for most meals, and almost anytime you said you were open to 'fun time' the guy was open for it too. In fact you dated your way up to the top of a fortune 500 company and became a billionaire. Then you realized you were 24 wealthy beyond belief but you were missing out on a real relationship. You hit up all your old flings but most were happily married. They you started online dating and found him, Lucas. You made sure you could trust him, and he loved you for your personality. It was when he asked for you hand in marriage that you opened up to him just how wealthy you were. You got married and you took him to a private island in Aruba and...</span></div></div>",
            "created":1501477200,
            "id":2362687,
            "title":"gay making her now straight"
        },
        "11412122":{
            "choices":[
                "Leash",
                "Bondage tools"
            ],
            "content":"<div class=\"\"><div> <span>What's Interesting is, when you went on social media, you saw status:taken. You checked the info and found the info said, In a relationship with Francis Lorsius. She was cute. You called her up and she sounded a little perturbed, \"Why haven't you called?\" \"Sorry I've been outta myself. Can I make it up to you?\" \"Yeah, you know what to do. You're losing your privileges for the weekend.\" and hung up. You went up. In the closet you found a box that had some adult toys. You pulled out your...</span></div></div>",
            "created":1501045200,
            "id":2359958,
            "title":"straight making her now gay"
        },
        "114121221":{
            "choices":[
                "a female version of yourself",
                "a different woman"
            ],
            "content":"<div class=\"\"><div> <span>She grabbed her collar and put it on and clipped the leash to the hook. She put on her muzzle, a panel gag, her tail butt plug, her ears, which clipped onto her real ears, causing constant discomfort, and finally her paw mittens. She walked down and crawled in her cage. She locked the cage and waited for her mistress. Franc took her time to release her doggie. Eventually Gene heard the door unlock. She awaited her punishment. Frannie came in and opened the cage, Gene crawled out. Fran led her outside and into a cage in her van. She locked the cage, threw a blanket over it, and went back inside. Fran came back with somethings and locked the door. She got in the car and began driving, not saying a word. Gene fell asleep.<br>\r\n<br>\r\nShe awoke still in her cage, and Francis still driving. She felt like she slept a whole night and she realized she had to pee. She began whining like a dog and Franc just said, \"We're almost there.\" About 10 minutes the van stopped and Frannie got out. She heard her girlfriends voice and another female voice. Fran, \"She's in here, I can't wait for her to see.\" Other woman, \"Do you think she'll be angry. You kinda tricked her and kidnapped her.\" Gene's heart skipped, she did sleep for a whole night. The door opened up and the two women lifted Gene's cage. She started getting frantic and yelling out, however, because of the gag your cries came out as believable dog noises of Oof and whines. The cage was set down and the blanket was removed. She was in a house she's never seen before. The other woman was a well built woman of about Gene and Fran's age. Fran opened the door and pulled on Gene's leash. Gene was forced to obey and follow the women. Fran sat down on the couch and said, \"Welcome to our new home!\" She removed your gag and told you to speak to her in human. \"Where are we? Why did you take me? What about my life?\" Francis just looked down at you and said, \"We are in our new house in the southern half of the united states. I took you because I've grown quite fond of you. Finally, what life? Last night you killed yourself in a horrible gas leak fire. All your possessions up in flame, your had been supported my me anyways and since I dumped you, you felt you had nothing left and burnt your life to the ground. By the way this is Mora she'll by your new owner and the three of us will live happy together.\" \"Fuaahhhhh.\" The collar shocked her. \"Be careful of that shock collar. You leave the vicinity of this house and it'll shock you until you return. You do anything bad and shock. You try to get help, shock. Your only option is to suck it up and be a good doggie.\" That was when the police came busting in. Unknown to them the collar on your neck was linked to Fran's heart beat. If it stopped the collar would release a blade right where Gene's throat was. <br>\r\n<br>\r\nYou woke up as Brad again, Gene knew something was up and switched to try to save herself, but upon death the switch was reversed. There was on side effect. You were slowly turning into</span></div></div>",
            "created":1501131600,
            "id":2360514,
            "title":"Leash"
        },
        "114121222":{
            "choices":[
                "Fran held that massive party and Gene was forced to be the waitress",
                "One of the random times Fran wanted to 'have fun'"
            ],
            "content":"<div class=\"\"><div> <span>She walked down to the basement into the windowless corner Fran loved so much for their games. She tied her breasts and vagina with rope. Then she used two pairs of handcuffs to lock her legs together with the chair being behind the pole in the corner and another one to attach her legs together. She then taped her thighs together and wrapped her legs to the pole. She then shoved a rag deep in her mouth, cleave gagged in the rag, and tape wrapped her head. Then she clipped one cuff onto her wrist and slid the blindfold over her eyes. She taped her arms in the same manner as her thighs and reached around the back of the pole and pushed the other cuff on her wrists, binding her arms behind her back. Fran walked in and searched the house for Gene until she found her. Fran looked over her girlfriend and said, \"Not bad, you look secure and a little uncomfortable. Well, I'm going to hand out around the house, okay.\" And she left upstairs. Fran came back, \"Hey I'm heading out to pick up dinner, you want anything?\" \"Nmhh, fhrm. Hm'm ghhld mht.\" Fran started teasing Gene, \"What I couldn't make that out.\" Gene signed and shook her head, before she could react Fran said, \"Nothing okay, bye.\" Door closed, Engine started, tires whirled on road, and silence.\" About an hour later Fran came back. Gene heard a second set of footsteps and remained silent. Fran took the other person upstairs and said, \"Make yourself at home.\" The other woman, \"Your girlfriend won't mind will she, I just need to quickly use her phone.\" \"No I texted her, she's kind enough to let a woman in need use her phone.\" \"You sure.\" Gene hated when strangers used her stuff but calling out would expose her. \"Do you hear her complaining. She's probably gotten somewhere, mouth full, roped into another person's plan, wrapped up in some trouble, locked into her own designs, or just standing around tied up in something, hoping she doesn't get exposed to something embarrassing.\" The other woman giggled and said, \"My boyfriend is the same way. There's always a call and he's out with the guys.\" The woman called her boyfriend. He came about 10 minutes later, picked up his girl, and took her back to her car to fix it. Fran came down and said, \"You ready to be let out of time out.\" Gene nodded and Fran let her go. Fran had her pleasure her without allowing Gene any sexual release of her own. Then Fran left and said, \"Remember our big trip tomorrow to my California house.\" Fran and Gene got up early to catch the train that was going to take them, slowly, to their vacation destination. They got bored on the train and since Gene was still in trouble Fran thought it only fit that she get some quiet time with Gene tied up. Fran put the do not disturb sign up, locked the door, drew the shades and grabbed the toys. Gene stripped and Fran gagged her with a ball gag. Then Fran used rope to hogtie Gene and used tape to cover the accessible knots. She then shoved a leather hood over Gene's head plunging her in darkness. Gene was lifted into the luggage compartment, which was locked, and Fran went out to mingle with the other guests. About two o'clock in the morning a drunk Fran came back and crashed on the floor. Wake up call was 9, Fran got up, released Gene, got changed, and went to her mansion on orange beach California. That's when Fran dropped some news on Gene. This move was permanent and Gene only owned the clothes on her, oh wait Fran was burning Gene's only set of clothing. Fran decided to use Gene as a toy for her enjoyment. Like the time when...</span></div></div>",
            "created":1501131600,
            "id":2360533,
            "title":"Bondage tools"
        },
        "114122":{
            "content":"<div class=\"\"><div> <span>Brad's body<br>\r\nHe began getting used to his new body. Despite being girly you were still a well built man. He decided to go out not in drag. He also decided to spend the month muscling up, if he wanted to stay, he's handsome, if not, the manly body will drive the real Brad insane.<br>\r\n<br>\r\nGene's body<br>\r\nShe began getting used to her new body. Despite being girly as a man you were still a little uncomfortable being a woman. This is real, REAL. You really could go out in a dress and makeup without stares, well, that is, if you can rid yourself of about 100 pounds, you were obese. She also decided to spend the month getting fit, if she wanted to stay, she's beautiful, if not, the well toned womanly body will hopefully be a nice reward for the real Genevieve.<br>\r\n<br>\r\nThey met at the gym. Brad look like hell, as a woman he never worked out, and the body was only used to working out enough to stay thin. He saw his old body and realized that Brad was about to do what you never found the patience to do, get fit. Genevieve's body saw her old body and waved, then proceeded to run for as long as she could on the treadmill. Afterwards both met up and had a salad together for lunch. Gene admitted that being a man was nice, woman looked but never made a fuss over you, men only looked at you in competition, and best off, she didn't have to worry about all the bullshit involved with being a woman, the shaving her legs, and arms, and crotch, just on the off chance that some guy sees her, likes what he sees, and ruin's her day by pestering her until she threatens to call the police. She liked not having to spend sooooooooo much time putting on make up, and of course she couldn't reasonably stop shaving and using make up, the world would look at her as a freak. Her natural lazy attitude was just enough to be a productive man, she could focus on the important stuff, like working, finding a mate to have fun with, and all that jazz, and it seemed that her old body had found a soul that fit it better, a man who spent his whole life wishing to wake up one day and be able to put on makeup, shave his crotch, legs, and arms, and walk out into the world bold and beautiful. A man that even would suffer the tinge of pain every 28 days as he bled from his new vagina, suffer the wonderful pain of pushing a human out of himself, a man that could and would walk into a room and demand respect and know how to do it without being, \"that bossy bitch\". That is when Genevieve realized that the world may be better if some men were women and women, men. Then she realized that both of them were happier in their new bodies and she said, \"Genevieve.\" Her body looked up and said, \"Yeah.\" and he said, \"I want to stay in this body, if you don't find any reason after this month to change I want to stay, you belong in that body and I belong in this one.\"<br>\r\n<br>\r\nAt the end of the month<br>\r\n<br>\r\nDespite the physical and cultural hardships she faced the former Brad was glad to say, \"I am woman, HEAR ME FUCKING ROAR!\"</span></div></div>",
            "created":1477026000,
            "id":2226806,
            "title":"follow both"
        },
        "11413":{
            "choices":[
                "during you time in prison",
                "After they cleared you of drugs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You got the very thing you always wanted but now you are more manly than you ever were as a man, NOOOOOOOOOOOOOOOOOOOO!</span></div></span></div>",
            "created":1475038800,
            "id":2216240,
            "title":"6 ft 6 in, 400 lbs of muscle, aa cup breasts, b..."
        },
        "114132":{
            "choices":[
                "racial problems come in",
                "You switch, again!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He told you to take care of his former body and was never seen again. Eventually the body became somewhat feminine so you began enjoying your life, until</span></div></span></div>",
            "created":1490677200,
            "id":2295857,
            "title":"After they cleared you of drugs"
        },
        "1141322":{
            "choices":[
                "5 ft, 95 lbs, aa cup breasts, brown hair, brown eyes, Asian, mistaken as a child",
                "6 ft, 115 lbs, d cup breasts, hair dyed multiple colors, green eyes, in a band"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This time you woke up as</span></div></span></div>",
            "created":1490763600,
            "id":2296408,
            "title":"You switch, again!"
        },
        "11413221":{
            "choices":[
                "\"I'm an adult, asshole.\"",
                "Ignore them and go about your day"
            ],
            "content":"<div class=\"\"><div> <span>You awoke again, at first you thought you were a child. You saw a man downstairs with some kids, you thought they were your father and siblings. Then the man kissed you on the lips and said, \"How are you, you took a nasty fall last night at the bar.\" You just looked shocked and said, \"Ah, fine.\" The kids then got up and ran out the door yelling, \"Bye mom, sorry we couldn't have breakfast with you.\" You husband then left for work and said, \"If you need me I'm one call away.\" You thought back to your new life and found you were a stay at home mom. You decided to live up that life. You became the best stay at home mom ever. You went to the store and that is when you encountered your first issues with your new body. Someone thought you were a kid skipping school. Your response, </span></div></div>",
            "created":1492750800,
            "id":2308578,
            "title":"5 ft, 95 lbs, aa cup breasts, brown hair, brown..."
        },
        "114132211":{
            "choices":[
                "the adult kind of services",
                "taking up any and all of his house chores"
            ],
            "content":"<div class=\"\"><div> <span>\"Young Lady!\" The woman grabs your arm, \"I am taking you back to school!\" You than sighed and went full stereotypical Asian and used your knowledge of martial arts and broke free. The woman grabbed at you and you decided to fuck up her day. You, knowing no one knows you, yelled, \"Help she's trying to kidnap me!\" At this a crowd of people stop her and detain her. You didn't stay to get in actual trouble. As soon as you got to the car your phone rings. You answer it as you start the engine, \"Hello?\" \"Akira, why am I getting a call that you caused a scene in Cheapmart?\" \"Some woman was trying to drag me off to school.\" \"Well you got us banned from the only store we can afford to shop at. What do you have to say for yourself?\" \"Stop chiding me like a child!\" \"Than stop acting like one!\" \"You know what.\" You hung up the phone, it was true though. When you husband got home he explained the trouble he had to go through to be allowed back in. The kicker was ONLY he is allowed back. He now has to pick up groceries after work. He told you that until further notice every time he goes to get groceries you will have to repay him in a service of his choosing. You knew that meant</span></div></div>",
            "created":1493874000,
            "id":2315025,
            "title":"\"I'm an adult, asshole.\""
        },
        "1141322111":{
            "choices":[
                "The next day for oil",
                "That weekend"
            ],
            "content":"<div class=\"\"><div> <span>Starting with today's trip. Your head sinks, \"What do you have in mind?\" He leads you up to the master bedroom, you strip, and he mounts you doggie style. After he is done you go down to start dinner. You ask you husband, \"How long will this punishment last?\" He just answers, \"Until either you are allowed back into cheapmart or we move. By the way they were talking though you are blacklisted from all cheapmarts so really unless I get a promotion this is permanent.\" You respond, \"I actually think I like this though, even if we move can we at least keep up the sexy games.\" He smiles and says, \"That's my freaky girl.\" The next time he went to the store was</span></div></div>",
            "created":1496379600,
            "id":2329858,
            "title":"the adult kind of services"
        },
        "11413221111":{
            "choices":[
                "it was your husband and kids",
                "it was not your family, oh shit, and they know you're in the house"
            ],
            "content":"<div class=\"\"><div> <span>Oh no not car oil though, sex oils, and lubes. You, \"That doesn't count.\" pouting. You husband, \"The kids are at a sleepover and you can't deny me if I go to the store.\" You smile and say, \"At least I control you heart.\" He says, \"But I control you everything. Now strip!\" You start with your shorts figure it's best if you excite him. Then you slowly take off you shirt, revealing that you were not wearing a bra, your body is used to this, benefit of being nearly flat. Then you take off you panties and he says, \"You know what to do with that.\" Your heart skipped, you racked your memory hoping he meant something else, he didn't. You put your own panties in you mouth. You were like most trans people, you like the gender you wish you were and have even made love to women. You found you actually preferred the taste of the other women's crotch sweat which you tasted when eating them out, maybe it's because this body registers that that taste is from it. You spit them out and say, \"I can't do this today.\" \"Okay, fine, maybe you'll change your mind.\" You go upstairs and he leads you to the walk in closet in the master suite. He hand cuffs you to the racks in a standing spread eagle. He then uses a sleep mask to blindfold you. You hear scooting and he says, \"Open up.\" You do and he sticks his penis in you mouth. You never thought this would ever happen, you didn't even like men and yet you became a married woman and before your husband's penis ever enters the proper hole for it you have felt him stick it in you ass and now your sucking it like a damn Popsicle. You taste his salty sperm as it shoots down your throat. You swallow, figuring it was better than having to clean it off the rug when you were freed. You actually kind of liked it, oh shit, of course you would like men now, your a straight woman, your feelings are tied, no pun intended, to the body's mind. You now stood there and waited to be released there was a ring and he said, \"Open up.\" You did and unsurprisingly he put a gag in your mouth, you could tell it was a ring gag. He closes the door and walks down to the door. You hear your neighbors and you husband say, \"Dirty laundry Akira must have dropped on her way out. You want to come in?\" They did and had a coffee and a chat with your husband. You tried to keep as quietly as you could. Finally they left and you husband came upstairs. He wasn't half way down when the doorbell rang again. It was Mr. Kronston dropping off your kids, supposedly there was an emergency and they had to return you kids early. \"I'm sorry about that, how about I take you out on the town.\" your husband said. Own of your kids, you haven't the need yet to learn your kids names from you memory, said, \"What about mom?\" \"Well she got banned from cheap-mart and so every-time I go to the store she's has to be punished for her childish behavior, but don't worry I make it fun for her too.\" One of your older kids said, \"Oh, that kind of punishment.\" and then all your kids agreed with them. You thought back and remembered that you were the one that revealed how your husband and you played sometimes and were generally open with your kids on all things sexual and kinky. Thus meaning you were tied up, and probably nude.<br>\r\n<br>\r\nYou had fallen asleep when you heard the door open and close. It was a group of feet on the floor and someone whispered, \"Don't be too loud or you'll wake her up.\" It took you a second to realize</span></div></div>",
            "created":1496466000,
            "id":2330631,
            "title":"The next day for oil"
        },
        "114132211111":{
            "choices":[
                "That weekend",
                "The next day again"
            ],
            "content":"<div class=\"\"><div> <span>Your kids scurry off to their rooms to do whatever and you husband came in the master suite and you said, \"Nhh whgm mm, ghn nhh plmhfm lmt mm gh?\" You husband came in and said, \"Sorry babe was trying to let you sleep.\" He began feeling you up instead of releasing you, \"You know I could probably do your job and mine. You could always just be where ever I want you and never released.\" This turned you on for some reason. You didn't ever know where it came from but you blurted out, \"Hh bhbn plmhfm. Hmf nhh rmlmhfm mm Hm'll lmt nhh dh whhtmvmr nhh whnt wnth mm.\" \"I can already do that.\", he said, \"But I'll make a deal.\" He releases you and your muscle memory sparked. You went over to the bed and waited until he laid down, completely nude. He was already erect and you mounted him and rode him hard. He fell asleep and you snuggled up next to him.<br>\r\n<br>\r\nThe next time he went to the store was</span></div></div>",
            "created":1496811600,
            "id":2332708,
            "title":"it was your husband and kids"
        },
        "114132211112":{
            "choices":[
                "Spreadeagle to the bed",
                "to a chair in the master closet"
            ],
            "content":"<div class=\"\"><div> <span>They walked around the house quietly stealing stuff. Then they found you, \"Don't worry Mrs. Johnson, we'll let you be.\" They rummaged through your jewelry and you couldn't help but hope they weren't staring at you. \"Bye Akira.\", and they left. Your husband came home about an hour later and realized they had been burglarized and called the police. The police came and began searching the house. They found you and your state was then believed to be connected to the burglars. You told them they only tied you up and left you naked as a deterrent for calling out, something you said you did anyways. They caught the burglars and they were put away for more than they did and were beat up in prison because of it. Your husband, \"One of those burglars was the niece of the CEO of Cheapmart. To keep that quiet they'll allow you to shop there again, next time you do something like that the punishment won't be something you'll enjoy, though so don't go messing around.\" \"So I'm free from punishment?\" \"Yes and no, you said you liked it so we'll continue.\" \"Can I tie you up?\" \"Sure if I allow it.\" Your heart skipped in your chest, your starting to feel the attractions a nympho woman would have.<br>\r\n<br>\r\nThat evening your husband allowed you to tie him up in reward for going with his plan in the courts. How did she tie him up </span></div></div>",
            "created":1498453200,
            "id":2343127,
            "title":"it was not your family, oh shit, and they know ..."
        },
        "11413221112":{
            "choices":[
                "Friday, after grocery shopping",
                "That afternoon, after grocery shopping"
            ],
            "content":"<div class=\"\"><div> <span>Walter came home, \"Hey baby I went to the store again and look who's not home yet.\" You looked and said, \"Didn't you say you had plans?\" \"Yes, and you obviously weren't listening either. Well strip and go to the special room.\" Your body took over and you took off all your clothes, put them in the hamper, and walked up to your room. You couldn't place it but you knew there was something about this weekend that you needed to remember. You walked past the bed into the bathroom, and stopped in the linen closet in the back of the room. You pulled a lever that was hidden and opened a secret chamber that laid behind the bathroom's linen closet and the bedrooms clothes closet. You walked in an you heard the door open up. Walter said, \"How about you tie yourself up and I will make sure the kids are taken care of.\" \"Okay, I'll make you horny.\" He went to check on the kids and you grabbed some interesting things. You started with a full body harness that hid nothing but still clung tight to your curves. Then you found clothes pins and clipped them to your nipples, and clitoris. Then you shoved a rag in you mouth and used a scarf to hold it in and then clear tape to wrap around you head, silencing yourself, but showing your master you are not going to make a sound. You placed yourself between to poles laid down cuffed your ankles together, used a leather blindfold to blind yourself and finished by cuffing your wrists together. You heard Walter give the kids a snack and say, \"alright I'll be upstairs getting ready for our week long camping trip in the mountains.\" Oh shit, that is what you forgot. He came upstairs and saw you, \"Sexy!\" He checked everything, \"cuffs on ankles and wrists are real cuffs and sturdy, blindfold effective, but-\" ungags you, takes out rag and regags you, \"unsafe gag for unsupervised bondage. Alright your tight, and since you chose bondage over a week in the mountains you will get your wish.\" \"Whht! Nh, plmhfm, Hm whhld mhgh rhthmr gh ghmpnng thhn fthn tnmd hp fhr h wmmg. Hm fhrght, lmt mm gh plmhfm hnd Hm'll gmt rmhdn fhr ghmpnng.\" he removed the clips so your circulation wasn't cut off to any areas and left and closed the panel, \"Whltmr!\" you screamed but remembered the room is soundproof and you only heard your family because of speakers in the room that are connected to the mics of your security system, that way you could have fun but still know what is going on in the house. You heard the closet door shut, rummaging in the bathroom, and then the bathroom door shut. Then you heard packing and your children ask, \"Where's mom.\" Walter, \"Oh, I'm sorry kids your mother got tied up and can't come with us.\" You kids sighed and your family left for the week to go camping.<br>\r\n<br>\r\nA week later your family came back. Your husband cleaned up and went to bed without even looking at you.<br>\r\n<br>\r\nThe next morning your husband sent your kids off to see a friends and finally released you. \"Had to make sure the kids were gone before releasing you, that way they don't know you would rather spend a week in bondage rather than camping.\"<br>\r\n<br>\r\nYou were starting to regret your constant urges for sex.</span></div></div>",
            "created":1498021200,
            "id":2340127,
            "title":"That weekend"
        },
        "114132212":{
            "choices":[
                "your husband coming in",
                "The door bell"
            ],
            "content":"<div class=\"\"><div> <span>\"Whatever. Believe what you want.\" Security came over and when they saw it was you waved and said, \"Sorry about that Mrs. Jones.\" You came home with the groceries and prepared your lunch. You didn't know why modern stay at home moms complain so much, it's not the 1890's were everything had to be done by hand. You had machines to do the laundry, dishes, and even for the floor, you had a freaking Cleanba, the latest in automatic cleaning robots. What took your parents collectively all week you got done in a few hours and had the rest of the time to veg out. You took a nap and was woken by</span></div></div>",
            "created":1493182800,
            "id":2311444,
            "title":"Ignore them and go about your day"
        },
        "1141322121":{
            "choices":[
                "leashed petplay",
                "bondage"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey baby, I got home early.\" He kisses you. Your new body always seemed horny, your memories confirmed, clinical nymphomaniac, cool. You said, \"Let's have some fun.\" You both went upstairs. You put on a collar and strip. Then you grab a leash in you right hand and you bondage bag in the other and said, \"Your choice.\"</span></div></div>",
            "created":1497848400,
            "id":2338981,
            "title":"your husband coming in"
        },
        "11413221211":{
            "choices":[
                "a exhibitionist's town",
                "a cabin"
            ],
            "content":"<div class=\"\"><div> <span>He grabbed the leash but didn't put it on, \"I don't wanna walk the dog right now.\" You knelt on all four and barked. You were playing around the house as a dog when your kids came home. Your mind took over and said to hide, but you made the mistake of doing it with a human run. \"Brittney are you running on two legs.\" You look over and see your husband coming, you begin running on all fours away from the kids. They come in and go up to their rooms. Your husband found you and dragged you out and into the den, \"What happened?\" \"Woof.\" He got red and you realized the answer was more important than the game, \"The kids came home.\" \"When has that ever stopped you Brittney!\" You memories confirmed that you actually do fetish stuff around your kids and like them to explore their own sexuality. \"I panicked and lost myself.\" Walter looked at you and said, \"Don't do it again. Oh and you just got this game extended until tomorrow morning.\" You both heard the kids and you husband came out and said, \"Hey guys your mom's playing a dog. Treat her like a dog okay.\" You walked out and your kids didn't even flinch. You youngest son even petted you as you crawled by. About an hour later you tapped on you husband and looked outside and you youngest daughter clipped your leash and walked you out to use the bathroom. None of your kids seemed to even care that they were playing a part in your sexual game. That night you slept on the floor. The next morning was a Friday and you were going for a week trip camping in the mountains. Up in the mountains you were going to...</span></div></div>",
            "created":1501304400,
            "id":2361625,
            "title":"leashed petplay"
        },
        "11413221212":{
            "choices":[
                "meet up with other fetish families",
                "cabin camping"
            ],
            "content":"<div class=\"\"><div> <span>He grabbed the bag and led you to the basement, \"How long should you stay tied up?\" You memories confirmed that you actually do fetish stuff around your kids and like them to explore their own sexuality. You were tied standing spread eagle, using course chaffing rope, with a rag tied around your eyes blinding you, and another rag shoved deep in your mouth and shiny vent tape holding it in. You heard your kids and your mind took over struggled to get free before the kids saw, but you corrected yourself thinking that your kids probably are used to seeing you nude and/or tied up. \"Brittney are you okay your struggling.\" You turn your head towards your husband coming, you nod yes and he says, \"One second the kids are in. They come in and go up to their rooms. Your husband came back in and asked, \"What happened?\" \"thm gndf.\" He got removed the gag and asked again, \"The kids came home.\" \"When has that ever stopped you Brittney!\" \"I panicked and lost myself.\" Walter looked at you and said, \"Don't do it again. Oh and you just got this game extended until the weekend.\" You both heard the kids and your husband replaced the gag and walked upstairs and said, \"Hey guys your mom's playing kidnap victim game. Treat her like shit okay.\" You imagined your kids didn't even flinch. After dinner they came down and did some painful things to you to torture you like a abused kidnap victim. None of your kids seemed to even care that they were playing a part in your sexual game. That night you slept standing, and the day after that was more of the same. The next morning was a Friday and you were going for a week trip camping in the mountains. Up in the mountains you were going to</span></div></div>",
            "created":1501304400,
            "id":2361630,
            "title":"bondage"
        },
        "1141322122":{
            "choices":[
                "you were caught tied up",
                "your husband came home"
            ],
            "content":"<div class=\"\"><div> <span>There was a delivery person their, \"Hey, is your parents home?\" You look at them and said, \"I am the woman of the house.\" They look at you and said, \"Can I see ID.\" You show them and they say, \"I cannot believe you are in your thirties. Anyways here is your delivery.\" They left it had your name and you opened it, \"OOOO these look fun.\" You took the 'adult toys' upstairs and began to play. But then...</span></div></div>",
            "created":1500267600,
            "id":2354919,
            "title":"The door bell"
        },
        "11413221221":{
            "choices":[
                "a spanking",
                "no sexual release for a week"
            ],
            "content":"<div class=\"\"><div> <span>You were blindfolded, ring gagged, and cuffed spreadeagled to your bed. When you heard the door. You assumed it was your husband so you didn't think anything of it. You heard the footsteps and continued to struggle. That was when you heard him approach and the bed shook slightly to your husband picking up the keys. \"Whaf nh eschp fhh mh?\" \"No mom! You knew these were mine and yet your still used them. Well as punishment your going to stay like this.\" You fought back as your 16 year old daughter walked away with your escape. You laid there all night, you forgot your husband was on a business trip. You daughter watched your younger kids and even invited her boyfriend over for sex. \"Yeah my parents are out of town and my siblings are downstairs blasting whatever. So we can be as loud as we want.\" You laid there hearing your daughter have intense sex and you had no release. Finally she released you and made you sanitize her bonds. Your husband came home and learned everything. He punished you with...</span></div></div>",
            "created":1508389200,
            "id":2403760,
            "title":"you were caught tied up"
        },
        "11413222":{
            "choices":[
                "your old body came to the show",
                "You switched again"
            ],
            "content":"<div class=\"\"><div> <span>Your ears were ringing and your bed was rocking. You jumped up and hit your head. You awoke to a group standing over you. \"Jewel are you okay?\" You mumbled yeah. When you hit your head though you forgot your whole old life and lived a nice normal life. That was until</span></div></div>",
            "created":1494392400,
            "id":2317253,
            "title":"6 ft, 115 lbs, d cup breasts, hair dyed multipl..."
        },
        "114132221":{
            "choices":[
                "upon your death you'll switch with a younger body",
                "the moment you have relations you'll switch with your mate"
            ],
            "content":"<div class=\"\"><div> <span>You had just finished your show when a large black woman walked up to you and yelled, \"Give me my body bad bitch.\" and began pounding you into the floor.<br>\r\n<br>\r\nThere was a strange phenomenon in these body switching. She actually beat \"you\" to death before security could pull her off. You however didn't die, she did. She was switched back into your body right as the final blow struck and her last moment was spent watching her former body lay a skull smashing fist into her original body. The body was left soulless and fell dead of cardiac arrest. You were put into your original body with the black woman's soul still in your body. You awoke to the alarm turning on the news and hearing that your second body killed your third body, with you now remembering everything. However you then remembered every second of three body's memories and heard the voice of body two remark in you head. After a while you got used to hearing a voice in the back of you mind. You, being the original soul, had complete power over the body and the other soul was pushed to background wisdom, which you used to effect basically of the movie, \"What women want.\" Eventually though her soul faded due to lack of connection to her body and she died in spirit. You lived a relatively normal life, until you learned one last side effect of the body switching voodoo.</span></div></div>",
            "created":1496379600,
            "id":2329789,
            "title":"your old body came to the show"
        },
        "114132222":{
            "choices":[
                "on her 18th birthday, 5' 7\", 115, c cup,",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You became woman</span></div></span></div>",
            "created":1498107600,
            "id":2340803,
            "title":"You switched again"
        },
        "1141322221":{
            "content":"<div class=\"\"><div> <span>Mary spent the day with her family and then went home. She was a lesbian that grew up in an extremely homophobic home so she didn't tell her parents about the girlfriend, who she invited over. Her babe said she had plans for her, but those plans would be permanent. Henri came over with a bag and said, \"Before I begin, do you consent to anything?\" Mary's heart raced and she nodded yes and said, \"Was the loss of my virginity the permanent part of the plan?\" Henri didn't answer just pull out a roll of tape and said, \"Strip.\" Mary did and when she was nude Henri began taping and explaining the situation. Wrists wrapped, \"Your hands are now tied in the matter and cannot go back on the consent, no matter what happens you have already consented.\" Mary, \"Why are you talking like that? Is this what you need to be turned on?\" Her arms were wrapped to her body immobilizing her, \"I want to make our situation permanent. If at the end of this you want to leave that is fine but tonight you're mine.\" Mary, \"What the fuck? You're scaring me.\" Henri, \"Shhh, I'm not going to hurt you, I'm just trying to bring you the happiness you deserve, I can tell that despite the opposition this will end how you want it.\" Thighs taped, \"Now only if you want to stay with me and open your own legs for me will I ever see those legs apart.\" Mary, \"Well you're consistant.\" Ankles taped, \"Now you can't walk out of what I have planned for tonight.\" Mary, \"And what if I want to leave.\" Henri blindfolds Mary, \"Now you're physically as blind as you are to my plans.\" Mary, \"What UUMPH.\" Henri shoved a foam ball into Mary's mouth and tape wrapped it shut, \"Shhh, you consented to anything, you haven't had a say since.\" Mary struggled but couldn't stop Henri from walking over to her phone, picking it up and saying, \"next time it rings I, your girlfriend, will answer the phone.\" \"fuhk yoh.\" Henri said, \"For that I'll do two things one, I'm ending it, two, I'm sending the pics from all our sexual experiments to your parents and letting them untie your ungrateful ass.\"<br>\r\n<br>\r\nAbout an hour later Mary's parents were in her apartment scolding her for her indecent behavior. However, the woman above you heard the whole thing and eventually came to your rescue. The two of you fell deeply in love and she respected you, you did play up bondage and other kinks but because it was a relationship of love and respect instead of a woman taking advantage of your inexperience the games were fun and sexual. Eventually your parents gave up on you and stopped telling you how to live your life. After a year as her you woke up in your old body again, a rush of memories flooded your head, you forgot about your experience but subconsciously retained the feelings of how to respect a wife and be respected by a wife. Speaking of which, your's woke up and said, \"Good morning Brad, what do you want to do today?\" You answered with a kiss and said, \"If you're up to it, you wanna fuck?\" She answered with a kiss and ripping your shirt off.</span></div></div>",
            "created":1508216400,
            "id":2402878,
            "title":"on her 18th birthday, 5' 7\", 115, c cup,"
        },
        "1141322222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A woman on her honeymoon.</span></div></span></div>",
            "created":1508475600,
            "id":2404035,
            "title":"other"
        },
        "1142":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Machine",
                "No idea"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were a man but switched bodies to a women, but the question is how did you switch bodies?</span></div></span></div>",
            "created":1473138000,
            "id":2207129,
            "title":"Your neighbor is, I mean was transexual, and sw..."
        },
        "11422":{
            "choices":[
                "6 ft, 230 pounds of muscle, DAMN foot long penis",
                "5 ft 9 in, 250 pounds of fat, 3 1/2 inch penis"
            ],
            "content":"<div class=\"\"><div> <span>You wake up not noticing a thing yet. You always kept a bulky figure so you could barely feel the difference between your old body and your new one. The phone rang you answer it, your voice was deeper than normal but not noticeable, you always tried to keep a deeper voice, you just thought your still sleepy vocal cords cause a deeper pitch, it was a woman on the phone saying whoever you are give me back my damn body. You just said, I don't want your body, I ain't no tranny, you were a little trans-phobic. You didn't notice that the voice was your own womanly voice because you always forced a deeper pitch to gain respect or some shit. You got another hour of sleep before the doorbell rang, you got up thinking it was those damn gypsies trying to repave your driveway. Then your phone rang. You answer it, it was the same female voice telling you they are outside and come out before they call the police on you. You called the police. A minute later the police came and you heard a scuffle and the woman saying, this is my house though the person inside somehow broke in. The damn doorbell again, you slid out of bed, feeling wobbly, your balance is off, must be the sleep, and you walked through your bedroom which you knew so well you could traverse it with your eyes closed, YOU TRIPPED, WHAT THE HELL. You open your eyes and for the first time notice something's a miss. You are not in your room and you just ran into a dresser against the wall. You find your way downstairs and to the front door to the house that you were sleeping in, still not noticing your body due to looking up to admire the home. You open the door and the officers say, \"Hello sir.\" \"sir, I'm a woman!.\" \"Sorry ma'am didn't realize you were trans. This woman says ahe lives here.\" The woman looks just like you. The officer took your shocked look as a confession to the contrary and said, \"Do you know this woman, ma'am, and can you prove you live here.\" \"Officer, I don't know why but I am not feeling myself today, I swear to you, I don't remember moving into this house, or ever living here, and that woman looks just like me as you can probably tell.\" The police woman behind the police man who was talking to you looked at both of your and said, \"Miss, are you on drugs?\" You look at her and say, \"I am most definitely not on drugs I am Jennifer Natilliammi, I don't know why so think I am a man, I probably am sick though cuz my voice is way too deep, but I am not a man and I do not live here and I don't know how I got here, she might very well live here but I don't know how I am here and not her. Officer, \"So you have proof of identification, because she is Jennifer Natilliammi. You looked shocked and said, \"I can most definitely prove I am the woman I claim to be, unfortunately. You stumbled around the house trying to find your purse with your wallet and you figure that somehow you must have lost it and told the officers, \"This woman must have taken my purse with my id because I can't find it anywhere.\" Officer, \"There is a purse right here ma'am.\" \"But that is not mine.\" \"Then you stole it?\" \"No, I just, I don't know, it's not mine, just like this house.\" Police woman, \"She is definitely on drugs.\" Police man, \"This id has you on it, mister Allen Kawalskavich. \"Allen, no I am.\" \"Yes we know, take them both in, we will get this shit straight.\" You look at the picture on the id and it is not a person you have ever seen. This must be a prank. They handcuff you and take you out to the car, on the way you pass a mirror and see the man on the id. You sit there in the backseat next to what you can only assume was is your real body. You are both taken in and upon being told to change into prison garb you see your new body.</span></div></div>",
            "created":1490763600,
            "id":2296705,
            "title":"No idea"
        },
        "1143":{
            "choices":[
                "machine invented that switched your bodies",
                "magic spell",
                "wishing upon a star, it's no different who you are(except it is different)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What random event was it?</span></div></span></div>",
            "created":1473224400,
            "id":2207491,
            "title":"Random events that defy yesterday's logic"
        },
        "11432":{
            "choices":[
                "Male body",
                "Female body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You would slowly turn into each other and no one would notice. Will we follow Janet trying to adjust to being her husband or Kevin trying to adjust to being his wife.</span></div></span></div>",
            "created":1496206800,
            "id":2328895,
            "title":"magic spell"
        },
        "11433":{
            "choices":[
                "story continues through the body(girls pov)",
                "story continues through the mind(his pov)"
            ],
            "content":"<div class=\"\"><div> <span>When a star is born<br>\r\nThey possess a gift or two<br>\r\nOne of them is this<br>\r\nThey have the power to make a wish come true<br>\r\n<br>\r\nWhen she wished upon a star<br>\r\nMade no difference who you are<br>\r\nAnything her heart desires will come through you<br>\r\n<br>\r\nIf your body is in her dream<br>\r\nNo request is too extreme<br>\r\nWhen you wish upon a star<br>\r\nAs dreamers do<br>\r\nFate is kind<br>\r\n<br>\r\nShe brings to those who love<br>\r\nThe sweet fulfillment of their secret longing<br>\r\n<br>\r\nLike a bolt out of the blue<br>\r\nFate steps in and sees her through<br>\r\nWhen she wished upon a star<br>\r\nher dreams came true<br>\r\n<br>\r\nWhen she wished upon a star<br>\r\nMade no difference who you are<br>\r\nAnything her heart desires will come through you<br>\r\n<br>\r\nIf your body is in her dream<br>\r\nNo request is too extreme<br>\r\nWhen you wish upon a star<br>\r\nAs dreamers do<br>\r\nFate is kind<br>\r\n<br>\r\nShe brings to those who love<br>\r\nThe sweet fulfillment of their secret longing<br>\r\n<br>\r\nLike a bolt out of the blue<br>\r\nFate steps in and sees her through<br>\r\nWhen she wished upon a star<br>\r\nher dreams came true</span></div></div>",
            "created":1473397200,
            "id":2208001,
            "title":"wishing upon a star, it's no different who ..."
        },
        "115":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "9 year boy",
                "17 yar old guy",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More More More More!!!!!</span></div></span></div>",
            "created":1294290000,
            "id":1030393,
            "title":"Other"
        },
        "1152":{
            "author_id":"switcher",
            "author_name":"switcher",
            "choices":[
                "Adam and Mike Switched Bodies",
                "Adam Possessed Mike"
            ],
            "content":"<div class=\"\"><div> <span>Adam sat on the small dock that was in his backyard, looking out at the river. It was a warm, Sunday afternoon and the fifteen year old boy was quite bored. As he sat on the dock, his older brother Mike walked out and stood over him. \"Hey bro, what're you up to?\" Mike asked him. Mike was dressed in a t-shirt and athletic shorts. \"Nothing really, just being bored,\" Adam asked as he looked into the lake. He then saw something glowing and decided to pick it up. \"What is it?\" Mike asked Adam, interested. \"It's a stone..\" Adam replied, admiring the glowing green stone he had just picked up from the lake. Suddenly, Adam began feeling weird. That's when..</span></div></div>",
            "created":1529555460,
            "id":2510126,
            "title":"17 year old guy"
        },
        "1153":{
            "author_id":"shifter98",
            "author_name":"Greatshift98",
            "choices":[
                "A 45 year old man",
                "A 40 year old woman with big boobs",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could their be</span></div></span></div>",
            "created":1401339600,
            "id":1804188,
            "title":"more"
        },
        "11531":{
            "author_id":"switcher",
            "author_name":"switcher",
            "choices":[
                "Explore Your Body More",
                "Get Ready For The Next Day"
            ],
            "content":"<div class=\"\"><div> <span>You're Daniel Johnson, or at least you used to be. Now you're George Thompson, your forty-five year old neighbor. For the week, at least. You used to be a twenty year old thinking about college, but you weren't sure what you wanted to be. You were thinking about being a business man, like your neighbor George, but wanted to try out the job first. That's when you found a spell online that said it would allow you to switch bodies with anyone, as long as they were the same gender as you. An idea quickly formed in your head: Why not ask George to switch bodies? When you asked him, he thought it would be a great idea. You got to be the business man and he got to be the college boy. It was strange being in George's body, as he was much older than you, but you soon got used to it. The only thing that was a bummer was that George's wife, Carrie, was out of town with her sister, which meant no fun with her in the bed. You soon decided to..</span></div></div>",
            "created":1527300000,
            "id":2498885,
            "title":"A 45 year old man"
        },
        "11533":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "A Celebrity",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe you wake up as a celebrity?</span></div></span></div>",
            "created":1412226000,
            "id":1865293,
            "title":"Someone else"
        },
        "115331":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Pregnant female celebrity ",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A pregnant female celebrity?</span></div></span></div>",
            "created":1466571600,
            "id":2168664,
            "title":"A Celebrity"
        },
        "1153311":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Yes",
                "Other pregnant celebrity"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim kardashian during her first pregnancy</span></div></span></div>",
            "created":1467867600,
            "id":2176571,
            "title":"Pregnant female celebrity "
        },
        "11533111":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Readers choice",
                "Cravings hit and caught on tv"
            ],
            "content":"<div class=\"\"><div> <span>You were sitting in your most hated class of the day. It was so boring and you wish there was a way you could be like one of the kardashian sisters who are only famous for being famous. Weirdly, at that same moment, a force heard your thought and decided to make it come true. You start to fall unconsxious and end up blacking out.<br>\r\nYou slowly wake up. You hear the sound of like pool water. You open your eyes and see a pool in front of you and you are now laying on a beach chair. Long black strands of hair fall in front of your eyes. You push the strands of hair out of your eyes and notice your now smaller, tan, more feminine hand. \"What the fuck! Where am I?\" You think to yourself. You try and get up but cant due to a weird shift in your weight all to the front of your body. You finally look down and are shocked at what you find. You see two swollen, milk filled, tan, EE cup boobs barely contained in a grey snakeskin looking bikini top. Under those giant melons was a ginormous tan pregnant belly. You look behind you at your now huge backside. You recognize that backside from the magazine cover \"This cant be. No I am not her.\" You think to yourself. You finally get up and feel somewhat balanced due to your huge ass in the back and huge boobs and belly in the front. You waddle over to a nearby mirror and the reflection confirms your terrible assumptions. You were now Kim Kardashian when she was pregnant.[URL=http://s1175.photobucket.com/user/bfine2525/media/Pregnant/4233E5C 6-84EB-4FE5-8C43-DCEDCF7AD9C0_zps6gah31lv.jpg.html][IMG]<a rel=\"nofollow\" href=\"http://i1175.photobucket.com/albums/r625/bfine2525/Pregnant/4233E5C6-84EB-4FE5-8C43-DCEDCF7AD9C0_zps6gah31lv.jpg\" target=\"_blank\">http://i1175.photobucket.com/albums/r625...</a>[/IMG][/URL ]<br>\r\nYou waddle back over to the beach chair and felt a sudden kick. \"Man Kim really did gain a lot of weight since she became pregnant. No wonder they have made fun of the weight gain. This belly is enormous.\" You think to yourself as you rub across the tan belly and Kim's memories slowly rush inside your head. Kim's mother shows up along with her sisters Khloe and Kourtney. They all sit down on the chairs next to you. \"So how are you feeling Kim\" Kris, Kim's mother asks you. \"Well I hate being this fat. I mean I look like an elephant. I also ache due to the swelling.\" You say to them as you feel weird speaking in Kim's voice. \"Well Kim, it will all be worth it in the end. You are just gonna have to deal with the weight gain right now.\" Her mother says to you. \"And I cant stand to even go outside right now because of all the paparazzi making lies, saying that I gained 100+ pounds when I have not gained near that much weight.\" You again say as the rest of Kim's memories fill in your head.<br>\r\n<br>\r\n\"Have you found out what you are having?\" Khloe asks as she puts a hand on your new pregnant belly. It feels weird to you that somebody wants to touch your pregnant belly and feel it. \"We found out we are having a girl and are going to name her North.\" You say to them as you watch her touch and occasionaly rub your now pregnant belly, wanting her to stop. Your now mother joins in as she feels the belly.<br>\r\nYou decided to stand a little bit in the pool. You waddle back into the beach house that you seem to be staying in for the weekend. You remember that Kanye isnt here this weekend because he is out working on a new album. To you, it seems kinda nice to escape your dull life for the life of a real celebrity even if it is a pregnant one. You try to escape Kims family for a few moments since they keep trying to touch your belly. Having to waddle everywhere because of the belly, not having a male extremity, and the constant kicks are just some of the weird feelings you are having to get used to pretty quick to completley act like kim and not your normal self. You waddle back out to the pool area after finishing going to the bathroom as Kim Kardashian for the first time. Kims family is still out there waiting to ask more pregnancy questions. \"So Kim, how has it been in bed with kanye now with the pregnancy?\" Kourtney asks you as you start to remember how to respond due to your new found memories. \"Well it has been pretty rough. Since I have gained all of this weight, I just dont have any energy to anything. The belly also seems to get in the way as well.\" You say as you remember the experiences. \"So how have the cravings been?\" Kris asks you. \"Well, look at me, I am huge! I can not stop eating. I have started eating a lot of junk food and have blown up like a blimp.\" You agitatingly say to them. \"Let's talk about something other than my pregnant body.\" You finally say. They all quieted about your pregnancy and eventually head up to bed in their rooms after getting a few last touches to your belly. <br>\r\n<br>\r\nYou dry yourself off after going in the pool one last time. You waddle up the steps and head into the room that Kim seems to be staying in. You look through the huge wardrobe that Kim kept in the closet. You change into what looks like a night gown. You hear a cell phone ring and waddle around to look where it is. You finally discover it and answer it. <br>\r\n\"Hello. who is this\" you say to the person on the other end. <br>\r\n\"Whoever this is in my body. I want it back.\" The person that sounded like your old voice said.<br>\r\n\"Hey, I was just going by my everyday life as a 15 year old boy and all of the sudden and I am a pregnant celebrity. I had nothing to do with this. I just woke up in this body for some reason.\" You emphatically say to your old body. <br>\r\n\"Well I was enjoying a time with my family to take my mind of having been 33 weeks pregnant. By the way, How is North doing?\" you hear your old voice say. <br>\r\n\"Well she seems to have been doing fine, she is kicking a lot now for some reason. It is starting to get on my nerves. I really would like to find a way to go back to my old life and to return you to your life as a celebrity.\" you say again in Kim's feminine voice. <br>\r\n\"Okay, well have someone in the morning send my private jet to come pick me up so I can see my old body again and find a way to get our lives back to normal. Till I speak to you again, good night.\" you hear Kim tell you. You hang up and climb into the very luxurious bed. You schedule your private jet to pick up Kim in your old body tomorrow. <br>\r\n<br>\r\nYou wake up, thinking that for some reason this is all a very real and terrible nightmare. You open your eyes and see the same room that you fell asleep in. \"Oh no, please I do not want to still be in the pregnant body of Kim Kardashian.\" you think to yourself as you see long black strands of hair fall in front of your eyes. You pull of the covers and what you see confirms your terrible assumptions. You are still in the body of Kim Kardashian and are still pregnant. You get up and put a hand on your pregnant belly. You waddle down to the steps to the kitchen where a tv camera is there, ready to film. They follow you around where you go and you learn that the old Kim is on her way to Los Angeles to meet with you on her/your private jet. You have the private chef fix you up a pretty nice breakfast to calm the baby in your belly.<br>\r\n</span></div></div>",
            "created":1467867600,
            "id":2176573,
            "title":"Yes"
        },
        "1153312":{
            "choices":[
                "sports",
                "entertainment"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How are they famous</span></div></span></div>",
            "created":1477112400,
            "id":2226997,
            "title":"Next"
        },
        "11533122":{
            "choices":[
                "yes, Yes, YEs, YES, YES!",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Porn star?</span></div></span></div>",
            "created":1477112400,
            "id":2226998,
            "title":"entertainment"
        },
        "115331222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>did you actually become a fictional character?</span></div></span></div>",
            "created":1477458000,
            "id":2228719,
            "title":"no"
        },
        "1153312222":{
            "choices":[
                "visual",
                "music"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>visual (movies, tv, and books because you see the words) or audible entertainment (music)</span></div></span></div>",
            "created":1477458000,
            "id":2228758,
            "title":"no"
        },
        "11533122221":{
            "choices":[
                "film",
                "author of books"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>film or author</span></div></span></div>",
            "created":1477458000,
            "id":2228762,
            "title":"visual"
        },
        "115331222211":{
            "choices":[
                "big screen star",
                "small screen star"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>finally movies or tv, i know there's overlap but most actors are only cast in one or the other</span></div></span></div>",
            "created":1477458000,
            "id":2228763,
            "title":"film"
        },
        "115332":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "family member",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe someone from your family?<br>\r\n</span></div></span></div>",
            "created":1419570000,
            "id":1907485,
            "title":"Someone Else"
        },
        "1153321":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "mother",
                "sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who you will become?<br>\r\n <br>\r\nKate, your 14 years old sister<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://cache1.asset-cache.net/gc/483870873-teenage-girl-looking-tough-full-length-gettyimages.jpg?v=1&amp;c=IWSAsset&amp;k=2&amp;d=2kbhjzFjKmsxUh59MAWJnX7mMvU7UG8L0o6Y3Ze3sgA%3D\" target=\"_blank\">http://cache1.asset-cache.net/gc/483870873-teenage-girl-looking-tough-full-lengt...</a><br>\r\n<br>\r\nYour mother Caroline, 35 years old<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://s.tvp.pl/images/d/d/a/uid_ddaabcfa5dca328a8aabddad263a92c21379007338303_width_800_play_0_pos_700_gs_0.jpg\" target=\"_blank\">http://s.tvp.pl/images/d/d/a/uid_ddaabcfa5dca328a8aabddad263a92c21379007338303_w...</a></span></div></span></div>",
            "created":1419570000,
            "id":1907487,
            "title":"family member"
        },
        "11533211":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "run out of the room",
                "stay in the room"
            ],
            "content":"<div class=\"\"><div> <span>Your name is peter, you are an avrege 16 years old guy, until your sister with your mom decided to change your life and teach you a lesson<br>\r\nAt first you though they are joking after telling you that you will take the role of a mother for at least a month. You go to your room laughing at them when everything sent dark.<br>\r\n<br>\r\nSlowly you regain your consciousness and notice your not in your room. \"Something's not right\" you though when you found yourself on the floor in your parents bedroom. Your body felt diffirent, your chest was heavy, your but softer and larger than usualy and you had long hair.<br>\r\n<br>\r\n\"OH no\" you say when you looked down at yourself and saw two large mounds under a dress, you grab them in shock. You notice your legs are hairles nad smooth, your hands feminine and delicate and your manhood is gone.</span></div></div>",
            "created":1419570000,
            "id":1907495,
            "title":"mother"
        },
        "115332112":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "Your husband walk's to the room",
                "you need to use the toilet"
            ],
            "content":"<div class=\"\"><div> <span>Still on the floor you try to get a grip of this situation. They were right, somehow you turned into your mom. suddenly the door opens and in walks your sister with your mom in your body now.<br>\r\n\"What are you doing on the floor mom\" your sister asks with an evil grin on her face. \"Why you did this to me?\" you ask and cover your mouth after hearing your mothers voice. \"Well you deserve it, and until you won't learn a lesson you will stay like this\" your mom says crossing her arms.<br>\r\n\"But how do you imagine me taking your life, doing your job and all other stuff?\" you say and slowly get up. \"Don't worry, with my body you have my skills. That means you will be able do drive a car or doing my job.\" you look at the boy in front of you who now is your son \"thats crazy.\" \"Yes, but sometimes you need to take drastic methods. Good luck mom\" she says and leaves the room. Your sister follows her but before she leaves she smiles at you and says mockingly \"Mom\"<br>\r\n<br>\r\n\"I don't think i can live like that\" you say and look at yourself. You are dressed in a short dress on thin stripes, red with white pattern. Under your <br>\r\ndress you can feel a bra, a totally new sensation you need to get used to. You were curious about your new body under the clothes but you didnt have the courage to look, although soon you would see it in all its glory.<br>\r\n</span></div></div>",
            "created":1419570000,
            "id":1907568,
            "title":"stay in the room"
        },
        "1153321121":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "drive your car",
                "take a bus"
            ],
            "content":"<div class=\"\"><div> <span>Before you could leave, your father who is now your husban walks into the room. \"Hey babe\" he says and embrace your waist. You back off a little when he try to kiss you.<br>\r\n \"What's the matter\" he ask surprised at your reaction. As much as you don't like the idea you know that you need to act like your mom. that means you will also act like a wife of this man. \"Oh it's nothing\" you say in an innocent voice and kiss him in the lips. It felt like an eternity although the kiss last only a few seconds. \"How about we have some more fun\" he says strocking your butt. \"Im not in the mood today\" you say and release yourself from his arms. \"So i guess thats a no\" your husband sigh as you leave the room.<br>\r\n\"That's too much for one day\" you say heading towards the kitchen. Your breasts were bouncing with each step making you irritated \"First i swapped bodies with my mom and now my father wanted to have sex with me\" you say hoping it was all a bad dream.<br>\r\n<br>\r\nUnfortunatly the next day confirmed it wasn't a dream. You stood before a mirror ready for work and looking at yourself mournfully dressed in your mom's working outfit. You were wearing tights, a black pencil skirt, white shirt with buttons on the front, a black vest matching your skirt and a blue, short tie.<br>\r\nYour mother was right about gaining her skills. Your makeup was done perfectly, also putting a bra wasn't a challenge either.<br>\r\n\"Ready for work mom?\" your mother says and pat your back. \"I'm not sure i can do it\" you say shaking from the stress. \"Of course you can. Now go before you get late\" she says guiding you to to the front door. You take your mom's purse and slip your feet into her black high heeled pumps. You take a deep breath and leave the house to start your first day at work.<br>\r\n</span></div></div>",
            "created":1419570000,
            "id":1907616,
            "title":"Your husband walk's to the room"
        },
        "11533211211":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "Next day",
                "Week later"
            ],
            "content":"<div class=\"\"><div> <span>You slowly aproach the car surprised that you can easily walk in high heels.<br>\r\nYou get in and fasten your seatbelt, it squish your breasts so you try to make it more comfortable but after a few attempts you give up and start the engine. Full of nerves you slowly start to drive to the bank your mom is working at.<br>\r\n<br>\r\nYour day at work went better than you expected. Thanks to the inherit abbilities you were able to do her job quite vell. Although you were scared that something will go wrong and you'd end up getting your mom fired.<br>\r\nFinally after eight hours your shift ended and you are free to go. you walk into the house and sigh with relief when you take off your high heels. You went to the living room and sit on the couch tired from the events of the day.<br>\r\n\"How was work mom?\" Your mom in your body asks and sit's next to you. \"Very funny. Can we end this farce right now?\" you say getting more irritated. \"No. I said at least a month so you still have plenty of time to get used to it\" she says and leaves.<br>\r\n\"Thats just ridiculous\" you say shaking your head. You look down at yourself and move your hand across your legs feeling the material of your tights. \"I need to change\" You say realizing you can't stay all day in her work uniform.<br>\r\n<br>\r\nAfter changing your clothes you head towards the kitchen. You were dressed now in blue jeans and a light green sweater with a v cut on the front. When you arrive at the kitchen you start to preapere dinner.<br>\r\n<br>\r\nThat was the most awkward dinner in your life, well at least for you. Peter and Kate seemed to enjoy this situation, and your father was acting as nothing happened. <br>\r\n\"Poor guy\" you though to yourself looking at him. He wasn't awere that the woman sitting next to him wasn't really his wife.<br>\r\n<br>\r\nAfter everyone finished their meal you stand up and decide to use your newly gained power. \"Kate, Peter could you wash the dishes please\" You say with a motherly tone. At first they try to protest but your husband didn't give them a choice.<br>\r\nYou head to the living room smiling \"Well, i guess being a mother have some pros\"<br>\r\n<br>\r\n  </span></div></div>",
            "created":1420088400,
            "id":1910369,
            "title":"drive your car"
        },
        "115332112112":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "Try to convince your mom to end it",
                "Don't bother her"
            ],
            "content":"<div class=\"\"><div> <span>The week pass quickly as you focus on your work at the bank and inpersonating your mom at home.<br>\r\nIt's been seven days since you become your own mom and you slowly adjust to some aspects of being her, like dressing in her clothes, having breasts and sitting down to pee.<br>\r\n<br>\r\nToday you had a free day from work so Kate wanted to spend some time together.<br>\r\n\"I can't believe i'm doing this\" you say waiting for her. You take a look at yourself and realize you were really good at pretending to be your mom. You're dressed in a short lose skirt. It was yellow with a thin, brown belt holding it at your waist. Your top was a white t-shirt and a denim jacket. Your outfit was compleated by a pair of black, high heeled sandals. Also your hair and makeup was done correctly.<br>\r\nAt one moment you catch yourself admiring how you look, not as a male but as a woman proud of herself.<br>\r\n<br>\r\nthe day went surprisingly well. You didn't think you could actually enjoy it but you had fun for the first time since you swapped bodies.<br>\r\nFirst you went shopping, then you bought some ice cream and went for a long walk. After that you rent a movie and watch it together at home.<br>\r\n<br>\r\nAnother week had passed. You came home from work and everything seemed normal. This worries you. How could everything feel normal? Two weeks ago you were forced to become an adult woman and slowly it feels like you were always like that. Even as you look at your reflection this evening, standing in nothing but your underwear which was very girly, lacy and pink you didn't feel wierd or embarrassed like in the first couple of days.<br>\r\nThose thoughts follows you to the bed where you lay next to your husband. As you turn off the lights he cuddles up to you and put his hand on your waist. At least he didn't want anything more like yesterday. Avoiding sex was becoming  more complicated every day.</span></div></div>",
            "created":1420088400,
            "id":1910378,
            "title":"Week later"
        },
        "1153321121122":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You consider to talk with your mother about shortening your time in her body, but you came to the conclusion that it won't help. She is too stubborn to change her mind and if you anger her she could make your life worse.<br>\r\nAnother few days passed. Just when you though it couldn't get any worse your period started. Luckily you were warned, so you could prepare for it.<br>\r\nYou sit on the couch watching peter playing your favorite video game. You take a sip of your tea still looking at the tv screen. You don't know if it's becouse your period made you grumpy but the game looks stupid to you now. Like your only goal in it is to mindlessly shoot. \"I can't watch it anymore\" you though an get up. You winced as you felt blood comming out, after changing your pad you head to the kitchen and take a pill to ease your cramps. You lean on the cupboard strocking your abdonmen. You're worried about the changes in your mind. The things you liked were becoming less amusing and you're afraid that until the end of the month you would become a compleatly diffirent person.</span></div></div>",
            "created":1420347600,
            "id":1912627,
            "title":"Don't bother her"
        },
        "11533211211221":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "You feel guilty",
                "You feel normal"
            ],
            "content":"<div class=\"\"><div> <span>Finally the last day came. you wake up and sit on the edge of your bed. A light smile appeared on your face as you realize today you will get back your body. You get up and straighten your nightgown. before you go to confront Peter you decide to dress up. You take off your your nightgown and take a look at your naked body the last time. After being your mom for a month you've got used to it, maybe even to much. Ignoring your thoughs you start to dress up. you put on your black panties and a bra, brown tights and a grey cotton dress with long sleeves.<br>\r\n<br>\r\nPeter was avoiding you, saying to wait until evening. You spend a month in this body so a few hours wont make a change. it was a long and boring day but you managed to last until evening. You head to Peters room and stand in the door. Shall we talk?\" you say crossing your arms.<br>\r\n\"Yes, sit down mom, we need to discuss something\". You rise your eyebrow courious what he wants. You sit on the bed and cross your legs in a womanly fashion.<br>\r\n \"You see\" he starts \"the problem is i want some more time, so i decided to make our swap longer\".<br>\r\n\"What!?\" You shout. \"Yes i decided we would stay like this for two months from now\"<br>\r\n<br>\r\nYou can't believe it. You try to argue but your mom has enough arguments to make you accept the offer. Not like you had choice, only she could swap you back and telling anyone you're not Caroiline but her son trapped in her body would make people thing you're crazy.<br>\r\nYou left the room furious. You walk into your bedroom and sit on the bed. hopeless and defeated you start to cry.<br>\r\n<br>\r\nIt's been two weeks since your mom extendet your swap. Your anger and sorrow fade away as you focus on living her life. unfortunatly this also makes you more acustomed to being her. You slowly begin to feel like you were always Caroline.<br>\r\n<br>\r\nConsumed by those thoughts you didn't notice your husband sneaking up to you when you were cleaning the table. As you turn you fall directly into his arms. You feel your breasts pushing against his chest as he pulls you closer. You've been in this body long enough to get adjusted to it, so you close your eyes and kiss him. Suddenly he puts his hand under your shirt and reach for one of your breasts. A shiver went down your spine as he starts careasing it. \"Come on dear, it's been so long since the last time\". Your heart froze for a moment. You don't want to do it but you can't avoid it forever. You'll spend some time as his wife and denying him could hurt your parents marriage.<br>\r\nSuddenly you've become wet in your panties. Your hormones started to work and you felt extreamly aroused. You look at your husband and smile seductively \"Let's go\" you say pointing your head at the bedroom.<br>\r\n<br>\r\nYou run upstairs holding hands with your husband. You cant believe it, in a moment you would be having sex for the first time, what was more unbelievable, as a woman. You enter your bedroom and shut the door. Before you even realize what are you doing you lay naked in bed waiting for your husband. In your mind you start to panic, you want to change your mind nervously looking for an excuse but it's too late. Your husband climbs on top of you and kiss you deaply. You feel his manhood touching the lips of your vagina. You close your eyes waiting for what comes next. You clench your hands on the sheet as he puts his penis inside you. At first the alien feeling of having a man inside made you uncomfortable, but with each move you desired more. Your fear disappears replaced by a great plesure, you lost yourself in it and forgot for a moment that you were ever someone else than Caroline, the only thing that mattered now were you two. You moan by the increasing plesure as your husband continues until you felt something like an explosion inside.<br>\r\n<br>\r\nYou lay next to your husband panting and sweating. You can't believe that you just expirienced a female orgazm and how phenomenal it was.<br>\r\nSatisfied by the outcome you kiss your husband and fall asleep. Next day...</span></div></div>",
            "created":1421557200,
            "id":1919486,
            "title":"Continue"
        },
        "115332112112212":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Next morning you wake up with a pleasant smile on your face. You strech your naked body and sit on the edge of the bed. You brush away your messy hair and stand up from the bed. You look at your husband still sleeping and ponder about the events of the night. You just had sex with your father as your mom and you think nothing of it, like it was the right thing to do.<br>\r\n<br>\r\nAfter dressing up you're ready to leave for work. Before you could open the door your husband hugs you from behind. \"leaving already?\" he asks. You turn and kiss him in the lips, you're becoming aroused feeling his hands squeeze you butt. \"The night was incredible darling, i wish we could do it more often\". You look him in the eyes and without hesitation you say \" anything you want sweethearth\".<br>\r\n<br>\r\nDay's and week's pass quickly. Living as your mom had become so natural that you slowly forget how it was to be a teenage boy. You realized that one day while watching tv. when you looked down at your body everything seemed to be fine. You know it shouldn't be, but somehow it feels like it was always your body and your life. The long hair brushing your neck, two big breasts under your soft blouse, the tight pants emphasizing your hips and butt, the flat space betwen your legs, lace panties and bras, all that didn't bother you anymore, rather it was perfectly normal.<br>\r\n<br>\r\nYour physical adaptation wasn't the only wierd thing. You were slowly becoming her mentally. You took interest in fashion and romances just like your mom. Videogames and sport didn't seem to entertain you anymore. The worst thing was that you compleatly lost interest in girls and become atracted to guys, especialy the only one in your life, your former father, now as Caroline your husband. You have become sexualy active since your first time and there are times when you just want to melt in his arms. As much as you try to deny it you really like being his wife.</span></div></div>",
            "created":1427691600,
            "id":1956242,
            "title":"You feel normal"
        },
        "1153321121122121":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "Live normally as Caroline",
                "You need to find a way back"
            ],
            "content":"<div class=\"\"><div> <span>The last day came very quickly. You were so absorbed living your mother's life that you didn't realize it's time to swap back. When you got home from work your mom in your body was waiting with bad news. Unfortunately she want's another two months of your life. You were so tired after work that you didn't even bother arguing, you just sigh and say \"maybe you should already say that you don't want to change back?\" <br>\r\nYour mom want's to respond but you interrupt her. \"I'm to tired for this, so do not make me angry and go to your room before i'll lose patience\" you say firmly and walk to your room to change from your working outfit to something casual.<br>\r\n<br>\r\nFor the next few day's you were angry and upset at Peter for stealing more of your life, but today you've stop thinking of it since your husband is taking you on a date.<br>\r\nYou check yourself last time before leaving to make sure everything is perfect. Your dress was red, without sleeves. Tight fitting and short shoving your legs and your hourglass figure. It also shoved quite a bit of cleavage.<br>\r\nFirst your husband takes you for a dancing. You're surprised that you could dance and really enjoyed it. Later the two of you went to a restaurant for dinner. It was so nice that you wish it could last forever. You enjoyed it so much that you completely forgot about your worries.<br>\r\nThe date ended and you both go home. After entering your bedroom you start kissing with your husband. As he lays down on bed you take off your clothes revealing verty sexy underwear you bought for this ocasion. Thankful about the evening you repay your husband making deep and passionate love with him. After finishing you cuddle to him with joy and satisfaction.<br>\r\n<br>\r\nAbout a month later your mom breaks some news that didn't make you very happy. You were doing laundry when she came over to you.<br>\r\n\"Mom we need to talk\". You rise your eybrow questioning yourself what is it about. The two of you went to the kitchen and sit at the table.<br>\r\n\"You see, there's a project for students at our school which let's you study overboard and i'm participating in it\".<br>\r\n\"You're joking right? Theres no way i'm letting you steal my life even more\" you say protesting.<br>\r\n\"Actualy you don't have a choice. What would you do? Tell your husband you're not his wife. I'm sure it would break your levely relationship\" she says with an evil grin. \"And what about your daughter? How would she react knpwing it wasn't her mothe but brother she was confessing to. Not to mention what were you doing with your husband in bed. You know the walls are thin.<br>\r\n\"Wait, when did you told Kate we switched back?\" You ask surprised. \"After our first month. I though it will be easier that way\".<br>\r\nYou want to start yeling at her but you restrain from doing it. You know you really don't have a choice. If she or you would tell the truth it would certainly ruin your family. You cared to much for your husband and daughter to let it happen. You went to far living as her so you accept the fact that you will stay in her body for a much longer time.<br>\r\n\"How long?\" you ask defeated. \"9 months\" she say's. You just nod and get up to continue your work.<br>\r\n<br>\r\nAfter a month your mom has left leaving you trapped in her body for a long time. You pretended to be worried about her leave, but inside you were furious. You questioned yourself if you could live normally again. You've spend five months living as a woman, mother and wife and you doubt everything will be just like before.<br>\r\nYou put those thoughts aside and continue living your mother's life. Eventualy you got into routine of working at the bank and taking care of the house. Spending so much time in her body made you accustomed to it so much that you can't imagine living as someone else. Sometimes you start to thing you're really her and your memories of being Peter feelt like some wierd dream.</span></div></div>",
            "created":1428814800,
            "id":1963032,
            "title":"continue"
        },
        "11533211211221211":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "Go to the airport",
                "Stay at home"
            ],
            "content":"<div class=\"\"><div> <span>Seeing no other way of getting your life back you decide to live your mothers live untill she returns.<br>\r\nTwo months after your mom left in your body you wake up feeling very sick. your body was sore and you vomited two times befor dressing up. Despite that you go to work hoping it would pass. After your shift is done your nausea subsided but you still didn't feel very good.<br>\r\nYour sicknes continued the next few days so your husband told you that you might be pregnant. You reject these thoughts since you used protection all the time, but your husband convinces you and you take the test. As you look at the result your blood freezes. Your heart starts to pound faster when you see two straight lines shoving that you're pregnant. Your world crushed in a second. How could you get yourself pregnant? How your mom will react? There was literally chaos in your head right now.<br>\r\n<br>\r\nAfter breaking the news to your family both your husband and daughter are overjoyed. you tell them to keep it a secret from Peter until he comes back and they agreed to it, thinking it would be a nice surprise. Thanks to that you can prepare for announcing it to your mom.<br>\r\nAs the weeks are passing by you slowly accustom to the fact that you're expecting a baby. Sometimes you're even curious about how it would be when the baby grows up. Walking around with a big belly and feeling the baby kicking.<br>\r\nSoon your body started to change. First your breats became bigger and more sensitive. Next you noticed a small bump on your belly witch grows every week. At the fifth month you finally feel really pregnant since your baby started to move and your belly is big enough that you can't hide it under your clothes.<br>\r\n<br>\r\nThe day of your mother's return finally has come. You dressed up and went downstairs where your husband was waiting to pick her up from the airport. \"Ready to go?\" He asks you.</span></div></div>",
            "created":1429678800,
            "id":1967842,
            "title":"Live normally as Caroline"
        },
        "115332112112212112":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "Accepting life as your mother",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You said that you're tired and you will wait at home for them, but in reality you wanted to gain a few more hours before meeting with Peter. After he leaves you walk around the hous nervously thinking how to explain your situation. You're seven months pregnant now and your belly is big and heavy so you've quickly got tired and sit on the couch. The waiting feel's like eternity but soon you hear the door opening. You take a deep breath and struggle to get up. Slowly you waddle to the corridor to give your son a surprise.<br>\r\n<br>\r\n\"I'm home mom\" Peter yells from the door. He stops with his jaw open when he saw you. \"Welcome back sweetie\" you say embracing your belly.<br>\r\n\"Mom?... But how?\" he says stammering. \"I though you were old enough to know where babies come from\" Your husband says patting him on the back and laughing. You blush a little bit remembering the nights with your husband and quickly change the topic. \"I'm going to prepeare some meal while you can unpack and rest a bit\" you say. \"We already decided to go out for dinner, so we better get ready\" your husband say's.<br>\r\n<br>\r\nAs you change your sweatpants and shirt for a drees you're ready to leave with your family. Your reunion went quite well. You had a delicious meal and you talked about his treep all the time so you didn't have the ocasion to mentioning your bodyswapping deal. After returning home Peter went to his room so you used this ocasion to talk. You quietly enter his room, sit on the edge of the bed and and slowly start.<br>\r\n<br>\r\n\"So, about our body swap, don't you think it's time? It's been already a year and im still in your body\". Peter looks at you surprised. \"What makes you think i want to swap now. Do you think i would really like to give birth to a baby? It's yours, you should take care of it\"<br>\r\n\"But you have put me in this situation. You knew i couldn't refuse my husband for so long\" you say trying to defend yourself. Suddenly Peter makes a sad face. \"But we can't Peter. I'm sorry\"<br>\r\n\"What do you mean?\" you ask surprised hearing someone calling you your name. \"I've messed up the bodyswap spell. i though it would be temporary but after our first month it turned out to be permament\". He says almost crying. \"That's why i told Jessica we swapped back, so everything would seem to be normal. That's why i wanted more time, i though maybe you could get used to this just like me. I'm sorry Peter\"<br>\r\n<br>\r\nYou can't believe what you just heard. You get up and leave his room. You went to the bathroom and brust into tears.<br>\r\nAfter some time you calmed down a bit. You take a grip on yourself and fix your smudged makeup. \"That's it, from now i'm really Mrs. Caroline Billings. An adult woman, mother and wife\". You say looking at your reflection.</span></div></div>",
            "created":1429851600,
            "id":1968740,
            "title":"Stay at home"
        },
        "1153321121122121121":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "content":"<div class=\"\"><div> <span>When the morning came you were woken up by your husband getting ready for work. You struggle to get up supporting your heavy belly and walk to the bathroom. After peeing you take a shower and dress up in a sleveles maternity sundress that went down to your ankles. Then you finish your makeup and went for breakfast. Peter was already in the kitchen earing his cereals.<br>\r\nIt's been two months since it turned out your body swap was permament. You didn't really mourn about loosing your life, maybe because you've spend so much time in this body it didn't seem to bother you. In fact you even enjoy it. You have a lovely husband, wonderfull kids, your pregnancy is going well and your labor can start any day now. You're happy with your current life and accepted it as your own.<br>\r\n<br>\r\nYou aproach Peter at the kitchen table. Since you've lerned the truth he was very distant. As his mother you know he blames himself for putting you in this situation.<br>\r\n\"We need to talk\" you say putting your hands on his shoulders. \"I want you to know i'm not mad. It was hard at first but i'm happy how it ended up. I don't want you blaming yourself, you're my dearest son and as you mother i will always love you\" you say and give him tight hug as much as your enormous belly let's you. \"I love you to. You're the best mom i could have\" he say's and leaves for school.<br>\r\n<br>\r\nLater at the evening you lay in bed happy that you finally could make it up with your son. After your husband joins you in the bed you went to sleep.<br>\r\nIn the middle of the night you were woken up by a sharp pain. you sit on the bed breathing heavily when another contraction starts. \"Honey wake up, i think it's time.<br>\r\n<br>\r\nYour husband rushed out from the bed while your son helped you walk downstairs. You left your house only in your shoes, nightgown and a jacked since you didn't have time to dress up. The way to the hospital was short but it felt like hours as you suffer from the pain.<br>\r\nFinally you arrived at the hospital where you changed your clothes to a hospital gown. After some time in the maternity ward you were finally ready to give birth.<br>\r\nYou push as hard as you can trying to puch the baby out. Now you know how hard and painfull childbirth can be. Luckly your husband supports you all the time. After eight hours in labor you finally give birth to a baby boy, you've named John. You lay in the bed looking at your sweet soon. \"He's so wonderfull\" you say overjoyed.<br>\r\n<br>\r\nAfter few days you go back home where everyone greated the new member of the family. Your life as Caroline goes fine and you love it. You can't imagine living as someone else. Watching as your son grows makes you proud. You feel like the happiest woman in the world.<br>\r\nWeeks and month's are passing by. it's been two years since John's birth and you're thinking of having another baby. You're 38 years old now and you want to make one more while you can. After a conversation with your husband he agrees and you went to work quite swiftly.<br>\r\nTwo week later you confirmed that you are pregnant. You're very happy about it and can't wait to see your child. You were even more surprised when you found out you're having twins. This could be more interesting, raising two at one time.<br>\r\n<br>\r\nYour pregnancy is going very well despite your age. It's more difficult carrying two babies inside you but you deal with everything. Your belly is also much bigger and heavier than last time and it's hard to walk, but your struggle is rewarded in your 36th week when your labor starts.<br>\r\nThis time you give birth to two girls Amanda and Amelia. As you look at them you don't regret anything in your life. Even if you could go three years back in time you would still swap with your mother and live her life until the end.</span></div></div>",
            "created":1429851600,
            "id":1968759,
            "title":"Accepting life as your mother"
        },
        "1153322":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "Sure",
                "An other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your neighbor's 9 year old daughter that you have babysat many time. She sees you like a big brother seeing how she is an only child and her mother is always busy working.</span></div></span></div>",
            "created":1460869200,
            "id":2134508,
            "title":"Your 9 year old neighbor girl"
        },
        "11533222":{
            "choices":[
                "yes",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your pregnant neighbor</span></div></span></div>",
            "created":1477112400,
            "id":2226995,
            "title":"An other"
        },
        "115332221":{
            "author_id":"thomas9000",
            "author_name":"Tomi900",
            "choices":[
                "Remained as Sarah",
                "Or become one of the siblings or mother"
            ],
            "content":"<div class=\"\"><div> <span>You've swapped into your pregnant neighbor (Sarah) who looked like she is already in her early 20's but that in fact she is only thirteen. She was living with her mother and her other siblings. They had moved in about 2 months ago and that you meet the mother before.<br>\r\n<br>\r\nThe mother (Nancy 32) had divorced and she had told you that she had moved to this place to get a fresh start, after she broke up with her boyfriend (Jack) after he was caught sleeping with Sarah and he had been convicted of rape of a minor.<br>\r\n<br>\r\nWhen you swapped it was while you were sleeping and it was the day before you were to start school the next day. Your body had seemed to move on your own after you heard your new mom tell you it's time to get ready for school.<br>\r\n<br>\r\nYou had finished getting dressed and then went down to breakfast. You see that now at the table is your new siblings (Jessica 15, Timothy 10, Devon  and  Dennis 8, Melissa 5, Pamela 3, Tiffany 12 mo.).<br>\r\n<br>\r\nNancy tells you that you need to help get your siblings ready for school so she can finish getting ready for work. Jessica tells you that she will get Melissa &amp; Pamela ready while you get Tiffany changed and dressed. You've gotten everyone ready and your mother tells everyone to get in the car that she can take everyone to school and daycare. <br>\r\n<br>\r\nShe has dropped off Timmy,the twins, and Melissa to the elementary school and then Pamela and Tiffany to daycare. She then pulls into the high school and then parks. She had gotten a job in the office as a assistant principal. It was when you get ready to walk over to the middle school your mom ask what your doing. You tell her going to school she tells you that it was decided that at the end of school last year you would be skipping a couple of grades and are going to be in the same as Jessica. She also tells you that I have already let the office know that you have a 2p.m. doctors appointment.<br>\r\n<br>\r\nThings had went by and you had been tired so you decided to take a nap.<br>\r\n<br>\r\nWhile sleeping did you swap with a new sibling or stay in the current body.</span></div></div>",
            "created":1565089560,
            "id":2697972,
            "title":"yes"
        },
        "115332222":{
            "choices":[
                "What?!",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>yourself but as a woman</span></div></span></div>",
            "created":1477544400,
            "id":2229169,
            "title":"next"
        },
        "1153322221":{
            "choices":[
                "your first day as a woman"
            ],
            "content":"<div class=\"\"><div> <span>The sirens blew, everyone fear the worst, then a strange gas covered the world. People coughed fearing the worst. Everyone blacked out. The world awoke seconds later to no gas, but they still had fear. what had happened? who did it? what will happen? The answer, a military experiment when haywire and exploded, the world began feeling strange like they were all going through intense puberty but all at once and within an hour everyone in the whole world had become the opposite gender. The government made a statement to the world and since the lab was destroyed with all the notes and scientists the world was told that this is most likely permanent.</span></div></div>",
            "created":1477544400,
            "id":2229171,
            "title":"What?!"
        },
        "11533222211":{
            "choices":[
                "your second day as a woman",
                "your second week as a woman"
            ],
            "content":"<div class=\"\"><div> <span>Many places in the world descended into chaos. In places with intense and oppressive patriarchal societies the \"men\" now started trying to take their place as the patriarchs, but that was met with violence as the women stated that since the men were now women the rightful thing to do was to become matriarchal, and they the matriarchs. However, nothing really changed, people in power were still in power. Feminists became menimists, and hardcore traditionalists called them bigots and misogynists. You however, like every other \"millennial\" and \"gen xer\" was primed for your world domination. As the world fought over stupid things your whole generation came in and took up the jobs that were now left empty as the more traditional minded people tried transitioning their lives from the now female husbands to the now male wives. <br>\r\n<br>\r\nYour name was Jason, but now your Jessica. </span></div></div>",
            "created":1480654800,
            "id":2244701,
            "title":"your first day as a woman"
        },
        "115332222112":{
            "choices":[
                "You called your \"boyfriend\" for emotional support",
                "you called your \"father\" for help figuring out today"
            ],
            "content":"<div class=\"\"><div> <span>You woke up, it was Saturday and you needed to go to the store and get groceries. However, there was this extreme cramp in your lower stomach region, almost at your crotch, you roll out of bed frustrated, for some reason, your mind's emotional state was going berserk. You sit down on the toilet, thinking maybe I just need to let out a number 2, and you pee. You wipe your crotch to see blood, your heart skips, you stand up and see blood, \"Shit!\" You walk into your room and see a huge circle of blood on your favorite sheets, you take them off to see the stain on the mattress pad, you take that off to see a stain on your mattress, you kick your bed only to slam your shin on the baseboard, you yell, \"Fuck\" as you hold back tears. You apply the pad the government gave you so you could go out to the store and buy \"feminine care\" products. You drop your spoon, and for some fucking reason begin crying, damn emotions getting all out of wack. You realized this is all probably because it's your first time but then you realized that you will have to go through this hell, once every four weeks, and you will be in complete shock to realize PMS is not something you deal with during your period but at the halfway point, so once every two weeks your emotional state will be absolutely off the scale. You get to the store and go to buy your pads, the man at the counter gives you a looks and says, \"Glad I don't have to deal with that again.\" You look at him and say nothing. You pay, \"What the fuck, how the hell is a box of fabrics I will literally bleed on so damn expensive.\" The man behind the counter and says, \"Because the man, well now the woman marked these as 'luxury items' and so you have to pay 'luxury tax' on these 'luxury items' along with normal sales tax making pads and tampons some of the most proportionally expensive items you will ever buy, and worst off, you are forced by your body to buy these items.\" You put your head on the counter and start to cry again. He pats you on the back and says, \"Worst off most politicians are too old to have gone through menstruation and therefore, the sexist thinking will most likely still never die, even when your daughters are buying tampons.\" You just yell, \"Mother fucking patriarchs.\" </span></div></div>",
            "created":1481000400,
            "id":2246441,
            "title":"your second week as a woman"
        },
        "1153322222":{
            "choices":[
                "fictional woman",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You not only switched bodies, but realities</span></div></span></div>",
            "created":1489208400,
            "id":2288042,
            "title":"next"
        },
        "11533222222":{
            "choices":[
                "Your hot professer",
                "Your crush"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Two more options</span></div></span></div>",
            "created":1505710800,
            "id":2387773,
            "title":"next"
        },
        "12":{
            "author_id":"scotland1983",
            "author_name":"Scotland1983",
            "choices":[
                "5 year old boy",
                "10 year old boy",
                "16 year old boy",
                "21 year old man",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you become</span></div></span></div>",
            "created":1241931600,
            "id":689079,
            "title":"Female"
        },
        "121":{
            "choices":[
                "he was your brother",
                "he was freaking out due to a curse that caused pain until he became someone else",
                "his parents had a gun that made you into a male version of yourself at 4"
            ],
            "content":"<div class=\"\"><div> <span>You were in a store and a brat next to you was freaking out. All of a sudden you turned and yelled, \"shut up!\". At which they yelled, \"No and mind you own business.\" and continued to have a fit. You had a bad day and yelled back, to the kid's parent's appellation, \"No one cares about what you want, you think you have problems, you should deal with the shit I've dealt with today and you problem will seem just as stupid as it is. So please shut the fuck up.\" Then the kid punched you, actually knocking you out.\" Unfortunately for you...</span></div></div>",
            "created":1480136400,
            "id":2242265,
            "title":"5 year old boy"
        },
        "122":{
            "choices":[
                "gang (gang made up of 10 year olds)",
                "siblings",
                "mad scientists"
            ],
            "content":"<div class=\"\"><div> <span>Last night was crazy, you were at a high school party when everyone in the room fainted. You all woke up to find yourselves in a room and your old bodies were standing over you. I seems you all were kidnapped and switched bodies with a/your/some (depending on choice)10 year old</span></div></div>",
            "created":1480136400,
            "id":2242263,
            "title":"10 year old boy"
        },
        "123":{
            "choices":[
                "your sexy boyfriend",
                "your brother who snuck up and poked you to make you squeel in shock",
                "The 500 pound, pimple covered slob who busted out the door and ran through you"
            ],
            "content":"<div class=\"\"><div> <span>You were walking down the hallway of your high school, happy as a girl could be. You had that morning got the best news you had heard in you entire life, by the end of this day you would no longer be a girl, but finally a boy. The name of the body you always hated was Kristina Marie Laurence. Your parents never knew you were trans, and given the fact that they would probably throw you out was probably the reason. You had one very important decision. The lady said she gave you a one time ability to switch with the next male you touched. They would never remember any life but the one you lived, and would love their body. You became...</span></div></div>",
            "created":1480136400,
            "id":2242262,
            "title":"16 year old boy"
        },
        "124":{
            "author_id":"aerrow",
            "author_name":"jake",
            "choices":[
                "search a clue about the swap",
                "Enjoy your muscular body",
                "Mike POV"
            ],
            "content":"<div class=\"\"><div> <span>You are Jenny Collins, 16 years old, a cheerleader, you have a cute face and a blow blond long hair, you back to home after a hard day, the people thing what be a cheerleader is a easy but they not know about the your special diet and the hard workout for do the choreography, the hours what you need every day in your hair, face and your outfit.<br>\r\nyou wear your cheerleader uniform, sneakers and your bag. <br>\r\n<br>\r\nbut you are happy, the life is good and the guys figth for your attention, maybe your B cup bra is a great help but in the college maybe you have a C cup as your mom.  <br>\r\n<br>\r\nYou think in your plans for this nigth, maybe after the homework you can chat with your bestfriend Melanie about the cool guys, finally you are in home, but you only have time for enter in the house and close the door in the moment what all start, you not aware but any very weird is happen. <br>\r\n<br>\r\nyou start to feel a nausea, your legs only can walk to the sofa and one moment after all is black.<br>\r\n<br>\r\n***            ***               ***<br>\r\n<br>\r\nHours later you wake up, you ear music, all is so strange, you remember the nausea, sure your parents find you and now are in your room, but why this not is the ceiling of your room?<br>\r\n<br>\r\nyou look around you, sure this not is your room, is a gym room, have mirrors, dumbbells, pulleys and other elements, is a very complete gym but you can see this is a home, not a public gym.<br>\r\nyou are in the floor but this floor is covered with a special carpet to absorb shocks.<br>\r\nyou not understand what happen until you get up and everything around you changes, you look in the mirror a man, is young maybe 20´s? and is so tall, easy 7 feet tall.<br>\r\nbut the most impresive is the muscular tone, a bodybuilder? maybe but sure is strong.<br>\r\nthe guy wear a nike outfit, sneakers, lycra short pants and lycra tank top, sweatband in the head and a sport watch.<br>\r\nblue eyes, blond hair and bronce skin, the guy is very huge.<br>\r\nyou move your hand and the guy move the hand too, you aware, you are the guy!<br>\r\n<br>\r\n***             ***                 ***<br>\r\n<br>\r\nMike Evans was a bodybuilder, 21 years old but very unhappy, he look the guys and girls in the street, wishing swap places with any, yes he have a big house with gym, a perfect body for be Mr Olympia but he hates the life, the long workout, the strict diet.<br>\r\n<br>\r\nbut he not know... what have a force, an entity ear the wishes, he was in the middle of your workout when occurred, he feels nausea and in a moment everything went black.<br>\r\n<br>\r\nMike wake up some hours later, he is in a sofa and the silence of the home is so estrange, a dismay? how? <br>\r\nMike look the own body and the surprise is inimaginable, the b cup and the cheerleader uniform, the sunrise in the cute face of the girl is very big.<br>\r\n<br>\r\n***               ***                  ***<br>\r\n<br>\r\nyou try find a clue about the swap but your big body is so heavy and you not can walk for a time. You need a time for walk in your new muscular legs, but you are decided, you want back to your body.</span></div></div>",
            "created":1450155600,
            "id":2075171,
            "title":"21 year old muscular man"
        },
        "125":{
            "choices":[
                "yourself but male",
                "a male celebrity",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>two options and one option to avoid the other two options</span></div></span></div>",
            "created":1477544400,
            "id":2229172,
            "title":"other"
        },
        "1251":{
            "choices":[
                "your first day as a man"
            ],
            "content":"<div class=\"\"><div> <span>The sirens blew, everyone fear the worst, then a strange gas covered the world. People coughed fearing the worst. Everyone blacked out. The world awoke seconds later to no gas, but they still had fear. what had happened? who did it? what will happen? The answer, a military experiment when haywire and exploded, the world began feeling strange like they were all going through intense puberty but all at once and within an hour everyone in the whole world had become the opposite gender. The government made a statement to the world and since the lab was destroyed with all the notes and scientists the world was told that this is most likely permanent.</span></div></div>",
            "created":1477544400,
            "id":2229173,
            "title":"yourself but male"
        },
        "12511":{
            "choices":[
                "second day as a man",
                "second week as a man"
            ],
            "content":"<div class=\"\"><div> <span>Many places in the world descended into chaos. In places with intense and oppressive patriarchal societies the \"men\" now started trying to take their place as the patriarchs, but that was met with violence as the women stated that since the men were now women the rightful thing to do was to become matriarchal, and they the matriarchs. However, nothing really changed, people in power were still in power. Feminists became menimists, and hardcore traditionalists called them bigots and misogynists. You however, like every other \"millennial\" and \"gen xer\" was primed for your world domination. As the world fought over stupid things your whole generation came in and took up the jobs that were now left empty as the more traditional minded people tried transitioning their lives from the now female husbands to the now male wives. <br>\r\n<br>\r\nYour name was Margaret, but now your Mark. </span></div></div>",
            "created":1480654800,
            "id":2244700,
            "title":"your first day as a man"
        },
        "125112":{
            "choices":[
                "Your \"girlfriend\" sees you at the store",
                "Your \"bros\" see you at the store"
            ],
            "content":"<div class=\"\"><div> <span>It was Saturday, you thought about what needed to be done today, because something was being forgotten. You thought, I need to get groceries, maybe do some personal shopping,\" your eyes opened almost instantaneously, \"Tampons, fuck I forgot today is my period day.\" You pulled the covers off, and realized you are now a man and your forgetfulness was not rewarded with a stain on your sheets, mattress pad, and mattress. You sighed with relief and slipped out of bed. You went down stairs, ate breakfast, did your morning workout routine, and left out the door for your Saturday out.</span></div></div>",
            "created":1481000400,
            "id":2246433,
            "title":"second week as a man"
        },
        "1251121":{
            "choices":[
                "first day of honeymoon",
                "your first anniversery"
            ],
            "content":"<div class=\"\"><div> <span>She walks up and kisses your cheek before you see her. You turn quickly and then realized it was her and kiss her on the lips and say, \"Hey sweetie. How's your first week as a woman?\" She says, \"Fine, I guess, your former clothes are a little too baggy for me so I'll probably have to either suck it up until the new gender opposite fashions come out or suck it up and buy girly clothes. How's your first week as a man?\" \"Given that today was my period day, I'm doing pretty good.\" All the adults look at you and you just apologized for your crude statement.\" Your girlfriend just said, \"Not looking forward to that.\" You look at her and say, \"You could always get pregnant.\" She looks at you and says, \"Not unless your proposing, you know my code.\" You say, \"Well then, maybe tonight after dinner.\" She looks at you and says, \"What! Really?\" but you don't answer.<br>\r\n<br>\r\nThat night you really did propose, it was weird. The first day you became a man she handed you the ring and said that she was planning on proposing but wanted to allow you to have the honors of doing it, now that you were the man of the relationship. You decided to propose the night she was planning on to show her you wanted this too.<br>\r\n<br>\r\nA month later you both had moved your stuff into your new house and went down to Florida to have your wedding. </span></div></div>",
            "created":1500872400,
            "id":2358704,
            "title":"Your \"girlfriend\" sees you at the store"
        },
        "12511212":{
            "choices":[
                "Dinner that night",
                "seven months later when the kid came"
            ],
            "content":"<div class=\"\"><div> <span>It had taken about four months before you started trying to get pregnant, it took about six months before you did, now on your first anniversary she came home with the best news, she was pregnant. Then it sunk in, 'she' was pregnant. Before the global switch she was a he and was expecting to be at the receiving end of the news. Yeah well you had gone through the pain of simulated childbirth and you swore that if you got married you might have your two replacement rate kids but that might be a stretch. But your wife was so happy to have kids, she grew up imagining being the father of a whole herd of kids, which originally hurt your uterus to think about. Now you were the father and your only requirement was something fun, and she had already gotten into her mind to have her cluster so you were happy to think of fathering a large number of kids. In fact the years after the switch the worlds population skyrocketed. Men were so trained to want kids and women to hate it only for the pain, that once the pain aspect was out of women's minds they adopted the now, feminine view of lets have a lot of kids.</span></div></div>",
            "created":1501650000,
            "id":2363451,
            "title":"your first anniversery"
        },
        "1252":{
            "choices":[
                "sports",
                "book author",
                "visual or audible entertainment"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how are 'you' famous</span></div></span></div>",
            "created":1477544400,
            "id":2229175,
            "title":"a male celebrity"
        },
        "12523":{
            "choices":[
                "visual",
                "music"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which form of entertainment</span></div></span></div>",
            "created":1477544400,
            "id":2229176,
            "title":"visual or audible entertainment"
        },
        "125231":{
            "choices":[
                "actor",
                "fictional character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you become</span></div></span></div>",
            "created":1477544400,
            "id":2229177,
            "title":"visual"
        },
        "1252311":{
            "choices":[
                "Oh, yeah",
                "hell no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>pornography?</span></div></span></div>",
            "created":1477544400,
            "id":2229178,
            "title":"actor"
        },
        "12523112":{
            "choices":[
                "big screen",
                "small screen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>movies or tv</span></div></span></div>",
            "created":1477544400,
            "id":2229179,
            "title":"hell no"
        },
        "1253":{
            "choices":[
                "family member",
                "an old man",
                "skip, next option"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>two more options and another skip</span></div></span></div>",
            "created":1477544400,
            "id":2229174,
            "title":"next"
        },
        "12531":{
            "choices":[
                "Father",
                "Infant cousin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was it?</span></div></span></div>",
            "created":1501650000,
            "id":2363173,
            "title":"family member"
        },
        "12533":{
            "choices":[
                "fictional man",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You not only switched bodies, but realities</span></div></span></div>",
            "created":1489208400,
            "id":2288041,
            "title":"skip, next option"
        },
        "125332":{
            "choices":[
                "sure",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your boyfriend</span></div></span></div>",
            "created":1490331600,
            "id":2294372,
            "title":"next"
        },
        "1253321":{
            "choices":[
                "a fairy appeared to you and said this switch was done to punish your laziness",
                "as soon as your body got pregnant you switched back"
            ],
            "content":"<div class=\"\"><div> <span>The two of you were fucking, then it happened. As soon as you both orgasm swoosh. You wake up the next morning as each other. You both try to figure it out and decide that if having sex did this it would reverse it, nope. Your \"boyfriend\" just awkwardly tried to fuck you and eventually said, \"Damn this is hard. You were always so good.\" You switch and finally you both orgasm, nothing.<br>\r\n<br>\r\nMonday came and you went off to do your body's work. Your \"girlfriend\" finished her work in two hours, At home she asked you, \"Why did it always take you a whole week to do a couple chores.\" She had a whole day to derp around while you were forced to work your ass off as an engineer. Before the week was up you were laid off and now looking for a new job, you were a girl who never thought about work so you never trained for anything. You now had to go back to college to figure out something while your engineer \"boyfriend\" got to live you life of leisure as a stay at home, WAIT, you hadn't gotten pregnant yet because you really were lazy but now you could give \"her\" more work to do. The strangest thing happened</span></div></div>",
            "created":1490331600,
            "id":2294374,
            "title":"sure"
        },
        "12533212":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your boyfriend got his job back and you were now raising a pair of twins, you didn't get a lazy day until you were too old to enjoy them.</span></div></span></div>",
            "created":1490331600,
            "id":2294375,
            "title":"as soon as your body got pregnant you switched ..."
        },
        "1253322":{
            "choices":[
                "yes",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your transgender neighbor...</span></div></span></div>",
            "created":1500872400,
            "id":2358710,
            "title":"next"
        },
        "12533221":{
            "choices":[
                "petplay",
                "bondage"
            ],
            "content":"<div class=\"\"><div> <span>You wake up feeling heavy. The phone rang you answer it, your voice was deeper than normal but not noticeable, you then started getting worried, it was a man on the phone saying whoever you are give me back my damn body. You just said, I don't want your body, I ain't no tranny, you were a little trans-phobic. You didn't notice that the voice was your own womanly voice because you always forced a deeper pitch to gain respect or some shit. You got another hour of sleep before the doorbell rang, you got up thinking it was your boyfriend. Then your phone rang. You answer it, it was the same female voice telling you they are outside and come out before they call the police on you. You called the police. A minute later the police came and you heard a scuffle and the woman saying, this is my house though the person inside somehow broke in. The damn doorbell again, you slid out of bed, feeling wobbly, your balance is off, must be the sleep, and you walked through your bedroom which you knew so well you could traverse it with your eyes closed, YOU TRIPPED, WHAT THE HELL. You open your eyes and for the first time notice something's a miss. You are not in your room and you just ran into a dresser against the wall. You find your way downstairs and to the front door to the house that you were sleeping in, still not noticing your body due to looking up to admire the home. You open the door and the officers say, \"Hello sir.\" \"sir, I'm a woman!.\" \"Sorry ma'am didn't realize you were trans. This woman says ahe lives here.\" You look down and see a male body. Then you look to the woman, she looks just like you. The officer took your shocked look as a confession to the contrary and said, \"Do you know this woman, ma'am, and can you prove you live here.\" \"Officer, I don't know why but I am not feeling myself today, I swear to you, I don't remember moving into this house, or ever living here, and that woman looks just like me as you can probably tell.\" The police woman behind the police man who was talking to you looked at both of your and said, \"Miss, are you on drugs?\" You look at her and say, \"I am most definitely not on drugs I am Abby Danielson, or at least I was when I went to bed, this might sound weird but I think I'm in someone elses body, but I am not a man and I do not live here and I don't know how I got here, she might very well live here but I don't know how I am him and not her. Officer, \"So you have proof of identification, because she is Abby Danielson. You looked shocked and said, \"I can most definitely prove I am the woman I claim to be. You stumbled around the house trying to find your purse with your wallet and you figure that somehow you must have lost it and told the officers, \"This woman must have taken my purse with my id because I can't find it anywhere.\" Officer, \"Your obviously high.\" She found a wallet and said, \"This id has you on it, mister Allen Barry. \"Allen, no I am.\" \"Yes we know, take them both in, we will get this shit straight.\" You look at the picture on the id and it is not a person you have ever seen. This must be a prank. They handcuff you and take you out to the car, on the way you pass a mirror and see the man on the id. You sit there in the backseat next to what you can only assume was is your real body. You are both taken in and upon being told to change into prison garb you see your new body.<br>\r\n<br>\r\nThat night in prison you toss and turn.<br>\r\n<br>\r\nThat morning a police officer brought you both out. By now you both were forgetting your old lives, and your respective partners had already switched genders unbeknownst to them. You were released by your girlfriend, Abby Danielson, and in the car, \"Someone must have dropped something in my drink, yesterday I was seriously tripping.\" She said, \"I fear you might be right, at least they dropped it.\" She looks at you, \"Or maybe you've been a bad boy.\" You say, \"Not now.\" She pouts and you can't help but smile, \"I just want to relax today.\" You hung out and by day 3 you had forgotten almost everything. Your day-to-day stayed the same, gender's flipped when it came to your partner. That weekend you decided to surprise your girlfriend with that kinky day she wanted. Your heart fluttered, and you felt hard down below. You always loved two things sexually, to dominate your woman, consensual of course, and to be put in a submissive position by your woman, also consensual of course. You decide to strip down naked and begin playing out your, and your technically old body who is now your girlfriend Abby's, fetish of...</span></div></div>",
            "created":1500872400,
            "id":2358716,
            "title":"yes"
        },
        "125332211":{
            "choices":[
                "you went out on a date",
                "staycation"
            ],
            "content":"<div class=\"\"><div> <span>It was a warm spring day so you knew you didn't have to worry about freezing. You had installed a device on the door that with the push of a paw the door would open, as long as the door was unlocked. You unlocked the door and went into the kitchen, where you placed two bowls, one you filled with water, the other she would fill with food when that time of the day came. Then you went up stairs and took your pajama shirt off and placed it in the hamper, your phone beeped, it was your girlfriend texting you. You ignored it and took off your pajama shorts and placed them in the hamper too. You admired your naked body and looked at your phone to see what Abby had said, \"Whacha doing 2day?\" You thought hard about your response, you decided to just leave it at, \"Thinking of having some fun. With you it would be funner. Use your key.\" You placed the phone down and ran to your room and grabbed the collar and placed it next to the door with a note that said, \"You doggy needs dressing.\"<br>\r\n<br>\r\nAbby came in the door and saw the collar, \"Oh, that kind of fun.\" The collar said, \"Snowflake\" on it, your demeaning dog name. Allen crawled down to his woman, \"Woof.\" Abby, \"Oh, baby, your naked did I forget your collar?\" Allen barks and crawls in a circle, she puts on her collar and says, \"Lets play outside\" They played ball and went inside. Allen ate lunch out of the bowl on the floor and Abby went out to the store. He looked outside the window, some older people walked by, he got scared he'd been spotted when a delivery woman drove up. he hid and waited for her to leave. He went back to his perch and looked out again, \"Abby is taking a long time.\" thought Allen. Then it hit him, lunch so he pranced over to the device but forgot Ab had disengaged the machine because she was playing with him. He then decided to cheat, but the doors were locked, she took precautions. He then laid on her perch waiting impatiently for his salvation. Eventually she came home and he ran out to do his business. After dinner she threw him into a cage and locked it for nighty-night time and slept upstairs. That morning she fed him out of a bowl, unlocked the mechanism and said, \"You know what baby. I am not letting you be human today, I'm gonna go shopping with the girls so you have free rein, see you tonight and if your a good dog I'll maybe give you human privileges like fucking.\" and went out. She came home that evening. She released him and instead of fucking put her collar on that said, \"Flower\" and they played dog for two days. After that they fucked.<br>\r\n<br>\r\nThe next day</span></div></div>",
            "created":1500872400,
            "id":2358719,
            "title":"petplay"
        },
        "125332212":{
            "choices":[
                "their first anniversary",
                "their play when the babies were asleep"
            ],
            "content":"<div class=\"\"><div> <span>It was a warm spring day so you knew you didn't have to worry about freezing. You had installed multiple inconspicuous devices around the house so that you could have fun anywhere. You chose where and how you were going to first tie yourself up. Then you went up stairs and took your pajama shirt off and placed it in the hamper, your phone beeped, it was your girlfriend texting you. You ignored it and took off your pajama shorts and placed them in the hamper too. You admired your naked body and looked at your phone to see what Abby had said, \"Good morning hansom.\" You texted back, \"Come over to have some fun.\" She said, \"fun or funfun.\" You thought hard about your response, you decided to just leave it at, \"How do you want me? ;) Don't forget to use your key.\" She texted you the details. You could guess what she was planning but you decided to let her have her day. You went upstairs to your bedroom to access the toybox. Here in a nook that shortens the linen closet but not enough to warrant suspicion is your 'toys'. You grab what she wanted on you, lock on the chastity cage on your manhood and walk down stairs. You left your phone, wallet, and keys in the basket next to the door and continued down. In the basement in a nook behind the water closet is a hole that leads into a secret sub-basement room accessible only through a secret door in the back of the Laundry room. You went through the small 4 foot tall door that led to a nook behind the closet and climbed the ladder down. You walk to the other end and follow it through a tunnel to your secret room. This secret room was built by a paranoid during the cold war. It was a nuke bunker that used to be connected on every floor but you have since closed up the entrances and ladders on the two upper floors. The nuke bunker had an entrance for itself but getting to it would mean either stripping in bunker, incurring Abby's wrath, or risking the neighbors seeing you naked climbing into a secret hatch.<br>\r\n<br>\r\nIn the bunker you Sat down on the mattress you put there for kidnap role play. You cuffed your ankles together and used tape to wrap you thighs. Then you blind yourself with a blindfold that has a strap behind your head and under your chin, so that with the assistance of a gag the blindfold won't come off. Then you wrap your mouth in tape and test the gag, \"Hhpmfhlln thnf mhfflmf mn fpmmgh.\", Good. Then you tape your arms to your side and lay down and roll on your chest. You lock the handcuffs around your wrists and wait.<br>\r\n<br>\r\nAbby came in the door and saw your stuff, This was the moment of truth, you weren't sure if your assumptions about the day was true but you weren't in a position to protest anymore. Abby came down and checked the bonds. She was confident he wasn't going to interfere with her day. His question about the day was answered when Abby said, \"Now that your out of town the girls and I can have a girls week.\" \"Whnt! Hhw lhng? H gnrl'f wmmg, Hm thhhght mhnbm h dhn, mhnbm Hmnth thm nnght, hr h whhlm wmmgmnd, bht h whhlm wmmg?\" \"There will be shopping, sleepovers, and other girly things but indefinably no boys allowed.\" \"Nhh dndn't hnfwmr mn qhmftnhnf! Hbbn. Whnt nhh fhnd Hm'm hht fh thnf whhlm wmmg wnll bm Hmn mn hhhfm, hn mn grmdnt ghrd.\" She sighed and said, \"I can barely make it out but yes a week, yes in your house, and only I will be using your card, but I might buy the girls some things.\" She then closed the doors to the room of the bunker, the bunker, the sub basement, and the laundry room. She texted the girls to come over. She put his phone and wallet upstairs in his safe. Abby was left right in front of the window. Some older people walked by, a delivery woman drove up. Abby got the package, and took it back upstairs. She went back to pondering, \"The girls are taking a long time.\" The girls finally came over and they left for their shopping day. They came back and tried on their new clothes, ordered dinner, had a girls night. The next morning they went out to go to the local chain of theme parks. Day 2 was spent at water park riding coasters trying out their new bikinis, and a night of hotel sleepover. Day 3 was spent at the theme park, and another night of hotel fun. Day 4 was spent all day at the hotel's spa, on Abby of course, and they drove back to Allen's house. Day 5 was spent out again shopping, and a final night of girl's night in. Day 6 was spent cleaning up the house, 'so Allen won't know.' and Abby recounting the week to Allen, who was freed and checked the financial damage. Allen said, \"How are you going to pay me back for this week.\" Abby, \"I pay you back. Boy this payback for getting me pregnant.\" Allen fainted and awoke to Abby fanning him back and then showing him the ring he bought her on his week away. The wedding was great, the babies, twins, a boy and a girl, were a lovely pain, but they bought a new house, designed with their kink in mind.</span></div></div>",
            "created":1500872400,
            "id":2358741,
            "title":"bondage"
        },
        "1253322121":{
            "choices":[
                "The night she returned",
                "her present for him"
            ],
            "content":"<div class=\"\"><div> <span>It was a warm spring day like the one when she first engaged you. You had installed multiple inconspicuous devices around the house so that you could have fun anywhere. You chose where and how you were going to first tie yourself up. You had sprung for the latest in robotic babysitters. You placed your kids in the basement and made sure the robot was working. That thing was the perfect way to safely ignore the kids for fun times and you both knew it. Then you went up stairs and took your shirt off and placed it in the hamper, your phone beeped, it was your wife texting you. You ignored it and took off your shorts and placed them in the hamper too. The phone vibrated again to remind you of the older text. You looked at it, \"Can't wait to come home. I can't believe what you are doing for me for our anniversary.\" You took off your boxers and put them in the hamper too. You admired your naked body and was amazed you kept your body even after the kids. You sent a mirror selfie and prepared your spot. The phone vibrated and you looked at your phone to see what Abby had said, \"Good evening hansom. Your preparing for our roleplay?\" You texted back, \"Should I wait or do it myself. What's the story.\" She said, \"I like how I surprised you and financially dominated you in the bunker. Let's roleplay the husband that thinks his fun will lead to sex but it leads to his wife using his credit card to have a week of fun.\" You went upstairs to your bedroom to access the toybox. Here in a nook that shortens the linen closet but not enough to warrant suspicion is your 'toys'. You grab what she wanted on you, lock on the chastity cage on your manhood and walk down stairs. You left your phone, wallet, and keys next to the reservations for the spa hotel she was being pampered at. He walked back up to the bedroom. If they were going for that roleplay he was going to make it look like that roleplay. On the mattress you put all your stuff. You cuffed your ankles together and used tape to wrap you thighs. Then you blind yourself with a blindfold that has a strap behind your head and under your chin, so that with the assistance of a gag the blindfold won't come off. Then you wrap your mouth in tape and test the gag, \"Hhpmfhlln thnf mhfflmf mn fpmmgh.\", Good. Then you tape your arms to your side and lay down and roll on your chest. You lock the handcuffs around your wrists and wait.<br>\r\n<br>\r\nAbby came in the door and saw your stuff, time for the fun, you weren't sure if she would still play it up, retie you, or just leave you but you weren't in a position to plan anymore. Abby came over and checked the bonds and decided to change it so that she was confident he wasn't going to interfere with her week. He was undone and she decided to move him over to the floor of their den closet, which had a lock in reverse to lock the sub in instead of keeping them out, plus the room had the same so that if the sub escaped the closet, or wasn't in there in the first place, they would still be trapped. She cuffed his hands and feet again, a belt to hold his leg together and his arms to his side. Then she tape wrapped his mouth and eyes. Locked the closet door and room door. Then she left and came back a week later.</span></div></div>",
            "created":1501218000,
            "id":2361199,
            "title":"their first anniversary"
        },
        "12533221212":{
            "choices":[
                "one night when the kids were asleep",
                "just some random time when they had nothing else to do"
            ],
            "content":"<div class=\"\"><div> <span>They checked on the kids, and went upstairs. They walked to their new bunker, built less comfortable than the old one, and she suffered to be put in the same situation as he was a year and a week ago. She hated it an apologized, but she also loved it so she allowed him to have another week, this time mimicking the bondage of two weeks ago. After a good three weeks of bondage the couple got back to work. They owned their own business selling stuff on the internet and so didn't have to check up with anyone else. The next time they played was...</span></div></div>",
            "created":1501650000,
            "id":2363457,
            "title":"her present for him"
        },
        "12533222":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Just wear white briefs ",
                "another clean janitor outfit"
            ],
            "content":"<div class=\"\"><div> <span>My name is, or at least was Elizabeth Marsh. That was about a month ago anyway, now it's Earl Covax. To whomever is reading this, I bet you are wondering how I wound up in this situation. Up until last month I had it all. A cute brunet in her mid 30's living in one of the nicest apartments in the city, I had little to complain about. That was until the market crash 2 months ago. You probably remember right? It was so bad most people threw themselves from building tops! It hit me so hard, I was about to sell my wardrobe but when no one would buy it, I stooped to the lowest of the low, selling it to strange men online. I wasn't stripping, and it wasn't porn, but they were very alluring outfits being worn while I was posing seductively. Known doubt I should have known, no self respecting woman would be interested. I just wanted enough to keep up my life style, so any money was good. That's when I met Earl...<br>\r\n<br>\r\nEarl was a janitor here in this building but now that's me. I say that still with a smile instead of horror because we have a deal. A deal that's about to expire soon so I want to document the past month of my life. Unfortunately a janitor's job is never done in this place so I'll only be able to write from shift to shift. Right now my coveralls are covered in some mysterious goo, so forgive me while I change into something new.....    </span></div></div>",
            "created":1555451280,
            "id":2645552,
            "title":"nope"
        }
    },
    "info":{
        "author_id":"scotland1983",
        "author_name":"Scotland1983",
        "brief_description":"you swap lives with someone",
        "created":1241971440,
        "description":"<td align=\"left\" class=\"norm\">you swap body with someone how it proceeds is up to  you</td>",
        "id":1558874,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594724940,
        "modified":1594724940,
        "pretty_title":"life swap "
    }
}