{
    "chapters":{
        "1":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "Try it right now, and work out with Chenise at home.",
                "Go to the climbing gym (inside the mall) and test it there.",
                "It might be safest to head to the college and try it with Madeline."
            ],
            "content":"<div class=\"\"><div> <span>The sun seeps through your window, the sunbeam seemingly lining up with your eyes in order to wake you up and start your day. You make your way out of bed, and begin to get dressed. As you're going through your drawers, you remember that you had a vial of Madeline's new test formula to try out, and you had left it in your bag for school, which is downstairs. It's about 11 in the morning, so you assume that your sister has left to hit the mall, but your mom's probably still home. <br>\r\n<br>\r\nYou begin to walk downstairs to fix yourself some breakfast, and you see Chenise in the exercise room, running on the treadmill. She's not wearing any shoes, as usual, but she's in a sports bra and some black spandex shorts. She's wearing headphones, so she hasn't noticed you come down the stairs. You are mesmerized temporarily by the long chain hanging from her navel, bouncing against her toned stomach as she runs vigorously, before snapping out of it and refocusing on breakfast. <br>\r\n<br>\r\nAs you prepare yourself a bowl of oatmeal and greek yogurt, you wonder when you should try the formula out...<br>\r\n<br>\r\n</span></div></div>",
            "created":1348981200,
            "id":1438039,
            "title":"A test subject."
        },
        "11":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "Jump onto the towel, and try getting her attention from higher up.",
                "Time to test the formula; climb all the way up her body from here."
            ],
            "content":"<div class=\"\"><div> <span>You decide that you're gonna give this stuff a test run right at home, and work out with your mom. You and Chenise haven't really done any bonding in a while, since you've been busy with school and training. Even though you can't test your grip too well, you can at least get a feel for how the traction works while you're conditioning. You run back upstairs to grab some workout clothes, and then you hurry back down to start your workout.<br>\r\n<br>\r\nYou walk into the exercise room, and your mom still hasn't noticed you. \"Probably better not to interrupt her training\", you think to yourself, as you hold the vial of formula in your hand. You trust that if something were to go wrong, your mom would be able to take care of you. Not wanting to waste any more time, you down the vial in one gulp.<br>\r\n<br>\r\nYou don't notice any immediate effects, just a slight dizziness. You begin walking to the exercise bike near the treadmill, when you suddenly start to seize up! You start to feel excruciating pain, causing you to grunt very loudly, but your mom can't hear or see you since she's focused on the run. Your body starts to secrete bright orange fluid from your pores, which start to envelop your clothing. You kneel to the ground, and you feel intense pressure coming from the now hardening fluid, its grip feeling like it's constricting you. The pressure gets so intense that you black out.<br>\r\n<br>\r\nAs you come to, your head feels a bit foggy, but your body surprisingly feels like it's in prime condition. However, you don't recognize your surroundings at all. You're in a gigantic, endlessly spanning space, with a rubbery black floor that stretches far into the distance. You can also hear loud booms in the distance, reverberating at a rhythmic pace. As you take a minute to get your bearings, you feel the vibrations stop. Suddenly, two absolutely gigantic objects start to move their way toward you, and the one coming from the left stops right in front of you, causing you to jump back a bit.<br>\r\n<br>\r\nYou crane your neck up high, and you can make out that there are five enormous, long, and round structures coming out of the dark monolith that almost crushed you. You look up further, and you can see the gleam of a golden chain swinging... and that's when it hits you. The vial put you in optimal climbing condition, but it also shrunk you to microscopic size, and now you are looking up at the titaness that is Chenise, your mother!<br>\r\n<br>\r\n\"Oh shit!\" you exclaim out loud, as you watch your goddess-sized mother start to wipe herself off with a towel. The sweat starts to drip from her body, and you see a droplet glide along her tummy, into her navel, along the surface of her chain, and then it plummets to the ground below. You watch the bead of sweat as it descends, and it drops directly onto you, knocking you onto the ground from the force. You then watch in fear as she drops her towel, and it lands dangerously close to you, the gust blowing you on top of her left big toe.<br>\r\n<br>\r\nAs she bends down to pick it up, you wonder how best to get her attention. You could either...</span></div></div>",
            "created":1349067600,
            "id":1438070,
            "title":"A hasty decision"
        },
        "111":{
            "choices":[
                "Her breasts (cleavage)",
                "Her belly button (onto the chain)"
            ],
            "content":"<div class=\"\"><div> <span>           You look up in anticipation as Chenise's large delicate fingers descend from above. Her hand closes on a fold of the towel. This is your cue to jump. You leap off your mother's shiny pink toenail and land on the towel. You cling to it tightly as you are lifted into the air. It's as if you are clinging to the outside of a rocket ship. You whiz through the air at rapid speed. The air and environment around you is a blur of lights and wind. You do make out a quick flash of gold which you believe to be the beautiful gold chain that you have often watched pendulum from your mother's incredibly hypnotizing, sexy belly button. You press your face tightly into the fuzzy, slightly damp workout towel. Your nostrils are filled with the wet pungent scent of your mother's warm sweat. The smell is somewhat comforting as you whiz insanely through the air.<br>\r\n           The towel thuds against some unknown surface. You fly off the towel, fly about an inch or two, and land among the soft, wavy tufts of your mother's hair. Your mother's gigantic hand swiftly swabs the towel across the top of her forehead. This motion causes several large drops of sweat to explode out in all directions. A few of them fly your way and you are splashed once more by some of your mother's wonderful odorous exudations.<br>\r\n           The sweat stings your eyes just a bit, but it's okay. It is a reminder of how hard your mother has worked to maintain the perfection that is her body. You think about all the countless amounts of fat and sweat that she has worked away over the years. What persistence. What dedication. All the love she has shown for her body to be taking care of it so well for so long. You sit down in the deep wavy recesses of your mother's beautiful dirty blonde hair, engulfed all the way up your neck, and appreciate all the sweat and sacrifice she has retain her beautiful, familiar shape. From this size, it's even easier to see and smell her hard work and effort.<br>\r\n           Suddenly, Chenise's head, which was previous pretty level when you had landed upon it, jerks back briskly. You are thrown out of your wonderful warm dirty blonde cocoon and into the air again. You grab onto a strand of hair on the back of her head just in time and find yourself face to face with the back of her neck. If you weren't in danger of falling and dying, you would pause to admire how beautiful her neck was as well: sweat dripping gracefully along the folds and crevices like little waterfalls down the side of a steep, deep-tan canyon. She has a tattoo on the back of her neck too. You had always known she had it, but had never taken the time to actually see what it was. Before you have a chance to do so, her head jerks briskly forward and you are flung out over the top of her head. You land directly on the mouth-end of the water bottle which she had apparently just taken a sip of. This must be why you were tossed back and forth just now.<br>\r\n           Cherise is still clutching the bottle and is about to put it back down. You leap from the bottle and onto Chenise's sweat-covered wrist. Her hand begins to move toward her head, specifically her ear. She is probably intending to adjust her earphone, as she is listening to her iPhone as she works out. As her fingers hit the earbud, a small shockwave shoots down her hand toward you. You are jolted off her wrist. You try to grab hold of it again, but her skin is simply too slippery. Beneath you are her massive breasts, sheening with sweat and confined inside her black sports bra; and her belly button, a large and deep jewel in the middle of wet, toned, beautifully black tummy, accentuated by the ever-swinging gold chain piercing.<br>\r\n<br>\r\nAs you lose your grip on your mother's wrist, which part of her beautifully exposed, goddess-like body do you fall into? </span></div></div>",
            "created":1432616400,
            "id":1983213,
            "title":"Jump onto the towel, and try getting her attent..."
        },
        "1112":{
            "choices":[
                "Get your mom's attention and/or call for help.",
                "Explore."
            ],
            "content":"<div class=\"\"><div> <span>           You lose hold of your mother's wrist and begin to fall. Animal terror grips you as you plummet. Your brain screams for stability. Something to grab on to. Something to calm your frantic brain. Anything. You notice that are your falling about a few millimeters (or, to you, a few feet) parallel to your mother's stomach, gleaming with an almost golden tan hue, sweat streaming down over its finely chiseled surface. You are reminded of an instance in which you went rock climbing with Kimberly. The two of you, sitting on a  peak, watching the sun rise over the horizon; the light illuminating both your faces and your own sweating bodies. This memory puts your mind at ease just enough for you to come to your senses and take action.<br>\r\n           You swim frantically through the air, desperate to grab hold of some part of your mother's fantastic tummy and stop your fall. At your old size, you glanced peaks at your mother's stomach and thought it a work of art, perfectly flat and gorgeously trimmed. However, at this size, while still very much convinced of its perfection and gorgeousness, you come to notice, as you drift closer to it, that her belly is riddled with countless subtle indentations, creases and protrusions. You stop flailing your arms and legs. You've drifted close enough to her stomach and now you can let gravity bring you the rest of the way there. You hold out your hands and spread your knees, ready to cling on to whatever you can. You prepare for impact. \"5.... 4... 3... 2... \"<br>\r\n           BOOM! You crash against the great wall of toned flesh. You are pressed flat by the impact. Your elbows and legs snap straight. Your stomach is forced flat against her's. Your face (as if fate) is engulfed into your mother's beautiful deep tan abdominal embrace. For a few moments, time stops. Here you are, pressed in to the soft fortress of life that is her belly. Is it so soft that it did not hurt you a bit to collide with it? No. But it is certainly soft enough that it would cause bones to fracture or you to be killed. This moment is bliss. You are stuck to her sweaty form like a fly to paper. The exertion of her pores fills your nostrils. Your body, pressed firmly against her's, shivers as her warmth transfers into you. Your face is completely engulfed by stomach skin. Your vision is completely and forcibly occupied by the sticky, wet, tan, tan tummy of a beautiful and sexy woman. Your mother.<br>\r\n           \"I'm only hugging an insignificant fraction of her belly,\" you think sublimely, \"Imagine how much more of this wonderful belly she possesses, how much more of her belly there is to explore and to feel and to appreciate.\" You feel your pants grow tight and a crawling wetness seeps into them.<br>\r\n           You suddenly find yourself rapidly beginning to un-stick from your mother's skin. You quickly tear your head out of its melded shape in her tummy. It feels like you just had your entire face waxed. A few of your hairs are stuck in the imprint of flesh where your head just was. Your body begins peeling off her stomach and so you quickly take hold of a couple of goose bumps for support. You decide that, instead of getting your mother's attention, you will try to escape her body and go somewhere safe to wait it out until the effects of the formula wear off. You begin to climb down the wall of her stomach, using various small creases and bumps in her skin like you would use rocks whenever you would go climbing. You are careful not to fall due to slipping on particles of sweat. This is pretty difficult, especially considering the fact that her flesh, as well as your own body, are constantly being doused in sweat as you climb. You resist the terrifying urge to look down by staring straight ahead and concentrating on your mother's beautiful tan tummy. This calms you down very much.<br>\r\n           \"My mom's stomach would make a really great place for rock climbing training,\" you mumble silently to yourself. \"Either she's really in the zone right now with her exercises or I'm just too tiny and weightless to be felt, but I'm a little surprised that she hasn't noticed where I am.\"<br>\r\n           A sudden jolt knocks you off your climbing wall. You fall for only a few seconds before you land on a hard surface. You tumble all across it for a few turns until you somehow manage to get your arm wedged into some kind of hook. The tumbling is over with, but the disorientation is not, for you feel yourself swinging. Not tossing or rolling, but distinctively swinging. You know exactly where you are before it even occurs to you to look up and remark at the color of the link that you find your arm wedged into. You are stuck on Chenise's gold chain: the chain which you have often seen emanating from the deep tight mouth of her navel, swinging with the movements of her hips, banging lightly and repeatedly against her bare belly. You and the chain swing imminently toward the black softness of her sweat pants. Upon impact, you are pressed into the cottony material and your vision is shrouded in blackness. Then, after a moment, you swing out toward the open air again. As the chain rears out as far as it can go, you arm suddenly slips from out of the link and you are flung upward. You drift in the air for a bit and then crash down upon something hard. At this point, you are genuinely beginning to feel a little bit beaten up. You'll undoubtedly be having a few bruises to tend to if you ever get out of this predicament alive.<br>\r\n           You aren't on the chain anymore for sure, but the object you find yourself lying on is the same color of gold. Then you look up. The roof of a large, dark cave is visible. It looks no bigger than a slit, but at this size, it's definitely big enough for you to slip through. In fact, if you wanted to go inside of it, this slit would probably be your only way in, as the rest of the entrance to the cave is completely blocked off by the object you happen be lying on.<br>\r\n           \"This is mom's belly button piercing... This is mom's belly button.\" A heavy, silent awe grips your very soul and makes your flesh tremble. You can't believe it. You are directly in front one of the most prominent objects of your deepest and most personal fantasies. The thing you have caught yourself staring at, wanting to do things do, wanting to even somehow be a part of, for so so long. The simple, yet endlessly curious and attractive anatomical feature that you have come to love and appreciate not just in your mother, but also in Madeline, Kimberly, Dani, and all the other women that you've come to know in your life. And who would'a thunk that of all the people who'd ever be able to excite your navel fascination to this degree, it would be your beautiful, wonderful, proud mother.<br>\r\n           You carefully stand up and look directly up above you. Towering miles into the sky is your mother, Chenise. Her breasts are large and firm and block off any view of her neck and face. They bounce rhythmically and lightly as she exercises. Cascading waterfalls of sweat emerge from her pores and pour down the sexy stone-cut wall that is her tight tan tummy. A lot of the sweat, as it glides down her wondrous body, stops and pools on the hood of skin that protrudes over the top of her navel. Some it pools off over the side and continues down the rest of her body, dripping over her sweat pants or seeping into them. Some of it drips down into the open slit between the hood of flesh and the top of her golden piercing. What you would give to be inside a drop of sweat, to drip down gracefully into the cavernous awesomeness of your mom's soft, deep belly button. To live inside of it. To get lost in the near-microscopic but many folds of flesh that intertwined and overlapped into the recesses of her navel. To get lost in those folds. To bury yourself in that ocean of beautiful tan waves and have your senses engulfed by their loving embrace, just as they were engulfed by the mere outside of your mother's flexible tummy just previously. What joy that would be. What simple loving bliss.<br>\r\n           But no. Your current and only priority is getting the hell out of here. You should grab hold of your mother's tummy and continue your descent like you originally planned. If you wanna run with this highly sensual and tempting idea that has now entered your head, you'll have plenty of time to devise a plan and put it into action once you are safe and have returned to normal size. You wouldn't even have to plan to try this thing again with your mom if you didn't want to. You could just as easily attempt it next time with Kimberly. Or Dani. Or Madeline. There's all sorts of possibilities.<br>\r\n           This line of thinking gives you the willpower to decide to head past your mom's navel and keep climbing on down. However, before you can even walk over to the nearest spot of grab-able tummy flesh, your mom's towel comes down and sweeps you up. You are swept in through the crevice between the hood of skin above her navel and the piercing upon which you had previously been standing. You are officially inside your mother's belly button. On one hand... you're in a woman's belly button. And not just any woman's belly button, your mom's belly button. On the other hand, if there was any hope of escaping your mother's body, it has officially been tarnished. The piercing blocks off nearly the entire entrance and the small sliver of an opening that you flew through is now too high for you to get to. You are pretty much trapped here, unless of course you can try to get your mother's attention by yelling or tickling her or something.<br>\r\n<br>\r\nSo, you're here. What are you gonna do now?</span></div></div>",
            "created":1432702800,
            "id":1983761,
            "title":"Her belly button (onto the chain)"
        },
        "11121":{
            "choices":[
                "You confess and she is upset.",
                "You confess and she is not upset."
            ],
            "content":"<div class=\"\"><div> <span>           You decide you're going to try and get your mom's attention to see if she can get you out of here. You saw earlier that she was wearing headphones, so yelling for her won't do any good. And even if she wasn't wearing them, chances are your voice would be nothing more than a faint squeak to her from all the way down here. You thrust your hands into your pockets, trying to think of something else to try. Then you feel something in the left pocket. It's your cellphone. It must have shrunk with you. What luck! You know what you're gonna do. You turn it on, go into your contacts and call your mom.<br>\r\n           After a few seconds, your mom's body stops jostling around so much. There's no way she could've heard it ring, but she probably saw the phone light up as it did whenever someone was calling it. Over the top of your mother's gold piercing, you can see your surroundings move as she walks over to the couch where she usually leaves her phone. As she bends over to grab it, you fall down on your ass, feel yourself slide forward toward the entrance of her navel, and collide with the massive orb of gold metal which accentuates her toned torso. You cup your nose tightly and begin rubbing it fiercely. You didn't break it or anything, but you certainly conked it pretty good. Suddenly, gravity seizes you and pulls you in the opposite direction, toward the deep, uncharted depths of your mother's umbilicus. You land face-down against a large but delicate and soft bubble of tissue. This must be the actual \"button\" of your mother's belly. The cavernous chamber you find yourself in, while, by all technical means, still called the \"belly button\", is really more of a large house for the actual \"button;\" the nub of flesh that marks the very back of the navel. In an instant, you think to yourself that this wonderful pillow is a greater jewel than the actual golden one at the front of your mother's belly button could ever be.<br>\r\n           Oddly enough, you see that, there is something protruding from the button itself. It is the spot where all the beautiful and intricate folds of your mother's sexy soft navel skin center together and coalesce, forming what appears to be some kind of... opening? Yes, an opening. A biological valve of skin and muscle and bodily fibers. You wonder what, if anything, is behind that opening. Is it some great big tunnel that extends deep into the thick, warm, unconquerable whole of your mother's perfectly-awesome body? You wonder what it would be  like to crawl inside such a tube and worm your way through it: claustrophobic and warm and wet, deep into the dark pink recesses of your mother's tall muscular body. The muscles and meat of her body would compress and wrap around your wiggling, worm-like form. You might feel constantly threatened that you'd be crushed under the weight of your mother's mighty insides, like a submarine under the weight of the ocean waves. Yet you know you would keep on inching through her. The true adventurer in you refusing to give up. You'd give anything to see what was on the other side. What would that be? Her stomach? Maybe. If you got stuck there, then you'd be more than just inside your mother. You'd become an actual part of her.<br>\r\n           This is an interesting idea, but before you can entertain anything else any further, a great crash emerges from outside and it permeates your mother's insides as well, causing you to tremble in its impact. After a moment, your head stops spinning and you realize what just happened. Your mother has sat down on the couch. She always sat down whenever she went to the couch to answer her phone. You feel her shift into the cushions a bit and, as she leans forward a bit into a desired sitting position, the tight, sweaty hot skin on her lower belly creases in a little bit, and the small sliver of remaining light which define the entrance into her belly button closes up. The piercing is pinched down into her cavernous navel and you are now completely sealed inside the deep dark hole in your mother's perfect tan tummy.<br>\r\n           The only visible source of light now is from your phone, which lies just a couple of feet (or what constitutes \"feet\" from your perspective) away from you, and does an absolutely piss-poor job of lighting the environment around you. It is on speaker. Your mother's voice is perky and clear.<br>\r\n           \"Walt? Hey baby, what's going on?\" You reach for the phone, hold it near you and instinctively respond.<br>\r\n           \"Oh, nothin' much.\" You would not in a million years ever describe a situation like this as \"nothin' much,\" but it's usually how you greet your mom when you call her so you really couldn't help that it slipped out.<br>\r\n           \"Okay then, what's up?\" she says. You pause. A ripple of electrifying heat washes over you. You really don't know how to even <i>begin</i> to answer this. A slight pang of worry hits you as well. Nevermind for a minute how you're going to tell this to her. The real question is... how is she going to react? How will she, Chenise, your mother, who adopted you from a very young young age, took you into her home, and showed you all the love and care that she shows her own biological daughter, Tanya... how will she react to the fact that you shrunk yourself down, climbed all over her body and ended up inside of her belly button? Will she be worried? Will she be happy that you're okay? Will she be angry? Disown you? Almost certainly not that last one, but who can say how she'll react. You've never been more nervous, dare you say \"afraid\", in your mother's presence in your life.<br>\r\n           \"Walt? You still there?\" she asks. You take in a deep breath.<br>\r\n           \"Mom, something kinda weird has happened and I need you to be calm about it and not freak out too much.\"<br>\r\n           \"What? Why? What is it, baby? Are you hurt?\" she asks, her voice taking on a tone of concern now.<br>\r\n           \"No, it's nothing like that. Just promise me that you will not freak out,\" you say to her firmly and slowly.<br>\r\n           \"Okay, Walt. I promise you that I will not freak out.\"<br>\r\n           \"Alright then. In that case, tell me if you can feel this.\" You place a hand on the big soft button of navel flesh that you are sitting upon. You rub your palm in a circle while your fingers tickle its delicate pink surface.<br>\r\n           \"Feel what?\" your mother asks in the tone of someone oblivious to the punchline of a joke.<br>\r\n           \"This!\" you say assertively and begin to tickle the great nub of skin with more ferocity. After a moment, you feel your mother's body straighten only slightly. You can't see her face (or anything, really), but if you could, you would imagine that it was overcome with queer awareness.<br>\r\n           \"Yeah, I do feel a little something,\" she says.<br>\r\n           \"Where?\" you ask.<br>\r\n           \"Uhhhhh....\"<br>\r\n           \"Go on,\" you urge her.<br>\r\n           \"Walt, what is going on?\" she asks in finality.<br>\r\n           \"Mom, there's something... in your navel. I need you... to <i>slowly </i> reach in and take it out. SLOWLY. Alright?\" There is silence for a long time. There is neither movement nor breath from either of you for a long time. Then, you feel your mother's great, mountainously tall torso straighten up. The slit of light, no longer covered by folds of creased midriff flesh, reappears and illuminates the inside of your mother's belly button once more. Giant wiggling shapes, which you can barely make out to be your mother's beautiful dark fingers, close around the great golden gem that conceals her sexy abdominal indentation, and remove it. With the entire entrance to your mother's belly button finally exposed, an intense amount of light shoot inside of it, brightening your surroundings to near-blinding whiteness. It is like seeing the light at the end of the tunnel. Your vision is entirely occupied with bright, hazy whiteness. And from out of that vast whiteness, a giant but familiar shape enters into your perception. It is your mother's index finger. You stand up and run toward it, stumbling over the bouncy, unstable clusters of navel skin that folds and intertwines all around you. You grab hold of the finger's nail and climb onto it. It seems to sense that you have done so and it slowly begins to move out of the great hole in your mother's impeccable belly and into the larger world that lies beyond.<br>\r\n           The open air (or rather, the \"open air\" as compared to the humid sweat-smelling air that filled the place from which are now being delivered) flies into your lungs and it feels good. Exhilarating. As you ascend on your mother's fingernail, your vision slowly returns and you remark with familiarity and desire at your mother's perfectly tasty tan tummy. It is a tummy fit for a goddess. A tummy to be proud of. A tummy to contest with the dreams and fantasies of all who so much as were lucky enough to glance at it. And of all of them, you were the only one to have ever been given the chance to see it in such an up-close and intimate way.<br>\r\n           \"Your mother's bare tan torso exits your field of vision and disappears beneath her black sports bra, which cradles and lifts her firm, luscious breasts just perfectly. You are then carried up to her neck, which ripples subtly as an audible gulping motion occur in her throat. You wonder for a curious moment what it would be like to be inside that throat and pushed down her esophagus in such a gulp. You would go down quite easy.  And speaking of which, the neck thing you meet are her lips, big and full and sparkling with deep purple lipstick. You finally stop at her bright beautiful eyes which are visibly filled with shock and disbelief.<br>\r\n           \"Walt?...\" she whispers hoarsely. You can see yourself reflected in those great black watery pupils of hers.<br>\r\n           \"Hey, mom,\" you say weakly. Now is the time for you to confess everything, and you meant <i>everything</i>. The potion <i>and</i> your fetish. There is no getting around it.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1432795920,
            "id":1984258,
            "title":"You give your mom a call."
        },
        "111212":{
            "choices":[
                "Hang out inside your mom's belly button while she does exercises.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>           Your mother stares at you, tender concern in those great big black eyes of her's. And you stare back.<br>\r\n           \"Mom, I know you're probably wondering how I got all... tiny and whatnot.\" You pause here, almost worried that her mind may not even be accepting of what she sees right now, let alone any sort of explanation for it.<br>\r\n           \"Yes,\" she whispers gently.<br>\r\n           \"Well... the chemistry lab at school concocted some kind of a formula, or serum, or I don't know what, but it's designed to increase the human ability to, uh, cling to surfaces essentially.\" Your mother's gigantic eyelids squint slightly in confusion. \"They needed a test subject, so a friend of mine - you don't know her, but she's a chemistry student - she told me about it and hooked me up with a sample. She said I might find it useful for my climbing, y'know? But... apparently, the one major side-effect of the thing is that it shrinks you down to about a millimeter or so and... well, here I am.\" Her eyes widen, panic begins to dawn upon her face. \"Now, Mom, before you freak out, let me tell you that the whole \"being small\" thing isn't permanent, alright. It wears off after about a day. Don't worry. I'm fine. It's all good.\"<br>\r\n           Most moms, you figure, might have started panicking about this kind of highly unusual thing before you had even gotten a word in edgewise, but you know your mom and she knows you. You both have a special bond of trust and patience between one another so strong that, even in the strangest and most difficult-to-process situations, you are both calm and understanding when it comes to every single situation that comes your way. The look in her eyes tells you that the knowledge you've given her doesn't rest too comfortably in her brain, but she, like so many times before, is willing to believe you, for your trust in one another has never steered either of you wrong before. You've told her the story, she accepts it. You've told her to keep calm even though the situation is definitely weird, she remains calm. Her eyes now start to take on a look of deep focus, like she is studying you for something.<br>\r\n           \"What were you doing on me?\" she asks suspiciously<br>\r\n           \"I was... well... climbing you to try and get your attention. It wasn't easy, believe me. I got jostled and tossed around a whole bunch. I'm not really hurt though or anything like that, don't worry. But man, did I get flung about. I got stuck in your hair at one point and I got caught on your sweat rag a time or two. And then... then at some point... I was climbing down your, uh... uh...\"<br>\r\n           \"My what?...\" You pause. <br>\r\n           \"Your, uh... stomach.\"<br>\r\n           \"Yeaaah?...\"<br>\r\n           \"I had to climb down it, 'cuz I realized trying to get your attention would be sorta futile, so I scaled down the way of your stomach, and it was just like climbing down a really nice, beautiful, steep canyon wall. And I kept getting drenched in sweat and it got a little slippery to climb down, and uh...\" You instantaneously realize that you have an erection. You see it rise through your pants. Your legs are spread apart, so your mom sees it too. There you are the size of a mite, hard and sweating, on the red glass nail of your mother's delicate finger, and she is watching. A moment of staring into those piercing wet eyes, and what you see reflecting back at you is awareness. You dare not look into them for another moment for fear they will also reveal her <i>reaction</i> to this awareness.<br>\r\n           \"I really liked being on your stomach, mom... and I also liked just as much, probably more so, being in your belly button. It was really pretty, and big, and deep.\" You don't dare look at her, but you assume she is still looking fixedly on you. \"And it's not just being inside of it that's made me come to have these feelings about it. I've always felt this way about it. About your belly button. And not just your's, but all women's belly buttons in general. There's nothing cuter and sexier to me than a woman's belly button, peeking just out from under the loose cloth of a crop top at the mall, or pierced with a barbell beneath a belly shirt at a concert, or sandwiched inbetween a two-piece bikini at the beach. The belly button, and my fascination with it, there's something almost kind of... spiritual in it. It's like I see a girl's belly button as like some kind of fixed point of enlightenment or spiritual essence on her body. A place where all that makes her beautiful and human is contained. And to long to touch it, or to kiss it, or... to be inside of it, is to want to know and experience the totality of her soul.\" You aren't exactly sure of any of this is making any sense. These thoughts, which you have only kept in your head your whole life, are finally being spoken to someone for the first time and you aren't sure if they're coming out the way you mean them to. \"And yeah, I think girl's belly buttons are beautiful. And I think, and have always thought, Mom... that your's is beautiful in a very special, unique way to me. I've always liked that you were never afraid to show it off. You'd always come down to the living room and exercise, baring your stomach completely, and not care if anyone saw or anything. And the way you've taken care of your body all these years, kept it fit and all that... really makes me feel proud of you. I've always appreciated your demonstrable way of loving yourself just as much as you love me and Tanya. Not many people can do that actually. Your stomach, which I dare call magnificent and tall and lovely, has always been a treat for me to see over the years since you've taken me into your home and raised me, loved me, as your son. I've always looked at your belly button with that same desire and fascination, that same longing for a connection of one human soul to another, and wanted to get closer to it, just as I've wanted to get closer to the belly buttons of many other women and my life. But unlike other women, you are my mom. And the connection we have with one another is not one that I'll be able to have with very many other people in my life.\"<br>\r\n           You stop speaking. Here it is. You slowly, nervously turn your head back toward her face. Her expression is blank. Totally devoid of emotional reaction. Your nervousness gives way to anxiety. You begin to open your mouth to speak and you feel yourself moving. Very slowly. Your mother is pulling you toward her, slowly but intensely. Her eyes, dull and stoic, almost grey, lock onto you. You stop staring at her eyes and look straight ahead at her perfectly straight line of a mouth. Her shiny purple lips begin to part. You see the wrinkled pedals of flesh, momentarily stuck together, come apart in a smack of saliva and begin to rise up, just exposing the faintest slivers of her pearly-white teeth. You are being moved toward those lips. Toward her mouth. Vague terror dawns upon you and slowly intensifies as you drift closer to the great opening.<br>\r\n           \"Is she going to eat me?\" you wonder. She wipes you off her fingernail and onto her lower lip. Before you can open your mouth to say anything, you look up just in time to see your mother's gigantic purple-painted top lip close on top of you and engulf you in its soft slimy comfort. The top half of your body is inside your mother's mouth. The lower half is still hanging over the edge of her bottom lip. You suddenly feel pressure surround you. The lips pucker around your whole body and you feel yourself begin sucked into the thick pillowy dream-like void of your mother's kiss. You are sucked so far inbetween her lips that your whole body is inside her mouth. But before you can totally pass between her lips and land on her tongue, you are sucked backwards, back into the fold of her wet pink lips. In an almost orgasmic smack of saliva, you are passed from your mother's lips and into her great soft hand. A small exhale escapes her lips and it wafts toward you. It damn near blows you backwards a little bit and it smells like cherry soda. As your mother's lips un-purse, they form into a mischievous little smile. Her eyes show that same mischievousness, as well as what you perceive to be understand, and perhaps even... pleasure? Your mother begins to speak.<br>\r\n           \"So... you like my belly button, you say?\" You stare at her, excitement slowly building inside of you.<br>\r\n           \"Yes,\" you whisper.<br>\r\n           \"Would you like to go <i>inside</i> my belly button again?\"<br>\r\n           \"Yes,\" you say, almost passionately.<br>\r\n           \"Well,\" she says to you, the smile on her face broadening, \"First, I want to give <i>your</i> belly button a kiss.\" She pulls you back toward her lips again. You aren't quite sure you heard her right. Before you can say anything though, two large delicate fingers grab you by the shirt. You are hoisted up onto to your feet and your shirt is removed from your body, exposing your own stomach. Your mother's smile turns into the pucker of a kiss and she leans in. Her lips are so fantastic and huge that your are completely engulfed by them. With intense suction, you are pressed into the velvety skin of her lips. An almost deafening moan of pleasure escapes her as you are sucked firmly against her loving kiss. Then she releases you. You fall back onto her hand, flat on your back and she laughs a little.<br>\r\n           She places you back inside of her deep sexy belly button. You know in your heart now that you are free to do whatever you want inside of it. Your mother, knowing her son is safe inside the soft impenetrable fortress of her loving tummy, approves of whatever you wish to do. <br>\r\n<br>\r\nSo what do you do now?</span></div></div>",
            "created":1433406900,
            "id":1987633,
            "title":"You tell her everything."
        },
        "1112121":{
            "choices":[
                "Yoga",
                "Sit-ups"
            ],
            "content":"<div class=\"\"><div> <span>           \"What do you wanna do now, sweetie?\" your mother asks you modestly. Her navel, inside which you sit, is a grand temple of tan flesh. You lean back against one of it's soft, squishy walls. Your thoughts are racing at a mile a minute. You are overwhelmed by exhilaration and joy, but you are also still aware of the weirdness of the situation and have not totally accepted how totally understanding your mother is about it. There's all kinds of things you could think to want to do in the confines of her beautiful belly button, but you wanna take things slow.<br>\r\n           \"Uh...\" you say, deep in thought about what to say. After a minute's indecision, your mother speaks up.<br>\r\n           \"Here. I know. You can help me with the rest of my exercises. Does that sound good, Walt?\"<br>\r\n           \"Er, yeah. Sure\" you say finally.<br>\r\n           \"Okay. Climb out of there for a second.\" She pokes her finger into her navel and you climb onto it. She lifts you up toward your face. \"I'm going to surprise you with something that I think you'll like, so I need you to close your eyes while I set everything up\" she says sweetly. You don't feel comfortable closing your eyes while you sit on a fingernail in the open air and are susceptible to falling off. Your big black eyes meet your's and she perceives this fear. Her lips form into a petite little smile and they emit a small chuckle. It's a woman's chuckle. A somewhat mischievous chuckle. \"Alright, sweetie. I'll put you somewhere safe until it's all ready.\" She pulls you closer to those lips and your face disappears into the soft purple pillowy wetness of that sexy smile. You are sucked through her lips into her mouth. You are sucked out onto the surface of her hot pink tongue. Inside of your mother's warm loving mouth, you watch her smile speak. \"Comfy? I'm gonna grab an exercise mat, so don't go anywhere.\" The warm cherry-smelling air from the back of her throat that composed her words and the way her tongue bobbed up and down as she spoke sends shivers down your tiny spine. You feel her walking toward the closet where she keeps the mats. You hear the door open, a pause in which she presumably got one, and the door closing again. She walks a few more steps, then she speaks again.<br>\r\n           \"Now close your eyes, Walt. I'm taking you out now.\" You close your eyes and feel yourself being sucked toward the front of her mouth. Enveloped by her wet sexy kiss, you are lovingly expelled from your mother's warm mouth and back into the open air. You are covered with sticky saliva. You immediately plap down onto what you feel to be her great flesh hand. You feel so safe in that hand of her's. You feel her lowering you. She gently dumps you onto the exercise mat. You know it to be so because you have exercised with your mother on these mats plenty of times before. \"Okay. Not yet,\" she says reassuringly. You wonder what she has in store for you. Either push-ups, sit-ups or yoga. These are usually the exercises for which she uses these mats. You hear a loud thud and a tremendous earthquake shakes beneath you for a few seconds. You are so badly startled that your eyes instinctively shoot open and you look up to see what the hell that was all about.<br>\r\n           You are stunned by what you see. Your mother is on her knees, looking down at you, towering over you with all her beauty: luscious breasts, mountainous tummy, and all. \"Whoops!\" she exclaims, \"Sorry, baby. I would've tried to be more gentle when I was getting down on my knees if I could. You okay?\" You only nod in surprise. \"Okay, good,\" she says, \"Because I'm about to do some push-ups and I wanna try a little experiment.\" The sly, suggestive grin edges its way onto her face again.<br>\r\n           She pulls out a green plastic cup. She tips it upside down and places it in front of you. You look at the cup and then look up at her, confused. Her sexy little grin elaborates.<br>\r\n           \"I wanna do push-ups and have you tickle my belly button at the same time. I want to place you right under my belly button. When I come down during each push up, my belly will come down right on top of you, and you will be inside my belly button. When you're inside it, I will be sure to come down as far as I can so that you will be able to touch the very back of it without even having to reach very far. And when the back of my belly button is in reach... I want you to tickle it good. We'll do this for a few repetitions and see how you feel, okay, hon?\" You are on board with this idea 100%.<br>\r\n           \"Yeah, sure, but I gotta ask. What's the cup for?\" Your mother's grin spreads out into a smile. She extends her finger out to you. You climb onto it. She picks you up and sets you down on the flat bottom of the turned-over plastic cup.<br>\r\n           \"You're so small that you barely come off the ground at all. My belly would never even be able to reach you when I bent down. This cup will put you at just the right height that my belly will be able to reach you.\"<br>\r\n           \"Okay,\" you say, satisfied.<br>\r\n           \"Now...\" she says to you. She comes down on all fours and begins slowly crawling forward until her sexy tan tummy hovers over you. \"Tell me when my belly button is right above you.\"<br>\r\n           You wait a minute until her navel is directly over you, then you say, \"Okay. You're good.\"<br>\r\n           \"Good,\" she coos. \"Then let's get started.\" She spreads out into a push-up position. You can't believe this happening. In a matter of moments, your mother's beautiful tummy will be falling toward you. It may even crush you. But you're sure that your mother will be super careful about it. Excitement fills every inch of your body. Your mother's body raises up and suspends over you.<br>\r\n           \"I love you, Walt. Be good to mommy's tummy,\" she says.<br>\r\n           \"I will,\" you say back. \"I love you too.\" With that final exchange, your mother's infinitely magnificent belly descends toward you. She is a like a goddess, you think. A goddess, and you are her unworthy mortal. A mortal that she respects and loves enough to share her impeccable body with. Your goddess is gracious enough to allow you to become one with her sacred flesh, to go inside that holy realm of her belly, a place which no other mortal has even been granted access to, and a place in which we only find ourselves once in our lifetimes: when we are but tiny babies, dependent on the warmth and care within our mothers' tummies. You never had the privileged to be brought up inside Chenise's exquisite tummy, but now you are getting sometime almost as good. You get to go, once again, inside her belly button, the closest you can get to the inside of her tummy without actually being in it. It is beautiful. It's almost like you're finally getting your chance to be reborn, reborn as <i>her</i> child, from <i>her</i> glorious belly.<br>\r\n           As her body descends, your vision, as you look up, is completely engulfed by the tan, wet belly of your mother. The closer it gets, the more the pungent scent of her stomach sweat fills your nostrils. \"She still hasn't even taken a shower yet,\" you think to yourself. The great hole in the middle of her stomach descends upon you. Her tummy falls onto you and you are kissed into the warm gaping maw of your mother's belly button. You are inside her navel, but you still have yet to get to the very back of it. Only, you don't have to get to the back of it. Your mother is bringing the back of her navel to you. You realize that the moment her navel engulfed you was all the moment that her tummy hit the cup. In order to keep lowering herself down until the back of her belly button was at your level, she'd have to keep lowering until the cup was pressing firmly into her tummy. The thought of your mother, baring her belly against the cup until it sunk a little ways into her flesh turns you on quite a bit. Just more proof of the great attractive strength contained within your mother's perfect body.<br>\r\n           At last, in the darkness, you can faintly see that you have arrived at the familiar pink button of flesh at the back of her navel, the \"button\" of your mother's belly if you will. It's even softer to touch than you remember. You can't help yourself. You begin to touch and tickle it furiously. Your mother starts chuckling with ticklish glee. The soft sensual chuckling travels throughout the whole of her womanly body and, encased in darkness, the sound fills the walls of her monolithic belly button and reverberates from all directions. This turns you on even more. You thrust your face into the extra-soft pink button of flesh and begin kissing madly. Heat ripples across your whole body. Your face is engulfed in sexy pillowy softness. The sound of magic harps ring lovingly in your brain. Your mother begins laughing wildly. Her whole body, especially her belly, begins to shake and quiver and bob with ticklishness. All you can hear are the sounds of your lips smacking crazily against your mother's belly button, your mother's hectic sexy laughing, and the hard, fast thumping of your mother's heart. It's all too much. Jizz explodes from your dick. You lay down on your back, on the flat surface of the plastic cup, and you begin to breathe heavily. At that exact same moment, your mother's belly button begins to move around you. You are expelled from the darkness of her tummy hole and now her hot, sweaty belly (which is sweatier than it was before you went into her belly button) hovers high over you once more. The two of you say nothing for a minute. Then your mother speaks.<br>\r\n           \"You ready for another one?\" For a good time, your mother and you repeat the same exercise. She gobbles you into her sexy sweaty navel every time she goes down, and you tickle, kiss, caress and touch the inside of it to your heart's content. After a little while though, your mother figures that it's time to move on to a different exercise.<br>\r\n<br>\r\nWhat do you and her do next?<br>\r\n </span></div></div>",
            "created":1434272880,
            "id":1992321,
            "title":"Push Ups (For Starters)"
        },
        "11121212":{
            "choices":[
                "You are back in your own bed and the shrinking effects have worn off.",
                "The shrinking effects haven't yet worn off."
            ],
            "content":"<div class=\"\"><div> <span>           \"I'm fine with whatever,\" you say. She smiles.<br>\r\n           \"How about sit-ups?\" she asks.<br>\r\n           \"Sure,\" you say. Chenise carefully grabs you between her thumb, and index and middle fingers and picks you up. She holds you in front of her flat tan belly. You can never get tired of looking at it. It shines with wet sticky sweat and, as she breathes, the slightest impression of a six-pack becomes visible whenever she exhales. You stare up into the eyes of your goddess mother.<br>\r\n           \"You wanna go into Mommy's tummy?\" You nod. \"You wanna be my little belly button boy?\" You nod harder. She chuckles, teeth pressed gleefully into her lips. \"Then back into my tummy you go, little guy.\" She drifts you close to the entrance to her navel. The pungent fumes of her beautifully-worked soft body fill your nose. As her fantastic belly hole is moments away from consuming you and filling your vision with those beautiful cavernous walls of tender tummy skin, she stops.<br>\r\n           \"But before you go back in Mommy's belly button, I want you to give her belly button another kiss.\" Her other hand descends down to her lower stomach. She gently pinches the edges of her navel all around until they pucker out toward you like a set of waiting lips. Then she carefully, but firmly eases your head into the soft, sexy embrace of her abdominal kiss. You kiss back, feeling the immense pleasure of your lips against her belly button. After a frantic 30-seconds of passionate blissful kissing, you stop, give her belly button one more delicate peck, and pull your head away from her her \"lips.\" Chenise stops pinching her navel, and it un-contorts effortlessly back into its original beautiful gaping shape.<br>\r\n           \"Now\" she says, \"It's time for Mommy's belly button to kiss you.\" As she says this, she does something you'd never seen before. She makes her belly \"flutter,\" like the way a waterbed would flutter if you sat down on it. Her navel ripples in and out of sight as her the waves of her belly swallow and regurgitate it again. <br>\r\n           \"Whoa! What was that?\" you ask excitedly.<br>\r\n           \"I dabbled a little bit in belly-dancing when I was in college. That was one of the moves that I still remember and can do pretty well\" she replies modestly.<br>\r\n           \"That was beautiful,\" you say.<br>\r\n           \"Then get ready, 'cuz this is your kiss.\" She holds you no more than a millimeter from the entrance to her navel. You hear a low powerful gurgle coming from inside her tummy. You look up and see the hot brown flesh of her beautiful womanly belly rolling toward you like a 40-foot wave. The wave swallows all perception as it engulfs you, rolls you forward, and deposits you gracefully and fluidly into the great, fantastic cavity in the middle of your mother's tummy. You fly for a moment through the darkness, but then crash against her soft navel skin and gently slide down onto the \"floor.\"<br>\r\n           \"Cool kiss, huh?\" you mother asks. She knows damn well that you are thoroughly impressed.<br>\r\n           \"Yeah!\" you shout back. You kiss the wall of your mother's navel that you are currently resting against appreciatively. In a minute, your mother is prepped and ready for sit-ups. She lays down on her back. All you can see from inside her tummy is the ceiling.<br>\r\n           \"You ready?\" she asks.<br>\r\n           \"Go for it,\" you say. She begins to do sit-ups. You lay on your back, arms behind your head, at the button of your mother's belly button, relaxing and feeling her work away like she does every single day to keep her body beautiful. Everytime she sits up, her belly button is forced closed by the juts of soft, firm muscle that prop up her strong sexy tummy. Then when she lays back down again, her belly button opens back up again, as wide and as proud as ever. In those moments when her navel closes and you are completed enveloped in darkness, you are reminded of how much your mom's belly button kind of feels like a mouth; the way it opens, closes, kisses - just like a mouth does. The sound of her heart beating, the little grunts of feminine power she emits everytime she goes in for another rep. All these wonderful sounds help to ease your body and relax your mind, and within a half-hour, you are deep in sleep.<br>\r\n           Later in the evening, still in her belly button, your mom goes to her room, lies down underneath the pink sheets of her bed, and begins to crack open the Stephen King book she has been reading every night for the past few days. She changed out of her workout clothes hours ago, and is now wearing a black AC/DC croptop. Even if she is 40, she still easily pulls off the body and looks of a hot girl at a rock concert. She puts down the book, gently lifts off the covers and takes one last look at you. Her beautiful bare belly is illuminated by the light of the bedside table lamp. There you are, curled up happily in the soft pink recesses of your mother's sexy warm belly button. She thinks you look so cute and little. She would kiss you if she wasn't afraid of disturbing you. She gently practices a few belly-dancing moves, rocking you in her stomach like a child in a cradle, being careful not to wake you. She wonders what it would have been like to have known you when you were very little, and if she could hold you in her arms. The rocking is comforting and, though you are not aware of it because you are still asleep, it feels good and it makes good dreams begin to permeate your mind. She is happy and you are happy. Mother and child both sleep easy tonight; she in her soft bed with her sweet son close to her body, you dreaming happy dreams, under the glow of the bedside table lamp, in the safe soft haven of your mother's loving tummy.<br>\r\n<br>\r\n           What happens when you wake up the next day?</span></div></div>",
            "created":1440556200,
            "id":2025630,
            "title":"Sit-ups"
        },
        "111212122":{
            "choices":[
                "Tanya takes you to hang out with her friends.",
                "Tanya takes you to see Madeline."
            ],
            "content":"<div class=\"\"><div> <span>           You are woken by a subtle but pronounced jarring of the earth beneath you, along with a great rolling groan that vibrates in your ears. At first you are confused, but then remember where you are. And as your mind relaxes, so too does your body, sinking lazily back into the indentation that your sleeping form had produced into the super-soft pink flesh of your mother's beautiful navel.<br>\r\n           \"It's morning,\" you think to yourself. \"And that little earthquake I felt just now must have been her stomach. She's hungry,\" you conclude. Curiously, your mind begins to play out a strange and not-altogether-unpleasant sequence of events. You imagine the soft walls of your mother's belly button slowly beginning to constrict. The intricate layers of flower petal-like navel flesh twist around your legs and back, and crawl in wave-like motions over your chest and arms. You marvel at what is happening to you. \"There is such a small amount of skin inside the human navel. There is only enough room inside it to fit one or two of your fingers at best. And yet, here I am, being thoroughly dominated and absorbed by perhaps the smallest and least-notable feature of the human anatomy. It makes me feel so weak. It makes me feel so content.\" As your thoughts finish being poetic, the folds that ensnare you begin to move in unison like a muscle.<br>\r\n           Your exposed face is turned away from the outside world and into the deepest depths of your mother's tummy cave. Where there was once a solid but soft wall of navel flesh, there is now a gaping, undulating hole that leads into a long, dark, tight winding tube. It looks a little like the opening of a throat. You can almost swear that it breathes like one too. Still inside your imagination, you hear your mother's voice. It sounds far up above and, at the same time, rumbling and clear, as if coming directly from her guts.<br>\r\n           \"I'm so hungry, Walt,\" the beautiful creature's body croons. \"How would you like to take a nice little ride into mommy's tummy?\" Without waiting for an answer, she laughs wildly and you are thrust into the gaping, small dark tube in front of you. You feel yourself being squished even tighter than before. All sides of you are compacted tightly and wetly against the sweet, sweat-smelling walls of this belly button throat tube thing. You are forced to stare directly ahead, as you are squeezed deeper and deeper into the bulk of your mother's beautiful, toned tummy. Her laughter, more muffled than ever, still penetrates your ears as you pass through the dark coil of soft muscular flesh. This reminds you of an episode of \"Invader ZIM\" you saw on TV when you were a kid. There was a scene where this sickly-looking green kid walked toward the camera, getting closer and closer, until his belly was completely engulfing the screen. Then, the camera zoomed into his belly button and traveled up through the inside of it and into his guts. But instead of being gross, this is absolute heaven. You feel so safe and warm inside the depths of your mother's firm, sexy tummy.<br>\r\n           You emerge through the belly button tube and into your mother's stomach. If you thought that being inside your mom's belly button was as close to her tummy as you could get, boy, were you wrong. You are now literally inside her tummy. It's like getting to be inside her belly as a fetus. You never got the chance to do that, but this is close enough. Only instead of waiting to be born, you're peacefully waiting to be digested into the sea of digestive juices that fill her stomach. Quietly and happily, with your mom's sweet, sexy laughter aiding the process, you slip away into unconsciousness. You are dissolved completely, and your body gets transformed into nutrients that flow throughout the whole of her gorgeous body, and contribute to maintaing the strength and beauty of your mother's goddess-like tummy.<br>\r\n           You are shaken out of this lovely little daydream by your mother's voice.<br>\r\n           \"Hey, sweetie-pie. You sleep okay?\" she asks sweetly.<br>\r\n           \"Yeah, I slept great,\" you say.<br>\r\n           \"Y'know, I never thought my belly button was all that cute. Or my belly for that matter. You know I like to show it off and keep it looking trim, but I never once thought of my belly as anything to be particularly proud of.\"<br>\r\n           \"Nonsense, Ma,\" you tell her. \"You have a beautiful belly and your belly button is soft and nicer than any bed I've ever slept in.\"<br>\r\n           \"Well then, I'll be sure to do more of these little tummy trips with you again soon,\" she says playfully. Her tummy slightly jostles from side to  side a few times like the hips of a belly dancer. You can't see her face, but you imagine that her lips are curled into a seductive smile and her eyes, shining with a loving gaze, are gracing the deep, sexy tummy hole in which you lie. \"Maybe we can go see a concert. I'll plop you right inside my belly button and put on one of my rock band belly shirts. Maybe the Nirvana one? You gotta like the Nirvana one.\" You do indeed like that Nirvana shirt she sometimes wore. A rock concert would be fantastic. You can just imagine being inside her belly button while we dances hard and fast to the blaring music, sweat pouring all down her rock-hard tummy and pooling into her navel. You could damn near drown in all that thick, pungent pore juice.<br>\r\n           \"Hey, sweetie,\" your mom asks, \"when is this shrunken thing gonna wear off anyway?\"<br>\r\n           \"Probably around noon today,\" you contend.<br>\r\n           \"Are you sure?\" she presses. You pause a moment.<br>\r\n           \"Not totally, but pretty sure. Just to be safe, I think I better go check in with Madeline and explain everything to her. Can you give me a ride up to her place. I'm not really in any position to go there alone. Obviously.\" Your mother begins to sit up. For a moment, you are swallowed into the darkness formed by the tightening of her tummy muscles over her belly button in mid-sit up position. You can still hear her voice resonating deep from within her core.<br>\r\n           \"I've got work in a little bit, but I think someone else would be happy to walk you up there.\" You suspect that she was smiling when she said that last part. Her belly muscles straighten her upright and vision returns to your eyes again. Standing before you is Tanya. Or rather, it's Tanya's belly. You would know it anywhere. You pretty much grew up with it, and she's been gracing the world with its presence for as long as you can remember. Her tummy is not as dark as your mother's, and while your mother's stomach shows traces of a six-pack, her's is as flat as a washboard. Nevertheless, it is beautiful. You blush at the sight of it. So big, so close. You've never been this close to Tanya's tummy before. Her gigantic hand comes down into view and her fingers wave delicately at you. There are no words. Your mom explains.<br>\r\n           \"I told your sister about everything while you were sleeping.\" After a long moment of silence, you can only utter one word.<br>\r\n           \"And?...\" Tanya laughs. Her tummy jiggles a little as she does so.<br>\r\n           \"It's... a little weird, I'll admit. But given how much this family likes to show belly all the time, I'm not surprised that it's had an effect on you. I think it's kinda cute actually.\" You laugh, relieved, but also a little bit surprised.<br>\r\n           \"I think she would be more than happy to give you a ride to Madeline's place,\" your mother contends.<br>\r\n           \"I'm ready to go now if you want,\" Tanya says chirpily.<br>\r\n           \"Heh, alright,\" you say with a shrug.<br>\r\n           \"Alrighty then,\" your mom says. She chuckles softly and you feel her tummy vibrate. Tanya chuckles in return and her tummy ripples in small corresponding ripples. Suddenly, your mother stands up and takes a step towards Tanya. She presses her tummy right up against Tanya's. You are trapped in darkness again, the well-lit world outside of your mother's navel being blocked by the impenetrable wall of your sister's tummy. You can hear your mother and Tanya both cackling loudly. And because you are so close to each of their tummies, the sound of their hysterical voices fills your ears in muffled loudness. You try to stand and are jostled off your feet. Your mother is moving her belly in short, spastic directions against Tanya's. You have no idea what in the hell they are doing, and what is so goddamn funny. After a few hectic seconds, the jostling stops and your sister's voice can be heard.<br>\r\n           \"Okay, Mom, I think I got it,\" she says through dying chuckles.<br>\r\n           \"Got what?\" you think aloud.<br>\r\n           \"Okay, honey,\" your mom says slowly, enunciating each word carefully, \"I need you to stand up and keep on walking until I tell you to stop. Alright?\" You don't know what sort of game your mom and sister are playing here, but you'll play it anyway.<br>\r\n           \"Um... okay,\" you say shakily. It's pitch dark inside your little cave. You can't see a thing. But you stand up and begin to walk forward anyway. As you cross the soft flesh of the inside of your mother's belly button, you wonder why you are being asked to do this. Aren't you eventually just gonna reach a dead-end? Isn't the entrance to her navel being blocked by Tanya's tummy? After almost a minute of walking, you feel certain that you should've bumped into your sister's soft, pillowy belly by now.<br>\r\n           \"Okay, he's in,\" your sister's voice whispers above you.<br>\r\n           \"Alright, stop, Walt,\" your mother's voice commands. \"Okay, now!\" The darkness is lifted from your sight once more, but not from the direction that you were expecting. Instead of seeing your sister's tummy back away from the entrance to your mother's navel, you are instead staring deep down into the back of a navel that looks distinctly different from your mother's. You turn around and are surprised to see your mother's tummy facing you. You are outside of it for the first time since yesterday.<br>\r\n           \"Nice day for a walk inside your little sister's tummy,\" Tanya comments.</span></div></div>",
            "created":1458378240,
            "id":2119650,
            "title":"The Belly Button Transfer"
        },
        "12":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "\"You're on\" you say, and down the vial right there in the store.",
                "\"Yeah right\", you wait until you reach the gym before taking it."
            ],
            "content":"<div class=\"\"><div> <span>You feel pretty confident in Maddie's ability to make a strength-enhancing formula, and you want to show off to your friends at the gym, so you decide that you're gonna head there. The mall is thankfully only a short walk from your home, so you set off on your way.<br>\r\n<br>\r\nYou arrive at the entrance to the mall, and you are making your way to the gym when you notice Tanya at Ardene with a couple of her friends. You think it might be cool if they got to see the effects of this formula too, so you walk in and surprise them.<br>\r\n<br>\r\n\"Still going for the cheap stuff eh?\" you tease. Indeed, Tanya at her friends were in the back searching for the cheapest deals at the store. <br>\r\n<br>\r\n\"Oh heyyy bro\" Tanya says, and her friends proceed to greet you subsequently. She was with her Native friend Sami, and her Japanese friend Wendy. All 3 of them had that unattainable ideal skinny frame that is propagated by all the photos in the store. They could easily be models, and Sami was showing off her navel piercing, much to your delight. Wendy was dressed more modestly, wearing a summer dress but still looking very cute. The only time she really shows her navel off is at the beach. <br>\r\n<br>\r\n*damn, i'm a creep* you think as you ponder the belly buttons of your younger sister's friends. You aren't THAT much older than them, but you don't think it'd be very appropriate to engage anything with someone still in high school. <br>\r\n<br>\r\n\"So what brings you here?\" Sami asks you, breaking your train of thought. Sami is a beautiful girl, with tanned skin and a strong, tall frame. Her hair is long and reaches halfway down her back, she has one stud on her nostril, and gorgeous greyish blue eyes. She was wearing sandals that show off her long, slender toes, and a long skirt with a crop top. You've often thought about asking her out, but again you think it'd be annoying dating someone under the drinking age since you can't take her out to a lot of places. <br>\r\n<br>\r\n\"I'm just off to the gym to test out a new formula my scientist friend has been working on.. don't worry, it's all natural\" you explain. \"It's supposed to put me in prime climbing condition. I'm not really sure how or if it works though\"<br>\r\n<br>\r\n\"Oh you're doing steroids now eh? Wouldn't want Mom knowing about that!\" Tanya teases you. \"I dare you to try it right now. Don't worry, we'll be here to take care of you in case it fucks up\" Tanya was teasing you, but part of it was a sisterly level of genuine concern. </span></div></div>",
            "created":1432761000,
            "id":1984031,
            "title":"Chillin' at the mall"
        },
        "121":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "Tanya and her friends turn around and watch you shrink.",
                "Tanya and her friends are too focused on shopping to notice you shrink."
            ],
            "content":"<div class=\"\"><div> <span>You don't wanna look like a wuss in front of your sister's friends, so you take on your sister's dare. Besides, you know you'd be safe with them if anything went wrong. <br>\r\n<br>\r\n\"Alright Tanya, here goes!\" and you chug down the formula. Your sister and her friends start laughing instinctively.<br>\r\n<br>\r\n\"I'm really interested in seeing if it works!\" Wendy says to everyone.<br>\r\n<br>\r\n\"Yeah well, I wanted to try on a few of these shirts before we go. Do you guys see anything you like?\" Tanya asks her friends, and they all turn away from you to look at the clothing.<br>\r\n<br>\r\nSuddenly, you start to feel your body tense up. You think it's just your muscles hardening, similar to Creatine, and you hope it's more effective than that. However, the pain increases to an unbearable level. You try and scream out, but your throat starts filling up with thick orange liquid and coming out of your mouth to cover your body. It moves over your clothes, and starts to harden all around you.</span></div></div>",
            "created":1432761420,
            "id":1984036,
            "title":"The shrinking begins!"
        },
        "1211":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "\"I found Walt. Here he is!\" Wendy shows you to the two girls.",
                "\"No, nothing\" Wendy wipes you on her dress near her stomach."
            ],
            "content":"<div class=\"\"><div> <span>Sami is well aware of your belly button fetish, so she had that in mind when picking out her shirt. She measured it against her crop top, and found it came up a bit higher and would show off more of her stomach. <br>\r\n<br>\r\n*walt would go crazy if he saw me in this* she thought. She thinks your fetish is really cute, so she loves to tease you whenever she can. <br>\r\n<br>\r\n\"Hey Walt, what do you think of thi-OHMiGOD!\" Sami yelped as she turned around to see the grotesque sight of your body covered in the hard orange goop. Her reaction caused Tanya and Wendy to spin around and see too.<br>\r\n<br>\r\n\"Oh shit Walt, what the fuck is going on?\" Tanya says, clearly panicked. The liquid compresses your unconscious body and begins to reduce it rapidly in size.<br>\r\n<br>\r\n\"It looks like... he's shrinking!?\" Wendy exclaims, as you shrink so fast that you seemingly disappear.<br>\r\n<br>\r\n\"Fuck... did he vanish? Did that shit... kill my brother?\" Tanya said, tears beginning to well up in her eyes. A few of her tears fall onto the floor before she buried her face in Sami's shoulder.<br>\r\n<br>\r\n\"I can't believe this is happening! I'm gonna kill that fat bitch!\" Tanya cries muffled through Sami's sleeve. Sami put her hand on Tanya's back and pet her to console her.<br>\r\n<br>\r\nWendy, who seems unfettered, bends down to take a look at the ground. She can barely make out something floating in Tanya's fallen tears, but she gets lower to the ground and puts her face right up to it. She almost gasps, but held her mouth shut before doing so. <br>\r\n<br>\r\nYou awaken with a jolt, soaking wet and floating in a huge pool of salt water. The last thing you recall is being imprisoned in a hard orange gelatin that felt like it was going to kill you, like some kind of alien life form. You look above you, and the sun burns brightly in the sky, but you notice that you are not outside so it can't be the sun. It is the biggest overhead lamp you have ever seen in your life. You turn around and look behind you, and almost become unconscious again at the sight. Above you are three giant teenage goddesses, and the pool you are floating in is likely the tears of your monolitic weeping sister above you. Even floating atop this teardrop, you are not even level with their shoes, being small enough that the soles tower over you. <br>\r\n<br>\r\nSuddenly, you see one of them move, and you recognize that she is leaning in to look for you; they must have seen you shrink! As the moon-like face approaches, you recognize that it is the face of Wendy, the cute and modest Japanese girl. Her face leans in so close that your entire view is eclipsed by her gigantic eye, which widens as her iris meets your frame. It was a surreal but invigorating sight, a tiny movement like an eye focusing on something looking so epic and grandiose. Suddenly, you were very excited about your current predicament. Imagine how girl's belly buttons would look at this size! You could build a house in one and live in it without the girl even finding out. You could climb her abs like a cliff face. You started thinking about Sami's stomach, and how her body would look so gorgeous amplified at your scale. <br>\r\n<br>\r\nYou eardrums almost shatter as you hear the sound of Wendy holding in a gasp so close to you. She then reaches her building-sized index finger toward you, and the teardrop you're attached to sticks to it like a suction cup, carrying you with it. You expect to feel sick as Wendy rises up, but you actually feel amazing! Your body feels primed for an intense workout, and you realize that the formula actually works, albiet with a ridiculous side effect.<br>\r\n<br>\r\nWendy then turns to her friends, with Walt on her finger, but she hovers her hand around their waistlines, out of their line of sight. From your view, you can see the massive, dark wall of your sister's exposed midriff directly above you. Her navel is very soft and deep, you used to play with it when you were both kids but stopped when you were older as it is obviously pretty awkward. Still, you wouldn't mind exploring her cute body at this scale.<br>\r\n<br>\r\nOff to the side, you see the incredible sight of Sami's belly. Her navel is awe-inspiring, so beautiful and long, just like the rest of her. Her piercing hangs around the hood of her navel, a simple metal bar adorned with a blue jewel. You almost had an orgasm right then and there, and you could feel the effects of the drug amplify your erotic imagination. You wanted so bad to climb her stomach and spend some time inside that navel! <br>\r\n<br>\r\nHowever, your fate was literally in the hands of Wendy. While she is cute, she has seen you now and probably wouldn't want you crawling all around her body due to her modesty. Still, her dress looked thin enough that you could fit through the threads of the fabric... <br>\r\n<br>\r\n*okay, i know Sami would enjoy tiny me in her navel, but i shouldn't think that about Wendy...* you surmise, and you try to stay focused on your current situation. You were sure Wendy would alert the others of your presence.<br>\r\n<br>\r\n\"Wendy, did you see something on the ground?\" Sami asks.</span></div></div>",
            "created":1432765320,
            "id":1984061,
            "title":"The Triforce"
        },
        "12111":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "\"Not a chance, he's coming with me\" You go with her and Wendy.",
                "\"Fine, just meet us there later\" You stay at the store with Sami for a while."
            ],
            "content":"<div class=\"\"><div> <span>Sami looks at Wendy's finger and sees an incredibly small black speck, barely a millimetre in height, floating in the teardrop. Sami leans in further, and history repeats itself as she holds in a gasp. Unfortunately, she does not cover her mouth fast enough and you are sucked in, landing right on her tongue.<br>\r\n<br>\r\n\"Ohmigosh, it's Walt, and he really did shrink!\" Sami explains. In her mouth, you can't make out the words she's saying as they are so loud that it SHOULD be blowing your eardrums off. You get flung around and squeezed into her tongue as she talks, and for the first time you start actually feeling like you're in danger. You wanted to explore Sami's stomach from the OUTSIDE, not inside! You know that these chemicals enhancing your body probably wouldn't hold up against stomach acid either. Her mouth closes briefly, and your entire environment darkens around you. <br>\r\n<br>\r\nOutside, Tanya leans in to look at Wendy's finger. \"Umm... I don't see anything\" she tells her, and Wendy brings her extended digit back close to her own eye. <br>\r\n<br>\r\n\"Oh dear... Sami, I think when you gasped, you sucked him into your mouth. I almost did that too\" Wendy says nonchalantly. Somehow, she seems rather calm despite the severity of what could happen to you.<br>\r\n<br>\r\nTanya's expression changes from sadness to passionate anger. \"FUCK! Spit him out Sami! Spit him out!\" and Tanya grabs Sami's shoulder and starts shaking her.<br>\r\n<br>\r\nSami, without saying a word, tries to feel for you in her mouth. You feel the surface you are on become stiff, and light pours in as she extends her tongue out of her mouth with you on it. You immediately sprint to the tip, feeling massive vibrations as Sami tries to resist giggling from the ticklish sensation this causes. You look upward and see the flushed face of your sister, and the relaxed expression of Wendy, and you hold your arms out in triumph. You see your sister's expression change as she finally recognizes that you are safe.<br>\r\n<br>\r\n\"Walt, don't fucking take a dare from me ever again!\" she exclaims, angry but relieved. \"Sami, hold out your hand so he can jump on\"<br>\r\n<br>\r\nSami then held her palm up under her tongue, and you jump off it. Even with her tongue basically on her hand, it's still a massive dive for you. Thankfully, the surface of her hand is very soft, so you land safely. Sami closes her mouth and extends her palm near her and her friend's faces.<br>\r\n<br>\r\n\"Wow, this is amazing\" Wendy says. \"It seems like his body can resist a lot more because of his size\".<br>\r\n<br>\r\n\"Whatever, as long as he's safe and he's not stuck like this\" Tanya replies. \"Bro, did your phone shrink with you? Try sending me a text to let me know you're ok!\"<br>\r\n<br>\r\nYou curse yourself for not thinking of that earlier. Of course you could have just texted them... but wait, you woke up in a pool of water. As you suspected, your phone was full of water and broken. You stood on Sami's palm and hoped one of them would figure that out.<br>\r\n<br>\r\nFinally after about a minute of waiting, Wendy explained \"Oh, his phone is probably too wet. When you were crying the drops landed on him and he got stuck in it. That's actually how I was able to find him\"<br>\r\n<br>\r\nTanya sighed. \"Oh well, I guess we'll just have to trust that he's not hurt. It also looks like we'll be babysitting him all day until this wears off\"<br>\r\n<br>\r\nSami seemed pretty excited by the idea of a tiny, superpowered you. \"Um, I'll take care of him here if you guys want to go ahead to the tattoo parlour so you can get your belly button ring Tanya\"<br>\r\n<br>\r\nTanya replies,</span></div></div>",
            "created":1432767240,
            "id":1984072,
            "title":"Found by the giantesses."
        },
        "121111":{
            "choices":[
                "Tanya gets her and Walt's lemonade, then proceeds to the tattoo parlour.",
                "Walt inquires Sami's intentions."
            ],
            "content":"<div class=\"\"><div> <span>           With that, you and the girls start walking toward the tattoo parlor. Well, you're not walking. Tanya is carrying you in her hand. You take note of how soft your sister's hand is. You could fall asleep on it, it is so soft. You are glad your sister is here to take care of you. Tanya is holding you about five inches away from her breasts, mountainous things which bounce and sway profoundly, compressed inside her scarlet red shirt. You are hypnotized by their movements which, with you being so small and so close to them, give off a low, rumbling, but not unpleasant sort of earthquake sound. You are startled out of your trans fixation by the voice of Wendy.<br>\r\n           \"Hey Walt, you alright there?\" Wendy asks, smiling down at you. Embarrassed as you are, you still take note of how cute it is that Wendy's grasp of the American dialect, though quite strong, still contains faint verbal traces of her Japanese mannerisms.<br>\r\n           \"Oh! What?\" you say, startled.<br>\r\n           \"We're talking about you here,\" Tanya says, \"Keep up with the conversation.\" Your racing heart begins to slow.<br>\r\n           \"Oh, yeah, right. Sorry about that,\" you say, meaning it.<br>\r\n           \"What were you looking at there, guy?\" Wendy asks gently. You look at Wendy, then up at Tanya. You can not see them very well past her breasts, but the look in Tanya's eyes, you think, suggests reproach. As if she might have noticed what you were staring intently at a minute ago. All of their eyes are upon you now. Your mouth locks and your brain frantically searches for something to say. Something other than the truth. <br>\r\n           \"I saw a lemonade stand a ways back and I could really go for some,\" you manage flatly. The eyes and faces of the girls don't change or decrease their intensity at this answer. \"I'm, uh, kinda thirsty,\" you add in addendum. After a few more seconds of uncomfortable silence, someone speaks.<br>\r\n           \"You want to <i>drink</i> a cup of lemonade?... At your size, you could <i>swim</i> in it,\" says Wendy, her voice rising upward in an \"ooh, how cute!\" inflection.<br>\r\n           You smile and say back, \"I was kinda thinking I might try do that too.\" Wendy and Sami both laugh. Their laughter clears the air of its previous awkward claustrophobia. Even Tanya is at least chuckling; although her eyes, for a brief moment, take on an expression that seems to say, \"Good save.\" \"In fact,\" you say to the girls, \"while I'm this size, I think I might wanna try a bunch of things. Y'know. Experiment! Try and find out what's possible at this size.\" At this, you quickly notice Sami out of the corner of your eye. You can't be sure, but you think she might have flashed you a suggestive little smile.<br>\r\n\"Yeah,\" says Wendy, instantly diverting your attention away from Sami, \"since you're so small, you could live in a house of cards, or fly with a parachute napkin, or ride the inside of a straw like a waterslide down into a cup of lemonade.\" Wendy seems to be getting very excited about the possibilities.<br>\r\n           \"How would I get back out?\" you ask hypothetically. Wendy's cute beige face leans in toward you extremely close. Her giantess lips struggle to hold back a monstrous case of the giggles.<br>\r\n\"We would suck you back up,\" she says, exhilarated, \"just like this!\" Wendy begins to make rapid, giddy kissing noises. Each quick pucker from her divine lips releases a perfume-like puff of breath directly into your face. Your flesh breaks out in goosebumps, your eyelids flutter, and your pants begin to tighten at this display of killer teenage girl cuteness. Tanya suddenly eases Wendy's face away from her hand. Wendy's mock-kissing, which was heart-stoppingly beautiful and enormous to you, must have been slightly annoying and a tad bit unwelcome to her. <br>\r\n           \"Well, let's just keep it to lemonade for now,\" Tanya says maturely. \"Besides, I could kind of go for a lemonade myself.\" You all head toward the nearest lemonade stand up ahead. Tanya's been holding you in the same protective spot, close to her chest, <br>\r\nfor the whole walk thus far, but while fiddling in her pocket for change with her free hand, the hand the holds you instinctively begins to drift down to her side. As her hand lowers, so does your line of sight. Before, you could only see the breasts and heads of most of these girls. Now, you could see nothing but their lower torsos and the tops of their pants. You find yourself low enough to have a perfect view of the side of your sister's exposed belly. You're so close to it, you can almost touch it. Does she know that she's let you drift down this far? Clearly not. You can see the side of your sister's belly in splendid, intricate detail. The vaguely rough, but still brown and beautiful texture. The tantalizing little white hairs that stick out from her follicles in points along her frame. The way her jeans hug the contour of her body perfectly, without squeezing her stomach or causing even the slightest trace of fat, if she had any, to bulge out from it. And the gorgeous view of the tall, waterfall length of her side that rises up high above you, disappearing into the dark recesses underneath her cute, flowing red belly shirt. You wish, more than anything, that you could see the front of it too. The front is where her belly button was. Suddenly the significance of this thought begins to dawn on you.<br>\r\n           \"Her belly button,\" you think to yourself, \"My sister's belly button. Tanya. My little sister. Her belly button. The one that I've admired, along with several others, for so long. Every morning, I would see her walk out the door for school. She was always wearing some kind of shirt that showed off her belly and her belly button. A crop top, a tummy jacket, even a belly dancer outfit for Halloween once.\" You think to yourself that belly pride sure runs deep in your family. Your mother has it and so does your sister. In those wonderful little mornings, she usually skipped breakfast and just left, but occasionally, she would see fit to grace you with her presence. She would sit next to you, eating cereal or toast. And you would never say much to her in those moments, but you would be still and glance down at her bare belly from time to time. Only for a moment or two at a time though.<br>\r\n           But there was this one morning where you found yourself staring at it for what seemed like a long time. You remember that morning very vividly. She was wearing a white long-sleeve shirt with black stripes running across it. It reminded you of a piece of a stereotypical French clothing. She was so beautiful, even in groggy early mornings like these. And on this morning, instead of merely <i>glancing</i> at her belly, you <i>watched</i> it. You watched it for a long time. You got to see that beautiful tan tummy flesh breathe. Gently rising and falling, easing in and easing out, with every sweet breath she took. So slow and subtle. So controlled. You felt like your breathing was matching hers. She was eating cereal. Cheerios, you think it was. The internal mechanisms of her heart and body were the sole captivators of your ears. And so you could hear, with clear, focused attention, the soft crunching of her teeth against the cereal. The orgasmic, calculated swallow as the food entered her esophagus. And the sweet, satisfied, gurgling contentment of her stomach as the food filled it, to be digested and become a part of that beautiful belly forever. You swear you can faintly <i>see</i> the soft, sensitive skin of her tasty tummy ripple with the impact of the mushy cereal chunks into the sweet, warm cradle of her stomach. You wondered what it would be like to press your ear into your little sister's tummy. You would hear the ocean. Or something like it. Something low and rolling and comforting that would sooth your mind. And though you would feel like your head was being rocked into gentle bliss by the waves of some soft, warm tide, you would know that the rocking you felt was just your sister's breathing; and that the soft silky warmth of her loving tummy was deeper and more wonderful than any current on the most relaxing sea. And as deep and wonderful and lovely as her untamable tummy was, you know that your sister would keep you close and keep you safe. She would not let you drown in it... And yet, maybe you wanted to it. Maybe some part of you wanted to hold your breath, plunge your face into the dark, all-compassing abyss of that heavenly belly flesh, and never re-surface again. To sink willingly into that beautiful, young ocean of vitality and love, and become one with it, for all eternity.<br>\r\n           So, in much this fashion, you stared. You stared at Tanya's exposed belly intently and for a long time. So long that you didn't stop staring until nearly a half-hour had passed. Did you ever take little breaks in between this watch, every once in a while, just to make sure she wasn't noticing you noticing her? You don't think so, and if you did, you can't remember. And did she notice? If so, she never said anything. Your initial feeling of having gotten away with it unnoticed in the first place was founded upon your rationalization that she was too intensely focused on eating breakfast to notice you or anything else. Because after all, if she actually <i>had</i> noticed you, she would have said immediately said something to you about it, right? Right?!<br>\r\n           You snap awake from your thoughts and memories. It has been no more than a few seconds. Above you, Tanya still does business with the man at the lemonade stand. You look around at the abdomens (because what else it there to see at this height?) of the rest of Tanya's friends. All stand motionless and preoccupied, except for one. A finger traces a heart around the exposed belly button of the green croptop-sporting tummy it belongs to. The tummy seems to know that you are gazing at it, and the finger gives you a little wave of acknowledgement. The finger bares the fire-orange coloring of Sami's favorite fingernail polish.   <br>\r\n  </span></div></div>",
            "created":1459494240,
            "id":2125939,
            "title":"Lemonade and Memories"
        },
        "121112":{
            "choices":[
                "Sami takes a detour.",
                "Sami and Walt quickly rejoin with the group."
            ],
            "content":"<div class=\"\"><div> <span>           Tanya carefully holds her outstretched hand out next to Sami's and gently tips you into it. The skin on Sami's lightly-tanned hand is soft and taut. You look up at Sami curiously, but you can't see her face because it is obstructed by her chin far above you. Tanya looks back at you once before disappearing down the escalator with the rest of the girls. You try to make out the expression on Sami's face as she continues to stand motionless for about ten whole seconds. Then Sami's fingers, slow and determined begin to curl over you like an ocean wave. The light leaves your eyes as the five great black silhouettes of her fingers come together. In the darkness, you feel her clutch on your tiny body, firm but not choking. You also feel her hand begin to move. When she unclutches her fist, you are staring directly into Sami's big, beautiful face. Her eyes are black and shining. Her nose, despite being much larger than you now, still retains that cute \"small\" quality you always saw in it. Her lips are full and red, and in between them are beautiful, straight white teeth which present themselves to you in a giddy little smile.<br>\r\n           \"Well hello there, little Walt,\" Sami says to you. Her voice is soft and transfixing. There are a few scattered freckles on each of her beautiful cheeks. They move up and down with the muscles in her face.<br>\r\n           \"Hi, Sami,\" you say in a voice too stunned to convey any sort of emotion. She moves you toward her mouth, which transforms from a toothy smile to a pucker. You are gently pressed into the force of Sami's hot, wet kiss. Your eyes see only the red, candy texture of those sexy, wet lips. Your thoughts run wild.<br>\r\n           \"I'm kissing Sami Stevens. My little sister's 18-year-old high school friend. The one who always wears the cutest belly shirts. She's kissing me. Really kissing me. At this size, she may as well be <i>eating</i> me,\" you think. Sami pulls you out of her mouth and back up to her face again. For a moment, you two stare at each other, both delighted to be in one another's company. Her eyes dart down for a brief instant, and when they dart back up to meet your gaze, they are filled with the light one has when thinking of a brilliant idea.<br>\r\n           She begins to lower you downwards. On your way down, you take unbridled notice of her pretty neck and firm breasts. Then, for a moment, your vision is filled with nothing but the descending teal of her lovely teal crop top.<br>\r\n           \"Ya like what'cha see?\" she asks. You nod. She chuckles. At last, your cottony blue-green visage becomes one of beautiful brownish-tan tummy skin. She stops you right in front of her big, black deep, beckoning belly button. You stare directly into it. It is positively gorgeous. You can think of nothing you would like more than to go inside it.<br>\r\n           \"I wore this for you, Walt,\" the beautiful belly button's owner says lovingly. \"Everytime you, Tanya and all of us hang out, I always make sure to wear an extra cute belly shirt to show off my tummy for you.\" You pause to actually look up into Sami's face. She's staring directly down at you, as if she were examining an insect... a very adorable insect. Her dark, shiny hair dangles and sways gracefully above you.<br>\r\n           \"You do?\" you ask.<br>\r\n           \"Mmhmm,\" she hums. \"I don't know about the others. We're all teenage girls, so wearing belly shirts is just kinda what we do. But I can tell you for a fact that I don't just wear them because I have them. I wear them whenever I know you're gonna be around.\"<br>\r\n           \"That's... I really appreciate that, Sami. Thank you. I never knew that it was intentional,\" you say.<br>\r\n           \"Oh, it's been intentional for a long time now, Walt. I've known for a while that you have a belly button fetish.\"<br>\r\n           \"You have?... How?\" you ask, surprised but kind of knowing the answer already.<br>\r\n           \"I've lost count of how many times I've seen you glance down at my stomach,\" she laughs. \"In the beginning, I thought it was just a weird tick or something, but after noticing you did it A LOT, I began to suspect there was something to it. Since I've been wearing them regularly, I've lost count of how many times you do this.\"<br>\r\n           \"I guess I could've been a little more conservative, or at least more inconspicuous, about my glancing,\" you admit sheepishly. \"And you don't mind it?\" you ask, staring directly up into Sami's beautiful black eyes?<br>\r\n           \"Do I mind it?\" she asks. She lifts her head and laughs wildly. She places you on the soft tan section of tummy flesh directly between her pink, studded belt buckle and her deep, cavernous navel. She lowers her hands down toward her belly and points two blue well-manicured fingers toward her belly button. It's as if they were signs to a carnival ride saying \"RIGHT THIS WAY!\"<br>\r\n           \"Get up inside this belly button, right now, man,\" Sami demands in a mock-thuggish voice. Your shocked gaze fixes upon her navel, but your muscles lock up tight. \"Come on, go inside, check it out, dude,\" she says in her regular voice. You're still trying to wrap your mind around what she's giving you permission to do. You just sit there, still staring. \"Walt, come on, do I have to force you in there? I know you won't mind that, and neither will I, but still, last chance, Walt. You gonna stand up and climb into it?\" You simply look up at her, dumbfounded.<br>\r\n           \"Uh...,\" you manage to say. She chuckles. Her belly quivers a little.<br>\r\n           \"Jesus, Walt. Why you gotta be so polite? Be a good boy and get in mah belleh!\" she says in a pretend-frustrated voice, with a poor imitation of Fat Bastard from the Austin Powers movies at the end of her sentence. She snatches you by the shirt and picks you up with her long blue fingernails. She adjusts her body posture, slouching into the bench that she it sitting on. Her tummy pudges out just a little bit. She looks the way you imagine she might if she were sitting at home on the couch, eating a bag of chips in her underwear, picking broken bits of chip off the bare brown surface of her sexy belly and popping them into her mouth. Her belly button is opened slightly wider by the shifting and slouching of her tummy muscles beneath, and looks more hungry and welcoming than ever. She presses you into the gaping darkness of her belly button with her index finger, middle finger, and just about a quarter of her thumb as well.<br>\r\n           \"Jesus, she can fit a lot of fingers in there,\" you think as your nostrils fill with the faint, but pungent scent of her unwashed tummy hole. \"I wonder if she's practiced seeing how many she can get.\" The fingers let go of you and exit the navel, but they don't leave her tummy. Instead, they stretch out horizontally and barricade the entrance to her belly button. Small, but significant rays of light, enough for you to be able to see, enter and fill your abdominal chamber from between the fingers.<br>\r\n           \"Well, Walt, I'm not letting you out until you've pleasured both me and yourself for at least a few minutes. For now, you are my belly button slave and I have trapped you inside the mouth of my taut teenage tummy,\" she says playfully, in a booming (well, at least it seems booming to you) godlike voice. \"This was always to be your fate, Walt. From the moment I caught you laying your foolish mortal eyes upon my forbidden goddess body, I knew that I would have my way with you. I would ensnare you with the very part of me that you fetishize. While I have you inside me, you will make use of your time. Begin the coveting mortal!\" she finishes.<br>\r\n           You immediately fall to the ground, onto the soft, delicate, lint-speckled skin of your goddess's belly button. You begin to kiss uncontrollably. Your face presses deeply into the intricate, pink folds. Your vision is blind to everything but the absorbing, loving pillowy softness of Sami's belly button. Your lungs fill with the smell of this young girl's tummy. Inside your pants, you feel your penis growing, pressingly smoothly into the hot, sweet-smelling flesh. You can hear Sami begin to laugh ticklishly. Her laughter, young and wild and womanly, echoes throughout your prison, and her stomach jostles you all around. You feel suddenly overwhelmed. So much flesh in this wonderful cathedral to kiss and caress, lick and bite, grab and squeeze. And outside, sandwiched between a long, draping black skirt and a hot blue-green crop-top shirt, a literal universe of sexy, tan, living, breathing girl tummy flesh that writhed and waited anxiously for your lusting touch. You could never get to it all. It would take you a million orgasms of hot, passionate attention to detail to cover every square inch, every square mile, of this beautiful behemoth of a girl that the angels called Sami. For the clearest spasm of a moment, Sami's body seems profoundly unconquerable. And in an even briefer spasm, you realize, to tell the truth, that you very much liked it that way. Then, all at once, sweet release. Your brain begins to drain of excess excitement and you sigh with relief. You can hear Sami's soft, but rumbling voice sigh too.<br>\r\n           \"Was she as pleasured by this as much as I was?\" you wonder. \"Well, how was that?\" you ask your goddess. Silence for a stone-cold moment. Then she speaks.<br>\r\n           \"Fun,\" she says simply. You can't see her face, but you imagine she's smiling wide and her eyes are filled with exhilaration. She takes her fingers off her belly button and stands up. \"Let's go meet up with the others, Walt,\" she says.<br>\r\n           \"Okay,\" you say, and Sami begins walking toward the escalator, carrying you, safe and warm and relaxed, inside her belly button. On the way, she stops at the Jamba Juice stand. As she sips the smoothie, you can hear ever nuance of the thick fluid being sucked up into her mouth and swallowed down into the depths of her beautiful, sexy tummy. At one point, she utters a large burp that fills your ears like a rocket blasting off for space. You both laugh hard at this.</span></div></div>",
            "created":1458712800,
            "id":2121510,
            "title":"Inside Sami's Belly Button"
        },
        "12112":{
            "choices":[
                "\"No, we'd better go back to the group.\"",
                "\"I'd really like to go in your mouth.\""
            ],
            "content":"<div class=\"\"><div> <span>           \"Hey listen, I gotta go to the bathroom,\" Wendy says. \"I'll be right back.\"<br>\r\n           \"Okay. We're gonna go find Madeline,\" says one of Tanya's friends. \"In the meantime, Sami, you stay here and see if you can find Walt. We'll be back.\"<br>\r\n           \"Got'cha,\" says Sami. The girls head toward the escalator, all feverishly trying to console Tanya. Wendy heads in the opposite direction with you clinging fearfully to her silky pink dress. You look back at Sam, who is watching you both leave with a somewhat curious look on her face. She obviously can't see you, so she must have been making that face about Wendy.<br>\r\n           Wendy turns a corner and heads into the girls bathroom. There is nobody else in there. You are scooped into her delicate little hand (which isn't so little anymore). Your ass sinks a little bit into its softness as she carefully lifts you up to her face level. Her eyes are big and black and beautiful. So sensitive and full of genuine concern. You feel almost sorry to look into such lovely gentle eyes.<br>\r\n           \"Are you okay, Walt?\" she asks.<br>\r\n           \"Don't worry, Wendy. I'm A-OK,\" you say reassuringly.<br>\r\n           \"Are you sure?\" she asks. Her voice is so sweet.<br>\r\n           \"Yes, I promise you. I'm completely fine.\"<br>\r\n           \"This is going to wear off, isn't it?\"<br>\r\n           \"Yes. Most likely after a day or two.\"<br>\r\n           \"Good,\" she coos, and the intense worry leaves her eyes. <br>\r\n           \"Your sister will be glad to know that you're okay\" she says.<br>\r\n           \"Yeah, she will. We should go and tell her I'm not dead. What are we doing in the bathroom?\" She pauses a moment.<br>\r\n           \"If, um, if it's alright with you, Walt. I'd kind of like to hold back on that for a few minutes.\"<br>\r\n           \"What do you mean, Wendy?\"<br>\r\n           \"Well, if I tell everybody that you're unharmed right this minute, we won't have anytime to be alone together.\" She flashes you a very petite little smile.<br>\r\n           \"What are you gonna do with me?\" you ask. You are a little bit hesitant to do anything other than calling your sister right away, but you are reminded of a couple minutes ago, when you were on Wendy's finger and saw everyone's stomachs from waist height. You are kind of turned on right now. You are willing to humor her for a few minutes.<br>\r\n           \"Whatever you want,\" she says, squinting her eyes like a huntress locking in on its prey. \"But honestly, I have an idea of what your first choice might be.\" With her free hand, she slowly lifts up her dress. Under that soft pink cloth is revealed Wendy's thin, sexy belly button. You are awed by its beauty. \"I know that you like belly buttons very much, Walt.\"<br>\r\n           \"How did you know that?\" you ask. She shrugs.<br>\r\n           \"I'm pretty observant. I catch you glancing down at all our stomachs whenever we all get together and hang out. Everybody wears crop tops and belly shirts except me, because my folks down allow me to wear those kinds of clothes. But if you ever wanted to get a rare glimpse of my navel, I think now would be the time to do it.\" She slowly brings you to her lips. They are pink and healthy. She smiles, revealing a set of perfect white teeth.<br>\r\n           \"You know what the Japanese word for 'belly button' is, Walt?\" she whispers.<br>\r\n           \"No,\" you say.<br>\r\n           \"Heso,\" she whispers. \"Isn't that a pretty word?\" You like watching her lips form the word, and you like the shape her lips make when she holds on the \"o\" part at the end of this word. It looks like they are puckering for a kiss. \"Say it with me, Walt.\"<br>\r\n           \"Heso,\" you say together. You feel her gentle breath on her skin as she utters the word, and you stare deeply into the soft gentle lips as they move around to form the syllables.<br>\r\n           \"Would you like to go inside my belly button, Walt?\" she asks in a bubbly voice.<br>\r\n           \"Absolutely, Wendy,\" you say without hesitation. She quickly presses you into her large, petite lips and engulfs you in a sweet, but brisk little kiss. She laughs in a way that almost sounds like a little kid hiccuping. It's adorable. \"Your lips are very soft,\" you admit to her. She smiles at you.<br>\r\n           \"You think my lips are soft? Wait 'til you feel my tummy,\" she says slyly. She lowers you down to her the first inch of exposed torso area, just underneath her small breasts. She slowly curls her hand into a gentle fist and clutches you comfortably inside it. \"She holds you so close to her stomach flesh that your head is pressed against it. She speaks, and you can feel her words vibrate through her beautiful body as she does so. \"Your Japanese goddess demands that you compliment her tummy with kisses. May you, mere mortal, take delight in the privilege to be so close to the sacred flesh that is my body. And may you find peace and happiness inside the warm, safe haven of my belly button.\" She laughs and then begins sliding you all the way down the length of her bare belly with you pressed firmly against it. You reach out your arms and hug the sexy soft stomach skin as it slides past you. You press your face into Wendy's beautiful belly and your field of vision is engulfed in her creamy beige tummy flesh. You frantically kiss her stomach. This beautiful, young, shy Japanese girl has graciously allowed you to not only see her belly, but actually go inside her belly button. And she knew about your fetish all along. Why didn't she tell you? Soft little belly hairs grace your face you continue you to kiss down the wall of her stomach. The lower you go, the softer the skin gets. You stop kissing at one point and just let your face rest, buried in her comfortable pillow skin as you are dragged down further. You notice that her tummy smells really nice. Like lavender. You vaguely wonder what kind of body soap she uses.<br>\r\n           \"After about a minute, you are finally at her belly button. It is even more beautiful and sexy up close. So many fantastic little details: the little hairs around and inside the navel, the way the skin inside kind of seems to fold in on itself in elaborate patterns, an almost cherry-ish smell emanating from it.<br>\r\n           \"Well, in you go, little guy\" Wendy says. She chuckles and then gently puts you inside. It's not very roomy. The walls of her belly button are almost kind of smooshing you together, but you can breathe just fine and it feels very sensual and safe. You start kissing one of the navel walls. The skin inside of here is even softer and (weirdly enough) tastier than the skin on the outside of her tummy. \"Comfy in there?\" Wendy asks. She shakes her hips from side to side a couple of times, almost as if trying to adjust <i>herself</i> to the fact that you're in there.<br>\r\n           \"YES!\" you scream from inside her.<br>\r\n           \"Well then hang on tight, my little belly button boy. We're gonna go back to the girls.\" The entrance to her navel is suddenly covered by a slightly-transparent curtain of bright pink as she lets her dress fall back down of her tummy. \"I know it's not a belly shirt, but ya gotta admit, Walt. It's still pretty cute, isn't it.\" You hadn't really thought so initially, but now, being inside Wendy's belly button and seeing the world through the haze of silky pinkness, you think it looks more than cute. It's absolutely fantastic. \"You have to say anything, Walt. I know you agree.\" She laughs a petite little Japanese girl laugh and it causes her belly to quake slightly. You tremble momentarily between the soft sexy walls of Wendy's tummy hole. She starts walking toward the bathroom door. It feels so nice to be inside her cute little belly button, feeling the slight bounces and quivers of her tummy as she walks. It is heaven. Suddenly, she stops walking.<br>\r\n           \"Unless, of course, maybe you'd wanna fool around a little bit more.\" You don't say anything, but she takes it that you are listening curiously. Which, in fact, you are. \"I can put you in a different part of me if you'd like. Maybe my mouth? You seemed to like that quite a bit too.\" She giggles again. Her laugh is really nice sounding. You actually wouldn't mind being inside that mouth while it giggles. You wouldn't it one bit. But also, there is your sister and her friends to think about. You and Wendy have only been gone for about five minutes, but she's still probably freaking out all the same. It might be a good idea to go tell her that you're alive. But then again, you have a cellphone, don't you? Couldn't you just call her and assure her that you're all right? If you did that, she'd obviously know that you were alive. And if she asked you where you were, you'd tell her not to worry about it because you're okay. And then, you'd have all of the time in the world to hang out some more with Wendy. Just you and her. Alone. Tempting. Very tempting.<br>\r\n<br>\r\n           What do you say to Wendy?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1443680100,
            "id":2042109,
            "title":"Walt and Wendy"
        },
        "1212":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Go home with Steph Tsunade",
                "You both stay at the mall",
                "Other options?"
            ],
            "content":"<div class=\"\"><div> <span>You disappear under a mound of clothes as they collapse like a tent around you, as the orange liquid hardens, it creates an effect of reverse-pull and shrinks you down to 1 mm tall. You squeak and start to run, but then you see a spacious white sneaker stomp in front of you as it seems a passer by seems to have noticed your shrinking. You feel soft hands pick you up as you hear a soft murmur and a shift of purple spectacles as the owner of the voice says, \"Oh my, and what have we here?\" In reply you turn towards a young lady with a pudgy gut, a sloppy ponytail with black hair and brown eyes. \"Hmm, what are you anyway, an ant? My name is Steph. It seems like you're coming home with me after all, unless you would like to hang out at the mall?\" She belches momentarily before blushing.</span></div></div>",
            "created":1458393360,
            "id":2119701,
            "title":"Lost in the mall"
        },
        "12122":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Ask Steph about the shrinking potion",
                "Ask Steph about other conversation topics"
            ],
            "content":"<div class=\"\"><div> <span>You and Steph both stay at the shopping centre as you fidget nervously, Steph didn't seem to have noticed though, although you do manage to pipe up.<br>\r\n\"Hey Steph,\" You respond, \"I have a question for you,\" Steph gasped, her brown eyes widening.<br>\r\n\"What is it?\" She asks attentively</span></div></div>",
            "created":1490975280,
            "id":2297773,
            "title":"You both stay at the mall"
        },
        "13":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "\"Let's head to the mall, if this works I want to show off to Dani\"",
                "\"I'm good with testing it at school with you\"",
                "You surprise her by drinking it right in front of her!"
            ],
            "content":"<div class=\"\"><div> <span>You decide that it's probably best to have Madeline watch over the first test so that she can observe any side effects and make tweaks to the formula. You finish up your breakfast, pop some vitamins, and swing your bag over your shoulder as you head out the door. <br>\r\n<br>\r\n\"Walter, are you leaving now?\" You hear Chenise behind you, and you turn around to see that she's wiping herself off with a towel after her workout. You catch a glimpse of the towel gliding across her stomach, and you hear the clinking of her piercing as she does. She starts wiping the towel along her legs and over her feet, and you feel a bit voyeurous at how suggestive this could be as the towel is brushed along the inside of her thighs. You snap out of it so you can reply,<br>\r\n<br>\r\n\"Yeah, I'm on my way to campus to help Madeline with her new project\". You don't really want to tell your mother that you're testing out experimental drugs, so you keep it vague.<br>\r\n<br>\r\n\"Want me to give you a lift? I need to cool off after that\" Chenise asked. She drives a white convertible, so the wind on her skin would be quite refreshing. <br>\r\n<br>\r\n\"Okay, sure\" you reply, and you both walk out to the driveway. Chenise remains in her workout clothes as she often does, and she has a fuzzy plush base on her car's pedals so she can drive barefoot. She reaches into the glove box and grabs her sunglasses, which completes her look of a summer goddess. You get in the passenger seat and start to drive off.<br>\r\n<br>\r\nAlong the way, you can't help but check out your mom's body some more. Her toned legs rest against the seat as she pedals the gas, and her navel piercing jostles against the wind. Her eyes are focused on the road, so she doesn't notice your ogling. You start imagining Chenise as a mountain, picturing yourself walking across her gigantic thighs, climbing over her shorts, and going up her beautiful stomach into her belly button. It would be so much fun swinging across her piercing, and you would love the warmth and scale of being so tiny in there. Navels are so sensitive that she would probably still feel a pleasant tickle...<br>\r\n<br>\r\n\"We're here\" Chenise snaps you out of your fantasy as you pull up to the campus drop-off. \"Say hi to Madeline for me!\"<br>\r\n<br>\r\n\"No problem mom, thanks for the ride!\" you reply<br>\r\n<br>\r\n\"It's okay, good luck with your experiments, hehe!\" your mom says as she drives out of the parking lot. As you walk to the chem building, you can't help but ponder that strange fantasy again. As you are an aficionado of both female bellybuttons and mountain climbing, you thought it only made sense to try and integrate both of those interests into a sexual fantasy. But man, that's your mom! Even if you aren't blood related, that's still pretty weird to you. However, if you were as small as you imagined, she would probably never discover you. <br>\r\n<br>\r\nYou enter the lab and see the familiar sight of Madeline working away on the computer, her back facing you. <br>\r\n<br>\r\n\"It's time.\" you say in your most dramatic voice. Madeline gasps and jumps, but she immediately realizes that it's just you so she starts laughing.<br>\r\n<br>\r\n\"Hey Walt, what a surprise! Are you here to tell me about how awesome my new formula is?\" Madeline asks, relaxing in her chair and crossing her stocking-clad legs.<br>\r\n<br>\r\n\"Actually, I haven't tried it yet. I wanted to test it with you\" you explain.<br>\r\n<br>\r\n\"Aww, how thoughtful! Let me just close up some things here and we'll get started\" she replies. \"But, we need somewhere to test it. We could go to the school gym or your usual spot at the mall, it's up to you\"</span></div></div>",
            "created":1432616400,
            "id":1983493,
            "title":"Driving with Mom and Meeting Maddie"
        },
        "133":{
            "author_id":"viciousx",
            "author_name":"misterX",
            "choices":[
                "You tickle her navel, and she feels you.",
                "You tickle her navel, she does not feel you and makes her way to the gym.",
                "You realize that your cell phone shrunk with you and you can just text her."
            ],
            "content":"<div class=\"\"><div> <span>\"I think we should stick around here, since it's right by the lab\" you decide. <br>\r\n<br>\r\n\"Thank god, I hate malls and I hate the gym. They're always glaring at me. At least everyone here knows I'm a scientist\"<br>\r\n<br>\r\nYou always feel depressed whenever Maddie talks like this. You know she is a strong and confident woman, and you wish she wouldn't feel insecure about her appearance. She is a big girl, certainly, but that doesn't mean she isn't gorgeous. Even though you are often surrounded by very athletic, conventionally sexy women (not to mention being quite hunky yourself) you know better than to think that as the only ideal. Madeline's body is wonderfully curvaceous and soft, and her stockings and skirts that she wears look quite erotic to you. Even her black pumps look really sexy, despite you not being a foot guy. Her beautiful green eyes, flowing long red hair, perfect makeup, and luscious red lipstick complete her divine look. <br>\r\n<br>\r\n\"Get outta here Maddie, you're beautiful and all those people are just jealous that you can be you\" you tell her, and she smiles pensively.<br>\r\n<br>\r\n\"You're always so charming Walt, I wish more guys were as thoughtful as you\" There it is, her typical reply again. There is a brief period of silence between the two of you, before Madeline breaks it to get back to work.<br>\r\n<br>\r\n\"Alright, we should probably get a move on. I just need to use the washroom and I'll be back in a sec\", and she walks out of the room for a bit. As she does this, you pull the vial of formula out of your bag. You think to yourself that it would probably be better if you took it right away so that you won't have to sit in the gym waiting to feel its effects.<br>\r\n<br>\r\n\"Bottoms up\" you cliche, and drink the vial in full. You can hear Maddie walking back now, her pumps making loud clicks that echo through the hallway. Suddenly, those clicks start to get louder and louder, and your body starts to seize up.<br>\r\n<br>\r\n\"AHHHH, WHAT THE FUUUUUU-\" you try to shout as clear, thick orange liquid fills your throat, spills out of your mouth and begins to surround your body. You start feeling the liquid harden and constrict your breathing, until you finally pass out.<br>\r\n<br>\r\nYou awaken suddenly, and hear and feel what sounds like massive earthquakes. You rise up to look at your surroundings; you appear to be in the biggest man-made structure ever conceived. The ceiling stretches up endlessly, and the floor goes on for what looks like miles. You can see fuzzy structures in the distance, but can't really make out what they are supposed to be. And those earthquakes are getting more intense, you are finding it more difficult to keep your footing.<br>\r\n<br>\r\nYou also notice that your muscles do not feel sore, rather they feel quite pumped! Your breathing is optimal, and you feel like you could take on any mountain. Looks like Maddie's formula works... but why are you in a giant room now?<br>\r\n<br>\r\nSuddenly, as a gigantic door swings open, everything clicks. You see Maddie, very blurry in the distance, and bigger than the biggest cliffs you have ever climbed. The formula has a side effect of shrinking you to 1 millimetre tall! You start to freak out a little, but you remember that the formula is supposed to be temporary, so all you need to do is get Maddie's attention and let her know what happened.<br>\r\n<br>\r\nHowever, you are really damn small. It's gonna be difficult to get ANYONE's attention at this size, you are too small to pick up an object and signal them, and you couldn't possibly be felt anywhere on their body... unless, perhaps, you went into their belly button. The belly button is very sensitive, so enough tickling in there could signify your location. There's a very real risk of being mistaken for a flea and simply squished, but you gave Maddie the benefit of the doubt. <br>\r\n<br>\r\nMadeline approaches, and the earthquakes get larger and larger, until she appears right above you. You start to make a run for it to avoid the aircraft-carrier sized pumps, but she suddenly stops with the tip of her shoe hanging far above you. <br>\r\n<br>\r\n\"Walt? Oh I guess he already went to the gym\" you hear her loud, booming voice above you say. It's time to act. You have to admit, you were pretty excited about this plan. You were just having this fantasy about Chenise, and now you get to live it out with Madeline. Somehow this life-threatening, utterly bizarre situation has filled you with confidence. Maybe it's another side-effect of the formula.<br>\r\n<br>\r\nYou wonder how you're going to approach climbing her pump, when she does the work for you by tapping her foot a few times. Those taps were so massive to you that the shockwave flung you upward onto her stocking-clad foot. From your perspective, her stockings looked like the world's biggest climbing net. <br>\r\n<br>\r\n\"Alright, this is gonna be awesome!\" you shout to yourself, knowing nobody could possibly hear you. Even though you were an insignificant speck, you felt more powerful than ever. You run along the first thread and jump at the vertical slope that makes up her leg. High above you, Maddie has sat down at her desk to make a couple more notes before she goes to meet Walt at the gym, or so she thinks. She has no idea that a microscopic Walt is actually testing the formula right now, making his way up her calf. <br>\r\n<br>\r\nDown there, you marvel at how her legs flex and distort your environment as she sits down. Her flesh is stretching the fabric and widening the gaps between the threads, which is a sight to behold at your perspective. You contemplate simply jumping through the threads and exploring her bare legs, but that's not going to get you anywhere. Still, the flesh beneath looks very soft and inviting.<br>\r\n<br>\r\nYou continue up her calf at an alarmingly fast rate, you were full of energy and didn't want to slow down. You go over the top of her knee, and are now at the edge of her lap. You look above you in awe at her massive stomach, your destination. Currently you can kind of see her face, sternly focused on her notes, but you know that view will be eclipsed by her breasts and further her wonderfully round belly as you continue to sprint forward on top of a thread along her thigh. <br>\r\n<br>\r\nAs you approach the beginning of her skirt, you see that you are so small that you have to climb up the fringe in order to keep going. Amazing, you think, that such a small detail like that can be so different from this perspective. You mount the top of her skirt and keep running.<br>\r\n<br>\r\nMadeline seems to be taking her time with her notes; you might've been a bit frustrated by this if you were actually waiting at the gym like she thinks. You look forward and see another obstacle; a high waist on the skirt. You imagine you're gonna have to climb over the top and slide under along her belly in order to get inside her navel. <br>\r\n<br>\r\nYou are now face-to-face with her mountainous torso, being held back by the skirt but with her body coming out around the top. From this angle, you can kind of see under her shirt, and you are relieved to see that a bit of her navel is poking out from the top of the skirt. You start climbing up, and the warmth of her stomach and the gentle movements of her breathing are very relaxing, making it a pleasant climb. This mountain you are climbing, the biggest one you have ever explored, is not a mountain at all but a living breathing woman who happens to be your very attractive friend. It's very surreal, but none of your previous outings have been this inspiring.<br>\r\n<br>\r\nYou stand on the waistline of the skirt, with plenty of room to walk, and you start to make your way toward the entrance of her navel. Even with only the top visible, it towers over you like a huge cave waiting to be spelunked. Suddenly you see gigantic shadows move, and her hands starts coming toward you on both sides. Have you been discovered already? No, you see that she is adjusting her waistline... but she's going to raise it up over her belly button! In a panic, you start to spring along her waistline as it curves and contours in her grip, and as she raises it up you make a dive for her navel, breaching it just as she brings the skirt over.<br>\r\n<br>\r\nYou land with a soft thud in the very back of her navel, and you slide down to the bottom base. You sit with your legs stretched in front of you, and the warm body all around you feels softer than the most plush mattress man could make. Tiny beams of light shine through the fabric of the skirt, but it is still very dark as the entrance of the navel has been compressed by her waistline being right above it. You are so tired, and the belly button around you so comfortable, that you almost want to fall asleep here, but you remember that you need to get her attention.</span></div></div>",
            "created":1432758480,
            "id":1984012,
            "title":"Maybe not RIGHT in front of her..."
        }
    },
    "info":{
        "author_id":"viciousx",
        "author_name":"misterX",
        "brief_description":"A mysterious formula made for climbers has a side effect of shrinking them to 1mm tall.",
        "created":1349065140,
        "description":"<td align=\"left\" class=\"norm\"><b>EDIT: May 2015: </b> I decided to make some minor tweaks to the rules and characters of the story.<br>\r\n<br>\r\nThe school chemistry program has made an all-natural supplement that is made to increase grip and traction in humans. You are Walt, an adept free climber who has been given a vial of the formula in order to test its effectiveness. Unfortunately, it has a sinister side effect; it temporarily shrinks you to one millimetre tall! This creates many interesting opportunities for a guy with a navel fetish.<br>\r\n<br>\r\n<u>Characters</u><br>\r\n<b>Walt</b>, a 21 year old black college student. You're a rather attractive, tall guy with an athletic build. You were adopted by Chenise at a very young age. You're a nice guy, and girls tend to get along with you quite well, though you can be a little cocky and jovial sometimes. You're somewhat of a local celebrity, seeing as you've been sponsored to do some free climbing videos and participate in their events. You have a bit of a navel fetish, and you tend to gravitate your attention toward that area when you're checking a girl out.<br>\r\n<br>\r\n<b>Kimberly</b>, a 21 year old white college student. She's been your friend for a while, and you got her into free climbing. She has long brown hair and brown eyes, with an athletic build that outlines her abs. She has a long torso, with a narrow, cute navel that is rather deep. She usually dresses modestly, with fitted shirts and women's jeans, and doesn't show a lot of skin. She's a really friendly girl, always willing to help out. You see her at school, or at the gym.<br>\r\n<br>\r\n<b>Dani</b>, a 29 year old Asian woman. She is your mentor, and she helped you train to be the free climber that you are today. Her hair is cut short, but it still has volume. She is very athletic, with rock hard muscles and abs. Her navel is round and deep, with a blue stud right above it. She likes to wear sporty clothes that show off her midriff. She can be very intense with you, and always wants to test your skills. She has a thing for you and will be dominating with her mannerisms, often touching you or standing a bit too close. She's always at the gym, as she works there as a personal trainer.<br>\r\n<br>\r\n<b>Tanya</b>, an 18 year old black girl. She is your mom's biological daughter and your sister. She is rather skinny, and wears low-cut shirts and jeans so her midriff and hipbones are often exposed. Her navel is deep and plush on the inside, and she has always wanted to pierce a gold ring on the bottom. She likes to hang out with her friends at the mall.<br>\r\n<br>\r\n<b>Chenise</b>, a 40 year old black woman. She is your adopted mother, a semi-retired fashion/foot model who made it big and is now enjoying a comfortable life at home. She is very beautiful, and is often cited as the source of your sister's good looks. She has wavy dirty blonde hair, and her navel is deep and narrow with an ornamental gold chain piercing hanging from the bottom of it. She usually wears dresses or modest outfits that show off her curvaceous figure, and is often barefoot or in sandals to display her gorgeous feet. <br>\r\n<br>\r\n<b>Madeline</b>, a 26 year old white college student. She is the inventor of the supplement that you will be testing. She's a very intelligent, sometimes nerdy woman who works with the chemistry program at her school. She's a big girl, with a big stomach, big breasts, and big curves, and she is very beautiful. Her navel is, as you'd expect, very deep, and you might get lost or trapped if you try to enter. She wears form-fitting dresses, but is usually in a lab coat with stockings and high heels. Her hair is long and red, she has green eyes, and tends to wear red lipstick.<br>\r\n<br>\r\nA few rules:<br>\r\n<br>\r\n-Please do not write one sentence or \"choice\" chapters. Each chapter of this story should have substantial content. It doesn't have to be 6 paragraphs long, but it should be longer than just a few sentences. I hate clicking on a story with 100 chapters and 98 of those chapters are just \"how small does he shrink\" or \"where does he land\", so don't be doin' that!<br>\r\n<br>\r\n-This is a micro/navel/body exploration story, so please keep this at the main focus. You can include other fetishes, but don't turn it into a feet story for too long. Also, please no piss/scat/anal insertion.<br>\r\n<br>\r\n-Please limit interactions with family/underage characters to playful and suggestive. That means no explicit nudity or sexual interaction. Keep the overly sexual stuff to the other female characters.<br>\r\n<br>\r\n<span style=\"text-decoration:line-through\">-Walt cannot shrink or grow once he has been shrunk. He also cannot die, so chapters cannot end with him simply being crushed. Other characters can shrink/grow, but please do not turn this into a giantess story.</span> EDIT: I decided that the story wouldn't really go anywhere as it was originally written. I realize that an entire story with a guy stuck at 1mm tall is very difficult to write as interaction is essentially impossible, so I have altered the properties of the formula so that it only shrinks Walt temporarily, and I don't mind if other characters are affected by it either. <br>\r\n<br>\r\n-The formula shrinks people to 1mm tall, and they grow back to their original size when it wears off. Please do not change the properties of the formula or add other formulas, I don't want this story to get too diluted with other size-changes.<br>\r\n<br>\r\n-Feel free to add new characters whenever you like, but give a description. Also, please do not alter established characters, as I will delete those chapters.<br>\r\n<br>\r\n-Male giants are okay, but Walt is straight so please keep that in mind. <br>\r\n<br>\r\nOther than that, have fun adding to my story!</td>",
        "id":1894689,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1490975280,
        "modified":1490975280,
        "pretty_title":"The Micro Cliffs"
    }
}