{
    "chapters":{
        "1":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "invisible possesion slug",
                "ghost",
                "a specal liquid ",
                "gain the ability to swap stuff",
                "more or anthor story"
            ],
            "content":"<div class=\"\"><div> <span>your are average 16 year old boy named mike winters who currently is helping out the Librarian of the school. while looking through the books in the book storage closet you hit some hidden switch in the book shelve revealing a secret passage. being curious you walk down it  as the book shelve behind you closes. after a minute or two of walking right in front of you is a strange  pod like machine that is marked transformation machine. you step inside it to check it out accidentally activating the machine causing you to black out. what happened?    </span></div></div>",
            "created":1381813200,
            "id":1679512,
            "title":"the beggining "
        },
        "11":{
            "author_id":"pss15",
            "author_name":"Pss",
            "choices":[
                "posses the librarian",
                "go to the office",
                "go to the lunchroom",
                "go posses students or teacher",
                "more options"
            ],
            "content":"<div class=\"\"><div> <span>you start to come to when you notice you eye sight has improved slightly. also that you are smaller than you originally where before and you feel different. as you move you feel that you making a sliding motion to move. you then come upon a small puddle of water in which you check your reflection. your new appearance is some transparent worm slug thing with two small mandibles in front of you mouth. looking around you see a screen appear that say congratulations you now an alien species of slug that can take over the body of its host. see the message you started moving towards the exit pondering on who will you posses. reaching the Librarians desk you know you can ether posses her or go somewhere else. what do you do?          </span></div></div>",
            "created":1381813200,
            "id":1679514,
            "title":"invisible possesion slug"
        },
        "111":{
            "author_id":"blavcleo",
            "author_name":"Mr.nice",
            "choices":[
                "Little sis",
                "Big sis",
                "Other choice"
            ],
            "content":"<div class=\"\"><div> <span>You was slithering for hours looking for Miss.Dasiy Goldberg you was about give up until you found this hug mountain that was actually Miss.Dasiy famous huge fat black ass that every student dream about.<br>\r\n<br>\r\nYou was thinking this is it this your opportunity to possess that fine for yourself while Miss.Dasiy was reorganizing books on the bottom shelf,Her older sister came in but the only different between the two her older sister have dat ass and stacking on top with a killer e cupped<br>\r\n Breast.(missed spelled on purpose)</span></div></div>",
            "created":1409202000,
            "id":1848500,
            "title":"posses the librarian"
        },
        "1111":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "ass",
                "vagina",
                "wait."
            ],
            "content":"<div class=\"\"><div> <span>Looking up the Velvet short skirt of the Buxom librarian, you can see the white pair of underwear straining against and almost being swallowed by Ms. Daisies large ass. her supple legs soft looking legs attached. She doesn't seem to notice you as she's putting the books in order on the shelf, which to your advantage gives some times to examine the possible entry points from the current position, but it the choice will have to be quick as her older sister is roaming the book isles. You narrow it down to enter through sweet ass or going through her vagina.</span></div></div>",
            "created":1413090000,
            "id":1870606,
            "title":"Hopping the smaller of the large asses."
        },
        "11111":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Find somewhere to explore or deposses?",
                "Go talk to your \"Big sister\""
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to get to distracted with admiring Ms. Daisies ass you decide to posses her and have the ass to yourself. You think for a bit on how to get up there and the only way was to crawl up Daisies leg so with a small leap he attached to her calf and began to crawl up her leg quickly, Daisy ignorant to what is currently happening. After passing the thigh your worm like body clung to one of her large cheeks guessing to where the entrance of her asshole was as you couldn't really tell even if you used your tendrils to pry apart the cheeks. with a blind leap of faith you plunged in hitting the entrance with accuracy forcing your way in with ease with your worm like bodies natural lubricant and shape. the sudden penetration and feeling of something wiggling deep made Daisy drop the books and let's out a loud \"Eek!\" while grasping her ass trying to stop whatever is in there but it was too late she arched her back and let out a painful and pleasurable moan before you and her black out.<br>\r\n<br>\r\nYour eyes open, the familiar smell of old and new books with a mix of flowery fragrance invades your nose theres a heavy new weight on your chest and an even heavier one on your rear. you look around frantically first at your chocolate cleavage then over your shoulder to the deadly ass covered in velvet skirt. you give your new ass a good smack feeling it jiggle for seconds after the smack followed by examination of your new race and body, but what should you do?</span></div></div>",
            "created":1413090000,
            "id":1870683,
            "title":"ass"
        },
        "111111":{
            "choices":[
                "Go inside the girl's bathroom.",
                "Go inside the janitor's closet."
            ],
            "content":"<div class=\"\"><div> <span>Whether you decide to stay inside this amazing body or take off for someone else, you better move somewhere else. If Ms. Daisies' sister comes back for you, she will surely notice something off. Or at least you imagine. <br>\r\n<br>\r\nThe toilets just outside the library are a good enough place. You just need to make your way out. You slowly take a few steps forward as you have to get adjusted to your new host and her outfit. Wearing a skirt doesn't give your legs much room to move and the three inch heels don't help either, having the feeling you're walking on stilts. Not to mention your breasts; they look mighty fine to you but having these babies feels like they get pulled towards the ground. It's a wonder you get as far as the librarian desk when you feel yourself slipping. Luckily you grab hold of the table before you fall over. <br>\r\n<br>\r\nClimbing up again you take a deep breath of air using your new pair of longs and continue your way out of the library. As you step outside you finally got the hang of it, even having Ms. Daisies' hips shaking behind you. <br>\r\n<br>\r\nStanding outside you see the girl's bathroom. The perfect place to think your plan over. Though you also see the janitor's closet, that also might be a fine place. In the janitor's closet you at least know you have some privacy, but there is not much room to move.<br>\r\n<br>\r\nSo where should you go?</span></div></div>",
            "created":1497848400,
            "id":2338878,
            "title":"Find somewhere to explore or deposses?"
        },
        "1111111":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Screw it, explore Daisies body",
                "Slip on out, dealing with someone else isn't good right now."
            ],
            "content":"<div class=\"\"><div> <span>You let out a deep smokey sigh while staring down the small sign on the girls restroom door before smiling deviously. \"Hmm, this would be better than that closet, god knows how awful it smells in there?\" You say while running the smooth surface of your palm along the side of your fat laden ass cheek straining up against the skirt that had to be tight enough for Ms. Daisy to struggle with in the morning to much of your own knowledge before pushing the door open and strutting inside the small woman's restroom composed of too stalls and a single large mirror hanging over two sinks, one of which looks to be in some bad shape. But the most notable thing of the restroom was how it made your belly squirm with anxiety for being in a location you should never have access to...and yet here you're somewhere within Ms. Daisies huge fat ebony ass.<br>\r\n<br>\r\n\"Gosh this is a bit too surreal....the machine actually being a thing and me!\" *She cups her throat while strutting towards the mirror to be greeted by Ms.Daisies reflection with her mocha skinned breast on full display through her partially buttoned tucked in white blouse and her straightened hair kept up in a bun with some bobby pins and sprays her hips and belly flood over the waist of her skirt. \"And my voice is...so smooth and not crackly at all, take that puberty!\" You joke and watch her lips move to the words, reaching up and touching the red glossed plump flesh. \"So freaky....and I came in through this thing?\" You mumble and smack your own ass making the flesh wobble beneath your own palm.<br>\r\n<br>\r\n\"Just where the heck am I inside this body, I came in through her ass but what exactly happened to me?\" You ask yourself while sliding your other hand from the soft glossy surface of your lips to one of the heavy mocha skinned orbs tugging against your chest sinking those small fingers into the doughy tit as the flesh mushes and slips around withing her black bra.* \"Hmph, feels a little funny hehe, maybe I can use this time to explore a little before contemplating over whatever that machine was?\" You talk to yourself which to anyone would sound like mindless dribble as you continue to knead into your tit. Sliding your hand away to jump up and down a bit to watch the orbs, and by extension the fat around your midriff bounce about followed by a loud clack of her heels.* \"Hehe, jesus this is a litle fu-wait fuck! Daisies sister....even if I get stripped down and naked I still got to deal with her!\" <br>\r\n<br>\r\n</span></div></div>",
            "created":1498107600,
            "id":2340656,
            "title":"Go inside the girl's bathroom."
        },
        "112":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Possess Ms. Summers",
                "Look around some more",
                "Go sonewhere else"
            ],
            "content":"<div class=\"\"><div> <span>You decide to head to the office so leave the library and slither your way over to the office. When you reached the office you saw Ms. Summers the secretary sitting at her computer.<br>\r\n<br>\r\nMs. Summers ( <a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/b9/6e/07/b96e074c2119166b2c8495028a834558.jpg\" target=\"_blank\">https://i.pinimg.com/originals/b9/6e/07/...</a> )<br>\r\n<br>\r\nYou also don’t see anyone else in the immediate area. What do you do?</span></div></div>",
            "created":1552804740,
            "id":2631256,
            "title":"go to the office"
        },
        "1121":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Someone walks in ",
                "You need around more with Mrs. Summer",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>You see the Mrs. Summers is all alone for now and she did have a pretty hot body so you slither up to her mobile chair and smoothly slide up if until your so close to her that you can hear her heartbeat.<br>\r\n<br>\r\nYou slide up her dress which she feels but to her it just feels like a pesky fly that she can take car or later, it's only when you start to slide into her was that she begins to stop, \"what is the~ OHhhhhhh that is really nice\" she says as you finish putting your slimy body up her crack. We the last of you finally makes it up her add she moans \"what is happening! ~OoooOoo\" until you finally finish and then she's silent, you slowly start to lose vision and then.<br>\r\n<br>\r\nYou said up to see you had fallen out of your chair, 'dammit! I need to stop having weird petty dreams\" you think to yourself as you get up and sit back into your chair. However it felt kinda different like there was more weight in some places and less in others, you just shrug it off and access the computer. \"I have to finish this report of miss sandson will flunk me!\" You think to yourself as you turn on the computer.<br>\r\n<br>\r\n Wait.... This isn't a library computer, it's to free with more apps and downloads, you look around and say \"this is the office, how did I get--\" you don't finish as you grow wide-eyed and realize you had just spoken with Mrs. Summers voice. Then you look down and there was a sight to behold, two large mounds of flesh pressing against the black fabric and making a weird necklace unbalanced, your crotch area felt empty and....free like there was no closure where your duck used to be contained which there wasn't since you were wearing a black dress with boots.<br>\r\n<br>\r\n \"I can't believe it I actually possessed Mrs. Summers!\" You whisper loudly, you get up and look around ,you don't see any cameras or people, you smirk, \"let's have a little fun then huh?\" You walk off to the women's bathroom \"thank God it's empty!\" You say with a wide smile as you walk up to the mirror and place your hands on your new boobs. \"Ohhh that's awesome~\" you moan with your new lips as you run your manicured hands along your boobs, \" this is Amazon by I actually possessed Mrs. Summers and I can do whatever I want! \"You say with exitement.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1556590140,
            "id":2652366,
            "title":"Possess Ms. Summers"
        },
        "113":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Possess Katie",
                "Look around here some more",
                "Go somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>After you manage to slither your way to the lunchroom, you begin to take a look around for potential hosts. As you look around you see Katie one of your friends walking by.<br>\r\n<br>\r\nKatie ( <a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/c7/9b/6b/c79b6b792d025a70b1d3798b3ea67326.jpg\" target=\"_blank\">https://i.pinimg.com/originals/c7/9b/6b/...</a> )<br>\r\n<br>\r\nYou also see more people coming towards the lunchroom and other places to go.</span></div></div>",
            "created":1552717440,
            "id":2630838,
            "title":"go to the lunchroom"
        },
        "114":{
            "author_id":"cale55",
            "author_name":"Sonic42",
            "choices":[
                "students",
                "teachers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is the first question?</span></div></span></div>",
            "created":1381899600,
            "id":1680169,
            "title":"go posses students or teacher"
        },
        "1141":{
            "author_id":"cale55",
            "author_name":"Sonic42",
            "choices":[
                "Male Students",
                "Female Students"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Next question?</span></div></span></div>",
            "created":1381899600,
            "id":1680170,
            "title":"students"
        },
        "11412":{
            "author_id":"cale55",
            "author_name":"Sonic42",
            "choices":[
                "Aelita",
                "one of the other two"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you went around, you saw three girls you knew and they all had a body that turned you on so much. Who should you possess?</span></div></span></div>",
            "created":1381899600,
            "id":1680171,
            "title":"Female Students"
        },
        "1142":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Female Teacher",
                "Male Teacher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A Male or Female teacher?</span></div></span></div>",
            "created":1543294800,
            "id":2582829,
            "title":"teachers"
        },
        "11421":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "English it is!",
                "Let’s try Math."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Ms. Addams your English Teacher whom you have a slight crush on?<br>\r\n( <a rel=\"nofollow\" href=\"http://images2.chictopia.com/photos/Annebeth/3765363250/3765363250_400.jpg\" target=\"_blank\">http://images2.chictopia.com/photos/Anne...</a> )</span></div></span></div>",
            "created":1543294800,
            "id":2582831,
            "title":"Female Teacher"
        },
        "115":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Home is where the heart is",
                "The park",
                "More."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We can head on home, your family has female members worth trying this power one. There is also the option of exploring the many locations of the big  city.</span></div></span></div>",
            "created":1409029200,
            "id":1847717,
            "title":"more options"
        },
        "1151":{
            "author_id":"petrozichy4589",
            "author_name":"Dima",
            "choices":[
                "Try possessiong mom!",
                "Scout Jessies room!",
                "Slip out and head to Robs!"
            ],
            "content":"<div class=\"\"><div> <span>You poke your little slug head up in the air and look around the whole library with a terrifying ability to see in a 360 degree view which, for you was a little disorienting among other things as your tiny tendrils whisk about in the air, somehow taking the fact that you had become this strange alien like slug with a stride possibly under influence of the weird machine itself or from the new anatomy of your mind in this body.* \"Fuuuuck this is sorta cool!\" You shout out which amounts to nothing more than just a hiss that catches Ms. Daisies attention for a second before turning her face towards the books, unaware of the dangerous powers granted to that of a 16 year old whose mind is possibly more sexually pent up than someone in chastity.*<br>\r\n<br>\r\nLooking around once again, you let out a soft hiss and ponder on what to do, \"Hmm, the machine said I can posses people, but the library...in school? I maybe dumb enough to blow on ice cream to cool it down but I know when I might get in a screw situation, I'm going home!\" You declare to no one but yourself as you look down at the floor from the librarian desk and simply flop and smack against the floor almost flattening out completely till your sluggish body inflates with air.* \"Grk, okay that didn't hurt but the impact left you feeling a little shaken up before the tendrils lift your sluggish body up and slide across the libraries tiled floor at an incredible pace, slipping right into the main hall of the school in seconds then shooting down the very same hall.* \"How do I control the speed of this thi-\" The scream was cut short as your body splats against the schools entrance door and simply ooze under it's seems till you pop out into the open in slug form.<br>\r\n<br>\r\n\"This thing!....oh shoot I'm out! yehahahaaa!\" *You shout and move on forward along the sidewalk as the sun beats down against your slimy surface while speeding along the sidewalk with little to no resistance till you make a few turns here and there along the neighborhoods surrounding the school till the familar sight of your own comes into the view going by the debilitated house around the corner and Robs own home with it's porch still fucked up due to a drink little accident involving his older sister and the car, swerving around and speeding a few houses down you spot your old one story home with it's lawn freshly cut and smelling of mildew and it's cool touch beneath the surface of your belly as you zip along the blades till you smack against the door and squeeze on through right into the entrance hallway with it's coat rack and family photos littering the wall.<br>\r\n<br>\r\n\"Ahh, Home sweet home, all at the expense of smashing my face into a few doors and being marked tardy....for four more periods, well shit.\" You mumble and look around for any sign of someone being home other than the faint sounds of 80's dance music and light breathes coming from the living room possible your mother trying to work off the lovely thick body she's accumulated over the years and the other faint sound of chatter coming from down the hall in Jessies room...possibly another friend or two she's brought over. \"Hmm, now that I'm home...maybe I could try a few things out?\"</span></div></div>",
            "created":1498107600,
            "id":2340766,
            "title":"Home is where the heart is"
        },
        "11511":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Your dad",
                "Your sister"
            ],
            "content":"<div class=\"\"><div> <span>You slithered over to the '80s music in the dining room, sure enough you found your mother dancing to the music with her tight body.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/44/92/93/449293757bdff0ffb7b15a8c3efd8d93.jpg\" target=\"_blank\">https://i.pinimg.com/originals/44/92/93/...</a><br>\r\n<br>\r\nYour slug form slithered itself over to where she was taking a break and started to crawl up her leg. She apparently was too tired to notice since there was no resistance when you crawled all the way up her legs and into her vagina. You expanded yourself once you got out of her reproductive system and soon enough you blacked out.<br>\r\n<br>\r\nYou woke up like you were having a nightmare, everything seemed to be normal...that is until you looked down. There were your new double DDs hanging off your chest, only just being contained in your mothers black mini-dress. You looked at your new hands and skin, your new black hair draping down the front and back of your torso.<br>\r\n<br>\r\nShe wasn't wearing any shoes today, so you took a couple steps forward, you noticed you had a slight sway in your hips as you walked. This felt so natural and (dare you say) right! You hear the '80s music still blaring and actually find it kinda...nice. you start to dance which must've looked kinda like strip teasing in your new sexy body, but you didn't care you just wanted to dance to the disco.<br>\r\n<br>\r\nThat is until you heard someone come down the stairs and ask you something.<br>\r\n<br>\r\nWho was it?<br>\r\n</span></div></div>",
            "created":1543986000,
            "id":2586295,
            "title":"Try possessiong mom!"
        },
        "115111":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Go with it",
                "Stop or depossess"
            ],
            "content":"<div class=\"\"><div> <span>Your dad comes downstairs and sees you dancing, he smiles, \" hey can join? \" he shouts over the loud music, \"sure just don't block my groove\". What? You never say groove like ever! Why would you say it now? Unless this body was affecting you somehow. But it's too late to stop and think now your father has come up behind and as started to make rather suggestive dance moves toward you, \"um uh h-honey can you not get so clo-\" your father stops you from talking as he closes his lips around yours and starts French kissing you!<br>\r\n<br>\r\nWhat happens now!?</span></div></div>",
            "created":1556590740,
            "id":2652369,
            "title":"Your dad"
        },
        "1152":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Option 1",
                "Option 2",
                "Option three: more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You slither to the park where you find two options<br>\r\nSeem like good options.<br>\r\n<br>\r\nA white blond enjoying the trail-<a rel=\"nofollow\" href=\"https://previews.123rf.com/images/steevy84/steevy841508/steevy84150800005/44394746-sexy-women-at-the-park-sunset-in-the-background.jpg\" target=\"_blank\">https://previews.123rf.com/images/steevy...</a><br>\r\n<br>\r\nA sexy jogger drinking water-<a rel=\"nofollow\" href=\"https://res.cloudinary.com/twenty20/private_images/t_watermark-criss-cross-10/v1504399003000/photosp/bacdfddf-2392-4660-a2ec-ffad13277fc4/stock-photo-water-exercising-sports-femininity-woman-drinks-sexy-fitness-sportswear-bacdfddf-2392-4660-a2ec-ffad13277fc4.jpg\" target=\"_blank\">https://res.cloudinary.com/twenty20/priv...</a><br>\r\n<br>\r\nWho do you pick?</span></div></span></div>",
            "created":1544418000,
            "id":2588002,
            "title":"The park"
        },
        "11523":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Option 3",
                "Option 4"
            ],
            "content":"<div class=\"\"><div> <span>You decided that these weren't as hood as you hoped so you slithered along until you found teo more people<br>\r\n<br>\r\nA pregnant mom-to-be:https://calmaxstudio.files.wordpress.com/2012/08/033.jpg<br>\r\n<br>\r\nA sexy teen socialising:https://content4.decorativemodels.com/stellaxo.com/0023/Sexy_teen_in _the_park_00.jpg<br>\r\n<br>\r\n</span></div></div>",
            "created":1544418000,
            "id":2588009,
            "title":"Option three: more choices"
        },
        "1153":{
            "author_id":"videoshards",
            "author_name":"Video",
            "choices":[
                "Anime world",
                "Video game",
                "I demand more choices!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did the machine transport you into an anime or a videogame world?</span></div></span></div>",
            "created":1445058000,
            "id":2048305,
            "title":"More."
        },
        "11531":{
            "author_id":"videoshards",
            "author_name":"Video",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Infinite Stratos?</span></div></span></div>",
            "created":1445144400,
            "id":2048664,
            "title":"Anime world"
        },
        "115311":{
            "author_id":"videoshards",
            "author_name":"Video",
            "choices":[
                "Train for tomorrow match",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>After looking at your new body your vision suddenly was blinded by a bright light. After a couple of second passed you found yourself in a locker room that looks likes it belong somewhere in anime.<br>\r\n<br>\r\n\"Yea! I got the whole day to train for tomorrow match. Time to get inside my suit.\"<br>\r\n<br>\r\nHear a girl's voice you turn around to meet a girl in a white uniform with red highlights. She has short hair that are dark magenta with the same color for her eyes. She also has what you believe is to be high C-cups. She walks towards the locker in front of you opening the locker on the bottom giving you a full view of her ass. Open the locker was open she began to take off her uniform to reveal her white panties and matching bra. Unconsciously you began to move your slug body towards her legs and began to climb it.<br>\r\n<br>\r\n\"Is something on my leg?\"<br>\r\n<br>\r\nShe stops putting her clothes in her locker to look down where you were. After a few second you where right next to her vagina. You began to move into it cause the girl to moan and slide down on the locker in pleasure.<br>\r\n<br>\r\n\"Ugh, what is happening to my body's?\"<br>\r\n<br>\r\nShe was playing with her boobs while she moved her right hand down her pussy shoving you down deeper into her pussy. As you where shoved deeper down you started to black out. After what seems like minutes you began to wake up. After blinking you realize you have normal human eyes again. Opening your eyes fully you notice you where still in the locker room with your butt on the ground because your ass is cold.<br>\r\n<br>\r\n\"Fucking hell the ground is co------- my voice, it's a girl voice, what how?\"<br>\r\n<br>\r\nAfter realizing my voice has change to that if a girl I tried to get up only to realize my center of gravity has change. Looking down I notice I have breast covered by a white bra. Did I became the girl that was changing I here? Getting up on my feet I began to look for a mirror. After a couple of minutes you spot a mirror. Looking at mirror I have realized I was right an have indeed became the girl that was changing. Looking at the mirror I began to suffer an headache. The girl's name is Kiyoka Aikawa, age 14, she is a 1st year in class one in the Infinite Stratos Academy. Those where the most prominent one that came to mind. After the headache passed you somehow gain all of Kiyoka memories, right now she got the whole day to herself that she was going to spend train find due to her match tomorrow. Or you can do something else in the meantime.</span></div></div>",
            "created":1445144400,
            "id":2048680,
            "title":"Yes"
        },
        "1153111":{
            "author_id":"videoshards",
            "author_name":"Video",
            "choices":[
                "Train your sexy self",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Realized I fuck up the options so I made this chapter for the IS chapter I made.</span></div></span></div>",
            "created":1446267600,
            "id":2055065,
            "title":"Train for tomorrow match"
        },
        "1153112":{
            "author_id":"videoshards",
            "author_name":"Video",
            "choices":[
                "Reader's Choice Infinite Stratos",
                "New anime world"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Realized I did not gave an choice to what anime world you wanted to go, so here is you choice.</span></div></span></div>",
            "created":1445144400,
            "id":2048959,
            "title":"Reader's Choice"
        },
        "115312":{
            "author_id":"shockmon",
            "author_name":"ShockMon",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The machine can transport you into Dragon Ball. Do you wish to enter this world?</span></div></span></div>",
            "created":1498798800,
            "id":2344937,
            "title":"Dragon Ball"
        },
        "1153122":{
            "author_id":"shockmon",
            "author_name":"ShockMon",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did you enter the world of One Piece?</span></div></span></div>",
            "created":1498798800,
            "id":2345029,
            "title":"One Piece"
        },
        "11531222":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the World of Naruto?</span></div></span></div>",
            "created":1498885200,
            "id":2345876,
            "title":"No"
        },
        "115312222":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>My Hero Academia?</span></div></span></div>",
            "created":1498885200,
            "id":2345877,
            "title":"Other"
        },
        "1153122222":{
            "author_id":"shockmon",
            "author_name":"ShockMon",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Bleach?</span></div></span></div>",
            "created":1499058000,
            "id":2346324,
            "title":"Bleach"
        },
        "12":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "you kind of died",
                "Just a transformation, you're not really dead",
                "other",
                "readers choice",
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is your body still there or did you just transform?</span></div></span></div>",
            "created":1483160400,
            "id":2256890,
            "title":"ghost"
        },
        "121":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Address one of the issues ",
                "Possess someone else",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>'Well that was short lived' he thought to himself as he sees his charred corpse on the ground. Turns out that the machine was a bust, and not only that but it literally blew up in a silent (how!?) Explosion. The upside was that he didn't draw any attention (again how) the downside being that he was, well, dead. He thought of this as a minor anmoyance more thsn a 'holy shit i'm dead!' Kinda way.<br>\r\n<br>\r\nOne thing he wanted to try out was if he could actually possess people, animals, and objects like in the movies. So he flew across the library and saw this woman.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://st3.depositphotos.com/7145424/16441/i/1600/depositphotos_164410404-stock-photo-woman-librarian-in-glasses-sitting.jpg\" target=\"_blank\">https://st3.depositphotos.com/7145424/16...</a><br>\r\n<br>\r\nShe was the librarian of your school and since you needed a guinea pig for his experiment of sorts he thought 'might aswell the autjority figure' and flew over to her. As he got closer he sensed the soul in her body: mindlessly working a saily routine over and over and over again, it would be so ocupied that it wouldn't even feel him snatch it away. So he quickly dug his ghostly hand into her essense which she reacted to with a gasp, after a <br>\r\nWhile resisting he finally tore the soul away in which it just stared off blankly at the room, this was its weakest state, and it was perfect since now the body was unoccupied so all he had to do was slip right in like soooo.<br>\r\n<br>\r\nHe woke up with a jolt, as he looked around things felt a little...off, one of those things being he was no longer a dude as addressed by the ckeavage and absence of his dick. He looked around: he saw sleeping students with heads on there books, smart students with there heads in a book constantly studying, and the cheerleaders wjo came here everyday to just relax and horse around. Now that he had a body he could actually adress these people but first these glassrs had to go. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://us.123rf.com/450wm/dmitriisimakov/dmitriisimakov1708/dmitriisimakov170800015/86667700-woman-librarian-in-glasses-sitting-at-the-table-studying-book.jpg?ver=6\" target=\"_blank\">https://us.123rf.com/450wm/dmitriisimako...</a><br>\r\n<br>\r\nHe stood up and took a look at this body, it was nothing absolutely killer but it was sexy in its own way aswell. Also he may need those glasses afterall (it was harder to see with them off than on)<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://us.123rf.com/450wm/dmitriisimakov/dmitriisimakov1708/dmitriisimakov170800016/86667701-woman-librarian-in-glasses-sitting-at-the-table-studying-book.jpg?ver=6\" target=\"_blank\">https://us.123rf.com/450wm/dmitriisimako...</a><br>\r\n<br>\r\nNow what should he do? <br>\r\n<br>\r\n</span></div></div>",
            "created":1544418000,
            "id":2588011,
            "title":"you kind of died"
        },
        "1211":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Punish them; it's in the rulebook",
                "Don't punish them; you've been in a similar situation",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>After he stood up he went over to the ones who were just sitting down with there heads on books, should be punish them? They were sleeping when the should have been studying, or should be said them without punishing them? They were probably just really tired from studying all night.<br>\r\n<br>\r\nWhat should be do?</span></div></div>",
            "created":1556591400,
            "id":2652382,
            "title":"Address one of the issues "
        },
        "14":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "stuff",
                "gender",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>not only swap stuff but swap gender</span></div></span></div>",
            "created":1543554000,
            "id":2583829,
            "title":"gain the ability to swap stuff"
        },
        "142":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>When he woke up as a female version of himself.he saw two massive G cup breasts on his chest with a hourglass figure and big hip and a big jiggle butt and a vagina . He had long brown and brown eye and big plump lips.he had No armpit, leg and pubic hair. He had no  piercings or nail polish. Your clothes you had on  were replace by a tank top with no bra and thin yoga pants ( your female self does not wear bras or panties) <br>\r\nDid  reality change?</span></div></div>",
            "created":1566198240,
            "id":2704602,
            "title":"gender"
        },
        "1422":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "Yes",
                "No you remember being a girl ",
                " You lost all your remember  (amnesia)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you remember?</span></div></span></div>",
            "created":1566198360,
            "id":2704603,
            "title":"No"
        },
        "15":{
            "author_id":"blavcleo",
            "author_name":"Mr.nice",
            "choices":[
                "A",
                "B",
                "C",
                "Your choice",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nShapeshifting or morphing-you can change your form to any person.<br>\r\n<br>\r\nMind control or hypnosis- you can mess with people minds and behavior.<br>\r\n<br>\r\nWerestriper or werewoman-when a woman bite you and turn into the female that bitten you<br>\r\n<br>\r\n</span></div></div>",
            "created":1409202000,
            "id":1848505,
            "title":"more or anthor story"
        },
        "151":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Morph into some one there",
                "Don't wait until after to morph",
                "Your choice "
            ],
            "content":"<div class=\"\"><div> <span>After getting out of the machine, you see a piece of paper slip out of a slot in the machine, it said:<br>\r\n<br>\r\nYou now have the ability to morph or as some call it shapeshift, you can change your form to any person living or dead, young or old, female or male etc. Use this power however you like.<br>\r\n<br>\r\nYou reread it at least 10 times before you realize what it means and how you can use it. Your body is tingling with anticipation (or was it the machines magic or whatever), you want to use it on someone just for a test run. You think of someone that is close to you and goes to the same school so its not weird: you think of your girlfriend Tari.<br>\r\n<br>\r\nAs soon as you begin to believe its a hoax your body begins to feel like Jello and you feel your body changing into someone more feminine. First you feel decent C cups emerge from your jellified body then your dick is sucked back into your body and is replaced by a tiny slit, you even feel your ass puff out of your body then the finishing touches such as hair, skin tone, bone structure, and clothes. You walk over to a mirror that was hanging on the wall, in it is an exact replica of your girlfriend: Tari Summers.<br>\r\n<br>\r\nYou are now fully convinced of your new powers as you cup your new breasts in your hands, you feel like you want yo do more though so uou morph back into your regular body and leave the library. You go to your next class and..<br>\r\n<br>\r\n</span></div></div>",
            "created":1543554000,
            "id":2583801,
            "title":"A"
        },
        "1512":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Your mom",
                "Your older Sister",
                "Your choice "
            ],
            "content":"<div class=\"\"><div> <span>You decide against the boices in your head telling you to morph now, though it would have made class interesting. After school you head to the bus and decide you will have a little fun, you morph quickly so no one notices into the girl who had just dropped her papers and walked into the bus where you greeted the bus driver normally, who thought nothong of it...until the same girl came rushing in and greeting him. You morphed back just on time to see the bus driver look around for a similar girl that had just walked into the bus...but to no avail. <br>\r\n<br>\r\nAfter that it was a pretty boring ride home, as soon as you got home you were greated by your dog rusty: a german shepard. You loved Rusty ever since he was a puppy and you thought he deseved a playmate since he was there only dog, also since his parents were at work and both his older sister and younger brother weren't here yet you morphed into an exact replica of Rusty. That's also how you figured out you could understand the language of the person/animal who you were since rusty literally said to you, \"sup, dog\", you explqined your new powers to him and apparently he was a lot smarter then he looked since he completely understood and accepted it.<br>\r\n<br>\r\nYou played with Rusty for about thirty minutes then decided to morph back and feed him. Rusty followed you around after that, he barked a couple times but you could no longer understand what he said, you suspected it was something like, \"wow! Cool power! Now where is dinner?\". After you fed him you headed up to your room and let Rusty in, you then locked the door behind you.<br>\r\n<br>\r\nYou really wanted to do more morphing so you thought of someone you knew and transformed into...</span></div></div>",
            "created":1543554000,
            "id":2583804,
            "title":"Don't wait until after to morph"
        },
        "15121":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "You hear a noise come from downstairs",
                "A new piece of paper materialized "
            ],
            "content":"<div class=\"\"><div> <span>You decided on your mom, and thought really hard on her form and body, you quickly changed into her after the practice from before. You looked into the mirror and your mom was staring back at you.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/3b/03/3f/3b033f6e7ab6d7f95dc4444548d74170.jpg\" target=\"_blank\">https://i.pinimg.com/originals/3b/03/3f/...</a><br>\r\n<br>\r\nRusty seemed excited to see you transform again, even if it was your mom, you chose some differerent clothing to wear aswell. Rusty barked and began sniffing you ehich you responded with pat on the head, you looked into the mirror and said, \"Wow, mom! I never thought you could look good in anything but man you look hot!\" It felt a little weird talking like that about your mothers body but then again tbis wad YOUR body, it just looked like mom.<br>\r\n<br>\r\nYou put your one free hand on your new face gently rubbed, just to get a feel of it, it felt smooth and gentle like your mothers face and skin should feel like, you thought so since she was a mom and a killer mom at that. You dropped your shorts and looked at her pink panties that you wear now wearing, Rusty seemed pretty curious about those, but you didn't mind him looking since he probably had never seen them before. You thought it was a pretty good time to stop staring at yourself and pulled your shorts back up, you looked over at Rusty who looked up at you with curiousity, you smiled and sat down to rub him when...</span></div></div>",
            "created":1543554000,
            "id":2583805,
            "title":"Your mom"
        },
        "151212":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "You hear the front door",
                "You spend some time in your new bodies"
            ],
            "content":"<div class=\"\"><div> <span>You see a piece of paper appear right beside your dog, you pick it up with your dainty hands and read it<br>\r\n<br>\r\nWow! You are making a lot of progress! We decided to tell you that you have a new power that comes along with this one. You can morph others into different things by touching them on the skin, like a dog to human, human to dog, it works well if you know the person/animal but it drains you qyite a bit if you use it on someone that randomly passes by so be careful.<br>\r\n<br>\r\nYou couldn't believe your eyes! You had just been given a new power! You wanted to use it on someone, someone like your dog. You look over at your dog who still looked at you with cinfused curiosity, you thought he was a perfect test subhect since you knew him well so you touched him on the head and thought of your younger brother Tim. <br>\r\n<br>\r\nSoon enough your german shepard buddy went from a cuddly little dog to a cute little boy.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i0.wp.com/forrestandfox.co.uk/wp-content/uploads/2016/12/little-boy-woods-autumn-cardiff-photography-forrest-fox.jpg\" target=\"_blank\">https://i0.wp.com/forrestandfox.co.uk/wp...</a><br>\r\n<br>\r\nHe looked around in a panic trying to find out what happened to him, then he sees you and says, \"Mike what did you do to me?\" You respond with \"It's okay, Rusty i'm just testing out one of my new powers and it works like a charm, as you can see\" you say both calmly and excitedly. Rusty says, \"Mike, what are you goi g to do to me now?\" \"Well i was just gonna keep you like this for a while, just until my real mom and brother come home\" you say calmly.<br>\r\n<br>\r\nRusty seems to like your answer since he doesn't ask anymore questions, but he did say one thing, \"Mike?\" \"Yes\" you say \"I hope you don't change me back really soon since then you can't undetstand me\", you smile and say, \" I won't do that yet, Rusty\" \"okay, i'm going to fall asleep now okay, mike?\" He said. \"Sure Rusty\" you say, you wete prepared for him to lie down but uou weren't prepared for him lying down on you thrn falling asleep.<br>\r\n<br>\r\nYou are very confused but unable to do anyrhing about it.<br>\r\nWgat happens now?</span></div></div>",
            "created":1543554000,
            "id":2583810,
            "title":"A new piece of paper materialized "
        },
        "153":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Option 1: beginners guide to why your body is changing",
                "Option 2: ONE OF US! ONE OF US!",
                "You pick a way he could become one of many he doesn't and  know someone who is "
            ],
            "content":"<div class=\"\"><div> <span>The legend goes that long ago there mystical creatures called werewoman, by day they would appear as regular people and would have normal lives but when the moon came out at night, or sometimes at will it the werewoman was powerful enough, they would change into that of a beautiful woman. The form of the woman would depend on the swordsman and their power, sometimes it would be of someone they knew, as in a friend of family, and sometimes it would be of someone completely random or even of a female version of their regular selves. Some werewomen where even powerful enough to change between forms but this took practice and skill to pull off without damaging themselves.<br>\r\n<br>\r\nThey survived for years in the middle ages, whether as a singular family in a regular town of even at times an entire town of werewoman! However the king of the land grew frightened of the werewomen, he was them as a danger to his kingdom so he proclaimed that all werewomen were to be killed. Many werewoman were terrified of this new order from the king and ran to hide in a distant land, others saw this as an offense as not one of their mind had done any wrong to the king but none were crazy enough to start a riot over the subject. Instead they worked together to make the werewoman gene in them all contagious, it would be transferred by sickness though it would be transferred by bite of even at times, sexual contact.<br>\r\n<br>\r\nThey plotted to infect the king himself as to teach him a lesson, this plan never came to fruition as one of the the members of the group of werewoman was loyal to the king and betrayed the rest of her kind. They were killed by the kings guard shortly after the traitor spoke of their whereabouts. However the traitor soon became guilty of herself for betraying her mind and so she began to spread the gene secretly as much as she could but was soon discovered just as her sisters had been by a rogue werewoman  she had just infected. She got most of them out into hiding before she was to killed by the kings guard, now the only werewoman in existence are the ones smart enough to leave in the beginning and the ones that were infected and they live in hiding in a land they made together far from any kingdom, so far in fact, that the kingdom's that knew of the werewoman soon forgot about them or merely acted like they didn't exist until finally they died out and the next generation had no idea that such a people existed.<br>\r\n<br>\r\nWhile the werewoman continued to live their own lives some were born male but still became female in the night so as to continue the race. Some would go out into the world and live among the 'regulars' as they called them, some survived with friends, some survived with a alarm dog who would harm at anyone who got too close in the night. <br>\r\n<br>\r\n<br>\r\nNow to continue with the werewomen's powers<br>\r\n<br>\r\n-they have access to magic of some sort as in making things appear as if they are another thing (as in making a cat look and act as a dog) however this only works as long as they are focusing on this and can only be done while the werewoman is in their female form.<br>\r\n<br>\r\n-they can run really fast and have invisibility but only for 15 minutes before they grow too weak to continue with this hard magic.<br>\r\n<br>\r\n-finally, as stated before, really powerful werewoman can change between forms but what forgot to mention is if they have this power they can swap between all the forms they have bitten (like it they bite you they now have the ability to turn into you...... and you still become a werewoman) this, like I said is very dangerous as it is done incorrectly or excessively will injure, paralyze, or in some cases kill the werewoman.<br>\r\n<br>\r\nNow that we have established the background and abilities of a swordsman let's see how a our character will react to being a were woman but first legs ask a simple question.<br>\r\n<br>\r\nWas Mike born with the werewomen gene but for some reason it's effects are just now coming out.<br>\r\n<br>\r\nOr was Mike bitten by or who was particularly fond of spreading the species.</span></div></div>",
            "created":1566076500,
            "id":2703970,
            "title":"The cursed werewoman"
        },
        "1532":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "A familiar person",
                "His female self",
                "Someone completely random from around the world"
            ],
            "content":"<div class=\"\"><div> <span>After Mike was done being in the library he started to head home, he and no car or bike and not enough of anything to rent a taxi or bus so he started to walk home, he walked a good amount of the way on the sidewalk and soon be saw his house he was almost there just a couple of years more and--- suddenly he felt a sharp pain in his are he looked over and saw a strange man in raggy clothes with blood in his textbooks at you for a while then ran off into the woods behind the two of them. Mike looked at his arm and saw a bite mark supposedly made by the man \"Oh shit, that looks bad and damn does it hurt I need to get home fast\" he sprinted all the way home and when his mother was his arm and screamed and asked \"who hit you!?\" \" some crazy dude in the forest did it, it's starting to hurt badly\" she wrapped it in bandages and sent him to bed where he soon tell asleep. Soon the moon came out, and his arm started to burn it burned like the sun was being branded into Mike and his body started changing into that of a woman; soon his hair grew out into long strands of brown, his chest started to swell until his middle torso split to make his own pair of female breasts, his form grew taller more slender, his rock was replaced with a vagina and soon enough a woman was left in Mike's place: a Werewoman.<br>\r\n<br>\r\nMike awoke to his bandage burning like flames he got up and walked into the kitchen to grab a drink of water to ,hopefully, sooth the pain. He poured it into a cup and drank it tell it was empty, \"ahhh refres---\" his eyes widened as he heard the feminine voice come out of his own mouth, he spokesman to make sure he wasn't going crazy \"hello?\" It was definitely not his voice but familiar nonetheless. He looked down and nearly screamed, \"I have fucking boobs!\" He whispered he grabbed .a tit and squeezed it a bit \" holy shit\" he said as he let his hand to of his breast \"I need to see this in the mirror\" he ran to the bathroom to see..</span></div></div>",
            "created":1569479100,
            "id":2723590,
            "title":"Option 2: ONE OF US! ONE OF US!"
        },
        "15321":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "A female family member",
                "A female friend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But who was it that was so familiar?</span></div></span></div>",
            "created":1569479160,
            "id":2723592,
            "title":"A familiar person"
        },
        "153211":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Sister or aunt",
                "Mother"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sister?<br>\r\n<br>\r\nAunt?<br>\r\n<br>\r\nMother?</span></div></span></div>",
            "created":1569479220,
            "id":2723593,
            "title":"A female family member"
        },
        "1532111":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Sister ",
                "Aunt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>His sister Candace, an athletic person who loves to keep her body in shape, she has a boyfriend named Tom.<br>\r\n<br>\r\nHis Aunt Caroline, a Milf if you ever saw one, usually very in touch with your family, loves her baby sister more than anything</span></div></span></div>",
            "created":1569632040,
            "id":2724346,
            "title":"Sister or aunt"
        },
        "15321112":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Follow Sander to his village",
                "go home and hope this is all a dream"
            ],
            "content":"<div class=\"\"><div> <span>Once you arrive in the bathroom and look into the mirror, you see your Aunt Caroline staring back at you: <a rel=\"nofollow\" href=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/501ed4ad-70af-4a6c-b1f7-b5ba99220921/dccx4hi-ed5a08cf-395c-49a6-be0f-d74ab0ead461.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzUwMWVkNGFkLTcwYWYtNGE2Yy1iMWY3LWI1YmE5OTIyMDkyMVwvZGNjeDRoaS1lZDVhMDhjZi0zOTVjLTQ5YTYtYmUwZi1kNzRhYjBlYWQ0NjEuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.3lkmEAn23MHZnksLjns16zsTrxIfMlewaRH5Oa-PezI\" target=\"_blank\">https://images-wixmp-ed30a86b8c4ca887773...</a><br>\r\n<br>\r\n\"Holy shit! I'm my Aunt!\" You whisper as to not wake the rest of the house, \"how did this happen? And why Aunt Caroline?\" you say as you poke your new gigantic breasts with your new fingers. Suddenly you hear a knock on the window outside and you see a feminine hand wave at you, \"what the fuck?\" You say in confusion as you watch the hand point towards the front door.<br>\r\n<br>\r\n\"Um okay..\" you say as you leave the bathroom and tiptoe towards the front door, hearing your dads loud snoring all the way there. You finally reach it and open it very slowly to reveal... no one, the porch was completely empty, \"huh? But I thought someone wa-\" \"someone was trying to contact you?\" A feminine voice said from behind. You whirl around, almost falling over due to the uneven weight, to see a tall woman standing over you: <a rel=\"nofollow\" href=\"https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/763ce31d-7b86-4505-8bcf-d6522dae8d93/dajxmk0-95ef934a-ebfa-449b-ab0d-db1263e77dec.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzc2M2NlMzFkLTdiODYtNDUwNS04YmNmLWQ2NTIyZGFlOGQ5M1wvZGFqeG1rMC05NWVmOTM0YS1lYmZhLTQ0OWItYWIwZC1kYjEyNjNlNzdkZWMuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.CqKjdnzbn3mKd8-B51wSUwNxxLRiopSrAp1FtkdIzYk\" target=\"_blank\">https://images-wixmp-ed30a86b8c4ca887773...</a><br>\r\n<br>\r\n\"Who are you?\" you ask the woman after calming down, \"I will tell you that later, but now we must leave this place\" she said determinedly as she exits the house while beckoning you to follow her. \"Uh okay?\" you say confused as you close the door and follow her around your house and into the woods where you have some difficulty catching up to her. Finally you reach a clearing and find her sitting in the middle surrounded by thick grass that is common in this area, \"now you may speak, child\" she says as she watches you sit in front of her, \"How do you know I'm a child?\" \"You radiate such potent childish aura that is so thick it would be foolish to think you were an adult woman\" she answers. \"Um okay, Who are you?\" \"I am known as Sander among my peers, I am also the cause for your transformation\" she says \"really?! How did you do it?\" You ask anxious for some answers.<br>\r\n<br>\r\nShe smiles before saying \"through a bite that carried the very curse coursing through my veins\", \"what? when did you bite me?\" you ask bewildered. \"On this very day when you were walking to that house\" she says as she points towards your house with her heavily manicured finger, \"no that was a random guy and you're not a guy\" \"neither are you, child\" she rebuttals with a smirk. To that you have no argument so you ask another question \"why am I a girl?\" \"Because of a curse that was given to me through birth by my curse bearing parents\".<br>\r\n<br>\r\nYou tilt your head in confusion, \"What curse?\" She closes her eyes and looks down, \"It is a long story, but a more simple way of putting it is that from this point onward when the moon comes out during the night you will change into a female\". Your eyes grow wide, \"but...I don't want to be a girl at night, I want to be a boy!\" you say angrily, \"there is no cure to this curse, you are now a werewoman whether or not you desire to be or not!\" Sander says with authority. You begin to cry, \"but my family won't be able to take me anywhere anymore,  will they even know who I am?\" Sander hugs you and says, \"it will be alright, child\" \"No it won't! I'm a girl and its all your fault\" you say with tears streaming down your aunts face.<br>\r\n<br>\r\nSander sighs before saying, \"I live in a village not too far from here filled with those also bearing the curse, I will guide you there if you wish but I will not stop you from going back to the house, it is all in your decision\" Sander says as she stands up. What will you do?</span></div></div>",
            "created":1577049300,
            "id":2763206,
            "title":"Aunt"
        },
        "153211121":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "You go your own way to find answers",
                "You continue following Sander"
            ],
            "content":"<div class=\"\"><div> <span>You didn't want anything to do with the person who ruined your life, but you wanted to know more about this strange curse.  \"Okay, I'll follow you but this place better be what you say it is\" he nods and beckons you to follow him deeper into the woods....<br>\r\n<br>\r\nYou almost lose him a couple times but you stay on him the entire trip until you finally see him wander into a cave, you obviously follow him in but with even more uncertainty this time. You find the cave to be a bit of a maze, with twists and shadowy corners and some odd sounds but thankfully Sander was a great guide and never left you in one place for too long, \"keep up child, we are almost to them\". Finally you begin to see some lights and before long you see actual people! Every person was of every race, ethnicity, religion you name it they were there, well except everyone was a female. \"Welcome, child, to Ramar!\" Sander says spreading his arms out like a bird for some dramatic flair.<br>\r\n<br>\r\nYou notice the village is quite big, with many areas to shop and eat but still areas to settle down in as homes, you can even see buildings that go all the way up to caves ceiling and even see women in strange clothing going up to the top. \"Ah, I see you've noticed the spire of the ancients\" Sander says as he nudges you to follow him into the village-city, \"the what?\" You ask him confused \"The spire of the ancients, where the oldest go to consult with those who have passed\" \"huh, like priests?\" you ask confused \"if you would like to think of it that way then yes, however I press you never to make that distinction in front of them, It can lead to unsavory results\" he says kinda menacingly. \"So.... everyone here is um a girl\" you ask trying to move the topic away from 'the spire of the ancients', he sighs and says, \"yes, child, everyone in this village has two X chromosomes, thanks to the curse\" he says annoyed. <br>\r\n<br>\r\nWhere do you go now?</span></div></div>",
            "created":1577154660,
            "id":2763830,
            "title":"Follow Sander to his village"
        },
        "15323":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "He recognizes the person he just masturbated as",
                "He doesn't recognize the person in the mirror"
            ],
            "content":"<div class=\"\"><div> <span>Mike runs to his bathroom and stares into the mirror, he doesn't immediately recognize the woman in the mirror but judging from the same reactions and facial expressions this was him now, \"how could this happen?\" He whispers as he continues to stare into the mirror slowly examining every part of his new face with his eyes and hands. Slowly but surely he makes his way down from his new face to his chest which feels his medium sized breasts once again but this time with a feeling of pleasure instead of panic and confusion. \"Well whatever happens to me, I hope it doesn't change for a while hehehe\", he continues downward rubbing his new stomach and feeling his slim waist as his hands continue to traverse this new womanly maze. Finally he reached the vagina, he's only seen it in sex ed and porn but now that he was seeing one in real life and on himself! This was a pretty enlightening experience that he planned on taking advantage of for certain \"Hmmm let's see if it's all its cracked up to be\" he slowly puts a finger inside it and feels around causing almost instant pleasure to surge through him like lighting surging from the ground to the sky, \"holy fuck! Plus that just one finger! What if....\" He puts another inside with the other and at first nothing much changed, I mean there was still massive amounts of pleasure coursing through him but there wasn't a huge difference between the first and second. <br>\r\n<br>\r\nThis all changed as he almost nonchalantly put a third in and started prodding which caused him another spike like the first, \"on there it is haha, looks like third times the charm!\" He says as he continues to dig around his own pussy and adds another stinger which increases the pleasure once more. But he entered a while new plans of existence once he added the fifth and final finger and was straight up shoveling it, \" how do women even function with this this. ..I can't even describe it! \" he says as he finally adds his whole hand in and realized that that was to much since he was on the verge of screeching to the world since he was holding back and just as quickly as he added it took it all out to reveal a wet and juicy hand. \"Well that was...nothing short of amazing\" he says as rinsed away his own feminine juices, \" let's take another look in the mirror and try to find out who the help I am\". He takes a good long look in there and...</span></div></div>",
            "created":1573179300,
            "id":2743702,
            "title":"Someone completely random from around the world"
        },
        "154":{
            "author_id":"megaho",
            "author_name":"megaho",
            "choices":[
                "DNA assimilation",
                "Other options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Options???</span></div></span></div>",
            "created":1543554000,
            "id":2583830,
            "title":"Your choice"
        }
    },
    "info":{
        "author_id":"pss15",
        "author_name":"Pss",
        "brief_description":"what is this thing?",
        "created":1381842420,
        "description":"<td align=\"left\" class=\"norm\">you are a 16 year old boy named mike winters who is an average person all around.<br>\r\nyou currently go to a school that rumors say that this school used to be some ones home where he or she made revolutionary things. so while looking helping out the librarian one day you stumble upon a secret passage behind a book shelve. after going down it you find a big pod looking machine that says special transformation machine.<br>\r\nthe machine turns mike into things that can posses peoples body's or some other ability.<br>\r\nplease spell a best as you can! </td>",
        "id":1958127,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1577154660,
        "modified":1577154660,
        "pretty_title":"the werid machine"
    }
}