{
    "chapters":{
        "1":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to Ultima. It is a calm evening and everything is normal. Ultima’s Pokemon Professor, Professor Palm is waiting at New Light City waiting to Welcome Veteran Trainers coming in the morning on the ship. The Scarlet Tower can be seen in the distance can be seen in the distance as it pierces though the clouds. Now for starters what gender are you?</span></div></div>",
            "created":1300338000,
            "id":1071867,
            "title":"Welcome to Ultima."
        },
        "11":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "A New Trainer",
                "A Veteran Trainer",
                "A Gym Leader",
                "A Pokemon Ranger",
                "More Choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then now what are you.<br>\r\nA New Trainer starting his Pokemon journey.<br>\r\nA Veteran Trainer coming in on the ship so he can take on the Advance League.<br>\r\nA Gym Leader in the Ultima Region.<br>\r\nA Pokemon Ranger patrolling Ultima.</span></div></span></div>",
            "created":1300338000,
            "id":1071874,
            "title":"What are you?"
        },
        "111":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "Eevee",
                "Espeon",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kai <br>\r\nPersonality: Kind, Caring, and helpful<br>\r\nLikes: Eevee evolutions <br>\r\nDislikes: People who abuse and/or steals Pokemon from other trainers<br>\r\nAppearance: 4 ft 6 in, light blue eyes, short brown hair. Usually wears sky blue t- shirt with khaki shorts and sky blue Velcro shoes<br>\r\nDream: Pokemon Coordinator or Trainer<br>\r\nStarter is...</span></div></div>",
            "created":1385145900,
            "id":1697743,
            "title":"A New Trainer"
        },
        "1113":{
            "author_id":"justanormalguy",
            "author_name":"Sketch",
            "choices":[
                "Ralts (Female)",
                "Ralts (Male)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Mark Kaisar<br>\r\n<br>\r\nPersonality: Brave, Unpatient but kind<br>\r\nLikes: The Ralts evolution line. <br>\r\nDislikes: People who think pokemon are slaves<br>\r\nAppearance: 4 ft 6 in, long black hair, brown eyes. Wears a black T-shirt with a dark blue jacket with black running shoes.<br>\r\nDream: Become a Pokemon Trainer.<br>\r\nStarter is...  </span></div></div>",
            "created":1390524120,
            "id":1732117,
            "title":"What about...?"
        },
        "112":{
            "choices":[
                "Yes",
                "New Character",
                "New Character"
            ],
            "content":"<div class=\"\"><div> <span>Name:Shane Tutty<br>\r\nAge:15<br>\r\nProffession:Pokemon Trainer<br>\r\nAppearance:Blue eyes,Dark brown hair,Wears a long sleeved black shirt and blue jeans.<br>\r\nPersonality:Cold and straight to the point with strangers.Friendly and kind with friends.<br>\r\nLikes:His Pokemon.<br>\r\nDislikes:People who abuse Pokemon.Being held in the same spot.<br>\r\nSkills:None.<br>\r\nBio:Shane was born in Kanto where he started his Journey.He recieved his first Pokemon from Professor Oak and went on to challenge every Gym and league in every region coming out successfully.Shane turned down taking the role as Champion as he hates being cooped up.He was informed and invited to Unova by Professor Oak.<br>\r\nShane`s Pokemon Team is:Charizard,Aerodactyl,Luxray,Mightyena,Armaldo and Garchomp.<br>\r\nShane chooses to use six Pokemon although he does have others.<br>\r\nSo go with Shane?</span></div></div>",
            "created":1300510800,
            "id":1072887,
            "title":"Shane Tutty"
        },
        "1121":{
            "choices":[
                "Rest",
                "Begin Journey"
            ],
            "content":"<div class=\"\"><div> <span>You stood out on the ships deck  with Charizard beside you.So what do you think about our new journey Charizard you ask?Charizard leaves out a low happy growl.(Shane cannot understand Pokemon and does not use a Mini Translator)<br>\r\nLadies and Gentleman this is your Captain speaking I would like to ask you to return to the lounge as we will be arriving in New Light City Momentarily.Alright you heard him you say Charizard return as you enter the lounge.You take a seat and await the ship to dock.After docking you leave the ship with a few other veteran trainers.Welcome to Ultima a male professor greets as you all gather.I am professor Palm he says lead professor of this region.I am sure all of you are eager to start your Advance league challenge he contiues.You can rest for the night or head away on your journey.<br>\r\nWhat will it be?</span></div></div>",
            "created":1300510800,
            "id":1072893,
            "title":"A Whole New Adventure"
        },
        "11212":{
            "choices":[
                "Cyan Town",
                "Crimson City"
            ],
            "content":"<div class=\"\"><div> <span>You take out your map and decide that if you leave now you could be at the next town by morning giving you a head start as the other trainers are resting for the night.Come on out Aerodactyl you say.Aero the Pokemon crows announcing its entrance.You climb up onto his back as he takes off into the air.You are close to two gym towns which one will you head to?</span></div></div>",
            "created":1300510800,
            "id":1072898,
            "title":"Begin Journey"
        },
        "112121":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You head for Cyan town.Aerodactly is flying good but as soon as it gets dark he begins to yawn.Alright Aerodactyl we`ll land in that clearing for the night you instruct.As soon as Aerodactyl lands you let out your other Pokemon.Charizard lights a small fire and you all get some food and drift off to sleep.Does anything happen durin the night?</span></div></div>",
            "created":1300510800,
            "id":1072914,
            "title":"Cyan Town"
        },
        "1121212":{
            "choices":[
                "Wait",
                "Have A Look"
            ],
            "content":"<div class=\"\"><div> <span>You wake up early and head straight to Cyan Town.After arriving you head to the video phone.After a long chat with your mom you talk to an aid in professor Oaks lab and ask him to transfer some of your Pokemon.After this your current team is:Charizard,Garchomp,Armaldo and Umbreon.You are waiting for two of your other Pokemon that were left in certain areas to be called upon when needed.You head to the Gym to see that its not open yet.I guess I`m early you think.Wait or have a look around town?</span></div></div>",
            "created":1300510800,
            "id":1072965,
            "title":"No"
        },
        "11212121":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You take a seat on a bench by the gym door awaitng the arrival of the leader.You decide to plan a strategy but scrap the idea due to the fact that you dont know the gym leaders Pokemon or battle style.After waiting for a half an hour you see someone approaching the gym.He has a few Pokemon with him.Is he the gym leader?</span></div></div>",
            "created":1300510800,
            "id":1073055,
            "title":"Wait"
        },
        "112121211":{
            "choices":[
                "In The Prep Room",
                "Skip To Battle"
            ],
            "content":"<div class=\"\"><div> <span>You see a boy with a Typhlosion,Floatzel,Lucario and Zoroark.Hey there he calls out what are you doing?Im just waiting for the Gym to open you answer.Well I can help you with that he says as he steps up and open the door Gym Leader Donald at your service he says.Oh hello my name is Shane you say.Well its nice to meet you Shane he says smiling.Excuse me but why are those Pokemon following you,you ask pointing to the Pokemon?Oh these Pokemon are mine he replies.They wanted to come with me and watch the battle.I can actually understand what Pokemon say and these four are very close to me he replies.Oh thats cool you say.Just then someone else arrives.Hello Mark Donald says this is Shane he's challenging me today.Well nice to meet you Shane, I'm Mark the gym's referee Mark says.Mark turns and see`s Donald`s Pokemon.Are your Pokemon going to watch the match he asks?Yes they are Donald says and don't worry, they will behave right guys.All you could hear was the Pokemon`s cries.Ok then Donald says.You follow Donald into the Gym alongside Mark.Alright Shane Mark will take you to the prep room so you can get ready and just to let you know I have a unique way of doing things so I might just surprise you, so keep your guard up Donald says.Ok I look forward to it.You say as Mark leads you to the Prep room.What now?</span></div></div>",
            "created":1300597200,
            "id":1073119,
            "title":"Yes"
        },
        "1121212112":{
            "choices":[
                "Umbreon",
                "Armaldo"
            ],
            "content":"<div class=\"\"><div> <span>You stand in the designated area.After a few minutes Donald enters and stands in the designated area opposite you.<br>\r\nThis will be a three on three Pokemon battle Mark announced.The challenger Shane versus the Gym Leader Donald.Donalds Pokemon cheer and say things that he can understand.You ready Shane Donald asked?Ready as I`ll ever be you reply.Garchomp go you say throwing the pokeball onto a platform in the middlle of the water.Garchomp he says glancing at Donalds Pokemon.Nice Donald comments.Swampert you`re up he says as the large water Pokemon stands opposite Garchomp.Battle Begin Mark instructs.Challenger first Donald says.Alright you say.Garchomp Dragon Pulse you order.Swampert is hit but withstands the attack and shrugs it off.Swampert use Ice Beam Donald instructs.Garchomp is hit and hurt badly.Dragon Breath you order.Garchomp releases a foul concentrated breath at Swampert.Swampert is Paralyzed.Swampert Hammer Arm Donad calls out.Perfect you think.Garchomp jump for Swamperts arm you instruct.What Donald says in shock his Pokemon seemed to agree with him.Garchomp follows your order quickly and takes the hit from Swampert and is launched high in the air.Now Dragon Rush you order.Garchomp folds in his arms and keeps his head down as he flies straight into Swampert.Both Pokemon fall to the ground exhausted.Both Pokemon are unable to battle Mark says this round is a draw.That was some strategy Donald comments.Thanks you reply but Garchomp wasnt supposed to get hurt you say upset.Next Pokemon.</span></div></div>",
            "created":1300597200,
            "id":1073132,
            "title":"The Battle Begins"
        },
        "11212121122":{
            "choices":[
                "Worried",
                "Calm"
            ],
            "content":"<div class=\"\"><div> <span>You return Garchomp to his Pokeball.You did great Garchomp you say now take a good rest.Donald returns Swampert to his Pokeball.Then he looks over to his Pokemon and gets distracted.Hey are you ok Donald you ask?Oh Im fine he replies taking out another Pokeball.Milotic its your turn Donald calls out.Ok Armaldo go you call.Armaldo lets out a roar as he stands at the platform.Ok I`ll start things up Donald says Milotic Rain Dance.Milotic moves around Gracefully calling for heavy rain.Armaldo Ancient Power you order as Armaldo throws a grey sphere at Milotic causing a good amount of damage.Milotic in the water Donald shouts. Milotic slips in and she swims menacingly under Armaldo's platform.Perfect you think staying calm.Now Milotic Aqua Jet Donald calls out. Milotic bursts out of the water heading straight for Armaldo.Protect you call out.Armaldo glows white and as Milotic hit she bounces off leavening her wide open. Oh-no Donald shouts Milotic get away.To late, Armaldo X-scissor you call out.Armaldo attacks Milotic with both claws knocking her out.Milotic is unable to battle.Mark announces Armaldo is the winner.I must say I didn't expect that Donald comments.Thanks you reply.How is Donald looking?<br>\r\n</span></div></div>",
            "created":1300942800,
            "id":1075435,
            "title":"Armaldo"
        },
        "112121211222":{
            "choices":[
                "Umbreon",
                "Charizard"
            ],
            "content":"<div class=\"\"><div> <span>Donald calls Milotic back into her Pokeball.Take a good rest he says I promise your efforts won't go to waste.Although he was down to his last Pokemon you had a calm look on his face. All his Pokemon look at him looking slightly confused until his Floatzel stands up and says something you dont understand.Yes Sora that is exactly what I have in mind.He says as he lets his next Pokemon out.Floatzel it's time for you to take control.What are you planning?you say confused.Oh you'll see Donald replies Floatzel in the water.Floatzel does that with no question.Now use Whirlpool he calls out.Floatzel starts swimming in circles at great speed creating a huge whirlpool.Armaldo Protect you say. Armaldo does that however Donalds Floatzel does not attack.What's going on you ask confused?Armaldo turns back to normal.Now!Donald shouts Spin and use Aqua Jet though the eye of the whirlpool.As Floatzel does this the whirlpool creates a huge spinning column of water heading straight for Armaldo.No you shout as Armaldo is hit with massive force knocking him out.Armaldo is unable to battle Mark announces Floatzel is the winner.What do you think Donald says confidently I call it, Azure Missile.You say nothing still shocked by the amount of power. As soon as you refocus you bring out...</span></div></div>",
            "created":1300942800,
            "id":1075439,
            "title":"The Calm Before The Storm"
        },
        "1121212112221":{
            "choices":[
                "In The Prep Room",
                "Skip To After Healing"
            ],
            "content":"<div class=\"\"><div> <span>Go Umbreon you call.Umbreon glares at Donald and his other Pokemon.Floatzel in the water Donald calls again.<br>\r\nJust as planned you think?Floatzel Whirlpool Donald orders.Not so fast you say.Umbreon in the water you order.<br>\r\nWhat Donald says.Umbreon Toxic you say.Umbreon releases purple liquid into the water from his body.The entire pool<br>\r\nwater becomes a dark purple colour.Umbreon jumps out of the water back onto his platform.Floatzel out of the water Donald calls.But it was too late as Floatzel had been badly poisened.Umbreon Faint Attack you order as Umbreon disappears.Where is he Donald asks?One of Donalds Pokemon say something of him and Donald see`s the platform Umbreon jumps onto moving.Floatzel Water Gun he ordered.It hit Umbreon directly knocking him back a few Platforms.<br>\r\nQuick Attack you order not giving Floatzel any time to react.Umbreon runs incredibly fast tackling Floatzel and knocking<br>\r\nhim out.The Winner is Shane and Umbreon Mark Announces.Way to go Umbreon you say running across the platforms <br>\r\nTo Umbreon.You kneel down beside him and hug him.Way to go Umbreon you say.Donald looks at you.I will be back in moment Shane he says.Ok you reply.If you come with me I will heal your Pokemon Mark instructed.Alright you say following him.</span></div></div>",
            "created":1300942800,
            "id":1075453,
            "title":"Ace In The Hole"
        },
        "11212121122212":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You wait for Donald with Mark.Sorry I took so long Donald said trying to sound friendly.Not a problem you reply.<br>\r\nI congratulate you on beating me you say I'm proud to present you with the Sapphire Wave Badge.Thank you you say as Donald hands you the badge.You smile as you walk towards the door.Does anything happen?</span></div></div>",
            "created":1301374800,
            "id":1078452,
            "title":"Skip To After Healing"
        },
        "112121211222122":{
            "choices":[
                "Relax for the day",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>You leave the Gym and as you leave you see another trainer waiting to challenge the gym.Hey there you said opening the door as he stands up.Hi Im Scott he said.Im Shane nice to meet you,you say.So did you beat the Gym he asked?<br>\r\nYeah but it was tough,good luck with your challenge you say leaving.Thanks he says.What now?</span></div></div>",
            "created":1302066000,
            "id":1083385,
            "title":"No"
        },
        "1121212112221221":{
            "choices":[
                "Interuption",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>After sending Garchomp and Armaldo back to the lab you head to the park and relax with Charizard and Umbreon.Umbreon lies down beside you but Charizard keeps looking around.\"Dont worry Charizard\" you say \"I`m sure they`ll get here alright\"regarding your two Pokemon who have yet to come.Charizard continues to look around.\"If you want Charizard you can fly to meet them,you know the route right?\"you say.Charizard instantly takes off.\"Looks like its just us Umbreon\"you say.Umreon doesnt reply he just glares at the others in the park.After relaxing a while you get up and leave the park Umbreon walks beside you.\"How about some training?\"you ask.He slowly nods.You walk towards a training area opposite the gym.</span></div></div>",
            "created":1308891600,
            "id":1133421,
            "title":"Relax for the day"
        },
        "1122":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Okay ^_^",
                "I would like another"
            ],
            "content":"<div class=\"\"><div> <span>Name: Scott Allen<br>\r\nHome region: Sinnoh<br>\r\nPersonality: Does not do gym battles. He thwarts the plans of Team Galactic. He is hunted by team Galactic. His Gardevoir taught him to speak to pokemon. Gardevoir also taught a small amount of Psychokinesis (Light objects).<br>\r\nMain pokemon: Gardevoir, Salamence, Leavanny, Tranquill, Conkeldurr, Lucario<br>\r\nCurrent Location: Sapphire Lake</span></div></div>",
            "created":1300942800,
            "id":1075645,
            "title":"Scott Allen"
        },
        "11221":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Go to Cyan town",
                "Team Galactic is outside"
            ],
            "content":"<div class=\"\"><div> <span>I was just sitting on the edge of Sapphire Lake. You picked up 3 small pebbles with your mind &amp; threw them across the water. \"Good job,\" Gardevoir said, \"You are getting good at this.\" \"Thanks,\" I reply. I then got up &amp; went back home with Gardevoir. When you arrive at your home, you saw Salamence resting outside. Leavanny was practicing her moves on some wild pokemon. Tranquill was wating at the gate for you to come back. \"Hi Scott,\" he said. \"Hi Tranquill,\" you reply. You walk over to your house quietly. Tranquill followed you. Inside, you saw Lucario meditating. \"Hello Scott,\" he says with his eyes still closed. \"Hey Lucario,\" you say. You then go up the stairs into your room to see Conkeldurr asleep with the tv on. <i>You have got to stop watching tv Conkeldurr</i>, you thought. You used Psychokinesis to turn the tv off.</span></div></div>",
            "created":1300942800,
            "id":1075653,
            "title":"Psychokinetic Practice"
        },
        "112211":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "You arrive at Cyan Town",
                "Team Galactic"
            ],
            "content":"<div class=\"\"><div> <span><i>Maybe, I might give the pokemon gyms a shot</i>, you thought. You wake up Conkeldurr by lightly rubbing him. \"Conkeldurr wake up,\" you say quietly. He then wakes up. \"What is it Scott,\" he says. \"Do you want to join me in gym battles?\" you ask. \"Yeah okay,\" he replies, \"It will be a new thing.\" You then pull out his pokeball &amp; recall him. You then walk down stairs &amp; see Lucario &amp; Gardevoir talking. \"Do you two want to challenge pokemon gyms with me?\" you ask cheerfully. \"It will give me a challenge unlike team galactic,\" Lucario laughs. \"I am right behind you where ever you go,\" Gardevoir says. You then recall both of them into pokeballs. You then go outside &amp; see Salamence starting to wake up. \"Hey Salamence, do you want to go on a journey,\" you call out to him. \"Yeah okay,\" he says, \"I am a little bored.\" You then put him in his pokeball. You see Tranquill &amp; Leavanny in a double battle. In a few minutes they won. \"Do you both want tougher opponents?\" you ask. \"I would love that,\" they both said. You then called them both in pokeballs. You then set off for Cyan town.</span></div></div>",
            "created":1300942800,
            "id":1075676,
            "title":"Start of a Journey."
        },
        "1122111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "You go in.",
                "The door opens behind you as you get up"
            ],
            "content":"<div class=\"\"><div> <span>You arrive at Cyan town in a few hours. You had little trouble on the way there. When you see the pokemon centre, you go there to heal your pokemon. The next place you saw was the gym. <i>Finally</i>, you thought. You sit down on the steps &amp; call out Gardevoir. \"Hey Gardevoir, we are just going to relax for a minute,\" you said cheerfully. \"Okay,\" she replied, \"Why don't you practice your psychokinesis?\" You then pick up 3 small stones with your mind &amp; juggle them in the air. You then drop them after fiddling for a bit. \"Very good,\" Gardevoir said, \"Your getting better &amp; better!\"</span></div></div>",
            "created":1301979600,
            "id":1082897,
            "title":"You arrive at Cyan Town"
        },
        "11221112":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Challenge time"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay Gardevoir, time to go in,\" you say recalling her into her pokeball. You start to get up &amp; the door opens behind you. \"Hey there,\" someone said. \"Hi I'm Scott,\" you said as you got up. \"I'm Shane nice to meet you,\" he replied. <i>Did he challenge this gym</i>, you thought. \"So did you beat the gym?\" you ask. \"Yeah but it was tough. Good luck with your challenge,\" he said as he walked away. \"Thanks,\" you reply.</span></div></div>",
            "created":1302670800,
            "id":1087794,
            "title":"Pokemon Trainer Shane "
        },
        "112211121":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "In the prep room",
                "Skip to the battle"
            ],
            "content":"<div class=\"\"><div> <span>You walk in &amp; see 2 people talking one was obviously the gym leader. The other one looked like a referee. \"Hello?\" you said. They turn your way &amp; look at you. \"Hello,\" the gym leader said, \"I am Donald, Cyan towns gym leader. You got here just in time. I was about to go on a journey of my own.\" \"I am Scott,\" you replied happily, \"This is my first gym battle. But I tend to thwart the plans of Team Galactic. So much so, Team Galactic is offering a large bounty for me.\" \"Wow thats some history,\" Donald laughed. \"Yeah,\" you laugh. Then a Zoroark comes in the room. \"Hey Donald are you ready to go?\" he asked. \"Yeah, but first I am going to challenge this trainer,\" he said to him. \"Wait you can understand Pokemon?\" you asked surprised. \"Yes I can. I was born with an ability to understand pokemon,\" he explained. You smiled &amp; said, \"I can understand pokemon too.\" \"Really?\" he asked. \"Yes. I was given knowledge on how to by my Gardevoir,\" you said. \"Wow, thats cool. Now about that gym challenge. Follow Mark &amp; he will lead you to the prep room,\" he instructed. You nod &amp; follow the referee.</span></div></div>",
            "created":1302670800,
            "id":1087814,
            "title":"Challenge time"
        },
        "1122111212":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Leavanny",
                "Lucario"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You walk into the stadium &amp; see several platforms with bodies of water under. \"Ready Scott,\" he asked. You levitated a pokeball with Psychokinesis &amp; said, \"Who said I wasn't.\" You knew that in this pokeball was...</span></div></span></div>",
            "created":1302670800,
            "id":1087822,
            "title":"Skip to the battle"
        },
        "11221112121":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Lapras",
                "Milotic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You thought that this was a water gym judging by the bodies of water. So Leavanny would be a great start. Donald then pulled out a pokeball &amp; said, \"Go...</span></div></span></div>",
            "created":1308373200,
            "id":1128904,
            "title":"Leavanny"
        },
        "112211121211":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "You get first strike",
                "He moves first"
            ],
            "content":"<div class=\"\"><div> <span>\"Go, Lapras,\" he said tossing out his pokeball. Then a lapras appeared in the water. <i>An Ice type</i>, you thought,<i> not good</i>. \"I'm ready master,\" the Lapras said. How did he train his pokemon?\" Leavanny asked you quietly. \"I don't know, but its funny,\" you said to her chuckling slightly. \"Hey I didn't train my gym pokemon that way. The pokemon league did for Gym purposes,\" he claimed. He then pointed to 4 pokemon in the stands. \"I trained those 4 over there,\" he said. \"Hello,\" they said waving. You waved back at them. \"Any ways sorry about the hold up. Let's battle,\" he said. \"Alright,\" you replied.</span></div></div>",
            "created":1308373200,
            "id":1128944,
            "title":"Lapras"
        },
        "1122111212111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Tranquill",
                "Salamence"
            ],
            "content":"<div class=\"\"><div> <span><i>Attract would be useless</i>, you thought. \"Leavanny, use Leaf Blade,\" you said.  Leavanny ran up to Lapras &amp; attacked with the leaf on her arm. Lapras staggered back a bit. \"Lapras, use Blizzard,\" Donald said to his Lapras. \"It shall be done,\" she said while summoning a large icy wind. It hit Leavanny &amp; she got sent to the floor. \"Are you okay Leavanny?\" you asked. She got up &amp; then she couldn't move. \"Oh no, she is frozen,\" you said looking at her. \"Now use Body Slam,\" Donald said to Lapras. Lapras then jumped out of the water &amp; landed on Leavanny causing her to faint. \"Leavanny, return,\" you said. \"You did great considering a type disadvantage,\" you whispered to the pokeball. You then got out your next pokeball. \"Go...</span></div></div>",
            "created":1308373200,
            "id":1128963,
            "title":"You get first strike"
        },
        "11221112121111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Samorott",
                "Quagsire"
            ],
            "content":"<div class=\"\"><div> <span>\"Go Tranquill!\" you yelled while throwing a pokeball with psychokinesis. <i>Be ready for a suprise</i>, you thought. \"I'm ready,\" Tranquill said getting ready. \"Ok now, Lapras use Ice beam,\" Donald said. Lapras created a beam of ice towards Tranquill. Tranquill managed to avoid the attack. <i>Hope your ready</i>, you thought while smiling. \"Good job, now use Retaliate,\" you said. Tranquill then sped at Lapras at insane speeds. \"Lapras get out of there!\" Donald said worried. It was only milliseconds before Tranquill made contact. Lapras then fainted. \"Lapras, return,\" he said. He then said something to the pokeball. \"Well that was a good strategy there,\" Donald said. \"Thanks,\" you replied happily. He then said, \"Now lets go....</span></div></div>",
            "created":1308546000,
            "id":1129919,
            "title":"Tranquill"
        },
        "112211121211112":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "\"Go, Samaurott!\""
            ],
            "content":"<div class=\"\"><div> <span>\"...Quagsire.\" The quagsire appeared &amp; said, \"Yes sir.\" You chuckled slightly upon hearing this. Donald appeared to be focused &amp; ready. \"Use Sky Attack,\" you said to Tranquill. Tranquill then became cloaked in a harsh light. \"Use Scald,\" Donald said. The water below Tranquill went to boiling &amp; a large cloud of steam rose up &amp; hit him from below. Tranquill then launched his attack &amp; hit Quagsire. It appeared to do alot, but it did not make Quagsire faint. \"That should have obliteraed him,\" you said. You then noticed Tranquill had a burn. \"Oh, I am unlucky this time,\" you said. You saw that Quagsire was on the point of fainting. \"Use Quick Attack,\" you said. Tranquill then struck Quagsire at an insane speed causing him to faint. \"Were you setting the stage for your final pokemon?\" you asked. \"Yes I was,\" Donald laughed. \"This hurts a bit,\" Tranquill whispered to you. \"Hang in there,\" you replied. Donald had his next pokeball. He threw it &amp; said...</span></div></div>",
            "created":1308546000,
            "id":1129930,
            "title":"Quagsire"
        },
        "1122111212111121":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Send out Gardevoir",
                "Send out Conkeldurr"
            ],
            "content":"<div class=\"\"><div> <span>\"Go Samaurott,\" Donald called out sending out a pokeball. \"Ready for battle sir,\" the Samaurott said. <i>His pokemon sound like people from the military</i>, you thought. \"*Sigh* Sorry about that Scott,\" Donald said over to you, \"I just wish my gym pokemon would loosen up a bit.\" \"Hey that’s understandable,\" Scott said, \"Now are you ready or what.\" \"Alright then Samaurott Shell Blades ready,\" he called out. Samaurott takes a Shell Blade and places it in his mouth. \"Ok now Surf,\" he called out. Samaurott creates a massive wave that makes it's way to Tranquill. \"Use Fly,\" you called out. Tranquill then fly’s up in attempt to dodge the on coming wave. \"Samaurott, now ride the wave.\" you call. Samaurott get's on the wave and he is launched in to the air. \"What in the world?\" you said staring at Samaurott. \"Now Shell Blade.\" you call out. Samaurott takes the blade out of it's mouth and he strikes Tranquill causing him to faint. \"Tranquill return,\" you said calling your Pokemon back. \"You held iin there for a bit &amp; thats what matters,\" you whispered. \"Sorry if I was a bit rough on him,\" Donald called out, \"My battle style is a bit unorthodox.\" \"Don't worry, he just need's to rest,\" you said. </span></div></div>",
            "created":1308805200,
            "id":1132981,
            "title":"\"Go, Samaurott!\""
        },
        "11221112121111211":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Both collapsed on the ground",
                "One is still standing"
            ],
            "content":"<div class=\"\"><div> <span>\"Go Gardevoir! Show them your power,\" you said flinging a pokeball with psychokinesis. \"I will show the power of a psychic,\" Gardevoir said as she appeared. \"So this is your mentor?\" Donald asked. \"Yes,\" you said, \"Gardevoir taught me how to speak to pokemon &amp; use psychokinesis.\" \"Awesome,\" Donald said, \"So lets do this now. Ready Samaurott?\" \"Ready sir,\" Samaurott said. \"Lets show them our power,\" you said to Gardevoir. \"We will do this together,\" Gardevoir said. You both focused your thoughts &amp; you felt like you were one with Gardevoir. A dim, white aura surrounded you both. \"Lets use Energy Ball,\" you &amp; Gardevoir said in sync as Gardevoir started charging a green ball. \"Dodge it Samaurott,\" Donald said. You &amp; Gardevoir released it &amp; Samaurott attempted to dodge it. But he was hit barely by it. \"Wow, an aura link,\" the lucario in the benches said. \"Samaurott, use Hydro Pump,\" said. Gardevoir got hit by it &amp; you felt it. You both then fell back. \"Thunderbolt!\" you &amp; Gardevoir said. \"Use Ice Beam,\" Donald said. Gardevoir released a large bolt of thunder &amp; Samaurott released a huge beam of ice. The attacks hit &amp; created a huge explosion. You felt the explosion through Gardevoir &amp; the aura link faded. The dust cleared &amp; you saw...</span></div></div>",
            "created":1311138000,
            "id":1150833,
            "title":"The power of the Aura Link"
        },
        "112211121211112111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Back to Sapphire Lake for the night",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>As the dust cleared you saw that both Gardevoir &amp; Samaurott fainted. \"Both Pokemon have fainted and both sides are out of Pokemon,\" Mark announced, \"The match is a draw.\" You then ran to Gardevoirs side. \"We did well Gardevoir,\" you said quietly to her. \"Yes we did,\" she said, \"I just wish we had have won.\" \"We did our best &amp; that is all that matters,\" you said happily. Gardevoir smiled at this. You then helped her up. \"You put up a good fight,\" Donald said, \"Plus I didn’t expect to see an Aura Link, you truly are an experienced trainer.\" \"Thank you,\" you said, “My Pokemon are like family to me.” You noticed him smile. \"Well I’ll let you go and heal your Pokemon,\" Donald said, \"Meet me in front and I’ll present you your Gym Badge.\" \"Sounds good,\" you said while walking towards your prep room. \"I could feel it in him,\" Gardevoir whispered, \"He could learn Aura Link.\" \"Okay so he would be able to link with his Lucario?\" you asked. She nodded. You retreived Gardevoir into her pokeball for healing. You then placed your pokeballs in the healing machine. After they were healed, you went to the main lobby &amp; saw Donald was not there yet. But you did see his pokemon there. The Lucario approached you. \"Can you understand me?\" he asked. You smiled &amp; nodded. \"My name is Riku,\" he continued, \"I saw a burst of happiness come from Donald after that battle. I would like to give you this.\" He then handed you a slip of paper with a number &amp; the Donalds name. <i>An Xtranceiver number</i>, you thought. You then got out a note pad from your pocket &amp; wrote your number on it. You then noticed Donald come into the room. \"Sorry for keeping you waiting,\" Donald said. \"No problem,\" you replied. \"Well for a fine gym I present to you the Sapphire Wave Badge,\" Donald said as he gave you a badge. \"Thanks, oh and here,\" you said as you gave you a piece of paper with your number on. \"Your Pokemon gave me your number for some reason so here’s mine,\" you continued, \"Maybe we can meet up some time and battle again while you travel.\" You look at your Pokemon and they just look back smiling. \"Well I would like to battle you again,\" Donald said smiling, \"Great well I’ll see you later,\" you said as you walked out the door.</span></div></div>",
            "created":1311138000,
            "id":1151080,
            "title":"A Draw!"
        },
        "11222":{
            "author_id":"darkdragon78",
            "author_name":"darkblade45",
            "choices":[
                "Let the adventure begin.",
                "A different person."
            ],
            "content":"<div class=\"\"><div> <span>Name: Raven Anson<br>\r\nAge:17<br>\r\nProfession: Pokemon Trainer on the side works as a detective and even as a unofficial ranger at times.<br>\r\nAppearance: Dark blue eyes, a little grown out short dark red hair, wears a black bucket hat, back sunglasses, a red shirt with a black jacket and pants.<br>\r\nPersonality: A little cold and distant to most strangers, but when he opens up is a caring person even if he doesn't speak much.<br>\r\nLikes:His Pokémon and cool weather.<br>\r\nDislikes:People who abuse pokemon. Fools unwilling to accept reality and cling to delusions whether they be of grandeur or a impossible world order for they usually lead to people and pokemon to suffering.<br>\r\nSkills: A very keen eye for details, a very good grasp on strategies, extensive knowledge on pokemon types and moves and ways to counteract them, and very physically fit.<br>\r\nBio: Born in the Johto region to his mother Grace a famous Rhyhorn racer and his father Malkom A pokemon ranger reserve. His father died at a early age and was raised mostly by his mother, her Rhyhorn, and her Fletchling. At the age of eight during a routine race in Snowpoint city encountered a Sneasel befriended it. Grace originally didn't want to keep it but was eventually convinced when Raven snuck her onto their ride to the next race. At the age of twelve set out on a pokemon journey and during it discovered Team Flare and their plot. Throughout the journey he defeated each gym one by one and thwarted Team Flare time and time again until their destruction by their own hands in the end. Soon after that he challenged the elite four and champion Diantha and defeated them all back to back according to the rules and became the champion of the Kalos at he age of thirteen. After two years of being champion Raven gave the position back to Diantha to go traveling again without being hassled by the paparazzi. Now Two years later he comes to Ultima to looking for a new challenge for himself and pokemon. <br>\r\nCurrent pokemon Team: Sneasel, Charizard, Garchomp, Gardevoir, and Vaporeon</span></div></div>",
            "created":1441565880,
            "id":2030725,
            "title":"I would like another"
        },
        "1123":{
            "author_id":"gardevoirlovr7",
            "author_name":"Arufa Orime",
            "choices":[
                "Joe Bradburn",
                "New Character",
                "New Character"
            ],
            "content":"<div class=\"\"><div> <span>Name: Joe Bradburn<br>\r\nAge: 14<br>\r\nProffession: Pokemon trainer<br>\r\nAppearance: Green eyes, brown short shaggy hair, Grey hoddie with blue jeans and dark green and black backpack.<br>\r\nPersonality: Nice, cool, trys to be strong at times of stress and does very well at stratigizing.<br>\r\nLikes: Pokemon, science<br>\r\nDislikes: Team rocket<br>\r\nBio: Joe is a veteran pokemon trainer, born in the Sinnoh region he has fought through all regions and even bad guys like team galactic and team rocket. He disband team galactic with the help of his friends Dimond, Pearl, and Platinum. He has completed all leauges from Kanto to Univa. He has even beaten Red, the famous trainer from Kanto.<br>\r\nPokemon Team: Tortera, Gardevoir, Luxray, Lucario, Wartortale, Dewatt, Sucuine, and Simisear.<br>\r\n I hope you like his story as much as me!</span></div></div>",
            "created":1318482000,
            "id":1206046,
            "title":"Joe Bradburn"
        },
        "11231":{
            "author_id":"gardevoirlovr7",
            "author_name":"Arufa Orime",
            "choices":[
                "Fire Gym",
                "Water Gym"
            ],
            "content":"<div class=\"\"><div> <span>\"Huf, this is getting kinda repititive, don't you think gardevoir?\" \"He he, ya but this will be kinda fun I mean its a new region with new battles!\" (Can Understand Pokemon) \"Ya I guess... Oh ya that reminds me, Prof.Rowan is going to meet us at the harbor.\" \"Oh, then you should swich out to Tortara so he can see the progress whith him.\" \"Ya good idea, return.\" The red beam hits her and I call out Tortara. \"Hello Joe. How are you?\" \"I'm fine, we're almost there and Prof.Rowan is waiting for us.\" <i>\"This is your captin speaking we have arived at New Light City, you are dismissed from the boat unless you have a ticket for Univa or Sinnoh.\"</i> \"Ok Tortara, here we go!\"<br>\r\n<br>\r\nWe step off and smell the salty sea air. <i>\"Sniff sniff\"</i> \"Ahhhh, that smells great, reminds me of Sinnoh...\" \"Joe, Joe! Ah there you are!\" \"Prof.Rowan! It's wonderful to see you again! I haven't seen you since we beat Cynthia!\" \"Ahhhh, don't remind me, I still don't walk right after that Garchomp hit me with dragon rage...\" Tortara says to me. \"Well let me see how Tortara is doing. Hmmm, yes, I see... Tortara is doing great, it seems to be in amazing condition!\" <i>\"Here we go again, I can't stand it when people call pokemon <b>IT</b>...\"</i> I think rolling my eyes. \"Thanks for meeting up with us Prof, are you staying here?\" \"Oh yes, I heard there was some legondary pokemon here and I want to evaluate the spots reported for my research. I will also meet with you for some gym battles and the leage champion.\" \"Thanks Prof, mabye this time I'll catch a major legondary pokemon from this region like Pearl.\" \"Ahh yes, he caught Palkia the pokemon of space. That reminds me I wanted to give you this.\" Rowan hands me a master ball, the one that he gave Pearl, Dimond and Platinum. \"Wow, you think I can catch the legodary pokemon here?\" \"Of course I do, Pearl isn't here to spoil it for you now is he?\" \"Hahaha, I guess so, thank you, I wont let you down!\" \"I know you wont Joe.\" \"Good bye!\" I say. I turn off and run, Tortara after me. \"Good luck Joe...\" Rowan wispers.<br>\r\n<br>\r\n\"Ok acording to this we have the choice of Crimson City, a Fire type gym or Cyan Town a water gym... What do you think?\" </span></div></div>",
            "created":1318482000,
            "id":1206082,
            "title":"Another boat to another region..."
        },
        "11232":{
            "choices":[
                "Grey Kage",
                "New character"
            ],
            "content":"<div class=\"\"><div> <span>Name: Grey Kage<br>\r\n<br>\r\nAge: 15<br>\r\n<br>\r\nDiscription: Tall, thin, black hair with dark green tips. Green eyes that shift to grey at times of fear or stress. Normally wears a black tee-shirt and blue jeans. Has a black and green one strap backpack as well.<br>\r\n<br>\r\nBio: Grey was born in the Unovia region, as the adoptive son of N. He was taught to listen to pokemon and he knows how to speak to them. Unlike his father though he does like to battle. He made a stronger link than his father did with Zekrom! Grey battled through everyone, his favroite gym leader being Roxie. He admired her and strived to be a gym leader himself, but he was unable to because of his love for multipule types of pokemon. He went along with it and moved on, going to the sinnoh and hoenn regions and battling as well as starting up contests. Now he's here in Ultima and he's ready for more action!<br>\r\n<br>\r\nPersonality: Quriky, often changing. You never know what he'll do next! He can act a bit crazy at times too, so he's a wild card!<br>\r\n<br>\r\nTeam: Sammortt, Weavile, Crobat, Swoobat, Glaceon, Luxray, Emolga, Magmotar, and Ferrothorn.</span></div></div>",
            "created":1351227600,
            "id":1453926,
            "title":"Grey Kage"
        },
        "112321":{
            "choices":[
                "Crimson City",
                "Abandoned Plant"
            ],
            "content":"<div class=\"\"><div> <span>Grey looked out the window, watching the new region of Ultima come into view. New Light City was his destanation for right now, but he already knew what type of gym he'd be taking on next. Poison... He wanted to know if the poison Gym was as good as Roxie. He basically idolized her, thinking of her as a mentor in battle and stratagy. He knew what he was facing in a poison Gym of course. Toxic, venoshock, toxic spikes, the works... But he had a plan. Swoobat. She could stay away from the spikes and deal massive damage with heart stamp and physic. She would also keep the poison at by with attract and a pecha berry as a held item. If she fainted all he had to do was send out Crobat or luxray and simply overpower them.<br>\r\n<br>\r\n\"Here we go...\" Grey said as they pulled into the harbor. He stepped off the ship and looked around, a professor was just ahead with a name card. \"Grey Kage\" it read. \"Looks like I'm the only veteran trainer this time around...\" He spoke to himself, aproaching the woman.<br>\r\n<br>\r\n\"Ah! You must be Grey Kage then! I'm, the pokemon professor around here!\" She said, holding out a hand. Grey took it and shook lightly, not speaking to her. \"Well it's good to meet you!\" She said as she began to rummage through her bag. \"Now where did that starter set go...\" She pulled out another bag full of items and other goods and passed it to him. \"This is your starter kit, it holds ten extra pokeballs, a badge case, a ribbon case, ten potions and a region map. Grey took the bag and sorted the items into his own bag.<br>\r\n<br>\r\n\"You'll probably want to move on to one of the gyms closest to here, which would be Crimson city...\" She said, before turning and walking away. \"Oh! And good luck Grey!\"<br>\r\n<br>\r\nGrey simply sighed as she left and looked over the map. Crimson city was only one route away... But the Abandoned plant wasnt too far off either... Where should he go?</span></div></div>",
            "created":1351227600,
            "id":1453988,
            "title":"Grey Kage"
        },
        "1123211":{
            "choices":[
                "Catch it! It seems to like you!",
                "Faint it! EXP and it knocked you over after all!"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what... I think we should head to Crimson city...\" Grey said, walking down the harbor docks to a pokemon center and heading over to the shop section. \"Ten pokeballs, fifteen ultra balls and twenty hyper potions...\" He said, pulling out his wallet and counting the money. He was passed the items and a white pokeball as well. \"Permier ball, free with every purchse of ten pokeballs.\" The clerk said. Grey merely nodded and pushed the items into the correct places in his bag. He then passed the money to the clerk, zipped the bag and headed out. <br>\r\n<br>\r\n\"Alright... I think we should do some training...\" He said as he looked over the new route. \"There is bound to be some strong pokemon here...\" He nodded and pulled out his pokeball. \"Come on out! Samurott!\" He called out, throwing the pokeball into the air. Samurott came out in a flash of bright light and smiled, streaching out. <br>\r\n<br>\r\n\"A fire gym then? Piece of pie...\" He said, popping his back. Samurott grined and pulled out his shell sword, polished and sharp as mewtwo's physco cut. \"I think this'll be fun...\" He said, putting it back into it's sheath.<br>\r\n<br>\r\nGrey sighed at his pokemon's cocky aditude. \"We should still train... You never know what they might have up their sleeves.\" He said, trying to get Samurott to act less cocky. The pokemon was like his old friend Barry... Always so damn cocky... \"Anyways... Come on, lets get some training done...\" He said walking down the route and into the trees.<br>\r\n<br>\r\n A rustle close by in a bush. \"Here we go...\" He said, staring it down. Suddenly in a flash of purple and creamy orange Grey was on the ground, being licked over his face. \"Gah! Mother of mew!\" He cried out complety suprised. A liepard was on top of him. <br>\r\n<br>\r\nWhat should he do? Catch or faint? </span></div></div>",
            "created":1351227600,
            "id":1454004,
            "title":"Training for a firey battle!"
        },
        "112322":{
            "author_id":"rhinosaurusrex",
            "author_name":"Rhinosaurus Rex",
            "choices":[
                "Let's Go with Austin",
                "New Character..."
            ],
            "content":"<div class=\"\"><div> <span>Name: Austin Motto<br>\r\nGender: Male<br>\r\nAge: 17<br>\r\nDOB: 12/01<br>\r\nRole: Water Trainer<br>\r\nPartner: Croco (Totodile)<br>\r\nHometown: Snowbelle City, Kalos Region.<br>\r\nPersonality:<br>\r\nAustin has a fun and optimistic personality. He is laid back and Ignorant but it doesn't show very often. Austin loves Water Type pokemon and dreams of becoming the world's best Water Pokemon Master. He will refuse to use any other type of pokemon in battle which hinders his ability at points but he has always been able to look at the bright side of things even in the grimmest of situations.<br>\r\n<br>\r\nHistory:<br>\r\nAustin grew up in Snowbelle City in the Kalos region and is very used to colder climates. He enjoys journeying to the pokemon village to play with the pokemon there. One day he discovered and injured Totodile in the village, he took it home and cared for it, the two became best friends and once the Totodile was back to full health it refused to leave, so Austin caught it and named it Croco. After fighting in the Kalos League Austin wanted to train more before challenging the Champion so he traveled to a new region to fight in the league there. He left behind all his pokemon and only brought Croco.<br>\r\n<br>\r\nPokemon:<br>\r\n<br>\r\nName:Croco<br>\r\nSpecies: Totodile<br>\r\nNature:Adamant <br>\r\nHeld Item: N/A<br>\r\nAbility: Torrent<br>\r\nMoveset: Water Gun, Ice Fang, Crunch, Chip Away.</span></div></div>",
            "created":1456530480,
            "id":2109996,
            "title":"Austin Motto"
        },
        "11233":{
            "author_id":"bearclaw258",
            "author_name":"Silent Reader",
            "choices":[
                "Jason Bagatta",
                "New Character"
            ],
            "content":"<div class=\"\"><div> <span>Name: Jason Bagatta<br>\r\nAge: 15<br>\r\nProffession: Pokemon Trainer<br>\r\nAppearance: Blue eyes,  light brown shaggy hair, dark blue shirt, black vest (like from the original outfit of Brock), cargo pants, and crimson backpack.<br>\r\nPersonality: Kind and caring for pokemon, but neutral to fellow people. If he can help it, he never likes to travel without one of his pokemon out with him. The fact is, Jason hates to be alone and if none of his pokemon are beside him, he sometimes forgets he has his team with him.<br>\r\nLikes: All kinds of Pokemon (mostly ice and eeveeltions)<br>\r\nDislikes: Being alone, Tamato berries, and people who hurt pokemon (which is why he doesn't like other humans that much)<br>\r\nBio: Jason's parents constantly moved, so he grew up in just about all the regions. He started out in Johto and he still remembers the first pokemon he encountered there. It was a sneasel and it tried running away at first, but when a tree almost toppled and crushed Jason, the sneasel saved him by creating a pillar of ice to prevent it from falling over any further. Jason could have sworn he heard a bit of muffled english from the sneasel, but it was mixed with poke-speech.<br>\r\nPokemon Team: Glaceon (first official pokemon), Espeon, Umbreon, Luxio, Blaziken, Golbat</span></div></div>",
            "created":1375905360,
            "id":1642254,
            "title":"Jason Bagatta"
        },
        "112331":{
            "author_id":"bearclaw258",
            "author_name":"Silent Reader",
            "choices":[
                "Continue talking",
                "Arrival"
            ],
            "content":"<div class=\"\"><div> <span>I let out a sigh as I leaned over the rail of the ship that I boarded a few hours ago. I was headed to yet another region to add to my list of regions I've been in. Espeon was sitting next to me looking into my eyes. 'Is something wrong?' She asked using her telepathy. I looked down at her.<br>\r\n<br>\r\n\"You know you don't have to use your telepathy, right?\" She smiled, closed her eyes, and tilted her head.<br>\r\n<br>\r\n'Come on, you and I both know that your understanding of poke-speech is still a little rough around the edges.' She said reminding me that I've still been unable to fully understand what pokemon say. She would use telepathy to get her messages clear, but I don't want her to. I need to perfect my understanding and if she doesn't verbally speak to me, I can't get proper practice.</span></div></div>",
            "created":1375910400,
            "id":1642309,
            "title":"Jason Bagatta"
        },
        "1123312":{
            "author_id":"bearclaw258",
            "author_name":"Silent Reader",
            "choices":[
                "It was a scream",
                "It was a battle"
            ],
            "content":"<div class=\"\"><div> <span>I let out a sigh again at what espeon just said to me still telepathically. \"Espeon, I'm serious. I want to be able to understand all pokemon. How am I supposed to know what the rest of the team are trying to say if I'm out of practice?\" Espeon looked a little guilty and she spoke to me.<br>\r\n<br>\r\n\"Esorry Jaseon.\" Like she had said already, my understanding of pokemon speech was still a little rough around the edges. \"Es just-\" She was cut off when we could hear the captain speaking over the intercom on the ship.<br>\r\n<br>\r\n<i>\"Attention all passengers. We will be arriving in Ultima very shortly. If you have a ticket for a different stop, please remain on the ship as we will be leaving soon after arrival. Thank you and have a great day.</i> Espeon and I looked at each other and smiled the same way she did a moment ago.<br>\r\n<br>\r\nSoon enough, the ship arrived in the port of New Light City and there was a registration terminal waiting at the edge of the town. I had been given a ticket before I boarded the ship and apparently, this is what it was for. I inserted the ticket into a slot and something popped out a few seconds later. I took it and it was a license for the Advance League! I knew I shouldn't lose this so that I could challenge all the gyms on the island. Without it, I'd only be eligible to battle in select gyms.<br>\r\n<br>\r\n'What's that?' Espeon asked me with her telepathy. I just shrugged ignoring the fact that she hadn't verbally spoken to me yet again.<br>\r\n<br>\r\n\"I guess this is what we need to battle in all the gyms.\"<br>\r\n<br>\r\n'How does that work?' Espeon asked.<br>\r\n<br>\r\n\"I'm not sure... maybe they have guards in front of the Advance League gyms or something.\" Suddenly, Espeon and I heard something in the city. We went to go investigate.</span></div></div>",
            "created":1375916520,
            "id":1642367,
            "title":"Arrival"
        },
        "11233122":{
            "author_id":"bearclaw258",
            "author_name":"Silent Reader",
            "choices":[
                "\"You want to fight too?\"",
                "\"Uh-oh\" *runs away*"
            ],
            "content":"<div class=\"\"><div> <span>As we approached the spot where we heard a loud crashing sound, there was a shattered box with a knocked out scyther on top of it. In front of it was a machoke who had a victorious grin on his face. \"I won!\" A boy who looked jut a bit younger than I had declared. Suddenly, espeon looked a little on edge as she looked at the boy.<br>\r\n<br>\r\n'I don't like him.' I looked at her curiously.<br>\r\n<br>\r\n\"What do you mean? Why not?\"<br>\r\n<br>\r\n'I don't know, but there's something not right here... I think there was more to this battle than meets the eye.' She stated only to me. I looked at the two boys who had their battle and what I saw was shocking beyond words. The boy who had lost gave the victor a pokeball and it seemed to recall the scyther that had just been beaten. Were both the pokemon his?<br>\r\n<br>\r\n\"Thanks for the new pokemon. I'm sure I'll be a better trainer anyway.\" Something snapped in me that made me shout out.<br>\r\n<br>\r\n\"HEY!\" I rushed over and I was not in the mood to be humored right now.</span></div></div>",
            "created":1375938660,
            "id":1642529,
            "title":"It was a battle"
        },
        "112331221":{
            "author_id":"bearclaw258",
            "author_name":"Silent Reader",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>The boy turned to me and smirked. \"Well, well... you want to place a wager too?\" I would have punched him if I wasn't already appalled by what I just saw.<br>\r\n<br>\r\n\"What is going on here?\" I asked unamused with his offer.<br>\r\n<br>\r\n\"We just had a wager battle. The loser forks over the pokemon that is beaten in the battle.\"<br>\r\n<br>\r\n\"That scyther is not yours!\" I said revolted.<br>\r\n<br>\r\n\"Hey, I won that battle fair and square! You don't believe me? Let's go at it!\" He looked at espeon and grinned. \"If I win, that espeon is mine.\" I clenched my teeth and my fist at that.<br>\r\n<br>\r\n'Do it.' Espeon said to me telepathically... as usual. 'I don't like this kid and now I know why.'</span></div></div>",
            "created":1376257620,
            "id":1644309,
            "title":"\"You want to fight too?\""
        },
        "1123312211":{
            "author_id":"bearclaw258",
            "author_name":"Silent Reader",
            "choices":[
                "Let's go machoke!",
                "Different pokemon"
            ],
            "content":"<div class=\"\"><div> <span>I thought about it for a moment and, trying not to glare at the boy, I nodded.<br>\r\n<br>\r\nThe two of us backed up a bit and I was about to recall Espeon before the boy yelled at me. \"Hold it! I said when I win, that espeon is mine. First of all, that means you have to fight with it!\" I hated when people called any pokemon 'it'. \"Second of all, you don't look like you fancy my terms of victory. What will you get if you win?\" I already knew the answer to that.<br>\r\n<br>\r\n\"Then you give scyther back to him.\" I said pointing to the boy who still looked down, but wanted to see my fight with this boy. He simply grinned.<br>\r\n<br>\r\n\"Alright, in that case, I really have nothing to lose. That scyther was weak. What good is it to me?\" This boy was really pushing it.<br>\r\n<br>\r\n'That's it!' Espeon sounded furious as she jumped forward in a battle ready stance. The boy smirked again.</span></div></div>",
            "created":1376261340,
            "id":1644340,
            "title":"Yes"
        },
        "113":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Yes, Let's follow Donald's story.",
                "No, I want a diferent Gym Leader."
            ],
            "content":"<div class=\"\"><div> <span>Name: Donald Mason<br>\r\nAge: 16<br>\r\nHome region: Jotho<br>\r\nProfession: Pokemon Trainer/Water Gym Leader<br>\r\nAppearance: Blue eyes, Brown hair, usually wares a graphic tee shirt with jeans.<br>\r\nPersonality: Friendly and understanding, but extremely shy.<br>\r\nLikes: Water, Video Games, His Pokemon.<br>\r\nDislikes: Bugs, Snakes (However he has a Serperior and Milotic), and people who mistreat Pokemon.<br>\r\nSkills: Has the ability to understand Pokemon and knows basic ninja skills.<br>\r\nBio: When he was born he had the ability to understand Pokemon. Donald wasn't very open when he was little, not even to his own parents. However he felt he could always share his feeling with Pokemon and he vowed to become a great Pokemon trainer when he grew up. On his tenth birth day he received two Pokemon eggs from relatives in Sinnoh which later hatched into Buizel and Riolu and he also got his starter Pokemon, Cyndaquil. With those three Pokemon by his side he challenged the Jotho league wile catching new Pokemon friends on the way. After beating the Jotho champion he traveled to the other regions and beat them as well. He became a very well know trainer and he hade a huge collection of Pokemon which he treated as family. Soon he was given the opportunity to become a Gym leader in Ultima. Donald, his mom and his little brother all moved to Ultima where he leads the Cyan Town Gym. He love's his job, but sometimes he feel confined and wishes to see more of Ultima.<br>\r\nDonald's Gym Pokemon: Floatzel, Lapras, Milotic, Swampert, Samurott, and, Quagsire<br>\r\nDonald's Main Pokemon: Sora:Floatzel, Riku:Lucario, Flint:Typhlosion, Cloud:Zoroark, Kiba:Mightyena, Neku:Jolteon, Beat:Marowak, Nick:Dragonite, Sho:Serperior, Tao:Mienshao, Dimitri:Sableye, Millenia:Swoobat, Miku:Lopunny, and Luka:Milotic <br>\r\nDonald’s Sub Pokemon: Shiki:Vaporeon, Joshua:Espeon, Xion:Umbreon, Crino:Glaceon, Suwako:Leafeon, Flare:Flareon, Nova:Ninetails, Edge:Absol, Jet:Shiny Buizel, Rhyme:Cubone, Rin &amp; Len:Eevees, and Miles:Haxours<br>\r\n<br>\r\nDo you want to go with Donald<br>\r\n<br>\r\n(Note: Donald has many more Pokemon then the ones listed.)</span></div></div>",
            "created":1300424400,
            "id":1072000,
            "title":"Donald Mason"
        },
        "1131":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "I think I'll head home.",
                "I think I'll stay and clean up.",
                "I think I'll go for a walk by the sea."
            ],
            "content":"<div class=\"\"><div> <span>You stand out side Cyan Town Gym on a nice warm evening. You and the Gym referee Mark are congratulating a young boy who has just beat you in battle. “I’m proud to present to you the Wave Badge.” you say to the young boy. “Thank you Donald.” the boy says “It means a lot to me.” “Hey maybe after you beat the Junior League you and I can have a battle with my actual team.” you say happily. “I will.” the boy says as he takes of to is next town. “You are in good spirits Donald.” Mark says to you. “That boy fought with a lot of spirit.” you reply “And that’s what I like to see in a trainer.” You then step into the Gym and you go and see your Gym Pokemon. “Greeting’s Master.” all the Pokemon say at the same time. “Please don’t call me that.” you say “When we are not in battle please call me Donald.” “But we are suppose to call you Master.” Samurott says “It’s in our training.” Although these Pokemon are yours they where trained by the Pokemon League specifically for use in the Gym. “What ever, anyway I came to say you all did good out there.” you say “I expect more great work from you guys tomorrow.” “Yes Sir.” they all say as you leave the room. “Why do you always talk to them after every battle.” Mark asks you. “I just want them to know that I appreciate them.” you reply “You know you should get a Mini Translator and talk to your Pokemon some time. I got one at home that I don’t need you can use.” “Thanks, but like having what Pokemon say be a mystery.” Mark says “So what are you going to do Donald.” You think for a second and you reply…</span></div></div>",
            "created":1300424400,
            "id":1072001,
            "title":"Donald's story."
        },
        "11311":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Some of your Pokemon.",
                "Nothing."
            ],
            "content":"<div class=\"\"><div> <span>\"I think I better get home.\" you say \"It's been a long day.\" \"Ok take care.\" Mark says as you walk away. You walk though Cyan Town and you watch as the sun set's over the mountains in the distance. You soon arrive at a small ranch on the edge of town. This ranch was yours, you got it when you moved to Ultima so all your Pokemon could live comfortably. \"I home.\" you say as you step into the house. You look and see a note on the counter \"Dear Donald, I went to Skyline City for groceries and Zach is spending the night at JJ's. Please behave wile I'm gone. Love Mom.\" \"I guess I have the house to my self for a little bit.\" you say as you look around \"I wonder were the others are?\" You walk up the stairs to you room. You open the doors and see...</span></div></div>",
            "created":1300510800,
            "id":1072485,
            "title":"Home Sweet Home."
        },
        "113111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "\"Check on some of the other Pokemon.\"",
                "\"Get some food.\""
            ],
            "content":"<div class=\"\"><div> <span>You step in and you see Sora, Riku, Flint, and Cloud (Floatzel, Lucario, Typhlosion, and Zoroark). \"Hey Donald how was your day?\" Sora asks. \"It was fun.\" you say as you fall on to your bed \"But boy it's been long.\" <br>\r\nThese Pokemon have been with you ever since you traveled Johto. You got Sora and Riku from pokemon eggs you got on your birth day and you got Flint as your starter. You found Cloud on a stormy evening in Goldenrod. You where taking the opportunity to see Sora use Swift Swim when you saw a wooden box floating in the water. You took Cloud into your care and you trained him in secret disguising him as a Umbreon. Ever since then these Pokemon have been very close to you. They where like brothers to you each with there own traits. Sora is very friendly, Riku is very easygoing, Flint acts like an older brother to you, and Cloud likes to go with the flow. <br>\r\n\"Hey Donald did you hear the news?\" Riku says \"There is a ship coming in the morning and all the professors are coming in to give a speech.\" \"Ah cool.\" you say \"It would be great to see professor Elm again.\" \"What do you mean by that?\" Flint asks \"Aren't you going?\" I wish I could, but I got to get ready for the new challengers.\" you reply \"I can't skip out on my Gym Leader responsibilities.\" \"You know Nick could get you there and back before any challengers got here.\" Cloud stats. \"I know, but still I don't have time for that sort of stuff.\" you say as you stand up. They all look at you with slight concern on there faces. \"Well I guess I better…”</span></div></div>",
            "created":1300510800,
            "id":1072502,
            "title":"Your Pokemon Brothers. "
        },
        "1131111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "The next morning.",
                "During the night."
            ],
            "content":"<div class=\"\"><div> <span>\"I should probably check on the others.\" you say as you walk down stairs. They follow behind as you step out side. \"Good guy your home.\" you hear as your Mienshou (Tao) jumps and lands on your head \"Tao, is happy your home good guy.\" \"Ha ha, and I'm happy to see you too Tao.\" you laugh as you pick her up. \"Hey look whose home.\" You turn and you see Neku and Kiba (Jolteon and Mightyena) \"So I bet you had some pretty sweet battles today.\" Neku says. \"Eh, same old, same old.\" you say casually \"So what’s been going on here?\" \"Not much.\" Kiba says \"Things have been quite here.\" \"Yeah it has been quiet lately.\" you reply \"I kinda miss traveling.\" All of your Pokemon look at you. \"Are you ok Donald?\" Flint asks. \"I'm fine.\" you reply \"I like being a Gym Leader.\" You continue though your ranch talking to all your Pokemon. When you come back inside you see your mom and her Miltank. \"Hello Donald how was your day.\" you mom asks. \"It was good.\" you reply. You sit down and eat dinner and you then head up stairs along with Some of your other Pokemon. \"Good night guys.\" you yawn. You hear no reply as your Pokemon get in there beds. You soon drift to sleep worn out from your day. Then... </span></div></div>",
            "created":1300510800,
            "id":1072903,
            "title":"Walking the ranch."
        },
        "11311111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "A chalanger.",
                "Mark waiting to greet you."
            ],
            "content":"<div class=\"\"><div> <span>You wake up the next morning feeling alert and ready. \"Morning, Donald.\" you look at the foot of your bed and you see Sora Riku Flint and Cloud looking at you. \"Hey guys.\" you reply \" Why are you up, your all normally asleep this early in the morning.\" \"We wanted to see you battle today.\" Flint says with a strange smile on his face. \"Can we come and watch.\" Sora adds having the same smile as Flint. \"Sure you guys can.\" you reply happily \"You know I like it when you watch.\" you go down stairs, eat some breakfast, and you say good bye to your mom as you head out with your Pokemon Brothers staying close by. As you stop by the store to buy a soda like you do every morning you notice that they still have that smile on there face. \"Ok What's up you guys?\" you ask feeling suspicious. \"What do you mean by that?\" Riku asks. \"You all have been looking at me with that smile all day.\" you state \"Are you guys hiding something from me?\" \"No way, we're just looking forward to seeing you battle.\" Cloud replies. \"Right.\" you say not totally convinced. You continue to the Gym and you soon see...</span></div></div>",
            "created":1300510800,
            "id":1072930,
            "title":"An unusual morning."
        },
        "113111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Profeser Elm. (He has come to watch your match.)",
                "Readers Choice."
            ],
            "content":"<div class=\"\"><div> <span>You see a teenage boy sitting on the bench by the door of the Gym. \"Hey there.\" you call out \"What are you doing?\" \"I'm just waiting for the Gym to open.\" the boy says. \"Well I can help you with that.\" you say as you step up and open the door \"Gym Leader Donald at your service.\" \"Oh, then hello my name is Shane.\" the boy says. \"Well it's nice to meet you Shane.\" you say smiling. \"Um, pardon me asking, but why are those Pokemon following you.\" Shane asks pointing to your Pokemon. \"Oh these Pokemon are mine.\" you reply \"They wanted to come with me and watch the battle. I can actually under stand what Pokemon say and these four are very close to me.\" \"Oh that’s cool.\" Shane says. Just then Mark arrives. \"Hello Mark.\" you say \"This is Shane, he's challenging me today.\" \"Well nice to meet you Shane, I'm Mark the gym's referee.\" Mark says as he turns and sees your Pokemon \"Are your Pokemon going to watch the match?\" \"Yes they are.\" you say \"And don't worry, they will behave right guys.\" \"Yes we'll behave.\" All your Pokemon say at the same time. \"Ok then.\" you say as you walk in followed by Mark and Shane \"Alright Shane Mark will take you to the prep room so you can get ready. And just to let you know I have a unique way of doing things so I might just surprise you, so keep your guard up.\" \"Ok I look forward to it.\" Shane says as Make leads him. You and your Pokemon walk to your room. You walk in and you see...</span></div></div>",
            "created":1300597200,
            "id":1073098,
            "title":"Trainer Shane."
        },
        "1131111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Floatzel, Milotic, and Swampert.",
                "Samurott, Quagsire, and Lapras."
            ],
            "content":"<div class=\"\"><div> <span>\"Why hello Donald.\" you turn and you see Professor Elm sitting down on a chair. \"Professor Elm.\" you say haply \"This is a huge surprise, what are you doing here?\" \"Well I came to Ultima to give a speech, but I thought I would come and pay my favorite little assistant a visit and watch him battle.\" \"Well I'm very happy to see you.\" you reply.<br>\r\nWhen you where little you always hung around Professor Elm's lab to visit with all the Pokemon. Professor Elm was fascinated by your ability to communicate with Pokemon and usually let you help out with some of his research. The one thing you liked was when a trainer came to the lab and you got to see new Pokemon. When you became a Pokemon Trainer gave you a lot of support though out your journey.<br>\r\n\"Well you should probably head out and battle your challenger.\" Professor Elm says \"I'll be watching from the stands.\" \"Ok I will.\" you say as you look at your Pokemon \"You guy's go and head to the stands.\" \"Good luck out there Donald.\" Sora says. \"Well be cheering for you.\" Riku adds \"Thanks guy's\" you say as you enter your prep room. You see that your Gym team are in there Pokeballs ready to battle. \"Ok the battle is a three on three, single.\" you think to your self. What team will you chose?</span></div></div>",
            "created":1300770000,
            "id":1074305,
            "title":"Your good friend, Profeser Elm."
        },
        "11311111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Floatzel",
                "Milotic"
            ],
            "content":"<div class=\"\"><div> <span>You grab Floatzel, Milotic, and Swampert's Pokeballs and you walk towards the arena. The arena is a pool of water with platforms floating in various spots. The roof is also open so whether can also take affect. You stand in your designated area and you see Shane standing on the opposite end. \"This will be a three on three Pokemon battle Mark announces \"The challenger Shane versus the Gym Leader Donald.\" \"You can do it Donald.\" You turn and you see your Pokemon cheering for you \"Show him why you are Gym Leader.\" \"You ready Shane?\" you ask. \"Ready as I'll ever be.\" Shane replies as he takes a Pokeball out and tosses it \"Garchomp go\" You see a Garchomp appear on top of one of the platforms. \"I'm ready to Battle.\" Garchomp says looking at you. \"Nice.\" you comment as you let Swampert out of his ball \"Swampert your up.\" \"Yes Sir.\" Swampert says as he takes his position. \"Battle Begin.\" Mark calls out. \"Challenger first.\" you say. \"Alright.\" Shane replies \"Garchomp Dragon Pulse.\" You watch as Garchomp’s attack hits Swampert, but Swampert stands strong. \"Not bad.\" you think as you call your command \"Swampert Ice Beam.\" You see Swampert's attack hit cleanly, causing massive damage to Garchomp. \"Dragon Breath.\" Shane commands. Garchomp releases a foul  concentrated breath at Swampert hitting him and Paralyzing him. \"Swampert Hammer arm.\" you call  out. \"Garchomp jump for Swamperts arm.\" Shane calls out. \"What\" you and Swampert say in confusion. Garchomp leaps for the are taking the hit sending him flying up. \"Now Dragon Rush.\" Shane calls out. Garchomp folds his arms and keep's his head down as he fly’s towards Swampert. As Swampert was hit both him and Garchomp was knocked out and fell to the ground. \"Both Pokemon are unable to battle.\" Mark calls out \"This round is a draw.\" \"That was some strategy.\" You comment. \"Thanks.\" Shane replies \"But, Garchomp wasn't supposed to get hurt.\" he finishes sounding upset. What Pokemon do you use next?</span></div></div>",
            "created":1300942800,
            "id":1075310,
            "title":"Let the battle begin."
        },
        "113111111112":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Worried",
                "Calm"
            ],
            "content":"<div class=\"\"><div> <span>Shane then returns Garchomp to it's Pokeball. \"You did great Garchomp.\" Shane says \"Now take a good rest.\" You return  Swampert to his Pokeball. \"You where awesome Swampert.\" you say \"You deserve a good rest.\" \"Your doing great.\" you heat Cloud call out. You look over and you see something unusual. You notice that Flint is talking with Professor Elm. \"<i>Wait Professor Elm doesn’t use a Translater.</i>\" you think to yourself \"<i>How are they talking?</i>\" \"Hey are you ok Donald?\" Shane says. \"Oh, I'm fine.\" you say taking out Milotic \"Milotic it's your turn.\" \"Yes Master.\" she says as she take her position. \"Ok, Armaldo Go\" Shane shouts throwing the Pokeball. You see an Armaldo appear on one of the platforms. \"Let's do this.\" Armaldo says. \"Ok I'll start things up.\" you say \"Milotic Rain Dance.\" Milotic moves around gracefully calling froth a heavy rain. \"Armaldo Ancient power.\" Armaldo throws a grey sphere at Milotic causing a good amount of damage. \"Milotic in the water.\" you shout. Milotic slips in and she swims menacingly under Armaldo's platform. You notice that Shane is staying calm. \"Now Milotic Aqua Jet\" you call out. Milotic bursts out of the water heading straight for Armaldo. \"Protect.\" Shane calls out. Armaldo glows white and as Milotic hit she bounces off leavening her wide open. \"Oh-no.\" you shout \"Milotic get away.\" \"To late, Armaldo X-scissor.\" Shane calls out. Armaldo attacks Milotic with both claws knocking her out. \"Milotic is unable to battle.\" Mark announces \"Armaldo is the winner.\" \"I must say I didn't expect that.\" you comment. \"Thanks.\" Shane replies. How are you feeling?<br>\r\n</span></div></div>",
            "created":1300942800,
            "id":1075317,
            "title":"Round 2"
        },
        "1131111111122":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Umbreon.",
                "Charizard"
            ],
            "content":"<div class=\"\"><div> <span>You call Milotic back into her Pokeball. \"Take a good rest.\" you say \"I promise your efforts won't go to waste.\" Although you where down to your last Pokemon you had a calm look on your face. All your Pokemon look at you feeling slightly confused until Sora stands up. \"Wait, Donald are you planning?\" Sora shouts. \"Yes Sora that is exactly what I have in mind.\" You say as you let Floatzel out \"Floatzel it's time for you to take control.\" \"Yes Sir.\" he says taking his position. \"What are you planning?\" Shane says confused. \"Oh you'll see.\" you reply \"Floatzel in the water.\" Floatzel douse that with no question. \"Now use Whirlpool.\" you call out. Floatzel starts swimming in circles at great speed creating a huge whirlpool. \"Armaldo Protect.\" Shane says. Armaldo does that however your Floatzel douse not attack. \"What's going on?\" Shane asks confused. You soon see Armaldo turn back to normal. \"Now!\" you shout \"Spin and use Aqua Jet though the eye of the whirlpool.\" As Floatzel douse this the whirlpool creates a huge spinning column of water heading straight for Armaldo. \"Armaldo quick Protect.\" Shane calls out in a panic. Armaldo try’s, but it douse nothing. \"Oh-no!\" Shane shouts as Armaldo is hit with massive force knocking him out. \"Armaldo is unable to battle.\" Mark announces \"Floatzel is the winner.\" \"What do you think.\" you say confidently \"I call it, Azure Missile.\" Shane says nothing still shocked by the amount of power. As soon as he refocuses he brings out...</span></div></div>",
            "created":1300942800,
            "id":1075320,
            "title":"Your Secret Weapon."
        },
        "11311111111221":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "In the Prep room.",
                "Skip to after healing."
            ],
            "content":"<div class=\"\"><div> <span>\"Go Umbreon.\" Shane calls. His Umbreon glares at you and your Pokemon. \"Floatzel in the water.\" you call out. You notice Shane smiling. \"What is he planning you think \"Floatzel Whirlpool.\" \"Not so fast.\" Shane says \"Umbreon in the water.\" \"What?\" you say feeling a bit confused. \"Umbreon Toxic.\" Shane says. Umbreon releases a purple liquid from it's body which turns the water dark purple. Umbreon leaps out of the water onto the platform. \"Floatzel out of the water.\" You say, but you are to late as you see Floatzel is badly poisoned. \"Umbreon Faint Attack.\" Shane orders as Umbreon vanishes. \"Where is he?\" you say trying to find him. \"Donald he's coming up on your right.\" Riku shouts at you. You look and you see one of the platforms move. \"Floatzel Water Gun.\" you shout. Floatzel's attack hits knocking Umbreon back several platforms. \"Quick Attack.\" Shane calls out before Floatzel can recover. Umbreon runs forward with incredible speed and knocks Floatzel out. \"The Winner is Shane and Umbreon.\" Mark announces. \"Way to go Umbreon.\" Shane runs across the platforms to Umbreon and giving him a hug. \"He really cares for his Pokemon.\" you think as you return Floatzel to his Pokeball. \"I will be back in a moment.\" you tell Shane. \"Ok.\" he replies as you walk to the Prep room. Then...</span></div></div>",
            "created":1301115600,
            "id":1076749,
            "title":"The last round."
        },
        "113111111112211":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You place the Pokeballs into the healing machine and you turn it on. \"You three did very well out there.\" you say as the machine finishes. \"Hey Donald, good job out there.\" you turn and you see Professor Elm. \"Thanks, he was a tough opponent.\" you say as you look behind him \"Where are my Pokemon?\" \"I told them to wait outside, cause I want to talk to you about something.\" Professor Elm says as he pulls something out of his pocket \"I believe this is yours.\" You look and you see a Mini translator in his hand. \"Hey that’s the Translator I keep around.\" you comment \"How did you?\" \"Flint grabbed it so he could talk to me.\" Professor Elm replies \"He actually used it when he called me on the video phone last night to ask me to come here.\" \"Flint did this.\" you say feel a bit upset \"Ok, what did he tell you.\" \"He's worried about you.\" Professor Elm replies \"All of your Pokemon are worried that you are putting to much stress on your self.\" \"But I don't feel stressed.\" you reply feeling confused \"I like my job as Gym Leader.\" \"I can see that.\" Professor Elm replies \"But Flint says that you have been feeling confined lately\" \"Well yes I have been feeling that a little.\" you say honestly \"But I can't leave the Gym with so many advance league Challengers coming.\" \"I know that you have put a lot on your self since your Dad has past.\" Professor Elm says. You sit silent as you feel those memories come back to you. Not to long ago you lost your Dad to illness. Ever since then you have been working hard to take your mind off it. That was also when Flint has tried to become a big brother to you to try and help you though the pain. \"I know you haven't quite gotten over it.\" Professor Elm says to you \"But working your self like this is not the answer.\" You look at the ground thinking about what Elm has told you. Do you agree with Elm?</span></div></div>",
            "created":1301115600,
            "id":1076788,
            "title":"Bitter memories."
        },
        "1131111111122111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "I'm going to take a break.",
                "It's nothing."
            ],
            "content":"<div class=\"\"><div> <span>\"Your right.\" you say plainly \"But what should I do?\" \"I think you should start traveling around Ultima.\" Professor Elm replies \"You haven't seen much of the region, so it would be good for you.\" \"But what about the Gym?\" you ask. \"Mark is qualified to temporally be Gym Leader.\" Professor Elm says \"Plus there is that protocol you made.\" You remember the thing you set up if you where ever away. If a Challenger takes on the gym when you where gone they got a card so they could challenge you. If it was Silver the trainer is of pure spirit and deserves to face you. If it was Black they where of dark spirit and they must face you to prove there worth. \"I need to go now.\" Professor Elm says \"I’m not forcing you, but please conceder.\" As Professor Elm steps out your Pokemon walk in. \"Are you mad.\" Flint asks you. \"No\" you reply as you stand up \"I needed to hear what he said.\" You walk to a case and you pull out a Wave Badge. \"Well I shouldn't keep Shane waiting.\" you say as you walk out of the room with your Pokemon following. \"I know I need to take a break but how would I start?\" you think to your self. You soon arrive at the Front of the Gym where Shane and Mark where waiting. \"Sorry I took so long.\" you say trying to sound friendly. \"Not a problem.\" Shane says. You stand up straight in front of Shane. \"I congratulate you on beating me.\" you say \"I'm proud to present you with the Sapphire Wave Badge (Advance League badge).\" \"Thank you.\" Shane says as you hand him his badge. You smile as he walks towards the door but you then go into deep thought. \"Is there something on your mind Donald?\" Mark asks you. You look at him and say...</span></div></div>",
            "created":1301115600,
            "id":1076807,
            "title":"Take a break?"
        },
        "11311111111221111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "One more challenger.",
                "Your heading out."
            ],
            "content":"<div class=\"\"><div> <span>\"Mark, I think I need a break.\" you say to him \"I know I got responsibilities here, but the professor told me that I really should rest some.\" \"I know, Professor Elm told me he was going to talk to you.\" Mark says \"It’s perfectly fine, I can handle things here wile your gone.” You sure?” you ask. “Yeah just have fun and when your ready you can come back.” “Thanks Mark.” you said. “Your Welcome.” Mark replied. then…</span></div></div>",
            "created":1308373200,
            "id":1128922,
            "title":"I'm going to take a break."
        },
        "113111111112211111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Same team (Floatzel, Milotic and Swampert.)",
                "Other team (Lapras, Samurrott, and Quagsier.)"
            ],
            "content":"<div class=\"\"><div> <span>“Hello?” you hear someone say. You and Mark turn and you see a trainer. “Hello.” you reply “I am Donald, Cyan towns gym leader. You got here just in time I was about to go on a journey of my own. \"I am Scott,\" the trainer replies haply \"This is my first gym battle. But I tend to thwart the plans of Team Galactic. So much so, Team Galactic is offering a large bounty for me.\" \"Wow that’s some history,\" you laugh. \"Yeah,\" Scott laughs. You then see Cloud come into the room. \"Hey Donald are you ready to go?\" Cloud asks. \"Yeah, but first I am going to challenge this trainer,\" You reply. \"Wait you can understand Pokemon?\" Scott asked surprised. \"Yes I can. I was born with an ability to understand pokemon,\" You explained. \"I can understand pokemon too.\" Scott replyed smiling \"Really?\" you asked. \"Yes. I was given knowledge on how to by my Gardevoir,\" Scott said. \"Wow, that’s cool. Now about that gym challenge. Follow Mark &amp; he will lead you to the prep room,\" You instructed. Scott nods &amp; follows Mark. You head off to your prep room and you look at your Gym team‘s Pokeballs. “Hmm, should I take that same ones as last time or should I use my other three?” you say to yourself. You go with…</span></div></div>",
            "created":1308373200,
            "id":1128932,
            "title":"Pokemon Trainer Scott"
        },
        "1131111111122111112":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Scott",
                "You"
            ],
            "content":"<div class=\"\"><div> <span>You decide to let your other team have a shot at it. You walk out and you see Scott on the other end of the stadium. \"Ready Scott\" you ask. You watch as Scott levitates a Pokeball using Psychokinesis. \"Who said I wasn't.\" Scott replied. Scott sends out his first Pokemon, a Leavanny. \"That’s a good start.\" you think. \"Go Lapras.\" you shout sending Lapras out. \"I'm ready master.\" Lapras replies. \"*sigh* I know you guys are trained to call me that but could you please not act like that right now.\" you say pointing over to Scott \"He can understand you.\" You could hear Scott chuckling slightly.  \"Hey I didn't train my gym pokemon that way. The pokemon league did for Gym purposes.\" you say as you point over to your pokemon watching \"I trained those 4 over there.\" \"Hello.\" Your Pokemon all say waving at him. \"Any ways sorry about the hold up let's battle.\" you say to Scott. \"Alright.\" Scott replies. Who goes first?</span></div></div>",
            "created":1308373200,
            "id":1128937,
            "title":"A bit of an odd start."
        },
        "11311111111221111121":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Tranquill.",
                "Salamence"
            ],
            "content":"<div class=\"\"><div> <span>\"Leavanny, use Leaf Blade.\" Scott calls out. Leavanny ran up to Lapras and attacks using the leaf on it's arm. Lapras staggered back from the attack. \"Not bad.\" You think \"Lapras use Blizzard.\" \"It shall be done.\" she says as she summons and massive icy wind. Leavanny was hit and was sent to the floor. \"Are you ok Leavanny?\" Scott says. Leavanny got up but she couldn't move. \"Oh no she is frozen.\" Scott says looking at her. \"Now use Body Slam.\" you call out. Lapras leaps out of the water and she lands on Leavanny causing her to faint. \"Leavanny, return.\" Scott says calling Leavanny back. You see him wispier something to the Pokeball. What Pokemon is next?</span></div></div>",
            "created":1308546000,
            "id":1129896,
            "title":"Quick knock out"
        },
        "113111111112211111211":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Quagsire.",
                "Samurott."
            ],
            "content":"<div class=\"\"><div> <span>\"Go Tranquill.\" Scott says sending out his next Pokemon. \"I'm ready.\" Teanquill says \"Ok now Lapras use Ice Beam.\" you call out. Lapras fires but Tranquill quickly doges. \"Good work, now use Retaliate.\" Scott calls out. Teanquill dives down at fast speeds. \"Lapras Get out of there.\" you call out but Lapras was hit square on and she fainted. \"Lapras return.\" you say calling Lapras back. \"You did well out there I'm proud.\" you say to the pokeball. \"Well that was a good strategy there.\" you call out. \"Thanks.\" Scott replies. \"Ok now Let's go...\"</span></div></div>",
            "created":1308546000,
            "id":1129901,
            "title":"Retaliate."
        },
        "1131111111122111112111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Go Samaurott"
            ],
            "content":"<div class=\"\"><div> <span>\"...Quagsire.\" you say sending him out. \"Yes Sir.\" Quagsire says. You hear Scott Chuckle at this but you where focused. \"Use Sky Attack.\" Scott says as Tranquill is covered in a bright light. \"Use Scald.\" you call out. The water below Tranquill started boiling and a large steam cloud rose and hit Tranquill from below. Tranquill launched his attack and it hit doing great however Quagsire didn't faint. \"Gotcha.\" you think to your self. \"That should have obliterated him.\" Scott says. Scott then notices that Tranquill is burnt. \"Oh I am unlucky this time.\" Scott says. You look at your Quagsire and you see he is close to fainting. \"Use Quick Attack.\" Scott says Tranquill then hits Quagsire at amazing speed causing him to faint. You return Quagsire and you get your next pokeball out. \"Were you setting the stage up for your final Pokemon?\" Scott asks. \"Yes I was.\" You laughed. You threw your Pokeball and said...</span></div></div>",
            "created":1308546000,
            "id":1129934,
            "title":"Quagsire."
        },
        "11311111111221111121111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Gardevoir",
                "Conkeldurr"
            ],
            "content":"<div class=\"\"><div> <span>\"Go Samaurott.\" you call out sending out your last pokemon. \"Ready for battle sir.\" Samaurott says. \"Ah please could you drop the whole sir and master thing for at least one time.\" you say \"I'm not a drill sergeant, I'm your equal.\" \"But it is what we are trained to do.\" Samaurott replies. \"*Sigh* Sorry bout that Scott.\" you say over to him \"I just wish my gym pokemon would loosen up a bit.\" \"Hey that’s understandable.\" Scott says \"Now are you ready or what.\" \"Alright then Samaurott Shell Blades ready.\" you call out. Samaurott takes a Shell Blade and places it in it mouth. \"Ok now Surf.\" you call out. Samaurott creates ma huge wave that makes it's way to Tranquill. \"Use Fly.\" Scott calls out. Tranquill then fly’s up in attempt to dodge the on coming wave. \"Samaurott Now ride the wave.\" you call. Samaurott get's on the wave and he is launched in to the air. \"What in the world?\" Scott says in shock. \"Now Shell Blade.\" you call out. Samaurott takes the blade out of it's mouth and he strikes Tranquill causing him to faint. \"Tranquill return.\" Scott says calling his Pokemon back. You see him say something to the Pokeball. \"Sorry if I was a bit rough on him.\" you call out \"My battle style is a bit unorthodox.\" \"Don't worry, he just need's to rest.\" Scott says \"However I hope your ready for what's next. Go...\"</span></div></div>",
            "created":1308546000,
            "id":1129938,
            "title":"Go Samaurott"
        },
        "113111111112211111211111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Both Pokemon fainted",
                "One Pokemon is still standing"
            ],
            "content":"<div class=\"\"><div> <span>\"Go Gardevoir! Show them your power.\" Scott says flinging a pokeball with his psychokinesis. \"I will show the power of a psychic.\" Gardevoir says as she appeared. \"So this is your mentor?\" you ask. \"Yes.\" Scott says \"Gardevoir taught me how to speak to pokemon &amp; use psychokinesis.\" \"Awesome.\" you reply \"So lets do this now. Ready Samaurott?\" \"Ready sir,\" Samaurott says. \"Lets show them our power,.\" Scott says to Gardevoir. \"We will do this together.\" Gardevoir says. You watched as they both focused and you see a dim, white aura surrounded both of them. “Wow could it be?” you think to yourself.” \"Lets use Energy Ball.\" Scott and Gardevoir said in sync as Gardevoir started charging a green ball. \"Dodge it Samaurott,\" You call out quickly. Scott and Gardevoir launched the Energy Ball and Samaurott attempted to dodge it. But he was hit barely by it. \"Wow, an aura link!\" Riku says. \"Samaurott, use Hydro Pump.\" you call out. Gardevoir got hit by the attack and both Gardevoir and Scott then fell back. \"Thunderbolt!\" Scott and Gardevoir said. \"Use Ice Beam.\" you call out. Gardevoir released a large bolt of thunder and Samaurott released a huge beam of ice. The attacks hit and created a huge explosion. “Man such power.“ you think “That just shows what one can accomplish if they are in sync with their Pokemon.” The dust cleared &amp; you see...</span></div></div>",
            "created":1311138000,
            "id":1150848,
            "title":"Aura Link"
        },
        "1131111111122111112111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Head home and get ready for tomorrow.",
                "Readers choice."
            ],
            "content":"<div class=\"\"><div> <span>As the dust settles you see that both Samurott and Gardevoir have fainted. “Both Pokemon have fainted and both sides are out of Pokemon.” Mark calls out “The match is a draw.” You and Scott run out to your Pokemon. “Master I have failed you.” Samurott whispers. “No you didn’t fail me, you gave it your all and that’s all I ask.” you whisper back “and could you please stop calling me that, we are equals.” You return  Samurott to his Pokeball and you walk up to Scott who is helping Gardevoir up. “You put up a good fight.” you said “Plus I didn’t expect to see an Aura Link, you truly are an experienced trainer.” “Thank you.” Scott says “My Pokemon are like family to me.” You smiled knowing that some one feels the same about Pokemon as you do. “Well I’ll let you go and heal your Pokemon.” you say “Meet me in front and I’ll present you your Gym Badge.” “Sounds good.” Scott replies. You walk to your prep room and you heal your team. “Good work guys.” you say as you pull out a Sapphire Wave Badge. As you make your way to the front you release your Gym Pokemon in there room and you told them that you would be taking a break and that Mark will be in charge They understood referred to you as master as usual which bugged you. Finally you made it to the front where Scott and your Pokemon where waiting. “Sorry for keeping you waiting.” you say. “No problem.” Scott replied. “Well for a fine gym I present to you the Sapphire Wave Badge.” you say as you hand him the badge. “Thanks, oh and here.” Scott says as he hands you a piece of paper with a number “Your Pokemon gave me your number for some reason so here’s mine. Maybe we can meet up some time and battle again wile you travel.” You look at your Pokemon and they just look back smiling. “Well I would like to battle you again.” you say smiling. “Great well I’ll see you later.” Scott says as he walks off. You then decide to…</span></div></div>",
            "created":1311138000,
            "id":1150851,
            "title":"A Draw."
        },
        "1132":{
            "author_id":"flamefang51",
            "author_name":"DragonXYZ",
            "choices":[
                "Go with Riki",
                "A different gym leader"
            ],
            "content":"<div class=\"\"><div> <span>Name: Riki Kyragani<br>\r\nAge: 12<br>\r\nHome Region: Ultima<br>\r\nProfession: Pokemon trainer/Dragon type Gym Leader/swordsmen/sensei<br>\r\nAppearance: Red eyes, blond hair, usually wears a black gi and always has his sword Dragon's tooth with him<br>\r\nPersonality: calm and collected, but shy, friendly and understanding<br>\r\nLikes: rare swords, any dragon type pokemon, strong opponents, peace and quiet (which means that he would not mix well with Ash Ketchum), his pokemon, any type of dragon, swordplay, and ancient documents<br>\r\nDislikes: loudness, people interrupting his match, people who mistreat pokemon, and corrupt people.<br>\r\nSkills: skill with a sword, ability to understand what any pokemon is saying and their feelings, advanced stealth and ninja skills<br>\r\nBio: When he was born with the same ability that Donald Mason has he kept to him self most of the time.  He spent most of the time either doing swordplay or hanging out with the family pokemon.  When he was 4 his parents died for a mysterious reason and he was orphaned.  He was taken in by a family of Dragonite and raised as one if their own.  When he was 10 he left his family of Dragonite to go on a pokemon journey, he discovered early on though that a Dratini from his family of Dragonite had followed him.  As soon as he got to little birch town some trainers saw the Dratini with him and tried to capture it but they did't count on Riki protecting it they where inraged and left.  Once Riki got to the lab he asked for a starter but they where out of them so, he asked if Dratini would count.  They said yes and caught Dratini in a pokeball and gave it to Riki.  Soon after Riki beat the Junior League in just a couple of days(yeah he is that talented).  After that he beat the advanced league in just a week and a half.  The elite four and the campion where so impressed that they requested that he became the dragon type gym leader in Chi Village he excepted the offer and made some adjustments to the gym.<br>\r\nRiki's gym pokemon: Dragonite, Garchomp, Salmance, Haxsarus, Hydregien, and Flygon<br>\r\nRiki's Main pokemon: Hurricane the Dragonite, Fin the Garchomp, Drake the Salamance, Axe the Haxsarus, Orochi the Hydregien, Meteor the Flygon, and Saburu the Lucario<br>\r\nRiki's Sub pokemon: none<br>\r\n<br>\r\nSo do you want to go with Riki?<br>\r\n<br>\r\n(Note: Riki's pokemon are extremely powerful and hard to beat that is why he is the youngest gym leader in Ultima so far and by far the most powerful his power is equal to that of all of the elite four and the champion combined so consider yourself lucky if you beat him so far he has had an unstoppable winning streak)</span></div></div>",
            "created":1388877840,
            "id":1721638,
            "title":"Riki Kyragani"
        },
        "12":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "A New Trainer",
                "A Veteran Trainer",
                "A Gym Leader",
                "A Pokemon Ranger",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then now what are you.<br>\r\nA New Trainer starting her Pokemon journey.<br>\r\nA Veteran Trainer coming in on the ship so she can take on the Advance League.<br>\r\nA Gym Leader in the Ultima Region.<br>\r\nA Pokemon Ranger patrolling Ultima.</span></div></span></div>",
            "created":1300338000,
            "id":1071883,
            "title":"What are you?"
        },
        "121":{
            "author_id":"cowboykitten",
            "author_name":"C.K.",
            "choices":[
                "Avelyn Plum",
                "Someone else...",
                "Someone else..."
            ],
            "content":"<div class=\"\"><div> <span><b>Name</b>: Avelyn Plum<br>\r\n<br>\r\n<b>Age</b>: 17<br>\r\n<br>\r\n<b>Profession</b>: Pokemon Trainer/Researcher<br>\r\n<br>\r\n<b>Home Region</b>: Ultima<br>\r\n<br>\r\n<b>Appearance</b>: 5'10\" with an average figure, light brown skin, straight long dark hair just past the shoulder line, with magenta eyes. Standard outfit is a purple and white flat cap with a tilted Pokeball insignia on it, buttoned purple coat that's only pinned at the midsection with a black undershirt, short wrap skirt, and tights just above the knee on her legs, followed with purple and white boots. A diamond studded earring is embedded in her left ear.</span></div></div>",
            "created":1440028500,
            "id":2022966,
            "title":"A New Trainer"
        },
        "1211":{
            "author_id":"cowboykitten",
            "author_name":"C.K.",
            "choices":[
                "Open the Pokeball!"
            ],
            "content":"<div class=\"\"><div> <span>          \"A surprise...?\" Avelyn repeats the words she was just told with a head tilt, spilling her hair to the side a bit. The resounding sound of a duo of soft claps proceeds with a very eager man rolling up close to the girl in his wheelie chair.<br>\r\n<br>\r\nHe explains, \"Yes a surprise! A surprise I have cookin' up just for you, Ms. Plum.\" He rolls himself in his chair back to his computer desk to resume typing at his keyboard with Avelyn still as clueless as ever. The teenage girl was seated on a smaller stool with a large tub in front of her, filled with warm water and foaming bubbles from the bath she was giving to a Pokemon. A rather annoyed Nuzleaf is sitting in the middle of it with lowered eyelids and brows, grumbling to himself as Avelyn proceeds to rub a washcloth over him.<br>\r\n<br>\r\nShe asks, \"Well...what for? My birthday already happened long ago this year and I haven't done any exceptional work for you as of late, Professor Palm.\"<br>\r\n<br>\r\nThe professor himself swirls his chair around from his desk to face the girl with shoulders shrugged and his hands in the air, \"Ms. Plum, why do suggest that there has to be some reason for it? Can I not just be generous to you?\" He says with a comical look on his face. Professor Palm himself was comical in a way, being expressive and quirky. The Pokemon researcher was definitely one of the younger ones to come by, being in just his late twenties and a lanky figure. A tall man with pale caucasian skin, his curly hair was poofed out in a thick fro that looked like a bleach blonde cotton ball was growing out from his head. Adventurous light blue eyes through circular glasses stare at the girl with a clear goal of passing off what he said more of an excuse than a reason. The professor himself could've been confused for a beach bum if it wasn't for his title or labcoat. A hawaiian shirt is buttoned together underneath his open white coat, exposing his cargo shorts (sometimes even straight up swim trunks) and weaved flip flops. His long sleeves are rolled up on his arms to accumulate with the warm weather he typically enjoyed, making anyone wonder why he even bothered with the labcoat. Perhaps its just so people take him and his research more literally.<br>\r\n<br>\r\nAvelyn fixes her hair and grumbles, \"Sir, you always have a reason when doing something for someone else. And generosity isn't one of them. And I keep telling you to just call me Avel-\"<br>\r\n<br>\r\n\"Ghhk. You wound me, Ms. Plum.\" He interrupts while clutching his chest to fake some pain before returning to his casual nature with a finger wagging, \"Buuuut you're not far from the truth. Which makes you all the more perfect research assistant. And no need to be humble, Ms. Plum. All the work you've done here has been exceptional.\"<br>\r\n<br>\r\nThe Nuzleaf grunts as he's forced to have water rubbed over his head, \"Does giving baths count as 'exceptional research' then?\" Avelyn smiles at that and answers, \"Sadly to him, yes it does.\" Avelyn had the natural gift to understand Pokemon, a trademark inheritance than ran through her family line. And with it she's helped Professor Palm in numerous ways with it, even helping him along with other research assistants of his who have the gift to develop a prototype in people and Pokemon being able to communicate with each other. The Professor had many assistances, but they're scattered all across Ultima, with Avelyn being the only one in the small living community known as Little Birch Town.<br>\r\n<br>\r\nThe Professor himself turns himself around from hearing the Nuzleaf and the girl talking, \"Oh? And what's he saying now?\"<br>\r\n<br>\r\nAvelyn confesses, \"He uhhh...is curious if this counts as important research.\"<br>\r\n<br>\r\nA sudden slam on the desk cause her hair to bristle with Prof. Palm smiling excitedly, \"Of course it is!\" He spins himself in the chair back to his computer and resumes typing, \"I'm curious at what temperatures of water Grass-type Pokemon enjoy or benefit from the most. Do they prefer something relaxing and hot like we do like a jacuzzi or shower? Or perhaps something more natural like cold rain or cool river water?\"<br>\r\n<br>\r\nThe Nuzleaf raises a brow with gritting teeth, \"What's the point of forcing me to sit through this like some kid? Why the bubbles?! Why not just ask?!?\"<br>\r\n<br>\r\nPalm pauses in typing and asks as he stares at his screen, \"What's he saying now over there?\"<br>\r\n<br>\r\n\"He says he likes warm water the most.\" Avelyn replies to the professor with the Nuzleaf flashing a look back at her. She whispers to him, \"I mean you do, don't you?\"<br>\r\n<br>\r\n\"I don't really care what temperature it is, as long as it ain't frigid or molten hot like any common living thing.\" He huffs with crossed arms.<br>\r\n<br>\r\nProf. Palm sputters a chorus of keyboard keys being mashed in with an accelerating joy burning him. \"Interesting. Interesting! This changes some of my suspicions then. See? Even with these little discoveries, we become a step closer in understanding Pokemon, and they to us. Soon there won't be much difference in us and them at all.\" He continues to work on his report as Avelyn pulls the Nuzleaf out of the metal round tub to set him on the floor, preparing a small towel to dry him off in. He however quickly snatches it from Avelyn, giving her a glare, and proceeding to dry himself. The girl grins and stands up from her stool, drying her own hands and arms off in a separate towel as Prof. Palm prints his report out and stacks it to an already large tower of papers by his desk that dared to be teetered over by the lightest touch.<br>\r\n<br>\r\n\"You still haven't told me what this surprise is, Professor.\" Avelyn asks as Palm's Nuzleaf is busy swaying his hips while shaking the grinding towel behind him.<br>\r\n<br>\r\n\"If I told you, it wouldn't be a surprise then!\" The researcher says while kicking away from his desk, letting his wheelie chair take far away to the end of the room by a door, stepping out of it. \"Now then, you've been my assistant for several years now, not as long as some of my others, but you're already a favorite pick of mine~!\"<br>\r\n<br>\r\nAvelyn didn't know how to take the flattery and rolls her head, \"Where ya goin' with this, Prof.?\"<br>\r\n<br>\r\nPalm doesn't cease to keep the mystery going and continues, \"Plus you've stayed here in Little Birch for most of your life instead of other trainers who venture across the vast biomes of Ultima.\"<br>\r\n<br>\r\n\"...By my own decision.\" Avelyn retorts back with crossed arms. She wasn't that all interested in gym leaders or becoming the Pokemon League Champion like every other trainer out there, more or less because it was a title that meant much to her and her goals were more about learning and befriending Pokemon than forcing them to fight each other.<br>\r\n<br>\r\nPalm opens the door, \"Now, you've never owned a Pokemon yourself, correct?\"<br>\r\n<br>\r\n\"What are you talking about? You've met Puff, our Hoppip back at home.\" The girl retorts again.<br>\r\n<br>\r\nThe professor rolls his eyes, \"That's more or less your father's Pokemon, Ms. Plum. I'm talking about a Pokemon you've connected with you and you alone that traveled every step with you.\"<br>\r\n<br>\r\n\"Well...I mean I've chatted and befriended plenty of other people's Pokemon, with the occasional wild one but...\" She says, rubbing her arm. Now that she thought about it, she's never had any Pokemon to call her own, but that wasn't really ever a problem. She's taken care of so many other people's Pokemon along with helping study others that the professor went out to get or interact with, all of them felt like they were hers in a way.<br>\r\n<br>\r\nProf. Palm shakes his head, \"Those aren't what I'm talking about.\" The Nuzleaf is finished drying himself off, with Palm noticing him. \"C'mere Wally!\" The Grass-type twitches its sprout leaf atop his head before looking over at the man. Approaching Palm, he's scooped up in the professor's arm and tucked to Palm's side, having his leaf tugged at in a rather ticklish manner. He grunts and sneers before eventually laughing some as the professor pinches and tickles his sensitive leaf. \"See. Pokemon and people have a rather unique bond with one another. But a trainer and their Pokemon...that's something completely different. Something even better and far grander, I can't begin on how to explain it to you.\" Looking to Avelyn, he smiles. \"And that's why I'm going to have you find that out for yourself.\"<br>\r\n<br>\r\nHe gestures Avelyn inside where the discovers a desk table with a pokeball resting on it. The girl shakes her head with a hand on her head, \"<font class=\"size3\" style=\"\">Oh don't do this</font>...\" She mutters with the professor snickering.<br>\r\n<br>\r\n\"Go on and take it. That's your new Pokemon. It's your job to help him learn and grow, and from that experience, you'll learn and grow as well! He was a hard one to find, and not many other trainers can get there hands on one, so take it as a good reward for all the hard work you've done for me.\" He continues to say with Avelyn already at the table, picking the ball up into her hands. She had no clue what was inside it, or if she would even accept such a thing. But without wasting anymore time, she decides to at least see this new Pokemon that'll act as her starter...</span></div></div>",
            "created":1440034140,
            "id":2022993,
            "title":"Avelyn Plum"
        },
        "123":{
            "author_id":"rhinosaurusrex",
            "author_name":"Rhinosaurus Rex",
            "choices":[
                "Continue with Sasha",
                "New Gym Leader",
                "New Gym Leader"
            ],
            "content":"<div class=\"\"><div> <span><b>Name:</b> Sasha Kimimori<br>\r\n<b>Age:</b> 17<br>\r\n<b>Home Region:</b> Ultima<br>\r\n<b>Profession: </b>Pokemon Coordinator / Electric Gym Leader<br>\r\n<b>Appearance:</b> Sasha had hot pink hair that hangs down to her waist, she has large yellow eyes with contacts in them. She wears a small yellow top and skinny jeans along with white sandals, all coated with an insulator to protect her from electrical attacks. Her skin is fair and she stands at about 5'7.<br>\r\n<b>Personality: </b>Sasha has a very electrifying personality, in that she is super active and excitable and enjoys the company of others. She has a tendency to over-react often and her movements and actions are always big and exaggerated. She loves music as well as she loves to dance.  <br>\r\n<b>Likes: </b> Music, cute Pokemon, dancing, adventure, electric Pokemon, make-up. <br>\r\n<b>Dislikes: </b> Ugly Pokemon, mean people, bad hair days.<br>\r\n<b>Skills:</b> Sasha is a very skilful dancer and singer as well as wears insulated clothing to protect her from electrical attacks<br>\r\n<b>Bio: </b> Sasha grew up always wanting to be a Pokemon Pop Star, her life goal was to train up the worlds most beautiful Pokemon and become the greatest Pokemon Coordinator that ever lived. To help fulfil this goal Sasha took many lessons in singing and dancing so that she could get closer to that goal. When she received her first Pokemon Sasha trained day and night, always practicing different ways to astound people. She decided to test her skills and travelled the region preforming for people, along the way she caught many different types of Pokemon and trained them to be stars as well. After her travels she was nationally recognised and became famous for her wondrous acts. Sasha later learned of a new fondness that she had for electric type Pokemon. She used the money she collected from her journey to create a Pokemon Gym/Theatre and once she was done she became the regions official Electric gym leader. <br>\r\n<b>Gym Pokemon: </b>Plusle, Luxio, Pikachu, Electribuzz and Joltic<br>\r\n<b>Main Pokemon: </b> Raichu, Fennekin, Minum, Lumineon, Luxray, Elekid, Dedenne, Froslass, Emolga, Jynx and Jigglypuff.</span></div></div>",
            "created":1456576920,
            "id":2110179,
            "title":"Sasha Kimimori"
        },
        "1232":{
            "author_id":"rhinosaurusrex",
            "author_name":"Rhinosaurus Rex",
            "choices":[
                "Ok time for Liz to hit the stage!",
                "New Gym Leader ",
                "New Gym Leader"
            ],
            "content":"<div class=\"\"><div> <span><b>Name: </b> Elizabeth (Liz) Yamida <br>\r\n<b>Age: </b> 25<br>\r\n<b>Home Region:</b> Ultima<br>\r\n<b>Profession:</b> Pokemon Trainer | Dark Type Gym Leader<br>\r\n<b>Appearance:</b> Wears a clock and scarf to hide her face. Brown hair, black shirt and jeans. Purple eyes.<br>\r\n<b>Personality: </b> Liz, much like her gym, is dark and mysterious. She has never been seen smiling or laughing. However she is not a bad person, in fact she is incredibly kind and helpful. She is always willing to help out young trainers as well as old ones, she will often give out tips and tricks on how to beat different people.<br>\r\n<b>Likes: </b> The Dark, Horror Movies, Challenges, Willing Trainers.<br>\r\n<b>Dislikes:</b> Light, Easy Battles, Romance Movies.<br>\r\n<b>Skills:</b> Liz has a strange aura about her, she can be quite intimidating. <br>\r\n<b>Bio: </b> Liz was never what you would call a 'normal' kid. She was always quite gloomy and intimidating, no-one dared mess with her and no-one dared be friends with her. She found it kind of lonely, never having anyone around. However one day another girl walked up to her and asked her to be friends, Liz happily accepted and the two girls were inseparable, there was never a time where Liz was so cheerful. The two girls travelled around the region until they had to return so that Liz's friend could become Gym Leader and replace her father. Sadly the girl fell very sick and on her death bed she asked Liz to take over her Dark Gym for her. Liz promised that she would be the gyms leader till her dying day and that she would remain kind to everyone even despite of the pain she had. That day when her friend dies, was the last day Liz ever smiled.  <br>\r\n<b>Gym Pokemon:</b> Absol, Umbreon, Houndoom, Sharkpedo and Spiritomb<br>\r\n<b>Main Pokemon: </b> Sableye, Gengar, Spoink, Sneasel, Shiny Charizard. Kabutops.</span></div></div>",
            "created":1456578480,
            "id":2110185,
            "title":"Elizabeth (Liz) Yamida"
        }
    },
    "info":{
        "author_id":"aurawolf",
        "author_name":"AuraWolf",
        "brief_description":"Your a Pokemon Trainer in the Ultima Region. Do you have what it takes to make it here?",
        "created":1300409820,
        "description":"<td align=\"left\" class=\"norm\">Welcome to the Ultima Region. Wile it may seem like your typical island region, many Pokemon Trainers from all over come to take on it’s massive Pokemon League. The Ultima Pokemon League is said to be the largest and most challenging league in the world. However this is also home to the elite division of Team Rocket. Do you have what it takes to become a Pokemon master?<br>\r\n<br>\r\nIn this story you can take a role of a new Trainer starting his Pokemon journey in Ultima taking on the Junior League (8 Gym’s, elite four, and champion.), a veteran Trainer coming to the island to take on the Advance League (17 Gym’s, elite four, and Champion.), or some other type of character in Ultima (Gym Leader, Team Rocket member, Pokemon Ranger, Etc.). You can also take part in other Pokemon events like Pokemon Contests and the Pokatholon. Some of the basic towns and locations are (Note: Gyms can be done in any order)<br>\r\nLittle Birch Town (Pokemon lab, starting point of Junior League)<br>\r\nNew Light City (Main Harbor, starting point of Advance League)<br>\r\nCrimson City (Fire Gym)<br>\r\nSapphire Lake<br>\r\nCyan Town (Water Gym)<br>\r\nEmerald Forest <br>\r\nIvory Town (Grass Gym)<br>\r\nDandelion City (Electric Gym, Pokemon theater)<br>\r\nSkyline City (*Normal Gym, Pokemon contest hall)<br>\r\nRuby Park<br>\r\nSand valley town (Ground Gym)<br>\r\nRock head Caverns (Rock gym)<br>\r\nIron City (*Steel Gym)<br>\r\nAurora Village (*Ice Gym)<br>\r\nValor City (*Fighting Gym, Sports coliseum)<br>\r\nWisdom resort (Psychic Gym)<br>\r\nLunar City (*Dark Gym)<br>\r\nAbandon plant (Poison Gym)<br>\r\nViolet Manor (*Ghost Gym)<br>\r\nWindmill Village (*Flying Gym)<br>\r\nMantis Village (*Bug Gym)<br>\r\nChi Village (*Dragon Gym)<br>\r\nVictory road<br>\r\nScarlet Tower (Elite four and Champion HQ)<br>\r\n(*Gyms not visited in Junior League) <br>\r\n<br>\r\nIn this story there are Pokemon from all five generations in this region so you can find any Pokemon here. The starters can be any starter from any game. You can use any type of Pokemon Battle in this story (Single, Double, Triple, and Rotation.)  Pokemon in this story can talk ether by use of a Mini translator, Telepathy, or the natural ability to understand Pokemon. Also in this story Pokemon aren’t limited to just four so any move a Pokemon can learn it can use, plus you can make your own original moves. Also your character may hold more then the standard 6 Pokemon with the Advance License (Max of 14 Pokemon) However League Battles only allow the maximum of 6 to be used in one battle.<br>\r\n<br>\r\nRules<br>\r\n<br>\r\nYou can take your story in any direction you want, But I do have a few rules.<br>\r\n<br>\r\n1: When you make a character leave an option to make a new character.<br>\r\n2: Feel free to add new locations, but make sure that they fit the world of Pokemon.<br>\r\n3: No sexual content what so ever.<br>\r\n4: No Vore<br>\r\n5: I will allow mild swearing, but if the chapter goes to far it will be removed.<br>\r\n<br>\r\nFeel free to add and have fun. ^_^</td>",
        "id":1760499,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1456578480,
        "modified":1456578480,
        "pretty_title":"Your Pokemon Trainer Adventure: Ultima"
    }
}