{
    "chapters":{
        "1":{
            "author_id":"larry84",
            "author_name":"Lawrence84",
            "choices":[
                "The magic necklace ",
                "The mistake of Venus ",
                "Gabrielle's travels ",
                "Change of roles"
            ],
            "content":"<div class=\"\"><div> <span>Gabrielle can become a giant in these ways (your choice) :<br>\r\n<br>\r\n<br>\r\nThe magic necklace :<br>\r\n<br>\r\nOnce you become the queen of the Amazons, give it a magic necklace (very similar to his), giving it the power to grow to incredible size.<br>\r\n<br>\r\n<br>\r\nThe mistake of Venus :<br>\r\n<br>\r\nGabrielle asks an Aphrodite (Hercules: The Legendary Jou, a spell that makes it very stronger, but Venus (wrong understanding) Gabrielle makes very bigger.<br>\r\n<br>\r\n<br>\r\nGabrielle's travels : <br>\r\n<br>\r\nGabrielle, is shipwrecked on an  Lilliput where everything is 24 times smaller than normal.<br>\r\n<br>\r\n<br>\r\nChange of roles :<br>\r\n<br>\r\nXena, Gabrielle &amp; Aphrodite (she for the first time),  the gentle giant Thea (<br>\r\nappeared in the episode:  the TItans. .In this story ,who was released from the rock, because the gods have seen his kindness) that only humans despite much love, you feel uncomfortable to stay with them (due to of its gigantic size) then asks Aphrodite, restricting their size .... until the spell fails .... just that Gabrielle has now become to them a Titaness <img style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/smile.png\" alt=\"*Smile*\" class=\"emoteZ\" title=\"Smile\" border=\"0\" width=\"15\" height=\"15\">))<br>\r\n<br>\r\n</span></div></div>",
            "created":1292698800,
            "id":1017496,
            "title":"The choices"
        },
        "11":{
            "author_id":"thequilldragon",
            "author_name":"TheQuillDragon",
            "choices":[
                "She turns into a giantess while she walks.",
                "She gives Xena her present then changes.",
                "Gives Xena the present then goes on with the festival, no changing yet. "
            ],
            "content":"<div class=\"\"><div> <span>\"Gabriel!\" Xena snaps her fingers in front of her dazed compainion.\"Come on now, we are almost there. I thought you would be more excited. You are their queen, after all..\"<br>\r\n<br>\r\nGabriel shook her head and continued to walk behind Xena. \"What.?, Oh that, you know, I love the Nation, but really Xena, we can't take some side trips or something? We don't have to go straight there. We could go shopping!\"<br>\r\n<br>\r\nXena just shook her head, taking a firmer grip on Argo's reins. \"No, no. I know what this is about. You just don't want to be involved in the Solistice ceromony. Come on Gabriel, is it really that hard to sit there while the Nation hands you gifts?\"<br>\r\n<br>\r\n\"You know what Xena, it is hard. Especially when everyone stares at you waiting for your reaction. By the Gods! Do you remember what they gave me last year? A \"blessed\" headress. My hair was blue for weeks!\" Gabriel complained.<br>\r\n<br>\r\nXena smirked at her. \"I don't know Gab, I thought your hair had a cetatain pazzaz to it. Those people in the fishing village thout so.\"<br>\r\n<br>\r\n\"Pazzaz? They though I was a walking mermaid and tried to throw me back into the ocean!\" Gabriel pushed Xena in revenge. <br>\r\n<br>\r\nXena just laughed at her. \"Well whatever they give you this year, just don't try it on untill your on your own. You wouldn't want to hurt their feelings.\"<br>\r\n<br>\r\nThe pair continued down the path well into the night. The moon had risen well over the tree tops when they hit Amazon territory. The walked slowly, anticipating the Amazon to jump down from the trees at any moment.<br>\r\n<br>\r\nAs a well rehearsed group, five Amazons jumped down and surrounded the pair. <br>\r\n<br>\r\n\"My queen, welcome back.\" Ephiny took off her mask and embraced her old friend. \"Xena.\" She shook hands with the leatherd warrior. \"Let us escort you to the village.\"<br>\r\n<br>\r\n\"I'll walk with you,\" Gabriel offered. She split away from Xena and walked with Ephiny in the front of the group. <br>\r\n<br>\r\n\"Is something wrong Gabriel?\" Ephiny asked. \"I usually can't pry you away from Xena.\" she laughed.<br>\r\n<br>\r\nGabriel looked back at Xena, who was talking to another amazon as they walked.<br>\r\n<br>\r\n\"Did you get the thing I asked for last winter?\" Gabriel whispered, turning back to Ephiny.<br>\r\n<br>\r\nEphiny smiled, and nodded discretly. \"So you two are a couple now?\" she asked her. Ephiny was warmed at the thought her Queen and friend had found love. \"How did you know last winter you would be with her?\"<br>\r\n<br>\r\nGabriel couldn't hold back a grin. \"I just had a feeling, that's all. Xena rarely gets presents, so when I thought about it, I just couldn't resit asking you to get it for me.\"<br>\r\n<br>\r\nThey made it to the village. Despite the late hour, the village was a-buzz to prepare for the solitice festival. Decorations lined every house, and the smell of baked treats filled the air. Gabriel sighed, the feeling of celebration sweeping through her. She reached for Xena's hand, and the feeling of belonging filled her soul. <br>\r\n<br>\r\n\"Maybe being back isn't so bad.\" Gabriel whispered to Xena. A soft smile graced Xena's lips and she nodded knowigly at her.<br>\r\n<br>\r\nGabriel felt surrounded by the ones she loved,  annd she wondered why she fought so hard to ignore this place. This was home to her. And things were only better with Xena at her side. <br>\r\n<br>\r\nLater, after greeeting her nation, Gabriel collasped on the bed in her hut. She could get a few hours sleep before the ceramony. She got in the covers, not even bothering to change clothes. She was asleep in no time at all.<br>\r\n<br>\r\nXena entered Gabriel's hut, after stabling Argo in the Amazon's stable. She was tired, but she smiled at the sprawled figure on the bed. She knelt and started a small fire at the hearth, and soon, a comforting heat rewarded her efforts. <br>\r\n<br>\r\nXena took off her leathers, draping them on the desk chair. She was left in her chemise, and she gently pushed Gabriel to her side of the bed. She blew out the candle, and went to sleep.<br>\r\n<br>\r\n<br>\r\nNot had four hours gone by before there was a pounding on the door. Gabriela got up, and saw that Xena had started a fire and was already dressed. <br>\r\n<br>\r\n\"Morning,\" Gabriel yawned. <br>\r\n<br>\r\n\"Morning to you too.\" Xena replied, kissing her on the forehead. I'll get the door.\"<br>\r\n<br>\r\nEphiny entered, not at all suprised to see them up and dressed. \"Ready my queen?\"<br>\r\n<br>\r\nGabriel quickly looked at her clothes, which were ruffled and dirty. \"Um, do you know where my ceremonial leathers are? And my mask? \"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<b>Ceremony</b><br>\r\n<br>\r\nGabriel sat on her cermonial throne, taking in the crowd that had gathered. She knew all these Amazons. Most individually, but she saw a few new faces, young and old. She would go through later today, to get to know them better. It was the type of queen she was. She was for the people, not the fame of it. The smell of the roasting boar they brought in this morning. She hadn't participated in the hunt, not because she didn't want to, but because she had other plans. She went to see the gift hidden away by Ephiny, that she planned to give to Xena. <br>\r\n<br>\r\nThe crowd went quiet, and Gabriel knew it was time to start. She rose off her throne, her red fur lined cape falling in place behind her. She heard the collective gasp of awe, but attributed it the excitment of the day. <br>\r\n<br>\r\n\"Amazon Nation, young, old, and proud. We come here today, to celebrate Artemis, and the blessings she has given us this year. The crops were plentiful, no sickness decended on us, and only joy was given us to celebrate this year. I am happy to announce that we have new Amazons this year, and we are very happy they have joined us! I hope we all have a fantastic day and may Artemis bless us!\"<br>\r\n<br>\r\n\"May Artemis bless us.\" They Amazons praised in unison. They cheered, and Gabriel once again took her seat. Ephiny took to the stage, annoucing it was time for the exchanging of gifts. Ephiny handed Gabriel her gift form the Nation, and everyone held their breath. <br>\r\n<br>\r\nGabriel stared at the small box package in her hand. Will this be my doom? she considered. She took a deep breath and untied the string and opened the brown paper package. To her suprise, a beautiful necklace was nestled in the paper. Small blue teardrops showered the necklace, and the chain was soft and delicate, holdng each precious gem in place. The silver and blue complemented each other completly, and Gabriel held back tears at the thoughtfullness of her Amazons. <br>\r\n<br>\r\nShe got up of her throne and hugged Ephiny. She turned to her Nation. \"Thank you everyone, I love it, it's perfect.\"<br>\r\n<br>\r\nThe Nation smiled at their queen, then each turned to find their own special someone to give there gift too. Gabriel watched the joy on eah Amazon's face as they all go a present. Her mind turned back to the necklace. She remeber ed her gift! she had to give Xena her gift! She turned to walk off the dasis, but was stopped by Ephiny.<br>\r\n<br>\r\n\"My queen, you must put on the necklace. You like it right?\" Gabriel smiled, and nodded. She thought about what Xena siad, about waiting until she was alone, but decided that it couldn't be that dangerous. She allowed Ephiny to fasten the clasp around her neck. The necklace settled perfectly around her neck. She felt a curious warmth throughout her body, but thought nothing of it. <br>\r\n<br>\r\nShe headed down the stage and towards Xena, who was staring at her with an odd look in her eye. <br>\r\n<br>\r\n</span></div></div>",
            "created":1380826620,
            "id":1673625,
            "title":"The Magic Necklace "
        },
        "13":{
            "author_id":"thequilldragon",
            "author_name":"TheQuillDragon",
            "choices":[
                "It's a Miniture deer!",
                "It's a Tribe!",
                "Other",
                "Its's nothing, Gabriel carries on through the odd forest. "
            ],
            "content":"<div class=\"\"><div> <span>Gabriel leaned against the rail of the ship. It wasn't that unplesent, once she administered the pressure points on herself. The firm wind carried their ship towards their goal. The day was clear, and Gabriel couldn't recall ever seing such a blue sky. Her gaze fell on the smooth water. The boat caused ripples in the otherwise smooth surface. Come to think of it, she had never seen the ocean so calm. <br>\r\n<br>\r\nShe walked away from the rail, searching for Xena. She was at the wheel, talking to the captain about the course. Gabriel smiled, Xena never could really relax, and she always had to be learning or doing something to pass the time. Gabriel could look into the deeper of meaning of things, and keep her occupied for hours, staring into nothing. Not Xena.<br>\r\n<br>\r\nGabriel joined her companion at the wheel, listening in to the conversation.<br>\r\n<br>\r\n\"And I'll be telling you, this weather has nothing wrong with it, you shouldn't be cursing such a blessing!\" The captain insisted<br>\r\n<br>\r\n\"Look, never in my many, many, years of sailing have I ever seen weather like this.\" Xena pressed. \"You feel that wind? It's strong. Why aren’t the waves rougher? In fact, why aren’t the waves moving at all?\" <br>\r\n<br>\r\n\"What do you want me to do, run to the nearest port because we are having perfect weather? “The captain grumbled, not taking kindly to Xena's worry.<br>\r\n<br>\r\n\"I think it might be best. Nothing is ever this perfect. \" <br>\r\n<br>\r\nGabriel's brow furrowed, stepping up behind the warrior. \"Is there something wrong Xena?\"<br>\r\n<br>\r\nXena turned to her companion. She sighed as she realized she was making her worry. \"Hopefully it's nothing, but I want to be on land, just in case.\" she reasurred her partner. <br>\r\n<br>\r\n\"But it’s so nice out, I don't think anything’s wrong.\" Gabriel mused. <br>\r\n<br>\r\nXena reached down and took Gabriel’s hand. \"Just in case, can you go below? I have a feeling. A bad feeling.\"<br>\r\n<br>\r\n\"You and your feelings,\" Gabriel teased as she nodded her assent. <br>\r\n<br>\r\nGabriel left, leaving Xena alone with the captain. \"Head as fast as you can to the nearest port, how far out are we?\"<br>\r\n<br>\r\n\"It'll be hours before we get close enough to anything. Nightfall for sure. If this wind holds, we are going fast.\"<br>\r\n<br>\r\nXena nodded her understandingly. Though she didn't like it, it was the best she could do. Her senses screamed of danger that much was for sure. <br>\r\n<br>\r\nNightfall<br>\r\n<br>\r\nThe wind hadn't let up, so they were close to some sort of land at least. The wind had picked up a strange sound for the last hour, sort of a shrill whistle. The men were spooked, and so was she, if she had to admit it to herself. Gabriel had stayed below as Xena had asked. But now, she wished she was with her warrior, instead of cowering in the hull, waiting for something to happen.<br>\r\n<br>\r\nSure enough, the boat started to rock.  Rain sloshed down the boat, in a sudden torrent.   Gabriel held herself back from going up- Xena didn't need to worry about her in a time like this. The whistling wind turned into a shriek, and Gabriel had to cover her ears as to not to lose her sense of hearing. Huge hits rammed into the side of the boat, jerking its inhabitants to one side of the ship to another. A body slipped down from the opening, falling to the ground before Gabriel. <br>\r\n<br>\r\nGabriel knelt, holding a firm grip on the box beside her. She turned the figure over and gasped, the man had a huge gash in his head. Gabriel let him go, knowing he was dead, and mentally prepared herself to go find Xena. She couldn't leave her out there. They could just as easily ride out the storm together in the hull. <br>\r\n<br>\r\nShe climbed the ladder to get to the deck, slipping as she fanatically navigated the wet boards. Rain beat down at her from all sides, making it impossible to see. The wind ripped at her, trying to drag her to the depths of the sea. <br>\r\n<br>\r\n\"Xena!!\" Gabriel screamed, the wind whisking away her loud pleas. Her short hair whipped her face; she didn't know where on the ship she was. She slowly edged forward, grabbing on to anything solid as she made her way across. Her feet hit something, and she realized it was the steps to the wheel and rudder. She strained against the pitching ship and the tearing wind, each step a small victory. She made it to the top, sliding to the wheel. No one was there. <br>\r\n<br>\r\nShe grabbed to the wheel, trying at least to keep the ship in place. It struggled against her. She screamed in desperation as another giant wave crashed into the ship. Gabriel heard the ship creak. To her utter horror, she felt as the shipped ripped, and a loud snap reached her ears. Debris flew past her and she tried to duck. Too late, something very hard hit her in her temple. Gabriel fell, stunned, as the ship raged around her. <br>\r\n<br>\r\n\"Xena...\" she mumbled.<br>\r\n<br>\r\n<br>\r\nThe Island<br>\r\n<br>\r\nGabriel coughed as water entered her lungs. She raised her head, blearily opening her eyes. She saw sand, lots of sand. She coughed again as water rushed in her open mouth and nose. She gagged, eyes watering as she sat up. She immediately felt the headache, and she grazed her head. Her hand came away covered in blood. Gabriel looked around, seeing the beach she was lying on and trees in the distance. Her hand dropped back into the water, gazing out into the sea. Xena...<br>\r\nWhat had happened? One minute they had beautiful weather and then a terrifying storm. Xena could be dead... <br>\r\n<br>\r\nShe stopped the thought immediatley. Xena was a warrior, and she never would let a little storm defeat her. No, Gabriel would just keep herself alive until she could figure where she was and find Xena again. They had been separated in the past. She would be fine. <br>\r\n<br>\r\nAnother ripple of water rushed over her legs. Gabriel slowly got up, taking her time in case her headache got the better of her. She looked around, deciding to head towards the tree to see if there was any sort of civilization around. That’s where Xena would look for her first. <br>\r\n<br>\r\nShe made her way towards the trees, noticing it didn't take her as long as usual to get there. She passed a tree, more of a sapling really; it wasn't any taller than her calf. She made her way deeper into the forest. But stopped in the middle of it. Even the tallest tree was only a little over her height! And the trees were really odd. They weren’t very thick, but they all looked like they had reached their maximum height. <br>\r\n<br>\r\nGabriel turned as she heard a sound behind her.<br>\r\n</span></div></div>",
            "created":1380905880,
            "id":1674102,
            "title":"Gabrielle's travels "
        }
    },
    "info":{
        "author_id":"larry84",
        "author_name":"Lawrence84",
        "brief_description":"Gabrielle is no longer a small warrior anymore ;-).",
        "created":1292697900,
        "description":"<td align=\"left\" class=\"norm\">In this story, Gabrielle (Xena's friend prnicess the Warrior) becomes a giantess (more precisely in the fifth season, where Gabrielle and more combative, and are dressed this way( <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://xenite.net/images/Gab/gab08.jpg\" target=\"_blank\">http://xenite.net/images/Gab/gab08.jpg</a> )<br>\r\n<br>\r\nNO EVIL GTS GABRIELLE (GTS GABRIELLE VS EVIL GTS,IS OK)<br>\r\nNO NUDITY<br>\r\nNO GIANTS (ONLY GIANTESSES)<br>\r\nNO WEIGHT GAIN,INFILATION..ecc..ecc<br>\r\nA Lilliput ends up only Gabrielle, not xena But anyway, you will be aware of and below will make friends with someone who will remind  look like her great friend of many adventures.<br>\r\n</td>",
        "id":1733874,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1410628860,
        "modified":1410628860,
        "pretty_title":"Gabrielle (from Xena TWP) : The Titaness"
    }
}