{
    "chapters":{
        "1":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Densuke",
                "Chiharu",
                "Kirika",
                "Komoe",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start with who you'll be?<br>\r\n1. Densuke (<a rel=\"nofollow\" href=\"http://images4.wikia.nocookie.net/__cb20080531053108/eiken/images/8/85/DensukeProfile.gif\" target=\"_blank\">http://images4.wikia.nocookie.net/__cb20...</a>)<br>\r\n2. Chiharu (<a rel=\"nofollow\" href=\"http://animenews.animec.ru/gallery/images/anime/Eiken/ch_chiharu1.jpg\" target=\"_blank\">http://animenews.animec.ru/gallery/image...</a>)<br>\r\n3. Kirika (<a rel=\"nofollow\" href=\"http://media.animevice.com/uploads/0/743/26669-chkirika1nz6.jpg\" target=\"_blank\">http://media.animevice.com/uploads/0/743...</a>)<br>\r\n4. Komoe (<a rel=\"nofollow\" href=\"http://cdn.myanimelist.net/images/characters/10/12278.jpg\" target=\"_blank\">http://cdn.myanimelist.net/images/charac...</a>)<br>\r\n5. someone else</span></div></span></div>",
            "created":1373000400,
            "id":1623357,
            "title":"So let's start....Who are you?"
        },
        "11":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Kirika",
                "Komoe",
                "Yuriko",
                "Teacher",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>It's lunch time at school and you decide to head up to the clubroom to relax, hoping no one will be there. You make it up to the clubroom with plenty of time to eat, relax, and make it to your next class with lots of time to spare. Entering the room you notice no one was there, \"Aww, i wish Chiharu was here.\" Disappointed at not being able to spend some time alone with your crush you decide to just eat your lunch on the couch and see if anyone else comes in for lunch. You finish your meal and begin to throw away your trash when you hear someone coming. <br>\r\n<br>\r\n\"I'm starving\"<br>\r\n<br>\r\nRecognizing it was _______________ and not Chiharu, you decide to hide in the next room.</span></div></div>",
            "created":1373691600,
            "id":1627236,
            "title":"So you're Densuke...."
        },
        "112":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Komoe only eats the pudding off Densuke",
                "Komoe eats Densuke whole",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The pink hair, overly devolped girl, Komoe entered the club house carrying a tray of pudding for the club. \"Hey Komoe, do you need some help with that try, it looks like a lot of pudding.\"<br>\r\nKomoe nodded for help, but as Densuke got closer to grab the try she slipped and the tray flew straight at Densuke, covering him head to toe in pudding.<br>\r\n<br>\r\n\"I'm sorry Densuke\", Komoe covered her mouth in embarrassment. \"I'll help clean you up\", Komoe stepped towards the cabinets for some paper towels, but slipped on some pudding on the floor and fell onto Densuke.<br>\r\n<br>\r\n\"Oof....\", Densuke was now trapped underneath Komoe's massive breast. \"Komoe are you ok?\"<br>\r\n<br>\r\n\"Yea..\" her stomach growled from hunger, \"I was looking forward to eating this pudding too, i'm so hungry\". Komoe looked at Densuke's pudding covered face, \"I hope you don't take this the wrong way..\" she leaned over and licked some pudding off his face, \"Mmm...the pudding is good, but you make it taste even better. I don't think i'm gonna need towles to clean you up\", Densuke saw the hunger in her eyes and started to get a bit worried about what she meant.<br>\r\n</span></div></div>",
            "created":1395032400,
            "id":1762112,
            "title":"Komoe"
        },
        "1121":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Komoe finishes all the pudding.",
                "Komoe close down his pants and things get even more sexual.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Komoe seem to be in a trance as she continued to eat the pudding off of Densuke's body. Densuke was becoming aroused the buxom girl continued to lick at his body even pulling off his shirt to get some  pudding that had slipped down his collar.</span></div></span></div>",
            "created":1407646800,
            "id":1839807,
            "title":"Komoe only eats the pudding off Densuke"
        },
        "11212":{
            "author_id":"marson89",
            "author_name":"Marson",
            "choices":[
                "He starts cumming down Komoe's throat, and his cum makes Komoe's boobs grow.",
                "Densuke tries to get Komoe off of him, but ends up with her boobs in his face."
            ],
            "content":"<div class=\"\"><div> <span>\"Komoe can't believe how good the pudding tastes on you Densuke.\"  Komoe said as she kept on licking Densuke's chest, her massive breasts pressing against his crotch; his dick was getting real hard and pushing against her soft tit flesh from inside his pants.  \"Oh, there's more pudding down in your pants Densuke.\"  Komoe got her boobs off of him, undid his belt and unzipped his pants, letting his cock spring free out of his boxers.  \"Wow, Densuke looks so big.\"  She sniffed at his cock.  \"Komoe can tell, this smells even better than the pudding!\"  Komoe opened her mouth wide open and went down on Densuke's rock hard cock, and her excited moans of satisfaction said that she thought this was the best tasting thing she'd ever had in her mouth.<br>\r\n<br>\r\nDensuke stared in shock until...</span></div></div>",
            "created":1413003600,
            "id":1870068,
            "title":"Densuke gets hot and heavy with Komoe!"
        },
        "112121":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Komoe climbs on top of him again wanting \"something else\" filled up this time.",
                "Densuke can't resist reaching out and grabbing Komoe's boobs"
            ],
            "content":"<div class=\"\"><div> <span>As Komoe's tongue danced around his cock Densuke couldn't hold back and started to cum. Komoe was at first surprised but reacted quickly enough and started gulping down Densuke's seed. As she drank down the cum Komoe's boobs began to grow swelling and straining against her shirt. After a few minutes the flow of cum petered out and Komoe got up from on top of Densuke showing her breasts were much bigger and were creating several tears and holes in her shirt. She sat back and patted her pleasantly full belly, she opened her mouth seemingly to say something but instead produced a surprisingly loud and deep belch forceful enough to shake her bust. This was the last straw for her already overtaxed shirt which burst off her body leaving her boobs bare.<br>\r\n<br>\r\nDensuke could only sit there and stare at Komoe  who had over the course of the past few minutes giving him the best orgasm of his life and nearly doubled her own bust size.</span></div></div>",
            "created":1443243600,
            "id":2040168,
            "title":"He starts cumming down Komoe's throat, and ..."
        },
        "1121211":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Pussy.",
                "Asshole. (Butt expansion)"
            ],
            "content":"<div class=\"\"><div> <span>Before Densuke could react Komoe climbed on top of him again pressing her huge boobs against his torso and straddling his waist.<br>\r\n\"Komoe feels hot especially down there.\" Komoe said as she ground there crotches together making Densuke rock hard in spite of the mind blowing orgasm he had just experienced. <br>\r\n\"Komoe wants you to make her feel good to fill her up.\" She continued.<br>\r\nDensuke was incredibly horny and couldn't deny his last anymore, he picked up Komoe and brought her down plunging is cock into her...</span></div></div>",
            "created":1447131600,
            "id":2059514,
            "title":"Komoe climbs on top of him again wanting \"s..."
        },
        "1122":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Komoe wakes up later in the day",
                "Someone walks in while Komoe is asleep",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Komoe started licking Densuke's face clean of pudding. Komoe even licked his lips a few time and even gave him a kiss for a second. She pulled back after realizing what happened, \"Ooh my god. That was my first kiss Densuke, i'm glad it was with you.\"<br>\r\n<br>\r\nDensuke looked into her eyes, \"Well it was my first time too.\"<br>\r\n<br>\r\n\"What?! i thought you and Chiharu had kissed already?\"<br>\r\n<br>\r\nDensuke looked away a bit embarrassed, \"No, we haven't yet. I like all you girls her in Eiken so i had been trying to figure out which one i would give my first kiss too. I'm glad it was with you, you're very kind and gentle, plus you have the biggest breast in the club for your size.\"<br>\r\n<br>\r\nKomoe blushed, \"I'm happy to help. You know there's another 'first' i want to try with you, and i hope you'll enjoy it as much as i will.\"<br>\r\n<br>\r\nDensuke was puzzled, was she thinking of having sex? Kissing is one thing, but he hasn't really decided who his first time would be with yet. \"I...i hope you're not thinking of sex?\"<br>\r\n<br>\r\nKomoe's face became a bright red, \"Oh no no no, I would lik....i mean, it's something Kirika showed us a while back and i've been trying to find someone to try it out with.\" Komoe brought her face close to Densuke's, \"All you have to do is relax and close your eyes.\"<br>\r\n<br>\r\n\"Well if it's not sex i guess i could help you.\"<br>\r\n<br>\r\nDensuke closed his eyes, waiting to for what's next. Komoe giggled and clapped her hands, \"Thank you Densuke, you don't know how happy you've made me.\"<br>\r\n<br>\r\n\"Glad i could hel...\", Komoe opened her mouth large enough to stuff Densuke's head into it. Shocked by the sensation of having his head in something so humid and slimy, he tried to to free himself from her maw, but realized his arms and body was still pinned underneath Komoe's massive breast. Komoe loved the flavor of the pudding in his hair mixed with his own delightful taste, she began to suck on his head, getting aroused by the taste. Komoe started sucking Densuke into her mouth, little by little, savoring every inch of him passing by her tongue. Soon she got to his shoulders, she made sure he was wrapped up by her breast so he couldn't free himself, as she plunged her head into her cleavage. Densuke was now chest deep inside of Komoe. <br>\r\n<br>\r\nDensuke's arms were now trapped to his sides, half way inside the tiny pink haired girl. Komoe then stood up to get better leverage, knew there was no way for him to escape now. She bent over more and more as the young boy was sucked into her even deeper. Komoe's arousal was getting the best of her, as she brought a hand down to her crouch and started to rub her pussy. She was locked in a state of ecstasy, She now was to Densuke's waist and brought one hand to his read end to help push him in fast. Komoe was getting close to the end of her meal, she had pushed him so only his feet and calves were left. Her knees buckled from her pleasure and she landed on her ass. The impact made Densuke drop even deeper into Komoe, so only his feet remained. <br>\r\n<br>\r\nKomoe was on the brink of climaxing, she knew once she swallowed the last bit of her crush, she'd explode. She couldn't take it much longer and grabbed the boy's feet and pushed them into her mouth, her lips closed behind him as the rest of his body slide into her stomach. Just as she slurped him down she began to climax from the sensation of the rest of his body finally reaching her belly, she arched backwards as she began to orgasm over and over. Her eyes rolled back into her skull, as she furiously came all over the flow, a torrent of female cum gushed out of her. After a few minutes she finally collapsed onto the floor, exhausted from cumming so many times. Komoe looked down her body and notice another large round orb, which wasn't her breast, her belly now housed her first kiss. \"I hope you enjoyed that Densuke, you were amazing.\" Komoe leaned her head back onto the floor as she brought both hands to her engorged belly and began to rub it as she drifted to sleep.</span></div></div>",
            "created":1415941200,
            "id":1886249,
            "title":"Komoe eats Densuke whole"
        },
        "11222":{
            "author_id":"yuki_mizuki",
            "author_name":"Yuki",
            "choices":[
                "Chiharu hear's you ",
                "Chiharu doesn't hear you because of something else"
            ],
            "content":"<div class=\"\"><div> <span>20 minutes later as Komoe slept with a smile on her face and Densuke tried to find a way out from his fleshy prison, making Komoe's large belly orb move about, <br>\r\n<br>\r\n \" huh, what's with all this white stuff splattered on the ground and why is Komoe laying like that and where Densuke ? \" a Feminine voice asked Densuke recognized that voice it was Chiharu and tried to yell and move to get her attention.  he moved around more feeling Komoe's hot stomach wall press against him as Komoe rolled on to her side.  <br>\r\n<br>\r\n\" Gah, Help me Chiharu i'm in Komoe's belly she ate me\"  Densuke yelled as he pressed against her belly more <br>\r\n <br>\r\n</span></div></div>",
            "created":1424754000,
            "id":1939535,
            "title":"Someone walks in while Komoe is asleep"
        },
        "112222":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Chiharu",
                "Komoe"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu didn't hear Densuke's pleas for freedom because Chiharu's head was suddenly trapped in Kirika's bosom. \"Oh sorry about that Chiharu, you stopped so suddenly in front of me.\" Chiharu tried to free herself from the Kirika's flesh mountains, but Kirika noticed Komoe on the ground, caressing her belly squirming under her hands. A smirk came over Kirika's face, she knew what Komoe had done, and she wanted to try it too. She licked her lips looking at the bloated belly of Komoe and then realized she still had Chiharu trapped between her breast, \"I am pretty hungry and i think Chiharu can fill my hunger. But Komoe looks so helpless on the floor. and with her gone i'll have the biggest breast in the club.\"<br>\r\n<br>\r\nKirika decides to vore........</span></div></div>",
            "created":1425877200,
            "id":1946399,
            "title":"Chiharu doesn't hear you because of somethi..."
        },
        "12":{
            "author_id":"crystalninja",
            "author_name":"CrystalNinja",
            "choices":[
                "Soccer Field. Jubei has a match today and she promised to come watch and support",
                "Beach. She wants to go swimming & there shouldn't be that many people there now.",
                "Park. She has a date with Densuke today and they're supposed to meet there.",
                "Eiken Club, where Komoe is cleaning up and the bimbo is happy to see her.",
                "Just a walk, but she walks by a fortuneteller's tent that piques her curiousity."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, I have grown again haven't I?\" Chiharu said though when she was concerned, there was only one kind of growth she could be talking about and that was that her massive breasts had grown even bigger again. Most girls would be overjoyed at more growth, but it worried Chiharu since her bust was already so damn huge and fat. It send plenty of boys her way, but she was just so shy and nervous around boys that she really didn't like all the attention she was getting. And of course this only made her more popular with guys.<br>\r\n<br>\r\n\"This H-cup bra is already feeling tight.\" She hadn't even gotten it that long ago, yet it already felt like it was getting too small for her ever-growing bust. \"Well it can't be helped.\" She said as she started to get dressed. She was already 16, she couldn't have that many years of growth left...right? She couldn't keep growing forever, that would just be insane!<br>\r\n<br>\r\nOnce dressed in a shirt that was very tight on her bust and skirt that was close to exposing her fat butt to everyone, she headed put of the house to...</span></div></div>",
            "created":1415854800,
            "id":1886041,
            "title":"Chiharu Shinonome, busty redhead like no other."
        },
        "122":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "Chiharu's bikini snaps off. She's going through another growth spurt.",
                "Chiharu runs into Kirika",
                "Chiharu runs into a young girl"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu Shinonome made her way to the beach. She had wanted to go swimming and she felt that today was a good day to do so. When she arrived at the beach Chiharu was surprised that only a couple of people were there at this time.<br>\r\n<br>\r\nThe lack of people there made Chiharu feel as if she had the whole beach to herself. Going on that feeling Chiharu changed into her two-piece bikini. It clung tightly to her breast and butt.<br>\r\n<br>\r\n\"I just bought this bikini.\" Chiharu said. \"I couldn't have grown again so fast, could I?\"<br>\r\n<br>\r\nDeciding not to let her sudden growth get her down Chiharu enjoyed herself at the beach. She swam in the water, built a sand castle, walked along the beach, and just had herself a good time.<br>\r\n<br>\r\nThe beach was still practically empty when sometime later...</span></div></div>",
            "created":1497560880,
            "id":2336608,
            "title":"Chiharu at the beach"
        },
        "1221":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "Chiharu's breasts continue to grow",
                "an Eiken girl comes up to Chiharu",
                "Densuke Mifune arrives at the beach",
                "Chiharu tries to continue her day at the beach",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>*SNAP*<br>\r\n<br>\r\nChiharu's eyes widened at that sound. She looked to see that her bikini top had snapped off. Chiharu's first instinct was to cover herself with her hands.<br>\r\n<br>\r\n\"I just bought that bikini!\" Chiharu exclaimed.<br>\r\n<br>\r\nChiharu then felt something pressing against her hands. She looked down and noticed that her hands were getting pushed away.<br>\r\n<br>\r\n\"My...My breasts... They're...They're getting bigger!\" Chiharu yelled.<br>\r\n<br>\r\nThe beach was still practically empty with only a few people there, and they were all busy doing there own thing. Plus, Chiharu was quite far away from everyone else, so she didn't have to worry about anyone staring at her. Chiharu could only watch as her breasts grew and grew. She knew she was still a growing girl, but this was still surprising.<br>\r\n<br>\r\nChiharu let out a sigh of relief when her breasts stopped growing at N-cup size. \"I'm now bigger than mother!\" Chiharu exclaimed. \"What do I do now?!\"<br>\r\n---<br>\r\n<font class=\"size2\" style=\"\">Chiharu's current size: N-cup size</font></span></div></div>",
            "created":1593548100,
            "id":2859261,
            "title":"Chiharu's bikini snaps off. She's going..."
        },
        "1222":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "\"Yep! Everyone from the Eiken Club is here!\"",
                "\"No! I'm here by myself!\"",
                "\"I only brought Densuke with me!\" Kirika points to where Densuke is"
            ],
            "content":"<div class=\"\"><div> <span>Chiharu was waling along the beach when she noticed someone up ahead.<br>\r\n<br>\r\n\"Kirika?\" Chiharu called out.<br>\r\n<br>\r\nIndeed it was Kirika Misono. She wore a black bikini which, just like Chiharu's, clung tightly to her breast and butt. Kirika turned to Chiharu, causing her breasts to bounce, and smile. \"Chiharu!\" Kirika exclaimed, \"Nice to see you here!\"<br>\r\n<br>\r\nChiharu responded, \"Kirika you decided to come to the beach today.\"<br>\r\n<br>\r\n\"Yep! I just wanted to enjoy being here!\"<br>\r\n<br>\r\n\"Is everyone else from the Eiken Club here?\" Chiharu asked.<br>\r\n<br>\r\nKirika smiled, then said...</span></div></div>",
            "created":1497728580,
            "id":2337746,
            "title":"Chiharu runs into Kirika"
        },
        "12222":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "Chiharu has another growth spurt",
                "Kirika gropes Chiharu's boobs. Seems Kirika has noticed Chiharu's growth spurt",
                "Kirika suddenly kisses Chiharu",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>\"No! I'm here by myself!\" Kirika Misono stated.<br>\r\n<br>\r\nChiharu Shinonome was surprised. Usually when Kirika goes somewhere she brings along everyone else.<br>\r\n<br>\r\n\"Well,\" Chiharu said, \"now you're with me.\"<br>\r\n<br>\r\nKirika laughed. \"It's been a while since it's been just the two of us Chiharu!\"<br>\r\n<br>\r\nChiharu and Kirika walked along the beach, idly chatting with each other. That was when...</span></div></div>",
            "created":1518292560,
            "id":2451427,
            "title":"Kirika came to the beach alone"
        },
        "123":{
            "author_id":"marson89",
            "author_name":"Marson",
            "choices":[
                "She sees Densuke, who offers her a very odd but pretty flower.",
                "She's early, so she waits for Densuke while people stare at her.",
                "She's on time, but Densuke's nowhere to be found!"
            ],
            "content":"<div class=\"\"><div> <span>\"Boy, I can't believe I'm on a date with Densuke!\"  He was small and meek and to most the world nothing special at all, but so far as she was concerned, the boy who was the first to grope her humongous breasts was the boy of her dreams!  \"And we're so lucky that everyone else in the Eiken Club is busy today.\"  Almost every other time they tried to get together, Kirika and the others got involved and made things awkward, but this time things were going to be different, today they were going to have a good time together, and maybe even hold hands!<br>\r\n<br>\r\nThus, Chiharu reached the park, and then...</span></div></div>",
            "created":1415854800,
            "id":1886091,
            "title":"Chiharu's on a date with her dream boy!"
        },
        "1233":{
            "author_id":"crystalninja",
            "author_name":"CrystalNinja",
            "choices":[
                "Continues waiting, but Densuke just isn't arriving, even after an hour.",
                "Searches around the park & bumps into young boy who vaguely resembles Densuke.",
                "Gets a call from Densuke who says he's coming & he has a surprise for her."
            ],
            "content":"<div class=\"\"><div> <span>She went under the tree where they were supposed to see and checked her watch to see that she was exactly on time, however Densuke wasn't anywhere around which was strange since he was pretty punctual.most of the time. It disappointed her that their date couldn't start exactly on time, but she was a patient girl and any time spend with Densuke would be great.<br>\r\n<br>\r\n''I just hope he isn't hurt.'' Chiharu would hate if something bad were to happen to him. However, five minutes passed and Densuke was still nowhere to be sen and Chiharu was starting to get more worried. Worried that Densuke would have gotten hurt and worried that he stood her up for something else, maybe another girl!<br>\r\n<br>\r\nThen Chiharu...</span></div></div>",
            "created":1415941200,
            "id":1886282,
            "title":"Where's Densuke?"
        },
        "12332":{
            "author_id":"marson89",
            "author_name":"Marson",
            "choices":[
                "The boy says he is Densuke, he get his age reduced by Kyoko!",
                "Chiharu leans over to look the boy in the eye and ask if he's okay."
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe I'm not in the right spot?\"  Chiharu knew she was, but she couldn't help her doubt and her submissive nature meant that she would always take the blame even when the other party was in the wrong; thus, she started walking around the park, looking for any sign of her beloved Densuke.  \"Oh, where could he be?\"  She was so consumed with worry about her favorite boy that she was caught off guard by something bumping right into her breasts!  \"Ah!\"  Even that momentary contact was a bit much for her sensitive tits.  \"I'm sorry!\"  She pulled back and looked down, and then gasped; it was a young boy, who kind of sort of vaguely maybe looked like Densuke.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1415941200,
            "id":1886303,
            "title":"Chiharu searches and makes an interesting find."
        },
        "13":{
            "author_id":"compactorflame",
            "author_name":"CompactorFlame",
            "choices":[
                "You need to eat someone, like Chiharu did",
                "You need to breast vore someone, like Komoe did",
                "You need Kyoko's help to enlarge your breasts with science",
                "Reader's Choice/Something Else"
            ],
            "content":"<div class=\"\"><div> <span>As Kirika Misono, you had just gone through a normal day of school. Well, as normal as it could get for you, anyway. Constantly smothering Densuke with your G-Cup breasts, teasing Chiharu's insecurity about her voluptuous body using your own...good times, good times. The school bell rang, and it was time for your favorite part of the day: the meeting of your very own Eiken club. You sat down at your usual spot next to Kyoko's noodle machine, and watched as the members of Eiken filed in. Kyoko sat next to the machine and took attendance. Yuriko had a special semester class she was taking that day, so she couldn't make it. Still, the other members all arrived: Chiharu, Komoe, and Densuke.<br>\r\n<br>\r\nKyoko adjusted her glasses. \"All right, so it looks like everyone who can be here is here. Let me check the date...April 7th.\"<br>\r\n<br>\r\nYou sat, stunned. Was it that day already? But Densuke's still in the room...It could be dangerous to let him know. \"Um...I know I don't usually ask this, but Densuke...could you leave the room for a bit?\" Chiharu give you a discerning look, and you meet their gaze. It <i>was</i> that time.<br>\r\n<br>\r\n\"Um, um, I...Ms. Kirika, I, um...\" Before Densuke could finish his stuttering, Komoe pressed a button and a mechanical arm extended from the floor and \"escorted\" him out the door.<br>\r\n<br>\r\nOnce he was out of the room, you asked everyone to huddle up closer, your voice increasingly stressed. \"Guys, I don't know what to do this time. The pill I usually take to suppress this...I don't think it'll work this time.\"<br>\r\n<br>\r\nChiharu clenched her fists, obviously relating to you. \"I know the feeling. It stopped working for me last year, but since my time's in summer vacation I managed to deal with it.\"<br>\r\n<br>\r\nKomoe nodded and frowned, looking at her own H-cup breasts on her tiny body. \"The same thing happened to me, and I was lucky it was in winter break. If anyone saw me...\"<br>\r\n<br>\r\nKyoko sighed. \"I'm lucky I don't have to deal with this myself, in fact I don't really get why you guys really need to find different ways to increase your breast size the same time every year. I mean, what could happen? But I could try and find another way for you to deal with it, Kirika, if my pills aren't working anymore.\"<br>\r\n<br>\r\nYou put your hand to your chin, accentuating your breasts between your arms and surprisingly keeping the uniform in one piece. You look to Chiharu and Komoe. \"How did you two deal with it?\"<br>\r\n<br>\r\nChiharu blushed, embarrassed, and answered. \"Well...you see...I headed into a dark alley around the city on the day I needed to...managed to get ambushed by a mugger...and I...I ate the mugger whole...\" With that, Chiharu became more embarrassed and tried to use her arms to cover her mouth and F-cup breasts.<br>\r\n<br>\r\nYou were shocked by this, but at the same time intrigued. Maybe you can do that with someone. \"Really? Komoe, what did you do?\"<br>\r\n<br>\r\nKomoe had the largest breasts, so for her it must have been the hardest. \"Well, it was winter vacation, and I knew that some ice fishers would be somewhere around the frozen pond I was staying by. So I found one who was about to freeze to death and...well, I put him into my breasts through my nipple.\"<br>\r\n<br>\r\nYou were even more shocked and intrigued by Komoe, could you do the same thing? But before you could consider that...Kyoko stood up. \"Well...to be honest, I've been looking up breast-enlarging serums and devices to use on myself, since my breasts are so small. And while my solutions don't seem to work on me, they probably will work on you.\"<br>\r\n<br>\r\nYou look at the three girls with the three options you have in front of you, and decide that in order to take care of this...</span></div></div>",
            "created":1409029200,
            "id":1847954,
            "title":"Kirika, desparately needing to grow"
        },
        "132":{
            "author_id":"compactorflame",
            "author_name":"CompactorFlame",
            "choices":[
                "Breast vore Yuriko",
                "Breast vore two kids at once",
                "Try eating someone instead"
            ],
            "content":"<div class=\"\"><div> <span>You stood up quickly, your breasts bouncing up and down but also starting to hurt a little...you needed to take care of this matter soon. Pointing to Komoe, you proclaimed, \"I've decided. You're going to help me put someone into my breasts.\"<br>\r\n<br>\r\nKyoko was left wide-eyed and speechless by your statement, but Komoe just jumped up and down in excitement, her breasts bouncing wildly and even smacking into her own face. Chiharu, on the other hand, was nervous about exactly who you would choose to breast vore first. \"Um...Ms. Kirika...do you think you could...not put Densuke into your breasts? I really do love him...and I feel that if anyone should use him to satisfy our annual needs...it should be me.\"<br>\r\n<br>\r\nYou thought for a second, considering how devilishly fun it would be to put Densuke into your breasts to increase their size, but you decided to adhere to Chiharu's request. Besides...having Chiharu do it herself one day might prove <i>very</i> interesting. \"Oh, I won't do it with Densuke. At the very least, I need to be better-acquainted with how it works first.\"<br>\r\n<br>\r\nChiharu sighed with relief, and walked out of the room to spend some time with Densuke. Kyoko followed them, to make sure that you and Komoe had some space to work. After some discussing how exactly breast vore worked and what it would require, Komoe took out her cellphone and called someone she said might seem nice on the outside, but was a real bully to big breasted girls, especially Komoe. It took some coercing, but the bully arrived at the room after a little while. You were relieved, as your breasts were starting to feel really painful.<br>\r\n<br>\r\n\"So, what am I doing here, again?\" The bully was a boy Komoe's age named Kaito. He was somewhat short, thin figure, and slightly muscular for someone of his size. You looked at him, thinking he looked good...good enough to eat, anyway. But you needed to go along with you and Komoe's plan. \"You said you needed me over for an...what was it, an interview?\"<br>\r\n<br>\r\nKomoe did her best not to stutter. \"Kaito, you're here because...well...a friend of mine needs you to answer one of her questions.\" With that, you shut the door behind Kaito and threw your school uniform's top onto Kaito, blinding him. With only your large bra left to cover your breasts, you came over to him from behind and asked your question. \"Tell me, Kaito, what do you think of large breasts?\" Kaito responded harshly, still trapped under the large shirt. \"Big breasts are over-rated, and shouldn't exist! The breasts on the girls in this school make them look like freaks!\"<br>\r\n<br>\r\nKomoe did her best to stay quiet, but you noticed a tear coming to one of her eyes. This boy really did deserve what you were about to do to him. \"Oh, really, now?\" You pulled Kaito out from under your shirt and smothered him between your breasts, encompassing his entire head. \"What do you think of them now?\" Suffocated between your huge breasts, Kaito fell unconscious. He really did look cute when he was unconscious, but a sharp pain in your breasts reminded you that time was of the essence.<br>\r\n<br>\r\nAs directed by Komoe, you took off your bra and released the unconscious Kaito to the floor. Your breasts, now completely uncovered, bounced wildly with pert nipples. You rubbed the areola on your left breast in a circular motion, and the nipple started to open. Because you were distracted by the sensations of rubbing your breast, Komoe helped by lifting Kaito's head over to your left nipple. Your nipple then started to open wider and wider until Komoe could finally push Kaito's head all the way inside. This provided you an amazing sensation, causing you to moan, and Komoe gave you tips on how to let your breasts pull him in the rest of the way.<br>\r\n<br>\r\nClosing your eyes and focusing on moving Kaito's limp body into your own, you manage to slowly direct your breast into taking more and more of him inside. Eventually, you opened your eyes to see that Kaito's waist and below were the only things outside your breast, and from your perspective it already looked much bigger. Taking him farther in, you noticed that your left breast had also started to shuffle around and grow, as Kaito's head was transferring to it mid-vore.<br>\r\n<br>\r\nKomoe pointed at your left breast and explained. \"Well, you see...when the breast with the nipple you're using takes in half of a body, it starts transferring that body to the other breast to make room for the second half. I heard that if you're doing two people at once it's kinda different...\" Two people at once? If putting one person into your breasts was this much fun, imagine what two would be like! Maybe next time, though. For now, you needed to focus on finishing the job with Kaito. Your right breast was almost at the size of your left one, so it shouldn't take much longer. Once Kaito's feet finally made it into your left breast, the nipple closed and the two breasts were even. But somehow they were still hurting like before.<br>\r\n<br>\r\n\"Komoe, what's going on?\" Komoe looked at you and simply said, \"Well, your breasts are just holding someone inside them right now, they actually haven't grown yet. You have to focus on digesting whatever's inside them into milk and fat.\" You looked surprised. \"Milk?\" Komoe shrugged. \"Well, yeah. When I put that fisherman in my breasts, I started milking a little bit...I had to really squeeze, but I got some out.\" Excited by the prospect of having your large breasts produce milk, and you were about to focus on digesting Kaito when you felt some rumbling in your breasts and heard a muffled scream come from them. Apparently Kaito had woken up and was using his last efforts to get out of your breasts...but all it did was tickle you.<br>\r\n<br>\r\n\"Now now, calm down, this will all be over soon.\" Focusing again, you started digesting Kaito's body into milk and breast fat, and the struggling died down. Your breasts also shrank slightly from their larger and disfigured state, but not by much. By the time Kaito was entirely a part of your breasts, the pain was finally gone and your breasts had grown from a G-cup to an I-cup. They had also gotten more perky, bouncy, and malleable. If putting one small boy in your breasts could do that, imagine what'd happen if...Even though you no longer needed to make your breasts larger, you wanted to experience more breast vore.<br>\r\n<br>\r\nYou told Komoe to pass on that for a special reason, the Eiken meeting tomorrow was canceled. And so the next day...</span></div></div>",
            "created":1409461200,
            "id":1849667,
            "title":"You need to breast vore someone, like Komoe did"
        },
        "134":{
            "author_id":"compactorflame",
            "author_name":"CompactorFlame",
            "choices":[
                "Keiko's sure to have some ideas!",
                "Kirika's a big girl, she can handle herself.",
                "Yes, let's get some ideas going with a different setup."
            ],
            "content":"<div class=\"\"><div> <span>Would you like a suggestion from Chiharu's much bustier mother, Keiko Sinonome?<br>\r\n<br>\r\nAre you going to leave the club room and figure out something on your own?<br>\r\n<br>\r\nOr if the previous chapter isn't suiting you (which) Perhaps you'd like to start fresh without it. Entirely up to you!</span></div></div>",
            "created":1579018860,
            "id":2773670,
            "title":"Reader's Choice/Something Else"
        },
        "14":{
            "author_id":"marson89",
            "author_name":"Marson",
            "choices":[
                "Komoe drinks a special brand of milk that makes her boobs grow.",
                "Komoe takes special pills to make her boobs grow.",
                "Komoe has a magic wand she keeps in her cleavage.",
                "Komoe just thinks about boys and her boobs do the rest.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Komoe Harumachi was a very, very happy girl, because she had the biggest boobs in the Eiken club and therefore in all of Zashono Academy, and this was no small feat for two reasons; first of all, the Eiken club had some very very buxom girls in it, especially Chiharu Shinonome and Kirka Misono who had absolutely gigantic breasts that would make regular bras break apart just by being in the same room as them, and yet Komoe was much bigger than either of them.  Second, Komoe was only in the sixth grade; that's right, the girl whose bust measured 111 cm around still had years and years worth of growth ahead of her.  \"Ha ha.\"  Komoe giggled to herself in her room as she looked at herself in the mirror, her colossal cans hanging out in the open as she'd just gotten out of bed.  \"Komoe's going to do her best to get even bigger!\"<br>\r\n<br>\r\nYes, Komoe had been deliberately making her breasts grow far, far bigger than anyone elses, and she was going to make them even bigger; after all, she had the biggest crush on one Densuke Mifune and so she wanted to have the biggest fattest boobies of all to offer to him so that he'd be her boyfriend!  So, what was Komoe's trick?</span></div></div>",
            "created":1413003600,
            "id":1870060,
            "title":"Komoe Harumachi's happy boob growing secret!"
        },
        "145":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "She eats someone",
                "She unbirths someone",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Vore related?</span></div></span></div>",
            "created":1577679480,
            "id":2766775,
            "title":"Something else."
        },
        "1453":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Anal Vore",
                "Breast vore",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more vore options</span></div></span></div>",
            "created":1577679540,
            "id":2766777,
            "title":"Something else"
        },
        "14532":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Finds a member of the Eiken club",
                "Finds someone random"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Komoe needs to find other busty beauties for her breast to gobble up and turn into more breast fat. Now the question is should she go for someone in her own club or some random girl that no one will notice is missing.</span></div></span></div>",
            "created":1577680320,
            "id":2766782,
            "title":"Breast vore"
        },
        "15":{
            "author_id":"thecore",
            "author_name":"The Core",
            "choices":[
                "Teacher ",
                "Kyoko ",
                "Lin Grace",
                "Yuriko",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a few more choices<br>\r\n<br>\r\n1. Teacher (<a rel=\"nofollow\" href=\"http://images.wikia.com/eiken/images/9/99/TeacherProfile.gif\" target=\"_blank\">http://images.wikia.com/eiken/images/9/9...</a>)<br>\r\n2. Kyoko (<a rel=\"nofollow\" href=\"http://images1.wikia.nocookie.net/__cb20080531053244/eiken/images/7/7b/KyokoProfile.gif\" target=\"_blank\">http://images1.wikia.nocookie.net/__cb20...</a>)<br>\r\n3. Lin Grace (<a rel=\"nofollow\" href=\"http://i47.photobucket.com/albums/f154/harimadez/MagicalKanan/eiken_lin.gif\" target=\"_blank\">http://i47.photobucket.com/albums/f154/h...</a>)<br>\r\n4. Yuriko (<a rel=\"nofollow\" href=\"http://www.absoluteanime.com/eiken/yuriko.jpg\" target=\"_blank\">http://www.absoluteanime.com/eiken/yurik...</a>)<br>\r\n5. Someone else (who's not in the eiken club)</span></div></span></div>",
            "created":1373000400,
            "id":1623362,
            "title":"Someone else"
        },
        "151":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "a ring",
                "a bottle of pills",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Teacher entered her home feeling worn out.<br>\r\n<br>\r\nToday was just another day of being ignored and tripping over her own feet. Lately nothing good has happened to her.<br>\r\n<br>\r\nTeacher was about to enter her room when she noticed a small box at her door. She picked it up and entered her room. On the box was a note:<br>\r\n<br>\r\n<i>-This will help you get lots of attention. Or at least the attention of the one you want the most.</i><br>\r\n<br>\r\n<i>'The person I want the most?'</i> Teacher wondered. An image of Densuke Mifune appeared in her head. Teacher shook that thought out. \"I'm a Teacher and Densuke's a student! We can't be anything more than that!\" Teacher repeated to herself while her face was red.<br>\r\n<br>\r\nTeacher opened the box and pull out...</span></div></div>",
            "created":1375678800,
            "id":1640574,
            "title":"Teacher's gift"
        },
        "1511":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "the ring glows again",
                "one of the Eiken girls come over",
                "Densuke comes over"
            ],
            "content":"<div class=\"\"><div> <span>Inside the box was a silver ring with a green emerald on it. Teacher put it on her finder and liked the way it looked. \"This ring is gorgeous. Who would send it to me?\" Teacher looked to see if there was a name on the note, but couldn't find one.<br>\r\n<br>\r\nShe told herself not to worry about and and went to have dinner. After her meal Teacher went to bed.<br>\r\n<br>\r\nWhile Teacher slept the ring glowed a bright green light. Teacher's body warmed up.This went on for a few minutes before the light went away. Teacher remained asleep through it all.<br>\r\n<br>\r\nWhen Teacher awoke the next morning she felt heavy. Teacher went to her bathroom and looked at her reflection. She was shocked with what she saw.<br>\r\n<br>\r\nHer nightshirt was struggling to hold breasts that were much larger than they were before. Teacher guess they must be at least G-cup size. \"My...My breasts. T-They're almost as big as Kirika's!\" Teacher exclaimed. Part of her was shocked, but another part of Teacher actually liked how she looked right now.<br>\r\n<br>\r\nJust then...</span></div></div>",
            "created":1375678800,
            "id":1640577,
            "title":"Teacher's ring"
        },
        "15111":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "the ring glows again",
                "one of the Eiken girls knocks on her door"
            ],
            "content":"<div class=\"\"><div> <span>The ring suddenly glowed bright green. Teacher's already tight nightshirt got even tighter. \"What's going on?\" she wondered.<br>\r\n<br>\r\nTeacher was then hit by a massive wave of pleasure. She let out a very loud moan. Through the pleasure Teacher was able to see that her breasts were getting bigger. She let out a moan as each button flew off her nightshirt. Soon her nightshirt couldn't cover her anymore.<br>\r\n<br>\r\n\"They're...They're really getting bigger!\" On impulse Teacher cupped her bosom. This caused a massive wave of pleasure to hit her, causing Teacher to fall to her knees.<br>\r\n<br>\r\nThe growth quickly ended a few seconds later. Teacher looked at her breasts which were about K-cup size. \"They're so big!\" she exclaimed. </span></div></div>",
            "created":1375938000,
            "id":1642795,
            "title":"Glowing ring"
        },
        "151112":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "Kirika Misono",
                "Yuriko Shinonome",
                "Komoe Harumachi",
                "Kyoko Morooka",
                "someone else had come in"
            ],
            "content":"<div class=\"\"><div> <span>Teacher was on the floor, pant heavily from the pleasure she had felt from her now K-cup sized breasts.<br>\r\n<br>\r\nThe ring was still on her finger.<br>\r\n<br>\r\n*Knock* *Knock* *Knock*<br>\r\n<br>\r\nSomeone was at her door. \"Teacher are you there?\" a girl called out.<br>\r\n<br>\r\n\"D-Don't come in!\" Teacher exclaimed as she tried to stand up.<br>\r\n<br>\r\nThe girl didn't hear Teacher clearly, and entered the room. They gasped when they saw Teacher. \"Teacher, you're huge!\" she exclaimed.<br>\r\n<br>\r\nTeacher could only blush as she looked at...<br>\r\n---<br>\r\n<font class=\"size2\" style=\"\">Teacher's current size: K-cup size</font></span></div></div>",
            "created":1596921780,
            "id":2882556,
            "title":"one of the Eiken girls knocks on her door"
        },
        "152":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "a drink",
                "a ray gun",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I've finally finished it!\" Kyoko Morooka exclaimed.<br>\r\n<br>\r\nThe last few months she had spent on this creation and now it was finally finished.<br>\r\n<br>\r\nAlthough she didn't show it, Kyoko Morooka was bothered with the fact that she was so small. Everyone around her was bigger than she was. Kirika was proud of her body, Komoe had the biggest breasts in the club, and Chiharu was still growing. Kyoko couldn't take it anymore and decided to make something that would make her bigger. She couldn't let anyone know, so she worked in secret.<br>\r\n<br>\r\nHer creation was designed to increase the size of a person's body, more specifically, increase the size of a person's breasts. Kyoko had made her growth creation the the form of...</span></div></div>",
            "created":1375246800,
            "id":1637454,
            "title":"Kyoko's creation"
        },
        "1521":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "Kyoko's growth happens instantly",
                "Kyoko's grows happens some time later",
                "Kyoko's growth happens when she around a certain person",
                "another Eiken girl arrives",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Kyoko had created a drink.<br>\r\n<br>\r\n\"With this, I can finally be big!\" Kyoko exclaimed. Thoughts of being just as big, if not bigger, than all of the other Eiken girl went through her head.<br>\r\n<br>\r\n\"I hope this works.\" Kyoko took a sip of her drink. It tasted sweet.<br>\r\n<br>\r\nKyoko looked at herself, waiting for the results.</span></div></div>",
            "created":1580414700,
            "id":2780533,
            "title":"Kyoko's drink"
        },
        "15211":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "Kyoko has some more of her drink",
                "Kyoko's breasts continue to grow",
                "an Eiken girl arrives. Kyoko shows them the drink",
                "Densuke arrives",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>It happened instantly.<br>\r\n<br>\r\nKyoko Morooka felt her chest warm up and tingle. Her hands instinctively went to her chest. Kyoko gasped when she saw her hands get pushed away.<br>\r\n<br>\r\n\"I...I'm growing!\" Kyoko cried out.<br>\r\n<br>\r\nHer shirt became tight, but to Kyoko, that just meant that her drink was working. A smile was on her face as she watched her breasts grow. Kyoko was saddened when the growth ended, but she was happy that her breasts were now D-cup size.<br>\r\n<br>\r\n\"I'm bigger!\" Kyoko cheered. \"My drink worked! Now I can finally be the biggest girl ever!\"<br>\r\n---<br>\r\n<font class=\"size2\" style=\"\">Kyoko's current size: D-cup size</font></span></div></div>",
            "created":1599594840,
            "id":2899601,
            "title":"Kyoko's instant growth"
        },
        "154":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "a bottle of breast-growing pills",
                "a jar of breast-growing lotion",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"It's finally here!\" Yuriko Shinonome exclaimed as she picked up the package addressed to her.<br>\r\n<br>\r\nIt was quite evident that Yuriko wanted Densuke Mifune to like her. However the boy always paid attention to her sister, Chiharu Shinonome. Yuriko concluded that Densuke was attracted to Chiharu because of her large breasts. Thinking that was the case, Yuriko believed that in order to make Densuke hers she would need for her breasts bigger.<br>\r\n<br>\r\nShe searched through various stores but found nothing, until she read an article about an item that could make breasts bigger. Figuring that it would give her the large breasts she desired, Yuriko purchased it.<br>\r\n<br>\r\n\"With this I'll finally have big boobs!\" Yuriko said. \"Then Densuke will be mine!\" She opened her package and took out...</span></div></div>",
            "created":1459886100,
            "id":2128156,
            "title":"Yuriko's purchase"
        },
        "1541":{
            "author_id":"spoonjedi",
            "author_name":"jedifork",
            "choices":[
                "her breasts instantly start expanding",
                "her breasts expand after some time",
                "her breasts expand when she is around Densuke"
            ],
            "content":"<div class=\"\"><div> <span>Yuriko Shinonome had taken out a bottle of pills.<br>\r\n<br>\r\n\"The article said that these pills were designed to make breasts bigger!\" Yuriko said. \"I hope they work! I want to be busty and make Densuke mine!\"<br>\r\n<br>\r\nYuriko opened the bottle and poured a pill out, before swallowing it. Not knowing if the expansion would be fast acting or not, Yuriko looked at her chest until...</span></div></div>",
            "created":1497877440,
            "id":2338725,
            "title":"Yuriko's breast-growing pills"
        },
        "15411":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "Yuriko takes some more pills",
                "Yuriko shows off her pills to Chiharu",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Instantly Yuriko felt her chest tingle. She then noticed that her shirt was rising.<br>\r\n<br>\r\n\"Is it...Is it...\" Yuriko wondered. She placed her hands on her chest, only to see them get pushed away.<br>\r\n<br>\r\n\"It's working!\" Yuriko cheered with a smile on her face. \"My boobs are growing!\"<br>\r\n<br>\r\nYuriko happily watched her breasts expand. She was saddened when her breasts only grew to D-cup size, but quickly became happy.<br>\r\n<br>\r\n\"I'm so glad the pills work!\" Yuriko exclaimed while groping her now larger breasts. \"Now I can be busty! Now I can be the one with the biggest boobs!\"</span></div></div>",
            "created":1530390600,
            "id":2513552,
            "title":"Yuriko's instant expansion"
        },
        "154111":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "Yuriko takes even more pills",
                "Yuriko shows off her breasts to Chiharu",
                "Yuriko goes to Densuke",
                "Yuriko's breasts continue to grow",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm so happy that these pills work!\" Yuriko exclaimed.<br>\r\n<br>\r\nShe smiled as she opened the bottle and took out a pill.<br>\r\n<br>\r\n\"Now to make my boobs even bigger!\" Yuriko swallowed the pill.<br>\r\n<br>\r\nThe pill worked instantly. Yuriko felt her chest tingle and soon saw her shirt rise.<br>\r\n<br>\r\n\"Yes!\" Yuriko cheered. \"Bigger boobs! Bigger boobs!\"<br>\r\n<br>\r\nHer breasts grew, almost ripping of her shirt, until they reached G-cup size. Yuriko groped her now larger breasts and moaned as pleasure shot through her body. \"I'm now the same size as Kirika Misono!\"<br>\r\n<br>\r\nShe looked at the bottle of pills again.<br>\r\n<br>\r\n\"More!\" she moaned. \"I want my boobs to be even bigger!\"<br>\r\n<br>\r\nYuriko took out two pills this time and swallowed them. She moaned in pleasure when her breasts expanded. Her shirt was instantly ripped off and her bra followed shortly after. Yuriko had a big smile on her face when her breasts stopped growing at M-cup size.<br>\r\n<br>\r\n\"I'm so busty!\" Yuriko yelled. \"My boobs are bigger than mother's! I've now got the biggest boobs in the Shinonome family!\"<br>\r\n---<br>\r\n<font class=\"size2\" style=\"\">Yuriko's current size: M-cup size</font></span></div></div>",
            "created":1580414220,
            "id":2780531,
            "title":"Yuriko takes some more pills"
        }
    },
    "info":{
        "author_id":"thecore",
        "author_name":"The Core",
        "brief_description":"The Eiken club has some Secret techniques to get their bust to their supernatural sizes.",
        "created":1373085180,
        "description":"<td align=\"left\" class=\"norm\">The eiken club girls have some of the largest breast in their school, with one lucky boy (Densuke Mifune) surrounded by 7 lovely ladies in the eiken club. <br>\r\n<br>\r\nEiken - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://en.wikipedia.org/wiki/Eiken_%28manga%29#Characters\" target=\"_blank\">http://en.wikipedia.org/wiki/Eiken_%28manga%29#Characters</a><br>\r\n<br>\r\nI allow mostly anything to go on in this story except for hard vore, m/m stuff.<br>\r\nI liked and perfersoft vore, breast vore, anal vore, absorption, any kind of expansion, and mostly anything that doesn't get to crazy (furry stuff allowed). try to link pictures if you can and/or links to reference so people can follow along better. Have fun</td>",
        "id":1941688,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599594840,
        "modified":1599594840,
        "pretty_title":"Eiken Club Secret(s)"
    }
}