{
    "chapters":{
        "1":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Uncharted",
                "Mass Effect",
                "Super Smash Bros.",
                "Assassin's Creed",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which game universe do you want to start?</span></div></span></div>",
            "created":1454130000,
            "id":2096567,
            "title":"First, which game?"
        },
        "11":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nathan Drake",
                "Victor Sullivan ",
                "Harry Flynn ",
                "Charlie Cutter ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Guessing you want Nate, or another character?</span></div></span></div>",
            "created":1454130000,
            "id":2096568,
            "title":"Uncharted"
        },
        "111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate ages into a fat daddy.",
                "Business AU. Nate is a billionare CEO, when he starts to gain weight.",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a storyline...</span></div></span></div>",
            "created":1454130000,
            "id":2096572,
            "title":"Nathan Drake"
        },
        "1111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "As Nate leaves, he slowly starts to get fatter and older.",
                "He decides to stay in the tomb for a while.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Crap! Crap! Cr--- ah--- Oww\"<br>\r\n<br>\r\nNate was deep in the jungles of Mexico searching for an ancient tomb, when he abruptly found the entrance, by falling into it.<br>\r\n<br>\r\n\"Whew... gotta watch my step\" he said to himself dusting himself off. Taking out his flashlight, Drake made his way along the tunnel, before hitting a dead end.<br>\r\n<br>\r\n\"Weird, it should be right here?\"<br>\r\n<br>\r\nCarefully, the treasure hunter began to pull the vines off the wall, to reveal some heavily weatherd ancient text.<br>\r\n<br>\r\n\"Beware all who... blah, blah, blah... for those who drink from, something something... defy the sands of time?\"<br>\r\n<br>\r\nTrying to discern the text, Drake then found a loose stone to the right. Pressing it, the wall began to open.<br>\r\n<br>\r\n\"Bingo\" he said smugly.<br>\r\n<br>\r\nHe entered a dark room. Looking around, he saw a sconce on his left. After rummaging for a lighter in his pocket, he lit the sconce to find, to his surprise, it still worked. The flames traveled from one sconce to the next until the whole room was lit.<br>\r\n<br>\r\n\"Huh, how about that\"<br>\r\n<br>\r\nThe room he was in was surpassingly preserved, lined with ornate reflective stones, like mirrors. Drake stopped to look at his reflection, smiling in a cocky fashion at his studly appearcnce.<br>\r\n<br>\r\nHe flexed his arms, making his biceps bulge out of the rolled up sleeves of his dark navy henly top, unbuttoned enough to show the hairy cleaveage between his pecs. He then looked down at his legs, clad in dark brown/green chinos, dusting the mud off his legs, before adjusting his belt and holster. He then put a hand to his handsomely stubbled jaw. At 6\"1, and 190lbs of muscle, he was a fine specimen of a man.<br>\r\n<br>\r\n\"Still got it\" said the 33 year old, with another cocky half smile. He then turned to the centre of the room, where there was a pool of clear sparkling water, a small gold statue of a fat man sitting on a podium in the centre.<br>\r\n<br>\r\nWading out to the middle, Drake pushed a spear riddled skeleton out his way.<br>\r\n<br>\r\n\"s'cuse me...\"<br>\r\n<br>\r\nHe then picked up the statue, tossing it from hand to hand.<br>\r\n<br>\r\n\"That was easy\"<br>\r\n<br>\r\nHe then waited, half expecting the tomb to collapse or ancient guardians to come to life, but nothing happened.<br>\r\n<br>\r\n\"Huh, thats a first\" scoffed Nate. He then looked down at the water. Nate had to admit, he was thirsty, and a quick drink couldn't hurt.<br>\r\n<br>\r\nKneeling down, he took a few sips, before standing up, wiping his mouth, and heading back to the exit, statue in tow.</span></div></div>",
            "created":1454130000,
            "id":2096582,
            "title":"Nate ages into a fat daddy."
        },
        "11111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate continues to age and fatten up as he drives.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Nate scrambled up out of the entrance.<br>\r\n<br>\r\n\"Phew\" he said, leaning on his knees to rest. For some reason that tired him out more then usual. He took the statue off his belt loop, and wiped the grime off. He turned it around, looking at it from different angles. At the base, was two numbers in small, glowing etching. The first said 35, the second said 193. The numbers then changed to 36 and 198.<br>\r\n<br>\r\n\"What the?\" said Drake confused. Looking down, Nate noticed that his normally flat abs had somehow curved out a bit at the bottom into a bump. He lifted up his shirt and placed his hand to it. His abs were fading and a soft layer of fat had formed. But the idol's curse clouded his mind, making him think that this was his normal apperance. Nate shrugged it off.<br>\r\n<br>\r\n\"Guess my dad bod is catching up with me\" he chuckled to himself.<br>\r\n<br>\r\nAs he wandered back through the jungle to his jeep, he suddenly noticed how hot he felt. Sweat stains were starting to appear down his back and under his arms. After a half hour of hiking, Nate finally reached the Jeep. Panting, he leant up on the side of the car. Meanwhile, the statue had flicked over to 38 and 203.<br>\r\n<br>\r\nNate looked at himself in the wing miror. Light wrinkles had appeared around his eyes and forehead, light grey hairs appearing in his dark brown hair and sideburns, his stubble becoming a bit longer.<br>\r\n<br>\r\n\"Wow\" he said, examining his sideburns. \"Gonna be a silver fox any day now i guess\".<br>\r\n<br>\r\nHe hopped in the jeep, adjusting the rear view mirror. The statue jumped up to 39 and 212. Nate's gut was now very visible, his shirt riding up a few inches. His pecs had began to loose tension, becoming softer, as his ass widened in his pants. Even his arms and legs grew a bit softer. Nate looked down at his newly formed modest belly.<br>\r\n<br>\r\n\"Huh, need to cut back on the donuts\" he said, jiggling the flab with his hands, before taking hold of the wheel. \"Guess it's normal for a guy my age\"<br>\r\n</span></div></div>",
            "created":1454130000,
            "id":2096590,
            "title":"As Nate leaves, he slowly starts to get fatter ..."
        },
        "111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate decides to go to a bar.",
                "Nate is ambushed and captured.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>As Nate drove along the beaten track back to the local town, the idol continued to crank up his age, and pack on the pounds as well. Sitting on the passenger seat, the Idol rolled on up to 40, and 224, while Nate remained blissfully unaware.<br>\r\n<br>\r\nHe now had a fully fledged 40 inch beer belly, covered with a good amount of dark hair. His ass had widened so much that he had a perpetual plumbers crack, his love handles spilling out over his pants. His chest was still fairly muscular, be it a bit more flabby and hairier now.<br>\r\n<br>\r\nAs for his face, the wrinkles began to grow deeper, as crows feet emerged along with frown lines on his forehead. The flecks of steel grey hair on his sideburns had spread up the sides of his head more, as stubble had now formed a short beard, speckled with grey, a small double chin beginning to form on his somewhat plumper face.<br>\r\n<br>\r\nNate pulled over to look at his map. Scowling at the lines on the paper, Nate followed the road he was on with his finger. Then, just as the statue clocked up to 41, 230, the paper went somewhat blurry.<br>\r\n<br>\r\n\"Fucking... can't see shit\" grumbled Nate. Reaching into the glovebox, he pulled out a glasses case. He took out his glasses, which were square metal frames, and put them on. He continued to read the map, pacing scratching his head.<br>\r\n<br>\r\nAfter a good 5 minuets, the statue rolled up to 42, 237. A lit, fat cuban cigar had appeared between Nate's teeth, the aging adventurer not even noticing, as to his mind he had smoked cigars ever since he hit 40. He put the cigar between his fingers, and exhaled, smooth smoke wafting away.<br>\r\n<br>\r\n\"Aw yeah... thats some fine cuban\" he grinned to himself. He remembered how he always used to nag Sully about how bad they smelt, but now he was a fat old bastard, he saw why he liked them. The statue quietly rolled over to 43, 242, Nate scratched his 42 inch hairy belly in ignorant bliss, coughing to himself. After flicking his cigar butt out the window, Nate put away his map and glasses, before lighting up another cigar between his teeth, and starting up the engine again.</span></div></div>",
            "created":1454130000,
            "id":2096845,
            "title":"Nate continues to age and fatten up as he drives."
        },
        "1111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Half hour later, Nate is in his early 50's and even fatter",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Nate drove his way into town. It was a hazy afternoon, and the rundown streets were relatively quiet. In the passenger seat of Drake's jeep, the statue began to push the chubby treasure hunter into his mid 40's, rolling over to 45, and 247 pounds.<br>\r\n<br>\r\nAs the statue changed, so did Drake. His wrinkled brow furrowed at the new thought. <br>\r\n<br>\r\n'Man, I need a drink'<br>\r\n<br>\r\nEarlier that day, a 33 year old Nate might have had the occasional beer, but now at age 45, he often drank scotch or whiskey, or anything that was strong. To his mind he had been an avid drinker since his early 40's.<br>\r\n<br>\r\nSpotting a bar, he pulled over and got out the Jeep, picking up the Idol before shutting the door. As he walked to the bar, his new fat jiggled and bounced with every step, his hairy ass crack and man boob cleavage on display, his 42 inch  hairy belly poking out of his shirt.<br>\r\n<br>\r\nShifting his weight from one leg  to another, a musky fart escaped from his hairy taint inside his pants. He opened the door, walking into the bar.<br>\r\n<br>\r\nAs he walked to the counter, he saw a few heads turn his way. The bar was mostly filled with burly men around his age, most with there shirts off due to the heat, fat hairy guts on display.<br>\r\n<br>\r\n\"Whiskey please, and keep 'em coming\", said Nate, sticking the statue along with a fat wad of pesos on the counter as he took his seat.<br>\r\n<br>\r\nThe bar tender raised his eyebrows in surprise, before pouring a drink.<br>\r\n<br>\r\n\"Rough day eh big guy?\" he said.<br>\r\n<br>\r\n\"You could say that\" said Nate, tapping his cigar over the ashtray. The statue quietly rolled up to 46 and 255. The bartender passed the glass over to the fat treasure hunter, who began to drink it down.<br>\r\n<br>\r\n</span></div></div>",
            "created":1454130000,
            "id":2096851,
            "title":"Nate decides to go to a bar."
        },
        "11111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate becomes more of a gay daddy bear.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>A half hour, 3 drinks and 2 cigars later, Nate had aged up to 52, and was now a hefty 297lbs, boasting a hairy 47 inch gut. His face had aged more, his hairline receding, grey highlights now running through his dark brown hair. His beard, now quite grizzly, was mostly grey.<br>\r\n<br>\r\nNate was having a great time, and despite his clothes growing to accommodate, they still fit snugly around his fat ass and belly, his hairy belly button on display, the hair now speckled with greys. A few big hairy men had gathered around Nate, who was sharing a few stories between drinks.<br>\r\n<br>\r\n\"So I said i was sorry and she throws a plant pot at me!\" joked Nate, the burly men laughing. A big hairy man of about 46 placed a hand on his shoulder.<br>\r\n<br>\r\n\"You are a funny man Drake, and sexy for a guy in his 50s\"<br>\r\n<br>\r\nNate was puzzled by this.<br>\r\n<br>\r\n\"Are... are you coming onto me?\"<br>\r\n<br>\r\n\"Why wouldn't I, your a big fat american treasure hunting daddy, of course you are hot\" laughed the man, the others cheering in response. Nate's brow furrowed in confusion. Then, the statue jumped to 54, 310. Suddenly, new memories were formed in Nate's head. During his late 40's he began going to gay bars, hooking up with burly hairy men, and soon started identifying as a big gay daddy bear. Blinking, Nate looked back at the big hairy biker who was feeling up his thigh. Nate felt his fat cock harden beneath his belly.<br>\r\n<br>\r\n\"Well, your not so bad yourself sexy\" flirted Nate, before the man grabbed him and started to make out, the other guys cheering.</span></div></div>",
            "created":1454130000,
            "id":2096860,
            "title":"Half hour later, Nate is in his early 50's ..."
        },
        "111111111":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Passionately made love with Bill lots of cuddlng and sweet kisses.",
                "Nate dominates bill like a naughty dog.",
                "Bill dominates Nate, who becomes a total bottom."
            ],
            "content":"<div class=\"\"><div> <span>The idol was not only making Nate older hairier and fatter but it was also changing his sexuality making him more gay. It also kept giving him fake memories of tons of sexual encounters with big gay men making him even gayer. Nate slowly began to love men as the statue kept affecting him as he kissed the biker guy deeply.<br>\r\n\"ummm Mmmmf.\" he said through moans as he kissed this big fat man.<br>\r\nNate loved how the bikers mouth tasted of strong whisky.<br>\r\n<br>\r\nNate pulled away and said \"Do you think you can handle a big ol' gay bear like me? trust me I'm nuts in the sack!\" <br>\r\nThe biker smiled.<br>\r\n<br>\r\n\"Names Bill, I think we should take this somewhere more private you wanna follow me to the hotel?\"<br>\r\n<br>\r\nNate smiled in response.<br>\r\n<br>\r\n\"Thought you'd never ask\"<br>\r\n<br>\r\n He got up to follow Bill, but not before bringing the statue along with him, it's effects slowly changing him. While he was a big fat 55 year old gay daddy who weighed 320 pounds now the statue began to focus more on fattening up Nate and making him hairier while still slowly ageing him up.<br>\r\n<br>\r\nNates arms and legs were covered in light hair, his belly was hairy all over with a long line of grey speckled hair down in belly to his junk.<br>\r\nHis big boy boobs also had a lot hair between and of course Nate still ha a rugged beard that made him look super sexy and manly.<br>\r\nOnce Bill and Nate were at the hotel room alone at last, Nate had to weigh around 330 pounds he was reaching obese levels of fat now. Bill couldn't help but notice.<br>\r\n<br>\r\n \"Wow.... is it me or are you getting sexier by the minute?<br>\r\n<br>\r\nNate shrugged, placing the statue on the windowsill and took his sweat stained, skin tight, barely fitting shirt off, giving his belly and moobs more space. Bill blushed in excitement as he looked at Nate's huge beach ball sized tanned hairy belly and large round man tits with big pink nipples to boot.<br>\r\n<br>\r\nAs Bill undressed, he felt like he was in for a ride, as Drake looked like the type of daddy who's had tons of men to sleep with.<br>\r\nNate came up top Bill and pressed his hairy gut into his. Nate smiled \"Mmmmhh, gotta say, your sweet. I've had a lot of guys, young guys, old guys, skinny, fat. Never gets old\".<br>\r\n<br>\r\n\"Your'e a real sex pig then?\" replied Bill.<br>\r\n <br>\r\n\"Hell yeah... so you up for some fun big boy?\"<br>\r\n<br>\r\nThey both kissed again passionately, their big jiggly bellies and moobs pressed together.<br>\r\nBoth undressed into there briefs the room was hot and smelled of sweat as both men were so excited.<br>\r\nNate took lead and got into bed with Bill. Nate was a man with many new tastes and he liked to have fun with men...</span></div></div>",
            "created":1454216400,
            "id":2097238,
            "title":"Nate becomes more of a fat gay daddy bear."
        },
        "1111111113":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate's hair goes more grey as he gets hairier, older and fatter",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Nate lay on the bed, puffing away on another cigar as he smiled down at the handsome burly biker, who began to rub his big hairy man boobs and belly in a sexy way. Letting his eyes wander, Drake took in the sight before him. Bill was 6'2, with close shaved chestnut coloured hair, thick grizzly beard, and tanned chubby face. He had a dragon tattoo in his left shoulder and arm, and was boasting a 40 inch belly, thick with hair.<br>\r\n<br>\r\nBill began to pull down his xxl briefs, revealing his beer can thick, 7 inch cock as it sprang up beneath his belly. Below was a set of hairy balls the size of ripe plums.<br>\r\n<br>\r\nNate licked his lips as Bill began to crawl over to him, kissing him, before moving down to his neck, then his hairy man boobs. The treasure hunter moaned as Bill began to suck and tease his nipples.<br>\r\n<br>\r\n\"God your so hot Drake, your belly is so big...\" whispered Bill. The statue, which had been sitting quietly for a while, sparked up again.<br>\r\n<br>\r\n56. 343.<br>\r\n<br>\r\nBill didn't notice as Nate grew fatter underneath him, he was too busy burying his face in Nate's increasingly bigger and hairier boobs, as the adventurer's waist size crept up to 50. Meanwhile, Nate's memories began to shift again. He loved having fat bear cock in his ass, or even bigger things sometimes, and would let any man use him, wherever he was, gas station bathrooms, alleyways behind bars, front seats of trucks. Daddies, bikers, truckers, construction workers, lumberjacks, cops, Nate loved them all.<br>\r\n<br>\r\n<br>\r\nNate took a puff from his cigar, smiling to himself as Bill pulled down his briefs, releasing his hard-on. Nate's dick wasn't very long due to how big he was, but it was very thick, poking out of a thick bush of pubes, along with hairy balls even bigger then Bills.</span></div></div>",
            "created":1454216400,
            "id":2097288,
            "title":"Bill dominates Nate, who becomes a total bottom."
        },
        "11111111131":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "In the morning Nate awakes to see he has changed even more over night",
                "Nate and Bill kept going like wild bunnies all throw the night "
            ],
            "content":"<div class=\"\"><div> <span>Nate was getting so fat and old now as he reached 57, and 372 pounds overweight.<br>\r\nNate's huge hairy gut was the size of a yoga ball and filled up his lap his boy boobs were water melon sized moobs that rested on his big hairy belly. His arms and legs were soft and hairy his face grew more wrinkled, but was still handsome and rugged, a fuzzy grey beard on his plump face and chins.<br>\r\n<br>\r\nBill didn't notice as they were making love that Nate's hair was becoming less brown and more grey and white, his hairline receding at his temples even further. Even the thick hair on his boobs, belly and pubes were a silvery grey.<br>\r\nNate was becoming quit the old gay bear now, but the older and fatter he got the more attractive he looked.<br>\r\nBill was kissing Nate sexy body all over.<br>\r\n<br>\r\n\"I don't know if something wrong with me Drake... but you just keep getting hotter! I don't know I just can't explain why, but your so fucking hot now.\" said Bill, stroking Nate's hairy belly. \"Seriously, your one hot old man\"<br>\r\n<br>\r\nNate smiled. He had this affect on men, guys just loved Nate's friendly cuddly big soft daddy look that he had.<br>\r\nHe loved playing with all theys big sexy men and he loved being dominated and played with it made Nate feel really good.<br>\r\n<br>\r\n\"Mmmmhh, well your making this <i>old man</i> feel really special Bill. Why don't we take it to the next level?<br>\r\n<br>\r\nNate then got onto all fours and presented his huge round tanned ass to Bill Nate jiggled his ass up and down wanting to be ass fucked. Bill couldn't hold it any longer he grabbed onto Nates big love-handles and slowly inserted his big cock into Nates big ass.<br>\r\n\"Ohhhhh god damn your a big one... come on big boy put it to good use.\" <br>\r\n<br>\r\nBill began thrusting into Nate fucking his ass like a well oiled machine. To Nate's mind this was just another night with another hot guy but in reality this was Nate's first time with another man, but it didn't even hurt as his asshole had become used to having big cock inside it. Nate was so different now, that he didn't care his 30s were long ago in his mind and he was living his life to the fullest now as a fat old gay bear.<br>\r\n<br>\r\nNate kept pushing into Bills hard cock Bill seemed to be near cumming.<br>\r\nHe could here it in Bills voice Nate began thrusting onto Bills cock it didn't take long till Bill blasted into Nate's hairy asshole filling him up with hot cum.<br>\r\n<br>\r\nNate came with Bill and felt like tonight was a successful night out.<br>\r\n<br>\r\nBoth fat hairy men layed in bed next to one another. Nate took a long smoke from his cigar while Bill rubbed Nate's hairy belly and kissed his chubby neck.<br>\r\n<br>\r\nNate smiled at Bill and said \"Ready for round 2? Bill was shocked \"Already damn, old man if I didn't know better id say you were way younger then you look.\"<br>\r\n<br>\r\n\"Haha, I was once, but that was a LONG time ago my friend...\" chuckled Nate, taking a puff. \"Can still fuck good though\"</span></div></div>",
            "created":1454216400,
            "id":2097400,
            "title":"Nate's hair goes more grey as he gets hairi..."
        },
        "111111111311":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "a police uniform.",
                "a truckers outfit.",
                "other..."
            ],
            "content":"<div class=\"\"><div> <span>Daylight filtered through the curtains, as the two fat hairy men snored loudly. On the windowsill, the idol quietly ticked over up to 400lbs, the ageing factor slowing down, but still packing the pounds on the old adventurer. <br>\r\n<br>\r\nNate yawned as he sat up, a little more difficult then usual, his giant hairy gut now sporting a 55 inch waist. He quietly plodded to the bathroom, side stepping through the doorway as his huge belly pushed up against the frame. Feeling for his cock, Nate grumbled as he began to take a piss, briefly taking a moment to scratch his big fat behind.<br>\r\n<br>\r\nHe then turned to the mirror above the sink, examining his reflection. All his hair was now a silvery grey colour, and was shorter, having receded to the top of his forehead, a small bald spot appearing at the back top. His face was still handsomely grizzly, his beard even thicker. <br>\r\n<br>\r\nHis hairy old man boobs had grown bigger too, grey hairs growing on his shoulders and back. Nate placed a hand to his flabby chin. Slowly but surly, he was on his way to becoming a fat sexy granddaddy.<br>\r\n<br>\r\n'mmm... need to shave...buy a razor when I'm out'<br>\r\n<br>\r\nNate returned to the bedroom to look for his clothes, which had also transformed overnight, as he was a bit to old and fat for treasure hunting. Nate found his clothes on the chair, as they had became...<br>\r\n</span></div></div>",
            "created":1454302800,
            "id":2097685,
            "title":"In the morning Nate awakes to see he has change..."
        },
        "1111111113111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate gets hungry, and a bit horny too.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Police Captain Drake, who had quit the treasure hunting business when he was 45, and started working in law enforcement, his skills coming in useful. For 12 years he had patrolled highways during the day, letting bikers, truckers, rednecks and road mechanics fuck his fat ass in his cruiser, gas stations or right by the road side, At night he spent his time gay bars hooking up with big hairy men who would grope his plump man boobs and huge belly, before shoving their fat cocks in his ass, sometimes two or three at a time. Over the years he'd grown used to being used by 6 or 7 men a day, or more if he was lucky.<br>\r\n<br>\r\nOn lonely stakeouts he would sit in his cruiser and eat donuts or burgers, watching hardcore bear porn on his cellphone, rubbing his short fat cop dick and big round hairy belly, pinching his puffy pink fat nipples, and occasionally pushing his big black rubber police baton all the way into his ass, or something bigger if he could find it.<br>\r\n<br>\r\nWith some difficulty, Drake pulled on his 55 waist navy uniform pants, as he began to button his navy xxxl long sleeve uniform shirt and black tie, his badge and nameplate pinned to his chest. He strapped on his big leather duty belt, the buckle poking out underneath his gut. He checked his pistol over, before sitting down to pull on his boots and leather gloves.<br>\r\n<br>\r\nAt that point, Bill rolled over and sat up.<br>\r\n<br>\r\n\"You leaving?\" he said, glumly. Nate finished pulling on his boots and began fastening his radio to his shirt.<br>\r\n<br>\r\n\"Sorry buddy, duty calls\" he replied. Bill scratched his head. He was sure Drake wasn't a cop the night before, maybe he had more to drink then he thought.<br>\r\n<br>\r\n\"Hell when I retire, Ill have plenty of time for this. But if i'm in the area, ill be sure to stop by\" said Nate, putting on his police hat.<br>\r\n<br>\r\n\"Sure, won't be long now then\" joked Bill.<br>\r\n<br>\r\n\"True\" Nate smiled back, picking up the statue off the windowsill. \"You have a good day now. Be seeing ya Bill\"<br>\r\n<br>\r\nDrake nodded politely and made his way out the hotel. He stared at the statue in his hands, which was to his mind, was confiscated stolen property. Taking it under his big flabby arm, he put on his sunglasses as he went outside into the hot summer day. Looking down the quiet street, Nate lit up another cigar and placed it between his teath.<br>\r\n<br>\r\n\"Now where'd I park\" he said, scratching his head. \"Oh yeah\"<br>\r\n<br>\r\nNate's jeep changed into a police cruiser as he neared the vehicle. He opened the door and sat down, pushing the seat back so his giant gut wouldn't press up against the wheel. He turned on his police radio, clearing his throat.<br>\r\n<br>\r\n\"Papa Fatass Sixty Niner reporting for duty over\"<br>\r\n<br>\r\n\"Loud and clear Sixty Niner, stand by\" replied a voice over the radio.<br>\r\n<br>\r\nNate started the car and pulled off, whistling to himself as he began his duty shift.</span></div></div>",
            "created":1454302800,
            "id":2097693,
            "title":"a texan police sheriff uniform."
        },
        "11111111131111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "they start to fuck Nate while he eats",
                "other...."
            ],
            "content":"<div class=\"\"><div> <span>Nate drove down the road for a few minuets, whistling to himself before he was interrupted by a grumble from his fat gut. He looked at the clock on his dashboard.<br>\r\n<br>\r\n\"7.00, 'bout time for some breakfast\" he said to himself with a smile. He passed a sign reading 'Bob's Diner 1 mile'<br>\r\n<br>\r\n\"Bob's 'll do. Wonder if he's doing pancakes today\" said Nate, licking his lips.<br>\r\n<br>\r\nBy the time he had reached the diner, the idol had crept up to 58. The age was going slower then before, almost a standstill, but his weight kept on creeping up, the obese cop now weighing in at 420lbs, sweat stains forming under his arms and boobs, and along his back.<br>\r\n<br>\r\nNate opened the car door and climbed out, wiping his sweaty brow before putting on his uniform hat. As he made his way across the parking lot to the diner, he felt his big belly bounce with every step, his hairy boobs bouncing on top. Before entering, he noticed three fat hairy construction workers watching him hungrily, rubbing their crotches.<br>\r\n<br>\r\n\"Mornin' guys\" greeted Nate. He'd probably had sex with them at one point in the past, but it was hard keeping track. <br>\r\n<br>\r\nAs he entered the diner, he looked around. It was quiet, just a few regulars, all fat men of various ages. In fact, all men in this town were some form of over weight, so it was normal, encouraged even.<br>\r\n<br>\r\n\"Mornin Bob\" greeted Drake, climbing atop a stool at the counter, his fat ass spilling over the edge. A fat hairy man with dark hair and a moustache, mid 30's turned to greet the cop.<br>\r\n<br>\r\n\"Captian Drake” replied Bob with a smile, “been a while since I’ve seen you down these parts, thought you retired”<br>\r\n<br>\r\n“Haha… not yet my friend”, chuckled Drake in response. “You still doing them pancakes with the bacon?”<br>\r\n<br>\r\n“Sure, stack of 6 coming up”<br>\r\n<br>\r\n“Make it 12 Bob, got a long shift today” said the obese cop, patting his gut. \"Plus I wanna give the old ticker a run for it's money\" he laughed.<br>\r\n<br>\r\n\"That's true, Drake. Hate to say it, but you look like your wasting away a little\" replied Bob.<br>\r\n<br>\r\n\"Well best make it 15, I'm thinking of getting a new uniform by the end of the month\"<br>\r\n<br>\r\n\"Ill throw in an extra 5 on the house. Gotta keep you fed now\"<br>\r\n<br>\r\n\"Well, Thanks very much friend\" thanked Drake.<br>\r\n<br>\r\nAfter a few moments, Bob placed a huge stack of 20 pancakes, topped with at least 40 strips of bacon, all smothered in syrup.<br>\r\n<br>\r\n\"Mmmm... thanks very much Bob\"<br>\r\n<br>\r\nNate began to dig in when the three construction workers came in, there eyes set on the sheriff's wide behind.</span></div></div>",
            "created":1455426000,
            "id":2104059,
            "title":"Nate gets hungry, and a bit horny too."
        },
        "111111111311111":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Nate goes with the 3 men for a wild time",
                "other "
            ],
            "content":"<div class=\"\"><div> <span>Nate was enjoying his breakfast, eating bacon and pancakes while drinking his black coffee. He was enjoying his meal so much that he didn't pay to much notice to the big fat construction workers who were eye balling his fat behind. Nate's big ass took up the whole stool like two navy yoga balls, his fat love handles spilling over the top of his duty belt.<br>\r\n<br>\r\nNate was eating away at his big stack of pancakes when suddenly he felt a pair of big hands grab his fat booty. He turned to see the 3 big fat construction workers smiling at him.<br>\r\n<br>\r\n\"Hey Copper, fancy meeting you here this morning\" said one, as he put his hands under Nate's pants to grab his ass cheeks.<br>\r\n<br>\r\nNate knew these guys well, they were rough in the sack and treated Nate like their personal play thing.<br>\r\nWhile he had no problem with that, as he loved rough sex, he found it annoying when every time they encountered him, they immediately wanted sex with him, even if he wasn't in the mood.<br>\r\n<br>\r\n\"Are they bothering you Drake? said Bob, throwing a cautionary glance at the newcomers. Nate shook his head.<br>\r\n<br>\r\n \"Don't worry Bob, can handle myself\" replied the cop gruffly, before turning his attention over his shoulder. \"Guys, can it wait. I wanna have my breakfast in peace thanks\".<br>\r\n<br>\r\nThe closest man laughed. \"You know how this works, Drake. When we want it, you give it.\" He began to move his hand around Nate's waist  \"Don't pretend you don't enjoy this\". Nate sighed, rolling his eyes.<br>\r\n<br>\r\n\"I'm not saying no, thing is i'm still pretty loose after the last guy\" explained Nate, before shoving another mouthful in. \"mmmph... just.... give me some time to recover all right? <br>\r\nSuddenly, the man managed to loosen Nate's belt, pulling his pants down before grabbing at his ass, while another grabbed his big boy tits from behind and began fondling them through his uniform shirt.<br>\r\n<br>\r\n\"You best hurry up and finish\" said the man, grinning as he groped the sheriff's fat body,  \"...because were bringing your fat ass back to the trailer for a little fun.\"<br>\r\n<br>\r\nNate felt turned on, he loved being treated like this. Nate was always on the bottom and he loved being treated like a fat cum dump. He felt his cock harden in his briefs, a hand rubbing it, fumbling to pull it out.<br>\r\n<br>\r\n\"All right, all right, fine...\" shrugged Nate, giving into the workers' advances. \"I'm horny now. Just let me finish and we'll get going. Gotta be quick though, i'm on duty\"<br>\r\n<br>\r\nNate went back to eating his meal while one of the workers pulled his dick out and grabbed onto the cop's love handles. He kept eating while the construction worker pushed him forward, exposing his ass more, before shoving his huge dick in, making him moan as he tried to eat his meal.<br>\r\n<br>\r\nThe other 2 construction workers kept playing with Nate's belly and moobs, popping open a few shirt buttons so they could reach in and pinch his nipples, jacking their own cocks as they did so, their cum splattering out onto Nate's meal. Captain Drake could hardly eat, he couldn't stop moaning through mouthfuls. The workers knew just how to treat him and he loved it.<br>\r\n<br>\r\nIt didn't take long till finally the construction worker came in Nate filling him with hot cum.<br>\r\nNate had finally finished his meal and was panting from lose of breath the workers said \"Were just starting you old slut, now get moving\"<br>\r\n<br>\r\n    </span></div></div>",
            "created":1455426000,
            "id":2104074,
            "title":"they start to fuck Nate while he eats"
        },
        "1111111113111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "They force fatten Nate while they fuck him again.",
                "other.."
            ],
            "content":"<div class=\"\"><div> <span>Nate hastily paid Bob, thanking him, before following the men out the diner to the construction trailer at the far side of the parking lot. As they made their way over, Nate took in his companions. All three were obese and hairy, wearing hard hats, high vis vests, work pants and stained shirts.<br>\r\n<br>\r\nJonah was 30, with a handlebar moustache, and greasy hair in a mullet underneath his hard hat. Then there was Ted, he was 42, with a thick beard and messy hair, and then Earl, who was 45, short shaved recceeding hair, with grizzly stubble on his fat chins.<br>\r\n<br>\r\nOpening up the trailer, Nate noticed the smell of old food and tobacco. Inside, their was a desk, covered in construction blueprints, littered with several ash trays. Beer cans and wrappers littered the floor, while damp stained construction clothes hung from lines along the room. At the back of the room was an old, worn couch, propped up with cinder bricks. On it was dirty underwear, fast food wrappers, and half an old pizza.<br>\r\n<br>\r\nThe three began to grope and grab at Drake, pulling his pants down as they pushed him towards the couch. Nate landed on the couch on his back, as Jonah unbuttoned his shirt, and began to suck his fat man teats, squeezing the plump round man boobs.<br>\r\n<br>\r\n\"Mmmm... you got nice big titties Sheriff\" he said, licking his lips. In moments, Drake's hairy man boobs swelled rounder and larger in size, like two soccer balls, the puffy nipples perked on top, poking through every shirt he wore. Earl lifted up Nate's fat hairy legs to expose his ass hole. He licked his lips, pulling apart the big round cheeks.<br>\r\n<br>\r\n\"Hairy and loose, just the way I like it\"<br>\r\n<br>\r\nThen, the hair around Nate's asshole grew thicker, forming a dark grey bush, spreading across his huge ass cheeks. His hole also loosened up even more. In fact, Captain Drake's hole was so loose due to all the cock and things shoved into it, that he usually kept an anal plug in there, just so it was nice and open for whenever something was stuffed in there..<br>\r\n<br>\r\n\"Hmmm, whadd'ya say brothers, do you think this pig needs more feeding?\" laughed Ted. Nate was already stuffed from the pancakes, and wondered what they'd try to feed him with.</span></div></div>",
            "created":1455512400,
            "id":2104783,
            "title":"Nate goes with the 3 men for a wild time"
        },
        "11111111131111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "That night, Nate was on a stakeout.",
                "Nate does highway patrol duty.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Nate moaned as Earl began to shove his face into Nate's hairy taint, licking the lose, pink anus as he went, combined with the sensation of Jonah teasing and sucking his nipples. Nate closed his eyes, lost in the sensation, when he felt something press up against his mouth.<br>\r\n<br>\r\n\"Yah like donuts, piggy?\"<br>\r\n<br>\r\nNate looked down at the glazed donut in front of his lips, shiny with grease. He was allready full but he opened his mouth as Ted shoved it in. Nate chewed as he felt cream splatter around his mouth. No sooner then he had finished with the first, a second was shoved in.<br>\r\n<br>\r\n\"Yeah... ya like that... thats it.... nice and fat\" teased Ted, as Earl began to sink his fat dick into Drake's hole, as it glided in and out of the loosened ring with ease.<br>\r\n<br>\r\nDespite still sitting in his police cruiser, the power of the idol still had its effect, making Drake slowly fatter and older, but all the food the old cop was eating was speeding up the fattening process. <br>\r\n<br>\r\nAfter 10 minutes of being fed, Nate had clocked up to the age of 59, and had gained 30lbs, making him 450lbs of obese grandaddy cop, and was still growing.<br>\r\n<br>\r\nNate continued to moan as he changed. Under his hat, his heir had shortened to a silvery grey buzz cut, his hairline receding further, the bald patch spreading slightly. His handsome face had wrinkles along his brow ands eyes, but his fat cheeks pumped them out a bit.<br>\r\n<br>\r\nThe three men took turns to pump away at Nate's ass, the sound of their fat belly's smacking against his wide ass. By the time all three men had pumped their loads into him, and all the donuts had been shoved into his cream covered mouth, Drake was a colossal 480lbs of blubbery cop.<br>\r\n<br>\r\n\"whew... that was awesome\" panted Earl.<br>\r\n<br>\r\n\"Yeah\" agreed Jonah, whipping his cock off.<br>\r\n<br>\r\n\"Thanks again Drake, ya fat old horny bastard\" said Ted. Drake got to his feet, and began to get dressed, his uniform now somehow an xxxxl, and still a snug fit.<br>\r\n<br>\r\n\"Don't mention it fellas\" he replied, buttoning up his shirt before clipping on his hugely long duty belt, lifting up his gut to do the buckle up. \"Same time next week?\"<br>\r\n<br>\r\n\"How about when we next see you?\" grinned Jonah.<br>\r\n<br>\r\n\"Fine...\" sighed Nate. \"Be seeing ya\".<br>\r\n<br>\r\nNate squeezed his way out the door and crossed the parking lot to his police cruiser. Looking at his watch he realised it was almost 12.<br>\r\n<br>\r\n\"Shit, that was longer then I thought\"<br>\r\n<br>\r\nHe squeezed into his cruiser, putting the seat back even further.<br>\r\n<br>\r\n</span></div></div>",
            "created":1455685200,
            "id":2105761,
            "title":"They force fatten Nate while they fuck him again."
        },
        "111111111311111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate tries to get back into his cruiser, but is too fat.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>That evening, Nate sat on a stakeout. His cruiser parked behind a billboard, Nate sat on a nearby bench, watching a building that was tipped to be burgled that night around 11. The evening air was chilly so the big fat cop was now wearing a dark navy police jacket on top of his shirt and tie.<br>\r\n<br>\r\nNext to him was a stack of about 30 fast food bags, which he had started to pig on over the course of the evening, adding to his ever growing waistline, as he was now 480lbs of fat old blubbery cop. At this point the idol had made it Nate's passion to get fatter anyway, and to his mind he had been an avid gainer for years.<br>\r\n<br>\r\nHe pushed his 4th burger of the night through his fat lips, licking his fingers.<br>\r\n<br>\r\n'mmmm... foods making me horny' he thought. Puling out his cell phone, he realised their wasn't enough signal for his usual romp of porn, so he thought of something else. Having an idea, he logged into Facebook.<br>\r\n<br>\r\n\"This'll do\"<br>\r\n<br>\r\nHe began to touch his big sensitive nipples through his shirt, the puffy nubs hard form the cold air. He was looking at profiles of his fellow cops, getting off to their pictures. Most of them had some form of belly, even the younger ones, but Drake liked to imagine them growing huge, popping out of their uniforms, so fat they couldn't move, touching and kissing each other, groping each other's soft boy boobs, rubbing their giant bellies.<br>\r\n<br>\r\nDrake felt his cock harden beneath his huge belly. He laid down on the bench, lifting his leg. He then undid a hidden zip at the back of his uniform pants, one he had sewn in for easy access to his hole. Fiddling around to get his plug out, he then took his night stick, the black rubber shiny rod a good foot long, and slowly pushed it into his ass.<br>\r\n<br>\r\n\"Ohhh.... yeah....\"  he said to himself, shoving another burger into his mouth. He looked at the profile of one of the younger cops, Officer Daniel Reed. He was 23, slim athletic build, with blonde hair shaved very short, a handsome looking man, especially in uniform.<br>\r\n<br>\r\nNate pictured the Officer swelling up so fat he fell forward onto his huge belly, his uniform popping off at the seams, his huge, soccer ball sized boy tits bouncing in front of him, his fat ass wobbling in the air, a diaper appearing around it, his body smooth and hairless, his skin shiny as he was coated in oil.<br>\r\n<br>\r\n\"Yeah... you like that don't'cha Dan\" said Drake, picturing the young cop as fat, hairless and baby faced. His cute, embarrassed expression turning his fat cheeks red, as he tried to cover his pink, perky nipples.<br>\r\n<br>\r\nWhile Nate was fantasising, the idol decided to make him fatter again, even more so then usual, as Nate had been stuffing the fast food. Slowly, his body inflated until he was a colossal 520lbs. HIs uniform was now custom made for his huge size.<br>\r\n<br>\r\nThe Captain didn't even notice the growth until he suddenly heard a creaking noise. Suddenly the old wooden bench he was laying on gave way under his weight, crushing underneath him.<br>\r\n<br>\r\n\"Whew... whoops\" said Nate, struggling to his feet. \"Best wrap this up\"<br>\r\n<br>\r\nHe thrusted the knightstick all the way in, and with a moan, a damp stain appeared on the crotch of his uniform pants as he came in his underwear.<br>\r\n<br>\r\n\"Yeah... well best get back to work\"<br>\r\n<br>\r\nAfter waiting another half hour, Nate looked at his watch. It was 12.23.<br>\r\n<br>\r\n\"Looks like they're not going to show\"<br>\r\n</span></div></div>",
            "created":1455771600,
            "id":2106196,
            "title":"That night, Nate was on a stakeout."
        },
        "1111111113111111111":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Nate pretends to be very hot in the car and starts to strip in front of Daniel ",
                "The statue makes Nate older and fatter again making Nate look even hotter"
            ],
            "content":"<div class=\"\"><div> <span>Nate decided to leave. No one was coming, so he returned to his cruiser. But when he tried to get in, he was abruptly stopped. His big hips got stuck on the sides of the car door and he couldn't fit his gut and legs into the tight space.<br>\r\n\"Darn it! I knew this would happen...\" in Nate's head this had been happening for a while now he found it hard to fit into most cars, heck sometimes he had trouble getting through normal house doors.<br>\r\n<br>\r\nNate tried to get in but all the pushing only made him sweat all over and get really tired.<br>\r\nHe gave up and kicked the car in frustration Nate sighed \"I knew I should of gotten a bigger car already.\"<br>\r\nNate sat down on the front of the car hood he used his radio hoping someone would come pick him up.<br>\r\n<br>\r\n \"This is Captain Drake, PF Sixty Niner, requesting a pick up at 73 intersection, over.\"<br>\r\n  <br>\r\nA voice came throw \"DP Eighty Six, Officer Reed responding to pick up\"<br>\r\n<br>\r\nNate smiled,  it was that cute handsome rookie Daniel he loved that sweet guy.<br>\r\n<br>\r\n\"Hey Dan, didn't know you were on patrol tonight\"<br>\r\n<br>\r\n\"Yeah, just finishing up actually. What happened, get too fat for your cruiser?\"<br>\r\n<br>\r\n\"Haha... yeah, pretty much\" Nate chuckled. \"You got a ride big enough for my fat ass?\"<br>\r\n<br>\r\n\"Uhhh yes sir, I'm in a Jeep. Plenty of room\" Dan replied in a slight embarrassed tone.<br>\r\n<br>\r\n\"Great just swing on by and pick me up, Ill just wait here for you, over and out.\"<br>\r\n<br>\r\nNate was happy he was getting a lift from Daniel. He found him to be a very cute and sexy young officer.<br>\r\n<br>\r\nNate had known most of his fellow officers for many years most of them were old and fat like him. Nate even had sex with some of his fellow officers all the time at the station or on duty almost ever week. But he never had sex with Daniel. Nate knew that Dan was secretly into big fat old men and teased him a lot.<br>\r\n<br>\r\nNate would pretend to pick up pennies he found on the ground just so he could bend over and let Daniel get a good look at his wide ass. Sometimes in the station showers Nate would shower right next to the young officer and playfully rub soap and water all over his hairy belly tender ass and big boy boobs just so Daniel could watch. He found it cute that Daniel would blush and even pop a boner, but when he looked Dan would hide his attraction to him, but Nate could tell that this cute guy wanted to sleep with him.<br>\r\n<br>\r\nNate wanted to ride his big cock too but sadly he hadn't gotten to third base with him yet but maybe this time he could. Nate sat on the car hood and waited it was so cold out tonight his big nipples were poking throw his tight shirt but his fat body kept him warm for the most part. After waiting for what seemed like forever, he saw headlights on the horizon it was Officer Reed in his big patrol Jeep.<br>\r\n<br>\r\nNate smiled, adjusting his hat and tie, before picking the idol off the passenger seat of his cruiser, and locking up.<br>\r\n<br>\r\n\"Looks like my knight in shinning armour has arrived.\"<br>\r\n<br>\r\nDaniel opened the door \"Hey Captain, you're luckily I was on duty tonight. I've got the heater on, you must be freezing\".<br>\r\n<br>\r\nThe young cop was wearing a long sleeve uniform shirt, unbuttoned at the top. Nate got in the passenger seat, his fat ass took up the whole seat he was so fat that his belly was pushing into Daniel. Nate took off his jacket and threw it in the back so he could relax in his seat. Daniel blushed at the sight of the massive Captain next to him.<br>\r\n<br>\r\n\"Wow Drake, I know you're like the fattest guy in town but you seem way fatter then usual.\"<br>\r\n<br>\r\nNate laughed.<br>\r\n<br>\r\n\"You're darn right I'm the fattest won't be long now till I'm the fattest old daddy in the country.\"<br>\r\n<br>\r\nDaniel blushed hard, looking at Nate's fat hot body he turned him on so much.<br>\r\n<br>\r\n \"Well ummm I guise we best be driving back to town huh.\"<br>\r\n<br>\r\nDaniel started driving and tried to look away from Nate's huge gut. Nate smiled as he looked at Daniel he thought maybe now was the perfect time to seduce him and have some fun.      </span></div></div>",
            "created":1455858000,
            "id":2106454,
            "title":"Nate tries to get back into his cruiser, but is..."
        },
        "11111111131111111112":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate's fantasy starts to come true, as Dan starts to plumpen up.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>After a few minuets driving, Nate felt hot and horny. He began to rub his nipples, moving his hands down and jiggling his boobs up and down. He smirked as the younger officer shifted his legs to hide his hardening cock.<br>\r\n<br>\r\n\"So.. uhhh... Sheriff, where'd you get the statue?\"<br>\r\n<br>\r\n\"Oh that?\" replied Nate, gliding his hands over his giant hairy belly. \"Stollen property, no luck finding the owner so I may use it as a desk ornament or something\"<br>\r\n<br>\r\n\"Cool... so whats it do?\"<br>\r\n<br>\r\nNate stretched and yawned. As he did so, the statue's powers whirred up again. In moments, Nate was 61 years old, all his hair was white, as he became a sexy grandaddy polar bear. But the statue not only bumped up his age, but made him 30lbs heavier, making him 550lbs obese.<br>\r\n<br>\r\n\"No idea\" said Nate.<br>\r\n<br>\r\nDaniel's brow furrowed, it shouldn't have been that hard on the engine to go up a hill, but he shrugged it off. Nate turned to look at the young officer. He  had a slim, toned muscular build. Daniel played football in college, but joined the force last year.<br>\r\n<br>\r\nNate thought back to his fantasy earlier, imagining the young officer as a huge fat cute hairless man baby, with big round perky boobs, and a huge wide ass. He licked his lips at the idea.</span></div></div>",
            "created":1455858000,
            "id":2106496,
            "title":"The statue makes Nate older and fatter again ma..."
        },
        "111111111311111111121":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "The statue changed both cops memories and made them think this was normal",
                "The statue starts to affect Nate again and makes him even fatter "
            ],
            "content":"<div class=\"\"><div> <span>As the two officers drive back to town, Nate was stuck on the fantasy of skinny little Daniel becoming a big obese fatty with smooth hairless skin, big womanly boy boobs, and a large cute rump.<br>\r\n<br>\r\nHe wished Daniel was so fat that he had to ask the Police Chief for a uniform 5 sizes up, or even more. Nate would've slept with Daniel the first day he met him if he was a big fatty. Nate thought that Daniel would be perfect like that, and it seemed while Drake was fantasying about this, his statue was listening and decided to make his dream a reality.<br>\r\n<br>\r\nAs Nate was examining the studly looking young rookie, Nate noticed something odd... Nate thought in his head<br>\r\n<br>\r\n 'Is he growing fatter?'<br>\r\n<br>\r\nNate looked on confused as Daniel seemed to be fattening up in seat. Daniel was to busy driving to notice his once flat abs had ballooned out into a large growing beer belly that was straining the buttons on his uniform. His pecs also started to fatten and become soft and plump, nipples becoming puffy, pointing through his shirt.<br>\r\n<br>\r\nDaniel's arms and legs also began to plump up in size as his cloths became tighter his once thin face seemed to be becoming softer and he was growing large hips and his butt was filling up his seat.<br>\r\n<br>\r\n\"Ohhh... ahh... man my uniform feels tight today...\" mumbled Daniel to himself.<br>\r\n<br>\r\nDaniel kept his eyes on to the road and barely noticed his growing belly that was straining his uniform.<br>\r\nHis shirt and pants became so tight around his body as he grow bigger,  just as Daniel felt his clothes  where getting too tight buttons on his shirt starting popping off like bullets in the car as his belly grew larger and filled his lap.<br>\r\n<br>\r\nDaniel looked down and was shocked to see his big fat hairless belly hanging out of his uniform.<br>\r\n<br>\r\n\"Oh my god what's happening to me? I'm so fat! <br>\r\nDaniel pulled over on the side of the highway so he could get a look at himself. Nate was enjoying the show and was watching the whole time he didn't even care if this was imposable, he loved this.<br>\r\nDaniel stopped the car and saw that his now huge belly had pushed out onto his lap, beginning to press up against the steering wheel.<br>\r\n<br>\r\nHis whole uniform started to rip as his butt became very large, tears forming across his wide bouncy rump. As Daniel started to feel his leather duty belt get uncomfortably tight, he rummaged around with his fat fingers to loosen it, only to make it burst off as soon as he undid it, his growing waistline pushing free.<br>\r\n<br>\r\nHis pants and sleeves began to rip apart around his large plump arms and legs, as his boy boobs got way to fat for his uniform and popped free. His uniform letting his big belly and moobs free to grow before Daniel could do a thing his whole uniform started to rip apart into little shreds as he became over 300 pounds overweight.<br>\r\n<br>\r\nDaniel stared in pure shook as he was left fat and nude besides his boxers and his cap Daniel kept growing for a little longer till finally he was 450 pounds overweight.<br>\r\nWhile Daniel was shocked, Nate was drooling at the sight of the big fat sexy nude cop in front of him.<br>\r\nDaniel's fat body was smooth and flawless, his huge belly looked adorable and so soft looking. His large watermelon sized boy boobs looked perky and plump and super sexy, with big pink puffy pointed nipples adorning each tit, and Daniels big booty overflowing in the seat, pressing into Nate's own huge behind.<br>\r\n<br>\r\nNate knew tons of sexy fat guys but Daniel was damn perfect.<br>\r\nDaniel slapped his big belly to see if it was real and turned to Nate who had a hungry look in his eyes.<br>\r\nBefore Daniel could say a thing Nate grabbed Daniel face and gave him a huge sloppy kiss he pressed his fat hairy belly into Daniel smooth hairless gut and even groped his fat booty.<br>\r\nNate was in love and all he wanted to do was have fun with Daniel all night long.<br>\r\n<br>\r\nAfter a few minutes of kissing Nate pulled back to look into Daniels cute blushing face.  </span></div></div>",
            "created":1456808400,
            "id":2111861,
            "title":"Nate's fantasy starts to come true, as Dan ..."
        },
        "1111111113111111111211":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "The two cops grow so fat they fill the car",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Nate hungrily kissed the young rookie, fondling his huge boy tits with his fat old fingers, while Daniel rubbed the hugely obese Captain's belly, untucking his shirt so he could put his hand inside and feel the mat of white hair on his huge gut.<br>\r\n<br>\r\nThen, the statue glowed again, touching both men's minds with its power. Nate withdrew from his younger colleagues plump juicy lips to admire the rookies fat body.<br>\r\n<br>\r\n\"Why'd you come to work in your underwear? To fat for your uniform again?\" he asked, smiling in a sexy way.<br>\r\n<br>\r\n\"Sorry Sir, I have been piling on the pounds lately, wanna be as big as you someday\"<br>\r\n<br>\r\n\"Well, your tits are almost as big as mine\" laughed Nate, squeezing Daniel's left boob. \"I'll order some new uniforms for you... what are you now, triple extra large?\"<br>\r\n<br>\r\n\"x4 extra Sir\" replied Daniel proudly, \"Probably worth getting a x5 though\"<br>\r\n<br>\r\n\"Wow... haha, you have been packing on the pounds, whats your secret?\"<br>\r\n<br>\r\n\"10 meals a day Sir, not including snacks\"<br>\r\n<br>\r\n\"Thats impressive kid, looks like your gonna be a big fat sexy Sergeant in no time\" smiled the Captain.<br>\r\n<br>\r\n\"Haha... gotta reach Corporal first\" laughed Dan. \"Besides, I'm way too young to be a Sergeant.<br>\r\n<br>\r\n\"Well keep eating kid, ill see about getting you a promotion\" said the Captain, patting the young officers belly.<br>\r\n<br>\r\n\"Thanks Sir, I just want to get fatter and fatter i guess\"<br>\r\n<br>\r\n\"Me too kid, hopefully I can get fat enough to become Chief of Police. That way I can wear a fancy uniform, sit in an office and eat all day while the other officers plough my fat ass\"<br>\r\n<br>\r\nDaniel licked his lips picturing Drake as a giant 800lb+  immobile fat ass, squeezed inside a Chief's formal dress uniform and cap, laying down with his huge belly dwarfing his desk, cigar in mouth, eating mounds of food while a group of officers hungrily fucked his mammoth sized hairy ass, shoving whatever they could into his hairy man hole.  Under Dan's belly, he was popping a boner.<br>\r\n<br>\r\n\"Sir?\" asked Dan timidly.<br>\r\n<br>\r\n\"Yeah Daniel\"<br>\r\n<br>\r\n\"Can I... can I fuck you please?\"<br>\r\n<br>\r\n\"Thought you'd never ask\" replied Nate smiling. With that, he unbuckled his duty belt, lowered his pants and underwear, turned to face the rookie, raising his legs and laying back to expose his hairy hole.<br>\r\n<br>\r\nOfficer Dan knelt on the seat,  pulled out his cock and lined it up, before pushing forward, leaning into the fat hairy mass of the Captain.<br>\r\n<br>\r\n\"I... I can't reach, my belly is too big... it won't go in\" said the young officer, his cock head poking at the entrance to Captain Drake's hole.<br>\r\n<br>\r\n\"Oh yeah... take out the plug first... then push your hips more\" said Drake, loosening his tie and top button, before rubbing his plump sensitive nipples through his shirt.<br>\r\n<br>\r\nDaniel took out the butt plug, holding it up to his nose. It smelt of the Captain's butt sweat and farts, which made his cock throb harder. He pushed his hips forward into Drakes rump, feeling his shaft sink into him. It felt warm and moist on his cock.<br>\r\n<br>\r\n\"mmmmph yeah... you got a good dick kid, nice and fat\"<br>\r\n<br>\r\n\"Thank you... sir\" grunted Dan, as he began to thrust into the Captain's mighty behind, the sound of his belly slapping against him with every thrust.<br>\r\n<br>\r\n\"That's it kid, push in deeper... damn that feels good\"<br>\r\n<br>\r\nDaniel leaned further forward, pushing his smooth belly into Drake's even bigger hairy one.<br>\r\n<br>\r\n\"Oh... Sherif... \" moaned Daniel.<br>\r\n<br>\r\n\"Call me Chief...\" replied Nate smiling,\"Sergeant Reed\"<br>\r\n<br>\r\n\"Yes... Chief\" said Daniel, smiling back, his face red and sweaty. \"this is amazing... I wish we were bigger... fatter\"<br>\r\n<br>\r\n\"Me too kid\"</span></div></div>",
            "created":1456894800,
            "id":2112051,
            "title":"The statue changed both cops memories and made ..."
        },
        "11111111131111111112111":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "\"I'm still horney lets head back to my place for more fun.\"",
                "\"I think for now on I'm going to be mostly nude I'm sick of tight uniforms.\" "
            ],
            "content":"<div class=\"\"><div> <span>It seemned that everytime Drake wished for something to happen the statue would make it come true.<br>\r\nWhen it heard both fatty cops talking about being hugely obese, it decided to make that a reality too.<br>\r\n<br>\r\nDaniel was on top of Nate, thrusting into his fat ass. He never knew fat sex could be so good as he rubbed his fat against Nate's, the older man's hairy belly felt ticklish on Daniels smooth fat belly. Daniel kept going down and kissing Nate on his fat lips and sucking on his big juicy boy tits.<br>\r\n<br>\r\n\"Wow, kid you're really damn good for a first timer\" panted Nate, \"you're making me feel young again.\"<br>\r\n<br>\r\n \"Thank you Sir... I just love your ass\" moaned Daniel in reply, \"do you think I'm going to fast?<br>\r\n<br>\r\n \"Don't worry Dan, this old slut can take it\" smirked Drake.<br>\r\n<br>\r\nBoth men kept fucking like wild bunnies but soon Nate and Daniel noticed something very strange. It seemed that they were gaining weight. While both fat cops thought what was happening was odd, they were in far to much pleasure to care.<br>\r\nDaniel just couldn't stop thrusting into Nate's ass even if something odd was happening to him.<br>\r\n<br>\r\nNate had no idea what was happening too, but the sensation was to good to think otherwise. In fact it only made him feel good as his already huge gut grew into Daniels big growing gut.<br>\r\nNate also seemed to grow older as he gained, turning 62, with white hair all over his fat body and he even more tanned now with a few sun burn marks over his fat body. Daniel fucked Nate faster as he saw himself and Nate grow, it was such a turn on for him.<br>\r\n<br>\r\nNate grabbed Daniel and hugged him close as they both grew while Daniel was fucking him.<br>\r\nNate wanted to feel there bodies grow and pushed into each other he loved how his huge beach ball sized tits pushed into each other, there big nipples rubbing into each other was so fucking hot.<br>\r\nNate loved how his big belly rolls rubbed all over Daniel's hairless cute belly.<br>\r\n<br>\r\nIt seemed like both fat cops were becoming super obese as they started to fill up the car.<br>\r\nDaniel's fat ass was pushing into the driver side door, pressing into it. Nate had popped and ripped out every bit of clothing he had on, leaving both fat cops fully nude. They kept growing and growing, filing up the confines of the jeep, there fat pressing up against the dashboard and doors, their weight making the seats creak under pressure. They continued, to grow, filling the space of the car with fat. Nate's head was now wedged between Dan's colossal boobs, which were resting on his own gigantic man tits, as Dan's ass began to press up against the drier side window. In moments, the car's seats broke under the pressure, just as Daniel was ready to cum inside Nate until finally the statue stopped their gain, Daniel blowing the biggest load ever before falling on top of Nate in exhaustion.<br>\r\n<br>\r\nBoth cops were super obese pigs now and filled the whole car.<br>\r\nDaniel was now 600 pounds overweight while Nate was an insane 700 pounds, making him the fattest cop in America now, and he loved it. <br>\r\n<br>\r\nNate said......</span></div></div>",
            "created":1456894800,
            "id":2112140,
            "title":"The two cops grow so fat they fill the car"
        },
        "111111111311111112":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate is now a perverted fat biker cop.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Nate sat in his cruiser by the highway, watching the traffic pass. Sighing loudly, he looked at his watch, which read 1.20pm.<br>\r\n<br>\r\n\"Phew, pretty hot day\" he said, wiping his brow.<br>\r\n<br>\r\nEven with the AC on full, sweat patches were forming down his back, under his arms, and around his big man boobs. Even his but crack was sweaty between hid huge fat ass cheeks. The fact that the statue was making him fatter still, didn't help.<br>\r\n<br>\r\nAs Drake hit 520lbs, he began to feel tight in his cruiser, his fat pushing up against the door, his belly pushing against the wheel.<br>\r\n<br>\r\n\"Damn it, knew this would happen someday\"<br>\r\n<br>\r\nSuddenly, the statue glowed.<br>\r\n<br>\r\nNext thing Nate knew, his cruiser was gone, and was replaced with a police motorbike, except it had much larger wheels and seat in order to take the weight of Sherif Drake's huge behind. Drake himself was now wearing biker cop gear. Black leather riding pants had appeared around his fat ass, along with leather boots. He also wore a helmet, sunglasses, gloves, and a leather police biker jacket. Underneath was a short sleeve navy shirt, unbuttoned to show off his man cleavage.<br>\r\n<br>\r\nNate also was now wearing a bra and panties underneath his uniform. To his mind, ever since his big boy boobs got so huge, he'd started wearing ladies underwear, as it felt nice.<br>\r\n<br>\r\nNate continued to examine the highway as if nothing had happened.</span></div></div>",
            "created":1457240400,
            "id":2113984,
            "title":"Nate does highway patrol duty."
        },
        "1112":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate begins to slowly but surely grow fatter",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>After treasure hunter and explorer Nathan Drake discovered the ancient lost city of Katesh, he made a fortune selling archeological wonders and relics. He then went to publish his own memoirs of his adventures, as well as selling the rights to some of his tales to huge Hollywood producers. In 4 short years, the 42 year old had gained a 28.2 billion dollar net worth, (and climbing) and was now the CEO of Drake Enterprises, an international corporation that had business in archaeology, historical site restoration, museum exhibits, publishing, shipping and storage, adventure package holidays and sports equipment.  During his rapid climb to wealth, Nate became as effective and skilled in a boardroom as he was in a tomb, and had become accustomed to the finer things in life, yet retained his old roughish charm and personality.<br>\r\n<br>\r\n_____<br>\r\n<br>\r\n<br>\r\nDrake looked out of the window of his high rise office, contemplating things, more specifically, his appearance. He was wearing a dark navy, slightly shiny three piece suit that clung tight to his form, light blue shirt with white collar and cuffs (complete with diamond cuff links), lilac silver paisley tie, done in a wide full windsor knot, and black high polished leather dress shoes, with matching belt. His hair was slicked back, executive style, his jaw clean shaven, finished with the finest aftershave.<br>\r\n<br>\r\nRef image <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://40.media.tumblr.com/d881ca138469f299c7b6d73abd8d8e4d/tumblr_nkripqqLkU1tx3zwko1_540.jpg\" target=\"_blank\">https://40.media.tumblr.com/d881ca138469...</a><br>\r\n<br>\r\n\"Sigh.... knew I should of gone with the Brioni this morning\" Nate grumbled, adjusting his sleeves,  before looking at the platinum rolex on his wrist.<br>\r\n<br>\r\n\"Where are they? it's already ten to five\"<br>\r\n<br>\r\nJust then, his desk phone rang. Nate crossed the spacious, sleek modern office room to his desk, pressing the loud speaker.<br>\r\n<br>\r\n\"Hey Debbie\" he said, preempting his secretary's call. He leaned on the desk, eyeing the phone<br>\r\n<br>\r\n\"Good afternoon sir. Parasol Pharmaceuticals called ahead and said they won't be meeting after all. Shall I reschedule for Wednesday?\"<br>\r\n<br>\r\nNate sighed, bowing his head.<br>\r\n<br>\r\n\"Never mind, ill contact them and see if i can do a video link some time. Anything else come up?\"<br>\r\n<br>\r\n\"Yes Sir, Forbes wants to do an interview for 'sexiest billionaires 2020'\" <br>\r\n<br>\r\nNate raised his eyebrows, giving a slight chuckle.<br>\r\n<br>\r\n\"heh.....Tell them I can do Thursday.\"<br>\r\n<br>\r\n\"Very well sir, I'll call right away. Oh and... sir?<br>\r\n<br>\r\n\"Yes Debbie?\"<br>\r\n<br>\r\n\"There's a package for you, it's being sent up as we speak\"<br>\r\n<br>\r\nNate's brow furrowed.<br>\r\n<br>\r\n\"A package... from who?\" asked the ex treasure hunter.<br>\r\n<br>\r\n\"Uhhh... Parasol Pharmaceuticals apparently\" replied the secretary. \"An apology package perhaps?\"<br>\r\n<br>\r\n\"Maybe...\" pondered Nate. He paused for a moment. \"Okay... Ill see what it is. You head on home, Ill finish up here\"<br>\r\n<br>\r\n\"Oh... thank you Sir\" said Debbie, surprised and the early end to her day. \"Well, good night Sir. See you tomorrow\"<br>\r\n<br>\r\n\"Night\" replied Nate, pressing the hang up the phone. Nate turned to face the window, rubbing the back of his neck. Suddenly, a noise made him turn abruptly. He turned to see the glass frosted double doors to his office shut as someone exited the room, as well as a box on his desk.<br>\r\n<br>\r\n\"What the...\" he said, scowling in confusion. He didn't even hear anyone walk across the marble floor, and the door was a good 15 feet from the desk. Brushing it off, Nate picked up the box, labeled with Parasol Pharmaceuticals logo. Inside was...<br>\r\n<br>\r\n\"Aftershave?\"<br>\r\n<br>\r\nNate took out a small dark blue spray bottle, and a letter.<br>\r\n<br>\r\n<div class=\"bquote\"><i>Dear Mr. Drake<br>\r\n<br>\r\nApologies for our absence this afternoon, unfortunately a <b>larger</b> corporation then your own asked to meet at the last second. We are deeply sorry that we couldn't attend your meeting, especially with such a prolific <b>fat</b> cat such as yourself, and hope we didn't put a <b>bulge</b> in your expenditure.<br>\r\n<br>\r\nAs we know, in regards to your enterprise, you're a <b>hungry</b> businessman who wants to <b>grow</b>, as we all want a <b>bigger</b> slice of the corporate pie. But we are aware your name carries a lot of <b>weight</b> so as to show you we are not <b>lazy</b> in our dealings, we will skip the bureaucratic <b>blubber</b>, and arrange to meet you as soon as possible. We look forward to seeing your <b>wide</b> array of connections, and hope to <b>feed</b> you some of our own, and ultimately, both <b>gain</b> something from working together.<br>\r\n<br>\r\nRegards,<br>\r\n<br>\r\nParasol Pharmaceuticals.<br>\r\n</i></div><br>\r\n<br>\r\n<br>\r\n\"Okay... weird\" he said to himself, putting the letter down, before picking up the bottle. He examined the dark unmarked glass, before spraying it, inhaling through his nose deeply. It smelt pleasant, sweet, yet earthy. <br>\r\n<br>\r\n\"Huh...\" he shrugged. \"at least it smells good\"<br>\r\n<br>\r\nLittle did Nate know that it wasn't ordinary aftershave.</span></div></div>",
            "created":1457586000,
            "id":2115739,
            "title":"Business AU. Nate is a billionare CEO, when he ..."
        },
        "11121":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate goes to eat at the Merlot, gaining more weight.",
                "Nate decides to go home instead to eat.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Drake worked away on his desk computer, answering emails, taking calls, etc., he was unaware that under his suit, his flat, toned abs were disappearing under a layer of fat, slowly forming a modest belly. Nate looked again at his watch. It was nearly 7.<br>\r\n<br>\r\n\"Shit... that time already\" he mumbled to himself. He shut down his computer, before getting up. He was about to leave when he saw his reflection in the glass of the now darkened window. Adjusting his suit jacket, he saw his belly pushing out in his waistcoat an inch or so.<br>\r\n<br>\r\n\"What the fuck?\" he blurted confused, passing his hand over the curved form underneath the waistcoat, his medium size suit was feeling snug around the waist.<br>\r\n<br>\r\n\"Maybe I had more to eat for lunch then I thought... probably just bloated\" reasoned Nate, before taking himself away from the reflection and walking across the room to the door. \"Still, better call Stephan tomorrow for an extra PT session\".<br>\r\n<br>\r\nJust as Nate picked up his coat and exited his office to head to the elevator, he felt a grumble down below. He placed a hand to his stomach.<br>\r\n<br>\r\n'On the other hand, I could go for a bite to eat' he thought, pressing the button for the lobby. The doors shut, as Nate pulled on his dark grey business coat.<br>\r\n<br>\r\n'Could probably head to the Merlot before going home'<br>\r\n<br>\r\nThe Merlot was an extremely expensive 5 star restaurant, which Nate frequented every now and then. As Nate exited the elevator and crossed the lobby, he noticed as he walked that his suit pants felt tighter across his ass, which was growing from toned and perky, to plump bubble butt.<br>\r\n<br>\r\nHe exited the building, his big black estate car with darkened widows waiting outside. He got into the car, sighing to himself as he laid back in the seat. For some reason the walk tired him out a bit.<br>\r\n<br>\r\n\"Good evening, Sir\" said the driver.<br>\r\n<br>\r\n\"Hey\" greeted Nate. \"Thanks for pulling up to the building\"<br>\r\n<br>\r\n\"My pleasure Sir\" replied the driver. \"And where do you wish to go tonight?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1457672400,
            "id":2116085,
            "title":"Nate begins to slowly but surely grow fatter"
        },
        "111211":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate finishes his meal, and thinks everything is normal",
                "Nate notices whats happening, and leaves",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Nate stared out the window, headlights passing by. The letter from Parasol confused him, especially the wording. Nate knew that his company hadn't exactly had a good history with them, especially after Nate bought out several manufacturers that Parasol had its eyes on, but a grudge seemed a little unprofessional.<br>\r\n<br>\r\nBut something about the letter made him feel uneasy. Were they insulting him, petty revenge perhaps? But then why would they want to make connections with Drake Enterprises, to net back the manufactures maybe?<br>\r\n<br>\r\n'I best keep an eye on this... see what they're up to' thought Drake, not noticing his belly pushing forward more. As the car pulled up to the Merlot, Drake peered through the restaurant doors. It looked relatively quiet.<br>\r\n<br>\r\n\"We've arrived Sir\" announced the driver, \"Would you like me to call in your security detail?\"<br>\r\n<br>\r\n\"No need\" said replied Drake. He never liked being babysat by two hulking goons in sunglasses that never spoke. \"It's just dinner. I'll be fine, but thanks\"<br>\r\n<br>\r\n\"As you wish Sir.\"<br>\r\n<br>\r\nNate opened the car door and got out. As he exited, he pulled down his waistcoat, which was riding up as it became increasingly tighter.<br>\r\n-------------------------<br>\r\n<br>\r\nMeanwhile at an undisclosed location<br>\r\n<br>\r\n“Did Drake take the bait?”<br>\r\n<br>\r\n“Like a fish to water, Sir”<br>\r\n<br>\r\n“Good, he’s practically ours then. What’s his current weight? Where is he?”<br>\r\n<br>\r\n“195 pounds Sir…. and entering 12 Harbour Blvd on foot”<br>\r\n<br>\r\n“Hmmm….The Merlot. Do we have a secure connection to his cell phone?”<br>\r\n<br>\r\n“Yes sir”<br>\r\n<br>\r\n“What about his home address?”<br>\r\n<br>\r\n“That too, sir”<br>\r\n<br>\r\n“Excellent, time for some fun”<br>\r\n---------------------------------<br>\r\n<br>\r\n“Good evening Mr. Drake” greeted the waiter as Nate entered the restaurant.<br>\r\n<br>\r\n“Hey… uhh, you got a table for one?” asked Nate as he took off his coat.<br>\r\n<br>\r\n“Your reserved table is right this way, Mr. Drake”<br>\r\n<br>\r\nNate frowned, as he passed his coat to the staff member.<br>\r\n<br>\r\n“Weird, must be a mistake” he explained. “I didn’t make a reservation for tonight”<br>\r\n<br>\r\n“It was made by one Parasol Pharmaceuticals, not too long ago Sir” continued the waiter. “They also said they’d cover your check for tonight, on the condition that you eat everything on tonight’s menu”<br>\r\n<br>\r\nNate raised an eyebrow in skepticism. <br>\r\n<br>\r\n“You’re kidding me right? That’s like 10 different dishes”<br>\r\n<br>\r\n“On the contrary, Sir. And the total is 12 main dishes, along with 6 entrees, 8 starter courses, and 10 desserts”.<br>\r\n<br>\r\nNate raised his eyebrows, somewhat in disbelief, unimpressed by what was happening. The waiter stared back, his professionalism unwavering.<br>\r\n<br>\r\n“They should be ready shortly Sir, if you’d kindly take a seat”<br>\r\n<br>\r\n“Well…” shrugged Nathan “Can’t turn down a free meal”<br>\r\n<br>\r\nHe removed his suit jacket and sat down at the table. A few moments later, waiters began bringing out plate after plate, placing them on the table, as well as rolling them out on carts, all 4 courses at once.<br>\r\n<br>\r\n“Bonne appétit” said the waiter, bowing. As the waiting staff left, Drake surveyed the food around him. Everything from fine steak, to lobster, to roast duck, to tuna fish, sea-bass, soups, salads, goats cheese, shrimp, cheesecake, chocolate mouse, fruit parfait, profiteroles. The list went on.<br>\r\n<br>\r\n\"Well... shit\" sighed Nate, not knowing how he could eat it all.<br>\r\n<br>\r\nNate picked out a steak and began to dig in. After finishing the plate, he placed a hand on his modest belly bulge, exhaling through his cheeks loudly.<br>\r\n<br>\r\n“What’s Parasol playing at, I can’t eat all this”<br>\r\n<br>\r\nJust then, his phone vibrated with a text message. Pulling the phone out of his pant pocket, he saw a text from an unrecognized number.<br>\r\n<br>\r\n<span class=\"clblue\">          Good evening Mr. Drake</span><br>\r\n<br>\r\nNate scowled at the mysterious text, before texting back.<br>\r\n<br>\r\n    <span class=\"clgreen\">                                             Who is this?<br>\r\n                                                       Parasol?</span><br>\r\n<br>\r\nAnother text came through. One word.<br>\r\n<br>\r\n          <span class=\"clblue\">Relax…</span><br>\r\n<br>\r\n                              <span class=\"clgreen\">You didn't answer my ques...</span><br>\r\n<br>\r\nNate was about to respond when a strange sensation hit him. He smelt the scent of the aftershave from earlier waft through the air. Then he suddenly felt very limp and mellow, almost drowsy.<br>\r\n<br>\r\n“What… the.. fu…” mumbled Nate, placing a hand to his forehead.<br>\r\n<br>\r\n<span class=\"clblue\">          Just let it all go…</span><br>\r\n<br>\r\nNate then felt his body relax into the chair, suddenly forgetting that anything was wrong.<br>\r\n<br>\r\n<span class=\"clblue\">          You’re a hungry man, aren’t you Drake.</span><br>\r\n<br>\r\nNate looked at all the food laid out in front of him.<br>\r\n<br>\r\n“I’m so…. hungry… “ he muttered.<br>\r\n<br>\r\n<span class=\"clblue\">          You want to eat all of it, don’t you?</span><br>\r\n<br>\r\n“Yeah… I can eat all of this… no problem”<br>\r\n<br>\r\nNate picked up his knife and fork again and began to shovel away at another dish. In moments, the roast duck was gone, as Nate started on the next dish. As he began to dig in, his phone lit up again. <br>\r\n<br>\r\n<span class=\"clblue\">          Faster<br>\r\n<br>\r\n          Eat with your hands</span><br>\r\n<br>\r\nNate dropped the cutlery and began grabbing handfuls of food, stuffing it into his mouth. He picked up a pork chop and stuffed it in before picking up the soup bowl and chugging it down. <br>\r\n<br>\r\n<span class=\"clblue\">          That’s it…<br>\r\n<br>\r\n          Grow nice and fat Mr. Drake</span><br>\r\n<br>\r\nSlowly, the once athletic muscular businessman began to fatten up in his suit. His belly continued to grow, pushing his waistcoat to the limit as it spilled into his lap. His ass widened, becoming fat round cheeks inside his ever tightening suit pants. His pecs lost their tension and began to form plump man boobs in his shirt, his now puffy nipples pushing through his shirt.<br>\r\n<br>\r\nEven his legs and arms were becoming softer, his neck fattening in his collar, face becoming more round and soft. Nate no longer had just a belly, but was now quite chubby, and the meal was only half over.<br>\r\n<br>\r\n<span class=\"clblue\">          That suit is getting awfully tight Drake…<br>\r\n<br>\r\n          It feels good being so fat, stuffed inside that suit, doesn’t it.</span><br>\r\n<br>\r\nNate gave a moan as he loosened his top button and tie, before moving his hand to stoke his belly, before shoving another handfull of food in.<br>\r\n<br>\r\n          <span class=\"clblue\">You’re popping out of your waistcoat fat pig</span><br>\r\n<br>\r\nWith a louder moan, Nate leant back as the bottom button of his waistcoat pinged off, followed by the next, and the one after that. As Nate continued to eat, the last three buttons gave way, letting his gut free from the confines of the waistcoat, spilling forth into his lap under his shirt.<br>\r\n<br>\r\n<span class=\"clblue\">          Your belt and zipper are next, fat-ass…</span><br>\r\n<br>\r\nNate gave a loud grunt and a moan as his belt buckle broke, his zipper pulling apart to release the tension of his big round booty, his pants now fitting like a second skin.<br>\r\n<br>\r\nNate was now weighing around 240 pounds, and showed now sighs of stopping until he’d finished every last bite. He moaned through the mouthfuls, stroking his huge round belly through his shirt.<br>\r\n<br>\r\n<span class=\"clblue\">          That’s it, keep eating…</span><br>\r\n<br>\r\n<span class=\"clblue\">          I want you so fat you’ll have to buy a new suit.</span></span></div></div>",
            "created":1457758800,
            "id":2116604,
            "title":"Nate goes to eat at the Merlot, gaining more we..."
        },
        "1112111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate goes home, where Parasol decide to make more changes",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Nate was almost finished with his feast, and was ploughing through the desserts as quickly as he could. The more he ate, the better it felt, as he rubbed his swollen belly, his shirt and tie covered in spilled food stains, the lower buttons popping off.<br>\r\n<br>\r\nNate was moaning with pleasure between every mouthful, the seams to his pants splitting. Just as he was finishing the desserts, stuffing them in to his mouth, a few more shirt buttons gave way, exposing his big round tanned hairy belly.<br>\r\n<br>\r\n<span class=\"clblue\">          <span style=\"font-family:verdana, sans-serif\">That's it<br>\r\n<br>\r\n          eat every last bite fat boy<br>\r\n</span></span><br>\r\n<br>\r\nNate finished up the last of the desserts, a piece of cheesecake in one hand, and chocolate tart in the other stuffing them into his mouth. When he finished, Nate let out a grunt as the seam running up the middle of the seat of his pants gave way, ripping open, shortly followed by the seams running down his legs, his fat thighs bursting free.<br>\r\n<br>\r\n\"That's better\" he sighed, breathing deeply, before laying back in his chair, feeling lethargic after such a heavy meal. Nate was now a hefty 290 pounds, his muscle had faded, making him a pure doughy fat ass. Just then, his phone lit up again.<br>\r\n<br>\r\n          <span class=\"clblue\">You've done well tonight Drake<br>\r\n<br>\r\n          <span style=\"font-family:verdana, sans-serif\">Feels good doesn't it</span></span><br>\r\n<br>\r\n\"Feels... so good\" moaned Nate, stroking his belly.<br>\r\n<br>\r\n<span class=\"clblue\">          You look great as a huge fatty...<br>\r\n<br>\r\n          We'll talk more later...<br>\r\n<br>\r\n          Goodbye for now Drake</span><br>\r\n<br>\r\nWith that, the messages were erased completely from Drakes phone.<br>\r\n<br>\r\nThe waiter then came out again, not even phased by the businessman's transformation, as if he expected it.<br>\r\n<br>\r\n\"Are we finished for tonight sir?\" he asked.<br>\r\n<br>\r\n\"Umm *burp* yeah\" replied Nate. \"How much did that all cost exactly\"<br>\r\n<br>\r\n\"2,345 dollars Sir\" replied the waiter. \"And 20 cents\"<br>\r\n<br>\r\n\"Wow...\" said Nate, somewhat surprised.<br>\r\n<br>\r\n\"All covered by your friends at Parasol Pharmaceuticals of course\"<br>\r\n<br>\r\n\"Yeah... right. don't know what I did exactly to get that kinda tab paid for\"<br>\r\n<br>\r\n\"I can only wonder Sir\" said the waiter, a slight shiftiness in his tone.<br>\r\n<br>\r\nNate reached for his wallet, pulling out a couple of hundred bills as a tip, before hefting his new weight to his feet, which was much more difficult then before. <br>\r\n<br>\r\n\"Here, thanks for the food\"  thanked Nate, passing the tip before picking up his suit jacket.<br>\r\n<br>\r\n\"The pleasure is all mine Sir. You'll find your coat waiting for you by the door\" said the waiter. \"We hope to see you again soon\"<br>\r\n<br>\r\nThe waiter began to pick up a few of the collection of plates, and headed back to the kitchen. Nate pulled his arm into the sleeve of his suit jacket, squeezing his fat arms into it.<br>\r\n<br>\r\n\"C'mon...go in\" he grumbled. With a few ripping noises, he managed to get it on, although it looked ridiculously small.<br>\r\n<br>\r\n\"Shit... dry cleaner must've shrunk it again\"<br>\r\n<br>\r\nPicking up his coat, Nate made his way out the restaurant to the car waiting outside. As he walked he felt his belly bounce, man boobs wobbling on top, his entire fat body jiggling inside the remains of his clothes. He got into the car, his weight making the back dip down.<br>\r\n<br>\r\n\"Home sir?\" asked the driver.<br>\r\n<br>\r\n\"Yeah, thanks\" answered Nate. \"Feeling more tired then usual\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1457845200,
            "id":2116888,
            "title":"Nate finishes his meal, and thinks everything i..."
        },
        "11121111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nate goes and jacks off to some porn",
                "Nate gets a snack",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>As the car headed back to Drake's lavish home, Nate tugged at the remains of his suit irritably.<br>\r\n<br>\r\n\"Knew this suit was too small\" he cursed himself. \"Why the hell did i wear it today\"<br>\r\n<br>\r\nGiving up with trying to make his shirt cover his belly, Nate returned to gazing out the window in thought. He was still trying to work out what Parasol had to gain from all of this. <br>\r\n<br>\r\n'Why buy me dinner?' questioned Drake. It wasn't uncommon for other businesses to buy him things to earn his favour, which Nate had always found rather cheap, regardless of the price of the gift. But something about this didn't add up.<br>\r\n<br>\r\n'What am I missing here?'<br>\r\n<br>\r\n__________<br>\r\n<br>\r\n\"Drake is getting suspicious Sir\"<br>\r\n<br>\r\n\"I see... has he made the connection\"<br>\r\n<br>\r\n\"Not yet Sir\"<br>\r\n<br>\r\n\"Well see to it that he doesn't, give him something else to think about\"<br>\r\n<br>\r\n\"Yes Sir\"<br>\r\n<br>\r\n__________<br>\r\n<br>\r\nDrake was thinking through his train of thought when he felt his phone vibrate. Picking it up, he looked at the new message.<br>\r\n<br>\r\n          <span class=\"clblue\">How is your evening going Mr Drake?</span><br>\r\n<br>\r\nDrake paused at the text, scowling, before texting back with his fat fingers.<br>\r\n<br>\r\n                              <span class=\"clgreen\">Fine<br>\r\n<br>\r\n                              You gonna say who you are yet?</span><br>\r\n<br>\r\n          <span class=\"clblue\">Not yet, but for now…<br>\r\n<br>\r\n          Just do as I say</span><br>\r\n<br>\r\nDrake was about to put his phone away in disgust, when that smell came wafting through again. He momentarily felt his mind go cloudy, before clearing again. He picked up his phone and sent a reply.<br>\r\n<br>\r\n                              <span class=\"clgreen\">Ok<br>\r\n<br>\r\n                              You're the boss</span><br>\r\n<br>\r\n          <span class=\"clblue\">Good boy<br>\r\n<br>\r\n          You see your driver?</span><br>\r\n<br>\r\nNate looked at the man driving his car. His name was Mike, he was about mid 20s, slim build, tanned, dark hair, handsome looking guy. He was wearing a black suit and tie with white shirt, and black leather driving gloves.<br>\r\n<br>\r\n                              <span class=\"clgreen\">Yeah<br>\r\n<br>\r\n                              What about him?</span><br>\r\n<br>\r\n<span class=\"clblue\">          You think he's sexy don't you?</span><br>\r\n<br>\r\n                              <span class=\"clgreen\">I'm not gay if that's what you mean</span><br>\r\n<br>\r\n          <span class=\"clblue\">You are now.</span><br>\r\n<br>\r\nDrake felt a strange sensation flood over him. Suddenly all sexual thoughts of women were erased. He liked men now. He looked at Mike again.<br>\r\n<br>\r\n'Huh, he is pretty handsome I guess' thought Drake.<br>\r\n<br>\r\n          <span class=\"clblue\">Get your cock out</span><br>\r\n<br>\r\nDrake slowly reached round to his crotch. Feeling under his belly, he pulled his semi hard dick out and quietly began rubbing it off in his hand. Luckily, Drake was an endowed 8 inches, so he could reach it no problem.<br>\r\n<br>\r\n          <span class=\"clblue\">That's it you fat bastard<br>\r\n<br>\r\n          You're a huge pervert</span><br>\r\n<br>\r\nDrake stared at Mike in the front seat, slowly milking his cock. He loved jacking off to guys, and he'd do it to any guy anywhere.<br>\r\n<br>\r\n          <span class=\"clblue\">Touch your boobs<br>\r\n<br>\r\n          Squeeze those big puffy nipples of yours</span><br>\r\n<br>\r\nDrake pushed a hand up the remains of his shirt, another button popping off as he did. He began to pinch the pink nubs under the fabric, moaning a little as he did. Mike looked in his mirror before snapping his eyes back to the road, embarrassed.<br>\r\n<br>\r\n\"Sir...\" said the driver. \"Are you okay?\"<br>\r\n<br>\r\n\"Just keep driving Mike,” replied Drake in an unsettlingly pervy tone.<br>\r\n<br>\r\n          <span class=\"clblue\">Yes, more<br>\r\n<br>\r\n          Keep going</span><br>\r\n<br>\r\nNate looked at the handsome suited man shift in his seat uncomfortably.<br>\r\n<br>\r\n\"You know Mike, you look good in that uniform\"<br>\r\n<br>\r\n\"Thank you sir\" replied the driver, flustered at what was happening.<br>\r\n<br>\r\n'Yeah, fits nice and tight on you\" continued Nate, jacking his cock faster now. \"I was thinking about changing it a little, maybe loose the pants, so everyone can see that fat juicy cock of yours hanging about\"<br>\r\n<br>\r\nNate licked his lips.<br>\r\n<br>\r\n\"I... uhh... might need a raise for that one Sir\" said Mike with a nervous laugh.<br>\r\n<br>\r\n\"That can be arranged\" continued Drake. Mike gulped at the unexpected response, not expecting him to call out the bluff. \"Hell, if you come in wearing nothing but your hat and tie, ill double your pay. Maybe keep the gloves too\"<br>\r\n<br>\r\n\"Ahem…  Ill keep that in mind Sir” replied Mike, trying to remain professional in the uncomfortable situation he was in. They pulled up to Drake’s stately modern home, the huge gates opening as the car entered.<br>\r\n<br>\r\nMike stopped outside the door before getting out and walking around to open Drake’s door. Nate heaved himself out, still getting used to hefting his new mass about, before turning to the young driver.<br>\r\n<br>\r\n“Thanks for this evening Mike”<br>\r\n<br>\r\n“My pleasure sir…”<br>\r\n<br>\r\nWithout warning, Nate leaned in and began to kiss Mike, hungrily making out with him. The younger man was too stunned to stop him, as Drake moved the driver’s hand up to his round supple man boob, making him stoke the plump doughy bosom.<br>\r\n<br>\r\nAfter a few moments, Nate pulled away, tucking a 50 into Mikes pocket as he did.<br>\r\n<br>\r\n“More were that came from” smiled Nate, as he headed to the door. “See you tomorrow,”<br>\r\n<br>\r\n“Umm… yeah.. uhh good night… Sir”<br>\r\n<br>\r\nMike stood their stunned at what just happened, before looking at the 50 in his pocket, and getting back into the car.<br>\r\n<br>\r\nAs Nate approached the door, his security guard standing outside greeted him. <br>\r\n<br>\r\n“Good evening Sir” he said as he opened the double doors before standing aside.<br>\r\n<br>\r\n“Evening Brett” greeted Drake. Much to the guard’s surprise, Drake grabbed his bulge, squeezing it as he passed. “Looking good tonight”<br>\r\n<br>\r\n“Uhh.. thank you Sir” replied the guard, his face turning red with embarrassment as his boss molested him, before walking into the entrance hall.<br>\r\n<br>\r\nWhile Drake was out, Parasol had somehow managed to find their way into Drake’s home, changing things. As well as the doors being made wider, and the furniture too, the old historical paintings and art on the wall, had been replaced with edited versions, depicting important men throughout history, only they were hugely obese and in lewd acts of nudity or sex.<br>\r\n<br>\r\nIn the center of the hall was a marble statue of Drake himself, standing heroically, gazing of into the distance in his old adventure gear, consisting of a henley shirt, cargo pants and holster, but the statue was also fat, the shirt riding up to expose a few inches of his hairy belly.<br>\r\n<br>\r\nUnder the statue was a plaque reading.<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><div align=\"center\"><i><b>Nathan Drake<br>\r\n</b><br>\r\nMay my gut be large,<br>\r\nAnd my bosoms be round<br>\r\nFor I will search,<br>\r\nUntil every secret is found.<br>\r\n</i></div></span><br>\r\n<br>\r\nDrake smiled at the statue as he passed.<br>\r\n<br>\r\n          <span class=\"clblue\">You're so fat Drake<br>\r\n<br>\r\n          You have always been fat<br>\r\n<br>\r\n          And proud of it too<br>\r\n</span><br>\r\nAs Drake got in the elevator to go to bedroom, touching himself as he went. When he exited the top floor and entered his bedroom, it had changed too. The bed was huge, double king size, and there was artwork depicting naked fat men. Taking off the remains of his suit, he walked to his desk. The pictures and photos of his adventures were now mixed with ones of various men ploughing Drake's fat ass. Nate smiled at one depicting him with the hilt of an ancient tibetan purbah dagger up his hole.<br>\r\n<br>\r\n\"Good times\"<br>\r\n<br>\r\nHe then saw a photo of him and his old mentor and 'partner in crime' Victor Sullivan. Sully was like a father to Nate, scooping him off the streets when he was 14 or so. He showed Nate all he knew about treasure hunting, and had many adventures. The photo was in Mexico, when Nate was about 26, except he had a beer belly then. His arm was around Sully, who was puffing away on a cigar. Just as Nate was smiling at the photo, another text came in.<br>\r\n<br>\r\n          <span class=\"clblue\">Sully was your suger daddy Drake<br>\r\n<br>\r\n          He liked to feed you when you were young<br>\r\n<br>\r\n          He made you obese by the time you were 16</span><br>\r\n<br>\r\nDrake remembered the nights he spent with Sully.<br>\r\n<br>\r\n____<br>\r\n<br>\r\n\"C'mon kid, you have to eat <i>all</i> your birthday cake, you wanna be Daddy Sully's little fatty don't'cha?\"<br>\r\n<br>\r\n\"I'm trying Sully... theirs just *burp* so much of it\"<br>\r\n<br>\r\n\"Keep trying, your still only 185 pounds\"<br>\r\n<br>\r\n\"I know, I know... could you... rub my belly again\"<br>\r\n<br>\r\n\"Sure kid\"<br>\r\n____<br>\r\n<br>\r\nNate thought of what to do next.<br>\r\n<br>\r\n“Still horny, maybe I should go put some porn on, finish what I started in the car”<br>\r\n<br>\r\nNate rubbed his dick at the idea.<br>\r\n<br>\r\n“On second thought, I could go for a snack”</span></div></div>",
            "created":1458104400,
            "id":2118328,
            "title":"Nate goes home, where Parasol decide to make mo..."
        },
        "111211111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Next morning, Drake is 10 years older.",
                "Drake dreams about his time as a teenager with Sully",
                "Someting else"
            ],
            "content":"<div class=\"\"><div> <span>\"Screw it, time for some porn\" he said, pulling off his underpants. He then laid down on his bed, spreading out so he could relax.<br>\r\n<br>\r\nNate then turned on the 60 inch flatscreen oppressive the room and began searching for porn.<br>\r\n<br>\r\n\"Hmmm... Big bellied biker cops?... nah, seen it. Phil the fat-assed mechanic? maybe some other time.... ohh suited twink belly inflation... nice\"<br>\r\n<br>\r\nHe hit play and began to fondle his cock. He watched a slim, cute looking 18 year old, dressed in a sharp suit moan as a water pump was put in his ass, and began to fill his belly with water, making it bulge out.<br>\r\n<br>\r\n\"yeah.... that's what i'm talking about\" moaned Drake, jacking off his cock with both hands. He briefly passed to turn the volume up, before resuming pulling on his 8 inch long, thick man pole. Just then, his phone vibrated with another text. Nate decided to ignore it, but the message appeared on screen.<br>\r\n<br>\r\n          <span class=\"clblue\">You look like you got your hands full Drake<br>\r\n<br>\r\n          Mind if we make it more manageable</span><br>\r\n<br>\r\nNate was in complete ecstasy, jacking off his cock, when it started to shrink. In moments, the 8 inch shlong shrunk to 4, but Nate didn't notice, as he removed one hand to play with his nipple. But although the his cock was smaller, it became twice as sensitive, causing Drake to let out a louder moan.<br>\r\n<br>\r\n          <span class=\"clblue\">Smaller<br>\r\n<br>\r\n          A fat businessman as yourself should have a tiny cock<br>\r\n</span><br>\r\nDrake moaned again as his cock shrunk further, becoming a fat 2 inch chode, so small Nate could jack it off with his finger and thumb.<br>\r\n<br>\r\n          <span class=\"clblue\">Good<br>\r\n<br>\r\n          One of your dildos is on the bedside table.<br>\r\n<br>\r\n          Use it</span><br>\r\n<br>\r\nNot taking his eyes of the screen, Drake reached out to the table, picking up a big black 8 inch rubber dildo, one of the many he kept in a custom made draw. Lifting his leg, he began to tease it into his ass. Slowly, at first, he let out a grunt as the fat head entered his hole. Soon, he was ploughing away at his ass, the thick rubber cock sliding in and out of his man hole.<br>\r\n<br>\r\n          <span class=\"clblue\">Thats it<br>\r\n<br>\r\n          Your cock is too small to jack off<br>\r\n<br>\r\n          You prefer having huge dick in your fat ass<br>\r\n<br>\r\n          The bigger the better</span><br>\r\n<br>\r\nNate let out an extra loud moan as the dildo grew from 8 to 13 inches. This increase in size pushed him over the edge, making him shoot his load all over the silk bedsheets. Nate panted, exahusted from the action. Removing the dildo, Drake turned off the tv.<br>\r\n<br>\r\n'Phew... what a workout' he thought. It wasn't long before Drake went to sleep after that, lying naked on the sheets.<br>\r\n</span></div></div>",
            "created":1458104400,
            "id":2118575,
            "title":"Nate goes and jacks off to some porn"
        },
        "1112111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Make him into a 67 year old posh englishman",
                "Drake wakes up even fatter.",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Drake slept, his obese body spread out naked on the sheets, when his phone lit up again. Snoring loudly, Drake didn't notice the phone light up, vibrating on his night stand.<br>\r\n<br>\r\n          <span class=\"cpblue\">Here's another idea Drake, seeing as we want you to excel in business, we thought we could give you some experience.<br>\r\n</span><br>\r\n          <span class=\"cpblue\">10 years ought to do it</span><br>\r\n<br>\r\nAs soon as the text came through, Drake started to age rapidly. His handsome speckle of grey in his side burns began to spread, making his hair a dark steel grey, his hairline receding at the temple slightly. his skin becoming more worn and wrinkled. In moments Drake was 52 years old.<br>\r\n<br>\r\n</span></div></div>",
            "created":1462424400,
            "id":2143697,
            "title":"Next morning, Drake is 10 years older."
        },
        "11121111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Nathaniel wakes up in his now stately old home.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>          <span class=\"cpblue\">actually, make it 20. A little more classier too</span><br>\r\n<br>\r\nHis hair lightened to light grey, receding far up the temple, a bald spot spreading at the back. His fat round face was now more wrinkly, with rosy chubby cheeks, and multiple chins. His facial hair sculpted into a neat pair of mutton chops. Down below, his body hair began to turn light grey, his man tits beginning to sag.<br>\r\n<br>\r\n          <span class=\"cpblue\">hmmm... 5 more</span><br>\r\n<br>\r\nNate's hair turns a silvery white, the top of his head now bald, leaving a horseshoe of hair around his head, his beard now bushy muttonchops and moustache. His ears stretched larger, white hairs growing out of them, as hair appeared on his back and shoulders, covering his man boobs,and down the centre of his belly. His tiny cock nestled in a bushy mass of white and grey pubes. His body has aged, his man breasts sagging, moles appearing on his skin, which became more pale. His belly became more round, like a huge beach ball.<br>\r\n<br>\r\n          <span class=\"cpblue\">Yes, Sir Nathaniel Drakesworthy, the fat old perverted British <div align=\"justify\"></div>business tycoon. Suits you nicely</span><br>\r\n<br>\r\n<br>\r\nNathaniel snored loudly, rolling over.<br>\r\n<br>\r\n          <span class=\"cpblue\">Are you dreaming about your old days in the war, when your fellow soldiers would fuck your fat ass in the trenches? Of course you are you old pervert</span><br>\r\n<br>\r\nNew memories began to flood into the businessman's mind. When he was a young boy, how he would look upon his father, Lord David Drakesworthy, and his many business associates, all finely dressed men with large bellies, smoking pipes and drinking whiskey. Nate would spy on them during there meetings in his father's drawing room, quietly jacking his cock while looking through the crack in the door.<br>\r\n<br>\r\nSince then he had aspired to become a gentleman like them. As he became a young man, he began to dress in fine clothes, smoke the pipe and drink liquors, developing a modest, portly belly in his late 20s. He followed in his fathers footsteps, studying politics and business at Oxford University, and after graduating, he worked with his father as the heads of 'Drakesworthy &amp; Son'.<br>\r\n<br>\r\nAround his mid 30s, Lord David Drakesworthy passed away, leaving his corporation to Nathaniel, who was already bald, and becoming the image of his father, complete with large round ball belly. But Drakesworthy's fetishes continued to grow as he aged. He would often fantasise about being lusted after by young men and boys, as he did to his father when he was young. Because of this, he would often employ young apprentices, as well as bring your son to work days for his employees, making them wear fine suits as dress code.<br>\r\n<br>\r\nNathaniel began to stir, just as the sun came through the velvet drape curtains of his bedroom.</span></div></div>",
            "created":1462424400,
            "id":2143702,
            "title":"Make him into a 67 year old posh Englishman."
        },
        "1113":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Nate grows bigger and fatter after taking a cursed sumo idol.",
                "Nate starts to let himself go after retiring from adventuring.",
                "Even more storylines?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about these storylines?</span></div></span></div>",
            "created":1457586000,
            "id":2115463,
            "title":"Something else?"
        },
        "12":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "John Shepard",
                "Kaidan Alenko",
                "Jacob Taylor",
                "James Vega",
                "More ME guys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The world of Mass Effect? And who's your man to fatten up?</span></div></span></div>",
            "created":1454302800,
            "id":2097542,
            "title":"Mass Effect"
        },
        "121":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "A few days later, on the Normandy",
                "something else..."
            ],
            "content":"<div class=\"\"><div> <span>The Illusive Man sat in his office, pondering the recent events of the Reaper war. After a failed assault on the Citadel to assassinate the council in order to get them out the way, He had ordered his research team to devise a method to remove the main hindrance to his plans, Commander Shepard. A beep from his holographic console indicated an incoming call. He took a puff from his cigarette before answering.<br>\r\n<br>\r\n\"Go ahead\"<br>\r\n<br>\r\n\"Sir, we believe we have produced a means to pacify Shepard enough so he's no longer a threat. However, it's somewhat... unconventional\".<br>\r\n<br>\r\nThe Illusive Man raised his eyebrows with curiosity.<br>\r\n<br>\r\n\"I'm intrigued Dr, tell me... Stasis? Temporary Displacement?\"<br>\r\n<br>\r\n\"It's a microscopic nanite weapon Sir...\"<br>\r\n<br>\r\n\"I see\" he said, tapping his cigarette over the ashtray\" I trust the effect of these nanites isn't deadly, or permanent. As much as I hate to say it, Shepard is a good means of failsafe\"<br>\r\n<br>\r\n\"No sir, it has a much more peculiar effect, once introduced to a male body, it increases hosts hunger, as well the rate of adipose tissue build up\"<br>\r\n<br>\r\n\"You mean to say... it will make him fat?\" quizzed the Illusive Man. \"Shepard will notice immediately, he'll find a way to reverse the effects\"<br>\r\n<br>\r\n\"Not exactly, if you'll cast your mind back to when Shepard was in our employment, he mounted an exhibition to the crash site of the Hugo Gernsback, on the planet Aeia, in search of Jacob Taylor's father....\"<br>\r\n<br>\r\n\"Yes yes I remember\" Interrupted the Illusive Man, waiving his and impatiently.<br>\r\n<br>\r\n \"As you'll recall, he discovered a strange species of flora, one that had strange effect on the mental activity of anyone consuming it\"<br>\r\n<br>\r\n\"The plant was toxic, and caused damage to the brain as I recall. We're trying to make Shepard passive, not mentally handicapped\"<br>\r\n<br>\r\n\"But we've managed to alter the makeup of the toxin, and in a small dose, made it so we can alter the perception of reality to anyone exposed\".<br>\r\n<br>\r\n\"So no one will question any... anomalies, such as Shepard gaining weight\" added the Illusive Man. \"Impressive\"<br>\r\n<br>\r\n\"Exactly Sir, and any other male he interacts with\"<br>\r\n<br>\r\n\"Why does the weight gain only affect males?\"<br>\r\n<br>\r\n\"The toxin had a secondary effect, making males more aggressive. We've altered the chemical reaction that causes the aggression, and made it a passive one, which, by effect, caused the increase in weight. The nanites release this chemical at a defined rate, allowing you to control the process, Sir\"<br>\r\n<br>\r\n\"And this affects males of all races?\"<br>\r\n<br>\r\n\"All races present on the Normandy Sir... with the exception of Asari, naturally\". continued the scientist. \"But all subjects, regardless of gender or race, should be affected by the perception alteration properties of the toxin\"<br>\r\n<br>\r\n\"Excellent. This is a very interesting discovery indeed\" complemented the illusive man.<br>\r\n<br>\r\n\"There are several effects I haven't mentioned sir, that affect Shepard specifically for some reason\" continued the scientist. \"It'll cause severally increased... gas, flatulence, as well as a decline in personal hygiene, need for excersise..,\"<br>\r\n<br>\r\n\"You mean to say not only will it make Shepard overweight, but also make him a slob?\" <br>\r\n<br>\r\n\"Yes, but..\"<br>\r\n<br>\r\n\"Then deploy it as soon as possible\"<br>\r\n<br>\r\n\"Yes... sir. We'll have a micro drone infiltrate the Normandy and target Shepard when it next docks at the Citadel Sir\"<br>\r\n<br>\r\n\"Perfect. And be sure that Dr. T'soni... or any other female crew member doesn't catch on after the nanites have administered. And don't forget EDI, I assume the toxin won't effect an AI and she's bound to notice\".<br>\r\n<br>\r\n\"We'll work on it immediately Sir\"<br>\r\n<br>\r\n\"Perfect...\"<br>\r\n</span></div></div>",
            "created":1461992400,
            "id":2141152,
            "title":"John Shepard"
        },
        "1211":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Shepard wakes up chubby",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Shepard sat as his desk in his quarters, finishing his evening meal while going through his messages at his terminal. Usually meals aboard the Normandy weren't particularly what you'd call appetising, but Shepard had noticed that something tasted different about todays meals, better even.<br>\r\n<br>\r\nHe stood up to stretch his legs, and began removing his uniform top to get ready for bed. He left the top on the char and opened the door to the bathroom behind him. Lost in his own thoughts, Shepard undid the zipper on his uniform pants and hooked out his cock to take a piss. Everything felt pretty normal, until he looked down.<br>\r\n<br>\r\nPlacing a hand on his front, he noticed his abdomen was slightly curving out at the bottom, pressing it, he realised it was a modest belly. Normally this would have been cause for alarm, as it wasn't there when he woke up that morning, but it was too late, the toxin had spread to everyone aboard the Normandy, and any man Shepard got close to would succumb to the weight gain effect too.<br>\r\n<br>\r\nCuriously, the 32 year old stepped onto the scales. Shepard was 6\"1 tall,  and normally weighed 195 pounds of toned, athletic muscle. But the scale said 197. He stared at the number, it suddenly rounding up to 198. Suddenly Shepard let out a modest burp.<br>\r\n<br>\r\n\"Hmmm, guess I shouldn't have had the extra burrito\" he shrugged, patting the soft bump. Flushing the toilet, Shepard washed his hands before leaving the bathroom and crossing to the authorised of his quarters to the bed.<br>\r\n<br>\r\nHe pulled off his uniform pants, so he was just in black boxer briefs, and climbed into bed.<br>\r\n</span></div></div>",
            "created":1461992400,
            "id":2141351,
            "title":"A few days later, on the Normandy"
        },
        "12111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Shepard goes downstairs for breakfast.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>As Shepard slept, the nanites worked away, releasing the toxin that slowly reduced his muscle mass, while creating soft fat, as well as making him slobbier and lazier mentally.<br>\r\n<br>\r\nSlowly, his defined muscles began to fade, the mass being covered with fat underneath his skin. His shallow abs faded behind a wall of adipose, that expanded into a belly. His arms and shoulders lost definition as they became softer. His pecs began to loose tension, fat forming around the muscle shape, becoming a pair of modest man tits. Further down, his toned muscular butt was filling out, ballooning in his underwear, his thighs becoming fat and wobbly.<br>\r\n<br>\r\nBy the time the morning came, Shepard was quite chubby, now weighing 216 pounds, most of and had lost a good quantity of his muscle mass, so he was mostly fat. With an overweight BMI of 28, Shepard had gone from a 32 to a 38-inch waist overnight.<br>\r\n<br>\r\nAfter ignoring his 7 a.m alarm,  Shepard began to stir. Rolling onto his front, he absentmindedly scratched his new belly. He looked at the alarm clock, and realized he had overslept an hour and a half, but shrugged it off with a dismissive grunt.<br>\r\n<br>\r\nThe chubby marine then lumbered out of bed, his body jiggling with every movement. Plodding to the bathroom, Shepard's thighs were close to rubbing together as he walked. He stood over the toilet and pulled out his cock to take a piss. As he did so, he scratched his ass, before letting out a loud fart.<br>\r\n<br>\r\n'Woah... where did that come from' <br>\r\n<br>\r\nLooking in the mirror at his somewhat rounder, chubbier face, he stroked his near beard reaching stubble, wondering whether to shave.<br>\r\n<br>\r\n\"Nah...I shaved two days ago\" he said dismissively. He then went to the bathroom, before picking up his uniform pants on the back of the chair. Pulling them on, he jumped a couple of times, trying to squeeze his much bigger thighs and ass in. It was no use, they wouldn't fit around his butt, let alone the zipper reaching round. A ripping sound made Shepard stop pulling them onto him.<br>\r\n<br>\r\n\"Hmmm... they never get the sizing right\" he grumbled. \"Think I have a spare though\"<br>\r\n<br>\r\nTugging the ripped pants off, he went to the wardrobe and picked out a spare larger uniform. Pulling it on, he breathed in as he did the belt, before zipping up the top and tucking it in. The alliance uniform, which had been designed for a fit physique, looked odd on the chubby Commander.<br>\r\n<br>\r\n\"Hope I'm not too late for breakfast...\" he said, making his way to the elevator, letting another fart rip as he walked. Shepard's face went slightly pink with embarrassment. \"What is up with me this morning? Thank god no-one was around\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1461992400,
            "id":2141383,
            "title":"Shepard wakes up chubby"
        },
        "121111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Shepard has a formal event with other Alliance officers to got to.",
                "Shepard visits another crew member.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Shepard leaned against the wall of the elevator, thinking to himself about whether to order more large uniforms, as to his mind, he had gained weight over the past 4 or 5 months. As the elevator doors opened, Shepard smelled the delicious scent of breakfast.<br>\r\n<br>\r\nMaking his way into the Mess Hall, Shepard made his way to the kitchen bar, the mess sergeant looking up from his cooking.<br>\r\n<br>\r\n\"Morning Frank\"<br>\r\n<br>\r\n\"Ah good morning Commander, almost thought you were going without today\"<br>\r\n<br>\r\n\"And miss out on your breakfast?\" replied Shepard, sitting down. \"Not a chance\"<br>\r\n<br>\r\n\"Haha, true. You are a man that likes his food\" chuckled Frank. \"What'll it be today, the usual?\"<br>\r\n<br>\r\nShepard looked down at his belly, spilling into his lap. He felt a pang of shame at how much he had let himself go, embarrassed about how tubby he'd gotten. What was more strange was that the crew didn't seem surprised at all, like it was the norm. Maybe they were just being polite?<br>\r\n<br>\r\nShepard was about to ask for a bowl of muesli with banana when something clicked inside his mind, like a wave of clarity. He suddenly didn't care about the weight he'd put on, or that he was constantly gassy. In fact, he enjoyed it. The feel of his belly swaying side to side as he walked, the pungent odor of his farts, the low rumble of his burps.<br>\r\n<br>\r\n\"Commander?\" <br>\r\n<br>\r\nShepard snapped out of it, realizing the mess sergeant was staring at him.<br>\r\n<br>\r\n\"Sorry Frank\" smiled Shepard \"Make it double bacon this time. And triple the eggs and beans\"<br>\r\n<br>\r\n\"Yes Sir, coming right up\"<br>\r\n<br>\r\n-------<br>\r\n<br>\r\nShepard was eating his way through his 2nd helping of food, his plate heaped with bacon, eggs, sausage, with yet another side of pancakes, accompanied by his usual morning coffee. Little did Shepard know, as he ate, it was causing his body fat to increase again. His belly began to push forward into his lap, causing Shepard's belt to feel tight. He popped open the buckle, relieving the pressure and got back to eating. The more he ate, the more fat he gradually gained, his man boobs becoming rounder inside his uniform, his ass widening in the seat so his cheeks spilled over the sides. He continued to eat, stopping every now and then the burp, rubbing and patting his belly.<br>\r\n<br>\r\nAs Shepard finished his 4th plate, he leaned back, before letting out a long, satisfied belch, placing a hand on his pleasantly full belly. Then, as Shepard shifted his weight, he let out a long, thunderous fart, the sound resonating between Shepard's fat ass cheek and the seat, the stench of eggs hanging in the air. Frank coughed, waving the air as the small filling his nostrils.<br>\r\n<br>\r\n\"Whew... *cough* If we found a way to weaponize your farts Commander *cough* the Alliance would be set\"<br>\r\n<br>\r\n\"Well, they'll have to make do with this fat old chemical weapon for now\" laughed Shepard, pointing at himself proudly.<br>\r\n<br>\r\nUnbeknownst to him, he had gained 17lbs, making him a borderline obese 230. He was becoming a fat, gassy, crudely mannered slob Commander of the Alliance Navy, and loving it too.<br>\r\n<br>\r\n\"Well I'm off to order new uniforms, mines getting a little tight around the middle,\" said Shepard, getting to his feet. \"Thanks again Frank\"<br>\r\n<br>\r\n\"No problem Commander, and uh...  could you order me one?\" asked Frank sheepishly, \"Mines feeling a little tight too\".<br>\r\n<br>\r\nIn the brief time Frank had spent with Shepard, he had gained a modest belly underneath his uniform.<br>\r\n<br>\r\n\"No problem, I'll have them delivered ASAP\"<br>\r\n<br>\r\n\"Thanks, have a good day Sir\"<br>\r\n<br>\r\n\"You too\"<br>\r\n<br>\r\nShepard turned and began to walk off, before stopping for a second, bending over slightly, and letting out another long, wet sounding fart. <br>\r\n<br>\r\n\"Woo!\" cheered the Commander, with a fist pump, grinning as he walked off to his duties, his fat thighs rubbing together as he walked. Frank smiled, nodding his head as he picked up the stack of plates where Shepard was sitting.<br>\r\n<br>\r\n</span></div></div>",
            "created":1462078800,
            "id":2141937,
            "title":"Shepard goes downstairs for breakfast."
        },
        "1211111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Off to the meeting.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Just then, Shepard ran into Lt. James Vega, who was wearing his formal dress whites. The commander remembered he had a lunch meeting with the other Alliance officer's to attend.<br>\r\n<br>\r\n\"Hey Commander, ready for this meeting thing then. Kaidan's still in the shower\".<br>\r\n<br>\r\n\"About that, do you have some dress whites I could borrow, mine are a little... snug\"<br>\r\n<br>\r\n\"Guess it's been a while, eh Loco\" he grinned, patting his own stomach. \"Don't worry, I got ya covered. Think I have a spare XL somewhere\"<br>\r\n<br>\r\n\"Loco?\" said Shepard confused, \"I thought your nick name for me was Cerdo?\"<br>\r\n<br>\r\nJames's brow furrowed, before smiling with clarity. \"Oh yeah! Pig!\"<br>\r\n<br>\r\n\"Thought so. Cerdo suits me anyway\" smiled Shapard,  shaking his belly with his hands. \"So about that spare uniform?\"<br>\r\n<br>\r\n\"Yeah, I'll send it up. And don't worry about returning it, I know what you're like with laundry.\" joked Vega.<br>\r\n<br>\r\n\"I changed underwear a couple of weeks ago actually... but thanks for the save lieutenant.\"<br>\r\n<br>\r\n\"No problem, see ya Cerdo\"<br>\r\n<br>\r\n<br>\r\n-------<br>\r\n<br>\r\nShepard had managed to get his fat ass into the dress pants, which thanks to James's huge muscular thighs, weren't too tight, but the fabric was taut in some places. The pants were dark navy with a gold stripe down the sides, accompanied with black highly polished dress shoes. Shepard pulled on his once white undershirt, the armpits stained yellow, before looking at the jacket. The jacket was a crisp white with a high collar and gold embellishments and chain , along with navy, gold embellished shoulder boards, as well as Shepard's service bar pinned to the chest, just under the gold alliance emblem.<br>\r\n<br>\r\nAs Shepard's mind became more slobby, the idea of wearing clean clothes became more foreign to him.<br>\r\n<br>\r\n'Wow, it's so white...' thought Shepard, running the prestine fabric through his fingers. 'Guess I'll have to jerk a few out on it tonight, get a few cum stains going'  he grinned at the thought of wanking his cock over James's uniform.<br>\r\n<br>\r\nShepard puffed out his round cheeks before sighing. The jacket may have been larger than his old one, but James's waist was far more trim than his.<br>\r\n<br>\r\n\"Guess it's time to pull out the old man girdle\" he sighed. To Shepard's mind, he had to squeeze on the tailor made girdle every time he went to a formal event, in order to keep his fat belly in check.<br>\r\n<br>\r\nThe girdle resembled a sports brace in aesthetics, with several straps that pulled to make it tighter, and smelled of week-old sweat. Shepard placed it around his waist, threading the straps, before pulling them tight, reining in his belly a few inches or so, the sudden pressure on his gut forcing out a loud burp and a pungent fart. He pulled until the round soft mass was compressed, his man tits sticking out on top.<br>\r\n<br>\r\nAfter securing the girdle Shepard placed on the jacket, doing up the buttons and zip the front. He finished off with his white dress cap and gloves, and turned to the side in the mirror. He was still obviously fat, but at least his belly didn't stick out so much.<br>\r\n<br>\r\n'Still needs something'<br>\r\n<br>\r\nShepard clenched, scrunching up his brow, before releasing a loud wet fat.<br>\r\n<br>\r\n\"There we go\" he said grinning, before heading back to the elevator to meet with James and Kaidan, who were waiting on the bridge.<br>\r\n<br>\r\n</span></div></div>",
            "created":1462165200,
            "id":2142210,
            "title":"Shepard has a formal event with other Alliance ..."
        },
        "12111111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "At the meeting...",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Shepard made his way to the bridge to meet up with James and Kaidan. As he walked he felt his thighs rub together, his belly squeezed tight inside the girdle underneath his dress jacket. As he approached the bridge, he saw only Kaidan standing there.<br>\r\n<br>\r\n\"Ready to go?\" asked Shepard.<br>\r\n<br>\r\n\"Yes Commander. All good to go\"<br>\r\n<br>\r\n\"Where's Vega?\"<br>\r\n<br>\r\n\"I dunno, he sounded like he was having some trouble changing.\"<br>\r\n<br>\r\nSuddenly James appeared, jogging up to the bridge. In the time it had taken since Shepard had last spoke to him, his chiseled abs had been covered by a modest gut, bulging out at the bottom of his abdomen underneath his jacket.<br>\r\n<br>\r\n\"Sorry Commander, I had some trouble putting on my...\" began James sheepishly.<br>\r\n<br>\r\n\"No need Vega, I understand\" smiled Shepard, patting his own belly. \"Let's get going\"<br>\r\n<br>\r\nThe three disembarked from the Normandy to the Citadel and got in a skycar to head to the meeting.<br>\r\n<br>\r\nBy the time they had arrived, Shepard had grown to an obese 243 pounds, his face now plumper, with round cheeks and a double chin above his fat neck, squeezed into his collar. James was becoming less muscled and more husky by the minute, now with a full on gut growing in his lap. Even Kaidan had begun to gain weight, shifting irritably as the waistband of his dress pants began to dig in.<br>\r\n<br>\r\nThe three sat together in the skycar, Shepard's fat spilling out of his seat, his farts and body odor stinking out the cabin. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1476162000,
            "id":2222166,
            "title":"Off to the meeting."
        },
        "13":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Mario",
                "Luigi",
                "Fox ",
                "Pikachu ",
                "Your Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Please select your Super Smash Bros character that you want to fatten up.</span></div></span></div>",
            "created":1568856300,
            "id":2720398,
            "title":"Super Smash Bros."
        },
        "135":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Bowser",
                "Donkey Kong",
                "Keep'em coming"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did you expect? There are a lot of characters, especially males. We got some options.</span></div></span></div>",
            "created":1570792920,
            "id":2731302,
            "title":"Super Smash Bros 2"
        },
        "1351":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Willing (to be the heaviest heavyweight)",
                "Unwilling (mid-match humiliation)",
                "Unknowing (some leftover WOL spirits)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bowser, the king of all koopas and heavyweight fighter already in a sense. Why would he get bigger if he is already big?</span></div></span></div>",
            "created":1570793400,
            "id":2731304,
            "title":"Bowser"
        },
        "13513":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Kirby... begrudgingly.",
                "The consoles and whatever 'spirits' are."
            ],
            "content":"<div class=\"\"><div> <span>There was only light for the longest time for the large turtle. He lay twitching somewhat cartoonishly before waking up not were he was before. He remembered all of the Smash crew fighting some prissy angel think before getting blinded and set elsewhere. He looked around and saw a couple places in the distance. There was a city made of consoles, some mushroomy ravine some, mountains or whatever... there was a mishmash of stuff and places and a lot of glowing orbs.<br>\r\n<br>\r\nHe had to do something. Laying about wasn't kingly and he had some shiny winged ass to smash. He glanced around with the nearest source of anything being the city of consoles. However, on the opposite side of it, he saw Kirby running around the place. \"Hurr... I am not gunna be bossed around by a puffball... but I have no inkling of an idea of what is gunna help. Dammit...\"<br>\r\n<br>\r\nHe huffed and picked his ass up before heading toward...</span></div></div>",
            "created":1570794180,
            "id":2731308,
            "title":"World of Light, behind the scenes"
        },
        "135132":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Snorlax (fat spirits)",
                "Pacman's bonus fruits (feeding spirits)"
            ],
            "content":"<div class=\"\"><div> <span>Bowser stomps his way into town and avoids being seen by the pink blob. He had pride to keep and he didn't want that high pinched ball telling him what to do. He can figure this out himself. He walks into the city with a few normal buildings, some buildings made of Nintendo consoles and handhelds and severs shiny figures out and about. A lot of them look familiar but had a shiny rainbow aura around them. Some looked like they couldn't talk like chibi robot and a few pikmin, but there was a couple spirits of interest to him soon enough.</span></div></div>",
            "created":1570794960,
            "id":2731311,
            "title":"Spirits, how do they work?"
        },
        "1353":{
            "author_id":"alex10850",
            "author_name":"KittenLover7",
            "choices":[
                "Link",
                "Falco",
                "Don’t like these options? How about some more?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more options to choose from!</span></div></span></div>",
            "created":1594026780,
            "id":2862404,
            "title":"Super Smash Bros 3"
        },
        "14":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Ezio Auditore (Renaissance Italy)",
                "Altiair Ibn-La'Ahad (Syrian Crusades)",
                "Jacob Frye (Victorian London)",
                "Arno Dorian (French Revolution)",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The historical action series, but which assassin? </span></div></span></div>",
            "created":1509253200,
            "id":2408689,
            "title":"Assassin's Creed"
        },
        "143":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Young Jacob (20s)",
                "Assassin Master Jacob (40s)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version of the character</span></div></span></div>",
            "created":1509253200,
            "id":2408690,
            "title":"Jacob Frye (Victorian London)"
        },
        "1431":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "10 lbs (a little overhang)",
                "20 lbs (small belly)",
                "30lbs (a pot belly)"
            ],
            "content":"<div class=\"\"><div> <span>Jacob was lounging about on the train hideout as it whistled along the track through the city. Since his sister Evie had left to travel to India for tje pasr couple of months with Henry, and Assassin operations were going well in London, Jacob had a lot more time to himself.<br>\r\n<br>\r\nBecause of this, he had gotton into a few lazy habbits. Sleeping in, big breakfasts, two or more lunches a day, afternoon naps etc.As well as doing these things, Jacob also had time to think. Recently he had discoverd his attraction towards men. At first he was disgusted, attempting to woo as meny women as he could to avoid dwelling on the thought. But lately he found himself curious, watching men as they passed in the street.<br>\r\n<br>\r\nJacob was getting dressed for the day, and was in the process of buttoning up his shirt. As he did so, he realsied how tight his trousers felt.<br>\r\n<br>\r\n'\"Must of shrunk in the wash\" he reasoned, shrugging.<br>\r\n<br>\r\nHe stopped infront of the mirror to check his reflection. He smiled, admiring his handsome face as he stroked his rugged jawline. At 5'11 and an athletic 178 pounds, along with his self proclaimed charming wit, Jacob considerd himself the whole package. <br>\r\n<br>\r\n\"Hello there, handsome devil. How are you today\" he said playfully flirting with himself.<br>\r\n<br>\r\nHe then looked down realising that all this time off had had an effect on his waistline. Jacob was somewhat shocked to realise he must of gained...</span></div></div>",
            "created":1509253200,
            "id":2408701,
            "title":"Young Jacob (20s)"
        },
        "14313":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Go buy new clothes",
                "get something to eat",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Jacob stared at the round pot belly on his midsection, wonderimg how he didnt notice how fat he was getting. He'd allways been stocky, but never this big. Even his face looked softer<br>\r\n<br>\r\nJacob turned and examined his body. His belly stuck out a bit, and his asss was definatly bigger. Jacob was wonderimg how comcerned he should be, before he realised...<br>\r\n<br>\r\n\"This doesnt look half bad...\" he shrugged. \"Guess i could use more weight\"<br>\r\n<br>\r\nHe continied getting dressed. As he pulled on his waistcoat, he reasised the buttons were strugling to meet around his belly. He breathed in, trying to make them meet. After some straining he managed to do up the waistcoat. It felt tiaght even though he was sucking his gut in.<br>\r\n<br>\r\n'Okay... need new clothes'<br>\r\n<br>\r\nHe put on his top hat and coat and got off the train.<br>\r\n<br>\r\n\"Hmm... where to buy a new suit and coat\" he wondered. \"On the other hand, i could use a bite to eat... and a pint or two\"</span></div></div>",
            "created":1509253200,
            "id":2408704,
            "title":"30lbs (a pot belly)"
        },
        "15":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Resident Evil",
                "Dead Rising",
                "Metal Gear Solid",
                "Legend of Zelda",
                "Even more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More game universes to choose from.</span></div></span></div>",
            "created":1454302800,
            "id":2097530,
            "title":"More"
        },
        "151":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Chris Redfield",
                "Albert Wesker",
                "More RE Guys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Resident Evil games huh? So whose gonna be your choice?</span></div></span></div>",
            "created":1454302800,
            "id":2097538,
            "title":"Resident Evil"
        },
        "1511":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "RE5",
                "RE Vendetta",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But which version of Chris</span></div></span></div>",
            "created":1517437380,
            "id":2447598,
            "title":"Chris Redfield"
        },
        "15111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Wesker hypnotises Chris into wanting to be a sumo",
                "Wesker injects Chris with a weight gain virus",
                "other..."
            ],
            "content":"<div class=\"\"><div> <span>\"Do your worst Wesker\" growled Chris, tugging at his restraints, his big bulging muscles flexing through his tight uniform shirt as he attempted to free himself. Wesker calmy paced around the struggling hunk, chuckling to himself.<br>\r\n<br>\r\n\"What's the matter, Chris?  Muscles not big enough to break those chains? Maybe being the hunky hero isnt suited to you after all\" he teased.<br>\r\n<br>\r\n\"Go to hell!\" barked Chris, using all his might to break free.<br>\r\n<br>\r\n\"Ahh Chris... youve never been good at civil conversation.... all brawn... no tact. Fortunatly my new experiment might fix that... well half the problem at least\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1517438160,
            "id":2447607,
            "title":"RE5"
        },
        "151111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Chris embraces the sumo life style",
                "Chris tries to fight off his strange new desires.",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Wesker smiled, walking in front of Chris, before revealing a metal vial. He pulled the top off, a yellow vapor wafting out. He placed it front of Chris's face. Chris struggled, before goiing sluggish, his vision blurring.<br>\r\n<br>\r\n\"Can you hear me Chris?\"<br>\r\n<br>\r\n\"Yes\" he mumbled, head slumped to one side.<br>\r\n<br>\r\n\"Excellent. When you wake up, you will be at home in your apartment. You will have the overwhelming urge to become a sumo wrestler.  You want to be the largest wrestler there is or ever was. You will dedicate your time to eating, training and living a sumo lifestyle. You have no interest in a future as a BSAA agent. All that matters to you is getting bigger and bigger. You will be disatisfied with your slim muscular body, and enjoy gaining fat and mass. You will be sexually aroused by your own gains, and sumo wrestlers in general You will have no memory of me, or this conversation. Understood?\"<br>\r\n<br>\r\n\"Yes\"<br>\r\n<br>\r\n-------------------<br>\r\n<br>\r\nWesker placed Chris back into his apartment, leaving no trace of his presence. That night Chris dreamt strange, vivid dreams. Japanese samuri warriors batteling atop great stone walls. Serene gardens and towering pagodas. He then drempt he was naked sitting atop a mountain, except he was a giant. He watched as people scurried up the mountain like ants, carring huge offerings of food. He dreamt he was eating the food. He looked and saw he had a huge belly, which rumbled like an earthquake, demanding more food.<br>\r\n<br>\r\nChris awoke the next morning, laying on his couch at home. He rubbed his head. Looking around he saw a sumo wrestling match on tv. He must have fallen asleap watching it. He had never watched sumo wrestling in his life. He had done normal wrestling in his younger years, and even got up to national level, a dozen trophies and singlets hidden away in his clauset.<br>\r\n<br>\r\nAs Chris watched two very large men colide with loud slaps, heavy thuds and low booming grunts, fat rippling flesh bouncing and wobbling as the two mammoth size men pushed into eachother. Chris watched transfixed, in awe. He felt an unknown desire stir in him, as well as his dick getting hard for some reason. Shaking it off, he pulled himself away, turning the tv off. He dismissed his confusing boner as morning wood and got on with the day.<br>\r\n<br>\r\nChris got up and trudged to bathroom. He got on the scales, looking down past his big round pecs at the number. It read 216 as usual, which was odd, because he was starting a bulk cycle and it should've made an impact by now. He placed his hands on his torso, feeling his chisled abs. For some reason he felt like something was missing.<br>\r\n<br>\r\nNoticing the time, Chris then left the bathroom to began his 3 hour morning heavy weight training, followed by a huge meal.</span></div></div>",
            "created":1517440200,
            "id":2447622,
            "title":"Wesker hypnotises Chris into wanting to be a sumo"
        },
        "1511111":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "A month later.",
                "two months later",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>That week, Chris found he was eating more and more, and moving less, with the exception of his weight training. He had forgon his usual 5am run and replaced it with more weights. At 11 he would then prepare his first large meal of the day.<br>\r\n<br>\r\nChris had done buking diets many times before, and usually ate very clean. But he felt compelled to eat extra clean this time, only eating various beans, rice, chicken, fish, and vegetables. Chris was a big guy, so he was normally used to eating large amounts of food after his workouts, his post work out meal often around 2000 calories, which would be too much for the average man, but Chris was a large, very active guy... normally.<br>\r\n<br>\r\nNow Chris was compelled by some unknown desire to eat increasingly larger and larger meals. He would gulp and chew his way through an entire tray of food, washing it down with half a dozen beers or so. As he ate, he would sit and watch sumo wrestling on tv or read about their lifestyle in books, finding himself increasingly more and more arroused at the apperance of the colossal sized men. <br>\r\n<br>\r\nChris would often stick his hand into his ever tightening work out shorts to jack himself off,  stroking and patting his bloated stuffed belly, or groping his softening pecs with the other. He would often picture himself as the larger wrestler on tv, imagining the huge, blubbery ripping body to be his own.<br>\r\n<br>\r\n\"Ohh... yeahh.... im so big... so strong... yeahh...\" he moaned, eyes fixed on the screen. <br>\r\n<br>\r\n After spending his load, he would pass out for a nap, often sleeping for 3 or 4 hours. By the time he woke up, he was hungry again.<br>\r\n<br>\r\nAfter a week went by, Chris awoke from his daily nap for his second daily huge meal. He passed infront of the  mirror, stopping to see his body. His abs had long faded, and were now replaced by a soft gut, exposed by his work out top riding up over his belly. Roles of fat were spilling over his shorts, which were now practically skin tight, his thighs wobbling as he moved. His bulky rock hard pecs had gained a layer of fat, making them droop into the beginings of moobs. Chris stroked and jiggled his fat belly, before croaching and doing a sumo squat in the mirror. As he did his shorts ripped open from behind, Chirs smiling at the noise.<br>\r\n<br>\r\nit then dawned on him that he was way too fat to be a BSAA agent. But he didnt care. He wanted to be a super heavyweight sumo wrestler. He decided he was going to call and quit his job first thing tomorrow. As Chris prepared his evening feast, he thought of ways he could make money for his new career.<br>\r\n</span></div></div>",
            "created":1517584260,
            "id":2448407,
            "title":"Chris embraces the sumo life style"
        },
        "1513":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Barry Burton",
                "Leon S. Kennedy",
                "Even more RE Guys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about these guys?</span></div></span></div>",
            "created":1454648400,
            "id":2099673,
            "title":"More RE Guys"
        },
        "15131":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Barry starts going on huge eating binges after eating some tainted food.",
                "Another story branch."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you wanna go with the man who flaunts off his magnum? Great! Now choose a storyline that has our big man getting even more bigger. (and fatter!)</span></div></span></div>",
            "created":1454648400,
            "id":2099685,
            "title":"Barry Burton"
        },
        "152":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Frank West",
                "Chuck Greene",
                "More DR guys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you going with the crazy-zombie-fun Dead Rising world? Good, now choose your fattening victim.</span></div></span></div>",
            "created":1454302800,
            "id":2097545,
            "title":"Dead Rising"
        },
        "153":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Solid Snake",
                "Naked \"Big Boss\" Snake",
                "More MGS Men"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You going with the men from Metal Gear? Then who's gonna be your man of choice?</span></div></span></div>",
            "created":1454302800,
            "id":2097540,
            "title":"Metal Gear Solid"
        },
        "1531":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Snake is captured and fattened up by a new kind of metal gear.",
                "Snake's newest mission requires him to gain an huge amount of weight.",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Solid Snake eh? Now choose what storyline that leads our gruff legendary hero becoming a huge fatass?</span></div></span></div>",
            "created":1454648400,
            "id":2099676,
            "title":"Solid Snake"
        },
        "15311":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Snake gets fatter.",
                "The metal gear does something different."
            ],
            "content":"<div class=\"\"><div> <span>Snake was busy on a mission, scouting out an old research facility in Kazakhstan that was a possible site for metal gear production. As he crawled through a vent, the grizzled mercenary grumbled to himself, his sneaking suit apparently a little tighter then usual.<br>\r\n<br>\r\nDropping down from the vent, Snake stood up and examined himself in the mirror, his stubbled jawline on his rough handsome face, before moving down to his body. He had been hitting the weights recently, the suit's fabric taut across his chest and arms, the skintight outfit leaving very little to the imagination underneath his holster and webbing.<br>\r\n<br>\r\n\"Hmmm...\" he grumbled, turning to examine his backside. Shaking off the distraction, Snake continued out of the room and down the hall.<br>\r\n<br>\r\n'Empty?' thought Snake, confused at the lack of guards, or scientists, or anyone for that matter. Cautiously, he opened a door to the main floor of the room, a large hanger. Large manufacturing machines and equipment lay quiet in the room. Snake placed a hand on a vent.<br>\r\n<br>\r\n\"Still warm... someone was here\"<br>\r\n<br>\r\nThen, without warning, something snagged Snake by the foot, sweeping him off his feet into the air. Dangling upside-down, Snake looked at what had ensnared him. A metal tendril, coiled around his ankle. He followed the tendril to see what looked like a glowing light looking at him from the darkness.<br>\r\n<br>\r\nScowling at the large metal monstrosity in the dark, Snake reached for his weapon, but before he could draw it, another tendril whipped out of the dark and restrained his wrist, followed by two more, ensnaring his remaining limbs, and a final one wrapping around his waist.<br>\r\n<br>\r\nSnake thrashed about, trying to pull free from the strange metal gear's grasp, but to no avail. The robotic creature held strong, turning the mercenary the right way up.<br>\r\n<br>\r\nSnake scowled up at the light that was the metal gear's eye, when another tendril snaked out of the darkness, but it looked different, almost like a clear plastic hose. Trying to work out what the creature was up to, Snake stared at the new tendril as it hovered in front of him like a cobra.<br>\r\n<br>\r\nThen, the tendril lunged forward, straight into Snakes mouth, making him gag. He began to jerk and thrash, trying to dislodge the pipe from his throat. Then he watched in horror as a strange liquid started to flow down the pipe towards him, flowing through the nozzle in his gullet and into his stomach. Then, Snake noticed something that made his brow furrow.<br>\r\n<br>\r\n'Chocolate pudding?'<br>\r\n<br>\r\nThe liquid indeed tasted like chocolate.<br>\r\n<br>\r\nAs litres of the liquid were pumped into Snake, the mercenary felt a strange sensation. His stomach was starting to distend like a water balloon, pushing out into a noticeable bump.<br>\r\n<br>\r\n'Is this thing fattening me up?' thought Snake, helplessly gulping gallons of the liquid.</span></div></div>",
            "created":1457499600,
            "id":2115023,
            "title":"Snake is captured and fattened up by a new kind..."
        },
        "154":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Link.",
                "Ganondorf.",
                "More guys?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So your going with the guys from the expansive Zelda franchise? Then pick your man of choice.</span></div></span></div>",
            "created":1457586000,
            "id":2115455,
            "title":"Legend of Zelda"
        },
        "155":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Tekken",
                "Street Fighter",
                "Even Even More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these game universes instead?</span></div></span></div>",
            "created":1454302800,
            "id":2097533,
            "title":"Even more"
        },
        "1552":{
            "author_id":"johnnysugar",
            "author_name":"JohnnySugar",
            "choices":[
                "Ryu",
                "Ken",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose the fighter to fatten.</span></div></span></div>",
            "created":1509858000,
            "id":2411369,
            "title":"Street Fighter"
        },
        "15523":{
            "author_id":"johnnysugar",
            "author_name":"JohnnySugar",
            "choices":[
                "Guile",
                "Cody",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these?</span></div></span></div>",
            "created":1509858000,
            "id":2411370,
            "title":"More fighters"
        },
        "1553":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Dead or Alive",
                "Silent Hill",
                "More game universes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are plenty of game universes out there to choose.</span></div></span></div>",
            "created":1454302800,
            "id":2097535,
            "title":"Even Even More"
        },
        "15533":{
            "choices":[
                "Spyro the Dragon",
                "Last Of Us",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More game universes</span></div></span></div>",
            "created":1454821200,
            "id":2100747,
            "title":"More game universes"
        },
        "155331":{
            "choices":[
                "Classic.",
                "Legend."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whice Spyro the dragon should this be?</span></div></span></div>",
            "created":1455253200,
            "id":2103173,
            "title":"Spyro the Dragon"
        },
        "1553312":{
            "choices":[
                "Spyro",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shall gain?</span></div></span></div>",
            "created":1455253200,
            "id":2103181,
            "title":"Legend."
        },
        "155333":{
            "choices":[
                "Halo",
                "Fallout",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More game universes</span></div></span></div>",
            "created":1455598800,
            "id":2105145,
            "title":"More"
        },
        "1553331":{
            "choices":[
                "master chief",
                "other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will it be?</span></div></span></div>",
            "created":1455598800,
            "id":2105146,
            "title":"yes"
        },
        "15533312":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The arbiter?</span></div></span></div>",
            "created":1455598800,
            "id":2105148,
            "title":"other."
        },
        "155333122":{
            "choices":[
                "yes ",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps an OC?</span></div></span></div>",
            "created":1455598800,
            "id":2105150,
            "title":"no"
        },
        "1553331221":{
            "choices":[
                "Choice one.",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choice one: Cyril vulgarian, a low-ranking Elite, has been sended on a mission to investigate a mysterious human-craft that has interd Covenant terratory. Many sorts of expansions awaits this sangheili (manly weight gain).</span></div></span></div>",
            "created":1455598800,
            "id":2105155,
            "title":"What about this OC."
        },
        "15533312211":{
            "choices":[
                "A kitchen.",
                "A labrotory."
            ],
            "content":"<div class=\"\"><div> <span>A Plasma Blaster, granades, exstra clippings of ammo, and Cyril valgarian was ready for danger. Climbing into his small ship, he flew towards the large human-ship, dodging debree that came from the ship.<br>\r\n<br>\r\nAfter the reports came through that a large human-ship had enterd Cavenent terratory, the hole space area was on high-alert. They fired a few shots at the ship, seeing if they would return fire, but nothing happend.<br>\r\n<br>\r\nThe captians decided that a willing (and least importend) sangheili should be chosen to investigate. And that is how the task came apon Cyril's shoulders. Ofcourse the captains told him that he was doing a great honor for the Cavonent, and the would have him coverd if anything sould go wrong. But in truth, they only wanted to use him as a scout. If he got captured, it was his problem.<br>\r\n<br>\r\nCyril felt his heart race in his chest as he neard the vessel. Stying under the radar, Cyril was able to bord his ship on a open carrier. As soon as the lach popped open, Cyril burst out yelling, and even waisting a few shots in the prosses.<br>\r\n<br>\r\nWgen he looked around him, he saw that tge hanger was desserted. \"Hmmm, strange,\" Cyril mumbled to himself. He got out from his ship and carfully made his way down the ship. He encounterd many sleeping dormes and bathrooms, but of humans there was no sign.<br>\r\n<br>\r\nHalfway down the ship, Cyril suddenly heard a loud crash coming from a nearby room. He went into stealth mode and went to theplace the noise came from. Peering around the corner, he saw that the room was...</span></div></div>",
            "created":1455598800,
            "id":2105171,
            "title":"Let it begin."
        },
        "1553332":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "A survivor of Vault awakes from cryostasis, realising the fallout makes men fat.",
                "A Vault Tech experiment in which subjects are given endless food.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a storyline.</span></div></span></div>",
            "created":1460178000,
            "id":2130355,
            "title":"Fallout"
        },
        "15533322":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "\"This is an all male Vault there are no woman here.\" ",
                "\"There are some woman there in the other rooms but its a mostly male vault.\""
            ],
            "content":"<div class=\"\"><div> <span>The end of the world had begun and the nukes were ready to fly and scorch the earth in flames.<br>\r\nBut luckily while this was the end of the world this didn't mean this was the end of humanity as before the war begun Vault Tech built underground vaults to secure the future of mankind safe away from the harmful radiation up above.<br>\r\n<br>\r\nBut while many of the vaults were designed to keep the lucky vault dwellers safe and alive for many centuries to come not all the vaults were just shelters as many were in fact social experiments to test scientific experiments of vault dwellers and see how they would live throw them.<br>\r\nFor examples vault 21 was filled with nothing but compulsive gamblers and in vault 69 of the 1000 people that entered there was only one man while the rest of the population was female. <br>\r\n<br>\r\nAnd so we come to the main focus of are story vault 93 and are main character Sam Hardy.<br>\r\nSam was a 35 year old single men he had dark black hair piercing blue eyes a handsome manly and face chiselled jawline he didn't shave a lot so he usually had a 5oclock shadow white perfect teeth and a perfect fit body with lots of sexy black hair around his chest arms legs and belly.<br>\r\nHe used to work as as a restaurant cook and was known to be a very good one too he was even a cop for a few years in his youth too, He was polite and well mannered.<br>\r\n<br>\r\nWhich is why so many people wondered why he wasn't married... tons of woman tried to go out with him but Sam would always reject them.<br>\r\nPeople just thought he wasn't ready yet but the truth was that the reason Sam didn't date any girls because he was secretly gay he had bean stuck in the closet his whole live and was afraid to come out in worry that everyone would reject his homosexuality.<br>\r\nPoor Sam could never find anywhere to really be himself he loved men and dreamed about being dominated by big sweaty hairy men but it felt like his dreams would never come true but luckily for Sam dreams come true in the strangest of places.<br>\r\n<br>\r\nIt was just a few minutes before doom day and Sam had just saw the news that the bombs were ready to fly but luckily for him had signed up already to join Vault 93.<br>\r\nSam quickly said good bye to his old live and rushed to the Vault just on the outskirts of his neighbourhood.<br>\r\nOnce he got there a guard standing at the entrance said \"Are you on the list?  Sam said \"Yes I'm Sam Hardy I signed up just a few weeks ago please let me in I dont want to die out here!\"<br>\r\nthe guard said \"Good your the last one you made it just in time man hurry up and get your butt inside the bombs are going to hit us any second!\"<br>\r\n<br>\r\nSam and the guard got inside and just as the door closed they could see flashes out light just before the vault closed shut shielding them from the radioactive hell fire.<br>\r\nSam let out a sigh of relive \"Thank god I though I was done for...\" <br>\r\nThe guard took of his riot helmet and Sam was surprised to see the guard was a 20 something year old with a boyish face green eyes and blonde well cut hair he put out his hand to shake Sam's and said \"Names John Vic pleased to meet you I guise were going to get to know a lot about each other for the rest of are lives down here.\" Sam shook the cute guards hand yeah I guise I'm going to make a lot of new friends down here.\"<br>\r\n<br>\r\nBoth men then went into the vault where the rest of the saviours were at.<br>\r\nInside Sam saw there were a lot of men removing there old cloths and putting on there new vault suits the guard said \"Well go ahead Sam get dressed.\"<br>\r\nSam said \"Oh ok..\". Sam began to remove his cloths and got into his new blue vault 93 suit.<br>\r\nHe felt a bit odd around all theses other undressing men he couldn't help but notice how all the other men were fit attractive looking men all around there early 20s and late 30s.<br>\r\n<br>\r\nA few men also seemned to be in there late teens with skinny hairless bodies while some others seemned to  be older dad types with hairy chests and grey hair. The main thing that Sam noticed about everyone he saw was that they were all very attractive looking.<br>\r\nSam thought it was very odd that there was not one ugly or even average person in the room.<br>\r\nThere was something fishy going on here...<br>\r\n<br>\r\nBy the time Sam was done everyone was ready and dressed up.<br>\r\nHe saw a few men talk with each other and some even seemned to know others personally too.<br>\r\nSuddenly John grabbed Sam's shoulder which made Sam jump a bit John said \"I'm gad to see some of the Vault dwellers are already making friends.\"<br>\r\nSam said \"Yeah...hey can I ask you something?\" John said \"Fire away man.\" Sam asked \"so I couldn't help but notice something but correct me if I'm wrong but were are all the woman? it seems like theirs none here... \"<br>\r\nJohn said \"Oh you dont know? well...\"                        </span></div></div>",
            "created":1460264400,
            "id":2130979,
            "title":"A Vault Tech experiment in which subjects are g..."
        },
        "155333221":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "A man kissing another man with there shirts unzipped ",
                "A man undressig out of his Vault 93 uniform "
            ],
            "content":"<div class=\"\"><div> <span>Sam was very confused did John really just say there are no woman in this vault? \"W..what?...but why? oh god how are we going to keep this vault populated! will all be dead in like 80 years!\"<br>\r\nJohn said \"Wow calm down man I guise you didn't get the Vault 93 application paper it said clearly this was a men only vault.\"<br>\r\nSam said \"I dont think that was explained to me...\"<br>\r\n<br>\r\nJohn said \"Hey buddy relax man while we dont have any woman to impregnate and have kids with this vault has a state of the art clone machine!<br>\r\nAll we need to do is give the cloning machine the DNA of two men and it will create brand new life. Healthy new born babies that will grow up and take over after were long gone so dont freak out Vault tech thought of everything.\"<br>\r\nSam felt a bit relived to know that this place could support children but he did find it odd that it required two men to use there DNA to have a child did this mean this place was going to have kids with two dads? it seemned normal enouth but he still didn't understand the point of this all but why though why was only attractive guys put in this vault?<br>\r\n<br>\r\nJohn suddenly giggled \"Hehehe wow man you clearly know nothing about this place. When you signed up for vault 93 you were put throw a test weren't you?\" Sam then remembered how when he signed up he had to go throw a test to see if he was the type of person they were looking for in Vault 93.<br>\r\nA vault scientist did ask him some odd questions that day. The scientist even asked a very personal question and asked if Sam ever had feelings for other men on a frequent bases.<br>\r\n<br>\r\nSam didn't want to lie and the scientist said none of this information would be public so Sam just decided to come out with it and say that he was in fact sexually attracted to other men.<br>\r\nIt was once he said that the scientist smiled and  told him he was in perfect health had a good personality looked great and was perfect for the vault.<br>\r\nSam always thought that what the scientist said was very odd but he never thought much about it till now.<br>\r\n<br>\r\nJohn said \"Are you starting to get the picture now? I know you're probably the type who wont want to admit it but I'm going to assume you're gay....\" <br>\r\nSam blushed \"N..no I'm not gay...\" John patted Sam's shoulder \"Relax man I'm gay and I'm proud to be gay.\"<br>\r\nSam couldn't believe it he was really with another gay man? who was also a cutie to boot.<br>\r\nJohn said \"Sam all the men in this vault are gay some like me will admit and a few are still in the closet like you but you dont have to worry here you can be yourself theirs no need to pretend.\"<br>\r\n<br>\r\nSam suddenly felt like a ton of weight had bean lifted from his shoulders he felt his heart beat faster was this really a place were he could finally be himself? John said \"I'm sure everything i just told you will be a lot to take in so I think first you should try to settle in. You have a room in the main living area and if you want you can start making some new friends.\"<br>\r\nSam said \"I will thank you for this its all a lot to take in but I feel like I can already call this place home.\"<br>\r\n<br>\r\nJohn flashed a big happy smile before saying \"Good to here man I need to get back to work but I know you and I will get along just fine.\"<br>\r\nJohn then went over to the other men explaining stuff to them and getting to know them too.<br>\r\nSam decided to go further into the vault it was a very big place Sam saw other men were already trying to get used to there new life's by meeting new people finding there own rooms and getting used to the place.<br>\r\n<br>\r\nSam soon found his own room it was a very big room with a king sized bed and lots of comfy furniture it was a lot better then the old apartment he used to live in. Sam didn't have much to unpack so he had plenty of time to spare so he decided to go see his new neighbour in the room next to him Sam saw the the door was unlocked and wondered if any one was inside Sam opened up the door to see...      </span></div></div>",
            "created":1460264400,
            "id":2131041,
            "title":"\"This is an all male Vault there are no wom..."
        },
        "1553332211":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "It was time for the Vault meeting with the Vault overseer ",
                "Sam came across a vault restaurant where a sexy chief was cooking food "
            ],
            "content":"<div class=\"\"><div> <span>Sam opened the door expecting nothing but was shocked to see in the middle of the room two men kissing with there Vault suits half unzipped to let there sexy sweaty abs and pecs out.<br>\r\nSam yelped \"Oh god oh fuck I'm sorry.\" he said as he covered his eyes. He looked a bit to see that both men had stooped kissing to look at Sam they both let out a chuckle \"Oh are you are new neighbour?\" Sam tried to not look embarrassed and said \"Yeah..I am.\" <br>\r\n<br>\r\nThe men came over to Sam with there uniforms still unzipped letting there hot bodies out on display.<br>\r\nSam tried to act natural and cool in front of these two sexy men.<br>\r\nThey introduced them selfs \"Hi I'm Dan and my boyfriend is Mike pleased to meet ya.\" <br>\r\nSam saw that Dan was a about 28 looking with tanned skin blue eyes brown hair a light beard a fit body covered in light brown hair and had perfect pecs.<br>\r\nWhile his boyfriend Mike seemned to be about 24 with light skin messy blonde hair a perfectly smooth face green eyes and a hairy chest and fit body.<br>\r\n<br>\r\nMike said \"Were a close couple we dont tell that many people but here we feel perfectly free to express are feelings for one another ain't that right Dan?<br>\r\nDan smiled and said \"You damn right.\" and gave Mike a loving kiss. Sam felt his heart beat he wanted to be as open as theses men were.<br>\r\nSam said well \"Its good to meet you I think ill be getting to know you guys well.\" <br>\r\n<br>\r\nDan said \"Oh yeah I think will all be having a big meeting with the Vault Overseer soon just so you know.\"<br>\r\nMike said \"I heard he's a really sexy looking guy.\" Sam said \"Oh cool well I guise ill just wait till when ever we have are meting.\"<br>\r\nDan said \"Great to meet you man will see you at the meeting.\"<br>\r\nSam left and as he did he could here both men going back to making out.<br>\r\n<br>\r\nSam felt so free in this Vault it was strange but this all felt like a dream come true.<br>\r\nSam decided to keep looking around getting used to his new home by exploring the huge place when....    </span></div></div>",
            "created":1460264400,
            "id":2131107,
            "title":"A man kissing another man with there shirts unz..."
        },
        "15533323":{
            "author_id":"chrisann",
            "author_name":"Chrisann",
            "choices":[
                "Brotherhood of Steel weight gain",
                "Institute weigh gain",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more Fallout storylines</span></div></span></div>",
            "created":1468386000,
            "id":2179684,
            "title":"Other"
        },
        "1553333":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Viewtiful Joe.",
                "Another game ",
                "Another game "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More game worlds to choose.</span></div></span></div>",
            "created":1460523600,
            "id":2132426,
            "title":"More..."
        },
        "15533332":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Mortal Kombat.",
                "Witcher 3: Wild Hunt",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then what about this one?</span></div></span></div>",
            "created":1460523600,
            "id":2132428,
            "title":"Another game."
        },
        "155333321":{
            "author_id":"johnnysugar",
            "author_name":"JohnnySugar",
            "choices":[
                "Johnny Cage",
                "Liu Kang",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kharacter will become korpulent?</span></div></span></div>",
            "created":1509887340,
            "id":2411372,
            "title":"Mortal Kombat."
        },
        "1553333213":{
            "author_id":"johnnysugar",
            "author_name":"JohnnySugar",
            "choices":[
                "Sub-Zero",
                "Jax",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about one of these?</span></div></span></div>",
            "created":1509887460,
            "id":2411373,
            "title":"More choices"
        },
        "155333323":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Assassin's Creed",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about this game ?</span></div></span></div>",
            "created":1517464140,
            "id":2447797,
            "title":"More..."
        },
        "1553333232":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Gears of War series",
                "StarCraft series ",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these games?</span></div></span></div>",
            "created":1568851680,
            "id":2720358,
            "title":"other"
        },
        "15533332323":{
            "author_id":"amatteroftrust",
            "author_name":"AMatterofTrust",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's one not often seen: How about Grand Theft Auto?</span></div></span></div>",
            "created":1588214700,
            "id":2827192,
            "title":"more"
        }
    },
    "info":{
        "author_id":"chrisann",
        "author_name":"Chrisann",
        "brief_description":"Hot video game characters pack on a 'few' pounds. 18+ ",
        "created":1454156460,
        "description":"<td align=\"left\" class=\"norm\">This is a fat gain interactive story for the hot guys of the gaming world. Warning: content contains themes of sexual nature. Your discretion advised.<br>\r\n<br>\r\n18+ Only!<br>\r\n<br>\r\nA few guidelines:<br>\r\n<br>\r\nDo's<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/checkg.png\" alt=\"*CheckG*\" title=\"CheckG\" border=\"0\" width=\"15\" height=\"15\"> Gay male content preferred, but hetro is okay (if female isn't explicit)<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/checkg.png\" alt=\"*CheckG*\" title=\"CheckG\" border=\"0\" width=\"15\" height=\"15\"> Try to keep along the lines of lore/themes of each games respective genre.<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/checkg.png\" alt=\"*CheckG*\" title=\"CheckG\" border=\"0\" width=\"15\" height=\"15\"> Inflation, Vore, sex is permitted<br>\r\n<br>\r\nDon'ts<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/xr.png\" alt=\"*XR*\" title=\"XR\" border=\"0\" width=\"15\" height=\"15\"> No female gain/sexual content (plenty of other stories for that)<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/xr.png\" alt=\"*XR*\" title=\"XR\" border=\"0\" width=\"15\" height=\"15\">  Keep to the tone of a thread (no sudden 'he gained 100000lbs)<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/xr.png\" alt=\"*XR*\" title=\"XR\" border=\"0\" width=\"15\" height=\"15\"> No sexual content about characters that are under the age of 18.<br>\r\n<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/xr.png\" alt=\"*XR*\" title=\"XR\" border=\"0\" width=\"15\" height=\"15\"> Don't bull your way through a character you don't know. Keep the nerds (such as myself) happy, do google search etc...</td>",
        "id":2073618,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594026780,
        "modified":1594026780,
        "pretty_title":"Male Video Game Fat Gain"
    }
}