{
    "chapters":{
        "1":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Lunch!  Oh Crap!",
                "One Period before Lunch! Gotta Find Help Quick!"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n“Uggh, Where am I?” You groan to yourself as you put your hands over your throbbing head.<br>\r\n As you massage your painful head, your slowly open your eyes to see that you are on the ground on your back. In mere second, a giant shadow flies past your field of vision and you manage to pull yourself up out of reflex.<br>\r\n“Whoa, what was that? Jets this low? That can’t be right.” You tell yourself.<br>\r\n Before you can get your bearing right in this thick jungle that you are standing in, you hear a rustle from behind and you notice a cat… A Huge Cat. As its left paw lands next to you, you are knocked away by the thrush of the wind and you almost piss your pants. The cat didn’t manage to see you. Well, how the hell could it, when it was so big that one of its claw was three times as big as you! You barely manage to stop yourself from crying out, alerting the cat of your presence as it dashes away at a speed that looks as if a mountain was moving as fast as a train.<br>\r\n“What kind of bullshit dream is this?” You ask no one in particular. You try to remember how the hell you got to sleep, only to realise you have no clue what so ever. Dream or not, you just hope that the monster cat doesn’t come back to eat you or anything. <br>\r\n“Feels so real,” You comment as you touch the jungle-like environment, complete with mud tracks and forages that block the sunlight, “but I could sure use getting up.” Just then, you hear more rustling, but softer this time. <br>\r\n “So what if it’s a dream, I still don’t want to die or anything” You joke and hide behind some leaves. That’s when you are dumbstruck as your eyes are telling you that there’s a 6 foot long lizard scurrying away, looking for food. “Wow, this is some whacked up dream.” You can’t help but comment. “I guess Lizards can’t hear,” You say as the lizard moves off at an extremely fast rate.<br>\r\n<br>\r\n “Anytime now.” You say whine at yourself as you slap your head few times, trying to shake off this weird dream. Before you finish trying to wake your self up from this dream, you hear a familiar sound from very far off distance. <br>\r\n*RING*RING*<br>\r\n You would know that sound from anywhere. It was definitely the sound of your school bell ringing, signifying start and end of periods or breaks. Only then do you realise what is happening…<br>\r\n<br>\r\n“What The FUCK!” You scream out at top of your lungs. You have no clue how you have shrunk to size of a  bug, but it wasn’t going to be very nice unless you found some help, quick!<br>\r\n<br>\r\nLooking up at the sky, you could predict that it was now time for…<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601212,
            "title":"And then there was light…"
        },
        "11":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Mel",
                "Jess",
                "Suzy"
            ],
            "content":"<div class=\"\"><div> <span> Your face turns white as you realise what time it is. It is none other than the one hour break for lunch! That means that this “Jungle” will be swarming with Teenagers, playing sports and running around. Running around in… Their… Dangerous… Sneakers! <br>\r\n“I’m so doomed!”  You say as you start to climb a short grass, to see which direction would allow you to leave this field most quickly. From what you could see on some weed, you had to head left. It seems like over 1km for you. Probably less than 20 meters, were you normal size. <br>\r\n “How the hell did this happen?!?” You cry out in frustration as what seemed like soccer ball flies over your head. <br>\r\n “Holy Shit, one hit and I’m so dead!” You realise.<br>\r\n<br>\r\n But then, a shadow covers your meaningless existence and you glance up to see gigantic, but not as big as the cat, objects falling from the sky and you crouch onto the ground and cover your head.<br>\r\n<br>\r\n With an amazing luck, you somehow managed to end up in between ridges of bottom of a soccer sneaker! Less than a second later, the stadium sized sneakers run off to horizon.<br>\r\n<br>\r\n Over half an hour later and many life threatening situations of the soccer ball rolling past, you manage to get to the asphalt part of the school! Looking back, you can see the endless horizon of grass, which was much like Jungle, when you were in it. As the grass covers sunlight and whatnot, you can only see few of the giant beings that play soccer with a ball as big as a whole school.<br>\r\n<br>\r\nAs you start to think about who and how you should get help from, you can see a lone person coming your way. However, at your size, you can’t possibly focus on the person’s face as it is as big as a bus and moving at the speed of one. You quickly retreat back into the grass, so that you don’t die there and then.<br>\r\n<br>\r\n Only mere seconds later, the giant has managed to cover what would’ve took you at least half an hour, and was going past you when, the giant fell, tumbling over.<br>\r\n “What are you doing! Use this free ride wisely! Quick! Hold on to this giant!”  Your brain starts shouting at you,<br>\r\n<br>\r\n You start to make a run toward the giant, but as you get closer and closer, even though you cannot see the face, you can tell clearly who the person is, from their feet.<br>\r\n It was none other than…<br>\r\n<br>\r\n1.Mel and her stinky stained sneakers. She’s in her track team uniform that makes it seem like her legs go on forever.<br>\r\n<br>\r\n2.Jess and her hot barefoot. She’s wearing shorts and a green T-shirt. Even though she’s suppose to be short, to you, she’s a goddess.<br>\r\n<br>\r\n3.Suzy and her fishnet boots. Up her skirt, you can also see that she’s wearing a black thong that looks like it’s giving her a wedgie.<br>\r\n<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601214,
            "title":"Whoever said “Saved by the Bell?”"
        },
        "111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Yes, it’s the end of the day and she’s going home.",
                "No, it’s just someone else. You continue try to unfree yourself."
            ],
            "content":"<div class=\"\"><div> <span>As Mel starts to recover from her fall with few groans, you somehow managed to climb onto the front end of her sneakers. When you are this small, you notice the details that you can make out on the sneaker. It has many scratches, imperfections, dirt and grime over it. As Mel push on the ground to get up, your world turns upside down and you hold onto the shoe laces as tightly as possible. What you don’t notice until Mel stands up gently, God knows how, but Mel managed to made even her laces wet with her sweat and now your whole body was covered with it, as you held onto it for your dear life!<br>\r\n However, the worst wasn’t over. As Mel adjusted and started running again, you felt like you were on a roller coaster ride to hell as you were constantly moved up and down, up and down, up and down… Your mouth was wet with saltiness from the sweaty laces and you felt like you could puke anytime… Luckily, before Mel could go for another lap of the school, the bells went off and Mel headed for the lock room.<br>\r\n As Mel sat down on a bench and started to take off her shoes, you waved with all your might, which wasn’t much as you felt so sick at that moment from the motion and lurching of the stomach. However, your body managed to be glued down onto the laces and you were first lifted up to the Mel’s locker. As the ride in the lace came to a stop, you saw enormous posters of athletes along the wall. However, this rest didn’t last long as Mel quickly stuffed up the locker with her worn and musty shorts and tops, blocking all light and fresh air for you… As time goes on, there’s nothing but silence and the air isn’t getting any cooler or fresher and increasingly, all you can smell is the build up of the sweat that  Mel left on her gym clothes and the shoe that you are currently stuck to. Soon, you can’t take it any more and you decide to get away from this prison before your body rots off from the high acidity of the locker. You try as hard as you can to pull yourself off the shoelace that you have dried onto, thanks to Mel’s overwhelmingly powerful sweat.  You can tell that you are slowly coming loose. However, you can hear someone come into the locker room just outside.<br>\r\nIs Mel back already?<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601215,
            "title":"Catch that ride!"
        },
        "1111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Mel’s room, with Mel in her underwear, walking around to find something.",
                "What? Soccer field? Mel must be covering for an absent player!"
            ],
            "content":"<div class=\"\"><div> <span>As you can hear the door of the locker room open, you pray to god that it isn’t Mel. That you will be given little more time. However, all you can do is curse, as your prison door opens and a wall of dirty track pants and shirts are removed to reveal Mel’s enormous face. Still glued to the shoe lace, you don’t have much freedom of movement so you aren’t surprised when Mel doesn’t see you waving all you can at her. Next thing you notice, is the supply of fresh air. You never felt this good about breathing fresh air before. However, it’s to be expected as there was an immense build up of stink from Mel’s sweat in the locker that you were trapped in.  The smell of feet and bad body odour lingers around you now, as you spent over half an hour in an environment filled with them with no circulation of air.<br>\r\n Mel soon finishes packing her bag for homework and reaches out to grab her pair of sneakers that you are glued to. To your perspective, her bed sized fingers miss you by inches as she pulls out the sneakers by the shoe lace.<br>\r\n “Wow, it’s still wet” Mel exclaimed as she felt the shoe laces.<br>\r\n “No shit, Mel, No Shit” You say in disgust, and feeling sorry for yourself.<br>\r\n“Hehe, no wonder Johnny always teases me” Mel said silently, rolling her eyes.<br>\r\nAs Mel changes from the school shoes to her sneakers, there’s instantly a change of temperature for you, and you remember how bad it was in the locker, before Mel opened the door. Down by Mel’s ankle, you look up her skirt and notice a white cotton panty with teddy bear decorations.<br>\r\nHaving put on the shoes and all, Mel carries her bag over her shoulder and turns around and starts heading for the swinging exit. You guess that she’s going to run home as usual, and you wonder if you could survive another round of this stink torture that Mel puts up. While you think about this issue, you don’t notice pair of sandal coming down on you from above.<br>\r\n“Oops, sorry for stepping on your shoes,” A girl, who was running in and didn’t see Mel, apologised.<br>\r\n“Don’t worry about it, I barely felt it” Mel assured.<br>\r\nIn your case, however, you were knocked out cold from the blow…<br>\r\nWhen you wake up, you find yourself at…<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601216,
            "title":"Wake Up Already!"
        },
        "11111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Nothing Lasts Forever. That includes scent of body lotion."
            ],
            "content":"<div class=\"\"><div> <span> When you regain your consciousness, even before you open your eyes, your sense of smell is assaulted by a nauseating stink of sweat and you cough few times, trying to force the pungent air out of your lung, without success.<br>\r\n You dare open your eyes and are surprised a bit as it’s dark and all you can make out is that you are in an enormous and messy room. Putting your inputs together, you figure out that you somehow fell off the shoe and ended up in the middle of Mel’s bedroom with mountains of clothes and whatnot everywhere. As you concentrate a little, you can definitely make out a sound of running water, which can only mean that either it’s raining outside, or Mel’s having a shower for the first time in God-knows how long. You just hope that it’s the latter. You wonder if Mel could possibly make you out in this dark and mess of a room. For example, as you look down, you can make out from the material that you are standing on a denim jean but it’s so dark that you doubt a 200 feet giantess could tell you apart from the pants. Before long, you hear the water running stop and you quickly head toward the bedroom door, hoping to get help from Mel, as she comes in. About a metre away, you hear series of thumps from the direction of the bathroom and the door opens and Mel comes running in! She’s dripping with water from her blonde lock of hair and she’s naked staring down in your direction. From your perspective, she’s a titan that just came out of the sea and is about to crush your world. Being too amazed, you can only stare as Mel reaches for the white towel you are standing on, bending over and showing off her blonde patch of pubic hair in the nether region. As the floor you are standing on elevates, you tumble backward and automatically manage to grab onto the towel as Mel uses it wipe her young and dripping body. While you are brisked around this goddess, the stink of sweat is gone and replaced by a sweet scent of body lotion and you can’t help but get turned on. Even so, your daydream ends as Mel finishes off with grinding the towel into her armpits that have untrimmed hair. Unfortunately, you also are rubbed furiously against the soft patch of skin and without your knowledge of how, you end up being stuck to Mel’s armpit! Mel just drops the wet towel onto the floor of her bedroom and bends down to grab a panty, shutting out all light that enters your scented prison.<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601219,
            "title":"Nothing Lasts Forever"
        },
        "111111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Mel feels something in her armpit.",
                "Mel stretches, pulling her arms up, making you fall off from her armpit."
            ],
            "content":"<div class=\"\"><div> <span>For the remainder of the evening, there’s barely any light for you as the dirty tank top that Mel decided to pick off the floor and wear blocks off any incoming of light. From what you can make out anyhow, Mel orders a pizza and resolves to watching TV on the couch as her parents weren’t coming back till night from a party. To you, it feels somewhat like you are being cooked alive in one of those Cheese and Tomato Sandwich Makers with Two hot plates that press down on the sandwich to squish it to a small size. While making the comparison, you wish that you actually were in one of them instead of between your best friend’s armpits as firstly, it was probably hotter between these soft mounds of flesh that prevented any intake of fresh oxygen, and secondly, it probably smelt better there. Smell of burnt cheese was better any day than smell of mixture between sweat and body lotion. In the increasingly smelly and hot prison, you manage to fall asleep.<br>\r\nIn your dream, you are in the middle of a very large dinner plate that stretches on for miles and looking up, you see Mel smiling evilly like when she forces you to smell her sweaty socks as a prank. <br>\r\n“Shit! Help Mel! Don’t eat me!” You scream as you turn and run and run all you can, away from this evil giantess. Taking a glance back quickly, you know that it’s hopeless as the plate is lifted and tilted so that you start sliding down toward Mel’s open mouth, showing off her white set of teeth and a wet tongue that seems to have a mind of its own, just waiting to gulp you. As soon as you land on her wet tongue, Mel’s mouth ceiling drools down a large amount of spit and you are covered in the sticky substance. <br>\r\n“How could I possibly resist, you look so tasty and nutritious” Mel mumbles to you.<br>\r\nJust as Mel gulps you, you wake up screaming, covered in sweat. <br>\r\nAs you open your eyes and realise it was a dream, you thank god and pant like you ran ten miles. Even with your eyes open, you can’t see a thing as it’s dark in between Mel’s armpits. Next thing you notice is, that the sweat you are covered in, is mostly Mel’s and that you smell just as much if not worse than what it was like in Mel’s locker.<br>\r\nWithin few minutes alarm bell goes off from a distance and all you can hear afterward is Mel’s muffled voice, saying “No school today! Horray.” As Mel stands up to go the bathroom, you notice that she went to sleep without a shirt and that you can see outside every few steps that she takes. As Mel sits down on a toilet, the sudden descent makes you loose from the not-so-sticky-now prison due to her sweat lubricating you. You quickly grab onto her long armpit hair as the fall would kill you. Then…<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601218,
            "title":"Nothing Lasts Forever. That includes scent of b..."
        },
        "1111111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "(Add On and I will change the Title Suitingly)"
            ],
            "content":"<div class=\"\"><div> <span>You wonder whats happening as one of the “plates” lifts and you see Mel’s humungous face, staring directly at you with a squinting face. <br>\r\n“Phew, what’s that down there?” Mel comments as the stink of her armpit makes her frown. “Is that  some kind of an insect? Or is it just dirt?” She adds as she reaches out for you with her left hand. Tangled in her hair, you can barely move as her large fingers grab onto you and pull you out of the sticky situation. <br>\r\nYou quickly proceed to get her help. “Mel, can you see that it’s me! It’s Johnny!” You shout to the best of your abilities wiggling between her fingers that could crush you so easily.<br>\r\n“It is too! Some kind of insect, heh.” Mel said as she took a closer look at you. “Interesting.”<br>\r\nYou continue wiggling, shouting which is obviously inaudible to Mel the titan.<br>\r\n“Hey there little guy. What were you doing in my armpit? Were you massaging it like a good boy?” Mel talks sweetly. From her speech, you feel almost as she is talking to a person and not a bug, like yourself. You quickly try to do something that will make Mel realise that it’s you, and not some insect that she can play around with!<br>\r\n“I bet you love sweaty stuff like my armpit, don’t you hehe.” Mel joked. “Just so you know, you are pretty special if you do, because everyone seems to tease me just because I smell a bit bad. Especially that Johnny.” You wonder where this conversation’s going and decide to stay still and conserve energy for now.<br>\r\n“Just a secret between us, some people just can’t appreciate how nice it is being messy and smelly. So, whenever this friend of mine called Johnny was coming over, I used to take off my socks in my room so that it will stink of it and I thought that he would eventually get used to it and even start liking it. But, there’s been no change for the last 5 years. But it wasn’t all for nothing, it was pretty funny looking at him disgusted and annoyed. Not only that… It turned me on how I could make him so powerless… Hehe.” Mel giggled, looking at you. You feel horrored thinking how can such a cute girl like Mel do something so disgusting…<br>\r\n“You know what, I would be possibly the best owner for you!” Mel suggests. “You obviously like sweat and stuff, and well, let’s just say, I’m a professional in that area!” Mel laughed again as she joked. You wish that there was a self destruct button built in yourself as Mel puts you on the sink counter and wipes the piss off herself. While doing so, you jump off the counter, knowing that dying is better than this, regretting nothing. However, after the descent with your eyes closed, you wonder if death is so painless as you didn’t feel any crashing or being flattened to death. As you feel the floor with your hands, it all makes sense. You managed to land on the socks that Mel was wearing yesterday! No wonder there was a disgusting odour lingering! Before you can have another try at killing yourself, Mel looks down to see you and lifts you up again between her massive fingers. <br>\r\n“Aww, you love my sweaty socks as well, little guy? That’s so appreciative. You know what, I will put this very socks in your jar for you! That should make you happy, huh?” Mel added, ignoring all your pleas and waving. With her other free hand, she grabbed the socks squeezing in within her tight grip, letting some of the sweat out. “Hehe, freshly made, just for you.” Mel added as she carefully placed you in an empty Milo jar in the corner of her room and dropped the black socks that smell alone could make you puke was dropped right on top of you, preventing any light coming in, and most of all, restricting the circulation of fresh air…<br>\r\n“What’s going to happen to me?” You can only sigh as the acidic air around you makes your eyes teary…<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601220,
            "title":"Mel feels something in her armpit."
        },
        "11111111":{
            "choices":[
                "Try and get out your self.",
                "Wait for Sarah."
            ],
            "content":"<div class=\"\"><div> <span> The Bottom Of The Jar Was wet up to your knees in sweat from the socks. It was like a shallow swimming pool, with a horrible stench added to it, like a rotting corpse. You Waide around trying to get some way out.  You become frustrated and bang one the glass walls screaming. Then your pocket vibrates. You find it interesting when it vibrates again. You reach and pull out your cell. New Text Message. You open it.<br>\r\n\"Johnny, Where Are you? Mom wants you to do dishes after dinner or you get your allowance cut off.\"<br>\r\nYou know you can't do dishes right now, and your little sister, whom you wouldn't trust with the ability to do whatever she wants to you, but she would also not believe you. You delete the message and find out who would believe you,,, believe that you are the size of a bug, in a jar in Mel's room with a knee high pool of sweat and a pair of socks because she thinks your a nice pet... who would care and believe you...? You dialed a number of someone who was madly in love with you, but had a serious sec drive issue. Sarah Cliché. Who Was always Ironic, which is quincidental for her name. You Heard The Phone ring and pick up.<br>\r\n\"Hey Johnny, What's up honey, doin anything tonight?\"<br>\r\n\"Now Sarah, You Know I'm with Jess.\"<br>\r\n\"What do you see in her, she has no creativity and is hardly friendly and is afraid to be normal.\"<br>\r\n\"Nows Not The Time!\"<br>\r\n\"Why?\"<br>\r\n\"I'm going to say this to you slowly, and I'm not lying. I am in a glass jar in Mel's room, in a knee deep pool of sweat, with a pair of dirty socks, because my current  \"Misfortune\" she thinks I am a bug.\"<br>\r\n\"That's slightly ridiculous, but I'll bite.\"<br>\r\n\"Good, I need you to go to her house, and get me out of HERE!\"<br>\r\n\"What's in it for me?\"<br>\r\n\"What?\"<br>\r\n\"You heard me.\"<br>\r\n\"Ummm.\"<br>\r\n\"Here, Deal or No Deal, If I come and get you out of there, you stay with me, all week of our vacation letting me do as I please with you whether you're the size of a big our not... or else I leave you there to rot in Mel's sweat.\"<br>\r\n\"What?!\"<br>\r\n\"Soooo, what's your choice?\"<br>\r\n\"Okay, All week, even though I'll regret it.\"<br>\r\n\"Well then, I'll just make sure you speak for yourself.\"<br>\r\nThe phone went dead, What have you done...</span></div></div>",
            "created":1226192040,
            "id":608231,
            "title":"Regretful Phone Call"
        },
        "1111112":{
            "author_id":"spongebob1234",
            "author_name":"Trisha",
            "choices":[
                "The piss makes you lose your grip entirely",
                "She finishes up with you clinging to her pussy hairs"
            ],
            "content":"<div class=\"\"><div> <span>Mel lifts her arms in the air to stretch. You cling to her armpit hair, despite the past night of sweaty hell, but the sweat causes your grip to fail and you slide down her smooth skin. Her whole body is slightly damp causing you to slide gracefully down despite the searing fear. Her curvature cause you to drip like a sweat drop down her luscious body.<br>\r\n<br>\r\nAs you pick up speed, your weight causes you to lose your hold to her body as you pass over her flat stomach. You find yourself freefalling and flail your arms about. Suddenly you find them both caught in a tangle of hair. The smell, though, is unlike the sweat of the rest of her body; no, you are very clearly in her pubes. While normally being this close to a girl's pussy would be a joyous event, you hear a thunderous waterfall directly below you. You gaze down and at that moment the strong scent of piss hits you square on. It's enough to distract you from the fact that you are still slowly falling ever further down. You don't realize it until your head falls right in the blast of her piss.<br>\r\n<br>\r\nLucky for her you're too small to make a significant change in the direction of her flow so she is unaffected. You, however, find yourself being assaulted with a torrent of salty, musky piss from your best friend.</span></div></div>",
            "created":1375520580,
            "id":1639307,
            "title":"Out of the Frying Pan...."
        },
        "11111122":{
            "author_id":"redrodent",
            "author_name":"c'mon",
            "choices":[
                "To the park for some Soccer",
                "Just outside to do some runinning"
            ],
            "content":"<div class=\"\"><div> <span>The warm stream seemed like it would never end, you were blinded by her piss stream and were holding on to your best friends massive pubes for dear life. if you fell here you'd be sentenced to humiliating death literally going down the shitter. With new determination you took a mound of her pubes and wrapped them around your arms to help keep your grip.<br>\r\n<br>\r\nUp above Mel was nearly finishing up business and but felt a faint tickling sensation in her nethers but thought nothing of the sensation. Down below stream weakened and eventually stopped prompting you then to breathe a sigh of relief, which you soon regret. Everything in her privates smells like a terrible miasma courtesy of her piss and lack of personal hygiene to her privates the smell burned your nostrils. Then it started getting darker, your weren't sure what was happening until you felt something rough collide with your back.<br>\r\n<br>\r\nMel had taken a piece of toilet paper and wiped her vagina with it, and unknowingly plowed you closer to it. From a normal persons perspective this might be seen as sexy to however it was a nightmare. Being rubbed up against a poorly kept pussy was punishment which only got worse as soon small traces of a sticky clear liquid began to form. To some degree she was getting off to this. Luckily she soon  removed the paper and flushed it away along with the rest of her finished business. With the image of you floundering in the golden dyed toilet water fresh in your mind you were just glad to be alive (though you do have to live with the soul crushing humiliation of knowing that she's technically marked you as her property). <br>\r\n<br>\r\nMel then leaves the bathroom and reaches for the nearest set of underwear and tight shorts on the floor. She slips them on and unknowingly makes you a prisoner withing her panties. You start trying to untangle you arms but you're nowhere near fast enough as the sound of her shorts zip up and tighten around Mel's waist and thighs. <br>\r\n<br>\r\nMel was gearing up to go somewhere, and most likely do something active, but where and what?</span></div></div>",
            "created":1431120780,
            "id":1975279,
            "title":"The gold experience"
        },
        "11112":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "A truck sized soccer ball is flying straight for you!",
                "You can make out giantesses running around with incredible agility."
            ],
            "content":"<div class=\"\"><div> <span> As you come to, you automatically feel like puking all the sweat that you drank out as you notice that you are practically on one hell of a roller coaster ride. With the speed of the movement, you bet your what’s left of your life that Mel’s definitely running somewhere. You just hope that it’s home, which would mean that you would be able to get her attention more easily. You try to cross your fingers, only to realise that even your fingers are restricted as they are glued to the shoelace. When you open your eyes…</span></div></div>",
            "created":1225256400,
            "id":601221,
            "title":"Why did you bother waking up?"
        },
        "111121":{
            "author_id":"ruleit1",
            "author_name":"Bird",
            "choices":[
                "Mel's shoe is found, and she's putting it back on.",
                "Mel's shoe is lost, so she removes her socks and uses flip-flops."
            ],
            "content":"<div class=\"\"><div> <span>Mel was excited for the game today.  She knew she was only a reserve member, but nevertheless she wanted to prove herself.  The game went well enough, with it almost ending in a tie when her team earned a penalty kick.  Mel was chosen to kick the ball, and in her urge to prove her worth, she kicked it as hard as possible.  In fact, it was so hard that her shoe went flying through the air as the ball soared over the goalie's head into the net.  As her team rushed around her, lifting her off her feet and carrying her away, she laughed and cried out, \"Somebody find my shoe!\"<br>\r\n<br>\r\nThe ending of the game was less fun for you.  Unbeknownst to the team, you would be sharing a big part in the final kick.  You see the soccer ball get bigger and bigger, and you close your eyes right before the impact.  Like a good player, Mel kicked with the laces of her shoe, which meant much of the energy was poured into you.  <br>\r\n<br>\r\nAltogether, you were very lucky.  If Mel's shoe had stayed on, the impact would have turned your body to mush.  Instead, the force shattered the dried sweat around you and tumbled onto the sweat stained sock that had been freed from its prison. </span></div></div>",
            "created":1385936940,
            "id":1701566,
            "title":"Goal!"
        },
        "112":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Fall off back into the grass.",
                "Squeeze yourself under her big toenail to get a safer ride."
            ],
            "content":"<div class=\"\"><div> <span> “At least something’s working out!” You comment as you quickly grab onto your girlfriend’s cute but massive toes, to you, as she was trying to get back up. However, you have a bit of trouble as you can’t manage to get a good grip on her humongous pinkie. After a deep sniff, you immediately understand why. Like any other day, Jess has put on some foot lotion on her feet that makes it smell fantastic. However, this is bad for you as it also makes her feet very slippery and hard to grab onto. You decide to use the bumps and tiny wrinkles on her big toe to climb up to her feet. While doing so, you can’t help but sigh as the scent of mixture of flower and sweat tickle your nostril.<br>\r\n “Owww. So stupid of me!” Jess said as she inspected her toenails. You thank God and start to wave your arms at her, shouting “Jess! Hey! Help! I shrunk Somehow!” However, to her, she can’t distinctively make out the tiny you on her pink toenail and she mistakes you for a scrape on her majestic artwork.<br>\r\n<br>\r\n “Oh man. A bit of the paint scraped off!”  Jess shouts angrily. She quickly picks up her belongings that fell out of her tiny bag and puts them back in.<br>\r\n<br>\r\n “No, Wait! Jess!” You shout as she stands up and the gravity starts to slide you down your girlfriend’s hot pink toenails like some gigantic slides in theme parks! You barely manage to grab onto the edge of her toenail but you notice that you ain’t going to last long like this. <br>\r\nYou…<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601222,
            "title":"Good thing your girlfriend's a Klutz."
        },
        "1121":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "A black thong that reeks of Chlorine",
                "Cat’s paw, just between two of it’s claw-retracted toes."
            ],
            "content":"<div class=\"\"><div> <span>It seems to you that holding onto a barefoot covered in foot lotion is impossible as not only is it moving too fast, thrashing you around, you just can’t get a proper grip around the massive toe that could crush you like the bug you are. As Jess walks along, you are soon flung into the air, like a cannon ball, at a speed making you dizzy. As you land, without even opening  your eyes, you know that you are back to a patch of grass, with no one to help you… You just hope that the cat doesn’t  come back for a quick snack, even knowing that it would mistake you for a pebble, anyway. Somewhat thanking god for the cushioned landing by the foliage, you stand up to head and find help before the lunch finishes as you would be left alone in the middle of a soccer field until 9am tomorrow, by which you would have frozen, starved or perhaps eaten to death. Gulping at just thinking about the many ways of your gruesome death, you head toward the asphalt basketball court, with signs of students shooting hoops.<br>\r\nMaybe it’s been twenty minutes, but honestly to you, it doesn’t seem like it’s getting any closer, almost as if it is a mirage in a desert… Knowing what the consequences could be, you shake off the feeling of being discouraged and press on toward your enormous goal. However, you soon get a familiar feeling and you notice a shadow overlooming you and you turn around, only to be stepped on by a…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602075,
            "title":"Back to Square One"
        },
        "11211":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "She submerges her thongs in the toilet water and pisses on it.",
                "Gives her anus walls a good scrub with her thong sole."
            ],
            "content":"<div class=\"\"><div> <span> You do not know why or how, but within less than a second, your vision of being stepped on by a black thong has been replaced by the grass field that you were venturing on! Within another few seconds, you come to the conclusion that you have somehow managed to be stuck in-between two indents of the bottom of a thong that stinks bad of chlorine. As the “driver” continues walking toward where ever their destination maybe, you are glad that they are moving away from the isolated soccer field, and toward the inner part of the school with more people, where there’s obviously more chance of a rescue! You next think about how you could pull yourself out, without coming up with any ideas. It’s just such a tight fit that you are barely breathing right now! <br>\r\nEventually, you notice that you have ended up at the school swimming pool as the floor you are almost kissing has become wet tiles that repeat a pattern for what seems like forever. As you are immobile, you can barely breathe AND try not to swallow the water that tastes like chlorine. After less than 5 minutes, you have drunk over what feels like 1L of water and feel full from it. While you are recovering from the “trauma”, the owner of the thong enters a locker, and you are aware of this as both the male and female locker rooms have a swinging door that creaks very loudly, due to the high humidity in the air, rusting the door hinges.<br>\r\n“Hey, Liz, did you have nice lunch?” a girl whose voice you can’t quite recognise asks.<br>\r\nWith a sudden slam, your journey comes to a stop in front of a locker and the “driver” replies “Alright.”<br>\r\nThis confirms your guess that this was her after all, as she was the only one in the team that you could think of, were any foot ware around the pool. <br>\r\n“Great. You know they are seeing if we improved from last month, right?” the other girl asked Liz.<br>\r\n“Oh. Is it that time of the month? I better go do my “lucky ritual” then. If you will excuse me.” Liz told the other girl politely as she headed toward a cubicle toilet.<br>\r\nWhat does this “ritual” of Liz’s involve?<br>\r\n</span></div></div>",
            "created":1225434240,
            "id":602080,
            "title":"Swimming anyone?"
        },
        "112111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "I don't know how to continue from this"
            ],
            "content":"<div class=\"\"><div> <span>She submerges her thong in the toilet, as her monthly ritual dictates. Every girl has a time like this every month, but only Liz has a ritual with the bizarre element about to transpire. <br>\r\n<br>\r\nYou struggle to remain above the water, because it gets tangled in your body, and the thong has a strong smell of chlorine, which is a poison, which constricts your breath.<br>\r\n<br>\r\nLiz sits down on the toilet, and pees on the thong and therefore right on you...  </span></div></div>",
            "created":1294368360,
            "id":1030551,
            "title":"She submerges her thongs in the toilet water an..."
        },
        "112112":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Yes. She washes the thongs by walking in them around the pool.",
                "No. The hot temperature made you come loose and get stuck next to her pucker hol"
            ],
            "content":"<div class=\"\"><div> <span> You never knew that Liz was such a superstitious person as she needs to do a “ritual” to have improved her time in swimming. You then guess that it won’t affect you anyway, and don’t really care about it. Really though, you couldn’t be any more wrong, thinking that you won’t be affected any more by this “ritual” of hers.<br>\r\n It all started back few years ago, when Liz first joined the swimming club. For the first few weeks, she was a regular newbie who didn’t stand out too much from others. However, one month, just before the improvement checkup, her ass was itch and when she went to the lockers, there was only one free cubicle and in it, there weren’t any toilet paper. Obviously, she wasn’t about to put her hands up her anus, and all she had on her were her brand new thongs. So, deciding that she could always wash it anyway, she spread apart her tanned cheeks and scratched itch on her anus. Ten minutes later, she beat the school record for 100m freestyle… Since then, she performed this act as a ritual and most of the time, she improved her time over and over again.<br>\r\n And now, she was lifting the thong that you were stuck to toward her open cheeks with the hole visibly opening and closing like a fish gasping for breath out of water. You wonder what the hell is going on, as your front half of the body is soon covered in this hot girl’s equally hot faeces and sweat. <br>\r\n“Ah, that’s the stuff” Liz moaned quietly as she rubbed the bottom part of the thong along the walls of the anus, scraping it clean of any faeces.<br>\r\nDoes things get any better?<br>\r\n</span></div></div>",
            "created":1225434300,
            "id":602083,
            "title":"Rub a Dub Dub"
        },
        "1121122":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Be crushed to bloody pulp by her sweaty anus walls",
                "Have your head sucked up and into Liz’s tight asshole"
            ],
            "content":"<div class=\"\"><div> <span> After the continuous rolling in the faeces and sweat, you can feel yourself come loose from the thongs and you praise god that you won’t die as just a piece of dirt beneath this gorgeous girl’s thong. You realise that you spoke too soon and that maybe god wants you die as a piece of shit up this girl’s ass.<br>\r\n As the thong is taken out and the cheeks come together, you are wedged and also sort of glued in-between by the sweat right below Liz’s asshole. You always wondered if girls felt uncomfortable wearing the one piece swimming suit as they obviously seemed to give massive wedgies  after a lap or two. Well, you learnt something today. The fact that these swimming suits give the girls wedgies, EVEN BEFORE any laps and this was evident as your feet were touching the rubbery surface that was inserted between Liz’s beautiful butt. This wedgie isn’t helping you in your escape as it actually blocks any way out of this hot prison, sealing you in, tightly. Before long, you feel like you will go crazy from the temperature, smell, humidity, flexing of the asshole muscle, as she is using them to swim, but most of all, the biggest factor is the mental concept that you are now so insignificant that you fit right in and also blend in inside a girl’s anus. A girl who used to almost seduce you every time you met, now, trapping you unknowingly, inside her stinky bowel. From the flexing of the muscles, you feel immense pressure and you wonder why the cool water is not flowing in, until you remember that the swimsuits are made out of materials without any microscopic holes for things to flow in and out as that would reduce the user’s speed…<br>\r\n As she finishes her 10th Lap, you are just about to…<br>\r\n</span></div></div>",
            "created":1225434420,
            "id":602084,
            "title":"One Piece Swimsuit doesn’t help either"
        },
        "11211222":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Keep it in. (She tries to pull back up whatever’s troubling her)",
                "Let it out. (She tries to excrete out whatever’s troubling her)"
            ],
            "content":"<div class=\"\"><div> <span> “Yes!” Liz yelled as she clenched her fist in joy on hearing that she improved her record once again. This in turn involuntarily makes her use her anal muscle and before you know it you are sucked up by the gaping hole and only your head goes through. From this, Liz moans few “Ooh!”s and “Aah!”s and tells the coach that she needs to have a short toilet break. She rushes there quickly, which makes you get pulled up even more, and sits down on a toilet quite rapidly, making you a bit loose, due to inertia of things.<br>\r\nThen, Liz makes a quick decision…<br>\r\n</span></div></div>",
            "created":1225434660,
            "id":602086,
            "title":"You are constipating her!"
        },
        "11212":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "*Scratch Scratch Scratch* What’s that noise?"
            ],
            "content":"<div class=\"\"><div> <span> “Boom!” is what rings in your ears as you fit right in between this cat’s toes that are over 15 feet tall, compared to you! You quickly look up and try to assess the cat’s eyes to see if this was intentional or if it was a very very bad coincidence. As the cat isn’t looking down, you automatically guess that  it was by pure luck, and nothing more. Those few movements of looking up and down, has somehow managed to get you all tangled up and you find yourself unable to free yourself from the odd-scented hairy toes that tower over you.<br>\r\n With swift movements, the cat runs like the wind and then you appreciate the fact that you are tied to the cat tightly as otherwise, you would simply die from being tossed off the paws at speed of 60 miles an hour.<br>\r\n You wonder where it’s going but you soon lose hope as the cat is moving away from school, reducing your rescue rate to almost nothing. You shout at the cat, “You stupid cat! Go back! I need help! Where the hell are you going!” From what you can tell, the cat can’t hear the flea-sized you and you are going with it for the ride.<br>\r\n After few more minutes of running and climbing over fences, the cat manages to place itself on top of a steel roof with the sun pouring in so warmly. Next thing you know, the cat lies in the sun and goes for a nap. Unable to untangle yourself, you decide to do the same and hope that this is all a very bad dream…<br>\r\n</span></div></div>",
            "created":1225434780,
            "id":602087,
            "title":"Whatever happened to Puss ‘n’ Boots?"
        },
        "112121":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "\"Karen!\"",
                "\"Suzy!\""
            ],
            "content":"<div class=\"\"><div> <span> *Scratch Scratch*<br>\r\n Your warm nap is rudely interrupted by a very loud and very close noise and you open your eyes to see that the cat has now come into a house and is sharpening its claws against a scratching post. Then you realise that this is an opportunity for you to get off this ride! Just as you expected, the violent movement untangles you and you fall into a heap of shredded cloth which cushion your fall. Next thing you hear a girl say, “Oh, what a smart cat! Good work Miss Sly, you have now mastered the use of scratching post!”  <br>\r\n “Hey, wait a minute,” you say to yourself, underneath a heap of shreds of clothes that block your vision, “this voice belongs to…”<br>\r\n</span></div></div>",
            "created":1225434840,
            "id":602088,
            "title":"Rude Awakening"
        },
        "1122":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Yes.  You will just have to squeeze in deeper.",
                "No. Abandon Ship!"
            ],
            "content":"<div class=\"\"><div> <span>Knowing that this is the only possible option for you, you use all you have left and pry apart your girlfriend’s big toenail just enough so that you can squeeze inside. As you let go of her nail, it clamps down on you… Well… Like a Clam, trapping you between her hard pink toenail and her soft toe skin under the nail.   <br>\r\n You wonder what the hell she’s doing in barefoot in the middle of lunch, only to remember that today was beach volleyball knockout competition! <br>\r\n “This isn’t good,” You realise. However, at the speed Jess is moving, there’s no way that you can jump off without breaking your bones. You think about how in the world you are going to get out of this. Then, you realise what it is that you need to do. It is to NOT get out of this. This, meaning your girlfriend’s protective pink toenails! As you look far into the distance, you are now sure that your girlfriend is going to participate in the Beach Volleyball Comp, as she is heading toward the sandbox.<br>\r\n As what might be your graveyard nears,  you start having second thoughts. Could you possibly stay with inside your girlfriend’s toenail while she’s jumping from mountains to mountains of sand? What if you fall off? You are pretty sure that the sand will protect your fall but, to you, it will be like you are lost in Sahara desert. There’s no way you can make out of the sandbox by yourself, should you fall off your girlfriend’s toenails.  Are you still up to it?<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601223,
            "title":"Home Sweet (Scent) Home"
        },
        "11221":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "The torture continues as Jess and Karen wins, and moves on to next round.",
                "Jess and Karen got knocked out and they are going to Jess’s house to relax."
            ],
            "content":"<div class=\"\"><div> <span> Your body feels like jelly and you can barely breathe in this prison that consist of pink see through roof and soft but oily floor made out of skin. And of course, you can’t forget the smell. It’s an odd but strong mixture of feet lotion and sweat. Just the aroma of it is making you nauseous and isn’t helping with your lack of strength.<br>\r\n<br>\r\n Anyhow, before you know it, Jess has already managed to step onto the sand area, ready for a game of Beach Volleyball with her friend Karen. Karen is a brown head at 6’1 which makes Jess look like a little kid. To you, there’s an endless stretch of sand in all directions  and you just pray to god that you don’t fall off, which would define your doom. Along with this, you use up what energy you have left to try and squeeze deeper into your girlfriend’s big pink toenail. From what you can tell, you are so insignificantly small that she can’t even feel you moving deeper into her, like some kind of pathetic parasite. <br>\r\n You start to worry what your fate will be once your girlfriend starts playing this match. As your world shakes more and more, you guess that she’s just warming up now. However, to you, this “warming up” is enough to make you puke all over her toe skin and that’s exactly what you do. Time itself loses meaning as all input your brain gets is the constant movement and the increase in temperature and smell. Your very existence is shaped by the series of quick movements and rest periods in between the runs. <br>\r\n “She must be giving it her all,” you comment about Jess, noticing the increase in sweating rate and also the temperature of her foot. Going through this, you realise this must be how Coal must be created. Through extreme temperature and pressure. However, you could claim that it’s worse for you, as Coals don’t have a nose to take in the increasing smell of sweat. Honestly, before, the aroma was somewhat hypnotising but now, as Jess is sweating even more and more due to the workout in the sun, that pleasant aroma turned into a stink that is making you cough every few seconds. From this, you wouldn’t be surprised if you were turned into a toejam between your girlfriend’s beautiful and yet smelly toes.<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601225,
            "title":"Not So Sweet Now."
        },
        "112212":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Relax in the Jacuzzi together and paint each other’s toenails after"
            ],
            "content":"<div class=\"\"><div> <span> In your oxygen deprived state, you can hear muffled conversation. As you concentrate as much as you can, you realise it’s your girlfriend talking to Karen. <br>\r\n “Close game huh,” Jess comments breathlessly.<br>\r\n “Yea. I guess” Karen replies with a sigh.<br>\r\n“Don’t worry about it too much. We tried our best, right?” Jess tries to cheer up Karen. “You know what, why don’t you come over to my place to relax a bit ?”<br>\r\n“Should I?” Karen asked, sounding more happy than before.<br>\r\n“Yea. Why not? When you come over, we can…”<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601226,
            "title":"Knocked Out!"
        },
        "1122121":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Oh No! You are practically glued under her toenail by the sweat and foot lotion!"
            ],
            "content":"<div class=\"\"><div> <span>You feel like you will go crazy any moment from the endless feeling of falling, rising and of course, the musty smell of the environment that is now making you choke. You wonder how the hell you are still alive when the temperature inside your girlfriend’s toenail feels like over 50 degrees and your body sweat is mixing with your girlfriend’s foot sweat, making it undistinguishable from one another, but smelling just as bad. Whenever your girlfriend’s foot lands on the ground, your body undergoes an immeasurable amount of force, while when she’s raising her foot, your body feels ever so light.<br>\r\nYou look up at the world in a shade of pink and make out that you are now in your girlfriend’s car, with Karen in the passenger’s seat. Your breathing starts to slow down as your world isn’t moving up and down anymore. <br>\r\n“Phew, we smell really bad” Karen comments, whinging her nose.<br>\r\n“Ha, well what do you expect, we’ve been running around in the sun for the whole lunch” Jess replied, snickering.<br>\r\nYou know that it takes about half an hour for your girlfriend to get from school to her house. You believe that this should be enough time for you to climb up to her ear to get her help. You decide to start your long journey by pulling yourself out of your girlfriend’s pink toenail first.<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601227,
            "title":"Permanent Stay?"
        },
        "11221211":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Knocked unconscious and ended up floating in the Jacuzzi"
            ],
            "content":"<div class=\"\"><div> <span>You start to cry silently to yourself as you immediately realise that as you are stuck under her toenail, making your hope of getting your girlfriend’s help next to none. While you cry, crawled up in a ball, you soon fall asleep from the agonizing experience that you had to go through today…<br>\r\n<br>\r\nIn your sleep, you manage to make out that Jess tells Karen, “We’re here”.<br>\r\nDespite hearing this, believing that there’s no hope for you, your mind tells you to die in peace and not to fight it…<br>\r\nNext thing you know, there’s warm water flooding into your prison and your mouth fills with it. As you are in the swim club, instinctively, your mind tells you to swim toward the surface for a fresh breath of oxygen. However, another part of your mind shouts in your ear, “You Idiot! You are glued down! How could you possibly swim up?!”. Then it hits you. You start to struggle in the water and as you expected, you are freed! The water managed to wash the sweat off! With your great swimming skills and buoyancy, you swim and float up for about what feels like over 10m in less than two seconds.<br>\r\nWhen you surface, the view amazes you. Your whole vision of the world is covered by none other than Jess standing tall in her blue bikini, looking down at you. You soon realise that Jess was standing in the Jacuzzi as the water was filling up, and that’s how you came loose! In your point of view, the water rises rapidly and now, the water’s floated you all the way up to Jess’s knee. You guess that Jess noticing you among the crashing waves is harder than finding a needle in a haystack. Despite how bad the situation looks for you, you are awed by how sexy and powerful Jess looks right now, looking down at puny you, like some kind of titan. As the water rises to about her hip, she turns off the water and the waves soon stop. <br>\r\n Jess starts crouching down, breaking the surface, calling out to Karen, “Hey Karen, should I turn the bubbles on?”<br>\r\nYou hear footsteps outside and as you look up, Karen is staring into the Jacuzzi with an impish grin.<br>\r\n“Whatever you want, Jess” Karen replies as she starts to lift her right foot just above the top of the Jacuzzi to step in. You are amazed at how such enormous objects can move so gently. As Karen finally sits down across Jess, Jess flicks a handful of water toward Karen, in a playful gesture. <br>\r\n“Hey, stop that” Karen quickly replied as she countered Jess with her own handful of water. As these girls have water fight, waves from the two tiatanesses push you toward Karen, who’s in one piece red swim suit that show off her busty chest. Even though it’s the wrong time and wrong place, you can’t help but get turned on, voyeuring on these two sexy giantesses. You try to swim against the current, betting on that Jess will be more easier to climb, as she is in a bikini, meaning you can grab onto her body hair, unlike Karen, who is wearing a rubber-like red swimsuit, making it impossible for you to climb her.<br>\r\nDue to your regular workout, this sort of current doesn’t slow you down much and you dive under, to avoid being pushed back by the current produced by Jess, toward Karen. As you swim onward, you can make out Jess’s blue bikini bottom clearer and clearer as you are obviously getting closer to her. Lucky for you, this Jacuzzi’s only about  2m by 2m, meaning even at your miniscule size, it doesn’t take you more than half a minute to get close enough to grab onto Jess.<br>\r\nYou finally swim all the way next to Jess’s left elbow, which is bobbing in and out of the water. You use the wrinkles and start climbing quickly and by the time you are half way to her shoulder, you are assaulted upon by  series of wall of water.<br>\r\n“Kyaah, let’s stop” Jess suggests.<br>\r\n“What, you surrender?” Karen teases as she sprays Jess with another wave of water.<br>\r\nReflexively, Jess backs off away from the water and it’s too short for you to react as you smash into the Jacuzzi wall.<br>\r\n“Ow, you made me bump my elbow, Karen,” Jess said, sounding annoyed.<br>\r\n“Just surrender already then,” Karen continued.<br>\r\n“Okay, okay. I surrender!” Jess giggled.<br>\r\nMeanwhile, you were…<br>\r\n</span></div></div>",
            "created":1225267680,
            "id":602085,
            "title":"Get ready to Swim!"
        },
        "112212111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Jess uses you as a weapon against Karen, thinking you are a bug, Karen’s weaknes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Jess did out of reflex, was enough to knock you unconscious. Oblivious to the environment, you float in the endless sea with two giantesses on each end.<br>\r\nWhile you were floating around from one place to another in the Jacuzzi...<br>\r\n</span></div></span></div>",
            "created":1225256400,
            "id":601230,
            "title":"You are the Weapon of Mass Fright"
        },
        "1122121111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Drop the bug in-between Karen’s open cleavage.",
                "Toss the bug into Karen’s open mouth"
            ],
            "content":"<div class=\"\"><div> <span>Unbeknownst to you, Jess spotted you not long after you fell into the water, unconscious. <br>\r\n“As if I would surrender, hehe” Jess told herself as she quickly palmed the tiny you, thinking it was an harmless little insect. Well, Jess was almost right. You WERE harmless, and you WERE little, but you sure weren’t an insect.<br>\r\nYou being still unconscious, as a revenge, Jess decided to… <br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601232,
            "title":"Aim and Fire!"
        },
        "11221211111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "She manages to pluck you out of this canyon of flesh.",
                "She only manages to push you deeper into it…"
            ],
            "content":"<div class=\"\"><div> <span>You feel yourself being lifted in your unconsciousness and Jess was lifting you toward Karen’s open cleavage, while Karen had her eyes closed, relaxing.<br>\r\n With a sudden violent movement to your left, you are staring down into a mountain, no, a canyon of wet flesh that would take you days to fully explore, was it a true landmark. Of course, without saying, the next thing was the falling part. Falling… Falling… and Falling between this gorgeous Karen’s boobs! Your fall slows down as you start sliding against the soft tanned flesh. As you can’t get any footing, you grab the unending flesh with both your hands on either side. <br>\r\n Karen immediately looks down to see a bug between her breasts! “Jess, you bitch!” Karen yelled as she lowered her two fingers to try and grab you…<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602056,
            "title":"Revenge!"
        },
        "112212111111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Dare try to loosen up and fall back into the jazucci?",
                "Leave your fate within Karen’s hands, Literally?"
            ],
            "content":"<div class=\"\"><div> <span>Lucky or not, Karen manages to grab you within her gentle fingers and pluck you out with a disgusted look. Already, you miss the softness and the warmth of the flesh that you were surrounded by only few seconds ago.<br>\r\n“Jess, that wasn’t funny at all! Not only was it disgusting, what if the bug got hurt?” she tells Jess.<br>\r\n Her wet fingers drench you within seconds and you notice that her grip isn’t exactly too tight on you. While Karen’s lecturing to Jess about how every life is equally important, do you…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602057,
            "title":"Goddess's...Fingers..."
        },
        "1122121111112":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "A dip of Nacho cheese!",
                "An open bottle of purple manicure!"
            ],
            "content":"<div class=\"\"><div> <span> You guess that Karen won’t be as cruel as Jess to a small and helpless bug like you and that she’s sure to make sure you don’t drown or anything in this cruel world of giantesses. After a short express of anger, Karen decides that she’s done with the Jacuzzi as she can’t believe how merciless she was to you. “Fine, be like that” Karen tells her with anger as she walks out with a towel covering her bikini clad body and her right hand carrying you.<br>\r\n “Wait, Karen! Don’t be so uptight!” Jess begs. “Are you telling me that you care more about this bug than your best friend?” she demanded.<br>\r\n “No! Of course not!” Karen defended. “Of course I care more about you, sweetie, but I’m just telling you that all life is equally precious! Even this ugly looking bug!”<br>\r\n “Gee Thanks.” you think to yourself.<br>\r\n “You know what? We shouldn’t fight over something like this! I admit that it’s my fault! I shouldn’t have played around with the bug’s life like it was nothing.” Jess apologised, looking sincere.<br>\r\n “In that case, I forgive you and sorry for shouting, honey.” Karen said, lowering her voice down.<br>\r\n “To make up, I will get us some low-fat nachos and manicures set up. You just go get changed, K” Jess suggested.<br>\r\n “Alright alright, if you are willing to make it up to me to that extent…” Karen accepted as she started to walk over to the bathroom. Just before going in, she pulled out her gold earings and also put you down next to them. From your perspective, the jewellery was bed sized and it was very shiny as well. “Don’t be going anywhere, little bug” Karen whispered as she stared at you.<br>\r\n “I won’t.” you reply with a smile, even knowing that Karen doesn’t have a clue who you really are.<br>\r\n With the shutting of the door, Jess comes back from the kitchen with a bowl of nachos with dips in the middle and three bottles of different colours of manicure on her other hand. Seeing that Karen has gone, Jess places the snack and the manicure on a nearby knee high table and heads toward you with an evil smile. “I got you now, you Son of a bitch” Jess says as she quickly snatches you up within her football field sized palm. “I really don’t understand why Karen’s so into little animals, but I will just get rid of you, and that will be the end of that.” Jess laughs. You start praying that Karen will come out to save you from your girlfriend’s clutches but your hope is lost, as Jess proceeds to dangle your miniscule body over…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602060,
            "title":"Your Girlfriend’s a Bitch"
        },
        "11221211111122":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Painted onto Karen’s right big toe nail.",
                "Stuck to the brush, at mercy of the next manicuree, Jess."
            ],
            "content":"<div class=\"\"><div> <span> Somehow, Jess has managed to open a manicure bottle and was quick enough to dangle you above it. Just dangling way up above, you can already smell the strong scent of manicure and it makes you cough. Ironically, your girlfriend farewells you to your death, saying “I sure hope you can swim, you bastard!” Then, you land with a splash onto the thick liquid that sticks and covers your whole body purple. Not only is the sticky liquid getting in your eyes and mouth, burning them, the fume of it is making your nose go literally crazy as it smells like strong alcohol. To make the matter worse, Jess decides to be extra evil and closes the lid, only so that she can shake the content without any spilling. So, for you, your world smells like alcohol, it’s spinning like crazy and your tongue is burning from swallowing the manicure…<br>\r\n At least the spinning part stops as Karen comes out and Jess puts the bottle down quickly. After heading toward the table where she left her ear rings, she puts them on and then realises that you are missing. “Hey Jess, did you put the bug somewhere?” Karen immediately accused Jess. <br>\r\n “What! No way! I just got us some snack! I’m sure the bug’s around somewhere and he will probably come out sooner or later” Jess lied.<br>\r\n “Well, if it’s later, when I’m gone, he’s obviously going to be flushed down the toilet, ain’t he?”Karen commented.<br>\r\n “Whatever are you talking about? I love bugs too now, remember?” Jess mocked Karen.<br>\r\n While this conversation is going on, you manage to swim toward the surface and float easily as the liquid is dense. However it still doesn’t help that you are practically impossible to tell apart from the solution of the manicure beside the tiny waves that you make as you kick at the liquid to stay afloat. <br>\r\n “Here, let me make it up to you K, you just sit and watch tv and eat some nacho, while I paint your toes to perfection. How about it?” Jess tempted Karen.<br>\r\n “Um, sounds good, actually” Karen said as she came over and sat down, spraying water in all directions from her stringy dark hair.<br>\r\n With few clicks of a remote, Karen has no cares in the world as she focuses her attention on the tv. Meanwhile, Jess opens the bottle that you are trapped in and squints in to find you.<br>\r\n “Purple, okay?” Jess asked Karen.<br>\r\n “Sure.” Karen said with her eyes glued to the tv screen.<br>\r\n With the order of “go”, Jess starts to make a whirlpool out of the liquid with the brush, trying to get you stuck onto the brush.  Swish here, Swish there, and you feel sick as you are assaulted by waves after waves of the inedible liquid, purple manicure. This goes on for about ten minutes as Jess finishes off making the painting neat on Karen’s toes and you are now too exhausted to move and have ended up…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602062,
            "title":"Purple’s not my colour."
        },
        "112212111111221":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Karen asks Jess to go wash her feet first.",
                "Karen can’t help but give Jess’s toes a deep kiss each. "
            ],
            "content":"<div class=\"\"><div> <span> After your world stops spinning, you realise that you are not in the bottle anymore as you don’t have any brown walls of glass trapping you in some thick liquid. However, you do make out Jess’s face, smiling down at you, like a 7-year old girl who’s just about to pull a prank on her friend. Well, really, that’s what this is exactly about. Pulling a prank. At the cost of your life!<br>\r\n As you try to move, you find you are unable to do so as the thick liquid isn’t even a liquid any more. It’s now a very tough solid that glues you onto your girlfriend’s best friend’s toe nail stronger than you would ever be able to break out from. However, the smell has gotten somewhat better as the alcohol smell has disappeared and a smell of soap has replaced it.<br>\r\n “It’s done and I think it looks fantastic” Jess tells Karen, sounding proud of her good work and the prank.<br>\r\n Looking down, Karen doesn’t notice you as you are immobile smack back in the middle of her right big toenail. To her, you look like a very fine blemish that no one will ever notice anyhow. “And it is too. Thanks Jess. Should I paint yours now?” Karen asked, smilingly cheerfully.<br>\r\n Jess agreed, seeing no harm, stretching out her beautiful toes in front of her best friend’s face. Just as Karen lifts the purple brush of doom to start her artwork, she manages to breathe in the odour that Jess’s foot is giving off. As Jess’s foot lotion was insoluble in water, Karen notices that Jess’s feet still smell like foot lotion and sweat…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602063,
            "title":"Whoa, Whoa, Whoa. Where is this going?"
        },
        "1122121111112212":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "They both strip to nothing.",
                "Jess returns the favour, by sucking on the toe you are glued to!"
            ],
            "content":"<div class=\"\"><div> <span> “May I?” Karen asks Jess.<br>\r\nYou guess that Karen’s talking about starting the process of painting but Jess’s response shocks you as she replies, “Yes. You may kiss them.”<br>\r\nNext thing you hear is Karen kissing Jess’s toes making loud noise with each one of them. You can’t tell if you are imagining but you are sure that you hear Karen sucking on the two big toes like a pacifier.<br>\r\n “Mmm, tasty as always” Karen mumbles as her mouth is half full with Jess’s toes on her left foot.<br>\r\n You seriously cannot believe why this is happening, as Jess does totally not look like a bi-sexual in your eyes… But then again, she did try to kill you few times today, intentional or unintentional.<br>\r\n After the end of the foot-fore-play…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602064,
            "title":"Ummm. Can I interrupt?"
        },
        "113":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>You run with all your might and get to the boot… Only to realise that there’s no way in hell that you can climb this smooth wall of leather…<br>\r\n Your eardrums boom as you hear Suzy curse, “Fucking Hell. Fucking Shitty Boots!” Protecting your fragile ear drums, you look around to see whether you could use some kind of a tool. Your body races as you see a bit of gum stuck to the construction of the heel. You can barely touch it, but when you do, your hand immediately sticks to the substance. You pull yourself up with gum and by the time Suzy starts moving, you realise the mistake as you are now too stuck to even freely move your head. All you can see is the ground coming so close that you will get crushed by it, only to have it move far far away, from your POV anyway…<br>\r\n Before you know it, you get used to this rhythmic motion and fall asleep from all the workout you got today…<br>\r\n<br>\r\n When you wake up, Suzy is pulling off the gum off her boots, only to see an odd looking bug stuck to it. Oh Crap!</span></div></div>",
            "created":1225432680,
            "id":602076,
            "title":"Gummed"
        },
        "1131":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Suzy feels like making you catch on fire with a magnifying glass.",
                "Suzy wants to watch you drown in her flam"
            ],
            "content":"<div class=\"\"><div> <span>“Suzy! It’s me! Johnny! Help!” You instinctively shout as you see Suzy with a Tweezers in her hands, making you think that she’s trying to save you. However, she’s only doing a monatomic duty of removing an occasional chewing gum that sticks to her precious boots. You lose hope as she seems insensitive to your shouting. However, your hopes return as Suzy suddenly smiles revealing a set of white teeth behind her black lips that makes her look so seductive.<br>\r\n “Help! I Shrunk somehow! Suzy!” You continue on.<br>\r\n Then, Suzy starts laughing like someone who’s gone crazy, drowning out your useless voice. “How dare does a bug like you think he’s good enough to be on a Goddess’s shoe?”Suzy questions you threateningly and rhetorically.<br>\r\n You feel loss of hope, and much more as you remember how little Suzy thinks of helpless insects, much like yourself. And as Suzy’s tweezers get a strong grip on you, you can’t breathe and you fall unconscious once again…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602068,
            "title":"Suzy's new best friend"
        },
        "11312":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "She can take a leak in the jar",
                "She can wash you up and torture you within her mouth"
            ],
            "content":"<div class=\"\"><div> <span>You wonder if you will ever get out of this alive, but then you already know the answer to that. Not very likely. Not at all.<br>\r\nBeing held up between Suzy’s cold tweezers make you feel so helpless and pitiful. Then you realise why Suzy does these things. The feeling of pure superiority and power will more than likely grant her ecstasy that she is obviously addicted to great extent.<br>\r\n<br>\r\nWhile you are thinking about all this, you didn’t pay attention to where Suzy was heading toward. You’ve been at her house before once, and from the posters of various rock bands, you remember that it’s her room. She opens a cupboard  with her free hand and pulls out a jar of cigs. She unscrews the jar and turns it upside down to empty the filthy content out of it. With a quick whoosh, she loosens her grip on the tweezers, right over the lidless jar and you do flips in midair, landing on your head, at the bottom of the glass jar. You take in your surroundings and you realise how hopeless your situation is. Without Suzy’s help, there’s no way you can climb out of this prison that makes you cough, due to cigarette particles.<br>\r\nAs you look up, you can only scream in horror as Suzy’s mouth is covering the whole of Jar’s entrance. She expands and shrinks her cheeks constantly and before you dodge it, she spits a large gunk of flam towards you. Next thing you know, you find yourself trapped in the jelly like substance that weighs down your arms and legs so that you can’t move, and only makes you sink deeper and deeper. You are so disgusted by this and pray to god that this is a dream, however Suzy isn’t done and another layer of flam lands on your face, resulting in a mouthful of it, down your throat.<br>\r\n“Hahaha, you pitiful piece of shit. That’s right! I’m your Goddess! Your wholly existence depends on me!” Suzy laughs out, drunken in power.<br>\r\nIf you were normal size right about now, you wouldn’t mind giving Suzy a smack in the head, for putting you through this torture, although she probably doesn’t mean it…<br>\r\nYou continue try to lift your arms out of the goo but all your brain’s processing is the strong taste of the flam, and the smell of cigarette that the flam you are trapped in, is giving off. <br>\r\nAs you are too busy trying not to drown in your friend’s pathetic flam, Suzy has carried the jar  to the bathroom, so that…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602070,
            "title":"You can't swim in this"
        },
        "113121":{
            "author_id":"spongebob1234",
            "author_name":"Trisha",
            "content":"<div class=\"\"><div> <span>Just when you thought things were bad, you notice she took her mouth away from the jar.  Phew!  But....why is she taking her pants off?  This can't be good.<br>\r\n<br>\r\nSPLOSH!  A burst of piss comes down on you.  Drowned out, you hear, \"Burn, little insect, burn!\"  you can't breathe in the sizzling liquid1  You slowly drown in the piss.  The phloem holds you in place, being sticky and all.  your eyes burn and your lungs burst.  Finally you pass out, drowned in a goth's piss. </span></div></div>",
            "created":1313197980,
            "id":1167087,
            "title":"She can take a leak in the jar"
        },
        "113122":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Gulps you down!",
                "Toys with you by running you against her teeth and tongue!"
            ],
            "content":"<div class=\"\"><div> <span>Just before your chin hits the jelly-like flam, Suzy manages to pluck you out using her tweezers. You wonder if she had a change of heart, as she carefully washes you at the tap, in gentle water.  However, you blame yourself, wondering if you have possibly jinxed yourself, as Suzy starts lifting you toward her open mouth, showing her yellow teeth and pierced tongue.<br>\r\nTo you, as Suzy tosses you, like some kind of candy, onto her tongue, you can’t help but imagine her red tongue as an enormous bed with a metal pole in the middle, with yellow tiles on the roof and  the floor as decoration. Next thing you notice is, that the smell of the jar or the flam is nothing compared to inside of Suzy’s mouth. The stench of cigarette’s so bad, that it makes your eyes water. Before you can think too much about the pain, Suzy…<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602071,
            "title":"Mouth Play"
        },
        "1131222":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Suzy decides to spit you out… along with her pool of spit",
                "Chew on you violently"
            ],
            "content":"<div class=\"\"><div> <span>The wet and slippery surface that you’re on suddenly lifts and you lose your balance, only to end up sliding toward Suzy’s metal piercing. To your perspective, the piercing is twice your size, and seems like a statue of some kind. Before you know it, Suzy’s starts to enjoy you all by herself as she wraps your small body around her amazing tongue like a cobra, sucking on your salty taste. However, in your point of view, Suzy’s spit is getting in your eyes and mouth and it’s burning, as if her spit was an acid. Not only that, this makes you feel somewhat sick as your whole body is covered in this sticky liquid, from head to toe. Anyhow, the fact is, you are helpless as Suzy has tied you up with her tongue, and are at the mercy of Suzy’s mighty tongues.<br>\r\nWhat does Suzy decide to do?<br>\r\n</span></div></div>",
            "created":1225429200,
            "id":602073,
            "title":"Dinner, to be?"
        },
        "12":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Mel in the gym ",
                "Suzy in detention",
                "Jess in drama lessons ",
                "Karen in the canteen",
                "Liz in the locker room"
            ],
            "content":"<div class=\"\"><div> <span>You look around frantically, in a few hours the whole field will be crammed with students!<br>\r\n\"Shit!\" you yell from the top of a flower. \"Just 2 hours! I'll never make it! Fuck!\" You slid down and desperately dashed for safety, panting swear words and dodging leaves and litter. Jumping, ducking, sliding to your goal. <br>\r\n<br>\r\nFor what seemed like years of never ending forest, you finally emerged on concrete. You stumble forward, dirt and grime covered you, mixed with blood from smashed glass. You lean heavily against a wall, gasping for air. \"I... made it...\" You gasped out, as you fell into a crack in the wall, completely unconscious.<br>\r\n<br>\r\nYou slowly open your eyes... your vision was blurred and you had a ringing sound in your ear. You shook it off and walked completely into the room, shielding your eyes from the light. When your eyes adjusted, what did you see?</span></div></div>",
            "created":1228604280,
            "id":619462,
            "title":"One Period before Lunch! Gotta Find Help Quick!"
        }
    },
    "info":{
        "author_id":"junky",
        "author_name":"Shrunk Maker",
        "brief_description":"Care for a change of perspective?",
        "created":1225266540,
        "description":"<td align=\"left\" class=\"norm\">What happens when you are forced to look at your friends from a different “perspective”?<br>\r\n<br>\r\nCharacters:<br>\r\n<br>\r\n<br>\r\nYou (Johnny) :  17 years of age.<br>\r\n5’9’<br>\r\nYour grades are decent, you love swimming in your swimming club and most of all, you got great friends. Not only that, you are young, free and ready to take on what the future has in store for you.  Except… Ending up, shrinking down to size of a bug in the middle of school and being given the opportunity to reassess whether you’ve been making the right friends or not.<br>\r\nIn this story, you will be going through an ordeal of journey where you will try to get your friends’ help on reversing this shrunken effect. However, the real question is, once you see the people you knew, from a different perspective. Could you possibly convince yourself to leave your future within their hands? Are they still trust worthy?<br>\r\n<br>\r\nMel: <br>\r\n17 Years Old.<br>\r\n5’8<br>\r\n<br>\r\nChildhood friend of yours, all the way back since Grade school.  Infact, you guys were introduced to each other as your parents were friends in college. Despite how much time you spend with her, there has never been any discussion of romantic approach to the relationship. She has blonde hair and has a very slim body as she has in the track team since junior high. She also loves playing soccer, but due to her dedication to the track team, she decided to join the soccer team as a reserve, just to play soccer when she is needed. She never had a boyfriend of her own, when she probably could’ve had a few by now. Odd, you always thought. Talking about odd, you could even say that she was quite twisted as it seemed like she doesn’t take a shower too regularly, which is evident from her body odour and the state of the room, every time you give her a visit. Even though you visit her every week and also tell her to start tidying up a bit, it never seems to get any better, if not worse. There’s clothing all over her room, her bedroom door doesn’t even close shut properly, and worst of all, there’s always the musky smell of feet that clings around in her room. It is truly amazing how he still hasn’t got used to the stink, even though he must’ve spent at least two or three hours in such a state every week for over five years. Anyhow, excluding her bad BO, 10 out of 10 as a friend. She loves wearing these old sneakers, which doesn’t help with her smell, and matching top and shorts track team uniform at school. At home, she sticks to Flip Flops and Tank top along with short pants that show off her strong smooth legs.<br>\r\n<br>\r\nJess:<br>\r\n16 Years Old.<br>\r\n<br>\r\n5’4<br>\r\n<br>\r\nOfficial Girlfriend. She’s quite petit but very sexy in her own ways. You’ve known her since start of high school and recently started to “date” officially. She gets along quite well with Mel, somehow. From what you can tell, they are quite different “beings”. Mel, the uncivilised and stinky cavewomen and Jess, the temptress with sexy body. Honestly, there isn’t a place that you can see that she hasn’t done something. She definitely shaves off all body hair. Well, the ones you can see. She paints her toenails hot pink, which you find pretty cute. Not only that, her fashion sense is overwhelming as you never seen her “repeat” an outfit before. From what you can tell, she is a bit of a perfectionist. All in all, you love her very much, and have been telling yourself that you are ready for the next step, with more than just goodnight kisses and regular phone calls. Just maybe…<br>\r\n<br>\r\n<br>\r\nSuzy:<br>\r\n17 Years Old.<br>\r\n5’10<br>\r\nA goth friend of yours. You first met her in a music class back in Sophomore.  She’s into rock music and isn’t afraid to dress up to school in fishnet boots that go all the way up to her long and elegant knees. Just remembering now, there have been few instances where you’ve seen her torture some helpless insects. She would spit on them, put them on fire with her lighter, or squeeze the life out of them between her powerful fingers. Once, she claimed that she got a jar full of them and drowned them all in her piss. You didn’t doubt her for a second. You have only been to her house once but it was surprisingly very neat. Maybe it’s because you are always around Mel, who’s living in a pig sty. Suzy’s house smelled fresh and she didn’t like it when things were messy, apparently. Funny though, when you were at her house, you saw that she had the same boots on. When asked why, she replied as if she was offended somewhat.<br>\r\n “Cuz I can. Something wrong with that?” When you heard that, you wondered whether that’s her defence for killing those insects…<br>\r\n<br>\r\nSide Characters:<br>\r\nKaren<br>\r\nJess’s best friend. 6’1. Very tall. Plays Volleyball with Jess.<br>\r\n<br>\r\nLiz<br>\r\nIn the same swim club as Johnny. She likes flirting with him and made moves on him before, even though she knows about him and Jess. 5’7 and great figure due to her enthusiasm in swimming. Wears Thongs.<br>\r\n<br>\r\n<br>\r\nRules:<br>\r\nNew Characters can be Introduced (Only Female)<br>\r\nProper use of Grammar and Spelling<br>\r\nPlease no Chapters involving Cliché such as “I was the one who shrunk you!”<br>\r\nLet Johnny (You) remain unnoticed or recognised as a pitiful bug for some duration please.<br>\r\nNo death of Characters except Johnny.<br>\r\nStick to “You” POV please.<br>\r\n<br>\r\nGood Luck and try not to get Eaten, Sat on, Stepped on, Toyed, Flicked Off, Jarred, Tortured, Spat on, Drowned, Humiliated or Used by your friends...</td>",
        "id":1490038,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1431120780,
        "modified":1431120780,
        "pretty_title":"Diminished Perspective"
    }
}