{
    "chapters":{
        "1":{
            "author_id":"aeroblade",
            "author_name":"Aeroblade",
            "choices":[
                "The Inner Planets",
                "The Outer Planets",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay. First I need to know who you are going to be taking control of.</span></div></span></div>",
            "created":1122872400,
            "id":264693,
            "title":"Who are you?"
        },
        "11":{
            "author_id":"aeroblade",
            "author_name":"Aeroblade",
            "choices":[
                "Usagi",
                "Rei",
                "Ami",
                "Minako",
                "Chibi-Usa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have these choices.</span></div></span></div>",
            "created":1122872400,
            "id":264694,
            "title":"The Inner Planets"
        },
        "115":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "ask mommy to be her baby",
                "continue to dream."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>chibi moon lay on here bed looking at a picture of her mother. \"momy i wander what it would be like to have you in my body as my baby.\" she giggled at the idea.</span></div></span></div>",
            "created":1134968400,
            "id":290776,
            "title":"dreams"
        },
        "1152":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "her mother walks in",
                "hears that there is trouble ad runs out to help."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she continues the dream of it and took a pillow and put it un her dress. giggling. \"oh i'm so big.\" she blushed and luaghed.</span></div></span></div>",
            "created":1134968400,
            "id":290777,
            "title":"silly girl"
        },
        "11522":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "shoves her in her duaghter",
                "starts to shove itself inside her in front of her mother."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>as she got there she saw a massive monster attacking and winning against the scouts. \"mommy.\" she calle dout running to salor moon. the monster noticed her and grabed her and held her leg open as it moved her mothere closer to her.</span></div></span></div>",
            "created":1135044300,
            "id":290778,
            "title":"scared duaghter"
        },
        "115221":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "mommy will be with you alway.",
                "tries to fight it."
            ],
            "content":"<div class=\"\"><div> <span>\"it ok my baby.\" said moon as she was pushed feet first in her duaghters sex ripping her outfit. \"mommy.\" she cried and tried to reach for her as she was beeing stuffed full with her mother. \"shh my baby.\" moon said now up to her knees in her duaghter, the monster just luaghed as it feed moon into her own duaghters womb.</span></div></div>",
            "created":1135044600,
            "id":290779,
            "title":"a childs cry."
        },
        "1152211":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "the monster vanishes and she wakes up in her bed.",
                "the monster finishes and then startes withe other scouts."
            ],
            "content":"<div class=\"\"><div> <span>chibi moon placed her hands on her expanding belly that was being filled with her mother. \"mommy me love you.\" she said as moon was up to her brest inside her baby girl. \" i know my baby. i know please take good care of me.\" sae said sheding a tear. \" i will mommy.\" chibi said reaching for moons hands.</span></div></div>",
            "created":1135045080,
            "id":290780,
            "title":"a mothers last hug"
        },
        "11522111":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "\"i will ttake good care of you mommy",
                "\"mommy i will find a way to get you out."
            ],
            "content":"<div class=\"\"><div> <span>chibi moon woke up in bed and looked around and every thing seemed normal till she tried to sit up. she looked at her belly and started to cry it wasn't a nightmare her mother was now her baby. \"mommy?\" she said rubbing her nine month belly. there was a light kick as her answer.</span></div></div>",
            "created":1136011320,
            "id":292798,
            "title":"a nightmare?"
        },
        "11522112":{
            "author_name":"podster",
            "choices":[
                "the monster goes after some more scouts",
                "the monster leaves"
            ],
            "content":"<div class=\"\"><div> <span>as chibi moon was about to grab hold of her mothers hands the monster pushed her mothers head past her sex lips cauing chibi to let out a hearty moan.<br>\r\n\"by mommy i will take good care of you\" she said<br>\r\nas the rest of moons arms were slurped up into chibi's<br>\r\nvagina. then the monster looked around for its next victim.</span></div></div>",
            "created":1137981240,
            "id":297676,
            "title":"Chibi's baby"
        },
        "115221121":{
            "choices":[
                "Who does he go after first?",
                "A knock on the door..."
            ],
            "content":"<div class=\"\"><div> <span>The monster was by now quite over joyed with his handy work. He was the Monster of Unbirth. He came to this dimension every thousand or so years to create a queen. Chibi moon was to be that queen. First though, he needed to stuff her with servents or else she couldn't claim her throne. Now, no ordinary person would do, you see. If one is to enter another's womb, they should at least know each other, right? Of course! Fortunatly, in reading Moon's mind, The Monster had discovered the Location of Moon's closest friends, The Sailor Scouts...</span></div></div>",
            "created":1153763820,
            "id":334156,
            "title":"The Unbirth Monster."
        },
        "1152211211":{
            "author_id":"unsnik",
            "author_name":"unsnik",
            "choices":[
                "Finishes pushing Murcury's body inside chibi",
                "another scout tries to pull her free"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The monster reached for Sailor Mercury who was quivering nearby in fear. He quickly stripped her of her clothes and moved her towards Chibi moon. He quickly pushed her head into Chibis' already stretched sex and began to push in the rest of her.</span></div></span></div>",
            "created":1161050460,
            "id":353286,
            "title":"Mercury rising"
        },
        "11522112111":{
            "author_id":"vayachan",
            "author_name":"Vayasil Enkashi",
            "choices":[
                "The monster goes off to hunt for more servants!",
                "Sailor moon seduced Mercury while inside her daughter."
            ],
            "content":"<div class=\"\"><div> <span>Chibi Usa's eyes widened as Mercury's cute face soon found itself pressed agains the child's taut lips. Try as she might to push away from the child's warm, wrapping embrace, Chibi Usa's vulva easily split to accomodate the woman's invasion.<br>\r\n        The scent was overpowering, as was the sweet taste of the girl's femenine oils. Who would have thought this girl could streatch so much? Certainly not innocent Mercury who could not help but squirm when her neck and shoulders popped into the child's lips, dissapearing into a world of embracing darkness.<br>\r\n             Even if he was accustomed to this, seeing this still pleased the Unbirth youma to no end, tentacles writhing behind him as Chibi Usa could not help but look at him lustily as he fed her mother's good friend into her devouring cunny. \"Why are you doing this to me?\" she asked, to which the monster responded by shoving a tentacle down the girl's throat, streatching her mouth open as he began to pump juices into her body, making her squirm and whimper, trying to fight it, her gorged belly soon accepting Mercury's smoothe, cute belly, beginning to streatch further to accomodate her hips.<br>\r\n          \"Soon, my future queen... you'll rule the world at my side... all shall be your children... and call you mother.... does that sound so bad?\" he hissed seductively, feeling this girl changing around his sensitive tentacle, her insides warping and changing as her eyes fluttered...<br>\r\n            Strangely, this... began to feel very good... she could feel her womb overtaking her other insides... but she was surviving this somehow, elevating her pleasure, making her flesh elastic and soft. Groaning in pleasure, she jolted as she buldged even greater, mercury's kicking legs being pushed into her now. Soon, the girl dissapeared entirely into her new mother's body with a sexy slurp, making Chibi Usa coo again and blush brightly. \"That... that felt...\"<br>\r\n<br>\r\n\"Good?\" the monster cooed, licking his lips. \"I know, my sweet... would you like some more?\" he asked, half-commanding. Chibi Usa hesitated then... \"Are they... going to hurt? Will my friends be okay...?\" she asked innocently, sniffling a little behind her gorged belly. the monster could not help but smile. \"Of course they well... for once, they'll be forced to really listen and respect your wishes! You can't pretend you wouldn't like that.\"<br>\r\n<br>\r\nConsidering these things over, Chibi Usa nodded and grinned. \"Alright... lets go find the others!\" she murured, grinning as the monster hefted her onto his back and left Mercury's home in shambles.</span></div></div>",
            "created":1167164940,
            "id":368281,
            "title":"...Traitor?"
        },
        "115221121112":{
            "author_id":"unsnik",
            "author_name":"unsnik",
            "choices":[
                "Goal achieved and they ride to freedom",
                "Explosion... "
            ],
            "content":"<div class=\"\"><div> <span>It is dark within the confines of Chibi's body. Sailor Mercury feels the thing that pushed her inside withdraw and leave her to the soft gentle pressures of this fleshy dark prison. She feels her panic and instinct to struggle subside as the pressure around her seems gives way to a more spacious darkness. <br>\r\n   Mercury feels herself floating in a warm substance.  She can't see what is around her, only feel the warmth and smell the sweet juices around her. Something brushes against her and she turns and feels a hand touch her belly button. There is a sharp pinch and Mercury reaches down to feel something attached itself to her bellybutton.  She realizes it's an umbilical cord that has attached itself to her body and began exchanging her blood for nutrients and oxygen.  The hand that led it to her brushes against her sides followed by a second hand.  She looks straight ahead in the darkness and sees a faint light.  Sailor moon, her hair undone and floating in this shadowy prism that once was Chibi's womb made Sailor moon appear like an angel to Mercury.  She was holding Mercury in her arms, it comforted the frightened Mercury to feel those soft hands touching her oddly sensitive skin. The faint light was Sailor Moon's aura for she had used it to save herself from being absorbed by the contorted monster that was her daughter.  Mercury fell asleep in Sailor Moon's arms.  <br>\r\n     \"Wake up you idiot!\" Mercury jolted out of her sleep, bouncing against the soft inner lining of her womb prison. <br>\r\n     \"What... who.\" was all Mercury could mumble.<br>\r\n      \"It's me Serena, now wake the heck up we gotta do something,\" she heard and annoyed Sailor moon reply.<br>\r\n       \"What in the world can we do now?\" replied sailor mercury.<br>\r\n      \"There is one way out of here... but I need your help,\" replied Sailor Moon.<br>\r\n      \"How can I help?\" Mercury whispered.<br>\r\n      \"We need to cause a contraction and get birthed out of here,\" Sailor Moon replied.<br>\r\n     \"How do we do that?\"<br>\r\n<br>\r\n    Sailor Moon briefly described that the umbilical cords attached their senses to Chibi's senses so what they did Chibi's womb she would feel it twice as much. So if she were to say orgasm, it would contract the walls of the uterus and open a way out for them... There was just one catch... they both had to orgasm to get Chibi to do the same. <br>\r\n<br>\r\nMercury blinked, the best she could in the ooze of the womb, and found herself quite perplexed by this proposition. But before she could ask a question she felt a hand caressing her extra-sensitive skin, up her sides and brushing her chest. Sailor Moon reached out and pulled her friend close so she could better feel what she was trying to do. Every touch felt extra sensitive, it seems the juices of the womb had made their skin extra sensitive to everything including touch.  Holding the slight smaller girl closer to her Sailor Moon held her for a moment, enjoying the mere touch of their bare flesh on flesh.  At first Sailor Mercury tensed in what seemed to be protest but then gave in to the intense feelings of just the mere touch of the soft creamy skin of Sailor moon... Sailor Mercury felt their bodies move together as hands caressed each other's bodies. It was intense the more they moved together the more they touched one another in every place from the breasts to inner thighs... across the regions of their sexes.  It was more intense these touches than anything... Mercury felt she would surely achieve their goal without further assistance... but she knew she had to help Sailor Moon achieve the same state so they could do it together. Sailor Mercury finally moved in synche with Sailor Moon's movements... exploring Sailor Moon's body like an soft warm harp... She wished to play this instrument... She felt an intense feeling arise within her as the biggest orgasm in her life grew to the point... She felt Sailor Moon's body tense under the same pressures... And...<br>\r\n</span></div></div>",
            "created":1180413840,
            "id":411686,
            "title":"It never ends"
        },
        "1152211211122":{
            "author_id":"insightfuleye",
            "author_name":"InsightfulEye",
            "choices":[
                "The youma forces more scouts into Chibi so he power increases.",
                "The scouts inside continue to pleasure each other to no detriment to chibi."
            ],
            "content":"<div class=\"\"><div> <span>Chibi's mind exploded in an extasy greater than anything she had ever known, and the unbirth youma wasn't finished filling her yet. The youma finished  pushing sailor venus into Chibi's rapidly expanding womb, oddly her belly did expand as much as it should have after it contained three teenagers one being her own mother. The next to be taken into Chibi's body was Jupiter.<br>\r\n<br>\r\nJupiters stuggle was mighty, but the immense strength of the scout only served to increase the pleasurable moans of Chibi. While the unbirth Youma seemed to gain in strength as his queen had more powerful people taken into her body and had access to their magic from the connection of Mother and child. Chibi now containing four scouts and having access to thier planetary mantles and the magical howitzer that was Serena was nearing the god like state the youma needed her to be in to be his queen.</span></div></div>",
            "created":1291677420,
            "id":1009617,
            "title":"Explosion... "
        },
        "12":{
            "author_id":"aeroblade",
            "author_name":"Aeroblade",
            "choices":[
                "Michiru",
                "Setsuna",
                "Haruka",
                "Hotaru",
                "Makato"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You now have the following choices.</span></div></span></div>",
            "created":1122872400,
            "id":264695,
            "title":"The Outer Planets"
        },
        "124":{
            "author_id":"arrancarx5",
            "author_name":"Chaos-X",
            "choices":[
                "Sailor Moon/Mini-Moon",
                "Sailor Venus",
                "Sailor Pluto"
            ],
            "content":"<div class=\"\"><div> <span>Hotaru is Busy Studying For a Big Test tomorrow in Science Class...She must Know the Theory &amp; Inner workings of Biology...So Hotaru Gets an Idea to Practice with her Friends...the Other Sailor Scouts! Hotaru Decides to Pack a Small Lunch Just in Case if she should Get hungry during her Studies...She Has 3 Options Ahead of her...Which Scout will Hotaru Visit First?</span></div></div>",
            "created":1198653060,
            "id":479418,
            "title":"Hotaru"
        },
        "13":{
            "author_id":"aeroblade",
            "author_name":"Aeroblade",
            "choices":[
                "Mamoru",
                "Luna",
                "Artemis (Is that right?)",
                "Diana",
                "More (This is where I leave you.)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>THere are probably more.</span></div></span></div>",
            "created":1122872400,
            "id":264696,
            "title":"Others"
        },
        "135":{
            "choices":[
                "The Oppositio Senshi",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of the Oppositio Senshi from \"Another Story\"?</span></div></span></div>",
            "created":1136393280,
            "id":293757,
            "title":"Oppositio Senshi"
        },
        "1351":{
            "choices":[
                "Sin",
                "Next please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Starting off the Oppositio Senshi, do you want to pick Oppositio Moon; Sin?</span></div></span></div>",
            "created":1136393340,
            "id":293758,
            "title":"Sin"
        },
        "13512":{
            "choices":[
                "Anshar",
                "Keep Going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sin's younger brother, Oppositio Senshi of Wind, Anshar? </span></div></span></div>",
            "created":1136393400,
            "id":293759,
            "title":"Anshar"
        },
        "135121":{
            "choices":[
                "Let's go with that!",
                "Your joking right?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Being an unbirthing story, poor Anshar is at a bit of a disadvantage; don't you think? Perhaps, being male, Anshar was not entirally compatable with Senshi powers; forcing Apsu to make a few \"modifications\".</span></div></span></div>",
            "created":1136393700,
            "id":293760,
            "title":"Anshar's Gender"
        }
    },
    "info":{
        "author_id":"aeroblade",
        "author_name":"Aeroblade",
        "brief_description":"Sailor Moon and the scouts unbirthing their friends and family.",
        "created":1122895860,
        "description":"<td align=\"left\" class=\"norm\">Because of the potetial adult content I do not suggest that people who are younger then 18 years of age view this item. I however am not one to talk. Stick to the basic plot of unbirthing and lesbianism please. Thank you and enjoy. Please add if you can as well.</td>",
        "id":996798,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1291677420,
        "modified":1291677420,
        "pretty_title":"Sailor Moon Unbirthing"
    }
}