{
    "chapters":{
        "1":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Grace (School)",
                "Amy and Sarah (Sisters)",
                "Katherine (Mistress)",
                "Reserved",
                "Reserved"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which storyline do you want to go down?</span></div></span></div>",
            "created":1499662800,
            "id":2351214,
            "title":"Storyline"
        },
        "11":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "They could not because Grace had left.",
                "They could not because Grace did not want to see me."
            ],
            "content":"<div class=\"\"><div> <span>The crush of my life was the girl that moved into the house next to mine. I was 8 years old when I first saw Grace; she was not the most beautiful girl and one could even say that she was a bit chubby. Of course, at the time, I did not know that she would become a dream (nightmare).<br>\r\n<br>\r\nIt all started when I was in the fifth grade, 2 years aafter Grace moved into the house next door. We had been friends ever since but I always suspected an alternate motive behind everything she did. It wasn’t until I was 10 years old that it happened. At that point of time, I was one of the taller guys in my class at 5'2\", and Grace finally decided to ask me out near the end of the school year.<br>\r\n<br>\r\nI tried to subtly put her down, but she kept clinging on the me. Eventually, I had to push her aside and tell her that I only saw her as a friend and that I liked the girl named Ashley in my class more. Hearing this, Grace ran off in a storm of fit and screamed that I would regret not accepting her. I tried to chase after her but my crush Ashley came up to me and started to talk to me so I forgot about Grace. One week later, my mom told me to go ask Grace's mom if they would like to go to the beach together. As you go to their house, Grace's mom answered the door. She was a beautiful and 5'7 tall lady who was still in her 20s. Her husband had left because she did not want to get an abortion so she had been raising Grace alone. She was standing in her 3 inch platforms because she was about to leave for work. When she answered the door, I instantly got a boner staring up at the 5'10\" women in heels. When I asked her if they could come to the beach she said that...</span></div></div>",
            "created":1499749200,
            "id":2351379,
            "title":"Grace (School)"
        },
        "111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Start of your 8th grade year",
                "The truth (Dead End)"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm very sorry but Grace has already left for my brother's house. She is going to stay there for 2 years because she got invited to a female athletic sports camp. \"Oh..\" you said, trying to figure out why Grace will ever leave to do something without telling you. As you left Grace's house, time started to pass, eventually you and Ashley started dating. Suddenly, over the summer of your 7th grade year, Ashley passed away, her body was found with her neck snapped and in a river near the local grocery store. She was so full of life why would anyone want to kill her. The police eventually found a suspect by the name of Richard Holmes and all the proof strayed towards him. However, Richard was dead as well with a gun shell in his head. The police eventually ruled it off as a drunk man trying to get some action, but when it failed he went suicidal. No one noticed that Richard was battered and had his neck broken as well. . .</span></div></div>",
            "created":1499749200,
            "id":2351724,
            "title":"She lefted?"
        },
        "1111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Date with Grace",
                "A new girl?"
            ],
            "content":"<div class=\"\"><div> <span>The summer lefted you shocked especially by Ashley's death. You guys had been dating for almost 2 years. On the first day of school, you realized that there was a girl in your homeroom class that you didn't recognize. Also the girl was extremely beautiful and was as tall as you at 5'4\". However, for the entire semester you never brought up the courage to talk to her, but you did catch her sometimes staring at you. Finally during the second semester, you had two classes with her, language arts and science. Somehow, luckily you were her lab partner, but it was pre-assigned and their was only one lab a semester. However, during the 2nd week you finally found out her name when she came to talk to you. <br>\r\n<br>\r\n\"Hey, remember me?\" The girl said; confused, I looked around to make sure no one else was around me. \"Wow, I leave for 2 years and everyone has forgetten about me.\" She said. No way I thought it couldn’t be her but I just had to confirm it. \"Grace?\" I asked her, \"Bingo.\" She said smiling. Grace had changed so much that I didn't even recognize her. \"I heard about what happened to Ashley, it's such a tragedy.\" She said. I was almost over Ashley but the mere thought of her again put me into a depressed mood. From that point on, I was barely paying any attention to Grace. Eventually, she lefted after getting my new number.<br>\r\n<br>\r\n--------------TIME SKIP---------------<br>\r\n<br>\r\n<br>\r\nAt the end of the year, I had grown another inch and was now taller than Grace. Eventually we started dating for the few weeks we had before Grace was to leave for volleyball camp...<br>\r\n<br>\r\n<br>\r\n<br>\r\n***Both of these choices take place near the end of the summer.***</span></div></div>",
            "created":1499749200,
            "id":2351757,
            "title":"Start of your 8th grade year"
        },
        "11111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Go to Winder Park",
                "Emily's walk home ( Dead End )"
            ],
            "content":"<div class=\"\"><div> <span>I was invited by Grace to attend her volleyball banquet, apparently all of her friends were eager to meet me. On the week before school started, I went to the banquet which was suprisingly close to my home. As I walked in I noticed that it was a rather empty place, only the team and  me were there. As I walked into the main hall, all I saw were girls, looking around I couldn't find Grace. <br>\r\n<br>\r\nFinally, I decided to ask one of the girls in the middle of the room who looked like she might be a coach. As I walked up to the girl I noticed that she was probably at least 5'8\" without the heels, but with her platform wedge heels, she was easily 5'10\" or 11\". As I reached up to tap her shoulder, she turned around and to my surprise it was Grace.  \"Oh, hey you made it,\" Grace said towering over me as she grabbed me by the shoulder and introduced me to her friends.<br>\r\n<br>\r\nAs I stared up at Grace who had grown over 4 inches during the summer, I started to feel insecure as I backed away from her. I left the party early without saying good-bye to her. However, on the way home I met Ashley's sister. She was only one year younger than Ashley and they looked nearly the same. I instantly fell in love and we started to set up a date...<br>\r\n<br>\r\n<br>\r\nGrace's POV:<br>\r\n<br>\r\nAs soon as my boyfriend slipped away, I tried to find him but I saw him leaving. I decided to follow him home and surprise him later.. but that all changed. I saw the girl that looked exactly like that slut I had murdered last year. Something in me snapped when I noticed that my boyfriend has not gotten over her yet. Revenge will be mine. I followed the girl home.<br>\r\n<br>\r\n<br>\r\nMy POV:<br>\r\n<br>\r\nAs I got home I quickly texted Emily to ask her when she would want to go on a date. She told me to meet her at Winder Park.<br>\r\n</span></div></div>",
            "created":1499835600,
            "id":2351908,
            "title":"Date with Grace"
        },
        "111111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Screw it, have the best of both worlds",
                "Choose Grace",
                "Choose Emily"
            ],
            "content":"<div class=\"\"><div> <span>Wow! I thought, our first date already and it hadn't even been a hour. But then numerous thoughts went through my head. \"What will Grace think? How am I going to break up with her?\" I thought that I was in love with Grace and wasn't going to cheat on her but Ashley was my first crush. </span></div></div>",
            "created":1499835600,
            "id":2352157,
            "title":"Decision"
        },
        "1111111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Ignore her and try to walk away, pretend you didn't see her.",
                "Answer her honestly",
                "Answer her dishonestly"
            ],
            "content":"<div class=\"\"><div> <span>\"Screw it.\" You thought as you ran to the park, I'll just have to balance out the time you spent with both of them and hope they don't find out. As you walked to Winder Park, you thought about what might actually happen if they did find out, but you dismissed it as only you being lefted single.<br>\r\n<br>\r\nWhen you got to Winder Park, you decided to sit down at one of your favorite benches in the park. As you sat down, the worst possible thing that could happen, happened. You saw Grace strolling throuh the park still in the same outfit from the banquet that you ditched her at. She saw you and walked up towards you and asked \"Hey, what are you doing here?\" She smiled.</span></div></div>",
            "created":1499892120,
            "id":2352187,
            "title":"Behind each's back"
        },
        "11111111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>As you quickly got up and walked away from her you decided to go home, Emily probably forgot to specify a time. \"Of course,\" you thought it is on the opposite side of the town for her house. As you were about to exit the park, you heard your phone vibranting as you pulled it out to check.<br>\r\n<br>\r\nIt was a text message from Emily that asked me where I was. I quickly replied that I was leaving because I thought that I was there on the wrong day. Emily told me that she was at some sort of bathroom area and that she was lost, i knew exactly where she was because I had gotten lost there with Grace a couple of times as children. I texted that I will be right there and ran towards the bathroom. But I hadn't ran more than 30 seconds when I got another text, it was from Grace. I decided to ignore it for now and pretend later on that my phone had died.<br>\r\n<br>\r\nAs I got to the bathroom area, I noticed that Emily wasn’t any where to be seen. As I pulled out my phone to text her I heard her ringtone in the bathroom. As she texted me back and told me to meet her inside the bathroom, I got excited and thought that I was about to get some already. It was pretty late and there was no one in the park. I quickly ran in to the bathroom, the only stall that was occupied was the handicapped one and as I opened the door.. I saw Emily.<br>\r\n<br>\r\nShe was not moving and she looked seriously hurt. As I looked around I thought that there might have been a rapist or serial killer around. I quickly grabbed my phone but noticed that it wasn't there. As I suddenly realized that my phone had fallen out of my pocket in my excitement. I quickly ran out the stall and grabbed my phone to go outside to call the police. As I was running out I suddenly bumped into a large object and fell down. \"Oh no,\" I thought, \"it's the murderer.\" <br>\r\n<br>\r\nAs I fell to my butt and looked up I saw a pair of heels and my heart rose, it might not have been the rapist but as I looked up I saw Grace with her arms crossing glaring down at me. \"What are you doing here?\" Grace hissed. I dropped my phone and told her what happened but she ignored me and just said so you were cheating on me. I realized the situation I was in and knew that I had to call the police before the killer actually came back.<br>\r\n<br>\r\nI quickly grabbed my phone and started to type in 911 but Grace grabbed my phone and crushed it... What the.. how was she so strong I thought as Grace squatted down and said \"You're dead.\" She flicked my in the forehead and sent me flying down the bathroom until I hit the opposite wall. As I sat there motionless Grace walked into the stall and grabbed Emily and brought her in front of me. As she held Emily in a reverse choke lift with one arm she used her other hand to lift me up too in a throatlift. \"Here this is what you wanted right,\" Grace screamed as she forced me towards Emily and made contact.<br>\r\n<br>\r\nAt this point Grace was insane as she threw Emily back into the stall and lifted me higher on the wall as she repeatedly smashed my head until I died.</span></div></div>",
            "created":1499964900,
            "id":2352546,
            "title":"Ignore her"
        },
        "11111112":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>\"Well, Grace the truth is I love another person, but I also love you.\" I said. Instantly, Grace demeanor changed as her face turned dark. As I kept talking about how I couldn’t decide whether to choose her or Emily. At this point, Grace was furious as she snapped and slapped me so hard that my face was destroyed instantly. Not knowing what happened I laid there more than 10 feet away from my starting location dazed. As Grace walked up she spit on me as she lifted me up and threw me into a nearby tree to die.</span></div></div>",
            "created":1499963340,
            "id":2352539,
            "title":"Honesty"
        },
        "11111113":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>\"Hey, what are you doing here?\" Grace asked. I answered that I was hoping to see her here. Grace smiled and sat down next to me. As I looked towards her I could visibly see that she was taller than me. As shd caught me staring at her she asked if I would like to sit on her lap.<br>\r\n<br>\r\nTrying to please her to get her to quickly leave I said sure and got up and sat on her soft lap. As soon as I sat down I realized that my feet couldn't touch the ground she was just so much taller than me. After a while I told her that i had to go. As I tried to jump off her lap her hands cupped my chin and she wrapped her arms around me and whispered \"Still lying to me, huh?\" as she increased the pressure. I tried to break free but it was no use.<br>\r\n<br>\r\nSuddenly she stood up bringing me with her. As I was held in a reverse throatlift dangling a couple of inches off the hround. \"You lied to me, you just didn't want to see me.\" She hissed in my ear at this point I was flailing and thrashing trying to get free but her choke was just too strong. I was passing out fast with one last effort I managed to break out of her hold. However, it felt too easy but I dismissed it in the heat of the moment.<br>\r\n<br>\r\nAs I fell to the ground trying to catch my breath I was once again sent flying by a kick in the stomach. I flew backwards and rolled over 20 feet backwards. It was over for me as I tried to crawled away but Grace was right behind me as she grabbed the back collar of my shirt, picked me up and slammed me to the ground again and again until I died.</span></div></div>",
            "created":1499895600,
            "id":2352210,
            "title":"Liar"
        },
        "1111112":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Girl's Locker Room",
                "Pre-Sports Meeting Room"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm...\" I thought, \"Am i really in love with Emily or was it just a way to try to regain my lost love?\" Eventually, the more I thought about it the more that I saw that I shouldn't be too hasty to fall in love with Emily. So I decided to text back to Emily \"I'm sorry, but I cannot be your boyfriend, I already have a girlfriend.\" I waited for a while but never got a response from Emily. I thought that she must have been really upset with me. <br>\r\n<br>\r\nThe rest of the summer past fast and I didn't see Grace because I was busy hoping to finish my summer homework. However, near the end of the summer, I heard on the news that a girl had been missing for a while now. It was Emily. The last time she was seen was when they saw her with me. I was arrested and put into juvenile hall for the kidnapping of Emily. They never found her body.<br>\r\n<br>\r\nAt that point, I was locked away for quite a while before new evidence arose and showed that I was at least not guilty of the crime. Luckily, I was able to keep up with my studies and I was able to stay on track to go to highschool. When I returned I realized that I no longer had any friends no one wanted to hang out with a potential criminal and I was pushed away to the corner.<br>\r\n<br>\r\nI hadn't seen Grace in a while so I decided to text her to ask her to meet me at the local pond where we always used to hang out. When I arrived the next day and stood waiting for Grace to come I saw a beautiful tall girl who had to have been almost 6 feet tall. She saw me and started walking towards me, I couldn't believe it, it was Grace. When she saw me, she realized that the top of my head didn't even come up to her mouth.<br>\r\n<br>\r\nAs she stared down at me towering, she said \"Sorry, but you're just too short for me now,\" as she walked away. 3 days later, at school I was being chased by a couple of jocks who thought that I was out to do no good. In a split decision, I realized that I was trapped and there was only two rooms to go into.</span></div></div>",
            "created":1499987580,
            "id":2352770,
            "title":"Choose Grace"
        },
        "11111121":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Kiss her feet",
                "Use this chance to run away"
            ],
            "content":"<div class=\"\"><div> <span>\"Screw it, they will never look for me in the girls locker room.\" As I ran into the girl's locker room I realized that my reputation will be ruined from this day forward and will forever be known as a pervert. \"What are you doing here, you pervert?\" A female voice behind me asked. Recognizing the voice, I turned around and saw that it was Grace. I started to back up with my voice stammering I said \"Well, I went the wrong way.\" With that Grace walked up to me, towering over me she cornered me to a locker and said \"You used to be so cute and now you are just a perverted criminal,\" Grace said slapping me across the cheek back and forth.<br>\r\n<br>\r\n\"I'm so sorry,\" I cried as the towering girl grabbed me by my throat and lifted me up against the locker. As I was held in the air dangling, I looked down at Grace she was just so beautiful. Finally she dropped me to the ground just as I was about to pass out. She then sat down and crossed her long legs. <br>\r\n</span></div></div>",
            "created":1500051420,
            "id":2353106,
            "title":"Girl's Locker Room"
        },
        "111111211":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Slave to Grace",
                "Dead to Grace"
            ],
            "content":"<div class=\"\"><div> <span>Crying in pain, you slowly started to crawl towards Grace's feet. As you reached her you tried to grab her feet to kiss them. \"Don't touch me you disgusting shit,\" Grace said as she snapped her foot into my face sending me backwards. The kick was enough to knock me out as I blacked out I saw Grace walking up to me.</span></div></div>",
            "created":1500310500,
            "id":2354980,
            "title":"Kiss her feet"
        },
        "1111112111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Initiate the Escape Plan",
                "Crawl up to Grace",
                "Boyfriend (Dead End)"
            ],
            "content":"<div class=\"\"><div> <span>When you woke up, the first thing you noticed was that you were in a unfamiliar room. There were a bunch of other guys in the room too. As you sat up one of them walked towards you and asked what did you do to get here. Still groggy, you don't know what he is even talking about. At that moment, Grace walks in and yells #2, the guy you were just talking to quickly scurried up to the towering women. He wasn't a short guy at all maybe even average but in her heels, Grace absolutely towered over him.<br>\r\n<br>\r\n\"Teach that new little shit how things work around here,\" Grace said as she grabbed the guys by the face and lifted him into the air, \"Or else you'll be the one that gets punished.\" The guy was having his face crushed while dangling in the air. Finally, Grace threw him at me and walked out.<br>\r\n<br>\r\nAs I learned that every one of these guys were here because they either displeased or pissed off Grace and she beat them up. \"Why don’t you guys rebel?\" I asked them and it turns out they never had the balls to do it because they were scared. Through my planning we eventually decided that on my signal we will not return to Grace's home but instead trap her and beat her up then escape.<br>\r\n<br>\r\nOne day Grace came home extremely pissed off and we heard her yelling at someone we assumed to be her boyfriend. As we heard a couple of slams and loud smacking sounds it stopped. Then Grace walked in and sat at her throne. We knew that we were supposed to crawl up one by one and worship her feet. As the first guy went up he started to kiss her feet but after about 15 seconds, Grace snapped her foot and kicked him backwards flying. \"Wow,\" Grace growls as she got up and grabbed the guy she just kicked by the throat and lifted him into the air, \" you guys really are just useless shits huh,\" as she choked out the guy.<br>\r\n<br>\r\nAt this point, I realized that she was emotionally unstable and that we could easily take her if we wanted to, but something also told me that the boyfriend that dumped her wasn't any thing important to her.</span></div></div>",
            "created":1500563400,
            "id":2356586,
            "title":"Slave to Grace"
        },
        "11111121111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Kneel down, it's over",
                "There is still a chance "
            ],
            "content":"<div class=\"\"><div> <span>As the next guy crawl up, I quickly gestured that it was time to rally and fight back. As we agreed, we all stood up and started to walk out of the room. \"Stop!\" Grace yelled but we ignored thinking the 12 of us could take her.<br>\r\nAs we reached the door, we tried opening it but the door was jammed. There was no lock on it. With that, Grace started to walk up to us. We quickly formed a group thinking that we could fight in numbers. As the towering woman walked up, she did a spinning roundhouse kick and knocked the first layer of us back into the second layer.<br>\r\n<br>\r\nThe only thing that stopped us from all flying away was the wall behind us. How the fuck was she so strong? I wondered. \"Kneel!\" Grace yelled.<br>\r\n<br>\r\n</span></div></div>",
            "created":1500656880,
            "id":2357169,
            "title":"Escape Time"
        },
        "111111211111":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>She broke me, it was over, I quickly kneel down and started to beg. The other guys quickly did the same too. As Grace squatted down and grasped one of the guys who was crying by the chin and asked him \"Who planned this?\" The guy didn't said so Grace stood up bringing him with her lifting him up.<br>\r\n<br>\r\nAs she held him the air the with her hand, she punched him again and again. Finally, he wasn't able to take it anymore as she dropped him to the ground. She kicked his limp body aside sending it rolling. The sexily walked up to the next guy and once again squatted down and asked him. He didn’t betrayed me so Grace lifted him too but this time she just held him there as she went to grab another guy.<br>\r\n<br>\r\nHolding both of them in the air, she crashed them together. After a couple of hits, she threw both of them backwards towards the other side of the room. Now she was pissed as she walked up to the next guy and straight up axe kicked him to death. At this point, all the guys in the group cowered and quickly pointed their fingers at me. Grace breathing heavily glared at me and using one finger she signaled for me to come to her.<br>\r\n<br>\r\nAs I crawled towards her I realized that I was going to die. How did it come to this... I decided that their was still a chance, I quickly crawled up and started to kiss her toes. I didn't stop until Grace told me to stop. I looked up at her she was calm or so I thought as she stomped her heels down on me. Again and again, she stomped me until I was crushed into smithereens.</span></div></div>",
            "created":1500657480,
            "id":2357173,
            "title":"Kneel down, it's over"
        },
        "111111211112":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>\"Everyone\" I yelled \"we still have a chance to escape.\" However, my words fell on deaf ears as I saw nearly all of them kneel down. Grace smiled and looked at the rest of us who were still challenging her. There was only three of us now as we formed a triangle around her.<br>\r\n<br>\r\nOn three, we attacked as I saw the two guys in front of her get lifted by Grace one in each hand. As I ran towards her, I saw the opening, this was our chance I thought, but her heel came up in an arc and lifted me up too and sent me flying into the air with her kick. As she turned the other guys around, she grabbed me too and held all three of us with her back arm around us. <br>\r\n<br>\r\nWe tried kicking and fidgeting back Grace didn't feel it at all. We were done for. As she started to crush our throats, tears started streaming down my eyes. How did this happen? Why? As I saw the two guys next to me fell limp and not breathing I realize my time was over. As Grace dropped the other two she put me back to the ground. As she tilted my chin to look up at her towering self, she spat on me. As I wiped it off she punched me towards the wall where I fell down unable to stand.<br>\r\n<br>\r\n\"You guys back there watch, this guy used to be my boyfriend. This is something you will never experience again\" Grace said to me as she lifted her knee to my balls  and lifted me up with only her thigh. With my dick on her muscular knees, I instantly got an erection as Grace lifted me up to her face level, she kissed me passionately while rubbing my dick back and forth with her knee. After not even a minute, I cummed in my pants and Grace slammed her knee into my balls crushing them. As I fell to the ground in a motionless state in pain, Grace walked away.</span></div></div>",
            "created":1500742800,
            "id":2357684,
            "title":"There is still a chance "
        },
        "11111121112":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>After watching her crush those guys throat like it was nothing, I suddenly lost my nerves and starting shaking. This girl was a monster I thought as I crawled up to her. I quickly planted a couple of kisses on her toes but she kicked me away. As I lay there stunned in pain Grace walked up to me and started to smother my face with her feet. As her soles crushed me, I continued to lick her feet trying to please her. Eventually, Grace let up as she lifted me up and placed me on her thigh. I realized that I was the only one left in the room.<br>\r\n<br>\r\n\"Mmm, you did a very good job,\" Grace said as she rubbed my dick with her thigh while cupping my chin. As I cummed in my pants Grace let me down and walked out of the room and the worst was over. That night I woke up dangling in the air by Grace's hand.  </span></div></div>",
            "created":1501777380,
            "id":2363917,
            "title":"Crawl up to Grace"
        },
        "11111121113":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>Mike's POV:<br>\r\n<br>\r\n\"Hey, dude I saw your girl Grace with a couple of other guys,\" Tom said as he pulled out his phone to show his best friend the pictures. They all showed Grace with other guys. \"Wow,\" you thought, \"screw that hoe.\" You figured you were going to break up with her anyways. At 5'10\", she was a inch taller than me and the fact that she always wore heels did not help either, and there was a different girl that you liked, a petite cheerleader.<br>\r\n<br>\r\nAs you called Grace to ask if you guys could meet up, she told you to come to her house. Once you arrived, you walked in to see Grace sitting on a throne of a sort with her legs crossed. Although you found her pose extremely arousing, you knew that you had to get revenge.<br>\r\n<br>\r\n\"Hey, you slut, I am breaking up with you,\" you said with a sneer. \"What?\" Grace replied. The words had so much authority that you found yourself answering her. After you told her everything, you left her in tears and turned around to walk away but as you were almost at the door, you heard the click of high heels as you were grabbed by the back of the head and smashed into the ground.<br>\r\n<br>\r\nWhen you woke up, you looked up dazily to see where you were. It was a large room with only a chair in it. As you explored the room, you heard the door open as Grace walked in and locked the door. She was wearing 8 inch stripper heels as she sat at her throne and pointed down at her feet. \"Fuck you bitch,\" you spat as you tried to punch her. Crack, Grace stood up and you punched her right in her hard stomach.<br>\r\n<br>\r\nAs she stared down at you, you realized that you had to run, this girl wasn't a human. As you turned around to run, she grabbed you by the back collar and threw you into the air. As you bounced off the roof and landed at her heels, she smashed them down on your arms breaking them. In tears, you try to crawl away, but Grace grabbed you by the balls and lifted you up. As she started fondling them skillfully while holding me in the air. After a few minutes, Grace carried you out by the balls and threw me into her basement to die.</span></div></div>",
            "created":1500623160,
            "id":2357034,
            "title":"Boyfriend (Dead End)"
        },
        "1111112112":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>I woke up and found myself swinging back and forth. I looked up and saw a giantess. It was Grace and I was on her foot as she dangled her crossed legs. She looked down and I suddenly felt myself flying to the ground as she lifted her sexy huge feet and started to crush me again and again.<br>\r\n<br>\r\nI snapped awake it was only a dream I realized but as I tried to get my footing I realized that I could not. \"Oh, you are awake now\" Grace said \"welcome back weakling.\" I realized that Grace's sexy feet were cupping my face and lifting me in the air. As she squeezed my face with her feet silencing my muffling, she started to swing me around with just her feet holding my face and threw me across the room. As i felt myself airborne I crashed into the lockers. <br>\r\n<br>\r\nGrace walks up to me and starts to smother my face with her sexy soles as I slowly start to pass out, I tried to run away but it was no use, her one sexy foot was stronger than my entire body. Then she sat down and her foot clutched my balls and she lifted me into the air. Because her legs were so much longer than mine I was dangling in the air as she gave me an aerial footjob. <br>\r\n<br>\r\n\"Does it feel good?\" Grace asked as she rubbed my dick and I cummed multiple times.</span></div></div>",
            "created":1526924040,
            "id":2496592,
            "title":"Dead to Grace"
        },
        "1111113":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Run for the door",
                "Beg for forgiveness"
            ],
            "content":"<div class=\"\"><div> <span>As I thought about it, I realized that the one I truly loved was Emily. So there I decided to start walking towards Winder Park while texting Grace and telling her that I wanted to break up with her. <br>\r\n<br>\r\nThe walk to Winder Park wasn't long, in fact it was awfully close to my house. I wondered why Emily would choose this location; because I could have swore that her house was on the other side of town. I decided to ignore this fact.<br>\r\n<br>\r\nAs I walked through the park I realized that i did not know where exactly in the park we were supposed to meet. I decided to call her. As I dialed her number, I heard the ringtone behind me as suddenly I got hit in the back of the head. As I feel down to the ground thinking I got jumped, all I saw was Grace standing there. Was it my imagination? I wondered as I blacked out..<br>\r\n<br>\r\nWhen I woke up I was in someones bedroom. As I opened my eyes bigger and looked around I realized that I was in Grace's bedroom. Nothing had changed at all since the last time I visited so many years ago. I realized that somehow I had gotten here. As I sat up slowly and got off the ground I decided to walk around the room a little. After a while, the door opened and Grace walked in. As I turned around to look at the towering girl, she asked me \"Why? Why did you break up with me?\" <br>\r\n<br>\r\nI couldn't answer but something told me that this girl had snapped. She was probably the one who had knocked me out in the park. But how did she carried me here? I wondered. It was then that I found out as Grace walked up to me and slapped me around the face sending me flying to the ground. \"Why? \" Grace screamed as she walked up to me pulling me up by the collar and lifting me to my feet. As I tried to run the opposite way she pulled me back and slapped my other cheek with an exploding slap and sent me flying to the ground again.<br>\r\n<br>\r\nAt this point, I knew I had to fight back or I wasn’t going to mke it out of here. So I quickly got up and ran at her and managed to tackle her to the ground. I hadn't been the most athletic guy but I managed to do it. It was then that Grace kicked me in the stomach with both of her heels and sent me flying a couple of feet backwards. Damn how was she so strong. <br>\r\n<br>\r\nWith the wind knocked out of me, I wasn’t able to move as Grace walked up to me and grabbed my throat and lifted me to her eye level with her heels on about 6 inches off the ground. \"How dare you treat me like this?\" Grace said as she extended her arm and lifted me higher into the air, \"How dare you break up with me through a text message?\" Then she threw me 10 feet across the room. Luckily, I landed on her bed. As I recovered my breath, I knew that it was over for me unless I ran or begged for my life.</span></div></div>",
            "created":1499835600,
            "id":2352163,
            "title":"Choose Emily"
        },
        "11111131":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>You quickly got your nerve ready as you ran towards the door. Grace was on the opposite side of the room so you managed to make it out of the room. But as you ran towards the door you realized that Grace was gone. As you turned around to look for her suddenly she pounced. She uppercutted you with a kick that sent you flying into the air and breaking your jaw. <br>\r\n<br>\r\nAs you fell down from the air she grabbed you by the throat and crushed it. You dangled there spitting out blood as she held you. You started passing out but not before you heard some last words \"You should've never cheated on me.\"</span></div></div>",
            "created":1499835600,
            "id":2352185,
            "title":"Run for the door"
        },
        "11111132":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Taxi Driver's death (Dead End)"
            ],
            "content":"<div class=\"\"><div> <span>You quickly got off the bed and got onto your knees and started to beg. \"I'm sorry Grace, I'll never do it again.\" I cried, but Grace simply stared at me with cold eyes as she walked up to me and flicked me in the forehead knocked me 2 feet backwards as I slid on her bedroom floor. \"Please!\" I begged, \" I will never do it again,\" I said as I crawled to her heeled feet and started kissing her toes. After a few minutes, I looked up at her and it seemed like she had calmed down. I quickly kissed each toe again before standing up. As I stood in front of her I looked up at her, she smiled down at me and said that she forgived me. <br>\r\n<br>\r\nI walked out of her house with a couple of bruises but alive. However, it was all a trick I knew that kissing her toes wouk<br>\r\nd give her some sense of dominance and that she had won. Instead of running home next door, I decided to go into Winder Park while texting Emily \"Where are you?\" As I sat down on a bench to catch my breath and after 5 minutes she texted back, \"I see you I'm coming.\" You started getting excited. As you heard the click of heels walking you looked towards your left and saw Grace.<br>\r\n<br>\r\n\"Oh shit!\" You thought as you got up and started running. As you looked behind you saw that Grace aas still keeping up with you even though you were running in sneakers and she was in heels. As you were almost out of the park, you turned around and Grace was behind you as she grabbed you by the back of the neck and lifted you into the air. With great fury she slammed you to the ground. Dazed, you couldn't move as Grace stomp on you all over your body.<br>\r\n<br>\r\nAs Grace turned your body to a mess, you couldn't do anything except wonder why she had Emily's phone. Eventually, Grace stopped and she throat lifted you and carried you back to her house where she threw you into the basement of her house. Near death and fading fast, you looked around and and saw Emily fainted and the battered still body of what seemed to be a taxi driver...</span></div></div>",
            "created":1499835600,
            "id":2352178,
            "title":"Beg "
        },
        "111111321":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>Taxi Driver's POV:<br>\r\n<br>\r\nAfter I saw the girl beat up and kill the potential rapist, I waa terrified but i couldn’t drive away. I was mesmerized by the way she easily managed to manhandle the guy. But when I saw her kill the other girl for some reason I decided that I was going to run away right there. But the girl quickly ran to my car and pulled me out of it. As she lifted me into the air as well she asked me if I was going to tell anyone what happened here. I quickly shook my head no. She smiled and dropped me to the ground. <br>\r\n<br>\r\nThat night as I got home and laid to sleep all I could see was the girl easily lifting me into the air. Around midnight, I heard a loud bang down in my kitchen. As I got up to go check, all I saw was a streak when I was smacked to the ground by a fist. As I laid there dazed the lights turned on and I saw that it was the girl. She quickly throatlifted me and carried me out of her house. She held me in the air while she carried me to her house.<br>\r\n<br>\r\nWhen we got there she wasn't even tired as she lifted me up and hanged me on a wodden pole. Then she said \"You're not going to live, I can't take the risk of you telling anyone.\" As she pelted my body with strong punches. I had turned into a living punching bag by this middle schooler girl.<br>\r\n<br>\r\nEverydsy she would come down and tell me about her old crush who she met at school that day and what happened while punching me to mush. Eventually, one day she came home mad. She was back from a volleyball banquet and she was carrying an unconscious girl. As she threw that girl to the corner, she walked up to me and cup my chin<br>\r\n She was now the same height as me dangling off the ground by the wodden pole in her heels. She said good-bye as she used her other hand to punch me rapidly fast in in the face as she punched me I blacked out and said my final prayers...</span></div></div>",
            "created":1499835600,
            "id":2352181,
            "title":"What happened to the taxi driver?"
        },
        "111112":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>Emily's POV:<br>\r\n<br>\r\nAs I walked towards my home I decided to stop by Winder Park, even though the park was on the opposite side of the city. As I slowly walked up to one of the swings, I heard some footsteps behind me. When I was about to turn around I was grabbed around my throat and lifted into the air dangling. Kicking my legs trying to get free, I turned around and saw a beautiful girl, I recognized her instantly I had seen her around school. It was Grace. As I tried to scream her hands wrapped around my mouth and nose and I blacked out.<br>\r\n<br>\r\nI woke up a few hours later, Grace was in the room as well with my phone.. she was texting someone.. who could it be I thought as I suddenly coughed. \"Oh you're awake faster than I thought,\" Grace smiled as she strutted up, she was still in the same outfit from the park. She was much taller than my petite self at 4'11\". \"Here,\" Grace said as she grabbed me by my throat, \"come up here to talk.\" Grace lifted me almost a feet into the air by my throat. As I was in the air, Grace said that she was going to trap her boyfriend because she knew he was going to cheat on her. She smirked as she lifted me higher by extending her arm.<br>\r\n<br>\r\n\"Now be quiet now,\" Grace said as she started to put pressure on my windpipes. Soon they were crushed as I was stuck in the air kicking my legs. Grace threw me to the corner of the room and walked out. \"Have fun.\" She said cheerfully. I laid there and passed out...<br>\r\n</span></div></div>",
            "created":1499835600,
            "id":2351916,
            "title":"Emily's walk home ( Dead End )"
        },
        "1112":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "content":"<div class=\"\"><div> <span>Richard's POV:<br>\r\n<br>\r\n\"YOU'RE FIRED,\"  he spat at Richard. This all started because Brian decided to switch the boss' sandwich with another one that had chili pepper in it. They were both fired that day and they decided to go to the local bar to get drunk and just forget everything that had happened.<br>\r\n<br>\r\nIt was all going well, they drank for 3 hours straight from 7 to 10. Brian decided to leave early and Richard stayed their for a couple more minutes before getting kicked out by the bartender for \"being too drunk.\" It eventually got violent and Richard was escorted out by the bar guards.<br>\r\n<br>\r\nRichard was having a really bad day so he went to his car and pulled out his pistol from the glove box. He was going to go rob the place. However, across the street Richard saw a young lady who couldn't have been more than a middle schooler walking home at night. In his drunk persona, Richard quickly ran over to try and hit on the girl. After some pestering, the girl eventually started to run. Richard quickly chased after her and caught her.<br>\r\n<br>\r\n\"Ahhh, the perfect scene the forced sex by the river.\" Richard thought. As he bent down to pull his pants off, suddenly a bright light shined on him. Another girl had gotten out of the back of a taxi. She was also beautiful just like the girl on the ground but she was much taller, at about 5'4\".<br>\r\n<br>\r\n\"Let her go,\" the new girl growled. \"Why dontcha make me,\" Richard sneered as he continued. Suddenly he went a jerking motion on the back of his shirt. He was airborne as he was sent flying over the bridge bars dangling for his life. The girl had just lifted him like he was nothing more than a feather. With that Richard tried to pull out his gun but it was no use, the girl saw it and grabbed it from him.<br>\r\n<br>\r\nThe girl stuck the gun at Richard's headand snapped Richard's neck before putting a bullet through his head. Then she dropped him into the river. \"Thank you for saving me!\" The girl on the floor exclaimed. As the saver girl took a closer look at the girl she realized that it was Ashley from her class back in elementary school. \"Well hello Ashley, the slut, I didn't think I could have my revenge so fa st. \" Almost simultaneously Ashley realized that the girl was Grace. \"This is for stealing my boyfriend.\" Grace said as she lifted Ashley into the air, broke her neck and threw her 10 feet into the air where Ashley fell down into the river and died...</span></div></div>",
            "created":1499749200,
            "id":2351739,
            "title":"What really happened..."
        },
        "13":{
            "author_id":"andygao6",
            "author_name":" AndyLORZ",
            "choices":[
                "Kneel Down",
                "\"What?\"",
                "Walk Away"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah!\" I thought, \"I am finally done with school.\" With dozens of job offers flowing in, I knew that my future was set for me. As I looked through the offers, one of them particularly caught my eye. It was a job that was only open to guys that were below average height. As I looked at the offer, that one fact intrigued me. The payment for the job was amazing, there was no paycheck but rather a success track. If we made it through the job properly, we would get massive compensation in the form of a fully paid 2 million dollar house, 3 cars, and a hundred million dollar. Although I had the sneaking feeling that it was too good to be true, I decided to give it a chance and meet at the local bar for the initial meeting that night.<br>\r\n<br>\r\n3 hours later, I walked into the bar and looked around, and it seemed that there were not much people there. I guessed like me a lot of people thought that it was too good to be true. As I looked around, there couldn't have been more than 30 people there. Out of the whole group, there was only one girl who was sitting in the corner of the room. She was amazingly sexy with her long legs and short dress. I knew that I would probably have no chance with her so I didn't even try. Although, out of the corner of my eye, I kept spying on her and seeing her reject all the guys that tried to hit on her.<br>\r\n<br>\r\n\"Ahem, may I have your attention,\" I heard a voice from the center of the room, \"it was a man.\" We all looked towards him as he introduced him. It turns out that he was retiring and the family needed a new butler, and the girl that was sitting in the corner happened to be the eldest daughter of the family. The new butler's task will be to guide the girl and may eventually be allowed to marry her if deemed worthy and in term inherit the family's fortune. Upon hearing this, the majority of the guys in the group starting cheering and started screaming out questions like \"What do we have to do?\" and \"How do we apply?\" Although there was also a couple of skeptical guys who were wondering if this was legit. At that the butler handed each of us a stack of hundred dollar bills. We were then told to leave and meet at their mansion 3 days from now after we had enough time to verify if the money was real..<br>\r\n<br>\r\n<br>\r\nButler's POV:<br>\r\n<br>\r\n\"Okay, Miss Katherine I have done exactly as you told me,\" the butler said. \"Good,\" Katherine replied \"I heard all of it myself, now we will see which one of these males will be a proper slave replacement for you my dear butler,\" as Katherine stood up towering over the butler's measly 5'7\". \"I guess it is good-bye for you then,\" Katherine said regretfully as she walked out of the bar leaving the man behind. \"Yes, it will be,\" the man said as he walked towards Euturn Bridge.<br>\r\n<br>\r\nYour POV:<br>\r\n<br>\r\nThe next day you walked to the bank to see if the money was real and it turned out it was. After answering some questions from the bank teller asking you where you got the money and how, you were set free to return home. Three days later you got ready to go to the mansion, you knew that you would have to put up a proper act if you were going to succeed at gaining the job. When you arrived at the mansion, you noticed the signs that pointed towards the interview room, as you followed them towards the room you noticed the line of people waiting to get in. Finally, it was your turn to enter, you were the last one. As soon as you walked through the doors all you saw was the girl from the other day sitting on a throne of a sort with her legs crossed. \"Kneel.\" the girl said emotionlessly.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1500700200,
            "id":2357491,
            "title":"Katherine (Mistress)"
        }
    },
    "info":{
        "author_id":"andygao6",
        "author_name":" AndyLORZ",
        "brief_description":"Girls in this story are taller and stronger than the guys. They love to humilate men.",
        "created":1499748420,
        "description":"<td align=\"left\" class=\"norm\">The story takes place in a unnamed town. <br>\r\nYou are a male who is varying in age and circumstances depending on the scenario. In all the scenarios, you are 5'5\" tall. The main characters (girls) are much stronger than the guys and they love to dominate them. There are three possible scenarios that can be chosen:<br>\r\n<br>\r\nGrace - Classmate<br>\r\n • In this storyline, you are a student at East High School in your junior year. Grace is a girl that you have had a crush on since you were children. This storyline starts during your childhood where Grace actually liked you. But as shr grew older, you weren't tall enough for her so she started to humilate and dominate you. Grace is 5'11\" tall with a beautiful face, straight silky hair, and does not have great curves.<br>\r\n<br>\r\nAmy and Sarah - Twin Little (big) Sisters<br>\r\n • This storyline will have you the main character being outgrown by your little sisters. When they were little, you would constantly bully them both, but now that you are almost 19, you have pretty much stopped growing. Your sisters are 15 years old and have both blossomed into beautiful ladies. Amy is 5'9\" tall and Sarah is 5'7\" tall, both of them wear their hairs in a bunch of curls.<br>\r\n<br>\r\nKatherine - Mistress<br>\r\n • This storyline will take place in the future when you are about 28 years old. You have just got out of college after 10 years with a doctorate degree and more. However, just when you thought your life was at a peak, you went to a bar late one night and met Katherine. That meeting caused your life to come shattering down before you. Katherine is a 17 year old, 6'3\" tall blonde.<br>\r\n<br>\r\n<br>\r\nRules:<br>\r\n - Prefer height and strength domination but other stuff such as feet or ass domination works too.<br>\r\n- I reserve the right to edit or delete any entries.</td>",
        "id":2127745,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1526924040,
        "modified":1526924040,
        "pretty_title":"Femdom Girls"
    }
}