{
    "chapters":{
        "1":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Berlin Apartment"
            ],
            "content":"<div class=\"\"><div> <span>Ich stand auf einem Friedhof in Detroit. Valerie hatte in ihrem Testament verfügt, dass sie in ihrer Heimatstadt begraben werden will.<br>\r\n<br>\r\nIch wusste, dass Nod das ehemalige Apartment in Tokio, das die anderen bezogen hatten, unbrauchbar gemacht hatte.<br>\r\n<br>\r\nIch weinte. Ich versuchte, die Tränen zurückzuhalten. Erfolglos. Ich sank auf die Knie.<br>\r\n<br>\r\nZitterte vor Trauer und Wut. Ich hörte Linette sprechen: <i>\"du solltest von hier verschwinden, Theresia.\"</i><br>\r\n<br>\r\nIch flüsterte: \"ich...kann mich nicht...bewegen...\"<br>\r\n<br>\r\nLinette sagte: <i>\"okay. Ich habe Ajay verständigt, er ist unterwegs hierher. Er arbeitet nicht mehr für Nod, du kannst ihm trauen.\"</i><br>\r\n<br>\r\nIch flüsterte erstickt: \"danke, Linette. Danke für alles.\"<br>\r\n<br>\r\nAls Ajay bei mir war, kniete er sich zu mir hinunter, legte mir eine Hand auf die Schulter: \"hey.\"<br>\r\n<br>\r\nIch drückte mein Gesicht fest an seines. Er nahm mich auf die Arme und trug mich davon. Ich schluchzte noch immer: \"wo...wo bringst du mich hin...?\"<br>\r\n<br>\r\nEr antwortete: \"Nach Berlin. Dort hat Linette eine zweite Bleibe gekauft. Leider sind Waffen und Munition bei Nods Brandstiftung in Tokio vernichtet worden. Aber da wir unser Geld noch haben, finden wir sicher einen Weg, das wieder geradezubiegen.\"<br>\r\n<br>\r\nIch antwortete nicht; ich war eingeschlafen, hatte mich in den Schlaf geweint.</span></div></div>",
            "created":1578891600,
            "id":2773258,
            "title":"Theresia: Detroit Friedhof"
        },
        "11":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Berlin Innenstadt"
            ],
            "content":"<div class=\"\"><div> <span>Ich wachte erst wieder auf, als wir im Apartment angekommen waren. Ajay hatte mich im Schlafzimmer ins Bett gelegt, er selbst hatte sich auf die Bettkante neben mich gesetzt. Er sagte: \"ich war derjenige, der das Geld rausgeschafft hat. Irgendwas <i>musste</i> ich einfach retten, Theresia. Den Apache haben wir nämlich auch verloren.\"<br>\r\n<br>\r\nEr klappte den Laptop auf und setzte mich davor auf den Stuhl. Ich sagte: \"warte. Sparen wir uns das Geld. Ich hab ´ne bessere Idee.\"<br>\r\n<br>\r\nAjay war fast sicher: \"die Kampfdrohnen?!\" Ich erwiderte: \"ja, richtig. Du nimmst unsere CH-5 und hältst mir den Rücken frei. Ich sehe, was ich von unten aus tun kann. Bestimmt hat Nod irgendwo noch ein Waffenlager oder so was.\"<br>\r\n<br>\r\nAjay sagte: \"oder du nimmst diesen Typen einfach IHRE Waffen ab. Irgendwas geht doch immer.\"<br>\r\n<br>\r\nIch sagte: \"ja, das wäre auch ´ne Möglichkeit. Ich mach das schon.\"<br>\r\n<br>\r\nIch wartete auf den Einbruch der Nacht, dann ging ich nach draußen.</span></div></div>",
            "created":1578891600,
            "id":2773265,
            "title":"Theresia: Berlin Apartment"
        },
        "111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Berlin, Nod-Lagerhalle"
            ],
            "content":"<div class=\"\"><div> <span>Ich lief durch die Stadt. Ich wusste, dass hinter jeder Überwachungskamera, die mich filmte, ein möglicher Nod sitzen musste, der mich auf Schritt und Tritt verfolgen konnte. Also versuchte ich mich unauffällig zu verhalten. Ich erkannte aus den Augenwinkeln, dass mir jemand folgte.<br>\r\n<br>\r\nIch ließ ihn herankommen; als er seine Pistole zog, drehte ich mich um, nahm sie ihm in derselben Bewegung mit dem rechten Zeigefinger zwischen dem Abzug elegant aus der Hand und versetzte ihm mit der Linken einen Schlag gegen den Kopf. Er sank bewusstlos zu Boden. Ich erkannte die Nod-Uniform sofort.<br>\r\n<br>\r\nIch prüfte die Waffe; eine Sphinx AT-2000P mit einem vollen 13-Schuss-Magazin. Ich steckte die Waffe ein. Dann betrat ich durch die Hintertür eine Lagerhalle, die bestimmt auch im Besitz der Bruderschaft war.</span></div></div>",
            "created":1578891600,
            "id":2773290,
            "title":"Theresia: Berlin Innenstadt"
        },
        "1111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Oranienburg, Surprise Attack"
            ],
            "content":"<div class=\"\"><div> <span>Ich ging sofort nach dem Betreten der Lagerhalle in Deckung. Nod-Soldaten patrouillierten in der Halle. Sie hatten einen LKW ankommen lassen; einer der Soldaten schien sich mit dem Fahrer zu unterhalten.<br>\r\n<br>\r\nIch wartete. Als der LKW für einen Moment nicht im Blickfeld der Soldaten war, schlich ich mich von hinten heran und stieg hinten auf die Ladefläche. Ich flüsterte: \"Linette?\"<br>\r\n<br>\r\n<i>\"ja, bitte?\"</i><br>\r\n<br>\r\n\"kannst du Samira Bescheid geben? Sie soll mit Ajay zusammen diese Lagerhalle ausräumen, bevor Nod zurück ist.\"<br>\r\n<br>\r\n<i>\"verstanden, Theresia. Ist so gut wie erledigt.\"</i><br>\r\n<br>\r\nDer Lastwagen fuhr los.<br>\r\n<br>\r\n</span></div></div>",
            "created":1578978000,
            "id":2773674,
            "title":"Theresia: Berlin, Nod-Lagerhalle"
        },
        "11111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Die Schwarze Hand bekommt nie genug"
            ],
            "content":"<div class=\"\"><div> <span>Ich wartete, bis der Motor des LKWs ausgeschaltet worden war. Ich hörte, dass sich der Fahrer mit seinem Nod-Kollegen unterhielt.<br>\r\n<br>\r\nIch entsicherte die Pistole so leise wie möglich und lugte vorsichtig um die Plane herum. Dann zielte ich. Der erste Nod bekam die Kugel direkt in den Kopf. Der zweite holte sein Funkgerät heraus, aber ich feuerte ihm drei Kugeln in den Oberkörper, bevor er Verstärkung holen konnte.<br>\r\n<br>\r\n<i>das wäre geschafft...</i><br>\r\n<br>\r\nIch sprang vom Lastwagen. Die beiden Leichen schaffte ich unter einiger Anstrengung auf die Ladefläche. Dann stieg ich wieder in den Lastwagen und warf einen Blick ins Handschuhfach. Darin lag eine weitere Pistole, eine Heckler&amp;Koch 45C mit einem vollen 8-Schuss-Magazin. Ich nahm die Pistole heraus und steckte sie ein.<br>\r\n<br>\r\nDann hörte ich Linette wieder: <i>\"Theresia? Du musst hier sofort weg.\"</i><br>\r\n<br>\r\n<i>verdammt, sicher wieder diese Elitefuzzis von der Schwarzen Hand.</i>, dachte ich.<br>\r\n<br>\r\nIch brachte mich hinter der Wand in Position, von wo aus ich die Straße im Blick hatte, aber Linette sagte: <i>\"bitte nicht, Theresia. Bitte tu das nicht!\"</i><br>\r\n<br>\r\nIch sagte: \"ich kann nicht anders. Ich weiß, ich bin viel schlechter bewaffnet, aber ich brauche mehr Feuerkraft.\"<br>\r\n<br>\r\nLinettes Stimme klang verzweifelt: <i>\"ich will nicht noch jemanden verlieren. Theresia, bitte!\"</i><br>\r\n<br>\r\nIch ließ mich auf den Boden sinken, die Waffe mit dem Lauf leicht gegen die Stirn.<br>\r\n<br>\r\n\"es tut mir so furchtbar leid.\", murmelte ich.<br>\r\n<br>\r\n</span></div></div>",
            "created":1579064400,
            "id":2774169,
            "title":"Theresia: Oranienburg, Surprise Attack"
        },
        "111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: auf dem Weg zu einem Arzt"
            ],
            "content":"<div class=\"\"><div> <span>Ich versuchte, möglichst leise zu atmen. Spähte hinter der Wand hervor. Zwei Elitesoldaten kamen in meine Richtung. Ich ging in die Hocke, um einerseits das Zielen zu vereinfachen und andererseits meinen Feinden weniger Trefferfläche zu bieten.<br>\r\n<br>\r\nLinette begann zu sprechen: <i>\"die ersten zwei auf 12 Uhr.\"</i><br>\r\n<br>\r\nIch erwiderte nichts. Ich zielte und feuerte zwei Schüsse auf einen der Nods ab. Ich sah ihn zu Boden gehen. Der andere erwiderte das Feuer. Ich duckte mich wieder, hörte die Kugeln an meinen Ohren vorbeipfeifen. Der andere feuerte weiter. Ich spürte einen brennenden Schmerz in meiner rechten Bauchgegend.<br>\r\n<br>\r\nDer Nod hatte mich getroffen. Ich legte mich auf den Bauch und schoss dreimal. Zwei glatte Treffer in den Oberkörper, der dritte unterhalb von seinem Hals. Er brach zusammen und regte sich nicht mehr.<br>\r\n<br>\r\nIch atmete tief durch. Linette sagte: <i>\"Theresia...\"</i><br>\r\n<br>\r\nIch unterbrach sie, etwas unruhig atmend: \"ich weiß, Linette. Das wird wieder.\"<br>\r\n<br>\r\n<i>\"schnapp dir einen der Lastwagen. Fahr zu dem Unterschlupf, ich führe dich. Dort bleibst du. Ich hab den Krankenwagen schon hierherbestellt.\"</i><br>\r\n<br>\r\nIch folgte ihrer Anweisung.</span></div></div>",
            "created":1579150800,
            "id":2774509,
            "title":"Theresia: Die Schwarze Hand bekommt nie genug"
        },
        "1111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Oranienburg Krankenhaus"
            ],
            "content":"<div class=\"\"><div> <span>Ich war losgefahren. Versuchte irgendwie wachzubleiben. Linette sagte, als ich an einer Kreuzung ankam: <i>\"hier rechts abbiegen.\"</i><br>\r\n<br>\r\nIch tat stöhnend, was sie gesagt hatte. Ich sagte: \"Linette...ich wollte dir nochmal danken. Für alles...\"<br>\r\n<br>\r\nMir fielen die Augen zu. Linette schrie: <i>\"Theresia! Nicht!\"</i><br>\r\n<br>\r\nIch spürte sie herunterschweben, sie sprach weiter: <i>\"bleib wach, hörst du mich?\"</i><br>\r\n<br>\r\nIch antwortete nicht, öffnete die Augen langsam. Öffnete die Fahrertür und stürzte auf die Straße.<br>\r\n<br>\r\n<i>\"Theresia...tu mir das bitte nicht an, ja?!\"</i><br>\r\n<br>\r\nIch versuchte, sie zu ignorieren. Stand auf und schleppte mich die Straße entlang.<br>\r\n<br>\r\nAls ich 10 Minuten später den Unterschlupf in Sichtweite hatte, kam bereits die Sanitäterin auf mich zugerannt.<br>\r\n<br>\r\nAnstatt zu Boden zu sinken, fiel ich ihr direkt in die Arme. Sie rannte mit mir auf den Armen zum Krankenwagen.</span></div></div>",
            "created":1579150800,
            "id":2774511,
            "title":"Theresia: auf dem Weg zu einem Arzt"
        },
        "11111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Oranienburg"
            ],
            "content":"<div class=\"\"><div> <span>Als ich wieder zu mir kam, lag ich an Blutinfusionsschläuche angeschlossen in einem Krankenhauszimmer. Die Ärztin sagte: \"die Kugel ist bereits entfernt. Besser, wenn Sie das nicht mitbekommen, dachte ich.\"<br>\r\n<br>\r\nIch streckte die Hand aus, die Ärztin nahm sie. Ich sagte: \"ich danke Ihnen.\"<br>\r\n<br>\r\nSie sagte, nachdem sie meine Hand wieder losgelassen hatte: \"Das ist meine Aufgabe. Sind Sie nicht Theresia?\"<br>\r\n<br>\r\nIch antwortete: \"ja, die bin ich.\" Sie sagte: \"du meine Güte! Sie sind die, die zwei ihrer Freundinnen...\"<br>\r\n<br>\r\nIch unterbrach sie: \"ja, genau. Tut mir leid, dass Sie ausgerechnet an mich geraten.\"<br>\r\n<br>\r\nIch stand auf, sie entfernte die Schläuche und nahm mich in den Arm: \"das tut mir wirklich leid.\"<br>\r\n<br>\r\nIch erwiderte: \"nicht schlimm. Ich muss jetzt weiter.\"<br>\r\n<br>\r\nIch löste mich aus ihrer Umarmung und verließ das Krankenhaus.</span></div></div>",
            "created":1579150800,
            "id":2774513,
            "title":"Theresia: Oranienburg Krankenhaus"
        },
        "111111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia vs. Nod Taxi Driver: Berlin Flughafen"
            ],
            "content":"<div class=\"\"><div> <span>Ich machte mich sofort mit einem Taxi auf den Weg zum Flughafen. Diesmal wollte ich nach Thailand. Ich hielt ein Taxi an und stieg ein. An den Taxifahrer gewandt, sagte ich: \"zum Flughafen, so schnell wie möglich.\"<br>\r\n<br>\r\nEr ließ die Reifen qualmen, ohne etwas zu erwidern. Er sagte: \"Sie sind Theresia, nicht wahr?\"<br>\r\n<br>\r\nIch antwortete: \"kommt drauf an, wer danach fragt.\"<br>\r\n<br>\r\nEr grinste. \"Ein Akolyth der Bruderschaft.\"<br>\r\n<br>\r\nEine Falle, das wusste ich jetzt. Als er seine Pistole auf mich richtete, zog ich meine AT 2000P.<br>\r\n<br>\r\nEr sagte: \"Patt, wie es aussieht.\"<br>\r\n<br>\r\nDas Taxi rollte ein Stück weiter und kam auf der Straße vor dem Flughafen zum Stehen.</span></div></div>",
            "created":1581570000,
            "id":2786704,
            "title":"Theresia: Oranienburg"
        },
        "1111111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Thailand Waldgebiet"
            ],
            "content":"<div class=\"\"><div> <span>Wir zielten noch immer mit unseren Pistolen auf den jeweils anderen. Er fragte: \"wie ist sie eigentlich gestorben? Ich hab nur von diesem Absturz gehört.\"<br>\r\n<br>\r\nIch wusste, dass er oder sie sich auf Valerie bezog.<br>\r\n<br>\r\nIch antwortete: \"sie hat den Piloten getötet. Der Absturz hat ihr wohl den Herzbeutel aufgerissen, aber ganz sicher bin ich mir da auch nicht.\" Er erwiderte: \"mein herzliches Beileid. Ich mache das nur wegen Nods Bankkonten, ich bin wirklich nicht so religiös eingestellt wie die meisten Nod-Anhänger.\"<br>\r\n<br>\r\nEin Teil von mir glaubte dem Nod. Ich sagte: \"okay. Ich werde meine Waffe jetzt einstecken.\"<br>\r\n<br>\r\nEr hob die Hände und steckte seine Waffe weg, ich steckte meine Pistole ebenfalls ein. Er überreichte mir eine Notiz: \"hier. Dort habe ich mein Apartment. Würde mich freuen, Sie dort zu sehen.\"<br>\r\n<br>\r\nEr stieg aus und sagte: \"danke, dass Sie mich nicht erschossen haben.\"<br>\r\n<br>\r\nSeine Stimme war durch die Lautsprecher seines Helms zu sehr gefiltert worden, als dass ich sein Geschlecht hätte identifizieren können. Ich blickte in die Richtung, in die er gegangen war, aber er war verschwunden.<br>\r\n<br>\r\nIch verließ das Taxi ebenfalls und machte mich auf den Weg dorthin, wo ich ursprünglich hin wollte.</span></div></div>",
            "created":1582261200,
            "id":2790598,
            "title":"Theresia vs. Nod Taxi Driver: Berlin Flughafen"
        },
        "11111111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Geheimes Nod-Infozentrum, Thailand"
            ],
            "content":"<div class=\"\"><div> <span>Nachdem ich das Flugzeug und das Flughafengelände verlassen hatte, war ich in einem Waldgebiet angekommen. Ich hörte Linette sprechen: <i>\"manche Nods scheinen wirklich an ihrem Leben zu hängen.\"</i><br>\r\n<br>\r\nIch erwiderte: \"das ist mir jetzt auch klar geworden. Glaubst du, er oder sie wird uns irgendwann helfen?\"<br>\r\n<br>\r\nLinette antwortete: <i>\"bestimmt.\"</i><br>\r\n<br>\r\nIch lief weiter durch den Wald. Ich funkte an Ajay: <i>\"finde heraus, wie dieser Nod heißt. Und mach dir keine Sorgen. Ich traue ihm.\"</i><br>\r\n<br>\r\nAjay brummelte nur bestätigend: <i>\"m-hm.\"</i><br>\r\n<br>\r\nAls ich einen Unterstand erreichte, zog ich meine AT-2000P. Ich lugte vorsichtig hinein. Ein Nod-Soldat stand darin. Ich zielte auf seinen Kopf.<br>\r\n<br>\r\n\"keine falsche Bewegung.\"<br>\r\n<br>\r\nEr hob die Hände und drehte sich um. \"ist ja wirklich interessant. Sie.\"<br>\r\n<br>\r\nIch ignorierte den Umstand, dass er mich offensichtlich kannte: \"nennen Sie mir einen Grund, wieso ich Sie am Leben lassen sollte.\"<br>\r\n<br>\r\nAnstatt zu antworten, stürmte er auf mich zu und ergriff meine Pistole. Ich rang ihn zu Boden. Er sagte: \"wenn Nod herausfindet, dass ich versagt habe, bin ich sowieso ein toter Mann.\"<br>\r\n<br>\r\nIch nahm den Finger vom Abzug, er drückte ihn nach hinten und erschoss sich.<br>\r\n<br>\r\nIch durchsuchte den Unterstand nach Informationen. Es sah wie ein verstecktes Nod-Informationszentrum aus: überall waren Kabel an Computer angeschlossen.<br>\r\n<br>\r\nIch betete, dass ich fündig wurde, bevor mich die Bruderschaft hier aufspürte. Also machte ich mich an die Arbeit.</span></div></div>",
            "created":1582261200,
            "id":2790602,
            "title":"Theresia: Thailand Waldgebiet"
        },
        "111111111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia: Sydney; Die Nadel im Heuhaufen"
            ],
            "content":"<div class=\"\"><div> <span>Ich startete einen der Computer, von dem ich annahm, dass es sich um den Hauptrechner handelte. Es rauschte kurz, dann sah ich darauf das Gesicht der Nod-Soldatin aus dem Taxi. Sie sagte: <i>\"ich bin Naomi. Freut mich sehr, dich kennenzulernen, Theresia. Ich habe viel von dir und Linette gehört. Ich glaube, ich bin bereit, euch zu helfen.\"</i><br>\r\n<br>\r\nIch sagte: \"Nod scheint wirklich entschlossen zu sein, dieses Mal als Sieger aus der Schlacht hervorzugehen.\"<br>\r\n<br>\r\nSie erwiderte: <i>\"ja, das ist mir jetzt auch klar. Deswegen habe ich mich an dich gewandt. Nod würde mich für meinen Verrat sicher umbringen. Du musst sofort zu mir, ich bin in Sydney.\"</i><br>\r\n<br>\r\nErst jetzt fiel mir auf, dass sie <i>geflüstert</i> hatte. Also musste Nod ihr dicht auf den Fersen sein.<br>\r\n<br>\r\nIch rannte sofort nach draußen, raste in einem Affenzahn zum Flughafen zurück und flog für 250 Credits nach Australien.</span></div></div>",
            "created":1582261200,
            "id":2790665,
            "title":"Theresia: Geheimes Nod-Infozentrum, Thailand"
        },
        "1111111111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia & Naomi: Sniper Endfight"
            ],
            "content":"<div class=\"\"><div> <span>Ich war sofort nach meiner Landung aus dem Terminal gerannt. Dann erhielt ich einen Anruf von Ajay: <i>\"ich habe Naomis Signal eingrenzen können. Sie ist in einem kleinen Haus am nördlichen Stadtrand.\"</i><br>\r\n<br>\r\nIch erwiderte nichts, sondern rannte weiter. Ich wusste nicht, wieviel Zeit mir noch bleiben würde, bis Nod sie fand.<br>\r\n<br>\r\nIch trat sofort die Tür ein, als ich das Haus erreicht hatte. Ich schoss dem Nod hinter der Tür eine Kugel direkt ins Herz. Dann wechselte ich zu meiner 45C, die noch 3 Kugeln im Magazin hatte.<br>\r\n<br>\r\nIch hetzte die Treppen nach oben, jemand zog mich in eine schattige Ecke. Naomi flüsterte: \"da ist mindestens noch einer, sei vorsichtig.\"<br>\r\n<br>\r\nDer Nod kam die Treppe nach oben, ich feuerte ihm meine letzten 3 Kugeln in die Brust, er stürzte wieder nach unten und blieb regungslos am Fuß der Treppe liegen.<br>\r\n<br>\r\nIch schob dem Nod die leere Pistole unter und wechselte wieder zu meiner anderen Waffe. Dann schloss ich Naomi in die Arme.<br>\r\n<br>\r\nSie klammerte sich fest an mich. Ich trug sie die Treppen runter, wieder aus dem Haus.<br>\r\n<br>\r\nDer Schuss ließ eines der Fenster zersplittern. Ich ging sofort hinter den Autos in Deckung, Naomi tat es mir gleich. Sie sagte: \"die haben Scharfschützen. Das ist eine Falle.\"<br>\r\n<br>\r\nIch erwiderte: \"das ist mir jetzt auch klar.\"<br>\r\n<br>\r\nIch umklammerte die Pistole.<br>\r\n<br>\r\nWahrscheinlich würde nur einer von uns lebend hier rauskommen.<br>\r\n<br>\r\nIch musste Naomi retten. Ich war nicht so weit gekommen, um sie jetzt von einem Scharfschützen töten zu lassen.</span></div></div>",
            "created":1582261200,
            "id":2790677,
            "title":"Theresia: Sydney; Die Nadel im Heuhaufen"
        },
        "11111111111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "choices":[
                "Theresia & Naomi: Casualties?"
            ],
            "content":"<div class=\"\"><div> <span>Ich sagte: \"die Autos kurzschließen würde zu viel Zeit in Anspruch nehmen, bis dahin wären wir erledigt.\" Naomi sagte: \"aber was sollen wir tun? Wir können nicht hierbleiben!\"<br>\r\n<br>\r\nIn Naomis Gesicht spiegelte sich das Entsetzen: \"tu das nicht! Nicht für mich!\"<br>\r\n<br>\r\nScheinbar wurde ihr jetzt klar, was ich vorhatte.<br>\r\n<br>\r\nIch nahm ihre Hände in meine: \"es gibt da draußen immer jemanden, der der Bruderschaft einheizen wird. Wenn ich es nicht bin, wirst du es sein.\"<br>\r\n<br>\r\nIhr liefen Tränen die Wangen herunter: \"Theresia...\"<br>\r\n<br>\r\nIch küsste sie zärtlich auf die Wange. \"tut mir leid.\"<br>\r\n<br>\r\nIch erhob mich und feuerte viermal; eine Kugel traf das Gewehr des Schützen, die anderen verfehlten. Naomi nutzte die Ablenkung, um auf das Gebäude loszurennen, in dem sich der Nod-Scharfschütze befand.<br>\r\n<br>\r\nNoch 3 Schuss. Naomi war mit dem Schützen auf gleicher Höhe.<br>\r\n<br>\r\nAls ich wieder hervorkam, um zu schießen, hörte ich einen Schuss. Zwei meiner Kugeln verfehlten, die dritte traf den Schützen in die Schulter.<br>\r\n<br>\r\nDie Kugel des Nod-Scharfschützen traf mich in den rechten Lungenflügel.<br>\r\n<br>\r\nNaomi stand die Angst ins Gesicht geschrieben.</span></div></div>",
            "created":1582261200,
            "id":2790689,
            "title":"Theresia & Naomi: Sniper Endfight"
        },
        "111111111111111":{
            "author_id":"blackie",
            "author_name":"Blackie",
            "content":"<div class=\"\"><div> <span>Ich hörte Naomis gedämpfte Rufe. Sah die Sanitäter, die mich auf eine Trage legten. Rang verzweifelt nach Luft.<br>\r\n<br>\r\n<i>Linette.</i><br>\r\n<br>\r\nSie begannen noch im Rettungswagen mit Bluttransfusionen.<br>\r\n<br>\r\nFuhren mich ins Krankenhaus.<br>\r\n<br>\r\nIch konnte Naomi hören, die mit den Sanitätern zusammen hinten in den Rettungswagen eingestiegen war: \"du musst bei mir bleiben. Theresia, du darfst nicht einschlafen.\"<br>\r\n<br>\r\n<i>du darfst nicht sterben.</i><br>\r\n<br>\r\nAls wir das Krankenhaus erreicht hatten, waren meine Lichter ausgegangen.<br>\r\n<br>\r\nWahrscheinlich begannen die Sanitäter mit Herzdruckmassagen und dergleichen. Vielleicht mussten sie mir sogar den Lungenflügel entfernen. Ich bekam nichts mehr davon mit.</span></div></div>",
            "created":1582261200,
            "id":2790695,
            "title":"Theresia & Naomi: Casualties?"
        }
    },
    "info":{
        "author_id":"blackie",
        "author_name":"Blackie",
        "brief_description":"Theresia auf einer unmöglichen Mission. Rache für Linette und Valerie nehmen.",
        "created":1578940080,
        "description":"<td align=\"left\" class=\"norm\">Valerie hatte es ebenfalls erwischt. Aber für Trauer ist keine Zeit. Wir werden Nod stoppen.<br>\r\n<br>\r\nUm jeden Preis.<br>\r\n<br>\r\nSelbst dann, wenn dieser Preis unser Leben sein sollte.<br>\r\n<br>\r\nIch bin Theresia.<br>\r\n<br>\r\nIch werde die Bruderschaft in der Luft zerreißen.</td>",
        "id":2210202,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582297380,
        "modified":1582297380,
        "pretty_title":"C&C: Tiberian Incursion: Prophecy"
    }
}