{
    "chapters":{
        "1":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #2",
                "Character Background"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nThis is my first entry. I'm not realy sure how to get this started so imma just dive in.<br>\r\n<br>\r\nMy name is Helen Rodriguez. Not Ellen. Not El. If you call me Lenny i swear now that you know i will find you and throw you in front of a literal rogue bus going 200mph (322kph) and watch you liquefy... Sorry. I get a little heated when people are being assholes. Yah know? Now that i think about it I'm doing a fabulous job considering i live in a bible belt.<br>\r\n<br>\r\nAnyway, in case you didn't notice, I'm transgender. Well at least questioning. Ps sorry if i ramble a lot. (Note to self: rearrange before posting) Remember when i said i live in a bible belt? Well my family is Suuuuuuuuuuuuuper religious. As in \"God hates gays\" and well lets just keep it pg13. Hey my first meta joke... i think. Sorry my train derailed.<br>\r\n<br>\r\nOoh! Now i remember. The other day my mom asked me to go to the store for her and get her a new pair of running shoes. She gave me all the specifics. Well all except shoe size. I myself am a size 9 (40EUR) UGH I know my feet are giant. The best thing about the store is that it not only is 60 miles away 4 towns over but that they have a no return policy.<br>\r\n<br>\r\nAny who, mom sends me to get her shoes: Black body with pink nike decal. They are on sale for little less than $90. Now my mom has a very small foot in contrast to me. Here's where it gets interesting. I bought a size9. She's a size 6. Not noticably different but i asked the counter girl if she could put the shoes i bought in a size 6 (37EUR) box. I was smiling the whole way home. Now as \"punishment\"for getting my mom the wrong size, these are my new shoes.</span></div></div>",
            "created":1598072400,
            "id":2889351,
            "title":"1st entry"
        },
        "11":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #3"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nI am silently squeeing with joy.I'm So Ex-cit-ed but i got to hide-it! I'm cut-ting the song right-here to avoid copy-write<br>\r\n<br>\r\nSo today, guess who just got her first feminine(androgynous) haircut today... ... ... sorry i forgot you can read this but i can't hear you (nice facepalm Helen). So back to the haircut. My mother gave me $10 she said that that was all i was getting because thats how much mens haircuts cost. TEN FLIPPING DOLLARS! It's a good thing i saved up. Well i happen to be out to my BFF. The Best BFF that ever FFed (we'll call her \"Jo\"(notherealname)). Jo told me about the cutest little salon about an hour away. Beeing the most awesomest of best friends i had to invite her. What was i supposed to do not have an alibi? Anyways, as we entered the salon, i told the story of how Jo and i made a bet (completely falsified information) i lost and as \"punishment\" i was to tell the hairdresser to give me a haircut that works for boys or girls<br>\r\n<br>\r\nWhen i got home later today i had to calm myself and act like it was the worst thing in the world. Well my mother being frugal decided that i didn't need and we couldn't afford another haircut for me. I will now spend the next 6 months with the cutest curly bob cut. Oh mother dear, when will you learn. Hopefully when it's too late to stop it. Anywho, thanks for the new haircut.</span></div></div>",
            "created":1598080980,
            "id":2889362,
            "title":"Entry #2"
        },
        "111":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #4"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nYesterday we had a HUGE party to celebrate my 17th birthday. I was actually in charge of the guest list. Well as you can probably imagine, I invited Jo. Well Jo is a bit of an aquired taste so i had a helluva time watering her down so she wouldn't spill the beans to my WHOLE FAMILY or worse, my mother. Did i mention the first time they heard of eachother, Jo thought my mom was a witch and My mom thought Jo was my girlfriend. (Well Mom's not wrong though not in the way she will ever find out i hope) Jo spent five minutes reading about the different covens that don't really exist within the realm of possibility and... I'm... rambling again... great train derailed. Though come to think of it, was it ever even on a track. And what kind of track was it... (proceed to stick foot in mouth) New paragraph<br>\r\n<br>\r\nSorry I'm working on it. Oh yeah the segunda!<br>\r\n<br>\r\nAnyway, when Jo got to my house as the only non-family member in attendance, she gave me this cute \"salmon\" colored gift bag and claimed it was the only thing she could afford after she got my present. I pulled her to the side and whispered to her, \"Jo honey, dial it down, 'the lady doth protest'\" its our code for you suck at acting you're gonna get me clocked. Good thing my mom HATES theatre(yesthatshowthespiansspellit) or i would have to muzzle my BFF.<br>\r\n<br>\r\nSo i mentioned Jo gave me a present right? Yeah she gave me the CUUUUUUTEST pair of skinnies i have ever seen. I went to the bathroom because my mom wanted me to try them on. When i got back she informed me they were, in fact, girls jeans. Remember when i said my mom was frugal... i don't remember but yeah shes a penny pincher. I offered her the jeans because i wanted it to seem like \"uh... you want me to wear girls jeans? You know thats crossdressing right?\" She told me to shut up because i already said they were comfortable(i did not tell her i thought they were cute or that i knew they were for women) she told me to wear them at home. Since they seem gender neutral to wear them for Jo since she did buy them for me without \"knowing\". Thats why she doesn't like to shop at a certain second-hand store(nonametoavoidcopyrightbecauseimparinoid) that bunches up all the denim regardless of gender.<br>\r\n<br>\r\nAnyway... wow i tend to say that a lot. I'm glad to know i can get away with a few things at least if mom doesnt know it was a happy \"accident\"</span></div></div>",
            "created":1598081280,
            "id":2889365,
            "title":"Entry #3"
        },
        "1111":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #5"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nI'M SOOOOOO STUPID! Ugh!<br>\r\n<br>\r\nYesterday my mom had to go to the doctor. Now hear me out because i know that sounds cruel. Like \"Helen, i know you are at odds with your mother but what could she have done to you to elicit that kind of reaction?\"... ... ... seriously i know this is in my head but wow, you just went there(facepalm)(maybe i should start a facepalm counter for all the times i mess up... nah too lazy. Where was i)<br>\r\n<br>\r\nMom went to the doctor to get a checkup on her bad ankle. Little side note she broke her ankle about 10 years ago when i was playing in the street. I wasnt watching where i was running, but seriously what 6 year old actually pays attention to the road... right... right?... um...<br>\r\nAnyway, she sort of (actually not sort of she did save my life when a truck was barrelling down the road i ran right in front of it when my mom caught me with one arm and threw me to the lawn out of the way. She got her foot caught in the gutter and consequently broke her ankle as a result... she has to get seen for her 2 screw implants to keep the pain in check. (Note to self check for run-ons because your 2 sentances take up a usual paragraph on a phone and its kind of annoying)(edit out later)<br>\r\n<br>\r\nSo back to the story, SuperMom is going to the orthopedic specialist for pain and would be out of the house for at least 6 hours. My sister was also out of the house at her boyfriend's house. She's a bit of a tomboy and luv luv loves her videogames. You needed that context because of the next sentance. She told me she was going to her BFs to play some wrestling... I've been to her boyfriend's house. Neither of them have well lets just say they get their excercises. Sorry, tangent again (i should really consider trigonometry as a career but i think it would be hard to \"function\" sorry I'll stop.<br>\r\n<br>\r\nAs i was saying, i had the whole house to myself. And a plethura of piñatas, i mean shopping bags, i mean clothes. My sister's new clothes to be exact. I went to my room and stripped. The only thing i took with me were panties i had stored away tajt Jo bought me which i hid under my floorboards under my carpet in a black box with a key that i disguised on my keychain. Remember when i said i was paranoid, i bet you thought i was kidding. I'm worse than Burt Gummer after 19 years of being haunted by giant worms. I went into my sister's room ans straight to her closet. I found what i was after. A fit and flare mini dress with a square neckline, long peasant sleeves with shirred cuffs, princess sleeves, with a hidden zipper in the back. I put the hanger on the door and headed to her bathroom. I washed everything.<br>\r\n<br>\r\nAfter the shower, i smelled just like my sister. Apricot peaches dancing in the room. As per usual. After i put on the dress i found her perfume and gave myself a spritz. I looked in the mirror and saw i was in heaven. I went to my phone and used a filter to make me look more like myself. (The gender bender filter)after the picture was taken, i stored it to a secret vault for my girl pics that only me and Jo (Jo and me... myself... i... whatever) know about. She gets a ping and sends me an encrypted message \"\"U alone?\" \"Yep\" \"Crap\"\" this translated to \"OMG SOOOOO CUTE\" \"TY, come over so you can help me hide the evidence\" \"ok girlfriend Ill B right ovr luvsya\"<br>\r\n<br>\r\nWhen Jo got to my house we went right away back to my sisters room and aired out the new smell to dilute it. I then got undressed and handed everything but my panties to Jo who would gladly washeverything while i took a shower... in my shower... my man shower... back to the mask of musk and swagger. When i was done, Jo finished pulling everything back into their propper places. The vault has detailed pictures of everything we use to make absolutely certain nobody sees anything out of place. Once the room is aired out we close all the windows and doors and turn out the light. I get dressed in my skinnies and my Nikes and put on a black t-shirt to hide the fading lines i created with my sisters bra. We head into the livingroom to watch half of a show before it is about 2 hours before mom and sis get home. I send Jo home with a bag of my panties so she can get them washed and back to me  during our next escapade.<br>\r\n<br>\r\nAfter Jo left i got a message from my sister \"heading home be there in about 5 minutes\". All i can say is that was a close call.</span></div></div>",
            "created":1600069500,
            "id":2902659,
            "title":"Entry #4"
        },
        "11111":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #6"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nI am probably the luckiest girl in the... the second luckiest g... the... well lets just say I'm pretty lucky today. Oh right, context, so today Jo hatched a plan to borrow me from my mother. The conversation is oh so funny that i thought you might like to... hear? read?... recount the words as though you were there with us. Ya know like a fly on the wall. Now, without further ado...<br>\r\n<br>\r\nI woke up to the sound of my phone ringing. Its obviously Jo. We have our encrypted conversation.<br>\r\n<br>\r\nJo: \"Rise and shine Mr. Gummer. You have a promise to fulfill!\"<br>\r\nCode: \"its Showtime beautiful\"<br>\r\nMe: \"Please don't\"<br>\r\nCode: \"hurry your ass over here I'm dying\"<br>\r\n<br>\r\nWithin 5 minutes my partner in crim is at the door. \"Good morning Momma E, how are you today?<br>\r\n<br>\r\nMy mother the ever impressed strikes up a round of small talk while i wait for my cue. 5 minutes of buttering up my mother... and i still have to wait another 5 minutes for why Jo showed up out of the blue. You see, as you probably know by now (and if you don't worry not i need to keep reminding myself from time to time) that my mother is a bit old fashioned. \"You stick to your word or you put your head between your leggs and kiss the road because I'm not tolerating a liar whose word means smut.\"<br>\r\n<br>\r\nGetting back to Jo's presence. We concocted a plan to \"force me\" to crossdress with my mother's approval. Toparaphraseafamousquotefromaweirdmovieisawaglimpsof'causeitwastooinapropria teformyhouse (fuew don't try saying that in one breath or you'll nearly pass out like me... i almost forgot the quote) i like to dabble on the edge myself-but not really 'cause as my bff said earlier I'm more paranoid than a survivalist who hates the government who works for different governments like Mexico South Africa and SouthAfriCanada #luvuMrKeaton. Where was i... and another facepalm for the lovely HelenRodriguez (say that in an anouncer voice)<br>\r\n<br>\r\nYou may or may not be asking \"how did you get your mom to let you crossdress?\" The answer is quite simple, i would be grounded for breaking a promise to Jo to help her with a project for school. I told her i would help her with her sewing class but she \"failed to mention\" that the article in question was in fact a dress. Normally if Jo wants to see me in something she made she would just have me come over when nobody was home and i do mean neither of our families were home. Don't get me wrong i Luv luv luv Uncle Bill and Aunt Didi but I'm still not going to come out to Jo's family even on accident.<br>\r\n<br>\r\nJo thought it would be cool if we didn't have to jump through a bunch of hoop(earring)sseewhatididthere just to try on one outfit. I thought whats the harm. So we hatched ... im being repetitive again arent i.<br>\r\n<br>\r\nSo mom opens the door to see Jo, they exchange pleasentries and Jo hits my mom with a bombshell.<br>\r\n<br>\r\nJo: \"Momma E, Leonard wont help me after he promised to do anything to help me in my sewing class short of exams, could you help me out?\"<br>\r\n<br>\r\nMom: \"What is the job Miss Greene and I'll make sure Lenny does it. You know my motto, \"Breaking a promise is like breaking Jesus's back twice over while splashing his wounds with lemon juice\"<br>\r\n<br>\r\nJo: \"Cool, so the thing is, i need a model and I'm not sure you would let him.\"<br>\r\n<br>\r\nMom: \"Whatever you need Jo, he'll do it or i'll write a letter to his dad to come get him, for the record, last i heard from him he's worse than me\"<br>\r\n<br>\r\nJo: \"Ok then that makes things easier.\"<br>\r\n<br>\r\nTurning my direction she game mw the cue at which i trudged out of my hiding place feigning dispare. She lets out \"ok Mrs. Doubtfire time to make your new dress!\"</span></div></div>",
            "created":1600069740,
            "id":2902661,
            "title":"Entry #5"
        },
        "111111":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #6",
                "Mom's Pov"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nI am sooo confused today! A few? days ago i went into surgery to take care of a plate that was sticking out due to some other issues (ofwhichiwillnotbementioningatthismoment) l was in the hospital for 2 days. Durring those two days i had amnesia. I love my mother and i want to express that when she told me that i wanted nothing more than to be as far away from her as physically possible. Jo stayed by me when mom was gone. So from this point I'm going to tell you all about the happiest day of my life, when i became a girl for a day.<br>\r\n<br>\r\nThe doctors told my mother that there were complications coming out of anaesthesia. I had no recolection of my name and insisted that i be called Helen. (Btw when Jo told me this i was horrified because i had inadvertently came out to my mother.  The one person who i had never wanted to find out.) Much to my bittersweet relief. The doctors told my mother that it would be some time before i came-to. This means that my unconsious mind (my innermost thoughts where my feminine persona resides) was on full display. Good thing everyone thought it was a delusion.<br>\r\n<br>\r\nApparently, mom had always wanted a daughter and seeing as i wouldnt remember, she snatched her opportunity. When we left the hospital for home, we didnt actually go home. We went to get a hotel in Reno Nevada. You guys thought i was crazy paranoid. My mother wanted to make sure nobody would recognize either of us so bad she left the state.<br>\r\n<br>\r\nSo i... wait, i bet you guys are wondering how i know all of this right? Jo did fill me in on a few details but she was only at the hospital. I was actually in a dream state. I seriously thought it was all a dream. Can you believe it? I mean yeah I'm a bit neurotic but I'm not an airhead. Its both creepy and exciting. Creepy because i had no control over myself, exciting because the real me finally got to shine through.<br>\r\nBack to reality, the reality that was a few days ago anyway. I woke up from a weird dream feeling completely at peace. My mom asked me how i was and i told her (in the most feminine voice i could muster) that i felt like a new person. She freaked out and called the doctor. After doing a CAT scan they told her that the best way to treat me was to wait it out in the mean time act as everything is normal. So anyway, mom booked a trip to Reno for about a week.<br>\r\n<br>\r\nIn reno. I wake up to find that i am in the cutest red nightgown, my mother apparently went to the store with Jo after swearing her to secrecy(oh mother if you only knew). We spent the morning getting our nails done. We went shopping for matching outfits. I almost got my ears pierced but she told me she wasn't paying for anything perminant (one of the many many times i genuinely thank you for not causing damage i could deny later. Oh i forgot that my sister went away on a mission trip and she'll be gon for 2 months. We dodged that bullet because it looks like we packed some of her clothes. Anyway on day 2 we went and got makeovers. All-in-all I'm sort of relieved that I'm back to normal. We have 3 days left in Reno and i am a bit torn. Either i fake it and we continue to make my mother uncomfortable (which i do not enjoy) or i pretend to hate the fact that we didn't pack any boys clothes. Oh well, at least i got to be a girl for a day.</span></div></div>",
            "created":1600070100,
            "id":2902663,
            "title":"Entry #6"
        },
        "1111111":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #8 (trigger warning)",
                "Helen's friends"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nI may have said this before but I'll say it again... \"man i love beeing a (Trademark)™️\"sorryshamelessplugformyfavoriteretromovieseriesokimdone... ... ... where did that come from? What I ment to say was that I'm an idiot. *you would think I would learn my sesson due to all of the weird stuff that has happened to me throughout all of these years?months?days?hours?minutes?secondscentisecondmillisecondmicrosecondnanoseco ndpicosecondfemtosecondattosecondzeptosecondyictosecondplankstime (takes deap breath&gt; i hope you didnt pass out and were able to follow along wowthatmademelightheaded okimdone) that i should know by now not to tempt fate the Almighty made me smart for a reason*<br>\r\n<br>\r\nIt just literally just dawned on me i left out some important details... and I'm once again rambling... (yaknow one of these days im gonna learn howda write right right?)<br>\r\n<br>\r\nSo anyway you know how i am a bit scatterbrained? Well today was the Jefferson State fair and i went with Jo and a few of my friends from school. Bit of a discription (allfakenames) Lynnette Watley my exgirlfriend, Doug Macias my eyecandy and wrestling teammate, and David Pinkert our resident jew. Little side note, Dave's gay and had a thing for me, he's cute but not enough for me to blow my cover. Cute boys aside, today we decided while at the fair to see a show. A hypnotist show.<br>\r\n<br>\r\nNow i think i have an idea what you are thinking. Probably. \"Helen? Why would you go see a hypnotist?\" i reiterate from earlier, i is no good with smartsy head muscle. What happened leading up to it was so embarrassing and Jo was just NO HELP thanks Jo you're the best girlfriend. I kept on about how hypnotism was all fake so obviously, they volunteer me, me of all people, can you believe... actually you probably could believe that with all my rotten luck. Well it just so happens that i was wrong. Hypnotism is real and i remember everything i did while up on stage.<br>\r\n<br>\r\nFirst they asked my name, \"Lenny,\" then they asked what i liked to do. I said, \"Hang with friends.\" You know, the standard stuff. Well as i was on stage, did i mention the sparse crowd? Well sparse isn't that accurate a term. I ment to say empty... private... uninterested. Anyway the only ones in attendance were my friends and myself. Talk about waisting a 300 seat building.<br>\r\n<br>\r\nBack to the show now, apparently, Doug and Lynnette are an item now as i was told as soon as i went under, they found a secluded spot to makeout. Leaving only... Jo and David. Meanwhile on stage i start getting put under, \"Your true self will be revieled.\" Needless to say Jo felt like crap she realized what was going to happen. Now i want to preface by saying that hypnotism cannot force you to do anything. Now, being my paranoid self, you need more than one 5 minute session to blow up my basement/bunker. They wont be getting into this galdern rec room anytime soon. Tell you what though that bastered cam close. Overall i think it was one hell of a hypno scare.</span></div></div>",
            "created":1600070400,
            "id":2902665,
            "title":"Entry #7"
        },
        "11111111":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Entry #9"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nI have some bittersweet news to share. This morning, i was diagnosed with Gynecomastia. Gynecomastia is... as the doctors put it, \"when a boy grows breast tissue like a girl due to hormonal imbalances.\" He then asked me if i was aware of my diet. I told him it consisted of soy products, peaches, raisins, lots of nuts (ironically), tofu... well prety much if it had a lot of estrogen, it went into my stomach.<br>\r\n<br>\r\nAfter hearing this, the doctor was not surprised at my new developements. He said i was lucky though because since it came naturally he theorized that it will go away on its own. I of course did not tell him that i also massage my breasts under a cold shower so the blood circulates. I super hope nobody catches on because i really really really really really really want to keep it hidden.<br>\r\n<br>\r\nMom oedered me a compression shirt to hide my boobies. Yes my boobies (i worked hard for them). Sadly though i hate to admitthat i have been ordered to keep it on. Its just as well. Come to think of it, mom really freaked when she found my AA's after a hug, (yes i hug my mommy as i love her to literal death eventhoughitakethissecretwithme) we have a mutual agreement now until my girls disappear. There's gonna be some bittersweet moments but now i dont have a problem hiding in plain sight.</span></div></div>",
            "created":1600070940,
            "id":2902673,
            "title":"Entry #8 (trigger warning)"
        },
        "11111112":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "LenLynn",
                "To the Mat",
                "Out of the closet for Hanukkah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How was the romance between lenny and Lynn?<br>\r\nHow about Doug and Lenny on the mat?<br>\r\nWhat about David's coming out story?</span></div></span></div>",
            "created":1600070700,
            "id":2902668,
            "title":"Helen's friends"
        },
        "12":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Jo",
                "Dad",
                "Mom (please read last)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jo<br>\r\n<br>\r\nDad<br>\r\n<br>\r\nMom (please read after everything else)</span></div></span></div>",
            "created":1598079780,
            "id":2889353,
            "title":"Character Background"
        },
        "121":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Jo's life before hrt",
                "END"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nI have been mentioning Jo a lot for the past couple of weeks. I notice that i never properly introduced you to her (or is it her to you). I have been debating whethee or not to write about her because well, she's like my sister and i want to do everything i can to protect her. Without further ado, this is how i met Jo.<br>\r\n<br>\r\nJoseph Tyler Greene was born on October 1st 2003 in Placerville Jefferson en route to the hospital. His mother Delilah and his father Bill were a very well off family. (Bill had discovered a large oil deposit while digging a new well so they could be self sufficient and not worry about water when times got tough such as a drought or...um... actually thats pretty much all i can think of at the moment, I'm starting to wonder among other things why they were digging a well in the first place they lived right outside the city limits they could easily tap into the water supply exiting the sewage treatment center not even a quarter mile from their front door. (Please don't comfuse Placerville, Jefferson with Placerville California as they are on opposite ends of the country.))<br>\r\n<br>\r\nAnyway so yeah the Greenes are loaded. Maybe somewhere between Melania Trump and Michael Cohen. The get a sizable check in the mail. The one thing they do differently than most millionaires is that they are the most levelheaded people i have ever met... well not technically in person but thats another story.<br>\r\n<br>\r\nBack to Joseph. Ever since he could talk, his parents could tell he was not like the other boys. One time when he was 5, he had friends over for a playdate. Lillian, Jacob, and Melody were close but really only friends by proximity as their parents were neighbors and Delilah would sometimes be asked to babysit. One time when Jacob was home sick, Lilian and Melody brought over a two dolls each. Delilah wanted to experiment with the childrens interests so she set out a video game aimed at both genders to entice the girls to play with Joseph. Well Joseph didn't want to play the video game as it didn't appeal to him. He instead insisted the girls help him make a makeshift dollhouse so that they could play with him. This was one instance that really started the wheels turning on the Greene family's dynamic.<br>\r\n<br>\r\nWhen Joseph was 8 years old he decided to come out to his parents. To say they were suprised would be a tremendous act of the upmost disrespect. I think that means that they would be offended and take actions (lawsuit?) against you. When they asked little Joseph how he(now she) would like to be called, she told them to just call her \"Jo. You know, like that one Helen Hunt Character from the movie about the tornado chasers with that cutie Bill Paxton who dressed like a badass instead of a wearherman and the hot asshole Jonas (all when they were younger of course)(now you see why she's my rock) not Josephine not Jolene not Jocelyn or anything like that just two letters J-O i like my name but Joseph is for a boy Jo can be anyone even a girl yeah especially a girl and thats why i want to be Jo im not losing my name you won't get confused and i won't need to correct you when you get it wrong as you already call me Joe just drop the E... (takes deap breath)\"<br>\r\n<br>\r\nWhile her mom and dad were supportive, she went on HRT (hormone replacement therapy for those that dont know though im pretty sure thats a small percentage in a place like this... well maybe it was nescessary... IDK now ya know), the community was not. It didn't matter that they were prominent members of the PTA, they were shunned and eventually, to prevent the school from closing down, Bill decided to move the family as far away from there as he could think. They changed Jo's records to reflect her prefered gender, asked if she wanted \"her body to reflect her mind\" (get bottom surgery), they were on the first flight to Croatia (first class of course). They spent a year there until they were certain they would be welcome in any comunity with nobody knowing about the events that transpired over the last 2 years. When they returned to the US, they moved down the street from me.<br>\r\n<br>\r\nI met Jo about two years ago and seeing as we were both outcasts, she was still quirky as ever (its pretty much a given that you guys know this by now) (i really need to stop using parentheses... hey am i the only one that sees the irony of \"You can't spell Parentheses without Parent\" though it's more funny than ironic... i think... i hope... oh well) safe to say we became instant friends. Last month, i came out to Jo. Can you imagine the look on her face when i spilled my guts to her, she never would have ever guessed. She was so impressed by my courage, she swore that she would keep my secret to the grave. Well being my rock, she felt it not only necessary but an obligation to tell me her story. And that's the story of Jo Taylor Greene.<br>\r\n<br>\r\nOf course she didn't know i would ever write about it so if you ever see her PLEASEPLEASEPLEASEPLEASEPLEASE don't tell her i said anything.<br>\r\n<br>\r\nJo, my confidante, my gift from the heavens, my best friend, my sister, i love you and i hope you forgive me. After all you were the one who told me be brave, be bold, and most importantly you taught me its better to speak your mind than to let it drive you crazy. So really its your fault. I did learn from the best.<br>\r\n<br>\r\nPs. Bill, Delilah, if you're reading this, please dont sue me (i changed your names and where you've lived)</span></div></div>",
            "created":1598079840,
            "id":2889354,
            "title":"Jo"
        },
        "1212":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Thanks for reading. It was fun. Love you♥️</span></div></span></div>",
            "created":1598079900,
            "id":2889355,
            "title":"END"
        },
        "122":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Allen's life growing up",
                "End"
            ],
            "content":"<div class=\"\"><div> <span>The Memoirs of Allen Rodriguez<br>\r\n<br>\r\nHello. My name is Allen Leonardo Rodriguez, my friends call me Lenny. I only have one thing to say. Be careful who you tell your secrets to.<br>\r\n<br>\r\nWhen i was a young boy, i had a very big secret. When i was about 5 years old, my mother liked dressing me up like my twin on Halloween. Mind you i have a twin sister. This went on until my sister started deciding what she wanted to wear for herself. Luckily we were always dressed in unisex costumes. At 5 it was an egg. At 6 it was a UPS box. At 7, when my sister decided she wanted to go as an elf from Rudolf the Red Noses Reindeer my mom said that i could decide next year. Off i went trick-or-treating in a pair of my sisters red tights and a new girls tunic. Mom said it was cheeper to make the costume than to buy one so i now owned a pair of tights, ballet flats, a green girls tunic that went down to my thighs, and a wide belt that cinched everything skintight and gave me a bit of a feminine shape. I oh so wanted to say that i hated the experience but i was so comfortable in the tights and the tunic that after Halloween, i decided to keep them. The tights were warm and the tunic was nice enough to sleep in. My mom said nothing so i figured it was fine. The next Halloween, i got to decide what we would wear. I decided on Spiderman. Well as you can imagine, my sister hated and i mean HATED all things comic book. After that year my mother decided we were old enough to wear our own costumes.<br>\r\n<br>\r\nBack to the tights. It always comes back to the tights. My favorite, and only pair of red tights. That is, until i got to high school and i was able to drive away to buy a new set of tights \"for my sister\" of course. I continued to wear tights until i met the love of my life after college in 1997. We married in 2001 and she gave birth to our one and only son Leonard, we call him Lenny, after me of course.<br>\r\n<br>\r\nThe following year, things got really heated. It was Lenny's second Halloween as he was born a week ans a half earlier. I got the idea to dress as someone i truly admire, the love of my life, my heart and soul, my rock, my wife, Elena Vasquez Rodriguez. I felt the one thing i could show her was how much i admired her. I did not realize that the woman who saw me that day, October 31, 2003, was no the woman i married. She crushed my soul. I had to sleep at my sister's because she told me that if i ever went back she would do something to put heaven at risk. The next afternoon, my sister called work and said to leave work early as she had something she needed to show me. When i got back to my sisters house she was in tears. Not long after reading the divorce papers, i was also in tears.<br>\r\n<br>\r\nWell safe to say the divorce was filed and i did not contest to granting Ellie Full custody of Lenny. She got the house, the car, my life insurance policy, everything. She filed a restraining order so that i could never see her or my son ever again. Well, there is one thing i got. When he turns 18, he will have the oportunity to contact me. If he so chooses. This Halloween marks the 15th anniversary that the divorce was finalized. Cruel fait, but i know in just another year, i get the hope of seeing the man my son has become.<br>\r\n<br>\r\nIf i could tell him something, i would tell him this: Leonard Alejandro Vasquez Rodriguez, wow, i can't believe you're already 17. It seems like it was only yesterday that i held you in my arms as i sang you to sleep.want you to know that i love you, i miss you, i can't wait to see you. I know that if you are anything like me, i pray for you. Nobody should have to go through the burden of carying a skeleton in their closet. That being said, if you do have any, bury them. Take your secrets to the grave. If you don't, you will spend the rest of your life atoning for everything you thought you knew about yourself begging for forgiveness from the only person in the world you care anything about. You were not a mistake and I still love your mother. I know this is hard but i leave you with this, coming from an exiled crossdresser, toughen up and be a man. Happy Halloween my son.</span></div></div>",
            "created":1598080020,
            "id":2889357,
            "title":"Dad"
        },
        "1222":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Thanks for reading. It was fun. Love you♥️</span></div></span></div>",
            "created":1598080140,
            "id":2889358,
            "title":"End"
        },
        "123":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Life of Ellie Vasquez and Delilah Baker",
                "End"
            ],
            "content":"<div class=\"\"><div> <span>Dear Diary,<br>\r\n<br>\r\nSometimes its hard to be a mom. Some days you get complete unconditional love from your child. Other times, they seem distant. After Allen left, it took a toll on me and the divorce I filed tore me to shreds. I spent years trying to understand what was going on with him. I loved that man nore than life itself, but i was too immature to get passed one minuscule detail of my husband's life. It was the worst mistake of my life and i regret it wholeheartedly to this day.<br>\r\n<br>\r\nThen it started happening again with my son Lenny. You know, he is just like me in a lot of ways. Jo like to call him neurotically paranoid. Where does everyone think he gets that from?<br>\r\n<br>\r\nHe didnt think i noticed that he got women's shoes on \"accident\". Or to check the store policy online before even going to the store. He didnt think i could tell the difference between a salon visit and a barbershop cut. I find it kind of funny how he thought i couldnt see the subtle highlights in his well maintained hair.<br>\r\n<br>\r\nHe didn't realize that i studied shakespeare in highschool with a little psychology. That maybe i cracked their code ages ago. I get a kick out of how subtle their \"inside\" jokes can be.<br>\r\n<br>\r\nHe didnt realize that i go into the crawl space under his room when i found a false floor. He never realized that i went to school with Delilah Greene (formerly Baker) and had stayed in contact with her after i moved from Placerville. Seeing my best friend coming back we thought it best to let the kids develope their own friendship so we thought it best to keep ours secret. And that it was my talks with D that sparked her idea to involve Jo in the process of drawing out my sons interior conflict.<br>\r\n<br>\r\nHe doesn't know i gave Jo the money to buy the Hypnotist CD to see first hand how he really acts when he is being his true self. After that bout with amnesia, i knew it was the perfect time to crack a little more of the shell he put up. I just wish he'd taken me instead of his friends' but with Jo with himi knew i had nothing to worry about. What did start worrying me was his self medication. He didnt think i noticed his budding breasts. Well at that point i knew it was time to write this letter.<br>\r\n<br>\r\nNow this is where i adress Francine the birthday girl (something about a lamp and a ball?) by elephant in the room i mean to say who i wrote this for.<br>\r\n<br>\r\nTo my beautiful Daughter Helen,<br>\r\n<br>\r\nYes, i know your name. However, rather than putting it out there for all the world to know, i want you to be the one to tell me when you are ready.<br>\r\n<br>\r\nI want to tell you that I love you more than anything in the world, and the fact that you hide in the closet for my sake shows how much you respect my reputation. I know how hard harboring secrets can take a toll on your psyche so to do as you are shows me (though misguided through no fault of your own) how much you love me. I am deeply sorry if you feel you had to do anything like that to make me love you. There is nothing, and i mean absolutely nothing, no problem or question you cannot come to me with. You are my baby. Remember, maybe it hasn't always been so but, Momma knows best.<br>\r\n<br>\r\nLove Always<br>\r\n<br>\r\nMom<br>\r\n<br>\r\nP.S. i wanted to wait until after you came out of the closet to give you this. Bye Sweetie</span></div></div>",
            "created":1598080740,
            "id":2889360,
            "title":"Mom (please read last)"
        },
        "1231":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Ellie",
                "Delilah",
                "Narrator"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Follow Ellie growing up or Delilah or 3rd person omniscient</span></div></span></div>",
            "created":1598080800,
            "id":2889361,
            "title":"Life of Ellie Vasquez and Delilah Baker"
        }
    },
    "info":{
        "author_id":"hallens25",
        "author_name":"Hallens25",
        "brief_description":"I've hit a roadblock on an epilogue so i want see what you guys come up with thanks.",
        "created":1598079420,
        "description":"<td align=\"left\" class=\"norm\">This is the diary of the daily life of Helen Rodriguez. She's just you average girl. She has a lifelong secret that only one other person in the world knows. She was assigned male at birth. Watch her day to day as she navigates the perils of the closet.<br>\r\n<br>\r\nPlease keep it PG. Thanks❤</td>",
        "id":2230112,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600070940,
        "modified":1600070940,
        "pretty_title":"Helen's Diary"
    }
}