{
    "chapters":{
        "1":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "You(Male 2nd person perspective)",
                "You(Female 2nd person perspective)",
                "One of the main characters.",
                "Kyosuke Kamijo(Violin boy, Sayaka's love interest)",
                "Some other character"
            ],
            "content":"<div class=\"\"><div> <span>Let's start by choosing the perspective the story will be told from.<br>\r\n<br>\r\nSecond person perspective where you control a male or female student going to school with the main characters(Aside from Kyouko, she never went to same school as others).<br>\r\n<br>\r\nOr third person perspective where you control one of established characters in the story!</span></div></div>",
            "created":1487826000,
            "id":2281267,
            "title":"First things first!"
        },
        "11":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Madoka",
                "Kyouko",
                "Homura",
                "Mami",
                "Sayaka"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright! Which of the main cast would you like to focus on first?</span></div></span></div>",
            "created":1487826000,
            "id":2281271,
            "title":"You(Male 2nd person perspective)"
        },
        "111":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Start with story!",
                "Start with feet!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good choice! Now do you want to go straight to bussiness and start with cute Madoka's feet? Or have some story to it?</span></div></span></div>",
            "created":1487826000,
            "id":2281281,
            "title":"Madoka Kaname"
        },
        "1111":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "You are new in the class and Madoka befriends you",
                "One day you just happen to witness Madoka patrolling for Witches",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, last question before we start. How do you want the story to begin?</span></div></span></div>",
            "created":1487939940,
            "id":2281585,
            "title":"Start with story!(Madoka)"
        },
        "1112":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Madoka saw you looking at feet pics on your phone and is curious about it",
                "You are controlled by a witch to just pounce at Madoka's feet",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hehe, going straight for our pink haired main character's feet huh? Well then what's the situation?</span></div></span></div>",
            "created":1487941020,
            "id":2281589,
            "title":"Start with Madoka's feet!"
        },
        "112":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Start with story!",
                "Start with feet!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Very good choice! Now, do you prefer to \"start with feet\" and get straight into footy situation with our hot redhead, or rather take things slowly and start with some story first?</span></div></span></div>",
            "created":1487826000,
            "id":2281274,
            "title":"Kyouko Sakura"
        },
        "1121":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "You meet Kyouko playing DDR at an arcade",
                "Kyouko happens to save you from a Witch!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well then how should we begin?</span></div></span></div>",
            "created":1487826000,
            "id":2281279,
            "title":"Start with story(Kyouko)"
        },
        "1122":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Kyouko is crashing at your place and discovers your foot fetish",
                "Kyouko dominates you after seeing you steal from abandoned church!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright! I swear this is the last question before we get into the bussiness. What's the situation?</span></div></span></div>",
            "created":1487826000,
            "id":2281278,
            "title":"Start with Kyouko's feet!"
        },
        "11222":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "You obediently start licking(You have a foot fetish)",
                "You reluctantly start licking(You don't have a foot fetish)",
                "You are saved by Mami appearing and stopping Kyouko from killing you!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size2\" style=\"\">(Kyouko is her more brutal \"Kill or be killed\" philosophy self in the beginning of this story. She haven't encountered the other girls, aside from Mami with whom she has shared past with, yet.)</font><br>\r\nOne day after school you heard a few people in your class talking about an abandoned church in town, supposedly once belonging to a very popular faith, which however quickly disappeared after it's creator commited suicide, after killing his whole family in a fit of alcohol-induced madness. It piqued your curiousity, as you never knew anything about a church like that, and since you had entire free day afterwards... why not check it out? They also mentioned something about ghosts haunting it... but come on, ghosts don't exist!<br>\r\n<br>\r\nYou did as you planned. After you entered the big abandoned building, you couldn't help but feel as if someone was observing you, but you dismissed that as just your imagination playing tricks on you due to creepy atmosphere of the place. You walked around the hall, and then suddenly you noticed a shining necklace on the ground. It was dusty, clearly lying there for some time, but seemed well made, possibly even from real silver or gold. It would be a waste letting it just lay there, so you pocketed it and went on your way checking the rest of the church...<br>\r\n<br>\r\nAt least that was your plan, not even a minute passed after you pocketed the old necklace before you saw a shadow of someone going straight at you. Next thing you felt was a sharp pain in your chest caused by a kick!<br>\r\n<br>\r\nWhen you opened your eyes there was a red haired girl standing above you. She was wearing a hoodie, shortpants and boots, rather average clothes, but she was also holding a rather large spear at your neck, and looked at you with anger.<br>\r\n\"A-are you a ghost?!\" You muttered quickly in panic and surprise<br>\r\n\"Ghost? Are you an idiot? There are no ghosts here. Just me, and you, a retard who thinks he can steal without any consequences.\" Said the girl<br>\r\n\"S-sorry! I didn't know it was your church!\" You say in panic<br>\r\n\"It's not mine, it belonged to my father. But that doesn't mean I will just let some losers take apart everything left there!\" The girl seems to look a bit distant<br>\r\nYou gulp nervously<br>\r\n\"Now give me a reason to not stab you with my spear right here and now.\" The girl says, she seems serious...<br>\r\n\"P-please don't kill me! I will do anything! Take my money if you want!\" You start begging<br>\r\n\"Phew, I could as easily take it from your corpse.\" The redhead shrugs, still keeping her spear at your throat<br>\r\n\"I beg you! I will do anything...\" You keep begging<br>\r\n\"Anything? What use could I have for someone like you?\" Asks the mysterious girl <br>\r\n\"I-I dunno! I will... lick you feet or whatever! Just don't kill me!\" You say first random thing that came to your mind<br>\r\n<br>\r\n\"Wow, you would just humiliate yourself like that just to have your pathetic life spared? Well then, why don't we see if there's truth to your words?\" The girl suddenly smirks, and she takes her spear off your neck for a moment, and starts removing one of her boots<br>\r\nYou could probably try to escape while she is busy doing that... but something tells you it's a really bad idea to disobey that girl at this moment.<br>\r\n<br>\r\nFinally the redhead puts her foot right in front of your face. It looks quite pretty despite the girl's personality being rather rough. The sole is nice and smooth, and her unpainted toes also look surprisingly cute and sexy... if you are into those things at least.<br>\r\n\"Well, are you gonna get to it, do you prefer me to just finish you with my spear?\" Says the redhead wiggling her toes in front of your face<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1488032160,
            "id":2282090,
            "title":"Stealing is bad!"
        },
        "112221":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "You accept her deal! Will be awesome to have girl like that live with you!",
                "You refuse the deal! She tried to kill you a moment ago!",
                "Before you answer, Witch labirynth suddenly surrounds you and Kyouko."
            ],
            "content":"<div class=\"\"><div> <span>You didn't consider yourself much of a masochist, but always found undeniable attraction in cute female feet, and the redhead's definitely qualified as that. Without much hesitation considering your current situation, you stick out your tongue and take a lick of the girl's sole. It tastes quite salty, probably from the sweat, it's not a bad taste though. Kinda encouraged by that first taste, you start taking more licks of her sole.<br>\r\n<br>\r\n\"Hm... that feeling ain't too bad. Keep licking and I might spare you after all!\" The girl says seeming to like the feeling of your tongue, as she relaxes her arm and points her spear to the floor now.<br>\r\nYou don't have to be told twice! The redhead moves her foot a bit from time to time allowing your tongue to reach still dry areas.<br>\r\n\"You seem quite enthusiatic doing that. Do you like the taste of my feet or something?\" The girl asks after a while<br>\r\nYou only nod before going back to licking. The redhead now positions her toes before your mouth allowing you to lick inbetween them. You find yourself loving the feeling of her toes wiggling while you put your tongue between them, savoring their taste.<br>\r\n\"Gotta say I never expected to have a guy lick my feet like that, but it sure feels good after playing DDR for a few hours beforehand...\" The girl mutters to herself<br>\r\nAs you keep licking between her cute toes, the girl seems to be thinking about something for a moment.<br>\r\n<br>\r\n\"Hmm... what would you say for a little deal?\" Asks the redhead suddenly, her expression changing into a grin, she takes her foot off your face for a moment<br>\r\n\"A deal?\" You ask, still lying on the floor<br>\r\n\"Yup, you see I am kinda homeless at the moment, and could use a place to crash in for a while. So I will just move in to your place, and in exchange forgive you for trying to steal from this church. You will also become my foot boy, since it would be nice to get some feet pamperin' after a tiring day.\" She says<br>\r\n\"B-but... I don't even know who you are?\"You say, not sure what to say to a proposal like that, it was rather unfair towards you, but a perspective of having cute girl like that give you her feet to pamper every day was kinda tempting...<br>\r\n\"Name's Kyouko, that's all you need to know. So, are you gonna agree? Or should I find another punishment for your stealing? Considering that you seem to enjoy yourself at my feet, so it hardly counts as one.\" Says the redhead, she clearly doesn't seem willing to give you real choice there, and refusal will probably not be too pleasant for you...</span></div></div>",
            "created":1490477640,
            "id":2294700,
            "title":"First taste of Kyouko's feet."
        },
        "113":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Start with story!",
                "Start with feet!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good choice! So, how do you want to start with mysterious Homura? Go straight for her feet, or have some story to it first?</span></div></span></div>",
            "created":1487826000,
            "id":2281283,
            "title":"Homura Akemi"
        },
        "1131":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "You are saved from a witch by Homura",
                "You have a crush on Madoka, and ask Homura for advice...",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Taking things slow is probably best with someone like her! Well how do you want story to start then?</span></div></span></div>",
            "created":1487941560,
            "id":2281591,
            "title":"Start with story!(Homura)"
        },
        "1132":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Akuma Homura senses your fetish and decides to toy with you using her feet",
                "Homura dominates you for getting to close to Madoka",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Nice choice! Although problem with Homura is that I can't imagine her letting anyone other than Madoka consensually touch her feet in most cases, unless she was her evil version from the Rebellion movie(Which seriously ruins the world and everything if you ask me...), Akuma Homura.</span></div></div>",
            "created":1487941440,
            "id":2281590,
            "title":"Start with Homura's feet!"
        },
        "11323":{
            "author_id":"rutinacuzza",
            "author_name":"Rutin Acuzza",
            "choices":[
                "Continue this path",
                "New scenario"
            ],
            "content":"<div class=\"\"><div> <span>You are what people would consider a creep. Secretly taking photos of girls when they're changing in and out of their gym clothes. For a period of time, you have managed to get away with it scot-free but your perverted deeds will not go unpunished.... Among the girls who fell victim to your voyeuristic photography was Madoka Kaname who you didn't think of much at the time. Soon you will discover that snooping on this girl was the biggest mistake of your life. Homura Akemi, a classmate of Madoka somehow found out about your perverted deeds towards Madoka. She does not tolerate the thought of having one of the boys laying their perverted eyes on her dear Madoka. Having one of them take photos too just fuels her anger. She finally decides to take action, when she came to you personally. She handed you a crumpled note telling you to meet her in an alleyway after school. Then she walked away instantly. You tried to get her to speak but to no avail. She ignores your words as she left. Despite this, you decided to meet up with her anyway.</span></div></div>",
            "created":1550656560,
            "id":2620223,
            "title":"Perverted deeds do not go unpunished"
        },
        "114":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Start with story!",
                "Start with feet!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good choice! Now how do you want to start with sweet Mami? Go straight for her feet, or have some story happen first?</span></div></span></div>",
            "created":1487826000,
            "id":2281284,
            "title":"Mami Tomoe"
        },
        "1141":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "You are Mami's classmate(One grade above other girls)",
                "Mami saves you from a witch, and you decide to repay her somehow.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good! Well then how do you want your story with Mami to start?</span></div></span></div>",
            "created":1487941860,
            "id":2281594,
            "title":"Start with story!(Mami)"
        },
        "1142":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Seeing Mami looking tired at school, you offer her a foot rub!",
                "While having tea with Mami, she suddenly starts playing footsie under the table!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last question before we get going then: What situation do you want?</span></div></span></div>",
            "created":1487943000,
            "id":2281598,
            "title":"Start with Mami's feet!"
        },
        "115":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Start with feet!",
                "Start with story"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If that's what you want... but do you prefer to start with Sayaka's feet, or have some story happen between you and her first?</span></div></span></div>",
            "created":1487826000,
            "id":2281285,
            "title":"Sayaka Miki"
        },
        "1151":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Seeing her upset over Kyosuke and Hitomi hooking up, you give her a foot rub!",
                "She was told you were badmouthing her, and decides to punish you!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So... straight to Sayaka's feet then? Alright, how should it be like?</span></div></span></div>",
            "created":1487943300,
            "id":2281599,
            "title":"Start with Sayaka's feet!"
        },
        "1152":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Sayaka saves you from a witch, so you decide to repay the debt somehow.",
                "You had a crush on Hitomi, but she chosen Kyosuke. You and Sayaka bond over that",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay... so how should your story with Sayaka start?</span></div></span></div>",
            "created":1487943600,
            "id":2281603,
            "title":"Start with story!(Sayaka)"
        },
        "12":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Madoka",
                "Kyouko",
                "Homura",
                "Mami",
                "Sayaka"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright! Which of the main cast would you like to focus on first?</span></div></span></div>",
            "created":1487826000,
            "id":2281286,
            "title":"You(Female 2nd person perspective)"
        },
        "13":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Homura",
                "Kyouko",
                "Madoka",
                "Mami",
                "Sayaka"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nice! Well then, who would you like to be the main character in the story?<br>\r\n</span></div></span></div>",
            "created":1487826000,
            "id":2281287,
            "title":"Start as one of the characters!"
        },
        "131":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Homura spends time with Madoka and discovers she is attracted to her feet",
                "Homura decides to enslave Sayaka to stop her from dying and saddening Madoka",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright! What should the story be about(At least initially)?</span></div></span></div>",
            "created":1487826000,
            "id":2281289,
            "title":"Homura's Story"
        },
        "1312":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Homura somehow shrinks Sayaka.",
                "Homura decides to just dominate Sayaka with her feet to enslave her.",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>And so once again, Homura woke up in her bed, on the day when she was supposed to go to her new school and meet Madoka. All the other timelines so far ended in failure, Madoka either died or gave into despair... it was unacceptable for Homura to let it happen however. Finally after all those timelines however she managed to pinpoint the main problem causing her failures, Sayaka Miki, Madoka's best friend at school. At first Homura considered her a rather harmless idiot, but it quickly changed after in one timeline after another Sayaka caused her own death, and then indirectly made others, including Madoka die as well. On top of that, death of her best friend definitely had big impact on Madoka giving in to despair. With this knowledge, Homura already knew what had to be done: Sayaka Miki had to be taken care of somehow, so that she doesn't cause grief to Madoka or cause others to die. Killing her was obviously out of question, since Madoka definitely wouldn't want that, but Homura needed some kind of way to neutralize her until Walpurgisnacht is dealt with...<br>\r\n<br>\r\nAs usual on the day she came back to, Homura went to school. She already done that way too many times for it to be stressful like it was on first time. The day played out as it usually did, she met Madoka, and her class yet again. She knew that day almost like the back of her hand, along with many possible variations of it. Madoka and Sayaka would come back home together, and they would have a chance of meeting Kyubey or getting caught in a witch labirynth which would lead them to meeting Mami. Homura made sure that neither of those would occur this time, and once the two split, she followed the blue haired girl to her house. Slowly going after her on the staircase, and going in with her(By stopping time when she opened the door and simply walking inside). Before she unfroze the time however Homura had to decide how to neutralize Sayaka...</span></div></div>",
            "created":1488412140,
            "id":2283918,
            "title":"Getting rid of the problem source"
        },
        "132":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Kyouko accidentally discovers she likes feet while spending time in Mami's house",
                "Kyouko finds out Sayaka has foot fetish and decides to blackmail and enslave her",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Great choice! What should the story be about?</span></div></span></div>",
            "created":1487826000,
            "id":2281293,
            "title":"Kyouko's Story"
        },
        "133":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Homura hurts her foot, and while looking at it Madoka realizes it's really cute.",
                "Madoka discovers that smell and taste of her feet addicts people.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cute choice! Well then what should the story be about?</span></div></span></div>",
            "created":1487826000,
            "id":2281295,
            "title":"Madoka's story"
        },
        "134":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Mami decides to admit having a foot fetish to Sayaka...",
                "Mami ties up Homura(Using her powers) and dominates her with feet",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nice choice! What should the story be about then?</span></div></span></div>",
            "created":1487826000,
            "id":2281298,
            "title":"Mami's story!"
        },
        "135":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "While spending time with Madoka, Sayaka realizes that she has a foot fetish.",
                "Sayaka decides to take revenge on Hitomi and Kyosuke!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whatever floats your boat! So, what should the story be about?</span></div></span></div>",
            "created":1487826000,
            "id":2281300,
            "title":"Sayaka's story"
        },
        "15":{
            "author_id":"christyadot",
            "author_name":"P O S T  B O Y",
            "choices":[
                "That cute trio of girls(2nd person perspective)",
                "That upper class student with drill hair.",
                "That red haired girl that hangs around the school.",
                "The new black haired girl.(2nd person perspective)"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cbrown\">Okita Risako</span>,was walking to Mitakihara middle school to start her day there. Until a weird bunny cat creature approached her. \"Oh my G-Gosh I-I must be hallucinating \"she frantically thinks. \"Okita Risako, make contract with me,and become a magical girl\" it said with fake emotion. \"H-how do I that?\" Okita played along with strange creature. \"By making a wish\" it said while studying her. \"A-A wish huh,well I wish for the power to mutate girls into big and beautiful amazons to protect me. I want to feel their powerful skin and muscle. And more importantly,I want indulge on their mighty feet,feeling their lenghty soles with my fingers,smelling their many scents. And that's only the <i><b>beginning</b></i>\" Okita who is almost screaming and stills think that this is all just an illusion. \"Okay\"the creature said.<br>\r\n<br>\r\n<br>\r\nSuddenly Okita felt something being pulled out of her,and a bright light suddenly blinded her. After a few minutes, the light resides and there was a Hazel colored gem on the ground. When she reached down to pick up the gem, it has suddenly turn into a ring on her right pinky. \"S-So it wasn't a hallucation\" she shakily stutters.And she couldn't find the strange creature.<br>\r\n<br>\r\n\"Maybe I-I can find it later\"she says while continuing her walk to school...and finding some girls to test her new powers on.<br>\r\n<br>\r\n\"Author note: Okita can turn girls into aged up Amazons with sharp claw on their hands and feet,and teeth to match (\"normal\" ones are around nine to thirdteen feet tall.).The changed girls are marginally more buff than amazon from dragon, but they're still reasonably muscular.) They will become much more aggressive,primial,and...frisky, but their core personality will stay mostly the same. Because of their new size, their feet will be much bigger than any adult human's feet on earth. They have strange tribal markings on bodies. And they will be mildly attracted to our protagonist. And Okita's powers will have very strange side effects other magical girls...\"</span></div></div>",
            "created":1514022900,
            "id":2431707,
            "title":"One weird magical girl..."
        },
        "151":{
            "author_id":"christyadot",
            "author_name":"P O S T  B O Y",
            "choices":[
                "...a gun pointing at your head.",
                "...a utterly gigantic pink marked hand reaching for you."
            ],
            "content":"<div class=\"\"><div> <span> <span class=\"cbrown\">\"Those three will be perfect...</span> you said while giggling like a villain straight out of Saturday cartoon. With that in mind,you start run towards the trio's route(and goddamn you're <b>fast</b>)<br>\r\n<br>\r\nAnd lo and behold, the three girls were walk downing,and having general good time walkinh to school. <span class=\"cbrown\"> \"Now it's time for you three to get some big <b>upgrades</b>\"</span> you whisper in anticipation,and hiding behind a few trees. With no more words,you aim your wand and fire at your targets.<br>\r\n<br>\r\nAfter that you quickly went back to your hiding spot There you hear the three girls' voice deeping with every grunts and moans they make. Until three primal and beastial(but strangely feminine) roars shook the very earth and trees around you. Peeking your head at out from your hiding spot. You see three massive shadow( the biggest one was big as a damn bus.)..and you also see..<br>\r\n</span></div></div>",
            "created":1518528420,
            "id":2452417,
            "title":"That cute trio of girls "
        },
        "154":{
            "author_id":"christyadot",
            "author_name":"P O S T  B O Y",
            "choices":[
                "watch in amazement",
                "run towards the school for safety!"
            ],
            "content":"<div class=\"\"><div> <span>Giggling not so sanely to yourself as you spot your first prey. You materialized your wand,and shot the black haired girl in the back with your magic.<br>\r\n<br>\r\n<br>\r\n<span class=\"cbrown\">heheheh successs! I'm real magical gir-why everything's grey and stop moving?</span> you suddenly question and look around your surroundings.<br>\r\n<br>\r\nSuddenly the same girl in a outfit similar to yours slam you into a wall. <br>\r\n<br>\r\n<span class=\"cgrape\">Who are y-you,an-d you did do to m-e-e-e!</span> the girl said while her voice becoming more unsteady and deeper by the second. And her canines are getting sharper...<br>\r\n<br>\r\n<span class=\"cbrown\">I-I'm Okita Risako,please don't hurt me..</span> you tearfully said.<br>\r\n<br>\r\nThe girl was about to reach in her strange shield...until she drops to ground,and letting you go.<br>\r\n<br>\r\nThe girl's frail body began to gradually stretch,swell,and grow.  Her hair was getting wilder and longer. Her pupils kept getting back and foward from tiny to big. The jewel on her hand is getting smaller and absorbed by her body?Her outfit and shield is begining to tear apart..and reform?(while the developing smell from her feet that is growing in her soon to be destroyed lack leggings/boots is turning you on..\" And strange purple and pitch black energies has began to swirl around her. And finally,the world seem to turned to back to normal.<br>\r\n<br>\r\n<span class=\"cgrape\">W-ha-at is hap-p-p-pening to <b>MEEEEE</b></span><br>\r\nThe poor girl practically roars like a beast at this qoint.<br>\r\n<br>\r\nYou..</span></div></div>",
            "created":1516137240,
            "id":2441702,
            "title":"The girl."
        }
    },
    "info":{
        "author_id":"darkblade7557",
        "author_name":"Darkblader",
        "brief_description":"Magical girls finally get some attention paid to their feet!",
        "created":1487878560,
        "description":"<td align=\"left\" class=\"norm\"><font class=\"size5\" style=\"\"><div align=\"center\">Welcome!</div></font><br>\r\n<br>\r\n<font class=\"size4\" style=\"\">Let's start by setting a few basic rules:<br>\r\n<br>\r\n1. No hardcore fetishes(Like scat, cannibalism, expansion or watersports)<br>\r\n2. All kinds of foot fetish(Tickling, smelling, worship, footjobs) are welcome<br>\r\n3. No character deaths(I know series had quite a few... but let's at least try to avoid it unless ABSOLUTELY necessary)<br>\r\n4. NO ONE SENTENCE CHAPTERS<br>\r\n5. Shrinking is alright, as long as story remains feet focused<br>\r\n<br>\r\nWith that you should be ready to go! Here's a quick reminder about how the main characters look like:<br>\r\n<span class=\"cppink\"><br>\r\nMadoka Kaname</span>: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://vignette4.wikia.nocookie.net/madoka/images/1/12/Madoka.png/revision/latest?cb=20150430165730\" target=\"_blank\">http://vignette4.wikia.nocookie.net/madoka/images/1/12/Madoka.png/revision/lates...</a><br>\r\n<span class=\"cgrape\">Homura Akemi</span>: <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/8f/66/9b/8f669b7b3cf254548fc75e5264470a72.png\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/originals/8f/66/9b/8f669b7b3cf254548fc75e52...</a><br>\r\n<span class=\"cred\">Kyouko Sakura</span>: <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://images.puella-magi.net/thumb/8/8c/Kyouko_character_art.png/300px-Kyouko_character_art.png?20110205200127\" target=\"_blank\">https://images.puella-magi.net/thumb/8/8c/Kyouko_character_art.png/300px-Kyouko_...</a><br>\r\n<span class=\"cyellow\">Mami Tomoe</span>: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://ami.animecharactersdatabase.com/images/2552/Mami_Tomoe.png\" target=\"_blank\">http://ami.animecharactersdatabase.com/images/2552/Mami_Tomoe.png</a><br>\r\n<span class=\"clteal\">Sayaka Miki</span>: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://vignette1.wikia.nocookie.net/madoka/images/e/e0/Sayaka_Miki.png/revision/latest?cb=20110116183201\" target=\"_blank\">http://vignette1.wikia.nocookie.net/madoka/images/e/e0/Sayaka_Miki.png/revision/...</a></font><br>\r\n<font class=\"size45\" style=\"\"><br>\r\n<div align=\"center\">Have fun!</div></font><br>\r\n</td>",
        "id":2113150,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1550656560,
        "modified":1550656560,
        "pretty_title":"Madoka Magica foot fetish stories"
    }
}