{
    "chapters":{
        "1":{
            "author_id":"baby-jer",
            "author_name":"Baby-jer",
            "choices":[
                "Mark agrees to do be Amy's baby",
                "Mark refuses"
            ],
            "content":"<div class=\"\"><div> <span>Mark and Amy have been married for 15 years. Mark is coming home from work and Amy stops him at the door. <br>\r\nShe is holding up a phone and she ask \"What is this?\"<br>\r\nMark responds \"I don't know what that is. Where did you get that?\"<br>\r\n\"That is funny, it seems to have all of your information on it, or at least someone who looks just like you!\"<br>\r\nAmy had found Mark's burner phone. Mark hadn't even put a password on the phone he never thought anybody would ever find it. That phone had all of his contact information and all of the information about all of women that he had been sleeping with.  It had all the websites that he and visited and all of the accounts that he had been using to meet other women. It also had all of the pictures Mark had taken and sent to other women. <br>\r\nMark was a sex addict and now his wife found everything! He was devastated! He knew that his world was over, he didn't know what to say. He just stammered and tried to lie like he had been doing for the last 15 years.<br>\r\n\"I can't believe you have been cheating on me for 15 years! You bastard! You are an addict! I saw all of the naughty perverted things that you have been looking at. You have two choices either do whatever I tell you, which according to your search history is being an adult baby or I am going to divorce you and leave you with nothing!\" <br>\r\nSo what is your choice?</span></div></div>",
            "created":1591052640,
            "id":2844319,
            "title":"Hubby becomes adult baby"
        },
        "11":{
            "author_id":"baby-jer",
            "author_name":"Baby-jer",
            "choices":[
                "Mark agrees to take a shower and shave",
                "Mark refuses"
            ],
            "content":"<div class=\"\"><div> <span>Mark agrees to do anything he has to in order to stay with Amy. He loves Amy, he is just not sure if he wants to be her new baby. He knows that Amy has been wanting to have another baby since their children have moved out, but he's been reluctant to start over again. <br>\r\n<br>\r\nAmy loved being a mother so she figured that this would be a perfect opportunity and the best of both worlds!<br>\r\n<br>\r\nShe was very excited and immediately went to the internet and pulled up some of the sites that Mark had been looking at.  She ordered everything she could think of.  She ordered diapers,onesies, mittens, plastic panties and training panties. She also ordered a changing table, an adult-sized crib and an adult sized crib. She's very excited to get her plan into action.<br>\r\n<br>\r\nIt took Amy 2 weeks to get all of the stuff that she had ordered delivered. But then her plan was coming together.<br>\r\n<br>\r\nMark was going about his business and had almost forgot about what he agreed to do. He had thought Amy had changed her mind.<br>\r\n<br>\r\nWhen Mark came home from work Amy was sitting at the kitchen table waiting for him. On the table was a very large adult diaper. It was baby blue with baby blocks printed on it. Mark pretended not to notice the diaper sitting on the table. <br>\r\nAmy asked mark \"Do you know what this is for?\"<br>\r\n<br>\r\nMark just looked at Amy and didn't say anything. <br>\r\n<br>\r\n\"Well this is the start of your new life. I want you to go and take a shower and shave off all of the hair on your body except for the hair on your head.\" <br>\r\n<br>\r\nMark began to say something and Amy said \"No! not one word, you do as I say or you are gone!\"</span></div></div>",
            "created":1591057320,
            "id":2844356,
            "title":"Mark agrees to do be Amy's baby"
        },
        "111":{
            "author_id":"baby-jer",
            "author_name":"Baby-jer",
            "choices":[
                "Mark chooses the bed",
                "Mark chooses the crib"
            ],
            "content":"<div class=\"\"><div> <span>Mark does exactly as he is told. He goes in strips off all those clothes and gets in the shower. Mark's head is going crazy. Mark has been very fascinated with adult babies he's watched lots and lots of adult baby p*** he stopped many times about how it would feel to be made to wear a diaper, being made to drink a baby bottle, he has even thought about what it would be like to be breastfed by his mommy.<br>\r\n<br>\r\nBut now the reality of the situation is coming. Mark soaps up his entire body and begins to shave all the hair from his body from head to toe. when he gets done he steps out of the shower grabs a towel and heads to the master bedroom.<br>\r\n<br>\r\nAmy is sitting on the bed and tells Mark to come sit down next to him.</span></div></div>",
            "created":1591196880,
            "id":2845257,
            "title":"Mark agrees to take a shower and shave"
        },
        "112":{
            "author_id":"baby-jer",
            "author_name":"Baby-jer",
            "choices":[
                "Mark leaves",
                "Mark decides to be a sissy"
            ],
            "content":"<div class=\"\"><div> <span>Mark says \"I will not be your baby! You are blackmailing me and I want nothing to do with it!\"<br>\r\n<br>\r\n\"That is fine when me, I will enjoy not being cheated on! I have one more option for you.<br>\r\nDo you remember those sites your were looking at? The ones that were not about adult babies, but the ones about femdom and being forced to be a sissy, remember? Yeah, that's right you can leave now or you can be made into my little sissy bitch!\"<br>\r\nSo what do you choose?</span></div></div>",
            "created":1591066080,
            "id":2844446,
            "title":"Mark refuses"
        },
        "12":{
            "author_id":"baby-jer",
            "author_name":"Baby-jer",
            "choices":[
                "Mark leaves",
                "Mark decides to be a sissy"
            ],
            "content":"<div class=\"\"><div> <span>Mark says he will not be her baby! You are blackmailing me and I want nothing to do with it!<br>\r\n\"That is fine when me, I will enjoy not being cheated on! I have one more option for you.<br>\r\nDo you remember those sites your were looking at? They ones that were not about adult babies, but the ones about femdom and being forced to be a sissy, remember? Yeah, that's right you can leave it be made into my little sissy! <br>\r\nSo what do you choose?</span></div></div>",
            "created":1591066200,
            "id":2844448,
            "title":"Mark refuses"
        }
    },
    "info":{
        "author_id":"baby-jer",
        "author_name":"Baby-jer",
        "brief_description":"Wife turns hubby into an adult baby. ABDL and diaper wearing.",
        "created":1591052400,
        "description":"<td align=\"left\" class=\"norm\">Mark and Amy have been married for 15 years.<br>\r\nAmy found out Mark had been cheating the whole time. <br>\r\nShe now has decided that Mark will now be her new baby.<br>\r\n <br>\r\nPlease bear with me this is a work in progress!<br>\r\n<br>\r\nPlease leave me feedback! Let me know what you would like.</td>",
        "id":2223275,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/101324.jpg",
        "last_full_update":1591368780,
        "modified":1591368780,
        "pretty_title":"Husband becomes wife's new baby"
    }
}