{
    "chapters":{
        "1":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Yotsuba Koiwai",
                "Koiwai-san/Mr. Koiwai  (You can make up  a first name for him )",
                "Fuuka Ayase",
                "Asagi Ayase",
                "someone else perhaps?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, who will be the the one to gain here?!<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1296363600,
            "id":1044676,
            "title":"Here is... the beginning!"
        },
        "11":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "normal... I'd say 40lbs to 60lbs for a five year old girl who is about 4ft tall.",
                "chubby 80 to 110lbs",
                "fat 130 to 170lbs",
                "obese 200 to 260lbs",
                "higher, higher!"
            ],
            "content":"<div class=\"\"><div> <span>Okay, here is not going to be  the standard \" how will she gain weight\" chapters, cause that's been done so too often.<br>\r\n<br>\r\nSo instead, We're going to have starting points for Yotusba's weight, she can start off being normal sized... or the story can begin with her already at over 4,000lbs...your choice. Let's begin.</span></div></div>",
            "created":1296363600,
            "id":1044699,
            "title":"Yotsuba & Weight Gain"
        },
        "112":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "\"No,...I've been eating normally.\"",
                "\"Hmmm, well daddy did win something called a lottery a few days ago...\" ",
                "\"Oh yeah! I've been eating tons lately, its fun!\""
            ],
            "content":"<div class=\"\"><div> <span>(First off words in \" \" mean spoken dialogues, words in {} mean thoughts and italics mean <i>whispered</i>.)<br>\r\n<br>\r\nIt was nice, cool Sunday in November, and little Yotsuba was once again, playing with Fuuka's exercise ball. Rolling and giggling hysterically on the large bouncy ball. Sitting cross legged on the couch in the Ayase's house's living room was the oldest of the three sisters, Asagi. Asagi was reading a book detailing about weight loss, which belonged to her sister, she closed the book and chuckled quietly to herself at some of the more ridiculous \"exercises\" the book claimed were genuine. Looking over to her young neighbor, who was now clutching onto the giant all with her body, she noticed something new about the young girl.<br>\r\n<br>\r\n\"Hehe heh, looks like you'll actually be needing that thing now Yotsuba-chan.\" Asagi, said. \"Huh? What do you mean?\" Yotsuba asked quizzically, tilting her head, her mouth agape. Asagi then knelt over to the five year old and struck her finger into the exposed stomach that was now apparent on the young girl. \"Wahh?! Who put this stuff on me?!\" Yotsuba whined, grabbing at the small love handles on her somewhat wider belly. {Who put it on you was probably yourself...} Asagi thought to herself in response to the girl's question. \" Guess you've been eating alot of junk food lately.. haha.\" the young woman said cheerfully, as she poked Yotsuba's fat. \"Gahahahaha... that tickles!\" Yotsuba squealed as she squeezed her sides in enjoyment of the sensation. <i>Hmm...</i> It does doesn't it?\" Asagi then grabbed the quad pigtailed girl and began tickling her, making her plumper stomach ripple just ever so slightly.<br>\r\n<br>\r\nAs this event was occurring Fuuka walked into the living room. \"Oh hahahaha,... Fuuka!\" Yotsuba said as she got up off the floor and ran up to the schoolgirl. \"Look, Fuuka! We're the same now!\", Yotsuba said with her arms outstretched. Confused at her statement Fuuka asked, \" Uhhh...what do you mean?\" We're both fat!\", Yotsuba cheerily shouted as she squeezed her chubby midsection with her left hand and pushed her right hand into Fuuka's stomach. \"Wah-whaaaaat?! I-I'm not fat!\" Fuuka cried in embarrassment at the five year old comparing herself to her by their physical measurements. \"I don't know Fuuka, it looks like you've gained about 15 pounds or so...\" Asagi said smirking as she took a shot at her sister's insecurities.  \"Sh-shut up! I'll prove it!\" A minute or two later Fuuka came in carrying in a weight scale. \"Ohh, what's that?\" Yotsuba wondered in awe. \"It's a scale you stand on, then it gives you your weight.\", Asagi proclaimed. \"Wow! It must be magic!\", the girl awed in amazement at the supposedly \"magical machine\".<br>\r\n<br>\r\nYotsuba then got on the scale and crouched down to see the numbers flash up on the screen, before Fuuka corrected her posture. \"No, you have to stand up straight for it to be correct.\". Yotsuba, smiling widely looked straight down at the screen until the numbers flashed up and came to... 85lbs. \"Woah, well Yotsuba-chan you've gained a whole 25 pounds.\" Yotsuba, being a small girl thought this was a great achievement and smiled brightly. Then she stepped off and Fuuka got on it came up at...168lbs \"Wahh nooooo! I've gone up by 23lbs!\" Fuuka cried starting to tear up a little. \"I can't understand how you could've gained so much, you've been exercising and dieting like crazy these past few days,... maybe you just have a horrid metabolism...\" Asagi saig in confusement. \"sigh\" Fuuka sighed as she slowly got off the scale. Asagi then got on for kicks and Yotsuba and Fuuka looked on anxiously until the numbers read at... 144lbs...\"Huh?! That's impossible, I couldn't have gained 12 pounds in only eight days!\". \"Maybe its some kind of epidemic...\" Fuuka said a little worried that even her older sister had somehow gained a bit of weight. \"Oh maybe if you give an offering to it, the scale will lower your weight for you.\" Yotsuba said thinking the situation was like that of a fairytale of some sort. \"If only that were true....\" Fuuka sighed as she imagined herself offering several items to a Weight scale deity to lower her down to a nice 124lbs.<br>\r\n<br>\r\n\"Hmmm, hey how'd you gain so much anyway Yotsuba-chan? You didn't seem any different when you came in this morning?...\" Fuuka asked to the eccentric child. \"It was probably the coat she was wearing.\" Asagi stated obviously. \"Uhh oh, right hehe...\" Fuuka said realizing her mistake. \"But, you haven't been gorging lately have you Yotsuba?\"</span></div></div>",
            "created":1296896400,
            "id":1047830,
            "title":"Yotsuba's gotten a little chubby..."
        },
        "1123":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Surprisingly, only Yotsuba wants to eat them, she eats it all gluttonously!",
                "Only Yotsuba and Mrs. Ayase with her sweet tooth, have the cake.",
                "They all decide to  chow down, gaining weight along the way..."
            ],
            "content":"<div class=\"\"><div> <span>\"Gorging?...Yeah I've been eating a bunch lately!\" Yotsuba exclaimed proudly. {She acts like it's a good thing... sigh so naive...} Fuuka thought in response to what the green haired girl said. Asagi merely half-smiled at her young neighbor's sense of wonder and cheerfulness. Fuuka then said, \"I wonder why your dad hasn't noticed this..., otherwise he would of told you by now.\". \"Maybe since to him it was gradual, he didn't notice Yotsuba-chan gaining a little weight over the past week...\" Asagi responded to Fuuka's curious statement.   *grumble grumble* Yotsuba's stomach then started to gurgle and growl, it begging for sustenance. \"Haha! It's hungry again!\" Yotsuba laughed as she stared down at her slightly rounder belly poking our from her midsection, the growls of her stomach making her ripples in the small layers of fat that now rested upon her body. \"Again? When was the last time you ate today Yotsuba?\" Asagi asked in curiosity. Yotsuba thought for a moment, her eyes becoming blank for a second and her tilted as she began remembering her last snacking.<br>\r\n<br>\r\n<br>\r\n\"Ummm...oh! It was at 3:06!\" Yotsuba then ran over to a small clock sitting on a shelf in the living room and brought it over to show the time. \"It was right here...\" Yotsuba then pointed at the Big six. \"What?! That was just thirteen minutes ago, just before you came over!\" Fuuka exclaimed learning just how \"long\" it was since Yotsuba had last eaten. \"We had Gyūdon!\" <b>*Japanese dish consisting of a bowl of rice topped with beef and onion simmered in a mildly sweet sauce flavored with dashi (fish and seaweed stock), soy sauce and mirin (sweet rice wine).*</b> Yotsuba said, oblivious to her inaccurate telling of time and Fuuka's exclamation. Suddenly, her hunger rang through again and she ran to the kitchen...<br>\r\n<br>\r\n\"Mom! Is there anything to eat?\" Yotusba said  to Mrs. Ayase, who had been currently reading the newspaper and had been to  in it to pay attention to what had been happening in the next room. \"Hmm? Oh well sure, take a look in the fridge Yotsuba.\" Mrs. Ayase said, putting down her newspaper to help the five year old. Looking into the fridge Yotsuba's eyes gleamed in awe at all the wondrous foods, mostly sweets. \"Wow! so many delicious stuff, you must have baker here!\" Yotsuba said quite cheery at just how much sweets were in the refrigerator. \"Hehe, trust me if we had a baker here she'd be a whale.\" Asagi said pointing a finger at her mother. Mrs. Ayase just glared angrily at her eldest daughter, clenching her fist in hopes that her daughter would get her karmic retribution for that remark. \"Oh wow, a whole sundae! Can I have it?\" Yotsuba shouted in sheer joy at the sight of such a delicacy. \"NO, that's mine.\" Mrs. Ayase said rather bluntly. Then, the middle-aged woman finally noticied the change that Yotsuba had gone through. \"Hmm? Say Yotsuba... did you gain a little weight since I last saw you?\" she said kneeling down and poking the girl's peeking gut. \"Oh yeah, Its good, and now I'm like Fuuka!\". \"Ah, yes... I can see that, you've seem to put on a little weight as well Fuuka.\" Mrs. Ayase said seeing how the both of them had put on weight. \"Agh, Mom!\" Fuuka cried, seeing that she just couldn't find any sympathy in her family at certain times. \"Don't you think she could use a diet?\" she said. \"Fuuka... she doesn't need a diet at her age! That could have detrimental effects on her body's system, she should just focus on eating normally.\" Asagi said in response to Fuuka's statement. \"Hmm..., you also seemed to have put on a little weight Asagi.\" Mrs. Ayase said, noticing how both of her older daughters' gaining and in retaliation to her elder daughter's earlier remark. \"Ugh it's only 12 pounds!\" Asagi shouted, putting her hands to her hips.<br>\r\n<br>\r\nMeanwhile, Yotsuba had taken to now raiding the pantry looking for anything large, sweet and yummy. \"Ohhh! What about this?\" the girl then grabbed out from the back of the pantry, a rather large sized box of cake mix. \"Hmm? Oh will lets see...\" Mrs Ayase looked at the back of the box to check the ingredients and remembered that she did have all the requirements. \"This'll be fine.\" Mrs. Ayase smiled down to the now drooling girl, sweat-dropping at the sight of the tranced state she seemed to be in. After getting out all the ingredients, mixing them all together, and keeping Yotsuba from licking too much of the batter in the bowl, Mrs. Ayase had finished the large chocolate cake, decorations and all.<br>\r\n<br>\r\nYotsuba and the others sniffed the sweet aroma coming from the pastry. Mrs. Ayase then got out knives and forks. \"Well, who wants cake?\"</span></div></div>",
            "created":1297140300,
            "id":1049843,
            "title":"\"She doesn't need a diet at her age!\""
        },
        "11231":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "\"It's great, I really like being fat! Ahaha!\"",
                "\"Yeah it's good. you should've tried that cake though.\""
            ],
            "content":"<div class=\"\"><div> <span>\"I'm not hungry\" \"I don't feel like it right now\" Asagi and Fuuka replied respectively. \"I DO!\" Yotsuba yelled in high spirits hoping to finally satisfy her growling stomach. \"Eh, but, didn't all of you say you were hungry?\" \"No, only Yotsuba ever said something like that, guess you were to busy baking this delicious cake to realize that. Why don't you eat it? Asagi said sighing, knowing her mother had just pretty much wasted almost a whole cake. \"I would... but I'm saving myself for something tonight, I can't risk my appetite on this cake.\" \"Well, what do you have in mind then?\" Asagi asked. \"Well we can save some for later after Yotsuba has her fill.\" \"Where?\" Fuuka asked. \"Our fridge is stocked full right now, there's not enough space for a cake, not even a slice.\" <i>\"Well I guess we could ask Ena if she wants some...no she doesn't really like chocolate cake that much...\"</i> Mrs. Ayase said softly as tried to think of a way to not let this wonderful cake go to waste. \"Hey!\" Yotsuba intervened, \"I'll eat it all for ya!\" seeing a chance to have far more cake then she at first thought, the green haired eccentric girl went for it with all her might.<br>\r\n<br>\r\n\"I don't think that would be a good idea.\" said Fuuka. \"You might get a nasty stomachache from all the sugar. \"Don't worry Fuuka, Yotsuba's good at eating cake!\" Yotusba responded, referring to herself in third person. \"I think we should let her try and do it.\" Asagi said surprising her mother and sister\"Huh?! Why?\" they both asked wondering what Asagi was thinking. \"Well, it looks like she's pretty hungry, at the very least she could give the rest to her dad.\" \"Hmm, I guess that'll work.\" Mrs. Ayase said stroking her chin as pondered on the idea. \"YAY! Your the good one Asagi!\" Yotsuba cheered, giving the young woman a thumbs up. At that moment Yotsuba took a slice of the cake, stuck her fork in and began devouring the rich, delicious, creamy delicacy. \"Ahh, it's Super!\" Yotsuba cheerfully shouted as she quickened her pace in her eating. <br>\r\n<br>\r\n\"As Yotsuba was nearly done with eating the 1st slice, Asagi, Fuuka, and Mrs. Ayase were quite surprised by the young girl's voracity in her eating as of late. \"She's...really picked up quite an appetite hasn't she?\" Mrs. Ayase. \"Yeah... she doesn't even look full, usually she'd be done after only one slice of cake.\" Fuuka said in similar surprise. Yotsuba then continued eating, after only a few minutes the noticeably larger girl was now nearly done with 4th slice, cake crumbs all over her cheeks and lips, quite a bit ago dropping her use of a fork and knife, this was due to being so entrapped in her gorging she simply lost focus on them. Now since the cake Yotsuba was eating had been baked to be made for four people it had been quite large, so the fact the girl was nearly done with her 4th slice and did not seem full even yet was astounding. \"How much can she eat?\" Asagi said bewildered at just how much Yotsuba was now capable of eating. Asagi, Fuuka, and their mother had taken to just sitting across from the girl and watch in amazement and shock at just how quick and how much the 5 year old had eaten. \"Are you almost full yet Yotsuba-chan?\" Fuuka asked, oddly though for once Yotsuba did not reply in the slightest. \"<i> Errr... I guess that answers my question</i>\" Fuuka said to herself a bit taken back by how voracious her friend had become.<br>\r\n<br>\r\nFinally, after only a total of 13 or so minutes Yotsuba had completely finished the cake made for four and looked quite content, rubbing her now taut belly, which poked outward by a good 3 inches, the lower half of her face covered in sticky chocolate. \"Well...are you full now Yotsuba-chan?\" Fuuka asked which at this point she really didn't expect a yes from the girl anymore. Yotsuba cheerfully replied with a loud sigh \"phew... That was really tasty...\" \"Uhh Yotsuba?\" Fuuka replied hoping to get Yotsuba to actually respond correctly to her question. \"Huh? Oh yeah I'm good for...owww.\" Yotsuba responded as she groped her stomach in pain. \"Ah! See, I knew you'd get a stomachache from eating so much...\" but Fuuka never got finish that sentence as moments later little Yotsuba let out a loud hearty burp, which was the reason for her stomach pain just seconds ago. \"BBBUUUURRRRPPPP!!!......Ahahahaha! I feel much better now!\" S Yotsuba laughed as the three older women just stood in absolute shock at what they had just witnessed and heard. The burp had been loud enough for the three to feel it in their ears just slightly. Never before had they heard a belch like that, especially from a five year old girl. \"\"I-I can't believe she did that...\" Mrs. Ayase said wondering just how did her young neighbor attain this...kind of attribute in only the eight days she had not seen the girl. Asagi then regained a bit of her composure and asked Yotsuba a rather important question, that she was really hoping Yotsuba had the answer for. \"Yotusba-chan... are you sure you enjoy this?\" the green haired now more fat then just chubby girl responded...<br>\r\n<br>\r\n<br>\r\n(To all those out there, sorry for the crappy segway ending at the end here. I was kinda stumped at this point. I hope to you all I can make up for it in the next chapter.)</span></div></div>",
            "created":1297393020,
            "id":1051665,
            "title":"\"I-I can't believe she did that...\""
        },
        "115":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "huge 300 to 500lbs",
                "massive 700 to 1,400lbs",
                "more and more and more limits!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Alright so if you're here you must want our title character to be even fatter!....right? T_T<br>\r\n<br>\r\nAnyway, here we go! Time to make a leap in the weight limits!</span></div></span></div>",
            "created":1296414600,
            "id":1044706,
            "title":"More weight!"
        },
        "1151":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "She was naked and over 500 pounds in pure fat ",
                "There was a massive cock bulge in her Pjs pants ",
                "She was a smelly fat slob "
            ],
            "content":"<div class=\"\"><div> <span>Yotsuba was a hyper active happy little girl.<br>\r\n<br>\r\nAt the age of 5 she had everything ahead of her and a nice happy family Her big sister Fuuka Ayase made her very happy.<br>\r\nAll seemned good till one day something very strange happened. <br>\r\n<br>\r\nWhen Yotsuba got up in the morning still as she walked to the bathroom to go brush her teeth and get ready for the day.<br>\r\nYotsuba saw in the mirror......<br>\r\n</span></div></div>",
            "created":1548351180,
            "id":2606777,
            "title":"huge 300 to 500lbs"
        },
        "11512":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Yotsuba felt very bloted like she was ganing weight? ",
                "Her cock became rock hard stiff ",
                "Yotsuba suddenly felt very lazy and just wanted to laze around in her room now"
            ],
            "content":"<div class=\"\"><div> <span>\"What the.....? Yotsuba saw as she looked at the side of the bathroom mirror to see something big stuffed between her legs in her pants.<br>\r\n<br>\r\nShe stood  in front of the mirror and pulled her pants down and was stunned when she saw a massive 12 inch male cock flop out between her legs. <br>\r\nNot only that but a thick large pair of ball now dangled below of her huge cock too.<br>\r\n<br>\r\nHer face went red as she said \"Oh my god what is this? it's so thick and heavy and warm,.<br>\r\nYotsuba had no idea what a dick was so she had no idea what this thing was since she never had a cock before<br>\r\n.<br>\r\nShe examined the thick cock and saw it was covered in veins that travelled up the shaft. she had a thick foreskin that slid over his big bulging tip that felt very itchy  <br>\r\n<br>\r\nWeirder then that was how her cock was all very hair with green hair all around the base. <br>\r\nShe looked at her huge basketball sized nutsack and saw it was also very hairy and had veins over it too. all Yotsuba knew was that what ever this thing was it was heavy hot. hair and very gross looking. and she couldn't get it off since it was attached to her groin. <br>\r\nY<br>\r\notsuba said \"Oh man what should I do? <br>\r\nThat was when.....</span></div></div>",
            "created":1548351720,
            "id":2606782,
            "title":"There was a massive cock bulge in her Pjs pants "
        },
        "1153":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "HUGE LEAP Jumbo sized, not the character mind you. 5,000 to 10,000lbs",
                "GIGANTIC 50,000 to 500,000lbs",
                "This girl will be engulfing the city in her body!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, here we go nito the crazy terriotry, beyond these weights exist the insane...</span></div></span></div>",
            "created":1296414840,
            "id":1044709,
            "title":"Yotsuba's getting flabby...very flabby"
        },
        "11533":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Yotsuba starts out at over 1,000,000lbs!",
                "No, I want even more ridiculous."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, now we get into my favorite weights in weight gain stories ONE MILLION AND ABOOOVE!!!!</span></div></span></div>",
            "created":1296415740,
            "id":1044723,
            "title":"This girl will be engulfing the city in her body!"
        },
        "115332":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "1,000,000,000lbs for Yotsuba!",
                "this is the FINAL choice!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just howfar are you, (and myself) willing to go?!</span></div></span></div>",
            "created":1296416820,
            "id":1044732,
            "title":"More weight is ridiculous... :D"
        },
        "1153322":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "FINAL WEIGHT: 100,000,000,000,000,000,000lbs 0_0"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here, Yotsuba Koiwai from the start is likeily big enough to cover her whole town and the surrounding ones, if you can make a story out of this, I'll be stunned.</span></div></span></div>",
            "created":1296417120,
            "id":1044736,
            "title":"this is the FINAL choice!"
        },
        "11533221":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "getting fed by Ena, and Miura who were both 900lbs and had 8 inch dicks.",
                "getting her chins humped by Ena, Fuuka, and Asagi,: 3,000, 5,000 and 12,000lbs "
            ],
            "content":"<div class=\"\"><div> <span>(Ok, here the characters will be VERY OOC, out of character for people who don't know. So, expect people to be greatly sexually attracted to the title character, massive burps from well anyone, tons of dickgirls, and overall... absurd shit....Enjoy!)<br>\r\n<br>\r\nIt was a nice cool October night in Chikuma, of Nagano Prefecture Japan well... it would've been if the city wasn't completely covered in the flab of an eccentric 5 year old named Yotsuba Koiwai. It had been 4 months since Yotsuba started gaining weight, and for a while everything was still relatively normal, the young girl was only around 200lbs. But about 2 months later she for some reason grew immensely one afternoon, she was with Asagi and Fuuka, her neighbors at a local park. Yotsuba was getting her ten inch long cock sucked by Asagi who too had also gained weight, being at about 600lbs. She was jerking off her own fifteen inch cock, letting out streams of cum with each tug. Fuuka, at the time was banging her sister with her nine inch dick, also having gained weight, oddly less than her older sister being only in the low 400s.  Right as the three of them came, huge globs of jizz going everywhere, Yotsuba felt a rumbling in her belly. <br>\r\n<br>\r\nAbout a few seconds later the little girl let out a massive burp that could be heard about three miles away, then as she was burping her little body gained enormous amounts of weights in seconds. Within three minutes, Yotsuba had completely covered the park, Asagi and Fuuka had quickly gotten aboard her fat before they were engulfed by it, jerking off and humping it as she continued to grow. As Yotsuba grew, her body was becoming more and more immersed in pleasure, making her now 20 foot cock blow its load all over a few streets, flooding them. As time went on, Yotsuba took up more and more space with her flab. Her fat had eventually reached her street after 20 mins or so, where her father was jerking off Mrs. Ayase 20 inch dick on her 700lb body. Once they had seen the wall of flab, they climbed up it and saw Yotusba's head off in the distance, being so attracted the girl and finding her so cute in the past they began to ravenously hump her folds, which could easily hold several cars inside them.<br>\r\n<br>\r\nOver the next few days her growth had finally stopped at her weighing around about 100 quintillion pounds. Her massive blubbery body had completely engulfed the town and a bit of other towns on its edges. Everyone had decided that, since they could not make her smaller, not that they would want too, they all chose to move all their belongings and everything to the various rolls, folds, and crevasses on the 5 year old's gigantic body. Yotsuba was very happy about this, she loved all the attention and the sensation of hundreds of people moving around in her fat, humping, sucking and having sex on her glorious shelves of fat. <br>\r\n<br>\r\nNow, in October, on a cool night, Yotsuba is currently...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1298131740,
            "id":1056765,
            "title":"Yotsuba has become a human city!"
        },
        "13":{
            "author_id":"goahead",
            "author_name":"GoAhead",
            "choices":[
                "200-300 lbs, getting there.",
                "300-400 lbs, outright fat.",
                "400-500 lbs, flat-out obese.",
                "600-800 lbs, where walking is getting hard.",
                "Even bigger."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her sisters already think she's a little tubby, but she could probably do with some more meat on her bones.<br>\r\nHow big are we talkin?</span></div></span></div>",
            "created":1474537740,
            "id":2213157,
            "title":"Fuuka Ayase"
        },
        "15":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Ena Ayase",
                "\"Yanda\" Yasuda",
                "Takashi \"Jumbo\" Takeda",
                "Miura Hayasaka",
                "others...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, who else will you submit to this stuff?</span></div></span></div>",
            "created":1296418920,
            "id":1044769,
            "title":"Another character from the manga?"
        },
        "155":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Torako",
                "Miss Stake/Shimau, actual name Hiwatari",
                "last one."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are pretty much the last few characters.</span></div></span></div>",
            "created":1296419040,
            "id":1044773,
            "title":"others...."
        },
        "1553":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Miss Ayase, the mother of the Ayase sisters."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, here it is the last character to have gain weight.</span></div></span></div>",
            "created":1296419100,
            "id":1044774,
            "title":"last one."
        }
    },
    "info":{
        "author_id":"bogger",
        "author_name":"Shinuto",
        "brief_description":"Here you can fatten up the characters of the manga series Yotsuba&! ",
        "created":1296405840,
        "description":"<td align=\"left\" class=\"norm\">Alright, first things first I don't care if any you find this sick, offensive, stupid, crazy, rude, horrid, or just plain odd. This is for my and others who enjoy this manga and happen to have my wacky fetish, entertainment. So don't come wanking on how \"Ohh how dare you make a weight gain series full of adult themes involving a child!\" Cause really...there's A LOT worse on this site... trust me. Now, that that's done let's get on the more important things.<br>\r\n<br>\r\nNow, as you know hopefully the manga series Yotsuba is created by Azuma Kiyohiko or Kiyohiko Azuma in his home country. He is well known as the creator of the other successful manga and anime Azumanga Daioh. This series entails the life adventures of an eccentric and energetic 5 year old who lives with her adopted father in a japanese suburb they moved into. It started out during the beginning of summer and has since shown her going through the daily lessons and things she engages in, typical to a girl her age. If you want to read the whole thing from beginning to current volumes look here: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.mangareader.net/132/yotsubato.html\" target=\"_blank\">http://www.mangareader.net/132/yotsubato.html</a><br>\r\n<br>\r\nNow, of course there will be weight gain in this interactive, obviously by the title you can understand that, You will be able to pick from Yotsuba Koiwai herself, her father, her neighbors, anyone really. Now there are some guidelines here on what is allowed and what I just don't want to see, <br>\r\n<br>\r\nWhat I'm okay with: weight gain, fast unrealistic weight gain, burping, futanari, small futas doing bigger normal girls, sex, orgies, large breasts, larger breasts, pop culture references, some farting not as often as burping though and only the loud scentless kind, 5 year old girl sexually dominating her older neighbors, and lastly occasional Azumanga references.<br>\r\n<br>\r\nAnything goes for content. Make em as fat as you want, make em slobs to the most extreme extent. Anything.<br>\r\n<br>\r\nFinally, this is not meant to be taken real seriously, however do have the characters act somewhat in character, like don't have little Yotsuba shouting off curse words, or have Asagi beat the shit out of sisters for no reason, stuff like that is just weird in my mind, unless you're going for complete craziness.  So now, go forth and lets see some crazy fast and enjoyable weight gain of a favorite manga of mine!  ^_^<br>\r\n<br>\r\nEDIT:2/11/11 If you want a choice to be done but don't have the initiative or the skills to do so, send me a message explaining which chapter/choice you'd like to see a story started for or done for and I'll do it for you.<br>\r\n</td>",
        "id":1746826,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1574602620,
        "modified":1574602620,
        "pretty_title":"Yotsuba&! Weight Gain"
    }
}