{
    "chapters":{
        "1":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "In you Girlfriend Michelle's room",
                "In you ex-girlfriend Holly's room",
                "In your best friend Hannah's room."
            ],
            "content":"<div class=\"\"><div> <span>You wake up with a pounding headache.  You try to open your eyes but the harsh glare of the light is just too painful.  For a while you can't even remember your own name.  You think and think and eventually it rises groggily to the surface of your mind.  Danny, your name is Danny.  You also vaguely remember going to a party last night.  It was just a graduation party though... there was no alcohol to your recollection.  Why then did you have such a huge headache? This didn't make any sense.<br>\r\n<br>\r\nGradually you are able to open your eyes despite the light.  You recognize the room your in and a split second later you realize with dawning horror that you're only about a inch tall!<br>\r\n<br>\r\nFirst off, where are you? </span></div></div>",
            "created":1212296400,
            "id":538908,
            "title":"In the morning."
        },
        "11":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "Suppress your hunger a little longer and wait for Michelle outside the bag.",
                "Dive in!"
            ],
            "content":"<div class=\"\"><div> <span>     Looking around you, you begin to calm down.  Your in your girlfriend Michelle's room.  You've been here at least a hundred times before.  The entire room is purple. The light is on inside the room so you can see but other than you it is entirely empty.  Utterly perplexed by your situation you sit down on the carpet and try to think out your situation.  Somehow you are only an inch tall.  You have no idea how that happened or how you even ended up here, and above all: can Michelle help you and how could you get her attention in  the first place?  <br>\r\n<br>\r\n     As you sit around musing over all these things a new problem presents itself.  You are astoundingly hungry.  You try to ignore this primitive instinct so you can focus on the more important issue of regaining your normal size but it doesn't take long for hunger to pervade every thought until you can literally think of nothing else.  Giving in you begin to look around.  Her door is open a crack but she lives on the opposite side of the house from the kitchen and there's no telling how many infinite dangers would present themselves to one so small out there.  With a stroke of luck so great it must have been sent by providence your eyes alight upon an open bag of skittles sitting in a chair just to your left. Michelle loves Skittles.  Perhaps an even greater stroke of luck, there is a pair of her pants hanging off the chair that allows you to climb up there and reach the bag.  <br>\r\n<br>\r\n     Some immediate advantages to the Skittles run through your head at once. Though they're really only sweats they're still the only things in the room that you can eat, and as you quickly realize, Michelle is a total neat freak and would never allow an open bag of skittles to just lay around open like that for more than five minutes.  Maybe once she returns she will find you in the bag and will be able to help you.  <br>\r\n<br>\r\nYou are now faced with two choices.</span></div></div>",
            "created":1212296400,
            "id":538940,
            "title":"In you Girlfriend Michelle's room"
        },
        "111":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "the cat wakes you up",
                "Michelle wakes you up",
                "you wake up on your own"
            ],
            "content":"<div class=\"\"><div> <span>\"Logic Danny.\" You reprimand yourself.  \"At your size you wouldn't be able to eat a Skittle anyways.\"  You sit down moodily; this situation is not improving.  You're an inch tall, you have no food what so ever, and if you remain in this state for much longer you might just end up becoming a meal to one of her family's pets.  Not your idea of a fun time. Almost on cue you hear the door creak open slightly.  Hope turns to cold fear when you see that instead of Michelle it is in fact her cat Patches.  Fear turns to panic as you see where Patches is heading.  The chair you are currently occupying has always been Patches favorite place to stretch out. You've seen him there hundreds of times.  Patches was already half way across the room. You need a decision fast.  You obviously can't let yourself be caught out in the open.  You look around franticly. You could try and hide in the bag of Skittles but the cat would simply have to look in the bag.  The cat is almost to the bottom of the chair.  One leap and it will be up here with you.  Inspiration strikes you and you immediately dash for the top of the pair of pants that had allowed you to climb up here in the first place.  <br>\r\n<br>\r\nYou make it just in time, leaping into the folds of Michelle's pants just as you feel the cat leap onto the chair.  You quickly crawl deeper inside to avoid detection. You can feel the cat laying down somewhere o to your left.  You crawl in just a tiny bit farther and are surprised to suddenly run into a wall of silk.  There must be a balled up thing of panties in here you think.  Expecting a long stay waiting out the cat you nestle yourself within it's folds and fall asleep.</span></div></div>",
            "created":1214208840,
            "id":547532,
            "title":"Uh-Oh."
        },
        "1112":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "You continue to ascended.",
                "Oh no! You accidentally fall out."
            ],
            "content":"<div class=\"\"><div> <span>     You're sleeping quite peacefully when suddenly your entire world turns upside down.  You are buffeted around unsparingly, tangled up in the silk in which you had been resting.  Awoken by total chaos your mind cannot register what was going on, or where you even were.  In an instant your seeking eyes are invaded by light pouring in, filtered by some red canvas.  Were you in a tent? In an intense panic you struggle to get free but it is a vain effort as your environment was still experiencing quite a bit of turbulence.   <br>\r\n<br>\r\n     As suddenly as it had begun all motion stopped. Dazed and confused you continue struggling, fearing for your life and just wanting to escape.  Somehow your efforts are rewarded as you manage to brush a section of your red prison off of your face, effectively freeing yourself.  The sight you see before you knocks all your breath away as the realization of where you are slams home.  The cat you now remember hiding from is nowhere in sight within the room, instead being replaced by Michelle standing in the middle of the room, wrapped up in only a towel with wet hair falling down to touch slick, moist skin.  She had obviously just come from the shower and the effect of her towering over you in such decor is enough to make you long for her like you had never longed for anyone before. You felt as if you would explode with desire.  In her hands she holds the pair of pants she had just fished you out off and with a careless flick she tosses them onto her bed. Underneath the hem of her towel her perfectly formed thighs flow ever upwards towards Heaven, almost coming together in glorious union before the imposing, straight line of the towel interrupts the landscape in stark contrast to the surrounding world of curves and guarding it's secrets jealously against all onlookers. You don't have to fantasize for long however because with one gentle motion Michelle unwraps the towel and lets in fall gracefully to the floor.  Her body is radiant.  Dawn light seeps in through her blinds as if on cue, reflecting upon droplets of water that yet cling to her naked skin, not wanting to leave the touch of this goddess.  This reflection creates a shimmering effect in which dawn fire cascades down her body, illuminating every nuance of her grace with the slightest movement.  She was beautiful. Golden hair fell across her soft face, always glowing with a soft smile, and then to brush against beautifully formed breasts miles above you. Awestruck by how she looks standing before you you cannot utter a single word.  Michelle softly steps towards the chair upon which she had set your former prison, which you now regard as the most blessed of chariots, every step bringing her naked form nearer to your position.  She carefully grasp the panties, causing you to tumble back down into their embrace, though your eyes never left her.  <br>\r\n<br>\r\n    You feel your self falling slowly, almost to the ground. Slightly to your left a massive foot appears, followed by a graceful leg, sliding into the underwear tenderly. The whisper of the soft fabric upon her delicate skin chanted softy of all the worldly pleasures the earth could offer as she slipped her other foot through.  Looking up now you encountered the greatest view of all.  As Michelle drew you up higher and higher the view got larger and larger, encompassing all of your vision.  The whispering became a roar, screaming to you blood of passion, pleasure, and overwhelming joy!  As Apollo's chariot once carried him to the sun yours was now quickly sweeping you up towards a whole different fire!</span></div></div>",
            "created":1222837620,
            "id":589532,
            "title":"Beauty in the Dawnlight."
        },
        "112":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "She sees you.",
                "She takes a handful of Skittles."
            ],
            "content":"<div class=\"\"><div> <span>You decide to jump into the bag.  You hoist yourself over the lip and dive inside, surrounded by the scent of fruit.  As soon as you jump down into the bag you realize it is only half full, and thus you fall farther than expected.  When your falling body does finally land amidst the Skittles you immediately sink almost to your chest, the Skittles around you shifting and sliding to accommodate you.  You panic for a brief moment and struggle to get out. Struggling you quickly learn however only serves to make you sink slightly deeper into the bag.  Breathing slowly you try to asses the situation.  You are stuck quite firmly.  The weight of the candies around you are pinning you down quite efficiently.  Fortunately your arms are still free. After a few seconds of recouping you try to use your arms to push yourself upwards and out of the trap you're in, however you can't get a firm grip on any of the Skittles around you and your hands just keep sliding off in vain.  'What a stupid idea this was' you think to yourself. \"Even if I wasn't stuck I still wouldn't be able to eat a Skittle at my size!\"  The truth of this epiphany was quickly cut short by the creaking sound of her door opening.  You hear someone step lightly in the room and you don't even have to see her to know that it's Michelle.  It's funny how when you've known someone long enough you can even identify the sound of their footsteps.  Her footfalls grow steadily louder as she moves towards the bag.  You let out a small \"Whoop!\" of triumph.  Now's your chance to get out of here.  Once you get her attention she will be able to dig you out of here, get you some proper food, and then maybe she can help you get back to your normal size.  The sound of her foot steps cease and suddenly you see her hand appear over the top of the bag, grabbing it and then lifting it. This change in position meant that all the Skittles in the bag shifted to a new position, and you unfortunantly are pulled under by the tide of sweets and come to rest in a new possition just under the surface. You begin to yell, try to catch her attention but underneath a layer or two of skittles your voice sounds faint even to you. There's no way she could hear you.  </span></div></div>",
            "created":1214036820,
            "id":546877,
            "title":"Trapped!"
        },
        "1121":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "Just teasing you... for now.",
                "Just hungry enough for a little bite-sized snack such as yourself."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly you feel the bag cease it's upward motion. All the skittles on top of you are effortlessly brushed away and you find yourself staring up at Michelle's giant face looking down on you. You shout for joy and wave your arms up and down. At first her expression is a puzzled one but almost out of nowhere her face breaks out in a grin. She laughs a little and lowers her hand, allowing you to climb up onto it. You climb on to the smooth skin easily enough and for the first time realize how small you really are. Michelle is literally holding you in the palm of her hand. She slowly raises you up to her face and looks you over with curious eyes. Finally she speaks in a low voice and though it is barely above a whisper it is still deafening in your diminutive state.<br>\r\n<br>\r\n\"It's a good thing I saw your foot sticking out of that bag.\" Michelle said in a low, seductive tone. \"I wouldn't want to accidentally swallow you... or at least... before I was ready.\" Before you are hit by the impact of what she had just said Her other hand, which had sneaked up behind you grabs you unexpectedly and pulls you with lightening speed up into the air, high above her now open mouth.<br>\r\nBelow you Michelle's mouth is gaping wide, showing white teeth contrasting against the brilliant red color of her tongue and throat.  Michelle moves her tongue back and forth across her lips, the giant, slimy muscle wetting her lips in animal anticipation.  In the very back of her throat you can see her uvula hanging down, waving softly back and forth over the vortex of her throat, as if beckoning you in invitingly and then point your way straight down her gullet and into her stomach.   <br>\r\n<br>\r\nWith you dangling directly over her open, hungry mouth Michelle decides she is....<br>\r\n</span></div></div>",
            "created":1225174800,
            "id":617355,
            "title":"Dangled."
        },
        "11211":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "Between her breasts",
                "down her panties."
            ],
            "content":"<div class=\"\"><div> <span>Michelle lowers you even closer to her gaping mouth. If you wanted to you could almost reach out and touch her top lip. Her tongue ceases it's excited movement and comes to rest in what seems like an ominously deadly stillness. Poised on the brink of becoming your girlfriends lunch for what seems like eternity you can't help but stare down into the rosy blackness of her throat, unable to speak a word.  Suddenly she breathes out, her hot, sweet breath flowing all around you, encasing you in an envelope of pleasant warmth.  Her breath melts into gentle giggling and she slowly draws you away from her mouth to look at you, laughing all the while.<br>\r\n<br>\r\n\"I was just teasing you.\" She said, sultry as hell. \"I went through all that trouble to shrink you down, I'm not going to end it that quickly and ruin all the fun.  I'm going to make you savor the time we have together, and then yes\" licking her lips, \"I'll savor you.\"<br>\r\n<br>\r\nYou open your mouth in protest to this unusual position you find yourself in but she is already talking again, her voice far over powering yours.<br>\r\n<br>\r\n\"No we're going to have a little fun before I decide to finally devour you. Besides,I've always imagined you as more of an after dinner dessert and it's only 10 am right now.  We're going to go all around town today, visiting all the places that are significant to us as a couple. Won't that be cute?\"<br>\r\n<br>\r\n\"But... but Michelle...\" you stammer.  <br>\r\n<br>\r\n\"Shhh.\" she whispers, putting her finger up against her lips in mock seriousness, a gesture you had always found incredibly cute. It gets you every time and this is no exception.<br>\r\n<br>\r\n\"It's time to go!\" Says Michelle. <br>\r\n<br>\r\nShe then carries you away from her face and stores you in a \"safe\" place which happens to be....</span></div></div>",
            "created":1228793880,
            "id":617352,
            "title":"Just teasing you... for now."
        },
        "11212":{
            "author_id":"oregino",
            "author_name":"Oregino",
            "choices":[
                "Avoid her attempts and jump out...But a glass of water is below.",
                "You allow her to do so. Fighting back is pointless at this point."
            ],
            "content":"<div class=\"\"><div> <span>Her heart beats faster with excitement.She lets her two fingers,which WERE holding you, come apart,Dropping you into the dark,moist place.She moves her tongue to more of your sensitive areas,provoking moans from both you and her.She lets you take a look of you self in the mirror of yourself in her mouth,before slowly using her finger to push you down her wet throat.You....</span></div></div>",
            "created":1228604100,
            "id":617356,
            "title":"Just hungry enough for a little bite-sized snac..."
        },
        "112122":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "You arrive in her stomach and it is empty.\r\n",
                "You arrive in her stomach and land on the rest of her lunch. "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nEver since you'd known her Michelle had always been the playful type. She would always engage in cute little arguments over the smallest of issues, often sticking her tongue out and laughing like a child when she won, and putting on mock embarrassment and hurt when she lost. It was one of the things you had always loved about her.<br>\r\n<br>\r\nAs her finger pushes you farther down towards the back of her throat you realize that's all that she's doing now. She's just being playful.  As you're inevitably pushed closer to the back of her throat you begin to think how strange it was that she didn't seem overly surprised at your shrinking... or how she had mentioned that she didn't want to eat you until she was \"ready\".  She must have shrunk you on purpose... this is just another game to her!  Your fleshy world shaken by an earthquake of giggles, which in any other time and place you would have found absolutely adorable.  She accentuates her pleasure by allowing a loud \"MMMMMM\" to resonate through the cavern of her mouth.  By now your legs have slipped partly down her throat, and your so covered in her saliva that every time you try to struggle you just slip further down.  Michelle's finger has you entirely at the back of her throat, slipping down inexorably and they're still pushing! She is quite amazing at suppressing the gag reflex, a fact you'd really wish you'd know before you shrank....<br>\r\n<br>\r\nWith you already halfway down her throat, her wet, heavy uvula slapping the back of your head her finger suddenly stops it's advance and with a loud *Slurp* retreats out of her mouth, leaving you in complete darkness.  <br>\r\n<br>\r\nYou feel Michelle tilt her head back, slowly, and with all the gentleness of an angel she swallows you in one sensual gulp. The smooth muscles if her throat grab you tightly, and before you can even let out a scream you're embraced entirely by her soft flesh, so eager to make you hers.... <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1232441280,
            "id":635837,
            "title":"*Gulp*"
        },
        "1121222":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "content":"<div class=\"\"><div> <span>You are propelled rapidly down the narrow confines of her throat, slurping and sucking and pulling you insatiably down.<br>\r\n<br>\r\nIt is incredibly dark and incredibly slimy down in Michelle's throat, which handled you incredibly gently (so as to not damage her food) but held your firmly enough between it's slippery walls to hint that this is truely a one way passage, and once you go down it there's no getting back up.  <br>\r\n     Without warning you are released from the tight passage of her throat and free fall a short distance into a warm, almost inviting chamber.  You are in your girlfriends stomach!<br>\r\nYou land face first on a pile of complete mush, which you sink down into without effort.  You struggle to the surface of your gooey prison and, tastinting the familiar taste of mayonnaise, realize that you have landed in the remains of what was once a sandwich.  This realization is made even more startling by a sudden bout of gurgles and splashes as her stomach contracted fiercly, work to churn it's contents to oblivion.  All around you Michelle's stomach gasses swirl, seeming almost to whisper in your ear, inviting you to give in to her stomach and be digested.  You fall into a trance listening to the gasses, standing there stupily in the puddle of a sandwich while her stomach continued chruning you and the rest of her food. <br>\r\n     Your trance is broken by a booming voice, rising well above the sounds of the gurgling and resonating throughout the entire chamber \"You were the best dessert ever Danny!\" you here Michelle exclaim, in a low cutesy voice. \"It feels so right to have you in my belly. I love you. You're the best boyfriend ever!\"<br>\r\n     She ate you and now she's telling you she loves you?!?  You have no idea how to take any of this. Your head is spinning from a million different things, it all seems sureal.  There's no way your girlfriend would have just tossed you down her throat and swallowed you like that. There's no way you can actually hear her moaning with pleasure at digesting you.  However the intnse heat that was now radiating from every part of her stomach snapped you back to reality and told you it was all very, very real.  In full digestive mode now Michelle's stomach was as hot as the sun, cloaking you in warmth, pulling your mind away to far away places, making you lose contact with all logic.<br>\r\n     It is with a smile that you give in to her stomach and let youself fall into her digestive juices to be overcome and absorbed into her body.  <br>\r\nMichelle gains a great amount of pleasure from the process.</span></div></div>",
            "created":1234335540,
            "id":645481,
            "title":"Heat."
        },
        "1122":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "Go on down"
            ],
            "content":"<div class=\"\"><div> <span>    Suddenly and ominously what light that had managed to leak down through the SKitlles is blocked out.  You realize in horror that she is reaching her hand into the bag.  Before you can react to this you feel a slight squeeze as her fingers dig down into the candies.  As with any person, Michelle's gut instinct is simply to grab a handful from the top of the bag.  It's true that your are burried under a layer or two but you are not nearly deep down enough to escape becoming a part of that handful. You are airborne. Your world explodes in light again.  Somehow when she grabbed the handful of Skittles you shifted to the top again, completely free! Her cupped hand is rising, rising.  You look out just in time to identify her massive chest and then her hand levels out and you meet face to face with your destination.  You scream and yell, jumping up and down to try and get her attention but to no avail, no one ever really looks at a handful of Skittles right before they eat it. No one, including your girlfriend Michelle.  Her massive, yet still soft and supple looking lips are right in front of you. Before you can even fully realize what is truely happening her soft lips begin to part.  Gradually, but certainly not slowly her mouth, your next inevitable destination is revealed to you.  First you see the expanse of her tongue, looking surprisingly moist and soft up close.  Next her teeth are revealed, and finally as her mouth fully opens you are struck with a sight unlike any man has ever seen before.  In front of you, and a bit below you the entrance to Michelle's throat gleams.  All of the inside of her mouth is a vibrant pink, almost beautiful in the light, and it all leads to the back to coalesce into a single dark tunnel, which knows only one purpose.   Above her glistening throat her uvula swings slightly back and forth in the back of her mouth as is beckoning you and inviting you warmly inside her mouth, and then pointing your way straight down her throat.  You take this all in in but a moment before you feel a slight gust of warm, yet sweet breathe rise up from her mouth and another brief shifting of the Skittles as Michelle cups her hand even more to act almost like a funnel into her mouth.  Her hand tips gently but quickly. Michelle obviously wants the Skittles, and you in her stomach now. As the surface of her hand goes almost vertcal you lose your footing and go cascading down into her warm, wet mouth.  You see the surface of her tongue rushing towards you and with a squishy sound you land on, sinking slightly into the slimy flesh.  Sittles pour in all around you and immediately her tounge comes alive, running all over you, coating you in saliva and then trying to fulfill it's purpose by pushing you under her teeth which have already started chewing the Skittles. Somehow, miraculously you avoid getting mashed under her teeth instead managing to stay on her tounge which coats you in even more saliva.  You try desperatly to make your way back to the front of her mouth, to try try escape but the art of consumption was made to be a one-way process.  Lubricated by Michelle's saliva you begin sliding inevitibly backwards down her tongue, her throat which will carry you down all the way to Michelle's stomach seems to be drawing you inexorably towards it.  You cannot escape.  You feel Michelle tilt her head back and you begin to slide even faster  down towards the back of her throat.  Everything narrows, you are now on a more or less vertical slope. It is so warm here in the back of Michelle's throat. So incredible, yet almost lovingly warm.</span></div></div>",
            "created":1214039100,
            "id":546886,
            "title":"She takes a handful of Skittles."
        },
        "11221":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "Michelle's POV",
                "Your POV"
            ],
            "content":"<div class=\"\"><div> <span>     The back of Michelle's throat pulsed powerfully, contracting and sending you plummeting straight down the dark, slimy passage of her throat.  You are caught and quickly enveloped by slick muscles, contracting and releasing in coordination to pull you down. As her throat pulls you on down towards her stomach a thought comes to you in the darkness. All the years the two of you had spent together, all the joy and all the tears, they meant nothing now.  Now you are absolutely nothing more to her than another little snack.  Just one more tasty snack, no different to her digestive system than any other meal that had ever found itself sliding down her throat.  This thought kind of saddens you.  You love her, and this is not what you had in mind when you told her you wanted to be with her forever.</span></div></div>",
            "created":1214099100,
            "id":547100,
            "title":"Go on down"
        },
        "112211":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "content":"<div class=\"\"><div> <span>     Michelle closed her eyes and swallowed the mouthful of Skittles she had.  She felt it disappear down her throat.  She smiled as she set the bag down on her nightstand. She loved Skittles and that handful had tasted especially good. It was almost, she thought for a moment as if there had been some kind of special ingredient mixed in that batch.  She shook her head, laughing to herself.  Skittles were Skittles, no special ingredients needed.   She moved away toward her door, the taste of fruit still fresh in her mouth.  For some reason she felt really good, better than she had in a long time in fact.  \"Maybe there really was some kind of special ingredient in those Skittles in my tummy\" she thought, laughing inwardly.  She patted her stomach contentedly before leaving the room.  30 minutes later while she was on the way to her friend Nicole's house she heard her stomach rumble slightly and let out a low growl. She smiled and patted it again. Digestion had begun.</span></div></div>",
            "created":1214100360,
            "id":547104,
            "title":"A delicious snack."
        },
        "112212":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "She feels you in there.",
                "She doesn't notice you at all. "
            ],
            "content":"<div class=\"\"><div> <span>Your journey does not take long.  With one final effort her throat effectively deposits you in her stomach.  You fall a little farther to land on a soft, gooey mass of chewed up Skittles.  This is an assumption on your part because it is pitch black in here which really isn't all that surprising considering that YOU'RE IN A STOMACH!!!  You manage to stand up off the mass of chewed up food, your feet sinking slightly into the wet floor beneath you that is your girlfriend's stomach. You still hold on to a faint hope of escaping, if only you could reach the stomach wall...<br>\r\n<br>\r\nThe only problem with all of this is that it is exceedingly warm in there.  At any other time and in any other place you would say it was just downright hot, but for whatever reason down in Michelle's belly the heat is not stiffling, but more simply inviting.  It is a loving warmth that seems to permeate the entire chamber, inticing you to stay.  You take a few blind steps in one direction trying to reach her stomach wall but the warmth is filling you up, making you sleepy.  You try to rouse yourself, this is no time to sleep, but you stumble and then fall face first into the soggy floor of MIchelle's stomach.  From your position on the floor you can hear faint, far off gurgling noises coming from deep within Michelle's bowels.  You know those noises are a precurser of a certain impending doom but you are helpless to get up and continue struggling.  It would be so much easier simply to lie here wrapped in a blanket of warmth with the slippery surface of her stomach caressing your face and to gently fall asleep listening to the symphony of noises emitting from the depths of Michelle's body, a cadence you would soon join.  Michelle had made you her meal, and now it was her stomachs job to make you into her nutrients.  You almost give up.  Yet somewhere some long forgotten sense of survival kicked in and you spring to your feet and dash towards what you hope will be the wall of her stomach.  You slam into it going full speed but you don't even get knocked off your feet. You pound the side of her stomach with your fist yelling as loud as you can.  You have to get out of here. You can't let your girlfriend unknowingly digest you!</span></div></div>",
            "created":1214114280,
            "id":547184,
            "title":"Warmth"
        },
        "1122121":{
            "author_id":"darkwolfx",
            "author_name":"darkwolfx",
            "choices":[
                "Get sucked down",
                "Manage to stay in her stomach."
            ],
            "content":"<div class=\"\"><div> <span>Michelle notices you pounding your fists on her slick stomach walls. You feel hope as she begins to speak. Your hope fades into fear as you decode what she says. \"Too many skittles can't be good for you.\" you are then moved around as she stands up. Sudfenly a hot, sweet smelling liquid disperses into her gut. you decide to try it. It taste vaugly like hot chocolate. You have very little time to realize this because her sttomach starts to churn, and soon a warpool is sucking you down. You remember the flashlight yourmom made you pack in case it got dark. You dig it out, only to find the current get stronger. you...</span></div></div>",
            "created":1357940460,
            "id":1506390,
            "title":"She feels you in there."
        },
        "1122122":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "content":"<div class=\"\"><div> <span>   You pound away, the gurgling noises growing steadily louder all around you.  Your strength is failing fast.  That warmth is still caressing the back of your neck. You can almost hear Michelle's stomach gases whispering softly in your ear, like a lover, begging you to stick around if only just a little while longer.  Your pounding fists begin to feel heavy and slow in their assault.  While still trying to get her attention one of your fists comes in contact with a new presence on the wall of her stomach.  There is some kind of liquid dripping it's way lazily into your organic prison, and it stings where it touched your fist.  As if excited at it's first taste of you what you have rightly guessed to be her digestive fluids begins to flow quite rapidly down along the walls.  You can hear it all around you draining into her stomach, spewing from some unknown origin.  You take a hasty step back from the wall, only to be immediately knocked off your feet when her stomach gives a mighty, unexpected heave.  For a moment a fierce flame of hope shoots through your veins, almost tearing out a cry of triumph in its wake. Surely that was a sign she was going to vomit!  This hope is utterly destroyed as her stomach heaves again, and again, throwing you all about.  Michelle was not throwing you up, her stomach was churning you!  You almost begin to panic when you realize that you are now up to your chest in her fluids, but then a welcome, but completely irrational calm sweeps over you.  You want to be digested. You have always loved  her and now you could be with her forever.  You had always cherished her company and now her body would cherish you.  Suddenly the thought came to you that your sacrifice as part of a meal was the ultimate symbol of love.  You let out a small sigh of contentment as you let yourself slip farther down into her fluids.You had gotten it wrong earlier, it didn't sting. Instead it actually kinda tickled, with hundreds of bubbles floating up to coalesce around you.  From the depths of some irrational part of your mind you thought it felt kinda like lying a big glass of soda pop, and of course there was still that inviting warmth lulling you to sleep.  You closed your eyes, completely relaxed and sank beneath the surface of her juices.  You would be digested and absorbed into her body, maybe to become a party of her amazingly sexy thighs, or maybe her breasts.  None of that mattered.  Where ever you ended up, you would be inside of her perfect body.  You would be home.</span></div></div>",
            "created":1214194500,
            "id":547444,
            "title":"Returning Home"
        },
        "13":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "Attempt to climb up her covers and wake her up.",
                "Better not risk falling.  You hide under the bed and wait until she gets up."
            ],
            "content":"<div class=\"\"><div> <span>After your few seconds of initial fright you begin to calm down.  You've always been known for keeping a calm head in big situations or at least in this case a very tiny situation.  You take in the pink curtains and all the band posters on the wall and you realize that you are in your best friend Hannah's room.  Looking across the expanse of the room you see her bed right in the middle, also decked out in pink.  All the way on at the top, almost out of your view due to the angle you can see a massive lump underneath the covers.  Hannah.  You set out across the room. If only you could wake up Hannah and get her attention maybe she could help you.<br>\r\n<br>\r\nYou travel for about ten minutes before finally arriving at the foot of her bed.  You now have two options: </span></div></div>",
            "created":1212296400,
            "id":538918,
            "title":"In your best friend Hannah's room."
        },
        "131":{
            "author_id":"ff7cetra",
            "author_name":"Dave",
            "choices":[
                "Not disturb but instead let her sleep peacefuly while you admire her",
                "turn her body into your own personal playground : )"
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to waste a single second you immediately grab a low hanging fold of pink sheet and begin to haul yourself up, hand over hand.  You make headway very slowly  since all of your weight (minuscule as you are) is straining at your arms since you have no footholds. You try not to look down as you climb up the slippery satin sheet, and try not to focus on how devastating a fall like that would be to your tiny body.<br>\r\n<br>\r\n     As you ascend higher and higher you can hear Hannah breathing above you.  Something about this excites you.  You have always really liked Hannah. She has to you always secretly been an icon of youthful beauty and energy.  Every time she she's you in the hall way at school she'll scream \"Danny!\" and run up and give you a huge hug.  Even though you really like her and there are occasionally times when it almost seems like she really liked you the two of you seem to be stuck in that \"friendship\" rut.  Sad seeing as to how she is super hot.  <br>\r\n<br>\r\n     So hearing her soft, gentle breathing reverberating all around your world, infusing the very air about you with all the energy and zest inherent in her body awakes in you a new desire, one much different, and much more primitive than your earlier wishes of getting help.  You begin to scramble as fast as you can up the expanse of the sheet, drawn on by the calling of her slow, steady breathing seeming to call out promises of raptures beyond all comprehension.  Fortunately for you you somehow managed not to fall in your head long dash up to the top and you eventually make it.  When finally you breach the top of the bed you behold the most wonderful sight any man has ever imagined.  Stretched out before you Hannah lies full up on her side facing you, but still asleep.  Sometime between now and when you had originally set out for the bed she had shifted and all the covers had fallen away from her, revealing her to be more a giant goddess wearing nothing other than a set of red silk bra and panties.  From where you crawled up onto the bed you are down by her knees. In front of you her colossal, yet still highly arousing thighs stretch away in perfect curvature, gracing the horizon and    seeming to almost reach for eternity before suddenly coming together perfectly and hiding their secrets beneath a single layer of thin, red silk.  Continuing on, craning your neck in awe of your friend's beauty your eyes flow upward, down along her smooth, perfectly flat stomach, unbroken by  any scar or blemish you eventually come to the view of another inviting red-lace field, this time covering (at least partially) her mountainous breasts. When you were your regular size you had always though Hannah had the perfect body.  Her breasts were nice sized C-cups, not too large, but certainly not lacking, and now in your diminutive size they are positively huge!  Somehow managing to tear your gaze away from them you continue on your visual tour to behold a spectacle almost unequaled on this earth.  In the soft dawn light the first sunbeams filtered into the room and alighted upon her face.  It illuminated her soft, blond hair that fell upon her sleeping visage  and turned her soft features into a picturesque angel. <br>\r\n<br>\r\nShe is a beautiful sleeping angel whom you should...</span></div></div>",
            "created":1212469260,
            "id":539471,
            "title":"Ascent to Heaven"
        }
    },
    "info":{
        "author_id":"ff7cetra",
        "author_name":"Dave",
        "brief_description":"You name is Danny Wilson, and when you wake up this morning you're only an inch tall!",
        "created":1212374700,
        "description":"<td align=\"left\" class=\"norm\">This is an interactive story involving a tiny man and some giantesses. Feel free to add if you want.  Insertion is ok, vore is great <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/smile.png\" alt=\"*Smile*\" class=\"emoteZ\" title=\"Smile\" border=\"0\" width=\"15\" height=\"15\">  Crushing is fine so long as it doesn't end in death.<br>\r\n<br>\r\nA note on insertion: I hate the word pussy. If it is used it will be edited.<br>\r\nEnjoy: ) </td>",
        "id":1433833,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1357940460,
        "modified":1357940460,
        "pretty_title":"Boy meets huge, huge world"
    }
}