{
    "chapters":{
        "1":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, are you a male or female?</span></div></span></div>",
            "created":1342462920,
            "id":1380055,
            "title":"Gender"
        },
        "11":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "A normal high school student",
                "A normal college student",
                "A police officer",
                "A private investigator",
                "A street conman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1342463040,
            "id":1380058,
            "title":"Male // Your Character"
        },
        "111":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "Of your parents. Your family is rich.",
                "Of a scholarship. Your family is actually really poor."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're 18 years old and a high school senior at Clearwater Heights Academy, a prestigious school for the rich and wealthy. You got into the school because . . .</span></div></span></div>",
            "created":1342464300,
            "id":1380072,
            "title":"You Are a Normal High School Student"
        },
        "1111":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "One of the local bad boys.",
                "A suspicious man wearing a heavy coat and a smirk.",
                "The smart girl from your class that got into Hightower because of a scholarship."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><b>Start of Story</b></div><br>\r\n<br>\r\n<div align=\"center\"><b>7:00 PM<br>\r\nOctober<br>\r\nNew York City</b></div><br>\r\n<br>\r\n<i>Ugh, such a tiring day.</i><br>\r\n<br>\r\nYou were walking down 7th Avenue lazily. School had ended about 4 hours and right after it, you and your friends had gone out to wander around town. You guys had just parted your ways since most of them had to go home and do whatever their parents forced them to do. But you, well, you had people to do stuff for you. <br>\r\n<br>\r\nAh, the joys of being rich.<br>\r\n<br>\r\nYou continue down the block normally. However, as you reached the end of the street and turned the corner, you came face-to-face with . .  </span></div></div>",
            "created":1342735440,
            "id":1382878,
            "title":"Your family is rich."
        },
        "11111":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "Accept his challenge anyway.",
                "Forget it. He's not worth getting grounded for."
            ],
            "content":"<div class=\"\"><div> <span>You found yourself coming face-to-face with Ian Castillo, one of the local bad boys and your rival since freshman year. Ian was a fair-haired 16-year-old guy that went to Hightower with you. His parents were rich as well, since they were doctors, and it was a wonder how a completely loving couple like Mr. and Mrs. Castillo can have such a good-for-nothing son as him. Why were you guys so bitter to each other? Well, that's a story for another time.<br>\r\n<br>\r\nAs soon as Ian saw you, his eyes immediately narrowed. <br>\r\n<br>\r\n\"Well, well, well,\" he snarled. \"Look what the cat dragged in.\"<br>\r\n<br>\r\nYour mood immediately dropped. \"Shut up,\" you spatted. <br>\r\n<br>\r\nIan's face darkened. \"You know, we still have some unfinished business to take care of,\" he said. \"How about you and I get it over with now?\"<br>\r\n<br>\r\nYou knew what he was talking about. This morning during 2nd period, a fight had broken out between you two, and if it wasn't for that annoying physics teacher of yours, someone would've won. This was a good time to finish what you two had started this morning. But then again, your parents had warned you not to cause any more trouble. You . . .</span></div></div>",
            "created":1343230740,
            "id":1388885,
            "title":"One of the local bad boys."
        },
        "111112":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "Decide to investigate further.",
                "Run."
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"No.\"<br>\r\n<br>\r\nYour reply came sharp and Ian looked genuinely shocked. Rarely did you ever turned down a challenge, especially if it involved him. <br>\r\n<br>\r\n\"What?\" he asked, slightly confused.<br>\r\n<br>\r\n\"You heard me,\" you responded. \"I said no. I'm already on probation with my parents -- call me a mama's boy but whatever. We'll settle this another time.\"<br>\r\n<br>\r\nFor a moment there was a tense silence, but it soon broke when Ian smirked. \"Fine then. Suit yourself,\" he said with a sly grin. Then, just like that, he walked pass you and disappeared around the corner 10 seconds later. You scowled and continued on your way. You knew you had just given him satisfaction by backing down, but you didn't care right now. You needed a way to get rid of these annoying thoughts.<br>\r\n<br>\r\n5 minutes later you arrive at a cafe in the middle of the city. As you enter, you see your best friend, Tony, sitting in the corner of his parents' restaurant playing on his laptop. He didn't notice your arrival until you pulled up a seat in front of him. He grinned as he realized who it was.<br>\r\n<br>\r\n\"Oh, hey!\" he beamed. \"How was school?\"<br>\r\n<br>\r\n\"Don't act like my mother.\"<br>\r\n<br>\r\n\"Sheesh, pushy.\"<br>\r\n<br>\r\nYou roll your eyes. \"You only missed two days of school -- nothing usually happens anyways.\"<br>\r\n<br>\r\n\"Not from what I heard. You and Ian got into a fight again?\"<br>\r\n<br>\r\n\" . . . No.\"<br>\r\n<br>\r\n\" . . . Uh huh.\"<br>\r\n<br>\r\nYou sighed. \"I don't really feel like talking about it. Entertain me. And don't think wrong.\"<br>\r\n<br>\r\nTony grinned, and for the next few hours you guys talked about random things. It wasn't until about 11 that you decided it was time to leave. You and Tony said your goodbyes before you left. However, about 15 minutes later as you were on your way home, you passed by a dark alley. Everything was fine at first. Then it happened:<br>\r\n<br>\r\nA gunshot rang through the air. <br>\r\n<br>\r\nYou ducked on impulse. Several seconds followed. Nothing happened. You slowly got up before peering slightly into the alley, the place where it came from. You . . .</span></div></div>",
            "created":1356054480,
            "id":1491889,
            "title":"Forget it"
        },
        "113":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "\"Oh I will.\"",
                "\"You're right. I won't.\""
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><b><br>\r\nStart of Story<br>\r\n<br>\r\n<br>\r\n12:00 PM<br>\r\nMonday<br>\r\nThe City</b></div><br>\r\n<br>\r\nYou dodge as a bat flies above your head and swerve your leg under your attacker, a local criminal named Cedric Shargie. The young college student drops to the ground and loses grip on the bat, letting it roll away. Quickly, before he could do anything else, you drew your gun and point it at him. <br>\r\n<br>\r\n\"No funny business,\" you warn. <br>\r\n<br>\r\nCedric snorts. \"As if you're gonna shoot me,\" he sneers.</span></div></div>",
            "created":1356370740,
            "id":1494075,
            "title":"You Are a Police Officer"
        },
        "1131":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "Greet her normally. ",
                "Get annoyed. "
            ],
            "content":"<div class=\"\"><div> <span>\"Oh yeah?\" you challenge. \"Remember the Niel Robinson case five months ago? The case where a 17-year-old kid abducted two girls? I was in charge of it; I was there when he died, and I was there alone. I don't think you need to be a rocket scientist to figure what happened.\"<br>\r\n<br>\r\nCedric glares at you but by reading his eyes, you can tell he won't be pulling anymore stunts. <br>\r\n<br>\r\n\"Yeah that's right,\" you say, still holding up your gun. \"Be a good boy. Now stand up so I can cuff you.\"<br>\r\n<br>\r\n45 minutes later, you're back at the station. You are now in your office, taking a break after you had turned in Cedric 10 minutes ago. However, a little while into your relaxing time, you get interrupted when a familiar person jumps out of nowhere and pushes you off your chair. <br>\r\n<br>\r\n\"Hey!\" you shouted as you look up to the person that mobbed you. You see a pretty blonde woman: Ally. She's one of the lab technicians, and she likes popping up out of nowhere and tackling you all the time. You . . .</span></div></div>",
            "created":1356394320,
            "id":1494239,
            "title":"\"Oh I will.\""
        },
        "1132":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "At the sky. ",
                "At his feet. "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"You're right,\" you say. \"I won't shoot you. But that doesn't mean I can knock you against the head. And just so you know, the last time I did that, the person I hit was out cold for half the day.\"<br>\r\n<br>\r\nCedric looks at you intensely. For a few seconds, everything was silent, but then you hear a chuckle. \"Well,\" he says. \"I think I'll take that chance.\"<br>\r\n<br>\r\nThen, before you can do anything, the college student jumps up and shoves you back before taking off towards an exit of the warehouse. You quickly steady yourself and let out some incoherent words before speeding off after him. You both rush through the door and outside to the front of the warehouse. Cedric runs onto the streets. <br>\r\n<br>\r\n\"Hey, kid, stop!\" you yell despite the fact that Cedric was only about 6 years younger than you. \"That's dangerous!\"<br>\r\n<br>\r\nCedric glances back for a second and you see a mischievous grin. \"Catch me if you can, sucker!\" he shouts before running onto the freeway.<br>\r\n<br>\r\nYou grit your teeth and run after him. If only your car wasn't at the repair shop. <br>\r\n<br>\r\nAn idea then strikes you. You take out your gun and shoot . . .</span></div></div>",
            "created":1356635040,
            "id":1495831,
            "title":"\"You're right. I won't.\""
        },
        "12":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "A normal high school student",
                "A normal college student",
                "An FBI agent",
                "A private investigator",
                "A news reporter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1342463160,
            "id":1380062,
            "title":"Female // Your Character"
        },
        "121":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "Out of curiosity. Your dad is a detective so he told you about it.",
                "Your mother was a victim of one of his fires."
            ],
            "content":"<div class=\"\"><div> <span>You're 17 years old and a high school senior at Clearwater Heights Academy, a prestigious school for the rich and wealthy. You got into the school because of a scholarship, unlike <i>some </i>people you know. <br>\r\n<br>\r\nNow how did you get involved with the Shadow Man Case?</span></div></div>",
            "created":1342465140,
            "id":1380080,
            "title":"You Are a Normal High School Student"
        },
        "1211":{
            "choices":[
                "Listen to your father, and stop looking for the man",
                "Continue looking ",
                "Go over your clues, but don't go out to look for more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your father told you about the the mysterious man, and you began looking for clues. Your father finds out about your snooping and tells you to stop before you get injured.<br>\r\n<br>\r\nWhat do you do?</span></div></span></div>",
            "created":1446848460,
            "id":2057609,
            "title":"Out of curiosity. Your dad is a detective so he..."
        },
        "123":{
            "author_id":"aznchika",
            "author_name":"DanniT",
            "choices":[
                "Decide to humor him. ",
                "Play it professionally. "
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><b><br>\r\nStart of Story<br>\r\n<br>\r\nMonday<br>\r\n7 AM <br>\r\nNew York City</b></div><br>\r\n<br>\r\nYou walk into your new work place, a large police station located in the buzzling city of New York. The building is busy. Officers swarm around, running back and forth between divisions, and you dodge a female officer as she flies pass you with a stack of folders. You walk up towards the check in area a few yards from the front entrance. <br>\r\n<br>\r\n\"Hello!\" a bubbly woman at the desk greets. \"What can I help you with ?\"<br>\r\n<br>\r\n\"Good morning,\" you reply back. \"I'm from the FBI department. I just transferred here.\"<br>\r\n<br>\r\nThe woman checked something on the computer before turning to you with a bright smile. \"Oh hello! You must be the mew Special Agent assigned to the Special Crime Division. You can find the department on the third floor.\"<br>\r\n<br>\r\nYou nod and thank her before going on with your way. As you step into the elevator, a tall man about 2 years older than you follows you in. He presses the button to the third floor before standing there silently. The elevator doors then close. As you travel up, you can't help but slightly glance over at his reflection against the glass walls. <br>\r\n<br>\r\nThe man stands there in deep though. He is tall, dark-haired, good-looking, and looks like one of those people that don't smile even if his life counted on it. However, before you could further \"observe\", there's a dinging sound and the doors open. You exit first and turn right at where a sign reads \"Special Crime Division\" followed by a pair of sliding glass doors. You enter the department. To your surprise, instead of seeing 20 other officers sitting at their desk, there are only 2 people: a blonde-haired man about your age and a brunette sitting beside him playing what appeared as Goldfish. <br>\r\n<br>\r\nThe brunette notices you first. She beams and throws down her cards, much to the blond's dismay, and jumps up to greet you. <br>\r\n<br>\r\n\"Hi!\" she exclaims. \"You must be the new addition to our team!\"<br>\r\n<br>\r\nYou smile and extend your hand. \"Yes I am. I'm Special Agent Williams. Nice to meet you.\"<br>\r\n<br>\r\nThe brunette shakes your hand energetically. \"I'm Emily.\"<br>\r\n<br>\r\nThe blond then stands up and grins at you. \"Well hello there,\" he greets with a wink. \"I'm Jay. And I don't think I've ever met such a pretty FBI agent before.\"<br>\r\n<br>\r\nYou . . .</span></div></div>",
            "created":1356410520,
            "id":1494278,
            "title":"You Are An FBI agent"
        }
    },
    "info":{
        "author_id":"aznchika",
        "author_name":"DanniT",
        "brief_description":"Catch the 'Shadow Man' by playing a cop, investigator, reporter, or even a normal student.",
        "created":1342462860,
        "description":"<td align=\"left\" class=\"norm\">Bombs are being placed, people are getting kidnapped, fires are purposely getting ignited, and accidents are getting planned. This, my friend, is all the work of the Shadow Man. <br>\r\n<br>\r\nMale viewers can play as a cop, private investigator, street conman, or a normal high school/college student.<br>\r\nFemale viewers have the option of playing a normal high school/college student, cop, private investigator, or even a news reporter.<br>\r\n<br>\r\nBut it doesn't matter who you are because as long as you make the right decisions, you're gonna be known as the person that caught the Shadow Man.<br>\r\n<br>\r\n<span class=\"cred\"><div align=\"center\"><u>Rules:</u></div></span><br>\r\n<br>\r\n1. Mild slang curse words like 'dang' and 'heck' are fine, but real swearing is not allowed.<br>\r\n2. Please use proper grammar. Slang is fine though because it makes the characters sound more real.<br>\r\n3. Violence is fine as long as it's not too much.<br>\r\n4. Romance is encouraged<br>\r\n5. No explicit scenes please.<br>\r\n6. Please keep it second person point of view.<br>\r\n7. Please keep from naming the main characters. Last names are fine though as long as they're constant.<br>\r\n<br>\r\nOther than that, enjoy and please add!</td>",
        "id":1880002,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1446848460,
        "modified":1446848460,
        "pretty_title":"The Shadow Man Case"
    }
}