{
    "chapters":{
        "1":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be an Elf, Dwarf, or Halfling",
                "Be a Human, Frostling, Lizardman, Azrac or High Man",
                "Be an Orc, Undead, Goblin or Dark Elf"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To fit all these characters in, you'll have to choose which race you want your character to be. Feel free to explore them all, there will probably be hundreds of stories in this interactive.</span></div></span></div>",
            "created":1186894800,
            "id":435552,
            "title":"Races"
        },
        "11":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Elf",
                "Dwarf",
                "Halfling"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now choose to be an Elf, Dwarf or Halfling.</span></div></span></div>",
            "created":1186894800,
            "id":434833,
            "title":"Elf, Dwarf of Halfling"
        },
        "111":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Arnus, Flandar or Jiswyn",
                "Be Lingolas, Lundar or Menfir"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>six</b> characters to choose from: <br>\r\n<br>\r\n<b>Arnus Strongbow</b> - he is young yet, for an elf, but extremely good with a bow. He's light-hearted and laughs all the time. He's good friends with the Halfling, Lilly Whiteleaf. He lives in the Elven kingdom of Lenore with Lilly, Menfir and Lindar, a corrupt elven king and brother to Lundar.<br>\r\n<br>\r\n<b>Flandar Dragoneye</b> - he is the general of the elven army under the rule of Lundar Elfking. He is brother of Jiswyn and is good friends with Lingolas and has a sort of rival with Menfir, though they do not dislike each other. He's an extremely good warrior and does everything to protect the royal family. <br>\r\n<br>\r\n<b>Jiswyn Treesong</b> - she is the sister of Flandar Dragoneye and is in a relationship with Lingolas Shadowscorn. She is a healer and a very powerful one at that. She's caring and kind and extremely beautiful. <br>\r\n<br>\r\n<b>Lingolas Shadowscorn</b> - he is the hermit son of Lundar Elfking. He exiled himself after the death of his twin brother, but is slowly coming back into contact with the elven kingdom of Cale, where Lundar reigns as king. He is in a relationship with Jiswyn Treesong and is good friends the others.<br>\r\n<br>\r\n<b>Lundar Elfking</b> - he is a good king. He is brother to Lindar Elfking, who rules Lenore with an iron fist. Lundar will do everything in his power to ensure the safety and future of his race.<br>\r\n<br>\r\n<b>Menfir Oakleaf</b> - the son of the horrid king Lindar Elfking, he rather spends his time in his Uncle's kingdom of Cale, with his cousin Lingolas. He travels with Arnus Strongbow and the halfling Lilly Whiteleaf. He is careful and full is mischeif, but is good at heart. <br>\r\n</span></div></div>",
            "created":1186894800,
            "id":434847,
            "title":"Character Choice"
        },
        "1111":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Arnus",
                "Flandar or Jiswyn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Arnus, Flandar or Jiswyn...</span></div></span></div>",
            "created":1186894800,
            "id":434864,
            "title":"Character Choice II"
        },
        "11111":{
            "author_id":"beware_five",
            "author_name":"Beware_Five",
            "choices":[
                "Have the meeting with King Lindar go Well and Dethrone him",
                "Have the meeting go wrong and you are forced to withdraw, swearing vengeance."
            ],
            "content":"<div class=\"\"><div> <span>Arnus sat on the bench in the garden behind his house while he waited for the others to arrive. He sat staring at the golden flowers called morning glory's, they were his favorite because they showed themselves in full bloom early in the day. <br>\r\n<br>\r\nHe was still staring at the golden petals when he heard footsteps coming from the back end of the garden. He quickly turned to see Lilly Whiteleaf approaching as loudly as her little feet could manage. He laughed when he saw what she was dressed in, She had on a small shirt that was the most outrageous thing he had ever seen. It was pink and green with spots of orange and purple dotted through it. Her pants were a solid blue and only reached her knees. Her hair was in pigtails and she was barefoot of all things! She was closely followed by Jiswyn Treesong and her brother Flandar Dragoneye. They were some of his most trusted friends but Lilly had to be his favorite, with here outrageous outfits and light attitude. He stood up from the bench as he took his eyes away from his flowers.<br>\r\n<br>\r\n\"So friends, Shall we head out?\" Arnus questioned lightly. He grabbed his bow from where it had rested just moments before. His quiver was slung lazily across his back and he cocked his head to look over at Lilly while he stretched.   <br>\r\n<br>\r\n\"So, I love your outfit today Lilly!\" Arnus laughed as soon as he saw Lilly smile. <br>\r\n<br>\r\n\"I wore it just for you Arnus, I knew you'd get a good laugh out of it!\"  Jiswyn smiled at that.<br>\r\n<br>\r\n\"But he gets a good laugh out of everything!\" She teased. Flandar stood with his sword at his hip and with an easy smile on his lips.<br>\r\n<br>\r\n\"He gets a kick outta everything!\" He joked.<br>\r\n<br>\r\n\"Come on guys, I'm not that bad!\" Arnus laughed yet again.<br>\r\n<br>\r\n\"Sure your not\" Lilly played with the strings in her hair as she said this. <br>\r\n<br>\r\n\"Okay, so maybe I laugh a little too much...\" He started.<br>\r\n<br>\r\n\"A little?!\" Jiswyn and Flandar said in unison. Lilly chuckled at how much they could be alike sometimes.<br>\r\n<br>\r\n\"Well shouldn't we be leaving?\" She said rather loudly.<br>\r\n<br>\r\n\"Alright Ms. Fidget, Lets go guys\" Arnus chuckled.<br>\r\n<br>\r\n\"Why are we leaving so early anyway, It only takes like twenty minutes to get there!\" Flandar complained. The others just looked at him and walked away. As they were entering the gates of a large castle like structure twenty minutes later they were stunned by what they saw.<br>\r\n<br>\r\n\"Wow...That is bad...\" Jiswyn said softly. Even Arnus couldn't find a thing to laugh about. There were guards surrounding three pens full of Elves and Humans and other prisoners gathered in the courtyard. <br>\r\n<br>\r\n\"What is going on?\" Arnus said with a heavy edge in his voice. A guard walked by and must have heard his question.<br>\r\n<br>\r\n\"There isn't any more room in the dungeons, so this is where the prisoners stay.\" The guard stated sullenly. As he walked away Arnus turned to his friends.<br>\r\n<br>\r\n\"Our mission just became a whole lot easier guys! We have got to get to the throne room and have a 'talk' with King Lindar...And soon\"<br>\r\n</span></div></div>",
            "created":1187154000,
            "id":436010,
            "title":"The Departure"
        },
        "111112":{
            "author_id":"beware_five",
            "author_name":"Beware_Five",
            "choices":[
                "Make it to throne room",
                "Be stopped before you can make it."
            ],
            "content":"<div class=\"\"><div> <span>Arnus and Flandar crouched down to survey the scene before them. The prisoners were surrounded by five guards to each pen. There was also an additional three guards standing watch at the hall entrance. Arnus turned to Flandar and the women.<br>\r\n<br>\r\n\"Flandar, Can you take out the guys by the hall entrance?\" Arnus whispered.<br>\r\n<br>\r\n\"Thats an insult, there is only three of them, give them to Lilly!\" Flandar flustered.<br>\r\n<br>\r\n\"I would, but I need her and You can take them out silently, we don't want to raise the alarm.\" Arnus protested.<br>\r\n<br>\r\n\"Fine, I'll do it, but next time you get that job!\" Flandar retorted as he slid his scimatar out of it's sheath at his side. He silently crept forward and got into position.<br>\r\nArnus nodded his consent at his choice of placement for the attack.<br>\r\n<br>\r\n\"Alright, we need Jiswyn to stay as far as way from the battle as possible, your our healer and we need you the most.\" Jiswyn nodded in agreement and scurried back into a corner. <br>\r\n<br>\r\n\"Lilly, I need you to...\" He began.<br>\r\n<br>\r\n\"I know! Be the distraction, Got it!\" Lilly was moving away when she spotted a figure standing in the shadows near Arnus. She slid back into place beside Arnus.\"<br>\r\n<br>\r\n\"Hey Arnus, There is someone in the shadows...\" She didn't get very far before Arnus looked at her with delightment gleaming in his eyes.<br>\r\n<br>\r\n\"I know, he has been following us for some time. It's alright, don't worry about it, He is no threat.\" Arnus chuckled.<br>\r\n<br>\r\n\"So you know him?\" Lilly smiled.<br>\r\n<br>\r\n\"Of course, so do you! Now hurry and get into position!\" Lilly scuttled into position while trying to place that ominous figure. When the signal was flashed Lilly jumped out of where she was hiding and shot a guard with a small slingshot she carried. The guard looked annoyed and the others just laughed, He came towards Lilly with hate in his eyes.<br>\r\n<br>\r\n\"Hey squirt! Why are you hiding?\" He yelled. <br>\r\n<br>\r\n\"Who's hiding?\" She said, leading him into a dark shaded area away from the eyes of his buddies. The guard looked at her and started forward, When he reached her he raised his sword for the killing strike and swung, He was suddenly still though, with an arrow protruding from his back. Lilly smiled and went to collect the next victim. At the same time Lilly had lead her first victim to his death,  Flandar had quickly spun out if his hiding space and finished the first guard with one swing of his sword. Before the others had time to realize what happened, they were on the ground bleeding. one got up quickly and started a dance of whirling blades around Flandar. He stepped out of the way and kicked the guard in the gut as he passed.<br>\r\nThe other guard was slowly crawling toward the alarm and looked back to see Flandar close on his heels. He got up and ran towards it and almost made it before an arrow whizzed out of nowhere and killed the man. Flandar went back and continued his fight with the other guard.<br>\r\nArnus thought how everything was going perfect when he heard the voice of a female cry out somewhere behind him. Jiswyn was standing there, behind her was a man with his arm around her neck and a knife at her throat. Arnus looked from his bow to the man and wondered if he could make it in time. He knew instantly that he could not. <br>\r\n<br>\r\n\"Don't even think of using that against me Arnus, You'll never make it. She'll be dead before you even nocked your arrow!\" A deep voice thundered. <br>\r\n<br>\r\nHe was right, Arnus thought about the man who had been following them, hoping he was somewhere near by. He looked out of the corner of his eye and saw the figure slide from on side of the wall where Arnus had just been leaning. He breathed easier when he saw the Shadow get near the tall figure with Jiswyn. Arnus gasped when he saw a flash of the knife on Jiswyn's neck. He tore his gaze away from the shadow and looked to the tall man. Jiswyn stumbled from his suddenly limp grasp. By then The others had returned and seen what happened somewhat. Flandar caught his sister and drug her away from the falling man. When he landed on his face they saw the reason for his death, A blade about five inches long was embedded in his back. Arnus made sure that their mission had been completed, the prisoners were running wild. Mission 1 complete. He then stepped forward and bowed his respects to the shadow near the wall.<br>\r\n<br>\r\n\"Nicely done Lingolas Shadowscorn...\"</span></div></div>",
            "created":1187154000,
            "id":436096,
            "title":"The Distraction"
        },
        "11112":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Flandar",
                "Jiswyn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Flandar or Jiswyn...</span></div></span></div>",
            "created":1186894800,
            "id":434865,
            "title":"Character Choice III"
        },
        "1112":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Lingolas",
                "Lundar or Menfir"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lingolas, Lundar or Menfir</span></div></span></div>",
            "created":1186894800,
            "id":434866,
            "title":"Character Choice II"
        },
        "11121":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Lingolas's cousin Menfir and his entourage is visiting...",
                "There is an archery contest to attend...",
                "A crown council meeting with his father..."
            ],
            "content":"<div class=\"\"><div> <span>He woke to a darkened cave, lit only by dim, dying candlelight. It had long since stopped terrifying him, the dark. When he'd exiled himself to this hermit life, he'd grown accustom to it, fortifying this cave into a domicile he'd trust in. One he called home, to the best of his ability. The word had never been defined by a location for him. But rather the people in it. And right now, the woman laying next to him was all the home he needed. <br>\r\n<br>\r\nJiswyn. Treesong. The many names she was known by and Lingolas was fond of simply calling her his. His love. She lay at his side, golden hair splayed out behind her, a slender arm laid across his chest while her head rested against his shoulder. She was bare, covered only by the fur blanket that lay across the both of them. She'd come to visit him the previous night, as she often did these days. Escaping from the castle, though he'd hardly call it an escape. She lived in the kingdom's castle out of choice. The most prominent healer in the kingdom. Perhaps it wasn't always the wisest choice to allow her to share his bed, should something happen in the castle that required her aid. It was why Flandar, her brother, always knew where she escaped to. Even condoned it, which flattered Lingolas to no end. <br>\r\n<br>\r\nHis hand curled around her shoulder, thumb running along her bare skin as he once again reveled in the gifts that were given to him. Exile looked different to him today than it had all those years ago when he'd first banished himself to it. He'd done so out of necessity. His twin brother, heir to the throne, struck down in front of him and it had nearly cost Lingolas his own life. Always a reminder on the faces of his people that they should be looking at two princes, instead of the one. He'd wanted to give them none. He'd wanted to follow his brother into that dark oblivion. These days, the sentimentality wasn't the same. He had no desire to do so anymore. Yet, he had no desire to return to the castle. <br>\r\n<br>\r\nNot for lack of love for his people or his father. Simply because he would know when the time was right. It wasn't that time yet. Not now. Right now, he was enjoying the woman curled at his side. <br>\r\n<br>\r\n\"Mmm,\" she gave a soft moan as he shifted beneath her, trying not to wake her and failing. Her head tipped back, blue eyes opening to the world as she looked up at him, smile slipping across full lips. \"Good morning,\" she whispered to him. <br>\r\n<br>\r\n\"Morning,\" he echoed back to her, shifting again to try and awaken his tired bones. \"How do you know it is morning, love?\" he asked. <br>\r\n<br>\r\n\"I just know,\" she groaned back to him, rolling to the side to stretch and he missed her warmth immediately. She didn't sit up yet, enjoying just lazing in the bed with him. \"Intuition,\" she added as she looked at his face again. <br>\r\n<br>\r\nSmiling down at her, he leaned in for a kiss before pulling back. \"Then I will believe you,\" he told her. <br>\r\n<br>\r\nWith a soft laugh, she sighed afterwards, sitting up and pulling the furs with her. It left him bare chested, exposed to the drafty cave air and he tried to tuck in at her side again for the warmth. She playfully shoved him away and it brought a smile to his face. How carefree they could be these days. The whole of Isolace may be at war, but their kingdom was safe. The Dark Alliance hadn't yet breached their territory. <br>\r\n<br>\r\n\"You should get up,\" she told him. \"You have a busy day.\" <br>\r\n<br>\r\nHe lifted a brow curiously at that, hand falling against her bare back, tracing her spine as though it would beckon her to lay down with him again. \"With what?\" he demanded playfully. \"What could I possibly be busy with today?\" </span></div></div>",
            "created":1437195600,
            "id":2009537,
            "title":"Lingolas"
        },
        "11122":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Lundar",
                "Menfir"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lundar or Menfir...</span></div></span></div>",
            "created":1186894800,
            "id":434867,
            "title":"Character Choice III"
        },
        "112":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Bandir, Portak or Sondra",
                "Be Thomac, Tondor or Trong"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>six</b> character to choose from:<br>\r\n<br>\r\n<b>Bandir the Fiery</b> - he is high spirited and has an explosive temper. He is good in nature and is good friends with Sondra. He fights in the dwarven army and likes a good ale every now and again.<br>\r\n<br>\r\n<b>Portak Sandstone</b> - though he loves his home in the mountains, he has always wanted more and disagrees with Trong's stubborn mentality to stay where they are. He wishes to see the ocean.<br>\r\n<br>\r\n<b>Sondra the Priestess</b> - she is gentle but with a strong, bosterous personality. She is a healer in the dwarven army and good friends with Bandir. She is always smiling and joking.<br>\r\n<br>\r\n<b>Thomac Stonecrusher</b> - he is a general in the dwarven army. He is strong and loud and can sometimes be mean, but he's just and bold. He'll do anything for his people and wants to protect their home at all costs. <br>\r\n<br>\r\n<b>Tondor Grimstone</b> - he is second in command to Trong. He's wise and brave and is working with the Elf King Lundar to establish a good relationship between Elf and Dwarf, to keep the alliance strong. He is good friends with the elves. <br>\r\n<br>\r\n<b>Trong the Dwarf</b> - as a leader, he is horrible. He is drunk 90% of the time and the times when it calls him to be a leader, he make Tondor take control. He feels no shame and is easily corruptable. </span></div></div>",
            "created":1186894800,
            "id":434844,
            "title":"Character Choice"
        },
        "1121":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Bandir",
                "Portak or Sondra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bandir, Portak or Sondra...</span></div></span></div>",
            "created":1186894800,
            "id":434868,
            "title":"Character Choice II"
        },
        "11212":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Portak",
                "Sondra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Portak or Sondra...</span></div></span></div>",
            "created":1186894800,
            "id":434869,
            "title":"Character Choice III"
        },
        "1122":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Thomac",
                "Tondor or Trong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Thomac, Tondor or Trong...</span></div></span></div>",
            "created":1186894800,
            "id":434870,
            "title":"Character Choice II"
        },
        "11222":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Tondor",
                "Trong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tondor or Trong...</span></div></span></div>",
            "created":1186894800,
            "id":434871,
            "title":"Character Choice III"
        },
        "113":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Ham, Lilly or Meridon",
                "Be Tritan or Winger"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>five</b> characters to choose from:<br>\r\n<br>\r\n<b>Ham Binger</b> - he's friends with Winger Lightfinger and cousin to Lilly Whiteleaf. He's sarcastic and huffy, but extremely good at heart. He's currently being held in a goblin dungeon along with Winger.<br>\r\n<br>\r\n<b>Lilly Whiteleaf</b> - she's a a joyful person who always has a smile on her face. She travels with Arnus Strongbow and Menfir Oakleaf. She's cousin to Ham Binger. She spends  most of her time helping the elves fight in the war.<br>\r\n<br>\r\n<b>Meridon the Wise</b> - he is second in command of the Halfling army. He's extremely old and extremely wise. He's a story teller and a musician. Many people go to him for answers.<br>\r\n<br>\r\n<b>Tritan the Half</b> - ruler of the Halflings, he's a younger king than his predecessors. He's completely faithful to the White Army, and will stop at nothing to see them succeed and survive. <br>\r\n<br>\r\n<b>Winger Lightfinger</b> - he's a bit strange. He has a joking manner about him and comes off rather aloof to people who don't know him. He's best friends with Ham Binger and good friends with Lilly Whiteleaf. He's currently being held in a goblin duneon with Ham. </span></div></div>",
            "created":1186894800,
            "id":435046,
            "title":"Character Choice"
        },
        "1131":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Ham",
                "Lilly or Meridon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ham, Lilly or Meridon...</span></div></span></div>",
            "created":1186894800,
            "id":434872,
            "title":"Character Choice II"
        },
        "11312":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Lilly",
                "Meridon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lilly or Meridon...</span></div></span></div>",
            "created":1186894800,
            "id":434873,
            "title":"Character Choice III"
        },
        "1132":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Tritan",
                "Winger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tritan or Winger...</span></div></span></div>",
            "created":1186894800,
            "id":434874,
            "title":"Character Choice II"
        },
        "12":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Human",
                "Frostling",
                "Lizardman",
                "Azrac",
                "High Man"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now choose to be Human, Frostling, Lizardman, Azrac of High Man.</span></div></span></div>",
            "created":1186894800,
            "id":434834,
            "title":"Neutral Races"
        },
        "121":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be one from group A",
                "Be one from group B or C"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>fifteen</b> characters to choose from<br>\r\n<br>\r\n<b><u>Group A:</u></b><br>\r\n<br>\r\n<b>Allocia Stinkweed</b> - he's a greedy landowner and ruler over a small city. He is married to Esmerelda the healer, but suspects her of cheating. He's a bit cruel and cold hearted, but easily manipulated by whomever threatens him the hardest. <br>\r\n<br>\r\n<b>Atam the Righteous</b> - he is devoting his life to becoming a High Man, though the gods seemed to have turned their backs on him. He is a rogue in life and travels alone, but is willing to help anyone who needs him. He is pure of heart and extremely good at fighting.<br>\r\n<br>\r\n<b>Averdin Freeman</b> - he is like a bodyguard to Esmerelda the Healer, and he is also her secret lover. He is completely devoted to her and will do anything for her. He's deadly with swords and has yet to be defeated in a duel, which is one of his favorite past times.<br>\r\n<br>\r\n<b>Conan McHarr</b> - he is good friends with Jacob the Noble and the two of them serve under Cristof the Man. Together, they are an unstoppable duo. Conan is gruff and rugid and loud and bosterous. He has no tact and doesn't have a problem making his thoughts be known.<br>\r\n<br>\r\n<b>Cristof the Man</b> - the leader of men. He's good at heart, but like all men, easily corruptable. He tries to do what is best for his people, but confusion plagues him. He trusts no one but his closest men.<br>\r\n<br>\r\n<br>\r\nGroup B:<br>\r\n<br>\r\n<b>Danto Dragonslayer</b> - a cocky, galliant man who is a legend throughout Isolace. He's slain 23 dragons in his life, more than any mortal or immortal. He searches out dragons to kill and he is fearless in his slaughter of them. He's become a horrid enemy of all dragonkin. It is said that even the Lizardmen have a fear of him.<br>\r\n<br>\r\n<b>Erik the Bold</b> - his title is deceiving. He is cruel and merciless and takes pleasure in the pain of others. He was married to Alexandra Lifestealer before he killed her. He does not know that she's been turned undead. He has no alliances but those to himself.<br>\r\n<br>\r\n<b>Esmerelda the Healer</b> - she is married to Allocia Stinkweed but has lost all love for him due to his cruel ways. Her secret lover is Averdin Freeman. She loves him dearly. She is a healer by trade and she has more magic than most mortals, which she uses to help others, much to the displeasure of her husband.<br>\r\n<br>\r\n<b>Jacob the Noble</b> - he is good friends with Conan McHarr. They work together for Cristof. The complete opposite of his friend, Jacob is graceful and more of the diplomatic type. He is eloquent and very crafty. But he is also good with a blade when the time calls for it. <br>\r\n<br>\r\n<b>Joshua the Martyr</b> - he was killed many years ago in battle. The story goes that Joshua was the last man standing against an army of hundreds. He struck down every one of them before succumbing to his wounds. He's been recently brought back to life by the gods to help fight in the war. He has found friends within the elven race.<br>\r\n<br>\r\n<br>\r\nGroup C:<br>\r\n<br>\r\n<b>Khabar Eagle Eye</b> -his alliances lie where the money comes most. He has been paid by Allocia Stinkweed to spy on his wife, Esmerelda the Healer and to find out who she has been sleeping with.<br>\r\n<br>\r\n<b>Prince the Paladin</b> - he is a sniveling little man, scared of battle and usually stands back to watch instead of running into the fray. He has a strong dislike of Menfir Oakleaf because of a past encounter with him. He is friends with Allocia Stinkweed.<br>\r\n<br>\r\n<b>Roderick Nightrunner</b> - he is a good man. He is ruler over a small city, but it is prosperous and just to the people who live there. He welcomes all who come to his city and he plans on aiding the White Army in the war. <br>\r\n<br>\r\n<b>Sylvia Firehair</b> - she is good friends with Resh Redhead, a Lizardman. She's spunky and fierce and fights for the White Army, though her alliance is questionable. <br>\r\n<br>\r\n<b>Zelda the Pure</b> - she is a priestess to the gods and she lives in the city ruled by Roderick Nightrunner, whom she secretly admires and harbors feelings for. She does not condone war, but is not against defending the people of the city. </span></div></div>",
            "created":1186894800,
            "id":435049,
            "title":"Character Choice"
        },
        "1211":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Allocia, Atam or Averdin",
                "Conan or Cristof"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allocia, Atam, Averdin, Conan or Cristof....</span></div></span></div>",
            "created":1186894800,
            "id":434875,
            "title":"Character Choice II"
        },
        "12111":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Allocia",
                "Atam or Averdin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allocia, Atam or Averdin...</span></div></span></div>",
            "created":1186894800,
            "id":434876,
            "title":"Character Choice III"
        },
        "121112":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Atam",
                "Averdin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Atam or Averdin...</span></div></span></div>",
            "created":1186894800,
            "id":434877,
            "title":"Character Choice IV"
        },
        "12112":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Conan",
                "Cristof"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Conan or Cristof...</span></div></span></div>",
            "created":1186894800,
            "id":434878,
            "title":"Character Choice III"
        },
        "1212":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Group B",
                "Group C"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Group B:<br>\r\n<br>\r\nDanto, Erik, Esmerelda, Jacob, or Joshua.<br>\r\n<br>\r\n<br>\r\nor <br>\r\n<br>\r\n<br>\r\nGroup C:<br>\r\n<br>\r\nKhabar, Prince, Roderick, Sylvia or Zelda...</span></div></span></div>",
            "created":1186894800,
            "id":434879,
            "title":"Character Choice II"
        },
        "12121":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Danto, Erik or Esmerelda",
                "Jacob or Joshua"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Danto, Erik, Esmerelda, Jacob or Joshua</span></div></span></div>",
            "created":1186894800,
            "id":434880,
            "title":"Character Choice III"
        },
        "121211":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Danto ",
                "Erik or Esmerelda"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Danto, Erik or Esmerelda...</span></div></span></div>",
            "created":1186894800,
            "id":434881,
            "title":"Character Choive IV"
        },
        "1212112":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Erik",
                "Esmerelda"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Erik or Esmerelda...</span></div></span></div>",
            "created":1186894800,
            "id":434882,
            "title":"Character Choice V"
        },
        "121212":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Jacob",
                "Joshua"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jacob or Joshua...</span></div></span></div>",
            "created":1186894800,
            "id":434883,
            "title":"Character Choice IV"
        },
        "12122":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Khabar, Prince, or Roderick",
                "Sylvia or Zelda"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Khabar, Prince, Roderick, Sylvia or Zelda...</span></div></span></div>",
            "created":1186894800,
            "id":434884,
            "title":"Character Choice III"
        },
        "121221":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Khabar or Prince",
                "Roderick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Khabar, Prince or Roderick...</span></div></span></div>",
            "created":1186894800,
            "id":434885,
            "title":"Character Choice IV"
        },
        "1212211":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Khabar",
                "Prince"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Khabar or Prince...</span></div></span></div>",
            "created":1186894800,
            "id":434886,
            "title":"Character Choice V"
        },
        "121222":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Sylvia",
                "Zelda"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sylvia or Zelda...</span></div></span></div>",
            "created":1186894800,
            "id":434887,
            "title":"Character Choice IV"
        },
        "122":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Bjern, Eclo or Freya",
                "Be Norshin or Paral"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>five</b> characters to choose from:<br>\r\n<br>\r\n<b>Bjern Wolfsong</b> - he is a hermit among the other frostlings, but he is wise and just and a powerful warrior. He watches over his people even if he does not come into much contact with them. He supports the White Army best he can. <br>\r\n<br>\r\n<b>Eclo Frostbite</b> - he is married to Freya the Seer and loves her dearly. He is a powerful mage among his people, although he may be a bit naive when it comes to worldly things. <br>\r\n<br>\r\n<b>Freya the Seer</b> - she is a prophet and married to Eclo Frostbite. Many people come to her for visions of the future and she has helped people of all races, though recently has refused to help those of the Dark Alliance. <br>\r\n<br>\r\n<b>Norshin War Priest</b> - he is an extremely powerful mage and holds a friendly rival with Eclor Frostbite. In battle, he is a great asset and has many spells that can counter the dark spells of the undead. His name is famous among the undead and they are gunning for him. <br>\r\n<br>\r\n<b>Paral the Cold</b> - leader of the Frostlings. He refuses to acknowledge and alliance with either side of the war, saying that the war will not come their way if they do not attract it. His people disagree with him an they are beginning to rebel. He plans on quieting them. </span></div></div>",
            "created":1186894800,
            "id":435051,
            "title":"Character Choice"
        },
        "1221":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Bjern or Eclo",
                "Freya"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bjern, Eclo or Freya...</span></div></span></div>",
            "created":1186894800,
            "id":434888,
            "title":"Character Choice II"
        },
        "12211":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Bjern",
                "Eclo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bjern or Eclo...</span></div></span></div>",
            "created":1186894800,
            "id":434889,
            "title":"Character Choice III"
        },
        "1222":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Norshin",
                "Paral"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Norshin or Paral...</span></div></span></div>",
            "created":1186894800,
            "id":434890,
            "title":"Character Choice II"
        },
        "123":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Forok, Lorash or Resh",
                "Be Shai or Tarash"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>five</b> characters to choose from:<br>\r\n<br>\r\n<b>Forok the Bloated</b> - he is a cruel slave master.  He's fat and greedy. He's made enemies with Resh Redhead, a young hotshot. He also allies himself with the Dark Alliance.<br>\r\n<br>\r\n<b>Lorash the Lizard</b> - leader of the Lizardmen. He's good in nature but refuses to choose a side in the war, not wanting to get involved. He's accepting of most people, but has problems keeping control over the different colonies.<br>\r\n<br>\r\n<b>Resh Redhead</b> - he's young and brash and very brave, but often rushes into things before thinking. He's friends with Sylvia Firehair and secretly loves her.<br>\r\n<br>\r\n<b>Shai Eggbuster</b> - he disagrees with Lorash's decision to remain neutral. He leaves to go fight alongside the White Army and soon ends up in the company of elves. <br>\r\n<br>\r\n<b>Tarash the Shaman</b> - he is a powerful shaman and a great healer for the Lizardmen. He has powers he has not yet begun to tap into and is just waiting for the chance to use them. </span></div></div>",
            "created":1186894800,
            "id":435052,
            "title":"Character Choice"
        },
        "1231":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Forok or Lorash",
                "Resh"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Forok, Lorash or Resh...</span></div></span></div>",
            "created":1186894800,
            "id":434891,
            "title":"Character Choice II"
        },
        "12311":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Forok",
                "Lorash"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Forok or Lorash...</span></div></span></div>",
            "created":1186894800,
            "id":434892,
            "title":"Character Choice III"
        },
        "1232":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Shai",
                "Tarash"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shai or Tarash</span></div></span></div>",
            "created":1186894800,
            "id":434893,
            "title":"Character Choice II"
        },
        "124":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Azrac, Karum or Katar",
                "Sha'rah or Vn'nih"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>five</b> Azrac characters to choose from:<br>\r\n<br>\r\n<b>Azrac the Gold</b> - he is the leader of the Azracs. He leads his people in their worship of the Sun God. He is a strict follower of tradition and rules and frowns upon outsiders to his race.<br>\r\n<br>\r\n<b>Karum the Mighty</b> - he is second in command to Azrac the Gold. He is a strong warrior and extremely smart. He is more accepting of outsiders and often times wonders about their connection to the Sun God.<br>\r\n<br>\r\n<b>Katar the Gladiator</b> - he is strong, massive in stature and is an arena pit fighter in the Azrac city. He has yet to be beaten. <br>\r\n<br>\r\n<b>Sha'rah Sundance</b> - She is very strong in her faith of the Sun God, yet she questions Azrac the Gold's view on outsiders. She is lively and wants to explore, but knows it would go against the word of the Sun God.<br>\r\n<br>\r\n<b>Vn'nih the Odd</b> - He is cooky and brave but is naive about the world outside the Azrac city. Unlike his brethern, his faith in the Sun God is lacking and he craves to leave the city.</span></div></div>",
            "created":1186894800,
            "id":434836,
            "title":"Character Choice"
        },
        "1241":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Azrac",
                "Karum or Katar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Azrac, Karum or Katar...</span></div></span></div>",
            "created":1186894800,
            "id":435021,
            "title":"Character Choice II"
        },
        "12412":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Karum",
                "Katar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Karum or Katar...</span></div></span></div>",
            "created":1186894800,
            "id":435022,
            "title":"Character Choice III"
        },
        "1242":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Sha'rah",
                "Vn'nih"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sha'rah or Vn'nih...</span></div></span></div>",
            "created":1186894800,
            "id":435023,
            "title":"Character Choice II"
        },
        "125":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Caspar or Isabelle",
                "Be Namru or Unwar"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>four</b> characters to choose from:<br>\r\n<br>\r\n<b>Caspar the Pious</b> - he is one of the most well known of the High Men due to his recent endeavors into magic and science, which goes against the faith of the High Men. Lately, his belief in the gods has been slipping and he finds himself not knowing what side of the war to help. <br>\r\n<br>\r\n<b>Isabelle the Serene</b> - unlike the rest of her race, she was turned into a High Man by Namru the Foresaken, who did so to save her life during a time of plague. Namru is her brother, but she harbors no love for him. She goes against the gods, yet the magic Namru used to turn her is still strong, and the gods have yet to abandon the hold she has on them. She has an attraction to the Dark Elves.<br>\r\n<br>\r\n<b>Namru the Foresaken</b> - foresaken by his people after turning his sister, Isabelle the Serene into a High Man to save her life, Namru is now exiled to the ancient city of Advent, where he wanders its ruins in search of answers to his own confusion. It is questioned why the gods still hold him in their favor.<br>\r\n<br>\r\n<b>Unwar the High</b> - the eldest of the remaining High Men, he was one of the first to be turned. After his many long years of life, he has become a bit eccentric. His favor with the gods is slipping, but they still hold on to him in the hopes he will redeem himself and help in the war. </span></div></div>",
            "created":1186894800,
            "id":435329,
            "title":"Character Choice"
        },
        "1251":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Caspar",
                "Isabelle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Caspar or Isabelle...</span></div></span></div>",
            "created":1186894800,
            "id":435024,
            "title":"Character Choice II"
        },
        "1252":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Namru",
                "Unwar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Namru or Unwar...</span></div></span></div>",
            "created":1186894800,
            "id":435025,
            "title":"Character Choice II"
        },
        "13":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Orc",
                "Undead",
                "Goblin",
                "Dark Elf"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now choose to be an Orc, Undead, Goblin or Dark Elf. </span></div></span></div>",
            "created":1186894800,
            "id":434835,
            "title":"Orc, Undead, Goblin or Dark Elf"
        },
        "131":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Asktor, Borak or Doktok",
                "Be Fakana, Kortarak or Roshek"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>six</b> characters to choose from:<br>\r\n<br>\r\n<b>Azktor the Unholy</b> - he's dark and cruel. He's a soldier in the Orc army and has no mercy for his victims. He doesn't choose who lives and who dies, because in his book, everyone dies. <br>\r\n<br>\r\n<b>Borak the Brute</b> - he's huge compared to most Orcs, who are large in their own right. He uses his gerth and strength to get what he wants. He's a soldier in the Orc army, but also serves an Undead Master, Yasha Bloodaxe. <br>\r\n<br>\r\n<b>Doktok the Fat</b> - he's a merchant of sort. He does business with anyone who will pay well. Everything he sells is used for evil. Basically he's a man who knows how to get stuff. But he's a coward and not very trustworthy unless you can pay the right price. <br>\r\n<br>\r\n<b>Fakana Poisoner</b> - she's a sorceress of sorts. Like her name implies, her favorite method of warfare is the biological kind. She poisons her enemies and is often called on mercenary missions by people who need someone killed descretley. <br>\r\n<br>\r\n<b>Kortarak Orc King</b> - king of the Orcs, he is vicious and cruel. He works closely with Gnash the Dead, leader of the Undead. He has many dungeons he uses to \"interrogate\" prisoners. He's heartless in his scourge across the land.<br>\r\n<br>\r\n<b>Roshek the General</b> - a general in the Orc army, he's extremely skilled in fighting. He does what he's told and never questions it. Though there may be some scrap of pity in his heart when he's killing, he quiets those thoughts, because he was not made for pity.</span></div></div>",
            "created":1186894800,
            "id":435543,
            "title":"Character Choice"
        },
        "1311":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Asktor",
                "Borak or Doktok"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Asktor, Borak or Doktok...</span></div></span></div>",
            "created":1186894800,
            "id":435026,
            "title":"Character Choice II"
        },
        "13112":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Borak",
                "Doktok"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Borak or Doktok...</span></div></span></div>",
            "created":1186894800,
            "id":435027,
            "title":"Character Choice III"
        },
        "1312":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Fakana",
                "Kortarak or Roshek"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fakana, Kortarak or Roshek...</span></div></span></div>",
            "created":1186894800,
            "id":435028,
            "title":"Character Choice II"
        },
        "13122":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Kortarak",
                "Roshek"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kortarak or Roshek...</span></div></span></div>",
            "created":1186894800,
            "id":435029,
            "title":"Character Choice III"
        },
        "132":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Alexandra, Calla, Dactor or Ector",
                "Be Gnash, Igor, Yasha or Zodar"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>eight</b> characters to choose from:<br>\r\n<br>\r\n<b>Alexandra Lifestealer</b> - she was married to Erik the Bold before he killed her. She was turned Undead by Dactor Deathbringer, but she harbors no love for him. She hates him for turning her into a monster. She tries to act human, but the bloodlust gets to her every once in a while. <br>\r\n<br>\r\n<b>Calla the Dark Queen</b> - like Alexandra, she was also turned Undead by Dactor Deathbringer. However, she has a strong allegance with Dactor and loves him as much as their race can love a person. She's cruel and cold, which is nothing like how she was in life. Before her death, she was the lover of Menfir Oakleaf. Now, she feels only hatred towards the elf and would like to see his death. <br>\r\n<br>\r\n<b>Dactor Deathbringer</b> - perhaps the coldest of the Undead, and the most infamous. He kills whenever he can and there's not a person who doesn't fear him. He will turn anyone Undead, trying to expand their race. He kills, he rapes, he destroys, that's what he lives for. <br>\r\n<br>\r\n<b>Ector Nightstalker</b> - one of the longest surviving undead, he is a great warrior but a more powerful sorceror. He works alongside Gnash the Dead to conjure weapons and magic to use against the White Alliance. He is cold and cruel.<br>\r\n<br>\r\n<b>Gnash the Dead</b> - leader of the Undead. He harbors great hatred for the living and seeks to destroy them all. He has secret plans after the White Army has been destroyed to break out into war among themselves in the Dark Alliance. He wants Undead to rule the land and will stop at nothing to make sure it is done. <br>\r\n<br>\r\n<b>Igor the Liche</b> - like Ector Nightstalker, he is a very powerful sorceror. Unlike Ector, he doesn't use it in battle. He's become a recluse among his people and often times goes off on his own. He wishes he could die and every day searches for a battle that will end his unlife. <br>\r\n<br>\r\n<b>Yasha Bloodaxe</b> - the most dangerous of the Undead, even more so than Gnash or Dactor. When he was alive, Yasha was one of the most powerful warriors to ever live. After death, he only grew stronger. He is good at manipulating people to do his bidding. It is said that he has the favor of an exile god on his side and could possibly be the sole downfall of the White Army. Joshua the Martyr killed him when he was alive and to this day, Yasha wants to seek revenge on the human. <br>\r\n<br>\r\n<b>Zodar Foulface</b> - he is more of a pion than anything of great importance. He goes where he's told and does what he's suppose to do. He enjoys killing and torturing people. He has an attraction to Calla the Dark Queen. </span></div></div>",
            "created":1186894800,
            "id":435546,
            "title":"Character Choice"
        },
        "1321":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Alexandra or Calla",
                "Dactor or Ector"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexandra, Calla, Dactor or Ector...</span></div></span></div>",
            "created":1186894800,
            "id":435030,
            "title":"Character Choice II"
        },
        "13211":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Alexandra",
                "Calla"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexandra or Calla...</span></div></span></div>",
            "created":1186894800,
            "id":435031,
            "title":"Character Choice III"
        },
        "13212":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Dactor",
                "Ector"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dactor or Ector...</span></div></span></div>",
            "created":1186894800,
            "id":435032,
            "title":"Character Choice III"
        },
        "1322":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Gnash or Igor",
                "Yasha or Zodar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gnash, Igor, Yasha or Zodar...</span></div></span></div>",
            "created":1186894800,
            "id":435033,
            "title":"Character Choice II"
        },
        "13221":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Gnash",
                "Igor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gnash or Igor...</span></div></span></div>",
            "created":1186894800,
            "id":435034,
            "title":"Character Choice III"
        },
        "13222":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Yasha",
                "Zodar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yasha or Zodar...</span></div></span></div>",
            "created":1186894800,
            "id":435035,
            "title":"Character Choice III"
        },
        "133":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Gorthak, Hollusk or Jattah",
                "Be Makai, Sister or Toro"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>six</b> characters to choose from:<br>\r\n<br>\r\n<b>Gorthak the Black</b> - he is a soldier in the Goblin army. He strives to rise in the ranks so he can start making decisions on where the army goes. He holds a strong desire to kill every Dwarf he sees. <br>\r\n<br>\r\n<b>Hollusk the Goblin</b> - leader of the Goblins, he is seeking war of the Dwarves for stealing their home in the mountains. He only chose sides with the Orcs because he's a bit of a coward and the Orcs and Gnash the Dead pushed him into joining their alliance, though he doesn't regret it. <br>\r\n<br>\r\n<b>Jattah the Leper</b> - a sickly creature whose skin is nearly gone. His lower jaw fell off long ago, yet somehow he is still alive. He's more of a recluse among his people and preys on young adventurers that come near the mountains. He's sought after by the Dwarves as he's become a bit of a legend to them. <br>\r\n<br>\r\n<b>Makai the Preacher</b> - she's fat, loud and bosterous. She's called a preacher because she came up with the Goblin standards. She's not particularly cruel, but she does have a strong allegance with the Dark Alliance. She can't stand elves, but she doesn't outright seek to destroy them. She calls them \"dirty fairies.\"<br>\r\n<br>\r\n<b>Sister Tersia</b> - she is cruel and an incredible fighter, one of the best Goblin warriors there is. She's a blood drinker, which gives her more power than most Goblins. She has a sort of relationship with Toro the Wicked and they fight together and sleep together, but there's no love between them. <br>\r\n<br>\r\n<b>Toro the Wicked</b> - he's a powerful warrior and fights alongside Sister Tersia. He feels love for Sister, which is unusual for a Goblin. He has a strong hatred of humans and will kill them on sight. </span></div></div>",
            "created":1186894800,
            "id":435548,
            "title":"Character Choice"
        },
        "1331":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Gorthak",
                "Hollusk or Jattah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gorthak, Hollusk or Jattah...</span></div></span></div>",
            "created":1186894800,
            "id":435036,
            "title":"Character Choice II"
        },
        "13312":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Hollusk",
                "Jattah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hollusk or Jattah...</span></div></span></div>",
            "created":1186894800,
            "id":435038,
            "title":"Character Choice III"
        },
        "1332":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Makai",
                "Sister or Toro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Makai, Sister or Toro...</span></div></span></div>",
            "created":1186894800,
            "id":435039,
            "title":"Character Choice II"
        },
        "13322":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Sister",
                "Toro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sister or Toro...</span></div></span></div>",
            "created":1186894800,
            "id":435040,
            "title":"Character Choice III"
        },
        "134":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Be Acara, Ender or Lithania",
                "Be Shalaheed, Tanaris, Tirlas or Vandir"
            ],
            "content":"<div class=\"\"><div> <span>There are <b>seven</b> characters to choose from:<br>\r\n<br>\r\n<b>Acara the Spider</b> - along with her brother, Tanaris, she escaped the evil rule of the Dark Elf outpost and formed a rebel group. She doesn't believe in the war and despises the undead race. If she could choose her alliance, she would side with the White Army. Unfortunately, her race chooses her alliance for her.<br>\r\n<br>\r\n<b>Ender the Dark</b> - Leader of the dark army and father to Acara and Tanaris. He is cruel and evil and deceptive. He wants nothing more than to lead the Dark Alliance to victory and take over the land. He will do anything to kill those who oppose him. He's merciless. <br>\r\n<br>\r\n<b>Lithania Moonweed</b> - she is Ender's lover. She is a seductress and very beautiful, but will not hesitate to do what she has to to gain power. She has no remorse and is cold hearted.<br>\r\n<br>\r\n<b>Shalaheed the Necromancer</b> - he is a rat of a being. He's sly and quiet and lurks in the shadows and is counselor to Ender. His skill with dark magic is unsurpassable and he conjures new plagues and deadly spells every day.<br>\r\n<br>\r\n<b>Tanaris the Knowing</b> - Like his sister, Acara, he is good in nature. If he could choose his alliance, he would side with the White Army. He is leader of a rebel group planning their stealth attacks against leaders of the Dark Alliance.<br>\r\n<br>\r\n<b>Tirlas Nightguard</b> - he left with Tanaris and Acara to be in the rebel army. Though he could care less who he is alligned with, he does care dearly for his friend Tanaris and would do anything for him. He is large in stature and is quiet. He's deadly in combat, but gentle otherwise.<br>\r\n<br>\r\n<b>Vandir the Exile</b> - one of the most cruel Dark Elves alive. He was around when the Prince of the elven army died those many years ago and it has broken him, turning him evil. He's vicious in battle and has killed many. He cares for nothing and fights blindly. </span></div></div>",
            "created":1186894800,
            "id":434841,
            "title":"Character Choice"
        },
        "1341":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Acara",
                "Ender or Lithania"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Acara, Ender or Lithania...</span></div></span></div>",
            "created":1186894800,
            "id":435041,
            "title":"Character Choice II"
        },
        "13412":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Ender",
                "Lithania"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ender or Lithania...</span></div></span></div>",
            "created":1186894800,
            "id":435042,
            "title":"Character Choice III"
        },
        "1342":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Shalaheed or Tanaris",
                "Tirlas or Vandir"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shalaheed, Tanaris, Tirlas or Vandir...</span></div></span></div>",
            "created":1186894800,
            "id":435043,
            "title":"Character Choice II"
        },
        "13421":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Shalaheed",
                "Tanaris"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shalaheed or Tanaris...</span></div></span></div>",
            "created":1186894800,
            "id":435044,
            "title":"Character Choice III"
        },
        "13422":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Tirlas",
                "Vandir"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tirlas or Vandir...</span></div></span></div>",
            "created":1186894800,
            "id":435045,
            "title":"Character Choice III"
        }
    },
    "info":{
        "author_id":"wenston",
        "author_name":"Wenston",
        "brief_description":"The twelve races of the world fight for power, and survival.",
        "created":1186899000,
        "description":"<td align=\"left\" class=\"norm\">Basically, I used to play a game called Age of Wonders and the NPC's that showed up from time to time always intrigued me. They just came with a picture and a statistic, so they didn't have a story with them. I decided to turn all the pictures into characters and in doing so, I created a story that has been with me for years. It just never found a home.  <br>\r\n<br>\r\nSo those characters are going to find a home here. I know there are a lot of them, but I needed to put them somewhere. Eventually I hope for all of these characters to have their own storyline within this interactive, as they won't find one anywhere else. <br>\r\n<br>\r\nSo search around, find one you like, and feel free to add. <br>\r\n<br>\r\nThere are twelve races:<br>\r\n<br>\r\n<b>Elves</b> - <i><span class=\"cgreen\">allied with the White Army</span></i>- a noble creature. They live immortal lives, though most of the ancient elves were killed in the Great Wars. They are tall and fair with their distinct pointed ears. They fight with honor and find strength in their allies.<br>\r\n<br>\r\n<b>Dwarves</b> - <i><span class=\"cgreen\">allied with the White Army</span></i>- a stocky creature, they are short in posture, but not short in heart. The lives span hundreds of years, the oldest dwarf having live to the ripe age of 673. The prefer mountain habitats.<br>\r\n<br>\r\n<b>Halflings</b> - <i><span class=\"cgreen\">allied with the White Army</span></i>- a race born of man and elf, the halflings have the immortality of their elven heritage but lack the magic. They are in tune with the earth and are mostly farmers or ranchers. Hardly do they go into battle unless called upon.<br>\r\n<br>\r\n<b>Humans</b> - <i><span class=\"cyellow\">neutral in alliance</span></i>- a mortal race, easily corruptable but has also born some of the greatest heroes Isolace has ever known. Human alliances are not chosen by their race, but rather by their location.<br>\r\n<br>\r\n<b>Frostlings</b> - <i><span class=\"cyellow\">neutral in alliance</span></i> - technically, they are halflings. But they live in the Frozen Wastes of the north and have developed a taste for the cold and ice. Their skin is hard and they are a peaceful, magical creature by nature.<br>\r\n<br>\r\n<b>Lizardmen</b> - <i><span class=\"cyellow\">neutral in alliance</span></i> - they live in the swampy regions and beneath the oceans of Isolace. Like their name suggests, they are lizard-like in nature. They differ in size and color, but all are cold blooded, scaled and mischevious. <br>\r\n<br>\r\n<b>Azrac</b> - <i><span class=\"cyellow\">neutral in alliance</span></i> - they are a dessert people. They are mortal, like the humans, though they live for years longer. They pray to the Sun God and what little magic they possess they received from him. Their skin is tan and their ears pointed, though not as defined as the elves. They border on the side of evil and could ally themselves with the Dark Alliance at any time.<br>\r\n<br>\r\n<b>High Men</b> - <i><span class=\"cyellow\"> neutral in alliance</span></i> - they were human once but found divinity and were made immortals by the gods they prayed to. They are few in numbers and have only one known city in all of Isolace. They are fair skinned and give a faint glow in the moonlight. They are righteous and good, but do not condone war, thus their lack of alliance to a side.<br>\r\n<br>\r\n<b>Orcs</b> - <i><span class=\"cred\">allied with the Dark Alliance</span></i> - created by the corrupt High Men years ago, the orc race has grown and conquered. They are a strong, brutal race, hardly intelligent on their own, but when allied with other races of the Dark Alliance, they are deadly. They are usually green or brown skinned.<br>\r\n<br>\r\n<b>Undead</b> - <i><span class=\"cred\">allied with the Dark Alliance</span></i> - like their Orc brethern, the undead were created by the corrupt High Men near the beginning of time. They were made from the corpses of humans and are given an immortal afterlife. They don't sleep, don't eat and don't age, except to rot. They are evil by nature and are said to be the bringers of every war fought in Isolace.<br>\r\n<br>\r\n<b>Goblins</b> - <i><span class=\"cred\">allied with the Dark Alliance</span></i> - they were once dwarves. A clan of dwarves long ago was cursed by the Azracs and turned into the foul, disgusting creatures they are. They are short and vary in body type, but all have a brown skin and grotesque look about them.<br>\r\n<br>\r\n<b>Dark Elf</b> - <i><span class=\"cred\">allied with the Dark Alliance</span></i> - they were elves once. But during the Great Wars of the past, a Prince Elf was slain in battle and it separated the factions of the great elven army. Going their separate ways, the Dark Elves chose to escape to the dark regions of the world. Their skin darkened to a pale greenish blue and their magics turned to a more evil pursuasion.<br>\r\n<br>\r\n<br>\r\n-----<br>\r\n<br>\r\nThere are so many characters in this interactive that it's impossible to list them all here. Explore, add, have fun. Do what you want with them, but keep the rating at 18+. Violence and romance is acceptable at a tolerable level. Rating level is subject to change. </td>",
        "id":1304219,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1437244680,
        "modified":1437244680,
        "pretty_title":"Endsong"
    }
}