{
    "chapters":{
        "1":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "Ranma-chan",
                "Akane",
                "Ukyo",
                "Shampoo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose a girl to start.</span></div></span></div>",
            "created":1371099600,
            "id":1610231,
            "title":"Choose a girl to start."
        },
        "11":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "Animal TF",
                "Inanimate TF",
                "Become a part of other girl",
                "Mental change",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to Ranma?</span></div></span></div>",
            "created":1371186000,
            "id":1610734,
            "title":"Ranma-chan"
        },
        "111":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Ranma fell in a curse pond ",
                "Mousse plan on turn ranma into a animal",
                "Ranma got bite by a animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how did ranma turn into a animal</span></div></span></div>",
            "created":1391749200,
            "id":1741268,
            "title":"Animal TF"
        },
        "1111":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Adult kangaroo or a baby joey",
                "Adult tiger ",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma running away from akane but then Ranma trip over a rock and fell into the curse pond and then ranma complete transform into a?</span></div></span></div>",
            "created":1393304400,
            "id":1751262,
            "title":"Ranma fell in a curse pond "
        },
        "11111":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Adult kangaroo ",
                "A baby joey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So which one did ranma turn into?</span></div></span></div>",
            "created":1393563600,
            "id":1752993,
            "title":"Adult kangaroo or a baby joey"
        },
        "111112":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "The female kangaroo pick up ranma and place him inside her pouch",
                "The female kangaroo leaving ranma and hopping away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma find himself he is now a baby joey and he different place but then wild female kangaroo approaching ranma.Ranma try run but he not use to have a kangaroo body.The female kangaroo stare a ranma for few minute and then?</span></div></span></div>",
            "created":1394082000,
            "id":1756400,
            "title":"A baby joey"
        },
        "1111121":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Yes ",
                "No "
            ],
            "content":"<div class=\"\"><div> <span>The female kangaroo pick up ranma and put him inside her pouch and with that the female kangaroo begin travel back to other kangaroo but meanwhile ranma feel the female kangaroo is move around outside but as she did ranma struggle tried to get out of her pouch but as ranma struggle tried to get out the female kangaroo can feel ranma struggle inside her pouch. ( Did the female kangaroo take ranma out of her pouch? </span></div></div>",
            "created":1395464400,
            "id":1765087,
            "title":"The female kangaroo pick up ranma and place him..."
        },
        "11111212":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "\"Speak to him and said\"",
                "\"Stop move and pull Ranma out from it Pouch\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Female Kangaroo ignore Ranma constant squirm inside it pouch as Female Kangaroo continued on it way.. Ranma keep struggle to escape from the inside of The Female Kangaroo Pouch and he said \"LET ME OUT\" but then The Female Kangaroo?..  </span></div></span></div>",
            "created":1412312400,
            "id":1865927,
            "title":"No "
        },
        "11113":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Cat or a Dog",
                "Other Animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well how about Ranma turn into a?</span></div></span></div>",
            "created":1396674000,
            "id":1773809,
            "title":"Something else"
        },
        "111131":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Cat ",
                "Dog "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay so which one did Ranma turn into?</span></div></span></div>",
            "created":1403240400,
            "id":1814991,
            "title":"Cat or a Dog"
        },
        "1111311":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Accept, find a place to sleep together and merge with the nekoken (successfully)",
                "Something interiors before she can answer with acceptance"
            ],
            "content":"<div class=\"\"><div> <span>Ranma pulls himself out of the pond, and looks down at himself,and sees that he was a light red female cat with darker red paws, basically looking like a red colored version of shampoo in neko form.  This had the side effect of forcing him into the nekoken, and although he did not know it his male form is gone, replaced with the female cat which has become his new cursed form, while his girl form is her new hot water form.  In the nekoken Ranma neko went looking for a nice lap, after seeing no enemies around.  However while looking she caught the scent of fish and went to get some.  Once there she saw that Shampoo in neko form was already there, and since Ranma neko was not scared of cats, including Shampoo neko, and Shampoo neko was not attacking her, Ranma neko walked up to her.<br>\r\n\"Can I please have some fish?\" She asked in cat speak, not feeling like fighting, especially not to someone who in neko mode she sees as a potential mate, though that is a new development from Shampoo not doing anything bad since the incident with the failed wedding six months ago. Unlike Akane, who had gotten even worse, to the point that Ranma neko no longer trusts her. And especially with the curse matching forms, meaning the cat spirit of the nekoken is no longer angry and wanting to fight everyone due to being a cat in a human body that does not fit well.  Making the cat spirit irritated.<br>\r\n\"Sure.\"   She said, also in cat speak after thinking abit. Luckily cat speak is only one language so no broken Japanese for Shampoo. \"I haven't seen you before what's your name?\"<br>\r\n\"You have seen me before Shampoo neko.\" Ranma neko said \"just not like this.  I am Ranma neko, Ranma in the nekoken.  There was a cursed pond Ranma Chan fell in that turned her into a cat and activated me.  Though i am much more docile, since the power and feared abilities are only uncontrollable when the target is human. Now that Ranma has a cat body when she and any cat I go to sleep with are asleep they will fuse with the nekoken,  permanently no after what form, which will help with Ranma's personality to make it a merger between mine and hers, especially since the pond used me to replace his cursed form, and his girl form to replace his birth form permanently.  Would you like to merge with me as well?  Ranma will need some help adjusting.\"<br>\r\nShampoo thinks, and due to liking Ranma in any form including his new cat form, and having changed since she arrived in Nerima decided to...</span></div></div>",
            "created":1477026000,
            "id":2226436,
            "title":"Cat "
        },
        "111132":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Namesake i.e a horse",
                "Another animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She turned into her </span></div></span></div>",
            "created":1475557200,
            "id":2218959,
            "title":"Other Animal"
        },
        "1112":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Cat",
                "Dog",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Mousse have a plan to make sure ranma never get neard shampoo a again,mousse have curse mountain spring water to turn ranma into a animal,so mousse found ranma walk in the stress and quickly stream the mountain spring water a ranma.Ranma soon become a female?  </span></div></div>",
            "created":1391922000,
            "id":1742811,
            "title":"Mousse plan on turn ranma into a animal"
        },
        "11121":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Sell you to the pet shop",
                "Breeding you with other cat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma soon become a female cat.Mousse quickly grab ranma and put him into a carrier cage and then mousse say now ranma i going to? </span></div></span></div>",
            "created":1392267600,
            "id":1745237,
            "title":"Cat-paw-carrier cage"
        },
        "111211":{
            "author_id":"animerules",
            "author_name":"Triple Anime",
            "choices":[
                "They took her home & use $ for something else  ",
                "They got her a boyfriend"
            ],
            "content":"<div class=\"\"><div> <span>\"Ranma we are thousands of miles away from Nermia in fact were at the other end of Japan and to make sure you don't somehow get back, I am selling you to a pet\"<br>\r\n<br>\r\n\"But mommy why can't I have a kitty\"<br>\r\n<br>\r\n\"Because we don't have the money right now and won't for a while\"<br>\r\n<br>\r\n\"Excuse me, I couldn't help over hearing, I got a cat that I am wanting to get rid of.  If your mother says it's okay and you can promise me that you will take very good care of her you can have her<br>\r\n<br>\r\nRanma couldn't believe what was happening the mother actually said yes and the little girl promised Mousse so he handed her over to her then started to walk away when he turned back <br>\r\n<br>\r\n\"Oh I just remembered, here's a few supplies for her and in fact you know what I'll give you this as well\" he handed the mother some money \"use it for whatever you want or to get her a boyfriend\"<br>\r\n<br>\r\n\"That's very generous of you\"<br>\r\n<br>\r\n\"No problem enjoy your new pet\" Mousse walked away</span></div></div>",
            "created":1476853200,
            "id":2225647,
            "title":"Sell you to the pet shop"
        },
        "111212":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                " Cheeaths ",
                "Next "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma was groggy and just before she pasted out she heard Mousse say that she should rest because soon she was going to be breeding with the other....</span></div></span></div>",
            "created":1475557200,
            "id":2218953,
            "title":"What type of cat"
        },
        "1112122":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Yes,  Ranma is now permanently breeding partner with fat male cat",
                "No, he decided made Ranma breeding with other male cat which must big then her "
            ],
            "content":"<div class=\"\"><div> <span>After 2 hour Ranma awake to find she was in room which smell right bad! \"Oh good you're finally awake Ranma, I won't want you miss out on met you're breed partner.\" Mousse said with evil smirk as he reveal huge and large fat house cat which was full breed and also it was male. \"Aah, Mousse you can't be serious right?\" Ranma asked in nervous tone in her voice. \"Oh but I am quite serious Ranma, I am tire you hang out my shampoo which is why I going made you pay by made you into breeding feline but course since you're female cat which mean you get to experience male feline mount on you along with be pregnant as a female cat!\" Mousse answered with huge grin on his face and immediately leave the room along with close the door behind him but no soon he did, The fat male cat made it way toward Ranma desire one thing!<br>\r\n<br>\r\n\"Ahh get away from me you fat cat!\" Ranma scream as she try escape the room but she couldn't find anyway of escape but then The fat male cat bite her neck to show his dominance over her and slowly begin mount her like no tomorrow! (Did Mousse like  owner of the fat male cat keep Ranma which mean Ranma and fat male cat will be permanently breed partners?) </span></div></div>",
            "created":1501822800,
            "id":2364697,
            "title":"Next "
        },
        "11121221":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Akane  \"Ranma?\"",
                "Shampoo \"Airen?\""
            ],
            "content":"<div class=\"\"><div> <span>Ranma moved out of the way and swung her claws at the fat cat but because of the nekoken instead of scratching it she killed it, knowing she had access to her chi she powered up then used her claws to perform a Bakusai tenketsu on the wall which created a hole and she ran out <br>\r\n<br>\r\nWhen Mousse and the owner of the fat cat came back he revealed that he was a police officer and would have to pay 867,380¥ ($10,000.00) when Mousse said he couldn't he was arrested <br>\r\n<br>\r\nMeanwhile as Neko-Ranma ran she ran into a girl and was hit with hot water her fur turned black which _____ saw she picked Neko-Ranma up and said _______<br>\r\n<br>\r\n<br>\r\n(&amp; a reminder to the next writer that the previous writer made it so Neko-Ranma could still talk so just a suggestion maybe cross with Sailor Moon or Gold Diggers(or other show with werecreatures))</span></div></div>",
            "created":1502773200,
            "id":2369421,
            "title":"Actually"
        },
        "11121222":{
            "author_id":"sailorotaku",
            "author_name":"SailorOtaku",
            "choices":[
                "Ranma was bowled over by Usagi",
                "They attacked Mousse"
            ],
            "content":"<div class=\"\"><div> <span>The fat cat ended up beaten to a pulp and since Ranma looked worn out both the fat cat owner &amp; Mousse just thought they wore each other out <br>\r\n<br>\r\nWhen Mousse came back Ranma spoke \"You bastered my wife is gonna be looking for me\" he just laughed \"Nice try Saotome\" he left then a few days later took her to the vet and after finding out she wasn't pregnant he brought in the next cat  then left them alone <br>\r\n<br>\r\n\"Artemis\" <br>\r\n<br>\r\n\"Hi Ranma, you look good in female form\" she bopped him <br>\r\n<br>\r\n\"Jerk, what if Luna heard that?\"<br>\r\n<br>\r\n\"She would agree so would your wife Usagi\" although it wasn't noticeable she was blushing <br>\r\n<br>\r\n\"Can you teach me how you and Luna change into human form\" <br>\r\n<br>\r\nHe shows her and she repeats what he did becoming a human again \"we may have to fight\" she said as they went to the door and when they opened it </span></div></div>",
            "created":1502773200,
            "id":2369426,
            "title":"No, he decided made Ranma breeding with other m..."
        },
        "11123":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Farm",
                "Zoo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma turned and saw Mousse who took off leading her to a </span></div></span></div>",
            "created":1436418000,
            "id":2005524,
            "title":"Something else"
        },
        "111232":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Panda",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which zoo animal</span></div></span></div>",
            "created":1494046800,
            "id":2315509,
            "title":"Zoo"
        },
        "1112321":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Mated ",
                "Back to China & captured by the Musk"
            ],
            "content":"<div class=\"\"><div> <span>Ranma entered the zoo and a short while after felt something hit her releasing cold water not giving a second thought she ignored it and kept looking for Mousse until she heard <br>\r\n<br>\r\n\"AAHHHH THE PANDA HAS ESCAPED\"<br>\r\n<br>\r\nRanma started looking for the escapee when she felt chains wrap around her then she heard \"I got it shoot it\" before everything went black,  when she came to she saw she was in a cage and Mousse was standing on the other side <br>\r\n<br>\r\n\"Enjoy your new home Saotome since there's no hot water your gonna be here a while\" he started to walk off \"Oh yeah that balloon I hit you with also had passion powder mixed in, I wonder how long you can keep from becoming a mother\"</span></div></div>",
            "created":1494046800,
            "id":2315546,
            "title":"Panda"
        },
        "11123211":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Big Male Panda turn out to be her Father ",
                "Ranma felt her body have mind of it own, as it allow male panda to mate with her"
            ],
            "content":"<div class=\"\"><div> <span>(After few days) Ranma avoided few the male pandas but because of passion powder mix with cold water, few male Pandas seem really attractive to her but one day the owner of the zoo noticed few male pandas seem really attractive toward one certain female panda and decided let one of male pandas mated with female panda! <br>\r\n<br>\r\n\"Attention everyone it seem few of are male pandas really seem attractive to one certain female panda which is the one that almost escape, so I decided we going let one of male pandas mated with her.\" The owner said with smile which made all zookeepers smile bright heard that wonderful news. <br>\r\n<br>\r\n(After few hour) <br>\r\nRanma slowly wake in different place as she heard few peoples said how excited it was to help endangered species like pandas repopulate!\" As soon Ranma heard that, she realized that she's is going repopulate by mated with one of male pandas in zoo, but then suddenly Ranma felt something touch her backside, as she turn around to see it was the biggest male panda in the zoo! <br>\r\n<br>\r\nThe big male panda take great interest in mated with Ranma, as it slowly approaches her! Ranma didn't want mated but then suddenly </span></div></div>",
            "created":1502859600,
            "id":2370104,
            "title":"Mated "
        },
        "111232112":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Yes",
                "No, she remain panda forever and remain Itachi mate for rest of her life"
            ],
            "content":"<div class=\"\"><div> <span>Ranma tried get away from big male panda, but then panda immediately got on top of her backside, and started thrust back and forth  his member into her vagina! “AHHHH GET THE MALE PANDA OFF ME, I NOT WANT TO MATE WITH HIM!” Ranma scream but sadly none could understand her!<br>\r\n<br>\r\n“Oh my itachi is mate with female panda already, this is wonderful so for now on Itachi and Female panda will be breed with each for now on, and also female panda will be name Rin.” The owner said while workers smile and clap because they Successfully got two panda to mate.<br>\r\n<br>\r\n(After few weeks)<br>\r\nRanma was now pregnant with big male panda Itachi baby, and made it worse he followed her everywhere and show her Affection by lick her and rub his body against her. “Rin and Itachi, sure love each.” Woman zookeeper said with smile on her face. “Yup, and I know they going be mate for life.” said the owner of the zoo. “NO I NOT REMAIN MALE PANDA MATE FOR REST OF MY LIFE!” Ranma scream but sadly none understood her. <br>\r\n<br>\r\n(Did Ranma ever get Rescued?)</span></div></div>",
            "created":1579198980,
            "id":2774519,
            "title":"Ranma felt her body have mind of it own, as it ..."
        },
        "11123212":{
            "author_id":"mary5000",
            "author_name":"Mary5000",
            "choices":[
                "I can help with that",
                "I want no part of it "
            ],
            "content":"<div class=\"\"><div> <span>In the morning the zoo keepers find the male pandas cowaring from the female so they send her back to China where guys working at the dock take her crate to the Musk kingdom where once the crate is open they find it empty when they move away from the opening she bulldozes out of it to try and find a bathroom <br>\r\n<br>\r\nCausing her to be chased but she finds not only a bathroom but Herb in the tub who was surprised to see a Panda break down the door even more when it jumps in and turns first into a familiar redhead then a familiar black haired man<br>\r\n<br>\r\n\"SAOTOME\"<br>\r\n<br>\r\n\"Prince Herb, forgive my intrusion\"<br>\r\n<br>\r\n\"Since you are speaking like this very well but you must tell me what happened?\"<br>\r\n<br>\r\n\"Duck boy used the instant version of Jusenkyo and turned me into a female panda, got me locked in a zoo and doused me with their passion potion\"  Herb and the guards as well as Lime &amp; Mint turned green \"I attacked them so the guards sent me back to China where I was diverted to here.\" he looked Herb in the eyes \"Those amazons have been a pain in my ass for far to long I want revenge\"<br>\r\n </span></div></div>",
            "created":1499922000,
            "id":2352397,
            "title":"Back to China & captured by the Musk"
        },
        "112":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "One of The Tendo's Clothes",
                "Shampoo's bike ",
                "Used different spell or choosed something else to position"
            ],
            "content":"<div class=\"\"><div> <span>Ranma was getting sick &amp; tired of all the attacks <br>\r\n//<br>\r\nGenma - Morning Battle<br>\r\nAkane/Shampoo - Either hit by Akane for some reason or get a bike dropped on him by Shampoo<br>\r\nKuno - Fight to get into school<br>\r\nMiss Hinako - Drain energy <br>\r\nRyoga - attacks at lunch<br>\r\nHapposai - during a raid on locker room drops his loot on Ranma &amp; he gets attacked by the girls<br>\r\nKuno - Fight to leave school<br>\r\nAkane - on way home uses mallet for some reason<br>\r\n<br>\r\nThis doesn't include gang ups, random challengers, people out for revenge<br>\r\n//<br>\r\nHe needed some peace &amp; quiet then one day he found a book &amp; not just any book a magic book that bonded to him after he touched it, normally he would have ignored it given his luck with magic but he was getting desperate that he decided to see if it could help &amp; it did<br>\r\n<br>\r\nOne of the spells was how to posses objects &amp; clothes so he decided to try it </span></div></div>",
            "created":1436331600,
            "id":2004922,
            "title":"Ranma gains magic"
        },
        "1121":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Kasumi's",
                "Nabiki's",
                "Akane's"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Tendo's outfit does he posses </span></div></span></div>",
            "created":1475557200,
            "id":2218958,
            "title":"Pick a Tendo"
        },
        "11213":{
            "author_id":"animecsi",
            "author_name":"Archie Comics Lover",
            "choices":[
                "Everyday outfit",
                "Other outfit"
            ],
            "content":"<div class=\"\"><div> <span>Any of her Dresses, blouse/skirt combos, shirt/short combos, blouse/sweater/skirt combos, shirt/pants combos etc<br>\r\n<br>\r\n<span class=\"clblue\">Spring/Summer School Uniform</span> = blouse &amp; jumper <a rel=\"nofollow\" href=\"http://images6.fanpop.com/image/photos/38500000/Akane-with-her-school-uniform-the-girls-of-ranma-1-2-38547725-343-500.jpg\" target=\"_blank\">http://images6.fanpop.com/image/photos/3...</a><br>\r\n<br>\r\n<span class=\"clblue\">Fall/Winter School Uniform</span> = blouse, jumper &amp; jacket <a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/c1/0e/1a/c10e1a35e8cef78ff24c6744f685dcf1.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/ori...</a><br>\r\n<br>\r\nGym uniform = <a rel=\"nofollow\" href=\"http://vignette1.wikia.nocookie.net/ranma/images/0/01/Akane_Tendo_Furinkan.jpg/revision/latest?cb=20151114204732\" target=\"_blank\">http://vignette1.wikia.nocookie.net/ranm...</a><br>\r\n<br>\r\n<span class=\"cbyellow\">Gi</span> = top &amp; bottom <a rel=\"nofollow\" href=\"http://www.oocities.com/Tokyo/Towers/3136/akane.gif\" target=\"_blank\">http://www.oocities.com/Tokyo/Towers/313...</a><br>\r\n<br>\r\nBathing(Swim) suit<br>\r\n<br>\r\nKimono = <a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/6a/85/79/6a8579597650cd8efa378945569aed08.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/ori...</a><br>\r\n<br>\r\nPyjamas = <a rel=\"nofollow\" href=\"http://www.geocities.ws/splixx_99/ran7.jpg\" target=\"_blank\">http://www.geocities.ws/splixx_99/ran7.j...</a><br>\r\n<br>\r\n<span class=\"cyellow\">Gymnastics Leotard</span>= <a rel=\"nofollow\" href=\"http://www.geocities.ws/prince_charms/season1/akanetrain.jpg\" target=\"_blank\">http://www.geocities.ws/prince_charms/se...</a><br>\r\n<br>\r\n</span></div></div>",
            "created":1490331600,
            "id":2294162,
            "title":"Which outfit"
        },
        "112132":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "School uniform",
                "School winter uniform ",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma decided on the </span></div></span></div>",
            "created":1519707600,
            "id":2458239,
            "title":"Other outfit"
        },
        "1121321":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Her gi",
                "Her pjs",
                "Swimsuit "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Given that there’s a school uniform link already, let’s make this </span></div></span></div>",
            "created":1542130320,
            "id":2577211,
            "title":"School uniform"
        },
        "1121322":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Having breakfast ",
                "Going to school ",
                "Somewhere else "
            ],
            "content":"<div class=\"\"><div> <span>Ranma went into the bathroom and was looking in a mirror and he started thinking about the winter school uniform which caused  a sensation went through his body then his head and legs turned blue while his torso turned white<br>\r\n<br>\r\nHis ears grew out and became sleeves as his face disappeared <br>\r\nHis torso became flat<br>\r\nHis legs merged together<br>\r\n<br>\r\nThen he dropped half on to the clean hamper  just before Akane walked in, she saw the uniform and tossed her clean socks, panties &amp; bra on top while putting her Pajamas and dirty underwear in the dirty clean clothes before going for a shower<br>\r\n<br>\r\nWhen she was done she dried then got dressed putting Ranma on before </span></div></div>",
            "created":1519707600,
            "id":2458252,
            "title":"School winter uniform "
        },
        "1121323":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Akane put it in her bag & headed to school",
                "Akane gave it to one of her friends ",
                "Akane decided to give it to Good Will"
            ],
            "content":"<div class=\"\"><div> <span>Ranma found her gymnastics outfit and while thinking that she hasn’t used it since the competition and wanting some peace &amp; quiet decided to posse it <br>\r\n<br>\r\nSo she put her hand on it and consintrated her legs shrunk into her body as did her left arm and head which then turned yellow and became translucent then moved into the leotard as her other arm disappeared <br>\r\n<br>\r\nFor the next few days Ranma just hang in the closet sure it wasn’t quiet as she would hear Kasumi and her Mother cleaning, the Father’s ploting, Akane talking to P-Chan or her friends but no one bugging her, no one attacking her.  <br>\r\n<br>\r\nAfter a week she decided to get down but before she could </span></div></div>",
            "created":1532505180,
            "id":2524412,
            "title":"Something else"
        },
        "1123":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Gained Shapeshifting powers",
                "The ability to swap with stuff as well as to swap other people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma cased a different spell on herself &amp; </span></div></span></div>",
            "created":1475989200,
            "id":2220919,
            "title":"Used different spell"
        },
        "11231":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Instantly",
                "he has to wait a bit"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets see. With this Spell I get the Ability to become anything I want. Sounds interesting.\" said Ranma after he has read the Spell and its effect. A smile appeared on his Face, after all the Battles he was very tired and needed some rest. So he began to say the words and for an short Moment he felt an tingling on his Body. As it faded, he looked at himself but he didn't changed. \"Hmmm strange. I thought more would happen. Maybe...\" said ranma as he scratched his head and thought about Akanes panties. He then felt his Arms became too light and as he looked at them, they became flat and an pink Color.<br>\r\n<br>\r\n\"Oh damn it!\" yelled Ranma as it spreaded from his arms to his Body, his Arms merged together. He tried to separate them but he didn't felt them anymore. \"Nonononono! Not them!\" Ranma yelled as the spreading got his Head. Slowly his Eyes, Mouth, Nose and ears shrunk into his Head and it became the same Pink color. The rest of his Body became flat and Pink aswell and merged together, forming an Pair of Panties.<br>\r\n<br>\r\nAs soon as the Tranformation was complete, Ranma was no more and there were now an Pair of pink Panties on the ground. \"Damn it, I became Akanes Panties. But now at least I know I can Shapeshift. Lets hope i can return to my normal Body instant.\" thought Ranma and began to think about his Body.<br>\r\n<br>\r\nDoes he transform back instantly or not?</span></div></div>",
            "created":1479272400,
            "id":2237833,
            "title":"Become an Shapeshifter"
        },
        "112311":{
            "author_id":"sailorotaku",
            "author_name":"SailorOtaku",
            "choices":[
                "P-chan",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He changed back but decided to try another form which was</span></div></span></div>",
            "created":1491109200,
            "id":2298660,
            "title":"Instantly"
        },
        "1123112":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "What",
                "Who"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it a...</span></div></span></div>",
            "created":1526619600,
            "id":2494744,
            "title":"Something else"
        },
        "11231121":{
            "author_id":"animecsi",
            "author_name":"Archie Comics Lover",
            "choices":[
                "One of the girls dildo",
                "An old doll",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of item</span></div></span></div>",
            "created":1594888080,
            "id":2869533,
            "title":"What"
        },
        "11231122":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Wrecking Crew/Family Member",
                "Someone from Nermia",
                "Someone from another show"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it one of the</span></div></span></div>",
            "created":1526619600,
            "id":2494746,
            "title":"Who"
        },
        "112311222":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Tsubasa",
                "Azusa",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it...</span></div></span></div>",
            "created":1526626620,
            "id":2494751,
            "title":"Someone from Nermia 2"
        },
        "1123112222":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "She was seen ",
                "She wasn’t seen"
            ],
            "content":"<div class=\"\"><div> <span>Ranma started to think about P-Chan but then his mind reminded him about Azusa and how she also loves the pig but then this lead to her thinking about her partner &amp; how she wanted revenge for him stealing her first kiss <br>\r\n<br>\r\nThen it started her clothes melded together then they turned pink and a dull yellow, her sleeves ballooned up and frills formed justthe bottom.  Next a white frilly collar appeared followed by a red bow and two rose blooms which appeared near the bottom <br>\r\n<br>\r\nRanma tried to stop it but the thoughts of revenge kept going which caused the changes to keep going as now she had lacey dull yellow socks on and her flats became green Mary-Janes with rose blooms<br>\r\n<br>\r\nHer hair became brown and grew as her face changed as well as not yet known to her her voice and mind did then a pink bow appeared and she now looked like <br>\r\n<a rel=\"nofollow\" href=\"http://www.oocities.org/colosseum/Arena/4990/azusa.jpg\" target=\"_blank\">http://www.oocities.org/colosseum/Arena/...</a> <br>\r\n<br>\r\n(A/N: from here on any time Ranma becomes someone she knows who she really is but is unable to say her real name until she changes back)<br>\r\n<br>\r\n“Wow Azusa looks just like Azusa” she paused “why Azusa say” her eyes widened “Azusa is Azusa not Azusa” in her mind she said ‘I’m not Azusa I’m Ranma’ before she could do anything more she heard <br>\r\nthe front door <br>\r\n<br>\r\n“Not good if Azusa caught if Azusa want to keep secret,  Azusa better leave”<br>\r\n<br>\r\nWith that she left the bathroom and headed out of the house</span></div></div>",
            "created":1526628720,
            "id":2494760,
            "title":"Azusa"
        },
        "11231122222":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Mikado ",
                "The Police & her parents ",
                "The Real Azusa",
                "No one"
            ],
            "content":"<div class=\"\"><div> <span>She stopped running when she was several blocks away, Ranma had thought only her body would change so she was surprised by the fact her clothes and mind had changed as well<br>\r\n<br>\r\nSo she decided to change back when she heard some call her name  “Azusa” she turned to see </span></div></div>",
            "created":1541970720,
            "id":2576263,
            "title":"She wasn’t seen"
        },
        "112311222222":{
            "author_id":"wwemania81",
            "author_name":"WWEis#1",
            "choices":[
                "RanmaAzuza escapes &  transforms",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>“Azusa there you are”<br>\r\n<br>\r\nRanma-Azusa turned to see a few police officers and some adults <br>\r\n<br>\r\n“I’m sorry honey but you were warned what would happen if you didn’t stop stealing stuff”<br>\r\n<br>\r\nBefore Ranma-Azusa could tell them she wasn’t Azusa she was tasered then put in a straightjacket before being put into the squad car</span></div></div>",
            "created":1602064200,
            "id":2916558,
            "title":"The Police & her parents "
        },
        "112312":{
            "author_id":"sailorotaku",
            "author_name":"SailorOtaku",
            "choices":[
                "Has to regain the power he used ",
                "Kasumi found him & put him away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does he has to wait a bit</span></div></span></div>",
            "created":1491973200,
            "id":2303770,
            "title":"Why"
        },
        "1123121":{
            "author_id":"sailorotaku",
            "author_name":"SailorOtaku",
            "choices":[
                "One of the Tendo girls",
                "Happosai"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Much like when he started using his chi(ki) he needs to build his reserves so he's stuck for awhile however he's found by</span></div></span></div>",
            "created":1491973200,
            "id":2303772,
            "title":"Has to regain the power he used "
        },
        "11231211":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Akane",
                "Nabiki"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is it </span></div></span></div>",
            "created":1505019600,
            "id":2383727,
            "title":"One of the Tendo girls"
        },
        "1123122":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Fortunately Happi grabs Akane in the living room",
                "Unfortunately A few more weeks pass before Happi grabs Akane"
            ],
            "content":"<div class=\"\"><div> <span>As Kasumi went to get the soap she saw the pair of panties &amp; thinking she dropped them tossed Ranma into the washing machine The about 20 minutes later she tossed him along with the other into the dryer and after roughly another 20 minutes she took them out and ironed them the folded him and put him into Akane's drawer under several other pairs of panties <br>\r\n<br>\r\nDays passed the finally Akane pulled him out and took him into the change room and set him with the rest of her clothes on the shelf then went into the furo as she was washing Ranma tried to change but couldn't he didn't have any chi left which meant that he was stuck for the rest of his life as Akane 's panties  <br>\r\n<br>\r\nThe he realized there was a chance and that is to absorb chi from Akane so he decided to wait until Happosai grabbed Akane so he could absorb some chi without her suspecting and so he waited and </span></div></div>",
            "created":1505019600,
            "id":2383738,
            "title":"Kasumi found him & put him away"
        },
        "11232":{
            "author_id":"acriolu",
            "author_name":"ACRiolu",
            "choices":[
                "Swap",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The ability to swap with stuff as well as to swap with other people<br>\r\nOr<br>\r\nSomething elase</span></div></span></div>",
            "created":1532529660,
            "id":2524514,
            "title":"The ability to swap with stuff as well as to sw..."
        },
        "112322":{
            "author_id":"acriolu",
            "author_name":"ACRiolu",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something involving shampoo</span></div></span></div>",
            "created":1532529720,
            "id":2524516,
            "title":"Something else"
        },
        "113":{
            "author_id":"mary5000",
            "author_name":"Mary5000",
            "choices":[
                "Breast",
                "Lips",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which part of a girl’s body?</span></div></span></div>",
            "created":1573116000,
            "id":2743336,
            "title":"Become a part of other girl"
        },
        "1131":{
            "author_id":"mary5000",
            "author_name":"Mary5000",
            "choices":[
                "One of the fiancée’s",
                "Kasumi or Nabiki",
                "One of the other girl’s in the series"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok now which girl</span></div></span></div>",
            "created":1573116180,
            "id":2743343,
            "title":"Breast"
        },
        "11311":{
            "author_id":"mary5000",
            "author_name":"Mary5000",
            "choices":[
                "Akane ",
                "Ukyo",
                "Shampoo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl is it </span></div></span></div>",
            "created":1573116420,
            "id":2743347,
            "title":"One of the fiancée’s"
        },
        "11313":{
            "author_id":"mary5000",
            "author_name":"Mary5000",
            "choices":[
                "Kodachi",
                "Akari or Azuna ",
                "Sayuri or Yuka"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl is it </span></div></span></div>",
            "created":1573116360,
            "id":2743346,
            "title":"One of the other girl’s in the series"
        },
        "114":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "personality of a different girl",
                "ranma chan has a new mental mind",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Okay, so here are the choices:<br>\r\n<br>\r\n1) Ranma chan gets one of the girls' personality. For example, she becomes like nabiki and become a fiancer in terms of collecting money.<br>\r\n<br>\r\n2) Ranma chan would get a new personality. For example she becomes a tomboy or become a schoolgirl that isn't embarrassed to show her body.</span></div></div>",
            "created":1371186000,
            "id":1610814,
            "title":"Mental change"
        },
        "1141":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Cologne doesn't see Shampoo and Ranma share a second bowl....",
                "Ranma gets caught in a shower as he walks home.",
                "Akane arrives at the Cat Café... and doesn't like what she sees."
            ],
            "content":"<div class=\"\"><div> <span>The Old Ghoul watched from behind the counter as Ranma downed the last of his noodles. She was always glad for the time that Ranma spent in the Cat Café. Especially as Ranma was enjoying some specially prepared sauce.<br>\r\n<br>\r\nThe sauce was a secret Amazon recipe, made to help the lesser warrior adjust. To help a woman fit into wifely role. It was seen as a punishment and a disgrace. But a necessary part for some to play to ensure the survival of the village.<br>\r\n<br>\r\nIt worked rather simply, making a woman's body more sensitive... not so simple as 'The Cat's Tongue', this one was crafted to enhance her sexual appetites too. To make a woman crave the touch of a man.<br>\r\n<br>\r\nAnd she had just watched Ranma finish off a bowl with sauce and gusto. The old ghoul went back into the kitchen, chuckling to herself as she imagined the next time her daughter's fiancée would feel a shirt brush over her nipples, or the embrace of underwear.<br>\r\n<br>\r\nThere was however a growing pile of unwashed dishes, and she didn't want to interrupt Shampoo and Ranma's time together.<br>\r\n<br>\r\nShe had her conversation prepared for the inevitable confrontation with the Saotome boy. A dose of the cure, and perhaps as a sweetener, give Shampoo her own taste of the sauce. Cologne didn't like the idea of giving Shampoo something like that, but... well, she had lost to Ranma, so it wasn't ... entirely unfair.</span></div></div>",
            "created":1432530000,
            "id":1982944,
            "title":"personality of a different girl"
        },
        "1142":{
            "choices":[
                "Tomboy",
                "Girly girl",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of personality does she get?<br>\r\n<br>\r\n<u>A tomboy</u>- A girl that likes to do guy things<br>\r\n<br>\r\n<u>Girly girl</u>- A girl that cares for things girls care about. Ex: Make-up, clothes etc.</span></div></span></div>",
            "created":1371358800,
            "id":1611964,
            "title":"ranma chan has a new mental mind"
        },
        "11421":{
            "author_id":"ranma-or-ranko",
            "author_name":"Ranko",
            "choices":[
                "Ranma hits his head on a rock.",
                "Ranma gets a dosage of some magic."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Ranma's personality become that of a tomboy's?</span></div></span></div>",
            "created":1421816400,
            "id":1921198,
            "title":"Tomboy"
        },
        "114211":{
            "author_id":"ranma-or-ranko",
            "author_name":"Ranko",
            "choices":[
                "They take it well.",
                "They don't take it well."
            ],
            "content":"<div class=\"\"><div> <span>Ranma was being chased by Akane, they ran near the koi pond. Akane had been swinging a bokken at Ranma the whole way, but Ranma had to stop to avoid the pond. While he was changing directions he caught Akane's bokken across the chest, knocking him into the water, he hit his head on a rock near the edge of the water.<br>\r\n<br>\r\n\"Ranma, Are you okay?\" Kasumi asked as Ranma awoke from his sleep.<br>\r\n\"I just feel a little light-headed, Kasumi-chan.\" Ranma replied. Kasumi's eyes widened at Ranma's use of \"Chan.\"<br>\r\n\"Are  you sure?\" Kasumi asked with even more concern that before. \"You hit your head pretty hard.\"<br>\r\n\"I'm sure.\" Ranma said looking into Kasumi's eyes with a smile.<br>\r\n\"Say Ranma, what do you think of Akane?\" Nabiki asked Ranma from the door.<br>\r\n\"She is a good friend, and fun to spar with.\" Ranma replied now smiling at Nabiki.<br>\r\n\"She's not your uncute fiance?\" Nabiki questioned, having already reasons to suspect that Ranma was not okay.<br>\r\n\"But we're both girls, it would be right for us to wed.\" Ranma replied her smile straightening.<br>\r\n\"But you are betrothed.\" <br>\r\n\"I know, I don't want to marry her. I want to marry a strong, handsome man who is just as strong as me, or even stranger!\" Ranma replied.<br>\r\n\"Maybe you should get some more rest.\" Kasumi interjected.<br>\r\n\"Sure thing, Kasumi-chan.\" Ranma said as she sunk back into her futon. Kasumi and Nabiki walked out, their fears confirmed.<br>\r\n\"Best tell Otosan and Genma-san.\" Kasumi said to Nabiki.<br>\r\n<br>\r\n&lt;b&gt;How do the two take the news? &lt;/b&gt;<br>\r\n</span></div></div>",
            "created":1421902800,
            "id":1921202,
            "title":"Ranma hits his head on a rock."
        },
        "11422":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Before the alarm, Ranma woke, dressed and headed out for a training run.",
                "On waking, Ranma picked up the underwear with a certain dread fascination.",
                "As she slept, Ranma's dreams were troubled."
            ],
            "content":"<div class=\"\"><div> <span>Ranma was sleeping in her usual manner. The sheets were scattered all over the floor, and her top damp. Genma was not tolerant of Ranma kun's snoring... Especially given that Ranma Chan didn't snore, at all.<br>\r\n<br>\r\nUnfortunately for the sleeping Saotome's they were not alone. Atop the wardrobe, Happosai opened his eyes taking in the rhythmic shifting of Ranma's impressive chest. He was feeling oddly conflicted. The girls just moved so much more when they were unrestrained. But he truly wanted to see Ranma have to cope with a woman's burden.<br>\r\n<br>\r\nIn his little nest of stolen panties, he was curled up like a very comfortable cat.<br>\r\n<br>\r\nBut the temptation proved too much for the old pervert. In a single bound, he landed, right on target. One foot resting atop each breast. Before Ranma could wake ... or protest ... or do anything.<br>\r\n<br>\r\nHe jabbed her sternum multiple times hitting a variety of pressure points. Ranma's only response was a mewling moan. The moan softened into a gentle sigh. Satisfied that his blows were accurate. He leaped back to his hidey-hole. His landing barely disturbed the wardrobe. Behind him there was a gentle shifting as Ranma's bust settled back to compensate for the now vanished weight.<br>\r\n<br>\r\nAs Happosai thought about what was going to happen in the morning. He picked out two pieces from his cache. With an indolent swipe he swatted a pair of pink panties to land beside Ranma's sleeping form. It took him longer to select a bra that would fit, but soon a suitable one was drifting down to land beside the sleeping girl.<br>\r\n<br>\r\nHapposai's dreams were as ever happy and filled with bounteous girls. He was already imagining Ranma's confusion and compulsions when she woke.</span></div></div>",
            "created":1432357200,
            "id":1981723,
            "title":"Girly girl"
        },
        "114221":{
            "author_id":"nerdman42",
            "author_name":"Nerdie",
            "choices":[
                "Ranma returns home",
                "Ranma runs into a familiar face"
            ],
            "content":"<div class=\"\"><div> <span>Ranma woke feeling... different. She couldn't quite put her finger on it, but she felt significantly refreshed. Climbing up from her mat, she maneuver around the old man and made her way to the mirror. Her fresh face gazed back at her, smiling a little to herself. She had a good head start on the day, she should go for a run. Sure, her father would have her training soon enough, but there wasn't anything wrong with a little more reasonable exercise. Besides, it was always good to watch her figure. A body like hers required effort in maintaining.<br>\r\n<br>\r\nNot noticing the strangeness of her own thoughts, Ranma tied her hair into a ponytail, applied a light blush, and put on her usual running clothes. They were practical and efficient, but she couldn't wait to come back and put on something more flattering when she got home.<br>\r\n<br>\r\nShe jogged around Nerima easily, enjoying the sights and sounds of early morning. Birds were chirping and a beautiful sunset was just over the horizon. What a lovely way to start the day.</span></div></div>",
            "created":1471064400,
            "id":2195305,
            "title":"Before the alarm, Ranma woke, dressed and heade..."
        },
        "1142211":{
            "author_id":"nerdman42",
            "author_name":"Nerdie",
            "choices":[
                "Something flashy and daring",
                "Something cute"
            ],
            "content":"<div class=\"\"><div> <span>Satisfied with her run, Ranma took a nice, relaxing shower, washing herself with long lasting shampoo without a second thought.<br>\r\n<br>\r\nShe wrapped herself with a towel, covering her chest, before approaching the mirror. Hm. She was certainly clean, but now she needed to make sure she looked good. After all, when you were blessed with looks like hers, it'd be a crime not to show them off.<br>\r\n<br>\r\nAfter drying her hair, she returned to her room and combed through her clothes. She needed something that spoke to the kind of person she was. Something that screamed \"drop-dead girl who could drop kick you\". Something that encapsulated Ranma.</span></div></div>",
            "created":1474434000,
            "id":2213077,
            "title":"Ranma returns home"
        },
        "11422112":{
            "author_id":"go14mei",
            "author_name":"Jvr",
            "choices":[
                "A pink frilly dress",
                "A cosplay outfit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something Like:</span></div></span></div>",
            "created":1484197200,
            "id":2262735,
            "title":"Something cute"
        },
        "114221121":{
            "author_id":"wwemania81",
            "author_name":"WWEis#1",
            "choices":[
                "Praise from Nodoka, Compliments from the sisters & insults from the fathers ",
                "Stunned silence "
            ],
            "content":"<div class=\"\"><div> <span>She pulled out a frilly pink dress and after a moment of wondering where it came from it was incinerated by a low powered Moko Takabasha as she realized it was from Happosai<br>\r\n<br>\r\nAfter digging some more she decided on <br>\r\n<br>\r\nA light blue spaghetti shirt with a flannel button shirt (unbuttoned) over top and a pair of jean shorts with knee high socks, once dressed she did her hair in a top ponytail then a very faint touch of makeup before heading downstairs to</span></div></div>",
            "created":1484456400,
            "id":2263724,
            "title":"forget that"
        },
        "114221122":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Job outfit",
                "Outfit from a different show"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which type of outfit is it?</span></div></span></div>",
            "created":1484197200,
            "id":2262747,
            "title":"A cosplay outfit"
        },
        "1142211221":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Ranma wear a bunny girl outfit</span></div></span></div>",
            "created":1487394000,
            "id":2279230,
            "title":"Job outfit"
        },
        "11422112212":{
            "author_id":"queendiva",
            "author_name":"QueenDiva",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ranma was wearing <br>\r\nBlack bikini-like shorts<br>\r\nRed mini jersey with \"Fearless\" across the front &amp; 01 on the back<br>\r\nKnee high red soccer socks</span></div></span></div>",
            "created":1489035600,
            "id":2286900,
            "title":"Bella Wrestling gear?"
        },
        "114222":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Ranma quickly slips on the pink running outfit.",
                "She's satisfied with her secret lingerie, and pulls on 'boy' clothes.",
                "Akane silently slides open the door, and takes in her fiancee's confusion."
            ],
            "content":"<div class=\"\"><div> <span>Her father was still snoring away when Ranma woke. The Sun was cresting the horizon, gilding the top of the garden fence. A quick sniff confirmed that her sleepwear wasn't suitable for the morning run.<br>\r\n<br>\r\nIt was then that her eyes spotted the lingerie. Her fingers flinched, snatching the air as she looked at them. The panties were a simple lacy pink arrangement of barely there flowers. Picking them up, they looked far too small to fit even her girl body.<br>\r\n<br>\r\nShe wanted to drop them, but forgot when she spotted the bra. It was sturdier. Again a similiar shade of pink, with firm support, the upper half of the cups was more decorative, and lined with little roses stitched along it.<br>\r\n<br>\r\nRanma was seized by a perverse thought, a glance at her sleeping father, drooling and snoring confirmed he was out for the count. Silently she stripped naked, and slid the soft panties up her smooth thighs, pressing them into place. She twisted and flexed, admiring her curves, as she posed and pouted.<br>\r\n<br>\r\nHer attention returned to the bra in her hands and soon she felt the comforting embrace of the silken cups, lifting and supporting the girls.<br>\r\n<br>\r\nIt was a nice image, as she admired her reflection... girly and cute... Pink... it wasn't a side she showed often.<br>\r\n<br>\r\nOutside it felt like only the birds were awake and about, as they sang their joy to the morning sun.<br>\r\n<br>\r\nRanma spotted a pink jogging outfit, that Nabiki had left unfolded in the corner. Her eyes shifted to her usual running clothes.<br>\r\n<br>\r\nHapposai was barely capable of containing his joy as he watched Ranma try to face his compulsions, but in the murk he was invisible.</span></div></div>",
            "created":1432357200,
            "id":1981732,
            "title":"On waking, Ranma picked up the underwear with a..."
        },
        "1142223":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Her normal clothes",
                "A cute outfit or school uniform"
            ],
            "content":"<div class=\"\"><div> <span>Akane slide open the door to Ranma's bedroom and saw Ranko standing wearing a pink bra &amp; panties she would have looked cute if not for the look of confusion on her face<br>\r\n<br>\r\n\"I knew you were a pervert\" Akane yell-whispered<br>\r\n<br>\r\nRanma spun around the confused look still on her face \"I am not\" before she could say anything else Akane whispered before leaving the room \"Oh yeah well see about that\" <br>\r\n<br>\r\nA few minutes passed and Ranma had just finished tiring her robe shut when Akane came &amp; pulled her to the bathroom<br>\r\n<br>\r\n\"Go in there, I set up.a test\"<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\n\"I saw the look of confusion on your face &amp; since Aunty isn't here that means you don't have to be Ranko which means either you are a pervert &amp; a liar,  your starting to accept your girl side, Nabiki is making you do this  or either The old freak or even the The old ghoul did something to you\"<br>\r\n<br>\r\nShe nodded &amp; entered the bathroom a few minutes later she came out wearing</span></div></div>",
            "created":1432443600,
            "id":1982338,
            "title":"Akane's test"
        },
        "11422231":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "At the breakfast table, Happosai spills some hot tea on Ranma.",
                "There's an icy silence between Akane and Ranma at the breakfast table.",
                "A visitor arrives at the door."
            ],
            "content":"<div class=\"\"><div> <span>Ranma came out in his usual comfortable clothes. It was unisex, but didn't flatter her girlish form.<br>\r\n<br>\r\n\"See. Not a pervert.\" she said defiantly.<br>\r\n<br>\r\nRanma started flapping, as Akane advanced on her.<br>\r\n<br>\r\nSwiftly her hands darted out, and slipped loose a couple of the buttons.<br>\r\n<br>\r\n\"Ha!\" she cried truimphantly. The pink of Ranma's satin bra becoming visible.<br>\r\n<br>\r\n\"I have to wear one.\" she pouted in answer.<br>\r\n<br>\r\n\"Us bigger girls need the support.\"<br>\r\n<br>\r\n<b>-Slap-</b><br>\r\n<br>\r\nAkane left the room, and a palm print on Ranma's cheek. The old pervert chuckled silently from his nest of panties. He could barely contain himself, when he saw rare tears coming from the corner of Ranma's eyes.<br>\r\n<br>\r\nHe had to suppress his instincts to be sure that his pressure point hits had had the desired effect. He needed to see how Ranma would react when he was male. It went against everything he stood for... But the possibility of humiliating Ranma made him happy to confirm what he suspected.<br>\r\n<br>\r\nBesides if she was wearing the bra, she was surely wearing those delectable panties.<br>\r\n<br>\r\n\"Breakfast's ready.\" Kasumi's sing song voice announced.</span></div></div>",
            "created":1432530000,
            "id":1982873,
            "title":"Her normal clothes"
        },
        "114222311":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Go to Nekohatten to talk with Cologne",
                "Go to park & meditate before meeting Mother at train station"
            ],
            "content":"<div class=\"\"><div> <span>As Ranma &amp; Akane entered she said \"Come on Akane I apologized\" as they sat down Genma  spoke \"What did you do boy &amp; why are you a girl\" <br>\r\n<br>\r\n\"One none of you business &amp; two because you tossed me into a cursed spring\"<br>\r\n<br>\r\n\"That's not what I ment\"<br>\r\n<br>\r\nRanma started eating before saying \"I just felt like it\" a few minutes later Ranma was hit in the face with hot water turing him back into a guy, he looked at Happosai &amp; his eyes narrowed, then before Ranma could explode he heard a voice in his head say 'Easy Ranma that's what the old fart wants'  this calmed him down surprising everyone 'We'll talk later' he thought back before the currently male said \"Great-Grandfather, I would appreciate it if you didn't do that, it gets very uncomfortable\"<br>\r\n<br>\r\n\"What do you mean boy?\"<br>\r\n<br>\r\n\"The Pervert means he's wearing a bra &amp; a pair of panties\"<br>\r\n<br>\r\nAkane stated as Ranma pored cold water on his head turning back \"Akane there was no reason to say that  &amp; if it's to get back at me for what I said, I said I was sorry I for once wasn't trying to insult you\" she then turned to Kasumi \"Do you still have the girl's school uniform you gave to me when I was locked?\" <br>\r\n<br>\r\n\"Yes of course, I'll get it out for school tomorrow\"<br>\r\n<br>\r\n\"Thank you\"<br>\r\n<br>\r\nRanma finished breakfast before shouting \"I'm off\" as she headed out heading to...<br>\r\n<br>\r\n</span></div></div>",
            "created":1433307600,
            "id":1987165,
            "title":"At the breakfast table, Happosai spills some ho..."
        },
        "11422232":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Ranma nodded, \"Of course... No objections.\" her voice warbled, just slightly.",
                "\"Would you prefer to be my wife?\" Akane asked pointedly.",
                "Nabiki arrives to investigate the noise."
            ],
            "content":"<div class=\"\"><div> <span>Akane was genuinely nervous about which outfit Ranma would choose. But it was a good kind of nervous, it made her rather excited. She had her own suspicions, especially given how pink and girly the lingerie was that she'd caught Ranma.... would she prefer Ranko, just now ... was wearing.<br>\r\n<br>\r\nThe shoji panel slid aside. It revealed Ranma in her pristine school uniform.... well, it was actually Akane's uniform. <br>\r\n<br>\r\nLike a catwalk model, Ranma stood in the doorway. She posed and pouted for the imaginary camera. Sticking out her ass, throwing back her shoulders, fluttered her eyes and blowing kisses to the non-existent audience. Akane ground her teeth..... This was not going the way she wanted.<br>\r\n<br>\r\nThe short skirt offended Akane's eyes, as it looked just a little too short. A growl started deep in the back of her throat, as Ranma started plucking at the seams of the blouse. The outline of her bra pressing firmly into the blouse revealing the details for everyone to see. The reason being, it was just a smidgen too small. The buttons were pulled tight, as the stitching strained to hold back Ranma's larger bust. It gapped when Ranma took a deep breath, the bra peeked out.<br>\r\n<br>\r\n\"This isn't perverse.\" she said clearly. Putting her fists on her hips.<br>\r\n<br>\r\n\"When I'm a girl... I should dress as a girl. Not. some. Tomboy.\" The last three words were clearly directed at Akane, and her own choice in clothes.<br>\r\n<br>\r\n\"Then you won't object to wearing it to school, would you, Ran<b>ko</b>.\" she said, spitting out the words.<br>\r\n<br>\r\nThere was a moment's uncertainty on Ranma's face.</span></div></div>",
            "created":1432530000,
            "id":1982697,
            "title":"A cute outfit or school uniform"
        },
        "114222322":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "\"I'll be your wife when I'm a girl if you'll be my husband when your a guy\"",
                "\"Um uh....\" or something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Of course not\" Ranma said shocking Akane they then went downstairs both wearing the school uniform<br>\r\n<br>\r\n\"Oh my\" Kasumi stated as they sat down at the table \"Ranma come with me\" as she took Ranma back up stairs she asked \"Why are you wearing that?\" Ranma scratched the back of her neck \"I don't know Kasumi, I guess I decided to try &amp; except this side of me since I can't seem to get rid of it\" she nodded &amp; said that she understood what she ment &amp; would help.if she wanted her to, se then got Ranma to change into her old uniform before they went back down<br>\r\n<br>\r\nAs the four girls ate breakfast Kasumi told her sisters what Ranma had said to which Akane replied  \"Does that mean you want to be my wife?\"<br>\r\n<br>\r\n\"Tell you what, you spend the day as a guy &amp; if your okay with it then ask me again tonight &amp; I'll answer you then\"<br>\r\n<br>\r\n\"Deal\"<br>\r\n<br>\r\nRanma pulled out a package of instant Nannicuan then doused Akane turning her into a boy, then they headed to school where the day went by pretty fast once they were back home </span></div></div>",
            "created":1433307600,
            "id":1987180,
            "title":"\"Would you prefer to be my wife?\" Akane..."
        },
        "1142223221":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Dinner no interruptions",
                "Dinner interrupted by ______"
            ],
            "content":"<div class=\"\"><div> <span>Akane took her sisters into her room then later she asked Ranma out<br>\r\n<br>\r\nSkip to Saturday Night <br>\r\n<br>\r\nAkane stood at the bottom of the stairs in a suit waiting for his date while Soun is crying about his youngest losing her mind another few minutes passed then he looked at the stairs and her jaw dropped as she saw <br>\r\n<br>\r\nRanma was wearing a red dress with a black shoulder (half) coat, black leggings, a pair of heels her hair was untied hanging down her back, she was wearing a bit of makeup and had a necklace on <br>\r\n<br>\r\n\"You look beautiful, Ranma\" Akane said after Nabiki smacked him in the back of the head <br>\r\n<br>\r\n\"T..Th..Thank you, Akio\" Ranma replied before adding \"You look good too\"<br>\r\n<br>\r\n Akan...Akio took Ranma's hand and headed for the door as they left Kasumi handed Ranma a purse </span></div></div>",
            "created":1448168400,
            "id":2065343,
            "title":"\"I'll be your wife when I'm a girl ..."
        },
        "11423":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Akane quizzed the usual suspects.",
                "\"Perhaps you'd prefer to be my wife?\" Akane asked.",
                "Happosai leaped out from hiding."
            ],
            "content":"<div class=\"\"><div> <span>Sitting at the low table for breakfast. Akane sat opposite Ranma, her face set in a scowl. Her fiance was better at martial arts than her, and ...<br>\r\n<br>\r\nStabbing her chopsticks into the rice, (at the moment) a curvier girl than her. Ranma and Genma had been caught in a shower on their morning run, and the room was starting to smell of damp panda.<br>\r\n<br>\r\nShe thought she saw (no...) felt something different about Ranma as she ate her breakfast. A degree of restraint, decorum... not just shovelling rice down her throat.<br>\r\n<br>\r\n\"Dad...\" she started uncertainly. Her voice falling silent.<br>\r\n<br>\r\nGenma just grunted and looked over, his pile of blank signs sitting untouched against his furry thigh.<br>\r\n<br>\r\n\"When I'm... running as a girl... I ...\" her cheeks turned crimson, and she looked jealously across to Akane.<br>\r\n<br>\r\n\"I need support.\" she blurted the words out in a hurried whisper.<br>\r\n<br>\r\nAs if afraid of being misunderstood, she gave her chest a playful squeeze.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://49.media.tumblr.com/c164afeca3d0a5749b174417d2f21992/tumblr_ntapg0dpzx1rwaupfo1_500.gif\" target=\"_blank\">http://49.media.tumblr.com/c164afeca3d0a...</a><br>\r\n<br>\r\nThe two fathers spat their tea across the table in shock. This wasn't like Ranma at all. Akane shot an accusing look at her fiance. But only received a blank look back.</span></div></div>",
            "created":1452402000,
            "id":2087239,
            "title":"Ranma the tease"
        },
        "114233":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Ranma makes it to her mother",
                "Ranma is stopped by Akane, fiancée or rival"
            ],
            "content":"<div class=\"\"><div> <span>'Not funny boy' Genma signed<br>\r\n<br>\r\n\"I wasn't being funny\" Ranma responded \"I'm sure Akane will agree\"<br>\r\n<br>\r\n'Enough stop this nonsense you don't need support' ^Flip^ 'your a boy, now act like one'<br>\r\n<br>\r\nSoun dived behind his paper while the girls had various degrees of shock as Ranma glared at her panaified father while getting up<br>\r\n<br>\r\n\"First of all I am not a boy, boys don't have these\" she gestured to her chest \"since you don't want to give me the money I'll go ask Mother I'm sure she'll want to help me get the nesecery support if not a proper full wardrobe\"<br>\r\n<br>\r\n\"That won't be nesecsary my girl here\" Happosai jumped in and handed her a bra<br>\r\n<br>\r\n\"Thank you Grandfather but one this is one of Akane's and two I don't know where it's been or what you have done with it\" she then started out before saying \" oh and Grandfather from this day forward I am no longer a member of the anything goes school\" everyone stared \"I'll only use my skills for self defence and to keep in shape but nothing more then that\" she then left</span></div></div>",
            "created":1465707600,
            "id":2162927,
            "title":"Happosai leaped out from hiding."
        },
        "1143":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Here's Ranko (Curse works as normal)",
                "Here's Ranko (Curse works in Reverse)",
                "Here's (name Nodoka would've given her)  "
            ],
            "content":"<div class=\"\"><div> <span>At birth she was stillborn her soul fused into Ranma<br>\r\nThe Nekoken &amp; Genma's crap burried her in Ranma<br>\r\nJusenkyo created a body <br>\r\nRyoga's Koi rod pulled her from under Genma's crap<br>\r\nThe Rock around the koi pond brought her out<br>\r\nThe Rock around the koi pond put her back but now she could talk with Ranma<br>\r\nThe failed wedding made her mad angry<br>\r\nAkane's latest temper tantrum p*$$ed her off<br>\r\n<br>\r\n<br>\r\nWhile out Ranko draged Ranma to an area near Neko &amp; put him into a cell and locked him in it, leaving a note for Ranma then she went to take control of their body<br>\r\n<br>\r\n</span></div></div>",
            "created":1375592400,
            "id":1640211,
            "title":"Twins in one body"
        },
        "11433":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Natsumi?</span></div></span></div>",
            "created":1409634000,
            "id":1851295,
            "title":"Here's (name Nodoka would've given her)  "
        },
        "115":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Mermaid",
                "Fairy",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did ranma turn into a </span></div></span></div>",
            "created":1392094800,
            "id":1743952,
            "title":"Magical creature "
        },
        "1151":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Ranma going to the beach ",
                "Ranma going to the big pond",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how did ranma turn into a mermaid?</span></div></span></div>",
            "created":1392267600,
            "id":1745163,
            "title":"Mermaid"
        },
        "11511":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Royal chambers",
                "Throne room"
            ],
            "content":"<div class=\"\"><div> <span>Ranma going to the beach to have fun,ranma quickly drop cold water on his head and then ranma quickly transform into his girl form and ranma put on a swimsuit,so ranma jump in the ocean water swim and enjoying himself but meanwhile in the deep part of the ocean there a kingdom of mermaid try to win the king triton love but king triton not want any of the mermaid,so triton swim up to the surface to got away from the mermaid but then he saw the most beautiful girl he ever seeing and with that king triton fall deeper in love with this beautiful girl and then triton decide this beautiful girl will become his bride but then triton notice that the girl he want to married is a human and she about to leave but triton won't allowed his future bride to leave,so triton quickly grab ranma hand and he use his power to turn ranma into a mermaid.Ranma sudden grow a beautiful mermaid tail and ranma saw he now have a beautiful red mermaid tail and ranma see triton and ranma try to get away but triton lift up ranma body and now ranma find himself in the arm of the merman.Triton carring his beautiful bride deeper and deeper into the ocean and then triton carring his future bride inside his castle and take her into his?       </span></div></div>",
            "created":1392267600,
            "id":1745202,
            "title":"Ranma going to the beach "
        },
        "115111":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Something nice to King Triton",
                "Triton i want you change me back to normal "
            ],
            "content":"<div class=\"\"><div> <span>Royal chambers.Ranma struggle tried to get away for him but thenTriton gentle set Ranma on his bed.Triton said oh my you look more beautiful now that your a mermaid.Ranma said Hey who are you and why did you change me into a mermaid.Triton smile and said my name Triton and I'm the king of the merpeople and as for your question why i change you into a mermaid well you see i fall in love with you and that why i decide to turn you into a mermaid that way i can have you with me forever.Ranma said?    </span></div></div>",
            "created":1398834000,
            "id":1789403,
            "title":"Royal chambers"
        },
        "1151112":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Triton said i sorry i afraid i can't do that",
                "Triton said all right i turn you back but one condition"
            ],
            "content":"<div class=\"\"><div> <span>Triton i want you change me back to normal.Triton chuckle and said oh my love if i did that you couldn't breathe underneath the water.Ranma said i not want to be a mermaid and you can't keep me here forever.Triton said oh my sweet Ranma you should be honor to be with handsome king like me.Ranma said wait a min how did you know my name.Triton said when i turn you into a mermaid i hear someone said Ranma so i thought it must be your name.Ranma said i begged you Triton please change me back to normal. (Did King Triton change Ranma back to normal?)  </span></div></div>",
            "created":1398920400,
            "id":1790067,
            "title":"Triton i want you change me back to normal "
        },
        "11511121":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "She can & does",
                "She can't but does know away"
            ],
            "content":"<div class=\"\"><div> <span>Triton blew a powder into the face of Ranma this caused her to relax &amp; her eyes to fall thus putting her into a hypnotic like state<br>\r\n<br>\r\nit was shortly after the honeymoon Ranma broke free of the powder &amp; she was pissed especially because the place guards would follow her at a distance.   So once she was ready she used the \"Umisenken\" &amp; finally managed to get out of the kingdom she then traveled to where the sea witch lived<br>\r\n<br>\r\n<br>\r\n\"Ursala?\"<br>\r\n<br>\r\n\"Well if it isn't the skank that stole my Triton\"<br>\r\n<br>\r\n\"I didn't steal him the bastard kidnapped me turned me into a mermaid\"<br>\r\n<br>\r\n\"Turned you into a mermaid\" <br>\r\n<br>\r\n\"Yes I was at the beach with my fiancée Akane\" Ursala intrupted again \"Isn't that a girl's name\" Ranma nodded \"I had a curse that turned me into a girl when splashed with cold water\"<br>\r\n<br>\r\n\"So your a boy who switches genders with water &amp; Triton decided to make you his wife \" <br>\r\n<br>\r\n\"Yup, but I wouldn't accept it and demanded he return me to normal but after he refused to turn me back he grabed something blew it in my face to make me fall in love with him &amp; would agree to marry him then he impregnated me.   The entire time I have been a mermaid I have heard stories about you, I heard that your a powerful Sea Witch\"<br>\r\n<br>\r\n\"That's right I am\"<br>\r\n<br>\r\n\"Can you turn me &amp; my child back into humans\"</span></div></div>",
            "created":1424581200,
            "id":1938321,
            "title":"Triton said i sorry i afraid i can't do that"
        },
        "115111212":{
            "author_id":"queendiva",
            "author_name":"QueenDiva",
            "choices":[
                "The Spring of the Pregnant Woman",
                "The Spring of the Pregnant Teenager"
            ],
            "content":"<div class=\"\"><div> <span>I can't, but there is a portal that can take you to any body of water.  This map will show you where it is &amp; how to use it\" she handed the map to Ranma<br>\r\n<br>\r\n\"Thank you\"<br>\r\n<br>\r\n\"No problem dear however you must now pay me\"<br>\r\n<br>\r\n\"Pay but\"<br>\r\n<br>\r\nShe held up her hand \"I always take something of importance to the person but in this case, I ll take the viberent color of your hair\" a stream of energy went from her hand to Ranma's hair and it dulled until it was the same color as her Mothers<br>\r\n<br>\r\nShe left and went off after finding and activating the portal she ended up in</span></div></div>",
            "created":1473656400,
            "id":2209431,
            "title":"She can't but does know away"
        },
        "1151112121":{
            "author_id":"chaoticanime",
            "author_name":"SlimerRules",
            "choices":[
                "Looked like her mother",
                "Looked like an older Ranko"
            ],
            "content":"<div class=\"\"><div> <span>When she came out she heard \"Oh Miss customer, I no see you come.  I sorry for that &amp; I sorry but you fell in the Spring of the drowned pregnant woman very trag\"<br>\r\n<br>\r\n\"Sorry to interrupt but do you have some clothes I can use?\"<br>\r\n<br>\r\n\"Oh sorry no, but maybe amazons have.  I take you but for now blanket should help keep you warm\"<br>\r\n<br>\r\n\"Thank you\" <br>\r\n<br>\r\nThey then started walking the trail as they did Ranma asked about the woman and he told her \"Do you know how far along she was\" he said there was no information about that \"but you now locked until give birth\" she let out a sigh and muttered under her breath \"thought so\" after a few minutes the Guide asked \"May this one ask how you end up naked in spring\" she sighed and after realizing she might have to say it several times told him everything <br>\r\n<br>\r\nAfter they reached the village she was given a check up and clean clothes as she got dressed she noticed that she </span></div></div>",
            "created":1505019600,
            "id":2383725,
            "title":"The Spring of the Pregnant Woman"
        },
        "11511122":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Ranma agreed to become his wife, but Triton didn’t change Ranma back",
                "Ranma agreed to become his wife, Triton change her back after they get married. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Alright I will change you back but on one condition.” Triton reply while look at her. “What your condition?” Ranma asked and Triton immediately grab her waist. “You become my wife and love me forever.” Triton answer.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1578945300,
            "id":2773279,
            "title":"Triton said all right i turn you back but one c..."
        },
        "1152":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Kuno",
                "Happosai",
                "Azusa"
            ],
            "content":"<div class=\"\"><div> <span>One day ranma walk in the park but all the suddenly ranma shrunk down and transform into his girl form and he grow wing on his back and now ranma have to find way,to turn back to normal but then the ground start to stake and ranma look up to see it? </span></div></div>",
            "created":1392094800,
            "id":1743982,
            "title":"Fairy"
        },
        "11522":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Now it time for me to play with our tiny female body ",
                "Oh ranma you going to play with my"
            ],
            "content":"<div class=\"\"><div> <span>Happosai,ranma try to hide for happosai know in him,he will just use me for his pleasure but it to late happosai noticed you and he quickly grab ranma and say oh my ranma it look like i will be enjoying myself and with that happosai unzipped his pocket shirt and then happosai put ranma inside his shirt pocket and quickly zip it backup again and then he started to run back home.Ranma got throw around as happosai run and ranma say HEY GET ME OUT OF HERE HAPPOSAI,HEY DID YOU HEAR ME I SAY I WANT OUT OF HERE and then ranma try to break the zipped open but it totally useless it won't pry but meanwhile happosai feel ranma struggle inside his pocket and then he got home and he quickly run upstair and then happosai unzipped his shirt pocket and grab ranma body.Ranma say HEY PUT ME DOWN and then happosai say? </span></div></div>",
            "created":1392267600,
            "id":1745157,
            "title":"Happosai"
        },
        "1153":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "Witch",
                "Vampire or a Werewolf ",
                "Succubus "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If ranma didn't turn into a magical creature how about a </span></div></span></div>",
            "created":1392613200,
            "id":1747322,
            "title":"Something else"
        },
        "11533":{
            "author_id":"animerules",
            "author_name":"Triple Anime",
            "choices":[
                "Yes ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Continue with Succubus or more choices</span></div></span></div>",
            "created":1479790800,
            "id":2240373,
            "title":"Succubus or more"
        },
        "115332":{
            "author_id":"animerules",
            "author_name":"Triple Anime",
            "choices":[
                "as Persocom (chobits)",
                "http://pre08.deviantart.net/acf9/th/pre/f/2011/231/4/3/ran_droid_by_smeadows-d47"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kodachi kidnapped Ranma and took her to a factory where she was turned into </span></div></span></div>",
            "created":1479877200,
            "id":2240796,
            "title":"More"
        },
        "1153322":{
            "author_id":"yukitheice",
            "author_name":"Yuki",
            "choices":[
                "Yes",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This or more options?</span></div></span></div>",
            "created":1490850000,
            "id":2297437,
            "title":"http://pre08.deviantart.net/acf9/th/pre/f/2011/..."
        },
        "11533221":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Reiko introduces herself",
                "She introduces Reiko to her master "
            ],
            "content":"<div class=\"\"><div> <span>\"Enter designation\"<br>\r\n<br>\r\n\"Reiko\"<br>\r\n<br>\r\n\"What is purpose\"<br>\r\n<br>\r\n\"To be my brothers Persacom\"<br>\r\n<br>\r\n\"Acknowle....wait where am I?,  What happened to me?\"<br>\r\n<br>\r\n\"Ahh, so your are in their good you are in the Kuno mansion &amp; I had your mind transferred to this body then had your original body destroyed\"<br>\r\n<br>\r\n\"You idiot Kodachi, them Amazon fused me and my sister together able to change with water because I refused to marry that purple hair bimbo, we are Reiko and Reiko.\"  A look of confusion crossed her face \"I am Reiko Reiko, why can't I say my name\"<br>\r\n<br>\r\n\"You are Reiko now but what did you mean by you and your sister what was your name?\"<br>\r\n<br>\r\n\"Ranma Saotome and my sister was Ranko Saotome although she would use my name sometimes\"<br>\r\n<br>\r\nKodachi' mind shutdown at this revelation and then</span></div></div>",
            "created":1494046800,
            "id":2315506,
            "title":"Yes"
        },
        "11533222":{
            "author_id":"yukitheice",
            "author_name":"Yuki",
            "choices":[
                "Yes",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How bout a Kitsune?</span></div></span></div>",
            "created":1490850000,
            "id":2297438,
            "title":"More options"
        },
        "115332221":{
            "author_id":"yukitheice",
            "author_name":"Yuki",
            "choices":[
                "Inari feels pity on this poor mortal.",
                "Curse/Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How should it happen?</span></div></span></div>",
            "created":1490850000,
            "id":2297440,
            "title":"Yes"
        },
        "12":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "A trip to Jusenkyo",
                "Shampoo works some magic",
                "Nabiki has a new gizmo",
                "She tries her own cooking",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What shall happen to our violent tomboy.</span></div></span></div>",
            "created":1380085200,
            "id":1669776,
            "title":"Akane"
        },
        "121":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "She headed back to Japan, her mission achieved... well a victory of a sort.",
                "She headed back to the cursed spring.",
                "Akane really didn't like the way the guide was looking at her."
            ],
            "content":"<div class=\"\"><div> <span>Akane was tired of competing with Shampoo for Ranma's attention, and she set off to China hoping to find a solution to her problems there.<br>\r\n<br>\r\nShe hated to admit it, but when she noticed how Ranma was around her and around Shampoo, she'd noticed his distracted glances. Even when Ranko was fighting she could be distracted by a jiggle or the shapely outline of a breast.<br>\r\n<br>\r\nAkane hated it, and tried to deny it, even to herself, but she was jealous of Shampoo and her curves. Especially when she saw their effect on Ranma. Damn it, she was even a little jealous of Ranko's curves.<br>\r\n<br>\r\nThe guide lead her to the Cursed Springs, and her temper had cooled by that point. She decided that Ranma was most likely to choose her when she brought him back a bottle from the 'Spring of the Drowned Man'. It was a trick and a tease that she fumed and ground her teeth at, watching Ranma follow <i><b>her </b></i>around like a loyal little puppy, begging for a treat.<br>\r\n<br>\r\nUnfortunately, she wasn't paying attention to where she was going on the uneven ground. A warning shouted by the guide only made things worse, when she turned around and tripped.<br>\r\n<br>\r\n-Splash-<br>\r\n<br>\r\nShe spluttered angrily to the surface, the jokes and insults for her being clumsy ringing in her ears.<br>\r\n<br>\r\nAs she struggled to the edge of the pool, the weight of the water pulled at her clothes and shoulders. She reached the road ready to curse out the guide. Who was watching her approach with a stunned expression and an open mouth.<br>\r\n<br>\r\nOn reaching the road, Akane realised why....<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://fap.to/images/full/44/970/970726660.jpg\" target=\"_blank\">http://fap.to/images/full/44/970/9707266...</a><br>\r\n<br>\r\nShe was never going to be insecure about her bust ever again. She would have given a little jump for joy but the threat of two black eyes stopped her.</span></div></div>",
            "created":1409806800,
            "id":1852452,
            "title":"A trip to Jusenkyo"
        },
        "1212":{
            "author_id":"bou53leau",
            "author_name":"P'titloup",
            "choices":[
                "She regains its original shape",
                "nothing changes",
                "She became even sexier"
            ],
            "content":"<div class=\"\"><div> <span>Resuming his calm, she walked cautiously toward the source cursed and she contemplated her reflection in the water and notes that only his body had changed and not his face. Then a thought came to her mind and she turned around to ask something to the guide that accompanied it.<br>\r\nShe asked him if it was the source where Ranma fell. He replied it was fine the same source. She then asked if the fact that she is fell in had broken off the spell who hit Ranma. He replied that she should check by herself if the spell was lifted. Sighing, she asked where she could find of the hot water to see if his body would return as he was before she fell in the source. The guide out of his sleeve a kettle filled with hot water and handed it to Akane, who emptied it on his head and...</span></div></div>",
            "created":1453870800,
            "id":2095439,
            "title":"She headed back to the cursed spring."
        },
        "125":{
            "author_id":"animerules",
            "author_name":"Triple Anime",
            "choices":[
                "Turned into an animal",
                "Swapped body's with non fiancée girl",
                "Turned into a doll"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of these</span></div></span></div>",
            "created":1446699600,
            "id":2057064,
            "title":"Other"
        },
        "14":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "spell misfire",
                "potion mishap",
                "new curse",
                "your choise",
                "your choise"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shampoo, the Chinese amazon warrior who has tried to get Ranmas love through various tricks, and magic supplied by her great grandmother.<br>\r\n<br>\r\nOn that note let's see what happens when her magic based plans backfire</span></div></span></div>",
            "created":1376542800,
            "id":1646757,
            "title":"Shampoo"
        },
        "141":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "an animal",
                "an object",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Shampoo was looking through her grandmothers magic scrolls, hoping to find something that would win Ranmas affection for her, or at least get rid of her competition. While she was looking a particular spell caught her eye, 'This seems interesting' she thought. Reading the description of the spell,she got excited. \"This just what Shampoo need\" she says in her odd accent. She wants to try the spell right away so she starts the preparations for the spell. When she finishes, she begins to read the spell vocally. As she nears the end of the spell, she fails to notice that in her haste to get ready some dust had flown into the air and had gone up her nose. \"AHHH-CHOO!!!\" Shampoo sneezed before she finished the spell. \"Uh oh.\" Smoke began rise from the scroll and cover Shampoo \"That not supposed to happen!\" she shouted. The smoke now completely covered Shampoo and she blacks out. When she comes to the first thing she notices is that she doesn't recognize where she is. Next she looks down at herself only to discover she that transformed into...</span></div></div>",
            "created":1376542800,
            "id":1646767,
            "title":"spell misfire"
        },
        "1412":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "real shampoo ",
                "clothing in a drawer",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Next she looks down at herself only to discover that she's transformed into...<br>\r\n</span></div></span></div>",
            "created":1376542800,
            "id":1646778,
            "title":"an object"
        },
        "14121":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "In someones bathroom",
                "On a shelf in a store"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where is she?</span></div></span></div>",
            "created":1381640400,
            "id":1678192,
            "title":"real shampoo "
        },
        "141211":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "The Tendos",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose bathroom?</span></div></span></div>",
            "created":1381640400,
            "id":1678193,
            "title":"In someones bathroom"
        },
        "1412111":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "One of the sisters",
                "Ranma"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But who uses her</span></div></span></div>",
            "created":1502773200,
            "id":2369351,
            "title":"The Tendos"
        },
        "14121112":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Nekohatten (Cat Cáfe)"
            ],
            "content":"<div class=\"\"><div> <span>Akane was walking into the change room when she saw a bright light under the door, she opened in and  <br>\r\nshe could only stare as Ranma's hair grew and turned purple leaving only a section of red, next Ranma's body grew a few inches not only in height but her breasts and butt grew a little, when done she turned to her and said <br>\r\n<br>\r\n\"Hiya Airen, Ranma would like to have fun but need go work\" she said caressing Akane's check as she walked out of the bathroom into the change room &amp; picked up her panties but <br>\r\n<br>\r\n\"Weird, Ranma clothes no fit\" <br>\r\n<br>\r\nShe walked back into the bathroom and doused herself with cold water turning into a cat then she ran out and headed to<br>\r\n=====================<br>\r\nWorld notes: Soun took daughters on training trip &amp; got cursed at Jusenkyo,  Soun/Donkey Akane/Man (up to whoever if K &amp; N were cursed) Amazon village Soun ate food Akane fought Ranma kiss of marriage they run return home to dojo where Genma currently teaches/lives with son (OC) Girls go back to school meets Kuno, Ukyo (male &amp; engaged to Akane) appears opens restaurant Ranma shows up with Mother &amp; Great Grandmother</span></div></div>",
            "created":1502773200,
            "id":2369393,
            "title":"Ranma"
        },
        "1412112":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "Ukyos bathroom",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1381640400,
            "id":1678194,
            "title":"someone else"
        },
        "14121122":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kodachis personal bathroom? (The Kuno family is rich surely they must have personal bathrooms right?)</span></div></span></div>",
            "created":1381640400,
            "id":1678197,
            "title":"No"
        },
        "14122":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "female clothing",
                "male clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of clothing</span></div></span></div>",
            "created":1376542800,
            "id":1646779,
            "title":"clothing in a drawer"
        },
        "141221":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "bra/panties",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>bra/panties or something else</span></div></span></div>",
            "created":1376542800,
            "id":1646780,
            "title":"female clothing"
        },
        "1412211":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "bra",
                "panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>well pick one</span></div></span></div>",
            "created":1376542800,
            "id":1646782,
            "title":"bra/panties"
        },
        "14122112":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Ranma-Chan",
                "another girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For which Girl?</span></div></span></div>",
            "created":1484283600,
            "id":2262993,
            "title":"Panties"
        },
        "141221121":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Ranma chan",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Luckily Shampoo saw a mirror to see what she has become.<br>\r\n<br>\r\n\"Shampoo underwear?\" Shampoo said as she was shocked over her new appearance. Sadly she can't speak since she doesn't have a mouth.<br>\r\n<br>\r\n\"Shampoo are you there?\" A girl asked as she entered the room.<br>\r\n<br>\r\nWho did Shampoo see?</span></div></div>",
            "created":1501131600,
            "id":2360506,
            "title":"Ranma-Chan"
        },
        "1412211211":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Cat cafe ",
                "Amazon or something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm looks like Shampoo isn't here.\" Ranma said as she was looking around the room.<br>\r\n<br>\r\n\"Ranma chan here?\" Shampoo asked.<br>\r\n<br>\r\n\"Well I don't think Shampoo won't mind if I wear her clothes\" Ranma smiled as she taken off her clothes. When she was done she also went and undid her ponytail.<br>\r\n<br>\r\n\"First the underwear.\" Ranma said as she taken the Shampoo underwear on the ground and pulled them up.<br>\r\n<br>\r\n\"Ranma dressing up like me?\" Shampoo asked.<br>\r\n<br>\r\n\"Next the bra.\" Ranma said as she went over Shampoo's drawer and picked up a purple bra that matched the underwear. It taken her a minute to get the bra to fit her breasts.<br>\r\n<br>\r\n\"Not bad. Next is the outfit.\" Ranma said as she went over to Shampoo's closet to grab one of her uniforms.<br>\r\n<br>\r\nWhich one will Ranma dress up as?</span></div></div>",
            "created":1501131600,
            "id":2360562,
            "title":"Ranma the cosplayer"
        },
        "14122112111":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "A new reality emerges"
            ],
            "content":"<div class=\"\"><div> <span>Ranma picked Shampoo's cat cafe outfit from her closet<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.deviantart.com/art/Ranma-dressup-at-cat-cafe-with-Shampoo-657669382\" target=\"_blank\">http://www.deviantart.com/art/Ranma-dres...</a><br>\r\n<br>\r\n\"Now to get on my outfit so I can work.\" Ranma said as she slip on the red dress and since her breasts was the same size as Shampoo's, there was no issue.<br>\r\n<br>\r\nRanma then found the red high heels and as she put them on, they fit as if she wore them before.<br>\r\n<br>\r\n\"This feels just right.\" Ranma said as she looked into the mirror and did poses as if she was modeling.<br>\r\n<br>\r\nWhat Ranma didn't notice is that her body is starting to glow that came from Shampoo in her cursed form.<br>\r\n<br>\r\n\"What is happening to me. I have to fight it.\" Shampoo screamed.</span></div></div>",
            "created":1501822800,
            "id":2364774,
            "title":"Cat cafe "
        },
        "141221121111":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So would this reality have Ranma and Nodoka replace Shampoo and Cologne as the new amazons?<br>\r\n<br>\r\nOption 2: Ranma replaces Shampoo as the new Amazon which there is still a Ranma Satome</span></div></span></div>",
            "created":1501822800,
            "id":2364775,
            "title":"A new reality emerges"
        },
        "1412211211111":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Posing at the mirror",
                "Later on"
            ],
            "content":"<div class=\"\"><div> <span>A white light surrounded the whole reality as both Ranma and Nodoka merged with Shampoo and Cologne.<br>\r\n<br>\r\nWhen the light cleared back to normal, both Shampoo and Cologne looked a lot different.<br>\r\n<br>\r\nWith Shampoo, she gained bigger breasts, and athletic body and a bigger butt with her hair still purple but has midcoat of dark red. Her knowledge she was able to learn Japanese and English while still having her Chinese at birth. Best of all this Shampoo wasn't cursed.<br>\r\n<br>\r\nAs for Cologne, she was a lot younger and was at Nodoka's age with long white hair with brown highlights. Like with Shampoo, Cologne had bigger breasts and rear with an athletic build that showed where Shampoo got her traits from.<br>\r\n<br>\r\n\"Mother, why were you in my room?\" Shampoo said with a grin.<br>\r\n<br>\r\n\"I don't know daughter how about we pose at the mirror.\" Cologne said as they were both naked.<br>\r\n<br>\r\n\"Yeah!\" Shampoo said with a smile on her face.<br>\r\n<br>\r\nBackstory- Shampoo and Cologne are amazons that decided to leave their tribe on good terms and they moved to Nerima without any problems at all. During that time, they first develop feelings for  each other and became a couple which since nobody knew of their affairs that made it easier for them. Cologne soon had the idea of having a harem for both of them which her daughter agreed to.</span></div></div>",
            "created":1501822800,
            "id":2364805,
            "title":"Option 1"
        },
        "1412211211112":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Ranma replaces Shampoo as the new Amazon which there is still a Ranma Satome ",
                "something else in same reality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Since there was no option other then new reality, I'll put it here... Something else in same reality happens, or Ranma replaces Shampoo as the new Amazon which there is still a Ranma Satome<br>\r\n</span></div></span></div>",
            "created":1501822800,
            "id":2364783,
            "title":"New Reality?"
        },
        "14122112111121":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Cologne was younger ",
                "Cologne was at the same age"
            ],
            "content":"<div class=\"\"><div> <span>Previous writer, I was almost done with the chapter until you added your piece.<br>\r\n<br>\r\nThe reality was changed as the glow from the Shampoo's cursed form had caused her to merge with Ranma. As she was fading she was screaming that she would be forgotten.<br>\r\n<br>\r\n\"Shampoo, you won't disappear because we are becoming one person with the combined intelligence, fighting skills and memories. Hopefully we can be better in the next life together.\" Ranma said warmly.<br>\r\n<br>\r\nShampoo cried in happiness as Ranma was right and she embraced her friend as they both kissed.<br>\r\n<br>\r\nWhen the light returned to normal, the new Shampoo was looking at herself naked as she saw the improvements that she had still dark purple hair but with light red streaks. Her look was still the same but with bigger breasts and a huge butt.<br>\r\n<br>\r\n\"I'm loving these improvements, look out world here comes a newly improved Shampoo. But first let's test out something.\" Shampoo said as she went to the sink and splashed cold water on her face.<br>\r\n<br>\r\nShe looked in the mirror and was grinning that no changes at all. \"Yes, no curses at all.\" Shampoo said.<br>\r\n<br>\r\n\"Shampoo dear come over to my room.\" Cologne said as Shampoo hear her great grandmother's voice.<br>\r\n<br>\r\n\"Coming great grandmother.\" Shampoo said with a smile as she seductively walk over to her great grandmother's bedroom.</span></div></div>",
            "created":1501822800,
            "id":2364795,
            "title":"Ranma replaces Shampoo as the new Amazon which ..."
        },
        "141221121111211":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Cologne explains",
                "Later on"
            ],
            "content":"<div class=\"\"><div> <span>When Shampoo entered Cologne's bedroom she was in surprise as she saw her great grandmother was younger and at Shampoo's age. She had a slightly bigger breast size than Shampoo, a large ass and her hair color was purple but with a white streak in the middle.<br>\r\n<br>\r\n\"What you think of the new me great granddaughter or should I say little sister?\" Cologne said as she groped Shampoo's breasts.<br>\r\n<br>\r\nShampoo moaned over her now older sister's has hit her good spots.<br>\r\n<br>\r\n\"H-How did you look like this?\" Shampoo asked.</span></div></div>",
            "created":1507957200,
            "id":2401020,
            "title":"Cologne was younger "
        },
        "14122112112":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "Amazon",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1501131600,
            "id":2360563,
            "title":"Amazon or something else"
        },
        "1413":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "she's grown",
                "it's dark and she can't move",
                "she feels smaller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The smoke now completely covered Shampoo and she blacks out. When she comes to she realizes... </span></div></span></div>",
            "created":1376542800,
            "id":1646774,
            "title":"something else happens"
        },
        "15":{
            "author_id":"kritik",
            "author_name":"kritik",
            "choices":[
                "Nabiki",
                "Kasumi",
                "Nodoka",
                "Kodachi",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options.</span></div></span></div>",
            "created":1371186000,
            "id":1610732,
            "title":"Other"
        },
        "155":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Happosai takes a good look at Ranma from head to toe.",
                "Before he can react, Happosai throws water over Ranma.",
                "\"Lecherous pervert.\" Akane growled."
            ],
            "content":"<div class=\"\"><div> <span>Ranma had been working on his kata in the yard. With one eye kept on the sky, he didn't want to be caught out in a shower. It was just harder to concentrate in his female form.<br>\r\n<br>\r\nThe moves, just made -her- move more, and less athletically, more jiggly...<br>\r\n<br>\r\nHe shook his head and headed for the bathroom. He was tired and thirsty after the heat of the bath, and headed to the kitchen for something cooling to drink.<br>\r\n<br>\r\nHe spotted a carton of milk in the fridge, with a pink bow around, and 'Akane' written on a small tag hanging from the ribbon.<br>\r\n<br>\r\nThere wasn't anything else there. Kasumi was out doing the shopping, and they would soon have a fridge that needed some empty space. He would be doing them a favour, so he drank the whole carton and tossed the empty into the rubbish.<br>\r\n<br>\r\nHe went into the living room, and found Akane sitting there watching TV, there was a wide space and on the opposite side sat Happosai, ironing his 'frillies'.<br>\r\n<br>\r\nLooking out the window, he saw the first drops of rain as they fell.<br>\r\n<br>\r\nHe turned to Akane, there was a scowl on her face, and she glowered at the TV. Her eyes threating to burn through it and the wall behind, there was a palm print on Happosai's face too.<br>\r\n<br>\r\nRanma didn't want to add to the situation so, \"Akane, I've finished the milk... <i>your milk</i>. But Kasumi will be back with more soon.\"<br>\r\n<br>\r\nHowever, it was Happosai's head that whipped around to Ranma's words.</span></div></div>",
            "created":1410584400,
            "id":1856419,
            "title":"Ranma-kun finishes a training session."
        },
        "1552":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Ranma finds she can't change back.",
                "Happosai bounces off her bounteous chest.",
                "Akane takes it as an insult. \"Baka Ranma!\""
            ],
            "content":"<div class=\"\"><div> <span>Happosai's smirk was deeply worrying, and Ranma felt a dread growing in the pit of his stomach. Snatching a glass of water, Happosai threw it across the room. The water sailed free from the glass, as it left, Happosai's smile widening in anticipation.<br>\r\n<br>\r\nRanma leapt to his feet, preparing to avoid the large blob of water. He didn't want anyone glomming onto her bosom. But she just didn't have enough time. He did a backflip out the door, and watched as the water flew over his head.<br>\r\n<br>\r\nLanding in the garden, he turned to face his attacker, his tongue already out as an insult and a protest.<br>\r\n<br>\r\nBut he'd thrown two globs of water. The second hit Ranma before he even saw it coming. He felt the familiar shifting as his body became ... her body.<br>\r\n<br>\r\nThere was something off, and as she pulled her shoulders back what that was was very obvious.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://fap.to/images/full/52/586/586635175.jpg\" target=\"_blank\">http://fap.to/images/full/52/586/5866351...</a><br>\r\n<br>\r\nAkane turned away from the TV to complain about the commotion, soon her eyes boggled out at the sight of Ranma-chan standing in the garden. Happi was jumping up and down on the spot, clapping with delight.<br>\r\n<br>\r\n\"Jiggly goodness.\" he yelled, before diving towards Ranma.</span></div></div>",
            "created":1410670800,
            "id":1856679,
            "title":"Before he can react, Happosai throws water over..."
        },
        "15523":{
            "author_id":"chaosqueen",
            "author_name":"WWEAnime",
            "choices":[
                "Epilogue: Ranma & Akane now Goddess of Martial Arts",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Akane swings her mallet &amp; it goes through Ranma sending her every where, Happosai disappeared Akane was in shock &amp; Kasumi started picking up pieces of the Ranma Jello putting them in a bowl <br>\r\nafter which she then put on the counter with a note then went to contact Cologne while she was gone Genma &amp; his ever empty stomach took it, sprayed whip cream on it &amp; ate what he thought was Jello<br>\r\n<br>\r\nA little while later<br>\r\n\"Um Father, Auntie, Mr. Saotome did you know what happened to that bowl that was on the counter\"<br>\r\n<br>\r\n\"Sorry Kasumi, I was hungry so I ate it\" <br>\r\n<br>\r\n\"You ate it?\"<br>\r\n<br>\r\n\"Yes again sorry Kasumi\"<br>\r\n<br>\r\n\"No as sorry as your going to be, Panda boy\" he looked at he in confussion at the arrival of Cologne<br>\r\n<br>\r\n\"What she means is because you ignore my sign saying \"WARNING: DO NOT EAT, THIS IS RANMA\" Genma cut her off  with a snort as Nodoka &amp; Soun turned green  \"So you can make more for the boy\" <br>\r\n<br>\r\n\"You misunderstand that wasn't FOR Ranma it WAS Ranma\"<br>\r\n<br>\r\nGenma, Nodoka &amp; Soun turned white &amp; Genma started gagging trying to bring up his child to no avail while in Akane's room Akane who was feeling guilty for her hand in Ranma's death commit seppuku </span></div></div>",
            "created":1428642000,
            "id":1961869,
            "title":"Jello Ranma"
        }
    },
    "info":{
        "author_id":"kritik",
        "author_name":"kritik",
        "brief_description":"transform the ladies of the Ranma-verse, Ranma-chan can change also. Review and add for GP",
        "created":1371108120,
        "description":"<td align=\"left\" class=\"norm\">You can do what you want to the Ranma girls, HOWEVER there are exceptions:<br>\r\n<br>\r\nNo mind control, <br>\r\nMind altering is fine.<br>\r\nNo age reducing.<br>\r\nI will allow endings only if I think the story has gone far enough in that storyline. <br>\r\nIt has to be a good ending at least 1 paragraph long<br>\r\nOther then that go wild.<br>\r\n<br>\r\nGP for reviews and new chapters</td>",
        "id":1938249,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602064200,
        "modified":1602064200,
        "pretty_title":"Ranma Girls Transform"
    }
}