{
    "chapters":{
        "1":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "For Honor! For Glory! to Battle!",
                "Let's see what's going on in my favorite show/game"
            ],
            "content":"<div class=\"\"><div> <span>Well, Here we are, You stand at a crossroads, young viewer/writer. Where shall thou go? to your left, the Arena! many folks say its the pits. (haha)<br>\r\nand to your other left, the portals to everywhere ever!<br>\r\n<br>\r\nChoose wisely, My good friend</span></div></div>",
            "created":1362459600,
            "id":1544397,
            "title":"The Start of It All!"
        },
        "11":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Zekara, the Jobber",
                "Fighter no. 2",
                "Battle-Brawler no. 3",
                "Combatant no.4",
                "More Girls, More Sweat!"
            ],
            "content":"<div class=\"\"><div> <span>Ahh, the Illustrious Colosseum. The place where girls become women... Unless they lose, in which case they are degraded and humiliated. Are you a Valkyrie of stinky destruction, whose mighty ass and toes can fall hundreds? Or are you just a poor little girl, out of her league and never going to smell good again?    <br>\r\n<br>\r\nP.S. I did kinda plan for a \"No Men Allowed\" type deal, is that cool? PM me or someting if you disagree.)<br>\r\n<br>\r\nP.P.S I don't want thirty page battles because two authors can't decide who the winner is. Once you feel your girlie has had it, don't try to deus ex machina away from a loss. If you really feel the need to always win, I'm going to have my character be a Jobber a.k.a a perma-loser, so there you go.<br>\r\n<br>\r\nOne final note, after a match is over, and you are done humiliating your opponent in the forfeit, remember to leave two options: a rematch for those who want to go again, and a new challenger approaches incase anyone else wants a shot at you.</span></div></div>",
            "created":1362459600,
            "id":1544398,
            "title":"For Honor! For Glory! to Battle!"
        },
        "111":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "A Mysterious Woman Attacks Zekara!",
                "A smug, Athletic woman wants a good Training Dummy to Humiliate"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey guys, its me, Zekara! I stand roughly about 5'2 and am really cute and snugly for my size, nevertheless, that doen't really help me much in battle, but I'm sure I'll win one of these days! All my life i was laughed at because i'm short and not very well... um, busty, so to speak.A while back I was scouted by the guys running this tourney, and according to them, I'm their official Jobber! I don't Really know what that means, but the pay is good! I've never won a match.\"<br>\r\n<br>\r\nZekara's Official Bio:<br>\r\nHeight: 5'2<br>\r\nWeight: She refuses to tell us.<br>\r\nPersonality: Very fun and bubbly, a clumsy ditz.<br>\r\nAny powers? None we are aware of.<br>\r\nStinkiest part of body? Her Feet.<br>\r\n<br>\r\n(I don't really know what to put on these bios, so go nuts)<br>\r\n</span></div></div>",
            "created":1362459600,
            "id":1544406,
            "title":"Zekara, the Jobber"
        },
        "1111":{
            "choices":[
                "Ignore the stench and head to the ring.",
                "It's too bad, just run!",
                "Oh dear... she's already unconscious."
            ],
            "content":"<div class=\"\"><div> <span>As Zekara walks down the hall towards the ring, there's suddenly a puff of smoke up above her, and a horrible fart blasts down on her. The entire hall fills with the nightmarish stench, the paint peeling off the walls some as the moist and damp gas floods it. I drop down in my usual black silk ninja outfit. My mouth is covered, but the rest of my head and big blond pigtails are visible. \"That's just a sample of what's waiting for you in the ring.\" I pull down my pants and tauntingly smack my fat ass at her before disappearing again. This would not be a fun match. While a very plump little girl, I was undefeated and an absolute terror of the federation. Known for being as cruel as I was stinky.<br>\r\n<br>\r\nFuuko's Official Bio:<br>\r\nHeight: 4'3 <br>\r\nWeight: 189 lbs<br>\r\nPersonality: Quiet and somewhat arrogant when she does speak. Likes to soften the opponent up before a match, even if she's undefeated.<br>\r\nAny powers?: Unbelievable farts, surprising speed and agility, can appear and vanish in a puff of smoke<br>\r\nStinkiest part of body?: Her butt</span></div></div>",
            "created":1363582800,
            "id":1552860,
            "title":"A Mysterious Woman Attacks Zekara!"
        },
        "11112":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "That Fuuko suddenly appeared in front of her, ready for a gas attack!",
                "that the smelly ninja is still nowhere to be seen, unnerving the loser gal"
            ],
            "content":"<div class=\"\"><div> <span>Zekara wasn't always the brightest, or the best fighter, but she did usually know when she was in over her head. Her personal rule was never try to fight ninjas. (A family tradition)<br>\r\nso, she decided the strategic option was to take a personal sick day, and get the hell out of dodge. as she slowly backed off, she called out to her unseen foe<br>\r\n \"Oh, uhm, don't mind me, I'm just like, the janitor or something. I hear my cleaning in the other room, so I'll just go get that..\" she said, nearing the door, as she turned around the blundering girl actually ran face-first into the wall, tumbling back down the hallway and ending face first at the edge of the ring. slowly looking up, Zekara realized....</span></div></div>",
            "created":1363928400,
            "id":1555948,
            "title":"It's too bad, just run!"
        },
        "111122":{
            "choices":[
                "Get in the ring.",
                "Find an excuse."
            ],
            "content":"<div class=\"\"><div> <span>As Zekara looked up into the ring she saw... nothing. The ring was empty and the crowd was fairly quiet. Of course with how suddenly I appeared and vanished this isn't all that unusual, but the quiet combined with the empty ring, after Zekara's embarrassing fall, was fairly unnerving. It seems like she might have a chance to get away again, except now the entire audience had seen her. Either she had to go through with this, or she had to come up with a very good excuse fast.</span></div></div>",
            "created":1364706000,
            "id":1561358,
            "title":"that the smelly ninja is still nowhere to be se..."
        },
        "1111221":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "the ninja, still nowhere, drives Zekara even more crazy",
                "only a fool would pass up a chance at attacking this fool!"
            ],
            "content":"<div class=\"\"><div> <span>THe entire audience started laughing at the poor girl's clumsy confusion. This flustered the little jobber, and she angrily leapt into the ring. \"Hey Ninja girl!\" she shouted, hoping her new opponent would hear her \"What's wrong? too afraid to fight lil old me?\" She was trying to goad her enemy out, although small, and had no training, was fairly good in a fight.<br>\r\nHer arrogance ever swelling, she stuck out her nose \"here, I'll even give you one free sniff. Doubt it can be that bad\" she smugly shouted, trying to get the audience back on her side...</span></div></div>",
            "created":1365570000,
            "id":1569441,
            "title":"Get in the ring."
        },
        "1112":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "The battle begins... Diana starts off strong.",
                "The battle begins... suprisingly Zekara gets in the first blow!  ",
                "Raise the stakes... Permanent slavery for the loser!  "
            ],
            "content":"<div class=\"\"><div> <span>The first challenger presents herself.  <br>\r\n<br>\r\n\"I am a female body builder!  My name is Diana and I will crush this puny girl and then make her inhale my sweat!\"  <br>\r\n<br>\r\nDiana's Official Bio:<br>\r\n<br>\r\nHeight: 5'11<br>\r\nWeight: 225 (Pure Muscle)<br>\r\nPersonality: Cruel &amp; Arrogant<br>\r\nAny Powers?  Borderline Super Strength<br>\r\nStinkiest part of her body?  Her armpits - no deodorant and lots of sweat!  <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1362978000,
            "id":1548144,
            "title":"A smug, Athletic woman wants a good Training Du..."
        },
        "11121":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Diana wants to Humiliate Zekara more, and puts her in all sorts of smelly holds!",
                "Diana wants to make the jobber suffer, and starts brutally beating her!"
            ],
            "content":"<div class=\"\"><div> <span>Zekara was scared witless, this was probably the biggest girl she's ever seen in her life. And it was apparent Diana had already been working up a sweat doing who knows what else, but Zekara was a determined fighter (who never won) so she put on a brave face \"Ha. Oh wow, a bodybuilder. what are you gonna do, bench-press me?\" she scoffed.<br>\r\n Obviously the brainless jobber realized the mistake of insulting the towering amazon, and spent the next minute backpedaling away, until she finally ran smack dab into the back corner of the ring. looking up into Diana's eyes, you could tell she was nervous about what was coming up, and then, in a blink of an eye, BAM! a strong kick sent Zekara sprawling onto her back, groaning in pain as the Dominating Musclegirl leered over her, cracking her knuckles and smiling \"Gulp\" Zekara muttered to herself \"Today is gonna be a long day, huh?\"</span></div></div>",
            "created":1362978000,
            "id":1548274,
            "title":"The battle begins... Diana starts off strong."
        },
        "111211":{
            "author_id":"mariotoast",
            "author_name":"MarioToast",
            "choices":[
                "She's done. (Another fighter)",
                "Nope, now she's getting more disgusting. (Scat and vomit)"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh yeah\" Diana grinned and pulled Zekara to the middle of the ring. She then wrapped her arm around Zekara's head and out her in a headlock that forced the jobber's nose into Diana's armpit. Zekara couldn't believe the stench. She writhed and tried to escape the hold, but couldn't even make Diana budge. The amazon grinned as she tightened the hold, causing pain as well as humiliation.<br>\r\n<br>\r\nAfter a while, Diana finally let Zekara go. Her face was covered in armpit sweat, and she was crying. This wasn't the end however, as Diana put Zekara in a scissorhold that forced the weaker girl's face in her ass. Zekara tried to plead with Diana to let her go. \"Please...I give up...\" Her voice was muffled by the powerful ass in her face, and Diana took advantage of Zekara speaking to let loose an intense fart right into her mouth. This fart reignited Zekara's struggling, but she was helpless as Diana kept her in the headlock, farting right in her face.<br>\r\n<br>\r\nAfter a long while, Diana let Zekara out of the hold. She tried to crawl away, feeling disoriented and sick. Is Diana done with her? Or does she plan on tormenting the poor girl some more?</span></div></div>",
            "created":1443681240,
            "id":2042116,
            "title":"Diana wants to Humiliate Zekara more, and puts ..."
        },
        "112":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "Is it you?",
                "Maybe you?",
                "Come to Helga!"
            ],
            "content":"<div class=\"\"><div> <span>The roar of the crowd on her ears and a cloud of rotten, noxious BO swirling around her, the first fighter entered into the ring. Every step from her shook the entire arena and was followed with a big, fat fart that poisoned the air even further. Finally she entered, center stage and showed off her body, already glistening with sweat. Her name was Helga Blubberella  (Or at least her stage name was) and she was a two-ton, seven foot tall hippo girl dressed in nothing but a barely-there bikini and a ballerina's Tutu. <br>\r\n<br>\r\nDisplaying a mind-boggling amount of agility, she skipped toward the ring with a hop, skip and a JUMP that flung her fifteen feet into the air and straight into the center of the ring, where she landed with enough force to send a smelly shockwave into the bleachers that flung people out of their seats.<br>\r\n<br>\r\nShe threw her hands in the air in delight, while basking in her own armpit stink<br>\r\n<br>\r\n\"Hello everyone!\" She smiled broadly, \"I am very happy to be being here today for you!\"<br>\r\n<br>\r\nHelga didn't have the best grasp of the English language and had an accent as thick as her stink, but darn if she wasn't the happiest stinker she ever saw. She didn't even know she was torturing anyone when she cut the cheese in an elevator or belched in someone's face. She thought everyone loved a good stinking and was eager to vent some scents.<br>\r\n<br>\r\nResting her hands on her fatty hips, she tapped one tubby toe and waited for her foe</span></div></div>",
            "created":1365570000,
            "id":1569375,
            "title":"Taking all comers!"
        },
        "1121":{
            "author_id":"awesomeone1427",
            "author_name":"Bad Influence",
            "choices":[
                "Fight!"
            ],
            "content":"<div class=\"\"><div> <span>Down the ramp came me, Beth. Now while I had been a fighter before, I had never faught like this. Stink fighting? This could be new. I was human, and a female MMA fighter. I was 5'6, 145 pounds. I looked up and you and gulped. This was gonna be a challenge. <br>\r\n<br>\r\nI knew how bad my feet stunk, so I figured if I could get you down, then my feet would quickly put you down. At least that's what I had hoped. I gulped and got into the ring, hoping I could maybe get some sort of an edge on you somehow. </span></div></div>",
            "created":1366002000,
            "id":1572053,
            "title":"Beth the human.  "
        },
        "11211":{
            "author_id":"smotherher22",
            "author_name":"Smother her",
            "choices":[
                "Shoves beth in the crotch of her underwear.",
                "Gives Beth a Stinkface."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Beth charges at Helga, but runs into a large, rank foot. She gags and falls to the floor, trying not to throw up. Helga turns around and does a butt drop. Helga follows it up with what?</span></div></span></div>",
            "created":1419515580,
            "id":1907284,
            "title":"Fight!"
        },
        "113":{
            "author_id":"perin",
            "author_name":"Perin",
            "choices":[
                "Dare to face Perin?",
                "Challenge her!",
                "Can I do this?!"
            ],
            "content":"<div class=\"\"><div> <span>Perin's Official Bio:<br>\r\nHeight: 5'0<br>\r\nWeight: Unknown<br>\r\nPersonality: Shy, Quiet, Regal<br>\r\nAny powers?: Hurricane-like farts, enough shit to bury a city, and powerful butt muscles for effortless anal-vore.<br>\r\nStinkiest part of body?: My butt and everything that comes from it.<br>\r\n<br>\r\nA soft bamboo flute melody played as I walked down the entry way into the ring. I was delicate and regal, a modern day princess in every way. My hair reached to the small of my back and was a soft medium brown, and my skin was icy pale, almost unnaturally so. Equally icy were my gentle blue eyes. The only color on my face was a soft pinkish blush as I walked towards the ring. I did not seem overtly shy at the moment, but always had this bit of pinkness in front of a crowd.<br>\r\n<br>\r\nEntering the ring, I slipped out of my sky blue kimono and now stood only in a similar blue silk top which gave good coverage to my fairly average breasts. On my wide perfect hips were custom panties which kept my crotch well covered, while leaving my ass completely bare. A little embarrassing, especially for one as shy as me, but it made my fighting style far easier.<br>\r\n<br>\r\nIt was the first match since I had taken a small vacation, and so the crowd was very eager to see what would happen after my hiatus. As of yet, I had effortlessly destroyed every girl who had dared challenge my legendary butt, and become a household name for my unstoppable rear. Would I finally find a worthy opponent this time, or simply add another mark to my record. I realized I needed to say something, and walked to the center of the ring.<br>\r\n<br>\r\n\"Um, thank you all for coming. I had a wonderful vacation and I'm very glad to be back here with all of you. I'm very much looking forward to meeting my next opponent. Uh, I hope she won't mind that I... failed to relieve myself this morning. I'm afraid my behind is very... packed at the moment.\"<br>\r\n<br>\r\nThe crowd cheered at this, my opponent was in for the fight of their life...</span></div></div>",
            "created":1394686800,
            "id":1759832,
            "title":"The shy, regal, champion"
        },
        "1131":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "You back off",
                "You get the first shot"
            ],
            "content":"<div class=\"\"><div> <span>Rai Official Bio:<br>\r\n Height: 5'0<br>\r\n Weight: Unknown<br>\r\n Personality: Overconfident, Vain<br>\r\nAny powers?: none<br>\r\n Stinkiest part of body?: My feet<br>\r\n<br>\r\nRai entered the ring wearing bright red panties that custom fit my body and matching top covering my bigger the average breasts. as I walk down to the ring I laugh at you. \"You re my opponent don't make me laugh you will be no challenge\" she said.<br>\r\n<br>\r\nTurning to the crowed 'you want to see me kick her butt to the curb\" she asked the crowed which cheered as I look at you with a smirk. \"so you want to quite now\" I taunted. </span></div></div>",
            "created":1424898840,
            "id":1940026,
            "title":"Dare to face Perin?"
        },
        "114":{
            "author_id":"hydranoid2009",
            "author_name":"hydranoid2009",
            "choices":[
                "yes!",
                "maybe...",
                "I'm screwed...."
            ],
            "content":"<div class=\"\"><div> <span>name: Harleen<br>\r\npersonality: dominant, loves her stink, protective of those she likes<br>\r\npowers: Powerful and smelly farts, can shrink people, super strength, grow a total of four arms, can both vore, and anal vore. She can also control her flatulence, letting it become a smokescreen, or even a butt flamethrower<br>\r\nweakness's: has 2 personalities, and has to flip a coin to decide between choices. Snatching the coin mid flip will cause her to be dazed in confusion. She also hates loud noises<br>\r\nhere is a picture of her: <a rel=\"nofollow\" href=\"http://hydranoid2009.deviantart.com/art/Harleen-405411282\" target=\"_blank\">http://hydranoid2009.deviantart.com/art/...</a><br>\r\n<br>\r\n\"What do you mean gun's aren't allowed?!\" Harleen shouted as she grabbed the inspector and shrunk him down. The inspector screamed as Harleen tossed him into her mouth and swallowed him. Feeling satisfied with the inspector having to endure her smelly innards, Harleen left her guns at the storage area, and hopped into the ring. Are you willing to go up against her?</span></div></div>",
            "created":1402117200,
            "id":1808552,
            "title":"Combatant no.4"
        },
        "1142":{
            "author_id":"fenrir16",
            "author_name":"Carnivore",
            "choices":[
                "I accept the challenge!",
                "You're too weak for me."
            ],
            "content":"<div class=\"\"><div> <span>Name: Sherry Kawcross<br>\r\nSpecies: Human<br>\r\nWeight: 132 pounds.<br>\r\nHeight: 5'10<br>\r\n<br>\r\nThis fighter has an emphasis on ranged attacks, using stinky belches and farts to fill space between her and her opponents, and even projectile peeing to take them down! However, her body itself isn't very stinky, and her nose is very sensitive, and her body ain't very strong, so she's easily overpowered.<br>\r\n<br>\r\nWill you fight THIS girl?</span></div></div>",
            "created":1456285860,
            "id":2108759,
            "title":"maybe..."
        },
        "115":{
            "author_id":"redtack2009",
            "author_name":"7pin",
            "choices":[
                "wrestler 5",
                "wrestler 6",
                "even more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>None of those challengers tickle your fancy?  Here's some more!</span></div></span></div>",
            "created":1424511780,
            "id":1937784,
            "title":"More Girls, More Sweat!"
        },
        "1151":{
            "author_id":"redtack2009",
            "author_name":"7pin",
            "choices":[
                "fight me!",
                "bring it on!",
                "Amanda the underdog"
            ],
            "content":"<div class=\"\"><div> <span>Name: Amanda<br>\r\nSpecies: human<br>\r\nWeight: 110 lbs<br>\r\nHight: 5 ft 4<br>\r\nStink stats: Amanda was a late joiner to the tournament not having really read up on it she is expecting to be doing normal wrestling against people her own weight. It was only after she gets into the arena ( where she can't leave) that she discovers just what she has gotten herself into. However after a while her feet and pits naturally begin to smell a little.<br>\r\nSpecial abilities: being an actual wrestler Amanda is naturally lithe and swift. However she has little in the way of stink resistance so she's liable to become helpless rather quicky if assaulted.</span></div></div>",
            "created":1424512380,
            "id":1937786,
            "title":"wrestler 5"
        },
        "12":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Anime",
                "Video Games",
                "Western Animation",
                "Live Action TV",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, here it is. The Beginning (hopefully) of a long and expansive list of choices, which will hopefully lead to your ultimate girl on girl sweaty stinky torturing! Good luck, and Bon Voyage!</span></div></span></div>",
            "created":1362459600,
            "id":1544410,
            "title":"Let's see what's going on in my favorit..."
        },
        "121":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Soul Eater",
                "Lucky Star",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, here we go! what do you wanna see first?</span></div></span></div>",
            "created":1362459600,
            "id":1544411,
            "title":"Anime"
        },
        "1211":{
            "author_id":"432true",
            "author_name":"Amazing",
            "choices":[
                "Armpits",
                "Armpits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Guys smelling guys armpits</span></div></span></div>",
            "created":1457653440,
            "id":2115667,
            "title":"Soul Eater"
        },
        "1213":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Naruto ",
                "Bleach ",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lots of other options!  </span></div></span></div>",
            "created":1387861200,
            "id":1713017,
            "title":"Other"
        },
        "12133":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes ",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about hellsing</span></div></span></div>",
            "created":1413435600,
            "id":1872721,
            "title":"More options "
        },
        "121331":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "HEY, Police girl!",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>alright, who will we focus on to begin with? perhaaaaaps…</span></div></span></div>",
            "created":1473362100,
            "id":2207677,
            "title":"yes "
        },
        "121332":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> love hina</span></div></span></div>",
            "created":1413435600,
            "id":1872724,
            "title":"no"
        },
        "1213322":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>to love ru</span></div></span></div>",
            "created":1413435600,
            "id":1872725,
            "title":"no"
        },
        "12133222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sailor moon</span></div></span></div>",
            "created":1413435600,
            "id":1872727,
            "title":"no"
        },
        "121332222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>tenchi muyo</span></div></span></div>",
            "created":1413435600,
            "id":1872730,
            "title":"no"
        },
        "1213322222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>happy lesson </span></div></span></div>",
            "created":1413435600,
            "id":1872731,
            "title":"no"
        },
        "12133222222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>dragon ball</span></div></span></div>",
            "created":1413435600,
            "id":1872733,
            "title":"no"
        },
        "121332222221":{
            "author_id":"rainbowriderv",
            "author_name":"rainbowriderv",
            "choices":[
                "Chi-Chi",
                "Bulma",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character?</span></div></span></div>",
            "created":1521855360,
            "id":2468567,
            "title":"yes"
        },
        "121332222222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>girls brovo</span></div></span></div>",
            "created":1413435600,
            "id":1872735,
            "title":"no"
        },
        "122":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Capcom",
                "Nintendo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Press Start! <br>\r\nBut seriously, where do you want to go?</span></div></span></div>",
            "created":1362459600,
            "id":1544414,
            "title":"Video Games"
        },
        "1221":{
            "author_id":"perin",
            "author_name":"Perin",
            "choices":[
                "Mega Man",
                "Street Fighter",
                "Other Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No shortage of choices in this category, but what series to begin with?</span></div></span></div>",
            "created":1394686800,
            "id":1759814,
            "title":"Capcom Choices"
        },
        "12211":{
            "author_id":"perin",
            "author_name":"Perin",
            "choices":[
                "Roll",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's only right that Rock's sister be the first choice.</span></div></span></div>",
            "created":1394686800,
            "id":1759815,
            "title":"Roll?"
        },
        "122111":{
            "author_id":"perin",
            "author_name":"Perin",
            "choices":[
                "Classic Roll",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Not that there aren't several versions to choose from of Roll as well. Right off the bat, what about the classic?</span></div></span></div>",
            "created":1394686800,
            "id":1759816,
            "title":"Which Roll"
        },
        "12213":{
            "author_id":"rickmick52",
            "author_name":"Castle",
            "choices":[
                "witch one",
                "or more ladys of resident evil"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the lady's of resident evil <br>\r\n<br>\r\n 1. Jill Valentine<br>\r\n<br>\r\n2. Ada Wong<br>\r\n<br>\r\n3. Claire Redfield</span></div></span></div>",
            "created":1454091120,
            "id":2096124,
            "title":"the ladys ofresident evil"
        },
        "1222":{
            "choices":[
                "Mario",
                "Pokemon",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well there are a whole lot to choose from here. Let's start with two of the big ones.</span></div></span></div>",
            "created":1363928400,
            "id":1555610,
            "title":"Nintendo"
        },
        "12221":{
            "choices":[
                "Wendy O. Koopa",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well if we're doing the Mario series, then there's only one place to start. That's right, the famous pink-wearing princess herself... Wendy! Yeah, I know I've used this joke before.</span></div></span></div>",
            "created":1363928400,
            "id":1555612,
            "title":"Mario"
        },
        "122211":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "Fight Classic Wendy",
                "Fight Super Wendy"
            ],
            "content":"<div class=\"\"><div> <span>Coming off her many, many, MANY filthy wins in other tournaments and leaving half-dead, stinking foes and a rotten odor in her wake, the infamous Wendy O. Koopa was back for another series of crushing, stinking victories. She was here to humiliate any girl who thought they could smell anywhere near as rotten as her. She was gonna shove their nose up her butt and pump them full of farts until they popped like a smelly balloon, she was gonna put their face in her armpit until they never smelled anything else again, she was gonna scrub their mouths with her cheesy feet and make them swallow a pound of toejam, she was gonna make them into her personal stink-slave.<br>\r\n<br>\r\nThere was no question that she was here to rock and she wasn't going to let even the strongest stinkers have an easy time against her. For this tournament, however, she WILL be toned down to be slightly beatable, but for the most part she's gonna dominate. Even if someone pulls out a win, it won't be until after they've survived atom bomb farts and smelled the armpits of death.<br>\r\n<br>\r\nAlso for this tournament, we'll be offering two types of Wendy to fight. The first is the classic Wendy that appears in Mario games, only much smellier. She'll be using her agility and some magic to aid her stinky combat abilities. The other Wendy is the \"Infamous\" Wendy from stories like \"You Vs. Who?\", \"Wendy's Gross Domination\" and others. She's big, fat and ruthless, even tougher than Classic Wendy.<br>\r\n<br>\r\nTo recap:<br>\r\n<br>\r\n<u>STATS</u><br>\r\n\"Classic Wendy\"<br>\r\nHeight:4'6\"<br>\r\nWeight: 150 Lbs (Chubby, but that's also counting her shell)<br>\r\nStinks: AWFUL (Feet, butt, farts, armpits, belches and scat)<br>\r\nPhysical Strength: High<br>\r\nAgility: High<br>\r\nPersonality: Bratty and rude.<br>\r\nSpecials: Has transformation magic she can use on her foe to temporarily turn them into things like clothes or a toilet<br>\r\n<br>\r\n\"Super Wendy\"<br>\r\nHeight: 6'5\"<br>\r\nWeight: 600 lbs<br>\r\nStinks: DEADLY (Feet, butt, farts, armpits, belches and scat)<br>\r\nPhysical Strength: Superhuman<br>\r\nAgility: Good (Not as fast as Classic, but fast for a fatty)<br>\r\nPersonality: Queenly, Dominating and Nasty.<br>\r\nSpecials: Doesn't use her wand like Classic Wendy, but has much stronger stinks. Also can vore foes easier because of her size.</span></div></div>",
            "created":1365570000,
            "id":1569380,
            "title":"Nobody Stinks Like Wendy!"
        },
        "122212":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Yes.",
                "No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the tomboy Daisy?</span></div></span></div>",
            "created":1365483600,
            "id":1569042,
            "title":"Next"
        },
        "1222121":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Daisy answers the door",
                "Daisy ignores the door"
            ],
            "content":"<div class=\"\"><div> <span>\"Phew.\" Daisy exhales loudly as she bursts into her room in the Mushroom Kingdom Castle. She tosses her racket down, exhausted from a long session of tennis doubles with Mario, Luigi, and Peach. She quickly unbuttons the uncomfortable tight shorts she is wearing, and pushes them to the ground. Daisy plops down onto her bed, spreading her limbs out wide, feeling hot and sweaty. Daisy sticks her nose into her armpit, and inhales deeply - soaking in her own odour. <br>\r\n<br>\r\nDaisy feels her slick crotch tingle - and begin to become even more slick. She turns over and pulls a pillow underneath herself, as she breathes deeply. She vigorously rides the pillow, making her gasp. She picks up speed as she feels herself about to plunge over the edge when:<br>\r\n <br>\r\n<i>Knock knock knock</i><br>\r\n<br>\r\n\"Daisy. Can I come in?\" Comes Peach's voice. </span></div></div>",
            "created":1400994000,
            "id":1801872,
            "title":"Yes."
        },
        "1223":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Blizzard",
                "Nope. Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps a story in one of the many worlds of Blizzard?</span></div></span></div>",
            "created":1401080400,
            "id":1802822,
            "title":"Other"
        },
        "12231":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Blood and honour!",
                "Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But which world tickles your fancy? The world of Warcraft perhaps?</span></div></span></div>",
            "created":1401080400,
            "id":1802824,
            "title":"Blizzard"
        },
        "122311":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Lok'tar Ogar! [Horde]",
                "For the Alliance! [Alliance]"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of the two factions most impresses you? The noble, dignified Alliance? Or the strong, honourable Horde?</span></div></span></div>",
            "created":1401080400,
            "id":1802828,
            "title":"Blood and honour!"
        },
        "1223112":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Human",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps you have a personal preference in a particular race of the noble Alliance. </span></div></span></div>",
            "created":1402030800,
            "id":1808336,
            "title":"For the Alliance! [Alliance]"
        },
        "12231122":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Night elf",
                "Dranei",
                "Continue…"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps one of the other five?</span></div></span></div>",
            "created":1406869200,
            "id":1836348,
            "title":"Keep going"
        },
        "122311223":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Dwarf",
                "Gnome",
                "Keep going dammit…"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one of the shorter two races?</span></div></span></div>",
            "created":1406869200,
            "id":1836349,
            "title":"Continue…"
        },
        "1223112233":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Pandaren",
                "Races added post-2014"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or do you prefer the fluffier Pandaren. <br>\r\n<br>\r\nOr a race previously unkown?</span></div></span></div>",
            "created":1406869200,
            "id":1836350,
            "title":"Keep going dammit…"
        },
        "123":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Disney Shows and Movies",
                "Cartoon Network Shows",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Get ready to see those wavy green stink lines! here comes the cartoons!</span></div></span></div>",
            "created":1362459600,
            "id":1544418,
            "title":"Western Animation"
        },
        "1231":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Mulan",
                "Jane {Wendy's daughter who is tomboyish}",
                "Other choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, since the classic Disney stuff won't cut it, we can skip the likes of Snow White, Cinderella, and the like.<br>\r\nHow about this?</span></div></span></div>",
            "created":1365483600,
            "id":1569050,
            "title":"Disney Shows and Movies"
        },
        "12311":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Mulan goes to \"confront\" all three princesses at once",
                "Mulan attempts to catch one princess at a time"
            ],
            "content":"<div class=\"\"><div> <span>          \"Kee-yah!\" Mulan shouts as she smashes her punching-dummy. \"I can't belive those bitches would do this to me!\" She snarls as she smashes the dummy again. <br>\r\n<br>\r\nMulan had been tasked with keeping those three princesses, the ones she kept alive once, alive until the husbands of the four returned from the call of duty - a call Mulan apparently couldn't answer, throwing her into a fury. To make matters worse, the three princesses weren't making her job very enjoyable:<br>\r\n<br>\r\nMei, Su, and Ting-ting had thought it would be humourous to steal Mulan's clothes whilst she bathed, then forced her to chase her through - what they had planned to be empty - a field. The field, as it turned out, was being used for a large family reunion. Mulan had the misfortune of running through it stark-naked. <br>\r\n<br>\r\nNeedless to say: she was not impressed. <br>\r\n<br>\r\n\"Those bitches are going to pay!\" Mulan grunts as she spins on her foot, sending ger foot toward her dummy, resulting in a large: <i>Crack</i>! as it's wooden frame shattered. <br>\r\n<br>\r\nMulan wipes her sweat-drenched brow with her bare forearm, releasing the stench of her underarm to her nostrils. \"Whew! And I think I now how they're going to…\" she says with a devilish grin. </span></div></div>",
            "created":1396760400,
            "id":1774465,
            "title":"Mulan"
        },
        "123112":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Ting-ting's home",
                "Su or May's home"
            ],
            "content":"<div class=\"\"><div> <span>Mulan walks away from her broken training-dummy, her skin slick with sweat, toward the direction of princesses homes. <br>\r\n<br>\r\nThe three women each have very large homes, their husbands had been rewarded with great wealth after helping China in the way they did. Mulan walks to the end of a road that splits off in three directions. It is quite late, so each of the princesses is likely at her own home preparing for bed. <br>\r\n<br>\r\nShe turns down the street to:</span></div></div>",
            "created":1396933200,
            "id":1775513,
            "title":"Mulan attempts to catch one princess at a time"
        },
        "1231122":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Su's home",
                "Mai's home"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>((Limit of two options in last chapter))</span></div></span></div>",
            "created":1396933200,
            "id":1775514,
            "title":"Su or May's home"
        },
        "12311222":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Mai wakes up and panics",
                "Mulan drops on top of Mai, waking her"
            ],
            "content":"<div class=\"\"><div> <span>Mulan turns down the street to Mai's, and after about five minutes of walking, arrives at her doorstep. Mulan smirks at the barred door, such pathetic locks cannot keep a soldier such as her out. Mulan quickly and quietly lifts the bar holding the door closed, and slips inside. <br>\r\n<br>\r\nIt is dark inside, smoke billows out of recently-extinguished candles; Mai recently went to bed. Mulan slinks into Mai's room to find her peacefully sleeping, \"Heh. That's going to change.\" She mutters under her breath. <br>\r\n<br>\r\nMulan slides her shirt off of her, now dry, chest. Allowing her breasts to be kissed by a cool breeze from Mai's open window. Her pants quickly follow into a pile on the floor as she climbs onto Mai's bed, holding her anus about a half-foot about Mai's nose. Waiting a moment before dropping her smelling hole onto Mai. </span></div></div>",
            "created":1396933200,
            "id":1775529,
            "title":" Mai's home"
        },
        "12313":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Okay.",
                "No,let it go."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Frozen?</span></div></span></div>",
            "created":1409806800,
            "id":1852558,
            "title":"Other choices."
        },
        "1232":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Adventure Time?",
                "Regular Show?",
                "Another Choice?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you came for cartoons, eh? well, what better place than the Cartoon Network! So, Hows about it champ? what's your pick?</span></div></span></div>",
            "created":1362546000,
            "id":1545205,
            "title":"Cartoon Network Shows"
        },
        "12321":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Do You want one of the many, many princesses?",
                "Or Some other lady?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Welcome to the wonderful land of Ooo, filled with all sorts of odd and magical girls who are just waiting to get some unlucky person (maybe even you!) to lick their feet. lets jump right in, shall we?</span></div></span></div>",
            "created":1363064400,
            "id":1548620,
            "title":"Adventure Time?"
        },
        "123211":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "Princess Bubblegum makes herself stink too, with SCIENCE!",
                "Bubblegum finds someone else to fight Marceline in a stink-off"
            ],
            "content":"<div class=\"\"><div> <span>Princess Bubblegum awoke on what she thought was an average day to find that she had an unusual amount of pressure on her chest. She tried to move but couldn't get up, roll over or even move her arms. At first she wasn't too worried, but that was from being half-awake. When the realization hit her, she freaked out and tried to get up, only to find that she was still stuck. Her eyes snapped open and she saw that her vision was completely obscured by... denim?<br>\r\n<br>\r\n\"Wakey Wakey Bubbles!\"<br>\r\n<br>\r\nBubblegum recognized that voice, \"Marceline?\"<br>\r\n<br>\r\nThe Vampire Queen answered not with her voice, but with her butt. FRRRRRPPPT blew out from the crack of her denim jeans and poured into Bubblegum's face, assaulting her with the stink of rotten eggs and decaying fish. Unfortunately for PB, her mouth was open and she got her tongue coated in vampire farts. She choked, coughed and sputtered while Marceline laughed. She jumped off her friend and hovered a few feet above her bed, laughing like a madwoman.<br>\r\n<br>\r\n\"What the hell Marceline?\" PB held her throat while she tried to get the awful taste off her tongue.<br>\r\n<br>\r\n\"Wasn't that super raunchy?\" Marcy said, smiling like a goof.<br>\r\n<br>\r\n\"Yes! Awful!\" <br>\r\n<br>\r\n\"It's so cool!\" Marceline said, \"I got cursed by a bog witch last night for playing my Bass too loud while she was sleeping. She gave me the Hex of Horrible Odors, my BO, farts and belches can kill small animals now! Here, smell my armpits!\"<br>\r\n<br>\r\nPB tried to yell \"no!\" but Marceline was too fast for her, she got a face (and mouth!) full of salty stenchy vampire sweat. She gagged and tried to struggle free but the smell sapped her strength. She could only lay there until Marceline decided that she had tortured her enough.<br>\r\n<br>\r\n\"Yeah, it's super cool\" she said, still amazed by her stench, \"She said that until I was defeated by someone smellier than me, my odor would have no end! And after smelling myself for a while I'm pretty sure that NOBODY can stink worse than me. Like, get a whiff of THIS.\"<br>\r\n<br>\r\nMarceline went to pull off one of her boots, and PB cried out in terror but it was too late. The boot came off with a sickening <i>\"Squealch!\"</i> and her disgusting, dripping foot coated the entire room in the smell of cheesy cornchips. PB was so repulsed that she jumped out of her bed and vomited out the window.<br>\r\n<br>\r\n\"Jeez PB, quit being a baby. It's just a foot smell\" Marceline snickered<br>\r\n<br>\r\n\"Go AWAY!\" PB shouted, \"Before I choke to death on your stink!\"<br>\r\n<br>\r\n\"Well if it's so bad why don't you cure me, huh? Find someone to stink worse than me and it'll stop.\"<br>\r\n<br>\r\n\"Hmmm...\"</span></div></div>",
            "created":1365570000,
            "id":1569387,
            "title":"Marceline's Stenchy Surprise"
        },
        "1232111":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "Princess Bubblegum goes and fights Marceline with her stench!",
                "Princess Bubblegum is addicted to being smelly, she joins Marcy in torturing"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey you gotta check out these skidmarks on my-\" Marceline was just pulling down her pants to show Bubblegum glob-knows-what, but PB was already running for her life (and her nose). Marcy tried to follow, but PB had disappeared into the many corridors and hallways of her castle. She COULD chase, but if there was anything Marceline was, it was lazy. Instead of following, she sat down on Bubblegum's pillow, pulled her bass out of nowhere and started playing and farting up a storm while she waited for the princess to return.<br>\r\n<br>\r\nPB had run all the way into her lab and locked the door behind her. If there was any way she was going to out-stink Marceline, then she had to do it with science! In a far off corner of her secret sanctum of scientific study, Bubblegum had kept a machine she called the \"Befouler\". It was a machine that she had accidentally created while working on a teleporter; instead of teleporting folks it instead made them incredibly noxious, smelly and foul. On top of that, it made them CONTAGIOUS, so that anything a \"befouled\" object came in contact with became horrendously smelly. She almost never used it unless she wanted to make some fancy cheese, but this was the perfect opportunity to do some good with it.<br>\r\n<br>\r\nPrincess Bubblegum had already devised a plan:  she used a tiny squeegee to get some sweat out of her armpit and feet from the run and placed it in a jar. She the hocked a loogie in a second small jar. Then, and finally, she put another jar over her butt and cut a petite fart that, while smelly, was nothing compared to Marceline's. PB placed the jars in the the Befouler Machine's glass chamber and switched it on. In a flash of green light and the sound of a broken tuba. When the light was gone, the jars of sweat, spit and fart were now filled with a greasy slime, a yellowish green liquid and a foggy gas, respectively.<br>\r\n<br>\r\nHolding her breath, Bubblegum slathered the sweat grease all over her body. In response, her gum body turned a muddy brown and began to stink horribly. She then guzzled the entire Jar of nasty spit, dying her tongue green and giving her belches and breath that could peel paint. And las but not least, Bubblegum took a syringe and punctured the gas jar with it, filling it up with that deadly stink, she injected it straight into her butt and her butt swelled in reponse.<br>\r\n<br>\r\n\"Now let's see...\" PB pointed her butt at a Princess Plant on the other side of the room and farted at it. The force of the fart knocked the plant off the table while the stink of it made the thing wither and die before dissolving into a green mist. <br>\r\n<br>\r\nBubblegum was ready.</span></div></div>",
            "created":1367557200,
            "id":1583713,
            "title":"The Stench of Science!"
        },
        "12323":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Ed Edd n Eddy maybe?",
                "Others?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>perhaps a story from the Cul-de-sac will work, or something else.</span></div></span></div>",
            "created":1449105060,
            "id":2069329,
            "title":"Another Choice?"
        },
        "1233":{
            "author_id":"gmanataolcom",
            "author_name":"GDog",
            "choices":[
                "Yes",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the characters from Family Guy?</span></div></span></div>",
            "created":1365310800,
            "id":1567367,
            "title":"Family Guy?"
        },
        "12331":{
            "author_id":"gmanataolcom",
            "author_name":"GDog",
            "choices":[
                "Brian Griffin",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are your  options<br>\r\n</span></div></span></div>",
            "created":1365570000,
            "id":1569472,
            "title":"Yes"
        },
        "123312":{
            "author_id":"gmanataolcom",
            "author_name":"GDog",
            "choices":[
                "Stewie Griffin",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options for Family Guy:</span></div></span></div>",
            "created":1365570000,
            "id":1569473,
            "title":"More"
        },
        "1233122":{
            "author_id":"gmanataolcom",
            "author_name":"GDog",
            "choices":[
                "Peter Griffin",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more options!</span></div></span></div>",
            "created":1365570000,
            "id":1569475,
            "title":"More"
        },
        "12331222":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Okay.",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Lois?</span></div></span></div>",
            "created":1408078800,
            "id":1842028,
            "title":"More"
        },
        "12332":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "sure.",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Avatar, the last Airbender?</span></div></span></div>",
            "created":1408078800,
            "id":1842027,
            "title":"No thanks"
        },
        "123321":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "yes!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, shall we start with Toph?</span></div></span></div>",
            "created":1408078800,
            "id":1842032,
            "title":"sure."
        },
        "1233212":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "yes!",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Katara?</span></div></span></div>",
            "created":1490262240,
            "id":2293861,
            "title":"No."
        },
        "12332122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Yeah!",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps Azula?</span></div></span></div>",
            "created":1521894000,
            "id":2468801,
            "title":"Nah"
        },
        "123322":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "yes",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the sequel, Legend of Korra?</span></div></span></div>",
            "created":1485228960,
            "id":2268333,
            "title":"Nah"
        },
        "1233221":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Awesome!",
                "No, too obvious"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, Shall we start with Avatar Korra?</span></div></span></div>",
            "created":1490262360,
            "id":2293862,
            "title":"yes"
        },
        "124":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "iCarly",
                "Victorious",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cue Theme Song!<br>\r\n<br>\r\nWhich one of these irl ladies is gonna get stinky?</span></div></span></div>",
            "created":1362459600,
            "id":1544416,
            "title":"Live Action TV"
        },
        "1241":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Make Carly lick her pits clean - \"as a joke\"",
                "Make Carly smell \"another area\"",
                "Something else, perhaps?"
            ],
            "content":"<div class=\"\"><div> <span>\"Carl-ay! Why is it so hot in here?\" Sam. Yells to Carly from the couch of Carly's appartment. <br>\r\n\"The AC just cut out! You'll have to live with it!\" Carly shouts back from her room on the second floor of the appartment. <br>\r\n\"Ugh. It's so damn hot in here.\" Sam whines:<br>\r\n\"Conplaining won'r help it, Sam. Here, I'll get us some lemona-. Pew! What died in here?\" Carly exclaims as she enters the living room. <br>\r\n\"Oh, sorry about that. The summer heat makes me a bit unenjoyable to be around.\" Sam says through a sly grin as she spreads across the couch. Her legs spread apart, and her arms on the top. <br>\r\n<br>\r\n\"Ew! Ever tried deodorant?\" Carly asks sarcastically as she walks to the kitchen and returns with two glasses of lemonade. She sits down under one of Sam's outstretched arms, and places the glasses on the coffee table. <br>\r\n\"Would you mind lowerin' your arm? I can smell things I've never wanted to!\" <br>\r\n\"Oh, you know you like it.\" Sam says slighly with a gleem in her eye - which Carly catches.<br>\r\n\"Sam -No!\" But her plea comes too late as Sam grabs her by the neck, and slides Carly into a headlock - with her face centimetres away from Sam's damp armpit. <br>\r\n\"Smell the love.\" Sam whispers with a giggle. <br>\r\n\"Oh gosh. Get off of me!\" Carly begs as she tries to claw her way out of Sam's grip. <br>\r\n\"Ooh. I wonder if you're stinky too.\" Sam coos as she lifts Carly's arm up and shoves her nose into it. <br>\r\n\"Sam. What the hell are you doi-\"<br>\r\n\"Oh. Deoderant. Like the precious princess you are.\" Sam mutters with disapointment. <br>\r\n<br>\r\nThen, Sam got an idea. A wonderful - awful, idea. </span></div></div>",
            "created":1397019600,
            "id":1776187,
            "title":"The AC is out!"
        },
        "12411":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "\"It's only fair that I get to feel good too!\"",
                "\"Get out of my house, you creep!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Ew, Sam. You're gross. Let me go.\" Carly begs. <br>\r\n\"Hmm. Sure, but first - you have to lick my pits clean.\" Sam says smugly. <br>\r\n\"What? You're crazy! I'm not licking your pits!\" Carly yells back. <br>\r\n<br>\r\n\"Okay.\" Sam says with a chuckle, as she tightens her grip on Carly's head. Pulling her friend's lips onto her moist skin. <br>\r\n\"Gro-th!\" Carly exclaims, unable to fully move her moth against Sam's skin. <br>\r\n\"You can make it stop.\" Sams says as she settles down on the couch. <br>\r\n<br>\r\n\"Ugh,\" Carly groans, \"fine.\" She says quietly. A few moments of silence pass before Sam feels Carly's small tongue, slowly gliding across her armpit. She feels a tingle in her crotch, and begins to rub herself gently. A small wet patch forms on the cloth of her shorts. <br>\r\n<br>\r\nCarly, on the other hand, is not enjoying this experience so much. \"Thith ith tho groth.\" She mumbles quietly, as she feels Sam moan quietly and the grip on Carly's neck tightens ever so slightly. <br>\r\n\"What is doing up there?\" Carly wonders, \"Ew\" she whines involuntarily as she feels Sams sweat bead up on her upper lip. Sam's armpit is absolutily disgusting. She probably hasn't showered in days, and obviously <i>doesn't</i> wear deodorant, by the abscence of a chemically taste. <br>\r\n<br>\r\n\"Ough\" Sam moans, a but louder this time, as she slides a hand into her boxers. (Which she thinks are way better than girly panties), into her vagina. She slowly strokes her clit, spewing forth juices from deep inside herself. <br>\r\n\"Sam what are y-…Oh my gosh! Are you touching yourself?\" Carly asks in a panic.<br>\r\n\"Nuh-n-…Oh!\" Sams arm falls limp on Carly's back as she feels fire of pleasure spread through her body.  Falling back on the couch, thrusting her hips againat her nearly-equally as limp arm as nore fluid floods out from inside her - soaking the crotch of her shorts. <br>\r\n<br>\r\nCarly's head bolts up. <br>\r\n\"Sam!\" She exclaims, \"You were turned on by tha- ew!\"<br>\r\n\"I'm sorry Carl-es, it just felt so good.\" Sam mumbles, her eyes closed. <br>\r\nCarly ponders for a moment, \"Well:\"</span></div></div>",
            "created":1397106000,
            "id":1776564,
            "title":" Make Carly lick her pits clean - \"as a joke\""
        },
        "124112":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly ignores the door",
                "Carly answers the door"
            ],
            "content":"<div class=\"\"><div> <span>Carly grabs a long metal tube off of the coffee table in front of the couch, (which Spencer was probably planning to use on one of his sculptures), abd seung it at Sam. <br>\r\n\"Get out! You creep! She screams as she wildly swimgs the rod at Sam's head like a bat. <br>\r\n\"Woah! Calm dow-\" Sam begins.<br>\r\n\"<b>Out</b>!\" Carly screams as she pushes Sam toward the door. <br>\r\n\"Wait! Car-\" Sam tries to interject, but Carly slams the apartment door in her face, quickly locking it. <br>\r\n<br>\r\nCarly sits back on the couch, hugging her knees to her chest. She sits for about ten minutes before she hears a knock on the door:<br>\r\n\"Carles. I…Could I borrow a change of pants?\" Sam's voice comes from outside the door. </span></div></div>",
            "created":1399093200,
            "id":1790903,
            "title":"\"Get out of my house, you creep!\""
        },
        "1241122":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly milks this opertunity to dominate Sam",
                "Carly cuts this out and lends Sam a pair of pants"
            ],
            "content":"<div class=\"\"><div> <span>Carly goes to her door and peers through the peephole. Sam is standing in the hall, awkwardly covering a wet patch on her shorts with her hands. <br>\r\n<br>\r\nCarly cracks open the door, \"What happened to yours?\" She inquires. <br>\r\nSam blushes, \"I…Uh…Squirt.\"<br>\r\nCarly raises an eyebrow, \"Come in.\" Carly opens the door and guides Sam to stand in the middle of the room. <br>\r\n\"Now take off your pants.\" Carly says, firmly.<br>\r\n\"Wha-\" Sam begins.<br>\r\n\"You heard me. Off with them.\" Carly intereupts. <br>\r\n<br>\r\nSam hesitantly unbottuns and unzips her shorts. She pauses for a moment before dropping them to the floor and stepping out of them. <br>\r\n\"Now the boxers.\" Carly says, holding back giggles.<br>\r\nSam slowly pushes the waistband of her boxers down, off her hips and down her thighs, before dropping them to the floor. <br>\r\n\"N-now the shirt and bra.\" Says Carly as she stares at Sam's hairy crotch. Sam quickly complies abd folds her hands over her nipples, to hold onto at least a small bit of privacy.<br>\r\n<br>\r\nCarly strolls over to Sam and lifts one of her arms - exposing the sweaty, hairy, <i>smelly</i> mess that is her underarm. She takes a whif:<br>\r\n\"Oh, goodness. You really are <i>stinky</i>.\" She says with a giggle as Carly lifts her own arm in front of Sam's face, \"Take a deep breath.\" Sam takes a long whif of Carly's underarm - which smells of lavender.<br>\r\n\"Much better than yours.\" Carly states, \"Tell me, Sam. Tell me how good I smell, and how much you stink.\"<br>\r\n<br>\r\n\"You smell like royalty, Carle-\" Sam begins.<br>\r\n\"Princess. I am your princess.\"<br>\r\n\"You smell like royal beauty, princess Carly. And I stink like a peasant that bathes in your poop.\"</span></div></div>",
            "created":1399525200,
            "id":1793718,
            "title":"Carly answers the door"
        },
        "12411221":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Treat Sam like an animal",
                "Treat Sam as her slave"
            ],
            "content":"<div class=\"\"><div> <span>\"No. You stink like…\" Carly giggles, \"A piggy.\" She pulls Sam's nose back like a snout, \"Make piggy sounds - piggy!\" <br>\r\nSam snorts, which sounds particularily piggish due to her 'snout':<br>\r\n<i>Snork snork</i><br>\r\n<br>\r\n\"Get on your knees, <i>piggy</i>.\" Carly commands Sam. <br>\r\n\"Yes, princess Carly.\" Sam replies through her 'snout'. She drops to her hands and knees. Carly lets go of Sam's face, \"Face me, piggy.\" She commands, and Sam obeys. <br>\r\n<br>\r\n\"Open your mouth, piggy.\" <br>\r\n\"Yes, prin-theth Caw-ly.\" Sam is unable to fully form her words as she obeys. Carly giggles and walks away. She sprints to her bedroom, to grab some \"supplies\" she wants to use on Sam. <br>\r\n<br>\r\nBut now she faces a dilemma: </span></div></div>",
            "created":1399611600,
            "id":1793991,
            "title":"Carly milks this opertunity to dominate Sam"
        },
        "124112211":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly shows Sam a picture of her in \"piggified\" form",
                "Carly sends the pictures to someone"
            ],
            "content":"<div class=\"\"><div> <span>Carly looks around her room. She decides she wants to make Sam into her piggy.<br>\r\n<br>\r\nShe grabs a thin, black leather belt. Sitting down at her desk, she loops the belt into the approximate size of Sam's neck - then a touch tighter. She punches a hole into the leather and unloops it again. Laying the makeshift collar on her bed, she looks around for something else. <br>\r\n<br>\r\nShe picks up an old necklace sitting on her desk. A thin chain with adjustable size. Carly smirks and envisions  Sam with her ' snout'. She attatches two bobby-pins to the chain and looks up across her desk. <br>\r\n<br>\r\nHer eyes fall upon a pair of scissors, and a devilish grin spreads across her face. A mental image of Sam's curly hair forms in her mind. She picks up the scissors and snaps them open and closed a few times. An idea forms in her head - no piggy should go without a tail, right? A soft, blonde tail would do. <br>\r\n<br>\r\nCarly grabs a black marker and her camera-phone as she stands and walks back out into the living room where Sam is still on her hands and knees. A puddle can be seen in front of her - from her mouth hanging open. Carly grins as she walks up behind Sam - who is facing away from Carly's bedroom. <br>\r\n<br>\r\n\"I have a couple presents for my little piggy.\" Carly squeaks through giggles. She slips the belt over Sam's head before she has a chance to respond. <br>\r\n\"Woah! What are yo-\" Sam begins to protest.<br>\r\n\"Shush, piggy. You'll love your collar.\" Carly says calmly. She straightens up and snaps a few quick pictures of her friend - she emails them to her computer as she slides the necklace under the back of Sam's collar. She runs the chain up on top of Sam's head, and hooks the bobby-pins into her nostrils. She pulls the chain tight: \"Make your piggy sounds for me, piggy!\" <br>\r\n<br>\r\n<i>Snork snork</i> comes Sam's piggy noise. <br>\r\n<br>\r\nCarly's heart thumps inside her chest as she casually strokes Sam's head. She chooses a lock of Sam's shoulderblade-length hair. She pulls the strands of hair up, holding them in the air, as nonchalantly as she can. She snips the length off of Sam's head. Sam snaps at the sound of scissors closing so close to her head. <br>\r\n\"Ohgosh. Did you just…\"<br>\r\nCarly stays silent and ties a large knot into the end of the lock of hair. She kneels beside Sam and places a calming hand on her rump - which, before this point, she hadn't noticed was so shapely. She runs a calm hand along Sam's skin, before spreading Sam's dry anus wide.<br>\r\n\"Ohgosh! No, don't-\" Sam pleads, expecting a very large intruder to be rammed inside. Instead, she fells Carly nestle somthing about the size of a gumball inside.<br>\r\n\"Now, don't drop this. Piggy.\" Carly coos, and Sam clenches her sphincter, holding her tail inside. <br>\r\n<br>\r\nCarly tosses the scissors aside, and pulls the cap off the marker, and writes on Sam's side:<br>\r\n<br>\r\n<b>PRINCESS CARLY'S PIGGY</b><br>\r\n<br>\r\nCarly snaps a few more pictures of Sam from behind, without her knowledge.</span></div></div>",
            "created":1399611600,
            "id":1794019,
            "title":"Treat Sam like an animal"
        },
        "1241122111":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Sam tries to get the phone from Carly",
                "Sam accepts defeat"
            ],
            "content":"<div class=\"\"><div> <span>Carly giggles as she flicks through the pictures of Sam - or rather, her piggy. She stops on a broad shot of Sam's back, which includes her tail, collar, and the writing on her side. She giggles and puts the phone in front of Sam's face, \"You like it, piggy?\" She asks.<br>\r\n\"Ohmygosh…Give me that!\" Sam screams as she lunges for the phone.<br>\r\n\"Nuh uh uh.\" Carly chides, \"Unless you want the internet to see you like this.\" She says with a sly grin.<br>\r\n<br>\r\nSam sits with her mouth hanging open. </span></div></div>",
            "created":1400302800,
            "id":1798111,
            "title":"Carly shows Sam a picture of her in \"piggif..."
        },
        "12411221111":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Anger continues to bubble inside her",
                "Her anger diminishes, giving way to remorse"
            ],
            "content":"<div class=\"\"><div> <span>Sam growls and lunges at Carly, she lands on top of Carly who involuntarily taps the 'upload' button her finger had been hovering over.<br>\r\n\"Well. That's it. Now everyone can see!\" Carly yells as Sam falls on top of her - pinning her to the ground. Sam lays motionless for a few seconds before screaming in rage:<br>\r\n\"Bitch!\" She shrieks as she straddles Carly's stomach. She unwinds a heavy slap to Carly's cheek - leaving a red hand-print on her face.<br>\r\n<br>\r\n\"Ouch!\" Carly yelps as she tries to rub her cheek. Sam struggles to pin Carly's arms underneath her legs - but eventually comes out on top, literally. <br>\r\n\"It's gonna hurt more, bitch!\" Sam roars as she waylays Carly's face with fist after fist. Carly's face runs red with blood as she feels her nose break.<br>\r\n<br>\r\n           <i><b>AIIGH</b></i><br>\r\n<br>\r\nCarly screams in pain. <br>\r\n\"Please! Sam! Stop!\" Carly pleads as she feels another fist slam into her jaw.<br>\r\nSam's face turns red as she steams. But, she ceases her battering of Carly's visage. <br>\r\nSam seethes as she watches tears stream down Carly's face. An unquenchable anger grips her, and she, in turn, grips Carly. Her eyes fall to Carly's pretty shirt, and the exposed bit of cleavage it reveals. She looks down at her own bare breasts. <br>\r\n\"Let's see how yours look!\" She grabs the fabric of Carly's blouse, and rips it down the middle. Exposing Carly's purple bra. She grabs the top of each cup and tears it off Carly's body. Revealing Carly's bare A cup breasts. <br>\r\n<br>\r\nSam squeezes her friends mammaries, leaving two bloody handprints. Carly cringes as the sensation of her breasts being, essentially, groped mixes with the exruciating pain of her broken nose and, likely, jaw. <br>\r\n<br>\r\nSam straightens up and huffs violently as she stares into Carly's eyes. As she does:</span></div></div>",
            "created":1400302800,
            "id":1798171,
            "title":" Sam tries to get the phone from Carly"
        },
        "12411221112":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly comes back alone",
                "Carly brings a friend"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine.\" Sam sniffles, a tear escapes her eye,  <br>\r\n\"Good.\" Carly smiles as she jerks Sam's leash. \"Come along, piggy.\" Carly leads Sam into the apartment washroom.<br>\r\n<br>\r\n\"Welcome to your new pigpen, piggy!\" Carly exclaims. <br>\r\n\"Wh…What?\" Sam stammers. <br>\r\n\"This is where you'll be sleeping from now on.\" Carly says brightly.<br>\r\n\"I don-…I don't understand.\" Sam says through tears, her voice distorted by her 'snout'. <br>\r\n\"Well we can't have you stinking up the rest of the house, now can we?\" Carly childes Sam, \"But there will be a few rules. Like you won't be alowed to use the toilet like a person.\"<br>\r\nSam's eyes widen, \"What?\" <br>\r\n<br>\r\nCarly walks over to the tub. She picks up the drain-plug and pulls a tube of super-glue she snagged from the living room from her pocket. She squirts a generous amount onto the plug, and rams it into the drain - ensuring it will never open again. <br>\r\n\"This will be your bed,\" Says Carly with a coo, \"Hop in!\" She pulls on Sam's leash, pulling her into the tub. <br>\r\n<br>\r\n\"D'you know what pigpens are full of?\" Carly asks. <br>\r\n\"Uh…\"Sam starts with a gulp, \"P-…Poop?\"<br>\r\n\"Yep!\" Carly says sweetly, as she hikes up her skirt, and pulls her panties down off of her behind. She settles down on the edge of the tub and, with a grunt, pushes several large stools out of her butt. A wave of stench washes over Sam as she reels in disgust.<br>\r\n<br>\r\n\"Ew ew ew!\" She squeals, \"Let me go!\" Sam pleads.<br>\r\n\"Nope. You're staying here.\" Carly asserts, \"And, to make sure…\" Carly grabs Sam's ankles with one hand, and a piece of her own feces in the other. She smears the mess all over Sam's feet, bottom and top. <br>\r\n<br>\r\n\"When I come back, if there is any poop outside your bed - or if you try to run, I'm sending the pictures to everyone!\" Carly tells Sam as she wipes the leftover feces from her hand on Sam's cheek - which makes Sam scream - and walks out of the room, locking the door behind her.<br>\r\n<br>\r\nSam breaks into fits of sobbing. Humiliated, she lies in wait for Carly to return. </span></div></div>",
            "created":1400302800,
            "id":1798135,
            "title":"Sam accepts defeat"
        },
        "124112211121":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Sam obeys",
                "Sam disobeys"
            ],
            "content":"<div class=\"\"><div> <span>Sam lies in silence - except for cries - for hours. She watches the sun set through the tiny frosted window in the bathroom. She jumps at the sound of the door clicking and swinging open, and Carly striding in. She drops several bags on the floor by the door.<br>\r\n<br>\r\n\"Good evening, piggy!\" Carly greets her pet warmly, \"I talked to your mom. I told her you decided you wanted to move in with me for a while.\"<br>\r\n\"Wh-…What did she say?\" Sam demands, suprised. <br>\r\n\"She said that she thinks she can endure having the house all to herself for a little. And, she said that since your eighteenth birthday was last month, she couldn't stop you even if she wanted to.\" Carly hisses with a smirk. \"That, and Spencer called. Some big-time art guy offered him a spot in some convention - in France. So we have the place all to ourselves - for a month.\" Carly giggles. <br>\r\n<br>\r\nCarly feels her sphincter begin to relax as she laughs, allowing some gas to escape, \"Oh goodness, I think all that cheese, and gravy, and chicken is wanting to come out.\" She giggles and hikes up her skirt to reveal nothing underneath. <br>\r\n<br>\r\n<i><b>ARRGGBBLL</b></i><br>\r\n<br>\r\nA huge rush of gas escapes Carly's colon.<br>\r\n\"Oh!\" Carly gasps involuntarily as semi-liquid feces pour out of her, \"Oh…I can feel it burning…Play in it!\"</span></div></div>",
            "created":1400302800,
            "id":1798144,
            "title":"Carly comes back alone"
        },
        "1241122111211":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "\"No.\"",
                "\"Fine.\""
            ],
            "content":"<div class=\"\"><div> <span><i><b>SQUORK</b></i><br>\r\n<br>\r\nA thick liquidish form of feces continues to spew from Carly as she demands Sam play in her excrement. <br>\r\n\"Good piggies play in the poop they're given.\" Carly pouts. <br>\r\n<br>\r\nSam cringes as she hesitantly reaches out into the pungent tide, scooping a generous amount into a hand. She pauses for a moment before squeezing her eyes shut and draping Carly's crap across her own chest. She rubs the mess all over her body, gagging at the smell. <br>\r\n\"Is my piggy enjoying herself?\" Carly asks with a coo from the side of the tub, she watches with her head in her hands, staring at Sam. <br>\r\n\"Ohgosh, no. Don't make me do this - please.\" Sam begs. <br>\r\n\"Oh, fine.\" Carly relents, \"You can stop - for now.\" She adds with a grin.<br>\r\n<br>\r\nCarly stands and retrieves the bags she had walked in with, \"I got you some things, Piggy.\" <br>\r\nSam only responds with a stare.<br>\r\n\"Would you like to see?\" Carly inquires.<br>\r\nSam sighs:</span></div></div>",
            "created":1400302800,
            "id":1798234,
            "title":"Sam obeys"
        },
        "1241122111212":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly decides to take more blackmail pictures of Sam",
                "Carly continues to dress Sam up"
            ],
            "content":"<div class=\"\"><div> <span>\"Please. No!\" Sam begs as she presses against the opposite side of the tub. \"Please don 't make me!\"<br>\r\n\"Ugh. Fine.\" Carly grunts as she drops her skirt back over herself, \"I can show you what I got you instead!\" She exclaims with glee. <br>\r\n<br>\r\nCarly undoes the belt around Sam's neck, pulling it, and her makeshift nose-hooks, off of Sam's head. Sam breathes a sigh of relief as she feels her nostrils be released. Carly quickly pulls a collar out of one of the bags. She wraps it around Sam's neck - who whimpers - and pulls it tight. She lifts two metal hooks on an adjustable leather strap out of the same bag. She loops the strap into a buckle on the back of Sam's collar - securing it. She runs the leather strap overtop of Sam 's head, and slips each hook into one of Sam's nostrils. She tightens the strap - pulling Sam's nose up and back, back into her 'snout'. <br>\r\n<br>\r\nCarly giggles as she pulls the next object out of the bag: a snout. A plastic snout with a strap like a party hat. Carly puts it overtop of Sam's nose, \"now you look like a piggy!\" She giggles. She pokes two holes in the snout with a pair of scissors from the same bag, \"So you still smell your lovely pigpen.\" She explains with a grin. <br>\r\n<br>\r\nCarly reaches into a second bag, and pulls out what looks like a thick balloon attached to a hand-pump. Carly nudges Sam, motioning for her to turn 'round. Carly pulls the small knot of blonde hair from Sam's backside. She reaches into the bag she produced the balloon from, and pulls out a thin, curly piece of plasticky-rubber that is attached to what looks like a piece of tape. Carly sticks the tail onto the balloon and slides it into Sam's rear. <br>\r\nSam gasps, \"What is that?\" <br>\r\n\"You'll see.\" Carly says soothingly as caresses Sam's backside. She picks up the hand-pump and slowly squeezes it, then again, and again. With each squeeze, the balloon inflates a little bit more - spreading Sam's orifice a little bit more. <br>\r\n\"Ohgosh.\" Sam exclaims, \"What are you doing? I-I can feel it growing!\"<br>\r\nCarly laughs, \"You won't be able to clench you bumhole after this.\" She says as she squeezes the pump one last time, then pulls the tubing off of the balloon - placing the pump back into the bag. <br>\r\n<br>\r\nCarly now thinks to herself, \"I wonder…\"</span></div></div>",
            "created":1401598800,
            "id":1805197,
            "title":"Sam disobeys"
        },
        "12411221112121":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Penetrate Sam's vagina",
                "Force oral sex on Sam"
            ],
            "content":"<div class=\"\"><div> <span>Carly giggles and pulls her cellphone from one of the bags. She snaps a picture of Sam's backside, complete with tail, then takes a barrage of photos of her face - along with her snout. <br>\r\nSam whimpers, \"Please don't.\"<br>\r\n<br>\r\nCarly grins as she digs back into one of the bags. She smirks devilishly as she lifts something out:<br>\r\nA large, pink strap-on dildo. <br>\r\n<br>\r\n\"Ohgosh.\" Sam gulps as Carly straps the toy around her pelvis. <br>\r\n\"Bend over, piggy!\" Carly commands gleefully. <br>\r\n<br>\r\n\"Please…\" Sam moans. <br>\r\n<br>\r\nCarly pauses, she wonders whether to:</span></div></div>",
            "created":1402203600,
            "id":1808890,
            "title":"Carly decides to take more blackmail pictures o..."
        },
        "124112211121211":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "\"What was that?\" Sam asks",
                "\"Like that?\" Carly giggles"
            ],
            "content":"<div class=\"\"><div> <span>Carly quickly pulls the strap-on tight, and strokes it slowly a few times. Running all the way down to below the shaft where a heavy rubber \"scrotum\" hangs. <br>\r\n<br>\r\nCarly gently pokes Sam's hairy, pink, puffy vaginal lips with the long plastic penis. <br>\r\n\"Anyone ever been inside there?\" She inquires. To which Sam only replies with a whimper. Carly shrugs and rubs the tip of the dildo along Sam's sensitive skin. Sam yelps as her crotch moistens. <br>\r\n\"You're liking this, aren't you? Piggy.\" Carly giggles. <br>\r\nCarly slides the neon-pink tip of the shaft into the first shallow bit of Sam. <br>\r\nSam gasps, \"No! I'm a virgin! It'll ri-!\" She is interrupted by a stabbing pain as Carly rams the shaft deep inside her. Brutally ripping her hymen into pieces. <br>\r\n<br>\r\nCarly quickly slides out to the tip, then quickly rams back into Sam. <br>\r\n\"Ohgosh! Please stop!\" Sam screams as blood flecks across the tub, as well as onto the two girls. Carly ignores her friend's pleas, and keeps violently ramming her vagina raw. <br>\r\n<br>\r\nWith each ram, Carly feels the dildo press on her clitoris, then release. The press. Then release. She can feel her own juices begin to flood her crotch. As she nears climax, she grabs hold of the rubber scrotum, rapidly flapping back and forth. As she falls over the brink of pleasure, she gives the rubber sac a hard squeeze:<br>\r\n<br>\r\nA warm, white, slimy liquid sprays out the head of the dildo. Some is sprayed deep inside Sam, while some is deposited on her buttocks. <br>\r\n<br>\r\nCarly collapses backward, after enjoying a long orgasm. Panting heavily as Sam lays aching, her vagina feels as if she's pushed a bowling ball out of it, and a sticky substance is leaking out. </span></div></div>",
            "created":1402203600,
            "id":1809303,
            "title":"Penetrate Sam's vagina"
        },
        "12411222":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "\"Nope\"",
                "\"Sure\""
            ],
            "content":"<div class=\"\"><div> <span>Carly giggles, \"Yeah you do.\" She walks off to her room to grab a pair of shorts. When she gets there, an evil idea swells in her head. She digs around in her underwear drawer - in the back where she hid things - and pulled out a small vibrator and a small G-string thong. She giggles as she closes the finger-length piece in her hand, grabs a pair of shorts - which she know will be a bit too small for Sam - and walks back to the living room. <br>\r\n<br>\r\n\"Thanks Carles. I'm sorry f-\" Sam begins. <br>\r\n\"You can have these shorts on two conditions: you have to keep this inside yourself.\" Carly grins as she holds up the vibrator.<br>\r\n\"Uh…\" Sam stammers.<br>\r\n\"And wear a thong, too!\" Carly giggles. <br>\r\n<br>\r\n\"Ugh.\" Sam groans, \"Fine.\" She grabs the toy out of Carly's outstretched hand and hesitantly puts it to her vulva.<br>\r\n\"Wait.\" Carly raises a hand, \"You have to turn it on first, silly!\" She pushes a small button on the base of the dildo, making it begin to whir and buzz. <br>\r\n\"Oh no…\" A look of despair creeps across Sam's face as she places the toy on her skin. Butterflies tie themselves into knots then burst into flames in her stomach. She gently pushes the toy into her naturally-wetting vagina. <br>\r\n<br>\r\n\"Oh!\" She moans as she nestles the buzzing toy as shallow as possible into herself. <br>\r\n\"Gimme the damn panties!\" Sam squeals as she squeezes her eyes shut. Carly laughs as she hands the underwear to her friend. Sam slowly steps into the unfamiliar cloth, pulling them up her legs. She lets the string rest just on top of the base of the vibrator - to which Carly smirks. <br>\r\n\"Can I please have the shorts now?\" Sam begs, hopping from leg to leg, feeling antsy. Carly tosses the shorts to Sam wh<b></b>o hastily pulls them over herself - but only to the lower waist. Carly scoffs as she walks over to her friend, gives a sweet smile - then grabs the waistbands of the shorts and thong, and pulls them up to her hips. <br>\r\n<br>\r\n\"<i><b>OHGOSH</b></i>\" Sam yelps.<br>\r\n\"Can I…huuh…Have muh…My shirt b-…Back.\" Sam stammers. </span></div></div>",
            "created":1400475600,
            "id":1798851,
            "title":"Carly cuts this out and lends Sam a pair of pants"
        },
        "124112222":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Did make it home without breaking down",
                "Succumbed to pleasure before making it home"
            ],
            "content":"<div class=\"\"><div> <span>Carly tosses Sam her shirt, but keeps her bra. Sam quickly pulls the thin T-shirt over ger head. <br>\r\n\"Ahha…N-Now what?\" Sam stutters. <br>\r\n\"Now we're going to go for a walk.\" Carly says sweetly.<br>\r\n\"Ohgosh…Where to?\" Sam inquires.<br>\r\n\"To your house.\" Carly says as she starts to open the door to her apartment. <br>\r\n\"B-but that's on the other side of town…An-…Ohgosh…I do-don't think I can make it that far.\" Sam mumbles. <br>\r\n\"Well that's your problem. Come along.\" Carly commands as she walks out the door.<br>\r\n<br>\r\n\"Ohgosh.\" Sam thinks as she takes a step out the door, pulling it closed behind her.<br>\r\n\"I can do this, I'll be fine.\" She gives herself a quiet pep-talk under her breath. She walks down the first step in the stairwell.<br>\r\n\"Ohgosh…I can feel it mov-…Oh…Inside me! Against m-…my…cl-!\" Sam freezes, begging her body not to succumb to orgasm. The wave passes and she begins to wali down the stairs again, one step at a time. <br>\r\n<br>\r\nSeveral minutes later, she reaches the bottom of the stairs where Carly is waiting for her. She steps out the door and starts toward her home. <br>\r\n<br>\r\nAnd, she:</span></div></div>",
            "created":1400475600,
            "id":1798874,
            "title":"\"Sure\""
        },
        "1241122221":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly",
                "Her mother"
            ],
            "content":"<div class=\"\"><div> <span>Sam takes deep breaths as she heel-toes her way home. When she finally makes it in the door, she breaks stride and runs to her room. As she closes and locks the door, her muscles tense.<br>\r\n\"Oh…Son of a…bitc-\" Every muscle in Sam's body wildly contracts and relaxes as she feel the fiery wave of pleasure wash over her. She scrunches her toes and squeals madly. She loses track of time as she collapses on her floor. Panting heavily. <br>\r\n<br>\r\nSam slowly reaches down the top of her shorts, into the G-string, and inside herself. She slowly pulls the toy from its place, on the verge of tears the whole time. When she pulls it out of her shorts, she clocks it off and relaxes - well, as much as one can relax with an uncomfortable wedgie.<br>\r\n\"How the hell to people wear these things?\" Sam wonders aloud.<br>\r\n<br>\r\nHer door swings open and her head snaps up. She looks dumbfounded, spread eagle, as she makes eye contact with:</span></div></div>",
            "created":1400475600,
            "id":1798982,
            "title":"Sam makes it home"
        },
        "12412":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly gives in",
                "Carly holds out"
            ],
            "content":"<div class=\"\"><div> <span>Sam spreads eagle, and pops the button on her pants. She slowly pulls her zipper down, and wiggles her pants down to the bottom of her butt. Her bright red boxers displayed proudly. She spreads the placket of her shorts wide, revealing her bare crotch to the open air. <br>\r\n<br>\r\n\"C'mon. Let me go.\" Carly says with a laugh, \"you stink!\"<br>\r\n\"Oh, I know…\" Sam murmurs as she swiftly pulls Carly's head from her armpit, and between her legs - with her nose on a course right into the open fly. <br>\r\n<br>\r\n\"Gosh! What are you - Ew!\" Carly exclaims as she realizes where Sam has shoved her nose.<br>\r\n\"Take a good whif, Carles.\" Sam giggles playfully.<br>\r\n\"I can't breathe down here, Sam!\" Carly pleads. <br>\r\nSam laughs, \"It might not be good air, but it's air.\"<br>\r\n\"Oh gosh. I can feel your pubes in my mouth as I talk. <b>Gross</b>!\"Carly spits a few times, deslerately trying to get Sam's body hair out of her mouth - to no avail.  \"You should really shave down here!\" She cries. <br>\r\n\"But the it doesn't stink so much.\" Sam coos, \"And the stink is the best part.\"<br>\r\n\"You're so disgusting!\" <br>\r\n<br>\r\n\"Taste me.\" Sam commands. <br>\r\n\"What?\"<br>\r\n\"You heard me.\"<br>\r\n\"I am <b>not</b> tasting you.\" Carly says with a gag. <br>\r\n\"Then you'll just have to stay down there until you change your mind.\" Sam says as she wraps her legs around Carly, pulling her face tighter into Sam's crotch.</span></div></div>",
            "created":1398920400,
            "id":1790111,
            "title":"Make Carly smell \"another area\""
        },
        "124121":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Sam forces Carly to lick her backside",
                "Sam tastes Carly"
            ],
            "content":"<div class=\"\"><div> <span>Carly groans, \"If I do taste your…Y'know, will you let me go?\"<br>\r\n\"Sure, Carles.\" Sam says, \"A few good licks - I wanna feel your tongue.\"<br>\r\n<br>\r\nCarly shudders and sighs, \"Fine, l'get this over with.\" She mumbles under her breath. Sam waits with anticipation as Carly slowly pushes her head down until her lips are milimetres from Sam's skin. Carly can feel her friend's pubic hair against her lips and nose. <br>\r\n<br>\r\nCarly hesitates for a second before making light contact with Sam's body with the tip of her tongue. To Sam this tiny touch feels electric, sparking a blaze of inhibition within her, and her crotch moistens more and more. <br>\r\n<br>\r\nCarly brings her tongue back down to the bottom of Sam's crotch, and presses her tongue against her skin. This time she uses her tongue like one might lick an ice cream cone. As she drags her tongue across Sam's body, she can feel every strand of coarse hair - taste the juices from inside her friend. <br>\r\n<br>\r\nSam jerks as Carly's tongue drags across her clitoris at the top of her vaginal slit. She relaxes, feeling Carly slowly licking her. A warm feeling starts in Sam's toes, and slowly moves like a wave up her body, and as it reaches her waist, Sam releases the muscles in her pelvis. <br>\r\n\"Sam! Wha-…Sto-…Ew! You're peeing on me!\" Carly yells. <br>\r\nSam, in the middle of a long orgasm, completely ignores her. And continues to empty her bladder onto Carly's face. <br>\r\n<br>\r\nAs the warm feeling fades away, Sam slowly comes back to reality. She feels the warm cloth that is sticking to her legs. <br>\r\nSam smirks, \"Alright Carles. Now it's time for my butt.\"<br>\r\n\"What? I licked your fishy pussy, and you said you'd let me go!\"<br>\r\n\"I lied.\" Sam replies sweetly. <br>\r\n\"I'm not doing anything else.\" Carly insists. <br>\r\n\"Oh yes you will.\"</span></div></div>",
            "created":1399093200,
            "id":1791121,
            "title":"Carly gives in"
        },
        "124122":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Sam lets go of Carly",
                "Sam decides Carly needs to be punsished"
            ],
            "content":"<div class=\"\"><div> <span>\"Anytime now, Carles.\"Sam coos, \"I want to feel your tongue.\"<br>\r\n\"Not gonna hap-\" Carly pauses for an involuntary gag, \"oh gosh. It smells like rotting fish. I'm gonna puke. \" She heaves against her will, thrashing about in Sam's grip. <br>\r\n\"Nice try, Carles. I'm not letting you go that easy.\" Sam giggles, thinking Carly is bluffing. <br>\r\n<br>\r\nCarly heaves and chokes: <br>\r\n\"Oh go-\" her words are cut short by the involuntary spitting up of her lunch. Sam laughs, thinking Carly is being the actress she is - but is suprised when she feels a warm, wet mass slop onto her vulva. <br>\r\n\"Did you just hur-…You-…Ugh!\" Sam exclaims. </span></div></div>",
            "created":1399093200,
            "id":1790890,
            "title":"Carly holds out"
        },
        "12413":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "She loses control of her bowels and has an accident",
                "She has an orgasm right then and there, loosening her grip on Carly's head"
            ],
            "content":"<div class=\"\"><div> <span>Sam chuckles, and slides up onto her bottom, spreading her knees and pulling her sock-wrapped feet in toward her body. She pulls Carly's head down to the damp cloth on her toes.<br>\r\n\"Ya' like it?\" Sam asks with a giggle.<br>\r\n\"You're disgusting. I'm gonna get you for this - ew!\" Carly squeals as Sam rubs her toes on Carly's lips. <br>\r\n<br>\r\nSam slides an arm around Carly's head and pulls off one of her own socks.<br>\r\n\"Oh, gross!\" Carly exclaims as Sam pushes her sweaty foot into Carly's nostrils. <br>\r\n\"You love the smell, don't you. <i>Carles.</i>\" Sam purrs to Carly as she pulls her other sock off and tosses it aside. <br>\r\n\"You I don't. This is <b>so</b> gross. You're like…Picking my nose with your toes.\" Carly whimpers, \"What is wrong with you, Sam?\"<br>\r\n<br>\r\nSam ignores Carly, and pays attention to pressure building inside her. <br>\r\n\"Ugh. I need to fart,\" Sam says, her words like moans, \"you'll like that. Won't you?\"<br>\r\n\"What? No! Ew! Let me go!\" Carly yelps as she pulls away, but Sam tightens ger grip on Carly's head. <br>\r\n<br>\r\nSam gives a sigh of relief as a quiet bit of gas passes from her backside. <br>\r\n\"Oh!…Gosh! What did you eat?\" Carly asks in disgust - the smell that much worse due to her proximity to Sam's anal cavity. Sam, on the other hand, is in complete euphoria. The fact that her best friend is being held down and made to smell the most disgusting things she has to offer excites her beyond description. She is so excited, in fact, that:</span></div></div>",
            "created":1398920400,
            "id":1790106,
            "title":"Something else, perhaps?"
        },
        "124131":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Carly complies",
                "Carly defies"
            ],
            "content":"<div class=\"\"><div> <span>Sam lets loose a second blast of gas in rapid succesion. Then a third - but with it, came an unexpected guest. Sam feels her anus relax, and feces pour out. The semi-liquid mass quickly stains through her boxers and jeans - and the rancid smell punching through faster yet. <br>\r\n<br>\r\n\"Ohgosh.\" Carly exclaims, \"Did you just-\"<br>\r\n\"Oh yeah,\" Sam says boldly, \"Take a good smell.\" She spreads her feet apart - spreading eagle. And pushes Carly's face up against her squishy backside. <br>\r\n\"Let me go! You are <b>beyond</b> disgusting.\" Carly whines. <br>\r\n<br>\r\nSam puts a hand to Carly's mouth, wiggling her way between her lips and prying open her teeth.<br>\r\n\"Wha a-we y'u dwoin-g?\" Carly asks as Sam holds her mouth open. To answer her question, Sam shoves Carly's open mouth onto the stinky stain on Sam's pants. <br>\r\n\"Suck my poop from my pants, Carles.\" Sam whispers as she wraps her legs around Carly's neck, and grabs a fistful of her hair. <br>\r\n<br>\r\nShe gives Carly's hair a sharp tug, \"I said: suck my poop.\" <br>\r\nAt this point Carly has broken into tears. Why is Sam doing this? Abd why is she being so mean?</span></div></div>",
            "created":1399093200,
            "id":1790648,
            "title":"She loses control of her bowels and has an acci..."
        },
        "1241312":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Sam takes pictures of the poopy Carly between her legs",
                "Sam urinates on Carly"
            ],
            "content":"<div class=\"\"><div> <span>\"Uhguhh. Nuh, Seh-m. Le-h me go.\" Carly begs. <br>\r\n\"Ugh. Fine. I want make you eat it…I'll make you wear it!\" Sam exclaims as  she slides her loose jeans down off her legs, flinging the stained bit of clothing across the room. Sam rocks onto her lower back, lifting her butt off the ground. She pulls her boxers to the bottom of her bottom. <br>\r\n\"How does it smell, Carles?\" Sam inquires as she scoops a generous helping of her own fecal matter onto her fingers. <br>\r\n\"Please…No.\" Carly pleads, but her cries fall on deaf ears. Sam ignores her, finger-painting Carly's forehead with poop.<br>\r\n\"Ohgosh…\" Carly gasps. Sam paints stripes across Carly's cheeks, then the bridge of her nose. Sam scoops a large amount of feces onto the side of her hand and runs it though Carly's hair. <br>\r\n\"Ew! It's so…Greasy!\" Carly complains. Sam keeps streaking Carly's hair when she finds her boxers to be, relatively, clean. <br>\r\n</span></div></div>",
            "created":1399611600,
            "id":1794084,
            "title":"Carly defies"
        },
        "1242":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Yes!",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Tori and Jade battle it out in a stink-off?</span></div></span></div>",
            "created":1365570000,
            "id":1569555,
            "title":"Victorious"
        },
        "125":{
            "author_id":"zekara",
            "author_name":"Zekara",
            "choices":[
                "Movies",
                "Literature",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more choices! Even more Ladies!</span></div></span></div>",
            "created":1362459600,
            "id":1544420,
            "title":"Others"
        },
        "1251":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Harry Potter girls",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What bunch of movie girls are gonna get smelly?</span></div></span></div>",
            "created":1398920400,
            "id":1790113,
            "title":"Movies"
        },
        "12512":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "Indeed they will!",
                "Nope. No they won't. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe the girls in the midst of the Hunger Games will fit your fancy?</span></div></span></div>",
            "created":1398920400,
            "id":1790114,
            "title":"A bit of danger perhaps?"
        },
        "125121":{
            "author_id":"mulloneangule",
            "author_name":"Thatguyoverthere",
            "choices":[
                "A nobody girl in her last year being eligable for the games",
                "The daughter of an influential figure in the community "
            ],
            "content":"<div class=\"\"><div> <span>The suprising outcome of the 74th annual Hunger Games success has been made known far and wide. The unlikely duo emerged victorious, trifling over many adversaries - as well as making some new powerful enemies. <br>\r\n<br>\r\nWhilst the whole of Panem revelled in the closing of the annual games, the powerful head of state plotted with his other higher-ups. A plan to squash this cute resistance must be thought up quick. <br>\r\n<br>\r\nAnd thought up quick it was. <br>\r\n<br>\r\nThe quarter quell special mix-up was announced soon before the 75th Hunger Games the net year:<br>\r\nThe tributes are to be only female. Two from each district - and past winners are not safe from the reaping. <br>\r\n<br>\r\nOf course the one girl the powerful figures wanted in the games could be cheated into being reaped easily - but who shall take the second place for district twelve?</span></div></div>",
            "created":1398920400,
            "id":1790117,
            "title":"May the odds fall not upon you!"
        }
    },
    "info":{
        "author_id":"zekara",
        "author_name":"Zekara",
        "brief_description":"Girls battling it out using their feet, armpits, and anything that gets smelly and sweaty!",
        "created":1362517740,
        "description":"<td align=\"left\" class=\"norm\">I've been browsing this site for a while, waiting for just the right story, you know the one, the perfect Interactive to cover your niche. I finally decided to cut the gordian knot, and make it myself. Anyways, Here's how its gonna go down:<br>\r\n<br>\r\nThis story is going to be split, right from the beginning, into two branches. The first branch, will be a tournament-y style fighting arena for OC characters to get down and dirty and all sweaty (and make the losers lick them clean). The battles will break down like this: Two characters enter,  one girl loses either by knock out from a really bad smell or grossed into submission, in which case the winner gets to enact a humiliating forfeit, which can be sexual, but remember to keep the gross stuff the focus. ALL THINGS ARE ALLOWED including scat and vore. But the Vore must be soft and has to end with the vore-e being vomited up or shitted out, because hey. there's some smelly torture right there.<br>\r\n<br>\r\nThe other branch is for more one-offy stories, using characters from Anime, Comic Books, Cartoons, Movies, etc. These are for those times where you just wanted to see Chun-li kick the shit out of Cammy, and then force her to lick her pits clean, Or Katara sweatbending straight into Azula's mouth. This is more like the standard stories, you know, probably with the long lists of choices of medias and things like that<br>\r\n<br>\r\nAnyways, I'm hoping this story will get big-ish who knows, maybe i'll even get YOU to contribute.</td>",
        "id":1922504,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1521894000,
        "modified":1521894000,
        "pretty_title":"Stench Fetish Fighters!"
    }
}