{
    "chapters":{
        "1":{
            "author_id":"cynderfan",
            "author_name":"Fan of Spyro",
            "choices":[
                "18-22, male, willing",
                "23-26, male, willing",
                "18-22, female, willing",
                "23-26, female, willing",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start with sex, willingness to gain weight, and age range.</span></div></span></div>",
            "created":1474744980,
            "id":2214109,
            "title":"Let's begin"
        },
        "12":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Spunky the bobcat.",
                "Your Choice.",
                "Your Choice.",
                "Your Choice.",
                "Your Choice."
            ],
            "content":"<div class=\"\"><div> <span>Name: Spunky <br>\r\nSpecies: Bobcat <br>\r\nAge: 26<br>\r\nHeight: 7'4\" <br>\r\nWeight: 520 lbs<br>\r\nBackground: Hailing from New York City New York U.S.A. Yours truly happens to be an Andre the giant inspired character and also a well known face wrestler who always follows the rules.</span></div></div>",
            "created":1477944540,
            "id":2230928,
            "title":"23-26, male, willing"
        },
        "13":{
            "author_id":"cynderfan",
            "author_name":"Fan of Spyro",
            "choices":[
                "Cierra",
                "Kristen",
                "Jaiden",
                "Sarah",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Name: Cierra<br>\r\nSpecies: Wolf<br>\r\nAge: 18<br>\r\nHeight: 5'6\" (about 1.68 meters)<br>\r\nWeight: 100 lbs (about 45.36 kg)<br>\r\nBust size: C cup<br>\r\nBackground: Cierra was always thin, only because she lived in a society were that was very attractive. Deep down she was completely disgusted by how overly important being thin was to this society's beauty standards. On top of that, always having to be so thin was tiresome and it sparked a desire for a heavier life when she could move away from her home.<br>\r\n<br>\r\nName: Kristen<br>\r\nSpecies: Fox<br>\r\nAge: 19<br>\r\nHeight: 5'7\" (about 1.7 meters)<br>\r\nWeight: 180 lbs (about 81.65 kg)<br>\r\nBust size: E cup<br>\r\nBackground: An old friend of Cierra, Kristen moved from her home soon after the end of Freshman year in high school. Thanks to being away from the society she and Cierra grew up with, Kristen was able to start a gainer's channel on YouTube. In private, Kristen would entertain Cierra's desires for a heavier life through social media.<br>\r\n<br>\r\nName: Jaiden<br>\r\nSpecies: White tailed Deer<br>\r\nAge: 20<br>\r\nHeight: 5'5\" (about 1.65 meters)<br>\r\nWeight: 230 lbs (about 104.32 kg)<br>\r\nBust Size: DD cups<br>\r\nBackground: Coming from a different society, one mostly isolated from the rest of the world, Jaiden was always at least a little bit heavy. Since she turned twenty, her society's traditions called for her to gain weight, to show she was ready to become a leader. Although most girls her age accepted that they must gain weight, Jaiden was one of the more enthusiastic ones willing to gain as much weight as possible.<br>\r\n<br>\r\nName: Sarah<br>\r\nSpecies: Dragon<br>\r\nAge: 21<br>\r\nHeight:5'10\"<br>\r\nWeight: 360 lbs (about 163.3 kg)<br>\r\nBust Size: G cup<br>\r\nBackground: Like most of her ever hungry, large stomached draconian peers, Sarah is a heavy girl. She is very much against any form exercise and very pro filling her seemingly unfillable stomach, a view that comes from both sides of her family. Her non-dragon peers have learned to clear way for her, in fear of being run over. Many of her draconian peers have admired her size for the powerful additions it adds to her figure.</span></div></div>",
            "created":1477640040,
            "id":2229449,
            "title":"18-22, female, willing"
        },
        "132":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "belly video",
                "update",
                "swim suit video"
            ],
            "content":"<div class=\"\"><div> <span>Living in a society that dictates unnatural body ideals is unpleasant. Women across the country had endured the oppression from the thin supremists for too long. One city decided to take a stand against the diet industry and promoted a fat lifestyle for their ladies. Gracing the city with body positivity ads featuring heftier ladies made the women feel more comfortable in their body. Removing any media that advocated weight loss extinguished the obsession with diets. Opening various plus size clothing departments provided the ladies with fashionable outfits. The city even widened the chairs to accommodate the ladies' growing asses. The results were surprisingly positive. The economy boomed, divorce rates plummeted, birth rates skyrocketed, and above all, the women were happy.<br>\r\n<br>\r\nMany made their pilgrimage to the enlightened town. One fox girl by the name of Kristen, was one of them. Kristen moved to the city after spending her Freshman year starving herself. Despite making her suffer, Kristen's slim figure made her attractive. She had many friends but only one in particular really understood her. A wolf girl named Cierra. Kristen and Cierra hated how society demanded girls be so thin. It was so tiresome to maintain such a figure. More importantly they never felt sexy. The fox and wolf girl wanted curves. Huge tits, big butts, wide hips, and soft bellies. Unfortunately they would be chastised for gaining weight. <br>\r\n<br>\r\nMuch to Kristen's delight she moved to the city that defended a girl's right to gain. Cierra however, stayed behind in the morbid society that insisted on fat-less bodies. Cierra is still thin to this day. <br>\r\n<br>\r\nKristen however...<br>\r\n<br>\r\n\"Here's your cake ma'am\" said a fat catgirl waitress.<br>\r\n<br>\r\n\"Mmm this looks even better than the first two!\" Kristen licked her lips.<br>\r\n<br>\r\nSince moving, the fox girl had happily fattening up to a voluptuous 180 pounds. Kristen adored the changes, her breasts in particular. Thanks to her unrestrained diet, her bust grew to E cups which she loved flaunting. Her appetite has grown as did her culinary expertise. Exercise had become a forgotten relic of the past for Kristen thus creating more opportunities for other ventures. One new hobby she picked up was her gainer channel were she documented her growth and celebrate a plus size lifestyle. <br>\r\n<br>\r\nKristen pulled out her phone to take a selfie with her food. Dressed in a pair of tight short shorts which tightly hugged her booty, digging into her soft flesh, and a crop top proudly exposing Kristen's belly and her foxy cleavage, an outfit typical of the city, Kristen gave a taste of her life to her subscribers. <br>\r\n<br>\r\nCierra was one of her subscribers, loyal following every video Kristen uploaded. Enamored with her fox friend's life, the wolf girl kept up to date with her.<br>\r\n<br>\r\n\"Boy that was good!\" Kristen complimented. \"I'm looking bigger, I should really do a...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1564678560,
            "id":2695526,
            "title":"Kristen"
        },
        "1322":{
            "author_id":"thomasfan99",
            "author_name":"AWVR1206",
            "choices":[
                "Cafe.",
                "All-you-can-eat buffet.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"...update,\" she thought.<br>\r\n<br>\r\nKristen immediately set up her camera, pulled up her shirt to reveal her big belly, and started recording. An hour later, Cierra received a notification that Kristen posted a new video. Without hesitation, she pulled up the video and watched Kristen's new update video. \"Hello, everyone, this is Kristen Fox with a brand new update,\" the plump vixen began talking about the progress she has been making since her previous update, all while playing with her newly acquired fat, particularly her belly.<br>\r\n<br>\r\nCierra sighed enviously. She was proud of her fat friend for making it in a fat-positive society but also wished she could live there. Unfortunately, her parents expected her to finish high school before leaving home; thankfully, she didn't tell her parents that she wanted to live where she could become obese beyond her wildest dreams. <br>\r\n<br>\r\nYouTube wasn't the only way Cierra kept up-to-date with Kristen; they would also text each other on how they were doing. Kristen would chat about her new fat; Cierra always talked about how she was \"still starving,\" as they put it. \"Don't worry,\" comforted Kristen, \"once you get your chance, you'll be one of the fattest creatures ever.\" Cierra felt much better, even though words of encouragement from her fat friend always cheered her up. \"And when the day comes,\" Kristen added, \"I'll have a spare room waiting for you.\" Ever since Kristen moved, she promised Cierra that she would have a room for her future roommate, so that they would gain weight together. \"I can hardly wait,\" replied Cierra with determination.<br>\r\n<br>\r\nAfter the two friends finished their talk, Kristen felt her belly rumble. \"Time for lunch,\" she thought excitedly, patting her tummy. She had been making good money on ad revenue from her videos, so she could easily afford a big lunch; good thing too, since the bigger her tummy got, the more she had to eat to satisfy it. She decided to eat at a...</span></div></div>",
            "created":1586625540,
            "id":2817213,
            "title":"update"
        },
        "135":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Vanessa",
                "Zara",
                "No good, got anyone else?"
            ],
            "content":"<div class=\"\"><div> <span>Name: Vanessa Knight<br>\r\nSpecies: Holstein cow<br>\r\nAge: 19<br>\r\nHeight: 6’ 2” (about 1.88 m)<br>\r\nWeight: 120 lbs (about 58.98 kg)<br>\r\nBust size: DD cups<br>\r\nBackground: Finally freed from her overbearing mother’s control, Vanessa has been enjoying the college life more than most others. Eager to try new things, she has so far managed to balance her studying and partying. She is also more than a little interested in finally getting some romance in her life, something that she missed out on earlier in her life.<br>\r\n<br>\r\nName: Zara Cooper<br>\r\nSpecies: Irish setter<br>\r\nAge: 21<br>\r\nHeight: 4’ 10” (about 1.47 m)<br>\r\nWeight: 85 lbs (about 38.56 kg)<br>\r\nBust size: A cups<br>\r\nBackground: The smallest among seven siblings, Zara has always had to hit well above her weight. Recently accepted to her local police academy, she has borne the brunt of heckling and worse from her fellow trainees, but hasn’t let it get her down. She has already scored exceptionally and shown great skill in dealing with people larger than herself, a skill she had to pick up while dealing with siblings that tended to be around twice her size while growing up.</span></div></div>",
            "created":1551167700,
            "id":2623237,
            "title":"More willing female 18-22 year olds"
        },
        "1353":{
            "author_id":"mr_j",
            "author_name":"Dragos Drakkar",
            "choices":[
                "Jessica",
                "Yasmine",
                "No good, got anyone else?"
            ],
            "content":"<div class=\"\"><div> <span>Name: Jessica Taylor<br>\r\nSpecies: Black dragon<br>\r\nAge: 22<br>\r\nHeight: 5’ 11” (about 1.80 m)<br>\r\nWeight: 205 lbs (about 92.99 kg)<br>\r\nBust size: D cups<br>\r\nBackground: Jessica is a struggling writer hoping for her big break. She can barely keep a schedule and is often running late no matter what she might be doing. This caused her single mother no end of grief while growing up.  Her previous works bring up just enough for her to scrape by, but she doesn’t even have a clue for her next novel.<br>\r\n<br>\r\nName: Yasmine Toyama<br>\r\nSpecies: Collared reed snake<br>\r\nAge: 18<br>\r\nHeight: 5’ 7” (about 1.70 m<br>\r\nWeight: 180 lbs (about 81.65 kg)<br>\r\nBust size: C cups<br>\r\nBackground: Yasmine can be summed up in one word: slacker. The less she can get away with doing, the better for her. Her school life has mostly been cozying up to the smartest person in the class and leeching off of them the entire time. The one class she has done some of her own work in is the Culinary Arts program, where she can test her limits beyond the far more traditional food that she gets at home.</span></div></div>",
            "created":1551168360,
            "id":2623239,
            "title":"More willing female 18-22 year olds"
        },
        "15":{
            "author_id":"cynderfan",
            "author_name":"Fan of Spyro",
            "choices":[
                "18-22, male, unwilling",
                "23-26, male, unwilling",
                "18-22, female, unwilling",
                "23-26, female, unwilling",
                "18-26, both sexes, neutral"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More age, sex, and willingness to gain weight</span></div></span></div>",
            "created":1474765140,
            "id":2214271,
            "title":"Let's begin (con't)"
        },
        "151":{
            "author_id":"civfrog992",
            "author_name":"Dark Dragon",
            "choices":[
                "Victor replaces Matt's protein powder with weight gain formula",
                "Victor befriends Matt",
                "Victor takes advantage of Matt injuring himself in the gym"
            ],
            "content":"<div class=\"\"><div> <span>     Matthew, Matt, is a 20 year old, 6 foot 5 inch tall, 187 pound blue tiger and a sophomore in college. All his life, he's been rather athletic, never being on less than one sports team throughout his entire primary schooling though he decided not to focus on sports while in college and instead on just putting on muscle. To that extent, he spends a lot of time in the gym and counts every calorie meticulously. The results has been the Freshman 15 entirely in pure muscle added onto his already muscular frame in just over a year.<br>\r\n     This growth has been impressive to almost everyone he's met except for one, his new roommate.<br>\r\n     Victor is a lion and not nearly as impressive as Matt is. At only 5 foot 9 and 150 pounds, he doesn't like looking up to his roommate and has promised to become the King of the Campus himself. He just needs to get Matt out of the way. To that degree, Victor has been plotting and has finally figured out what he wants to do to Matt.</span></div></div>",
            "created":1551133740,
            "id":2623036,
            "title":"Matthew"
        },
        "1511":{
            "author_id":"civfrog992",
            "author_name":"Dark Dragon",
            "choices":[
                "The appetite stimulant kicks in before his workout",
                "The stimulant turns out to be slow acting",
                "The stimulant doesn't have any effect on Matt"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Victor! Would you throw together a protein shake for me?\"  Matt shouted from his room where he was getting ready to head to the gym.<br>\r\nVictor rolled his eyes as he got up from the couch. It wasn't unusual for him to be the one to make the shakes for Matt even though he would never be allowed to even taste them. <br>\r\nBut for once, Victor was grinning as he made the shake. Matt was a jerk to Victor, always teasing him for being shorter and not as buff. Well, that was all going to change. Since Matt only ever touched the protein powder except when he bought it from the store or in shake form, Victor had taken the initiative to switch the protein powder with a much less beneficial, and much higher calorie, weight gain powder.<br>\r\nVictor did everything he was supposed to with the altered shake to make it look and taste exactly like it should have and then just for added measure, he placed in a little appetite stimulant which he quickly shook in.<br>\r\nMatt came out and snatched the mixer bottle from Victor's hand.<br>\r\n\"Thanks man.\" Matt said as he threw the bottle into his gym bag and headed out the door. \"I'll be back in a couple hours.\"<br>\r\n\"I know the routine Matt.\" Victor groaned. \"Have a good time.\"<br>\r\n\"At the dining hall.\" Victor chuckled as the door closed behind Matt.</span></div></div>",
            "created":1553141580,
            "id":2632899,
            "title":"Higher Calories with the same great taste"
        },
        "152":{
            "author_id":"civfrog992",
            "author_name":"Dark Dragon",
            "choices":[
                "Lion",
                "Wolf",
                "Tiger",
                "Rabbit",
                "Other type animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So this is an anthro story. Which type anthro did you want to follow?</span></div></span></div>",
            "created":1595879280,
            "id":2876368,
            "title":"23-26, male, unwilling"
        },
        "1523":{
            "author_id":"civfrog992",
            "author_name":"Dark Dragon",
            "choices":[
                "Isaiah's shake causes massive weight gain",
                "Drinking from the bottle makes him hungry",
                "The spell interacts with Isaiah's protein powder"
            ],
            "content":"<div class=\"\"><div> <span>          Isaiah grinned at his reflection. He'd been working on his body for years and his first contest was closing in. That was no reason to slack off. He could justify mirror breaks like this as \"posing practice\" but even that would have to come to an end or he'd lose all his hard work!<br>\r\n          Tearing his eyes away from the mirror, he headed back over to the bench press...<br>\r\n          \"What do you think you're doing?\" he growled at a scrawny German Shepard that was starting to unplate the barbell he'd left there.<br>\r\n          The poor dog gulped, realizing his mistake. At this gym, everyone knew never to cross Isaiah.<br>\r\n          \"I'm sorry! I didn't know you were still using it!\" He tripped over himself trying to get out of the tiger's way as fast as possible.<br>\r\n          Grumbles came from all corners of the gym. This behavior from Isaiah was not uncommon but that didn't mean that they liked it.<br>\r\n          In the far corner, a salamander had enough. He'd been practicing magic for some time and although he had sworn he would never cast a curse, he'd had enough of Isaiah's antics! This decision was made worse for him since it would mean he'd end up with some massive personal gain repercussions for he was also scheduled to show in the same bodybuilding contest, but he didn't care at this point.<br>\r\n          While Isaiah was working on enlarging his already massive pecs, the salamander made his way back to the locker room. Isaiah made have been strong, but he wasn't that smart. He always left his locker unlocked figuring everyone knew who's locker it was and what he would do if to them if they disturbed his stuff. It was a rule the salamander was now breaking.<br>\r\n          Opening the locker, he pulled out the shaker bottle that Isaiah used for all his after workout shakes. Mumbling some words in an ancient language known mainly to salamanders, the bottle glowed for a moment. His work done, the salamander headed back out to finish his own workout.</span></div></div>",
            "created":1595881680,
            "id":2876382,
            "title":"Isaiah, the Aspiring Bodybuilder"
        }
    },
    "info":{
        "author_id":"cynderfan",
        "author_name":"Fan of Spyro",
        "brief_description":"Anthros start gaining a lot of weight.",
        "created":1368469800,
        "description":"<td align=\"left\" class=\"norm\">Young adult anthros start gaining weight at alarming rates. The cause is yet unknown and is making headlines globally. A cure is unlikely to arrive quickly, but progress is slowly being made as the youths keep getting heavier. Will a cure be discovered in time or will young adults live out the rest of their lives immobilized and ever gaining? You get to follow their stories. Please keep characters your own and between ages 18 and 26.</td>",
        "id":1933253,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595881680,
        "modified":1595881680,
        "pretty_title":"Anthro Young Adult Weight Gain"
    }
}