{
    "chapters":{
        "1":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Now I'm hungry! (Author's choice)",
                "You made me angry; time to start the worshiping! (Author's choice)",
                "You made me angry; time to start the worshiping! (Reader's choice)",
                "You made me angry; time to start the worshiping! (Reader's choice)",
                "You made me angry; time to start the worshiping! (Reader's choice)"
            ],
            "content":"<div class=\"\"><div> <span>First school year of hell over with! You're Matt, a kid who just finished freshman year. You should feel excited about finishing arguably the worst year of high school! Summer break is here! You should be positively giddy at all the possibilities! <br>\r\n<br>\r\nNot for you, well, maybe a few possibilities. Most of the time will be spent in service of your sister, Leslie! She has forced you to do this for as long as you can remember! Her favorite way is by forcing you to either smell, kiss, or lick her feet! In her words, \"worshiping my feet is humiliating, unpleasant, and establishes dominance, but it won't kill you, keeping me out of trouble! If mom even cares!\"<br>\r\n<br>\r\nYou get home, sling your bag in the corner, and cross the hallway, and down two or three steps to the living room couch. You ALWAYS had to get home before Leslie got home, because you knew that once she did, your duties began! You got, maybe, a blessed minute or two before she came home from the same school. She dawdled because she had friends that she walked home with. <br>\r\n<br>\r\nAbout five minutes, Leslie announced \"WOO HOO! Summer! Matty? I got you a present for finishing Freshman year!\"<br>\r\n<br>\r\nIt's really amazing how fast a smile of relaxation can turn to a grimace of despair! You're not falling for Leslie's tactics! \"Fuck off, Leslie!\"<br>\r\n<br>\r\nLeslie had an infuriating habit of taking away any insults power! She replied, \"I will, later! But first I want to show you your present!\" She came in to stand in front of you! \"Come on, bro, come with me, it's on the dining room table! Follow me!\" She led the way up to the dining room table. On it sat a sci-phi looking laser gun.<br>\r\n<br>\r\nYou looked at the gun and then at Leslie, \"seriously? How old do you think I am? I'm not gonna be amused by a toy laser gun!\"<br>\r\n<br>\r\n\"Nicole gave it to me. Said she got it from some guy she met when she noticed him following her out of Music World. To be honest, she was too afraid to try it out. Then today, I saw it poking out of Nicole's pocket, and I asked her about it, and she was all like 'Some creepy stalker dude gave it to me, but I don't trust it! Do you want it?' And I was like, sure! You know the summer worshiping ritual you do? Well, wanna see if something good happens when I use that?\"<br>\r\n<br>\r\nYou were about to say no, but Leslie picked up the gun and shot you. Your body became filled with a warm sensation that slowly spread throughout the body, and then it turned cold. \"It's a temperature gun!\" Everything slowly started getting bigger,  \"Leslie! Why is everything growing?\"<br>\r\n<br>\r\nLeslie smiled, and said \"everything's the same! Except you! You're shrinking! Oh, good! Well, for me! This will make it easier for you to worship my feet!!\" She started laughing, and said \"Sorry bro! I'd help you, but I actually find this pretty funny! Good news for you, though, you will never have to go back to school! Wait here, I left my phone in my bag, I'll be back in a second!\" <br>\r\n<br>\r\nYour height was slowly shrinking! You had to hide quick! Climbing onto one of the dining room chairs, and then into a box of Sugar Pops that was left out, After a second, you cursed yourself for forgetting that they were Leslie's favorite cereal!<br>\r\n<br>\r\nLeslie came back from the entrance way. \"Okay, bro, now hold still and don't forget to...\" She looked up from her phone, and saw you were gone! \"Where did you go?\" She saw the side of the cereal box bulge out a bit. \"Oh!\" She went and got a bowl, and poured herself a bowl of Sugar Pops and Matt. When she saw you she clapped her hands together \"Oh my god! You're so cute at that size!\" You were 2 inches tall. \"Think you were being clever, huh. Hiding in my FAVORITE cereal? Well the jokes on you, because...<br>\r\n<br>\r\n</span></div></div>",
            "created":1530404220,
            "id":2513601,
            "title":"What a horrible last day of school"
        },
        "11":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes, you manage (author's choice)",
                "No, you don't (author's choice)",
                "(Reader's choice)",
                "(Reader's choice)",
                "(Reader's choice)"
            ],
            "content":"<div class=\"\"><div> <span>\"Now I'm hungry!\" Leslie gets up to go get a bowl, a spoon and some milk.<br>\r\n<br>\r\nYou had to act fast! Escaping the cereal box is now your goal, but it was hard to get up over the side, because of the round nature of the Sugar Pops; every time you get a foothold on one of the Pops, it slips out from under you. You try to move your feet faster, to try to gain momentum, but it just slips out faster. You start to panic, as you hear approaching footsteps, and try to reason it out. 'She won't ACTUALLY eat me, right?'  You begin to calm down, as you think 'no, she wants to force me to worship her feet!'<br>\r\n<br>\r\nLeslie returned, and with a clang,dropped the stuff on the table. Next, Leslie turned your little world upside down as she poured some of the cereal. Leslie chuckled, and said \"like one of those prizes in cereal boxes!: Next she poured the milk in, making you a little cold from the coolness of the milk. \"I don't WANT to eat you bro, but I will if you end up on my spoon!<br>\r\n<br>\r\n'She's really going through with this!?' <br>\r\n<br>\r\nAs Leslie ate, you really tried to avoid being on her spoon when she lifted it out...<br>\r\n<br>\r\nBut do you manage?</span></div></div>",
            "created":1530553860,
            "id":2514149,
            "title":"Now I'm hungry!"
        }
    },
    "info":{
        "author_id":"numerio",
        "author_name":"Tex",
        "brief_description":"A remake of one of my favorites by another author, who deleted their account. ",
        "created":1530391680,
        "description":"<td align=\"left\" class=\"norm\">A story about trying to escape your fate!<br>\r\n<br>\r\nYou're Matt, a semi-normal, a 16 y/o kid of 5'6\". It's the end of your Freshman year, and you're already sick of High School. You're a bit of a loner, so you don't really talk to anybody. You do have several crushes, though. One of them, Cassie, goes to the school. You can never think of what to say to her, so you have to rely on your decent looks, to get her to notice you. It sucks! Coming home isn't any better, because your sister, Leslie, forces you to smell her feet, and worship them, knowing full well your intense fear of feet! Whatever else she needs doing, but doesn't want to do herself, forces you to do for her!<br>\r\n<br>\r\nYour older sister, Leslie,17, always made you smell her feet when you were growing up, and still does to this day! She gets away with a lot more than she should, probably because of her ability to twist speech! What's worse is that she does it to you because she knows that's the one thing you hate, knowing your phobia! She can't really be classified an \"athlete\" per se, although she enjoys being active; thus making her feet even worse for you! <br>\r\n<br>\r\nYou have another older sister, Kristin, who's 21. She's in her first year of the local university. To save money, she just lives at home. Being a gamer, She keeps to herself, most times.  But when she does interact, it's usually to join Leslie in torturing you!<br>\r\n<br>\r\nYour \"mother\" Martha (or Leslie's mother), dotes over Leslie too much. To her, she hit the genetic jackpot when she birthed Leslie! In fact, the only reason she had you was because she hoped she'd make another Leslie. So the only time she really pays attention to you is when you don't collide with what she's planning!<br>\r\n<br>\r\nOther characters:<br>\r\n<br>\r\n(All four characters are Leslie's friends, and none of whom know that she regularly tortures you!)<br>\r\n<br>\r\nJennie: 17, the only athlete of the group, Jennie is a superstar soccer player. <br>\r\n<br>\r\nNicole: 16, your typical high school girl. She likes music; Music World is her second home!  <br>\r\n<br>\r\nSally: 17, the health nut of the group, Sally sometimes annoys the others with her factoids.<br>\r\n<br>\r\nFinally Jenn: 17,and is quick to capitalize on any situation. Maybe that's why she also gets the best marks in her class. As such, she's grown up to be a brat.<br>\r\n<br>\r\nI only have one rule: keep the physical descriptions of characters out of it! I want you to imagine your own looks for characters. I don't want you stuck with a brown hair person if it doesn't work for what you're writing!<br>\r\nOh, one more rule, try to keep with the story line!<br>\r\nHAVE FUN!<br>\r\n<br>\r\nPS. I had saved much of the original story! So, for those chapters, I'll tweak them to make them fit with the new story!</td>",
        "id":2162326,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1530837900,
        "modified":1530837900,
        "pretty_title":"Life At My Big Sister’s Feet "
    }
}