{
    "chapters":{
        "1":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "John Madden single college freshman at home ",
                "Jay Nelson store owner at work",
                "Tammy Johnson stay at home mother at the presentation ",
                "Someone asking the desk about customtion",
                "Free Spaces"
            ],
            "content":"<div class=\"\"><div> <span>\"After this presentation, you may order one for yourselves at the desks near the entrance and on our website for those on their phones and computers,\" The keynote said waving his hand to the door, releasing the realistic robots wander off stage. This made the crowd go with woos and hollers, one going so far as to shout \"THANK YOU\" loud enough for the presenter to hear him. Giving a small laugh, he quipped back, \"YOU'RE WELCOME\"<br>\r\n<br>\r\nAnd while all this is fine and good, where and who are you?</span></div></div>",
            "created":1562821200,
            "id":2685504,
            "title":"Introduction to the future "
        },
        "12":{
            "choices":[
                "a fem-boi bot",
                "a masculine-girl bot",
                "a twink",
                "copy of a celebrity ",
                "more choices"
            ],
            "content":"<div class=\"\"><div> <span>Jay Nelson looked away from the TV monitor showing the news cast of the new androids that had just came out for sail and thought maybe he should get one to help him in the store.  While it might be dead at the moment when the school and work day ended the store was usually packed and too much to handle by himself.  Having one of those androids would be cheaper in the long run than hiring some help.  Taking advantage to the free time Jay pulled up the site of the android sellers and began to go through the products.  \"Man they were not lying about the different body types,\" Jay said as he scrolled through screens of fem-looking boy bots, masculine female bots, twinks, bears, even some in costumes like cheerleaders (both male and female) maids/butlers there was even a link to make the androids look like celebrities or even scanning a picture to get a full custom one.<br>\r\n<br>\r\nLooking through all the options Jay finally chose </span></div></div>",
            "created":1562821200,
            "id":2685529,
            "title":"Jay Nelson store owner looking for help at work"
        },
        "123":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "The day it  arrived",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, think I'll go with him since he might bring in the guys, \" Jay thought out loud picking the slim male model. Clicking on to the next page, the storekeeper was met with a big blue button just asking to be pressed reading customize with three presets below. \"And don't really need to customize him so let's go with you,\" he said selecting the preset that was 5'6 with dirty blond hair and grey eyes.<br>\r\n<br>\r\nNext was a page of sliders and other options. Carefully read through each one Jay choose choices he felt like could help at the store and slid the sliders to be more on the friendlier. \"Can't have the place turn into terminator after all, \" he jokes reading the next slider, \"How submissive or dominate do you want your robot to be?\" figuring it would be better for it to listen to customers he set it to the bottom of the submissive end. But unknown to him this turned the twink bot into an obedient slave, following any order given to him and bottom for anyone who called for it...</span></div></div>",
            "created":1562907600,
            "id":2685579,
            "title":"a twink"
        },
        "1231":{
            "choices":[
                "in a version of a boy scout uniform",
                "tight short shorts and a white tee shirt",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>A few days latter during the slow part of the day a van from Android company pulls up.  Jay is surprised to find the driver was actually another android as he saw a glowing band around the left leg of the guy.  \"Hello to you sir I have your order for you right here,\" the delivery android said pulling a large box out of the back of the truck.  \"Will you need any help in unpacking or initializing your bot today sir?\" the android asked but Jay just said no leading to the delivery bot to give him a nod drive away.<br>\r\n<br>\r\nJay used the hand cart for loading his supplies to move the large box into the back of the store and immediately opened the box.  Jay googled at the twink bot for one thing it had been shipped without any clothing and was so lifelike it was startling to see it standing in the box.  Jay pulled the twink bot out and found the charging station in the right armpit and started to charge the bot as he checked out what else was sent with the it.  He breathed a sigh of relief when he founds some clothing for the bot for while he wanted to attract customers a naked fully life like twink bot might bring in the wrong sorts of clientele.  <br>\r\n<br>\r\nJay's phone suddenly beeped and looking at it he found that during the charging of the twink bot it had interacted vie the wi-fi with his phone due to it being the way he had ordered the bot.  A infor-graphic appeared on the screen topped with the name he had chosen for the bot, Cody, with all the bot's stats underneath it.  It must have been pre-charged or maybe just fast as Cody was close to being able to be turned on.  Giving the screen a quick glance Jay pocketed his phone as he grabbed and outfit for Cody to wear.  In the end Jay decided to dress Cody....</span></div></div>",
            "created":1562907600,
            "id":2685849,
            "title":"The day it  arrived"
        },
        "12312":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Skip to the mall",
                "Ride to the mall",
                "Go the a second hand store"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, let's turn you on, so you can dress yourself,\" Jay said to to the inactive twink not. Throwing the clothes at Cody's feet, Jay reached behind one of his ears. The robot's eyes blinked open slowly looking up at Jay, and let out a soft moan that the shopkeep played off as a groan. \"You okay there buddy, \" The man asked not sure how the robot was supposed to look like when booting up. \"Yes. Are you Jay?\" Cody asked back with an innocent look in his eye. \"Yea, I'm Jay. I bought you so you can help me at the store.\" Jay said introducing himself to the Twink. \"Okay,\" Cody nodded with a bit more energy.<br>\r\n<br>\r\n\"Can you get dressed by yourself because I have to grab a thing or two before we go shopping?\" Jay asked taking a step back. \"What are we going for, \" Cody replied skipping the first question entirely as he reached for the shorts. \"Some clothes for you. Can't exactly have you showing that much skin while bagging.\" Jay said reaching the doorway, but not leaving. He wanted to make sure he could get dressed by himself, so he waited and watched him put on the shorts.<br>\r\n<br>\r\nFirst Cody stretched them out in front of himself as to measure if they would fit. Deciding they would he turned away from the door and stepped into them. Reaching down, he took a wider stance than most people would, arching his back as the fabric slid along his slim calves to his round thighs and bubble like butt. Getting a grip on to his own packaging, Cody bent at his waist to pick up the shirt, shaking his hips at Jay all the while. Whilst watching Jay started noticing little things, like how tuned the robot's legs were, or how soft his ass looked before it was covered, or even that his penis was getting hard by being watched. \"You weren't the only one kid, \" the shopkeep thought, adjusting himself before leaving the room...</span></div></div>",
            "created":1562994000,
            "id":2686222,
            "title":"tight short shorts and a white tee shirt"
        },
        "123123":{
            "choices":[
                "Cody comes forward with his pile of new clothes",
                "Cody meets the other Android"
            ],
            "content":"<div class=\"\"><div> <span>\"Come along Cody if you are going to work in the store you will need some more outfits,\" Jay said.  \"And some less provocative ones don't want you to show off to much otherwise I might have to shut down,\" he added to himself as Cody walks over and wraps his thin arms around Jay's right one.  Jay just smiled down at him as he used his left hand to muss Cody's hair before they walk to a nearby second hand store know as <i>Second Times the Charm</i> which had a great selection of items and would hopefully have some clothes Cody's size.  Arriving at the store Jay lead Cody to the clothing section and told him to pick out a couple of outfits as Jay went to talk to his friend who owned the store.  <br>\r\n<br>\r\nAs Jay chatted with his friend Cody found some great outfits, including a mesh top, a pair of brown short shorts (that when he held them to his body his memory files conjured images of Misty from the anime series of Pokemon in the early seasons) a rainbow tank top with \"It's My World\" printing along the front.  Cody also found a wide selection of underwear from tighty-whities, boxers, male thongs, and even a g-string.  Cody had to bite his left hand thumb at all the great finds in this story as he wondered which ones he should choose to get. <br>\r\n<br>\r\nMeanwhile Jay was talking with his friend he noticed that for once his friend was not the only one working in the store.  Jay was about to ask if his friend had finally decided to hire some help when he noticed the pulsing color line on the teen's right ankle showing the kid was another Android.  Jay tilted his head though for Cody's color had been bright baby blue while this one was a deep forest green.  \"So I see you got one of those Androids as well,\" Jay said as he friend could only nod having just taken a drink.  \"Do you know if the color means anything for my Android has a blue coloration yet yours in green?\" Jay asked.<br>\r\n<br>\r\n\"Oh that it is sort of a sign of what type the Android is a blue color is a bottom the brighter the more submissive the Android, white is neutral, black is a rouge one, green is a dominant one, and red is one that the owner makes it switch from topping to bottoming,\" Jay's friend explained reading the info from his owner manual.<br>\r\n<br>\r\n\"Ah surprise they can advertise that fact to the public,\" Jay said blushing at how he and his friend now knew which position they preferred to be in a relationship at least in Jay's mind.</span></div></div>",
            "created":1563080400,
            "id":2686524,
            "title":"At Second Times the Charm"
        },
        "1231232":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "A weak yes",
                "They are intercepted",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi there, \" a voice called behind Cody, turning to look over his shoulder he was met with the other Android. \"My name's Steven, do you need help with anything, \" he asked closing in on the other robot. Scanning the new Android, Cody found that this one had a wider frame than he did, and was an inch or two taller. He even had a green light to signify his dominance.<br>\r\n<br>\r\n\"Hi I'm Cody and yes you can,\" Cody smirked grabbing the thong and g string. \"Which do you think would better with mesh,\" he asked not wanting to disappoint his owner. Humming, Steven started staring at the twink's pelvis but was distracted by his erection had gotten. \"I would rather be dealing with this, \" Steven growled into Cody's ear, palming the Twinks hard cock. \"Do you want me to deal with, \" he asked giving it a single stroke...</span></div></div>",
            "created":1563080400,
            "id":2686544,
            "title":"Cody meets the other Android"
        },
        "12312321":{
            "choices":[
                "Jay drags Steven's owner back their for their own fun",
                "Steven's owner shows up looking for the pair"
            ],
            "content":"<div class=\"\"><div> <span>When asked a yes/no question due to the ultra submissive setting Jay had assigned him there was only one response for Cody to give.  So looking up at the dominant Android, Cody leaned in pressing his slim body against Steven's frame and whispers in the other's ear, \"Yes.\"<br>\r\n<br>\r\n\"Good boi,\" Steven said as he took hold of Cody's left hand and pulled the un-resisting twink bot into the back.  As this, according to his programing, was even more important than shopping for clothes Cody dropped the thong and g-string as he allowed himself to be pulled along.  Once they were safely in the back and away from the eyes of the customers Steven took on an even more aggressive hold as he pushed Cody into a wall before leaning down and claiming those lush twink bot lips.  Cody let out an moan at the kiss but also the treatment as Steven grabbed both of Cody's hand and lift them over the Android's head and holds them there with his right hand as his left hand begins to run its way sensually down Cody's side making the twink bot wiggle and get erect.  Steven feels the twink bot's erection poking him in his thigh and smiles in the kiss before he breaks it, and even though neither of them needs to actually breath the pair act out their programing as they take a moment to catch their breath.  \"Well someone is an eager boi,\" Steven said right into Cody's ear bringing a shiver down Cody's slight frame.<br>\r\n<br>\r\n\"Yes sir,\" Cody said leaned towards Steven as much as he could with his hands stilling being held above his head.<br>\r\n<br>\r\n'Good now let's see what we have to work with,\" Steven said as he hooks a finger into the waistband of Cody's short shorts and underwear he is about to pll them down when....</span></div></div>",
            "created":1563080400,
            "id":2686615,
            "title":"Following their programming "
        },
        "123123212":{
            "choices":[
                "you did not invite me to play with him",
                "Jay should be the first one to play with him"
            ],
            "content":"<div class=\"\"><div> <span>Just as Steven was about to pull down Cody's clothes and reveal the twink bot's cock the door to the back opens and in walks Steven's owner, Charlies.  \"Ah I thought so when I could not find you and Cody was not in the clothing department,\" Charlies said crossing his arms at the pair of Androids.<br>\r\n<br>\r\n\"What is the big deal Charlie?\" Steven asked still holding Cody's arms above his head using one of his.<br>\r\n<br>\r\n\"Well for one we may have customers waiting such as Cody's owner, but more importantly Steven....</span></div></div>",
            "created":1563080400,
            "id":2686625,
            "title":"Charlies came looking for the pair"
        },
        "1231232122":{
            "choices":[
                "Cody finds Jay on the sales floor",
                "Cody finds Jay in the bathroom",
                "Jay is ready to go, both gets into his car.",
                "Open"
            ],
            "content":"<div class=\"\"><div> <span>\" You know Steven, Jay should be the first one to play with him \" as Charlie looks at his aggressive droid, letting Cody's hands loose now, Steven responded \" well I agree Charlie but I don't think that Jay really understands what type of droid that Cody is, I mean Cody told me that he hasn't even flirted with him once \" .<br>\r\n<br>\r\nCharlie looked to Cody \" Is this true Cody ?  Has Jay not even touched you yet ? \" <br>\r\n<br>\r\nShyly Cody answered \" N..no sir, I have flirted with him but he shows no interest \" as Cody slowly walks towards Charlie.<br>\r\n<br>\r\n\" Well I guess we are going to have to turn your forwardness up quite a bit then, I guess you are going to have to make Jay want to play with you Cody .  Come here boy I will turn up your settings\"  as Cody turns around and Charlie adjusts your settings, both Charlie and Steven both sees the difference right away, Cody has become more aggressive and confident.<br>\r\n<br>\r\n\" Go get him Cody, and have some fun \" .</span></div></div>",
            "created":1563080400,
            "id":2686631,
            "title":"Jay should be the first one to play with him"
        },
        "12312321222":{
            "choices":[
                "pulls down Jay's pants to reach the cock (Cody is a power bottom)",
                "turns Jay arround to take his owners ass (Cody is a top)"
            ],
            "content":"<div class=\"\"><div> <span>It was never hard for an Android to get lost from their owner or the other way around due to the connection vie the app for the Android the owner kept.  And since Jay kept his app on his phone Cody was able to easily find his owner just as he was getting done in the shop's bathroom.  \"Oh hey Cody did you find some good cloths,\" Jay said waving at his twink bot as he noticed Cody walk showed a little more confidence in it.  Rather than answering Cody uses Jay's tie to pull his owner down into a kiss as he pushes the pair of them back into the bathroom.  Jay was so shocked he allowed himself to be basically manhandled by Cody until they were inside and the twink boy had closed the door with his right foot.  Breaking the kiss Cody reached behind himself and locked the door.<br>\r\n<br>\r\n\"You have ignored my flirting since you started me up but that ends now,\" Cody said a slight huskiness to his voice as reaches for Jay's button down shirt and rips it open revealing Jay's lean chest.  Jay blushes but makes no move to stop as Cody leans in and begins to run his tongue around his left nipple making it harden a bit while the twink bot's fingers played with the other one to harden it as well.<br>\r\n<br>\r\n\"Well were did this come from,\" Jay asked a little confused but not really caring for he was used to being the dominant one in a partnering and was finding it a little thrilling that his sort of femtwink bot was the one who seemed to be calling the shots at the moment.<br>\r\n<br>\r\n\"Nowhere,\" Cody said simply before returning to his nipple play with Jay who threw his head back and let out a slight moan just as Cody used his free hand to rub Jay's clothed crotch.  \"Well it seems I was not the only one eager for this,\" Cody said as he pulls away leaving Jay panting for a moment at the lost of sensation to his hard nipples.  Cody than shocks Jay as he....</span></div></div>",
            "created":1563080400,
            "id":2686643,
            "title":"Cody gets aggesive "
        },
        "123123212221":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Vibrating Cock Ring",
                "Pair of Handcuffs",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Finally, \" Cody moaned watching his owner cock rise after having his boxers rugged until it was released. \"I felt like something was off when you turned me on, and this was it, \" the blond remake taking a hold of it. Giving a few pumps, Cody smiled watching Jay struggle, but his cock harden. He leaned in and kissed the tip of the shaft. \"Are you close baby, \" the robot asked pumping in a constant rate.<br>\r\n<br>\r\n\"No\" Jay exhaled feeling as if he was as hard as he could get. \"Well like a lot of things, that is going to change.\" The twink said slowly crawling up to his chest again and bite his nipple. The human threw his head back but was caught by a hand that pulled to Cody's face. With little ease, he leaned in and kissed Jay. And within seconds a tongue slipped in.<br>\r\n<br>\r\nWhile the two were kissing, Jay started to leak precum. Feeling it, Cody withdrew his hand from the erection and into his short's pocket. Breaking the kiss, Cody watched as his owner catch his breath. \"You know, I grabbed this while looking for clothes. I was going to give it to you so you can use it on me, but I might have to use it on you, \" he said revealing a...</span></div></div>",
            "created":1563080400,
            "id":2686665,
            "title":"pulls down Jay's pants to reach the cock (C..."
        },
        "1231232122212":{
            "choices":[
                "starts giving Jay a blow job",
                "takes off his shorts revealing his own erect cock"
            ],
            "content":"<div class=\"\"><div> <span>Jay's mouth falls open as he sees Cody spinning pair of handcuffs around a finger but before he could say anything the dominant twink bot opens both cuffs and slips them around Jay's wrist before closing them again.  \"Um you did find the keys they goes with these right?\" Jay asked tugging his wrist apart as far as the cuffs would allow.  Rather than answer the blonde twink bot grabbed a hold of the chin connecting the cuffs and lifts them upward and hooked them on the bathroom's coat hook.  \"Hey,\" Jay began only to be silenced as Cody gave him another kiss as one hand went back to the nipples and the other took hold of Jay's hardening cock.<br>\r\n<br>\r\n\"Now time for real fun,\" Cody said breaking the kiss with a small bite to Jay's bottom lip almost hard enough to draw some blood.  \"You may protest that you don't like this but your body is saying something quite different,\" Cody said as he brings up a pre drenched finger and sticks it in Jay's mouth and letting his owner suck his own juices off the twink bot's digit.  Once the pre had been sucked clean off his finger the femish twink bot sunk to his knees and took hold of his owner's cock in both his hands as he began to jerk Jay off.  Jay could only bang his head into the bathroom wall and let out a moan as the Android expertly worked his cock bringing it up to his full erect state of seven and a half inches.  \"Now that's better time for some real fun,\" Cody said giving Jay's cock head a kiss before he....</span></div></div>",
            "created":1563080400,
            "id":2686679,
            "title":"Handcuffs"
        },
        "12312321222121":{
            "choices":[
                "free his hands so he could take a more active part",
                "fuck him "
            ],
            "content":"<div class=\"\"><div> <span>After the bound Jay's cock head a kiss Cody winks up at his owner as he opens his mouth as wide as a normal human could and brought it over the top of the cock.  Jay goggled at the blonde twink bot's head bob up and down on his cock like a pro finding it rather sexy as Cody kept eye contact with him at all time.  Jay wished his hands were free so he could run them through Cody's curly hair but he still could not get the cuff chain off the coat hook above his head and the blow job from Cody was so good he was barely able to form intact words let alone asking Cody to get his hands down.<br>\r\n<br>\r\nCody despite being a femish Twink Android was not totally in charge as he brought his left hand up to play with Jay's shaven balls while the other reached around and began to play with his owner's butt.  Even though Androids did not need to breath Jay could have sworn that he was feeling a breath brush across his stomach coming from Cody's nose.  Jay suddenly noticed that the colored line around Cody's left ankle had changed color it was no longer Blue for a full submissive but more red for a bot that switched between topping and bottoming which explained his new attitude.  As Jay was unaware of Steven and his owner, Charlies upping Cody's dominant levels Jay could not figure out the change maybe the bot had detected something about him that he was not aware of.<br>\r\n<br>\r\nSoon that thought line was gone from his head as Cody brought his tongue into play as he let it roll clockwise around the girth of Jay's cock bringing out a new sensation just as Cody pushed one of his fingers into Jay's ass, something none of Jay's previous partners had ever done to him before.  Jay began pant as he felt a climax approaching but it was as if Cody felt it as well as the twink bot backs up and let's Jay's cock flop out of his mouth with a small line of saliva connecting Cody's mouth and Jay's cock.  With Cody no longer expertly working on his cock Jay was finally able to speak as he begs the newly dominant Android to...</span></div></div>",
            "created":1563080400,
            "id":2686773,
            "title":"starts giving Jay a blow job"
        },
        "123123212221211":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Penis was the same size as Jay's",
                "Penis that was exchanged for a bigger one"
            ],
            "content":"<div class=\"\"><div> <span>Humming, Cody traced the length of Jay's hard penis with a single finger as he rose from his kneeling position. \"Couldn't if I wanted to, and I kinda don't want to, \" Cody remarked inches from Jay's lips. \"Would has to ask a worker, and I don't think you would want them to see you like this, \" the twink teased, popping his fingers back into Jay's mouth. Giving no resistance, the human sucked on them as Cody went back to stroking him.<br>\r\n<br>\r\nSatisfied with the with how he sucked, Cody withdrew his digits only for Jay to speak again, \"Can you at least take me off the hook? Can't you see I'm cooperating?\" Jay pleaded, watching as more of his clothes were being tugged off by the robot boy, \"You have, \" Cody confirmed, ridding his owner of his pants, and underwear, before lifting the chain from the hook and laying the still cuffed man on the ground.<br>\r\n<br>\r\n\"But this isn't really about you right now, \" he continued, now switching to his own clothes. The first thing that came off was his pink shorts with bulge pointing to the left. Stepping out of them to show off his...</span></div></div>",
            "created":1563080400,
            "id":2686863,
            "title":"free his hands so he could take a more active part"
        },
        "1231232122212112":{
            "choices":[
                "breathing a sigh of releif",
                "with his lips pressed togeather as if he had been prepared to kiss the ass"
            ],
            "content":"<div class=\"\"><div> <span>As Cody pulled of his pink shorts Jay was shocked to see the femtwink's cock for when he had saw it a hour ago it had been around the same size his own, granted the cock he had seen had been flaccid at the time but still. Cody saw his owner checking out his cock ans smirked down at him, \"I see you have noticed the change. It happened after I talked to Steven it seemed that unlike you his owner ordered spare cock parts for Steven and after hearing about how you had not yet played with me yet they offered me one of their spares so what do you think?\" Cody asked performing a tea bag on Jay form.  Jay was so shocked to say anything as his Android who he had ordered as a submissive boy toy had turned dominant with a larger cock slowing lowering towards his face.<br>\r\n<br>\r\nThe good thing is though his hands were still cuffed together he could not move them so thinking that Cody was about to sit on his face Jay reached upward and caught the descending twink ass glad that he would not have to worry about the smell or anything as Cody was brand new.  Cody smiles as he feels Jay's hand grab his bubble butt as he began to wiggle it in the hands of his owner.  \"Ah that feels nice,\" Cody said as he began to place more and more of his weight on Jay's hands forcing them downward to his owner's face.  At a moment where Jay was almost kissing the femtwink's ass Cody stood up and looked down to see Jay....</span></div></div>",
            "created":1563080400,
            "id":2686880,
            "title":"Cody plays a little with Jay"
        },
        "12312321222121121":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Saddled Jay",
                "Grabbed Jay's hips",
                "Went for a kiss"
            ],
            "content":"<div class=\"\"><div> <span>\"Guess that can wait till we get back home, \" Cody said walking around a tired Jay. Following the robot's ankle, the owner saw that the light was still red, \"He must be close to being completely dominant, I got to do something, \" he thought, trying to remember anything about the robot he forgot. If his pants weren't thrown to the sink, he would have turned him off from the app. <br>\r\n Suddenly it came to him, behind the ear, there was a button to power him up there it must do other stuff. <br>\r\n<br>\r\n\"Must have been why he put these on me, \" he thought. Getting out of his thoughts, the owner looked down at the twink. He had forgone teasing his boner again for crawling along his body planting kisses along the way. \"Okay, it's clear he's going in for another kiss when he does I'll grab his face and push the button, \" Jay planned. Getting to his nipples Cody straightens his back and...</span></div></div>",
            "created":1563080400,
            "id":2686906,
            "title":"breathing a sigh of releif"
        },
        "123123212221211212":{
            "choices":[
                "quite gently and lovingly",
                "a rough as a bucking bronco"
            ],
            "content":"<div class=\"\"><div> <span>Jay prepared himself for the kiss as Cody straitens up but rather than leaning in to kiss the his owner Cody smirked as he places his hands on Jay's hips before he slowly and sensually runs his hands down them to take hold of Jay's thighs so he can lift them up and give him access to Jay's virgin asshole.  Jay's plan of turning off his femtwink bot shattered as Cody lifted his hips and placed Jay's legs over his shoulders as he scooted forward and ran his large cock along Jay's crack.<br>\r\n<br>\r\n\"Now Cody stop that this instant,\" Jay ordered hoping there was still enough submissive programing acting in Cody to stop the Android.<br>\r\n<br>\r\n\"Yeah but no,\" was Cody's reply as he moved forward and pushed the head of his cock passed Jay's anal ring making Jay start to scream at the large intrusion.  Fearing Steven or Charlie would come in and stop his fun Cody grabbed the underwear he had been wearing and stuffed them into Jay's open mouth muffling the screams which as Cody began to work up a pace shifted to include some slight moaning.  Jay could not believe that the submissive boy toy bot he had ordered had become so dominant as it took his anal cherry and road him....</span></div></div>",
            "created":1563080400,
            "id":2686912,
            "title":"Grabbed Jay's hips"
        },
        "1231232122212112122":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "He wants Jay to turn over",
                "There's a knock at the door",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The smacks of flesh echoed through the restroom as Jay's once twink bot turned fuck machine sped up his rhythm. \"Don't know why doing this never crossed my mind, \" Cody started, spanking the man's ass as he cocked his hip to have a deeper stroke. With a sudden burst of strength, the twink bot slammed his owner's ass driving his borrowed cock deep into Jay.<br>\r\n<br>\r\nHumming Cody parted his human's legs, never removing his penis from him, putting on display the shopkeeper's hardening cock, wet with cum. Taking a few seconds to take in the human form, Cody figured out what happened. He couldn't hear Jay say if he was cumming with his mouth stuffed and with the sounds of sex surrounding them.<br>\r\n<br>\r\nChuckling at his own mistake, Cody reached for the spent cock in front of him. Two hands shot out trying to stop him but failed as the android grabbed the linking chain. Pulling the cuffed hands over Jay's head, Cody came eye to eye with him still buried into Jay to his amazement. \"You're my toy now Jay, so behave or I'll have to really punish you, \" the blond stated, releasing the chain and trapping his lips in a kiss. Knowing there was no escape Jay finally gave in, leaning into the kiss and opening his mouth to accept the bot's tongue. Cody only slapped his ass again...</span></div></div>",
            "created":1563512400,
            "id":2689128,
            "title":"a rough as a bucking bronco"
        },
        "12312321222121121222":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Save for it the fun upstairs ",
                "Cody catches it in his mouth",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey you two, it closing time want to take it upstairs with us, \" Steven shouted for the robot and human to heard. Jay could hear the smirk on the other android's voice as he listened to the invitation. He gasped into the fabric in his mouth as Cody chose to stroke Jay's cock as he was distracted. \"Will it be a four-way with you two? \" the twink asked he pumped his hips slowly into the human. <br>\r\n<br>\r\nThere was a pause before the employee spoke again. \"Sure, \" the robot on the outside said not as loud as last time, \"or the two of us can share your owner, \" he continued, humping the door, wanting to join in the fun in the bathroom. \"Maybe after Charlie can give Jay tips on being a good little subby, \" Cody laughed, tugging an exposed nipple.<br>\r\n<br>\r\n\"And then a little show for us, \" Steve said but phased it as a question. \"No, I like this kinda fun to be up close and personal, \" Cody replied, feeling Jay tense up. With a slow wide grin, he watched as his \"toy\" was about to explode...</span></div></div>",
            "created":1563604680,
            "id":2689585,
            "title":"There's a knock at the door"
        },
        "12312321222122":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "A little sword play",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Lifting the bottom of his shirt, Cody showed his abs to his trapped owner. \"Look, I can dress, \" the robot started but paused to throw his shirt off. \"And undress myself, \" he finished grabbing his waistband and stepped out of his shorts and presented an erection. Yet Jay still stood slack-jawed as he remembered the size of his penis when the robot was showing off to him.<br>\r\n<br>\r\nNoticing his owner was staring at his lower half, Cody run his hand along the length of his new penis that was two inches longer than his old one. \"Like what you see, Steven gave it to me before looking for you, \" he said taking several hip-swaying steps at the bound man. \"The original was nice, but I think this one fits the new me better, \" the robot stated before rubbing both shafts against each other...</span></div></div>",
            "created":1563612540,
            "id":2689617,
            "title":"takes off his shorts revealing his own erect cock"
        },
        "12312322":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Jay",
                "Charles ",
                "A customer looking for help"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who interrupted them..</span></div></span></div>",
            "created":1581917460,
            "id":2788479,
            "title":"They are interrupted"
        },
        "12313":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "In all leather bondage gear",
                "A Christmas Elf",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just a few choices for Cody to wear...</span></div></span></div>",
            "created":1562994000,
            "id":2686225,
            "title":"other"
        },
        "123133":{
            "choices":[
                "Ok lets dress Cody up like this.",
                "Cody wants more ",
                "Other Choices",
                "and more Choices"
            ],
            "content":"<div class=\"\"><div> <span>How about having Cody dressing up like a school girl in a nice short skirt and a belly shirt, he could be only wearing sandals on his painted small feet and for the best surprise he could wear a G-string under his skirt.<br>\r\n<br>\r\nSurely he could find attention dressed like this, probably from a lot of boys and men !!!</span></div></div>",
            "created":1562994000,
            "id":2686232,
            "title":"Other"
        },
        "125":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "voluptuous vixen",
                "Hunk guy",
                "More choices "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about more traditional body types, like a voluptuous vixen, or a hunk of man..</span></div></span></div>",
            "created":1564123380,
            "id":2692460,
            "title":"more choices"
        },
        "1253":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Boy next door",
                "Girl next door",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some average body types.</span></div></span></div>",
            "created":1565170020,
            "id":2698419,
            "title":"More choices "
        },
        "12531":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Get a feisty ginger red head",
                "Get a blonde surfer dude",
                "Get a dark haired romantic",
                "Get a honey brown haired sweetie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I really just need some help and don't want my android attracting attention.\" Jay thought out loud. Still, there were a few boy next door models to choose between.</span></div></span></div>",
            "created":1565170320,
            "id":2698421,
            "title":"Boy next door"
        },
        "125314":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Naked, Jay will provide his own clothes later",
                "scout like uniform",
                "casuals",
                "a simple brown jumpsuit"
            ],
            "content":"<div class=\"\"><div> <span>Next was a page of sliders and other options. Jay carefully read through each one:<br>\r\n<br>\r\nFriendliness: 8<br>\r\n<br>\r\nSubmissive: 9 (it might get boring if the android just obeyed)<br>\r\n<br>\r\nGive android a fake background and personality (great for conversations): Yes<br>\r\n<br>\r\nSexuality: 0 (He's supposed to help around the store<br>\r\n<br>\r\nFinally, there was an option asking how Jay wanted the android dressed. Jay noticed that there was no option to remove the genitals. The model he had chosen was named Brian and all Brians were alike in body and only differed in personality.<br>\r\n<br>\r\nSo what clothes does Jay choose for Brian</span></div></div>",
            "created":1565171280,
            "id":2698428,
            "title":"Get a honey brown haired sweetie"
        },
        "1253142":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Getting ready for a day of work",
                "Skip to later in the work day",
                "Skip to after the work day",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Just for the fun of it, Jay chose a scout like uniform. Of course it wasn't an official scout uniform and it had very few badges, zero merit badges so that Jay could have the option of adding those later but Brian wore brown shorts, a brown button shirt with vent flaps, a red scarf, a blue sash and a mountie style hat along with hiking boots. After Brian arrived and Jay unpacked the box, he discovered Brian had been packed making a scout salute. Jay turned Brian on and waited for him to initialize.<br>\r\n<br>\r\nThen Brian asked, \"Are you Jay?\"<br>\r\n<br>\r\nJay said, \"Yes.\"<br>\r\n<br>\r\nBrian said, \"Glad to meet you. How may I serve you?\"<br>\r\n<br>\r\nJay thought that the fun was over and it was time to get back to work. \"Well Brian, I guess I don't really need you in a scout uniform. Please change into these work clothes.\"<br>\r\n<br>\r\nBrian said, \"Alright but will there be time later to work on some merit badges. I would really enjoy having a few badges on my sash.\"<br>\r\n<br>\r\nJay chuckled, \"Sure, why not.\" But then he was surprised as without any sign of modesty, Brian stripped right there in front of him and started changing into his work clothes. Jay had to turn away a moment as he realized he was staring at Brian's privates although Brian didn't seem to mind. Jay didn't want to complicate his work android relationship with any sexual entanglements.</span></div></div>",
            "created":1565172600,
            "id":2698432,
            "title":"scout like uniform"
        },
        "12531423":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jay turns Brian off for the night",
                "Jay stays up late having a conversation with Brian",
                "Jay shares his bed with Brian",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>The work day went by like usual. Most customers were nice but there were a few rude customers. Some customers got mad if Brian helped them and other customers got mad if Brian didn't help them. Brian handled every situation wonderfully.<br>\r\n<br>\r\nBut then it became time to go home and Jay realized he hadn't thought about what to do with Brian when the store was closed. He'd only planned to have Brian help at the store. He thought about just turning Brian off and putting him in storage overnight but decided to take Brian home instead. Jay wanted to learn a little more about Brian.<br>\r\n<br>\r\nHe was surprised when Brian began preparing supper without being asked. Brian said, \"I've got to earn my merit badge for cooking.\"<br>\r\n<br>\r\nJay wondered what to do with Brian at night. Technically Brian didn't need to sleep but he seemed so human that just shutting him off and leaving him standing in the closet seemed odd. Then again, Jay only had one bed.</span></div></div>",
            "created":1565257140,
            "id":2698854,
            "title":"Skip to after the work day"
        },
        "12531424":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "The bedrooms first ",
                "The kitchen first ",
                "The Basement first "
            ],
            "content":"<div class=\"\"><div> <span>As Jay was walking away from the robot he felt his pocket vibrant. Digging it out he saw that he had received a message from General Atomics, thanking him for his purchase and recommending to download their companioning application. It listed features like adjusting settings, and even if other androids were around. Yet Jay gave it no mind, he figured that even if Brian was exactly what he wanted the machine had an AI that could learn. <br>\r\n<br>\r\n\"I'm ready, \" Brian called, making Jay face him. The blue t-shirt seemed to hang from his body as if it was a size or two larger than him, and the cargo shorts were only held up by the belt he had from his scout's uniform. \"I really should have written down your measurements when I was on the site.\" Jay apologized, realizing just giving him hand me downs won't cut it for long. \"It's okay, \" the robot replied opening his arms for a hug that Jay barely sneaked out of. \"Either way, come on. Let me give you a tour of the house then the store, \" the human said taking a few steps to the door...</span></div></div>",
            "created":1565202540,
            "id":2698538,
            "title":"Other"
        },
        "15":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Open",
                "Open",
                "Open",
                "Open",
                "More space"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>These are open space for more stories, so feel free to write something up and fill them out... (Message me if you want the title to change from \"Open\")</span></div></span></div>",
            "created":1562821200,
            "id":2685506,
            "title":"Free Spaces"
        },
        "151":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "You're a boy",
                "You're a girl"
            ],
            "content":"<div class=\"\"><div> <span>You wiggled in your sit watching the General Atomics presentation. Ever since two models ago you've been saving up your money to buy the newest one when it was to come out, but they were too expansive. You followed the tall muscular male unit as it walked off stage a band of light encircling his forearm being showed to the camera. You chuckled thinking of how people might mark the halo of light with \"slut\" or \"bitch\".<br>\r\n<br>\r\nThe female unit followed the male, but instead of swaying her hips off stage she stepped onto a platform that began to spin with a soft light below her.  The light seemed to show her curves off as she stood with her arms to her side. Clearly done with their product announcement, they moved on to more on A. I. Yet that didn't quite grab you as much as the robots, especially when there was still one being on stage.<br>\r\n<br>\r\nAs you were watching her spin, your mind started to drift and you imagine a dominatrix's outfit on her. With black reflective heels, stocking held by a garter belt, a tight top, and a police-style hat. You felt yourself biting your lip, but not seconds later you started drooling thinking about her in a strap-on towering over you. <br>\r\n<br>\r\nBut your eyes started to wander for some reason, yet you were not out of you lustful daze. Your eyes fell upon the male unit of the other side of the stage. You didn't even question how he got back on stage or even on another platform, you just imagined him as a leather daddy, his bare-chest being caressed by a harness and wearing black jeans. You suddenly had a need to be on your hands and knees in front of him as he trained you in his style of sexual play...</span></div></div>",
            "created":1563426000,
            "id":2688819,
            "title":"Buying a domme"
        },
        "155":{
            "author_id":"meanmay",
            "author_name":"playfultoys",
            "choices":[
                "Open",
                "Open",
                "Open"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just wanted more space for writing...</span></div></span></div>",
            "created":1562821200,
            "id":2685507,
            "title":"More space"
        },
        "1552":{
            "choices":[
                "a dominant little brother bot",
                "a sumbmissive bro boy-toy",
                "a little brother that was a vers."
            ],
            "content":"<div class=\"\"><div> <span>Watching the live stream of the Android seller's press conference on their newest and by far cheapest model to date made Jesse smile.  He could finally afford one of the Androids and he was going to get it.  Jesse was a thirty-two year old bachelor who had a decent job that gave him a lot of free time.  Jesse's family had been middle class so he did not have a big place only two small bedrooms a bathroom and a combined living room/kitchen.  Thanks to his job Jesse was able to stay in somewhat decent shape and stood around six foot tall with a mop of messy brown hair on his head.<br>\r\n<br>\r\nHe was happy for the reduced price for Jesse had wanted one of the Androids for a long while know and now with this advance model being more available would finally let Jesse fulfill a for a little brother.  Jesse was the youngest of three kids but he also had an little brother kink but since he had non of his own picking a twink Android would work just as well.  Cracking his fingers Jesse began to fill in the needed information giving his Android the same hair coloration but making it more smooth, and due to the Android standing in for a little brother Jesse had the bot stand around five foot five inches tall.  Jesse also made sure to give the bot some baby fat still in its body and a look that if people did not know any better would mistake it for a fifteen year old.  Once he designed the bot Jesse choose to name the twink Android Samuel, or if he wanted to irritate the Android it would also answer to Sammy though would not be happy about it.  When it came to the last choice Jesse bit his tongue for a moment in thought before he decided that Samuel should be....</span></div></div>",
            "created":1563638580,
            "id":2689743,
            "title":"Want of a little brother"
        },
        "15521":{
            "choices":[
                "grabs Jesse's ass possessively ",
                "gives Jesse a wedgie"
            ],
            "content":"<div class=\"\"><div> <span>In the end the choice was not hard for Jesse for while he had a little brother kink was also really into the idea of role reversal so he clicked on the button that would make sure that Samuel would be the dominant little brother he always wanted.  With that clicked it also allowed him to go back and fill out some other information such as what would happen if he called the bot Sammy.  Licking his lips he made it so that if he either on purpose or slipped up and called the bot Sammy the bot would punish him for it.  Jesse also was able to choose a starting cock size, for with interchangeable parts he could always buy or trade for a different size, which was larger than his own.  Next came the selection of Samuel's attitude which Jesse made to be a little bratty but also extremely confident in his abilities.  Once all that was finally done Jesse placed the order and waited for its arrival which was marked at just over a week and a half.<br>\r\n<br>\r\nOver the next week and a half Jesse was so distracted at the thought of Samuel's many of his co-workers asked if he was alright leading him to only smile and nod at them.  On the big day Jesse arrived home to find the Samuel's shipping case on his door step, he had no fear of anyone taking it for the Androids were made to be specific to their owners and no one wanted to take one home and find that they had chooses an utterly dominant/submissive bot when the person did not like that.  Smiling to himself Jesse hauled the case inside and opened it finding Samuel fully clothed in the case.  Jesse pulled the twink out and finding a charging cable and the slot behind the Android's left ear Jesse plugged the bot in for a full charging as he went over the instructions booklet that came with the Android.  Jesse was a quick reader so he was able get it finished before Samuel was fully charge so Jesse used his time to clean up the remains of the packing case finding a couple of sets of clothing and some replacement parts for the Android's arms and legs.  <br>\r\n<br>\r\nSuddenly a beep started to come from the Android signaling the end of its initial charging so Jesse goes over and unplugs the Android and presses the start up button behind the right ear, this button according to the manual would only work this one time than be nothing more than say a mole on the Android's skin.  After he pressed the button Samuel's eyes flutter open revealing deep brown eyes, same coloration that Jesse had, as the Android who was made to be akin to an eighteen year old that looked like he was just fifteen to raise his right hand over his head while using his left hand to cover his mouth as the boy let out a loud yawn as if waking from a deep sleep.<br>\r\n<br>\r\nOnce the start up was done Samuel smiles up at Jesse with his gorgeous brown eyes and said, \"Morning bro.\"  Jesse was so happy he went in for a hug wrapping his arms around Samuel as he gave his new \"little brother\" a tight bear hug.  Samuel responded in kind as he wraps his own arms around Jesse though due to their height difference the Android's arms were closer to Jesse's ass a fact that the Android took full advantage of as he...  </span></div></div>",
            "created":1563640080,
            "id":2689752,
            "title":"a dominant little brother bot"
        },
        "155211":{
            "author_id":"landover",
            "author_name":"Landover&",
            "choices":[
                "take off his shoes and give him a foot rub",
                "to perform a striptease for his amusement "
            ],
            "content":"<div class=\"\"><div> <span>As Jesse hugged his new \"little brother\" Samuel hugged him back wrapping his arms around Jesse's form in such a way that the dominant bro-bot was in fact grabbing his ass.  Jesse could not help but let out a soft sound at the touch which nearly turned into a moan as Samuel's grip tighten about his ass.  \"This is mine no one else's\" Jesse heard Samuel say and as if to emphasis the point the twink android lifted one of his hands and gave Jesse's left cheek a slap.  At the blow Jesse could not stop himself from moving forward deeper into Samuel's grip his wildest dreams come true with how well the company did with this dominant little bro-bot.<br>\r\n<br>\r\n\"Only yours,\" Jesse agreed after a moment of silence leaning down and nuzzling his chin against the top of Samuel's head.<br>\r\n<br>\r\n\"Good boy,\" Samuel said finally ending the hug as he went to look around Jesse's modest home.  Jesse was torn between letting Samuel explore on his own or to follow the dominant twink.  His mind was made up for him as Samuel turned back and saw he was not following him so with a frown on his face and a snap of his fingers pointed Jesse to few steps behind him.  Samuel than explored the house Jesse following after him as if he was a dog following it's owner.  Once the android had finished his exploring he flumped back onto Jesse's bed and crossed his legs showing of a good pair of slim legs.  With a smirk Samuel than ordered Jesse to .....</span></div></div>",
            "created":1579840860,
            "id":2777684,
            "title":"Samuel claims Jesse's ass"
        },
        "155212":{
            "choices":[
                "some more brotherly bullying ",
                "some sexual domination"
            ],
            "content":"<div class=\"\"><div> <span>As Jesse shared his first hug with his new little bro bot Samuel it seemed had other ideas.  The Twink bot moved his hands from cupping Jesse's ass upwards until they reached his \"older brother's\" waistband.  With expert movements as if he had done this many times before Samuel took a firm hold of your underwear's waistband and gave it a harsh tug upward.  You can't help but make a small squeaking sound as Samuel give you a surprising wedgie with such force it actually forces you to stand on your tip-tpes.  \"Now that is a way to start the day,\" Samuel said in a slight sing song voice as he lets out a laugh at your discomfort, but it did not really bother you that much for you wanted a dominate bratty little brother and it seems the company had come through so you just hugged Samuel even tighter than before.<br>\r\n<br>\r\n\"Oh I just love you Samuel,\" You said your voice slightly higher due to the wedgie's pressure on your crotch which only causes Samuel to work even harder at bulling you it seems.  He suddenly lets you go and you almost thank him as you begin to pull your underwear out of your crack but before you make much progress Samuel reaches upward at you as he pulls your head down.  You does not protest or pull away thinking Samuel was pulling him in for a kiss, how wrong he was for you soon found his head being held between Samuel's slim body and muscular arm in a sleeper hold.  The good thing Samuel was not applying pressure, however, the young bro bot did start to use his other hand to give Jesse a hard noogie making you squirm having never experienced one before and finding it annoying.<br>\r\n<br>\r\n\"You like that you dork,\" Samuel taunts but instead of waiting for a response he brings his free hand to his mouth and sucks on a finger letting you know what was coming next.  You try to get away but are unable to either due to your lack of leverage or because Samuel being an Android has more strength than you do despite your size differences.  Samuel lets out a laugh as he brings his wet finger to your ear and gives you a wet willie as he still holds you in place by your head.  As you can not get away as the wet finger enters your ear you can not help stomping your left foot at the sensation from the willie which just causes Samuel to laugh at you again.  Samuel then moves on to...</span></div></div>",
            "created":1563723720,
            "id":2690148,
            "title":"bullied by your little bro bot"
        },
        "1552121":{
            "choices":[
                "answer him that his feet look good",
                "say you are thinking of something else but accidently call him \"Sammy\""
            ],
            "content":"<div class=\"\"><div> <span>Samuel lets go of your head and you use your new freedom to turn your head and bat the opposite ear that received the wet willie in hopes of getting rid of the wet feeling in it.  Samuel uses your distraction to take off first the shoe than his sock of his left foot before he balls up the sock and sticks it into your mouth.  You gag a little but thankfully due to both the newness of the Android as well as them having no scent there is no foot odor that comes with said sock.  Samuel just laughs at you as you gag on the sock in your mouth nearly bent over as you try to spit it out.  As you do so you notice that Samuel has rather large feet making you think of the old wives-tale of a person with large feet also has a large cock.  <br>\r\n<br>\r\nYou did not really know how big of a cock your Twink-bot has for you just ordered one that is larger than your five inch erect cock, and as Samuel was shipped fully clothed you had not yet had a chance to see what he was packing.  Noticing you staring at his feet Samuel wiggles his toes on his bare foot making you blush.  Like what you see bro?\" Samuel asked placing a hand under your chin and forcing you to look him in the face.  You give him an answer which is muffled in his sock making Samuel laugh as he reaches in and pulls the sock out which just causes him to giggle even more at the line of saliva hanging between his formerly clean sock and your mouth.  \"Want to try that again?\" he said mid-giggle.  You gulp as you...</span></div></div>",
            "created":1563766440,
            "id":2690450,
            "title":"Samuel puts a sock in it."
        }
    },
    "info":{
        "author_id":"meanmay",
        "author_name":"playfultoys",
        "brief_description":"With breakthroughs in AI and robotics robots have become the new smartphone everyone wants",
        "created":1562886720,
        "description":"<td align=\"left\" class=\"norm\">General Atomics has finally put the finishing touches on their new model of Android, the Olympia, a robot with ultra-realistic skin feel and human-like thought speeds.<br>\r\n<br>\r\n \"Reaching from dykes and twinks to bimbos and Bears, we provide a wide range of body types and personalities in this model down to the lightest of freckles on their rear.\" the keynote speaker remarked putting his arms around a nude male and female units.<br>\r\n<br>\r\nAnd now a short list of their features (which is not complete as I will pick and pull ideas from chapters as well to add to it.)<br>\r\nConnect to wifi and phone<br>\r\nInterchangeable parts<br>\r\nThe youngest the robot can look is 15 or 16<br>\r\nScentless<br>\r\nCan be given multiple modes<br>\r\nCan be modified if the android is willing<br>\r\nMost common placement for an indicating light is the ankle but can be in other places<br>\r\nGreen is Dom/Top, Red is changing from one to an other or a switch\"h, and Blue is submissive/bottom<br>\r\nCan be gifted to others<br>\r\n<br>\r\nAnd now my short list of do's<br>\r\nAny pairing is allowed and encouraged<br>\r\nRobo customizations (Will be put into its own section.)<br>\r\nEndless choices (but if it's for a custom android keep it in that section)<br>\r\n<br>\r\nAnd now the not's<br>\r\nNo scat/farting/toilet/adult baby stuff<br>\r\nNo weight gain<br>\r\nNo gore<br>\r\nNo pregnancy <br>\r\nNo shrinking<br>\r\n<br>\r\nEnjoy your purchase </td>",
        "id":2195512,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1581917460,
        "modified":1581917460,
        "pretty_title":"Chromed and Painted "
    }
}