{
    "chapters":{
        "1":{
            "author_id":"leomon1828",
            "author_name":"Leomon",
            "choices":[
                "Bowser",
                "King K Rool",
                "Ganon",
                "King Dedede",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We know what’s going to happen but whom does this weight gain, or obesity, or slobishness begin with?</span></div></span></div>",
            "created":1195794000,
            "id":468035,
            "title":"The Victu...ummm Villains."
        },
        "11":{
            "author_id":"leomon1828",
            "author_name":"Leomon",
            "choices":[
                "Overfed",
                "Magic Spell Backfire",
                "Potion",
                "Strange Berries",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bowser, the king of the koopas. But How does he gain?</span></div></span></div>",
            "created":1202446800,
            "id":495914,
            "title":"Bowser"
        },
        "111":{
            "author_id":"leomon1828",
            "author_name":"Leomon",
            "choices":[
                "The depressed king continues to gorge. ",
                "Somone joins him in his eatings. ",
                "The king is Captured and fed against his will"
            ],
            "content":"<div class=\"\"><div> <span>The large koopa looks out his window sighing. A leg of turkey hanging from his maw as he continues gorging. He does this every time one of his famous schemes against the mushroom kingdom fails. That damn Mario and his brother always getting in the way. It was worse this time for him though, so he's developed an even larger paunch then usual. Love handles are starting to shove as they push out of the sides of his shell. Even his collar and armlets and leg lets have been feeling too tight of late. </span></div></div>",
            "created":1206680400,
            "id":513719,
            "title":"Overfed Koopa"
        },
        "1112":{
            "author_id":"liamthemystic",
            "author_name":"Phoenix",
            "choices":[
                "At the meeting",
                "in the throne room."
            ],
            "content":"<div class=\"\"><div> <span>But, he wasn't the only one at the table. Two others had joined his son Jr., and his royal adviser Kamek. This wasn't an odd occurrence for Jr. who would take any chance too eat as many sweet, and greasy foods as possible. He already dose mind you, his diet is filled with nothing healthy, but he likes to gorge with his dad. But Kamek was usually not with them, but for some reason this time was different. \"So what did you want to talk about.\" Bowser said as he was removing his collar allowing his neck to hang out. \"Just the fact that I have devised a plan that may just be able to erase Mario, out of the equation.\" Kamek said as he started eating a pie. \"Really, and prey tell me WHY YOU DIDN'T MENTION THIS EARLIER!\" Bowser yelled spitting sauces over the table. \"B-Because I-I only found out about it an hour ago, so here's my plan. Remember when you tried to kidnap Mario and Luigi when you were a child, and we can time travel with E. Gadds machines. Well I thought why not stop their parents from meeting, that way they wouldn't exist, to stop you.\" Kamek said while standing up exposing his stomach. \"Well, how do we get Gads machine without alerting someone.\" \"We could buy it, like we did with my paintbrush, and his portrait ghost machine to free king Boo.\" said Jr. whose face was covered in cake. \"Yeah, that's right he always was a sellout, let's send him a request.\" Bowser said, while unhooking his wristbands, allowing his arm some freedom.</span></div></div>",
            "created":1539659220,
            "id":2564411,
            "title":"Somone joins him in his eatings. "
        },
        "1113":{
            "author_id":"cho-ran",
            "author_name":"Cho-Ran",
            "choices":[
                "one of his minions that wanted to end the conflicts and decided to fatten him up",
                "Princess Peach!",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>waking up suddenly, the slightly heftier koopa noticed he wasn't in his castle, and that thick metal cuffs were holding his arms and legs down, while he laid on the floor. he groaned, wondering what had happened, the last he remembered was that he had just finished a chicken leg that was on the dinner table and... Bowser blinked, it must've had a powerful drug to put him to sleep in it! but... who did it?<br>\r\n<br>\r\nhearing a door open he looked up and saw...</span></div></div>",
            "created":1238389200,
            "id":668594,
            "title":"The king is Captured and fed against his will"
        },
        "11132":{
            "author_id":"cho-ran",
            "author_name":"Cho-Ran",
            "choices":[
                "*SNAP* the hose is broken!",
                "too much food, too little exercise makes even his jaws too flabby to resist"
            ],
            "content":"<div class=\"\"><div> <span>\"P-Princess!\" Bowser gasped.<br>\r\n<br>\r\n\"sorry for the suddenness of this, Bowser, but I hadn't been captured in a while and wondered what was going on...\" Peach sighed.<br>\r\n<br>\r\n\"you were worried about me!\" Bowser asked gleefully.<br>\r\n<br>\r\n\"in a way, yes. and when I had heard you were glutting during your depression, I realized why you were always getting bigger, and also how to stop our countries from warring.\"<br>\r\n<br>\r\n\"you'll marry me!?\" Bowser jumped to a conclusion!<br>\r\n<br>\r\n\"uhhh... no. sorry, Bowser... but I'm going to force feed you so much that you won't be able to capture me ever again.\" before he could say anything a toad put a hose in his muzzle and clamped the king's jaws together. \"now, now! we're just over feeding him, be gentle.\" Peach warned, not wanting to see anything bad happen to anyone.<br>\r\n<br>\r\nonce a odd gel began to filter into his gullet, Bowser began to try to get the somehow tasty liquid from entering his jaws. suddenly, he got an idea, and began to comp down on the hose, hoping his jaw muscles would still rend the metal that he used to be able to.</span></div></div>",
            "created":1238389200,
            "id":668598,
            "title":"Princess Peach!"
        },
        "111322":{
            "choices":[
                "Bowser tries to make a run for it once the hose is removed ",
                "Bowser  develops Stockholm Syndrome  and enjoys being engorged "
            ],
            "content":"<div class=\"\"><div> <span>Bowser tried with all his might to break the hose, unfortunately jaws were too flabby to resist. Peach smiles as her plan takes effect. <br>\r\n<br>\r\n\" Later Bowser,  I have a wedding to attend  to. I'll be sure to give you some of the wedding cake.\"<br>\r\n<br>\r\n<i>Curses I  can't  break the hose! Yet this liquid does taste good. Whatever this gelatin is it sure tastes great! I have to find a way to escape and kidnap Peach before she turns me into a complete lard ball.</i> Bowser thought  to himself. </span></div></div>",
            "created":1437077340,
            "id":2008897,
            "title":"Unable to Break the Hose. Tasty Liquid Ahoy"
        },
        "115":{
            "choices":[
                "Starts a career as a sumo wrestler ",
                "Is hypnotized by his enemies ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other ways does the Koopa King gain weight. </span></div></span></div>",
            "created":1440634920,
            "id":2026035,
            "title":"Other"
        },
        "12":{
            "author_id":"leomon1828",
            "author_name":"Leomon",
            "choices":[
                "Time to gorge",
                "A Mystical Curse",
                "Feeling a bit slobish..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The King has been eating a bit too much latly, his usual belly is a bit more, thicker then usual. </span></div></span></div>",
            "created":1250485200,
            "id":745787,
            "title":"King K Rool"
        },
        "13":{
            "author_id":"flamingphoenix",
            "author_name":"Delightful",
            "choices":[
                "Lazy",
                "Slob",
                "Magic Spell / Potion",
                "Force-Fed",
                "Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Ganon gain weight?</span></div></span></div>",
            "created":1237957200,
            "id":666154,
            "title":"Ganon"
        },
        "133":{
            "author_id":"cho-ran",
            "author_name":"Cho-Ran",
            "choices":[
                "Magic spell",
                "Magic potion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so which will it be?</span></div></span></div>",
            "created":1238302800,
            "id":668584,
            "title":"Magic Spell / Potion"
        },
        "1332":{
            "author_id":"cho-ran",
            "author_name":"Cho-Ran",
            "choices":[
                "Ganon becomes addicted to red/blue/ect. potions",
                "Ganon finds a potion made by his henchmen and drinks it, unaware of the effects",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>there are a lot of ways this could happen, so let's make sure there can be more than one potion, eh?</span></div></span></div>",
            "created":1238302800,
            "id":668587,
            "title":"Magic potion?"
        },
        "13322":{
            "author_id":"cho-ran",
            "author_name":"Cho-Ran",
            "choices":[
                "he permanantly shifts to his pig-form and has  an incredible increase in hunger",
                "he gets stronger, at the cost of laziness."
            ],
            "content":"<div class=\"\"><div> <span>Ganon was walking through his tower, plotting how to take over the land of Hyrule, when he overheard his moblins in another room. \"with this potion lord Gannon should be able to take over Hyrule very quickly! the power it gives the drinker is incredible!\" and another agreed.<br>\r\n<br>\r\nbursting into the room, Gannondorf bellowed, \"give me that potion!\" and quickly took the potion out of the hands of the moblin and chugged the tasty beverage down.<br>\r\n<br>\r\nblinking the moblin gasped, \"lord Gannon! that potion wasn't complete yet! there are still side effects!\"<br>\r\n<br>\r\nlowering his gaze, Ganon stared blankly as he cursed his own impatience. suddenly the effects began it;</span></div></div>",
            "created":1238302800,
            "id":668591,
            "title":"paitience is a virtue... that villians lack"
        },
        "15":{
            "author_id":"leomon1828",
            "author_name":"Leomon",
            "choices":[
                "Mew-Two",
                "General Scales",
                " Wolf O'Donnell",
                "Free Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's just a few more to get you started. </span></div></span></div>",
            "created":1195794000,
            "id":468033,
            "title":"More Choises"
        },
        "151":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "A vending machine",
                "Some large pink berries",
                "A tree with very large apples"
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo was bored, he and his army of cloned Pokemon had found this peaceful mountain habitat a few months ago, it was very nice but not very exciting place to live in, some of the Pokemon clones were becoming restless.<br>\r\n<br>\r\n\"The young ones seem to be bored.\"  Mewtwo observed as the the offspring of his Pokemon sat around the water hole doing nothing.<br>\r\n<br>\r\n\"If only there was something here to spark their interest...\" Mewtwo mused<br>\r\n<br>\r\nThen Mewtwo spots something very unusual, What is it? </span></div></div>",
            "created":1339304400,
            "id":1357235,
            "title":"Strange Foods"
        },
        "1511":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Baby Pokemon notice the vending machine, and want to try it",
                "A candy vending machine is soon spotted",
                "The clone Nidoqueen comes other, attracted by the scent of the soda"
            ],
            "content":"<div class=\"\"><div> <span>\"What is this man made object doing here?\" Mewtwo asked suspiciously.<br>\r\n<br>\r\nIt was a vending machine all right, with buttons labeled 'Fresh Water' 'Soda Pop' 'Lemonade' and 'Moomoo Milk' and other things.<br>\r\n<br>\r\n\"How could this have possibly have gotten here?\" Mewtwo rubbed his chin thoughtfully.<br>\r\n<br>\r\nHe pressed the button labeled 'Soda Pop' just to see if the machine worked, sure enough a can of soda came tumbling down.<br>\r\n<br>\r\nMewtwo picked it up \"It's cold even?\" Mewtwo murmured<br>\r\n<br>\r\nHe opened the can of soda the bubbles went up his nose, Mewtwo snorted.<br>\r\n<br>\r\n\"Why do humans like this stuff?\" He grunted as he tried to clear his nostrils.<br>\r\n<br>\r\nNonetheless he took a sip of the soda, it was sweet and bubbly and delicious beyond all measure.<br>\r\n<br>\r\n\"Now I know why humans like it.\" Mewtwo admitted as he took another sip of soda.<br>\r\n<br>\r\nSoon </span></div></div>",
            "created":1339304400,
            "id":1357260,
            "title":"A vending machine"
        },
        "1512":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "His butt was getting bigger",
                "His belly was getting bigger",
                "His whole body was fatter"
            ],
            "content":"<div class=\"\"><div> <span>\"I've never noticed this before...\" Mewtwo remarked as he saw a bush with dark green leaves and bright pink berries.<br>\r\n<br>\r\n\"I don't recognize these berries and I know every recognized berry in this region!\" Mewtwo did not know what to make of this strange plant.<br>\r\n<br>\r\n\"These berries are brightly colored.\" He observed \"They might be poisonous, they might not be, I better test before any of my Pokemon clones do so.\"<br>\r\n<br>\r\nMewtwo popped to berries in his mouth, he found the berries to be very sweet, not bad tasting at all.<br>\r\n<br>\r\n\"Not bad.\" He murmured <br>\r\n<br>\r\nHe gulped them down, not only did they have a good taste they had a good aftertaste as well.<br>\r\n<br>\r\nThat's when Mewtwo noticed something alarming, his entire body had turned bright pink!<br>\r\n<br>\r\nBut that wasn't all   </span></div></div>",
            "created":1339304400,
            "id":1357250,
            "title":"Some large pink berries"
        },
        "1513":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The apples hook him to fattening",
                "The apples alarm him by fattening him",
                "The apples cause a delayed fattening reaction "
            ],
            "content":"<div class=\"\"><div> <span>Mewtwo's eyes widened, he had never seen anything like this in his entire life!<br>\r\n<br>\r\nIt was an apple tree, but not just any apple tree, each individual apple, must have been the size of a large watermelon!<br>\r\n<br>\r\n\"In all my years I have never seen anything like it!\" Mewtwo exclaimed<br>\r\n<br>\r\nSome of the Pokemon clones must have overheard Mewtwo's psychic exclamation, because because some of them came over to investigate. The Nidoqueen Clone, the Ninetails clone, the Rapidash clone, the Golduck clone and Bulbasaur clone came to see what Mewtwo was worried about.<br>\r\n<br>\r\nWhen the clones saw the apples their mouths watered, Mewtwo warned them it might be dangerous, but the clones paid no heed and started to shake the tree.<br>\r\n<br>\r\nWhen the apples came tumbling down, the clones started to gorge themselves on the over sized fruit.<br>\r\n<br>\r\n\"I wouldn't do that if I were you.\" Mewtwo warned \"It could be poisonous.\"<br>\r\n<br>\r\nThe Ninetails protested \"Ninetails! Nine!\" (Translation: 'Stop being a worrywart!  Have some fun for once!)<br>\r\n<br>\r\nMewtwo decided to take a bite of one of the apples, however something strange happened</span></div></div>",
            "created":1339425960,
            "id":1357521,
            "title":"A tree with very large apples"
        },
        "153":{
            "author_id":"leomon1828",
            "author_name":"Leomon",
            "choices":[
                "Get A hotel Room",
                "Wolf's hungry go to the buffet...",
                "Wolf is kidnapped..."
            ],
            "content":"<div class=\"\"><div> <span>Wolf growled. He was essentially stranded on a vacation planet after his crew decided to leave him there, feelign his abilities weren't good enough to compare with Foxs team. Luckily he had enough money to get off the planet, as well as living comfertably for the rest of his life but maybe he could sue a vacation before taking back what was properly his...<br>\r\n<br>\r\nSomethign was a little weird though, most of the people on the planet seemed...larger then most...arround the waist. </span></div></div>",
            "created":1227243600,
            "id":610282,
            "title":" Wolf O'Donnell"
        },
        "1531":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Pasta and Veggie Platter",
                "The Hamburger Platter",
                "The Chocolate Fudge Sundae"
            ],
            "content":"<div class=\"\"><div> <span>Wolf decides to go to a hotel, he decides to visit one called the Hungry Hippo Hotel.<br>\r\n<br>\r\nTrue to it's name, most of the hotel staff are hippos, rather plump hippos at that.<br>\r\n<br>\r\nWolf gets a room, and learns that the hotel has room service and that if he should ever feel hungry he should just call and he'll get food delivered to his door.<br>\r\n<br>\r\nOnce Wolf gets to his room he feels rather peckish, so he decides to call room service<br>\r\n<br>\r\nWhat does Wolf get?</span></div></div>",
            "created":1339429080,
            "id":1357549,
            "title":"The Hungry Hippo Hotel"
        },
        "15312":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "One Week Later",
                "One Month Later"
            ],
            "content":"<div class=\"\"><div> <span>\"I'd like the Hamburger Platter...With milk instead of a soft drink...\" Wolf added as an after thought.<br>\r\n<br>\r\n\"So that's one Hamburger Platter with Moo Juice...\" The lady on the other end of the phone said \"Coming right up!\"<br>\r\n<br>\r\nWolf sat on the edge of his bed and brooded, he didn't care that he was not eating healthy, he was depressed, it was time for comfort food, before he knew it, his food had arrived.<br>\r\n<br>\r\nThe hamburger was deliciously juicy, it even had grilled onions, which Wolf loved, as soon as he finished the burger Wolf took a swig of creamy whole milk to relieve his mouth after the spicy burger.<br>\r\n<br>\r\nThen he moved onto the fries, he piled on the salt and made a small mountain of ketchup and soon not a single French fry was left.<br>\r\n<br>\r\nWolf lapped up the leftover ketchup and took a final swig of milk and he felt so full inside that he could hardly move at all! </span></div></div>",
            "created":1339431120,
            "id":1357558,
            "title":"The Hamburger Platter"
        },
        "15313":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Next Week",
                "Next Month"
            ],
            "content":"<div class=\"\"><div> <span>Wolf was feeling down in the dumps after his crew leaving him, he didn't feel like keeping track of calories, he wanted comfort food, so he called Room Service and ordered the chocolate fudge sundae.<br>\r\n<br>\r\nWhen he received his sundae, he wasted no time digging into it.<br>\r\n<br>\r\n\"This is good!\" Wolf remarked \"No wonder the people here look like they do!\"<br>\r\n<br>\r\nThe fudge sauce was rich and chocolaty and the vanilla ice cream was perfectly smooth and creamy.<br>\r\n<br>\r\nWhen Wolf was done he had a much larger gut then before.<br>\r\n<br>\r\n\"Maybe staying here won't be so bad after all.\" He sighed</span></div></div>",
            "created":1339429320,
            "id":1357550,
            "title":"The Chocolate Fudge Sundae"
        },
        "1532":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "A selfish Tiger who wants the pizza for himself",
                "A Friendly Female Cat whose willing to share",
                "A very hungry Dog"
            ],
            "content":"<div class=\"\"><div> <span>Wolf felt a little peckish so he decided to head to a local Buffet.<br>\r\n<br>\r\nAll around him were Furries who were very...large to say the least.<br>\r\n<br>\r\n\"Maybe the food here is really that good.\" Wolf mused to himself as he got himself a dish, a knife and a fork.<br>\r\n<br>\r\nHe looked around and saw the many buffet tables around him, one was the salad bar, one was for soups, one table had lots of meat dishes, one had ethnic dishes like pizza, pasta and so forth and one was the dessert table.<br>\r\n<br>\r\nDeciding not to waste anymore time, Wolf started filling up his plate with various foodstuffs.<br>\r\n<br>\r\nAs he reached for a slice of pizza, a large hand also reached for the same slice.<br>\r\n<br>\r\nWolf looked up and saw </span></div></div>",
            "created":1339304400,
            "id":1356976,
            "title":"Buffet Time"
        },
        "15322":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"My bad.\" The Female Cat said \"Were you reaching for this piece?\"<br>\r\n<br>\r\nWolf blinked with surprise at this larger then average feline She was a Siamese, but much fatter then any Siamese he had ever seen.<br>\r\n<br>\r\n\"I'm Sandra.\" The Female Cat said smiling \"Sandra Siamese...And you are?\"<br>\r\n<br>\r\n\"Wolf...\" Wolf said quickly \"Wolf O'Donnell.\"<br>\r\n<br>\r\n\"Well Wolf.\" Sandra said \"I've been looking for a feeding partner, If you want I'll be your feeding partner! I'll even feed you if you feed me!\"<br>\r\n<br>\r\nWhat does Wolf say? </span></div></div>",
            "created":1339304400,
            "id":1356981,
            "title":"A feeding partner?"
        },
        "153221":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Wolf feeds Sandra",
                "Sandra feeds Wolf"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...\" Wolf said reluctantly \"I guess it couldn't hurt...\"<br>\r\n<br>\r\n\"Wonderful!\" Sandra said cheerfully \"We'll head over to may table it's at the very back.\"<br>\r\n<br>\r\nWolf grabbed the last few slices of pizza and followed Sandra to a very large table in the back.<br>\r\n<br>\r\n\"Why do they make the tables here so large?\" Wolf asked<br>\r\n<br>\r\n\"Well, with a population as large as ours, adjustments have to be made for our size...\"<br>\r\n<br>\r\nSandra and Wolf sat down<br>\r\n<br>\r\n\"Now would you like to start by feeding me, or would you rather I feed you?\" Sandra asked<br>\r\n</span></div></div>",
            "created":1339304400,
            "id":1356985,
            "title":"Feeding Time!"
        },
        "1532211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Sandra wants more food",
                "Sandra leans in for a kiss"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...\" Wolf said reluctantly \"If you want I could feed you first.\"<br>\r\n<br>\r\n\"Oh that's wonderful!\" Sandra purred<br>\r\n<br>\r\nWolf sighed, despite being hungry he knew he had to be a gentleman do to the whole, Lovable Rouge's code of honor thing.<br>\r\n<br>\r\nSandra lay on her back and opened her mouth.<br>\r\n<br>\r\nWolf took a bowl of creamy fish soup and poured it into Sandra's mouth.<br>\r\n<br>\r\nSandra sighed with pleasure as the warm creamy soup flowed into her mouth, she swallowed at regular intervals but still she got a bit of the soup on her face.<br>\r\n<br>\r\nWolf saw this and said <br>\r\n<br>\r\n\"Oh Sandra, let me...Let me get that for you.\"<br>\r\n<br>\r\nHe wiped off some of the schmutz with his finger and then popped the finger in his mouth tasting the delicious liquid. </span></div></div>",
            "created":1339427400,
            "id":1357537,
            "title":"How Romantic!"
        },
        "1532212":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "He likes the sensation",
                "He's alarmed"
            ],
            "content":"<div class=\"\"><div> <span>\"Wonderful!\" Sandra says \"I always look forward to feeding people!\"<br>\r\n<br>\r\nBefore Wolf can say anything an enormous slice of deep dish pizza is crammed into his mouth, as he swallows he feels his belly getting bigger.<br>\r\n<br>\r\n\"What the heck?!\" Wolf exclaims</span></div></div>",
            "created":1339427580,
            "id":1357540,
            "title":"Sandra feeds Wolf"
        },
        "1533":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "An Enormous Machine",
                "A Sexy Big Beautiful Tiger Woman",
                "A Far Male Bear"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly Wolf felt something hard hit the back of his head...He opens his eyes and what does he see?</span></div></span></div>",
            "created":1339390800,
            "id":1357333,
            "title":"What the heck?!"
        },
        "15332":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "I want to feed you till your my size",
                "I want to try a new weight gain potion on you! "
            ],
            "content":"<div class=\"\"><div> <span>\"Hi there Handsome.\" The Tiger purrs in a sultry voice<br>\r\n<br>\r\n\"Who are you?\" Wolf asked<br>\r\n<br>\r\n\"I'm Tanya Tiger.\" the Tiger purred \"And it looks like I have you in my clutches...\"<br>\r\n<br>\r\n\"What are you going to do with me?\" Wolf asked getting nervous<br>\r\n<br>\r\n\"Well...\" Tanya put her finger to her chin and thought</span></div></div>",
            "created":1339390800,
            "id":1357338,
            "title":"Tanya"
        },
        "153321":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "An enormous pizza ",
                "A humongous milkshake"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm a chef.\" Tanya says \"I'd like to test a few new recipes on you if you don't mind.\"<br>\r\n<br>\r\n\"Sure.\" Wolf growled \"Whatever gets me out of here faster.\"<br>\r\n<br>\r\n\"All right then!\" Tanya laughs with glee \"Let's get started.\"<br>\r\n<br>\r\n\"What does she serve first?\"</span></div></div>",
            "created":1339394160,
            "id":1357341,
            "title":"A Ten Course Meal"
        },
        "1533211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "\"I have a new flavor of ice cream I want you  to try.\"",
                "\"I've created the ultimate candy!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Don't go anywhere!\" Tanya said \"I'll be right back!\"<br>\r\n<br>\r\nTanya ducked into her kitchen, Wolf could hear the sounds and whisking and slicing and could smell the delicious smells of pepperoni, olive oil, sliced mushrooms and other such things.<br>\r\n<br>\r\nWhen Tanya came back into the room, she was carrying an enormous deep dish pizza with pretty much every topping you could imagine on it!<br>\r\n<br>\r\n\"Ta da!\" Tanya said cheerfully \"My deep dish, everything lover's pizza!\"<br>\r\n<br>\r\nShe placed it before Wolf, He took a slice and tasted it...He had to admit, she and done a good job, everything from the crust, to the sauce to the toppings, blended perfectly well and made every bite like a taste of heaven.<br>\r\n<br>\r\n\"When you're done with that pizza.\" Tanya said \"I have another surprise for you...\"<br>\r\n<br>\r\n\"Oh?\" Wolf said \"What's that?\"<br>\r\n<br>\r\n\"Well...\" Tanya said</span></div></div>",
            "created":1339426680,
            "id":1357527,
            "title":"An enormous pizza "
        },
        "15332111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "It was a bright pink color",
                "It was a dark green color"
            ],
            "content":"<div class=\"\"><div> <span>\"I've got a new flavor of ice cream I want you to try!\" Tanya said \"I call it Paunchberry Ice Cream!\"<br>\r\n<br>\r\nWolf, despite being halfway through the pizza, was not feeling full at all, in fact, the food that Tanya was feeding him was starting to hook him to fattening.<br>\r\n<br>\r\n\"Don't go nowhere!\" Tanya said \"I'll be right back!\"<br>\r\n<br>\r\nAs Wolf finished the pizza, Tanya came out with the ice cream<br>\r\n<br>\r\nWhat color was it?</span></div></div>",
            "created":1339426920,
            "id":1357532,
            "title":"New Ice Cream Flavor"
        },
        "1533212":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "His belly was getting bigger",
                "His butt was getting bigger"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to try a new milkshake flavor first.\" Tanya said \"Wait right there...\"<br>\r\n<br>\r\nShe ducked into the kitchen, Wolf heard the sound of a blender and smelled sweet smells coming from the kitchen.<br>\r\n<br>\r\nTanya reappeared with a humongous rainbow colored milkshake complete with whipped cream and cherry.<br>\r\n<br>\r\n\"Ta da!\"  Tanya said \"My rainbow fruit milkshake! Enjoy!\"<br>\r\n<br>\r\nWolf lifted his lips to the straw and began to drink, it was very sweet and creamy and it tasted like all the fruits in the world! Suddenly he noticed something</span></div></div>",
            "created":1339394400,
            "id":1357343,
            "title":"A humongous milkshake"
        },
        "154":{
            "author_id":"cho-ran",
            "author_name":"Cho-Ran",
            "choices":[
                "Big Blag (battletoads)",
                "Kraid (metroid)",
                "Even More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about one of these villains?</span></div></span></div>",
            "created":1196053200,
            "id":469199,
            "title":"more choices"
        },
        "1543":{
            "author_id":"cho-ran",
            "author_name":"Cho-Ran",
            "choices":[
                "Ridley (metroid)",
                "Scuzz (battletoads)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about one of these?</span></div></span></div>",
            "created":1196053200,
            "id":495912,
            "title":"Even More Choices"
        },
        "15432":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "Choose this guy.",
                "Have more, less obscure choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You can choose this character or........</span></div></span></div>",
            "created":1381267200,
            "id":1676182,
            "title":"Scuzz (battletoads)"
        },
        "154322":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "Let's find out!",
                "Just go to a different villian"
            ],
            "content":"<div class=\"\"><div> <span>After time and time again of being defeated by Snacker the Shark and failure to save that ONE jinjo. Banjo along with his faithful companion, Kazooie, have given up on their quest to save Tootie from the clutches of the downright rotten Grunty. Which has given her enough time to rob Tootie of her beauty, making Grunty the evil, yet drop dead gorgeous ruler of the world. With all of her plans finally completed, what will she do now?</span></div></div>",
            "created":1381438320,
            "id":1677104,
            "title":"Hot Gruntilda the Witch"
        }
    },
    "info":{
        "author_id":"leomon1828",
        "author_name":"Leomon",
        "brief_description":"Your favorite video game Villains won. But now with nothing more to do... but eat. ",
        "created":1195861260,
        "description":"<td align=\"left\" class=\"norm\">So you captured the kingdom, disposed of the hero, or won the treasure. You win. So now what? Video game villains find out that with nothing else to do they turn to the dinner table a lot more. See what happens when it begins to show. A lot.</td>",
        "id":1351997,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1539659220,
        "modified":1539659220,
        "pretty_title":"Villainous Weight"
    }
}