{
    "chapters":{
        "1":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Mom or Dad",
                "Sibling",
                "Friend",
                "Neighbor",
                "Stranger"
            ],
            "content":"<div class=\"\"><div> <span>As you were walking back home from school, you heard as somebody has been screaming nearby, possibly being robbed. You ran to the alley where the noises were coming from and you saw an old lady fighting off a very agressive man, that was trying to steal her purse. You ran towards him to help her, but at the same moment the lady let go off the purse, which gave the thief an oppurtunity to run away. You followed him. As you got near a corner where he turned, everything went black.<br>\r\n<br>\r\nYou woke up after a while, the lady was looking at you. Apparently, the guy wait for you and hit you with something. Even thougt you did not get her purse back, the lady was very grateful.<br>\r\nShe said:,,I have looked deep into your heart young man. I will give you an ability to make your deepest desires possible. But use my gift carefully.\" She walked with you for a few blocks to make sure that you are ok. After a few minutes you parted ways and wished each other a good day.<br>\r\n<br>\r\nYou were approaching your neighborhood with a minor headache causing you to be a little disbalanced. You entered your house that was suppose to be empty at the moment, but as you entered there was...<br>\r\n</span></div></div>",
            "created":1554786000,
            "id":2642365,
            "title":"Intro"
        },
        "11":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Go to the kitchen to talk to mom",
                "Help out your dad"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Both of your parents were home. Your mom was in the kitchen, your dad was carrying luggages.<br>\r\nYou...</span></div></span></div>",
            "created":1577404200,
            "id":2765012,
            "title":"Mom or Dad"
        },
        "12":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Patrick",
                "One of the twins",
                "Becca"
            ],
            "content":"<div class=\"\"><div> <span>You come from a big family.<br>\r\nWhich one of your siblings is it?<br>\r\n<br>\r\nPatrick - 24, at university, masculine, blonde, blue eyes, has a girlfriend<br>\r\nAlex or Ben - twins, 19 years old, both like to tease you a lot, quite masculine, but not as Pat., they spend a lot of time together, brown hair, blue eyes<br>\r\nBecca - 16, your youngest sibling, you are closest to her, brown hair, blue eyes, bit of a nerd</span></div></div>",
            "created":1554786000,
            "id":2642371,
            "title":"Sibling"
        },
        "121":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Hugs you",
                "Leaves"
            ],
            "content":"<div class=\"\"><div> <span>Your brother stood there just in his boxers, staring at you completely surprised. \"Hey, little man. Watcha doin' here? Shouldn't you be at school now?\"<br>\r\n\"Hey. No, I always come home this early on Fridays. But what are you doing here? You are suppose to be at college. Aren't you?<br>\r\nHe seemed a bit nervous a just said:\"I got a few days of so I decided to come back home and maybe throw a little party for me and my friends. Which reminds me. Could you leave for the night? I already spoke to everybody and they all got a place to sleep over, including our parents. I'd be really gratefull, man.\"<br>\r\nYou couldn't say no to that nice face of his. And man, that body. You always envied him so much. Shit, you shouldn't look so long at him or he is gonna notice.<br>\r\nYou nodded and he...</span></div></div>",
            "created":1554786000,
            "id":2642427,
            "title":"Patrick"
        },
        "1211":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Give it a shot",
                "Decline. You are the big brother now"
            ],
            "content":"<div class=\"\"><div> <span>He smiled and immediately hugged you. You closed your eyes and inhaled his smell and just enjoying his naked torso touching your body.<br>\r\nBut something felt off. You closed your eyes and felt a but nauseous.<br>\r\nYou opened them again, but you were standing above somebody else. In front off you was your body. You both looked at each other in horror.<br>\r\n\"Mike? Is that you? Did we just...\"<br>\r\n\"Swapped bodies? Yeah I think so. Man, your body feels amazing.\" You said as you touched your brothers hands.<br>\r\n\"Hey, stop it. We gotta switch back like right now. I can't stay like this.\"<br>\r\nYou...</span></div></div>",
            "created":1554786000,
            "id":2642430,
            "title":"Hugs you"
        },
        "12111":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "It works. You're back in your body",
                "Nothing happens"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even though you'd love to stay, you need to find out more about this power. You touch your brother again and..</span></div></span></div>",
            "created":1576254840,
            "id":2759105,
            "title":"Give it a shot"
        },
        "121111":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Makes a proposal",
                "Wants to use your power",
                "Laughs at your comment and leaves"
            ],
            "content":"<div class=\"\"><div> <span>Your brother seems to be happy to be back in his body. You on the other hand would like to go back. The feeling od the tight skin, solid muscles a the fact that you were in Simeone else's body was incredibly erotic.<br>\r\n\"Why the long face, bro?\" your brother asked kind of surprised<br>\r\n \"I didn't even get to feel your six pack. It felt so good to be in your body.\"<br>\r\nYour brother...</span></div></div>",
            "created":1576255200,
            "id":2759107,
            "title":"It works. You're back in your body"
        },
        "1211111":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Hell yeah",
                "No way",
                "Someone interrupts you"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine then. How about this? You get to spend a day in my body on one condition. You will swap with me the second I fall asleep or as you will see me completely wasted. Which doesn't mean you get to stay for the party. You will come back only at 3 am or if I'll text you. <br>\r\nSo, what do you think? Do we have a deal?\"</span></div></div>",
            "created":1576263900,
            "id":2759129,
            "title":"Makes a proposal"
        },
        "12111111":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Yeah, sure. Why not?",
                "He rejects"
            ],
            "content":"<div class=\"\"><div> <span>You shake hands on it, but this time you don't swap. You try it again, this time you focus on his body and it works.<br>\r\n\"Sweet, I know how it works now.\"<br>\r\n\"Ok, that's amazing, but let's switch back, I need to prepare some stuff.<br>\r\nAn idea comes to your mind.<br>\r\n\"Hey, actually. What if I did it all for you in your body. You could relax in mine in the meantime and I will get everything ready. Just tell what needs to be done and I'll do it.</span></div></div>",
            "created":1576264440,
            "id":2759132,
            "title":"Hell yeah"
        },
        "121111111":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Asleep",
                "Jerking off",
                "Playing video games"
            ],
            "content":"<div class=\"\"><div> <span>You're pretty sure, that the list of tasks your brother gave you wasn't suppose to be that long, but you don't care. You got to clean the swimming pool in his body. Hell, now that you got a washboard abs, you don't care. You take of your shirt and exposing your new huge body for the world to see.<br>\r\nYour brother came to check on you a few times, but that was an hour ago. You're pretty sure he fell asleep. You need to go enjoy this body way more than just looking and occasionally touching your chest. There doesn't seem to ne anyone in sight, so you put your hand in your boxers.<br>\r\n\"OH my god. This dick is huge.\"<br>\r\nThe blood begins to flow into your dick making it rock hard. You need to take care of it. Now.<br>\r\nYou go upstairs and find your brother in your room</span></div></div>",
            "created":1576265040,
            "id":2759133,
            "title":"Yeah, sure. Why not?"
        },
        "1211111112":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "\"I wanna suck my own Dick\"",
                "\"Give your body a blowjob\"",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"What the fuck are you doing, Patrick?\" your manly voice resonates through your room dusturbing your brother.<br>\r\n\"Hey. Uh... Yeah. Sorry about this. I got kind of bored and your body is horny all the time, so I just had to you know.\"<br>\r\nNevertheless he still kept stroking your dick even with you watching.<br>\r\n\"Could you please stop atleast for now? This is ridiculous.\"<br>\r\n\"I don't think I want to. It feels totally different in your body then in mine. You should try it.\"<br>\r\n\"So you don't mind then? Ok, I might as well go fuck somebody.\"<br>\r\n\"Nah, this body needs to stay here for tonight. Sarah's gonna com. So... You know, no fun for you today. But there Is one thing I wanted to try.\"</span></div></div>",
            "created":1576265580,
            "id":2759136,
            "title":"Jerking off"
        },
        "13":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Zack",
                "Nick",
                "Alice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?<br>\r\n<br>\r\nZack - more stronger than you, womanizer, short light brown hair, hockey player<br>\r\nNick - typical nerd, wears glasses, scrawny, curly short hair<br>\r\nAlice - beautiful, brunette, blue eyes, D cups</span></div></span></div>",
            "created":1562302800,
            "id":2682714,
            "title":"Friend"
        },
        "132":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Try the cinema anyway",
                "Screw it. Play video games"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey. What the hell are you doing here?\" you asked your friend, bit concerned that he was inside of your house.<br>\r\n\"Hi. Your mom let me in. We were suposse to go to the cinema, remember?\"<br>\r\nShit. You totally forgot, that you should have bought them on the way home. It's gonna be sold out.<br>\r\nYou...</span></div></div>",
            "created":1562385540,
            "id":2682715,
            "title":"Nick"
        },
        "1321":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Few tickets left",
                "The tickets are sold out"
            ],
            "content":"<div class=\"\"><div> <span>As you were walking to the cinema, you felt a weird tingling in your stomach. Something was different. You didn't even pay attention to the small talk Nick was trying to come up with. He was talking about Jessica again. Not that you cared.<br>\r\nYou arrived to your destination.<br>\r\n<br>\r\n</span></div></div>",
            "created":1562385840,
            "id":2682717,
            "title":"Try the cinema anyway"
        },
        "13212":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Holds your arm to stop you",
                "Leaves home"
            ],
            "content":"<div class=\"\"><div> <span>What the hell Mike? You were suppose to buy them. Why didn't you?<br>\r\nYou went to the park nearby and you told him about the robbery and the woman.<br>\r\n\"Deepest desires? She probably meant some slutty girl. Am I right?\" Nick laughed at you in disbelief<br>\r\n\"You're really disgusting sometimes Nick, you know that?\" you reply annoyingly, slowly walking away from him. As you keep walking, Nick...</span></div></div>",
            "created":1562386140,
            "id":2682718,
            "title":"The tickets are sold out"
        },
        "132121":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Allow him to go on a date in your body",
                "Touch him again to swap back"
            ],
            "content":"<div class=\"\"><div> <span>As he touches you, you switch bodies. Now looking at each other from different point if view.<br>\r\n\"WHAT THE FUCK\" your body let's go of your grip and stares in horror. You both can't believe what just happened. \"How's this even possible?\" Nick whispers with a shaky voice.<br>\r\n\"What if this is the gift from the lady?\" the thought goes throught your head and right now it's the only possible explanation.<br>\r\nNick keeps touching your body, face first, stretching his arms and even forcing his hand to your pants.<br>\r\n\"What the fuck do you think you're doing? Don't touch that!\" <br>\r\n\"Why not? It's mine, I am Michael now. See. I can dk whatever I want. Hell, I bet even Jessica will go on a date with me now.\"<br>\r\nYou</span></div></div>",
            "created":1562386620,
            "id":2682725,
            "title":"Holds your arm to stop you"
        },
        "1321211":{
            "choices":[
                "follow Nick.",
                "go to Nick's home."
            ],
            "content":"<div class=\"\"><div> <span>You like Nick as he always was that guy who was standing in the corner alone. He was always awkward with girls and even around other guys sometimes. Some part of you think it's okay to let go on his date. <br>\r\n<br>\r\n\"Fine, you can go. But don't go too far.\" You warn Nick. <br>\r\n<br>\r\n\"I promise I won't go too far.\" Nick solemnly promises with a serious face. Then your old face shows off a weird grin. \"Later Nick.\" And off Nick goes.<br>\r\n<br>\r\n\"Ugh, I hate this already.\" You mutter to yourself as you look down at Nick's body. Nick really doesn't have anything to show for. <br>\r\n<br>\r\nLooking up you can see him disappearing into a side street. Hmm, you could follow him to make sure he doesn't screw up. Then again, it would be awkward being found out if he saw you. You could also go home and chill at his home. He has a sweet gaming set-up you've been itching to try out.<br>\r\n<br>\r\nYou</span></div></div>",
            "created":1562422680,
            "id":2682897,
            "title":"Allow him to go on a date in your body"
        },
        "13212112":{
            "author_id":"rilo43",
            "author_name":"Rempa21",
            "choices":[
                "Nick inside your body.",
                "Somebody else."
            ],
            "content":"<div class=\"\"><div> <span>Not sure what to do standing here, you decide to go to Nick's house. On the way there you notice how awkward it is inside Nick's body. Not only is he blind without his glasses, he's scrawny which makes the journey home so much worse. People looking at you, some calling you names behind your back. If this is how Nick's life is, you're glad with yours. <br>\r\n<br>\r\nAt Nick's house you can see through the window his mother watching her favorite soap opera. A group of stampeding cows going through the living room wouldn't make her look away from it. This is the perfect opportunity to see if someone notices it.<br>\r\n<br>\r\nGoing inside you put off your shoes and walk past the living room. \"Hey mom.\" You shout. <br>\r\n<br>\r\n\"Hey sweetie.\" She answers still looking at the television screen. Shrugging your skinny shoulders you hurry upstairs and enter Nick's room. <br>\r\n<br>\r\n\"Heh, heh. This is awesome.\" You remark seeing the sweet gaming set-up Nick has. <br>\r\n<br>\r\nYou start up one of your favorite games and start playing the game. You notice though playing the game is much easier somehow, like your fingers are more used to holding the controller. It might be an effect of you inside your friend's body.<br>\r\n<br>\r\nHalfway through the game you wonder how Nick is doing inside your body. You hope that he hasn't gone too far. <br>\r\n<br>\r\nOpening the door all of a sudden you turn around and see</span></div></div>",
            "created":1576875240,
            "id":2762157,
            "title":"go to Nick's home."
        },
        "1321212":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Try it out some more",
                "Go home and try it out there"
            ],
            "content":"<div class=\"\"><div> <span>As you quickly take a grip of your previous body, your vision fades and you are back in your original body.<br>\r\n\"Come on man, I was just kidding. I wouldn't have done anything bad to your body.\" Even thought you don't really believe that, you still stay with Nick at the park talking about all the possibilities<br>\r\nYou</span></div></div>",
            "created":1562386860,
            "id":2682726,
            "title":"Touch him again to swap back"
        },
        "14":{
            "author_id":"m2mbodyswap",
            "author_name":"lovebodyswaps",
            "choices":[
                "Dan, muscular, 32 years old",
                "Suzy, Dan's girlfriend, 29 years old",
                "One of the gay guys from next door, both over 30"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one of the nighbours was it?</span></div></span></div>",
            "created":1577404440,
            "id":2765014,
            "title":"Neighbor"
        }
    },
    "info":{
        "author_id":"m2mbodyswap",
        "author_name":"lovebodyswaps",
        "brief_description":"The life of a young man gets much more interesting with a newly given power.",
        "created":1554785700,
        "description":"<td align=\"left\" class=\"norm\">Your name is Michael. You are 17 year old high school student looking forward to try out your new power, that you have been given after a strange encounter.<br>\r\n<br>\r\nAll sex is ok. Don't Kill off the main character, don't put the end chapters. </td>",
        "id":2187703,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1577404440,
        "modified":1577404440,
        "pretty_title":"Body swapping"
    }
}