{
    "chapters":{
        "1":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Go outside and take a walk, it's a nice day",
                "Get a text message from someone",
                "Go to the gym",
                "Decide to take a nap",
                "Go to the mall"
            ],
            "content":"<div class=\"\"><div> <span><b>It's the summertime!</b><br>\r\n<br>\r\nYou had just graduated high school, and you were super excited to start your new life.<br>\r\n<br>\r\nBut first, this summer <u>HAD</u> to count<br>\r\n<br>\r\nYou woke up to your alarm clock going off. The birds were chirping outside very loudly. You wondered how you hadn't woken up prior to the alarm once you got your head together. Putting on your slippers after getting dressed, you looked in the mirror. You had never been a bad looking guy, just over 6 ft and with a healthy and strong build. You though that you looked good.<br>\r\n<br>\r\nYou had left your parents place a month after graduating. It was a decision that everyone was happy, to be frank<br>\r\n<br>\r\n\"Man, it's cool to be living on my own\" Ty said to himself, turning on the TV for a moment. You flickered through the channel and decided it wasn't worth the time. Guess it's time to go outside and see what's in store for the day!<br>\r\n<br>\r\nYou...</span></div></div>",
            "created":1465016400,
            "id":2159016,
            "title":"Starting off"
        },
        "11":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Ms. Roose, a very pretty mother of 2 pretty young girls.",
                "Sarah, a popular girl from high school",
                "Chelsea, a waitress from the local diner",
                "Angelica, a cute 9 year old who played frequently on the other side of the road"
            ],
            "content":"<div class=\"\"><div> <span>You decide to take a walk.<br>\r\n<br>\r\nThe sun is shining, the birds are chirping, and you make your way down the nice suburban neighborhood lane that you've come to know over the last few weeks as your new neighborhood. You remembered seeing a few different people when you took a few walks before. The place you lived was big enough that you could recognize people from when you lived with your parents, but there were also plenty of new faces. As a young man tends to do, you specifically paid a bit of attention to the females you saw. <br>\r\n<br>\r\nYou were walking, almost on autopilot down the sidewalk, thinking about one of the girls you've seen during these neighborhood treks..<br>\r\n<br>\r\nThe girl in your mind was...</span></div></div>",
            "created":1465016400,
            "id":2159022,
            "title":"Go outside and take a walk, it's a nice day"
        },
        "112":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Agreed, excitedly to come over",
                "Had an alternative plan",
                "Came up with an excuse."
            ],
            "content":"<div class=\"\"><div> <span>You thought about Sarah.<br>\r\n<br>\r\nAnd then you ran into Sarah.<br>\r\n<br>\r\n\"Ouch! Watch where you're going Ty!\" Sarah exclaimed at you. Seeing her face contorted in anger wasn't something you liked to see. She was a very pretty girl that you always crushed on in High School, but because you didn't come into your looks until last year, she wouldn't give you the time of day.<br>\r\n<br>\r\n\"Yeah I'm sorry, I wasn't watching where I was going\" You said, flustered.<br>\r\n<br>\r\n\"Obviously.\" she said with a point. Her face softened and I felt relieved \"Why do I see you around here so much now? Did you move?\"<br>\r\n<br>\r\n\"Uh yeah\" you stated quickly. \"My parents let me leave the house now that I graduated, so I live down this way now. I imagine you're parents place is around here then?\"<br>\r\n<br>\r\n\"Yep!\" she said \"Lived in this really nice place towards the end of this street for my entire life. My parents just went on vacation so I get to have the entire house to myself!\" she said, before adding \"Unless my sister comes back home for some reason\"<br>\r\n<br>\r\nYou honestly couldn't believe you were talking to her. She was the epitome of what you found attractive in a girl. When you could, you always tried to catch glimpses of her.<br>\r\n<br>\r\nShe had long blonde hair, a set of brown eyes, a wonderful smile, and a more curvy figure than you could handle. She had huge triple D breasts, and a huge ass on her. She knew it too, you gathered, from what she always chose to wear. <br>\r\n<br>\r\n<i>You had to really try to focus on what she was saying</i><br>\r\n<br>\r\n\"So hey, I hope we can forget about the way things were in High School, maybe you could come over and hangout with me. I've got a few games for my PS3 we could play if you'd want.\" she said flashing a smile.<br>\r\n<br>\r\nYou couldn't believe it<br>\r\n<br>\r\nYou...</span></div></div>",
            "created":1465016400,
            "id":2159027,
            "title":"Sarah, a popular girl from high school"
        },
        "1121":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "\"I don't have a PS3 silly\"",
                "\"Let me go get it\""
            ],
            "content":"<div class=\"\"><div> <span>You walked to her house, keeping light conversation and trying to mentally prepare.<br>\r\n<br>\r\nYou caught glimpses when you could, of her huge ass out of the corner of your eye. It pushed her jeans out so far it was impossible to not stare at. You thought she may have caught you once, but she didn't say anything.<br>\r\n<br>\r\n\"Here we are\" she said. <br>\r\n<br>\r\nThe house really was a big one. She drove an expensive Tahoe, so you figured her parents were loaded.<br>\r\n<br>\r\n\"My parents let me have whatever I want, because they can afford it.\" she said showing you around her part of the house. She had a floor, decorated with expensive toys and very girly things.<br>\r\n<br>\r\nShe ushered you to sit, and you did.<br>\r\n<br>\r\n\"So where is your PS3...\" you ask</span></div></div>",
            "created":1465016400,
            "id":2159030,
            "title":"Agreed, excitedly to come over"
        },
        "11211":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "She approaches you laughing",
                "She continues to stand there, berating you"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't have a PS3 silly\" she said with a smirk on her face<br>\r\n<br>\r\n\"Well, what did you invite me over for then?\" you asked<br>\r\n<br>\r\n\"Ty, do you not think I don't notice you staring at me all the time? You couldn't be more obvious about it. You were even looking down my shirt right after you bumped into me.\"<br>\r\n<br>\r\nYou immediately started to sweat. You were not great with girls, and being confronted like this made you nervous.<br>\r\n<br>\r\n\"Oh, are you upset that I called you out on it?\" She laughed, her breasts jiggling slightly. \"You're a huge perv on me, aren't you Ty?\" <br>\r\n<br>\r\nYou didn't know what to say.<br>\r\n<br>\r\n\"Well..\"</span></div></div>",
            "created":1465016400,
            "id":2159032,
            "title":"\"I don't have a PS3 silly\""
        },
        "112111":{
            "choices":[
                "You wake up 5'5 and for every inch she took she grew two",
                "you wake up 5'5 and for every inch she took she grew five "
            ],
            "content":"<div class=\"\"><div> <span>She started giggling. <br>\r\n<br>\r\n\"I won't lie I've perved on you before\" she said shocking you with this statement. <br>\r\n<br>\r\n\"Wait what\" you ask why someone like her would like someone like you.<br>\r\n<br>\r\n\"Oh what you don't like a hot girl perving on you\" she said walking closer to you her breasts jumped up and down with every step.<br>\r\n<br>\r\n\"N-n it-\" you couldn't get a word out.<br>\r\n<br>\r\n\"Aww I got you tongue tied don't worry I don't need you to talk\" she said standing on the tips of her toes so she could kiss you after she was done you could hear mumble something but you couldn't understand what she said. <br>\r\n<br>\r\n\"Come on inside this is where the fun happens\" she said walking in front of you teasing you by shaking her butt at you and giggling. She lead you to her room which was very nice her parents had money and that was obvious she had a flat screen a super expensive computer and a very nice bed which is where she sat down.<br>\r\n<br>\r\n\"Nice room you got here\" You said complementing her. <br>\r\n<br>\r\n\"Yeah well your pretty lucky because you're the first gut to see it\" she said dropping another socking bit of information. <br>\r\n<br>\r\n\"Wait what are you talking about\" you ask confused again.<br>\r\n<br>\r\n\"What think I would have guys in and out of here...nope you're special because I like you\" she said still having a teasing look as she patted her hand on her bed signaling you to sit down the bed was nice except your legs hung off the end a bit. <br>\r\n<br>\r\n\"This is a really nice bed\" You say getting comfy sitting on it. <br>\r\n<br>\r\n\"You know what else is really nice\" before you have time to react she jumped on your lap her lips brighter than they did just a few minuets ago. Before you had time to process more information she planted her lips onto your's within moments everything went dark.    </span></div></div>",
            "created":1471136520,
            "id":2195540,
            "title":"She approaches you laughing"
        },
        "112112":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Started to shrink",
                "Ran",
                "Tried to grab her phone"
            ],
            "content":"<div class=\"\"><div> <span>\"I just think it's funny that you stare at me. Why do you stare at me?\" She went on.<br>\r\n<br>\r\nYou sat there, more nervous than you'd ever been in your life. You felt like your entire body was contracting in on itself. You felt so small, being yelled at by a beautiful, tall woman who you thought wanted to be your friend.<br>\r\n<br>\r\n\"I mean, my boobs are pretty big.\" she said pushing them together \"And my butt is <b>biiiiiiig</b>\" she said slapping it, smirking at you<br>\r\n<br>\r\nYou started to feel turned on, which felt inappropriate in this situation.<br>\r\n<br>\r\n\"Haha you're getting a boner Ty!\" she said laughing at you. She took out her phone and snapped a picture before you could hide it. In your khaki shorts, it was very visible<br>\r\n<br>\r\n\"Oh my god, wait till everyone sees this!\" she said \"I'm texting it to all my girlfriends right now!\"<br>\r\n<br>\r\nYou...</span></div></div>",
            "created":1465016400,
            "id":2159037,
            "title":"She continues to stand there, berating you"
        },
        "1121121":{
            "author_id":"vintovka",
            "author_name":"Vintovka",
            "choices":[
                "Laughing at you makes Sarah and her friends grow while you shrink",
                "Sarah shows you the humiliating video of you shrinking",
                "You run out of the room"
            ],
            "content":"<div class=\"\"><div> <span>\"No Sarah, stop!\" you shout, too in shock to actually do anything.  You try to push your boner down and hold it between your legs, but Sarah just laughs more.  \"Please, I'll be humiliated!  Is there anything I can do to stop you from sending that?\"<br>\r\n<br>\r\n\"Nope!\" Sarah promptly replies, continuing to text away.  \"Everyone in our class is gonna know what a perv you are!  And look!\"  She holds her phone up beside her head, showing you the text conversation.  \"I'm sending a picture of you grabbing at it too, like you're trying to hide it from me!\"  You look up and watch the progress bar fill, sending the second picture out to the group text right after the first.<br>\r\n<br>\r\nWait, looking up at her?  That shouldn't be.  You quickly take a step back, hoping that she hadn't noticed you are now several inches shorter than she is.  Very soon you bump into her nightstand, stopping you a mere two feet away from her, not nearly far enough for her to chalk it up to a trick of depth.  \"Sudden growth spurt, huh?\" you ask.<br>\r\n<br>\r\n\"Growth spurt?  What are you...\" Sarah finally looks up from her phone from where she had been smiling at the replies rolling in.  \"Ha, you're smaller than me now!\" she exclaims with a wide grin.  She steps toward you, seeming to loom larger as she gets closer.  \"And you still have a boner!  Why is that, Ty?  Does this make you aroused?\"  You try to hide your crotch from her viewpoint, and Sarah stands even taller before you.<br>\r\n<br>\r\n\"Ha, you just got smaller again!\" she shouts, lifting up her phone again.  \"I saw that!  I'm gonna get it on video and send it to all my friends too!\"  She lifts up her phone, holding it well out of your reach and points the lens down at you.  \"Why are you getting small, Ty?  Is it because you're aroused by me?  No, then you'd be ankle height for sure... and you still have a boner, unbelievable!  Is getting smaller making you aroused?  Is it me being taller than you that does it now?  Say something!\"  You sputter for words, all while Sarah gets larger, until she blocks out the light from the ceiling fan.<br>\r\n<br>\r\n\"Oh, I know!  It's when I make you self-conscious!\"  She stops the video for now and attaches it to another text message.  \"You got a bit smaller too when I pointed out how you creep on me.  Well I have bad news for you Ty, it's gonna get worse for you before it gets better.  Everyone I know has seen it, and they're passing it on.\"  You whimper and look up at Sarah, the top of your head brushing the bottom of her breasts.  Sarah looks at her phone and grins.</span></div></div>",
            "created":1471181460,
            "id":2195722,
            "title":"How Embarrassing"
        },
        "11211211":{
            "author_id":"vintovka",
            "author_name":"Vintovka",
            "choices":[
                "\"I need another selfie with you!\"",
                "\"Why don't you take a picture of me now?\"",
                "\"Some of my friends are coming over!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Replies are already coming in and it's not looking good for you!\" Sarah proclaims, turning her phone around so you can see the screen.  She must have sent it to at least a dozen people, and there are already so many replies you can't see what she originally sent.  Your eyes scroll over the messages, trying to keep up while new ones come in.<br>\r\n<br>\r\n\"lol what a dork\"<br>\r\n<br>\r\n\"serves the perv right\"<br>\r\n<br>\r\n\"omg he's sooooo gross\"<br>\r\n<br>\r\n\"lmao he used to creep on me too\"<br>\r\n<br>\r\n\"haha i'm sending it to all my friends\"<br>\r\n<br>\r\nAnd they keep rolling in.  Each message you read makes you feel even smaller in their eyes, and your stature changes to match.  It looks like Sarah grows two feet in as many seconds, and the phone even looks smaller in her hand now.  She turns the phone back around so she can read it too, and busts out laughing.<br>\r\n<br>\r\n\"Oh my God, you're so small now!\" she says between peals of laughter.  \"You're so tiny you're almost down to my knees, Ty!\"  Sarah pauses for a moment, an enormous smile plastered across her face.  \"That's perfect!  I'll call you Ty-Knee!\"  She beams at her own cleverness and shoots up another foot, bringing you face to face with her knees.<br>\r\n<br>\r\nSarah squats down, bumping her leg into you as it's pushed forward.  You're amazed at how much she towers over you even now, her beautiful face far above your reach.  \"Come here Ty-Knee, I want to get a selfie with you!\"  Before you can comply she grabs you and forcefully yanks you toward her, slamming your face into her shin.  \"Oops, sorry!  Guess I don't know my own strength... or you're just that small!\"  She bursts out laughing again, and her shin becomes significantly taller than you.<br>\r\n<br>\r\nShe holds her phone out at arm's length and swaps to the camera facing you, the phone looking like a toy in her hands.  You see how huge she is compared to you now and turn your face away, unable to believe how far you've fallen in so short a time.  \"Look at the camera and smile, Ty-Knee!\" she implores, moving her other hand above your head and raising two fingers in a peace sign.  \"I want all the other girls to see how pathetic you are!\"  For a brief moment you look at the camera and smile so she can take the picture, and you swear you see her grow even more.<br>\r\n<br>\r\nOnce the picture is taken Sarah stands back up and starts tapping away with an pinkie finger, her other digits now too large to work the keyboard, smiling the whole time.  She paces back and forth, and you see her stretch even further upward until her head nearly touches the ceiling.  After the message is sent she moves her phone away so she can look directly at you.<br>\r\n<br>\r\n\"Ty!  You're even smaller than you were a second ago!\" she says, barely able to contain a giggle.  \"You're almost down to my ankles!  But Ty-Ankle doesn't have the same ring to it as Ty-Knee.\"  Sarah's head hits the ceiling, but she seems not to notice.  \"Guess you're back to just short ol' Ty, or Tiny.\"  She looks back at her phone and grins.</span></div></div>",
            "created":1472130000,
            "id":2201298,
            "title":"Losing for Their Gain"
        },
        "112112113":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Get taken via cleavage to Jerrica's house to meet her sisters.",
                "Lauren offers to stay with Sarah for pizza and to decide what to do with you."
            ],
            "content":"<div class=\"\"><div> <span>*ping!* You felt the world shift, and you felt dizzy for a moment. <br>\r\n<br>\r\nSarah smiled at her phone \"Lauren and Jerrica are here Tiny.\" You are frozen with fear at the thought of more women joining in on the fun. It seemed like they would only exacerbate the situation you thought to yourself. You heard the door open and two sultry feminine voices, one you knew VERY well. There steps were far more like stomps than the normal elegant female walk you were used to hearing. A colossal woman, atleast a head and a half taller than Sarah herself walked into the room.<br>\r\n<br>\r\nYou realized now that the last text message didn't cause Sarah to grow or for you to shrink, but the world around you grew much larger. Sarah seemed even larger than before now that you think of it, but the room was much more suited to her than before. <br>\r\n<br>\r\n\"Hey Sarah, where's Lauren's ex-boyf-...\" the immense blonde asked before peering down at you and smirking. Jerrica was naturally incredibly thin, except for a nice pair of hips, large bubble butt and an absolutely incredibly massive rack. Her breasts made Sarah's huge jugs look modest by comparison.<br>\r\n<br>\r\n\"See for yourself\" Sarah stated happily pointing down at your diminutive state. \"Wow he's so absolutely tiny!\" Jerrica yelped pouncing down at you. Her beautiful face filled you with fear as it revealed just how massive it was by comparison. \"I want to take him home and let him meet my little sisters\" she said.<br>\r\n<br>\r\n\"Woah hold on, let me see the twerp\" a familiar voice laughed beyond Jerrica's massive form. Jerrica frowned and turned around \"Fine Lauren, it is your birthday so the world kind of does what you want it to today.\" Your ex was hot before, but with the changes the world underwent from Sarah's texting and your boner, she was quadruple the girl you remember. She wasn't as tall as Jerrica or even Sarah, but she made up for it. Her legs were powerhouses, and her thighs were thick enough to crack watermelons. Of course, her ass was bigger than Kim Kardashian could ever dream to have had naturally, and she had her hair up in a ponytail. She beamed down at you from a seemingly endless distance.  \"Hey Ty, you look smaller than when I dated you. You must have stopped working out. I started squatting obviously\" she said, slapping her massive yoga panted ass. \"I think you should appreciate the thing about me you miss most, by kissing my ass and letting us take a picture of it\"<br>\r\n<br>\r\nJerrica, Sarah and Lauren all busted out into laughter at this thought. You looked up at the titanic women. You couldn't possibly hope to get away. Sarah's pink carpet floor seemed endless, and the 3 women's enormous feet looked like buses. Why was the world changing like this? There had to be a way to try to control it. Sarah was able to manipulate reality somehow, you just needed to try to trick her. The three of them had stopped talking and looked down at you smiling.<br>\r\n<br>\r\nSarah hopped forward slightly, her massive breasts jiggling in her tank top. \"So Ty, Jerrica wants to take you back home to meet her little sisters, Lauren wants to take you back to her place to make you take pictures kissing her ass, but I sort of want to just pig out on a ton of pizza and watch Netflix shows if you want to just kind of be my slave here\" she grinned.<br>\r\n<br>\r\nYou weren't sure which option gave you the best odds, but you had to make a choice.</span></div></div>",
            "created":1506490500,
            "id":2392453,
            "title":"\"Some of my friends are coming over!\""
        },
        "1121123":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "She decided to make you feel smaller",
                "She called one of her friends",
                "You tried to escape"
            ],
            "content":"<div class=\"\"><div> <span>You tried to grab her phone from her, finally able to move.<br>\r\n<br>\r\nYou wrestled with her for it. You were bigger than she was, and weighed more than her despite her juicy curves.<br>\r\n<br>\r\n\"You asshole! I'm going to call the cops!\" You didn't buy it. You shoved her and she fell into the wall.<br>\r\n<br>\r\n\"THAT'S IT!\" she screamed. \"YOU NEED TO RESPECT ME, THIS IS MY HOUSE\"<br>\r\n<br>\r\nYou stopped fiddling with her phone for a second. You looked up at her, now standing over you kneeling. She looked so much bigger all of a sudden. As if she was even taller than you.<br>\r\n<br>\r\n\"You need to delete this picture, and then I'l stop do...\" you trailed off as you stood up. Whereas before you had been almost a full head taller than her; now you met her gaze,... If anything she looked down on you slightly. You both had surprised reactions.<br>\r\n<br>\r\n\"What... Why are you smaller than me?\" She asked pondering the question. Suddenly she grabbed for her phone and grappled with you. She was a cheerleader, and had muscle (Which is why her curves looked as good as they did). With her being slightly taller than you, you were unfortunately outmatched.<br>\r\n<br>\r\nShe grabbed the phone from your hands, and sent you flying onto your butt.<br>\r\n<br>\r\n\"Serves you right, asshole.\" she said looking down on you again. Your vision seemed to have blurred from the impact, and as it cleared, you saw her seem to loom even larger, her frame blocking much of the light from the lamp in the room.<br>\r\n<br>\r\n\"Woah! I just watched you get smaller! Was it because I threw you down?\" She asked laughing. \"No, no, because you shrunk when I yelled at you too.\" she said.<br>\r\n<br>\r\nYou put it together about as fast as she did. You shrunk when she made you feel smaller. That first feeling on the couch? You must have shrunk then, When she looked down at you when you were kneeling? Again there. When you were thrown down? She looked down on you.<br>\r\n<br>\r\n<br>\r\n\"Well looks like you're not going to be a basketball player anymore\" she said laughing \"Do you want to look at my boobs now?\" <br>\r\n<br>\r\nYou didn't have a chance to answer before your face were smushed between her huge breasts.<br>\r\n<br>\r\nWhat happened next?</span></div></div>",
            "created":1465102800,
            "id":2159052,
            "title":"Tried to grab her phone"
        },
        "11212":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Amazon World (RPG)",
                "Diaper Baby Adventure (Kid game)",
                "God Simulator"
            ],
            "content":"<div class=\"\"><div> <span>Sarah brings the PS3 back and sets it up for you to use.<br>\r\n<br>\r\n\"I burned some of these from the internet, I bet you'll like them. Choose from these and pop it in.\" She told you \"I'm going to use the bathroom really quick\"<br>\r\n<br>\r\nYou follow her ass as it sways back in forth all the way to the bathroom. You see her turn and catch your eye while she shuts the door, and you swear you can make out the hint of a smile.<br>\r\n<br>\r\n\"Well I guess I should pick a game then.\" You haven't ever seen any of these titles before. Best hope that they're not low quality..<br>\r\n<br>\r\nYou choose...</span></div></div>",
            "created":1465102800,
            "id":2159136,
            "title":"\"Let me go get it\""
        },
        "112122":{
            "author_id":"shadoww",
            "author_name":"shade",
            "choices":[
                "you choose the 8 year old character",
                "you chose the baby charecter"
            ],
            "content":"<div class=\"\"><div> <span>You stare at them indecisively before remembering Sarah's busty tits and think how nice i would be to suck on them even if they are just in a game so you choose duaper baby adventure.<br>\r\n<br>\r\nSarah finishes up and see the game in your hand immediately grabs it and shoves it into the Ps3  </span></div></div>",
            "created":1602620880,
            "id":2920701,
            "title":"Diaper Baby Adventure (Kid game)"
        },
        "12":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "You pass out/wake up in this new kingdom owned by Cassie, your apparent owner.",
                "You hear a knock at the door and snap out of it",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>You hear a ping from your cellphone.<br>\r\n<br>\r\n\"Hey silly, what's up?\" It was your friend Cassie. She was a cute bubbly girl who you had met earlier this year.<br>\r\n<br>\r\n\"Not much, just laying around watching TV. Want to come over?\" You message back. You had a crush on the girl, even though she was 2 years younger than you and though she had a cute body and curves, she acted quite immature. She was nice enough when she was having a good time with you though.<br>\r\n<br>\r\n\"Sure :) Be right there Ty!\" She texted you back. \"What are you watching?\"<br>\r\n<br>\r\n\"The news. Pretty crazy stuff.\" you responded. You were kind of zoning out from the droning programming.<br>\r\n<br>\r\n\"Ughhh Ty that's so boring, I'll find something cool for us to watch when I get there :P\" She said. You smiled to yourself, she jokingly would always try to make you do stuff for her, but you always teased her that she couldn't make you like she could the guys in her grade.<br>\r\n<br>\r\n\"I like it, and it's my house! I'll tell you what we're watching\" you said back to her. Your vision was starting to go blurry. You were focusing. You were completely zoning out on the TV when you got her last text message.<br>\r\n<br>\r\n\"No way silly. Everything I say is true, whether you like it or not! <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\">\" she said. It was the last thing you read before you slipped into a total daydream. You imagined a massive pink palace that seemed to take up all of your vision. All of a sudden, your body rushed up to the door, which was many MANY times larger than a normal door. It opened and inside you saw a massive open area that was a true representation of a girly palace of pure opulence. Your vision became more focused as you heard voices around you that sort of brought you to your senses.<br>\r\n<br>\r\nYou saw massive women dressed like Disney princesses that towered far above you. You couldn't be more than half the size of their pinky toes. They all had thick curves and flawless faces that looked a bit young, and then you realized that they resembled girls from your High School. They were. All of them were Cassie's friends or people she knew. They all had the the bodies of thick beautiful princesses, with large heaving chests and round shapely bottoms, and large burgeoning hips, and their faces couldn't have been more beautiful without being recognizable, but they still maintained their obvious youth. It made you feel strange. <br>\r\n<br>\r\nThen, just as before, you found yourself being rushed forward until you were at the foot of a massive woman in a large flowing petticoat, who was even many times larger than the other girls, who sat on a massive pink throne. You looked up and saw a massive pair of breasts that stretched the Belle like dress to it's limit. Even further above was Cassie's smiling face. <br>\r\n\"You're my slave\" she said in a sweet nectary voice. You dropped to your knees without any explanation as to why. You kissed the incomprehensibly large toe in front of you.<br>\r\n\"Everything I say is true\" you hear her say to you as you vigorously kiss the immense stadium sized toe. The smell of it makes you dizzy..<br>\r\n</span></div></div>",
            "created":1529904780,
            "id":2511587,
            "title":"Get a text message from someone"
        },
        "122":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Cassie puts her feet up on the couch",
                "Cassie laid down on her side, her butt facing towards you.",
                "\"Let me have the remote silly\""
            ],
            "content":"<div class=\"\"><div> <span><b>KNOCK KNOCK KNOCK</b> \"Tyyyyyyyyyy! Let me in!\" you hear Cassie yell from the door.<br>\r\n<br>\r\nYou realize you were daydreaming (Thank god) and rush to let your friend in. You open the door to see the cute, bouncy short brunette smile and rush to give you a hug. She was wearing a teal tank top that showed off her B cups, and had a pair of khaki short-shorts that showed off her generously large butt.<br>\r\n<br>\r\n\"Hey! I missed you!\" she said happily to you, even though it had only been a few days since you had seen her last.<br>\r\n<br>\r\n\"Yeah I uh, missed you too\" you replied. She was cute, but you weren't really sure how to respond to her advances. You both walked into the living room and sat on the couch. Immediately she smirked at you as you grabbed the remote. <br>\r\n<br>\r\n\"You're still watching the news? It's so booooooring. Why do you like this stuff\" she said giggling. You shrugged and scoffed. You looked down at your phone and saw your conversation with Cassie. For some reason, the last text message wasn't there.  <br>\r\n<br>\r\n\"Weird\" you thought to yourself. Had you imagined that too? You put your phone down and looked over at Cassie. She was getting comfortable...</span></div></div>",
            "created":1529905320,
            "id":2511589,
            "title":"You hear a knock at the door and snap out of it"
        },
        "1221":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "She picks a show, literally.",
                "\"You want to give me a footrub silly?\"",
                "She notices you staring at them."
            ],
            "content":"<div class=\"\"><div> <span>Cassie puts her feet up on the couch. She has cute feet, that are smooth and well cared for, in bright pink socks. She smiles at you as you look down at them.<br>\r\n<br>\r\n\"Cassie, come on, you don't need your feet up here\" you say to her.<br>\r\n<br>\r\n\"Yes I do silly. You'd be angry if I didn't put my feet up here. You're happy that they're on the couch!\" she giggled. Suddenly I felt slightly uneasy, before I realized that I agreed with her. I suddenly was happy that her feet were on the couch with me. I smiled and said \"You're right Cassie, thanks\" without really knowing why. I felt uneasy, even though I didn't show it.<br>\r\n<br>\r\nShe gave me a big grin and said \"Told you! I know what's best for you honey, that's why we're friends\"<br>\r\n<br>\r\nI think to myself about how I had my opinion shift so quickly. I knew it had happened, but I really didn't want her to move her feet now. She had completely changed reality by simply telling me that it was different than it was. It didn't take long before she asked me for the remote and after she told me that I'd like the show she put on, I relented and became even more worried.<br>\r\n<br>\r\nI really hadn't wanted to let this girl who thought I was a big strong jock walk all over me, but she had came into my house, put her feet up on my couch and had taken my remote all in less than 5 minutes.<br>\r\n<br>\r\n\"These socks make my feet look like the cutest in the world don't they?\" she said in a bubbly tone to me as she flicked through the channels. I looked down at her feet. She scrunched them a few times to emphasize them. As I stared at her feet, I felt my heart start to absolutely melt. Suddenly, her feet were all I could think about. I felt yourself getting a little turned on staring at her feet..</span></div></div>",
            "created":1529907060,
            "id":2511594,
            "title":"Cassie puts her feet up on the couch"
        },
        "12212":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Cassie noticed your boner",
                "You looked at Cassie and saw she had changed",
                "Try to rub her feet"
            ],
            "content":"<div class=\"\"><div> <span>She asked you with a smile on her sweet face.<br>\r\n<br>\r\nYou barely could contain yourself as you said \"YES\" enthusiastically. You felt embarrassed at how quickly this situation had turned into something completely different than what  you wanted it to be, but you also felt like you had ran into your first crush in gradeschool. Butterflies were all over your stomach as you stared down at her cute feet again.<br>\r\n<br>\r\n\"Do you want me to take my socks off or not?\" she asked looking over her hip \"My feet are kinda stinky. I had to go to the gym for cheerleading today.\" She finally had settled on something at looked back over at you. <br>\r\n<br>\r\n\"Let's watch Keeping Up With The Kardashians\" she laughed at you. <br>\r\n<br>\r\nYou grimaced. You hated those vapid bimbos. They were beautiful and huge racks and butts, but you couldn't stand their stupid dramatic show. \"Come on Cassie, that show is full of dumb bimbos.\" You thought to yourself about all of the artwork you had seen on DeviantArt and other websites you browsed. \"Honestly their butts aren't even that big. I don't see what the fuss is about!\" You had seen plenty of girls that put the Kardashians butts to shame, morphed or otherwise. It didn't impress you that much anymore.<br>\r\n<br>\r\n\"Wow Ty that's so mean of you! They're very smart girls, they might seem like they're having dumb arguments to you, but its because you're just too dumb to understand what they're talking about.\" she said with a obviously annoyed voice \"As for their butts not being that big, I know that's not how you really feel. You told me the other night when we were falling asleep on the phone that you thought Kim's butt was what you thought should be the national average, and we're friends and all, but TMI on telling me one of your biggest sex fantasies was living inside her buttcheeks\"<br>\r\n<br>\r\nYou were floored by everything you had heard, and you knew that it was all becoming true as it did. You looked at the TV screen and saw Kim and Khloe talking about something. You tried to follow along, but you couldn't keep up with all the numbers and formulas they were saying. You instead started to drool as you stared at Kim K's enormous ass. It was almost twice the size it normally was, and you felt yourself getting a boner as you stared.<br>\r\n<br>\r\nWhat happened next?</span></div></div>",
            "created":1529908320,
            "id":2511598,
            "title":"\"You want to give me a footrub silly?\""
        },
        "1222":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Go sit on the smaller couch and think about what to do next",
                "Rub Cassie's feet",
                "Cassie says something else."
            ],
            "content":"<div class=\"\"><div> <span>Cassie had laid down on the couch and laid on her side watching the TV. Her butt was pointed at you and she had her legs folded up.<br>\r\n<br>\r\n\"Hey!\" you say to her. \"I was laying down like that! Go use the smaller couch or something\" On the other side of the coffee table you had a couch that was smaller.<br>\r\n<br>\r\n\"No way\" she giggled \"This couch is big enough for me to lay down on. That one over there is too puny. It might be big enough for you though\"<br>\r\n<br>\r\nYou laughed. Sometimes she joked with you about being larger than you, which you laughed off because you were a foot taller than her. \"Yeah I don't thi-\" you trailed off. You had turned back to the TV, but as you looked back over at her, you saw a much larger girl than you were expecting.<br>\r\n<br>\r\nIt was Cassie alright, but she was huge compared to how large she had been a few seconds ago. Her cute face loomed over her huge hip. Looking at her face gave you a view of her larger than life ass. \"You don't think what?\" she said sounding slightly annoyed. \"Go over to the smaller couch Ty. There isn't enough room for us both to lay down and you can fit over there\" she gestured over to the couch. <br>\r\n<br>\r\nAgain you looked over at the smaller couch, and it looked like it had grown just as she had. It looked more than large enough for you to lay on now. \"BREAKING NEWS\" you heard on the TV. You looked back over to see that the TV seemed larger than it had before. Before you even had a chance to react to the TV seeming larger, Cassie exclaimed \"Oh my god Ty, come on I want to extend my legs a bit!\"<br>\r\n<br>\r\nYou looked over at her and your mouth widened. Her body was much larger, probably close to 10 feet tall now, and she looked thicker to boot. Her legs were scrunched up close to her humongous ass and her huge feet were pretty close to your face. \"Unless you want to rub my feet\" she laughed.<br>\r\n<br>\r\nYou stood up and found that you only rose up a fraction of what you used to. You had to be about 4 feet tall. You felt slightly dizzy as you thought to whether or not you would go sit on the other couch. Cassie playfully nudged you with her huge foot.and giggled as you fell back on the now much larger couch next to her other foot.</span></div></div>",
            "created":1529906160,
            "id":2511591,
            "title":"Cassie laid down on her side, her butt facing t..."
        },
        "12223":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "She gets some text messages back",
                "You check your Facebook..",
                "Buttmunch?.."
            ],
            "content":"<div class=\"\"><div> <span>\"My butt is sooo sore from cheerleading\" she said as you sat lightly restrained by her leg laying on your lap. You glance over at it. \"Our workouts have been so tough lately, but I eat enough ice cream anyway. It's probably good that the calories are going to my legs and butt than it is if they went to my belly\"<br>\r\n<br>\r\nAs the words came out of her mouth, you watched as her butt swelled up larger. She was over twice your height, and it made it seem all that more intimidating. <br>\r\n<br>\r\n\"Is it weird to ask you to rub my butt?\" she said lightly while she turned and laid chest down while smiling back at you.<br>\r\n<br>\r\n\"Uhh Cassie I\" you stammered out nervously.<br>\r\n<br>\r\n\"Oh come on Ty, as a bonus I'll let you kiss both of my cheeks first\" she laughed loudly. You turned beat red before she said \"I bet I know what it is. What you really want is to kiss both of my cheeks for a minute a piece, then you'll rub my butt for me, right?\" She obviously wasn't taking the suggestion seriously, but because she said it, it became true.<br>\r\n<br>\r\n\"Yes Cassie\" you said \"Can I please kiss your butt cheeks for a minute a piece? If I can, I'll give you a butt rub for as long as you want\" you continued. The words were coming from your mouth, and you couldn't stop them.<br>\r\n<br>\r\nShe looked back at you with a huge smirk on her face \"Are you serious Ty? You want to kiss my butt for that long?\"<br>\r\n<br>\r\n\"I... Uh\" you were trying to resist it. You really wanted to, her massive butt was looming in front of you and it was taking all of your willpower to now throw yourself at her ass.<br>\r\n<br>\r\n\"Of course you do, did you hear how you just asked me? You're pretty much begging me. It's adorable, you're such a cutie. Of course you can kiss my butt. It's like your favorite thing in the world to do!\" She said playfully, not knowing that she was further altering reality.<br>\r\n<br>\r\nShe pulled down her shorts and revealed her shapely butt. You couldn't contain yourself,  planting as many kisses as you could on her young butt. Your boner was pushing against your jeans as you kissed her ass and took in her light girly scent.<br>\r\n<br>\r\n\"Oh my godddd this is adorable\" she interrupted you. You looked up and saw her Iphone pointed right at you. \"Don't let me stop you little guy, show them how you really feel about my booty\" she laughed<br>\r\n<br>\r\nYou were so embarrassed. You couldn't believe she had recorded you.<br>\r\n<br>\r\n\"Oh my gosh you're so tiny next to my huge butt. I'm sending this to my friends\" she said. You watched as her butt seemed to swell even larger in front of you. You realized that it had grown slightly, and you had shrunk slightly because of her last statement.<br>\r\n<br>\r\n\"Cassie please don't send that to anyone!\" you pleaded with the now massive 16 year old. You felt so powerless.<br>\r\n<br>\r\n\"Are you kidding? Who wouldn't want to see you kissing my butt. Everyone should know why I call you Buttmunch\" she laughed \"I don't know why you're acting all embarrassed, people have you on Facebook.<br>\r\n<br>\r\n...  </span></div></div>",
            "created":1529910060,
            "id":2511615,
            "title":"Cassie says something else."
        },
        "122231":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "\"Yeah he's my butt slave\"",
                "\"Yeah he's my slave",
                "\"Don't talk about my boyfriend like that!\""
            ],
            "content":"<div class=\"\"><div> <span>As you sat somewhat bewildered between Cassie's titanic legs with your face resting on her buttcheeks, her phone made a \"PING\" noise. She squealed and her massive thighs shut on you, driving your face slightly into her booty. Your mouth was resting against her soft pink panties.<br>\r\n<br>\r\n\"Oh my god Laura said that you're smaller every time she sees you\" You watched as the pink expanse grew in front of you.<br>\r\n<br>\r\n*PING*<br>\r\n<br>\r\nCassie laughed even harder \"Kayla said that you're obsessed with my butt and that she can see you sniffing it when you're kissing it.\" She looked back at me \"I was sweating pretty hard, so you must really be attracted to my actual personal scent if you think it smells good back there.\"<br>\r\n<br>\r\nYou took a deep breath and felt at peace. Her sweaty butt was the most intoxicating thing you had ever smelled, as far as you were concerned.<br>\r\n<br>\r\n*PING* <br>\r\n<br>\r\n\"Wow your ex Carly commented\" she said with a laugh as you gazed up over her pink panties alarmed \"Buttmunch is such a little twig now hahaha. I used to date him, but he got really skinny LMAO I had to break up with him and my friends and I started calling him Twiggy Ty, but I think I like Buttmunch better. He looks so fucking tiny. I can't believe I dated someone as short as him, even before he lost the weight\"<br>\r\n<br>\r\nYou suddenly shrunk even more, and felt your body become thinner and weaker. You were barely able to see over her panties now, as you were being nearly completely pressed into her asscrack.<br>\r\n<br>\r\n*PING* <br>\r\n<br>\r\n\"Is he your slave now?\" She said and trailed off...</span></div></div>",
            "created":1529911080,
            "id":2511621,
            "title":"She gets some text messages back"
        },
        "1222311":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Play a game",
                "Go take a nap",
                "Go babysitting"
            ],
            "content":"<div class=\"\"><div> <span>\"He's my little butt slave, aren'tcha Twiggy?\"<br>\r\n<br>\r\nPanicking, you raised your shrinking body and said \"Yes I am Cassie\" with a reluctant smile.<br>\r\n<br>\r\n\"Good! Remember that you signed a contract, and you know what would happen if you broke that?\"<br>\r\n<br>\r\nSweating, you had no idea what she was talking about. You quietly kissed her huge ass and hoped she wouldn't bring it up. She continued texting and giggling. You were now her butt slave and it was tough to even think about escaping. <br>\r\n<br>\r\nShe looked back at you and said in a deadpan tone:<br>\r\n<br>\r\n\"If you don't be a good slave, my butt will literally eat you\" As you made eye contact with her, her new reality exploded into your mind<br>\r\n<br>\r\nYou panicked, remembering now you being full size, and begging her to let you enslave you. She didn't want to do it at first, but you started crying like a baby and pathetically started kissing her dirty feet. She was so small and meek compared to you, and wasn't used to ever dominating anyone, so she was taken aback<br>\r\n<br>\r\n[\"I... I don't know if I can let you be my butt slave. I know it's kinda big, but I don't think it needs someone to worship it\" she stammered out<br>\r\n<br>\r\n\"Cassie please! I need to be your butt slave. I will do anything for this\" you said, snot running down your face and stammering pathetically, clinging to and kissing her feet.<br>\r\n<br>\r\n\"Wow, I thought you were a big tough guy but this really is pretty silly\" she said giggling a little \"W..why do you think you need to be my butt slave\"<br>\r\n<br>\r\nYou looked up with red eyes \"Because I'm not big or tough, I'm really a wimpy shrimpy twig. I need to be your slave so that you can get bigger and stronger, and I can embrace my destiny\"<br>\r\n<br>\r\nShe burst into laughter \"That's so ridiculous, but I always wanted to be bigger and more powerful than someone, and you've always been a hunk to me so I'll try it out I guess\" <br>\r\n<br>\r\nShe took the papers from your hand \"What are these?\"<br>\r\n<br>\r\nYou remembered being overjoyed, the happiest you'd ever been \"That's my contract. Once you sign it, I'll be your butt slave and if I'm ever not a good slave, your butt will eat me\"<br>\r\n<br>\r\n\"Okay sweetie\"]<br>\r\n<br>\r\nYou now remembered everything. You shuddered as your memories of the former life you knew were replaced with this new version of life (As you were nose-deep in her giant asscrack)<br>\r\n<br>\r\n\"Alright tiny, it's time we..<br>\r\n<br>\r\n</span></div></div>",
            "created":1549796580,
            "id":2615493,
            "title":"\"Yeah he's my butt slave\""
        },
        "13":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Squat Machine",
                "Elliptical",
                "Bench Press"
            ],
            "content":"<div class=\"\"><div> <span>\"I guess I'll go to the gym.\" Ty said. He grabbed his gym bag and headed down to the gym.<br>\r\n<br>\r\nAbout ten minutes later, he arrived at the gym. It was pretty busy in the gym that day. He looked around at all the machines people were using. He eventually decided to check out what girls were around in the gym, to dictate where he went to workout.<br>\r\n<br>\r\nTy looked over to the squat machine to see a girl, Marissa squatting 225. Her short-shorts did little to hide her massive ass, which flexed full of blood after her first set.<br>\r\n<br>\r\nOn the elliptical, he saw two blonds in Yoga pants chatting, Jessa and Laura,<br>\r\n<br>\r\nOver at the bench press, he saw a girl with a very large chest putting up 180, which Ty thought was pretty impressive.<br>\r\n<br>\r\nWhere should you go to work out?</span></div></div>",
            "created":1465102800,
            "id":2159133,
            "title":"Go to the gym"
        },
        "131":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "3 ft tall",
                "2 ft tall",
                "1 ft tall"
            ],
            "content":"<div class=\"\"><div> <span>Ty walked over to the Squat rack and started setting up to do some squats himself. He couldn't help but always try to catch of glimpse of Marissa's ass as she squatted deep reps, her ass bloated with muscle. <br>\r\n<br>\r\nOne time, Ty wasn't fast enough to avoid her catching him looking.<br>\r\n<br>\r\n\"Hey Ty\" she said \"Why don't you try actually squatting that instead of watching me\"<br>\r\n<br>\r\nShe gestured to the bar he had. You were only squatting 180. You were weaker than her, atleast in your legs.<br>\r\n<br>\r\n\"The fact that you're a man is the only reason you can even do that much\" she said with a smirk on her face. \"If you were a girl and worked out the way you do, you'd be a weakling.\"<br>\r\n<br>\r\nShe picked up the 225 and squatted it 8 times with ease, and set it down roughly. Ty tried, but failed to not stare at her ass the entire time.<br>\r\n\"I think you should donate to my ass if you're going to stare at it like that.<br>\r\n<br>\r\nSuddenly Ty feel a shock going through his body. He looked down at himself and found he was shrinking. His relatively large muscles were becoming smaller by the second. He looked up at Marissa, whose frame had blown up in the meantime. She looked like an amazon, and her muscles were massive, but she still retained a thin layer of fat over her which only proved to make her look even thicker.<br>\r\n<br>\r\nHow small did she make him?</span></div></div>",
            "created":1470891600,
            "id":2194343,
            "title":"Squat Machine"
        },
        "14":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Someone approaches you",
                "You start to walk..."
            ],
            "content":"<div class=\"\"><div> <span>Ty decided to take a nap. <br>\r\n<br>\r\nIn his nap, he dreamed of being in a big puffy room filled with big pillows everywhere. He started off in the clothes that he fell asleep in, but the longer he looked around, the more the room seemed to swell in size. Ty looked down at his clothes to find that they had disappeared! <br>\r\n<br>\r\n\"What the hell!\" Ty shouted, finding his bottom to be the only thing covered, by a big puffy diaper no less.<br>\r\n<br>\r\n\"I need to figure out how to get out of here.\"</span></div></div>",
            "created":1465102800,
            "id":2159132,
            "title":"Decide to take a nap"
        },
        "141":{
            "author_id":"the_doje",
            "author_name":"Doje",
            "choices":[
                "Get fed by your new mom",
                "Watch TV with your mom",
                "Try to escape during the day"
            ],
            "content":"<div class=\"\"><div> <span>\"Morning Ty\" a cheery voice rang out as loud thuds echoed into the room. The light flashed on and you saw a hot girl named Abby you knew from school walking towards you.<br>\r\n<br>\r\n\"A-Abby! Wh-wh-why are you here you here!\" you said desperately. She was a very strong petite hockey girl with enormous breasts and a large booty. You realized her breasts were much bigger than usual and she was far taller than you were. Abby sighed \"Oh Ty, you always pretend you don't know what's happening. You're a little baby, and you're getting littler all the time\" she laughed.<br>\r\n<br>\r\nAs if a reaction to this, the room swelled in size again, and Abby grew with it, her breasts lurching larger still in her tight blue athletic shirt.<br>\r\n<br>\r\n\"And your mommy is BIG\" she emphasized thrusting her chest outwards. It surged forward and she surged upwards, looking down she stated \"and getting bigger all the time\"<br>\r\n<br>\r\nIf there was any cause that would make you consciously use a diaper after being potty-trained, this was a pretty good one. You peed yourself and she immediately seemed to have noticed.<br>\r\n<br>\r\n\"Aww little Ty peed his diapee. Looks like it's time to start punishing you today\" she happily chimed. Punishing you? What did she mean?<br>\r\n<br>\r\n\"Let me change you pee-pee boy!\" she almost sang, her massive breasts pushing against you as she freakishly quickly changed you. There was something different though. These diapers were bigger, and a tinged pink. \"You're at diaper stage 1 for the day. If you want to stop becoming a baby and me to stop becoming more and more your true mommy forever, all you have to do is not pee your pants\" she beamed at you with her beautiful eyes.<br>\r\n<br>\r\nAbby, your 'mommy' takes you downstairs. Once there, you...</span></div></div>",
            "created":1506491340,
            "id":2392458,
            "title":"Someone approaches you"
        },
        "15":{
            "author_id":"wildones",
            "author_name":"Bmk",
            "choices":[
                "Shie shop",
                "Library",
                "Cafe in mall",
                "Childhood",
                "Very tall security guard(girl)"
            ],
            "content":"<div class=\"\"><div> <span>You see 3 beautiful girls on the way. But 3u is as long as one long boots. Where is the shoe magazine when you are passing by? It is the longest (10cm long) you are telling you for a long time, but you feel very short. One of the girls (the longest one is 20-25cm long and you are 1.55s long) from the back says how long it must be at the age of 13 to be a child or something.</span></div></div>",
            "created":1506172860,
            "id":2390018,
            "title":"Go to the mall"
        }
    },
    "info":{
        "author_id":"the_doje",
        "author_name":"Doje",
        "brief_description":"This is an interactive about the life of a young man named Ty who becomes tinier",
        "created":1465100400,
        "description":"<td align=\"left\" class=\"norm\">You are Ty, an 18 year old growing up in the suburbs of Springfield, wherever. <br>\r\n<br>\r\nThrough various means, you find yourself shrunk at the hands of various women and girls you know, and find them growing larger, more voluptuous and far more powerful than you. <br>\r\nThese women become either your goddess, tormentor or savior, sometimes all three. Each story has different motives and each girl wants to do different things. Maybe you'll accidentally cause them to become an ever-growing goddess, or maybe they'll gradually turn you into a little baby who shrinks to the size of a grain of sand! The possibility is endless!<br>\r\n<br>\r\nKeep it straight please, <br>\r\nKeep the main character Ty,<br>\r\nTy can never become larger than the girl who shrinks him.<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhen I first made this interactive, I was hopeful that I would find an interactive that would have everything I was looking for in it. I am passionate about making this the ultimate interactive for my tastes, if you'd like to contribute, please do, but keep the spirit of my story alive, and try to add decent sized entries if they aren't setting up for some greater purpose for you.<br>\r\n<br>\r\nI WILL TIP 500GP for good entries (Starting June 2018! Please let me know if you didn't receive yours!)</td>",
        "id":2086392,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602620880,
        "modified":1602620880,
        "pretty_title":"Women grow big, you shrink and regress."
    }
}