{
    "chapters":{
        "1":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Dipper",
                "Mabel",
                "Pacifica",
                "Wendy",
                "Other/Combo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character do you want to fatten up?</span></div></span></div>",
            "created":1567659600,
            "id":2713710,
            "title":"Who to pick?"
        },
        "11":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Story 4",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your story!</span></div></span></div>",
            "created":1567659600,
            "id":2713721,
            "title":"Dipper"
        },
        "111":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "The hands stripped off his cloths and forced him to wear girls underwear ",
                "They forced hm into bed and began to feed him ",
                "Dipper felt himself age backwards as the hands held him "
            ],
            "content":"<div class=\"\"><div> <span>Dipper pines was a smart 12 year old boy who had a thing for the supernatural<br>\r\nHe dedicated himself to finding monsters and revealing the truth about them.<br>\r\nHe wanted to be known as the boy who discovered monsters <br>\r\n<br>\r\nOne day Dipper found an interesting case about a local ghost.<br>\r\nDipper read up about this old mansion on a hill that was long abandoned<br>\r\nIt once belonged to a rich family. <br>\r\n<br>\r\nIt was said the parents became crazy and fattened up there 1 year old daughter making her into a huge room filling blob.<br>\r\nSomehow the parents got squished under the blob babies fat ass.<br>\r\nOnce the three was found by police they helped move the girl with a crane and took the parents to the local Hospital in order to save them but they passed away not long after.<br>\r\nThe daughter was too young to know about this and spent the rest of her childhood slowly losing weight but she never did get trully skinny again.<br>\r\nEver since then the house has said to be haunted to the ghosts of the parents <br>\r\n<br>\r\nDipper got excited hoping maybe he could capture footage of these ghosts.<br>\r\nHe told Mabel about his plan but was disappointed to find Mabel was having friends over for a sleep over so she couldn't come.<br>\r\nDipper was annoyed he had to go alone but he was still determined to get footage of these ghosts.<br>\r\nDipper then went to the large house breaking in and going around taken pictures and filming what he saw <br>\r\nDipper was hoping to see some ghosts but found there was nothing.<br>\r\n<br>\r\nHe soon came up the bedroom upstairs <br>\r\nThat's when he heard a voice say \"A child is here\" <br>\r\nDipper looked around but no one was there.<br>\r\nAnother voice said \"It's a boy though. I was hoping for a girl\" <br>\r\nAnother voice said \"Don't be picky he will do just fine.\" <br>\r\nDipper felt hands grab at him and he panic trying to free himself from the invisible force. <br>\r\n<br>\r\nDipper was shocked when.....</span></div></div>",
            "created":1568696400,
            "id":2719809,
            "title":"Story 1"
        },
        "1113":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Dipper continued to eat.",
                "The ghost couple gave him some new clothes.",
                "Suddenly, Mabel came in to rescue him!"
            ],
            "content":"<div class=\"\"><div> <span>Dipper suddenly felt his body growing smaller, quickly realizing he was regressing from his 12-year-old age into a toddler, then into a baby, and soon became a cute, adorable newborn baby! He was plopped down onto the soft bed as the sounds of his invisible captors gawked at his youthful body.<br>\r\n\"Aww, he looks so cute as a baby!\" A voice mentioned, now more noticeably female.<br>\r\n\"I told you, dear. All babies look adorable, no matter what their gender.\" The male voice spoke up, patting Dipper on the head. \"Especially once they're made nice and plump!\"<br>\r\n\"Wh-what?\" Dipper asked in a high-pitched voice.<br>\r\n\"Now, now. Don't be fussy, baby. We'll make sure you get all the food you can eat!\" The father spoke. <br>\r\nSuddenly, Dipper noticed several piles of food appear before him with a faint, blue glow. The food began to levitate towards him magically, stuffing themselves into his mouth and forcing him to chew them down. He couldn't help himself, not only was he admittedly hungry, but the food was just too good to resist!<br>\r\n\"Good boy, eat up! You'll make a fine blob... Just like dear Patricia...\" The female voice smiled, poking Dipper's belly as it expanded outwards.<br>\r\n<br>\r\nThe food Dipper ate was far larger than his infantile body, causing his weight gain to occur much more rapidly than would be expected. His body spread across the bed, quickly becoming difficult for him to move around more than a weak jiggle. This futile jiggling only made the two ghostly parents love him more, and the food only increased in size and speed.<br>\r\n\"Mrrphg...\" Dipper groaned, watching in desperation as his once skinny, pre-teen body quickly bloated into a gigantic exercise ball of newborn fattiness.</span></div></div>",
            "created":1568696400,
            "id":2719916,
            "title":"Dipper felt himself age backwards as the hands ..."
        },
        "11131":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "the ghosts forced Dipper to wear some of Patricia's underwear ",
                "the ghots play with his fat for fun ",
                "The ghosts use some kind of curse to keep Dipper as a newborn forever "
            ],
            "content":"<div class=\"\"><div> <span>Dipper couldn't believe it not only was he a tiny cute newborn baby but he was also being force fed by feeder ghosts who treated him like he was there baby.<br>\r\nDipper had no choice but to eat as the food floated to his mouth and fed him.<br>\r\nHe couldn't get away since the ghosts kept him in place and even then he had the strength of a newborn and couldn't even walk he was at the mercy of the ghosts. <br>\r\n<br>\r\nThe food was so tasty Dipper ate up everything fed to him like sandwiches pie cake and milkshakes. <br>\r\nAs he ate his little naked baby body swelled with fat. his belly ballooned out across his lap becoming big and round. his arms and legs become plump. he grew cute girl like boy boobs and his ass was filling the bed and he grew 2 chins and big puffy cheeks. <br>\r\nPoor Dipper was so fat now well over 200 pounds which was big for a small baby like him <br>\r\n<br>\r\nDipper tried to talk between the bites. \"Please stop I'm not your baby I'm just some kid you need to stop feeding me otherwise I'll fill this room! <br>\r\nThe ghosts said \"Oh don't be so fussy baby. be good and eat your meal so you can grow fat and cute\" <br>\r\n<br>\r\nit was useless the ghosts ignored everything he said and just kept feeding him </span></div></div>",
            "created":1568774700,
            "id":2719921,
            "title":"Dipper continued to eat."
        },
        "111311":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Someone came to save him!",
                "He outgrew the room, spreading into the rest of the manor!",
                "The ghosts gave him a break with the food, only to stuff him with something else"
            ],
            "content":"<div class=\"\"><div> <span>The ghosts decide to have some fun. They begin to notice Dipper's clothes are ripping off, so they cover him up using some of Patricia's old underwear. He is put into a skimpy bra and panties, his fat squishing up against the tight underwear. He felt so embarrassed and awkward, his chubby baby face turning a bright red while food continued to be shoved down his throat.<br>\r\n\"Aww, you look just like our dear Patricia!\" The male voice spoke. \"Before she crushed us underneath her fat butt... She was so much happier then, and you'll be happy, as well!\"<br>\r\n\"We'll make you into the fat blob we never could turn Patricia into...\" The female voice doted, stuffing a huge amount of food into Dipper's mouth. \"You'll be bigger than she ever was!\"<br>\r\n\"Mrrphh!\" Dipper struggled to get a word in, but he just couldn't fight through all the blubber he had packed on, not the mention the large funnel of food constantly being shoved into him.<br>\r\n<br>\r\nThe newborn Dipper was at the mercy of these two feedee ghosts, stuffing him with more and more until...</span></div></div>",
            "created":1568777160,
            "id":2719930,
            "title":"the ghosts forced Dipper to wear some of Patric..."
        },
        "1113112":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Dipper soon fills up the whole mansion with his blubber ",
                "the ghosts then somehow make Dipper younger? ",
                "The ghosts brainwashed Dipper to think he was a girl and there child "
            ],
            "content":"<div class=\"\"><div> <span>Dipper was force fed through the night.<br>\r\nFor hours all the ghosts did was feed him stuffing him with cakes and pies making little newborn Dipper grow into a massive bed sized blob.<br>\r\nThe bra and panties he was forced to wear somehow kept stretching out around his fat body.<br>\r\n<br>\r\nThe cute pink bra kept his boy boobs nice and perky and the panties got swallowed up between his huge smooth creamy white ass cheeks.<br>\r\nHis arms and legs sunk into his fat body becoming completely useless leaving Dipper immobile unable to even move his head.<br>\r\nHis fat face sunk into his body as he lost his neck and grew huge cheeks and big neck and chin rolls.<br>\r\n <br>\r\nDipper soon filled up the room with his blubber making both the ghosts very happy as the mother ghost said \"Oh he's so cute he's just like our daughter only bigger! <br>\r\nThe father said \"He is our child now will take care of him and make him into the biggest blob possible\" <br>\r\n<br>\r\nDipper moaned and groined as they fed him and his fat began to break through the walls and spread into the hallways and out the windows.  </span></div></div>",
            "created":1568907840,
            "id":2720669,
            "title":"He outgrew the room, spreading into the rest of..."
        },
        "11131122":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Dipper finally stopped regressing at atomic size.",
                "Dipper woke up on the bed in the mansion, it was just a strange dream... Right?",
                "Mabel came to save him!"
            ],
            "content":"<div class=\"\"><div> <span>Somehow, someway, Dipper felt himself regressing even further. Not to any form of pre-birth state, but... Younger in ways Human Beings have never experienced. His cuteness and natural tininess became exaggerated to absolute insane amounts, reaching an age only describable as negative. If he weren't such a gigantic, mansion-sized baby, he would surely be less than a foot tall, and only shrinking in size!<br>\r\nAnd yet, despite his age lowering younger and younger, going from -10 to -100, all the way to the -1000's, he was still getting fatter, and much quicker, too! His appetite and metabolism seemed to be going absolutely bonkers, like a computer system attempting to load some nonexistent, contradictory code.<br>\r\nHis new Ghost Parents were never prouder, their baby son growing into such an absolutely massive, young blob. Despite his head being now the size of a baseball, with cheeks larger than cars, he was now only conceivable as a mountainous range of adipose and flab.<br>\r\n\"Our son is so adorable! We need to make him fatter!\" The woman stated.<br>\r\n\"And even younger, as well!\" The male added.<br>\r\n\"Fatter... Younger... Fatter... Younger...\" They repeated as Dipper quickly outgrew the mansion, and resumed swelling out into the forest beyond.<br>\r\n<br>\r\nDipper could feed the trees beneath him, though he was now encased in a massive wall of his own obesity, blinded by blubber. He still felt very sad, he wondered how he must be like a monster now, crushing everything underneath his negative-age butt.<br>\r\nIt wasn't long until...</span></div></div>",
            "created":1568940960,
            "id":2720849,
            "title":"Younger Than Young."
        },
        "111311221":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Dipper gives in and starts to enjoy himself ",
                "Dipper soon filled up all of gravity falls with his ultra baby fat ",
                "Dipper woke up was it all a dream? "
            ],
            "content":"<div class=\"\"><div> <span>Dipper had aged as far backwards as humanly possible without him vanishing <br>\r\nIf he wasn't a mansion sized blob he would now look like a hamster sized baby with a small softball head with huge eyes little mouth and little tuff of hair. he would beyond cute. but he was also a giant blob of fat and now his tiny ultra baby face was now sinking deep into his neck rolls the ghosts had to lift the fat away to reach his mouth to feed there baby boy.<br>\r\n<br>\r\nDipper was now stuck as a ultra baby even if he did keep aging it would take a million years for him to go back to even being a newborn again. but the ghosts even used some kind of magic to halt Dipper's ageing all together keeping him stuck as a 100000 years backwards baby. <br>\r\n<br>\r\nLittle Dipper was so humiliated and now that he was so young the ghosts now thinking he was the perfect age began to feed him twice as fast his ass swelled out behind him crushing trees and his belly swelled out in front of him covering the hill the house once sat on.<br>\r\n</span></div></div>",
            "created":1568995140,
            "id":2721131,
            "title":"Dipper finally stopped regressing at atomic size."
        },
        "1113112213":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "On their way out, they notice a gigantic, delectable feast.",
                "They manage to leave, but Mabel is acting a bit weird.",
                "The ghosts return, and begin to feed Dipper and Mabel!"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, Dipper woke back up in the mansion, completely unchanged and skinny. It seemed Mabel was there with him, trying to wake him up.<br>\r\n\"There you are, silly! You ran into this big house earlier, and you didn't come out for hours.\" Mabel explained. \"I'm glad you're alright, though!\"<br>\r\nDipper rubbed his head. \"Ough... What happened? I had the strangest dream...\"<br>\r\n\"Don't worry about that, bro. Let's just get home, alright?\" Mabel offered, picking Dipper up out of the old bed.<br>\r\n<br>\r\nDipper figured what happened had to have been just a long, odd dream, rubbing his head groggily. Yet he still felt as if there were some kind of presence in the house, as though the two feeder parents haven't left him. They didn't seem to be doing anything yet, so as long as they could get out of the mansion, he would presumably be safe.<br>\r\n<br>\r\nThat is... IF he could leave the mansion.</span></div></div>",
            "created":1568995500,
            "id":2721132,
            "title":"Dipper woke up was it all a dream? "
        },
        "11131122131":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "There bodies grew fat",
                "They grew younger and cuter",
                "There cloths changed into tight skimpy bikinis "
            ],
            "content":"<div class=\"\"><div> <span>Dipper and Mabel where going to leave. but Dipper couldn't shake that dream it felt so real he felt so soft and fat only a few minutes ago so what the hell happened? <br>\r\nThat's when Dipper heard a voice say \"Are test was perfect and now that the boy's sister is here we can now have two children!<br>\r\nDipper turned back to see nothing and Mabel called to him \"Come on Dipper let's go already\" <br>\r\nBoth twins walked out the house and saw something very odd.<br>\r\n<br>\r\nThere was a picnic outside. a huge picnic with tons of food looking like it was all just made.<br>\r\nThere where pies and cakes and pizza and ham and drinks and burgers everything a kid loved.<br>\r\nMabel's eyes glew when she saw it saying \"Oh wow a picnic! and no one else is around why don't we eat some?<br>\r\nDipper said \"Wait this is wrong why is that here? it's like it was put here for us\"<br>\r\nMabel said \"Who cares? I'm hungry let's dig in! <br>\r\n<br>\r\nMabel sat down and began to eat <br>\r\nDipper at first didn't want to eat but his belly growled and the food looked good.<br>\r\nDipper then sat down and joined in eating up all the food,<br>\r\nMabel stuffed pie slices down her maw and Dipper ate up big bowls of ice cream.<br>\r\nBoth kids loved this food it was so tasty.<br>\r\n<br>\r\nBut as they ate both Dipper and Mabel didn't even notice as.....</span></div></div>",
            "created":1568996040,
            "id":2721133,
            "title":"On their way out, they notice a gigantic, delec..."
        },
        "111311221312":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "They ran out of food.",
                "The ghosts returned!",
                "They were given skimpy underwear."
            ],
            "content":"<div class=\"\"><div> <span>The two were so preoccupied with stuffing their faces that they didn't even notice their ages slowly regressing, shrinking down from 12-year-olds to 10-year-olds, then down to 5, 4, 2, all the way to becoming obese newborns. Their stomachs growled for more all the way through, however, and their feasting had not stopped even when they became tiny, fatty babies.<br>\r\n\"Mrrph... Mo'!\" Mabel squeaked in a high-pitched voice, mouth full of burgers.<br>\r\nEven Dipper had become as gluttonous, joining his sister in a hunger-induced rampage on this food, which didn't seem to be running out any time soon. Their clothes stretched out, revealing several folds of their blubbery bodies, spilling outwards off the chair and dangling towards the ground as their newborn bodies kept shoveling hundreds of meals into their voracious maws.<br>\r\n<br>\r\nDipper and Mabel continued to eat and eat until...</span></div></div>",
            "created":1568996280,
            "id":2721135,
            "title":"They grew younger and cuter"
        },
        "11132":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "A baby boy.",
                "A baby girl."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are the clothes for a boy or girl?</span></div></span></div>",
            "created":1579372080,
            "id":2775215,
            "title":"The ghost couple gave him some new clothes."
        },
        "12":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Story 4",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your story!</span></div></span></div>",
            "created":1567659600,
            "id":2713720,
            "title":"Mabel"
        },
        "13":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Story 4",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your story!</span></div></span></div>",
            "created":1567659600,
            "id":2713719,
            "title":"Pacifica"
        },
        "14":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Story 4",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your story!</span></div></span></div>",
            "created":1567659600,
            "id":2713718,
            "title":"Wendy"
        },
        "15":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Combo",
                "Other individual characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe two characters?</span></div></span></div>",
            "created":1567659600,
            "id":2713711,
            "title":"Other/Combo"
        },
        "151":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Dipper and Mabel",
                "Mabel and Pacifica",
                "Dipper and Pacifica",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Take your pick!</span></div></span></div>",
            "created":1567659600,
            "id":2713712,
            "title":"Combo"
        },
        "1511":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your story!</span></div></span></div>",
            "created":1567659600,
            "id":2713713,
            "title":"Dipper and Mabel"
        },
        "15111":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Mabel found a working cotten candy machine ",
                "Dipper had come to the hall of mirrors and all his reflections seemed round ",
                "Mabel and Dipper met back up at the freakshow tent "
            ],
            "content":"<div class=\"\"><div> <span>Dipper and Mabel where like two pees in a pod working together to solve mysteries and have fun <br>\r\nOne day the two came across something new an abandoned circus on the outskirts of town long deserted and rusted.<br>\r\n <br>\r\nDipper looked at the journal saying \"I know about this place Mabel this old circus used to be a busy famous circus till one day some kinds went missing when they where found the kids where fattened up into big fat blobs and put into the freak show for the circus after that the circus was shut down. we've got to figure out the mystery behind this place\" he said excitedly <br>\r\n<br>\r\nBut Mabel was not excited as she said \"Oh come on Dipper couldn't we have stopped to eat before we came here? I'm really hungry! <br>\r\nDipper sighed and said \"Mabel will get food afterwords this is an amazing mystery here! I'm sure you can hold off eating for a while.\"<br>\r\nBoth kids went into the circus looking around the old place looked like no one had been there in years<br>\r\n. <br>\r\nAs the kids walked around Mabel got separated from Dipper as she wondered if she could find some food around the circus that didn't spoil Dipper looked behind himself and saw Mabel was gone he got annoyed and went to look for her and as the twins now separated looked around......</span></div></div>",
            "created":1567659600,
            "id":2713731,
            "title":"Story 1"
        },
        "151111":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Shot out tubes and began feeding Mabel tons of cotton candy.",
                "A pink slime monster hopped out threateningly.",
                "A strange gas exhaled from the machine, then it broke down entirely."
            ],
            "content":"<div class=\"\"><div> <span>As Mabel wandered around, she found what seemed to be a completely functioning cotton candy machine! It was whirring with mechanical noises and clattering gears, just a little bit rusty but seemed to be in good condition.<br>\r\n\"Mmm! Don't mind if I do!\" Mabel smiled, licking her lips as she went over to get herself a cone. She grabbed the paper stick which held the cotton candy and tried to climb up to get inside, only to notice the machine violently shaking as she touched it. Something was definitely wrong here, and Mabel was getting a bit worried.<br>\r\n\"Uh, Dipper? Is this some kind of prank?\" Mabel asked, backing away as the machine shook more and more rapidly.<br>\r\n<br>\r\nEventually, the Machine...</span></div></div>",
            "created":1567659600,
            "id":2713733,
            "title":"Mabel found a working cotten candy machine "
        },
        "1511111":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Dipper then came to sounds of his sister screaming and tried to help ",
                "Dipper was dealling with his own problems as a hotdog machine began to go crazy",
                "Mabel was all by herself was the machine fed her more and more. "
            ],
            "content":"<div class=\"\"><div> <span>Mabel saw the machine shake around like it was jumping when suddenly two large plastic feeding tubes shot out of the machine. <br>\r\nMabel gasped and shouted \"Dipper help! before the two tubes lunged at her and to her shock she felt two big plastic hoses fill her mouth to the point her jaw was fully open to let the two tubes in <br>\r\n<br>\r\n\"Mmmmmffff mmmhh! Mabel said trying to pull and spit the tubes out but then she saw something pump through the tubes to her shock rotten candy was being pumped from the tubes and into her mouth her cheeks bloated up from all the candy filling her mouth and she had no choice but to start eating taken big gulps of candy floss making it fill her little belly. <br>\r\nThe candy was so tasty that Mabel couldn't help but moan as she ate her belly began to grow making her sweater ride up to show off her big smooth pale tummy. <br>\r\n<br>\r\nIt soon got fat with belly rolls as her big belly filled her lap even the rest of her body got fat as her arms and legs got chunky her butt began to grow filling up her panties and making her skirt ride up she grew fatty boobs and she even lost her neck grew big fat cheeks and three chins. <br>\r\nMabel needed help she needed Dipper! </span></div></div>",
            "created":1567659600,
            "id":2713739,
            "title":"Shot out tubes and began feeding Mabel tons of ..."
        },
        "15111112":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Felt himself and Mabel getting younger?",
                "Saw a strange man in a Ringleader outfit.",
                "More feeding machines to fatten them both up."
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately, Mabel would find no help from Dipper, as he was busy being attacked by a rogue Hot Dog machine! They were shooting into his mouth like a gattling gun, being restrained by metal tubes, his mouth forced open by the many sausages being shoved into him. They came in at such a powerful rate he couldn't consume them all in time before another batch came in, he was constantly growing fatter and fatter with no end in sight!<br>\r\n<br>\r\nThe two Pines twins were trapped, each one now heavily obese to the point of ripping out of their clothes from the sheer amount of lard being piled onto them. Just as they felt they were going to keep growing forever, the machines suddenly stopped. They miraculously ran out of food to feed them with, huzzah! They wobbled around, feeling up all their newly-added pudge and blubber.<br>\r\n\"Hee hee... After all the force-feeding, this fat is pretty cool!\" Mabel smiled, wobbling her gut around playfully. It seemed she was enjoying it a lot, much more than Dipper, who was in the middle of a panic attack.<br>\r\n\"Oh no! I've ripped out of all my clothes, I can barely stand! I need to find Mabel, we need to get out of here, quick!\" He stated, attempting to get up onto his feet. He managed to just barely stand up, and waddled his humongous body over towards where Mabel was, managing to find her pretty easily from the sounds of playful giggling and a groaning stomach. \"Mabel, oh no, you got fat, too?\"<br>\r\n\"Yeah! Oohh, your tummy looks so cute and squishy! Bwop!\" Mabel giggled, poking Dipper's giant belly. He shoved as much of his shirt down as possible to cover it, but didn't do that great a job of it.<br>\r\n\"Mabel, this is serious! Something weird is going on in this carnival, and we need to get out before--!\"<br>\r\n<br>\r\nBefore Dipper could finish, he...</span></div></div>",
            "created":1567659600,
            "id":2713962,
            "title":"Dipper was dealling with his own problems as a ..."
        },
        "151111121":{
            "author_id":"deadman123",
            "author_name":"tincan",
            "choices":[
                "Dressed them both up like clowns ",
                "Gave them sprankling bikinis ",
                "put feeding tubes in there mouths "
            ],
            "content":"<div class=\"\"><div> <span>Both Mabel and Dipper where now obese kids with no cloths. only Dipper had his hat left but other then that both kids where butt ass naked with there huge bellies and giant asses on display <br>\r\n<br>\r\nDipper was freaking out he didn't want to be obese and naked but Mabel was having a blast as she loved being so soft and big she had fun playing with Dippers fat belly and even slapped his big butt making Dipper blush. <br>\r\nDipper then said \"Mabel we don't have time for this we need to leave now! <br>\r\nMabel then said \"Hey Dipper are you ok? your voice sounds higher it's cute! <br>\r\n<br>\r\nDipper was confused but he did notice was Mabel getting smaller? her face got fatter and her voice got higher too.<br>\r\nSoon Dipper realised and shouted \"Oh my god were getting younger! <br>\r\n<br>\r\nBoth kids shrank down becoming short and fatter soon it stooped and both Mabel and Dipper saw they where both 5 years old toddlers again. but now super obese with huge beach ball sized bellies and big round asses.<br>\r\nDipper blushed saying \"Oh no what if were stuck like this? how will Wendy like me now?<br>\r\n<br>\r\nMabel slapped her big belly and said \"Who cares this is great! I love being a toddler again! <br>\r\nsuddnly a light shined on both of them and a man in a top hat and suit who looked very ghost like came out saying \"Why hello children so nice to see new recruits for the circus! <br>\r\nMabel said \"Oh we can join the circus? Dipper said \"No way you made us fat and young in the first place didn't you! what are you trying to do to us?<br>\r\n<br>\r\nThe man said \"I just want you two to be the best new stars at my circus that audiences will love to see but first we got to make you look like your part of the circus! he said as he..... <br>\r\n</span></div></div>",
            "created":1567746000,
            "id":2714217,
            "title":"Felt himself and Mabel getting younger?"
        },
        "1511111212":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Continued to grow fatter, eventually becoming immobile.",
                "Regressed even further.",
                "Were fed more fattening foods"
            ],
            "content":"<div class=\"\"><div> <span>He put the two young toddlers into stretchy, sparkling bikinis which showed off a lot of their fat but restrained their fatty breasts and ginormous asses. They felt tight, yet still comfortable, and made them look even cuter!<br>\r\nDipper felt very embarrassed being in a skimpy bikini, feeling like some kind of girl, while Mabel thought it made her look even more adorable, much less awkward than being naked at least.<br>\r\n\"You look great in those! Now, come along! It's time for your big show!\" The ghostly ringleader spoke, levitating both kids with a strange, telekinetic ability. They were lifted into the big tent in the center, who knew what kind of diabolical scheme awaited for them inside?<br>\r\n<br>\r\nDipper was still nervous, trying to find ways to escape, while Mabel was just excited to see what the big show would entail. As they entered, the uproarious applause of several ghostly specters filled the seats, happy to see the obese toddlers.<br>\r\n\"Welcome, one and all, to tonight's biggest attraction; The Insatiable Toddlers!\" The ringleader spoke. \"Give them any food, any object, anything at all and they will eat it, and grow fatter and fatter! Their bellies are large, but their appetite is larger! Feed them, feed them!\"<br>\r\n<br>\r\nThe ghosts all clamored around to start feeding the children, starting with smaller, circus-themed foods like Hot Dogs, Pretzels, Elephant Ears and even some Burgers. A steady stream of food flowed into their mouths and fattened them up even more than ever before, much to the displeasure and pleasure of Dipper and Mabel respectively.<br>\r\n<br>\r\nAs they ate and ate, the two...</span></div></div>",
            "created":1567746000,
            "id":2714426,
            "title":"Gave them sprankling bikinis "
        },
        "1512":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your story!</span></div></span></div>",
            "created":1567659600,
            "id":2713714,
            "title":"Mabel and Pacifica"
        },
        "1513":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your story!</span></div></span></div>",
            "created":1567659600,
            "id":2713715,
            "title":"Dipper and Pacifica"
        },
        "15131":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Yes.",
                "Next."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Dipper and Pacifica  get fatter when they are dating?</span></div></span></div>",
            "created":1569008640,
            "id":2721237,
            "title":"Story 1"
        },
        "1514":{
            "author_id":"theroux3105",
            "author_name":"Umbra Sombra",
            "choices":[
                "Yes! Let's continue!",
                "No... Move on..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you thank? Ford and Stan?</span></div></span></div>",
            "created":1588092900,
            "id":2826304,
            "title":"Other"
        },
        "152":{
            "author_id":"theroux3105",
            "author_name":"Umbra Sombra",
            "choices":[
                "Robbie",
                "Soos ",
                "Or others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's about...</span></div></span></div>",
            "created":1588092420,
            "id":2826298,
            "title":"Other individual characters"
        },
        "1523":{
            "author_id":"theroux3105",
            "author_name":"Umbra Sombra",
            "choices":[
                "Grunkle Stan",
                "Grunkle Ford ",
                "Others?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Grunkle Stan, Ford... hmmm...</span></div></span></div>",
            "created":1588092480,
            "id":2826299,
            "title":"Or others"
        },
        "15231":{
            "author_id":"theroux3105",
            "author_name":"Umbra Sombra",
            "choices":[
                "Addict in food ",
                "He meets a witch "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How he will gain weight?</span></div></span></div>",
            "created":1588092780,
            "id":2826302,
            "title":"Grunkle Stan"
        },
        "15233":{
            "author_id":"theroux3105",
            "author_name":"Umbra Sombra",
            "choices":[
                "Sheriff Blubs ",
                "Gideon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's about these characters?</span></div></span></div>",
            "created":1588092660,
            "id":2826300,
            "title":"Others?"
        }
    },
    "info":{
        "author_id":"single22",
        "author_name":"Singed212",
        "brief_description":"Characters from Gravity Falls get fat and fatter!",
        "created":1567700880,
        "description":"<td align=\"left\" class=\"norm\">Rules apply as always, no gore, transformation (unless it's futa) or scat, and age regression is fine :3<br>\r\n<br>\r\nEnjoy! :D</td>",
        "id":2199896,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1588089324/item_id/2199896.png",
        "last_full_update":1588092900,
        "modified":1588092900,
        "pretty_title":"Gravity Falls WG Story"
    }
}