{
    "chapters":{
        "1":{
            "author_id":"rockreborn",
            "author_name":"RockSage",
            "choices":[
                "Look for help from people living in the ghetto",
                "Look for a way into the city and look for help there",
                "Scavenge for food",
                "Learn the area and find shelter",
                "Look for a military outpost"
            ],
            "content":"<div class=\"\"><div> <span>You groan and open your eyes. Dust and debris are everywhere around you. It looks like a war zone. This didn't look like your bedroom at all! <br>\r\n<br>\r\n\"Where am I?\" you wonder. \"What happened here?\" And how did you sleep through it?<br>\r\n<br>\r\nYou see a few men who look to be in their twenties or thirties walking around the rubble. You jog over to them, and they regard you with a distrustful gaze. <br>\r\n<br>\r\n\"Excuse me,\" you ask. \"I seem to be lost. Can you tell me where I am?\" The man in the front, a guy with a spiky hairdo, sneers at you.<br>\r\n<br>\r\n\"Like I'm going to help a Britannian punk!\" Pardon? You're American, not British. Can't he tell by your lack of a British accent?<br>\r\n<br>\r\n\"Er, I'm not British,\" you start to say, but the guy grabs you by the front of your shirt and pulls back his fist. Uh oh.<br>\r\n<br>\r\n\"Don't mock me, you bastard!\" he shouts as he nails you in the face. You fall backwards from the impact with a 'THUD!' as the guy and his group walk off, talking about the Britannians and the Japanese or something. You sit and stare at them, wondering what the hell that was about. <br>\r\n<br>\r\nA rumbling catches your attention as you see purple robots with guns drive over the debris in a nearby intersection. Wait a minute! Those are Sutherlands! You'd recognize that design anywhere! <br>\r\n<br>\r\nIt all makes sense now! The ruins, the thugs, the robots...you must be in Area 11! How the hell did you go to sleep and wake up in the world of Code Geass?! You may be an expert on the show, but that doesn't mean that you'd ever want to visit!<br>\r\n<br>\r\nWell, now what? You calm down and make a plan, that's what. You survey the area, finding a piece of chalk that you can use to jot down ideas for the time being.<br>\r\n<br>\r\nYour first option is the obvious one: find a way to get home. If you had to guess, the most logical way for you to get home would either involve some sort of technological gate or something, go into the world of C and hope that you can use the Sword of Akasha or whatever it's called, or the third possibility would be...death. If you decide to try to go home, you're definitely going to leave suicide as a last resort.<br>\r\n<br>\r\nAnother possible path would be to help the Black Knights and maybe lessen the collateral damage caused by the fight over the series. This would be a tricky path, because you'd have to deal with Lelouch for certain.<br>\r\n<br>\r\nA third path has you join the Britannian army and perhaps help there.<br>\r\n<br>\r\nOr, you could just play it by ear. Not a very wise decision, but with your presence, things may have already changed.<br>\r\n<br>\r\nYou muse to yourself on your possible choices: do you take a side, stay neutral, and/or try to get home? Doesn't particularly matter at this exact moment, because you know that you'll die far before you can complete any of these tasks if you don't get supplies, food, and money.<br>\r\n<br>\r\nOf course, you can strive for any number of these goals, but what do you think is your best option for the moment?</span></div></div>",
            "created":1348865820,
            "id":1436485,
            "title":"We're not in Kansas anymore, Toto..."
        }
    },
    "info":{
        "author_id":"rockreborn",
        "author_name":"RockSage",
        "brief_description":"You wake up in the world of Code Geass, armed only with your knowledge of the series! ",
        "created":1348863060,
        "description":"<td align=\"left\" class=\"norm\">You are a normal, 17 year old person who wakes up one morning to find that you are in Area 11 shortly before the events of the first season of Code Geass. You are well versed in the episode content, and must decide whether you will join the rebellion, enlist in the Britannian army, stay neutral and do something else,and/or try to go home. <br>\r\n<br>\r\n<br>\r\nDo's: Keep characters in-character. This is of the utmost importance. For example, don't have Lelouch instantly trust your  <br>\r\n          character if he or she reveals that he/she knows about his mother.<br>\r\n         Use proper grammar, spelling,punctuation, etc. No one likes to read a sloppy chapter.<br>\r\n         Romance and 18+ stuff is allowed AS LONG AS IT MAKES SENSE.<br>\r\n<br>\r\nDon't's: No OCs that effect the original plot.<br>\r\n             No superpowers. You may have your character gain a Geass at some point, but only if the progression up to <br>\r\n             that point makes sense and the Geass is mind-based.<br>\r\n             No guy-on-guy stuff.<br>\r\n<br>\r\nOther than that, just have fun with it!<br>\r\n              </td>",
        "id":1894155,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1348865820,
        "modified":1348865820,
        "pretty_title":"Stranded in Area 11"
    }
}