{
    "chapters":{
        "1":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Shadowcat and Rogue",
                "Magma and Boom-Boom",
                "Jubilee and Wolfsbane",
                "Shadowcat and X-23",
                "Shadowcat and Danielle Moonstar"
            ],
            "content":"<div class=\"\"><div> <span>Who will get the ball rolling?<br>\r\n<br>\r\nChoices...<br>\r\n<br>\r\nShadowcat and Rogue<br>\r\n<br>\r\nMagma and Boom-Boom<br>\r\n<br>\r\nJubilee and Wolfsbane<br>\r\n<br>\r\nShadowcat and X-23<br>\r\n<br>\r\nor<br>\r\n<br>\r\nShadowcat and Danielle Moonstar<br>\r\n<br>\r\nTake your pick!</span></div></div>",
            "created":1582088400,
            "id":2789584,
            "title":"Let it begin!"
        },
        "11":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Rogue uses an inhibitor collar",
                "Kitty uses her phasing",
                "Kiss during Truth or Dare",
                "Admits her feelings after Rogue is nearly killed",
                "Climbs into bed with Rogue"
            ],
            "content":"<div class=\"\"><div> <span>How do Kitty and Rogue end up together?<br>\r\n<br>\r\nChoices...<br>\r\n<br>\r\nRogue uses a mutant inhibitor collar to nullify her powers<br>\r\n<br>\r\nKitty uses her phasing so she doesn't register to Rogue's power<br>\r\n<br>\r\nThey kiss during a game of Truth or Dare<br>\r\n<br>\r\nKitty admits her feelings to Rogue after a mission where Rogue is nearly killed<br>\r\n<br>\r\nor<br>\r\n<br>\r\nKitty climbs into Rogue's bed after Rogue suffers a nightmare<br>\r\n<br>\r\nWhich will you choose?</span></div></div>",
            "created":1582088400,
            "id":2789585,
            "title":"Shadowcat and Rogue"
        },
        "111":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Tells Kitty she needs to test a way she might've found to suppress her power",
                "Tells Kitty she needs to find out something",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>One afternoon, Rogue walked through the halls of the X-Mansion, holding a package that had arrived for her that afternoon. \"Finally, Ah was gettin' worried that it wouldn't come.\" She told herself. Unknown to the others, Rogue had secretly obtained an experimental mutant inhibitor collar. They were going to be used to help mutants with uncontrollable powers such as hers learn to control their powers. Despite this, the X-Men were concerned that the collars would also be used as weaponry against mutants. So far, Rogue had secretly tried using five collars but all of them had either short circuited or plain didn't work at all. \"With any luck, this here collar'll help me get closer to Scott.\" she thought hopefully as she entered hers and Kitty's bedroom and unwrapped the collar. It was bright yellow with a red center for the clasp. Slowly, she put it on and activated it. \"Now, Ah just need ta cover it up with a choker.\" she smiled as she grabbed one and slid it over her collar, effectively hiding it from sight. \"An' now all I need is ta test it on someone...\" Rogue remarked mentally as she looked outside and saw Kitty approaching her. \"Hey, Kitty. Could ya help me?\" She asked. \"'Kay! What's up?\" Kitty asked eagerly as she entered their bedroom. Rogue shut the door as Kitty plopped down onto her bed.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\nRogue tells Kitty she needs to test out something she might've found to suppress her power<br>\r\n<br>\r\nShe tells Kitty that she needs to find out something<br>\r\n<br>\r\nor<br>\r\n<br>\r\nSomething else<br>\r\n<br>\r\nTake your pick!</span></div></div>",
            "created":1582088400,
            "id":2789602,
            "title":"Rogue uses an inhibitor collar"
        },
        "1111":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Rogue apologizes and Kitty does a surprising thing",
                "Rogue apologizes and goes to find Scott",
                "Kitty stops Rogue before she can find Scott"
            ],
            "content":"<div class=\"\"><div> <span>Rogue took a deep breath. \"Ah think Ah may've found a way ta suppress mah power. But Ah need ta test it to find out for sure.\" She explained slowly. \"Really?!?!?\" Kitty asked brightly. \"Oh! To test it! I get it!\" She added. Soon, \"O-okay. Just take it easy.\" Kitty said nervously as Rogue slowly reached an ungloved hand towards Kitty's exposed arm. Kitty had taken her sweater off enough to expose her shoulders and upper arms. \"Pleeeeasse don't kill me, Rogue!\" She added mentally to herself. Then, the most incredible, wonderful thing happened. Rogue tapped Kitty's arm twice, but nothing happened! \"Huh?!?\" \"Did it work?!?!?\" Kitty asked, slowly opening an eye in surprise. \"OH MAH GOD!!! I NEVAH THOUGHT IT'D WORK!!!! THIS IS AWESOME!!!!\" Rogue darn near shrieked in clear delight. She was so happy she leaned in for a big kiss on Kitty's lips. \"W-Whoa!\" Kitty stammered in surprise as she managed to stop Rogue in time. <br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\nRogue apologizes and Kitty does a surprising thing<br>\r\n<br>\r\nRogue apologizes and goes to find Scott<br>\r\n<br>\r\nor<br>\r\n<br>\r\nKitty stops Rogue before she can go find Scott.<br>\r\n<br>\r\nWhich will you decide?</span></div></div>",
            "created":1582088400,
            "id":2789614,
            "title":"Tells Kitty she needs to test a way she might..."
        },
        "11111":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Make love on Kitty's bed",
                "Do it on Rogue's bed",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Rogue quickly regained her composure. \"S-Sorry. I jus' got excited.\" She apologized as she looked away, rubbing her arms awkwardly. Then, \"Like, it's okay, Rogue!\" Kitty smiled as she stood up, her sweater still half off. \"I got excited too.\" She admitted as Rogue turned in time to see Kitty completely step out of her clothes, leaving a naked Kitty standing in front of her. \"K--Kitty?!?\" stammered Rogue in disbelief as she eyed her naked friend. \"W-What're ya doin' Kitty?\" she asked, still in shock at her nude roommate and best friend. Kitty just smiled and walked up to Rogue. \"It's okay, Rogue. I know you're not used to this. I'll go easy on you.\" Kitty cooed sexually. \"A-Ah don't know.\" Rogue stammered nervously, leaning against the wall, Kitty's boob touching hers. \"You won't need this!\" Kitty smiled as she phased Rogue's green shirt, tank top and bra off, leaving Rogue's top half naked. \"Whoa! HEY!!!\" Rogue protested in surprise. \"Well, are you gonna take those off? Or am I gonna have to do it?\" Kitty asked, nodding to Rogue's boots, pants and underwear. \"Alright! Alright! Hold your horses!\" Rogue sighed as she took them off. Now, like Kitty, Rogue was completely nude. \"Happy now?!?!?\" She asked impatiently. \"Oh yes!\" Kitty laughed in delight.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\nKitty and Rogue make love on Kitty's bed<br>\r\n<br>\r\nThey do it on Rogue's bed<br>\r\n<br>\r\nor<br>\r\n<br>\r\nSomething else<br>\r\n<br>\r\nTake your pick! </span></div></div>",
            "created":1582088400,
            "id":2789656,
            "title":"Rogue apologizes and Kitty does a surprising thing"
        },
        "111111":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Kitty and Rogue keep having sex",
                "Rogue leaves to find Scott",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Soon,<br>\r\n<br>\r\n\"OH MAH GOD!!\" Rogue moaned in delight. She was on her hands and knees on Kitty's bed. Kitty sat behind her, two of her fingers in Rogue's pussy. \"KITTY, DON'T STOP!!!\" Rogue moaned, clearly enjoying every second. \"You're really enjoying this, eh Rogue? Someone else touchin' you must really, like, totally turn you on!\" Kitty smiled as she kept moving her fingers up and down. \"MMMMMMAAAHHHH!!!\" Rogue groaned in pleasure, her body shaking with each tingle she got from Kitty's act. \"You must be a lightweight. I'm barely doing anything to you!\" Kitty giggled in delight. \"MMMM!!!! OH MAH LORD!!!\" Rogue moaned in pleasure. Then, \"A-are you chumming?!?! Already?!?!? You're, like gushing all over!\" Kitty yelped in surprise as said liquid gushed from Rogue's booty. Then, \"Okay, Kitty's \"kitty\" totally needs attention.\" Kitty smiled, leaning back so her privates were exposed to Rogue. \"Ah've never done this before. Ah-Ah'll try mah best.\" Rogue said nervously as she leaned in. Then, she slowly began licking Kitty's pussy and crotch. \"Oh yeah! That-that's the spot! Keep going!!\" Kitty moaned as Rogue kept licking. \"Y-You sure you haven't done this before? You're, like, totally a natural!\" She added with a wide grin. <br>\r\n<br>\r\nWhat next?<br>\r\n<br>\r\nKitty and Rogue keep having sex<br>\r\n<br>\r\nRogue leaves to find Scott<br>\r\n<br>\r\nor<br>\r\n<br>\r\nSomething else happens<br>\r\n<br>\r\nWhich will you choose?</span></div></div>",
            "created":1582088400,
            "id":2789663,
            "title":"Make love on Kitty's bed"
        }
    },
    "info":{
        "author_id":"blackbeltii",
        "author_name":"pirate king",
        "brief_description":"Several of the Evo girls become kinky towards each other",
        "created":1582118100,
        "description":"<td align=\"left\" class=\"norm\">This is an interactive story. Each chapter tells a part of the story. When you reach a chapter that has yet to be written, feel free to make an addition.<br>\r\n<br>\r\nGuidelines<br>\r\n<br>\r\nI will allow sex to be described <br>\r\n<br>\r\nThe girls can wear and use diapers during sex<br>\r\n<br>\r\nWeight gain will also be allowed if you want it to be.<br>\r\n<br>\r\nI won't allow vore, male sex, racial slurs (except for 'Mutie' and other anti-mutant slurs), or anything else gross or rude.<br>\r\n<br>\r\nOther than that, enjoy.  </td>",
        "id":2213386,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1582132560,
        "pretty_title":"X-Men Evolution Lesbians"
    }
}