{
    "chapters":{
        "1":{
            "author_id":"jfoxx",
            "author_name":"Johnny Foxx",
            "choices":[
                "A world here magic is real",
                "A world where dinosaurs never went extinct",
                "A world where monsters exist instead of humans",
                "A world where the Nazis won WW2",
                "More "
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the Nexus, the realm between all possibilities. Here you can see everything that could have been, as well as what never was. So what are you waiting for? Choose an alternate earth, and let's get this train rolling! <br>\r\n<br>\r\n(You're also more than welcome to add any other alternate realities you can think of, just please don't repeat any that are already listed.) <br>\r\n<br>\r\nSo, where shall our story take place?</span></div></div>",
            "created":1583557200,
            "id":2797732,
            "title":"Where to Begin? "
        },
        "11":{
            "author_id":"jfoxx",
            "author_name":"Johnny Foxx",
            "choices":[
                "Ned",
                "Elvira",
                "Winnie",
                "Reader's Choice",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>In this reality, every human being has the capability to use magic, though some are of course, better at it than others. Rather than using wands, most channel magical energies through their bodies, realeasing it from their hands. Various schools exist across the globe, teaching and training children how to use and control magic in various ways. <br>\r\n<br>\r\nSo, who do you wish to follow?<br>\r\n<br>\r\nNed - Often called \"Ned the Nerd\" by pretty much the whole school, Ned is an outcast with glasses, braces and an acne covered face. Just about everyone abuses him in one way or another because of his feeble magic skills. Or at least, they used to be feeble. See, Ned's been studying a lot of spells lately, and practicing them every night before bed. He also happens to have discovered a spell of his own creation, one that lets him drain another's powers and add them to his own. Now it's time for some payback. <br>\r\n<br>\r\nElvira - The resident goth. Has a morbid fascination with the dead and death in general. Secretly practices necromancy, which is highly illegal. Wants to turn herself into a lich to gain greater power, as well as immortality. <br>\r\n<br>\r\nWinnie - Adept at magic, but is more interested in alchemy. Specifically, a potion to make her more beautiful than the most popular girl in school so she can take her place.</span></div></div>",
            "created":1583557200,
            "id":2797747,
            "title":"A world here magic is real"
        },
        "12":{
            "author_id":"jfoxx",
            "author_name":"Johnny Foxx",
            "choices":[
                "Dinosaurs are still beasts in the modern day",
                "Dinos have evolved alongside humans and are more civilized",
                "Humans couldn't catch up, and dinosaurs rule the Earth in modern times"
            ],
            "content":"<div class=\"\"><div> <span>So the dinosaurs are still around in this world. Okay, but are they still animalistic, or have they evolved alongside humans to be more like us? Or, an even bigger question, did humans evolve at all in this reality, or did dinosaurs replace us as the dominate species?</span></div></div>",
            "created":1586840400,
            "id":2818984,
            "title":"A world where dinosaurs never went extinct"
        },
        "122":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "Jump to one week",
                "You hang out at the mall with your egg"
            ],
            "content":"<div class=\"\"><div> <span>With your nose pressed against the window of MesoPet, your mouth is wide open in awe at the sight of the huge speckled eggs resting on a bed of straw. The artificial light is bright, and the colors really shine, a mixed blend of pink and purple shell, spread apart dots, and an almost cartoonish size. You feel like you're the last person on Earth to finally get one!<br>\r\n<br>\r\nBy now, they're more affordable. When the celebrities were taking selfies and they were pumping out movies every month with trained ones, the cost skyrocketed. But like with all trends, people had more or less grown bored with dinosaurs. Besides, the wild ones are too much trouble. There are breeds that are more docile, and a bustling illegal trade of the dangerous kinds.<br>\r\n<br>\r\nNow you can finally afford one (a starter egg, nothing fancy), and after putting a down payment, the cashier brings out one of the eggs from the storefront. <br>\r\n<br>\r\n\"You'll take care of it, right? These people, they come in, they spend their whole life savings, and they realize they can't even take care of it.\"<br>\r\n<br>\r\nHe gently hands you the egg wrapped in a blanket. \"These models have an accelerated phase, so just leave it in light and it should take no longer than a week.\" The salesperson rummages beneath the cash register and brings out a pamphlet. <br>\r\n<br>\r\n\"This will give you the basics on feeding and care. Shouldn't be too hard to feed it. They're genetically modified to adjust to whatever you have in your backyard.\"<br>\r\n<br>\r\nYou thank him and leave the store, holding the egg to your chest.  You don't even care that this is not a natural egg - this is the only reason they're more affordable now. It doesn't matter, you'll give your dinosaur the best care ever.</span></div></div>",
            "created":1586926800,
            "id":2819098,
            "title":"Dinos have evolved alongside humans"
        },
        "1222":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "You look for the nearest security booth",
                "You head home"
            ],
            "content":"<div class=\"\"><div> <span>The mall is packed since it is the weekend. You live pretty far and since you don't get a chance to come here often, exploring sounds tempting enough to stay longer.<br>\r\n<br>\r\nIt is the place to be to catch a sight of all the different types of dinosaurs co-living with humans. You spot families walking their herd of gallimimus, walking speedily to catch up with the leashed, growling beasts that extend their long necks to snap and snip at each other. A businessman rudely cuts them all off, walking along a protective velociraptor, as he chats on his phone while the dinosaur eyes anyone approaching too close with a frightful suspicion. They really were incredible guards and conveniently, too expensive to only  be owned by the wealthiest. <br>\r\n<br>\r\nThrough the glass dome of the mall ceiling, you hear the screech of pterodactyls circling around the building. They weren't uncommon but not typically owned as house pets. Too much upkeep and it was impossible for anyone in any neighborhood to get any sleep. Mostly they were attracted to the peak points of the buildings in cities where they gathered to roost. <br>\r\n<br>\r\nYou protectively press the egg against you as you people watch. Towards the atrium near the food court, you see a group of people in bandanas raising their fists. <i>Protesters</i>, you realize when one of them begins to loudly yell about freeing the \"imprisoned innocent creatures subjected to slavery\" right before he flips over a metal table.<br>\r\n<br>\r\nNo doubt security will be here soon, you think, and there will be some big scene in the middle of the mall. Sighing, you look down at the egg. Are you going to worry about someone trying to snatch your new friend from you? You don't understand why they make such a big deal about it. The liberationists. After all, they don't have any complaints about dogs or cats, also the result of domestication after thousands of years to become the perfect house pets. <br>\r\n<br>\r\nThe scuffle in the food court grows louder as a protester shoves a man in a suit. The two begin to swing fists at each other as a crowd gathers to watch the scuffle. Surprisingly there is no security guard around yet and you are disturbed by the lack of response so far. The tram to exit the mall is just up the escalator. Perhaps this outing has come to a natural conclusion and it is time to go.</span></div></div>",
            "created":1587099600,
            "id":2820059,
            "title":"At the mall "
        },
        "12221":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "You are going to sneak the egg out",
                "Defeated, you look for somewhere to hide the egg"
            ],
            "content":"<div class=\"\"><div> <span>The mall hires a third party company to handle security and their booths can be found on each level of the building. Suspiciously enough, the first booth you approach looks vacant. The outside of it has been vandalized with juvenile graffiti and you can see that the inside is also a mess. Paperwork scattered everywhere, a broken tablet, and a pack of pepper spray have been torn open and spilled on the floor. <br>\r\n<br>\r\nYou look around before pocketing one of the sprays. Meanwhile in the food court, the altercation has become a full blown fistfight, with the crowd of patrons shoving and scrapping against the liberatonists. Families begin to pack tightly against the hallway to exit and load onto the tram back to the city. The entire building is chaotic and loud with the screeching of pet dinosaurs. Even the pterodactyls flying in the air have become frantic and landed on top of the dome, clawing at the glass furiously. What is going on?<br>\r\n<br>\r\nWith the egg wrapped around your jacket, you spot one of the other security booths. You don't even bother walking to it since it also appears to be deserted. A man and a woman dash by you with their own pachycephalosaurus catching up to them. The top of its ridged spiky head looks damp and the animal snorts annoyed as it walks around you. The oddest feature is the bandana tightly wound around the dinosaur's mouth.<br>\r\n<br>\r\n\"You are gonna want to go ahead and get out of here ASAP,\" the man tells you. His companion nods in agreement. \"The liberationists found a way to undo millions of years of symbiosis by putting something in the vents and <i>all </i>the dinos are going berserk.\" Before you can ask another question, the trio run off. Despite the quick encounter, you worry if the bandana they were trusting was going to protect anybody...<br>\r\n<br>\r\nSo there has been an attack? And where is security? You can't think about it for much longer because a loud siren begins to blare. Red emergency lights from the upper portions of the mall flash wildly. Then, a voice is heard throughout the building. Loudspeakers of the mall boom with static until you hear the sound of a throat clearing. \"Attention all! The natural order has been restored by the <b>SBL</b>. Abandon the ones you have unjustly subjected to slavery and head to the nearest exits in an orderly fashion. This is your first and only warning to cooperate - your control ends today.\" <br>\r\n<br>\r\nWith the danger increasing by the second and the situation in the mall worsening, you consider your options and what to do with the egg that has cost your life savings...</span></div></div>",
            "created":1587186000,
            "id":2820855,
            "title":"Social unrest - with dinosaurs "
        },
        "122211":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "Play his bluff ",
                "Try to knock him down and exit through the train"
            ],
            "content":"<div class=\"\"><div> <span>As you look around for the nearest exit that isn't crowded with fleeing shoppers, a canister smashes into a nearby water dispenser and bursts open. Immediately your eyes begin to water as a thick, noxious smoke covers the atrium. You hear people screaming, the mall hectic with the sound of smoke devices exploding and the terrifying roars of dinosaurs turning on their owners. In between coughing, you are at least thankful that whatever you've breathed in of this crap, it hasn't made your lungs collapsed.<br>\r\n<br>\r\nThe dinosaurs however, are not reacting as neutral to whatever they've been exposed to. As you head up into the escalator that leads into an increasingly crowded station, you see people fleeing from their beloved dinosaurs. You pick up a gift bag that someone dropped and in the middle of all the chaos, you empty out the complimentary promotional shirt and party supplies so you can sneak your speckled egg inside.<br>\r\n<br>\r\nA small child cries as their leashed <i>compsognathus</i> squirms and stretches its neck to snap at whatever is close by. The semi-tame pterodactyls flying around have also now taken to roosting on the roof and squawking furiously, using their beaked mouths to tap at the glass panels until they crack. A man runs by you, yelling that the velociraptors have taken over the food court.<br>\r\n<br>\r\n\"Everyone get out now!\" A voice yells and there is another explosion from down where the MesoPet store is located. This one sounds big, and you hear glass breaking and a fog of smoke wafts up past the stairs to where the train station is situated. You don't even look back at what is going on, instead trying to blend into the crowd with a now very stuffed backpack. With no idea how many SBL liberationists have raided the mall or where they're coming from, you won't let them take your egg without a fight. <br>\r\n<br>\r\nWith the train to leave the mall now just a few feet away, you push through a group of sobbing teenagers and are about to board the train when someone grabs you by the shoulder.<br>\r\n\"Hey!\" You turn to face a young adult in a gas mask. He wears a brown jacket and carries an electric baton that looks like it was stolen from one of the security booths. He yanks you out of the line of passengers and eyes you suspiciously. <br>\r\n\"You trying to smuggle out a dino? Why don't you let me take a look at your bag?\" The SBL soldier says menacingly. </span></div></div>",
            "created":1591299420,
            "id":2845868,
            "title":"Riot!"
        },
        "122212":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "Lie that you have to go to Sarge immediately",
                "Go with her to not appear suspicious "
            ],
            "content":"<div class=\"\"><div> <span>With tears running down your cheeks, you peel down a layer of the wall on the back of the security booth. The veneer is soft and cracks easily, forming a large fist-sized hole in the drywall. You can come back for it later, you realize. <br>\r\n<br>\r\nFirst, you have to get out of this mall and once they send in the State Police and clear up this mess, you can claim it again. It just makes you sick to your stomach, the thought of abandoning your dinosaur before it has even hatched. <br>\r\n<br>\r\nAfter finding a spot where the egg is safely out of view, you crawl back out of the booth and to the commotion of the mall: crowds scurrying to exit and the increasing aggression of the protesters who have taken over in a swarm. <br>\r\n<br>\r\nIn the distance, far from the food courts, you hear a terrifying roar. The fleeing families scream and their stampede becomes even more frantic. You haven't seen any of their dinosaurs around... Whatever is spraying toward the vents makes them frightened of humans. Primal again.<br>\r\n<br>\r\nYou are about to join one of the groups running, when a woman with a brown ponytail, her face hidden by a bandana blocks your path. She looks you up and down. When she sees you are holding a rag in your first and that your raggedy clothes mean you are no elite, she nods with approval.<br>\r\n<br>\r\n\"I saw you,\" her eyes flash dangerously. Your cheeks, still wet from the tears are sure to make you look guilty in the eyes of the hooligan. <br>\r\n\"They pepper sprayed you too, huh?\"<br>\r\n<br>\r\n\"Don't bother looking, we took all the good stuff when we got rid of the guards.\" She hands you a cloth so you can wipe your eyes. Then with her back turned, with some type of firearm strapped, she turns to a pack running for safety. \"That's right, get out of here bougies! Leave your dinos here or you'll regret it!\"<br>\r\n<br>\r\nThe SBL girl appears to have mistaken you with one of their own.<br>\r\nYou know you can use this to your advantage, even though you aren't sure if socializing with the enemy is a safe way to stick around and make sure Egg isn't destroyed in the ongoing takeover.<br>\r\n<br>\r\n\"I need more of it,\" you blurt out to the girl. Purposely vague, you are unsure at first if it'll catch her attention. What are these <i>terrorists </i>using? Some type of hormone disruptor? A drug that just makes large reptiles become wild with rage? If you are going to stick around, you might as well find a way to destroy whatever is in their supply, you realize. You never imagined yourself in this situation but something had to go wrong, didn't it? <br>\r\nYour first time almost having a pet dinosaur...<br>\r\n<br>\r\n\"More what? \" The girl replies. \"Oh...\" She realizes. <br>\r\n\"You have to go to Sarge, he has the stash on him.\" Hey, I heard these sickos kept the dangerous ones somewhere underneath. Wanna go with me?\"<br>\r\n<br>\r\nYou can tell the girl is smiling through the cloth in front of her mouth. </span></div></div>",
            "created":1587272400,
            "id":2821000,
            "title":"Defeated, you look for somewhere to hide the egg"
        },
        "1222122":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "You \"volunteer\" for the job",
                "You try to change her mind"
            ],
            "content":"<div class=\"\"><div> <span>The last thing you want is to be outed as a simple pedestrian with the angry mob taking over. With the cloth now going around your face, you follow the mysterious girl and accompany her on a tour of the mall.<br>\r\n<br>\r\n\"Can you believe they just left this hanging around in one of the guard stations?\" she says, holding up a ring of dozens of small, silver keys. \"We have complete access to everything.\" <br>\r\nYou pass by a group of her friends, all of which stare at you suspiciously until she clears the air by asking them for a status report. You are beginning to suspect that she is a high-ranking member of this organization. <br>\r\n<br>\r\n\"We've freed an apatosaurus from the petting zoo, Mei.\" <br>\r\nOne of the boys says. \"What do we do next?\"<br>\r\n<br>\r\n\"Get everybody out of here first. We're going to barricade the entrance and have our base set up before State Police is deployed.\"<br>\r\n<br>\r\n\"And if they don't want to get moving?\"<br>\r\n<br>\r\n\"You are armed - they aren't, I am sure you'll figure it out.\"<br>\r\n<br>\r\nShe excuses herself from the group and the two of you head to a seemingly locked door by the escalator. The keys jingle as Mei unlocks the door. It opens with no issue, leading into a narrow stairway that descends down beneath the surface.<br>\r\n<br>\r\nShe closes the door behind and it shuts with a definitive slam. <br>\r\nThere is little light here and it only gets darker as the two of you walk underground. \"Hmm, it should be here somewhere.\"<br>\r\n<br>\r\nOnce the two of you make it to the bottom of the stairs, this lower basement portion of the mall is illuminated with artificial lights reflecting off bright blue. Instead of walls, there is now a circular tank that takes up the entire space. You almost forget how dangerous this whole situation is becoming. You are in aw of the creature that resides down here.<br>\r\n<br>\r\nThrough the glass, you are rewarded with a view of the plesiosaur lifting a mighty fin and splashing around. It is surprisingly roomy here, but you can tell the creature is distressed being in such a confined space.<br>\r\n<br>\r\n\"We haven't been able to gas it for obvious reasons,\" Mei says. <br>\r\n\"Sarge doesn't want any dino left untreated.\"<br>\r\n<br>\r\n\"How could they just leave it here?\" You are disgusted. Even though you don't agree with the protestor's methods, they might have a point about how the dinosaurs are being treated here. Mei doesn't seem to be paying attention to your anger. Instead, she has the mission in mind. <br>\r\n<br>\r\n\"If we drug some of the fish, we can get it to infest the chemical. After that, we can find a way to release it.\" It seems like an improbable outcome. However, she is looking at you as if she expects you to do the job for her - both of drugging the plesiosaur and somehow releasing it. </span></div></div>",
            "created":1587358800,
            "id":2821608,
            "title":"Underground"
        },
        "12221221":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "You try to lie your way out of this",
                "You pretend to drop the bucket to distract her"
            ],
            "content":"<div class=\"\"><div> <span>In a continuing day of being coerced into doing things you don't want to, you find yourself within the still-in-development aquatic exhibit, high above a sparkling artificial lake and surrounded on all sides by glass walls. They went through the effort of decorating with replicated ferns and algae that would've been prevalent millions of years ago.<br>\r\n<br>\r\nIt was a beautiful enclosure, only accessible for the moment, by an expensive VIP pass. Like most corporate exposures to dinosaurs, not a lot was known about what went on behind the scenes. To see the plesiosaur splashing around, emitting a confused screech that made the water ripple, was an astounding sight that would've once cost you thousands of dollars. Now, you felt sympathy for the being in such a small space, on a mockery of its own and all by its lonesome.<br>\r\n<br>\r\n\"You know what the sick bastards call him?\" Mei interrupts your thoughts. \"Chompy! Even for a pet, he is supposed to be pretty temperamental.\" The liberationist is inserting vials of a chemical into the insides of fish. From the way up, you saw that Chompy's feeding time was just about to approach. Mei had herself been reluctant to join you on the other side, but access to the enclosure required two people - it was also a group effort to release the lock on the gate blocking the mighty dinosaur from swimming out into the bay.<br>\r\n<br>\r\n\"So we just drop them from up here?\" You look down into the pool where the beast is waiting to eat. If the drop isn't incredibly painful, even onto a wet surface, you don't want to think about what a creature like that would do out of curiosity. Mei passes you the bucket of fish. <br>\r\n<br>\r\n\"I'm not getting more stink on my hands, this is a job for you.\" She snickers. Her hand goes on your shoulder as you hold the bucket nervously. \"You know, it is weird. I really haven't seen you around before. You just have a familiar face... but I am now trying to remember where we last saw. Sedona?\" </span></div></div>",
            "created":1587445200,
            "id":2821984,
            "title":" Monsters of the Prehistoric Sea"
        },
        "14":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "You try to order a drink despite not being of legal age yet",
                "You search the tavern for a familiar face"
            ],
            "content":"<div class=\"\"><div> <span><i>June 6, 2045</i> It is the annual celebration of the defeat against the Allied menace and the parade honoring the defenders of Normandy is just about to begin. You shuffle through the crowd to get a better view of the military vehicles, the troops marching down with flags of the Iron Cross, and the silent brotherhood marching solemnly down the street with portraits of Herr Wolf. <br>\r\n<br>\r\nThese parades are a waste of money, everyone knows it but no one dares say a word. It was just last week that one of your neighbors disappeared in the middle of the night. He had published an editorial in an underground newspaper criticizing the People's Court and was said to have been executed at night - or worse, taken to one of the reeducation camps. Even talking about what could've been has always been seen as a mortal sin against the state. <br>\r\n<br>\r\n\"Achtung!\" A man holding a loudspeaker begins to announce to the crowd. Even with the mandatory years of German in school, you have trouble picking up most of the words but it is obvious that they are going to bring traitors out to the streets. Not wanting to witness the bloodshed, you find a tavern along the parade route and sneak inside past the crowds. </span></div></div>",
            "created":1586754000,
            "id":2818533,
            "title":"Life in the Axis States "
        },
        "141":{
            "author_id":"cornsnacks",
            "author_name":"Sakuya Kawakami",
            "choices":[
                "You panic and try to leave the tavern",
                "You tell him to get his disgusting hands off you "
            ],
            "content":"<div class=\"\"><div> <span>The tavern is crowded and you make your way past the groups of people excited about the parade. There are the occasional faces of disgust and those that get too drunk to hide the pains of life. To your surprise, there are no uniformed soldiers or members of the Gestapo lurking around, at least not in plain sight. Perhaps the <i>Roasted Boar</i> has an arrangement with the local patrol to not interfere with its business.<br>\r\n<br>\r\n\"One of those, please.\" You are at the set of taps where a bartender cleans a glass, his expression bored and unamused by the commotion inside. The man eyes you suspiciously and you think about blending back into the crowd if he starts to ask for your ID. Instead, he nods and fills a frosted glass with a bubbling amber lager. He says a few words in Swiss, which you aren't familiar with. He switches from German to French with ease before realizing he is not getting far if it isn't in English.<br>\r\n<br>\r\n\"Alright kid, here you go.\" He pushes the glass towards you and as you reach into your pocket to pay, his hand comes down on your wrist and the bartender leans in. \"There's no way in hell you're 25. You trying to get me shut down? Who are you working for?\" He's not physically imposing but trying to break free will definitely cause a scene. </span></div></div>",
            "created":1586926800,
            "id":2819044,
            "title":"The Roasted Boar Tavern"
        },
        "15":{
            "author_id":"jfoxx",
            "author_name":"Johnny Foxx",
            "choices":[
                "A world where humanoid animals (furries) exist alongside people",
                "A videogame-like reality",
                "A cartoonish kind of world",
                "A world where superheroes and villains are real",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First few choices not good enough? Okay, how about these?</span></div></span></div>",
            "created":1583557200,
            "id":2797734,
            "title":"More "
        },
        "151":{
            "author_id":"orangeskunk5",
            "author_name":"OrangeSkunk5",
            "choices":[
                "You are the only Furry",
                "Everyone else is a Furry, but not you",
                "Half/Half (Either by All males, All Females or Half of each Sex)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In what form of it do you wish to have it?</span></div></span></div>",
            "created":1593497280,
            "id":2858875,
            "title":"Gettin' Furry with it"
        },
        "1513":{
            "author_id":"orangeskunk5",
            "author_name":"OrangeSkunk5",
            "choices":[
                "Every Male is a Furry",
                "Every Female is a Furry",
                "Half the world (25% Male Furries, 25% Female Furries)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1593498480,
            "id":2858882,
            "title":"Keeping it Fair"
        },
        "152":{
            "author_id":"jfoxx",
            "author_name":"Johnny Foxx",
            "choices":[
                "RPG world",
                "Life: The MMO",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so what kind of videogame are we talking about? A fantasy RPG, with elves, dragons and monsters? Or maybe more of a Ready Player One sort of thing, where your life in general is like a game.</span></div></span></div>",
            "created":1588050000,
            "id":2826005,
            "title":"A videogame-like reality"
        },
        "153":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Dylan Dalmatian.",
                "Tomo Goto.",
                "More."
            ],
            "content":"<div class=\"\"><div> <span>In this cartoonish version of reality itself, both cartoon humans and talking animals coexist, as they go about their daily lives unless they're in some kind of trouble and need to be saved or rescued.<br>\r\n<br>\r\nNow then who do you want to follow?<br>\r\n<br>\r\nDylan Dalmatian - An animated dalmatian dog he's the eldest son of the dalmatian family that resides at 101 Dalmatian Street in Camden Town London UK as he dreams of one day being the 1st dog on Planet Mars.<br>\r\n<br>\r\nTomo Goto - An animated raccoon who happens to be a comic book artist and ninja who happens to be from Tokyo.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1587272400,
            "id":2821271,
            "title":"A cartoonish kind of world"
        },
        "155":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Where Harold won the Battle of Hastings",
                "Where the Glorious Revolution ended with a compromise.",
                "Where Richard won the Battle of Bosworth.",
                "Where giants exist along with humans.",
                "Another Reality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With alternative history the possibilities are endless, especially if fantastic elements are included.<br>\r\n<br>\r\nThe reality you want to check out is...</span></div></span></div>",
            "created":1589000400,
            "id":2833119,
            "title":"More"
        },
        "1551":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "The Normans are retreating because William the Bastard has been killed.",
                "William's planning to regroup his forces for another attack, but aren't pursued.",
                "A part of the fyrd start to chase the Normans, but are recalled in time.",
                "One of William's allies is having second thoughts.",
                "Another Reason to Change the Outcome"
            ],
            "content":"<div class=\"\"><div> <span>14th October 1066, 7 miles North-West of the burg of Hastings two large armies have drawn up against each other. Holding the high ground is the army of Anglo-Saxons commanded by King Harold II, legally appointed monarch of the English nation. Opposing them is the army of Normandy and her allies led by Duke William the Bastard, adamant that Harold has broken a solemn vow to him that he would receive the English throne after the passing of the previous incumbent, Edward the Confessor.<br>\r\n<br>\r\nHarold's army is strong in infantry with a plethora of veterans of his campaign against the Norwegian invasion in the previous month. William's army has more cavalry and the nominal backing of the Vatican. Should William win the whole socio-political structure of England that has lasted for over two hundred years shall be demolished and replaced with the feudal system established in France; the prospect of this doesn't bode well for the thanes, especially after William has pillaged and burned his way along the South-East coast.<br>\r\n<br>\r\nThe battle is long and arduous. Norman archers have greater range but the shield wall of the Saxons deflects the vast majority of their arrows, infantry attacks against the shield wall appear ineffectual and the cavalry cannot make headway against the tightly-packed fyrdmen and huscarls.<br>\r\n<br>\r\nThe situation continues until one flank of the Norman army begins to rapidly disengage.<br>\r\n<br>\r\nA/N: OTL feigned retreats allow the Normans to deplete the strength of the fyrd in the shield wall and the archers change their angle of attack to achieve victory. How shall this version conclude to give Harold the victory instead?</span></div></div>",
            "created":1589000400,
            "id":2833146,
            "title":"Harold Godwinson Victorious"
        },
        "15511":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Make for Hastings and besiege the demoralised Normans.",
                "Head for Pevensey and force the Bretons to retreat in disarray.",
                "Strike at the French in Bexhill in the hopes of isolating the other armies.",
                "Withdraw to London and see how the enemy deals with the loss of their leader.",
                "Harold Godwinson opts for an alternative course of action."
            ],
            "content":"<div class=\"\"><div> <span>As William led charge after charge with his cavalry against the English his closest knights were taken out by the combined efforts of English projectiles and close-quarter combat, whereupon he saw that his left flank was starting to crumble and responded with a strong cavalry charge in that direction. The fyrd who'd been resisting this portion of his army could see that the men opposing them were thinning out and were about to launch a charge against the impending retreat when they found a large force of horsemen coming right at them; they responded with a sudden release of a great quantity of projectiles. Leading the charge the Duke of Normandy receives one of these right in his neck, killing him within seconds and leaving his head hanging limply from his neckbones and fronds of flesh. The cavalry charge had too much momentum at this time and slammed against the shield wall, sending William's body tumbling into the fyrd where it lay among the men for a matter of minutes while the charge was resisted.<br>\r\n<br>\r\nEventually a key gap in the assault of the Normans opened up and the Saxons could add still more projectiles upon the army, prompting the cavalry to withdraw with a contingent of the fyrd on the Saxon right-flank in pursuit while the remaining men set upon William's corpse and severed his head completely. Gyrth Godwinson, brother of King Harold, received news of the duke's death and called for the Norman's head to be stuck upon the longest spear the men under his command could find.<br>\r\n<br>\r\nFor half-an-hour the forces of Normandy and her allies continued the struggle in earnest, blissfully unaware that their commander had been killed, although the left-flank had all but collapsed into a retreat for Hastings. The remainder of the fyrd on the Saxon right-flank turned to engage the exposed flank of the remaining strength of the Norman army while those who set off in pursuit cornered the allied infantry in a copse where they slaughtered the men and plundered their bodies bare; only the cavalry forces reached Hastings where news of William's death spread faster than on the battlefield.<br>\r\n<br>\r\nBy now Gyrth had lifted William's head high into the air on the end of a spear and began to carry it towards the king's position. Harold saw it soon enough and sent a message for his brother to carry it forwards to bolster the will of his men and sap the morale of the enemy. Sure enough the sight of their duke's severed head in the hands of the Saxon nobility led to a major drop in the Normans' morale, starting a wave of routing men from the Western end of the Norman forces to the East until the whole force fled with a strong contingent of the Saxon army in pursuit.<br>\r\n<br>\r\nThe forces who'd come directly from Normandy made for Hastings to re-join their cavalry, intending to hold out until William's successor could send reinforcements. The allied forces under command of Alan the Red, having been heavily reduced during the collapse of the army's left-flank, had fled to Pevensey and had begun the process of re-embarkation. The remaining allies under command of Eustace of Boulogne, having the strongest available force, made camp at Bexhill with the intention of guarding communication between the other two surviving contingents.<br>\r\n<br>\r\nWith nightfall King Harold has a decision to make.</span></div></div>",
            "created":1589120280,
            "id":2833412,
            "title":"William, Duke of Normandy, 1028-1066"
        },
        "155113":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Eustace gaining victory but unable to capitalise on it.",
                "Harold gaining victory but Eustace's men got away.",
                "Eustace gaining victory but with hardly any men left.",
                "Harold gaining a clear victory.",
                "Another Outcome"
            ],
            "content":"<div class=\"\"><div> <span>The army of Eustace, Second Count of Boulogne, faced a new problem. Aside from the prospect of attack by the Anglo-Saxon forces their choice of encampment was not as good an idea as it might've appeared from Eustace's point of view; William's policy of pillaging and burning to goad King Harold into joining battle had left the parish devoid of any viable shelter and any food they could've salvaged was now split amongst the three contingents of the allied forces and that was much lower than it could've been as a third of their supplies had been left behind for the English to plunder.<br>\r\n<br>\r\nKing Harold opted to break the largest of the enemy forces and, thusly, keep the remaining two split and morale low. Gyrth, having lost the most men and achieving the glory of taking William's head, was set the task of laying siege to Hastings and given first choice of reinforcements but was under strict instruction not to storm the town until Harold sent the word. Leofwine Godwinson, another of Harold's brothers, was allowed a smaller force than he'd commanded at the Battle of Hastings and sent to harry the Bretonic forces at Pevensey while the king retained the majority of the available strength.<br>\r\n<br>\r\nEustace of Boulogne had anticipated that a small force of Harold's men would be sent to Pevensey, but he'd assumed that they would be sent along the main road from Hastings while most of the Anglo-Saxon force would besiege the town. He'd readied a defence despite the weariness of his men on the morning of the 15th October, but no attack came. The weather was dry but the wind had turned bitter out of the East. In the afternoon Eustace ordered some scouts to check on the situation at Hastings where they each reported a large army in the vicinity by sunset, although what they'd actually encountered was Harold's men making ready to march upon Bexhill while guarding the road to London against any attempt by the Normans to sally. While this was occurring Leofwine and his men slipped past the sentries by a wide route to the North.<br>\r\n<br>\r\nCome the morning of the 16th Harold's forces appeared on the road from Hastings. Eustace, having assumed that Harold was more concerned with taking Hastings, was taken by surprise as he was actually about to send some of his men to Pevensey with instructions to bring the boats along the coast. Eustace hurriedly sent out orders to establish a defence but Harold's army were already opening the battle with a mass of projectiles, which now included arrows released from Norman bows, and rendered the redeployment disorganised.<br>\r\n<br>\r\nThe battle concluded with...</span></div></div>",
            "created":1589123640,
            "id":2833434,
            "title":"Battle of Bexhill"
        },
        "1551134":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Harold pursues William FitzOsbern.",
                "Harold returns to Hastings.",
                "Alan the Red casts off, ignoring Eustace's orders.",
                "Alan the Red cast off earlier, leaving William and the wounded.",
                "Another Occurrence takes place"
            ],
            "content":"<div class=\"\"><div> <span>With Harold on the offensive the shield wall would not be as effective, however his men were able to bombard Eustace's army with constant projectiles of varying quality and type; consistent volleys weren't possible with the limited training of the fyrd but they were able to start some form of coordination that meant their opponents were facing projectiles almost every second of the opening hour of the battle. The result of this was that many of the rank-and-file serving under Eustace were either killed or injured to the point of being unable to fight.<br>\r\n<br>\r\nFaced with the prospect of another defeat in the same week Eustace, Count of Boulogne, decided that he'd have to try and get the wounded out of danger and appointed one of the late duke's closest confidants, William FitzOsbern, in charge of the contingent that was to escort the wounded back to Pevensey. His orders were for Alan the Red to commence loading of the wounded and camp followers onto the boats and send them back to Normandy while the remaining strength was to ready the remaining vessels to receive the rest of his men in a fighting retreat but not to cast off until he himself boarded.<br>\r\n<br>\r\nBy the time William had began the evacuation of the wounded Harold's men were running low on designated projectiles, permitting Eustace a reprieve while they readied themselves for an advance. Eustace had been so pre-occupied with organising the evacuation with William that he didn't really think much of the lull in the missile attack until he heard the war cry of Harold's huscarls.<br>\r\n<br>\r\nEustace wouldn't reach Pevensey; the only men under his command who survived the close-quarter fighting arrived at the beaches in frantic disarray with a notable reduction in their arms and armour. Harold Godwinson had triumphed at Bexhill and, while his army was steadily depleted with casualties and through the earlier splitting of his force, the survivors had garnered sufficient experience with each battle and some of the fyrdmen could offer extra training and advice for any reinforcements mustered between battles.</span></div></div>",
            "created":1589138040,
            "id":2833483,
            "title":"RIP Eustace Boulogne"
        },
        "15511343":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Follow Harold back to Hastings",
                "Follow Alan to Rouen",
                "Look into what Robert has been up to",
                "Take a peek at how Gyrth has been dealing with the men in Hastings",
                "Let's look at another aspect of October, 1066"
            ],
            "content":"<div class=\"\"><div> <span>Alan the Red received the wounded and the instructions from Eustace of Boulogne as delivered by William FitzOsbern and successfully carried out the initial portion overnight, however the wounded and non-combatants were only just getting underway on the morning of the 17th October when a force of huscarls were spotted marching towards the coast from the North North-West. Looking between the assembled men and the approaching infantry Alan the Red had to make a decision to either stand and fight or embark and set off. The wind was currently flowing from the North-East and a number of his own men had already gone with the boats to defend against any possible Vikings or pirates that might be snooping around the Channel. An hour before noon Alan made his decision as the huscarls were now close enough for him to hear their taunts and he could see members of the fyrd forming a rear guard or reserve force, what's more the banner of King Harold could now be seen on the road from Hastings. Alan called for a retreat with the aim of reaching Rouen to recuperate and send a report to Robert, who'd now be the Duke of Normandy in his father's stead.<br>\r\n<br>\r\nSome men stayed voluntarily to fend off the huscarls closing on their position, prompting Alan to identify each of them individually by name so that they'd be written into the chronicles for posterity. The fight was quick and brutal but Alan did succeed in getting all embarked men away, closely following those vessels carrying the wounded, but some boats remained beached as there were not enough men to service all of them.<br>\r\n<br>\r\nKing Harold II reached Pevensey in time for lunch and was welcomed enthusiastically by his brother, Leofwine. After hearing his recounting of the fight for the boats Harold gave a small laugh and called for the banner of Eustace of Boulogne. After some time of familial ribbing and reconciliation over Leofwine's embarrassment Harold called for his men to start back to Hastings while the fyrd that Leofwine had with him were to set about taking the vessels Alan had left behind to the nearest viable port on the English coast.</span></div></div>",
            "created":1589207820,
            "id":2833877,
            "title":"Alan's Dynamo"
        },
        "155113432":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Raise an army and try again.",
                "Seek a peace treaty with England.",
                "Send a message to the Pope, asking why his ordination failed.",
                "Seek counsel with the King of France.",
                "Another Idea"
            ],
            "content":"<div class=\"\"><div> <span>18th October 1066, Rouen. Clouds filled the sky as a fleet of ships came up the Seine with the flag of Normandy being borne only halfway up a viable pole and the banner of Brittany the only other insignia visible from afar. After docking Alan the Red disembarked at the head of a column of camp followers bearing wounded soldiers; in a matter of minutes he broke off from the parade of mourning and made for one of the more prominent residences in town.<br>\r\n<br>\r\nWilliam FitzOsbern was left to organise the religious aspects of the aftermath of their expedition to England and find aid for the wounded. Alan spent time dictating messages of honour for the fallen and a post mortem for the new Duke of Normandy. Robert had been overseeing the construction of the Chateau de Caen to the West and would need to learn of his new position and duties as soon as possible.<br>\r\n<br>\r\nThe lateness and condition of the roads meant that Robert did not receive the message until mid-morning of the 21st October. By this time Alan had gone to Rouen Cathedral to perform confession and was now engaged in penance. The impact of learning of his father's death coupled with the news that he hadn't even got within sight of London hit the teenaged duke hard. Being young but not a child he hadn't any official requirement for a regent but, in effect, his mother would now be running the duchy on his behalf and she would be the most prominent voice of reason in his court.<br>\r\n<br>\r\nThe result of this was that his conclusion to the disaster of his father's expedition was...</span></div></div>",
            "created":1589214000,
            "id":2833912,
            "title":"Robert, Duke of Normandy"
        },
        "1551134322":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Send someone to Normandy to extract concessions.",
                "Prepare a counterattack against the Duchy of Normandy.",
                "Send someone to Normandy to hear their terms.",
                "Pander to the ego of Philip, King of France.",
                "Denounce William the Bastard to the Pope."
            ],
            "content":"<div class=\"\"><div> <span>Shortly after arriving in Rouen Robert called for Alan the Red and William FitzOsbern to discuss their options for resolving the situation with England. The three met in the one tavern in town known to be frequented by members of the nobility with the widow Matilda, Robert's mother, and her younger son Richard. A quantity of men also stood in attendance but they were there to stand guard of these noble personages and were not to speak of the plans being made.<br>\r\n<br>\r\nRobert had intended to start preparations for another invasion of England for revenge against Harold Godwinson's army slaying his father, but Matilda talked him out of it by speaking of how it hurt her just as much and how she wasn't calling for the English king's head, also she looked to passages in the Bible that highlighted the sinful nature of vengeance. Alan supported her statement by recalling how the bold actions of Duke William and his men led to the collapse of the alliance within the forces that had crossed. FitzOsbern brought out matters of logistics and the cost of the expedition, prompting Robert to look at the prospect of making peace.<br>\r\n<br>\r\nAcross the Channel, with the forces in Hastings having surrendered, Harold was discussing what would be the best course of action from here. He'd called a meeting of the Witan to present his available options and the viability of them. The most obvious option he had was to send an emissary to Normandy to expound over how their army was trounced and that they'd have to accept peace terms as he'd provide, but this could lead to later attempts to take the crown by disgruntled members of the French nobility. Another possibility was to launch a retaliatory strike against Normandy, but this could lead to all-out war with France. Also Harold could send an emissary to Normandy with the intention of hearing what kind of peace terms they'd be willing to discuss, but this could be misconstrued as a sign of weakness and lead to another attempt to claim the throne. Remaining options were to send an emissary to the French king himself to discuss the fact that the Duke of Normandy went to war without representing France itself, but there was some talk among the members of the Witan that this could be found as being a falsehood should Philippe choose to interpret it as such. Or, finally, a representation could be made to the Pope on how the Duke of Normandy had sinned against the people of England and paid the price; the danger here being that Harold's men had taken a banner indicating that the head of the church had ordained the invasion and, as such, could potentially excommunicate the whole nation in response.<br>\r\n<br>\r\nAs the sun set, casting a ruddy glow over the River Thames, the king of England and his appointees came to a conclusion.</span></div></div>",
            "created":1589215260,
            "id":2833921,
            "title":"25th October 1066"
        },
        "15511343224":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Refuse the offer of marriage, but acknowledge Harold's kingship.",
                "Dismiss the English embassy, but send a message to Robert to avoid war.",
                "Accept Edgiva as his queen, cementing peace on both sides of the Channel.",
                "Dismiss both embassies, washing his hands of the whole affair.",
                "Another Option"
            ],
            "content":"<div class=\"\"><div> <span>A vessel bearing the banner of the House of Godwin came up the Seine; as it docked a few armed men stepped onto shore and escorted a young lady who was enrobed in an outfit that was rather simple for the French court but dyed with prominent colours, the banner being brought up by a servant as the last to disembark. This was King Harold's little sister, Edgiva.<br>\r\n<br>\r\nKing Philip of France was only a teenager and, as such, Harold anticipated that he might be rather pliable by both his representatives and those of the new Duke of Normandy. Recognising that Robert could get representatives to Paris at least a week before his could arrive Harold had opted to play a trump by sending his sister as a potential bride for Philippe, what with Robert's sisters being still too young to marry outright or too old for the French king's needs.<br>\r\n<br>\r\nReaching the royal residence Edgiva and her entourage found that they needn't have worried so much as Robert hadn't sent any of his sisters in the first place, but his twelve-year old brother was there. The young lad had an entourage of his own, of course, but Richard responded to their arrival by loudly accusing them of murdering his father. Though some of her guards reached for their weapons when they saw some of his doing the same Edgiva spoke clearly and calmly in her own tongue to them, which led to their slowly stepping back while she spoke to the King of France in Latin, not trusting her understanding of French.<br>\r\n<br>\r\nPhilippe had already heard the petition Richard of Normandy had brought on his brother's behalf, loud and brash the lad had been in calling the Saxons a race of brazen murderers; the king had concluded that this was not the tone the duke had intended as there was nothing in the petition specifically mentioning a request for the whole of the kingdom to mobilise against the English king. Now he heard the straw-blonde lady espousing the necessity of a king to defend his people and homeland, talking about the artful manner in which the French king avoided solving grievances upon the battlefield. No one present dared to make the point that Philippe was too young to even consider leading his army personally.<br>\r\n<br>\r\nIn the end the King of France made his decision.</span></div></div>",
            "created":1589216820,
            "id":2833928,
            "title":"Paris, 21st November 1066"
        },
        "1552":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "James returns to the main fight and both sides lose too many men.",
                "William is killed, making the battle a Phyrric victory.",
                "Queen Mary arrives in Ireland with a plan to persuade her father.",
                "A new pope sends an emissary calling for James to make peace talks.",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>James VII of Scotland, also known as James II of England, came to the throne upon the death of his brother, Charles II. As a devout Catholic he'd been at loggerheads with parliament who associated the Catholic church with Queen Mary of England and her brutal persecution of Protestant sects, apart from which the King of England was meant to be the head of the Anglican church. Nevertheless James wasn't all that much younger than his predecessor, and without any surviving sons his crown would be passed on to his eldest daughter Mary who, despite her namesake, was definitely a Protestant. The members of Parliament were prepared to wait for the Catholic king to die of old age, but then a bombshell was dropped. The queen consort became pregnant and, when she ran to term, gave birth to a healthy boy; this new prince was christened in a Catholic ceremony and Pope Innocent XI was named as his godfather. For the Protestant members of Parliament this was the last straw as it meant a Catholic succession. Swiftly they made plans to usurp the king and place his daughter on the throne, affirming that the monarch was there at the sufferance of Parliament, to that end they approached Princess Mary's husband, Duke William of Orange. William was younger than King James but he had a few niggling health issues that meant he didn't have quite the charm, but the Protestant faith had become so prevalent in Great Britain that most men had little concern about these matters.<br>\r\n<br>\r\nOn the 15th November 1688 William of Orange and his forces landed in Torbay, Devon. Though he'd come to aid Parliament in hastening his wife's accession to the throne there was one major condition he had, he himself must be made King of England and Scotland; fortunately there wasn't much fuss made of this among the MPs. As the Protestant forces mobilised various portions of the British Army were sent to try and halt the invasion, however many Protestant soldiers defected. As the days rolled past and William's forces moved closer to London their numbers swelled with new recruits and defectors to the point that, on the night of the 9th December, King James and Queen Mary began to evacuate to France.<br>\r\n<br>\r\nOn the 11th April 1689 William of Orange and Princess Mary were coronated as William III and Mary II respectively. In this year legal measures were drafted to guarantee that a Catholic would never sit upon the English throne ever again. However James was not intent on merely sulking in exile and conspired with the King of France to recover his crown. He headed a counter-invasion that landed in Ireland, the one place in the British Isles with a Catholic majority at the time. Initially James enjoyed considerable backing and success but hit a snag at Londonderry; the town was both a Protestant majority and fortified which meant that there'd be a considerable siege.<br>\r\n<br>\r\nFor a while James seemed to be making an impact upon the town but then reinforcements under the command of King William arrived by sea with dedicated seamen actually jumping into the water to hack away at the boom James's men had put in place to prevent Londonderry from resupplying. The siege had failed and James had to withdraw into the Catholic south of Ireland.<br>\r\n<br>\r\nJames again made an attempt to march north while William marched south until the two armies drew up on either side of the River Boyne. On the north bank the Williamites of Great Britain and the Netherlands, on the south bank the Jacobites of Ireland and France. This battle would be brutal, one of the last great battles of the pike-and-shot tactics. Two major crossing points had to be defended by the Jacobites with one large front along the tidal portion of the river while the two crossings were divided on the south side by a great marsh.<br>\r\n<br>\r\nHistorically the battle was won by William, who was a visible figure among his men in the thick of battle until he experienced what appeared to be an asthma attack, while James was hardly seen as he focused on preventing a flanking attack that was frustrated by the marsh. What happens here to make the two sides seek a truce that wouldn't be quite so favourable to William?</span></div></div>",
            "created":1590092580,
            "id":2839158,
            "title":"Glorious Revolution"
        },
        "1555":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "A reality where all girls wear and use diapers",
                "A reality where women are obedient to men",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other reality would you want to visit?</span></div></span></div>",
            "created":1589000400,
            "id":2833157,
            "title":"Another Reality"
        },
        "15553":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Boudicca succeeds in kicking the Romans out of Britannia.",
                "William Wallace wins the Battle of Falkirk.",
                "Saladin gains control of Acre.",
                "The American Revolution ends with a compromise.",
                "Other Possibilities"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other threads available are...</span></div></span></div>",
            "created":1589086800,
            "id":2833392,
            "title":"Something else"
        },
        "155535":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "What if Hannibal Barca conquered Rome",
                "What if Harald Hadrada won the Battle of Stamford Bridge",
                "What if Bonnie Prince Charlie won the Battle of Culloden",
                "What if female mammals were considerably larger than males",
                "More Possibilities"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And still more ideas for alternative timelines.</span></div></span></div>",
            "created":1589558700,
            "id":2835957,
            "title":"Other Possibilities"
        },
        "1555355":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "What if Matilda won the civil war of 12th-century England.",
                "What if Abraham Lincoln escaped his assassination.",
                "Genghis Khan's attempt to attack Japan led to the latter building an empire.",
                "What if the Battle of Waterloo effectively ended as a draw.",
                "Other Timelines"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The fact remains that the possibilities are endless.</span></div></span></div>",
            "created":1589655600,
            "id":2836696,
            "title":"More Possibilities"
        },
        "15553555":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "What if Joan of Arc didn't get captured by Burgundians.",
                "What if Christopher Columbus died on his first voyage to the Americas.",
                "What if Communism took off in Germany instead of Russia.",
                "What if Leonardo da Vinci discovered electricity.",
                "More Possibilities"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And still there are more timelines to explore.</span></div></span></div>",
            "created":1590686700,
            "id":2842233,
            "title":"Other Timelines"
        },
        "155535555":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "A world where hair colour is used to separate people.",
                "Europe ravaged by the black plaque, then invaded from Asia.",
                "A world where Victorians made it into space, and landed on the Moon.",
                "A virus has devastated humanity, and at risk of going extinct.",
                "More possibilities."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other realities, and differences.</span></div></span></div>",
            "created":1602239340,
            "id":2917988,
            "title":"More Possibilities"
        }
    },
    "info":{
        "author_id":"jfoxx",
        "author_name":"Johnny Foxx",
        "brief_description":"Come visit a world like, yet unlike our own, be it in history or reality.",
        "created":1583569920,
        "description":"<td align=\"left\" class=\"norm\">Let's face it, reality sucks. Don't you ever wish things in our reality were different? For example, a world where magic was real. Or maybe one where superheroes really existed. Well, in this story you can visit these worlds and many more! Whether it's an alternate history scenario, such as the dinosaurs never going extinct, or alternate reality like mentioned above, feel free to run wild with it! </td>",
        "id":2215105,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602239340,
        "modified":1602239340,
        "pretty_title":"Alternate Earths"
    }
}