{
    "chapters":{
        "1":{
            "author_id":"pervysage",
            "author_name":"PervySage",
            "choices":[
                "Tomo is back to try and finish.",
                "Chiyo had come to check on her science project.",
                "Sakaki had come to finish her hypothesis",
                "Ms. Kurosawa was looking for Ms. Yukari",
                "Yomi was looking for Tomo"
            ],
            "content":"<div class=\"\"><div> <span>     John would enter the science lab at Azumano high school, timorously peeking into the room to ensure noone else was there. He had heard that this school facilities were all around impressive, and the shy, easily embarrassed boy had wanted to see this for himself. His icy blue eyes reflected the dim lighting of the room, as he ran a lithe hand through his short, brown hair.<br>\r\n<br>\r\n     Seeing no one in the room, he slipped inside, shutting the door behind him. He was fairly sure he wouldn't get in trouble, but he didn't want to take a chance with anyone running into him. School had not even started yet, and he certainly was there early, ready to begin his career here as a sophomore; 11th grade in Japan. John would begin to take a few tentative steps into the room, before his luck went down the drain. <br>\r\n<br>\r\n     As fate would have it, Tomo Takino had been on clean up duty the  day before. The ADHD, hyperactive girl had mopped some of the floor, but then been distracted and run off. Something perhaps expected from Osaka. Any friend of Tomo's might have warned John to be careful. After all, Tomo was known for half assing her way through tasks. <br>\r\n<br>\r\n     It happened in an instant. John felt his left foot go ahead of his right one. However, due to his martial arts training, he had fairly good balance. He spun his upper body a little, grabbing onto a table. But his hand forced weight down on the table, and a glass vial was tipped off the table, shattering below John. A huge explosion of harmless, pink smoke filled the room, the automatic emergency ventilation system activating and filtering the air out.<br>\r\n<br>\r\n     But as John's vision cleared, and the pink wisps of smoke faded, he realized something was drastically different. A huge metal pillar stood next to him, slanted slightly. looking along it's impressive length, he saw that this towering structure was a chair leg. He had been shrunken down to the size of a dime. He swallowed, his knees beginning to shake.<br>\r\n<br>\r\n     Then, as he thought that things couldn't possibly get an worse, they did. He heard echoing footfalls nearing the lab door. It seemed someone else was here too. This was bot good, especially for the minuscule John, who; wearing his normal attire of a black suit ensemble, would be spotted in contrast to the linoleum floor. His mind began working, and he realized that he'd stand out, especially next to the fragments of the dropped beaker.<br>\r\n<br>\r\n     He moved as fast as his tiny legs could carry him, coming to a halt behind a table leg. From behind the safety of his latest shelter, he peeked out, as the door opened.<br>\r\n</span></div></div>",
            "created":1207342980,
            "id":516102,
            "title":"The Incident"
        }
    },
    "info":{
        "author_id":"pervysage",
        "author_name":"PervySage",
        "brief_description":"You find yourself shrunk in the world of Azumanga Daioh. Details inside.",
        "created":1207342140,
        "description":"<td align=\"left\" class=\"norm\">Characters:<br>\r\n<br>\r\nJohn(You): You're an ok student in London, England, until you are accepted on a transfer program to Japan. Knowing it would broaden your horizons, you accept. You know martial arts, and are very logical and deductive. You're also a bit of a pervert, liking girls feet. But, you know your fetish could never overwhelm your logical knowledge of danger, having been bullied your whole life for being \"puny\"<br>\r\n<br>\r\nTomo Takino: A very wild and hyper girl, who is very impulsive and unknowing or uncaring of the consequences of her actions. Makes bad grades and is rather a slacker<br>\r\n<br>\r\nKoyomi \"Yomi\" Mizuhara: Tomo's classmate since elementary school, and the one who often has to keep her in check. She's not fat by any standards, but seems to watch her weight. She's fairly smart and sort of athletic. Tomo's \"Straight man.\"<br>\r\n<br>\r\nAyumu \"Osaka\" Kasuga: The number one airhead and ditz of the school, she can best be described as 'Special', Osaka is plain, flat-chested, and feeble. Ayumu considers herself \"slow\" and \"spacey\" - but she lacks the energy or motivation to dispute it. <br>\r\n<br>\r\nChiyo Mihama- A child prodigy, Chiyo has skipped five grades to tenth grade, and is still at the top of her class. Still a child, however, and definitely the smartest of the group.<br>\r\n<br>\r\nSakaki: Tall, soft-spoken Sakaki is uncomfortable with her height and her busty physique. Because she is shy, she seldom speaks, and this reticence is misinterpreted and admired as \"tough\", \"mysterious\", and \"cool\"—a reputation compounded by her natural athletic ability.<br>\r\n<br>\r\nKagura: She has a one-sided rivalry with Sakaki and attempts to outdo her in all activities, be it playing softball, sprinting, or even eating lunch. This is how her character was introduced to the rest of the cast, when during 1st year's field day, she was defeated by Sakaki in a running event. The next time the two meet, Kagura has decided to make Sakaki her rival, yet she also makes continuous attempts to be a good friend to Sakaki. Sakaki is a natural athlete (and doesn't remember a thing about running against Kagura during the first Athletics Fest, which stuns Kagura) and defeats her in almost everything except stamina events. Like her would-be rival, she is sometimes embarrassed when Tomo calls attention to her large breasts.<br>\r\n<br>\r\nYukari Tanazaki:She is the girls' English and homeroom teacher (class 3), but a teacher with very unconventional methods and a rather close relationship with the class. Her students are casual enough to call her by her first name (Yukari-sensei in lieu of Tanizaki-sensei, with a few, mostly Tomo, addressing her as the extremely-informal Yukari-chan). Depending on the day, time, and her mood, she can be either a horrible tyrant or one of the sweetest, most touching teachers ever. Her behavior ranges from mercilessly teasing Chiyo and hitting students with blunt objects to kind and gentle words and simple, encouraging notes on tests telling students she believes in them. She is often selfish, irresponsible, miserly, and generally dysfunctional, and shamelessly expects her friend and fellow teacher, Minamo Kurosawa (\"Nyamo\"), to not only tolerate all of this, but to enable it. <br>\r\n<br>\r\nMinamo \"Nyamo\" Kurosawa: A gym teacher at the girls' school. In the girls' first year of high school, she is the homeroom teacher of Class 5. During their last two years, she is the homeroom teacher of Class 2. Minamo is a high school friend and rival of Yukari Tanizaki; Yukari relentlessly insults and freeloads from Nyamo, but Nyamo gets her digs in, too. \"Nyamo\" is a nickname from her student days, but Yukari calls her that, and so does Tomo Takino. Other students call her Kurosawa-sensei. Whereas Yukari appears to be an older version of Tomo, Nyamo resembles Yomi (more in personality than looks) and the two teachers' odd relationship is similar to the one that Tomo and Yomi share.<br>\r\n<br>\r\nPopular with the students, Nyamo is nicer, less obnoxious, and far more in control than Yukari. Yukari often teases her about her past romantic relationships and that she is a \"stupid P.E. teacher\". During one of the summer trips the girls take together, Nyamo gets very drunk (usually, Yukari is prone to this behavior; as a matter of fact, Nyamo drank specifically to keep the alcohol away from Yukari) and tells the girls all about the birds and the bees, which embarrasses Sakaki and confuses Chiyo, but impresses the other girls.<br>\r\n<br>\r\nThe Story: Your name is John Stevenson. You are a student in England, well versed in martial arts and a self acclaimed philosopher. Your looks are about average, and you have never had a girlfriend. Your grades, however, are excellent. You win an opportunity to go to Japan as a transfer student. However, while touring the facility on your own, an explosion went off in the lab, after you slipped on the wet floor and knocked a table over. <br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n- Decently written additions only, at least a few paragraphs please.<br>\r\n- Please spell check and use grammar.<br>\r\n<br>\r\nWhat I like, and you should expect to see:<br>\r\n<br>\r\n- Feet<br>\r\n- Mouth play<br>\r\n- Breasts<br>\r\n- Butt<br>\r\n- Other Creative Situations<br>\r\n<br>\r\n**If you like the story, please add. It's easier to continue writing when I know somebody enjoys contributing.**</td>",
        "id":1409732,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1249147440,
        "modified":1249147440,
        "pretty_title":"Shrunk in Azumanga Daioh"
    }
}