{
    "chapters":{
        "1":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "1) Sakura Haruno.",
                "2) Ino Yamanaka.",
                "3) Hinata Hyuga.",
                "4) Ten Ten."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your choice is :<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></span></div>",
            "created":1376715600,
            "id":1647362,
            "title":"The chosen one "
        },
        "11":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "1) Naruto Uzumaki",
                "2) Sai",
                "3) Sasuke Uchiha"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now choose the lucky slave.</span></div></span></div>",
            "created":1376715600,
            "id":1647367,
            "title":"1) Sakura Haruno."
        },
        "111":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "Some other slave thing",
                "Will let his slave some rest"
            ],
            "content":"<div class=\"\"><div> <span>Naruto was walking along the street of Konoha enjoying the long period of peace he created, with all his efforts,  as hokage, when while he was thinking about some silly things he met Sakura.<br>\r\nSakura: hi Naruto! How are you?<br>\r\nNaruto:fine thanks, but sakura I'm the hokage now, you should call me by my title! (said Naruto with proudness and his usal laughing face)<br>\r\nSakura: Naruto you know, you can be whatever you want, you are always my team mate, and always \"only\" Naruto you know? (said Sakura with a little fleer on her face)<br>\r\nNaruto: as you wish Sakura-chan, but don't do it in public, remember I'm the highest authority here! (laughing face again)<br>\r\nSakura: ok naruto-kun, but... can you follow me in my house? I want to show you a new special jutsu...<br>\r\nNaruto: what is that?<br>\r\nSakura: follow me and you'll see it<br>\r\nNaruto: ok Sakura,now I'm too curious.Lets go!<br>\r\n<br>\r\nThey got in Sakura's house, then they went in Sakura's room.<br>\r\n<br>\r\nSakura: ok Naruto, be ready! Just lay there in the bed because I want \"my hokage\" comfortable, then close your eyes! You will see the surprise...<br>\r\nNaruto:yep, if you called me, the hokage, just to show a justu I'm sure that it must be great! I just can't wait!<br>\r\nSakura: so do I naruto, so do I. (said Sakura hiding a evil grin)<br>\r\n<br>\r\nSakura did some seals, then she touched Naruto's chest, afterward she jumped silently on the bed without doing an only vibration or sound <br>\r\n<br>\r\nNaruto: May i open my eyes?<br>\r\nSakura: Wait a second it is almost done, now just kiss the air!<br>\r\nNaruto: why?<br>\r\nSakura: just do it!<br>\r\n<br>\r\nNaruto did as Sakura asked thinking he would feels Sakura's lips, but when he opened his eyes he saw Sakura's dirty and sweaty feet over him.<br>\r\n<br>\r\nNaruto: what the hell? Sakura are you crazy?<br>\r\nSakura: Nope! Hahaha! It was an enslavement justu!I invented it lot of time ago, but the only trouble was to find someone who would kiss my dirty feet!<br>\r\nNaruto:What?! I'm the hokage, the most powerfull ninja here! You can't beat me! I'll show you!<br>\r\n<br>\r\nBefore Naruto's could do a single action, even only a little reaction, Sakura did a little seal with her hand and Naruto fell down in the floor screaming in pain and sorrow, twisting his body like if a hundred volts would pass through his nerves<br>\r\n<br>\r\nNaruto:Please stop! It hurts too much! I'll do want ever you want me to do!<br>\r\nSakura: are you sure? Remember i can do it everytime i want using just a hand!<br>\r\nNaruto: yes, yes please!<br>\r\n<br>\r\nSakura with another seal ended the justu<br>\r\n<br>\r\nSakura: I know outside here you are the Hokage, but here you'll be my little foot slave, you'll call me Mistress and my feet will be your owers, your possessors!<br>\r\nSakura: From now on when you will not do your role as hokage you will kiss, lick, smell and clean your owers , and you will implore, beg me to stay with them and to serve them as the good foot slave, toes servant that you are, is that ok?<br>\r\nNaruto: if it will not make me suffer again as some minutes ago then...then ok...<br>\r\nSakura:ok remember to follow the rule and you'll not suffer, but try to disobey and i'll kill you slave!<br>\r\nNaruto: I'll do it mistress<br>\r\n<br>\r\nSakura: ok Slave, now knlee down and kiss your owners<br>\r\nNaruto was very angry, but he couldn't do otherwise so he got down on his knlee and he kissed Sakura's  dirty and sweaty feet while she was moving her toes in the air, producing a really hard and penetrating foot smel in the air.<br>\r\nSakura:dirty thrall what are you doing? You must do it with passion, with devotion! (said Sakura slapping Naruto's face)<br>\r\n<br>\r\nNaruto dropped behind, on his back and Sakura started to trample his face<br>\r\nSakura: you should love them! Treat them properly stupid slave!Can't  you understand that you exist just to use your tongue on my feet!<br>\r\nSakura: You deserve nothing but  to get your face stomped !<br>\r\n<br>\r\nAfter something like an hour Naruto was exhausted, and he decided to put apart his honor and to ask her mistress to stop, even if he had to beg her a pathetic, humiliating way<br>\r\n<br>\r\nNaruto: Please my mistress stop! Please you feet, those which are my possessors need to be cleaned!<br>\r\nSakura:uhm...let me think (while she was going on with the trampling)...you are beginning to think as the slave you are...uhm...to put my stinky feet before your dignity...ok! Do your honor then!<br>\r\n<br>\r\nNaruto tried to take Sakura's foot with his hand and to lick it but he was out of energy.<br>\r\n<br>\r\nSakura: You waste all of your energy to avoid serious damage on your face? Isn't it?<br>\r\nSakura: Well i want to help you, take out your tongue, your mistress will give you the honor of using your mouth to clean her feet! (Said sakura laughing)<br>\r\n<br>\r\nNaruto took out his tongue and Sakura started rubbing her feet on it<br>\r\n<br>\r\nSakura: Slave do you feel honored by licking the feet that left your face in that condition? <br>\r\nNaruto: Yer mistress, I feel glad because my owners did me some Souvenirs to have with me when i want. (Said naruto smiling and hoping to save his self from another trample session)<br>\r\nSakura: ok, now i'm tired of rubbing them my self, i'll put them all inside your mouth!<br>\r\nSakure: i reccomend you to do a good job, right? I want your owners to shine! Or you'll stay there till they'll be swollen up!<br>\r\nSakura : when you'll done slave tell me!<br>\r\nSakura: so i can think to something else to make you do...<br>\r\n<br>\r\nWhat else the terrible mistress will force naruto to do ? <br>\r\n <br>\r\n</span></div></div>",
            "created":1376751900,
            "id":1647396,
            "title":"Naruto's surprise"
        },
        "1111":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "Another foot worship session",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Sakura told Naruto to get back home and that she would call him whenever she had some other humiliation for him.<br>\r\n<br>\r\nAfter a week, when Naruto's mind was about to forget the whole \"foot nightmare\", our Hokage was seaten in his office sealing some paperworks, when Sakura got in.<br>\r\n<br>\r\nNaruto: Hi Sakura! How are you?<br>\r\nSakura: Fine thanks foot-slave!<br>\r\nNaruto: Shh!! Don't call me in that way while i'm working!...please<br>\r\nSakura: why? You don't want people to know that you are my foot cleaner?<br>\r\nNaruto: ...yes...please...my mistress...(said Naruto in a very low voice)<br>\r\nSakura: ok, come with me to eat some ramen and \"for now\" your secret will not be revealed.<br>\r\nNaruto: what? AHAHA! Ramen! I love it! Yeah, why not!? Lets go! I'm relly hungry you know?<br>\r\nSakura: ok, i'm gald to hear that, but bitter is more bitter if you taste someting sweet you know?<br>\r\nNaruto: ...yes...I know...(Said gulping loudly)<br>\r\n<br>\r\nThey ate their Ramen and Naruto was wondered because Sakura treated him as a friend, but in the ending of the lunch Naruto got asleep, Sakura had put some sleeping pills in his food.<br>\r\n<br>\r\nSakura: wake up foot servant!<br>\r\nNaruto: what the ...?<br>\r\nNaruto: it's all black!...And i can't move! And what is that stench?<br>\r\nSakura: it's because you have your owners in your face, and you've been tied to my bed firmly. (Said Sakura laughing)<br>\r\nSakura: and...(She stomps Naruto's face)...this is the lovely smell of you possessors! I've trained my self with Tsunade for three long days! So now you will sniff the results of all my efforts. (Said Sakura with  a evil sneer) <br>\r\nNaruto: Oh! Sorry mistress!<br>\r\nSakura: Say you love the smell of your two mistresses, and you want to serve them forver! (Said Sakura pushing her feet in Naruto's face)<br>\r\nNaruto : Sorry mistresses! I love your smell! And I'll serve you forever!<br>\r\nSakura: That's right! Now, open your mouth so i can let you taste my sweaty toes!<br>\r\n<br>\r\nNaruto opened his mouth wide hoping that the taste of Sakura's hard training (her feet sweat) was not too disgusting<br>\r\n<br>\r\nSakura : How is my sweat?<br>\r\nNaruto : Delicious... (Said Naruto swallowing with a forced happy face)<br>\r\n<br>\r\nSakura: Now eat the debris between my toes! eat the toe jam! Right! Collect all of them in your mouth!<br>\r\n<br>\r\nNaruto was every single second about throw up, but he was to scared, so he just did what Sakura ordered<br>\r\n<br>\r\nSakura: Look at you! You depend on my feet! (Said Sakura laughing)<br>\r\nSakura: oh you are such a good slave! I have just to order and you fulfill each of mine desires!<br>\r\nSakura: how are my toe jam? Tasty?<br>\r\nNaruto: yes mistress Sakura! I love them!<br>\r\nSakura: even better than ramen?<br>\r\nNaruto: of course my goddess, the taste of my owner is incomparable!<br>\r\n<br>\r\nSakura: Good, open your mouth wide now! (Said Sakura putting all of her toes and lot of her feet inside Naruto's mouth)<br>\r\nSakura: Deeper! I want to touch your tonsils<br>\r\n<br>\r\nNaruto was about to gag <br>\r\nSakura put one foot deeper in Naruto's throat and the other on his nose, using her big toe and her ring-finger to close his nostrils <br>\r\n<br>\r\nSakura: ok now don't move or i'll use my pain-creator justsu!<br>\r\n<br>\r\nHearing that Naruto didn't move a single muscle till the foot on his mouth and the other on his nose by blocking air to his body made him pass out.<br>\r\n<br>\r\nWhat else Sakura will think up for her poor slave?</span></div></div>",
            "created":1376914200,
            "id":1648310,
            "title":"Eat her toe jam after a hard training"
        },
        "11111":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "She will punish Naruto for not respetcting her ",
                "She will use Naruto as a toy-boy"
            ],
            "content":"<div class=\"\"><div> <span>Naruto got up again seeing all black.<br>\r\nHe recognized the stinky smell of Sakura's feet and he hypothesized his face had been used as a footstool.<br>\r\nHe thought that for his stupidity now he was in that situation and even if he was the hokage he had to accept this fate.<br>\r\nNaruto so resigned to his destiny and wanted to try to be a good foot slave, so Mistress Sakura maybe would treat him better and with time let him free.<br>\r\n<br>\r\nWith this idea on his mind he took out his tongue and he started licking what was in close contact with his face.<br>\r\nAs he understood from the scent what was on his face were his two mistresses, Sakura's feet.<br>\r\nSakura lift up her feet for some second.<br>\r\n<br>\r\nSakura : Slave, what are you doing? I know you love your owners and you want to show me, but i didn't given you my permission.<br>\r\n<br>\r\nSayng this she slapped Naruto's face with both feet.<br>\r\n<br>\r\nNaruto : sorry goddess Sakura, and sorry my two mistresses, please stop so i can serve you better!<br>\r\nSakura : ok slave but just because i have other programs for you!<br>\r\nSakura: go in the kitchen, lay the table and made me some sashimi with soy sauce and wasabi!<br>\r\nNaruto : ok goddess Sakura!<br>\r\nSakura : did i allowed you to call me by my name dirty slave?<br>\r\nNaruto : No, sorry goddes...<br>\r\nSakura : why are you looking me in my eyes? You are a foot slave! That means you belong to my feet! And that you can look only at my feet! <br>\r\nNaruto : sorry goddess, and sorry my two owners.<br>\r\n<br>\r\nSaing that Naruto kisses Sakura's feet<br>\r\n<br>\r\nSakura : that is not enough, but for now i'm tired , get in the kitchen and do a good jod!<br>\r\nSakura: otherwise i will remember you the pain of the enslaving jutsu!<br>\r\nNaruto : No please goddess! I'll do a good job! I promise!<br>\r\nSakura : I'll see! Hurry up. <br>\r\n<br>\r\nwhen Sakura's food was ready Naruto called his mistress and she started eating.<br>\r\nSakura : Naruto go under the table and take care of your mistresses!<br>\r\nNaruto : yes my goddess<br>\r\n<br>\r\nNaruto went under the table.<br>\r\n<br>\r\nSakura : Distend under the chair slave! And let me put your mistresses on your face, i want to play with that . (Said Sakura laughing)<br>\r\n<br>\r\nSakura Played with Naruto's face in lots of ways, putting both of her big toes on his mouth and stretching his mouth, using his face as the pedals of a car, and at list using his front, his cheeks and his nose as a doormat where to rub her feet.<br>\r\n<br>\r\nSakura: Ok my dinner is over, now it's time for you to eat.<br>\r\nSakura : Open your mouth wide! Said Sakura taking some pieces of fish wish her toes<br>\r\n<br>\r\nSakura's foot sweat was not exactly a good condiment but Naruto had no other possibility and he obeyed. <br>\r\n<br>\r\nSakura : how is your food ? <br>\r\nNaruto : uhm...good thanks goddess!<br>\r\nSakura : you have to be grateful also with your mistresses, they are feeding you ! ( Said Sakura with a grin)<br>\r\nNaruto : Of course (Said Naruto with some fish and some toes in his mouth) <br>\r\n<br>\r\nNaruto didn't know if it was worse the taste of that \"seasoned\" food or the pathetic creature that he had become.<br>\r\n<br>\r\nSakura : ok slave, your got enough, now let's go to my room, i need you again as my footstoll because i want to read a nice book.<br>\r\nNaruto : yes but why don't you use a woden foot stool my goddess?<br>\r\nSakura : what? Are you joking!! It should be an honor for you to have your mistresses on your face! <br>\r\nNaruto : yes and it is but...ok nothing....sorry goddess...<br>\r\nSakura : you will be punished later.<br>\r\nSakura : now let's go to my room. <br>\r\n<br>\r\nSakura got on his comfortable chair, while Naruto was again with his back on the floor and Sakura's feet on his face <br>\r\n<br>\r\nWhat will Sakura do after her read ?<br>\r\n</span></div></div>",
            "created":1377050820,
            "id":1649136,
            "title":"Another foot worship session"
        },
        "113":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Naruto ",
                "Adult Naruto "
            ],
            "content":"<div class=\"\"><div> <span>Sakura has always desired Sasuke however he has spurned her every time.  This time she would not give him a choice and for the times he has rejected her she would make him PAY.<br>\r\n<br>\r\nBefore the stories continues will this be Naruto or the Adult Naruto show?  </span></div></div>",
            "created":1376937960,
            "id":1648460,
            "title":"3) Sasuke Uchiha"
        },
        "12":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "1) Naruto Uzumaki",
                "2) Sasuke Uchiha",
                "3) Shikamaru Nara"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The slave who will have to obey to every Ino's desire is : </span></div></span></div>",
            "created":1376715600,
            "id":1647370,
            "title":"2) Ino Yamanaka."
        },
        "121":{
            "author_id":"hypnoslave",
            "author_name":"Irish Spartan",
            "choices":[
                "Mind altering",
                "Break him (torture)",
                "Trick him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Naruto will be her slave. So how will she get him?</span></div></span></div>",
            "created":1376752680,
            "id":1647399,
            "title":"1) Naruto Uzumaki"
        },
        "1211":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "Nope, Naruto is Humiliated after jogging",
                "Yes, Naruto's revenge"
            ],
            "content":"<div class=\"\"><div> <span>While Naruto was training with the Rasenshuriken, Ino was thinking about how strong was Naruto becoming  and how cool would it be to have a servant, a menial like him, to humiliate, to get worshipped and to have with to do shopping...<br>\r\nOf course all the kunoichi in the city of Konoha would be very envious of the girl who enslaved the nine tails fox-guy and she would be the most famous, the most desired girl in all the leaf village.<br>\r\nKnowing she was not stronger as a ninja than Naruto , she decided to outwitting.<br>\r\n She would use the mind control jutsu to make Naruto him self sing up on a enslavement scroll she made with some techniques and justu.<br>\r\n<br>\r\nIno decided to act during Naruto's nap, when he  was sleeping, cause of the hard training, in the moment in which he was almost without defenses, she used her jutsu to control Naruto.<br>\r\nNaruto didn't realised he was under a genjutsu and thinking he was in a strange dream, trusting on the fack that in the dream there was Ino, he signed up the contract.<br>\r\nFor Ino it was done, Naruto was her slave forever.<br>\r\n<br>\r\nWhen Naruto awoke he saw Ino in front of him, smiling and with her arms folded.<br>\r\n<br>\r\nIno: Well Naruto i played you a trick , and now you are my slave.<br>\r\nNaruto: Ino are you ok? You look totally crazy! (Said naruto laughing)<br>\r\nIno: you want to see? Then slave i order you to knlee, to take off my sandal and to kiss my feet!<br>\r\n<br>\r\nSomething in Naruto's brain forced him to knlee, to take off Ino's dirty sandals and to kiss her feet.<br>\r\n<br>\r\nNaruto : What am I doing? I can't stop? What have you done to me?<br>\r\nIno : I just made you put your name in this enslavement contract.<br>\r\nIno : Now keep your mouth busy by licking my lovely feet!<br>\r\n<br>\r\nOf course Naruto did as Ino told him. He used his tongue to clean Ino's soft soles up and down.<br>\r\nHe put his heel in his mouth and he sucked well.<br>\r\nAll  Naruto's tongue was getting black, while Ino's feet were getting lighter.<br>\r\nThe stench of Ino's feet was now in Naruto's mouth.<br>\r\n<br>\r\nIno:It's ok for now slave.<br>\r\nIno : come this evening in my house, at eight o'clock, not a minute first because you'll not find me, i'll do jogging.<br>\r\n<br>\r\nNaruto: Ok princess Ino!<br>\r\nNaruto: what? I Can't controll even what i say?<br>\r\nIno : relax slave, is the jutsu that is working properly (said Ino laughing)<br>\r\nIno : See you later slave!<br>\r\n<br>\r\nWill naruto find a way to get free from this slavery? <br>\r\n<br>\r\n</span></div></div>",
            "created":1376922300,
            "id":1648355,
            "title":"Mind altering"
        },
        "12111":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "Feed him with her feet",
                "let him starving , giving him other punishment."
            ],
            "content":"<div class=\"\"><div> <span>Approximately at eight o'clock Naruto felt strange and he started to not control his body, he went outside his house and he started walking along the street without knowing the reason.<br>\r\nAfter some minutes of strolling he reached Ino's house and soon his mind went on Ino's contract justu.<br>\r\nHe understood he was going to umilite him self again without anything to do against.<br>\r\nHis hand knocked the door and he saw Ino in underwear clothes and a pair of trainers shoes.<br>\r\n<br>\r\nIno: Oh it's you slave! It's eight o'clock! Congratulations you have been were punctual and precise!<br>\r\nNaruto: I think it's casue of the justu Princess! I'm never timely! (Said naruto laughing)<br>\r\nIno: Can you see you pathetic slave? This jutsu is making you a best person! (Said Ino smiling)<br>\r\nNaruto: yes princess, even if it's not me speaking, you know? I can't control even my thoughts!<br>\r\nIno: I know, i know slave! But now you live to serve me! So it's better for you if you get used to! (Said ino with a grin)<br>\r\nIno: now slave come inside! I want to sit on the coach while you take care of my feet.<br>\r\n<br>\r\nThey went into Ino's living room.<br>\r\nIno:Slave take off my shoes and breath inside!<br>\r\nNaruto: yes princess! It's an honor for me.<br>\r\n<br>\r\nNaruto took off Ino's shoes and sniffed inside. <br>\r\nThe stench of sweaty feet was terrible.<br>\r\nIno's shoes were all wet with her feet-sweat.<br>\r\nShe made Naruto smell each shoe for thity minutes, she was very bad, in fact she gave him some breaks to not make his nose get used to her sweat and to let him feel every single time the smell.<br>\r\nNaruto's nose could breath only Ino's sweat.<br>\r\n<br>\r\nIno: Little servant now lick inside my shoes, i want them clean for my next run!<br>\r\n<br>\r\nNaruto licked inside her shoes as his princess told him<br>\r\n<br>\r\nIno: Are you happy thrall? Now you will have the chance to lick my feet!<br>\r\nNaruto: Yes princess! I feel really regared.<br>\r\nIno: take off my socks!<br>\r\n<br>\r\nNaruto did as Ino ordered him<br>\r\n<br>\r\nIno: now open your mouth wide!<br>\r\nIno:good boy! <br>\r\n<br>\r\nSaing this Ino put her socks in Naruto's mouth and her feet on his face<br>\r\n<br>\r\nIno: you really love my feet, don't you? You are feeling their taste, you are touching them on your face, you can smell the sweet odor , of course you see them well covering your face, and now (slapping naruto's face) you can hear them!<br>\r\nIno: you should be satisfied! All of your senses can feel my feet! (Said Ino's laughing)<br>\r\nIno: now let me watch some television , stay there quiet and still.<br>\r\n<br>\r\nNaruto felt really humiliated, he was doing the foot-stool and Ino wasn't giving him any attention.<br>\r\nAfter something like two hours he felt Ino's feet slapping his face.<br>\r\n<br>\r\nIno: wake up! Wake up slave! take off my socks from your mouth and lick my feet!<br>\r\nIno's feet were even more sweaty, beacuse they had passed like two hours stuck on Naruto's face.<br>\r\nIno: lick them! lick them if you want to eat! Earing you stomach you are very hungry and maybe thirsty!<br>\r\nIno: drink my foot-sweat then we will see if i can feed you something.<br>\r\n<br>\r\nNaruto was starving and he licked Ino's feet as if it was a dying man in the desert.<br>\r\nEvery drop of feet-sweat was a drop of life for Naruto.<br>\r\nHis tongue was sliding up and down on Ino's soles, even between her toes making him eat her toe-jam.<br>\r\nIno was satisfed of that,  she wery laughing all the time moving and wiggling her feet and her toes.<br>\r\n<br>\r\nIno:Naruto it's fine for now. <br>\r\nIno:Stay there on the floor with my shoes on your nose and my socks on your mouth, i'll see if there is something to eat for a slave.<br>\r\n<br>\r\nWhat will the beautiful perfidious princess do of her slave?<br>\r\n</span></div></div>",
            "created":1378647360,
            "id":1659624,
            "title":"Nope, Naruto is Humiliated after jogging"
        },
        "121111":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "Gagged with your feet mistress",
                "just to sleep! I beg you"
            ],
            "content":"<div class=\"\"><div> <span>Naruto was waiting on the floor for his mistress, when after something like an hour his hunger was about to make him faint.<br>\r\nThe only thing Naruto could do was to smell Ino's foot stench or taste her sock sweat.<br>\r\nBetween a breath and another, between a swallowing and the following one he heard Ino's step.<br>\r\n<br>\r\nIno: Slave! I found some ramen for you!<br>\r\n<br>\r\nNaruto thoghts \"thanks to god\"<br>\r\n<br>\r\nNaruto spat out Ino's socks from his mouth and he let Ino's shoes dropping on the floor, going to met his mistress.<br>\r\n<br>\r\nIno: what are you doing slave? Now i have to punish you again!<br>\r\nNaruto: no please princess!( said crying) Not again!<br>\r\nIno: what? I have to slave! Your are my foot-slave! You must love this foot-slave thing! Because this is your role! Serving my feet is your honor! <br>\r\nIno: you should do it with proudness! <br>\r\nNaruto: OK , Sorry mistress! Sorry!  (putting her socks in his mouth and her shoes on his nose again)<br>\r\nIno: it's too late slave! <br>\r\n<br>\r\nSaying that she smashed hit Naruto's face making the shoes fly away:<br>\r\n<br>\r\nIno:spit out my socks slave! (said Ino trampling naruto's face<br>\r\n<br>\r\nAfter a hunderd of hits on  Naruto's face were visible two red prints of Ino's feet.<br>\r\nNaruto in pain spat out Ino's socks<br>\r\n<br>\r\nIno: Finally! But i want to slap with my feet your face another little bit!<br>\r\nIno: if you want to do the good slave then kiss my feet after each slap, goit it servant?<br>\r\nNaruto: yes princess, thanks for the punishment!<br>\r\nIno: you are welcome slave, can you see? You are totally pathetic! I'm broking your face with my feet and you are thankfull too!<br>\r\nIno: you are truly born to be my foot-slave!<br>\r\n<br>\r\nIno slap naruto's face something like ten thousand times and after every slap naruto was ready to kiss the feet that hit his face.<br>\r\n<br>\r\nIno: ok slave, you are redeemed, but what a pity! You ramen now is cold!<br>\r\nIno: i'll do a little improvement!<br>\r\n<br>\r\nSo Ino put his feet on the ramen<br>\r\n<br>\r\nIno: now you can eat!<br>\r\n<br>\r\nNaruto as hungry as he was ate all he can, even if the taste of the ramen was the same of Ino's socks, maybe because of her foot-sweat.<br>\r\n<br>\r\nIno:Open your mouth!<br>\r\n<br>\r\nSaying this Ino put her feet inside naruto's mouth, helping him to eat.<br>\r\n<br>\r\nIno: slave i want my feet clean! So clean them with your mouth! I don't want to see a single trace of ramen or anything else!<br>\r\n<br>\r\nNaruto licked her feet eating the remained ramen.<br>\r\n<br>\r\nIno: ok slave, do you want to sleep or to be gagged with my feet?<br>\r\n<br>\r\nwhat will answer Naruto?<br>\r\n</span></div></div>",
            "created":1378653600,
            "id":1659672,
            "title":"Feed him with her feet"
        },
        "13":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "1) Naruto Uzumaki",
                "2) Neji Hyuga"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The shy girl will put her feet over:</span></div></span></div>",
            "created":1376715600,
            "id":1647371,
            "title":"3) Hinata Hyuga."
        },
        "131":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "a good foot worship session ",
                "use Naruto as a foot-stool"
            ],
            "content":"<div class=\"\"><div> <span>Hinata was thinking about Naruto, her true love.<br>\r\nShe was really angry because of the fact that Naruto did not showed her even only a chance to understand that they were made to stay together.<br>\r\nHinata was too shy to tell Naruto her feelings, but she were also tired of waiting so she used her brain to find a solution.<br>\r\n<br>\r\nPassed some days of thinking she thought that she could use the seal that hyuga family use to control the second-child lineage to make Naruto do whatever she wants.<br>\r\nShe went in her fatherìs office trying to find the secret jutsu to apply the seal.<br>\r\nAfter some hours of studing she understood, so she decided to play naruto a trick.<br>\r\nHinata decided to invite Naruto for a dinner, Naruto would never say no to some free ramen!<br>\r\nDuring the dinner she put some sleping draught in Naruto's food and after half an hour, when the dinner was already ended and they were walking along konoha.<br>\r\nHinata took Naruto on her shoulder and they get in Naruto's house, then Hinata while Naruto was sleeping did the jutsu.<br>\r\nShe decided to let Naruto sleep, she would make him pay the following day.<br>\r\n<br>\r\nThe following day Hinata went in Naruto's house and awoke him with a foot-slap.<br>\r\n<br>\r\nHinata: Wake up stupid slave!<br>\r\nNaruto: ahhh? what is happening? Hinata what are you doing here?<br>\r\nHinata: Don't call me by name, now im your queen! And i'm enslaving you stupid Naruto<br>\r\nNaruto: what ? Are you crazy? what's wrong with you? why should i be your slave! You know i'm the strongest ninja here in konoha!<br>\r\nHinata: Stupid slave take a look to your shoulder! (Saing this she slap his face with her feet again)<br>\r\nNaruto: what's that? It's look like Neji's symbol!<br>\r\nHinata: Becase it is like his! It's the seal!<br>\r\nNaruto: Ok Hinata! Ok ! I Understood what it is, but how the hell did it appeared on my forehead?<br>\r\nHinata: Because i did the jutsu of course! And now you are my slave!<br>\r\nNaruto: Ok! Ok!  I'll do whaever you want if you don't active the seal! But first tell me, why?<br>\r\nHinata:(blushing) Shut up! A slave can't talk to his Queen! A slave must only kneel down and kiss his mistress feet!<br>\r\nNaruto: ok my queen! I'll do it<br>\r\n<br>\r\nafter that Naruto kneeled down and he took off Hinata's sandals and he started kissing her feet.<br>\r\n<br>\r\nHinata: lick my foot print in the shoes! Like the sole of my flip-flop<br>\r\n<br>\r\nNaruto disgusted of his self took out his tongue and he licked the black foot print on Hinata shoes for twenty minutes<br>\r\n<br>\r\nHinata:Ok slave now just stay still, i'll take your nose between my toes, so you can smell my feet proerly! ( Said Hinata with a sneer)<br>\r\n<br>\r\nNaruto could only breath Hinata's feet, and the stench between her toes was even harder.<br>\r\nAfter something like an hour Hinata stood up<br>\r\n<br>\r\nHinata: now open your mouth, i want to gag you , because it is that what you deserve!<br>\r\n<br>\r\nNaruto too scared of a possible Hinata's over-reaction did as she told him<br>\r\nHinata made Naruto distend on the floor and she put her left foot inside Naruto's mouth.<br>\r\n<br>\r\nHinata: Deeper! Deeper! I want to touch the middle of your treachea!<br>\r\n<br>\r\nHinata's feet was half inside Naruto's mouth, and Hinata with her toes could touch Naruto's tonsils.<br>\r\n<br>\r\nHinata: It's not enough, I want to see it all inside!<br>\r\n<br>\r\nHinata pushed her feet as deep as she could, but Naruto was about to vomit or to pass out.<br>\r\n<br>\r\nHinata: ok it's enough, now the right one!<br>\r\n<br>\r\nSaing this she put her right foot inside Naruto's mouth<br>\r\n<br>\r\nShe acted as she did with the left one, making Naruto have half of Hinata's foot on his mouth and throat.<br>\r\n<br>\r\nHinata: good night slave!<br>\r\n Naruto: please no! (Said in an incomprehensible way because of the foot in his mouth)*<br>\r\n<br>\r\nHinata pushed her feet as down that she blocked with her foot air to the rest of the body and Naruto passed out. <br>\r\n<br>\r\nWhat will Hinata do?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1378683240,
            "id":1659950,
            "title":"1) Naruto Uzumaki"
        },
        "1311":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "Yes my slave, my  love!",
                "No inferior servant!"
            ],
            "content":"<div class=\"\"><div> <span>Hinata: ok pathetic slave, now we will do a good foot worship session, this will be an example of normal day for you.<br>\r\nHinata: I think you are smart enough to understand that as a slave you worth nothing, so i can use you as a feet-shoe cleaner, as a gyp to housework, i can make you   suffer as much as i want and ytou have to be grateful to your mistress. (Said Hinata laughing)<br>\r\nNaruto: Yes mistress, but may i ask you one thing?<br>\r\nHinata: no slave! Don't talk until you have the permission to! For now i want you as my foot cleaner!<br>\r\nHinata: there are still some debris of socks between my toes, which desires to  stay in a foot-slave mouth!<br>\r\nHinata: my feet are still half black as the flip-flop in which they were! So now lick them clean untill they are  shining, totaly bright!<br>\r\nHinata: you will clean them till they are swollen up for what you did to me!<br>\r\nNaruto: what? what have i done?<br>\r\n<br>\r\nImmediately Hinata hit Naruto's face with her feet. Then she got over Naruto trampling his body.<br>\r\n<br>\r\nHinata: I told you that you need my permission to talk!<br>\r\nHinata: now you will be trampled under my feet as a worm!<br>\r\nHinata: that is what you deserve! To be stomped with my feet!<br>\r\n<br>\r\nNaruto was being battered black and blue by Hinata's feet, red foot print were visible all over his body<br>\r\nNaruto understanding Hinata's will tried to behave as a good servant so when she stomped his face he kissed and licked her feet.<br>\r\n<br>\r\nHinata: what? Uhm i see that you have convinced your self that you are an inferior being!<br>\r\nHinata: Ok i'll trample your face now , if you will going on  kissing my feet as the slave you are i will tell you my reasons!<br>\r\n<br>\r\nHinata started trapling his face more strongly to test her slave resistance and to understand how much he had prostrated at her feet<br>\r\nNaruto held on, holding the pain, throwing his honor by worshippping the feet that were beating up him in that pitiful state.<br>\r\n<br>\r\nHinata: ok slave, the truth is that i like you, that i love you! (Said Hinata blushing)<br>\r\nHinata: but you were intrested on that stupid Sakura! You've totally ignored me! So i prefer to have you unred my feet that in Sakura'sarms.<br>\r\n<br>\r\nNaruto blushed too but Hinata was too keen on  trapling him to notice that<br>\r\n<br>\r\nHinata: slave now you can talk!<br>\r\nNaruto: i like you too Hinata, but i was too shy to tell you!<br>\r\n<br>\r\nHinata  in rage hit again Naruto's feet<br>\r\n<br>\r\nHinata: i told you , you are not a man, you are just a slave born to serve my feet!<br>\r\nHinata: worship them and don't claim<br>\r\n<br>\r\nNaruto started kissing her feet.<br>\r\nAfter something like 20 minutes Hinata ordered him ti lick her feet.<br>\r\nNaruto licked Hinata's sole well, up and down, passing his tongue in every little wrinkle of her soles, her put he heel all inside his mouth using his tongue to clean and to mkassage it, then he took her toes inside his mouth , cleaning between them, eating the drebis amd the sweat that was accumulated.<br>\r\nThe lucky slave gave to the little finger and to the big toe a special treatment , putting them outside and inside his mouth lots of time, giving Hinata a nice pleasure and once again the feeling of being superior.<br>\r\n <br>\r\nAfter two hours Hinata told the slave that it was enough.<br>\r\n<br>\r\nHinata: slave how are my feet?<br>\r\nNaruto: delicous my mistress!<br>\r\nHinata: so you really like my feet?<br>\r\nNaruto: i don't really know mistress, i think i must love them so even if the taste is not the best i have to do my slave-duty.<br>\r\nHinata: uhm good answer slave!<br>\r\nNaruto: My mistress may i ask you one thing?<br>\r\nHinata: ok manservant, tell me.<br>\r\nNaruto: would you like to be my girlfriend and my mistress?<br>\r\n<br>\r\nHinata get all red in face, she couldn't believe!<br>\r\nBut then she thought to all the time Naruto needed to ask and...<br>\r\n<br>\r\nwhat will Hinata answer?</span></div></div>",
            "created":1378719360,
            "id":1660166,
            "title":"a good foot worship session "
        },
        "132":{
            "author_id":"giantess18",
            "author_name":"Haro-Haze",
            "choices":[
                "Lick them",
                "Learn to love the smell of my feet",
                "I have another jutsu I want to test on you"
            ],
            "content":"<div class=\"\"><div> <span>(takes place in original naruto series)<br>\r\n<br>\r\nOne day Hinata decided to get revenge on her lower branch cousin Neji for hurting her during the chunin exams, she saught to do this by using the hyuga family scrolls and learn a jutsu that could make him pay<br>\r\n<br>\r\nIn her studies she found a way to use his curse mark to make his body completely loyal to him but it took a week to finish which was great because that would be the time that neji should return from his mission<br>\r\n<br>\r\nA week passed and hinata summons bringing him into a dark room where she had set the jutsu in place activating it when he was in the center of the room<br>\r\n<br>\r\nHinata laughs as Neji Is frozen with a look of fear as hinata kicks him onto the floor unable to stand unless she wishes for him to do so \"awe what's the matter can't you take your week little cousin\" she said kicking off her sandal \"what have you done to me Hinata?\" Neji asks<br>\r\n<br>\r\nHinata smiles \"from now on you shall only call me master mistress or goddess, or else\" raising her dirty feet she hadn't washed all week wait to torture Neji, she pushes them onto his face forcing him to smell them, they smelt so bad that he gagged constantly only to taste her dripping foot sweat falling into his mouth<br>\r\n<br>\r\nHinata tells neji\"______\"</span></div></div>",
            "created":1378819680,
            "id":1660715,
            "title":"2) Neji Hyuga"
        },
        "1321":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "be trampled and then gagged for my feet\"",
                "be humiliated with my friend\""
            ],
            "content":"<div class=\"\"><div> <span>\"Lick them you worm!\" said Hinata with an amused and threatening face.<br>\r\n\"I hope you are joking, little flawed snooty girl!\" Said neji getting angrier and angrier.<br>\r\n\"Take your stupid dirty feet off of my face NOW! Or i'll kick your ass and you will remeber it for the rest of your useles life!\" Said Neji putting Hinata's feet apart.<br>\r\n\"What? How can't you understand? You are my doggy now! A bad doggy at the moment! I'll teach you how to behave with your mistress stuip pet!\" Said Hinata with a look sure of herself.<br>\r\n<br>\r\nHinata did three rapid seals with her hand a neji's sing in the forehead lit, with the consequence that Neji screamed in pain putting his head  about his head.<br>\r\n<br>\r\n\"Aaaah! aaahh! My head is exploding! My body is aching so much!\" Said Neji rolling in the floor \"Please make it stop! PLEASE!\"<br>\r\n\"Will you be obedient? Will you humiliate your self just for my fun? Will ytou pay for the rest of your stupid life for the humiliations you did to me till now? Said Hinata screaming like a chief of ninja army.<br>\r\n\"aaah! rrrgggh! No! I can't kneel at your feet\" Said Neji with the last spark of proudness that his will could give him, saing this he tried with his last strengths to hit hinata with a gentle punch , but of course the pain made him  miss her.<br>\r\n\"You are so arrogant! Prostrate yourself to my superiority\" She Said and she did again the seal adding another hand seals that increased Neji's pain.<br>\r\n\"Please stop! Make it stop! I don't want to die!\" Siad Neji Crying<br>\r\n\"Then humiliate your self! Lick the sole of my right foot, for the heel to the top of my toes! Do it! Admit that you are just a pathetic loser! And the pain will be over!\" Said Hinata in an insolent tone.<br>\r\n<br>\r\nNeji took Hinata's right foot and while he was writhing for the sorrow he licked Hinata's sole collecting all the dirty in his mouth.<br>\r\nAfter something like ten full foot licking Hinata did some other seals and Neji pain stopped.<br>\r\nNeji was exausted but he got on licking the sweat and the dirt for Hinata's feet.<br>\r\n<br>\r\n\"Wait slave, i'm tired stay there in the floor, i'm taking a chair\" Said Hinata with a happy face<br>\r\n<br>\r\nHinata took a chair and she put neji's chest between the anterior legs of the seat, then she put her feet  on her slave face.<br>\r\n\"You can carry on your task my foot-servant\" Said the hyuga girl to his cousin<br>\r\n<br>\r\nNeji continued to lick her feet as long that seemed to him an eternity.<br>\r\nEvery centimeter of Hinata's soles had been cleaned  from Neji's tongue, the top of Neji's tongue was becoming a whole with his mistress foot-wrinkles, the stench of his owner feet the only air for his nose,<br>\r\n<br>\r\n\"Well my feet are now clean, but I'm not happy for today , i want to humiliate you some more for having resisted to your goddess!\" Said Hinata laughing<br>\r\n\"And now you will... <br>\r\n<br>\r\n</span></div></div>",
            "created":1378923180,
            "id":1661201,
            "title":"Lick them"
        },
        "13212":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Anko the sadistic snake mistress!  ",
                "Sakura "
            ],
            "content":"<div class=\"\"><div> <span>\"And now you will be humiliated with my friend!\" <br>\r\n<br>\r\nNeji was exhausted, degraded and still in quite a bit of pain.  But who was the friend Hinata was talking about?  Last Neji knew she had no friends.  \"Who?\" the branch family member managed to croak out.<br>\r\n<br>\r\nHinata giggled and revealed her new friend...</span></div></div>",
            "created":1389557460,
            "id":1726353,
            "title":"be humiliated with my friend\""
        },
        "14":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "1) Naruto Uzumaki",
                "2) Rock Lee"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> This dertermined and strong kunoichi ( female ninja) will humiliate: </span></div></span></div>",
            "created":1376747160,
            "id":1647375,
            "title":"4) Ten Ten."
        },
        "141":{
            "author_id":"khazadummo",
            "author_name":"Khazadummo",
            "choices":[
                "you wil pass your first foot-slave day in my house!",
                "you will see..."
            ],
            "content":"<div class=\"\"><div> <span>Ten Ten determined and courageous was training her self, as always, when she looked at her sandals.<br>\r\nHer blue sandals were all dirty and her feet very stinky, it was boring to clean every time her self, so istead of training this time she would fine a man who could do all the boring works for her.<br>\r\nCause she was not the best ninja in konoha, nor the strongest kunoichi she decided to try to find a slave to humiliate, just to increase her self-esteem.<br>\r\nShe thought about all the ninja in konoha, but the only one who was enough beautilful and enough dumb to serve her was exactly the strongest ninja in konoha, the nine tail guy, Naruto!<br>\r\n<br>\r\nSo she decided to met Naruto and to enslave him with a trick, a bet and then a blackmail.<br>\r\n<br>\r\nTen Ten found Naruto while he was going to met Tsunade.<br>\r\n<br>\r\nTen Ten: Naruto, have you got a minute to talk with me?<br>\r\nNaruto: Well i was going in the hokage's office to see if there are some missions for me, but tell me. (Said Naruto with his smile)<br>\r\nTen Ten: I want to offer you some sushi, do you want to come with me? It's almost lunch time.<br>\r\nNaruto: ok then, i'll do my duty late.<br>\r\n<br>\r\nThey get in the usual ramen shop and Ten Ten ordered sushi for both.<br>\r\n<br>\r\nTen Ten: Naruto do you know that to became hokage you need to be the most powerful and valued ninja in the city?<br>\r\nNaruto: yes, why? maybe you want to say that i'm not?<br>\r\nTen Ten: yes i think you are not!<br>\r\nNaruto: you want to bet it? <br>\r\nTen Ten: ok sign here, and remember you can't use any justu or trick, nor chakra, just your aim!<br>\r\nNaruto: ok, but what's that?<br>\r\nTen Ten: just our bet written. I challenge you to hit a hundred of targets just using kunai!<br>\r\nTen Ten: the one who will do this challenge better will win the bet!<br>\r\nNaruto: yes and if i win?<br>\r\nTen Ten: i'll pay your food for the rest of your life.<br>\r\nNaruto: ok! Fine! <br>\r\nTen Ten: you don't want to know what happen if you lose?<br>\r\nNaruto: no thanks, i can't lose against you <br>\r\nTen Ten: ok see you at seven o'clock in the forest near konoha!<br>\r\nNaruto: see you loser! (Said naruto laughing) No i'm just joking , you know!<br>\r\n<br>\r\nThey met at seven o' clock in the forest of konoha, and Ten Ten had prepared already the twohunderds targets<br>\r\n<br>\r\nTen Ten: Naruto it's your turn.<br>\r\nNaruto; ok! get ready to be amazed!<br>\r\n<br>\r\nNaruto throw the kunai threw all of his kunai, nintynine targets, a good result <br>\r\nTen Ten shooting her kunai did a better result, a hundred targets hit.<br>\r\nNaruto was incredulous<br>\r\n<br>\r\nTen Ten: that's the result of all of my year of training with weapon!<br>\r\nTen Ten: Now that you've lost you have to do for one day what ever i'll ask you to do!<br>\r\nNaruto:  uhm, ok! It doen't look that bad.<br>\r\nTen Ten: it is ! Ahahah! Because now you will clean my dirty foot!<br>\r\nTen Ten: i don't wash them till a week! Because for me it's always too boring. But now that i have my little foot-slave , my little bitch it will be all easier!<br>\r\nNaruto: No! I don't want to! Please choose something else!<br>\r\nTen Ten: read the bet papaer please? I can ask you everything! So now give me a piggy-ride to your house!<br>\r\nNaruto: ok<br>\r\n<br>\r\nThey got in Naruto's house , with naruto running as fast as he could to be seen by the lower number of possible people.<br>\r\nTen Ten Sat on a easy-chair giving the idea of a roman mistress<br>\r\n<br>\r\nTen Ten: ok slave now sit and take off my sandals! Then clean them , up and down!<br>\r\n<br>\r\nNaruto did as Ten Ten asked him , he took out his tongue and with disgust he licked first the dirty soles of her shoes, then the edges of the shoes and at the end her soles that were all black with Ten Ten foot prints.<br>\r\nHe took with his tongue all of the foot sweat, all the dust, all the  debris ad all the sticky things.<br>\r\n<br>\r\nTen Ten: look at you ? Who is the loser now?<br>\r\nTen Ten: take your tongue off!<br>\r\n<br>\r\nNaruto took his tongue off and both of them notice it was all black, Naruto felt  very humiliated<br>\r\n<br>\r\nTen Ten: OK Slave with my shoes is enough, now my feet! (Said Ten Ten wiggling his toes)<br>\r\n<br>\r\nNaruto shuddered at the view of those really really dirty feet, there were just a little bit of mud and dust and sweat <br>\r\n<br>\r\nTen Ten: ok now slave clean my soiled foot. (Said ten ten laughing scornfully)<br>\r\nNaruto: am i forced?<br>\r\nTen Ten: yes you are! Remember the bet<br>\r\nTen Ten:but first clean your mouth, brush your teeth and come back!<br>\r\n<br>\r\nNaruto was happy of cleaning his mouth, but soon he understood that it was just a way to humiliate him even more.<br>\r\nNaruto noticed that Ten Ten was really proud on that way that his tongue got black while her thing got bright.<br>\r\nSo after a nice teeth cleaning Naruto  kneel took her  left foot and started licking.<br>\r\nThe taste was horrible, the humiliation maybe worse but he did his duty, he licked for first her heel.<br>\r\nHe put it in his mouth scrapping with his tongue the dirt.<br>\r\nSo he did with the sole using the whole tongue as a sponge , exspecially the deeper part of his tongue.<br>\r\nThen Ten Ten put all his five toes inside, filling his mouth.<br>\r\nTen Ten waggle her feet inside Naruto's mouth using his mouth as a shoe and his tongue as a doormat.<br>\r\n<br>\r\nTen Ten: Lick between my toes, and eat everything!<br>\r\n<br>\r\nNaruto so took again his aldready dirty tongue outside to recover all the drebis between her toes, he notice that the  junks one between the finger toe and the little toe  were even tasty , maybe something like a chewing gum or a candy.<br>\r\n<br>\r\nTen Ten: OK pathetic waste, now the other <br>\r\n<br>\r\nNaruto did the same job , scarpig with his tongue the dirty heel , passing his tongue lots and lots of time in the sole of her feet and eating minutely the toe-jam.<br>\r\n<br>\r\nTen Ten: Ok slave now just suck well one by one my toes and you are done!<br>\r\n<br>\r\nNaruto suked her toes one by one, making a suction effect that pleased Ten Ten very much.<br>\r\nShe put both her Big toes inside and outside his mouth many times, then all here toes making Naruto pass his tongue between them again.<br>\r\nThen she took her feet away from Naruto's face.<br>\r\n<br>\r\nTen Ten: Naruto it's fine for today, but now you will be my foot-bitch forever!<br>\r\nNaruto: why? Not ! That's not in the bet!<br>\r\nTen Ten: You are right Naruto, but what if I say what you did to my feet, how did you humiliated your self to all the people in the town?<br>\r\nNaruto: they won't believe you! <br>\r\nTen Ten: I can prove that! <br>\r\nNaruto: how?<br>\r\nTen Ten: i can just ask shikamaru or his dog to sniff my feet and see if they can smell the odor of your saliva!<br>\r\nNaruto: ...sh*t...you are right! Ok please don't tell anyone!<br>\r\nTen Ten: I Will keep our secret if you will be my foot-slave!<br>\r\nNaruto: Ok ... i have no others chances...i will...<br>\r\nTen Ten: sign here please!<br>\r\nNaruto: what's that? <br>\r\nTen Ten: A secret enslavement contract! It's just an assurance for me<br>\r\nNaruto: Ok<br>\r\n<br>\r\nThey both sign<br>\r\n<br>\r\nTen Ten: ok slave, now kiss good-bye my feet! Now they are clean at least!<br>\r\nNaruto: ah-ah-ah! (With a ironic laugh) <br>\r\n<br>\r\nNaruto kissed her feet.<br>\r\n<br>\r\nTen Ten: See you tomorrow! Tomorrow is a better day!<br>\r\nNaruto: I hope! What's on your mind?<br>\r\nTen Ten:<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1378746360,
            "id":1660276,
            "title":"1) Naruto Uzumaki"
        }
    },
    "info":{
        "author_id":"khazadummo",
        "author_name":"Khazadummo",
        "brief_description":"male characters from the famous manga \"Naruto\" are submitted to the superior female sex ",
        "created":1376745720,
        "description":"<td align=\"left\" class=\"norm\">Rule if you want to create some addition:<br>\r\n<br>\r\n1. Write in a good english, try to use a good grammar <br>\r\n2. No explicit sex is allowed , only foot \"fetish\" &amp; femdom erotica<br>\r\n3. You must write about male Naruto characters who are forced to obey to women (again Naruto character)<br>\r\n4. You may invent if you want an unexisting ninja, but if you want use your fantasy ; do not copy from anywhere<br>\r\n5 . Make the addiction \"readable\" <br>\r\n<br>\r\nChoose the girl/women who will domiate over the lucky servant.</td>",
        "id":1947864,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1389557460,
        "modified":1389557460,
        "pretty_title":"Naruto boys are foot slaves "
    }
}