{
    "chapters":{
        "1":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "You already know the story so far"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If you want to know how the story started, read halo tickling.</span></div></span></div>",
            "created":1340686800,
            "id":1367383,
            "title":"The beginning "
        },
        "11":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Continuing the story."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If you want to know what the restraints look like go to google and look up Miranda Keyes tickle and it is on the first page of images. P.S. the leg holders fold upwards to do you can get her legs and feet!</span></div></span></div>",
            "created":1340773200,
            "id":1368263,
            "title":"You already know the story so far"
        },
        "111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Go to the bunker",
                "FIGHT!!!"
            ],
            "content":"<div class=\"\"><div> <span>You let her go and patch her up. When your done all it looks like is like you two just had a friendly chat in her room. Being a war hero, she goes down to random outposts to boost the troops morale. You serve as co-pilot until you get to the surface of negus four. You land the pelican and get off. Then you watch it fly back up to the ship to get some more supplies. You are their with Miranda as her bodyguard. You are armed with a battle rifle and a magnum. You also have three frags and a smoke grenade. You are wearing ODST armor except the helmet, which you left back on the pelican. Miranda is armed only with a magnum. She is wearing her regular uniform with a bulletproof vest underneath. You two are walking around chatting with the soldiers when a Sargent calls you over. \"Sir, ma'am, we are detecting an incoming attack on our southern front!\" he says. \" I suggest you get yourselves to the bunker in the east end while we take care of it.\" \"Is it covenant?\" you ask. \"No, it's a local rebel base five clicks out. We usually don't consider them a real threat, but their getting bolder, and their attacks increasing with more troops every time.\" he says.</span></div></div>",
            "created":1340859600,
            "id":1368862,
            "title":"Continuing the story."
        },
        "1112":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "The rebel camp"
            ],
            "content":"<div class=\"\"><div> <span>\"I've been looking for some action all day!\" you say. You two follow the Sargent to a command room. He is running you through the plan. \"The machine gunners will then-\" BOOOOM! A huge explosion shakes the command center. \"What the HELL was that?!\" the Sargent exclaims. \"The rebels have never brought explosives before!\" \"Well this changes everything.\" says Miranda. \" Radio the pelican tell it to bring troops and ammo first!\" she tells a lutenint. \"Yes ma'am!\" he says. You head out into the vehicle depot. All that is left is three mongooses and a warthog. Well this won't be enough to counter the firepower that they have.\" you say. You make your way to the front lines with miranda and the Sargent in the fallback line. You run over to a machine gun and man it. You mow down three rebels and destroy a rebel mongoose. Two explosions come in close to you, one knocking you back. \"Fall back!\" you hear someone shout. You quickly sprint to a position about thirty yards from Miranda and the Sargent. You are killing rebels on all sides when one leaps at you brandishing a knife. He knocks you to the ground and tries to stab you. You take hold of his hand and thrust the knife backward, stabbing him in the forehead. You push his body off of you and continue to fight. \"Uuuuuugggggghhhh!\" you hear someone say. You look around just in time to see the Sargent fall to the ground. A bullet had entered his skull and killed him instantly. You see Miranda running back to check another marine when she gets shot in the back. \"MIRANDA!!\" you shout. You sprint towards her. You see a rebel standing over her about to finish her off. \"NOOOO!\" you shout as you ram your shoulder into him sending him flying backwards. You pull out your magnum and put three bullets in his chest and head before running back to Miranda. You open up the back of her shirt to see the bullet only passed through her uniform. It did not get through her vest. She had, though, been paraliyzed by the force of the bullet hitting the armor. You sigh in relief as the butt of a rifle hits you in the back of the head, knocking you out cold...<br>\r\n</span></div></div>",
            "created":1340946000,
            "id":1369431,
            "title":"FIGHT!!!"
        },
        "11121":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Two rebels come in to investigate the noise",
                "Miranda breaks out of her restraints"
            ],
            "content":"<div class=\"\"><div> <span>You wake up six hour later to a strange noise. You look around groggily and see Miranda in the same looking restraints that you put her in for the training. She is struggling to get out of them. You realize you are strapped into a chair. You start struggling to get out of your bonds now when...</span></div></div>",
            "created":1340946000,
            "id":1369439,
            "title":"The rebel camp"
        },
        "111211":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "They torture Miranda "
            ],
            "content":"<div class=\"\"><div> <span>The next thing you hear is the door being opened. Two rebels walked in. They saw Miranda first.\"Ah, we're not trying to get out of the restraints are we?\" one of the rebels said. \"The other one is awake too.\" the other informed him. \"Ah, so he is. Now we can start the interrogation!\" They leave the room and come back five minutes later with a big load of torture tools!</span></div></div>",
            "created":1341032400,
            "id":1369460,
            "title":"Two rebels come in to investigate the noise"
        },
        "1112111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "You escape the restraints and kill the two guards."
            ],
            "content":"<div class=\"\"><div> <span>They set up Miranda's restraints so that her hands were over her head and her feet were sticking out. ( to see the picture go to the instructions on either page 2 or 3). They take off her clothes, you just finally notice how hot she was. Her stomach smooth, her feet soft and perfect. She is only in a bra and underwear. Her bra and underwear are both grey and her clothes are on a rack next to her. The rebels get out a big box. You realize it is an electrocution battery! You struggle to get out of you restraints, trying to help miranda. But the rebels have already hooked it up. \"AAAAAAAAHHHHHHHH!!!!!!! PPPPLLLLEEEEAAAASSSEEEE!!!!!\" she screamed. They gave her electrical shock after shock. She was screaming as loud as she could. The second rebel took her clothes and threw them into the fireplace. Now Miranda had no uniform or anything else to cover herself. All she had left to cover herself were her bra and underwear.</span></div></div>",
            "created":1341032400,
            "id":1369545,
            "title":"They torture Miranda "
        },
        "11121111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "A UNSC outpost",
                "A crashed pelican"
            ],
            "content":"<div class=\"\"><div> <span>You eventually break free of your bonds. This goes unnoticed by the rebels who are too busy interrogating Miranda on secret base locations. You take the first one into a chokehold and snap his neck. The second is now trying to shoot you with his magnum and almost shoots you in the arm but narrowly misses. You grab the dead rebels magnum and shoot him in the head three times. \"Well, that takes care of that!\" you say as you turn off the battery (it was on during the four second battle you had.). Miranda was sobbing. You grabbed her and held her behind you when you herd voices outside the door. It burst open and three rebels stormed into the room and you quickly shoot them down. You and miranda run from the room. You manage to sneak past the guards guarding the gate. You walk about a mile into the woods and you stop because Miranda apparently cannot walk anymore. You decide to check her wounds and vitals. You are patching up a deep cut along her chest when you hear footsteps. It is only a rabbit. You continue to fix her wounds. You continue walking.( you two had argued for ten minutes over if she was in any state to continue or not.) You finally come across...</span></div></div>",
            "created":1341032400,
            "id":1369573,
            "title":"You escape the restraints and kill the two guards."
        },
        "111211112":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "They overpower you but don't knock you out.",
                "You kill all of them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You find a crashed pelican in the middle of a clearing. You see a UNSC symbol on the side. You run towards it hoping to find a friendly medic for Miranda, but instead you find a squadron of rebel elite soldiers...</span></div></span></div>",
            "created":1341114720,
            "id":1369881,
            "title":"A crashed pelican"
        },
        "1112111121":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Haven't we seen these guys before. ",
                "You and miranda are rescued by the pelican some marines"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All four of them charge at you. They tackle you to the ground and pin your arms behind your back. On punches you in the side of your head, making you fall to your knees.</span></div></span></div>",
            "created":1341598560,
            "id":1372866,
            "title":"They overpower you but don't knock you out."
        },
        "11121111211":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "A short stop for details."
            ],
            "content":"<div class=\"\"><div> <span>You here a shout. \"Get off of him!\". You see Miranda tackled to the ground. They tie your wrists together. Then they hang you from a tree by your wrists. Miranda is hung right in front of you. Both of your wrists are tied together. You take her hand and hold onto it. She is trying to look behind her. She looks very fearful. One of the guards walks into your line of sight. You have seen him before... You realize it is your old best friend, Peter!</span></div></div>",
            "created":1341603420,
            "id":1372892,
            "title":"Haven't we seen these guys before. "
        },
        "111211112111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Continuing the story."
            ],
            "content":"<div class=\"\"><div> <span>You and Pete met years ago on the UNSC warship California. You two had been best friends since you met. You had been on countless missions together. But when you got the promotion he wanted he was very angry. The next mission you went on together he was very unfocused. He went to check out a strange noise and didn't come back. You and your team went to search for him. You searched for an hour but didn't find him. That was the last time you saw your best friend...                                Now you are tied up. You and mirandas wrists are tied together. You two are hanging from a tree from you wrists. You foreheads are touching, as are your chests, legs, and stomachs. You ankles are tied together with Miranda's. She is struggling to get out. She has a very frightened look on her face...</span></div></div>",
            "created":1341721860,
            "id":1373758,
            "title":"A short stop for details."
        },
        "1112111121111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Miranda",
                "You"
            ],
            "content":"<div class=\"\"><div> <span>You had been asleep for half an hour.\" I'll leave you two to talk.\" Pete says with a grin. You look in Miranda's eyes. \"He was telling me what they were going to do to us while you were passed out.\" she says. \"They are letting us decide who should be tortured.\" You two decide on which one it will be. Who is it?...<br>\r\n</span></div></div>",
            "created":1341727560,
            "id":1373816,
            "title":"Continuing the story."
        },
        "11121111211111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Whip",
                "Electrocution"
            ],
            "content":"<div class=\"\"><div> <span>You two argue who it will be. Five minutes later, Pete comes back. Well which one of you will it be. \"Let it be me.\" you whisper to miranda. \"I couldn't stand seeing you being hurt like that again.\" \" It will be me!\" you say to Peter. \"Well then okay. Torture the female!\" he commands two of the soldiers. \"Wait, NO!\" you say. \"Well you should have expected this. After all, it's an old UNSC strategy.\" says Peter. What do they use to torture Miranda?</span></div></div>",
            "created":1341728520,
            "id":1373824,
            "title":"Miranda"
        },
        "111211112111111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Electrocution",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You are also in your shorts that you put on under your armor. You feel the cloth from Miranda's bra slide away. You also feel her underwear slide off. She is now completely naked. You see over her shoulder, a trooper with a long, slender whip. He lashes the whip across Miranda's back. Tears form up in her eyes as she cries out in pain. He lashes her five more times. She is crying into your shoulder. \"Look at me.\" you say to her.\" Are you just going to succumb to this, or are you going to put up a fight?!\" you say to her. She looks up at you. \" I can't,\"she says.\" It hurts too much. You meet your lips with hers. You kiss her for twenty seconds or twenty minutes or even twenty days. Now all you can feel is the sweet warmth of her lips and body until... \"Aaaawww, ain't that sweet?!\" says one of the troopers. \"Sepetate them!\" he orders the rest. You are soon hanging from a different tree. You are looking at Miranda's left side. One other trooper comes in front of miranda with an identical whip to the firsts. He lashes her across the chest. She screams out in pain. She is begging them to stop when Peter comes out of nowhere. He orders them to stop. She only has lash marks on her. They had not been hitting hard enough to make actual cuts. They then decide to torture her another way.</span></div></div>",
            "created":1341730620,
            "id":1373840,
            "title":"Whip"
        },
        "1112111121111112":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "You wake up and you and Miranda are humiliated."
            ],
            "content":"<div class=\"\"><div> <span>Peter walks over to the crackling fire that is about ten feet away from you. He takes out a large metal rod with a symbol on the end. You realize it is the rebel symbol. You also realize the pole is a branding pole. He walks in front of Miranda and thrusts the branding pole onto her chest. She screams as loud as possible in pain. \"Get the $@!4 away from her you @$&lt;*%!!!\" you shout at Peter. One of the troopers hits you in the back of the head with a rifle, knocking you out cold...</span></div></div>",
            "created":1341780840,
            "id":1374157,
            "title":"Other"
        },
        "11121111211111121":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "\"No WAY!!\"",
                "You have to, seeing as you don't have a choice, so you agree"
            ],
            "content":"<div class=\"\"><div> <span>You wake up two hours later. Your cheek is laying on something very smooth. You realize it is Miranda's stomach. You try to get up. You soon figure out you can't move a muscle. \"Aaahhh. The second lovebird is awake.\" one of the troopers said. \"Radio Peter at omega base. Tell him to come back in about three hours.!\" \"Yes, sir!\" said the trooper. Miranda began to fill you in. You two are going to torture each other. She told you all that she knew about this was that most of the punishments were very perverted and sexual. \"Now,\" said the rebel squad leader. \" You boy will lick the female until she is covered in saliva!\" he said with a nasty smile! What happens next?</span></div></div>",
            "created":1341781740,
            "id":1374168,
            "title":"You wake up and you and Miranda are humiliated."
        },
        "111211112111111211":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "You have to do her back",
                "Lower torso"
            ],
            "content":"<div class=\"\"><div> <span>\"Well then,\" the captain said. \"If you feel so strongly about it.\" He gave a gesture to a solider. The solider lifted up your head. He punched you in the nose several times. \"That all you got big shot?!\" you say. He punches you in the eye twice. \"Ahh!\" you shout. \"Just do it!\" Miranda whispers to you. \"It'll be okay.\" \"Are you sure?\" you whisper back. \"Yes, just do it!\" she says. \"Alright I'll do it.\" you say out loud. You are untied with your hands behind your back. You are once again laying on your stomach ontop of Miranda. You start licking her face. You are dragging your tongue along her cheeks. You move down to her chin then her neck. You get to her breasts. You arelicking the tops of them. Your tongue is covering her perfect breasts in saliva. You drag your tongue through the crack in between her breasts. You drag your toungue back and forth through the crack between her breasts. You move down and get her stomach and hips.</span></div></div>",
            "created":1341783960,
            "id":1374204,
            "title":"\"No WAY!!\""
        },
        "1112111121111112112":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "You are forced to beat her on the breasts, pussy, and ass"
            ],
            "content":"<div class=\"\"><div> <span>You move down to her lower torso. She starts wiggling when you start licking her pussy. You move down and get her legs and feet. They hang her by the wrists again and you get her back, back of her legs, and her ass. You are finally finished. You are knocked out cold...                                      You wake up fifteen minutes later. You are tied to a tree. You are facing outward and your hands are wrapped around the tree behind you and tied together. They tie miranda up with you so you are literally nose-to-nose. She is forced to start wiggling and moving around in a very perverted, sexual way. This goes on for the next one and a half hours.</span></div></div>",
            "created":1341814860,
            "id":1374573,
            "title":"Lower torso"
        },
        "11121111211111121121":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "They let you down and you start beating the crap out of Peter",
                "They torture Miranda for unknown reasons"
            ],
            "content":"<div class=\"\"><div> <span>\"NO! NO MATTER WHAT YOU DO OR SAY TO ME I WONT DO IT!!!\" you shout. Then a voice comes out of nowhere. \"What if I told you that your free?!\" The soliders look around. Three bullets with three instant kills drops them to the ground. Ten UNSC troopers come out of nowhere... Peter at the lead.</span></div></div>",
            "created":1342675920,
            "id":1382194,
            "title":"You are forced to beat her on the breasts, puss..."
        },
        "111211112111111211211":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "The offer"
            ],
            "content":"<div class=\"\"><div> <span>One of the troopers cuts the ropes and you drop to the ground. You thank the trooper and turn to Peter. You immediately tackle him to the ground and punch him so hard you break his nose. \"What the HELL was all that about, eh?!\" you shout. Two troopers pull you off of him and give you you're armor. You are still giving Peter a dark look. You turn to the medic and ask if Miranda will be okay. The medic says that she has received a few permanent wounds. But none of them will affect her in any crucial way.</span></div></div>",
            "created":1344657480,
            "id":1402176,
            "title":"They let you down and you start beating the cra..."
        },
        "1112111121111112112111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Recruitment"
            ],
            "content":"<div class=\"\"><div> <span>You and Miranda spend the next two and a half years together. When she gets killed at the end of the war, you leave the marines and retire. You are still only about 28 years old and very fit. You are sitting on the front porch of your house with your wife when a helicopter lands in the front yard. There is bullet holes in it but no symbols of the UNSC anywhere. A tall bearded man steps out and beside him a bald smaller black man. The first man introduces himself as \"The Director\". When you ask him if he is here to recruit your son for the UNSC he laughs. He says he is the leader of a very special project. One that does not agree with the UNSC's perspective. It is called PROJECT FREELANCER...</span></div></div>",
            "created":1344658020,
            "id":1402178,
            "title":"The offer"
        },
        "11121111211111121121111":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "You accept",
                "You deny"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are told that PROJECT FREELANCER is a group of supersoliders fighting against the UNSC. He wants you to become a SPARTAN and join this organization...</span></div></span></div>",
            "created":1344658200,
            "id":1402179,
            "title":"Recruitment"
        }
    },
    "info":{
        "author_id":"bobbysmithd",
        "author_name":"Bob",
        "brief_description":"Have fun with commander Miranda Keyes where halo tickling left off!!!!",
        "created":1340686500,
        "description":"<td align=\"left\" class=\"norm\">Characters: You, Miranda Keyes, Cortana. Locations: Bridge, Your room, her room, torture chambers. Plot: you can torture her any way you want, by tickling, branding, beating, electrocuting, and anything else you can think of. Rules: 1. No death 2. Nudity IS allowed 3. No adding extra characters 4. Use your imagination 5. HAVE FUN</td>",
        "id":1875929,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1344658200,
        "modified":1344658200,
        "pretty_title":"Halo: Miranda Keyes"
    }
}