{
    "chapters":{
        "1":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "Inara",
                "Kaylee",
                "River",
                "Zoe",
                "YoSaffBridge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose who gains weight.</span></div></span></div>",
            "created":1269022620,
            "id":853534,
            "title":"Your choice."
        },
        "11":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "Hungry",
                "Horny",
                "Late for a crew inspection by Mal",
                "Late for a date with Kaylee"
            ],
            "content":"<div class=\"\"><div> <span>It had been a few months since Inara had had a client, and since all she had to really do on Serenity was eat, it had started to show on her body. Starting from the top, her face was a bit fuller, with the very first signs of a double chin. Her breasts had become slightly larger, and were just beginning to overfill her bra. Her stomach had lost it's flat muscles, replacing it with a soft layer of pudge, and she had little love handles that showed in her midriff-baring tops. Her ass had become a little plumper, and her thighs were starting to touch. All in all, she had gained about 20 lbs, and it showed. Inara woke up, rubbed her slightly bigger belly and realised that she was...</span></div></div>",
            "created":1269023400,
            "id":853537,
            "title":"Inara"
        },
        "111":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "Strawberries!",
                "Chocolate Cake"
            ],
            "content":"<div class=\"\"><div> <span>She was ravenous! All she could think about was food, so she quickly put on her old gown (that wasn't really fitting that well anymore), and ran to the dining hall. She looked at the clock and realised that it was three in the morning. She didn't care. She went to the cupboard and looked around, finding nothing that looked very tasty. Just as she was about to close the cupboard door, she saw a strange box in the corner. She pulled it out and saw that it had Kaylee's name on it. She opened the box, and found...</span></div></div>",
            "created":1269023820,
            "id":853539,
            "title":"Hungry"
        },
        "1111":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "Kaylee was eating",
                "Kaylee was thinking"
            ],
            "content":"<div class=\"\"><div> <span>\"Tsai boo shr, Kaylee's strawberries!\" Inara knew Kaylee loved these, and would never forgive anyone who took them, but they just looked so fresh, so plump and juicy... Inara wiped a bit of drool from her lip, and decided. \"One, then I'm done. I don't want to ruin our friendship.\" Inara sat down at the table, then took a bite out of her assigned strawberry. \"Oh Goooooooood...\" Inara moaned, doing her best to try not to come right then and there. She couldn't stop now, they were so good, so delicious, she had to have more. \"Kaylee won't miss a few more...\" she thought, grabbing another strawberry with one hand and reaching down the front of her dress with the other. She plopped the second strawberry into her mouth, and couldn't resist any longer. She came long and hard, almost falling to the floor with the convulsions of her passion, her best orgasm ever. She sat straight up, and continued to gorge on the strawberries. Meanwhile, in another part of Serenity...</span></div></div>",
            "created":1269024960,
            "id":853540,
            "title":"Strawberries!"
        },
        "11111":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "Inara and Kaylee having breakfast",
                "The Plot Thickens"
            ],
            "content":"<div class=\"\"><div> <span>In Kaylee's quarters, she was also eating. With not much to do because of the big rest they were having, she had also put on some weight, around the same amount as Inara, only 20 lbs or so, but enough for her to notice. She had woken up at around the same time as Inara, with the same feelings of hunger and arousal, and had found some of her strawberries beside her bedside. Not finding the fact that she hadn't picked up strawberries in a long time to be suspicious, she dug in without concern for her widening figure. The next morning...</span></div></div>",
            "created":1269044940,
            "id":853683,
            "title":"Kaylee was eating"
        },
        "111111":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "\"Why don't we go to my private shuttle\"",
                "\"I really should stop eating so much\""
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Inara woke up, hungry and turned on as before, and ran to the dining hall. She was out of breath and slightly red when she got there, and saw Kaylee stuffing her face with the strawberries, which there always seemed to be more of, with one hand rubbing herself all over. Kaylee saw Inara standing there and blushed bright red. Looking at Inara, Kaylee knew why nobody had seen her in days, as she looked much bigger (and better, in Kaylee's eyes). \"Inara, I didn't know you were awake. Do you want something to eat? These strawberries are just amazing...\" Kaylee saw Inara looking at the food with a longing look in her eyes. \"I-I'd love some.\" Inara stuttered, noticing that Kaylee looked better than she ever had. She had small love handles that Inara simply loved. They both looked at each other for a while, before Inara couldn't take it anymore and sat down with the strawberries in front of her. Inara's cute little love handles were more pronounced when she sat down, in her formerly loose dresses. Kaylee couldn't help but stare at her large breasts, and on instinct took a strawberry and popped it in Inara's mouth. Inara blushed hotly and looked at Kaylee...</span></div></div>",
            "created":1269049320,
            "id":853722,
            "title":"Inara and Kaylee having breakfast"
        },
        "1111111":{
            "choices":[
                "Make a move on Kaylee",
                "Offer Kaylee some food"
            ],
            "content":"<div class=\"\"><div> <span>\"Why don't we go to my private shuttle, you look like you could use a massage!\" Inara offered the young mechanic. Kaylee's oft-cheerful face once again lit up with a smile.<br>\r\n<br>\r\n\"Sure. That sounds great!\" She chirped, waddling a few steps ahead of the companion. Inara noted how Kaylee now filled her jumpsuits out much, much more. She approved.<br>\r\n<br>\r\n\"You look great, Kaylee\" Inara commented.<br>\r\n<br>\r\n\"I do not! All I've done this past while is eat, eat, eat.\" Kaylee said.<br>\r\n<br>\r\n\"You're looking better than ever. It suits you\" Inara reassured her friend \"Trust me.\"<br>\r\n<br>\r\n\"Well, I guess I can't really argue fashion with a Companion\" Kaylee said, as they entered Inara's opulently decorated shuttle, an oasis from Serenity's grime and clutter.<br>\r\n<br>\r\n\"Why don't you lie on the bed?\" Inara bade Kaylee.<br>\r\n<br>\r\n\"I remember how it goes.\" Kaylee said. It brought back memories for Inara, she had coaxed the mechanic into her room, had her remove her shirt, and lovingly massaged Kaylee's back. When she had been thin, Inara had been able to resist any further impulses, but Kaylee's new, rounder figure made it increasingly difficult to resist as she kneaded the girl's backfat.</span></div></div>",
            "created":1289264220,
            "id":990156,
            "title":"\"Why don't we go to my private shuttle?\""
        },
        "11111112":{
            "choices":[
                "\"You're right!\"",
                "\"They'll be plenty of time for that...\""
            ],
            "content":"<div class=\"\"><div> <span>Inara loved everything about Kaylee's new look, the way her now ample cleavage filled her jumpsuit, the way her thighs had just the slightest jiggle when she walked. Most of all, she loved the way Kaylee lit up whenever there was food around. Inara had just the thing for her.<br>\r\n<br>\r\nAs Kaylee lay rested on Inara's bed on her front, wearing nothing but the lower half of her mechanic's jumpsuit, Inara opened a bureau near in the corner of the shuttle. A moment's rummaging through the many gifts she had accrued and she found the object of her search. A box of succulent chocolates, given to her by her last client, an over eager young man, wishing to buy a bit more affection from the Companion. Normally, Inara had no interest in such things, but she knew Kaylee would.<br>\r\n<br>\r\nCarrying the box over to Kaylee, she set it down at her side, and sat gracefully on the bed.<br>\r\n<br>\r\n\"I've got something for you, Kaylee.\" Inara smiled. Bleary eyed, Kaylee turned round, propping herself up on the headboard, she barely reacted to Inara's quick downwards glance at her chest, they were fairly comfortable being naked with each other. Kaylee noticed the the chocolates.<br>\r\n<br>\r\n\"Oh, but what about my massage?\" Kaylee asked.</span></div></div>",
            "created":1289514120,
            "id":991924,
            "title":"Offer Kaylee some food"
        },
        "1111112":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "...do this more often!\"",
                "...be having lunch right about now...\""
            ],
            "content":"<div class=\"\"><div> <span>\"I really should stop eating so much, if I keep on like this I'll be too big for this dress in a few days time...\" Inara said, subconsciously still putting the strawberries in her mouth. She had never been so entranced, so enthralled by food before, but as she looked down at her still-stuffing hand and saw her cute belly that was poking out about an inch and a half over her dress, she knew that she was addicted to these strawberries. \"I know what you mean,\" said Kaylee, \"I've put on a bit of weight recently as well. I just can't seem to bring myself to diet, especially not with these...\" she gestured to the delicious strawberries, before taking one without thinking and placing it in her mouth, rubbing her larger belly as she did. Inara couldn't wait any longer, and kissed Kaylee hard on the lips. Kaylee kissed back, tasting strawberry and sweat on Inara's hot lips. They ran their hands up and down each others soft bodies, fondling each others bigger assets and stroking their sides, feeling the small bumps where they both had formed love handles. \"I want youuuu...\" Kaylee moaned, stroking Inara's large breasts. They gasped and moaned for a good hour, before orgasming simultaneously. \"We should really...</span></div></div>",
            "created":1269080280,
            "id":853926,
            "title":"\"I really should stop eating so much\""
        },
        "11111122":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "Revealed her plan to Inara",
                "Got some different food from the cupboards"
            ],
            "content":"<div class=\"\"><div> <span>\"We should really be having lunch right about now!\" said Kaylee. \"You're right.\" said Inara, sitting up and causing her boobs to bounce. \"I feel like such a pig, but I'm starting to feel hungry almost constantly. What about you, Kaylee?\" \"I know, right! I thought I was the only one!\" Both the girls stood up and made their way to the table. Kaylee turned around, only to find Inara staring at her ass with a glazed look on her face. \"Snap out of it, I thought you were hungry!\" Kaylee teased. Inara shook her head and sat down at the table. \"Sorry, Kaylee, I just haven't had a client in ages. I've gotten used to having a lot of sex, so when I don't get it, I get really turned on.\" \"You're not the only one...\" said Kaylee, with a mischievous grin on her face. Kaylee leaned over the table, giving Inara a good view of her now-ample cleavage, and started feeding her the strawberries. Inara gave herself a massage under her clothes, while Kaylee flipped between feeding Inara and feeding herself. Then Kaylee... </span></div></div>",
            "created":1269103140,
            "id":854019,
            "title":"...be having lunch right about now...\""
        },
        "111111222":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "A cake that she had made earlier"
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe I should get some more food\", Kaylee said, \"these strawberries won't last forever.\" Inara could only nod, completely in her own world of stuffing and sexual bliss. Her bra was cutting into her back, and so she quickly undid it, allowing her now-even-larger breasts to hang free. Fondling them with one hand and shoving the rich, juicy strawberries into her hungry mouth with the other, Inara moaned and gasped her way to a second climax, before beginning a third. Kaylee looked through the cupboards, one hand groping her big butt. In the second to last cupboard, she found...</span></div></div>",
            "created":1272764100,
            "id":876604,
            "title":"Got some different food from the cupboards"
        },
        "1111112221":{
            "author_id":"supperman",
            "author_name":"Supperman",
            "choices":[
                "In the shuttle.",
                "One Week Later..."
            ],
            "content":"<div class=\"\"><div> <span>The cake was massive, rich and very, very fattening. It was a triple chocolate sponge, with chocolate syrup and high-fat ice cream on top. Kaylee got the cake down, with some difficulty, and proceeded to cut it in half, moaning softly just by looking at it. She gave half to Inara, and they started stuffing themselves. Both only used one hand, using the other to rub themselves (Inara liked the feeling her belly gave her, but Kaylee spent all her time grabbing her big ass.) Afterwards, they stood up, stomachs distended from the massive meal, and started going their separate ways. \"Um, Inara?\" Kaylee called back, \"Do you think you could let me stay with you, in your shuttle?\". \"It'd be my pleasure, honey.\" Inara replied, licking her lips at the thought of what they were about to do.</span></div></div>",
            "created":1280710020,
            "id":928312,
            "title":"A cake that she had made earlier"
        }
    },
    "info":{
        "author_id":"supperman",
        "author_name":"Supperman",
        "brief_description":"The girls of firefly gain weight, realistically.",
        "created":1269022500,
        "description":"<td align=\"left\" class=\"norm\">This is a weight gain story set in the firefly universe (the first one on writing.com, to my understanding) - ALL GAINING MUST BE NATURAL. I CANNOT STRESS THIS ENOUGH. Sex is allowed, as is girl on girl. Male gaining not allowed. And finally please, no one sentence entries or entries where too much happens too quickly (i.e she ate so much she became as fat as teh worldz LAWL), again this is supposed to be natural. Thanks.</td>",
        "id":1656697,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1289514120,
        "modified":1289514120,
        "pretty_title":"Firefly Girls Weight Gain"
    }
}