{
    "chapters":{
        "1":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Jump up and down and yell to get Allison’s attention",
                "Hide behind the faucet from her",
                "Another Girl enters the bathroom",
                "You stay on the sink",
                "Allison doesn't see you, and another girl walks in"
            ],
            "content":"<div class=\"\"><div> <span>The sound of dripping water wakes you up. Your eyes peel open slowly, and at first, all you see is a blurry bunch colors and lights. As your mind clears, you’re able to gather your bearings and stand, but you’re not sure where you are. The last thing you remember is entering a dark room, with a strange sign above it, but you can’t for the life of you remember anything else.<br>\r\n<br>\r\n  You look around, and nothing is recognizable, but you see large strange shapes all around which look familiar. You notice a large metal structure jutting from a white clean porcelain mountain, you fall to your knees as you begin to understand just where you are. The white sky and dripping water, it looks like a changing room but it’s somehow increased in scale immensely. Your standing on the edge of a sink, and suddenly you remember vaguely where you are. You came into the all girl’s school across the street from your all boys school to meet with your girl friend Adriana. But how did you end up here, and shrunken!<br>\r\n<br>\r\n    You hear a door swing open, and fall shut. “shit” you whisper under your breath. <br>\r\nYou see an enormous women walk in, she is stunning. Long brown hair, cute nose and glasses, nice ass, great legs, big tits. She is wearing the school’s uniform, a blouse shirt with a skirt, her skirt is really short and she has 3 out of the 6 buttons on the shirt undone, exposing her bra and beautiful cleavage. <br>\r\n<br>\r\nYou don’t remember how you know, but you recognize her as Alison, she knows Adriana but isn’t her closest friend, but they know each other pretty well. <br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065485,
            "title":"Introduction"
        },
        "11":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You Lose your balance and fall",
                "Let her pick you up",
                "Something unexpected happens",
                "She stands up"
            ],
            "content":"<div class=\"\"><div> <span>You jump up and down, and wave your hands in the air wildly, trying desperately to get Allison’s attention. She spots you, a tiny black dot moving on the sink. “huh?” she says inquisitively. “oh my gosh!” she squeals. Allison approaches you and gets down on her knees to look you eye to eye. “Oh gosh . . . it’s a tiny little man!” She examines you. “Wow, you’re only like, maybe half a centimeter!” Alison continues to examine you and you get a little closer to her. </span></div></div>",
            "created":1299301200,
            "id":1065487,
            "title":"Jump up and down and yell to get her Attention"
        },
        "111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Pulls you out of her Cleavage, drops you into her mouth and Swallows",
                "Puts one hand on each breast and pushes them together, squishing you between her"
            ],
            "content":"<div class=\"\"><div> <span>You get closer to Allison but the side of the porcelain sink is slippery, you slip off and fall through the air, you’re sure you’re going to die but suddenly your is stopped and you’re caught in a soft pocket of air and flesh, you look around and you realize you’re in between Allison’s breasts, right in her cleavage. She giggles and looks down at you and she . . .</span></div></div>",
            "created":1299301200,
            "id":1065489,
            "title":"Slip off the sink and fall into her cleavage"
        },
        "1111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Allison giggles and you and then two fingers descend and pulls you gently out from the embrace of her soft warm breasts. “Awe you’re so cute, almost cute enough to eat . . . in fact.” She licks her lips. “You’re so tiny and you look so yummy, and you’re barely a few millimeters tall, I bet you’d easily slide down my throat little guy.” She moves you towards her mouth. “Mmm, yea I think I’m gonna swallow you hehe” Alison dangles you over her open mouth and then releases. Her eyes close as she feels you slide down her tongue. She smiles and swallows. She traces your descent down her throat and feels you resisting. \"ooh, you're putting up a fight\" Alison swallows again. \"Hehe, not anymore\" she giggles and rubs her stomach, and exits the bathroom.</span></div></div>",
            "created":1299301200,
            "id":1065495,
            "title":"Pulls you out of her Cleavage, drops you into h..."
        },
        "1112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Need to find a way out of here (Run for the door)",
                "Should see if another girl will help you (stay in the bathroom)"
            ],
            "content":"<div class=\"\"><div> <span>Allison looks down at your helplessness and giggles, she bites her lip and smiles. “Awe, you look so cute down there, are you enjoying yourself little guy?” She smiles again and then you see her put a hand on each of her breasts. “Hehe, bye bye little tiny perv” you feel emence pressure as her boobs get pressed towards you, for a few seconds the pressure of being squished between her breasts is extremely painful, her tits are more sweaty then you expect and right as you think you're going to pop between her boobs, you slide out of her cleavage. You fall past her tummy and land at her toe. \"Hehe, awe he was so tiny i can't even see any blood from his body on my tits\" Allison giggled and then walked away. You look around the bathroom and decide you</span></div></div>",
            "created":1299301200,
            "id":1065496,
            "title":"Puts one hand on each breast and pushes them to..."
        },
        "11121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "To Climb her toe and try and get her attention",
                "Hide from her"
            ],
            "content":"<div class=\"\"><div> <span>You run towards the door, you're barely maybe 2 millimeters high so it takes 20 minutes just to walk 6 inches. You get tired and realize it will take hours to reach the door. You continue to walk and then you hear the door open. A young girl, Sophie walks in the bathroom. She is an 11th grader and shes part of the leadership program so she gets to dress down instead of wearing the uniform. She is wearing a tight pink tank top, with a double D push up bra and tight denim short shorts. <br>\r\nshe walks over to the sink and starts doing a bit of her makeup in the mirror. You see she isn't wearing shoes for some reason so it would be easy to climb her toes. But after your experience with Allison you're worried. After awhile you decide</span></div></div>",
            "created":1299387600,
            "id":1065776,
            "title":"Need to find a way out of here (Run for the door)"
        },
        "111211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "fall back down into her cleavage, getting stuck between her breasts.",
                "you fall into her cup of yogurt"
            ],
            "content":"<div class=\"\"><div> <span>You approach her toe, it alone is about as tall as a small apartment building. Shes distracted doing her makeup so you climb the front of her big toe, after twenty minutes you reach the top of her toe but she finishes her makeup and starts to leave the bathroom. You hold on for dear life and eventually she goes to her next class and sits down. Over the course of her hour and half class you climb up to her chest, you're under her tank top climbing up her stomach. You get to her breasts. Her cleavage leaves only about 5 millimeters between her breasts for you to climb through, just barely enough room. You see she is eating a cup of yogurt in class, as you get to the top of her chest you climb on top of her left boob, she moves a little and you lose your balance. you</span></div></div>",
            "created":1299387600,
            "id":1065779,
            "title":"To Climb her toe and try and get her attention"
        },
        "1112111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>slip, falling right back into her sweaty bosom, she feels you land in her cleavage and she subconsciously, pushes her tits together, as if to catch food she dropped, she assumes you were some yogurt she dropped, she looks down and sees your tiny body in her shirt and thinks you're a blueberry piece from her snack. she dips her two fingers into her bosom and picks you out of her cleavage, she drops you quickly into her mouth and tilts her head back, swallowing you. </span></div></div>",
            "created":1299387600,
            "id":1065789,
            "title":"fall back down into her cleavage, getting stuck..."
        },
        "1112112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "you get stuck to her finger",
                "you remain in her yogurt"
            ],
            "content":"<div class=\"\"><div> <span>you slip off her tit and fall down, landing in the sticky blueberry liquid she is eating, you see she isn't using a spoon but her finger, and you see her look down, and it appears she is looking right at you, but instead of seeing you she dips a finger into the yogurt. </span></div></div>",
            "created":1299387600,
            "id":1065780,
            "title":"you fall into her cup of yogurt"
        },
        "11121121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "she slips her finger into her mouth and unknowingly eats you",
                "the yogurt slides off her finger and you end up right back in her cleavage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>her finger dips into the blueberry yogurt and you get stuck to it, she pulls you and the yogurt up towards her lips, but as you get closer you see the yogurt is sliding off her finger slowly. </span></div></span></div>",
            "created":1299387600,
            "id":1065785,
            "title":"you get stuck to her finger"
        },
        "111211211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>your hopes are fruitless as her finger slides between her lips, you're plunged into total darkness and you get soaked by her wet saliva and the yogurt, she licks her finger dry and her tongue pulls you off, and quickly, along with the yogurt, tosses you into her throat, as Sophie swallowed unknowingly, a tiny classmate. </span></div></div>",
            "created":1299387600,
            "id":1065793,
            "title":"she slips her finger into her mouth and unknowi..."
        },
        "111211212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "she swallows you",
                "she changes her mind and pulls whatever it is in her mouth out to see what it is"
            ],
            "content":"<div class=\"\"><div> <span>the yogurt slides off her finger, drips down and you fall right back where you came from, the sticky yogurt sticks to the side of her left tit and you are stuck in the yogurt on her boob as well, she looks down, noticing the yogurt she spilled, and the bell rings. Quickly she runs her finger across her boob, collecting the yogurt and you. She licks it off her finger and her tongue darts back into her mouth, you get caught behind her one tooth when sucked into her mouth and she swallows the remaining yogurt. <br>\r\n<br>\r\nSophie feels something else in her mouth still, she poked it with her tongue, before moving it up onto the center of her tongue and started to play with it. She tossed it this way and that into her cheeks and what not, before she decided it was time to swallow. <br>\r\n<br>\r\nYou prepare yourself, Sophie continues to play with you in her mouth, until her tongue positions you and you feel her getting ready to swallow. </span></div></div>",
            "created":1299387600,
            "id":1065797,
            "title":"the yogurt slides off her finger and you end up..."
        },
        "1112112121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she pushes you to the back of her mouth and then she swallows, sending you down into her belly, as far as she knew she had eaten some blue berry chunk from her yogurt, she didn't know she had just swallowed a tiny student alive. </span></div></span></div>",
            "created":1299387600,
            "id":1065798,
            "title":"she swallows you"
        },
        "1112112122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "\"you know you were pretty tasty\" (she eats you)",
                "\"Don't worry i'll take care of you\" (she hides you back in her shirt)"
            ],
            "content":"<div class=\"\"><div> <span>she decides she should see what it is in her mouth, she opens her mouth and gently pulls the tiny thing out with her thumb and index finger. She brings it to her eye and you're staring right into her enormous blue eye waving your hands like mad. She squints her eyes trying to see you, \"OH MY GOSH!\" she exclaims, she quickly tucks you back in her tight cleavage and runs to the bathroom. She pulls you back out and drops you onto the sink. \"Wow, are you really a tiny little person?\" you wave your arms showing her you're real. \"Awe, poor little guy, i almost swallowed you, wow you're like a tiny speck\" </span></div></div>",
            "created":1299387600,
            "id":1065820,
            "title":"she changes her mind and pulls whatever it is i..."
        },
        "11121121221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>\"you're just so tiny, i doubt theres any way for you to get back to normal, and you're too small to take care of\" she looks at you and has an evil smile, you scream \"you know you tasted pretty yummy little guy\" you squirm and try to get her to drop you. she giggles and drops you into her mouth. she closes her eyes, tilts her head back a little and then swallows you into her belly. </span></div></div>",
            "created":1299387600,
            "id":1065824,
            "title":"\"you know you were pretty tasty\" (she e..."
        },
        "11121121222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Her bedroom, with a few of her friends",
                "her bedroom, and she is alone"
            ],
            "content":"<div class=\"\"><div> <span>\"awe you're so little and cute, don't worry i'll take care of you\" she drops you back into her shirt and you soon fall asleep in her bosom. you've been though a lot today and you're ready to collapse. Her chest jiggles as the car she is in goes over a large bump, waking you up, it's now been a few hours since she discovered you, she pulls you out of her shirt and you're in</span></div></div>",
            "created":1299387600,
            "id":1065827,
            "title":"\"Don't worry i'll take care of you&..."
        },
        "111211212221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Diana (Double D's, Short skirt, brown hair, wearing a button down shirt)",
                "Miranda (34 C's short shorts, wearing a low cut t-shirt, blonde hair blue eyes)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize you're in her bedroom with Sophie and her friend</span></div></span></div>",
            "created":1299387600,
            "id":1065832,
            "title":"Her bedroom, with a few of her friends"
        },
        "1112112122211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "you fall into Diana's cleavage",
                "you fall into Sophie's cleavage"
            ],
            "content":"<div class=\"\"><div> <span>Sophie and her Friend Diana, the two girls are standing and Sophie places you on the floor at their feet, they're looking down at you, they both have cute, evil smiles. You can barely even see their faces past their enormous breasts though. Diana looks at Sophie. \"So what should we do with him?\" she asks. Sophie giggles. \"Let's play a game\" \"like what?\" You get nervous when Sophie's smile gets wider. The two girls get on their knees and you see that they each now have a golden chains hanging into their bosoms. they kneels over top of you and then Sophie ties their chains together at the center. Then Sophie's evil smilling face looks down at you and her two giant fingers pick you off the ground, and you're dropped onto the chain. It's like a high wire. \"okay now, you walk from the middle to Diana's end of the chain, and then all the way over to my end, and back to the middle, if you fall, well . . . \" Sophie pushed her already tight breasts together to emphasize that if you fell you'd be squished by one of the girl's awesome cleavage. \"Get going little man\"</span></div></div>",
            "created":1299387600,
            "id":1065842,
            "title":"Diana (Double D's, Short skirt, brown hair,..."
        },
        "11121121222111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>you fall on your way to Diana's end of the necklace, you fall down and get bounce off Diana's round perky tit, you then slide down and get stuck in her cleavage. \"Awwwweeee, loooook!\" she squeals. You look up to see Diana and Sophie grinning and giggling down at you. Sophie then puts one hand on each of Diana's boobs, causing Diana to giggle, and pushes them together, from down in her cleavage you see the gab between her breasts get smaller and smaller, until you can't see either giantess' face anymore, and you are ultimately squished in Diana's bosom. </span></div></div>",
            "created":1299387600,
            "id":1065848,
            "title":"you fall into Diana's cleavage"
        },
        "11121121222112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>you fall down into Sophie's familiar cleavage, being caught in between her tight sweaty warm breasts. She giggles and then she pushes her arms against her boobs, tilting her head in a cute way and pursing her lips, her breasts get tighter and tighter until you pop right between her massive boobs. \"Hehe\" giggled Sophie</span></div></div>",
            "created":1299387600,
            "id":1065849,
            "title":"you fall into Sophie's cleavage"
        },
        "1112112122212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Sophie",
                "Miranda"
            ],
            "content":"<div class=\"\"><div> <span>You're in the kitchen of Sophie's house and she's standing over you, you're on her counter and you look up to see Sophie and another attractive girl; Miranda. The two are whispering and giggling. Then they turn their attention to you. \"okay, we've been talking, and since you were so yummy earlier, one of us is going to swallow you\" says Sophie, making you scream in horror. \"Now we aren't going to decide who eats you though, you are\" you stagger backward \"NO, I WON'T CHOSE WHO KILLS ME!\" you scream. Then Sophie's finger hovers over you and pushes you down from standing up, \"if you don't ill just slowly crush your body here and now\" you figure you have to chose so you pick</span></div></div>",
            "created":1299387600,
            "id":1065844,
            "title":"Miranda (34 C's short shorts, wearing a low..."
        },
        "11121121222121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Sophie, she gets a wide smile and her skyscraper fingers descend and pick you up, before you know it you're being slowly pushed into her mouth. Sophie closes her eyes and tilts her head back. \"mmm, down you go\" she says softly. Miranda puts a finger on Sophie's throat, as she swallows she feels you sliding down Sophies throat into her warm belly. </span></div></div>",
            "created":1299387600,
            "id":1065852,
            "title":"Sophie"
        },
        "11121121222122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Miranda. She squeals with excitement and carefully bends down, she closes her eyes and licks you off the counter. She stands up and closes her mouth and eyes, she has a cute smile as she tosses you around in her mouth. She sticks her tongue out, showing you to Sophie who laughs, and then she pulls it back into her mouth, and swallows you. \"ooh he squirmed, hehe delicious\" </span></div></div>",
            "created":1299387600,
            "id":1065854,
            "title":"Miranda"
        },
        "111211212222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She eats you",
                "She sits on you"
            ],
            "content":"<div class=\"\"><div> <span>You're alone in Sophie's bedroom with her, she bends over and shakes her bosom over her bed until you fall out. She looks down at you and smiles. \"So i've decided not to keep you, you're just to small to take care of, so . . .  bye bye\"</span></div></div>",
            "created":1299387600,
            "id":1065834,
            "title":"her bedroom, and she is alone"
        },
        "1112112122222":{
            "content":"<div class=\"\"><div> <span>Just as you realize what Sophie just said to you, she quickly turns around and bends over. You realize what's about to happen....She's going to sit on you!<br>\r\n<br>\r\n\"Bye bye little guy!\" Sophie says with a voice that you can only describe as too happy, as she starts to slowly lower her titanic ass down onto you.<br>\r\n<br>\r\nYou get up and, in a desperate attempt to get her to spare you, you beg for your life, however, these efforts have been wasted as Sophie is not paying attention to your pathetic cries, realizing this plan is not working, you attempt to run away from her ass.<br>\r\n<br>\r\nSophie giggles as she sees the speck on her bed attempting to escape her ass, and, increasing the volume of her giggles, she finally drops her planet-sized ass onto your insignificant body.<br>\r\n<br>\r\nAfter the impact, Sophie stands up from her bed and takes a look at her behind in the mirror, and she is delighted to see a tiny red dot where her ass collided with your body. You never stood a chance.<br>\r\n<br>\r\n\"Hee hee hee, sorry, little guy, but you were no match for the ass of a Goddess like me!\" Sophie laughs, delighted.</span></div></div>",
            "created":1367732520,
            "id":1584369,
            "title":"She sits on you"
        },
        "11121122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>her finger misses you and you are able to swim through the thick substance as she eats it, the bell rings and she sees theres a tiny bit left, she looks into the cup and then shrugs, and turns the cup to her mouth, drinking the remaining yogurt, you slide down the side of the cup till you slip between her lips and into her hot mouth, before you can think, she quickly swallows the yogurt, and unknowingly , you as well. </span></div></div>",
            "created":1299387600,
            "id":1065788,
            "title":"you remain in her yogurt"
        },
        "111212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>you run, trying to hide from her, you go to run past her foot but she shifts positions slightly, her toe quickly covers your entire body like a falling house and you fall to your knees, roiling over on your back, just in time to see her big toe before she accidentally flattens you. </span></div></div>",
            "created":1299387600,
            "id":1065790,
            "title":"Hide from her"
        },
        "112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "she lies and swallows you",
                "She drops you into her shirt and walks away"
            ],
            "content":"<div class=\"\"><div> <span>“Come here little guy” you look up and see two giant fingers descending on you, her soft feminine fingers grab you by the back of your shirt and she dangles you in front of her face.  “Oh wow, you’re so cute and tiny . . . there’s so many things I could do with you”<br>\r\nShe smiles. You look frightened. “Don’t worry little guy, I’m not gonna hurt you, not yet anyways”<br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065490,
            "title":"Let her pick you up"
        },
        "1121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>“Hmm, actually . . .” her stomach growls and she rubs it in hunger. “I’m really hungry little guy, and there’s nothing to eat around here, so I think I’m just gonna swallow your tiny body mkay?” she giggles and you scream, which only makes her giggle louder. She opens her mouth a tiny bit, just enough for her fingers to fit, and pushes them into her mouth, you feel her tongue licking you all over and then she lets go of you and pulls her fingers out of her mouth. Her tongue tosses you back and forth, and then finally she positions you at the back of her mouth and says, “Down you go” you fell yourself get pulled her throat before she finally swallows. “Ooh, tasty” she says while rubbing her belly. </span></div></div>",
            "created":1299301200,
            "id":1065497,
            "title":"she lies and swallows you"
        },
        "1122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She keeps you in her cleavage without mentioning it to her friends",
                "She shows you to her friends and Kathleen asks to see you",
                "She shows you to her friends and Adriana asks to see you!"
            ],
            "content":"<div class=\"\"><div> <span>She begins to lower your body and as you look down, you see her amazing cleavage getting closer and closer. She puts you right in her cleavage, tucked between her sweaty breasts. “You’ll be nice and safe and warm in there . . .  and hard” she winks and giggles. Then she exits the bathroom. Allison walks down the hall, passing one girl Megan and a few other classmates. She goes to lunch and picks a seat, right next to a few of her friends; Kathleen, and your girlfriend, Adriana!</span></div></div>",
            "created":1299301200,
            "id":1065499,
            "title":"She drops you into her shirt and walks away"
        },
        "11221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Allison talks to the girl and after awhile, she leaves, then she pulls you out of her shirt. “I’m sure you enjoyed that little man, but that girl made me think, so I’ve decided to get rid of you and go find some other tiny men to play with.” You scream, which makes her laugh. “Oh don’t be so scared, it wont hurt . . . much” Allison positioned you between her thumb and index finger, and then pushed on you till you popped between her fingers. </span></div></div>",
            "created":1299301200,
            "id":1065510,
            "title":"She keeps you in her cleavage without mentionin..."
        },
        "11222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Swallow him",
                "Drop him in her shirt"
            ],
            "content":"<div class=\"\"><div> <span>Allison pulls you out of her Cleavage while the girls are eating lunch. “Hey guys, you’ll never guess what I found today” “what?” asks Adriana “A tiny little man, look” Allison holds you in front of the two girls. “OH MY GOSH!” squeals Kathleen. “can I see him?” she asks. Allison is reluctant but she drops you into Kathleen’s hand, “oh wow, he’s so tiny!” She watched as you squirmed in her palm, and when you look up she has an evil smile on her face. “I have an idea” says Kathleen. “Dare me to . . .</span></div></div>",
            "created":1299301200,
            "id":1065512,
            "title":"She shows you to her friends and Kathleen asks ..."
        },
        "112221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>“Dare me to swallow him?” asks Kathleen. Adriana and Allison look at each other and giggle. “ya, do it.” Kathleen brings you up to her lips and opens them, she dangles you above her mouth and giggles, “down the hatch” she says teasingly. She drops you and you fall into her mouth and slide down her tongue. She plays with you in her mouth for a bit before she decides to just swallow you. “mmm, wow, he tasted good” Kathleen smiled. </span></div></div>",
            "created":1299301200,
            "id":1065517,
            "title":"Swallow him"
        },
        "112222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Kathleen takes you out as a snack on the bus",
                "You slip out of her cleavage during class"
            ],
            "content":"<div class=\"\"><div> <span>“Dare me to put him in MY shirt?” asked Kathleen. “Wow, this guy is like the luckiest guy in the world, from one pair of giant tits to the other haha, ya do it” said Allison. You see Kathleen’s cleavage get closer and closer till you’re hovering over them, Allison had D’s, where as Kathleen had C’s, still big boobs but not as big. Kathleen drops you and you slide into her cleavage comfortably. “Keep him there for now Kath” giggled Adriana. You struggle for air in the sweaty pocket of Kathleen’s cleavage. “PLEASE LET ME OUT” you scream. “I heard him scream for help, poor guy” said Kathleen. The bell rang, “guess you’re staying there for awhile little guy.” The girls got up and went to third period.</span></div></div>",
            "created":1299301200,
            "id":1065518,
            "title":"Drop him in her shirt"
        },
        "1122221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She drops you in and swallows ",
                "She drops you but you miss her mouth and land on the floor"
            ],
            "content":"<div class=\"\"><div> <span>You’re kept in her sweaty cleavage throughout 3rd and 4th period, when the girls go to get on the bus to go home, Kathleen’s stomach starts to rumble. “Oh man I’m hungry, I forgot to eat at lunch” Adriana smiles. “Eat that little man we found” Kathleen undoes her buttons and looks down at you, stuck to her tit from sweat. “Awe, look at him, he’s so pathetic” Kathleen pulls you out of her shirt and brings you up to her mouth. </span></div></div>",
            "created":1299387600,
            "id":1065524,
            "title":"Kathleen takes you out as a snack on the bus"
        },
        "11222211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kathleen drops you and you fall for what seems like ever, before landing in her mouth, she savors you for a moment and then swallows. She traces your descent down her throat with her fingers down to her stomach, “mmm, delicious” </span></div></span></div>",
            "created":1299387600,
            "id":1065526,
            "title":"She drops you in and swallows "
        },
        "11222212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She finds you in 25 minutes, and swallows you",
                "She finds you in 15 minutes, and squishes you with her tits"
            ],
            "content":"<div class=\"\"><div> <span>Kathleen drops you, and you fall towards her mouth, but the bus shudders and she moves, you fall past her mouth and land on the ground, normally, such a fall would kill you, but because you’re so light, you hit the ground and are barely hurt. Kathleen looks for you, “where the hell did he land” but before she sees you, you’re spotted by another girl on the bus, who discretely picks you up off the floor, quickly pocket you I her shirt and gets off the bus before the other girls notice. You were scooped up and stuffed into the third pair of breasts today, and while it seems like every guys dream, you’ve been tossed around so much you’re getting soar. <br>\r\n<br>\r\nThe girl arrived home and before you know it you’re dumped onto a bed. When you look up it’s a girl you don’t recognize. Its Megan, the girl who talked to Allison in the bathroom today, she smiles down at you. “Hi there little man, you scared?” You nod, but you’re too tiny for her to see. “Okay we’re gonna play a game okay? Now I’m gonna let you hide in my room, anywhere, you get one hour to hide, and then I have one hour to find you, but, depending on when and if I find you, I kill you in a different way, If I don’t find you after an hour, you get to live, but you HAVE to come out after the hour cause if you don’t then when I do find you I kill you no matter what. Now, if I find you within the first 10 minutes, I step on you, if I find you within twenty, I squish you in my cleavage, thirty minutes and I eat you, forty and I sit on you, fifty I drown you in my pussy, and between fifty and sixty if I find you, you get to pick, and then if you last longer than sixty you live, as long as you come out.” She picks you up and places you in the middle of the room. “Now hide, be back later, bye bye” <br>\r\n<br>\r\nThe door to her room shuts, and youre left alone, you hide behind the leg of dresser and wait there, nervous, an hour passes and her door swings open, time begins to pass.<br>\r\n</span></div></div>",
            "created":1299387600,
            "id":1065528,
            "title":"She drops you but you miss her mouth and land o..."
        },
        "112222121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span><br>\r\nMegan finds you after about 20 something minutes, she plucks you off the ground and lays on her back and closes her eyes, you look down and her mouth is right below you, you scream which only amuses her, she giggles and the drops you, immediately swallowing you, and licking her lips afterwords.<br>\r\n</span></div></div>",
            "created":1299387600,
            "id":1065539,
            "title":"She finds you in 25 minutes, and swallows you"
        },
        "112222122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>About 15 minutes pass, you think Megan isn’t going to find you, you look out to check and she’s looking right at you, she grins and plucks you off the ground. “Don’t worry, you’ll enjoy this death little guy” She drops you into her cleavage, and presses her hands on her breasts, youre slowly but surely turned to paste in her cleavage. “Hehe” Megan giggled as she looked down at the red stain on her tit. </span></div></div>",
            "created":1299387600,
            "id":1065538,
            "title":"She finds you in 15 minutes, and squishes you w..."
        },
        "1122222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She swallows you",
                "She stands up and steps on you"
            ],
            "content":"<div class=\"\"><div> <span>During 4th period, the sweat from Kathleen’s cleavage is so hot and wet, that you slide down from between her breasts and land in her lap, you’re so tiny she doesn’t notice and you make your way down her pant leg till you’re on the ground. You scramble across the floor till you reach a pair of shoes, you figure not every girl is as cruel as them and that trying to escape is pointless as you’d be stepped on no doubt. You begin to climb up the pant leg of another girl.<br>\r\n<br>\r\nYou’re extremely small so you barely make it far at all before the bell rings and she stands up, the girl leaves and everyone exits the class room, and you somehow manage to avoid getting stepped on, the room appears to be empty, until you see one girl stayed after class, she’s Felecia, a short, busty cute girl, she walks over towards you. “OH MY GOD! IS THAT?!” she bends down and sees you. “oh wow! It is, it’s a tiny little man!” Felecia has a big smile, she reaches down and picks you up carefully and <br>\r\n</span></div></div>",
            "created":1299387600,
            "id":1065525,
            "title":"You slip out of her cleavage during class"
        },
        "11222221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Felecia smiles, and then she opens her lips slightly, she dangles you over her mouth and then drops you, you fall down into her mouth and she quickly swallows you, sending you down into her warm tummy, “ooh he was yummy” </span></div></span></div>",
            "created":1299387600,
            "id":1065530,
            "title":"She swallows you"
        },
        "11222222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Felecia stands to full height, “well you’re basically a bug little guy, you know what I do to bugs?” she asked rhetorically. “I squish em” the last thing you see is Felecia’s foot descending on you, before she squished you under her foot. </span></div></span></div>",
            "created":1299387600,
            "id":1065532,
            "title":"She stands up and steps on you"
        },
        "11223":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Notices it’s you",
                "Doesn’t notice it’s you"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nAllison pulls you out of her Cleavage while the girls are eating lunch. “Hey guys, you’ll never guess what I found today” “what?” asks Adriana “A tiny little man, look” Allison holds you in front of the two girls. “OH MY GOSH!” says Adriana, “he’s soo cute! Can I see him?” Allison drops you into your girlfriend’s hand. She looks down at you and . . .<br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065514,
            "title":"She shows you to her friends and Adriana asks t..."
        },
        "112231":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She swallows you",
                "she feeds you to Allison"
            ],
            "content":"<div class=\"\"><div> <span>“wait guys . . . HOLY SHIT! IT’S MY BOYFRIEND!” Adriana yelled. “What?” Allison and Kathleen looked and noticed it was you. “Oh wow sorry A, I didn’t mean to stuff your boyfriend in my cleavage” Allison laughed. “Oh he always thought you were hot anyway, I’d caught him checking you out. In fact, I think maybe he deserves a little . . . punishment, and since he’s so small, I’ve got a few ideas.” Adriana smiled.  So baby, what am I gonna do . . .</span></div></div>",
            "created":1299387600,
            "id":1065522,
            "title":"Notices it’s you"
        },
        "1122311":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>“You know, I was getting tired of you anyway, but there was always one thing I liked about you . . . I always loved the taste of you” she smiled, “bye bye sweetie, I loved you” Your girlfriend dangles you above her mouth and teases you with her tongue. “mmm, make sure to squirm baby” she drops you and you slide down into her mouth, she plays with you with her tongue for a bit. “down you go” she pushes you down and swallows you, sending you to die inside your hot girlfriends warm belly.</span></div></div>",
            "created":1299387600,
            "id":1065535,
            "title":"She swallows you"
        },
        "1122312":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>“Since you spent the majority of the morning in Allison’s cleavage, with a hard on probably, and you check out other girls all the time anyway, I’m done with you, Allison, you hungry?” Allison smiled “Hehe ya” Adriana looked at you and gave you an evil smirk, “Well good bye sweetie, enjoy Allison’s stomach.” She brought you over Allison’s mouth and dangled you a bit, she lowerd so you were in her mouth but still between her fingers, she drops you and Allison shuts her mouth, she closes her eyes and tosses you around in her mouth a bit. She tilts her head back and swallows, the lick her lips. “Ooh, delicious.” </span></div></div>",
            "created":1299387600,
            "id":1065537,
            "title":"she feeds you to Allison"
        },
        "112232":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Adriana didn’t even notice it was you, her own boyfriend, you cried as the women you loved talked with her friends about how she was going to kill you. “Oooh should I eat him? He looks soo yummy.” Said Adriana. “Ya, I bet he’ll taste great” said Kathleen. Adriana shrugged and carried you into the air and hovered you over her mouth. “Down you go” She drops you. You fall down into her mouth, you land on her tongue and she begins to swirl you around and play with your body before tilting her head back and swallowing, sending you into her warm belly. You die soon inside your girlfriends stomach.  </span></div></div>",
            "created":1299387600,
            "id":1065523,
            "title":"Doesn’t notice it’s you"
        },
        "113":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You manage to not get eaten",
                "You slide down her throat",
                "She coughs you out"
            ],
            "content":"<div class=\"\"><div> <span>As Allison looked closer at you, and began to realize just how small you really were, she let out a very small gasp, and the gust of wind sucks you off the sink and you're shot into her wet mouth. \"Oooh shit, i think i blew him away!\" Allison hadn't even felt you land in her mouth. Before you could react she instinctively swallowed</span></div></div>",
            "created":1305867600,
            "id":1109894,
            "title":"She accidentally inhales you"
        },
        "1131":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She swallows",
                "She pulls you out of her mouth"
            ],
            "content":"<div class=\"\"><div> <span>But you being resourceful manage to climb behind a tooth. You hold on as the air pushes down her throat. Allison soon felt something in her cheek and used her tongue to get it. You felt her tongue scoop you up and toss you back into the middle of her mouth.</span></div></div>",
            "created":1305867600,
            "id":1109898,
            "title":"You manage to not get eaten"
        },
        "11311":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Alison felt something in her mouth. It felt like a soft piece of candy. She used her tongue to pull it out from the back of her teeth and she sucked on and tasted it for a moment. It was delicious, she even let out a very quiet moan of enjoyment when she tasted the small treat. She giggled to herself and let out an audible *gulp* as she swallowed the small snack. She licked her lips and soon, forgot all about the treat she had swallowed. </span></div></div>",
            "created":1306472400,
            "id":1114129,
            "title":"She swallows"
        },
        "1132":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You were sucked down her throat and into her warm belly. Allison felt something slide down her throat. \"Huh. oh eww i think i swallowed a bug\" Allison rubbed her hand against her throat *gulp* she made sure it had went down. \"Oh well, now where did he go\"</span></div></div>",
            "created":1305867600,
            "id":1109899,
            "title":"You slide down her throat"
        },
        "1133":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She feels you",
                "She goes to put a shirt on and squishes you",
                "You slip out of her cleavage"
            ],
            "content":"<div class=\"\"><div> <span>Another girl, Claudia, a short, brunette Latina with a good chest and great ass walked in. Before she can send you to the depths of her belly, Allison's throat rejects you and she coughs until you fly out and land right in between Claudia's tits as she begins to change. \"You okay?\" asks Claudia, Allison nods and leaves the change room. As Claudia continues to change you get pressed deeper into her cleavage. Her big sweaty tits weighing down on you. </span></div></div>",
            "created":1305867600,
            "id":1109901,
            "title":"She coughs you out"
        },
        "114":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She hadn't felt you ",
                "She felt you",
                "You were slipping"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison begins to stand up, and her big D cup tits hit the edge of the sink you were standing on. You were pulled off the sink and descended into Allison's sweaty bosom. As you became trapped between her tits you realize</span></div></span></div>",
            "created":1305867600,
            "id":1109896,
            "title":"She stands up and her tits hit the edge of the ..."
        },
        "1141":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You land in front of a shoe",
                "You land in an open bottle of water",
                "You land somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>that you were so small she hadn't even felt you land comfortably between her giant breasts. Alison looked back at the sink. \"Huh, where'd he go?\" you hear her say. You pound against her breasts hoping she would feel you but unfortunately she continued to look around for you, not even feeling you struggle in her cleavage. Alison left the change room and her bosom bounced as she walked down the hall, You were tossed all around inside her cleavage and eventually landed at the back of her chest where her tits met her ribs and you were stuck between her two giant boobs. Alison proceeded to her classes, you remained trapped inside her sweaty cleavage all day as she went to math, and science class. Finally she had gym, and went right back to the changing room. She stripped down to her bra and panties and on went a pair of tight booty shorts, and a low cut tank top. You peered out from the crease of her tits and heard the instructor order them to run laps. Your whole world began to shake as she jogged around the track. Her breasts bounced up and down and up and down and you were thrown about like a rag doll. The sweat began to trickle down her breasts and you slowly began sliding out of her cleavage. You had realized long ago that pain didn't work the same way at your size and neither did breaking bones or other injuries. You fell from the sweaty embrace of Alison's tits and as you fell, her hand was swinging with the rhythm of her jog, and she accidentally smacked you, sending you flying. </span></div></div>",
            "created":1306645200,
            "id":1115563,
            "title":"She hadn't felt you "
        },
        "11411":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You feel pressure as her tit's get pushed together",
                "You're pulled out during lunch"
            ],
            "content":"<div class=\"\"><div> <span>As you landed on the ground, a sandle was right in front of you. As you looked up to see who it belonged to, you couldn't, whoever it was, they were so big chested that their face wasn't visible from the ground. But she wore booty shorts and was filling her nails, apparently not a gym person. You climbed up onto her sandle and began scaling her toes. You reached her shorts after 20 minutes and you held on for dear life as she started walking to class. She sat down, and you fell, landing right down her shorts, and in front of her white lace panties. She felt you, and light poured into the panties as she lifted you out and you saw her look of awe and disgust. \"What the fuck! a little man!? What the fuck were you doing in my panties you little pervert!\" she yelled. Felecia, that's who the girl was, she slowly brought you right up to her face. She hovered you in front of her lips and gave a look of disgust, then let you go. She felt you land right in her cleavage. She tucked you in tighter and looked down, \"I'll deal with you later\" she said. And then she pulled her shirt up, descending you into darkness from down in her tits. </span></div></div>",
            "created":1306705620,
            "id":1115654,
            "title":"You land in front of a shoe"
        },
        "11412":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You fell out of the mouth of the bottle",
                "She drinks you"
            ],
            "content":"<div class=\"\"><div> <span>You became soaked, you had landed in a large body of water, and you struggle to stay at the top so you didn't drown. But then all of a sudden the bottle began to move and the whole thing tilted. you were sent into a confusing struggle as you found the new pocked of air. But at the mouth of the bottle, you saw two pink lips and you began to slide towards them along with the rest of the water. You could recognize the girl about to drink you as Nicole. You noticed she was beginning to pull the bottle away from her mouth. </span></div></div>",
            "created":1306706580,
            "id":1115664,
            "title":"You land in an open bottle of water"
        },
        "1142":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Alison",
                "Justine",
                "Nicole"
            ],
            "content":"<div class=\"\"><div> <span>That she had felt you collide with her huge boobs and land in her cleavage. \"Huh, where did he . . .\" Alison started to giggle and you looked up and saw her cute stare as she watched you struggle down in her cleavage. \"Aww, you're so cute down there\" she commented. Alison jumped, causing her tits to bounce like crazy. You sunk deeper down in her shirt and this only caused her to laugh even more. As you became trapped in her tits she slowly dipped her fingers into her cleavage and pulled you out gently. \"You're sooo cute\" she said with a big smile. You struggled to get out of her grip and she laughed at your pathetic attempt to escape. You managed to struggle enough that the scruff of your shirt that she was holding you by ripped, and you plunged back into her cleavage. \"Wow, you must really like my tits\" she said giggling. Alison playfully pushed her tits together, rolled them against each other and made them bounce. You were tossed around inside her shirt like a bug. You accidentally slipped into her bra and the sweat caused you to slide down so you were trapped under her breast, caught between the boob and bra. Alison smiled and pushed her breasts together again.  You remained trapped there for awhile, unaware of what was going on outside. You finally saw light again when Alison was alone in a small hallway. She pulled you out and in her hand, she had a small plastic container with sprinkles, She winked and dropped you into the container. <br>\r\n<br>\r\n  Alison sat down with her friends, Justine, and Nicole. They all finished their lunches pretty fast, and now the three girls had the school's small cup of ice cream as desert. \"Hey, i brought sprinkles\" said Alison, setting you and the plastic container on the table. You knew what would be your fate when one of the girl's reached for it. </span></div></div>",
            "created":1306645200,
            "id":1115582,
            "title":"She felt you"
        },
        "11421":{
            "author_id":"finalesrest",
            "author_name":"Finale's Rest",
            "content":"<div class=\"\"><div> <span>It felt like less then a second before you found your new surrounding of sprinkles unceremoniously flipped upside down, and the pull of gravity's cruel wrath sending you back out into the unforgiving world. Now, freefalling toward a frosted dessert at what seemed to be mach speed, you couldn't help but feel, that this wasn't what you signed up for, not today and well not EVER. Your thoughts were so rudely interrupted by the sensation of your face meeting a chilled surface, soft enough not to kill you, but solid enough for you to suffer from what would could be a minor concussion, not that getting a doctor's professional opinion was really viable, nor top priority at the moment. Getting your bearing atop the delectable glacier you met with the face of the girl who would ultimately try to end your precious existence, and as fate would have it, it was Alison. Yes, after all this was her idea, this situation was all of her construction, so naturally she would hold the ice cream you land in.<br>\r\n<br>\r\nFor the briefest moment.... a microsecond, fitting your micro size, you held a belief that maybe, just maybe you could perhaps escape this ice cream, and survive this encounter. This moment was dashed as soon as your eyes were irrevocably locked in a life ending stare with Alison. Before you could even go through all five stages of grief., before even hitting denial about the situation you found yourself rising up. Rather than sully the experience of going through the spoon to claim her prize, Alison decided to take the more intimate approach and released her tongue; as Alison's tongue flew out like a bat out of hell the it darted forward, the light of above you was blotted out, the tongue's shadow mirrored its physical counterpart and enveloped you. With one simple lick, you were body became stuck to the tongue. Your sight became a wall of flesh, more endless than anything that could be comprehended, and with everything changing the only thing you could know for sure is that she had taken another lick of the ice cream while you were already on there, as if to enhance the area for her tongue to have its way with. It was right after this that the last lights off life and were smothered out for you, and that you were destined to be food for this girl, never to feel the warmth of the sun ever again, instead you were to experience your last moments in a blur of black and pink dancing in front of you.<br>\r\n<br>\r\nThe feeling of ice cream rapidly melting inside the most humid place and warm place possible assaulted you from all sides, and the dairy product rapidly diminished leaving your body sticky and suffering from a case of hypothermia, that would normally be life threatening if things were \"normal\". With the remaining puddle of ice cream you were sent cruising, by way of tongue launcher throughout the seemingly endless cavern, hitting stalactites, stalagmites, the ceiling, and all manner of walls before the tongue decided to more accurately show you around every aspect of the mouth like it was giving a tour guide. You went from just being a ice cream to being an ice cream sandwich as you found yourself in between the cheek of her mouth and her tongue, pushing you out, Alison's tongue fully extended. Falling from this position back onto the waiting tongue, your body was contorted as her tongue curled all around you, as if giving you the taste seal of approval, and then for a lingering moment everything stopped. Then, for one final time, her tongue launched you to the roof of her mouth and the world began to tilt slightly, changing her tongue into a fatal slide. Slowly the slide became more and more slanted, until the ability to oppose it became insurmountable and your final fall had begun, a fall that could not be more perilous. As you travelled through the throat, at breakneck speeds, and hit the stomach acid full speed, you neck did in fact break on contact, ending your misery forever. Slowly in that stomach you would be like the rest of the food, but in Alison's mind she will always remember the feeling of eating a human being live, and try to replicate with small candies just to feel it once again. And that dear viewers leads us to.........</span></div></div>",
            "created":1464182160,
            "id":2153710,
            "title":"We all Scream in Ice Cream"
        },
        "11423":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She says no",
                "She says sure"
            ],
            "content":"<div class=\"\"><div> <span>Your hopes sunk as Nicole picked the container of sprinkles off the table. Your whole world tossed as you were turned upside down. You heard the girl's laughing and talking. You saw through the hole, Nicole's bowl of ice cream. As she started shaking the container, you were shoved out and landed in the gooey bowl of vanilla ice cream. You sunk and struggled to keep your head above air so you didn't drown. You looked up and saw a huge metal object dip into the bowl. It scooped up a large chunk of white goop and Nicole slid the spoon in her mouth. It looked like she had devoured a mountain. You tried to swim through the goo and reach the edge. You caught Alison's eye, she was looking right at you and even mouthed the words \"Bye bye\" She winked and kept talking to her friends. You looked behind you and Noticed the spoon coming for you again. You were scooped into her spoon, but as she brought it closer and closer to her lips, Justine said something. \"Ooh, can i have a bite?\" she asked. </span></div></div>",
            "created":1306721160,
            "id":1115807,
            "title":"Nicole"
        },
        "114231":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>\"Hold on, lemme finish this bite\" says Nicole. You see her lips open and the spoon slide onto her tongue. You're pushed inside her hot sweaty mouth and the ice cream begins to melt as she pushes bit by bit of it down her throat. Finally you feel yourself being pulled to the back of her mouth and then ultimately, swallowed. <br>\r\n<br>\r\n   Nicole swallowed her bite of ice cream. \"How are the sprinkles Nicky?\" asked Alison. \"Mmm, so good\" she answered. Alison Giggled. \"Good, i added something to them to make them better\" </span></div></div>",
            "created":1306721340,
            "id":1115810,
            "title":"She says no"
        },
        "114232":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She was just listening to her friend, she eats you",
                "She seems to notice you"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure, open up\" You hear Nicole say. All of  sudden, you're no longer in front of Nicole's mouth, but Justine's instead. You see her mouth get closer and closer but then the ice cream topples off the spoon and you fall. The white ice cream land's down Justine's shirt and you slide down between her breasts, it was only a small chunk, HUGE to you, but small to them. In fact, to them it looked like a sprinkle that just was covered in ice cream was all that fell. \"Huh\" Justine plunged her fingers into her cleavage and plucked you off her tit. She was about to bring the sprinkle to her mouth but she stopped right at her lips. </span></div></div>",
            "created":1306721880,
            "id":1115819,
            "title":"She says sure"
        },
        "1142321":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>She hovers you over her mouth for a moment, and you look down into the dark void of her mouth. Seeing her huge pink tongue move around, just waiting for you to drop and send you down the path of her throat, past her breasts and into her stomach. Suddenly Justine's grip disappeared and you fell, colliding with her wet tongue and being quickly sucked down her throat. You fell but managed to hold on to the inside of the throat, if only for a brief moment, before her throat pulled you down. <br>\r\n<br>\r\n  Justine dropped the sprinkle into her mouth and swallowed. She felt it get stuck for a moment and she placed a hand on her throat and there was a loud *gulp* as she swallowed it indefinitely. \"Hmm, that sprinkle felt like it didn't wanna go down\" said Justine. Alison giggled. </span></div></div>",
            "created":1306722120,
            "id":1115822,
            "title":"She was just listening to her friend, she eats you"
        },
        "1142322":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Alison moves you to Nicole's cleavage",
                "Alison feeds you to Justine"
            ],
            "content":"<div class=\"\"><div> <span>Justine could swear her sprinkle moved, she brought it up to her eye and suddenly her expression became amazement. \"GUYS, IT'S ONE OF THOSE SHRUNKEN GUYS FROM CHEM!\" she exclaimed. The other girl's gathered around. \"wow, he's so cute!\" said Nicole. \"Hmm, what should we do with him?\" asked Alison. Justine looked you over for a moment. \"Well, who has the biggest tits here?\" she said. Alison raised her hand. \"Double D\" she said smiling. Justine laughed. \"Well if you enjoyed MY tits, wait till you see Alisons\" said Justine. Alison giggled, knowing that you were already quite familiar with her boobs. You now looked down at a sight from not 10 minutes ago, Alison's cleavage. You fell and were caught between those giant mounds of flesh and plunged into the deep darkness of Alison's bosom. \"I'm sure he's very comfy\" said Alison with a smile. </span></div></div>",
            "created":1306722480,
            "id":1115825,
            "title":"She seems to notice you"
        },
        "11423222":{
            "author_id":"finalesrest",
            "author_name":"Finale's Rest",
            "content":"<div class=\"\"><div> <span><span class=\"cplum\">\"Okay, Okay\"</span> Justine said while jiggling you furiously inside her cleavage, <span class=\"cplum\">\"This is fun, but there is only SO much fun we can have with a sprinkle!\"</span> She laughed, stopping her self and in turn her breasts. <span class=\"cplum\">\"We are eventually going to have to get rid of this sprinkle... so what are we going to do? I think that as fun as this is.... Justine you need to finish your food\"</span> Suddenly Justine got up and as you gravitated upwards you got a very distinct view of Justine's open maw. You were given exactly no time as you found yourself airlifted toward the chasm that is Justine's mouth and began falling toward said chasm. The impact of the your body on her tongue was sudden, but not unpleasant. The feeling of her tongue on your body all over, this ravenous beast the size of a subway having its way with you, was frightening, but it had this intimate feeling, that could not be placed, this full embrace felt sensual in every way. This feeling of complete stimulation from all sides, kept rising even as her tongue slowed and she began slowly savoring every single stroke of her tongue on his skin. This went on for another endless 30 seconds, before the inevitable plummet reared its head forward... as in she literally reared her head forward and began to swallow. The long slide as you slowly descended down the tongue toward the back of the throat, was maddening, as you attempted to stop it, but it was an ultimately futile effort, as was any resistance at this point. You were swallowed whole and your life was extinguished in  Justine's stomach fulfilling the destiny of a sprinkle. And that dear view leads us too....</span></div></div>",
            "created":1466152860,
            "id":2165570,
            "title":"The Destiny of a Sprinkle"
        },
        "12":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She hides you in her mouth",
                "She hides you in her Cleavage",
                "Puts you on her palm, and flicks you like a bug"
            ],
            "content":"<div class=\"\"><div> <span>You assume it’s best to hide, so you run behind the faucet. Allison walks up and turns on the water, the enormous sound of the running water almost deafens you, you start to try and get away from the sink but some water splashes and you slip down into the sink. <br>\r\nAllison notices you fall. “What’s that?” you try to look up but you’re immediately plucked between her soft fingers, and brought into the air. “It looks like a bug” You look into her eyes and scream. “ALLISON, IT’S ME!” she barely hears you. “Oh my gosh! It’s a tiny little man!” <br>\r\n<br>\r\nThe door opens again and Allison panics and . . .<br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065488,
            "title":"Hide behind the faucet from her"
        },
        "121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Allison giggles and tells Megan about you, who convinces her to swallow you",
                "Allison accidentally swallows you",
                "She says no and waits for Megan to leave, then pulls you out of her mouth"
            ],
            "content":"<div class=\"\"><div> <span>Allison, wanting to keep her discovery a secret, panics and hides you in the first place she can think of, her mouth. She drops you in and slides you under her tongue, you’re covered in the warm embrace of her wet mouth and her large tongue. It begins to move wildly and light shines into her gullet as she talks to the other girl. <br>\r\n<br>\r\n“Oh hey” Says Allison. The other girl, Megan, smiles. “Hey guess what” she says. Allison listens, “what” “some girls in science actually found a way to shrink people and tested it on a bunch of guys across the street, me and some friends found a bunch and have been playing with them, want one?” Asks Megan. <br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065492,
            "title":"She hides you in her mouth"
        },
        "1211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>“some girls in science actually found a way to shrink people and tested it on a bunch of guys across the street, me and some friends found a bunch and have been playing with them, want one?” Allison smiles, “Actually it’s funny you mention that, I just found one in this bathroom, he was on the sink, he’s sooo tiny, I hid him in my mouth when you walked in”  Megan laughs, “Oh my gosh, you should totally swallow him!” she says. Allison looks surprised. “Really?” “Hehe ya, they’re like half a centimeter tall so they wouldn’t be hard to swallow, and I ate one, they taste so good, and it’s so cool when they squirm down your throat.” Allison thinks for a second and then smiles. “Hehe, okay” She sticks out her tongue with you on it, showing you to Megan, who laughs. Her tongue darts back into her mouth. “Bye bye little guy” says Allison, You feel her tongue throw you into her throat, and she swallows you. “Mmm, wow he was yummy” Allison said rubbing her stomach. “I told you” </span></div></div>",
            "created":1299301200,
            "id":1065500,
            "title":"Allison giggles and tells Megan about you, who ..."
        },
        "1212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Allison begins to talk to the other girl. “some girls in science actually found a way to shrink people and tested it on a bunch of guys across the street, me and some friends found a bunch and have been playing with them, want one?” Allison gets surprised by this, and accidentally, she swallows you whole, “oh my gosh oops” Megan looks at Allison confused. “What?” Allison giggles. “I actually had found one of those little guys In here and I hid him in my mouth when you came in, but I just accidentally swallowed the poor little guy” Megan laughed, “hehe, oh well, they’re tasty though aren’t they?” Allison nodded and giggled.<br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065501,
            "title":"Allison accidentally swallows you"
        },
        "1213":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Lifts her panties and tells you to go down to her pussy",
                "orders you to walks up between her breasts, towards her face"
            ],
            "content":"<div class=\"\"><div> <span>You hear Allison talk for awhile, and then the girl leaves and you’re pulled from her hot mouth and she dangles you in front of her. “Okay little guy, you’re coming home with me, I don’t know what I’m gonna do with you just yet, but I’ll decide later, for now, back in you go.” She drops you into her mouth and tucks you under her tongue. Allison leaves and after hours during the day of being in her mouth, she finally gets home.<br>\r\n<br>\r\nShe goes to her bed room and spits you onto her hand. “Now, let’s see, what should I do . . . OOH OOH I have an idea.” Allison strips down to her bra and panties, and lays down on her bed, she sets you on her stomach and smiles at you. She<br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065502,
            "title":"She says no and waits for Megan to leave, then ..."
        },
        "12131":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Allison lifts up her panties, “go” she orders, you march towards her pussy and under her underwear, she lets go and your pushed down my her panties into her pussy. You fall right into her hole. Allison slides her fingers to her wet pussy and slips two fingers in behind you, she pushes you deep into her pussy and fingers herself hard and fast, you eventually drown from her cum and die inside her vagina. </span></div></div>",
            "created":1299301200,
            "id":1065515,
            "title":"Lifts her panties and tells you to go down to h..."
        },
        "12132":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>“walk towards my face” she said, you began to walk up her stomach, and then between her cleavage, her giant mountain sized breasts smelled sweet, as you reached her chin, Allison tilts her head down and sucks the air around you, sucking you up into her mouth. Allison tilts her head back and closes her eyes, swallowing you.</span></div></div>",
            "created":1299301200,
            "id":1065516,
            "title":"orders you to walks up between her breasts, tow..."
        },
        "122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Allison tells Megan about you and convinces her to squish you between her tits",
                "Allison says no and waits for the girl to leave"
            ],
            "content":"<div class=\"\"><div> <span>Allison, wanting to keep her discovery a secret, panics and hides you in the first place she can think of, her cleavage, she drops you into her shirt and you slide down between her breasts, her tight bra keeps you suspended in the pocket her tits form. You hear Allison start to talk to the girl who walked in. <br>\r\n<br>\r\n“Oh hey” Says Allison. The other girl, Megan, smiles. “Hey guess what” she says. Allison listens, “what” “some girls in science actually found a way to shrink people and tested it on a bunch of guys across the street, me and some friends found a bunch and have been playing with them, want one?” Asks Megan. <br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065493,
            "title":"She hides you in her Cleavage"
        },
        "1221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>“some girls in science actually found a way to shrink people and tested it on a bunch of guys across the street, me and some friends found a bunch and have been playing with them, want one?” Allison smiles. “Actually I already found one, look” Allison showed Megan her chest, and she noticed your tiny body being clenched by her tits. “Oh wow” Allison giggles. “ooh ooh, you should squish him between your tits, it’s probably like every guys dream of the best way to die” Megan laughed. “hehe, I guess, you think I should?” Megan nods, “ya I squished a few with my boobs, it feels cool when there bodies pop in your cleavage.” Megan undid a few buttons and showed the tiny red blood stains from the men she had crushed with her boobs. “See?”<br>\r\n<br>\r\nAllison got a wide smile, “hehe ya I bet he’s going to enjoy this” Megan nodded and watched. Allison placed one hand on each of her breasts and began to push them together, you felt her breasts get closer and closer, the pressure of them squishing you was so great, that finally you pop between her tits. “Awe, he popped like a grape right between em”<br>\r\n</span></div></div>",
            "created":1299301200,
            "id":1065503,
            "title":"Allison tells Megan about you and convinces her..."
        },
        "1222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Allison talks to the girl and after awhile, she leaves, and she looks down her shirt at you. “I’m sure you enjoyed that little man, but that girl made me think, so I’ve decided to get rid of you and go find some other tiny men to play with.” You scream, which makes her laugh. “Oh don’t be so scared, it wont hurt . . . much” Allison placed a hand on each of her giant breasts and began to slowly push them together. As you look up you struggle to escape the grasp of her massive tits but it's no use. The gap between her breasts slowly gets smaller and smaller until you can't see her face anymore and your whole world goes dark as you're squished like a bug between her breasts. Alison felt a tiny pop and released her boobs, she looked down to see a very tiny red stain in her cleavage. She giggled and adjusted her bra, and walked out of the washroom. </span></div></div>",
            "created":1299301200,
            "id":1065504,
            "title":"Allison says no and waits for the girl to leave"
        },
        "124":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She knocks you off her necklace",
                "She picks you off her necklace"
            ],
            "content":"<div class=\"\"><div> <span>Alison quickly placed you on her palm and used her ginger to flick you, You were sent flying and you watched Alison casually walk out of the room. Mattie, and another girl Madison, both walked in. You were heading right for Mattie. You collided with her lower neck and slid down her chest. You scrambled and caught on to her necklace. You were now hanging above Mattie's cleavage. \"Mattie, what's that?\" asked Madison, noticing you on her necklace. Mattie looked down and saw you. \"OH MY GOSH\" Mattie giggled loud and smiled. \"I thought Megan was joking, they really did shrink some of the guys!\" Mattie and Madison laughed. \"But how did you get there little guy?\" Mattie lifted you up to her face. \"Hmm, Madison, i don't think he liked my chest, maybe he'll like yours better\" Mattie dropped you onto Madison's necklace. Her's was much longer, and it actually dipped into her cleavage, You were now hanging in between Madison's D cup tits and hanging on for dear life. \"Awe, he's so cute\" said Madison. </span></div></div>",
            "created":1306645200,
            "id":1115593,
            "title":"Puts you on her palm, and flicks you like a bug"
        },
        "1241":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She dangles you over Madison's mouth",
                "She slowly pushes her breasts together",
                "She knocks you down her shirt and you land at her feet"
            ],
            "content":"<div class=\"\"><div> <span>Madison gently plays with the necklace, swinging it back and forth, causing it to knock into each of her large tits. You eventually lose grip and you fall,  landing at the base of her breasts and caught right between theme. You struggle like crazy and the girl's giggle. \"CLIMB\" order's Madison. You obey and start to climb up through her cleavage. Her sweat makes it more and more difficult to climb up. You eventually get to her necklace and Madison plucks you out of her shirt. She brings you over to Mattie who winks and suddenly Madison drops you back into Mattie's cleavage. You land right on her left tit and Mattie giggles</span></div></div>",
            "created":1306645200,
            "id":1115605,
            "title":"She knocks you off her necklace"
        },
        "12411":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Mattie smiles and plucks you right off her tit, She slowly brings you over to Madison. \"Madison, you hungry?\" asked Mattie with a big smile. \"Hmm, i think i am\" said Madison, while playfully opening her mouth and sticking her tongue out. Mattie dangled you right above Madison's open mouth, \"bye bye little guy\" said Mattie, She dropped you, and you landed right on Madison's wet tongue. She barely gave you time to realize what happened. Before you knew it you were sucked into her mouth and Madison sat you on her tongue. \"Good?\" asked Mattie. Madison's eyes closed and there was an audible *gulp* as she swallowed.  Madison smiled. \"Mhm\" she said. Mattie laughed, and Madison licked her lips, \"i wish there were more\" she giggled. <br>\r\n</span></div></div>",
            "created":1306645200,
            "id":1115619,
            "title":"She dangles you over Madison's mouth"
        },
        "12412":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Mattie slowly started pushing her breasts together, causing you to slide down the side of her tit and land comfortably tucked between her breasts. But the pressure didn't stop, her boobs kept getting closer and closer. You felt your arm break, and then both your legs, and then thing's started going black.<br>\r\n<br>\r\n  Mattie pushed her boobs together, she felt the little man struggle but it only made her laugh. She felt a small pop and a bit of moisture touch her tits. She released her grip and looked down. The tiny man was dead, and his barely noticeable blood stain was all that remained, he was only a millimeter big, so he looked like a squished bug. \"Awe\" said Mattie. She used her finger to wipe her cleavage clean and licked her finger clean afterwards. \"What a way to go\" said Madison, and the girl's shared a laugh. </span></div></div>",
            "created":1306645200,
            "id":1115631,
            "title":"She slowly pushes her breasts together"
        },
        "12413":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Mattie flicked you, and you fell, right down her shirt, for a moment, you were stuck to her tit on the inside of her cleavage, but Mattie shook her chest and you plummeted to the ground. You landed right at her feet, and soon you were looking up and Madison and Mattie, you couldn't even see Madison's face past her tits and Mattie you just barely see her chin. \"CLIMB\" ordered Madison, pointing to her feet. You stumbled over to her toes and began to scale her foot, one toe was like a house, so it took you 5 minutes just to get on top of her toe. Madison tapped her other foot in impatience. You collapsed from exhaustion and then suddenly felt someone's fingers grasp you. You watched as first you passed Madison's legs, then her crotch, stomach and finally her huge boobs, you were now level with them, Madison brought you closer to her chest, until you were right above her cleavage, the darkness below seemed to go on forever.<br>\r\n<br>\r\n    Madison hovered the tiny guy above her tits, and dropped him. She barely felt him as he landed somewhere down her shirt. \"Good luck\" she called. Madison buttoned up her shirt, and the girl's went about their day, Madison assumed that at some point he would be crushed between her tits. </span></div></div>",
            "created":1306645200,
            "id":1115639,
            "title":"She knocks you down her shirt and you land at h..."
        },
        "1242":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Madison picked you off her necklace and brought you into her air. She examined you and smile crossed her face. \"Hmm\" she said \"i have an idea, Mattie,\" Madison began to bring you close to Mattie's face. \"Open up\" She said with a giggle. Mattie slowly opened her mouth and her eyes focused on you like you were a snack.  She teased you by moving her tongue all about. \"Careful, don't fall\" she said laughing. Madison then let out a quiet \"oops\" and you fell, landing right on Mattie's tongue. You didn't have much time to react. You saw Madison laugh and you were plunged into darkness, you sat on her wet tongue for a only a few moments, before the whole mouth tilted up and you slid, right down her throat. <br>\r\n<br>\r\n    Mattie smiled as she tossed the tiny man around in her mouth a bit before sitting him in the middle of her tongue. \"Is he still in there?\" Asked Madison. Mattie didn't say anything, her head tilted up slightly and there was a loud *gulp* as Mattie swallowed. \"Awwwweeee\" said Madison laughing. \"Poor guy\" she said with a smile. \"Mmm\" Said Mattie. She licked her lips and placed her hand against her throat and there was another *gulp* as she pushed him down her throat into her belly. \"He didn't wanna go down\" she said gigging. Mattie rubbed her stomach. </span></div></div>",
            "created":1306645200,
            "id":1115610,
            "title":"She picks you off her necklace"
        },
        "13":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Alison objects, and wants to keep you safe",
                "Alison agrees, and they think of what they're gonna do with you",
                "You run and jump off Felecia's hand, and accidentally land down Alison's shirt",
                "Alison leans in to get a better look at you, and accidentally inhales you"
            ],
            "content":"<div class=\"\"><div> <span>As Alison approaches the sink, another girl enters the bathroom. She is shorter than Alison and has shoulder length black hair, and is VERY busty. \"Hey feesh\" says Alison. \"Hey\" answers Felecia. The two girls go to the sink to mix their makeup. You stare up at their massive sizes in awe. Felecia drops her brush for a moment and leans over. \"Huh?\" she says, as she appears to look right at you. \"What?\" asked Alison. Felecia carefully reaches for you, and plucks you between her fingers. \"Alison, look\" She brings you up, and holds you in her palm, showing her friend. \"One of those guys that they shrunk across the street must have escaped\" Alison leaned in to get a better look at you. \"Oh wow, he's so tiny\" Felecia giggled. \"You know, it's probably best we dispose of him, i'm sure Megan and the other girls wouldn't want any of them loose\" she said. \"Whaaat! But he's sooooo cute, we can't hurt him Feesh\" Felecia scoffs. \"Sure we can, and we can make it enjoyable, i heard they killed them in sexual ways so the guys would enjoy it.\" Alison looked skeptical. \"Well....\"</span></div></div>",
            "created":1301634000,
            "id":1080275,
            "title":"Another Girl enters the bathroom"
        },
        "131":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "snatches you from Felecia",
                "Doesn't stop her, Felecia leaves with you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"NO, we can't hurt the pour guy\" Felecia rolls her eyes. \"Fine i will\" she says. Alison </span></div></span></div>",
            "created":1301634000,
            "id":1080277,
            "title":"Alison objects, and wants to keep you safe"
        },
        "1311":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Alison goes to sleep, with you still in her cleavage",
                "Alison bends over to pull off her pants, and you fall out of her cleavage",
                "Alison stretches, causing her breasts to squish together."
            ],
            "content":"<div class=\"\"><div> <span>Alison quickly plucks you off Felecia's palm. \"WE ARE NOT GOING TO HURT HIM!\" Felecia scoffs and storms out of the room. Alison looks down at you and smiles, soon you're being tucked comfortably in Alison's cleavage. \"Sorry, i don't have any pockets little guy, but you'll be safe down there\" you nod, hell like you're gonna object to being in between the biggest boobs you'll ever see. Alison walks out of the bathroom, you remain snug in her shirt for the rest of the day. And Alison brings you home. By the time she's home, Alison walks to her room, she's almost forgotten you are in her cleavage, and she starts to undress. </span></div></div>",
            "created":1301634000,
            "id":1080314,
            "title":"snatches you from Felecia"
        },
        "13111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Alison inhales you as she sleeps",
                "You climb up to her lips"
            ],
            "content":"<div class=\"\"><div> <span>Alison, forgetting you were still in her cleavage, stripped down to her bra and panties and slipped into bed. You remain trapped between her giant warm breasts. The hot flesh held you perfectly. Since it was summer, she slept without blankets. So during the night, you finally manage to slip out the top of her boobs because she was sweating and it made her breasts moist enough to squeeze between. You pop out of her cleavage and land just below her neck. Alison is breathing rather heavily, so you're careful as you walk up her neck to her face, but you need to get her attention and wake her up, to remind her you're here.</span></div></div>",
            "created":1301634000,
            "id":1080328,
            "title":"Alison goes to sleep, with you still in her cle..."
        },
        "131111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>As you reach Alison's neck, she breaths in lightly, unfortunately, the gust is extremely strong. You feel yourself being sucked up towards her mouth, you can't resist and you're sucked into her wet mouth, and quickly, Alison instinctively swallows you. Alison rolled over, and swallowed again, subconsciously making sure her little snack made it's way to her belly. \"Mmm\" she said in her sleep. Licking her lips, Alison continued to sleep soundly, unaware that she'd eaten you.</span></div></div>",
            "created":1301634000,
            "id":1080353,
            "title":"Alison inhales you as she sleeps"
        },
        "131112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She opens her mouth as you cross, swallowing you",
                "You make it to her eyes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You climb up to her lips, you can't walk across her cheeks, as the slope would be too difficult to cross, so you time her breathing and wait to run across her lips when they're closed. You see her close them and you sprint it</span></div></span></div>",
            "created":1301634000,
            "id":1080356,
            "title":"You climb up to her lips"
        },
        "1311121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You begin to run, but Alison opens her mouth halfway through, and you slip, and fall down her open mouth, You slide down her tongue and Alison swallows you as she sleeps. Alison sits up. She giggles \"I'm such a bitch\" She traced your descent to her belly with her finger and licked her lips. \"But he was tasty\" she giggled again and laid down, falling back asleep. </span></div></div>",
            "created":1301634000,
            "id":1080359,
            "title":"She opens her mouth as you cross, swallowing you"
        },
        "1311122":{
            "author_id":"toddingram",
            "author_name":"ToddIngram",
            "choices":[
                "She puts you back in her cleavage",
                "She puts you on her windowsill"
            ],
            "content":"<div class=\"\"><div> <span>You sprint for it. Just as you reach her top lip, she yawns. Startled, you fly off her top lip. You're flipping in midair from the force, and you twirl in the direction your going, so you can't see what you're headed for. You hit some hard flesh and bounce a bit. Looking down, you notice you are on the tip of her nose. Smiling that you are still alive. you slide down her nose like a playground slide, and walk to her left eye. You pull her upper lid far enough to see her eye (a  huge ordeal) and finally she stirs. Unfortunately, she sits up, sending you falling down. But you are ready this time. You spin around quick as lightning and hang on to her chin just in the nick of time. She feels you, and picks you up in her fingers to look at what woke her up.<br>\r\n\"Huh..? Oh god, it's you! The kid I saved today!\" She looks shocked. \"I'm so sorry, I forgot all about you! Are you okay?\"<br>\r\n\"yeah\" you reply. \"It was a bit hard to wake you up, but other than that I'm fine.\"<br>\r\n\"Oh, I am so so sorry,\" she says, shaking her head. <br>\r\n\"it's alright, it's alright\" you say, She perks up a bit at your approval.<br>\r\n\"Well, gosh, I guess you need somewhere to sleep, huh?\" She smiles very, very sweetly. Not a bitch smile that would lead to some prank, but a really nice smile.<br>\r\n\"But where?\"</span></div></div>",
            "created":1316730540,
            "id":1192743,
            "title":"You make it to her eyes"
        },
        "13111221":{
            "author_id":"toddingram",
            "author_name":"ToddIngram",
            "choices":[
                "Go on a walk, with you in her cleavage",
                "Go on a walk, with you somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>\"Do you mind going back in my cleavage? I know you've been there all day...\"<br>\r\n\"No, no, it's fine, it's okay.\" you say. She smiles, the sweetest smile you've even seen, and gently lowers you into her cleavage again.<br>\r\nYou squish your way down until there's enough warm flesh on either side of you to keep you comfortabl, but enough air to breathe.<br>\r\nYou hear her fall asleep again. Her soft breathing moves your fleshy tit bed around in a very rocking motion that puts you right to sleep.<br>\r\n<br>\r\nIN the morning, she wakes up before you do. You feel a shaking on either side of you and wake up. She looks down on you with a smile.\"<br>\r\n<br>\r\n\"Good morning, little guy.\" She waves.<br>\r\n<br>\r\nYou smile, and push her war up her cleavage so you can see her better. You can  see her giggling as you do, in a really cute and sexy way.<br>\r\n<br>\r\n\"Good morning\" you say back. Allison really is a cutie. You are a lucky guy to be where you are.<br>\r\n<br>\r\n\"SO, there's no school today\", she says, with a bit of a playful tone. \"So, what do you want to do today?\"</span></div></div>",
            "created":1317086940,
            "id":1195728,
            "title":"She puts you back in her cleavage"
        },
        "131112211":{
            "author_id":"keepitmoving",
            "author_name":"Keepitmoving",
            "choices":[
                "Get back to your new home safely and watch TV on your owners lap",
                "You fall out of her cleavage and she doesn't notice."
            ],
            "content":"<div class=\"\"><div> <span>\"I could really use some fresh air. Could we go on a walk with me in your cleavage?\" You say. \"Sure cutie, let me change my bra and panties and get some clothes on and we can go. I'll put you in my underwear drawer while I change.\" She gets up and plucks you out of her cleavage and places you in a giant bra in her underwear drawer and grabs another bra and pair of panties before closing you in. After a while your drawer opens up and you see Alison in a running shirt zipped down to display her breasts. She smiles down on you and says \"Goodness, your so cute. I love you.\" Your picked up and tucked back in her cleavage. She goes out of her room and down her stairs and out the door. It's early in the morning so she's not worried about you getting spotted in her cleavage. After riding between her breasts for a while she looks down at you and says \"So, not that you'll have any choice in it, but what do you say about being my pet from now on?\" \"I think I would love that.\" \"That's great! Your my new pet now.\" She smiles very sweetly. \"Let's start heading back home. We can watch some TV together.\"</span></div></div>",
            "created":1355895480,
            "id":1490868,
            "title":"Go on a walk, with you in her cleavage"
        },
        "13112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She chokes on you",
                "She swallowed you"
            ],
            "content":"<div class=\"\"><div> <span>Alison walks over towards her nightstand, and she bends over to slide off her pants. Her breasts part as she bends down, and you fall from her tits. You fall through the air, before landing in a small glass of water. You struggle to get back to the surface, but when you look up, Alison is picking up the very glass you're in! Alison brings the cup to her mouth and begins to slowly drink. You are pulled towards her lips and you struggle against the current. As you finally reach her mouth you slip between her lips and into her mouth. Alison quickly swallows the water and sends you down her throat.</span></div></div>",
            "created":1301634000,
            "id":1080342,
            "title":"Alison bends over to pull off her pants, and yo..."
        },
        "131121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Alison's older sister, Amy walked in the room. Alison swallowed her water but something got caught in her throat and she choked, spitting it out. As Alison spits you out, you soar towards her older sister. You hit her neck and begin to slide down, you manage to scramble and grab hold of her long gold necklace which hangs down into her cleavage. You slide down the chain and are suspended right between Amy's tits. \"You okay sis?\" asks Amy. \"Yea, choked on something\" Any bent down to pick up some clothes she came to get. Unknowingly, Amy's push up bra squeezes together as she bends over, and her breasts push against you until you pop right between them. </span></div></div>",
            "created":1301634000,
            "id":1080365,
            "title":"She chokes on you"
        },
        "131122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alison swallows her water. \"Hmm, that water tasted different\" Alison felt something in her throat and swallowed again. *gulp* \"Hmm, weird\" </span></div></span></div>",
            "created":1301634000,
            "id":1080362,
            "title":"She swallowed you"
        },
        "13113":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Alison throws her arms up to stretch, You feel her breasts get pushed closer and closer by her arms. The warm flesh rubs against you and you're pushed deeper and deeper into her cleavage, until her breasts are squeezing so tight on you. You feel your bones begin to break from the pressure, and you begin to lose sight. You look up one last time, to see Alison's face disappearing as her tits close to tight that you can't see up through the gap between her breasts anymore. Your vision goes completely black, as you're turned to a tiny red stain in Alison's cleavage.<br>\r\n<br>\r\nAlison felt something pop between her breasts. \"huh\" she stopped stretching and looked down. All she saw was a very small red stain right in her cleavage. \"Oh no! i completely forgot about that pour little guy!\"Alison frowned as she looked at the bug sized man's remains on her chest. \"Pour little guy\"</span></div></div>",
            "created":1301634000,
            "id":1080350,
            "title":"Alison stretches, causing her breasts to squish..."
        },
        "1312":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She looks hungry",
                "She's smiling "
            ],
            "content":"<div class=\"\"><div> <span>\"Whatever, you can't have him\" Felecia walks past Alison and heads to class. She tucks you in between her breasts, tightens her bra, and does the buttons up. After hours of school, Felecia arrives home, and takes off her uniform, and puts on short shorts and a tight tank top. She pulls you out of her shirt and places you on a dresser. You look up at her face and</span></div></div>",
            "created":1301634000,
            "id":1080368,
            "title":"Doesn't stop her, Felecia leaves with you"
        },
        "13121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You struggle from her grip and fall back down her shirt",
                "She eats you"
            ],
            "content":"<div class=\"\"><div> <span>Felecia's stomach grumbles lowly. \"uh oh, i'm getting pretty hungry little guy, and there's nothing to eat around here\" You see her fingers reach for you, and soon you're plucked between them, dangling in front of her lips as she licks them. \"Well, i guess you'll have to do as a snack\" Felecia giggled and her mouth opened slowly.</span></div></div>",
            "created":1301634000,
            "id":1080371,
            "title":"She looks hungry"
        },
        "131211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Before Felecia can eat you, you manage to struggle out of her grip, and you fall down, landing back in her cleavage. \"Really! fine, since you seem to love my giant tits so much, i'll let you get nice and comfy\" Felecia reached behind her and tightened her bra again! now her breasts were so tight, you could barely breath. As Felecia went about her routine, she bent over to pick something up and her bust was pressed together even tighter, finally squishing you right between them. \"oops....oh well\" Felecia said giggling as she felt your body pop in her bosom. </span></div></div>",
            "created":1301634000,
            "id":1080375,
            "title":"You struggle from her grip and fall back down h..."
        },
        "131212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Felecia slides you into her mouth and begins to toss you around like a candy. She sucks on you and suddenly you feel her mouth rise at an angle. She tilts her head up and tosses you to the back of her mouth.You're then pulled down as she swallows. \"Mmm, just what i needed, a tiny snack\" she giggled and rubbed her stomach. \"What a yummy little man\" she said, licking her lips and smiling. </span></div></div>",
            "created":1301634000,
            "id":1080373,
            "title":"She eats you"
        },
        "13122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You look up to see an evil smile on her face. She giggles and leans down to pick you up. She plucks you between her fingers and brings you to her face. \"I'm gonna get right to it, i decided it would be fun to kill you by squishing you... right here\" Felecia lowered you to her giant bust and dropped you. You slid down in her cleavage and were caught between her massive breasts. She starts to press her breasts together lightly, and pout as she looks down at me to tease. She finally giggles and winks down at you, then presses her arms tightly against her breasts and squishes her tits so close that you pop between them. \"That was fun\" she said giggling. </span></div></div>",
            "created":1301634000,
            "id":1080376,
            "title":"She's smiling "
        },
        "132":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You slip",
                "One of the girls pulls you into their mouth",
                "The girl's didn't tell you the whole game, and they suddenly start making out"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure, i bet it'll be fun\" Alison smiles. The girls look down at you, each with an evil smile on their face. Felecia seems to think for a moment and then she giggles. Her hand curls and you tumble and fall until you're dangling in the air, as Felecia holds you by the back of your shirt, with the very tip of her thumb and index finger nail. You're so tiny she can barely grip your shirt. Felecia makes pouting lips, and then you see her undo a few buttons, revealing her massive bust. \"Alison, i have an idea\" Felecia leans in and whispers to Alison, she giggles and the girls then look to you. \"Okay little guy, we're gonna play a little game, me and Alison are gonna lean close and make our tongue's touch, you're gonna be put in the middle, if you fall, you'll land down one of our shirts, if you don't, one of us will eventually suck you into our mouths and make you a snack. If you stay on long enough, we MIGHT let you live\" Felecia smiled and the girls leaned in, and stuck their tongues out until they touched. You are suddenly dropped on their giant pink tongues. They're slippery and dangerous. You try to get footing,</span></div></div>",
            "created":1301634000,
            "id":1080288,
            "title":"Alison agrees, and they think of what they'..."
        },
        "1321":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Alison",
                "Felecia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You slip off their tongues and fall down, landing in whose cleavage?</span></div></span></div>",
            "created":1301634000,
            "id":1080377,
            "title":"You slip"
        },
        "13211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You land comfortably between Alison's giant Double D's. You're caught right in her cleavage, her breasts are soft and warm, but her bra tightens them against you. She lets out a giggle, causing her bosom to jiggle. Her breasts knock together, squishing you between them. \"Pour guy\" she says laughing. \"Oh im sure he enjoyed it\" Felecia joked. Alison smiled and cleaned the blood from her breasts.</span></div></div>",
            "created":1301634000,
            "id":1080379,
            "title":"Alison"
        },
        "13212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You bounce off Felecia's E's and land tightly in her cleavage, \"Awwweee, look at the little guy\" Felecia giggled loudly and tilted her head, smiling down your helplessness from in her bosom. Alison then pressed her breasts together and winked at Felecia. She looked at you and mouthed \"bye bye\" then her breasts got closer and closer, and less and less of her face could be seen up through the gap in her breasts, until finally you were squished right between them. \"I felt him pop\" she giggled. Felecia laughed, and Alison bent down, licking your tiny blood stain off her friends boobs.</span></div></div>",
            "created":1301634000,
            "id":1080380,
            "title":"Felecia"
        },
        "1322":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>As you begin to cross their giant tongues, you feel one of the pink floors move and suddenly you're pulled into Felecia's hot mouth. She closes her eyes and starts sucking on you like a candy. \"down you go\" she said, smiling and running her finger down her throat to trace your descent as she swallowed you. \"Mmm, what a yummy snack\" she teased. \"Awe, i wanted to eat him Feesh\" Alison giggled.</span></div></div>",
            "created":1301634000,
            "id":1080383,
            "title":"One of the girls pulls you into their mouth"
        },
        "1323":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Suddenly the two tongue get closer, and they slide into each other's mouths. You're pulled down Alison's tongue and into her hot mouth. the girls continue to make out, and you're passed between their wet mouth numerous times. Finally Alison pulls away and giggles, *gulp* she winked at Felecia. \"mmm, he was tasty\" Felecia laughed. \"good kissing\" Alison giggled.</span></div></div>",
            "created":1301634000,
            "id":1080388,
            "title":"The girl's didn't tell you the whole ga..."
        },
        "133":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She squishes you in her cleavage",
                "She pulls you out of her shirt"
            ],
            "content":"<div class=\"\"><div> <span>Alison considers Felecia's idea to dispose of you, but when they aren't looking, you run as fast as you can and jump off Felecia's hand. You figure it's best you die quick from a fall this high, rather than stick around to see what they would do to you. You expect to land hard on the ground. But you're hit by something soft, and you bounce until you're stuck between two giant mountains. Each is soft, warm, and sweaty . . . wait, sweaty? You realize, you landed down Alison's open shirt, and are now stuck between her giant breasts. You look up to see Alison looking down at you, she doesn't look happy. \"YOU LITTLE PERVERT!\" She yells. \"You still sure we can't get ride of him?\" asks Felecia. Alison looks at you in disgust. \"I've changed my mind.\"</span></div></div>",
            "created":1301634000,
            "id":1080283,
            "title":"You run and jump off Felecia's hand, and ac..."
        },
        "1331":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>\"If this perv likes my tits so much, he can die between them\" Alison smiles and pressed against her breasts. You feel enormous pressure as her boobs get tighter and tighter. You feel her soft warm flesh finally squish you and you die between Alison's giant boobs.\"There, little pervert got what he deserved\" Alison giggled. \"Good job\" said Felecia laughing.</span></div></div>",
            "created":1301634000,
            "id":1080391,
            "title":"She squishes you in her cleavage"
        },
        "1332":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Alison pulled you out of her cleavage and brought you to her mouth, \"You little pervert, i hope you taste good\" She dropped you, and you slid down into her mouth, down her tongue, and Alison swallowed, sending you down her throat. \"Mmm, as least the little shit was yummy\" Alison rubbed her stomach, \"mmm, what a tasty little snack\" She said, smiling and licking her lips.</span></div></div>",
            "created":1301634000,
            "id":1080392,
            "title":"She pulls you out of her shirt"
        },
        "134":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>\"Well....\" Alison leans down, and she looks at you in Felecia's palm. She considers how small you are, and all the things they could do with you, but how she doesn't wanna hurt someone. Alison begins to sigh, inhaling deeply, and unfortunately, at your tiny size, she sucks you into her mouth. Alison quickly leans back up, instinctively, without thinking, Alison swallows you. \"SHIT\" Felecia started laughing. \"Well, thats one way to do it\" she said giggling. \"I can't believe it, i swallowed the pour guy!\" Alison rubbed her throat, feeling you slide down. \"Oh well, did he at least taste good?\" Alison nodded. \"But still, pour little guy\" Felecia giggled again and the girls walk out of the bathroom. </span></div></div>",
            "created":1301634000,
            "id":1080278,
            "title":"Alison leans in to get a better look at you, an..."
        },
        "14":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "land down her shirt",
                "land on the ground"
            ],
            "content":"<div class=\"\"><div> <span>You remain on the side of the porcelain sink in the hopes that Allison will notice you. She walks over to the mirror and begins doing makeup, as she bends over to look in the mirror, you're greeted by the pleasant sight of her amazing cleavage. You wave your hands like mad trying to get her attention but you're not having any luck. Suddenly Alison drops her lip stick and leans far down to get it out off the ground. As she bends down to get it, the gust of wind knocks you off the sink, and you</span></div></div>",
            "created":1301806800,
            "id":1081500,
            "title":"You stay on the sink"
        },
        "141":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She sees a friend of hers and they hug",
                "She gets to class"
            ],
            "content":"<div class=\"\"><div> <span>You sink through the air and and bounce off Alison's soft warm breasts. Her bouncy boob launches you into the air again and you land comfortably in her cleavage. Alison doesn't even feel your tiny body land down her shirt. You slide down her cleavage until it gets narrow and you're held in place in her bosom. Alison finishes up her makeup and begins to walk to class. </span></div></div>",
            "created":1301806800,
            "id":1081511,
            "title":"land down her shirt"
        },
        "1411":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>On her way to class, Alison sees her friend Megan. The two girls hug, and you see Megan's breasts get closer and closer until Alison's boobs press together as the girls embrace. You shot out of her cleavage and land right on Megan's left breast. As the girls stop hugging. You tumble down Megan's chest. You struggle to escape the embrace her cleavage but it's too tight. You look up to see Megan is now writing a test. You begin to try and climb out of her shirt. Megan feels something down her shirt. She reached behind her and tightened her bra. you feel her breasts get tighter and tighter until you can't take it. Her boobs smush you slowly in between them. Megan felt something pop in her cleavage. She looked down and saw a small red stain. \"oops, one of the little shrinkies must have gotten in my shirt, oh well\" she giggled. </span></div></div>",
            "created":1301806800,
            "id":1081633,
            "title":"She sees a friend of hers and they hug"
        },
        "142":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "It's Haley, a cute, sweet busty brunette with amazing blue eyes",
                "It's Megan, a gorgeous, big chested brunette girl with blonde highlights"
            ],
            "content":"<div class=\"\"><div> <span>You fly off the sink and hit the ground hard. Somehow you aren't killed, but you're a little bruised. You see Alison finish up her makeup and she leaves the bathroom. As you stand in the middle of the washroom floor you try to formulate a plan.But you hear the door swing open. </span></div></div>",
            "created":1301806800,
            "id":1081516,
            "title":"land on the ground"
        },
        "1421":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She felt you",
                "She doesn't feel you, keep climbing"
            ],
            "content":"<div class=\"\"><div> <span>Haley enters and she walks right for you. She's wearing a button down red shirt, revealing her large breasts. Her curly brown hair has a few strands which dip into her cleavage. She walks over to where you are on the ground, and she looks into the mirror to do her makeup. You stare up in awe at her, she's positively enormous! she's like a true goddess to you. You figure you're going to need to get someone's attention sooner or later so Haley is as good a choice as others. You walk over to her toe and start to scale the side of her mountain sized feet. You reach the top of her toe and almost slip off her toe nail. She seems like she'll be doing her makeup awhile so you keep climbing. You eventually reach her thighs and get on top of the band of her short shorts. You almost fall down into her shorts but you grab her skin to hold on. </span></div></div>",
            "created":1301806800,
            "id":1081553,
            "title":"It's Haley, a cute, sweet busty brunette wi..."
        },
        "14211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She \"accidentally\" drops you down her shirt",
                "She's going to eat you"
            ],
            "content":"<div class=\"\"><div> <span>Haley felt something strange down by her waist. She lifted the bottom part of her shirt, to see what looked like a very small bug crawling up her. Before she could swipe it off, she noticed it didn't look like any kind of normal bug. Haley thought it almost looked like . . . a person? \"What in the ...\" Haley carefully picked the bug off her skin and held it gently with her thumb and index finger. She brought it slowly up to her face. \"OH, MY, GOSH, it IS a little person!\" Haley giggled and a cute smile ran onto her face.\"Wow, those girls weren't kidding, they really did shrink a bunch of guys across the street!\" Haley looked you over carefully, in awe of how tiny you are. Haley was pretty smart, and she figured you were about an eight of an inch in height. \"Hmm, i wonder what i should do with you, i mean you're so little, and obviously i can't just let you live, you tried to get in my pants you little pervert\" You try to object and claim you were climbing her, but Haley can't hear you. She looks at you with a seductive smile. </span></div></div>",
            "created":1301806800,
            "id":1081559,
            "title":"She felt you"
        },
        "142111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "right inside her yogurt",
                "on the table"
            ],
            "content":"<div class=\"\"><div> <span>Haley giggles to herself and casually positions you above her enormous, exposed breasts. Suddenly you're falling through the air for miles. \"oops\" she says, obviously not actually having dropped you on accident. You collide with her enormous breast and get stuck to the sweaty mountain of flesh. Haley looks down to see you helplessly trying to stand up. But her breast was too soft and bouncy, and when you tried to stand you'd fall. She laughed and then she jumped a little, causing her bosom and your entire world to shake and move. You get extremely dizzy and fall right off her breast and slide down into her cleavage. You fall down until it gets narrow and you're stuck right between her boobs. \"You nice and comfy?\" she asked rhetorically. Haley giggles and leaves the bathroom. As lunch time rolls around, you manage to climb out of her cleavage and stand on top of her giant breasts. You look down to see she's eating a cup of yogurt. You figure if you run and jump, you have a 50/50 chance of landing on the table in front of her, or landing in her yogurt and becoming her snack. You get ready, sprint and jump, you land</span></div></div>",
            "created":1301806800,
            "id":1081568,
            "title":"She \"accidentally\" drops you down her s..."
        },
        "142112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>She smiled. And you saw a huge pink tongue jut from her mouth and run across her upper lip. \"Well, since you're so small, i'm sure nobody's gonna miss you, so\" Haley moved you towards her lips and she slowly opened her mouth. You see her tongue stick out just a little, and Haley dangles you just a few feet (to you) above the tip of her tongue. \"i think it's time for a snack\" She giggled and dropped you, you land on her soft wet tongue, and soon she sucks you into her mouth. She moans and tosses you all around her mouth, until you feel yourself being pushed towards the back of her throat. You hear the sound of her swallow you *gulp* and you slide down her throat. \"ooh, he was a yummy little snack\" Haley smiled to herself and patted her belly. </span></div></div>",
            "created":1301806800,
            "id":1081572,
            "title":"She's going to eat you"
        },
        "14212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She sees something on her boob",
                "she doesn't see you"
            ],
            "content":"<div class=\"\"><div> <span>You continue your climb, and you go under her shirt so that you're climbing her navel and belly. You see her huge breasts being held by her push up bra, and you figure you'll have to climb up through her cleavage. As you reach the tops of her boobs, you climb onto her left tit and try to catch your breath. But Haley is looking in the mirror.</span></div></div>",
            "created":1301806800,
            "id":1081574,
            "title":"She doesn't feel you, keep climbing"
        },
        "1422":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She raises her toe, she's going to step on you!",
                "She bends down to pick you up"
            ],
            "content":"<div class=\"\"><div> <span>As you look up, Megan walks into the bathroom. She looks somewhat familiar, like you've seen her recently. She walks to the center of the room and puts her hands on her hips, you see she isn't wearing shoes. She walks towards you and soon her feet are right on either side of you. She seems to be looking to for something. Suddenly she looks down, and seems to spot you. She smiles, but it doesn't look like a comforting smile. </span></div></div>",
            "created":1301806800,
            "id":1081579,
            "title":"It's Megan, a gorgeous, big chested brunett..."
        },
        "14221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>She smiles and moves her foot so her big toe is directly in front of you. She raises her giant toe and you see it's shadow loom over and darken everything around you. She giggles and her toe comes down, crushing you like a tiny bug beneath her foot. She moves her toe away to see the little red stain on the ground. She giggles and leaves. </span></div></div>",
            "created":1301806800,
            "id":1081586,
            "title":"She raises her toe, she's going to step on ..."
        },
        "14222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "I think i'm hungry",
                "I'm going to keep you"
            ],
            "content":"<div class=\"\"><div> <span>She bends down, and her fingers quickly grasp you and bring you up to her amazing eyes. She smiles. \"Well, well, well, i finally found you, you little shit\" You look confused. \"Oh sorry, didn't i say? We shrunk a bunch of guys from your school, and then we sent them to random places around ours, so that you could run into \"accidents\" with the students\" Megan smiled at what she'd done. I was looking for you for awhile, and now that i have you . . .\"</span></div></div>",
            "created":1301806800,
            "id":1081590,
            "title":"She bends down to pick you up"
        },
        "142221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>\"I think i'm a little hungry, and there's nothing around to eat, so i guess you'll have to be my little snack\" Megan winked and let out a loud laugh. It happened so fast, she tilted her head back, dangled you above her open mouth, and you looked down her dark gullet, all of the sudden you were falling and you felt yourself being sucked down her throat. Megan swallowed her little snack. \"Mmm, he was yummier than expected\" She licked her lips. Megan undid a button of her shirt and looked down at her breasts. Several shrunken guys were down in her cleavage. \"I'm still a little hungry, and it's almost lunch, so don't get comfotable\" she giggled and did her shirt up, and left the washroom.</span></div></div>",
            "created":1301806800,
            "id":1081596,
            "title":"I think i'm hungry"
        },
        "142222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She grabs you",
                "She grabs someone else"
            ],
            "content":"<div class=\"\"><div> <span>You barely had time to react as Megan undid her shirt, and you were dropped, before colliding with her giant breasts. You slid down and were caught by the fat flesh of her cleavage. You saw several other shrunken people. \"Hey guys look, she got another one\" said one of the prisoners of her bosom. \"What the hell is she going to do with us?\" You ask. The man shrugs, and Megan starts to walk, her chest jiggles and shakes as she walks and you bounce all around in between her boobs. Her chest comes to a stop and daylight pours into her cleavage. Her fingers reach deep into her bosom and pull out a tiny shrunken man. you look up to see Megan casually talking to her friends. Her mouth opens and she very slightly leans her head back, and drops the little man into her mouth. You see a bulge move down her throat as Megan swallows him. She licks her lips and her gaze turns down her shirt. She smiles and her fingers reach in again. </span></div></div>",
            "created":1301806800,
            "id":1081605,
            "title":"I'm going to keep you"
        },
        "1422221":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You're lifted from the sweaty prison of her cleavage and soon you're staring her lips in face. You see them open slightly and her fingers shove you in her mouth. Her tongue licks and tastes you all over, and before you can barely react, you're pushed down her throat as she swallows you. \"Mmm, these little guys are sooo yummy\"</span></div></div>",
            "created":1301806800,
            "id":1081607,
            "title":"She grabs you"
        },
        "1422222":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Megan plucks someone from her bosom once more, and you watch as she makes him her snack. But soon, Megan starts to get up, and her arms shoot out from her body and she lets out a huge yawn. As her arms come back in they squish your prison together and you're quickly mushed along with several others in between her giant breasts. Megan feels something pop between her boobs. She pulls the collar of her shirt out to see a bit of red in her cleavage \"oops\" she giggles. </span></div></div>",
            "created":1301806800,
            "id":1081609,
            "title":"She grabs someone else"
        },
        "15":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Madison ",
                "Mattie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The girl who walks in is . . .</span></div></span></div>",
            "created":1305694800,
            "id":1108642,
            "title":"Allison doesn't see you, and another girl w..."
        },
        "151":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Madison noticed you",
                "Madison leaned down to wash her face. "
            ],
            "content":"<div class=\"\"><div> <span>in walked a short haired brunette girl named Madison. She was sweet girl, big chested, cute and she didn't seem too mean. She Approached the counter and bent down to start doing her makeup. Her low cut shirt made her large breasts nearly burst out of her shirt. You were mesmerized by her cleavage and got distracted. You didn't realize . . .</span></div></div>",
            "created":1305694800,
            "id":1108688,
            "title":"Madison "
        },
        "1511":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Drops you down her shirt",
                "She tastes you",
                "puts you on her necklace"
            ],
            "content":"<div class=\"\"><div> <span>As your vision went from her huge chest up to her eyes, she was looking right at you. You expected a look of shock, but instead she smiled and all the sudden she plucked you off the sink and held you in front of her eyes. \"Awe, Hi there little guy\" she said. You screamed for her to help you but she didn't seem to hear. \"hmm, i heard about some girls in the chemistry wing shrinking a bunch of boys from the other school, but i never thought i'd actually find one\" She giggled. \"Hmm, what should i do with you, you're so tiny, there are so many options\" </span></div></div>",
            "created":1305694800,
            "id":1108721,
            "title":"Madison noticed you"
        },
        "15111":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "her breasts are too tight, you pop between them",
                "You get stuck and she takes you with her"
            ],
            "content":"<div class=\"\"><div> <span>Your gaze turns to her amazing cleavage. Her low cut shirt and push up bra makes her breasts look amazing. \"Oh, you like these huh?\" she said teasingly. \"Well\" Madison smiled as she lowered you to her boobs and dropped you. You slid down between her massive breasts and fell deep into her cleavage. \"Nice and comfy?\" she asked. Madison hugged herself and pressed her tits together. You slid deeper into her chest and</span></div></div>",
            "created":1305694800,
            "id":1108732,
            "title":"Drops you down her shirt"
        },
        "151112":{
            "author_id":"chaoscookie",
            "author_name":"Ubrofl",
            "content":"<div class=\"\"><div> <span>Madison took her seat in her next class as you remained stuck, struggling between her enormous breasts. <br>\r\n<br>\r\n20 minutes or so in, Madison gets bored when she remembers the tiny person lodged in her chest. She plucks you out and without a second thought she pops you into her mouth. Her mouth begins to churn, swishing you around as her tongue prods you. Eventually the bell ring, and with a deep sigh, Madison swallows you whole. \"Oh he was yummy\" she giggled to herself as she packed her things and went home.</span></div></div>",
            "created":1488419220,
            "id":2283938,
            "title":"You get stuck and she takes you with her"
        },
        "15112":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She liked the taste",
                "She didn't like the taste"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She smiled again and her lips parted, suddenly she dangled you just in front of her lips and her tongue poked out and took a brief taste of you. You were terrified. But surely she wouldn't eat you right?</span></div></span></div>",
            "created":1305781200,
            "id":1108809,
            "title":"She tastes you"
        },
        "151121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She swallowed",
                "She pulls you out"
            ],
            "content":"<div class=\"\"><div> <span>Madison giggled. \"Mmm, you're yummy\" she giggled again and this time opened her mouth and dangled you right above her throat and licked you, \"Mmm, i think you'd make a tasty treat little guy\" she teased. She finally dropped you right in her mouth and started sucking on you and licking you all over. She smiled and let out the occasional \"Mmm\" and then </span></div></div>",
            "created":1305781200,
            "id":1108811,
            "title":"She liked the taste"
        },
        "1511211":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You felt her throat pull you down as she swallowed you like a piece of candy. With a loud audible \"Mmm\" as she felt you slide down her throat and into her warm belly. \"What a yummy little snack\" Madison smiled and licked her lips. She rubbed her stomach and closed her eyes and let out one more loud *gulp* to make sure you were gone. She giggled to herself and simply continued her makeup.</span></div></div>",
            "created":1305781200,
            "id":1108814,
            "title":"She swallowed"
        },
        "1511212":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "You slip off and land down her shirt",
                "She licks you back into her mouth and swallows"
            ],
            "content":"<div class=\"\"><div> <span>She covers you in saliva, throwing you back and forth around her mouth. \"Mmm, dare me to swallow little guy?\" she asked tauntingly. She made a loud *gulp* sound and laughed at her teasing. \"Awe i think i scared him\" Madison used the tip of her tongue to collect you and spread you onto the front of her lips. You began to slide off her red lipstick </span></div></div>",
            "created":1305781200,
            "id":1108816,
            "title":"She pulls you out"
        },
        "15112121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>The slippery lipstick makes you fall for what seems like ever until your fall is broken when you bounce off her huge breast and land down her shirt and get stuck in her cleavage. Madison laughs so loud and finally looks down at you and smiles. \"Awe, comfy?\" she asked. Madison Squeezed her arms together until she felt a very tiny pop. She looked down and a miniscule red stain was now in her cleavage. She giggled ran her finger through her tits to clean the stain and licked her finger clean.</span></div></div>",
            "created":1305781200,
            "id":1108819,
            "title":"You slip off and land down her shirt"
        },
        "15112122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>But your hopes of escape are dashed as her tongue darts back out, licks you and sucks you back into her mouth. \"Bye Bye\" she said in a cute sing song voice. She laughed and you felt her swallow you. Madison giggled and traced her finger down her throat as she felt your movements as you slid down her throat. She licked her lips and said \"Mmm, yummy snack\"</span></div></div>",
            "created":1305781200,
            "id":1108821,
            "title":"She licks you back into her mouth and swallows"
        },
        "15113":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "you lose grip and land in her shirt",
                "You hold on"
            ],
            "content":"<div class=\"\"><div> <span>Madison brought you to the necklace which hung just above her huge breasts and she dropped you onto the ornament. you slid and held on with both hands for you life. If you fell, her giant boobs would crush you. She giggled at your situation and skipped all the way to class to make sure her necklace jumped about and moved</span></div></div>",
            "created":1305781200,
            "id":1108834,
            "title":"puts you on her necklace"
        },
        "151131":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Madison barely felt it when you flew off and landed quickly between her boobs. Her movements made her breasts knock together and within minutes her boobs pressed together and you were turned to paste between her huge tits.</span></div></span></div>",
            "created":1305781200,
            "id":1108837,
            "title":"you lose grip and land in her shirt"
        },
        "151132":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>You manage to hold on and Madison gets to class, as she sits down, the force jerks you up and you fall down into her shirt. Through the class you sit down stuck between her boobs and she would every now and then push them together and squish you a more and more. Finally her arms shot out and she yawned. As her arms returned her breasts were squeezed so tightly that she crushed you like a bug between her massive tits. She felt  a slight pop. \"Huh, awe poor guy\" she laughed, seeing your tiny blood stain.</span></div></div>",
            "created":1305781200,
            "id":1108838,
            "title":"You hold on"
        },
        "1512":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "She sees you in the mirror and you fall",
                "She sees you in the mirror and picks you up",
                "You fall and land in her cleavage"
            ],
            "content":"<div class=\"\"><div> <span>As you slowly got closer, Madison leaned down to wash her face. A strand of her hair knocked into you and you held on so as not to fall hundreds of feet to your death. As she began to wash her face, her strand of hair dangled right over her exposed cleavage and you began to slip off her hair. </span></div></div>",
            "created":1305694800,
            "id":1108723,
            "title":"Madison leaned down to wash her face. "
        },
        "15121":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Just as Madison swore she saw something in her hair, it fell, and she watched in plummet to her tits. She felt something tiny bounce off her boob and get caught between them. She dug her fingers into her shirt and pulled it out from between them and held it to her face. \"Well hello cutie\" she said smiling. \"Wanted to get down my shirt huh?\" She giggled and dropped you right back into her cleavage. She felt him slide deep to her chest and she gave herself a tight hug to squish him even more. She looked down and saw you struggling to get out and she made a fake expression of offense and giggled again. She pushed her breasts together with her arms again and this time felt a tiny pop as the man in her cleavage was squished like a bug between her giant boobs.</span></div></div>",
            "created":1305781200,
            "id":1108825,
            "title":"She sees you in the mirror and you fall"
        },
        "15122":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>Madison noticed the moving object in her hair and remembered what it was. She smiled and in a quick motion, plucked the tiny man out of her hair and dropped him into her mouth. She tossed him this way and that and then finally a loud *gulp* signaled that she had send him down her throat to his doom like she had done to many others earlier. \"Mmm, ooh i still just love when they squirm\" she giggled.</span></div></div>",
            "created":1305781200,
            "id":1108828,
            "title":"She sees you in the mirror and picks you up"
        },
        "15123":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "choices":[
                "Madison gets a drink, with you in it",
                "She changes her mind and another girl walks up"
            ],
            "content":"<div class=\"\"><div> <span>As you tumble through the air you land right between her giant breasts. She must not have felt you because she barely acknowledged it. As she finished her makeup, she giddily walked out of the bathroom, her bosom shaking with every step. She finally came to a drinking fountain she bent over and you fell out of her cleavage and landed right in the nozzle of the drinking fountain. </span></div></div>",
            "created":1305781200,
            "id":1108833,
            "title":"You fall and land in her cleavage"
        },
        "151231":{
            "author_id":"hyadekii",
            "author_name":"Hyadekii",
            "content":"<div class=\"\"><div> <span>As Madison turns on the fountain, the shot of water propels you up and you're sucked into Madison's mouth. Before you can think, she swallows the swig of water and you're sucked down her throat. Madison hadn't even been aware that she'd just swallowed you.</span></div></div>",
            "created":1305954000,
            "id":1109930,
            "title":"Madison gets a drink, with you in it"
        },
        "151232":{
            "author_id":"carlosthebat36",
            "author_name":"CarlostheBat",
            "choices":[
                "She feels something in her breasts",
                "She feels nothing, and walks to her next class"
            ],
            "content":"<div class=\"\"><div> <span>Just as Madison was about to turn on the fountain, the bell rang. \"Uh-oh. Class is about to start. I can't drink right now.\" She says to herself. She turns around, and starts walking to her next class. You sigh in relief that you didn't end up as Madison's drink. But now your new problem is how to get down. It's too far down to jump, even at this size. Soon, another girl comes up to the fountain for a drink. You're surprised to see that it's Alison. \"Maybe I can get her help this time.\" You say to yourself. You jump off the nozzle onto the fountain itself, and walk to the edge. Just as you reached the edge, Alison turned on the water for a drink. You look forward. Just feet (to you) in front of you are two of the biggest breasts you've ever encountered (again.) You take a deep breath, and jump, landing safely in her cleavage. It's soft, warm, and sweaty, but very comfortable. You look up.</span></div></div>",
            "created":1367296260,
            "id":1581431,
            "title":"Alison again?"
        },
        "152":{
            "choices":[
                "Mattie noticed you",
                "Mattie accidentally knocked you off the sink",
                "Another girl entered the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>Allison left the bathroom before you could make any contact with her. Next, in stepped Mattie, as she went up to the sink.<br>\r\n<br>\r\nMattie was African-American with curly hair. She had an attractive figure and had a pretty noticeable chest. You didn't know her too well, but she seemed nice enough. Still, you couldn't know for sure if she would help you. <br>\r\n<br>\r\nRight now, she was wearing her school uniform and a pair of boots. She was examining herself in the mirror. She was pretty attractive, and you caught yourself ogling at her. What happened next?</span></div></div>",
            "created":1306645200,
            "id":1115572,
            "title":"Mattie"
        }
    },
    "info":{
        "author_id":"hyadekii",
        "author_name":"Hyadekii",
        "brief_description":"This is a choose your own adventure giantess micro, vore, and cleavage story. ",
        "created":1299384780,
        "description":"<td align=\"left\" class=\"norm\"><br>\r\n<br>\r\nIf you add a chapter you will receive 400 GPs provided the chapter is good and follows the rules, and is at least a paragraph<br>\r\n<br>\r\n<br>\r\nThis is an interactive giantess story, it features primarily vore, and breasts. <br>\r\nIf you decide to extend the story anyway for any reason, please note:<br>\r\n<br>\r\nNo foot fetish allowed, i hate foot fetishes and please respect that<br>\r\n<br>\r\nNothing gay and absolutely no giant males<br>\r\n<br>\r\nThe person must always remain his size and cannot injure or change the size of any of the girls<br>\r\n<br>\r\nThe person must remain nameless to ensure his identity is \"yours\" so to say<br>\r\n<br>\r\nNo Profanity, nudity is acceptable but anything to sexual will be deleted, this is a breast and vore story first and foremost.<br>\r\n<br>\r\n</td>",
        "id":1757173,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1488419220,
        "modified":1488419220,
        "pretty_title":"What Happens in Chem (Episode 2)"
    }
}