{
    "chapters":{
        "1":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Sandra",
                "Cindy",
                "Christine",
                "Candice",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>It's Monday and you have to go to Sandy Beach Enterprises for work. On your job it says that you have planning and other business related stuff. However something weird happened in the morning and Dave starts feeling odd as soon as he enters the office.<br>\r\nIn the office you meet Sandra who is hot and who you like a lot and she likes you to. However in the workplace you fancy other ladies who work there. The ladies come and see you during break. This is where the weirdness starts.<br>\r\n<br>\r\nWhich lady should you stay with?</span></div></div>",
            "created":1246424400,
            "id":717342,
            "title":"The starting"
        },
        "11":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "You are shrunk",
                "You are transformed into a inanimate object",
                "You transform her"
            ],
            "content":"<div class=\"\"><div> <span>You and Sandra has history because you are always arguing with her but she still likes you. Little do you know that she wants you to be transformed or shrunk so she can get her own back for all of the arguments. She doesn't know that you can transform her.<br>\r\n<br>\r\nSo what happens.</span></div></div>",
            "created":1246424400,
            "id":717304,
            "title":"Sandra"
        },
        "112":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "A bra",
                "A pair of knickers",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will she turn you into.</span></div></span></div>",
            "created":1246424400,
            "id":717317,
            "title":"You are transformed into a inanimate object"
        },
        "1121":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Transforms you into a tampon (revenge)",
                "Turns you back and shrinks you",
                "Turns you into a sex toy"
            ],
            "content":"<div class=\"\"><div> <span>You suddenly black-out and then wake to hear Sandra say <br>\r\n\"Dave wake up\" and you discover that you cannot move and do anything. She says \"Wow you're perfect. You comfort my breasts brilliantly. There will be a treat for you as soon as we get to mine.\" Sandra just works until she can go home and she is planning to do something to you.<br>\r\n<br>\r\nWhat does she do?</span></div></div>",
            "created":1246424400,
            "id":717357,
            "title":"A bra"
        },
        "11212":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Absorbs you and increases her breast size with you as them",
                "Makes her boobs bigger without absorbing you"
            ],
            "content":"<div class=\"\"><div> <span>She sits all day in work until 5:30 and then drives home. She goes instantly into her bedroom and takes her clothes off and says to you. <br>\r\n\"Dave I hope your day is going well because it is going to get better for you.\"<br>\r\n<br>\r\nOf course you don't know what she meant, so she unstraps you from her breasts and takes off her knickers as well. She prepares for a bath but before she enters the bath she massages her whole naked body with you starting at her breasts all the way down to her pussy.<br>\r\n<br>\r\n\"Wow Dave do you know how much I enjoy this,\" she says with such passion.<br>\r\nSo she then puts you on the floor and then turns you back to normal but she has shrunk you to 3 inches tall.<br>\r\n<br>\r\n\"Now you can get in the bath with me and massage my wet naked body\"<br>\r\n<br>\r\nYou are then lifted by her before she enters the bath and then puts you onto her left breast and tells you to walk into the middle of them<br>\r\n\"Dave can you position yourself perfectly in the middle because I want to try something with you\"<br>\r\n<br>\r\nShe says that this will not hurt but you will get the best benefits of it.<br>\r\n<br>\r\nSo she says a spell that she remembered from a fictional book.<br>\r\n<br>\r\nWhat does the spell do</span></div></div>",
            "created":1258088400,
            "id":791181,
            "title":"The best shrinking ever"
        },
        "112122":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "She transforms you into a bar of soap and gets back into the bath.",
                "She grows you back to normal for a pleasurable night"
            ],
            "content":"<div class=\"\"><div> <span>You are just laying there in between Sandra's breasts and then you see them expand in size around you. Of course, you're scared whether or not you will be crushed by them.<br>\r\n<br>\r\n\"Dave don't worry you'll be perfectly in the middle\" Sandra says to you.<br>\r\n<br>\r\nSo you see her breast now reach to the size of 40DD. \"Woah!!\" You exclaim as your manhood as now gone erect.<br>\r\n<br>\r\n\"Dave, sorry but you are not doing anything to me yet. I have a surprise for you.\"<br>\r\n<br>\r\nSandra gets out of the bath with you in between her giant rack and she says<br>\r\n\"Dave you know what, tonight you can do whatever you want to me tonight seeing as I pleasured you this much.\"<br>\r\n<br>\r\nSo you think to yourself of what you can do to her but she gives you a warning<br>\r\n<br>\r\n\"Dave if you think of anything that can affect me in a bad way then I will not be very happy with you\"<br>\r\n<br>\r\nSo you tell her that she can do anything to you just for safety.<br>\r\n<br>\r\nWhat does she decide to do to you.</span></div></div>",
            "created":1258520400,
            "id":793403,
            "title":"Massive breast growth"
        },
        "1121221":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "She keeps you as a towel and sleeps in it",
                "She turns you into a always erect man doll and always cuddles you while sleeping"
            ],
            "content":"<div class=\"\"><div> <span>You just stand there on her hand for a while and then you feel your body becoming very slippery. Within seconds you find yourself slipping off her hand but she grips you more firmly as you have become a block. Sandra exclaims \"Wow this is so brilliant that you have turned into this because I couldn't find any\". She then climbs back in the bath with you in her hand.<br>\r\n<br>\r\n\"Hey Dave do you mind if I use you or should I not\" She asks as she is looking at you now in your blocky form. <br>\r\n\"No I do not mind at all. Just go easy with me\". You reply.<br>\r\n<br>\r\nSandra then rubs you all over her body and then does some crazy stuff with you. She sticks you in between her now 40DD breasts and just keeps rubbing until they are clean on the inside. She is proud with what she has done because she tests it by dropping you into the water but through her cleavage to test the slipperiness of the insides. You hit the water and then fall to the bottom, Sandra tries looking for you but she moves backwards and sits on you as you were upright. \"Ou--ooh\" She moans as she feels you there and then grabs you. She rubs you all over her legs and bottom regions. She then rubs you clean and makes sure you're properly clean and not smelling of her smells. She finishes in the bath and makes sure that you are dry so she can prepare you for something else.<br>\r\n<br>\r\n\"Our bathtime is nearly done but you're gonna have one more treat my guy. Oh did I mention that I love you because I want to be with you whatever.\" She says. \"Also I'm in the mood for some loving so you can do that tonight if you want.\"<br>\r\n<br>\r\nShe looks at you as you start to cry and she knows that you love her too. She then turns you into a towel and puts you around her. She stays nude for the night even in bed.<br>\r\n<br>\r\nHow will she sleep tonight with you and what will she turn you into?</span></div></div>",
            "created":1278046800,
            "id":910292,
            "title":"She transforms you into a bar of soap and gets ..."
        },
        "1122":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "She makes your night much better",
                "She takes you home and starts to get her revenge on you"
            ],
            "content":"<div class=\"\"><div> <span>Sandra asks you if you can go into the toilets with her with your eyes closed because she has a surprise for you. \"Dave when you open your eyes you will feel very different about yourself.\"<br>\r\n<br>\r\nSandra says. \"You can open your eyes now.\" <br>\r\n<br>\r\nYou look up to see the towering height of Sandra without her trousers on staring down at you.<br>\r\n<br>\r\n\"Wow a pair of silk knickers, I'm putting you on straight away Dave.\"<br>\r\n<br>\r\nSo she puts one leg through you and then the other one as your face is then pushed up to where her pussy is. You're thinking to yourself, \"What's going on, this is weird. Why am I a pair of knickers?\" Then you remembered what you said to her the other day.<br>\r\n<br>\r\n*Flashback*<br>\r\n<br>\r\n\"Hey Sandra. You know what I wish that we had. The power to shape-shift anyone including ourselves\"<br>\r\n\"Ok then Dave, exactly what will you do then if you could do that then\"<br>\r\n\"Well Sandra I will turn myself into a pair of knickers in-case some girl here forgot a pair\"<br>\r\n-Dave leaves-<br>\r\n<br>\r\nSandra thinks to herself, \"Well if this does happen I will forget my knickers so that I can make his day.\"<br>\r\n<br>\r\n*End flashback*<br>\r\n<br>\r\nDave thinking, \"Ah that's why.\"<br>\r\n<br>\r\nSandra promises a great night for you when she gets home but she is also planning revenge on you for being a perv and she is only using this as a 'please and then torture method'<br>\r\n<br>\r\nSo what happens to you.</span></div></div>",
            "created":1258174800,
            "id":791582,
            "title":"Slik knickers"
        },
        "113":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Change her back ",
                "Turn her into something else."
            ],
            "content":"<div class=\"\"><div> <span>Sandra drags you into a toilet and admits her feelings to you. After years of waiting your life will change forever. As Sandra goes into the toilet you think about playing with her breasts and then you hear a noise after Sandra has finished on the toilet and as walked away from it. After she opens the door there is a flash and little does she know she has been transformed into her 36E breasts and you smile you know now you're gonna have fun.<br>\r\nSandra asks you to get a mirror and then she sees that she is her breasts. She is shocked about it but she knew that was what you liked most about her. <br>\r\n<br>\r\nWill you change her back or into something else.</span></div></div>",
            "created":1246424400,
            "id":717310,
            "title":"You transform her"
        },
        "1131":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Turn her into something on her list.",
                "Turn her back into her breasts",
                "Turn her into chocolate"
            ],
            "content":"<div class=\"\"><div> <span>After you have finished playing with Sandra's breasts you change her back and arrange for her to come to your house.<br>\r\nShe says yes and starts writing a list of things that she wants to transform into. She even says that you can turn her into her breasts again. <br>\r\nYou and Sandra go to your house and Sandra <br>\r\nshows you the list and you see that she wants to be turned into a  chocolate girl but you warn her about what if she melted. She says that you can mold her into whatever you want if that happens. <br>\r\n<br>\r\nWhat would you do?</span></div></div>",
            "created":1246510800,
            "id":717633,
            "title":"Change her back "
        },
        "11311":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Turn her into a chair",
                "Other object"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>On her list it says that she wants to be transformed into the following;<br>\r\nA chair<br>\r\nA ball<br>\r\nher favorite animal which is a cow<br>\r\nA doll<br>\r\nPopcorn? (From Transformation Powder except I'm gonna write it better)</span></div></span></div>",
            "created":1249621200,
            "id":740436,
            "title":"Turn her into something on her list."
        },
        "113112":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A ball so you can bounce her about</span></div></span></div>",
            "created":1249621200,
            "id":740437,
            "title":"The Ball"
        },
        "1131122":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A cow. Think of the benefits. Four Breasts and free milk</span></div></span></div>",
            "created":1249621200,
            "id":740438,
            "title":"A cow"
        },
        "11311222":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A doll. She will be small and be able to pleasure you in a different way</span></div></span></div>",
            "created":1249621200,
            "id":740439,
            "title":"A doll"
        },
        "113112221":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Sandra is fine and only took a slight dent",
                "Sandra takes some major fall damage"
            ],
            "content":"<div class=\"\"><div> <span>You tell Sandra to lay down onto the sofa and then think of her being small and made of plastic. Instantly the white light from earlier happens and now you look at this tiny clothed figure laying on there unable to move.<br>\r\n\"Hehe it worked,\" said the doll, \"Dave thank you as I've always wanted to be like this for a while.\"<br>\r\n<br>\r\n\"Not a problem and glad I could make your dream come true\" You say to Sandra who you've just picked up to inspect, \"you still look as good as your real self and everything is the same physically.\"<br>\r\n\"Yep except for being small and unable to move but that doesn't matter as I want you to carry me everywhere,\" She says from her voice chip as her lips don't move, \"just be careful with me, ok?\"<br>\r\n\"Of course Sandra, I won't let any harm come to you my love\" You say with a tone of passion in your voice, \"let's have some fun shall we?\"<br>\r\n\"Absolutely hehe\" She replies excitedly.<br>\r\n<br>\r\nTime passes as you play with the girl you've been wanting, you styled her hair and took her everywhere via the belt on your jeans. It was a great time for the pair of them. Soon though you had to run upstairs and Sandra slipped from your belt causing her to fall down the stairs.<br>\r\n<br>\r\n\"SANDRA!!!!\" You shout.<br>\r\n<br>\r\nShe hits the ground and what happens?</span></div></div>",
            "created":1354639560,
            "id":1481690,
            "title":"Sandra, the cutest doll ever"
        },
        "1131122212":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Look on her list",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh no, Sandra are you ok,\" you cry as you see her plastic body there on the floor not knowing what has happened to her.<br>\r\n\"Dave are you there,\" you hear from Sandra's voice chip.<br>\r\n\"Yes babe, I've got you,\" you say as you pick up Sandra but notice that her arm as snapped off, \"but I need to do something for you.\"<br>\r\n<br>\r\nYou search the area as to where Sandra fell to find her missing arm, first you look under the stairs followed by under the table. Suddenly you feel a burst of sadness as you broke a promise to her and start crying. Just when you think that you lost all hope, an idea hits you to look under the sofa. Her arm's there and you smile. <br>\r\n<br>\r\n\"Dave what are you doing with me,\" She asks, \"why are you making grunting noises?\"<br>\r\n-CLICK- \"There, that's got it and should hopefully stay there\" You say with great happiness, \"but babe we are not keeping you like this,\"<br>\r\n\"Why is that Dave, I like it like this,\" she says while sounding upset.<br>\r\n\"I hurt you so I don't want it to happen again,\" You reply.<br>\r\n\"You're fine hun, you fixed me so it's ok. Anyways I wanna be something else hehe,\" She says lovingly.<br>\r\n<br>\r\nSo you grab Sandra and put her on the table making sure she's upright.<br>\r\n<br>\r\nWhat do you turn her into, do you check her list or something you want?</span></div></div>",
            "created":1354647120,
            "id":1481786,
            "title":"Sandra takes some major fall damage"
        },
        "113112222":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "Your choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A cone of popcorn so you two could enjoy a movie together<br>\r\n<br>\r\n(<b>This chapter break off is for me only</b>)</span></div></span></div>",
            "created":1356619980,
            "id":1495711,
            "title":"Sweet and tasty Popcorn"
        },
        "11312":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>She lays there nude on your sofa while you are thinking of her breasts again. The reason why she is naked this time was because you told her that you don't want to rummage into her clothes. So after you thought of her breasts the same flash happens and her breasts are just sitting in the place she was in. She says to you \"come and caress me good\". You even pull down your trousers to reveal your now erect penis and she lets you massage it between her breasts. You are in heaven. She says if she can turn back you can do it properly.<br>\r\n <br>\r\nWill you turn her back.</span></div></div>",
            "created":1246510800,
            "id":717662,
            "title":"She is her breasts again."
        },
        "11313":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "You remold her",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>Sandra just stands there and strips until she is nude. You think of her being all chocolatety and yummy and then all of a sudden you see a flash. You're hoping it's gone according to plan and then all you see is Sandra playing with herself.<br>\r\n\"Wow this is cool, I can't believe that I'm chocolate\" but she goes to the window in the kitchen and starts melting because it's 28'C and she was in the sun. Luckily she was standing in a saucepan so she melted into that. <br>\r\n\"Dave! Help me\" she cries.<br>\r\nSo you pick up the saucepan that contains Sandra and you start molding her into something else.<br>\r\n <br>\r\nWhat will she end up as?</span></div></div>",
            "created":1246510800,
            "id":717699,
            "title":"Turn her into chocolate"
        },
        "113131":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You start to mold her back to normal but she didn't notice that you had another saucepan that had more chocolate in. So while you are molding her breasts you add the extra chocolate to them. After you finished with molding her you turn her back to normal. <br>\r\n\"Oh Dave, thank you.\" As she tries to put on her bra she finds that she cannot. Then she notices her boobs are bigger. \"So while you were molding me back to normal you added more chocolate to my breasts, now I must be a 40G.\" You say yes and then she just dances and lets them bounce. \"Cool I love them and I love you. I know, lets turn you into one of the things on my list. How does a new bra sound until I get one from the shop.\"<br>\r\n <br>\r\nWould you let her turn you into a bra?</span></div></div>",
            "created":1246510800,
            "id":717702,
            "title":"You remold her"
        },
        "1131311":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>She turns you into what her bra was when she came in. She picks you up and puts you on. You think to yourself that if you had a dick then it will be so hard right now.<br>\r\n\"Come on Dave lets go.\" she grabs the doorkey that you leave on the shelf and shuts the door.<br>\r\nShe goes into her favorite bra shop and asks the shopkeeper where the 40G bras are. She picks a laced one that has a flower design on it. She says to herself \"Dave might like this.\" she buys it then goes back to your house and takes you off and she turns you back to normal. \"You like what bra I bought?\" she asks and you say yeah because you discover that she bought it with your money. Sandra asks if she can stay the night.<br>\r\n <br>\r\nShould she?</span></div></div>",
            "created":1246510800,
            "id":717723,
            "title":"The trip to the bra store"
        },
        "11313111":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes and turn her into anything",
                "No, you're enjoying this"
            ],
            "content":"<div class=\"\"><div> <span>Sandra is happy that you said she can stay the night. Little do you know she has plans for you and you will be completely unaware.<br>\r\nShe starts by stipping down to absolutely nothing and gets into the bed with you while you are asleep but you won't be there for long because she turns you into your manhood. You awake to see Sandra insert you between her breasts and she notices and says \"Hi Dave, I'm treating you to this and this is thanks for making my breasts even more bigger.\"<br>\r\nAfterwards she asks if you want to be turned back and do the same to her.</span></div></div>",
            "created":1257051600,
            "id":784996,
            "title":"A night with Sandra"
        },
        "113131111":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes. It isn't gonna hurt anyone. ",
                "No due to there's too much risk because other staff members will be there."
            ],
            "content":"<div class=\"\"><div> <span>She puts you down and then you turn back to your normal self. Afterwards she sees your manhood and worries about what you are thinking. You then tell her to come with you because you want to transform her into something.<br>\r\n<br>\r\n\"Dave what exactly are you going to turn me into because we are nude and my breasts are massive.\" She worries as you have a look of serious planning on your face.<br>\r\n\"Oh you'll see what I is planned\" You wink to her.<br>\r\n<br>\r\nFirst you decide to turn her into quite a few things that go though your mind at the time. Sandra just looks at you as you start to think about it. Then it comes to you that you should turn her into something that is great in it's self, you turn her into water which then falls in a nicely placed bucket while some fell into a glass near the bucket which you didn't know about and drank it. \"What the hell Dave\" She mumbles in her watery form. \"It's time to put you into the bath. I'm sure there's enough of you here\" You say as you are running into the downstairs bathroom. Little do you realise that some of her fell into a nearby glass until then. \"Sandra I think I drank some of you! When you fell into the bucket a some of you landed in the glass which then I drunk\" So you quickly try to get that part of her out of your system but it's too late, it's reached your stomach. \"Dave how come you didn't realise what that was\" She mumbles. \"Sorry babe I'll refill that part up somehow,\" you panic.<br>\r\n<br>\r\nWhen you get in the bathroom you decide to try something really strange. You think about wanting to perform some sort of fusion with Sandra. Luckily you can't spill her because the bucket is much bigger than her body in the liquid from. After you put her in the bath, first you decide to lay in the bath but think that you're too big to enjoy it so you shrink yourself. Sandra is now a swimming pool which you enjoy because she's all around you. She then says about the part of her that you drank, well little did you know that after you transform back to normal that it was on it's way. You then stay laying down because you start to urinate in her. Prior to this you haven't had a drink or eaten anything so it was the part of her coming back. Then you stand up and prepare yourself for what you're about to do. Of course she doesn't know what is going on and she mumbles \"Dave why are you standing in me?\" \"Well you'll see\" You say as you then start thinking about the fusion. Seconds later your body turns into water and joins Sandra's which is perfect because you two didn't overflow the bathtub.<br>\r\n<br>\r\nYou then incant some phrase to transform you back but it transforms Sandra back and you're nowhere to be seen. She then wonders where you have got to and then looks at her breasts which has had the most biggest increase in size ever \"Dave where are you because my breasts are bigger for some odd reason.\" \"Er Sandra I hate to surprise you but the fusion went kinda wrong\" You say to her, \"I've wanted to have my body join yours but instead it went into making your boobs much bigger, so yeah I'm now your breasts which have grown and you know that it's pretty awesome.\" Sandra is creeped out by this but she lets you stay there for a few hours and she plays around with you rubbing them on herself quite enjoying it. The problem is that you miss playing around with them yourself so you ask her to do something to help turn you back. You ask her to be able to produce milk from her breasts so she can squeeze you out, she does this and then squirts milk from her breasts into the bucket which then shrinks her breasts back to normal size and you are the milk contained in the bucket. You then transform back to normal and she comes along to hug you but you decide to transform into knickers before she does but she catches you while falling.<br>\r\n<br>\r\n\"Dave what the? Why are you transforming yourself constantly.\" She asks.<br>\r\n\"Well your later transformation is gonna be so good that I'm letting you have your way with me\" You reply<br>\r\n\"Ok I'm gonna put you on and then sit on your couch. Watch out though I'm gonna do something with you\" She says while winking.<br>\r\n<br>\r\nSandra then lies on your couch with her breasts in the air and she is just thinking of what the later transformation will be. Will it be a big surprise or just mediocre. While thinking this she starts to get turned on and brings her fingers down towards you. She's gonna do the thing she said she'll do and that's have fun with herself and have you go in there. During your panic you transform her into her vagina and you as your penis yet again but you fall into her. She doesn't worry because she wants this so badly so she just enjoys your thrusting which you are doing by moving your balls. Now this is some odd sex that is going on in your house but you're enjoying this. However she wants turning back because this was accidental. So she turns back to normal but you're still in her so she pulls you out and decides to put you in her mouth. Now this is great as she is putting you in her mouth and sucking you, you then cum in her mouth and she loves it. Of course after you're finished spilling your load she turns you back and she asks you have planned for her properly.<br>\r\n<br>\r\n\"Ok Dave what do you have for me\" She asks.<br>\r\n\"Well it's a late night so this is the last one for tonight\" You say.<br>\r\n<br>\r\nYou then tell Sandra to lay back to the ground and then you think about a bed. All of a sudden you see Sandra just change into something. You see her head become the headrest complete with mouth so she can talk to you, her massive breasts turn into pillows and a secret hole in the bed where her vagina will be. \"Oh my God Dave you've turned me into a bed. Now this has a whole new meaning to the phrase sleeping with me\". Oh did I mention that her arms are a quilt.<br>\r\n<br>\r\nInstantly you climb upon her and fold her arms around you and position your head onto her breast. As soon as you do that she says to you. \"Dave you have a good sleep and you've exceeded yourself from what you did to me today.\" Sandra starts to sleep and you see that in her eyes then you wish her good night. While sleeping you forget that there's that hole in the bed and you feel something strange then Sandra wakes up.<br>\r\n<br>\r\n\"Hey that's my Vagina\" She shouts. <br>\r\n\"Yeah I noticed that.\" You shout back<br>\r\n\"Ok I'll let you go there again because I want to be with you forever Dave.\" She says lovingly.<br>\r\n\"Really? Well I want to be with you too.\" You reply.<br>\r\n\"Well let's have this day where our relationship hit a new high.\"She shouts.<br>\r\n\"Sssshhh you'll wake the neighbours babe.\" You tell her.<br>\r\n\"Oops sorry\" She says while embarrassed.<br>\r\n<br>\r\nThe morning breaks and you and Sandra both have work. She says that she doesn't want anyone to know what happens in our private life. She requests that stuff should be hidden. So you transform her breasts back to original size while for work and make sure that every secret between you two are kept between the pair of you.<br>\r\nSo you both are at work until home time but she says she wants to go to the beach. Also she wants to have her home body to show off plus she says she didn't bring a towel so you know what that means for you.<br>\r\n<br>\r\nDo you go to the beach and let her show off her new body, then turn you into a towel or you tell her no and save everything for being at home?</span></div></div>",
            "created":1278046800,
            "id":910479,
            "title":"Odd stuff then a female bed. Every man's dream ;)"
        },
        "1131311112":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "\"... we play hide and seek?\".",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"No Sandra, there's too much risk because other staff members might be there!\" you tell her. \"Oh!\" she replies crestfallen.<br>\r\n<br>\r\nHalf an hour later you arrive at your house after a short drive. Once inside Sandra looks at you expectantly. \"Well Dave, I wondered... With this spell we can transform into anything, right? How about...\".<br>\r\n<br>\r\n</span></div></div>",
            "created":1283317200,
            "id":948189,
            "title":"More fun over at your house!"
        },
        "11313111121":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Head - Sandra hides first.",
                "Tail - You hide first."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"... we play hide and seek?\". Now this turns you on tremendously. After agreeing on some ground rules and doffing your clothes you both throw coins to determine who should hide first.</span></div></span></div>",
            "created":1283317200,
            "id":948191,
            "title":"Hide and seek"
        },
        "113131111211":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... in the kitchen.",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hehe... ready?\" Sandra asks as you set two alarms on your mobile. The first is set to three minutes from now, the other to one hour after that. \"Ready!\" you answer and close your eyes as Sandra runs off.<br>\r\n<br>\r\nAfter three minutes of waiting the alarm goes off and you open your eyes. Now you decide to start searching...</span></div></div>",
            "created":1283317200,
            "id":948198,
            "title":"Head - Sandra hides first."
        },
        "1131311112111":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "You know where Sandra's hiding!",
                "You have no clue and investigate."
            ],
            "content":"<div class=\"\"><div> <span>... in the kitchen. In there you see a <a class=\"duLink\" rel=\"nofollow\" href=\"http://humanfactorsblog.org/wp-content/uploads/2009/01/milk.jpg\">jug filled with milk</a>  <a title=\"New Window\" href=\"http://humanfactorsblog.org/wp-content/uploads/2009/01/milk.jpg\" rel=\"nofollow\" target=\"_blank\"><img style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a> and some fruits like <a class=\"duLink\" rel=\"nofollow\" href=\"http://www.marconisida.com/wp-content/uploads/2007/12/frutta.png\">apples and bananas</a>  <a title=\"New Window\" href=\"http://www.marconisida.com/wp-content/uploads/2007/12/frutta.png\" rel=\"nofollow\" target=\"_blank\"><img style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a>. Also there's a jug of <a class=\"duLink\" rel=\"nofollow\" href=\"http://kara.allthingsd.com/files/2008/06/peanutbutter_skippy.jpg\">peanut butter</a>  <a title=\"New Window\" href=\"http://kara.allthingsd.com/files/2008/06/peanutbutter_skippy.jpg\" rel=\"nofollow\" target=\"_blank\"><img style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a>. And, if that wouldn't be enough, there's still the refrigerator.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1283317200,
            "id":948212,
            "title":"In the kitchen"
        },
        "11313111121111":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... a reply.",
                "... no reply."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hehe, clever, but I know as what you're posing, Sandra!\" you say and grab the jug of milk. \"You know, leaving the cup open was a mistake!\" you taunt the contents and get ...</span></div></span></div>",
            "created":1283317200,
            "id":948215,
            "title":"You know where Sandra's hiding!"
        },
        "113131111211111":{
            "author_id":"bankaixxx",
            "author_name":"Bankaimorph",
            "choices":[
                "Turn Sandra back",
                "Do something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Awww, was my disguise this obvious\", the milk blubbered.<br>\r\n<br>\r\n\"Heh, you forgot I am an expert in these things. Well, since I won, I get to decide on my prize!\"<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1311803280,
            "id":1155984,
            "title":"Gotcha!"
        },
        "1131311112111112":{
            "author_id":"bankaixxx",
            "author_name":"Bankaimorph",
            "choices":[
                "... drink her",
                "... bake her into a cake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to...<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1311803340,
            "id":1155986,
            "title":"What to do with a glass of milk?"
        },
        "113131111211112":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "It is her!",
                "It isn't!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>... no reply. \"Oh, then this isn't you!\" you mumble and examine the fruits in the jar more closely. \"Gotcha!\" you yell as you grab an apple.</span></div></span></div>",
            "created":1283317200,
            "id":948217,
            "title":"No such luck!"
        },
        "1131311112111122":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Success!",
                "Another fail!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Unfortunately you still get no reply (you both settled on the rule that the other has to say something once found). Now you look at the other fruit.</span></div></span></div>",
            "created":1283317200,
            "id":948218,
            "title":"It isn't!"
        },
        "11313111121111222":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "\"Stop!\" it comes from the peanut butter.",
                "No answer."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After grabbing another apple and a banana you still got no reply. \"Damn it!\" you exclaim. Just then you turn around, open a drawer and put out a spoon. Next you open the jar of peanut butter and threaten to stick the spoon in.</span></div></span></div>",
            "created":1283317200,
            "id":948221,
            "title":"Another fail!"
        },
        "113131111211112222":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... look inside the refrigerator.",
                "... look somewhere else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hell!\" you shout as there's still no sign of her. Now you look at the refrigerator. <i>She couldn't have, or?</i> you ponder. Next you decide to...</span></div></span></div>",
            "created":1283317200,
            "id":948222,
            "title":"No answer."
        },
        "1131311112111122221":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "\"Yes?\".",
                "No answer."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>... look inside the refrigerator. There, the first thing I saw was the fridge gunk on the floor. \"Sandra?\".</span></div></span></div>",
            "created":1354961100,
            "id":1483823,
            "title":"... look inside the refrigerator."
        },
        "11313111121111222212":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Yes",
                "No answer"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After you get no answer from the gunk you saw in the fridge, you take a look at the block of cheese that is sitting in the door. You pick it up and then say.<br>\r\n<br>\r\n\"Sandra, I've found you\"<br>\r\n<br>\r\nDo you get a response?</span></div></span></div>",
            "created":1355040660,
            "id":1484501,
            "title":"Hmm...ooh cheese"
        },
        "1132":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Her Arse",
                "A pair of boxers",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Like what?</span></div></span></div>",
            "created":1246424400,
            "id":717320,
            "title":"Turn her into something else."
        },
        "11322":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Let her suck you.",
                "Transform her"
            ],
            "content":"<div class=\"\"><div> <span>You watch as Sandra is turned into a pair of boxers which are red with a black trim. <br>\r\nWhen you get home you take off your trousers and change your boxers from your white ones to the ones that Sandra are.<br>\r\nShe actually doesn't mind being the boxers because all she is seeing is your manhood in her face. If she had a mouth she will try and suck you off.<br>\r\n <br>\r\nWill you let her or transform her again?</span></div></div>",
            "created":1246424400,
            "id":717374,
            "title":"A pair of boxers"
        },
        "11323":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "A towel",
                "A USB flash drive"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about any of these?</span></div></span></div>",
            "created":1246424400,
            "id":717351,
            "title":"Other"
        },
        "113232":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Have one copy of Sandra for immortality's sake",
                "Keep her as a digital girl forever"
            ],
            "content":"<div class=\"\"><div> <span>After you finished staring at the breasts of Sandra on the floor and thought about things, you start to think what you could potentially do.<br>\r\n<br>\r\n\"Erm Sandra, it's no accident that you are like that. I sort of tested something.\" You say with a sad tone.<br>\r\n\"Oh it's ok Dave, besides I love situations like this especially to me. I'll let you turn me into whatever.\" Says Sandra while you are holding her breasts and about to hug them, \"just be careful with me, ok?\"<br>\r\n\"Alright, you don't mind if I kiss you at all babe?\" You ask.<br>\r\n\"Sure, you didn't have to ask\" She replies.<br>\r\nYou kiss both her nipples and she says, \"Well what are you gonna turn me into now?\"<br>\r\n\"Uh-oh someone's coming\" You say as you jump into the nearest cubicle after you transform Sandra into a USB drive and catch her.<br>\r\n<br>\r\nMoments later there is no-one outside and the coast is clear. You reach into your pocket and sigh in relief that the woman you love is still safe. Looking at the small piece of plastic in your hand, you see it has the words \"My love always x\" written on it and you smile with a tear in your eye.<br>\r\n<br>\r\nLater on you get home and you place Sandra into your computer to see her there appearing on your desktop, you wave through your webcam as you go into the drive to back up her now digitisied form to which you place onto another USB drive that you lock away for safekeeping.<br>\r\n<br>\r\nWhat do you have in mind?</span></div></div>",
            "created":1339924620,
            "id":1361410,
            "title":"A digital girlfriend!"
        },
        "1132321":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "\"You're gonna use those two to test me dying safely\"",
                "\"Don't think about making more of me\""
            ],
            "content":"<div class=\"\"><div> <span>Once you locked the back-up USB drive away from harm, you head back to the PC to safely remove the original Sandra from it. Holding her in your hands fills you with joy as you then place her down on the floor and see the white flash as once it's gone a naked Sandra is there. You go to hug her.<br>\r\n<br>\r\n\"Hello once again Dave, why did you turn me back so soon?\" She asks.<br>\r\n\"Well you know when you said that you don't mind being turned into stuff and being careful, the first thing I thought of was backing you up on my PC.\" You say with a happy look on your face.<br>\r\n\"So now there's two of me but different realities, aww you're so sweet,\" she smiles.<br>\r\n<br>\r\nYou look at her now and think about the whole thing, she wonders something.<br>\r\n\"Dave, can I die now?\"<br>\r\n\"As long as there is a back up, nope.\" You say realising you're a genius, \"is it ok if I do this?\"<br>\r\nSandra feels all funny as she shrinks down and takes the form of a chocolate chip cookie on the ground, \"ah you're gonna test this. Well eat me, I've always been a sweetie hehe.\"<br>\r\nYou laugh as you pick her up and proceed to eat her but before you give her a kiss, \"I'll tell your copy all about this babe.\"<br>\r\n\"Well she'll have my memories so just explain that she can't die and she'll be fine,\" she says but noticing that you're not going to eat her, \"what's wrong?\"<br>\r\n\"I can't eat you, just wouldn't be right.\" You turn her back and give her a hug but then you notice that you have two spare USB sticks.<br>\r\nSandra looks at you and knows what you are up to.<br>\r\n<br>\r\nWhat does she say?</span></div></div>",
            "created":1339926180,
            "id":1361415,
            "title":"\"You copied me? Oh thank you Dave\""
        },
        "14":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Tell her to go into the toliets for a moment",
                "Turn her into a lollipop ",
                "She turns round and there's a bra on the floor which is you"
            ],
            "content":"<div class=\"\"><div> <span>You see a familiar girl standing there next to the others and you realise that it's your old school friend Candice who you had a major crush on. You remember that back then all you looked at were her breasts and once you were on a bus ride you managed to see her bare arse because of her jeans. \"Wait when did she work here because you haven't seen her about\" You think to yourself. Well whatever the reason it doesn't matter because she has fallen for you for some reason and your day has got better.<br>\r\n<br>\r\nYou know that she likes being called \"Candi\" and she is as sweet as her name impiles. She doesn't know what you have planned for her or how you'll surprise her when she turns round to look at you.<br>\r\n<br>\r\nWhat are you planning?</span></div></div>",
            "created":1282107600,
            "id":938522,
            "title":"Candice"
        },
        "141":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "You follow her.",
                "You turn her into something.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now you tell her that you've something special planned today and that she should go into a stall in the female staff restroom. \"Why?\" she asks you. \"Well, I've something in store for you!\" you tell her and she goes off.</span></div></span></div>",
            "created":1282712400,
            "id":943603,
            "title":"Tell her to go into the toliets for a moment"
        },
        "1412":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "You turn into Candice.",
                "You turn into a charlady.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Now you wait for almost minute. <i>Well, she should be seated by now...</i> you guess and recite the transformation spell that you found in an old tome of magic spells one week ago. As you feel the magic taking effect you smirk to yourself. <i>Good, but now I need to get into the ladies' restroom unnoticed!</i></span></div></div>",
            "created":1282712400,
            "id":943614,
            "title":"You turn her into something."
        },
        "14121":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "You go into the restroom.",
                "Someone interrupts you."
            ],
            "content":"<div class=\"\"><div> <span>\"But of course!\" you mumble and hide behind a potted plant on the hallway. Quickly you speak the spell in your mind and presto, a change kicks in! First you feel your testicles retreating in your body, next your ass grows a bit and small knots of flesh grow on your chest.<br>\r\n<br>\r\nIn seconds the small lumps turn into Candice's voluptuous C cups, just as your hair grows. Your longarm shirt turns into Candice's sweater, with your jeans becoming her skirt. Half a minute after you used the spell, you are essentially Candice's perfect duplicate, including clothes.<br>\r\n<br>\r\n\"Hehe... nice!\" you say as you feel your boobs. <i>And now...</i>.</span></div></div>",
            "created":1282712400,
            "id":943644,
            "title":"You turn into Candice."
        },
        "141211":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... the contents of the toilet bowl.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Next you open the door and enter the ladies' restroom. Upon entering the foreign territory, you notice some immediate changes. First of all the room isn't nearly as big, or at least doesn't seem to be, due to the extra space donated to the stalls lining the entire back wall. Secondly, the bathroom smells a whole hell of a lot better. Perhaps girls spray perfume after taking nasty dumps? You really have no idea. <br>\r\n<br>\r\nLuckily for you the room is otherwise empty. You begin heading to the only stall with a door only slightly ajar, but stop to look at yourself in the mirror again. <i>Oh yeah, I really am Candice! Oh wow!</i> you ponder as you see your jiggling breasts.<br>\r\n<br>\r\nJust then the real Candice's voice can be heard. \"Hello? Help!\" she cries. Smirking you open the stalls door and walk in. \"Hello Candice!\" you say towards...</span></div></div>",
            "created":1283230800,
            "id":947821,
            "title":"You go into the ladies' restroom."
        },
        "14123":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "You have a better idea and go into the men's restroom.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><i>Or do I?</i></span></div></span></div>",
            "created":1283144400,
            "id":947298,
            "title":"Something else"
        },
        "141231":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... stand in front of the urinals.",
                "... vanish into a stall."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just then you have another idea which has to do with another magic spell you found earlier. Quickly you walk into the men's restroom where you...</span></div></span></div>",
            "created":1283230800,
            "id":947814,
            "title":"You go into the men's restroom."
        },
        "1412312":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... and something appears out of nowhere.",
                "... but nothing appears."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>... vanish into a stall. <i>Oh well, I hope I won't screw this teleportation spell up!</i> you ponder after locking the door and start to incarnate the magic words. Seconds later you feel the magic taking effect...</span></div></span></div>",
            "created":1283490000,
            "id":949311,
            "title":"Magic Teleportation"
        },
        "14123122":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Suddenly you feel a pressure in your bladder!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>... but nothing appears. \"What...\" you mumble.</span></div></span></div>",
            "created":1283490000,
            "id":949312,
            "title":"... but nothing appears."
        },
        "141231222":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "She got teleported somewhere.",
                "She's still over in the ladies' restroom."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happened to the already transformed Candice?</span></div></span></div>",
            "created":1283490000,
            "id":949314,
            "title":"Magically transformed AND teleported?"
        },
        "1412312221":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... one of the urinals in the restroom (she is urine).",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She got teleported somewhere - with 'somewhere' being....</span></div></span></div>",
            "created":1283490000,
            "id":949315,
            "title":"Magically transformed AND teleported!"
        },
        "1413":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "You turn yourself into something.",
                "You turn into the toilet she's sitting on.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What have you in store for her?</span></div></span></div>",
            "created":1282712400,
            "id":943604,
            "title":"Something else"
        },
        "142":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "A thong",
                "Knickers",
                "Tanning cream for a tan session later"
            ],
            "content":"<div class=\"\"><div> <span>Candi is just walking ahead of you when you think of having a lollipop for some reason. Right in front of your eyes you see her clothes come off and she's shrinking down also with a stick forming under her feet. \"What's going on Dave\" She cries. \"Oh you're just turning into candy, Candi. Just like your name\" You say while smiling.<br>\r\n<br>\r\n\"Well this is not what I had in mind\" She says as you're about to grab her from the floor.<br>\r\n<br>\r\nYou peel back the plastic wrapping which surrounded her and look at her now candied self, amazed at what exactly has happened in terms of her. The breasts are still poking out, everything is in proportion. To you this is a perfect lolly which you start licking her and judging by the look on her face she is enjoying it \"Ooh this is good Dave, get your tongue under there and do it well\" She says while your tongue is nearing her breasts. \"Also don't be afraid of sucking them too\"<br>\r\n<br>\r\n\"WOAH She's getting very sexual about this even though there's risk that I can bite her and kill her.\" You say shocked about how Candi is enjoying this. \"Can't she be something without so much risk. Erm but what, I know\" You exclaim.<br>\r\n<br>\r\nYou take Candi out of your mouth and lay her down onto the table in which you then turn her back to normal. That however has got her so turned on that she wants a piece of you and she decides to transform you into something better than that. \"Well Dave you know back on that bus you saw my arse, well how about you be near my arse or more better wiped on it.\" She says maniacally. <br>\r\n<br>\r\nWhat exactly does she turn you into?<br>\r\n<br>\r\n </span></div></div>",
            "created":1282107600,
            "id":938528,
            "title":"Turn her into a lollipop "
        },
        "1423":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Shrunk down",
                "A towel for her to lay on now",
                "Own choice"
            ],
            "content":"<div class=\"\"><div> <span>You look at Candice with a confused look on your face as she says that she has no tanning cream for later. Does this mean she is gonna rub you all over her body just to help get a tan. Yes she is.<br>\r\n<br>\r\nYour body starts gooing up and she gets the nearest pot that she can see so you can be stored in there. It's 12:30PM and work is finished for the day, she grabs you in the pot and puts you in her bag. \"See you later everyone\" She says with a happy look on her face. She is going to relax for the rest of the day outside in the sun.<br>\r\n<br>\r\nAfter the drive to her house out of the watchful eye of neighbours and passers by, she goes indoors and completely strips down all of her clothing until there is no fabric on her. Then she reaches for you in her bag and takes you out while loosening the lid, she doesn't let any of you spill as she catches the gooed you and puts you straight on her pert butt which she rubs in. \"So how do you feel being there then Dave. That's where you've always wanted to be isn't it?\" You cannot speak because of your rubbed in self on her whole back. She then lies there and let's herself develop a browness which has come from you so now you're a part of her, well half of you is because she hasn't done her front side.<br>\r\n<br>\r\nShe then flips over and starts grabbing your gooed body again, this time rubbing it on her breasts and near her vaginal area in which she then surprises you by pulling out what is familiar to you. That is your penis!! \"Yeah you knew that I wouldn't let you transform and keep this Dave, so I'm making good use of it\" She says down to the remaining amount of you. There's a brief moment after she rubbed you in on her front that she thinks 'what have I done to him' but she goes 'well I have the best part of him here and he's this tan that I have, maybe I should not of done this'. She tries to then rub you off her front and sorts out her back but it seems too late until you remember something and that is you'll be able to get yourself out of her body via sweat so you make her lie on her front until you fall back into the pot. She turns round to see you back in there and puts your penis in the jar which is lying on her front, what happens after that is you transform right on Candi's front but you notice something and that is that you are....<br>\r\n<br>\r\nWhat are you now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1282107600,
            "id":938688,
            "title":"A bottle of tanning cream"
        },
        "14232":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "She transforms into your penis and you back to normal. Her boobs are plastic",
                "A list of other stuff"
            ],
            "content":"<div class=\"\"><div> <span>Candice picks up your penis from the jar and pours the sweat near you as you then start to morph into fabric. Candi's back then turns into fabric because of the tan is you as well so she grabs you and puts you together. She then takes you off her naked body and positions you on the grass ready to lay on.<br>\r\n<br>\r\nThere is one little thing that she wanted to do first and that was check to see if you had your penis after she made you turn into that towel. Happily for her you do but it's embedded onto the fabric which she is then disappointed about. She goes to incant the spell and in a instant you start seeing your penis come out of the towel into the real one. It's erect which she notices and then smiles.<br>\r\n<br>\r\n\"Oh yeah this is good,\" She says as she lays you on the ground with your penis up in the air and positions herself directly above you.<br>\r\n\"Candi what are you doing.\" You ask,<br>\r\n\"I'm wanting to have sex with you and right now seems the perfect time,\" she replies.<br>\r\n\"Huh well I wanted to do you for ages so let's go then but I warn you that we can end up transforming at any time due to the weird circumstances lately.\" You warn her<br>\r\n\"I'm ready for that,\" she says<br>\r\n<br>\r\nSo she lowers herself down and your penis goes into her to her delight and she thrusts her hips to get it going. However you're now seeing Candi come down on you constantly but weirdly her breasts hit you in the face but you then open your mouth (that wasn't completely embedded) which then catches her nipple. There is a light that then flashes which could mean something bad. You're transforming and so is Candi.<br>\r\n<br>\r\nWhat happens to you two?<br>\r\n</span></div></div>",
            "created":1283490000,
            "id":949383,
            "title":"A towel for her to lay on now"
        },
        "142321":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "\"Awesome!\" she replies in excitement.",
                "\"WHAT!?\" she freaks."
            ],
            "content":"<div class=\"\"><div> <span>As the flash's gone you see that you're back to normal. \"Phew!\". Just then you notice that Candi's gone. Curious you look down and see this lying on the floor, which you presume is her.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://farm1.static.flickr.com/196/458920472_b6f119cec7.jpg\" target=\"_blank\">http://farm1.static.flickr.com/196/45892...</a><br>\r\n<br>\r\n\"Ca-Candi?\" you ask the plastic tits. \"Dave!? What the hell are those plastic boobs doing on the floor? Hey, they look like mine!\" you hear Candi's voice. \"Candi, where are you?\" you ask her. \"I don't know!\" she replies. <i>Just great!</i>. \"Wait, I'll try to move!\" Candi says. And suddenly you feel movement, only it comes from your dick!<br>\r\n<br>\r\n<i>No way!</i> you think as you see your 'little' friend seemingly moving on its own accord. \"Aagh! Dave, I can't really move forward!\" it comes most definitely from your dick. Intrigued you close your palm around it and bend it upwards. \"Hey, I can see you!\" Candi says and you see your penis' meatus forming the words like a mouth. \"What, what is it?\" Candi queries as she sees the shocked expression on your face.<br>\r\n<br>\r\n\"Uh, Candi, I don't know how to say this... You, you are my penis!\".</span></div></div>",
            "created":1283576400,
            "id":949826,
            "title":"Candi the peni"
        },
        "142322":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now there's a lot what could happen to you! Do you turn into her vagina while she turns into your cock &amp; balls?</span></div></span></div>",
            "created":1283490000,
            "id":949402,
            "title":"A list of other stuff"
        },
        "14233":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you her sweat, contained in the jar?</span></div></span></div>",
            "created":1282712400,
            "id":943684,
            "title":"Own choice"
        },
        "142331":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "\"Sure!\"",
                "\"Hehe... No!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"What!? Oh gosh Dave, you're me sweat!\" Candice says as she sniffs the contents of the pot. \"What? Oh no! Candi, change me back!\".</span></div></span></div>",
            "created":1283317200,
            "id":948335,
            "title":"Sweat sweat."
        },
        "1423312":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "But you  could get even with her by using the spell, too!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hehe... No!\". \"WHAT?\" you gasp in shock. Without her lifting the transformation spell (well, actually curse) there's no way to change back for you on your own.</span></div></span></div>",
            "created":1283317200,
            "id":948337,
            "title":"\"Hehe... No!\""
        },
        "14233121":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... snot.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Just then you have an idea: you could get even with her by using the spell, too!<br>\r\n\"Well Candi, since you don't want to change me, I'm going to change <i>YOU</i>!\". \"Wha-? No, no NO NO!\" she yells, but just then she starts to change into...</span></div></div>",
            "created":1283317200,
            "id":948341,
            "title":"Let's get even with Candi!"
        },
        "142331211":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "\"... I'll change you back!\"",
                "\"... two can play this game!\""
            ],
            "content":"<div class=\"\"><div> <span>... something. In seconds you watch sexy Candice's body shrinking and turning yellowish-green. Over the time of half a minute she's turned into a heap of nasal mucus on the floor. \"Dave!\" she yells furious. \"Oops, sorry Candice! I will change you back if you do the same with me!\". \"Alright Dave, ...\".</span></div></div>",
            "created":1283317200,
            "id":948349,
            "title":"... snot."
        },
        "1423312112":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... some of her menstrual secretion.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"... two can play this game!\" she says as she incarnates the spell that will transform you, this time into...</span></div></span></div>",
            "created":1283317200,
            "id":948352,
            "title":"A game for two"
        },
        "14233121121":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "\"Well, let's change back to normal!\" she proposes.",
                "You turn her into something more disgusting."
            ],
            "content":"<div class=\"\"><div> <span>... something awkward. Once the change is over, you realize that you're something slimy and horrible smelling. \"Ew... What am I?\" you ask. \"Hehe... Dave, you really have no idea, don't you? You are some of my monthly flow!\". \"WHAT!? You bitch, I'll get you for this!\" you yell and incarnate the spell again to turn Candice into her own pee.<br>\r\n<br>\r\n\"What...\" it comes from her as the changes kick. \"Hehe... Candice, now you're really pissed off!\". \"DAVE, OH WAIT!\" the living piss yells. Next you realize you're changing again, this time into crap. \"Ha ha...\" Candice smirks. \"Candice!\" you yell in shock.</span></div></div>",
            "created":1283403600,
            "id":948727,
            "title":"Body fluids transformation fun"
        },
        "142331211211":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "She changes back.",
                "That's when suddenly..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Well, let's change back to normal!\" she proposes.</span></div></span></div>",
            "created":1285736400,
            "id":965660,
            "title":"Back to normal?"
        },
        "1423312112112":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... someone was at the front door!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That's when suddenly...</span></div></span></div>",
            "created":1285822800,
            "id":965932,
            "title":"That's when suddenly..."
        },
        "14233121121121":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Candice's sister, Nicole!",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>... someone was at the front door! Who could that be?</span></div></span></div>",
            "created":1301288400,
            "id":1077889,
            "title":"... someone was at the front door!"
        },
        "142331211211212":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Her landlord!",
                "Somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who could that be?</span></div></span></div>",
            "created":1301354340,
            "id":1077890,
            "title":"Someone else"
        },
        "1423312112112121":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "Unfortunately, the next thing you hear is the door getting unlocked!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Knock-Knock! it suddenly comes from the door.<br>\r\n\"Miss Mitchell?\" the voice of an elderly man asks.<br>\r\n<br>\r\n\"Oh damned, that's my landlord, Mr. Carnel! He can't see us like this!\" Candice whispers.</span></div></span></div>",
            "created":1305871140,
            "id":1109348,
            "title":"Her landlord!"
        },
        "14233121121121211":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "The same instant she uses the spell...",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Unfortunately, the next thing you hear is the door getting unlocked! \"Oh crap!\" it comes from Candice.</span></div></span></div>",
            "created":1305893220,
            "id":1109433,
            "title":"Unfortunately, the next thing you hear is the d..."
        },
        "142331211211212111":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... she turns into...",
                "... you turn into..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The same instant you hear Candice mumbling the transformation spell, next...</span></div></span></div>",
            "created":1305893640,
            "id":1109435,
            "title":"The same instant she uses the spell..."
        },
        "1423312112112121111":{
            "author_id":"zackfairlegend",
            "author_name":"zackfairlegend",
            "choices":[
                "Bar of chocolate",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to her?</span></div></span></div>",
            "created":1366018680,
            "id":1572128,
            "title":"... she turns into..."
        },
        "1423312112112121112":{
            "author_id":"gugubu",
            "author_name":"gugubu",
            "choices":[
                "... a duplicate of Candice.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>... you turn into...</span></div></span></div>",
            "created":1305893760,
            "id":1109436,
            "title":"... you turn into..."
        }
    },
    "info":{
        "author_id":"zackfairlegend",
        "author_name":"zackfairlegend",
        "brief_description":"A man in his work has crushes on a lot of girls who work there,\r\n",
        "created":1246461240,
        "description":"<td align=\"left\" class=\"norm\">Your name is Dave and you are 23. You work in the marketing department of Sandy beach enterprises. Dave has crushes on a lot of ladies who work there and even likes some in accounts. Little does he know the day gets weird.<br>\r\n<br>\r\nThe girls are;<br>\r\nSandra,24. She works in sales and has great tits and a arse to match.<br>\r\nChristine,22. The woman in accounts who also has great breasts and likes you a lot.<br>\r\nCindy,22. The other woman in accounts who also likes you and has medium sized breasts. <br>\r\nCandice, 23. A old flame of yours from back in high school who you wanted to be with forever. The perfect girl with great C cup breasts and cute arse.<br>\r\n<br>\r\nRules.<br>\r\nYou can add other girls. <br>\r\nDave is not gay so no guys.<br>\r\nBe experimental.<br>\r\nYou can shrink Dave, grow the girls, have Dave transformed into an inanimate object and the girls can be transformed into their body parts or anything. It's all up to you.<br>\r\nNO SHIT BASED TRANSFORMATIONS<br>\r\n<br>\r\n<span class=\"clred\">I will be giving you 100 GP for every chapter but only if it is more than a 1 paragraph entry</span></td>",
        "id":1576932,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1395826860,
        "modified":1395826860,
        "pretty_title":"The ultimate male fantasy story"
    }
}