{
    "chapters":{
        "1":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Anime",
                "Games",
                "Celebrities",
                "Original",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It begins. Pick from any of the following choices, and begin your descent into the girl of your dreams....</span></div></span></div>",
            "created":1149742800,
            "id":323291,
            "title":"Genre"
        },
        "11":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Sailor Moon",
                "Digimon",
                "Tenchi Muyo",
                "Fushigi Yugi",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>An otaku? Well, you've come to the right place. Keep in mind, just like others, if you don't find any of these choices to appealing, you can make more under Other. Just make sure to leave an \"other\" option so other people have the same privilege.</span></div></div>",
            "created":1149829200,
            "id":323292,
            "title":"Anime"
        },
        "111":{
            "author_id":"joeball",
            "author_name":"kreeper57",
            "choices":[
                "Beats her up",
                "Gulps her up"
            ],
            "content":"<div class=\"\"><div> <span>Usagi was not paying much attention to her surroundings-as usual-and didn't notice Aluminum Seiren was watching her when she transformed into Sailor Moon. <br>\r\nAluminum Seiren now had something over on Sailor Moon and ran to tell Lead Crow immediately. Well, first she had to stop and get something to eat. She ran into Ikuko Tsukino and reckognizes who she is and decides to have some fun. She mentions that she knows Ikuko's daughter and has a secret. Ikuko asks what it is and AS tells her it is private and to come in closer and she will whisper it in her ear. Naively, she does and after she is right next to her AS opens wide and takes her into her mouth. She strips off the poor woman's clothes and fondles her breasts as she takes them in and then fingers her pussy as she lifts her up and gulps her down. \"Ooops! I forgot to tell her that her daughter is Sailor Moon! Burp!!\"<br>\r\nShe waddles over to Lead Crow, her busty best friend and fellow fiend. Crow wants to know who is digesting in Seiren's stomach. \"Sailor Moon's mommy!\" she giggles. Crow demands what she is talking about and Seiren tells the whole story. Crow cackles evilly and then the Sailor Scouts appear. Sailor Moon confronts the slightly slimmer Seiren and is ready to fight when seiren calls her Usagi and points to her tummy and tells who its tenant is. <br>\r\nSailor Moon...</span></div></div>",
            "created":1282021200,
            "id":938240,
            "title":"Sailor Moon"
        },
        "112":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Yes",
                "NEIN!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Righto. The obvious one first: How 'bout Renamon?</span></div></span></div>",
            "created":1150952400,
            "id":325962,
            "title":"Renamon?"
        },
        "1121":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "You head home",
                "You grab someone off the street for some fun and dinner"
            ],
            "content":"<div class=\"\"><div> <span>You stare down at them from the top of the building like they’re insects. They are only made of flesh and bone, while you are data. Sleek, silent, perfect data. No other creature on this world can compare to your stealth or grace. You can sneak up on anyone in this world and be on them before they even hear your footsteps. No person is perfect, but you are not a person. You are a silent killer, stalking the night for prey. No one has ever heard you coming or seen you until it’s to late.<br>\r\n<br>\r\n*Grumble!* <br>\r\n<br>\r\nUnless of coarse, they hear your stomach growling. Sighing, you sit down on the rooftop and brood. Today marks a day that you should be happy and celebrating.  On this day you should have a smile on your face and a full belly, but instead, you’re sitting on a roof, watching humans go by and wondering how they would taste. Today is the day that all Renamon should look forward to all year, but you’ve been dreading it since your tamer/master forbid you from following your instincts. On this date, your matting season has started.<br>\r\n<br>\r\nUnlike other species, which only get the urge to reproduce, when Renamon’s mating season begins, there are two urges that surface. The urge for pleasure and the urge to eat. Renamon’s are carnivorous digimon, able to eat anything twice their size without chewing on it. Although your race has the appearance of a kitsune or Japanese fox, you have more in common with the snake, able to stretch over it’s prey and swallow it whole. Not only does it make eating easier, but also makes sex very interesting. You’ve had many lovers over your time, some were twice your size and you rode on their hands like a child, but all of them ‘fit’ inside you ether when you got randy or hungry. <br>\r\n<br>\r\nHowever, when you came to earth, your tamer, Rika, ended your fun.<br>\r\nFirst thing she did, was order you to never eat anyone or have sex, which by the way, were you’re favorite things to do. You have bared through it for now, but with your matting season starting, your urges will triple and not even the command of your tamer will stop you from feasting or pleasing yourself on any human that crosses your path. You had tried to explain it to Rika, but she just glared at you and told you, ‘to buck up and deal with it’. It was easy for her to say, she had never felt the pleasure of having a living person wiggling around in her stomach. Maybe it would show that arrogant bitch who’s boss if you went home and ate her in her bed, or better yet, you got two holes down below that need filling, maybe after a few nights tucked away inside your womb or rectum will teach the brat not to mess with you.<br>\r\n<br>\r\nYou shake of those thoughts out of your head, it’s just the hormones talking, you can fight this. On the other hand, Rika didn’t have to know if you took a little snack of the street and ate it before going home. Sure, you’d have to wait for the meal to digest before leaving, but your metabolism will eat through any person in minutes. If you don’t eat someone now, you may very likely go home and take out your hormones and hunger out on Rika, which the more you think about it, doesn’t sound like a bad idea.<br>\r\n</span></div></div>",
            "created":1151038800,
            "id":326044,
            "title":"Renamon mating season"
        },
        "11211":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "Rika wakes up",
                "Rika sleeps on"
            ],
            "content":"<div class=\"\"><div> <span>As much fun as it sounds to kidnap someone off the street, molest him or her, and then eat him or her, you decide not to. What’s stopping you isn’t morals or loyalty to Rika’s command, but rather your pride. If you disobeyed your orders from Rika, then it would make you seem soft and easily controlled by your emotions. If there was something all Renamon’s weren’t, it was soft. <br>\r\n<br>\r\nGiving the smorgasbord walking casually down the street one more look, you start roof hopping back home. Your unnoticed by the people below you as you hop from rooftop to rooftop, nearing the home of your tamer. Your sleek fur blows in the wind as you run, giving you a sense of freedom and independence, two things that you love dearly. The more you think about it, the more you feel unsure about your relationship with Rika. When you first joined her, you thought that you and the small human might be partners. Both having equal rights and control in the relationship. <br>\r\n<br>\r\nYou also secretly thought that there was a chance that your partnership could perhaps become physical over time. Like most Renamon, you’re bisexual and enjoy partners of both genders in both the bed and the menu. For a long time, you’ve imagined cold and spunky Rika, lying at your feet as your servant, only you can think about much more things she can do for you beyond fighting. You don’t know if it’s the mating cycle kicking in or if your just incredibly horny, but right now, your fur feels real hot.<br>\r\n<br>\r\nYou’re so distracted by your condition, that you nearly pass Rika’s house. At the last moment, you stop and stare at the looming abode. It’s not too late to hunt down a cute guy or girl and have a little fun and meal with them. No one would know about your momentary slip, but you. However, you do head into the house silently. Maybe it’s your pride still controlling you or maybe you secretly only want one person to eat and screw, and she’s in this house. As you pass by the doors to Rika’s mother and grandmother, you hear not a peep from ether room. It hits you, both guardians aren’t here. Dark thoughts enter your mind at the realization that no one is home except Rika. You could do anything you pleased with her and no one would hear her scream. <br>\r\n<br>\r\nWith every step you take closer and closer to Rika’s room, you feel your reluctance to take the girl diminishing. After all the years of serving her, obeying her every demented order and letting herself be put down and humiliated, didn’t you deserve a little payback? You didn’t even have to digest the brat, let her spend a few days inside one of her holes and see how spunky she is. She’ll think twice before ordering you to ignore your mating season. <br>\r\n<br>\r\nStanding in front of Rika’s door, you turn the doorknob with your furry right hand and step inside. You see the object of your obsession sleeping peacefully on her futon, completely unaware of the massive headache sees caused you this evening. So easy would it be to kick her awake and make her play the servant, or better yet, eat her while she’s asleep and let her wake up in the burning acid of your stomach. If you ate her now, her punishment might be quick, but it would still be fun. You take a tentative step to her and loom over her. Her cold, emotionless face looks so serene when she sleeps, like a baby. You wonder what her face would look like as your wolfing her down or forcing her up your hindquarters. Your imagination makes you tremble and you reach towards her. <br>\r\n</span></div></div>",
            "created":1152334800,
            "id":329478,
            "title":"Desire"
        },
        "112112":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Swallow her whole",
                "Put her in down there"
            ],
            "content":"<div class=\"\"><div> <span>Your paw inches closer and closer toward that which you desire, and you can feel your entire body getting warmer, emanating waves of heat throughout the room. It was quite a marvel, but then, it goes to show why this state is called a heat. You can hardly stand from the intense pressure, both by the weakness of your muscles when confronted with the balmy temperatures and from the knowledge that the act you are about to take part in is entirely forbidden. The closer you get, the less you think of these distractions; you become more focused on your goal of independence from this demanding irritance. <br>\r\n<br>\r\nYour paw reaches Rika after what seems like aeons, a time stretched from reality into eternity, and you caress the tamer's forehead. Cold is all you feel; cold relative to your own temperature, and the coldness that wraps around her perpetually. Unawoken by your advances, Rika continues to slumber peacefully, and it is truly confirmed in your mind that she is yours; she can not and will not fight your actions. When all doubt leaves your mind, the feeling of hunger becomes stronger than ever, and so does the feeling of longing for stimulation... You must take some action soon, or you won't be able to contain yourself.</span></div></div>",
            "created":1152421200,
            "id":329537,
            "title":"Rika is yours"
        },
        "1121122":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Slide her in your pussy",
                "Shove her up your butt"
            ],
            "content":"<div class=\"\"><div> <span>You realize that you can fulfill two needs at once: the carnal delights you revel in and the emptiness that plagues you, simply by consuming the brat before you in a less orthodox method. Sliding onto the bed at the zenith of grace, your body completely covers Rika's, her own pressing into yours, driving you mad with anticipation. You grab hold of the headboard and slide forward, bringing your dripping vulva straight to Rika's face. You can see her expression change ever so slightly to one of discomfort, and you know full well why; the scent and the warmth combined were enough to penetrate even dreams themselves. Now, though, you find yourself conflicted... should you indeed slide Rika up your lovehole, or would it be better for her to take the darker route?</span></div></div>",
            "created":1152421200,
            "id":329540,
            "title":"Up {i}something{/i}"
        },
        "11211221":{
            "choices":[
                "Change her",
                "absorb her"
            ],
            "content":"<div class=\"\"><div> <span>REnamon grinned as she slowlypressed her vulva down onto rika's face and groaned as she felt waves of pleasure rack her body as rika slid into her love tunnel. Unbeknownst to Ren,Rika woke from the noise and began to buck and thrash as she realized what was happening. \"Let me out Renamon! Why are you doing this to me?!\" \"(groans)I want to make you like me my sweet little heartbreaker,and I will do just that!\" A powerful contraction pulled Rika into Ren's snatch up to her neck. Renamon took this chance to suck on her tamers budding breasts before she went under comepletely. Rika moaned and writhed as she recieved this pleasure. Renamon theen sucked RIka the rest of the way into her womb. what will Renamon do to Rika?</span></div></div>",
            "created":1242018000,
            "id":689612,
            "title":"Slide her in your pussy"
        },
        "112112212":{
            "choices":[
                "become her and take her life eat others",
                "merge with her and become a rika with a fox ears and tail"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>but how do you absorb her </span></div></span></div>",
            "created":1250485200,
            "id":745846,
            "title":"absorb her"
        },
        "1121122121":{
            "choices":[
                "renikamon is born ",
                "renamon dress like rika from now on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>renamon was now wearing rika clothes </span></div></span></div>",
            "created":1275973200,
            "id":896705,
            "title":"become her and take her life eat others"
        },
        "1121122122":{
            "choices":[
                "read the former rika dairy about how to live her life",
                "or go to the near by park to absorb more girls"
            ],
            "content":"<div class=\"\"><div> <span>renamon looked at her now swollen belly. \"well rika you wont let me do much as me but lets see want i can do as you\" said renamon. on the inside rika started to panic \" what are you going to do\" rika asked quaking with fear \" as i said i going to become you mind body and soul\" rena said. the merge had already begun, rika was moved form her partners womb to the center of renamons body. on the outside renamons body started to shrink and take the form of rikas body, it only took a few minutes before renamon had rikas body shape <br>\r\n<br>\r\nrena's fur started to thin being pulled back into her body when it finshed rena looked exactly like rika even rikas red hair became renas her new red hair came down to her back. rena grabbed rikas hair clip off the floor and put it in the same fashion rika would. rena looked in the nearby mirror the only thing diffrent is that rikas eyecolor was replaced by renas icey blue eyes.<br>\r\n<br>\r\nrena grabbed rikas panties that fell off her during entery and slid them on she then put on a thin blue strap white tank top. she also found a black skirt and put it on as well she grabbed a pair of knee high black boots and slid them on\"i'm no longer rika i just rena\" she said to no one.</span></div></div>",
            "created":1294117200,
            "id":1029130,
            "title":"merge with her and become rika"
        },
        "11211222":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Go after any humans you can find",
                "Find another Renamon somewhere"
            ],
            "content":"<div class=\"\"><div> <span>It seems inevitable that this brat should end up in your rectum one way or another; the womb isn't the best route to the stomach. So, you figure, what harm could it do if she starts there instead of ending up there? None, of course, and rather it should do good. You had always been one that followed the rules... at least since your tamer came along. What perfect irony that you should teach her a lesson by breaking the rules, putting her in the exit-only opening. Besides, it was perfect for your purposes. You needed a way to keep her in you, and the butt is easily one of the harder places to escape from. On the flip side, it's also the most easy container to eject something from when the time comes.<br>\r\n<br>\r\nYou slide your hindquarters across Rika's face, \"salivating\" from your lower half. Miraculously, she had not woken during any of this, and you suspect she won't for some time, easily enough for you to finish your task. You drop your rear, now directly above Rika's face, burying her nose in your depths. This would serve as another lesson, you chuckle; one that would teach her what kind of attitude is expected from now on. You slide your backside across her face, back and forth, her nose delving in and out each time. Feeling complete bliss, waves of pure ecstatic sensation pulse through you, rendering your brain almost unable of coherence. Your entrance opens more and more, and your master's head is already inside you before you even have a chance to realize. You push off against the headboard, raising your rear in the air, Rika still lodged within, bringing her up to a sitting position. Waves of ooze pumped forth from your entire nether region, covering the tamer in a rich sheen. You lean back, sitting on Rika's shoulders, and they - along with her entire upper body - slide in as though there were no friction at all. As you feel the huge mass enter your bum, you fall out of sync with reality for just a moment, your vision blurring from the pulse of pure pleasure that crushed your very being. Something was strange about this; you couldn't quite put your finger on it, but it was far more pleasurable than you thought possible. Maybe, just maybe, it was because you now would have the freedom to enjoy it? Or maybe it was merely the sense of payback for all the orders Rika had given you without once considering your feelings... Psychological reasoning aside, you can feel the body start to stir, if only a little. At this, you quickly lift your backside into the air, flinging your butt meal's legs up. Now it was definite. You can feel the being punching your insides, and the legs that still remain outside of you begin to kick, gaining intensity at a rapid rate. Reaching around, you swiftly catch both of Rika's legs, work your arms down to her knees, and push as hard as you can. It seems you hardly needed to give much force at all, as the tamer falls in at a rate that seems like she's plain falling, never mind into anything. The legs that still dangle by the knee outside of you quickly slip deeper, deeper into your abyss, as your back mouth greedily gulps down more and more jeaned calf, never relenting. Finally, Rika's feet reach your anus. Once again, you feel the same pleasure as before, the same waves of stimulation flowing through you as the awkward smoothed appendages burrowed into you. You feel compelled to stretch out on the bed, and that does nothing to stop the feeling; rather, it intensifies it as your glutes are now massaged, amplifying the weight with which your exit is massaged. Your cheeks, which share the same waves of pleasure, become tighter and tighter, and they constrict your tamer's feet more and more, pressing, pushing, until finally they slip inside you, sending one more grand burst of glory across your muscles. <br>\r\n<br>\r\nRolling over, you can still feel her struggling inside you, poking and prodding, searching for the way out. You can't bring yourself to care; the feeling is too immense, to powerful, and the only thing you can understand at this point is that you want more, more of this feeling, more of these things inside you, more of this pleasure that consumes your soul. You roll out of the bed with catlike - or foxlike - speed, flipping yourself upright on landing, with your gut swelled to quite a degree. You hardly notice any drop in agility; you're too focused on your goal. You want more.</span></div></div>",
            "created":1152421200,
            "id":329542,
            "title":"Rika's demeanor IS less than sunny..."
        },
        "112112221":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "Rika POV",
                "You begin hunting for a mate and meal"
            ],
            "content":"<div class=\"\"><div> <span>You take tentative steps towards the door, making sure to squeeze your posterior with every step. Your hunger sets you into motion, infusing you with the desire for more of this luscious feeling of fullness. Right now, you really need is a big Renamon stud, that can give you the loving that you so richly need. Hell, at this moment, you’d settle of a lovely little she Renamon to keep you company. Sadly, you haven’t seen another of your race since entering the real world, which although sad, won’t deter you from fulfilling your needs. Even before you came to the real world, you have settled for lovers not of your race; you’ve seen taken member of a whole different species. Why you remember a fun night, where you had a quickie with a Gekomon in his lair and then let him sleep it off in your stomach. No, you’d survive if you had to take a human to bed with you. Thinking about having some unaware male, or female, submit to your perverted desires and hunger, only gives you more energy as you leave Rika’s room. You’ll find some lovely little creature, show them the time of their short lives and then end their lives in your empty stomach.<br>\r\n<br>\r\n You feel your insides, rearranging and tightening around the imbedded victim inside your rear. Your anus tightens as her struggles strengthen, but to nowhere the degree needed to break free of your bottom hole.  You can’t imagine what Rika must be going through inside you. She woke up with her head already buried inside your rump; she probably doesn’t even know where she is. The thought bothers you slightly, knowing that Rika is aware of her helplessness would only go to further your arousal. Maybe after you satisfy your other carnal needs, you can discus with Rika’s her placement in your bowels.  As you step out of the room, your tail swishes as you walk down the hallway quietly. The kicking and punching as slowed down slightly and you grow displeased. From what you know about your former master, right now she is using her supposedly gifted mind to try and cogitate on an escape plan from your insides. It infuriates you that even when she’s unaware of you, Rika continues to be a hindrance in your enjoyment. <br>\r\n<br>\r\nA malice smirk form on your vulpine face and you begin to tighten your internal muscles. She’s ether start moving or be ground down into paste by your mighty inner muscles. The protuberance in your fur begins to pulse and squirm. You feel every inch of Rika’s small body being completely entombed in your hot intestines. It must feel like to her that a dozen humans are sitting on her, while in actuality, it’s only one very displeased digimon that is around her.  Rika’s struggles intensify and you let your bowels slacken off, no reason to hurt her yet, you don’t want to tenderize your meal. You leave the house and return to the rooftops. You survey the city with a naughty glint in your eye, tonight someone will be treated to your foxy body and become a part of it.<br>\r\n</span></div></div>",
            "created":1152421200,
            "id":329669,
            "title":"It's your time now"
        },
        "1121122212":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "It'll be worth the wait, it HAS to. To the mystery.",
                "Can't contain emotion... take the woman."
            ],
            "content":"<div class=\"\"><div> <span>Gazing upon the streets with a lust that could not be satisfied, you spied around for someone or something suitable to fill your need. It seemed that the slippery form inside you - struggling and thrusting against your interior - did little to quench your thirst for sex. Indeed, your state of arousal was heightened to a level you never thought possible. Horny didn't begin to describe it. <br>\r\n<br>\r\nYou could feel tiny, delicate fingers probing the inside of you, as you squatted, watching the passersby down below. Time and time again, they would find what was deigned the exit, yet were set to heel by a quick squeeze of your rectum. <br>\r\n<br>\r\nThose that passed below all seemed to be skinny, fat, unattractive... and they inflamed your passion all the same. Thick juices ran from your labia, caking the fur on your legs. You couldn't stand it. You knew you had to pick one of them, but who...?<br>\r\n<br>\r\nScanning for someone, <i>anyone</i>, who could satisfy you, you catch a glimpse of a particularly attractive woman down below, standing lonely in a doorway. Blonde and busty, she had just slightly wider hips than what you presumed was her D cup. Wearing a short skirt that hugged her curves, and a blouse that revealed her cleavage plain as day to the world, she held her breasts in her arms, shivering. It wasn't terribly cold; in fact, quite warm as nights went. You knew that she was signalling her readiness. She wanted to be picked up by anyone, as she and you were kindred spirits, both overtaken by lust.<br>\r\n<br>\r\nOff in the distance, you can also see a rather large figure on top of another roof. Thinking this odd, you strain to make out what it could be. Your efforts go in vain; it's simply too far away. This being could be anything, you think, from a human to a digimon to - perish the thought - another Renamon. As you feel the struggles of the life within you, however, you realize you may not be able to contain your passion long enough to reach the mystery being. What is your decision?</span></div></div>",
            "created":1153717200,
            "id":333977,
            "title":"Searching for new prey"
        },
        "11211222122":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "Eat her right now",
                "Have her 'eat' you"
            ],
            "content":"<div class=\"\"><div> <span>You know that lust makes you unstable, you make rash decisions that you usually regret later. Consuming Rika you know is not something you’ll regret later, but if there is another Renamon on that rooftop, you want to be in your right mind when you meet them. In your currant state, one glance and you’d definitely explode, raping them and then eating them before you can fully enjoy yourself. If you’re going to mate and feast, you want to be in full control and be able to fully enjoy the sensation of fur against your tongue. The real game lay in the other Renamon, but that didn’t mean that you couldn’t get a little practice with the blond human on the street.<br>\r\n<br>\r\nNot wasting another moment, you swoop down behind the unsuspecting human. Not wanting anyone to notice your presences, you cover the woman’s mouth quickly. Your iron grip holds her still as you leap up off the ground and back onto the roof. Throwing the stunned human onto the ground, you smirk. In less then three seconds you captured this human without anyone the wiser. It was nice to know that you hadn’t lost your knack for hunting.  Looking her over one more time, you lick your lips from how sexy she appears and will probably taste. With Firm buttocks and a real set of tits (you can tell) You couldn’t of found a better human to eat if you had searched the whole city. Just the thought of her soft skin rubbing against your fur and inside you makes your juices churn. You notice that her tiny skirt has been pushed up and you can see what was underneath it. <br>\r\n<br>\r\n“My, my, my, aren’t you a naughty girl,” you mock, indicating to her lack of underwear. It pleases you to see that her carpet matches the drapes, your prey is a natural blond through and through. The human’s mouth gaps open at you like a goldfish. She’s trying to say real words, but all that she can come up with is whimpering moans. You crouch down in front of her, momentarily taken away by the tightness you feel in your bowels. Rika hasn’t stopped moving since you gave her the squeeze. Her tiniest actions inside you send waves of pleaser to your crotch and only remind you how horny you are.  You regain your focus on your human prey when she finally finds her voice and starts speaking.<br>\r\n<br>\r\n“W-W-Who A-Are you?”  She stutters under your stare, absolutely terrified of you. Seeing her fear puts you in high spirits. For how long have you been in hiding under the orders of your former tamer? How long has it been since you played a game of cat and mouse with some weal pathetic animal? How long was it since you smelled fear from another? Too long.<br>\r\n<br>\r\n“Call me mistress and I need you for something important.” If you’re going to play with your meal, you might as well create a fake name for yourself. Renamon is a nice name, but mistress as such a better ring to it. You can hear her screaming now, ‘Mistress, allow me to please you!’ ‘Mistress, I need you!’ ‘Mistress, please don’t eat me!’ Oh yes, this was going to be fun.<br>\r\n</span></div></div>",
            "created":1154062800,
            "id":335106,
            "title":"A lovely catch"
        },
        "112112221222":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "Might as well 'eat' her before you really eat her",
                "Just eat her already!"
            ],
            "content":"<div class=\"\"><div> <span>“What do you want?” You smirk at her sweetly. Her fear is starting to fad as she slowly begins to believe she’s safe. You’ll let her keep that notion for a little while, she’s no use to you now as a panicky mouse. She can start being afraid after you get a little satisfaction.<br>\r\n<br>\r\n“I’m in heat, causing my pheromones to fluctuate and make me seek out a mate of the same species. Sadly, none could be located, so I have kidnapped you to quench the inferno in my loins.” The blond human blinks at you several times, scratching her head as she tries to understand you. Sighing in indignation, you realize that your choice of language was too much for this human. It’s not that it matters though, your interested in her body, not that lump of jell-O she calls a brain.<br>\r\n<br>\r\n“I’m horny and I need to fuck.”  The human's face lights up, fully understanding what you want. Her face darkens a little, when she fully comprehends what you’re asking of her. Although, you’re delighted to see that she does have a hint of curiosity in her eyes. <br>\r\n<br>\r\n“Okay, if I fuck you, you’ll let me go?” You nod your head solemnly. She’ll be let go alright, let go right into your mouth and down into your stomach. The human takes a tentative step towards you, perplexed on how to proceed with your interspecies sex. Going on instinct, the human starts to take off her dress. Her breasts fell free, bouncing slightly as she takes her dress off. You stare at her large breasts with very large aureoles, the nipples tight already. Pale naked skin greeted your eyes and you ate it all up. She was a lovely specimen and it almost seemed a shame that you have to eat her once she finishes servicing you, but then you hear a slight grumble from your belly, telling you that it wants to be fed. You raise your hand and beckon her closer, which she does without hesitation. You look her in her emerald eyes, admiring her human beauty.<br>\r\n<br>\r\n“I'd like to know the name of my lovers before I take them,” you say, wanting to know what to call this exotic beauty. You won’t mourn her when she’s gone, but it would be a comfort to know who’s supplying you with pleasure and a meal.<br>\r\n<br>\r\n“Alice,” she says simply. Her eyes have wandered down your body, trying to figure out where to start. She finds your form to also hold some exotic beauty, but she can’t seem to understand why you have a large bulge over your abdomen that seems to be moving slightly. You have no desire to tell the naïve human that the bulge is another person, currently lodged where she will take her final journey through.<br>\r\nAlice moved down your body, stopping briefly at you stomach to examine the bulge you have there before moving to your already wet pussy. She parted the lips enough to start licking at them, her tongue sliding all along your wet pussy as she licked away at your entranced. Your furry lips tickle her lips as she plunges her tongue into your twat, tasting your tangy juices. You moan loudly, throwing your head back as your face contorts into pure ecstasy as Alice licked away at you. You place a paw on her head to guild her on as she lapped away at your pussy with a frenzy that amazed even you. Alice let her hands move to your tight furry ass, squeezing the cheeks to spread your pussy wider and let her lick at it more and more, her tongue sliding in, out and over your drooling snatch. You think momentarily of what lies behind your plush behind that Alice is so roughly handling. Could Rika have any idea of what’s going on outside her anal prison? Does she even know she’s inside her partner? It matters little because the sensation of your rectum being stretched by Rika and Alice’s actions to your pussy have helped you to reach on monstrous climax. You throw your head back and cried out as you come, shrieking in pleasure as you splash your honey all over Alice's face, causing you juices to streak all over her blond hair. She looks up at you with big, heartfelt eyes. Licking you has raised her arousal and she is looking for some relief as well. Should you reward her for her good job or consume her right now to feed your other growing hunger?<br>\r\n</span></div></div>",
            "created":1154062800,
            "id":335107,
            "title":"Senseless sex scene"
        },
        "1121122212222":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Investigate that odd form you saw earlier",
                "Grab the closest thing near"
            ],
            "content":"<div class=\"\"><div> <span>The side of your mind that stands for justice cries out to you, to pleasure the savior that had granted you such ecstasy. The side of your mind that drives your lust, however, has a different idea. You still were unable to move entirely properly, the orgasmic jolts coursing through you; yet beyond your lack of coordination was your will to continue this pleasure. If this buxom was able to send you into a state like this from the outside, just imagine what she could do from the inside... Your eyes catch her moist, sweaty flesh, gazing upon her voluptuous curves, and a drop falls from your mouth upon your chin. In an instant, any rational thought is gone from your mind, and you lunge at her with the single thought \"eat\".<br>\r\n<br>\r\n\"Kyaaaaaa!!!\" Your prey screams in a piercing tone, sent straight through your mind, doing little to deter you from your goal. You grab her wrists, wrapping them behind her back. You note that her physical strength is quite more than you're used to, for a human, as her arms evade you time and again. Even so, your muscles are more than enough to subdue her, and she quickly succumbs to exhaustion in her upper body. Her slippery legs kick about wildly, gaining nothing for her position. You pull her hair back, and she lets out a yelp that pleases you to no end. You yank her head up to earshot, and coo softly \"Now, Alice, don't be frightened. You just looked too delicious in that glaze of yours.\" She jerks her head away, but she can't escape your menacing voice. You give a chuckle, and continue \"Now, now, you might enjoy it. I will, and that's really all that matters, mm? That's a good girl...\" Alice continues thrashing, in a futile attempt to escape, and the smell from her private areas was circulated to your nostrils. With a renewed vigor, you grip her arms behind her back, mounting your delicious prey. Your mouth advances to her head slowly, teasingly... and you greedily glomp her entire head at once. Her thrashing has now been heavily exacerbated, as she struggles for her life. Little good it would do her. You force her body up into your mouth, your knees now situated on the floor at her sides. An inertia had built up, and she slid into your mouth with little effort. As you reached her hips, her rampant kicking forced her into you more easily, most ironically. Your jaws close around her feet, and with a gulp, she is sent down to the hellish abyss of your stomach.<br>\r\n<br>\r\nYou can't help but grin as she struggles meaninglessly inside you, kicking the walls of your stomach furiously. Added to Rika's clawings, you were in no less than heaven. Your dripping labia pulsed uncontrollably, as you shifted your body to grind the two separate lumps inside you against each other. The thought of them meeting withing your body had you even more aroused... what might they do...?<br>\r\n<br>\r\nYou know in your mind that this is still not enough. You must find more prey to attain that feeling of satisfaction you had so craved since your entrance into this world... but what could be unfortunate enough to cross your path next?</span></div></div>",
            "created":1154062800,
            "id":335125,
            "title":"Slip *gulp*"
        },
        "11211222122221":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "The figure is another Renamon",
                "The figure turns out to be another type of digimon"
            ],
            "content":"<div class=\"\"><div> <span>You lick your lips seductively and take a moment to revel in the pleasure of having yourself stretched out in two areas. With so much of your skin being pushed out, you can only guess how tight it must be in your intestines now with less give for your prisoner. The struggles of your meals (the one for your stomach and the one for your rectum) have become a little less violent. You have no idea what ether victim must be thinking; Rika may not even know where she is even. All you know is that the Alice, the human that gave you that needed climax that you desired so much, is rocking back and forth in your stomach like an infant. <br>\r\n<br>\r\n“Hope you enjoy my belly Alice, cause your mistress certainly is.” The rocking becomes more furious and you laugh darkly. Alice must have been nearing a mental breakdown after being forced to go down on a digimon and then get eaten by said digital monster. Her mental state mattered little to you, so you stopped thinking about it. You had more important things to focus on at this moment, like the mysterious figure you spotted on the roof awhile ago.<br>\r\n<br>\r\nIt was still a mystery you that was, and you hated mysteries. Did you see another Renamon or was it just some ignorant digimon looking for a good time. If it were the former then you would be overjoyed, a nice long male Renamon cock to ride or a juicy female Renamon pussy to lick would really hit the spot right now. However, although the former is great, the latter still has a tiny appeal. A rare new digimon could be fun to mess around with, especial if it was a female breed. After your tryst with Alice, you felt like having some hardcore lesbian sex. Maybe something, that left you feeling all tingly all over and wanting more. You weren’t looking for Mrs. Right, only someone that was a good pussy licker and didn’t taste bad herself.  <br>\r\n<br>\r\nYou look to where you first spotted them and walk towards the ledge of the roof. Your two bulges jiggle as you move and Alice’s struggles start anew. You ideally wonder how much of a fight she would put on when you start fucking your next victim. The next rooftop is a good thirty feet away, impossible for a normal human, but very easy for you. To be careful, you pause to calculate how much strength you will have to expel to get to the other side. With the extra weight inside you, you roughly weigh near to four hundred. Calculating for a moment, you take several steps back and take a running start towards the edge. As you leave the rooftop and are hovering in midair, you can swear that you can hear Alice screaming from inside your stomach. With all the layers of skin separating her from the outside, the little slut must have had quiet a set of lungs to be heard from your belly. You land flawlessly on the other rooftop and look around you. With your magnificent night vision, you spot a figure in the shadows. The tail you see swinging back and forth tells you that you’re not looking at a human. <br>\r\n<br>\r\n“Looks like you’ve had a busy night.” Renamon shrugs at the shadowy figures comment. It was true that she had been busy, but she was planning on getting busier with them very soon.<br>\r\n</span></div></div>",
            "created":1154667600,
            "id":337338,
            "title":"Next meal/lover located"
        },
        "113":{
            "author_id":"snayluk69",
            "author_name":"E",
            "choices":[
                "Ryoko",
                "Mihoshi",
                "Ayeka"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these girls...</span></div></span></div>",
            "created":1411055460,
            "id":1858478,
            "title":"Tenchi Muyo"
        },
        "115":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Fullmetal Alchemist",
                "More plz"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices? Are you mad? Well, OK. </span></div></span></div>",
            "created":1149829200,
            "id":323293,
            "title":"Anime+"
        },
        "1152":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Ranma 1/2",
                "More!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kay. How's this?</span></div></span></div>",
            "created":1149829200,
            "id":323294,
            "title":"Ranma 1/2"
        },
        "11521":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "Aquasexual it is",
                "Next character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a character, any character</span></div></span></div>",
            "created":1149829200,
            "id":323409,
            "title":"Ranma"
        },
        "115211":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "Ranma accidently shrinks herself with the book",
                "Ranma accidently shrinks someone else"
            ],
            "content":"<div class=\"\"><div> <span>Rain sucks, thought the young lady that wasn’t a lady as she walked home in the down pour. Her oversized red shirt clung to her top-heavy chest, showing her nipples and the soft curve of her breasts. If any males had been out, they would have been compelled to look at the large knockers that hung on the short girls chest. Of coarse, they wouldn’t of been looking long because the girl would of noticed their eyes on her and promptly knock them out. <br>\r\n<br>\r\nRain and magic sucks, the girl thought after a moment of reflection. The two elements were connected for the girl because one brought the other. The magic attracted the rain and the rain caused the magic. It was the circle of life in a twisted sense. Rain had never been an issue for the girl, until she found magic. The magic brought a very unique problem for the girl and rain became the bane of her existence. The cold drizzle became her rival, only unlike her human rivals, there was no technique to beat this one. She just had to bear with it and remind herself that she was Ranma Saotome and she was a he.<br>\r\n<br>\r\nI would have an easier time reminding myself if I didn’t have these hanging from my chest, Ranma though, taking a handful of her endowed chest and feeling them up. Ranma was 16 years old and had both a curse that turned him into a girl when splashed with cold water and three fiancées. Most people would be delighted to have three girls that wanted to marry you and definitely at least get you in the sack, but Ranma was concerned with one thing, getting his manhood back. Ranma’s one goal in life was to become a real man again, he had tried potions, magic mirrors, mystical kettles and anything else that might give him back his man meat, but all failed. All he had found through his effort was trouble, insanity and water. <br>\r\n<br>\r\n“That’s it,” Ranma growled, stopping in the middle of the road. “I Ranma Saotome swear that I will never again waste my time trying to find a cure. I’ll live with my curse and bear with it for the rest of my life if I have to. I’ll be the manliest woman in the world!” He cried this out to the heavens, daring them to prove him wrong. This was a big mistake by Ranma because if there was one thing he should of learned from his lifetime of misadventures, it was not to tempt fate.<br>\r\n<br>\r\nContinuing home, Ranma walked with a little stride. If he couldn’t beat his female side, then he was just going to have to accept it. He didn’t have to become a girl just because he had the body. He wasn’t going to start wearing dresses and make-up and she certainly wasn’t going to be dating any…. Shudder… boys. She would always be Ranma Saotome; best martial artist in town if not all of Japan and no curse was going to change that. <br>\r\n<br>\r\nRanma stopped at the Tendo house, which had been his home since his ten-year training trip ended. She lived there with her fiancée Akane, her two sisters Nabiki and Kasumi, and her father and the Tendo’s father. It was a quiet house, when a deranged martial artist didn’t pop in to destroy her. Walking up to the house, Ranma spotted something lying in front of the front door. Walking closer, Ranma saw that it was a book. Picking it up, Ranma looked at the title and nearly had a hernia. <br>\r\n<br>\r\n“Cures for curses and other unmentionables?” Ranma whispered the titled. Grinning, she hugged the book to her chest and scampered into the house, barely having times to take off her shoes. She ran upstairs and into the guest room, she shared with her father. Slamming the door shut, she excitedly opened the book and started scanning through it. As she read through it, she had no idea what was in store for her or how much her life was going to change because of this book.  <br>\r\n</span></div></div>",
            "created":1149829200,
            "id":323410,
            "title":"Not Sticking To Her Word"
        },
        "11522":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Inuyasha",
                "MORE, DAMMIT!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>KYAHH!~!@~</span></div></span></div>",
            "created":1149829200,
            "id":323296,
            "title":"Inuyasha"
        },
        "115222":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "Space shrinking it is",
                "Another choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>On an ship lost in space with hundreds of women and only three men, the ladies have to keep themselves occupied some way.</span></div></span></div>",
            "created":1149829200,
            "id":323297,
            "title":"Vandread"
        },
        "1152222":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Shuffle, and...",
                "I'd rather cut cheese than cards..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Howzabout yugioh?</span></div></span></div>",
            "created":1156914000,
            "id":343170,
            "title":"Yugioh?"
        },
        "11522221":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Not at all...",
                "She smells funny"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have anything against the dark magician girl?</span></div></span></div>",
            "created":1156914000,
            "id":343171,
            "title":"DMG?"
        },
        "115222212":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Hai!",
                "Bye"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mai's ok then?</span></div></span></div>",
            "created":1156914000,
            "id":343173,
            "title":"Mai?"
        },
        "11522222":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "Hell yeah!!!",
                "How about NEXT!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You can't go wrong with Eureka 7.</span></div></span></div>",
            "created":1287637200,
            "id":978658,
            "title":"Eureka 7?"
        },
        "115222221":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "Eureka walked in",
                "Another girl walked in"
            ],
            "content":"<div class=\"\"><div> <span> You open your eyes after a a good night sleep.You realize that your bed is much bigger than you remember.You look around and see that you are not in your room and that your are about 1 inch tall.Then the soft ground moves a little and you fall flat on your ass.\"Your awake.\"You hear a loud voice call out.You look to the top of the bed and see the face of Eureka.You alwas love Eureka and thought see was cute.Eureka was only in her panties and bra and you realize that you were sleeping on Eureka's belly.\"I was wondering when you would wake up.\"Eureka said with a smile.\"Now I'm going to go put on my dress and you can stay on my bed.\"Eureka picked you up and set you down on her bed.She left the room with her dress.all you could do was sit and wounder what has just happend.After 5 min the door opened and.....</span></div></div>",
            "created":1287637200,
            "id":978663,
            "title":"The goddess Eureka!"
        },
        "1152222211":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "Toy/Slave",
                "Friend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Eureka walked in the room.She was in her dress from the anime.\"I'm back my new.....\"</span></div></span></div>",
            "created":1287637200,
            "id":978664,
            "title":"Eureka walked in"
        },
        "115222222":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "pokemon",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about pokemon girls?</span></div></span></div>",
            "created":1299301200,
            "id":1065032,
            "title":"more options"
        },
        "1152222222":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "Yes please",
                "I think I'll pass."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one piece girls?</span></div></span></div>",
            "created":1316494800,
            "id":1190835,
            "title":"one piece"
        },
        "11522222222":{
            "author_id":"vilecreatin",
            "author_name":"FireDragon14",
            "choices":[
                "Sexy ninja here I come!",
                "Not really my thing. Let's try the next one."
            ],
            "content":"<div class=\"\"><div> <span>Who doesn't like the idea of being gobbled down by a sexy ninja girl/kunoichi? Girls from both before and after the series timeskip are permitted, at least I think so. This means if you want on of the main girls when they were younger to swallow you, go for it. But if you want someone a bit more grown up, you could choose between one from the older generation or take a trip down the throat of one of the somewhat older main girls.</span></div></div>",
            "created":1359927480,
            "id":1523539,
            "title":"Naruto girls"
        },
        "115222222222":{
            "author_id":"dnutt15",
            "author_name":"The Berzerker",
            "choices":[
                "Sure!",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fairy Tail?</span></div></span></div>",
            "created":1419108300,
            "id":1905196,
            "title":"Not really my thing. Let's try the next one."
        },
        "12":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Dead or Alive",
                "Chrono Trigger",
                "Breath of Fire",
                "Zelda",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you've been thinking impure thoughts about them game girls too, eh?</span></div></span></div>",
            "created":1149829200,
            "id":323298,
            "title":"Games"
        },
        "121":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Helena",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Have a thing for Helena, do you?</span></div></span></div>",
            "created":1149829200,
            "id":323303,
            "title":"DOA Girls. W00t."
        },
        "123":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "1",
                "Higher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kaaay. Which one?</span></div></span></div>",
            "created":1149829200,
            "id":323299,
            "title":"BOF1"
        },
        "1232":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "2",
                "Higher.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>2's good then?</span></div></span></div>",
            "created":1149829200,
            "id":323300,
            "title":"BOF2"
        },
        "12321":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Bleu",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We now begin our descent into the world of Breath of Fire 2, years after the original; A land where demons run rampant and mythical creatures no longer surprise. Which of its beloved characters do you wish to enter?</span></div></span></div>",
            "created":1149915600,
            "id":323620,
            "title":"Bleu?"
        },
        "123211":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Meet with Bleu",
                "Nina moans..."
            ],
            "content":"<div class=\"\"><div> <span>          The heavens were angry... the earth around you quaked. You found it hard to keep your footing, getting seasick on land, were that even possible. You gazed into the face of your enemy, feeling an absolute terror, deeper than anything you've ever felt before... a shock that chilled you to the bone. The blue beast leapt, blazing through the air, paw outstretched; that massive mitt, still stained with blood, threatened to end your life at that instant... It was then that your savior, the deus ex machina naga to whom you had trusted your life in this maneuver loosed the titanic spell she had been readying. A white bolt, streaking forth, tearing the atmosphere, drove directly into the stomach of the beast, punching completely through it. A bright flash accompanied the impact, blinding you... when your eyes could regain their focus, you saw the great behemoth smash against the ground with a deafening thud. Your thoughts at that moment were too frenzied to collect at once, but you knew... you knew Bleu had not let you down.<br>\r\n<br>\r\n          \"-att?\" The melodic voice had roused your mind back into coherence. \"Katt? You awake?\" You open your eyes, seeing naught but black. It must still be dark out, you surmise, and you wonder why this voice is bothering you at whatever hour this might be. \"Mmm....\" you moan, barely able to stay conscious. \"Ah! Good.\" Clearly Bleu. Nobody else could be this oblivious to the annoyance of others. \"C'mon. I wanna show you something.\" You lazily pull yourself out of the bed, moving at speeds that would rival a snail. The flea-ridden blankets have gotten you to itch to the point that you've become numb to all feeling. You grumble, thinking that's the last time you stay at this Inn. <br>\r\n<br>\r\n          As you slowly rise, you can see the sleeping forms of Ryu and Nina, exact opposites of one another. Nina, with her wings tucked back behind her, was the picture of grace as she slept, hardly disturbing anything as she took light, slow breaths. Ryu, on the other hand, had his limbs outstretched, snoring madly, making jerky movements which brought him closer and closer to the edge of the bed. You couldn't help but find this funny, even in your half-dead state. You continue toward where you remember the door being...</span></div></div>",
            "created":1149915600,
            "id":323625,
            "title":"Into Bleu"
        },
        "1232111":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Enter Bleu!",
                "GYAH!!!~!@~ (flee)"
            ],
            "content":"<div class=\"\"><div> <span>          You bound down the stairs, still half-asleep but now with your reflexes in check. You begin to wonder what exactly it is Bleu wants at this kind of time, and why she only woke you up... but whatever it may be, you think that it had better be good or you're gonna learn what snake meat tastes like.<br>\r\n<br>\r\n          You pass through the Inn's door, out into the night. The full moon shines brightly upon the earth, illuminating everything even in this valley of the mountainous regions. You feel your feral instincts welling up within, though under control... you hope. As you stride through the moonlight, you see a form that must be Bleu for certain. Taking care to restrain yourself from yelling, you ask in an irritated tone: \"What? What's so important?!\" You're able to make out Bleu's grin as the naga slides closer to meet you. \"Aw, c'mon, don'tcha wanna see my new spell? It took me forever to finally get it right... about a thousand years, actually.\" The realization that Bleu was so much older than she looked surprised you momentarily. You had known already, of course, but it was just so out of the ordinary when she looked so young. Magic is definitely worth looking into, you note.<br>\r\n<br>\r\n          \"What's so good about this spell then? And why <i>NOW</i>?!!\" Bleu smirks. \"Aw, what, you don't appreciate being the first one to see?\" \"<i>NOT IN THE MIDDLE OF THE NIGHT!!</i>\" You yell, immediately covering your mouth with your hand in an embarrassed realization that Ryu and Nina were still sleeping. \"Shh... you can yell all you want later,\" replied Bleu. Somewhat bewildered by this, you think to inquire about why... but before you can ask, Bleu cuts you off. \"So, Katt... have you ever felt like life's too complicated?\" \"...?\" You're not sure how to respond to this seemingly random statement. \"Like... you wanted to just go back in the womb?\" \"W-what?\" you stutter. \"I can make it... simpler for you... would you like me to?\"</span></div></div>",
            "created":1150002000,
            "id":323631,
            "title":"Bleu's new spell"
        },
        "12321111":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Saved by...?",
                "No escape from a snake."
            ],
            "content":"<div class=\"\"><div> <span>          You step back, bewildered at the proposition. \"H-how would you do that?\" you inquire, with a shifting perception of she who stood before you. \"Well, that's the spell, see... It'll work on just about anything, but I thought it was just too fun to keep to myself, so... \" Your legs tense, your shoulders bristle, in preparation for whatever it may be that Bleu is about to attempt. \"Well, let's see if that wasn't just a fluke, then!\" Bleu raises her arm high into the air, wrapped around her majestic staff. A dim light sprouts from the tip, illuminating the surrounding area ever so slightly. You hear her mumbling some arcane language, her lips moving furiously... you feel a strange tingle deep within, as the light fades...<br>\r\n<br>\r\n          The magister naga's staff had now lost its glow completely, and her incantation had been completed. \"It begins...\" you hear from the slender form. You feel your fur stand on end, and your limbs go lax... what's more, a force acting on you, pulling you from a direction you didn't think possible.. that force grows and grows, becoming strong, as you walk towards Bleu... \"I promise Katt, you're going to enjoy this.\" The force grows greater, irresistible, as you feel yourself actually lift off the ground, floating toward Bleu... you level out to become horizontal, and accelerate towards her, closer, closer. You can see her exposed belly fast approaching, but you feel concern... that belly is above you. Gathering whatever wit you can, you see that your trajectory is indeed aimed lower than the belly, and you see... Bleu's now exposed and open vagina, glistening in the moonlight, beckoning to you. You try to scream out, but you can't - your entire body has become paralyzed, floating though the air, destined for that moist opening...</span></div></div>",
            "created":1150088400,
            "id":323799,
            "title":"Bleu launches UnBrt"
        },
        "123211112":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Remain as Katt for her new life",
                "Swithc viewpoints."
            ],
            "content":"<div class=\"\"><div> <span>          You begin to panic, floating towards Bleu's awaiting sex. Your body doesn't respond, no matter what signal you send. Your mind is racing, but you can't make out even one of your own thoughts. All you can hang onto is that this shouldn't be possible, even though its clearly occurring right here and now. You're going to be sucked into the womb, just as Bleu said... well, at the very least, you can't say she lied about anything. <br>\r\n<br>\r\n          Your head approaches,, revealing to you the gaping entrance more clearly than you'd have liked. The light reflects off, shining into your eye... you can feel the heat pouring out from within Bleu's body. Your hair is now flattened, pressed against her labiae, coating your crown in a thick solution. It feels as though you had stayed out in the rain for days, even though the rest of your body was... actually, you just noticed that the rest of your body was moist as well, sweat dripping from every recess, and.. you can feel your sex dripping, coating the inside of your leg, caressing you, wrapping around aided only by gravity. Your vision blacks out, as your head is pulled into the naga. Your face is coated completely in thick juices, and you feel as though you're about to suffocate.. but then, a feeling overtakes you; a feeling of peace and tranquility, and you know this wave of calm came from your predator, her desire to let you know that it was all right. You knew you could trust her, too; it was a bond that could only be built between those who fought together, and it was that bond that now allowed you to believe her in these most extenuating of circumstances. Your shoulders slide in as nothing, as you're pulled deeper... your head no longer feels resistance as you head inward, though you feel encased entirely. Your breasts slow Bleu down ever so slightly, but to no avail, as they slip in with an almost unnoticed pop sound. You no longer feel the rest of your body; left outside this environment, it feels as no more than a weight on the rest of you. This body is you now, not those unwieldy, dangling apparati. As your new home closes in around you, you feel more and more of your old self transformed into this new being, a being that has now lost all ties to the outside world, and you welcome it... Bleu was right, and you were right to trust her; your life was now as simple as could be, and you wouldn't trade it for anything.</span></div></div>",
            "created":1150088400,
            "id":323801,
            "title":"Wombed"
        },
        "1232111122":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "No... things must be put right.",
                "But... this feels right, so..."
            ],
            "content":"<div class=\"\"><div> <span>You feel your new guest squirming within you, adjusting, contorting... a feeling simply beyond compare. Your belly is swelled, but not distended... you must have had more space in there than you thought. That, or Katt was smaller than you estimated. Your once gaping entrance had now closed, sealed from penetration and from view. To be truthful, you're surprised the spell actually worked that way.. it was supposed to force you to swallow the target, but you certainly weren't complaining about this twist of events. Your new guest begins to calm, and you as well... the initial sensation of the act was pure exhiliration, and even now, your entire body was in a state of high alert, tingles flowing throughout. Of course, you couldn't keep Katt in you forever... could you? </span></div></div>",
            "created":1150088400,
            "id":323802,
            "title":"Bleu's shoes"
        },
        "12321111222":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "A demon attacks!",
                "It's someone else..."
            ],
            "content":"<div class=\"\"><div> <span>You decide that Katt has taken permanent residence inside you. This feeling cannot be beat, and there's no way you could release that which triggered it. You're simply too enthralled by the concept of having someone inside you, and even more, the one you've been fighting behind, observing... you used to hate yourself for those thoughts you had but now, they just seemed fitting...<br>\r\n<br>\r\nYou decide to head back to the Inn, and hope things will sort themselves out in the morning, but...!</span></div></div>",
            "created":1150088400,
            "id":323803,
            "title":"Katt ain't gettin' away."
        },
        "123211112222":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Swalw",
                "UpAss"
            ],
            "content":"<div class=\"\"><div> <span>          You begin to head toward the Inn, but you can't shake a feeling... it seems as though you're being watched by something or someone. Scanning your surroundings, you see a strange form to the right; a form that seemed half monster, half human... the form advanced to you, becoming more clear, and it was without a doubt that this form belonged to one who, now, was worse than any demon. This form belonged only to Nina.<br>\r\n<br>\r\n           The angelic beauty approached, smoothly, slowly, with only the highest form of grace. You knew there was no way this could be coincidence. She had seen, and now, she must be... <br>\r\n<br>\r\n          \"What.. exactly was that?\" the princess asked. \"Are you.. of my clan?\" Taken aback at this question, you quickly shift into an alert position. \"Clan? Heh... I wouldn't be caught dead in your little clan.\" You had always held a distaste for Nina, even years ago, when you traveled with her great great grandmother. Something about that whole family irked you, in some deep section of your mind. \"Well,\" Nina replied, \"that spell... it's of the class that only my family could ever master. My mother used that very technique one time, long ago... a thief had invaded the castle, and she...\" Nina turned away. The memory clearly wasn't too pleasant for her. \"Well, I don't care about your little family,\" you snap, \"because I mastered this spell all on my own!\" \"Yes, but only the one... right?\" In your determination to acquire this spell, you hadn't thought of the possibility that there could be others like it... <br>\r\n<br>\r\n           \"It's no matter whether you learned the spell, but, to turn it on a fellow party member...\" Nina gained a look of utter contempt. \"You must be punished.\" \"Oh?\" you reply. \"It seems to me that I have the advantage! You come near me and I'll send her down, and then you'll never get her back!\" \"And how is that different from what you already planned?\" You realize that as this moment, Nina isn't the good little girl she pretends to be in front of everyone. She knows you never intended to release Katt, and she doesn't seem to care... \"I know you're not going to let her go, and that's fine by me... actually, you just saved me the effort.\" Nina floated closer. \"I... I've been in love with Ryu ever since that.. that day... when he helped me rescue my sister... And even then, Katt was there. But then you show up, and.. well, I couldn't get rid of both of you at once... but now that you're one unit..!\" You take an agressive stance, fully ready to fulfill your promise of sending Katt to your bowels, but also to defend yourself, when Nina begins chanting... but something was different. She was chanting at a speed that was far faster than you thought possible, and you had barely gotten in position to send Katt downward when Nina had finished chanting, and you felt your entire body become loose... But what spell did Nina cast?</span></div></div>",
            "created":1150088400,
            "id":323806,
            "title":"Nina approaches..."
        },
        "1232111122222":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Escape from these damnedable depths!",
                "An unexpected roommate?"
            ],
            "content":"<div class=\"\"><div> <span>          Your body becomes almost completely limp, and your arms fall to your sides. Your staff drops and smacks the ground. You can feel a wind picking up around you, but it's a warm wind... an odd thing, since the night was a bit chilly to begin with. You see Nina's dress blowing about in the breeze, dancing elegantly as it did with all her spells, and in the dim light, you catch a glimpse; she's not wearing any undergarment at all... <br>\r\n<br>\r\n          As the wind picks up, you can see faint outlines of objects moving about, circling Nina in a small whirlwind. The swirl embraces you, and you feel it wrap around your body. It sends a light tingle from your head to your toes, and you feel Katt squirm. Clearly she felt it as well. As the gust becomes stronger, you feel yourself being pulled and pushed this way and that, unable to resist. All of a sudden, the wind becomes intense! A gale force bowls you over, smashing you to the ground, but it doesn't end there; you're lifted into the air once more, and then brought down with a thunderous resonance! You feel no pain, but the impact is there for certain. You're lifted into the air once more, tossed about, and you see Nina circling around you... or are you circling around Nina? You can see that your environs are moving with you, and that means that you're the mobile one, flying and crashing around the Windian princess. You can feel the wind shifting, twisting; and you see Nina growing closer and closer. Her arms lift up, and so does the air, as you stabilize in orbit around her. In one motion, she brings them down, and you're hurled toward her in an arc, unable to see what's happening in the weak light and inconsistent surroundings, but then...<br>\r\n<br>\r\n          Instantly, your vision blacks out entirely, and your head feels like it's being crushed by a vise. Your arms are immobile, but you can feel a strong pressure, as if formed by a stiff pillow, on both shoulders... and you realize what had happened. Nina had said there were other spells, hadn't she? So the only way you could have been going that wasn't where you put Katt was...! Immediately, you feel the forces acting on your head pulling, squeezing, forcing you inward to this abyss. Your shoulders join your head without much effort, and your entire body slips through the gate your head had already entered quickly, except - The last bit of your tail could still feel a slight chill. You were clearly left out a small bit, but the rest of you was in a place you couldn't dispute: You were up Nina's ass.<br>\r\n<br>\r\n           A soft, comforting voice spoke to you, but from which direction you couldn't tell. The voice seemed melodic but with a certain undertone you couldn't quite understand, one that seemed to be of malice and hatred... &lt;Comfortable?&gt; you hear. Not knowing how to respond, you remain silent. &lt;You didn't learn this telepathy spell either, did you...?&gt; You scream and yell in response, as words you didn't even know you knew came flying out your mouth, to which you were immediately answered by &lt;Heh, I can't hear you... you'll have to speak up a bit. But I suppose I shouldn't trust what you say, since you're just talking out of my... well, you know.&gt; The joke is lost on you, as you can't even focus on anything. The heat inside Nina is incredible, not to mention the fact that you still can't seem to move. &lt;You know, I've always liked this tail of yours... maybe I should leave just it hanging out, so it looks like I have my own...&gt; You think if she does that, you may have a chance to get out of this. Just so long as you're not completely sealed inside her... &lt;Nahh!&gt; Oh bloody hell. You feel the muscles around you contract one last time, as the rest of your tail is slucked up like spaghetti. You can feel an odd sensation at the tip of that tail... like something hard and round being crushed against it... &lt;Oh, I should tell you. I can't let you out yet, so I'm just going to plug myself up until I'm ready... I hope you don't mind me using that shelf space...&gt;<br>\r\n<br>\r\n          You're not sure if you're still paralyzed by the spell or by the rage you're feeling at this absolute bitch for what she's doing... But you'll get even...</span></div></div>",
            "created":1150347600,
            "id":324502,
            "title":"Into the arse of Nina"
        },
        "12322":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "3",
                "Higher, you fool!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3!?!?~@!~@!</span></div></span></div>",
            "created":1149829200,
            "id":323301,
            "title":"BOF3"
        },
        "124":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "Zelda herself",
                "Nah, let's do Midna",
                "More please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda girls sound good huh? Which one?</span></div></span></div>",
            "created":1272085200,
            "id":872846,
            "title":"Zelda"
        },
        "1243":{
            "author_id":"snayluk69",
            "author_name":"E",
            "choices":[
                "princess ruto",
                "not into fish..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe one a little bit fish like</span></div></span></div>",
            "created":1411055580,
            "id":1858479,
            "title":"More please"
        },
        "125":{
            "author_name":"dogen1",
            "choices":[
                "Yes, please!",
                "I want something else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do the girls from the Tekken Franchise strike your fancy?</span></div></span></div>",
            "created":1149829200,
            "id":323402,
            "title":"Tekken, Anyone?"
        },
        "1251":{
            "author_name":"dogen1",
            "choices":[
                "I Want Christie Monteiro, Super-sized!",
                "No Way!  Make It Ling Xiaoyu!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tekken it is!  Now which lovely lady from Tekken 4 would you most like to see as a giantess?</span></div></span></div>",
            "created":1149829200,
            "id":323403,
            "title":"Tekken 4, Here I Come!"
        },
        "12511":{
            "author_name":"dogen1",
            "choices":[
                "Whatever Could It Be?"
            ],
            "content":"<div class=\"\"><div> <span>Few can believe the news.  After an epic battle against Karate legend Heihachi Mishima, Christie Monteiro has emerged the winner of this year's King of the Iron Fist Tournament.  Still only 19 years old, Christie has proven herself to be a true Capoeira prodigy, having achieved this level of martial arts prowess after only 2 years of training.  Now the head of the Mishima Empire, she has the financial means to conduct a global search for Eddy Gordo, her missing tutor.  She affords herself a mere day's rest before she takes a tour of Mishima's Headquarters.<br>\r\n<br>\r\nAs Christie begins, she is unsure as to what her duties as a corporate executive will entail.  She listens half-heartedly to her assistant, a petite Filipina named Annette De La Paz, as she describes the intricacies of the Mishima Finance Offices.  They walk briskly through a number of meetings, during which Annette introduces her new boss to a number of zaibatsu employees.  Christie has already forgotten their names by the time they reach the elevator.<br>\r\n<br>\r\n\"Listen, Annette,\" Christie pleads, \"I'm so glad you're helping me with all this.  It's just that I can barely concentrate on all this while Eddy is still missing.  When can we begin searching for him?\"<br>\r\n<br>\r\nAnnette gives her a reassuring nod.  She waits until  Christie finishes before pressing the button for the 10th floor.  <br>\r\n<br>\r\n\"Ms. Monteiro, I understa-\"<br>\r\n<br>\r\n\"Christie, please.\"<br>\r\n<br>\r\n\"Christie, I understand what you mean.  Please know that we will be conducting a search for Mr. Gordo just as soon as...\"<br>\r\n<br>\r\nChristie diverts her attention towards the elevator panel.  In the bottom-left corner is a small red button, encased in safety glass.  Beside it is a keycard slot.  Annette is still talking when Christie looks back up at her.<br>\r\n<br>\r\n\"Annette,\" she says, raising her hand in a silencing gesture.  \"What floor does that button lead to?\"<br>\r\n<br>\r\n\"That, Ms. Monteiro, leads to Mishima's most advanced R &amp; D Facility.  All of the work done there has until now been supervised directly by Mr. Mishima himself.  Of course, nothing in there is of any relevance to-\"<br>\r\n<br>\r\n\"Really?  What sort of research Heihachi been doing?  And please, it's Christie.\"<br>\r\n<br>\r\n\"Well, <i>Christie</i>, I can't honestly say.  Even I was restricted access from the facility.\"<br>\r\n<br>\r\n\"You really don't know what's down there?\"  Christie asks, surprised.<br>\r\n<br>\r\nAnnette nods, seeming slightly embarrassed.  \"I guess Heihachi didn't consider me trustworthy enough.\"<br>\r\n<br>\r\nChristie feels the curiosity overwhelming her.  What secrets could possibly be lurking below them?  Grinning, she tugs at the keycard that had until now been tucked inside her blouse.  She watches as the card  slot's LED blinks green as she forces in her ID; almost immediately after the elevator starts to descend.  Christie waits for the fluttering sensation in her belly to subside before she speaks again. <br>\r\n<br>\r\n\"I guess today's your lucky day then, Annette.  You can reschedule my meeting with the board for later this afternoon.\"<br>\r\n<br>\r\nFor what seems the first time since Christie was introduced to her, Annette smiles.  \"Will do.  Still, I can't believe that Heihachi didn't seal off the facility before giving you Mishima Corp.\"<br>\r\n<br>\r\n\"Oh, I'm not so surprised.  After all, It would have taken him some time to completely block off the facility.  He would only have done so if he'd thought there was a chance he would lose.\"  Christie smirks.  \"Somehow I don't think humility is one of Heihachi's strong points.\"<br>\r\n<br>\r\nThe elevator bobs lightly upon reaching the basement floor, forcing Annette and Christie to grasp the brass railing beside them.  There is a familiar chime as the lift doors open.  Both Annette and Christie squint as they exit the lift, its fluorescent bulbs having left them ill-prepared for the relative darkness of Mishima R &amp; D.  Their footsteps, plodding and deliberate, echo with a metallic resonance; it soons dawns on Christie that they are walking on some kind of catwalk.  Her pupils continue to dilate, until finally she can see how massive the structure truly is.  Annette grabs her shoulder, pointing at the myriad workers below them.<br>\r\n<br>\r\n\"This place is enormous!  How could Heihachi have kept all this so well-hidden from the board of directors?\" Annette asks, shaking her head in amazement.  She feels Christie tug at her hand.<br>\r\n<br>\r\n\"Come on!  Let's see what he was up to!\"<br>\r\n<br>\r\nThey climb down the spiral staircase beside them, taking short, brisk, steps.  Finally, they reach the lab's stone floor; Annette stops, feeling it rumble beneath her feet.  Christie has already begun speaking with one of the workers by the time she catches up with her.<br>\r\n<br>\r\n\"So you're her?\"  The worker glances at Christie skeptically.  \"They said you were young, but-\"<br>\r\n<br>\r\nAnnette can see her boss's temper flare slightly.  <br>\r\n<br>\r\n\"Listen, I may be young, but that doesn't make me any less your superior.  Now, if you like being employed here, I'd suggest you stop talking down to me.\"<br>\r\n<br>\r\nThe man shifts about, looking downward; Christie's rebuke has obviously stung his pride.  Annette notices  his badge, which has the name Walter Deckard printed alongside his photo.  <br>\r\n<br>\r\n\"I apologize, Ms. Monteiro.  Now what was it you needed from me?\"<br>\r\n<br>\r\n\"What I needed, Walter, was for you to give me and my associate a tour of this facility, maybe explain to us the purpose of your experiments here.  And, please, call me Christie.\"<br>\r\n<br>\r\n\"Certainly, Christie.  Just follow me.\"<br>\r\n<br>\r\nThe three of them walk through the laboratory hastily.  Walter leads, all the while explaining the facility's purpose to the two girls.<br>\r\n<br>\r\n\"You see, Heihachi was obsessed with the notion of combat.\"  Walter pauses to take a breath.  \"Nearly everything in this lab is either a weapon of some sort.  That, or an attempt to redefine the limits of human physical fitness.\"<br>\r\n<br>\r\n\"You mean like steroids?\"  Christie asked.<br>\r\n<br>\r\n\"No, Ms. Monteiro, far more than that.  Take this, for example.\"  Deckard brought them to a halt, pointing at what seemed to be a skeleton made from stainless steel.<br>\r\n\"This was our attempt at creating a fully-functional metal frame.  If successful, we would have been able to   <br>\r\ncraft a race of soldiers with nearly indestrucible bones.  However, none survived the implantation process.\"<br>\r\n<br>\r\n\"No wonder this was kept so well-hidden!\" Annette exclaimed.  \"Who knows what peace accords and treaties Heihachi violated with this research!\"<br>\r\n<br>\r\n\"Exactly,\" Walter said.  \"Unfortunately, Heihachi threatened potential whistleblowers with torture and death.  He even used a few of the more stubborn ones as test subjects.\"<br>\r\n<br>\r\nChristie stops for a moment, noticing a piece of machinery to her right.  She reads the warning signs accompanying it with care, her eyes bulging as she does so. It is not until Walter taps her on the shoulder that she exits her trance.<br>\r\n<br>\r\n\"Christie, what is it?\"<br>\r\n<br>\r\n\"I was just wondering, Mr. Deckard, about <u> that </u> .\"  <br>\r\n<br>\r\n</span></div></div>",
            "created":1149829200,
            "id":323421,
            "title":"Christie Monteiro: This Year's Winner of the K"
        },
        "125111":{
            "author_name":"dogen1",
            "choices":[
                "Christie: Different Size, Same Gentle Personality.",
                "Looks Like Christie's Accident Has Changed Her In More Ways Than One..."
            ],
            "content":"<div class=\"\"><div> <span>Deckard realizes almost immediately that Christie is pointing at the <b> Atomic Density Reconfiguration Ray </b>.<br>\r\n<br>\r\n\"That?  Well, in theory, the ADRR allows the user to alter the amount of space between atoms in any given object.\"<br>\r\n<br>\r\nChristie's eyes widen with realization.  \"You mean you could shrink something with that?\"<br>\r\n<br>\r\n\"Or grow something,\" Deckard continued.  \"However, it proved too unpredictable when used on living subjects, and was scrapped for production as a weapon.  Now we test it purely for commercial purposes-\"<br>\r\n<br>\r\nChristie has stopped paying attention to him, and moves toward the ray. Soon she is standing beside the machine, her facial expression one of childish delight.   Deckard races toward her, shouting words of caution.  These words go unheard by Ms. Monteiro, who reaches out to touch the ray's cool metallic surface.  She lets out a surprised yelp as a concentrated beam of energy escapes from the ray, showering her in radiation.  <br>\r\n<br>\r\nSmoke floods the lab.  Annette coughs, waving her hands about in anguish as she looks for a sign of Christie.      She stumbles blindly through the facility, her breath growing short, until she feels herself being lifted off  of the ground.  A booming voice calls out to her, clearly audible through the din of panicked lab workers.<br>\r\n<br>\r\n\"Annette?  Is that you? Let's get out of here!\"<br>\r\n<br>\r\n\"Christie?\"<br>\r\n<br>\r\nAnnette, still unable to see, cannot make sense of what is happening around her.  She hears an enormous crash, as well as a number of screams.  Nausea overtakes her as she feels herself bobbing up and down, almost as though she were at sea.  Eventually she blacks out...<br>\r\n<br>\r\nWhat will Annette wake up to?<br>\r\n   <br>\r\n               <br>\r\n</span></div></div>",
            "created":1149829200,
            "id":323425,
            "title":"Christie: All Grown Up"
        },
        "1251112":{
            "author_name":"dogen1",
            "choices":[
                "\"I guess I'll be eaten.\"",
                "\"Um, I think I'll go with the butt.\""
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\nAnnette's eyelids open slowly.  She glances about, wondering how long she had been unconscious, then tries to determine where she is.  The dense forest surrounding her discourages her efforts.  A feeling creeps into her gut, telling her that something about this place is wrong.  Soon she realizes that it is the sound of the wind that is rattling her nerves.  Turning around, she understands why.<br>\r\n<br>\r\nWhat Annette has taken to be the sound of a strong breeze blowing is in fact the breathing of the giantess laying down behind her.  Looking at Christie, she began to remember the strange events at the Mishima Corporation, particularly the bit involving the ADRR.  She jumped in alarm as Christie began to speak; her voice was now so powerful that Annette could feel her ears starting to ring.<br>\r\n<br>\r\n\"For a second there I thought you were never gonna wake up.\"<br>\r\n<br>\r\n\"Ms. Monteiro?  What's happening?  Where are we?  I remem-\"<br>\r\n<br>\r\nChristie reaches out towards Annette, who squeals in alarm.  Curling her fingers around her, Christie lifts her terrified assistant upwards, until finally she is at eye-level with her.<br>\r\n<br>\r\n\"Don't worry,\" Christie says, doing her best to sound reassuring.  \"Everything's fine.  There was an accident at the lab, you blacked out, and I took you someplace safe.\"<br>\r\n<br>\r\nAnnette shoots Christie a puzzled look.  \"Well, thank you for saving me then, Ms. Monteiro, but aren't you worried about what's happened to you?  I mean, what if your current condition is irreversible?\"<br>\r\n<br>\r\nChristie giggles.  \"Condition?  What condition?\"<br>\r\n<br>\r\n\"Your size!\" Annette exclaims.  \"You're now almost 200-\"<br>\r\n<br>\r\n\"Oh, you mean that.  Listen Annette, this isn't a condition, this is a blessing!  I've been given absolute power!  Why would I want to reverse that?\"<br>\r\n<br>\r\n\"What if there are side effects?!  Christie, we must bring you to the lab right away!\"<br>\r\n<br>\r\n\"Anne, you worry too much.  I feel great!  I can do whatever I want and no one could possibly stop me.  How could they?  You're all the size of toys compared to me now!\"<br>\r\n<br>\r\nNow the feeling of dread returns to Annette; her palms sweat profusely.<br>\r\n<br>\r\n\"Christie, are you sure you're ok?\"<br>\r\n<br>\r\n\"Of course I'm ok!  I'm better than ok!  I'm feeling great!  If anything, it's everyone who should be worried.\"<br>\r\n<br>\r\n\"W..what do you mean?\" Annette stammers.<br>\r\n<br>\r\n\"Think about it!  There's nothing I can't do anymore!  I mean, look at you, for example!  Think of everything I can do to you now that I'm this size!  If you make me mad, then I can step on you...\"  Christie stomps on the ground, crushing a number of small trees.  Next, she dangles Annette in front of her face and opens her mouth.  \"I can swallow you...\"  Annette lets out an involuntary yelp as she feels herself rocketing downward, towards Christie's waist.  \"I can make you my new dildo...\"  Finally, she makes a half-circle with her arm, until at last the shivering woman in her palm is getting a view of her shapely hind end.  \"I can even get really mean if I want and use you as a buttplug.  And you know what?  There's nothing that you or anyone else can do about it.\"<br>\r\n<br>\r\nAnnette swallows hard, terrified by what she is experiencing.  Her mind races, searching for a way out of her current plight.  All she can think of is to try and reason with her captor.<br>\r\n<br>\r\n\"Christie, what's wrong with you?!  You sound like you've gone crazy!  I don't even know who you are anymore!\"<br>\r\n<br>\r\nChristie smirks.  \"Of course you don't know me!  The Christie you knew is dead!  The only reason I acted like I did in the past was because I had to worry about the consequences of my actions.  But now I'm invincible!  Here, I'll show you!\"<br>\r\n<br>\r\nUnsure whether to scream or sob, Annette settles for a state of bleary-eyed hysteria.  Tears stream down her cheeks as she feels herself being elevated once more.  She continues to plead with Christie, who grins at her sadistically.<br>\r\n<br>\r\n\"Please, don't hurt me!  I'll do anything!\"<br>\r\n<br>\r\nThe goddess' face goes blank for a moment as she ponders something.  \"I'll tell you what, Annette,\" she says in a sing-song voice, \"how about I let you decide what happens next?\"<br>\r\n<br>\r\n\"Oh thank you Ms. Monteiro, if you let me go I promise I won't tell anybo-\"<br>\r\n<br>\r\nChristie raised a finger to her lips.  \"Sorry Annette, but that's not one of the options.  Do you want me to tell you what your options are?\"<br>\r\n<br>\r\nAnnette, now in a near-catatonic state, is scarcely able to nod her head.<br>\r\n<br>\r\n\"Okay, here goes.  Option 1 is that I get to have you for a snack.  Don't worry, I promise not to chew!  I wanna feel you moving inside my tummy.\"<br>\r\n<br>\r\nChristie gave Annette a teasing lick.<br>\r\n<br>\r\n\"Your other choice,\" Christie says as she lies down onto her stomach, \" is for you to go up my butt.\"  She drops Annette onto the small of her back, jutting out her posterior as she does so.  \"I guess you can think of it as being eaten in reverse.\"<br>\r\n<br>\r\n\"Please don't...\"<br>\r\n<br>\r\n\"Which is it gonna be, Annette?  Remember, if you don't answer soon, I'll tear your limbs off, then stick you up my butt, and then eat you.  So, unless you want that, I'd suggest you make up your mind pretty fast...\"<br>\r\n<br>\r\nWhat does Annette decide?       </span></div></div>",
            "created":1150952400,
            "id":325944,
            "title":"A Giantess Power Trip / A Tough Choice"
        },
        "12511121":{
            "author_name":"dogen1",
            "choices":[
                "Annette is digested while Christie sleeps.",
                "Annette somehow avoids digestion and makes it to Christie's rectum intact."
            ],
            "content":"<div class=\"\"><div> <span>As horrifying as a one-way trip into Christie's belly sounds, Annette still figures it's better than spending her final moments trapped in somebody's rectum.  She takes a moment to compose herself before speaking.  After smoothing out the wrinkles in her skirt, Annette looks up, determined not to give her captor the satisfaction of seeing her afraid.<br>\r\n<br>\r\n\"Christie, there is no way I'm going up your ass.  Just eat me and get it over with.\"<br>\r\n<br>\r\n\"Someone's sure in a hurry,\" Christie says, amused.  \"Very well then.  Let's get started, shall we?  My tummy can't wait for much longer.\"<br>\r\n<br>\r\nParalyzing fear grips Annette as she feels herself being lifted into the air.  Soon she is at eye level with Christie.  Her attempt to appear dignified falls apart once she feels herself being undressed.  Though she struggles against it, Annette is now completely nude.  Christie eyes her hungrily.<br>\r\n<br>\r\n\"Sorry about that, I just wasn't sure how you'd taste with all those clothes on.  Anyways, are you ready?  I sure hope so, cuz it's time for you to go in my mouth.\"<br>\r\n<br>\r\nChristie sticks out her tongue, as though she is going to taste the girl dangling in front of her face.  Annette shuts her eyes in anticipation.  To her surprise, she does not feel the rough surface of Christie's tongue across her body.  Instead, she is flung forwards, past Christie's jaws, only to be swallowed without a moment's hesitation.  A bulge can be seen travelling down Christie's throat.<br>\r\n<br>\r\n\"I told you it couldn't wait,\" Christie says, burping.  She begins patting her tummy, which is groaning in anticipation of its latest meal.<br>\r\n<br>\r\n\"Now, if you don't mind, I'm gonna take a little nap while you digest.\"<br>\r\n<br>\r\nListening to her belly churn as it goes to work on Annette, Christie soon falls asleep.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1151298000,
            "id":326732,
            "title":"A Snack for Christie"
        },
        "125111211":{
            "author_name":"dogen1",
            "choices":[
                "1. Goes on a feeding frenzy in town",
                "\r\n2. Discovers a few campers nearby"
            ],
            "content":"<div class=\"\"><div> <span>Christie wakes a few hours later.  Yawning, she stretches her arms and legs, which begin to tingle as circulation returns to them.  Suddenly she remembers Annette, who seems to have fallen silent inside her belly.  Christie rolls onto her back and starts poking her abdomen, listening intently for her assistant's voice.  The only sound she hears is a deep rumbling from within her bowels.<br>\r\n<br>\r\n\"Hi Annette!\" she exclaims, rubbing her tummy.  \"Hope you slept as well as I did!\"<br>\r\n<br>\r\nA spongy brown lump containing Annette's remains finally enters Christie's rectum.  Christie winces reflexively as it begins poking against her anus.<br>\r\n<br>\r\n\"Not very talkative today, are we?  Well, that's okay, our time together's almost over anyways...\"<br>\r\n<br>\r\nChristie rises up and starts to walk in the direction of a nearby lake.  Once there, she squats down over it, taking a deep breath. Her anus starts to loosen up, while her bowels  push their contents towards the gaping orifice.  Several minutes pass before the first piece of waste slides out from her colon,landing in the water below with a hearty splash.  She grunts as a few stray bits are evacuated, remnants of long forgotten meals that have only now completed their trip through Christie's bowels.<br>\r\n<br>\r\n\"I kind of expected to see you by now, Annette,\" Christie said, scanning her shit for hair &amp; bone fragments.  \"I guess maybe my belly's just a lot stronger than I thought...\"<br>\r\n<br>\r\nOne last chunk of excrement begins pushing against Christie's anus.  Grunting, she strains her rectal muscles, until finally the offending clump is fired out of her anus.  In it are the bones of a human girl. <br>\r\n<br>\r\n\"Aha, there you are! I hardly recognized you!  Anyways, thanks for the experience!\"<br>\r\n<br>\r\nChristie stoops down to look at Annette's remains.  Once satisfied, she rises to her feet, aware of a newfound hunger awakening inside her.<br>\r\n<br>\r\nWhat does Christie do now?</span></div></div>",
            "created":1151902800,
            "id":328397,
            "title":"Bye-Bye Annette."
        },
        "1251112112":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Stick some up her butt",
                "Stick some up her twat"
            ],
            "content":"<div class=\"\"><div> <span>Stomping through trees that were rarely bigger than her, Christie searched for more prey that could satisfy her. The feelings she had experienced with Annette had changed her; she would no longer be sated by food alone. No, she wanted more of that feeling, of taking living and sentient beings and consuming them, degrading them to a level ordinarily impossible. <br>\r\n<br>\r\nAfter a short time, she came across a series of tents, all pitched in a row. A malicious grin spread over her face, realizing she had hit the jackpot. Bending down, she opened the flap on the one nearest her. \"Yoo-hoo!\" she cooed, in a voice that shook the earth. Peering in, she spied two female campers, huddled together in the corner. They must have heard her footsteps, she thought; she wasn't being very subtle about walking. Rolling on her elbow to the next, she opened the flap and spied three more. She noticed that all of them seemed to be wearing the same outfit, with an emblem she didn't recognize. Unsure of what they were here for, she abandoned any thought of finding out. Instead, she stood up and barked, \"Alright! Out of the tents, every one of you! You've got ten seconds until I start stomping!\"<br>\r\n<br>\r\nThree seconds passed, then five. Terrified women began pouring out of the tents, conglomerating at the foot of the giantess. One, however, just had to be different. Darting off toward the darker forest, a wailing camper attempted an escape, dashing forth... not getting anywhere. She saw the ground pulling further and further away, as the circulation left her head. As she was spun around, she was directly adjacent to the eye of the gargantuan Christie. The voice of the behemoth wrapped around the body of the camper, killing every nerve in her body. \"Now now, you should have known that wouldn't work. We must punish bad girls...\" Chuckling, she opened her mouth wide and tossed the girl in. Grinding her teeth back and forth, crunching down into the bones, she chewed the camper for no less than a minute before finally gulping her down. <br>\r\n<br>\r\n\"Oh, sorry\" she giggled. \"Looks like I'm late.\" Her face now beaming with a delightful sadism, she raised her foot and brought it down with a monster force on the tent she had first seen. Walking step by step, she smashed tent after tent, twice feeling a gooey eruption underneath, as though stepping on a snail, and she cackled maniacally both times. Reaching the end of the line, she bent down, facing the huddled mass of pink T-shirts and cargo shorts. \"So, my pretties, what do I do with you...? I don't think I'd like to repeat myself...\" Reaching into her undersection, she began to massage her private areas. \"I missed my chance with Annette, so maybe I could stick some of you up my butt... but my kitten's hungry too...\" </span></div></div>",
            "created":1160456400,
            "id":351693,
            "title":"Gulp, stomp, what next?"
        },
        "12511121121":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Experiment with other orifices",
                "She loved this feeling; she needs more in her butt!"
            ],
            "content":"<div class=\"\"><div> <span>Christie couldn't stand the sight of these pathetic specimens; giving up on life, content to huddle together and wait for the end, crying and screaming. She decided there would be no more suitable a place for these imbeciles than the most degrading and embarassing place she could think of: The human rectum.<br>\r\n<br>\r\nHer grin turning to a scowl, she reached down with the hand that wasn't occupied with herself to scoop up a handful of the puny mites. She had gathered three in her slender fingers, and looked down on them with contempt. Picking the smallest one with her now soiled free hand, she swung her around to her rear end, forcing her glutes apart with her wrist. Grinding the camper's head against her anus, she motioned her in small circles, plying her rosebud wider and wider. Dropping the two campers in her other hand between her knees and clenching them, she gently licked her left hand. Swinging around to her rear, she gently massaged her anus, slathering saliva all around herself and her prey. Jamming the girl in deeper, she moaned and bucked her head, flipping her luxurious hair back, as her meal slid into her effortlessly. <br>\r\n<br>\r\n\"Ohhh....\" she cooed, feeling the girl slide deeper and deeper into her. A tingling wave of ecstasy enveloped her body, claiming every part of her. Juices flowed from her nether regions, dribbling down her legs. Glancing down, she noticed a pool had gathered near her knees, encasing the two she had left there.<br>\r\n<br>\r\n\"Oh... don't worry darlings, you're both going to see her again very quickly. At the same time, even...\" Taking both in hand, she mashed them against her rump, squeezing them with her cheeks, grinding them against her skin. Making a palm with her other hand, she aligned them to her anus and drove them in with terrific force, in a hammer-like motion. Literally no friction impeded them as they slipped into her colon.<br>\r\n<br>\r\nFalling forth, she collapsed onto her stomach, clenching and twisting in ecstasy. The struggles of the damned paralyzed her with a happiness and fulfillment bordering on the insane. Barely able to contain herself, she managed to hold herself up with at least her right arm, gazing at the remaining campers. There had to be at least 20 wailing and screaming girls left, none of whom made any attempt to flee. What would she do with them, she wondered...</span></div></div>",
            "created":1160456400,
            "id":351710,
            "title":"Black Hole"
        },
        "125111211212":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Suffocate'em, digest'em, shit'em.",
                "To hell with waiting! Christie goes after more prey."
            ],
            "content":"<div class=\"\"><div> <span>Barely able to focus, Christie pulled herself to her knees. Panting, she glared at the mob of useless creatures before her. She knew that they all deserved the same fate; They all deserved the ultimate humiliation.<br>\r\n<br>\r\n\"Whoo... Okay, girls, I don't suppose... I can just ask you... to march in for me, huh?\" The response from the mass remained the same: A symphony of whines and wails. \"As I thought... So.\" Making a fist, Christie raised her clenched hand high in the air, held for a moment... Then, like a crashing thunderbolt, brought it down, down to the crying women, about to smash them all, but...! Just an inch before the tallest, she stopped herself. In a flinch that had proved the mass had become symbiotic, the group pulled together even more. Smiling, Christie had now gotten exactly what she wanted.<br>\r\n<br>\r\nSquatting above the mass, the giantess aligned herself with the girls, finding it easier with the smaller target. \"Looks like a piece of cake... or pie\"<br>\r\n<br>\r\nAll of a sudden, the behemoth let herself drop, remaining square with the group. Slamming down, she felt many of the girls be driven into her at once. Shifting her weight, she rotated her buttocks, as more and more of the glob of girls slid into her backside. The feeling was unbelievable. The pleasure she had from one, even three girls <i>actually</i> inside her <i>rectum</i> was nothing compared to this. The wriggling conglomerate struggled somewhat, though all that served to do was drive them in deeper. <br>\r\n<br>\r\nClenching her buttocks, she took hold of the remainder and leaned forward, her rump suspended in the air. Taking both hands, she crammed in the few that managed to remain outside her body. The fluids produced from her body now ran from both orifices; a goo lightly stained brown, coating her inner thighs. The struggling from within was astronomical, twisting and warping her mind, contorting her body in the oddest positions. Unable to move, almost unable to breathe, and with cries emanating from her bowels, Christie revelled in the fact that there were still so many more potential meals left in the world....</span></div></div>",
            "created":1160456400,
            "id":351709,
            "title":"Mass spelunking."
        },
        "12511122":{
            "author_name":"dogen1",
            "choices":[
                "Continue from Annette's POV",
                "Continue from Christie's POV"
            ],
            "content":"<div class=\"\"><div> <span>After pondering her options, Annette decides that even though having Christie use her as a suppository sounds pretty unappealing, it is still preferable to melting in a pool of stomach acid.<br>\r\n<br>\r\n\"Time's up!\" Christie yells.  \"Let's see, what do I rip off first?\"<br>\r\n<br>\r\n\"Wait, wait!  I know what I want!\"  Annette's hands wave frantically as Christie's massive fingers clamp down on her leg.  <br>\r\n<br>\r\n\"Oh yeah?  And what has Ms. Annette decided?\"<br>\r\n<br>\r\n\"I'll take the butt,\" Annette replied, fighting the urge to gag.  <br>\r\n<br>\r\nChristie starts to giggle.  \"Annette!  I had no idea you were so kinky!  I just wish you would've told me sooner, we could've had a lot of fun!  Anyways, I hope you're ready for this...\"<br>\r\n<br>\r\nWith that, Christie sets Annette on the small of her back.  Her hands then travel down her body, past her hips, to the bronze curves of her buttocks.  Gripping them firmly, she spreads them apart, until Annette is able to see the pink skin of her anus.  As she looks at the puckered hole, Annette wonders whether digestion really be such a terrible fate after all.<br>\r\n<br>\r\n\"Well, Annie, what do you think?  I hope you like it, since this is gonna be your new home from now on.\"<br>\r\n<br>\r\nThe urge to vomit suddenly overwhelms Annette, especially she when feels Christie nudging her toward her rear end.  She becomes more stubborn in her movements, her mind recoiling in horror at the thought of being trapped within the humid depths of a giantess' colon, knee-deep in shit and digestive juices.  Her sluggish pace infuriates Christie, who snatches her up with her free hand and dangles her over her sphincter.  Annette can feel her head bumping against the rubbery aperture as she is lowered down by Christie.  Though it gives slightly as Annette is forced against it, Christie's anus does not relax.<br>\r\n<br>\r\n\"Annette?\" Christie asks, batting her eyes demurely.  \"It looks like I'm gonna need your help relaxing back there.  All you're gonna have to do is lick it a little bit and it should open right up.\"<br>\r\n<br>\r\n\"What?!\"<br>\r\n<br>\r\nChristie's voice grows cold once more.  \"Do it or I'll force feed you my shit until your stomach ruptures.\"<br>\r\n<br>\r\nThis proves enough motivation for Annette, who begins tracing the folds of Christie's with her tongue.  She can feel it start to dilate as she licks it.  Christie soon begins pushing her against her asshole once more; this time Annette's head becomes completely submerged in her rectum.  The combination of sweat and saliva lubricates Christie's anus, and soon Annette is waist deep in Christie's bowels.  Ironically, her struggles pull her in deeper, until finally her feet are the only part of her still outside of Christie.  Christie reaches down and gives them one final push with her index finger, waiting until they are completely inside her before clenching her anus shut.<br>\r\n<br>\r\n\"Now what do you think?\" Christie asks, unable to resist taunting the poor soul imprisoned within her rectum.  \"Having fun in there?\"</span></div></div>",
            "created":1150952400,
            "id":325952,
            "title":"In Through the Out Door"
        },
        "125111222":{
            "choices":[
                "She had the sudden urge to go on an eating spree!",
                "A stranger crosses her path..."
            ],
            "content":"<div class=\"\"><div> <span>As if to awnser, her bowels gurgled, and a rather loud fart trumpeted from her now humgous rear. Christie giggled as she heard a faint groan emit from somewhere by her rear end that had nothing to do with her gas. \"Whoopsie! Sorry Annette, I guess I'm still working down my egg-omlet breakfast... Or maybe that pork burrido lunch?\" She giggled agian, \"Or you could be <i>really </i>unlucky, at it'll be both!\"<br>\r\nShe continued laughing until...</span></div></div>",
            "created":1299301200,
            "id":1065017,
            "title":"Continue from Christie's POV"
        },
        "1251112222":{
            "choices":[
                "Like you should meet my other best freind!",
                "Like having a small snack..."
            ],
            "content":"<div class=\"\"><div> <span>A flicker of movement caught her eye, and she looked over to see a lone and stunned-looking hiker standing behind her. Christie smiled malevolently. \"Why, what do we have here?...\"<br>\r\n<br>\r\nThe hiker gulped. \"Uh... Nevermind, I'll just go the other way now-\" She suddenly shrieked as Christie swooped over and picked her up, dangling her in front of her face. \"Oh, I don't think so...\" Christie said, giving her new prey a sinister smile.<br>\r\nShe sized up her newest catch, a young Indian girl in her late teens or early twenties with brown eyes, long hair, and was -much like Christie's previous vitcim- very pretty.<br>\r\n\"What's your name girl?\" Christie damanded.<br>\r\n\"Uh...Dani. Now I'd...um... really <i>really </i> appreciate it if you let me down now...\"<br>\r\nChristie grinned, and flipped her hand over, dropping the tiny hiker towards the ground. Suddenly finding herself in a free-fall Dani screamed, only to be caught by Christie's other hand. <br>\r\n\"T-That was not funny! You could have killed me!\"<br>\r\nChristie laughed. \"What! Kill you? Never! Dani, you just became my best freind. And right about now I'm feeling...\"</span></div></div>",
            "created":1299301200,
            "id":1065031,
            "title":"A stranger crosses her path..."
        },
        "12511122221":{
            "choices":[
                "Follow Christie",
                "Follow Dani"
            ],
            "content":"<div class=\"\"><div> <span>\"-like you should meet my <i>other </i>best freind!\"<br>\r\nDani blinked, clearly not understanding. \"Uh...Great. Can I meet them on the ground by any chance?\"<br>\r\n\"Oh, but she is <i>so </i>close by!\" Christie exclaimed. \"Her name is Annette, I'm sure you two will get along <i>fabulously</i>!\"<br>\r\nAnd with that, she began inching her had towards her butt, using her other hand to push her cheeks apart. Dani squirmed nervously as she grew closer and closer to the giantesses rear, and upon seeing the slightly-damp looking anus opening and closing she screamed.<br>\r\n\"Waitaminute! This is insane! I'm not some anal-butt toy you can pleasure yourself with!\"<br>\r\nChristie laughed, \"Oh, you are a funny one. I'm sure Annette will enjoy your company... Unless she has turned into shit!\"<br>\r\nAll inhibitions lost, Dani yelled out in terror as her captor pushed her feet-first into the hungry-looking anus. She nearly voimited as her feet sunk into the orfice, which quciky gobbled her up all the way to her waist. There, in a last ditch effort to save herself, Dani planted her hands on each side of the anus to keep herself from sinking any further.<br>\r\nChristie gave a start, expecting her new toy to slide in on her own. \"My, my, quite the little fighter you are aren't you?\"<br>\r\nDani gritted her teeth, trying hard not to loose her grip. 'I am <i>not </i>going in there,' she thought feverishly. '<i>no</i> way!'<br>\r\nSadly for her, Christie's bowlels had other plans. There was a slight gurgling noise, followed by a faint hiss, and before she knew it Dani found herself in a evil-smelling dark-green fog. \"Oh, EW!\" she gasped, pinching her nose between her thumb and forefinger.<br>\r\nSadly, this last-second mistake was exactly what Christie had been hoping for. With her grip destabilized, the anus gave Dani another firm tug, pulling the young hiker in further. She yelped as her other arm sunk into the ass, \"Oh, no.\" Dani cried. \"Oh nonononoNO!\"<br>\r\nBut it was too late, the tiny Indian had already been consumed by the ass to face her fate within Christie's bowlels.<br>\r\nChristie giggled, as she felt her newest freind fall into her colon and as her rear released another deep burp-like fart.<br>\r\n\"Tehehe! It's a good think i'm feeling gassy today, that one was such a trouble maker!\"</span></div></div>",
            "created":1299906000,
            "id":1069005,
            "title":"What, what? Up the...ew..."
        },
        "125111222212":{
            "choices":[
                "Yes! There is somthing moving!",
                "No... She is alone..."
            ],
            "content":"<div class=\"\"><div> <span>Dani slid into the organ on her back as if she was on some kind of morbid water-slide, she eventually stopped with a sickening squelching noise. It took the bite-sized indian to realize and accept her current surroundings and perdicament.<br>\r\n'Ohdeargod, THIS CANNOT BE HAPPENING!' Dani thought, bolting upright from the slimy carpet she had once been lying down upon. This was a mistake.<br>\r\n\"OHhhh <i>God</i>!\" Dani moaned, gritting her teeth and pinching her nose again. The smell of Christie's bowels was beyond repulsive, right on par with an overfull outhouses found on a hot summer hike if not worse. Dani felt her stomach clench with every strained breath as she got to her feet, trying hard to ignore the squelches and squirts of a warm mud-like substance she did not want to think about. <br>\r\nNow standing, Dani was in awe at how huge her surroundings where. It was like some gigantic cavern; a gigantic, hot, stinky cavern slicked with sloppy brown piles here and there. <br>\r\n\"H-Hello?...\" Dani cried out, her voice slightly altered by her tightly gripped nose. \"Anyone there?...\" <br>\r\n </span></div></div>",
            "created":1303016400,
            "id":1089592,
            "title":"From hiker to spelunker"
        },
        "1251112222121":{
            "choices":[
                "Another person! (Annette)",
                "A wall of poo!"
            ],
            "content":"<div class=\"\"><div> <span>As if to awnser, she saw somthing move in the inky blackness in front of her and -against her better judgement- she moved a bit closer to investigate.<br>\r\n\"Ugh, the smell...\" She wimpered in disgust, still clasping her nose as liquid waste sloshed around her shins. As Dani shuffled closer to where she saw the movement she suddenly gasped when she saw that it was nothing less than-</span></div></div>",
            "created":1305003600,
            "id":1104020,
            "title":"I spy..."
        },
        "12511122221212":{
            "choices":[
                "And thats the end for her...",
                "No...Wait...A miracle occurs!"
            ],
            "content":"<div class=\"\"><div> <span>A moutain of dung, dark brown in color and absolutely reeking. It appeared to have only entered the colon recently, and Dani had the feeling that there was much more packed behind it.<br>\r\nDani couldn't help it, she vomited. Both the smell and the sight sickening her beyond any possible measure. However; the action caused her to loose her grip on her nose, allowing the stench to hit her full on. She gasped, doubling over agian, coughing in the foul air and feeling ready to vomit yet again.<br>\r\nShe never got the chance though, as a thunderous rumble shook her evil-smelling abode making its walls quake and its inch-tall guest fumble onto her knees. Dani retched as the smell grew stronger and looked up with wide and watering eyes to see that the mound of poo was steading heading towards her. Even more terrifying though, was that for a split second she swore she saw what looked like a human leg sticking limply out of the pile before it got sucked back in. Terrified, Dani jumpled back to her feet and sloshed her way back towards where she entered only to be unable to find it. She beat upon the rubbery walls of her prison screaming and sobbing for release but found none. The inevitibily of her struggle dawned on her as the bowel released another ominous gurgle and she turned back to meet her fate.<br>\r\nThe mass of feces slowly slid towards her making little noise save for the soft wet crackle of its movment. Knowing that there was nothing else she could do, Dani screwed her eyes shut and wimpered as the warmth and stench enveloped her...<br>\r\n</span></div></div>",
            "created":1305694800,
            "id":1108604,
            "title":"A wall of poo!"
        },
        "125111222212121":{
            "choices":[
                "Hold it. Lets find somthing else to do...",
                "Nature waits for nobody..."
            ],
            "content":"<div class=\"\"><div> <span>Completely unaware of the life-or-death struggle happening within her bowels, Christie lay on her back watching the clouds with as an annoying sense of boredom passed over her. Granted, her little escapades with Dani and Annette were fun, but she could no longer feel thier struggles and she no longer felt the need to go running off for yet another victim.<br>\r\nOddly enough, thinking of her little slaves seemed to awaken somthing in her rear, as a heavy weight started to push upon Christie's delicate rosebud. Christie made a face and bore down slightly, letting out a small poot of a fart and temporarily taking off some of that pressure (she also could have sworn she heard a tiny scream escape as she let out her gas, but she thought nothing of it.)<br>\r\n'It seems I'll have to poop soon...' She thought, debating on if she should hold in her load or just release it and get it over with.</span></div></div>",
            "created":1314421200,
            "id":1175943,
            "title":"Meanwhile..."
        },
        "1251112222121211":{
            "choices":[
                "She finds an isolated campsite",
                "She finds a small town"
            ],
            "content":"<div class=\"\"><div> <span>Christie wan't quite in the mood to 'take care of buisness' quite yet. It was still somewhat early in the morning, and she did not waste her first day as a giantess unloading her bowels - no matter how badly she needed to.<br>\r\nHer mind made up, Christie clenched her back-hole once more -ignoring the onimus gurgle the action caused-, got up on her feet and began walking through the dense forest. <br>\r\n'Hopefully, I'll find somthing worth my interest...' She thought, oblivious to the ever-increasing pressure in her rear.</span></div></div>",
            "created":1314421200,
            "id":1176451,
            "title":"Adventures!"
        },
        "12511122221212111":{
            "choices":[
                "Breakfast is served!",
                "Bathroom needs come first!"
            ],
            "content":"<div class=\"\"><div> <span>Within moments, Christie came across a small clearing in the woods. In it's centre there was a small dying campfire along with a tent, it suddenly dawns on her that this must be the campsite Dani had previously wondered away from only to meet her fate in the depths of Christie's rectum.<br>\r\nInterested, Christie silently snuck up on the site and took a small peek into the tent. Sure enough, Dani had not gone hiking alone.<br>\r\nFast asleep in the tent was yet another girl of an age close to Dani. However unlike the Indian beauty; this girl was caucasian, her brown hair was done in a long pony-tail and she had a constellation of freckles across her nose. The one thing she did have in common with her hapless freind, was that she too was also very pretty.<br>\r\nChristie smiled slyly as she watched the girl sleep, trying to imagine a way to take advantage of her newest pet...</span></div></div>",
            "created":1314421200,
            "id":1176461,
            "title":"Yet another victim"
        },
        "125111222212121112":{
            "choices":[
                "Leave the tent",
                "Rough it out..."
            ],
            "content":"<div class=\"\"><div> <span>Christie smiled nastily as a sick idea clicked into her head about the same time a heavy weight pressed up against her rectum. Sure, she had to take a dump, but why not have some fun while she was at it?<br>\r\nHer mind made up, Christie squatted above the campsite as her insides gurgles and churned. The giantess tried not too giggle too hard as her rear released a long and silent pre-dump fart, knowing that it would be the only warning the sleeping camper would ever get...<br>\r\n<br>\r\n<br>\r\nLea was still blissfully asleep as Christie's stinky cloud of gas desecended upon her tent. Her tiny ski-slope noise was the first to react, twitching twice before wrinkling at the smell, it was not long until it's owner woke up as well. <br>\r\n\"Ugh, Dani, that's <i>rank</i>!\" Lea sputtered, waving a hand in front of her face. The pretty brunette turned around, expecting to see her mischevious bunkmate grinning back at her, but saw nothing but an empy sleeping bag. However; this did not totally suprise Lea in the slightest as she began to sue both her hands to wave away the stench. 'Typical Dani...Dropping a stink-bomb like this and leaving...'<br>\r\nShe groaned, in spite of her efforts the smell wasn't getting any better but with it still being moring and all she wasn't all to keen to leave her tent...<br>\r\n</span></div></div>",
            "created":1314853200,
            "id":1178887,
            "title":"Stinky sneak attack..."
        },
        "1251112222121211121":{
            "choices":[
                "Nope! She didn't!",
                "Yes, she did..."
            ],
            "content":"<div class=\"\"><div> <span>Lea grunted as she got out of her sleeping bag, even if she didn't wake up to the nicest of things she might as well get up and start her day being awake and all...<br>\r\nThe brunette streatched out her post-nap kinks and threw on a large pink shirt that sufficiently covered up her somewhat skimpy sleeping attire (which pretty much consisted of her panties and bra).<br>\r\nWalking barefoot out of the tent, Lea smiled as she the morning sun shone upon her face and took a deep breath through her nose...Which was a bad mistake...<br>\r\nLea gagged, bending over slightly and cupping both hands over her nose. Though she didn't think it was possible, it smelled even worse outside the tent than it did inside! <br>\r\n\"Ohhh, Phee-youu!\" Lea exclaimed, her eyes watering slightly at the unexpected stink. \"Christ Dani, did you drop a load in your shorts or somthing?!\"<br>\r\nAs if in answer there was a loud wet crash behind her, Lea yelped as she turned around and saw that a big dark brown mass had fallen from the sky and crushed her tent! Lea peered at the mystery object, one hand still glued to her nose. Whatever it was, it stank, so badly that she could practically see the stench rolling off it. To be honest, it looked exactly like a giant piece of-<br>\r\n\"Shit!\" Cried Lea, as yet another large load fell right behind her, landing with a sickening squelch. Right after that, another peice fell on her left, quickly followed by another on her right! Lea looked around, she was now enclosed in a pen made of this stinky-organic stuff that was almost as tall as she was! Her head spun, just as much from the smell as from her confusion. And just when things couldn't get any stranger...<br>\r\n\"Aww, damn it. I was so <i>close</i>!\"<br>\r\nLea looked up, and gasped to see the monsterous asshole of a giant woman. Her eye's widened as the said giantess looked down at her with a wry grin. \"Sorry 'bout the mess, I've been holding this one in <i>forever</i>!\"<br>\r\nThe womans giant rosebud opened, and let out a loud brassy noise followed by a foul wind. Lea bent over, gasping and gagging as the hurricane of stench. After it subsided, she looked up and was horrified to see that the giant asshole was opening and closing like the mouth of a great beast... Implying that another load of waste was on its way...<br>\r\n\"Wait!\" She screamed, abandoning the death-grip on her nose to wave her hands in the air. \"Please! I'll do anything you want! Just don't...poop!\"<br>\r\nThe Giantess paused, her rear hole closing for a moment... Lea paused, praying that she had heard her plea...<br>\r\n</span></div></div>",
            "created":1315026000,
            "id":1180071,
            "title":"Out in the open..."
        },
        "12511122221212111211":{
            "choices":[
                "Nothin' but dumpage...",
                "Lea survived!"
            ],
            "content":"<div class=\"\"><div> <span>\"Mmmfffff... You wound'nt happen to know some little Indian girl running around these parts did you?\" Christie thundered, another storm brewing in her colon.<br>\r\n\"D-Dani?\" Lea stuttered. \"What does she have to do with this?\"<br>\r\n\"Ehhhh... Nothing much. I just ran into her earlier today, but she's -ooooohhh- been itching to see you...\"<br>\r\n\"What do you mean?\" Lea asked, fearing the awnser.<br>\r\nChristie smiled nastily. \"Let me show you!\"<br>\r\nAnd just like that, her rear vomited forth an explosive wet fart that showered Lea with watery poo. She screamed as the mess washed over her like a bucket of hot-stinking mud and knocked her on her back. Sputtering and gagging in disgust, Lea almost didn't notice as her hand felt somthing cloth-like. She looked down, and saw a poo-stained pair of hiking jeans, not far from those was a once-white T-shirt and bra. Lea gasped, this time not from the smell, those clothes belong to Dani! Which meant she was sitting in...<br>\r\n\"OH MY GOD!\"<br>\r\nLea's shocking revelation was met with a disgusting roll of wet thunder from above. With a great groan of satisfaction Chrstie fully unloaded her colon, a cascade of small semi-solid logs pouring out her like some stinking waterfall. After about ten sceconds of this, a final echoing fart of farewell ended Christie's extensive bowel movement. Chrstie let out a sigh relief, feeling a good hundred pounds lighter she turned to see assess the damage made by her bodily functions and saw...</span></div></div>",
            "created":1316408400,
            "id":1190832,
            "title":"Down come the bombs!"
        },
        "1251112222121211122":{
            "choices":[
                "Leaves for new adventures!",
                "WTF, survivors?!"
            ],
            "content":"<div class=\"\"><div> <span>Having just woken up, Lea wasn't quite in the mood to leave her sleeping bag even if the inside of the tent stunk of rotten meat and beans. She also didn't want to give her freind the satisfaction of waking her up, as she suspected Dani would be waiting for her outside to laugh at her reaction. Having made up her mind, Lea lay down and snuggled back into her sleeping bag in an attempt to go back to sleep.<br>\r\nSadly, her efforts were in vain, as the smell didn't dissapate as she had hoped. In fact, it actually started to get <i>worse</i>. <br>\r\nLea groaned and raised her sleeping bag over her nose and mouth, wondering what on earth Dani could have ate to have had such stinky gas...<br>\r\n<br>\r\nThen, out of nowhere somthing big, wet, and heavy landed on the tent, causing it to collapse all around her. Lea gasped in suprise, and found her legs pinned under both the tent and the massive mystery object. But before she could react <i>another</i> massive weight seemingly fell from the sky and landed upon her chest. <br>\r\nUnable to move her arms or legs, Lea gagged as an utterly repulsive smell invaded her olfactory, this heavy moist stuff stank of somthing you'd find in an abandoned outhouse or in the bathroom of a grimy resturant. Truth be told, it smelled just like-<br>\r\n<br>\r\n\"Aaaahh...\" Christie sighed in relief as a third log of poo fell from her butt and landed on the tent with a wet squelching noise, completely burying the tent (and it's hapless inhabitant) in a steaming pile of waste. After those few inital logs, her bowels released a number of smaller greasier poops that piled higher and higher until it nearly reached the top of the trees! Finishing off with a final wet fart, Christie got back up and inspected her handiwork.<br>\r\nBeneath her was moutian of steaming dung, dark brown and reeking of past meals. Christie's nose wrinkled at the smell, but she smiled at the fact that somewhere in that mess where the bodies of three lovely girls...<br>\r\nStill smiling, Christie waved a dramatic hand in front of her face. \"Phewww, you girls <i>stink</i>! I think i'll leave now before you make me spew from both ends!\"</span></div></div>",
            "created":1314939600,
            "id":1179482,
            "title":"Bad move Lea..."
        },
        "1251112222122":{
            "choices":[
                "Start looking for her!",
                "And that's when the digestion begins..."
            ],
            "content":"<div class=\"\"><div> <span>Nothing replied but the reverberation of her own voice, now adding a sense of eerie unease to her immense disgust. Having been a apt hiker, Dani was not fond of going it alone in unknown territory, it was stupid dangerous and could easily wind up getting you killed.<br>\r\n'That's even been proved already...' Dani thought mournfully, had she not wandered away from her camp site for an early morning hike, chances are she wouldn't be entombed in the fetid ass of a giant...<br>\r\nPast all the disgust and cursing of her stupidity, Dani couldn't help but wonder... 'Didn't the giant say someone else was trapped in here?...'</span></div></div>",
            "created":1336280400,
            "id":1330488,
            "title":"On your own Dani..."
        },
        "12511122221222":{
            "choices":[
                "Get lower, maybe the fumes won't get her",
                "Get closer to the 'exit' and hope for a fart"
            ],
            "content":"<div class=\"\"><div> <span>Dani was busy trying to decide what to do to notice the pulses and quivers that raced along the walls of the colon. However, it was impossible for her not to notice as a greenish colored gas seeped into the cavern making smell of the bowels sickeningly stronger.<br>\r\nDani coughed and hacked in the foul air and attempted to wave the green mist away while tightly pinching her nose. 'Ugh! God, is she farting again? That is really, <i>really </i>gross!'<br>\r\nThe mist did not dissapate however; and the smell <i>certainly </i>wasn't getting any better. Truth be told, both were getting even worse, it was getting hard to see though all the fog and the smell was honestly starting to burn at her lungs. Dani felt hooks of panic sink into her as she raised a cleaner part of her T-shirt above her nose and mouth so she could breathe easier.<br>\r\n\"Ughh... W-what's happening? What do I do?\" She wondered aloud. </span></div></div>",
            "created":1336280400,
            "id":1330512,
            "title":"Ass-gestion..."
        },
        "1252":{
            "choices":[
                "Ok, sure",
                "No Way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You sure are picky. Ok how about Soul Calibur?</span></div></span></div>",
            "created":1162011600,
            "id":355608,
            "title":"Chapter 4: Soul Calibur"
        },
        "12522":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Yessssss!!!!!",
                "No!!!!!!!!!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Street fighter girls</span></div></span></div>",
            "created":1316494800,
            "id":1190897,
            "title":"No Way"
        },
        "125222":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "Samus yeah!",
                "next!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Metroid okay?        </span></div></span></div>",
            "created":1317704400,
            "id":1200963,
            "title":"No!!!!!!!!!!!"
        },
        "1252221":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, so are you a metroid character?</span></div></span></div>",
            "created":1317704400,
            "id":1200964,
            "title":"Samus yeah!"
        },
        "12522211":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "Ridley",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright but which one?</span></div></span></div>",
            "created":1317704400,
            "id":1200965,
            "title":"yes"
        },
        "125222111":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "oral",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright what type of vore?</span></div></span></div>",
            "created":1317704400,
            "id":1200967,
            "title":"Ridley"
        },
        "1252221112":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>breast?     </span></div></span></div>",
            "created":1317704400,
            "id":1200970,
            "title":"other"
        },
        "12522211122":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>anal?                       </span></div></span></div>",
            "created":1317704400,
            "id":1200972,
            "title":"no"
        },
        "125222111221":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "Giant samus",
                "small ridley"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First major question, is samus giant or ridley small?</span></div></span></div>",
            "created":1317704400,
            "id":1200974,
            "title":"yes"
        },
        "1252221112212":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "samus's ship",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are they in the universe?</span></div></span></div>",
            "created":1317704400,
            "id":1200975,
            "title":"small ridley"
        },
        "12522211122121":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "wanting that ass",
                "wanting to kill her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ridley woke up on samus's ship shrunk. He got up and examined his new form. He then thought of dangers and then Samus came in completely naked! Ridley felt...</span></div></span></div>",
            "created":1317704400,
            "id":1200989,
            "title":"samus's ship"
        },
        "125222111221211":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "she sees him",
                "she doesn't see him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>An erection of ridley's crotch appeared and he grew incredibly horny. then he started to masterbate.</span></div></span></div>",
            "created":1317704400,
            "id":1200992,
            "title":"wanting that ass"
        },
        "1252221112212111":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "she does",
                "she doesn't"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ridley stopped in the middle of masterbation Samus had locked eyes at him. Ridley though \"does she recgonize me?\"</span></div></span></div>",
            "created":1317704400,
            "id":1200994,
            "title":"she sees him"
        },
        "12522211122121112":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "was to horny to move",
                "ran"
            ],
            "content":"<div class=\"\"><div> <span>she then whispers \"Cockroach...\" Ridley almost burst out laughing Ridley thought \"Mighty Samus Aran is afraid of cockroaches!?\" the Ridley looked at Samus again she wasn't afraid, she was joyful and cruel. She then went across the room and turned on a camera, she then grabbed Ridley and the camera and took it into an empty room with comfy padding. then Samus talked into the camera \"Hello buttcrush world, it is I Samus Aran, the suppliers of your entertainment. I have a cockroach. Soon he will be gone! as Ridley watched Samus's butt descend upon him he...</span></div></div>",
            "created":1317704400,
            "id":1201004,
            "title":"she doesn't"
        },
        "125222111221211121":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "samus buttcrush him(accidentally anal vored him)",
                "samus recgonized him and stopped"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ridley just stood there with a smile on his face still masterbaiting, then...</span></div></span></div>",
            "created":1317704400,
            "id":1201009,
            "title":"was to horny to move"
        },
        "13":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Britney Spears",
                "Jennifer Lopez",
                "Shakira",
                "Angelina Jolie",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK, let's get some obvious ones out of the way first.</span></div></span></div>",
            "created":1149829200,
            "id":323302,
            "title":"Celebrities"
        },
        "131":{
            "author_id":"joeball",
            "author_name":"kreeper57",
            "choices":[
                "Juicy Jessica Simpson",
                "Her bratty little sister"
            ],
            "content":"<div class=\"\"><div> <span>Brit was feeling hungry and it looked like this dumb skank was not going to stop for food any time in the near future. She was getting quite tired of just driving around hoping to find some paparazzi to take another photo of their twats. Screw this, I guess I'm eating rich food tonight.<br>\r\nParis Hilton didn't even blink when Britney ripped off her blouse and came at her with her mouth open. As stupid as the heiress was even she thought it strange when B stuck her head in her mouth. Kinky is one thing but what the f...<br>\r\nThe pop princess lifted the blonde bimbo up and shoved her slim sleazy body and snuggly into her stomach. She felt her prey struggle, but the excitement of gulping the bitch sent her adrenaline and her stomach juices into overdrive and soon she reduced the worthless wench to a nice bulge in her belly. That was good!<br>\r\nMeanwhile, Lindsay was passed out in the back as usual, her firm fat titties popped out-again as usual. So it wasn't hard to gently strip the deadhead redhead with rousing her. damn, she looked tasty! Britney couldn't resist given those juicy jugs a frisky fondle. Liloawoke slightly and asked \"Are we there yet?\"<br>\r\n\"Well, you will be soon, bee-atch!\" Brit responded and shoved the plush pillows into her mouth and bit. Her mouth was filled with mamms and she let the tasty titties rest awhile, savoring their succulence before swallowing. Ms Lohan was too drugged up to respond intelligently, but her addled brain still realized that something was amiss when her friend just bit off her moneymakers and ate them. But before she could summon up a reasonable defense she found herself staring down the throat of her now ex-friend and stopping dead in her stomach. <br>\r\nBritney stripped naked in the back seat as her clothes were now unfit to hold her expanded physique. She fondled her own breasts, which were fuller and firmer than red's ever were. As she relaxed and digested the delicious duo she reached for her cell and called...</span></div></div>",
            "created":1282798800,
            "id":944360,
            "title":"Britney Spears"
        },
        "1311":{
            "choices":[
                "Pregnant ",
                "non pregnant",
                "full from voring jamie lynn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Jessica arrived she examined her. Is she</span></div></span></div>",
            "created":1350795600,
            "id":1451389,
            "title":"Juicy Jessica Simpson"
        },
        "13111":{
            "choices":[
                "Grabs Brittny and swallows her",
                "breaks down crying"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A very pregnant Jessica simpson waddles to the door and Brittny greets her and closes the door behind her but before she gets a chance to swallow jessica. Jessica</span></div></span></div>",
            "created":1350966720,
            "id":1452098,
            "title":"Pregnant "
        },
        "131112":{
            "choices":[
                "jessica simpson force feed herself to Brittny",
                "jessica swallows brittny"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I just swallowed my boyfriend cried jessica. Please do me a favor and close your eyes...</span></div></span></div>",
            "created":1350966900,
            "id":1452100,
            "title":"breaks down crying"
        },
        "134":{
            "choices":[
                "Pregnant!",
                "Nonpregnant!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it pregnant or nonpregnant Angelina Jolie you want to play as?</span></div></span></div>",
            "created":1242277200,
            "id":691185,
            "title":"Angelina Jolie"
        },
        "1341":{
            "author_id":"eyepop909",
            "author_name":"Mr.Smith",
            "choices":[
                "She doesnt care about her son and goes up stairs to digest",
                "she cant here him but she can feel him moving"
            ],
            "content":"<div class=\"\"><div> <span>Jolie was far into her second pregnancy and she did not mind it one bit in fact she liked getting her husband to do evrything for her but he was away at the moment so she was alone with her son.  it was then that the son came running up to her to sit on the sofa with her, theye wached tv for a bit but then she noticed him staring at her belly \"what are you looking at? still want to see the baby\"? she laphed but her son just answerd simply \"yes\" \"well i told you\" she replied \"there is no way i can get you in my body... unless i eat you and thats impossible\", she continued to wach TV \"but thers no harm in trying to eat me mom\" he said simply.  she thouht about this, she would just tell him he wouldent have seen the baby anyway considering it was in the womb not the stomoch.  \"ok then i will try but dont be dissapointed if it doesent work\" she got down on her hands and knees and waited as her son put his foot tawards her mouth.  she got it in suprising both her and her son as her mouth continued to strech around her son's leg.  he looked like he was enjoying it so she continued up his ancle.  he then stuck the other foot out and she got that in with the other one.  still on her hands and knees she continued to swallow her son.  the bulge that was already on her grew and grew as se finished his legs.  he was not a big boy and was under 10 so she got off her hands to support his body and started kneeling untill she reached his head and that didnt last long as he tasted delishious.  she swallowed and admired her belly which was now big enouph for her to be pregnant with 5 kids.</span></div></div>",
            "created":1286168400,
            "id":968558,
            "title":"Pregnant!"
        },
        "13411":{
            "author_id":"eyepop909",
            "author_name":"Mr.Smith",
            "choices":[
                "after the digesting the freind comes round and asks jolie to swallow her",
                "she goes to her local school and eat all willing kids"
            ],
            "content":"<div class=\"\"><div> <span>She sat admiring her belly once more then thouht she didnt care what happend to her son and she went up stairs to digest him.<br>\r\n<br>\r\nThe next day she had a normal pregnant belly once again.  so she decided to visit the park, on ariving at the park she saw a freind of hers and walked over to her (being a celeb she didnt have many normal freinds so she was very nice to this one) her 4 kids were playing on the slide when they saw her and ran over \"hey miss angelina\" they all said \"you still have that baby in your stomoch\"? they asked.  \"yes he's still ther my son wanted to see him yesterday so i swallowed him\" sudenly she realised what she had said and turned wondering what to do next, \"rearly!!?\" her freind exclaimed \"can i talk to you for a sec?\" when they were out of sight she asked... \"listen my children have been askin me wy they cant see your baby so could you swallow them and say that you forgot it was in your womb\"? \"ther annoying me so much it would just be for a short while\" she asked \"sure glad to\" Jolie walked over to the kids \"alright i har you want to see my baby? well evryone get to the top of the slide and i will open my moath for you to slide in\" she said to the little 6 year olds, they mediatly ran to the top of the slide and she got on her hands and knees.  the first one was a boy he was down in one guld hardly enlarging her tummy ,  the second a larger boy went down with two and the third boy was down in about 2 and a half gulps.  the forth was less eager to come \"if your scared dont be your perfectly safe in me\" \"or would you rather be in your mom?\" the freind looked at her douhter and opend her mouth wide so she could jump in and jump she did, the freind being new to this took 4 gulps to get her down and looked half the sise of a nine monther.  sh then sat down and talked with her douhter stroking her belly whilst Jolie slid away with her enormous belly to digest in peace.</span></div></div>",
            "created":1286859600,
            "id":973681,
            "title":"She doesnt care about her son and goes up stair..."
        },
        "134111":{
            "choices":[
                "Jolie heads home to 'do' her husband",
                "Jolie heads towards a collage campus"
            ],
            "content":"<div class=\"\"><div> <span>two hours later all 4 kids had been digested.  The mother comes back at this point and asks \"What was it like for them?\"<br>\r\nJolie sat and pondered this for a moment. <u><i> Should I tell her the truth, that they where in great pain?</i></u> Jolie decided to try a simpler path.<br>\r\n\"If you are really that curios, why not join them?\" asked Jolie.<br>\r\n\"I'm not sure.\"  she replied shyly.<br>\r\n\"Oh come on I can see you want to!\" shouted Jolie.<br>\r\nThe Mother thought for a minute, than said \"Ok.\"<br>\r\n<br>\r\nJolie stood up.<br>\r\n\"Good.\" she said \"I was starting to feel hungry again.\"<br>\r\nThe mother stood up and held her arms in front of her.<br>\r\n\"Before you swallow, could you play with me?\" she asked tentitivly.<br>\r\n\"Sure.\" Jolie replied.<br>\r\nWith that, Jolie took the mothers arms and stuck them in her mouth, and swallowed.  The first swallow surprised the mother as she went in to her waist in one go.<br>\r\nJolie stop'ed for a minute and began to lick the mothers nether regions.<br>\r\nThe mother started to squirm in pleasure.  Five minutes later she cam.<br>\r\nAt this point Jolie started to swallow again.  because the mother was already in to her waist, Jolie looked straight up and let gravity do the rest.<br>\r\ntwo minutes later it was all over.  The mother was already starting to be digested, and was screaming in pain.<br>\r\nJolie, ignoring the screams, tried to figure out what to do next.</span></div></div>",
            "created":1305090000,
            "id":1104522,
            "title":"after the digesting the freind comes round and ..."
        },
        "13412":{
            "author_id":"eyepop909",
            "author_name":"Mr.Smith",
            "choices":[
                "she digests him and then unberths him",
                "she swallows some stronger acid to save her the trouble of pooing him out whole"
            ],
            "content":"<div class=\"\"><div> <span>She got up from the sofa she could feel him moving and she knew he must be dissapointed that she had tricked him about the baby, but she was full had an enormous stomoch and no annoying husband to tell her not to eat the kids, She wonderd tho if she should try digesting him (she knew stomoch acids didnt harm humans) and them shove him up her vagina to introduce him to the baby but she would have to pass him either way.</span></div></div>",
            "created":1286168400,
            "id":968563,
            "title":"she cant here him but she can feel him moving"
        },
        "134121":{
            "choices":[
                "Angilena rebirths him and swallows him again digesting him",
                "Angelina unberths the neighbor kids"
            ],
            "content":"<div class=\"\"><div> <span>As she went to th<u></u>e bathroom she felt her son move again and let's out a massive belch as she walks she feels how full her belly really is and she gets a small hiccup. Once in the bathroom she squats over the tub and begins to push feeling her son move through her arouses her. She continues pushing feeling a large object well up in her butt knowing its her son she pushes hard feeling her anus stretch around him.He then falls to the floor of the tub laughing and she asks \"whats so funny.\" He says \"you burped.\" \"Are you ready to meet the baby for real this time?\" \"Yeah\" Angelina then positions her self over her son and she shoves his head into her pregnant pussy and covers him with cum as a lubracant and then slowly sucks him up into her pussy caressing her belly as it expands to the size of a full term quintuplet pregnant belly. She waddles to her bed as the last of him is sucked up.</span></div></div>",
            "created":1350795600,
            "id":1451385,
            "title":"she digests him and then unberths him"
        },
        "1341211":{
            "choices":[
                "Gets a strange craving for another small meal",
                "Gets a horny craving for sex"
            ],
            "content":"<div class=\"\"><div> <span>Angelina lays on the bed watching her son move in her belly and realizes how much better it was to have him in her stomach rather then her womb. She remembers how full her belly felt and how she wasn't hungry now that he is in her womb she is constantly hungry from having to feed her son, the baby, and herself. So she decides to rebirth her son and swallow him again. She waddles to the tube and begins to push on her sons body after a few trys his feet are visible in her panties and she continues to push until he is out completly now sitting under her completly covered in amniotic fluid and cum wrapped in her panties he says \"why did you push me back out I was having fun\" she says \"I know but I am hungry for a little boy and you are what I'm craving.\" Before he can react she pulls down her panties and grabs him and shoves his feet into her mouth, she swallows his feet and in one gulp he is in up to his hips screaming \"mommy please don't.\" Angelina  then tips her head back and uses gravity and the amniotic fluid as a lubricant she swallows again with a loud gulp only the boys head sticks out of her gapeing maw she swallows him up and feels him slide down her throat and just as he hits the bottom of her belly, Angelina lets out a monster belch and feels her belly become tight. \"Oh my belly is so full I'll  be fed for weeks.\" She then...</span></div></div>",
            "created":1350964620,
            "id":1452065,
            "title":"Angilena rebirths him and swallows him again di..."
        },
        "134122":{
            "choices":[
                "Angelina wakes to a normal belly and the doorbell",
                "The acid doesn't work"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Angelina goes to her cabinet with a strong stomach acid in and drinks every drop. She then goes to bed and falls asleep.</span></div></span></div>",
            "created":1350914520,
            "id":1451554,
            "title":"she swallows some stronger acid to save her the..."
        },
        "1341221":{
            "choices":[
                "Invites Tori in and swallows her whole.",
                "Invites Tori in and unberths her."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Angelina wakes up she notices her belly is back to a normal prergnant belly and she hears the door bell ring. She walks down stairs and opens the door and .sees her new neighbor named Tori. She then...</span></div></span></div>",
            "created":1350916440,
            "id":1451567,
            "title":"Angelina wakes to a normal belly and the doorbell"
        },
        "13412211":{
            "choices":[
                "digests Tori and becomes pregnant with triplets",
                "regurgitates Tori and feeds herself to Tori"
            ],
            "content":"<div class=\"\"><div> <span>As Angelina invites Tori in she notices Tori is also pregnant.b\"Hey how far along are you?\" She asked \"About six months with twins.\" Angelina thinks to her self (\"oh three for the price of one\") Once inside Angelina grabs Tori by the belly and stuffs it into her gaping mouth \"What are you doing?\" Cried Tori as Angelina sucked on her twin filled belly. Angelina grabed Toris hands and shoved them into her mouth and she pulled toris legs into her throat then one giant gulp Tori was in Angelinan's throat up to her C-cup breasts and she blasts a huge load of cum into Angelina's belly, Angelina gulpes again and swallows her up to her neck as Tori pleadeds with her \"P-please don't swallow me\" Angelina just ignores her and gulpes her down as she caresses her massive swollen belly as she watches Tori struggle inside her belly she let's  out a massive belch. Then she</span></div></div>",
            "created":1350928680,
            "id":1451703,
            "title":"Invites Tori in and swallows her whole."
        },
        "134122112":{
            "choices":[
                "continue as Angelina through Tori",
                "continue as Tori"
            ],
            "content":"<div class=\"\"><div> <span>Angelina sits on the couch and thinks (\"I wonder what its like being swallowed.\") So she puts her fingers in the back of her throat causing her to regurgitate th e contents of her stomach including Tori.Angelina feels a large object come up her throat thinking its Toris head but is suprised when it is her butt. As she continues to regurgitate she notices Tori is asleep. After she is done regurgitating Tori she opens the other pregnant womans mouth and she slips down to her underwear. Angelina then places her feet into Toris mouth and pushes into her throat forcing Tori to swallow. Angelina is now down to her thighs when Tori swallows again causing Angelinas twin filled belly to enter her maw. Tori soon wakes up and instinctivly tries to clear her throat of this largr blockage she swallows with a large gulp. Tori soon looks at what is blocking her throat and sees Angelina Jolie pushing herself further past Toris lips causing her to swallow and 2and a half gulps later all that is left is Angelinas head. With one final swallow Tori completly swallows and gulps down Angelina Jolie and as Angelina hits the bottom of her stomach she belchs a massive gas  bubble up.</span></div></div>",
            "created":1350966300,
            "id":1452094,
            "title":"regurgitates Tori and feeds herself to Tori"
        },
        "1341221121":{
            "choices":[
                "continue through tori",
                "continue as tori"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Angelina sits inside Tori's massive squishy belly rubbing her belly she listens to tori's belly make loud noises <a rel=\"nofollow\" href=\"http://www.shutterstock.com/subscribe.mhtml\" target=\"_blank\">http://www.shutterstock.com/subscribe.mh...</a> </span></div></span></div>",
            "created":1362296580,
            "id":1542757,
            "title":"continue as Angelina through Tori"
        },
        "135":{
            "choices":[
                "Lady gaga ",
                "Gwen stefani",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1331960400,
            "id":1296417,
            "title":"More"
        },
        "1353":{
            "choices":[
                "megan fox",
                "jessica simpson",
                "christina agulara"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices.</span></div></span></div>",
            "created":1350967260,
            "id":1452103,
            "title":"Other"
        },
        "13533":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Christina Aguilera ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Very inconsiderate of that lady writer to not continue the list, so</span></div></span></div>",
            "created":1479524040,
            "id":2238898,
            "title":"Or"
        },
        "135332":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Katy Perry",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one Katy Perry?</span></div></span></div>",
            "created":1479524160,
            "id":2238900,
            "title":"Other"
        },
        "14":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Tobreux",
                "Matheui",
                "Nathaniel",
                "Trinenna (female) enters through the doorway",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Datsun was awaiting arrivals, someone very special indeed. Smoothing her tangled hair down, the petite French girl patted her Axotl as it shimmied up her thigh, she smiled gratefully, she was feeling very horny indeed... almost too horny. Female hormones indeed. Her bionic eyes narrowed at a male who just arrived. He blushed at the sight of the leggy female, but it seemed there were more options through that doorway, he turned to leave, but Datsun interrupted.<br>\r\n\"Why act so concerned, cherie?\" she spoke playfully, \"I'm availible. What's your name,\"<br>\r\n<br>\r\n\"My name is...\" The male began. </span></div></div>",
            "created":1266210000,
            "id":836956,
            "title":"Datsun sizes up the male"
        }
    },
    "info":{
        "author_id":"maxtwenty",
        "author_name":"MaxTwenty",
        "brief_description":"F/? vore of any and all sorts, UB, anal, oral, hair, ear, whatever floats your boat.",
        "created":1149828300,
        "description":"<td align=\"left\" class=\"norm\">Hello, and welcome to yet another fleeting dream of this becoming the supposed \"ultimate\" vore interactive.<br>\r\n<br>\r\nTired of searching for vore and finding so very, VERY much M/M or M/F? Find that hard to get into (literally) but still like the concept of being swallowed? <i>Especially</i> in, shall we say, \"alternate\" ways? Well, look no further! This story is designed <i>just</i> for you, with <b>nothin' but</b> female swallowers. An otaku, are you? Well, just imagine yourself sliding down Sailor Moon's slippery throat, or if you get bored of that, take a break and go up Renamon's ass! If you don't like anime but still cartoons, games, etc. you can choose from many, MANY alternate scenarios in them as well, or even pick a celebrity to explore! What's this? Bored of those concepts already? Well then, feel free to create your very own original character! You've stumbled on a portal to the fantasies you've always dreamed of, and now you can let others take them even further!<br>\r\n<br>\r\n<br>\r\nThere's very few rules to this interactive short of preserving coherency really, and they are as follows:<br>\r\n<br>\r\n1) Pick first-person (I), second-person (you), OR third-person (she) viewpoints! However, please preserve that choice throughout. For instance, if one chapter is: \"She tilted her head back, and (X) slid down, down into that fleshy abyss, when...\" then the next chapter <i>should not</i> be something like \"I fell for what seemed like eons before I reached that hellish zone, that place would surely be my tomb.\" A suitable alternative would be: \"(X) fell for what seemed like eons before she reached that hellish zone, that place that she knew would surely be her tomb.\" This may be changed ONLY if you give an option to do so in the next chapter. And at that point, please pay attention to Rule#2:<br>\r\n<br>\r\n2) It's fully acceptable to have the followed character swallow another character as a plot device; However, in this instance the swallowed character must be female. Let's make no false pretenses: This is not, nor is it trying to be, a vore story for everyone under the sun. It is built for those who are disgusted by picturing male genitalia.<br>\r\n<br>\r\n3) Please, PLEASE, no extremely short chapters, and certainly no short endings. It is allowed to end the story in a given branch, however remember the golden rule of any story: The ending is usually the climax, and the anticlimax rolled into one. In other words, make sure something story-ending happens and that all loose ends are wrapped up suitably. If you end it with a small paragraph, you better believe that chapter's getting deleted.<br>\r\n<br>\r\n<br>\r\nNow yes, I know it sucks when somebody goes modhappy on your story. So I will not, EXCEPT in the case where these rules are deliberately flouted or in other extenuating circumstances. Suffice to say, your story is safe unless it's blatantly racist or offensive (in other ways than pornography). By that I mean, you won't get a chapter deleted for saying a character is black, NOR if you use, say, the word \"nigger\" as being said by another character when it <i>is</i> part of that character. You probably WILL have a chapter deleted if you use the word multiple times in narration unrelated to a character's thoughts, etc.<br>\r\n<br>\r\nThis is getting long. Have fun with this, and don't worry about keeping it TOO clean =) </td>",
        "id":1116803,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1531432620,
        "modified":1531432620,
        "pretty_title":"Swallowed by girls... hee hee"
    }
}