{
    "chapters":{
        "1":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Naruto",
                "Sasuke",
                "Shikamaru",
                "Choji",
                "Gaara"
            ],
            "content":"<div class=\"\"><div> <span>It is an unusually hot day in the hidden lead village, the inhabitants are warm and sweaty. They look delicious to you, you have befriended a few even told one or two that you think they would be tasty, some have even seamed interested back. Some of your friends have fetishes that they want to explore others are completely revolted by the whole idea of being eaten. You don't care, your hungry and horny and they are walking meals.<br>\r\n<br>\r\nThe question is who do you go after first?</span></div></div>",
            "created":1325102460,
            "id":1247997,
            "title":"It begins"
        },
        "11":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Eat Him! (Unwilling)",
                "Eat Him (willing)",
                "Foot Fetish",
                "Ass Fetish",
                "Fuck Him First"
            ],
            "content":"<div class=\"\"><div> <span>Mmmm he looks good you think staring at the cute blond in the orange jumpsuit. You follow Naruto around a bit and hang out with him for awhile until he finally heads home, out of the eye of the public. He invites you in so hang out for a bit, in traditional style he takes off his sandals and the smell hits you, you can't help but drool a little at that scent. You play games and bullshit for awhile as you stare at his body, he finally catches you looking at him with a vacant stare on your face.<br>\r\n<br>\r\n\"What do you keep staring at me for?\" he asks almost angry<br>\r\n\"Sorry\" you say \"I'm just a little hungry\" <br>\r\n\"Oh, you should have said something, I can help!\"<br>\r\n<br>\r\nYou've decided your going to eat him but does he want you to and do you go right for the main course or do you play with your food some?</span></div></div>",
            "created":1325102940,
            "id":1248000,
            "title":"Naruto"
        },
        "111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Mouth",
                "Cock",
                "Ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Naruto eat him?</span></div></span></div>",
            "created":1350745380,
            "id":1450283,
            "title":"Eat Him! (Unwilling)"
        },
        "112":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Spit him up for more fun",
                "Take a nap",
                "Someone comes in"
            ],
            "content":"<div class=\"\"><div> <span>You look at Naruto inquisitively as he starts taking off his clothing revealing that sexy naked teen body. He is glistening with sweat and smells amazing even from the other side of the room. \"If your hungry why not eat me, I know you want to\" Naruto taunts. <br>\r\n\"Are . . .Are you sure Naruto\" you ask, he nobs and lays down on the bale. You start smelling his feet, they are soft and smell amazing, you bury your nose between them as he scrunches his toes. You start licking his toes and between them sucking slowly inching his feet in further your lick all over tasting the sweaty outline of his soles. You swallow past his delicious feet as you see that big grin on his face. You slowly nibble up his tasty calves and thighs tasting his delicious boy meat before twirling your tongue around his cock slowly making him rock hard. You suck him off gently as you stroke your own cock and cum at the same time. Next you begin licking his tasty hole playing with his butt, its so soft and delicious you just can't resist. \"mmm Eat me\" he moans. You start licking over his ribs and chest finally licking the pools of sweat out from his pits before sending the tasty ninja to your belly.</span></div></div>",
            "created":1359752100,
            "id":1521897,
            "title":"Eat Him (willing)"
        },
        "113":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Eat Him",
                "Fuck Him",
                "Another Fetish"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait right here, I'll get you something\" Naruto says  You glance at those feet as he walks away and realize his sweaty sandals are still int he room. You grab one and inhale deeply, it has a strong odder to it, strong and delicious. You lick the inside of it tracing where his heal would be all the way up to his toes. It tastes salty and amazing, you've wanted to lick his feet for a very long time and now you at least get his shoes.<br>\r\n<br>\r\n\"What you couldn't wait for me!\" In horrified shock you turn to see Naruto re-enter the room, in even greater surprise you realize he is completely naked. \"Don't worry I'm not mad, I was gonna let you eat me so you'd be licking my feet eventually.\"<br>\r\n<br>\r\n\"May I lick them some before I eat you?\" you ask shyly<br>\r\n\"Of course\" said the energetic teen. Naruto pushed everything off of his table and laid on it stomach up, \"Lick away and when your done licking me, eat me. Just make sure to spit me up later.\" You needed no more hesitation or direction you where instantly at his bare sweaty warm feet. You pressed your face into them inhaling deeply, they smelled even stronger than the sandals. Your tongue gently flicked below his toes once, then again before finally fully emerging from your mouth to lick those pink soles. They were warm and felt good against your tongue. you stuck his whole heal in your mouth and sucked and nibbled at it.<br>\r\n<br>\r\nNaruto's hand slowly worked its way down to his now hard dick and played with it seductively. You sucked at his soft salty heals then licked up his arch to his toes. you lick and suck at his toes before taking all five in your mouth at once and sucking then all, they were delicious. Your noticeably drooling and moaning with pleasure. Your tongue swirls around all of his tasty toes before repeating on the other foot in full. You go up to his face and give it a giant lick and him a passionate kiss. . . <br>\r\n<br>\r\nYou and Naruto are both rock hard, do you fuck him, eat him, or do you have another fetish.</span></div></div>",
            "created":1325103900,
            "id":1248012,
            "title":"Foot Fetish"
        },
        "1133":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Ass",
                "Pitts",
                "Add your own"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which fetish will it be next?</span></div></span></div>",
            "created":1325103960,
            "id":1248013,
            "title":"Another Fetish"
        },
        "11331":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Eat Him",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Naruto turns over on the table exposing his juicy ass, you cannot contain yourself you lunge right for it. You start biting and sucking on one of his butt checks while feeling the other one, it was warm and squishy yet muscular, it was hairless and tasted amazing. You switched to the other getting a good taste for both before going between then and licking around his hole.<br>\r\n<br>\r\nNaruto was moaning with joy, clenching slightly but not a lot. You went in exploring as far as your tongue would take you, getting in as much of his taste as you could. You finally had your fill but were so hard it was difficult to think of anything besides fucking this freshly lubbed hole. You get on top of Naruto and thrust it in with no mercy, you could almost hear him whimper. In and out, in and out on that nice young hole, you pumped away with all your might you felt him cum on the table and you soon followed inside him.<br>\r\n<br>\r\nYour stomach growled loudly. Is  it dinner time yet?</span></div></div>",
            "created":1325104620,
            "id":1248017,
            "title":"Ass"
        },
        "113311":{
            "author_id":"justusgirls",
            "author_name":"Kathy",
            "choices":[
                "Tease him",
                "Screw that. Keep eating!"
            ],
            "content":"<div class=\"\"><div> <span>You flip Naruto over and stuff his head into your mouth. Your tongue quickly assaults Naruto's face tasting him and covering him in drool. You take a big gulp sending Naruto's head into your throat. Your throat bulges out showing all of Naruto's face. You start taking big gulps swallowing more and more of Naruto. You work your way over his chest giving his hardened nipples a licking before swallowing them and licking his abs. You take a big gulp brining Naruto's waist into your mouth. You notice he has a hard on. Should you tease him or keep swallowing?</span></div></div>",
            "created":1379377020,
            "id":1664263,
            "title":"Eat Him"
        },
        "1133112":{
            "author_id":"justusgirls",
            "author_name":"Kathy",
            "choices":[
                "Go to sleep",
                "Go find someone else"
            ],
            "content":"<div class=\"\"><div> <span>You decide that you want to keep eating Naruto so you do. You swallow his squishy butt and dick and swallow his legs like noodles giving his toe's a little teasing lick and tasting them before swallowing them too. You sit back and enjoy the feeling of Naruto's legs entering your stomach. You sit back and sigh. You feel a pressure in your stomach and then \"<b>UUUURRRRPPPPP</b>\" and Naruto's headband comes flying out of your mouth landing a few feet away. Naruto struggles inside your stomach making you moan and rub your over sized belly in pleasure. Now do you go to sleep or go find someone else?</span></div></div>",
            "created":1379377320,
            "id":1664265,
            "title":"Screw that. Keep eating!"
        },
        "115":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Find another activity",
                "Eat Him",
                "Someone walks in"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you mean you can help?\" you ask obviously confused hoping the spunky blond is thinking the same thing you are.<br>\r\n\"I know you want to eat me and I'm fine with that but before you do I want to have some fun\" Naruto then leans in kissing you sensually. Within seconds all aspects of cloths are gone, Naruto is laying on a table with his legs in the air. You lick over his juicy butt and around his tasty hole getting hungrier but also making for a good lube. You slowly lick up and down his shaft before positioning your as his waiting hole. You put his ankles over your shoulders and start to slowly push in. It is a tight fit and you can see a small glimmer of pain on his face quickly replaced by joy. As you pump Naruto moves his feet so one is covering your nose and the other is just under your lips. You inhale deeply getting the sweaty delicious scent of a hard days work before opening your mouth and sucking on his long tasty toes. Do you stop here and find another fun activity for the blond or do you shoot your load and cram him down your gullet?</span></div></div>",
            "created":1433048280,
            "id":1985645,
            "title":"Fuck Him First"
        },
        "1153":{
            "author_id":"arros101",
            "author_name":"Arros101",
            "choices":[
                "Sasuke",
                "Konahamaru",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Someone walks into the room and see's you fucking, who is it?</span></div></span></div>",
            "created":1587955380,
            "id":2825344,
            "title":"Someone walks in"
        }
    },
    "info":{
        "author_id":"arros101",
        "author_name":"Arros101",
        "brief_description":"Naruto male vore and any other fetish you want.",
        "created":1325102160,
        "description":"<td align=\"left\" class=\"norm\">This is a vore story predominately but with some fetish (feet, ass, ect.) I still want lots of vore though.<br>\r\n<br>\r\nYour name is Jiro, a 17 year old boy who has stayed back behind the seams but is a full shinobi of the hidden leaf village. You have spiky light-brown hair, pale skinny, size 11 feet and you stand about 5.6ft. Your special salivate jutsu allows you to swallow people whole and to spit them up later . . .or not.<br>\r\n<br>\r\nRules-<br>\r\n-No Toilet<br>\r\n-No Girls<br>\r\n-sex and fetish is fine and encouraged<br>\r\n-lets try for longer posts please.<br>\r\n-No shrinking or growing!<br>\r\n-other than that anything goes!!</td>",
        "id":1836268,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1587955380,
        "modified":1587955380,
        "pretty_title":"Naruto Vore and Fetish Male Only"
    }
}