{
    "chapters":{
        "1":{
            "author_id":"horstbarbara",
            "author_name":"HorstBarbara",
            "choices":[
                "you collapsed during a football game",
                "you notice some changes in your appearance",
                "You start feeling sick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are Jonah Miller, 19 years old. Last year you graduated from high school. After moving away from your parents to study abroad, you are getting along alone pretty well, until...</span></div></span></div>",
            "created":1551378240,
            "id":2624378,
            "title":"Where does the road lead us to?"
        },
        "12":{
            "author_id":"horstbarbara",
            "author_name":"HorstBarbara",
            "choices":[
                "Your hips seem to be wider",
                "Your legs are losing hair",
                "Your Penis seems shrunken",
                "Your waist is getting thinner",
                "Other Choices"
            ],
            "content":"<div class=\"\"><div> <span>It was a lazy sunday morning and you got nothing to do. After getting up and getting some light breakfast, you started to work around your place. You are renting a small apartment at the outer rim of the city. This area is very sleepy and nothing really happens all day. This is what you like about this place, being a shy and silent guy. After some cleaning and sorting, you decide to get a shower.<br>\r\n<br>\r\nYou've never been the body-aware type of guy, not really doing sports. But, at least, you are keeping yourself clean and tidy. After showering you take a closer look on yourself in your big bathroom mirror. While being 5 feet and 9 inches tall, you bring your 176lbs on scale. It's not like you are looking like a fatty, but you're not small either. At the moment you let your average brown hair growing out, as you are to lazy to visit a hairdresser. Except from your emerald green eyes, you got a pretty average face. Nothing out of the ordinary.<br>\r\n<br>\r\nJust then you realize</span></div></div>",
            "created":1551379380,
            "id":2624387,
            "title":"you notice some changes in your appearance"
        },
        "124":{
            "author_id":"horstbarbara",
            "author_name":"HorstBarbara",
            "choices":[
                "Visit the public swimming pool",
                "Keep yourself entertained at the TV"
            ],
            "content":"<div class=\"\"><div> <span>\"Finally!\" you thought, \"I think my dieting is getting some shit done!\"<br>\r\n<br>\r\nFor the last few weeks you've been doing some newly invented diet, which uses a lot of soya, herbs and a special lotion, but no exercise (which was important to you). It seems like the first changes are starting on becoming visible, which is a sign of success.<br>\r\nHappily, you grab a towel in which you roll yourself in to get dry. Afterwards you are applying the lotion and dressing yourself up. You notice your Shirt being slighly baggier around the waist.<br>\r\n<br>\r\nWhat do you want to do with the rest of the day?</span></div></div>",
            "created":1551380220,
            "id":2624403,
            "title":"Your waist is getting thinner"
        },
        "1241":{
            "author_id":"horstbarbara",
            "author_name":"HorstBarbara",
            "choices":[
                "The next day",
                "During the night"
            ],
            "content":"<div class=\"\"><div> <span>A couple of blocks away is public swimming pool, which is not overcrowded this boring evening, you assume.<br>\r\nSo you start collecting everything you need and throw it into your bag:<br>\r\n<br>\r\nSwimming trunks<br>\r\nnew underwear and socks<br>\r\na towel<br>\r\nyour Lotion<br>\r\nSome cash<br>\r\n<br>\r\n\"This should do, or i am missing something? ... Na, thats it!\" you thought to yourself, closing the apartment door behind you. After around a fifteen minute walk, you arrive at the public swimming pool and pay the 10 bucks charge. \"This have been cheaper a year ago...\". <br>\r\n<br>\r\nThe inside of the poolhouse was very nice, they spent a lot of money in some improvements and innovative new things inside. This was probably the reason for the increased charge. As predicted, the place was pretty empty so you got a lot of room to yourself. After swimming a few laps and getting tired, you decide to take a closer look on the new features. There was something you thought of being a hot tub. You skipped reading the description because your body felt sore from the effort.<br>\r\n<br>\r\nYou let yourself down into the empty tub into the extraordinary hot water. You were not expecting this, being close to getting burned. But it was very relaxing on the other hand and your muscles just needed it. So you got yourself in, down to the neck. After some quality time and deep relaxing, you left the hot tub nearly drifting off to sleep without realizing that you elimated all of your body hair in this thing.<br>\r\nWhat you realized is, that your swimming trunks were obviously not made for this kind of high temperatures, they shrunk and now sit tightly on your behind and hips. \"Shit\", you mumbled, \"this is my last pair...\"<br>\r\n<br>\r\nYou left for the changing rooms, dried yourself up while noticing the towel feels a bit harder than usual, proceed with covering your body in the Lotion, dressing up into a seemingly tight brief and your remaining clothes, finally heading home. After strolling home for 20 Minutes, you fell into bed exhausted only in your briefs.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1551382140,
            "id":2624412,
            "title":"Visit the public swimming pool"
        }
    },
    "info":{
        "author_id":"horstbarbara",
        "author_name":"HorstBarbara",
        "brief_description":"When Jonah is diagnosed with a life threatening disease, medication did not go as planned.",
        "created":1551378060,
        "description":"<td align=\"left\" class=\"norm\">First of all, some basic rules:<br>\r\n- Please watch for spelling and grammar mistakes<br>\r\n- Swearing is okay, but do not overuse it<br>\r\n- Chapters which are not matching the story line or have to much spelling/grammar mistakes will be deleted<br>\r\n<br>\r\nSo let's get going!<br>\r\n<br>\r\nYou are Jonah Miller, 19 years old. Last year you graduated from high school. After moving away from your parents to study abroad, you are getting along alone pretty well, until...</td>",
        "id":2184053,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1551382140,
        "modified":1551382140,
        "pretty_title":"Side Effects"
    }
}