{
    "chapters":{
        "1":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Phineas",
                "Ferb",
                "Candace",
                "Jeremy",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lets start of with some characters.</span></div></span></div>",
            "created":1283749200,
            "id":951290,
            "title":"Who to choose?"
        },
        "11":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Ben does it, finding that the Ray completely worked",
                "Ben does it, but sees that he is still afraid of feet. ",
                "Ben does not do it"
            ],
            "content":"<div class=\"\"><div> <span>It's just another summer day for Phineas and the gang. They spend the whole day making something and testing it out. The new neighbor, Ben, watches them from his room, a little shy. He sees that they gang have some sort of ray gun and have shot each other with it, but it seemed like nothing had happened. A couple of hours pass before Ben decides to go over and see what they are doing. By the time he gets to the back yard, everyone has left and Phineas and Ferb are heading inside the house. In the corner of his eye, Phineas sees Ben in the yard and tells Ferb that he will be inside in a minute. <br>\r\n<br>\r\nPhineas walks over to Ben and says \"Hey there, I am Phineas. You just moved in next door to us right?\"<br>\r\n<br>\r\nBen smiles at Phineas, happy that his neighbor is so friendly. \"Yea, I did. My name is Ben. I was just wondering what you and your friends were doing out here.\"<br>\r\n<br>\r\nPhineas reply's \"Oh, me and my brother Ferb made a ray gun that will get rid of a persons fears. We were testing it out on our friends and us and it works and is completely safe. Do you want to try it out?\"<br>\r\n<br>\r\nBen looks amazed at this, but is a little skeptical. \"Well, maybe. The only phobia I have is feet. My parents aren't home right now, so you mind if we go to my house to do this?\"<br>\r\n<br>\r\nPhineas smiles at this \"Sure, lets go over now.\"<br>\r\n<br>\r\nPhineas goes inside to tell his parents that he is going to the neighbors house. Once Ben and Phineas gets to Bens room, Phineas pulls out the ray gun and shoots Ben with it. Ben sees the ray hit him, but doesn't make him feel different. Ben asks \"Did it work?\"<br>\r\n<br>\r\nPhineas sit's on Bens bed looking at Ben. \"Well, only one way to find out. How about you come over and take my shoes off and massage my feet?\"</span></div></div>",
            "created":1409368080,
            "id":1849145,
            "title":"Phineas"
        },
        "111":{
            "author_id":"grzeskowiak",
            "author_name":"M. G.",
            "choices":[
                "Agrees and willingly slides his nose into the shoe while rubbing the socked feet",
                "Refuses and struggles against Phineas",
                "Phineas changes his mind last second, he has other plans for Ben"
            ],
            "content":"<div class=\"\"><div> <span>\"Well I'm not so sure about this\" Ben says while looking back at Phineas. \"Oh come on! How else are we gonna find out? Besides since it's so hot today my feet are probably sweaty and smelly so we will know for sure that you aren't afraid of them\" Phineas says and points at his feet. \"Well... Okay!\" Ben finally manages to say while looking Phineas's feet. \"That's the spirit\" Phineas says with a smile.<br>\r\n<br>\r\nBen slowly walked up to his bed and then kneeled in front of Phineas, Phineas couldn't help but grin in a dominating way, he didn't know why but he was enjoying seeing his new friend in this position. Phineas then planted his feet in Ben's lap, as soon as that happened Ben started undoing the laces of Phineas's shoes, then he slowly pulled off his right shoe, revealing sweaty socked foot of Phineas. Ben gulped as he looked at the foot in his lap, the socks were darkened and he could easily see the sweat stains and feel the heat emitting from the foot. \"Well? What are you waiting for? Only one way to find out right?\" Phineas said with a chuckle and then wiggled his toes. Ben then grabs his foot and starts rubbing it, immediately feeling the dampness of the sock, as if that wasn't enough the smell finally got to his nose, it was really strong boy feet smell, with really intense aroma of foot sweat and sweaty socks. One thing was certain Ben wasn't afraid of feet anymore, actually he found the smell rather pleasant, he found the damp texture of the sock and the sight of Phineas's feet really enjoyable as well. His fingers were exploring the foot, digging between the toes, squeezing them, or just touching around the foot. Phineas really enjoyed the treatment, having someone at his feet was gratifying. Ben finding his attraction and curiosity towards his new friend's feet a little shocking said \"I-I think tha-that I'm not afraid anymore, maybe we should stop?\", Phineas was quick to respond \"Oh I don't think we should, you know how it is with experiments, you have to give it time, and we wouldn't want wrong results right?\" he said with a smile and then followed it with \"In fact I think you should take my other shoe off don't you agree? You know just to be sure...\" Phineas was really enjoying having someone at his feet, he wasn't gonna let go so easily. \"I-I guess you're right\" Ben said nervously and then started pulling the left shoe off. As soon as the shoe was off the smell intensified, the other socked foot was even sweatier and warmer now since it had some more time to bake in that shoe, Phineas sighed happily and then wiggled his toes while smiling smugly. Ben then placed his hands on the left foot and again indulged in touching the damp material of the sock. In the meantime Phineas grabbed his shoes and said \"You know what? I don't think it's a fair experiment, after all we should test more things than just if you are afraid of rubbing my feet, I think you should rub my feet WHILE smelling my shoes\" Phineas then takes one of the shoes and shows the opening of it to Ben, slowly getting it closer and closer to Ben's face. Ben then </span></div></div>",
            "created":1410661380,
            "id":1856517,
            "title":"Ben does it, finding that the Ray completely wo..."
        },
        "1111":{
            "author_id":"socker",
            "author_name":"Socker",
            "choices":[
                "Ben smells Phineas's socked feet.",
                "Ben smells Phineas's bare feet."
            ],
            "content":"<div class=\"\"><div> <span>Ben agrees and willingly slides his nose into Phineas's shoe while rubbing his socked feet.<br>\r\n<br>\r\nAt once, a warm and damp and musty sensation hit Ben right in his nose. It smells like the heat of the whole summer was concentrated in his shoe, as if Phineas never took off his shoes through all the adventures he had.<br>\r\n<br>\r\n\"Hey Ben,\" said Phineas, \"Do you know what the tip of a shoelace is called?\"<br>\r\n<br>\r\n\"Nope.\" Ben was so engrossed - yet not grossed out - by the scent of the shoe that he didn't really care for fun facts.<br>\r\n<br>\r\n\"An aglet!\" exclaimed Phineas.<br>\r\n<br>\r\n\"A <i>what</i> let?\" <br>\r\n<br>\r\n\"A-G-L-E-T. Aglet! Don't forget it!\" sang Phineas.<br>\r\n<br>\r\nBen couldn't believe it. This kid was actually singing! And singing about... the tip of his shoelace? Although Ben thought it was strange at first, the effects of the ray soon made him lose whatever fear and uncertainty he may have had. Actually, hearing the voice of Phineas singing was comforting to Ben, and almost hypnotic. And of course, now that Ben learned about the aglet, he didn't have to be a-frayed.<br>\r\n<br>\r\n\"I'll never forget it now,\" said Ben, \"since that song is going to be stuck in my head!\" <br>\r\n<br>\r\n\"That's great! Hey, why don't you pull on my aglet so that you can loosen my shoelaces? That way you can open up the tongue of my shoe better!\"<br>\r\n<br>\r\nPhineas's shoes were blue with white laces and high tops. His shoelaces definitely needed some loosening to widen up the opening of his shoe.<br>\r\n<br>\r\nBen started to remove his hands from Phineas's sweaty socked feet in an attempt to grasp the aglet, but was soon interrupted.<br>\r\n<br>\r\n\"Whoa, buddy, I didn't say you could stop rubbing my feet!\" <br>\r\n<br>\r\n\"B-but- you said you wanted me to loosen your shoelaces?\" stammered Ben, quickly restoring his hands to their rightful position at Phineas's feet.<br>\r\n<br>\r\n\"You know, when I'm faced with a problem, I like to think of creative ways to solve it,\" said Phineas proudly. \"People are always surprised at how young I am when they see my inventions.\"<br>\r\n<br>\r\n\"Yeah, aren't you a little young to invent a ray that gets rid of people's fears?\" questioned Ben.<br>\r\n<br>\r\n\"Yes. Yes I am,\" said Phineas with a smile. \"But you're not too young to figure out an innovative way to loosen my shoelaces while massaging my feet!\" <br>\r\n<br>\r\n\"Hmm...\" Ben thought out loud, \"I think I have an idea, but I'll have to chew it over for a while.\"<br>\r\n<br>\r\nAnd with that, Ben bit into the little piece of plastic at the end of the shoelace. He pulled the laces loose with a flourish, and smiled with the aglet through his teeth.<br>\r\n<br>\r\n\"Now that's showing innovation!\" said Phineas. \"Wish I could give you something in recognition for your genius. I know! Why don't you get a nice big whiff of my shoe now that my laces are loosened up for you?\"<br>\r\n<br>\r\n\"That would be the best prize ever,\" said Ben. He eagerly dug his face into the wide-open tongue of the shoe, now releasing even more of the sweaty summery scent that was previously confined by the laces. The essence of all the past escapades experienced by Phineas permeated the lining of his shoe, and was now filling Ben's lungs. It was almost as if Ben, the new kid on the block, was living vicariously through Phineas every time he inhaled his shoe. Ben sniffed the shoe and massaged the feet of Phineas for about 23 minutes, with no breaks. Phineas enjoyed every minute of it.<br>\r\n<br>\r\nFinally, Phineas said, \"You know, Ben, whether I'm building something or doing researching for a plan, I like to have good sources. My observations show that you've lost your fear of smelling my shoe. Now you should go straight to smelling the source!\"<br>\r\n</span></div></div>",
            "created":1465612560,
            "id":2162283,
            "title":"A-G-L-E-T. Don't forget it!"
        },
        "11111":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Lick my socked feet!",
                "Take my socks off!"
            ],
            "content":"<div class=\"\"><div> <span>Phineas removed the shoe from Ben's face while smiling down to him, and lifted the foot that wasn't currently being until it was about a foot away from Ben's face. \"Seems like you enjoyed that. Now it's time for you to smell my feet directly from the source! Socks on of course. If this goes well, the socks come off.\"<br>\r\n<br>\r\nBen couldn't help but blush a bit when Phineas said he enjoyed the smell of his shoe. \"Yea, I guess I did enjoy it didn't I?\" Ben couldn't help but stare at the socked foot in front of his face. The sock hugged Phineas's foot, the shape of his foot being completely visible. Ben could see the sweat stains on the bottom of the sock and foot. He was unable to tell if the socks have been worn for a couple days, or if his feet just sweat that much during his adventures. The smell was definitely strong though.<br>\r\n<br>\r\n\"If you enjoyed my shoe, then you are gonna love this.\" Phineas's said with a bit of a smirk, watching Ben staring at his foot. Phineas of course wanted to help Ben with his fear of feet. But he couldn't help to feel a bit playful and a bit controlling of Ben. Phineas started lowering his foot onto Ben's face, watching for his reaction. <br>\r\n<br>\r\nBen watched the foot get closer to his face and the smell getting stronger as it did. Within just a couple of seconds, Phineas's sweaty socked foot was on his face. More importantly, Phineas's toes were right on Ben's nose and his sole covering his mouth, making sure Ben breathed through his nose and Phineas's toes. Ben was definitely getting the smell directly from the source. He was filled with an intense cheesy scent with each breathe he took. The feet were smelly enough to make normal people stay away from them, let alone have the feet on their face. The socks weren't even off yet, and Phineas's feet are bound to be smellier when they do come off. But Ben just sat there and smelled Phineas's toes. He actually really enjoyed it, almost loved it like Phineas said he would. <br>\r\n<br>\r\nBen was so focused on the smell, he stopped massaging Phineas's other foot. This of course was noticed by Phineas, who could only smile more. \"Hey, don't stop massaging my foot.\" Phineas said playfully with a small chuckle. Ben immediately started massaging the foot again while he sniffed the one on his face. Phineas just laid back with a smile, relaxing as he had his feet taken cared of. This went on for 15 minutes. Ben didn't complain at all, just sat their and enjoyed Phineas's sweaty smelly foot as he massaged the other sweaty foot. Phineas even playfully wiggled his toes on Ben's nose and curled them over his nose some times, just to make sure he got the most of the smell. <br>\r\n<br>\r\nAfter 15 minutes, Phineas sat up to watch Ben. He could see Ben had his eyes closed, and it could only make Phineas feel even better knowing that Ben was seemingly loving his feet. Phineas decided it was time to move on and broke the silence. \"Well it definitely seems like you enjoy the smell. There is still more to observe though! I think it's time that you...</span></div></div>",
            "created":1466185920,
            "id":2165717,
            "title":"Ben smells Phineas's socked feet."
        },
        "111111":{
            "author_id":"socker",
            "author_name":"Socker",
            "choices":[
                "Taste my bare feet?",
                "Taste my brother's socks?"
            ],
            "content":"<div class=\"\"><div> <span>\"I think it's time that you lick my socked feet!\" said Phineas, with a friendly yet dominant tone in his voice.<br>\r\n<br>\r\nBen took one last whiff of the smelly socked toes ensconced around his noes. He certainly enjoyed smelling them. Now he couldn't believe he could get to taste them! Ben's mouth was already watering at the thought, before he even drew out the tip of his tongue. He shakily gave a quick lick on a small section of the socked sole.<br>\r\n<br>\r\n\"C'mon Ben, you can do better than that!\" encouraged Phineas.<br>\r\n<br>\r\nNow Ben slowly dragged his tongue from the heel of the socked foot to the tips of his toes. The texture of the sock on Phineas's foot was curious to Ben. The surface was smooth were the sock clung to the warm sweat on Phineas's sole; Ben's tongue glided over these areas with ease. Other parts of the sock were slightly drier, and the soft yet coarse cotton of the sock tickled Ben's taste buds. Ben licked not just the sole of the socked foot, but around the ankle, the top, and, of course, the toes.<br>\r\n<br>\r\n\"You know, there's actually a strong connection between the sense of smell and the sense of taste,\" said Phineas. \"It only makes sense that this would be the next step in our observations to see if the ray gun is working. So, now that you know how my feet smell in my socks, how do they taste?\"<br>\r\n<br>\r\nBen sucked on Phineas's toes, still with the socks on. He truly savored the sweaty flavor. Then with his mouth clamped over the toes, Ben's tongue made circles and swirled over the ball of the foot.<br>\r\n<br>\r\n\"It tastes... good,\" said Ben, his voice muffled with a mouthful of Phineas's foot. \"Kind of salty.\"<br>\r\n<br>\r\nIn fact, Phineas's socked feet tasted like a bag of chips! It even somewhat smelled like it too. The socks smelled like they would be sour or spicy, yet the taste was more salty and savory.  Ben couldn't quite decide which flavor it tasted like the most: it could have been sour cream and onion, or salt and vinegar, or even nacho cheese. Maybe all of the above. What was certain, though, was that once Ben had a taste, he couldn't have just one! He stopped massaging Phineas's other foot and enthusiastically tasted the fresh sock as though he had just opened a new package of chips and didn't want to share.<br>\r\n<br>\r\n\"Going for seconds, I see,\" said Phineas with a laugh.<br>\r\n<br>\r\nBen couldn't just go for seconds — he could go for minutes, hours even! He could spend all night sucking on Phineas's socked feet. Phineas felt so relaxed that he laid back and took a 45 minute nap. Ben wouldn't mind if Phineas had decided to sleep for longer.<br>\r\n<br>\r\nPhineas woke up to see that Ben was still at it. Ben continued licking away at both of Phineas's socked feet, like a happy puppy enjoying the socks of his master. Ben almost felt as though Phineas owned him, and it was his job to please him. Perhaps it was one of the ray gun's side effects, in addition to eliminating Ben's fear of feet. Maybe it was just Ben growing more attached to his new friend. Whatever the reason was, Ben would have been glad to be Phineas's pet at the foot of his bed. Phineas enjoyed his new pet as well. Who needs a boring platypus (that doesn't do much), when you could have a nice puppy instead? <br>\r\n<br>\r\nAfter over an hour of Ben licking, sucking, and savoring Phineas's feet, the fabric of the socks were completely soaked. They were already wet with sweat to begin with; now, they were sodden with saliva.<br>\r\n<br>\r\n\"It looks like you've tasted all you can from my socks,\" said Phineas. \"Now, why don't you...\"<br>\r\n</span></div></div>",
            "created":1468568100,
            "id":2180509,
            "title":"Lick my socked feet!"
        },
        "1111111":{
            "author_id":"storysearch",
            "author_name":"Storysearch",
            "choices":[
                "Invite my brother? ",
                "Rest my feet on your face?"
            ],
            "content":"<div class=\"\"><div> <span>REALLY?!?!?! shouted Ben, unable to contain his excitement.<br>\r\n<br>\r\n\"Of course...c Phineas said with a small smile; \"you've earned it!\"<br>\r\n<br>\r\nUnable to wait another second, Ben took Phineas's feet in each of his hands and yanked off both of the socks at the same time.<br>\r\n<br>\r\nWhat Ben saw before him made him shudder with excitement. Phineas's feet were absolutely perfect Evenly rounded heels and soles with slender arches, topped off by twelve shapely toes.<br>\r\n<br>\r\nBen began to lick his lips. \"W-what should I do first?\" he asked, his voice quavering.<br>\r\n<br>\r\n\"You've proven yourself to be a pro at this over the past few hours!\" replied Phineas; \"I leave it up to you!\"<br>\r\n<br>\r\nBen smiled. Then, without waiting another second, he started to pass his tongue over the length of Phineas's soles. First the right one, then the left one.<br>\r\n<br>\r\nPhineas let out a moan of extreme pleasure \"OOOOOOHHHHHH; don't stop Ben!\"<br>\r\n<br>\r\nBen continued to lick both of the soles for about 15 minutes. The chip-like taste of Phineas's sweat was even better than it had been when the socks were on. <br>\r\n<br>\r\nThen, Ben began to suck Phineas's right big toe. It was like biting into a hot dog, except, this was 100 times tastier! Ben did not stop until he had gone to town on all twelve toes.<br>\r\n<br>\r\n\"Well...\" said Phineas after a while. \"I think that we have more than proved that the ray worked.\" However..\" that doesn't mean that we should stop!\" \"What if I...\"<br>\r\n</span></div></div>",
            "created":1595913600,
            "id":2876702,
            "title":"Taste my bare feet?"
        },
        "112":{
            "author_id":"socker",
            "author_name":"Socker",
            "choices":[
                "Ben lies and says yes, the gun cured his phobia",
                "Ben tells the truth that he is still afraid of feet ",
                "Ben says he still doesn't know if it worked or not"
            ],
            "content":"<div class=\"\"><div> <span>\"Umm... I-I don't know,\" said Ben apprehensively.<br>\r\n<br>\r\n\"Give it a try,\" encouraged Phineas, \"and let's see if it worked! I gave you a shot with the ray gun, and now it's your turn to give it a shot!\"<br>\r\n<br>\r\nPhineas laid back, propped up on his elbows. His feet, still in his shoes, now rested at the foot of Ben's bed. Ben was shocked, grossed out, and a little mad at Phineas for putting his dirty shoes on his bed. He wanted to object, but at the same time, he didn't want to lose his new friend. <br>\r\n<br>\r\nReluctantly, Ben sat next to Phineas's shoes at the edge of his bed. He could see little scuff marks on his sheets already. He wanted to get those shoes off his bed sooner rather than later, or else risk further soiling his sheets. With trepidation, Ben tugged on one of Phineas's blue, high-topped shoes. They wouldn't budge. Ben couldn't believe he just touched another boy's dirty shoe. Gross! Steeling himself, Ben resolved to quickly loosen the laces and just yank both shoes off. He dropped the shoes on the floor, and at least now, they weren't on his bed. For a second, Ben was slightly relieved that at least he got that over with.<br>\r\n<br>\r\nIt was far from over. As soon as Ben fearfully flung off Phineas's filthy shoes, his nose was assaulted with the smell of Phineas's feet. Ben's head reeled back, partly from dread, and partly from the sheer scent. He tried holding his breath discreetly, but could only last for a couple of seconds before needing to breathe again. Although Ben tried to keep his face far away from the feet, he could still smell distinctly since he was sitting right next to them. Phineas's feet had the strong, sweaty scent of boy feet. His shoes and socks had absorbed all the foot sweat that Phineas developed while building the ray gun on that hot summer day. All that sweat and heat allowed his feet to marinate like a barbecue at a backyard beach. <br>\r\n<br>\r\nAlthough Ben had no choice but to involuntarily breathe in the scent from Phineas's feet, he still avoided looking at the feet once the shoes were off. Ben hated everything about feet; even the mere sight of them was enough to send shivers down his spine. However, Ben figured he couldn't avert his gaze the whole time Phineas was there. He had to try looking at his feet eventually, and he figured now was as good as any time. Ben recoiled at what he saw. Phineas's socks were white, but they were darkened and slightly dirty with the sweaty imprint of his soles. He could make out the outline of Phineas's toes, arch, and heel where they made their sodden impression on the bottom of Phineas's socks. Ben imagined all the bacteria that must be having a field day, and he felt sick at the thought. Ben had to look away from the feet once again, so he looked up to Phineas.<br>\r\n<br>\r\n\"Thanks for taking my shoes off,\" said Phineas with a smile and a sigh. \"Now how about that foot massage?\"<br>\r\n<br>\r\nAs if smelling and seeing those feet weren't enough! Now Ben had to <i>touch</i> them? Well, at least he wouldn't have to <i>actually</i> touch Phineas's feet. The socks would provide a barrier, albeit a thin one. Whatever relief that thought may have given to Ben proved to be short-lived. Feeling Phineas's socked feet was probably <i>worse</i> than touching his bare feet could ever be. His socks were soaked in sweat and radiated a humid heat that Ben could feel even without actually touching them. Phineas's feet were obviously warm, but it was Ben who had cold feet. The vile sensation of the damp sock fibers on Ben's palms and fingers, coupled with the musty odor from Phineas's feet, was absolutely repulsive to Ben. He tried massaging more lightly, then with more pressure — any variation at all that might give some relief to Ben (it was certainly relieving for Phineas and his tired feet). Ben found that changing up his foot rubbing techniques didn't help at all; every contact his hands made with the feet made him want to gag. Part of Ben wanted to just run out of his own bedroom and leave Phineas there. He was thinking about getting up to leave, but then he heard his friend speak.<br>\r\n<br>\r\n\"So,\" said Phineas optimistically, \"do you think the ray gun worked?\"<br>\r\n</span></div></div>",
            "created":1466058660,
            "id":2165007,
            "title":"Afraid of Phineas's Feet"
        },
        "1122":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Phineas knows, and lied to Ben about what the ray gun really does. ",
                "Phineas suggests removing the socks, and smelling his bare feet",
                "Phineas calls Ferb over, to try his feet instead. "
            ],
            "content":"<div class=\"\"><div> <span>Ben groaned under the smell and feel of the socked feet currently in his hands. He couldn't understand how the boy's feet just seemed to fill the room with the musky scent. Of course, it was a summer day and Phineas had been outside all day. But to Ben, it was as if Phineas's socks could be used as some sort of toxic warfare weapon. As a result, Ben's fingers just seemed to get soaked from the sweat as he rubbed the boy's feet. And plans had already been made to wash his hands as much as he could until the smell left his fingers. <br>\r\n<br>\r\n\"No..no, it didn't work Phineas! Your feet...god, I can't do this. I'm sorry Phinease, but your feet reek! They smell and feel absolutely disgusting!\" Ben exclaimed, probably a bit harsher than he really meant to. <br>\r\n<br>\r\nEven as he said all this, and even as much as he wanted just to let go of those feet, he didn't. He continued to try and massage the boy's feet. Phineas remained quiet for a few seconds, and Ben was a bit nervous to look up at the boy sitting on his bed. As a result, Ben's eyes was locked on the foot he was massaging. Those toes wiggled at the boy, seemingly a bit playfully. As a result, Ben looked up to Phineas, just to avoid watching those toes. <br>\r\n<br>\r\nA bit surprisingly, Phineas had a soft smile on his face, even after Ben's words.Phineas pushed that foot a bit into the hands working them, and replied...</span></div></div>",
            "created":1562787540,
            "id":2684939,
            "title":"Ben tells the truth that he is still afraid of ..."
        },
        "13":{
            "author_id":"christyadot",
            "author_name":"P O S T  B O Y",
            "choices":[
                "Take those shoes and socks off,and rub them.",
                "She uses her barefeet to further tease and rub you."
            ],
            "content":"<div class=\"\"><div> <span> It was another summer day at the tri state area. And you are a local kid who came to see the fletcher kids make their amazing inventions. <br>\r\n<br>\r\nBut unfortunately, the boys and their parents left the area for few days and thus leaving their house almost vacant. You'll about return home dejected, until their sister came in your direction,and she was..more than a little annoyed.<br>\r\n<br>\r\n\"What doing in my yard,you little..\"the very tall girl grumble,but you almost gawked at those very big white shoes she is wearing. <br>\r\n<br>\r\n\"Oh, this is rich.\" the girl snickered cheekily,and bringing you back to reality. \"Hey twerp,sit on that hammock with me\"<br>\r\n<br>\r\n\"Y-yes ma'am!\" you suddenly stutter,and you do what you're told to do.You sat on one end,while she sat on the other end. She then..put both of her huge feet on your belly. Which they were bigger than your torso, and she slowly but very gently rub the solesof her shoes against your belly and chest.<br>\r\n<br>\r\n\"You like it you cute little twerp\" Ms.pencil-neck cooed, and your blush pretty much tells her your answer.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1522280400,
            "id":2471458,
            "title":"Ms.Pencil-neck"
        },
        "15":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Isabella",
                "Buford",
                "Baljeet",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these</span></div></span></div>",
            "created":1283800860,
            "id":951313,
            "title":"other"
        },
        "152":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Do what he saids and Smell his feet",
                "Do what he saids and Lick his feet",
                "Refuse"
            ],
            "content":"<div class=\"\"><div> <span>It was a hot summer day and Buford was once again was bulling this time on a kid who owe money to him but didn't pay him<br>\r\n<br>\r\n\"P-please Buford i said i would pay you next week\" the kid said cowering in a corner as Buford was cracking his knuckles<br>\r\n<br>\r\n\"You know what kid since i don't feel like getting your blood on my knuckles (he was making a joke he wasn't going to beat him up that hard) You will do something for me...\" before the kid could answer buford punched him <br>\r\n<br>\r\n<br>\r\nWhen the kid woke up he was tied up as Buford walked in<br>\r\n<br>\r\nThe kid whimpered as buford started to take off his shoes then pull them off reveal sweaty damp socked feet \"You will worship my feet\" the kid eyes widen \"and maybe i will forget about the money you owe me\" The kid still whimpered he knew buford never took off his shoes before and he plays lots of sports plus chasing kids all day he knew his feet were smelly as Buford stuck a socked foot in his face</span></div></div>",
            "created":1372808580,
            "id":1621560,
            "title":"Buford"
        },
        "154":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Carl</span></div></span></div>",
            "created":1298228700,
            "id":1057516,
            "title":"Other"
        },
        "1542":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Yes!",
                "Yes, but as Perrys POV",
                "No!! To old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the evil Dr. Doofenshmirtz? </span></div></span></div>",
            "created":1364861640,
            "id":1562643,
            "title":"Dr. Doofenshmirtz?"
        },
        "15423":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok what about Agent P himself?</span></div></span></div>",
            "created":1372808700,
            "id":1621561,
            "title":"No!! To old"
        },
        "154232":{
            "author_id":"joshua19988",
            "author_name":"Joshua19988",
            "choices":[
                "Get help from ferb ",
                "Stay as a foot pet"
            ],
            "content":"<div class=\"\"><div> <span>Your a new kid how has came to to meet Phineas and Ferb your name is chat you came to meet Phineas and Ferb you see phineas but not ferb. You talk to Phineas and ask where Ferb Phineas says his sick. You must be the new kid come and sit next to me hey Phineas and some other kid come her what Stacy candace Isn't well so you ant building nothink what can we do then. I now what you can do what it will be good for not so much for you. I don't care ok no turning back ok. Stacy takes off her shoes and socks her<br>\r\n<br>\r\nPhineas: what is this<br>\r\n<br>\r\nStacy: it's your fun<br>\r\n<br>\r\nChat: it's just feet <br>\r\n<br>\r\nStacy: well get to worshiping <br>\r\n<br>\r\nPhineas: I am not doing that<br>\r\n<br>\r\nStacy: then do nothing<br>\r\n<br>\r\nPhineas: give me the foot <br>\r\n<br>\r\nStacy gives her foot to Phineas and gives the other one to Chat they start by massage her foot nice and slow but Stacy said stop massage and start licking we started to lick her for a nice long time then they started to suck on her toes but then Candace came down stirs fills a lot better she sees Chat and Phineas Candace said make me strink ray Phineas made a strink ray and gave it to Candace and zap Phineas and ferb and Stacy woke up Candace said have this foot slave Candace put Phineas in her sock put it on and went to bed and Stacy put Chat in her sock and put her shoes on and went and every night Chat was trap in her smelly socks</span></div></div>",
            "created":1409336040,
            "id":1848972,
            "title":"How about Stacy"
        }
    },
    "info":{
        "author_id":"packman4life",
        "author_name":"The13thMember",
        "brief_description":"You having fun with feet of charatcers from Phineas and Ferb.",
        "created":1283799240,
        "description":"<td align=\"left\" class=\"norm\">Just you, or another character from the series, having fun with the feet of Phineas and Ferb characters. There is no shrinking or transformation allowed. Smelly feet is a plus but not necessary. Sex is allowed, but don't go out of control with it. And you don't have to willingly have fun with the characters feet, master/slave is allowed. </td>",
        "id":1705679,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595913600,
        "modified":1595913600,
        "pretty_title":"Phineas and Ferb feet"
    }
}