{
    "chapters":{
        "1":{
            "author_id":"ashl3yfox",
            "author_name":"AshleyTheFox",
            "choices":[
                "with ashley(aboard captured covenant ccs battle cruiser `Glorious Transendence')",
                "dark and stormy night(cliche)",
                "hotel room(with parents,kids have seperated)",
                "street fight(with sisters)",
                "secret service(with brother)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>please select your setting!and write a story!oh and for all storys Ashley is considered dead until the moment of your chosing.</span></div></span></div>",
            "created":1380348600,
            "id":1671042,
            "title":"THE BEGINING!"
        },
        "14":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Our heroes are competing in a sumo wrestling tournament.",
                "The mafia's goons are being yelled at by their own boss.",
                "Our story's protagonist is at the site of the sumo wrestling tournament.",
                "Other.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span>The Place: Metro City U.S.A.<br>\r\n<br>\r\nThe Time: Present Day.<br>\r\n<br>\r\nThe Story: One supposedly fateful day in Metro City U.S.A. our protagonist Ashley confronted a group of mafia goons who were currently harassing some shopkeepers as she had to do something as she arrived on the scene.<br>\r\n<br>\r\n\"Hold it right there! Now see here you big bullies either you can leave these innocent shopkeepers alone or else it's gonna get real ugly real fast!\" Our protagonist shouted as she got the mafia goons attention as the shopkeepers themselves felt quite relieved that someone had come to their rescue as they were now worried about the story's protagonist as they knew she wouldn't be able to beat those goons themselves.<br>\r\n<br>\r\n\"Listen here little Missy there ain't no way that you're gonna be able to beat us ergo move along and go play with your dollies or whatever.\" The lead mafia goon said.<br>\r\n<br>\r\n\"Yeah go on now go play and move along for we're gonna shake down these shopkeepers and no one's gonna stop us including you.\" The second mafia goon said.<br>\r\n<br>\r\n\"Hear hear after all what makes you think you can stop us as we're bigger than you and stronger than you for after all if you try to stop us we'll flatten you like a pancake ergo get lost toots.\" The third mafia goon said.<br>\r\n<br>\r\n\"I agree ergo you can either leave or else you'll be sorry.\" The fourth mafia goon said.<br>\r\n<br>\r\n\"Little Missy?! Now listen here you greasy Italian American meatballs I ain't gonna leave here and by the way I don't play with dollies or whatever for I'm a martial artist who happens to have a black belt in karate as I also lift weights ergo these shopkeepers ain't gonna be shaken down by the likes of you guys as I'll also have you know I've taken on big guys like you as I've also clobbered them and made mincemeat out of them ergo you guys asked for it as it's go time!\" Our protagonist said as she was getting ready to clobber her opponents.<br>\r\n<br>\r\n\"Greasy Italian American meatballs?! Greasy Italian American meatballs?! Alright that does it ergo let's get her boys!!\" The lead mafia goon barked as he and his fellow goons stepped forward as they were about to clobber our protagonist until four heroic male sumo wrestlers arrived on the scene as they happened to be on our protagonist's side.<br>\r\n<br>\r\n\"Who are you guys and I can assume you must be the cavalry or something?\" Our protagonist asked the four anthropomorphic male animal sumo wrestlers.<br>\r\n<br>\r\n\"Allow us to introduce ourselves my name is Doug Dalmatian as I'm the team's leader.\" Doug Dalmatian said as he introduced himself.<br>\r\n<br>\r\n\"My name's Ace Dalmatian as I'm the team's second in command and Doug's loving nephew.\" Ace Dalmatian said as he introduced himself.<br>\r\n<br>\r\n\"Have no fear ma'am for yours truly Shorty the basset is here to save the day!\" Shorty the basset hound said as he introduced himself.<br>\r\n<br>\r\n\"Allow me to introduce myself for my name is Wilfred the rat for after all I may be a sumo wrestler but I do have a big heart.\" Wilfred said as he introduced himself.<br>\r\n<br>\r\n\"And together we're known as.....The Mega Stars!\" All four sumo wrestlers said in unison as they stared down their enemies as both member's sides then charged right at each other as an all out battle between the forces of good and evil was under way as our four heroic animal sumo wrestlers and the story's protagonist with their strengths combined sent the mafia's goons running away in terror with their tails between their legs as our heroes proudly gave each other high fives.<br>\r\n<br>\r\n\"Well now that we've taken care of those goons we may as well be on our way.\" Doug Dalmatian said as he his nephew and their allies started to walk off towards their destination.<br>\r\n<br>\r\nMeanwhile.....<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1602616080,
            "id":2920651,
            "title":"Street Fight(With or without my sisters)"
        }
    },
    "info":{
        "author_id":"ashl3yfox",
        "author_name":"AshleyTheFox",
        "brief_description":"this story continues the sonic x story with a touch of everything.......",
        "created":1380348180,
        "description":"<td align=\"left\" class=\"norm\">anyone can add to this story.rules are as follow: 1.must include main protagonist in some of your chapters.  2.no descriptive sex scenes please. 3.must have more than 3 sentences. 4.must have good grammer. 5.you must tll me before you add. 6.oc's welcome. 7.no fucking testimate of god shit in here. 8.trekie fans welcome. 9.have fun. 10.if you wanna put deadpool into your story go ahead,but put a shit just got weird sighn up first. 11.killing is allowed. 12 .you are free to have your story include vehicles or weapons from games,shows,and movies. 13.fan created skylanders welcome. 14.anything can happen.         list of characters that I am putting in.    protagonist:Ashley Tremortin. related famly:Eon(father)Violet(mother)Jynx(sister)Katie(sister)Lilith(sister)David(big brother).friends:Krystal.    other characters:sonic,tails,blaze,silver,knuckles,amy,rouge,tikal,shadow,eggman,vanilla,cream,the babolyn rouges,honey the cat(will have Texan accent),vector,espio,charmy,metal sonic,sally acon(not a princes in this story),and any other sonic character I have missed. Factions that will be included:U.N.S.C.,the covenant,forerunners,G.U.N.,the eggman empire,Starfleet,C.O.G.,Umbrella,and anything else you can think of!  ashleys powers(after infection):active regeneration,ability to mutate body parts for combat efficiency,can run In bursts of 250 mph,is a weapons expert,has an organic energy shield,master of a vast amount of martial arts,can leap 89 ft in the air,perfers 2 type 25 plasma rifles to close combat,has the ability to copy others appearance for a short time,is a brilliant stratigest,is calm and collected in battle,has eight forms for combat,can lift 300 times her size,powers are due to an infection she has,can utilize her natural born ability shadow phase to teleport or possess people.personality:doesnt exactly know a lot about civilian life and is often gender confused,i one of ONI's secret Spartan 2's,is not that femine,constantly keeps her A.I. mellisa with her,often aggressive,is very unsocial.you get the point..........STORY TIME!</td>",
        "id":1955036,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602616080,
        "modified":1602616080,
        "pretty_title":"Sonic Multiverse:darkness rising"
    }
}