{
    "chapters":{
        "1":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Mayuri",
                "Assistant (Kurisu)",
                "Moeka",
                "Faris",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of the Lab Members will get inflated, first?</span></div></span></div>",
            "created":1591592400,
            "id":2848140,
            "title":"Decisions, Decisions"
        },
        "11":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Water",
                "Weight",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lab Member 002, Shiina Mayuri is the childhood friend of Okabe. Practically the mascot of the lab, she's kinda ditzy, but completely innocent and kind. Now, what will make her puff up?</span></div></span></div>",
            "created":1591636800,
            "id":2848151,
            "title":"Mayuri"
        },
        "114":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "To be able to make Okarin happy.",
                "To have a body Okarin would like.",
                "To have Okarin notice her."
            ],
            "content":"<div class=\"\"><div> <span>Mayuri was relaxing on the sidewalk in front of her house on a cool, fall day. Well, night. It probably wasn't the best place to do this, but it's probably just fine. She loved to do this. Lay down, and look at the stars. Her house was a little bit away from all the lights and sounds of the inner city, so she could see the stars decently well. She reached up. She felt like, if she really wanted, she could just pluck one of the stars out of the sky, and hold it in her hand. But still, she probably would never be able to do that. Just like her Hikoboshi... Her mind floated to Okabe. It might have just been her imagination, but it seemed like Okarin had been getting more and more distant. He seemed more interested in Kurisu than Mayushii, ever since that summer. If only she could get Okabe to see her, not just as an old friend, but-<br>\r\n<br>\r\nMayuri: \"Mm...?<br>\r\n<br>\r\nShe was snapped out of her thoughts as she saw a shooting star. She could actually make her wish come true! She quickly, without even having time to think first, wished...</span></div></div>",
            "created":1595638440,
            "id":2874433,
            "title":"Stardust Handshake"
        },
        "12":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Weight",
                "Water",
                "Magic"
            ],
            "content":"<div class=\"\"><div> <span>Lab Member 004, Makise Kurisu (Aka Christina, Assistant, Celeb Sev, the Zombie, and @Channeler Chris) is a brilliant neuroscientist. Practically the definition of a Tsundere, she is the (Generally very angry) brain of Future Gadget Labs. Now, what will make her puff up?</span></div></div>",
            "created":1592017680,
            "id":2850436,
            "title":"Assistant (Kurisu)"
        },
        "124":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Change herself some more",
                "Switch pictures",
                "Think about what to do (leaving the computer open)"
            ],
            "content":"<div class=\"\"><div> <span>Kurisu: Ugh... Why is this class even required...? It's a Physics degree, not a design class!<br>\r\n<br>\r\nKurisu huffed as she plopped down in front of Daru's computer in the development room. She closed out the erotic game he had left open, and checked for a photomanipulation software. Why did she need one of those? Because she needed to take at least one \"arts\" class for her physics degree, which she had been working towards online while in Japan. Since it was the only one that interested her, she chose the photography class. One unit of that class, was how to edit pictures and touch them up. She didn't feel like paying 6,000 yen for one, so she might as well see if Daru had one... And a few minutes later, she found it. It was called \"Magic Touch 2D\". Knowing Daru, he probably used it to make pictures of girls more lewd. She shook the image out of her head, and opened it up. Her current assignment was to change her hair color in a picture. It was just due before her next class in a few days, so there was no rush, but she also didn't have anything to do, so she might as well just go ahead and do it. She had already sent a semi-recent picture of herself to the computer, so as the program opened, she went ahead and uploaded it. As she did, she felt as slight shiver run down her spine, but she chalked that up to the options the software had. Along with the normal options for photomanipulation, the program also had \"Select region\", \"Size up\", and \"Size down\". Seriously, what kind of program was this...? Either way, it would at least work for now. She quickly got to work splitting the picture into multiple layers, and got only her hair highlighted on the picture. She picked a light ash blonde, and colored over her normal red-brown mix. Once she had it a good color (even though the class was a throwaway class, she still had some integrity), she pressed save. As she did, she suddenly felt reality flicker around her, as a wave of nausea hit her. Her senses were filled with a static-like sensation. The world seemed to spin for a second. She felt like she was being wrung out like a wet towel. Then, just as quickly as it started, it was over. She slowly opened her eyes, out of breath. She looked around. Everything was the same. What had just happened...? She hadn't been at the computer that long... She'd spent longer browsing @channel, she shouldn't have had such a strange feeling when she got up. Either way, something was wrong. She stood up, brushing a lock of her blonde- Wait, blonde? She raced into the bathroom, and looked in the mirror. Her hair as perfectly ash blonde. She blinked a few times, the gears in her head turning. It was obvious her change to her picture had changed her actual, real hair color, but how? She moved back to the development room, and began searching for an explanation. Pretty quickly, she found it. The computer was hooked up to the PhoneWave (name subject to change). Somehow, the program must have sent a signal to the PhoneWave, sending some sort of message to the past, somehow changing it to match the changes on Magic Touch 2D. Kurisu quickly confirmed her theory by painting her hair over with her normal color, and submitting the changes. She braced herself as she pressed enter. She was still almost overwhelmed by motion, but managed to recover much faster than before. She checked her hair. Her normal chestnut with a reddish tint. She released a breath she didn't reailize she had been holding. She was back to normal. Now... What to do with this new program...?</span></div></div>",
            "created":1596956220,
            "id":2882724,
            "title":"Magic"
        },
        "13":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Weight",
                "Water",
                "Magic"
            ],
            "content":"<div class=\"\"><div> <span>Lab Member 005, Kiryu Moeka (AKA Shining Finger), is known for her amazing ability to type at blazing speeds. But, despite the bouny personality you might assume she has based on her texts, she actually has a very quiet and timid personality. Now, what will make her puff up?</span></div></div>",
            "created":1592018460,
            "id":2850441,
            "title":"Moeka"
        },
        "14":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Weight",
                "Water",
                "Magic"
            ],
            "content":"<div class=\"\"><div> <span>Lab Member 007, Faris NyanNyan (actual name Akiha Rumiho), has a wild, vivid imagination. She can create entire stories and histories in her head, which she immediately projects onto other people. Oh, and she also owns a cat maid cafe, called MayQueen Nyan<sup>2</sup>. She's constantly in her maid persona, speaking in Nyanian. What will make her puff up?</span></div></div>",
            "created":1592018700,
            "id":2850442,
            "title":"Faris"
        },
        "144":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Blue Space",
                "Green Space",
                "Red Space"
            ],
            "content":"<div class=\"\"><div> <span>Mayuri was sitting in the lab, as per usual. It was nearing the end of summer vacation, and the day was sweltering hot. She was currently helping Luka with her summer work, while Kurisu was helping both of them. Well, Mayuri wasn't helping as much, but she was still giving plenty of moral support. Either way, they were just starting to get a bit worn out, when the door clicked open, and a familiar, cat-eared girl walked in.<br>\r\n<br>\r\nMayuri: Feris-chan! Tutturu!<br>\r\n<br>\r\nFaris: Heya, Nya!<br>\r\n<br>\r\nLuka: Ah, Faris-san... Hello.<br>\r\n<br>\r\nFaris: Huh? Hold on a second...<br>\r\n<br>\r\nShe pretended to sniff the air.<br>\r\n<br>\r\nFaris: I smell work! A lot of it, too, nya! It's the summyer. You shouldn't be working in the summyer!<br>\r\n<br>\r\nLuka: But school starts in a week... We have to do it by then, and there's a lot of it...<br>\r\n<br>\r\nFaris: Well, we can all at least take some time off, because...<br>\r\n<br>\r\nShe dramatically pulled a box out of hammerspace. Nobody saw her holding it before, but it just suddenly appeared.<br>\r\n<br>\r\nFaris: I found this at a shop on the way here, nya! The myan at the counter seemed really happy to be rid of it...<br>\r\n<br>\r\nKurisu: Doesn't that seem a bit odd to you? It's probably not too high of quality... How much did it cost?<br>\r\n<br>\r\nFaris: It was free! He said he could predict that there would be people to cheer up in my future, so I should have it, nya!<br>\r\n<br>\r\nKurisu: Hm...<br>\r\n<br>\r\nBut despite her scowl, it seemed her worries were satiated for now.<br>\r\n<br>\r\nFaris: Anyway, we should play!<br>\r\n<br>\r\nShe smacked the box down on the one table in the room. Finally, the group could see the front of the box a little better. Most parts were worn off. Pretty much the only legible part was where it said \"transform your boredom!\". Huh, a bit of a strange tagline, but whatever. She plopped open the box, and pulled out the instructions... which were just as mangled and worn as the box. It had to be handed over to Kurisu for interpretation, and even she couldn't understand most of it.<br>\r\n<br>\r\nKurisu: Ok... It seems like we'll all pick a piece to represent us. We start at the start square of the board, and roll dice to progress. Whatever color space we land decides what color card we draw. Um... And then we... Do whatever it says...? Are you sure this is an ok game to play, Faris-chan?<br>\r\n<br>\r\nFaris: It'll be fine! <br>\r\n<br>\r\nKurisu: Ok. It seems like the red ones will be something the person who draws it will have to do, while the blue ones will be something other people have to do. Green, meanwhile, is something that everyone has to do.<br>\r\n<br>\r\nLuka: U-Um... What kind of stuff is it...?<br>\r\n<br>\r\nKurisu: I don't know. The instructions are completely destroyed.<br>\r\n<br>\r\nFaris: Then, in that case, we should just learn by doing! I'll go first. Hm... I'll be... This one, nya!<br>\r\n<br>\r\nShe pulled out a pink piece, that once again didn't seem to exist before she needed it to. Then, everyone else also picked out a piece. Kurisu chose a red piece, Mayuri got the blue one, and Luka got the purple one.<br>\r\n<br>\r\nFaris: All right, now time to roll!<br>\r\n<br>\r\nThe dice somehow just appeared in her hands as she tossed them onto the board. A four.<br>\r\n<br>\r\nFaris: That'll put me here, on a...</span></div></div>",
            "created":1592195880,
            "id":2851391,
            "title":"The Magic Board Game"
        },
        "1442":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Red Space",
                "Blue Space",
                "Green Space"
            ],
            "content":"<div class=\"\"><div> <span>Faris: That'll put me here, on a green space, nya!<br>\r\n<br>\r\nFaris took the top card off the red deck.<br>\r\n<br>\r\nFaris: Hm... Everyone pick a nyumber between 1 and 100, nya!<br>\r\n<br>\r\nKurisu: Pick a number...? What kind of game even is this?<br>\r\n<br>\r\nFaris: Who knows, just do it!<br>\r\n<br>\r\nMayuri: Mayushii picks... 71.<br>\r\n<br>\r\nLuka: U-Um... I'll go with... 17.<br>\r\n<br>\r\nKurisu: I'll take 42. <br>\r\n<br>\r\nFaris: And I'll do 33! Ok, so it says to flip it over once we're... nya...!?<br>\r\n<br>\r\nThe others seemed to also voice their shock, as 4 thick, black tubes dropped down from the ceiling, and immediately plugged themselves into the four girls' mouths. Then, it began to pump a strange, tasteless fluid into their mouths. As Faris processed what in the world was happening, she noticed that all of them began to get slightly plumper all over. Right as se bgan to realize what was happening, Luka was released. She had only gained a little bit, still keeping most of her elegant, stick-like figure, just with a bit of pudge, mostly centered around her waist and thighs. Next, Faris was released. She had gotten much bigger than Luka, now gaining a rounder tummy along with a slightly larger chest. Nearly instantly after Faris, Kurisu was released. Her weight had been spread the most evenly around her body out of the three so far. Her newly-widened torso pushed her lab coat to the side, as she had a much rounder waist. Then, there was Mayuri, who kept getting pumped up.<br>\r\n<br>\r\nLuka: M-Mayuri-san...!<br>\r\n<br>\r\nMayuri: Mmph! Mmmngh...<br>\r\n<br>\r\nKurisu: Here, help me try to pull it out!<br>\r\n<br>\r\nFaris: Yeah!<br>\r\n<br>\r\nAs Faris and Kurisu pulled and pulled, it finally came out almost a minute later, as Mayuri leaned back, groaning. Her fat had mostly grown out around her belly and bust, jumping her up almost a full cup, and leaving her with a huge stomach. Her dress seemed a little small...<br>\r\n<br>\r\nKurisu: What...in the world... was that...?<br>\r\n<br>\r\nLuka: I-I... Wha... U-Um...<br>\r\n<br>\r\nMayuri: Mm... Mayushii's softer now...<br>\r\n<br>\r\nFaris: Nya... That was byizzare...<br>\r\n<br>\r\nKurisu: Um... call it a theory... but I think those numbers had something to do with it.<br>\r\n<br>\r\nMayuri: Huh...?<br>\r\n<br>\r\nKurisu: Think about it. Luka picked the smallest number, and she gained the least. Mayuri gained the most, and she picked the biggest number by far. Meanwhile, Faris and I picked numbers in the middle, and gained a medium amount. I-I mena, I'm still nowhere near fine with this! But I think that may be what happened...<br>\r\n<br>\r\nFaris: Hm... that makes sense, nya. <br>\r\n<br>\r\nKurisu: Geez... we need to stop playing this, before we get even more messed up. This entire game is probably about changing our bodies in some way.<br>\r\n<br>\r\nLuka: R-Really...?!<br>\r\n<br>\r\nFaris: \"Transform your boredom...\"<br>\r\n<br>\r\nKurisu: Exactly.<br>\r\n<br>\r\nMayuri: Um... Mayushii doesn't think we should stop. Look...<br>\r\n<br>\r\nMayuri was holding the instructions. She was pointing to a part of it that had just become legible. It said \"any changes made during the game are temporary, unless a player willingly stops playing\".<br>\r\n<br>\r\nKurisu: So we're trapped...!?<br>\r\n<br>\r\nFaris: Enyough panic, nya! We just need to keep playing, right? Let's make it through! If it's temporary, relax! We'll be fine afterwards, nya!<br>\r\n<br>\r\nKurisu: I guess you're right...<br>\r\n<br>\r\nAnd so, Kurisu rolled a 5, picked up her red piece, and ended up on a...</span></div></div>",
            "created":1595225160,
            "id":2871844,
            "title":"Green Space"
        },
        "15":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Luka",
                "Suzuha",
                "Kagari",
                "Maho",
                "More?!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You need more potentially puffy lab members?</span></div></span></div>",
            "created":1592019420,
            "id":2850447,
            "title":"More choices"
        },
        "151":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Water",
                "Magic"
            ],
            "content":"<div class=\"\"><div> <span>Lab mem 006, Luka Urushabura, is a shy worker and Yanabayashi Shrine. Clumsy and easily flustered, she's a friend of Mayuri and has a slight crush on Okabe. Now, what will make her puff up?<br>\r\n<br>\r\nNote: We will be using Luka as a girl for this</span></div></div>",
            "created":1592019600,
            "id":2850450,
            "title":"Luka"
        },
        "1513":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Use on herself",
                "Use on Mayuri",
                "Wait until she gets to the lab to test it out"
            ],
            "content":"<div class=\"\"><div> <span>Luka walked out of school, finally done with the day. It was August, and school had just recently started. She stood just outside the doorway, feeling the heat of late summer wash over her. She didn't have to help out in the temple today, so she would probably head over to the Lab for now. But first, she had to wait for Mayuri. So, Luka walked out the front gates, and moved to the side, so she wouldn't be in the way of everyone. There, she waited. Her mind drifted, and she thought back to the last few months. The PhoneWave (name subject to change) had been crazy, but since they'd only managed to send numbers back in time (which didn't even win the lottery, with Luka messing up a number), they hadn't really done much. But then again, Okabe had been acting pretty weird. He had claimed things were different, like that Luka used to be a guy. Well, not like she even looked like a girl, with being flat as a board up top, but she definitely didn't look like a guy. <br>\r\n<br>\r\n<i>Clonk!</i><br>\r\n<br>\r\nLuka: Ow...!<br>\r\n<br>\r\nLuka grabbed her head as she felt something fall to the ground next to her. She checked it out. It looked like a small, dark scarlet, almost maroon, rock. It must've fallen and hit her on the head on it's way down.<br>\r\n<br>\r\nLuka: What in the world...?<br>\r\n<br>\r\nThen, a note fluttered down in front of her face. She fumbled for a second before catching it.<br>\r\n<br>\r\n<i>To who ever receives it, this is a Wishing Stone. If you think about something hard enough while holding this stone, it will become real. You can alter yourself and the world around you, and only you will know. Think carefully about your decisions.</i><br>\r\n<br>\r\nLuka looked up and all around her, trying to figure out where the stone came from. Eventually, she shrugged and fiddled with the rock in her hands, her mind moving to other things.<br>\r\n<br>\r\nLuka: Hm... I wish Mayuri wouldn't take so long... It's so hot out-<br>\r\n<br>\r\n??????: Luka-chan! Tutturu!<br>\r\n<br>\r\nLuka: Gah...!<br>\r\n<br>\r\nLuka almost fell over, before she recognized the voice as Mayuri.<br>\r\n<br>\r\nLuka: M-Mayuri...! Please don't scare me like that...<br>\r\n<br>\r\nMayuri: Sorry...<br>\r\n<br>\r\nLuka: It's fine. Let's go ahead and go.<br>\r\n<br>\r\nMayuri: Ok!<br>\r\n<br>\r\nMayuri bounced ahead, as Luka followed along behind her. As they walked, she thought about what had just happened. She had thought about Mayuri arriving, and she had arrived. It's almost like the stone was real... Well, this is where she would earn her Lab mem title. It's time to experiment.</span></div></div>",
            "created":1592187960,
            "id":2851371,
            "title":"The Magic Stone"
        },
        "15131":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Bigger!",
                "Share the stone...?",
                "Wait for a bit longer to use it again"
            ],
            "content":"<div class=\"\"><div> <span>As the two girls walked along, Luka was completely absorbed with what she should use to test the stone. Of course, Mayuri was skipping a little in front of them. This caused her rather large chest to bounce around in front of her, almost taunting Luka. She had always wanted to be a bit bigger up front... She was a bit sick of having people almost mistake her as a dude from far away. Even up close, nobody really seemed to be able to tell. But, if she was a little bigger, that wouldn't be a problem anymore... So, with that slight thought floating across her head, she made up her mind. Steeling herself, she made her wish.<br>\r\n<br>\r\nLuka: <i>I wish my chest was as large as Mayuri's.</i><br>\r\n<br>\r\nSuddenly, she felt the world spin around her. She got dizzy, and stumbled for a second. Mayuri paused ahead of her, and looked back, confused. When the dizziness finally faded, Luka slowly lifted her head, her eyes still shut, prepping for another wave, that never came. But still, something felt off... She felt... heavier. Realization dawned on her as she slowly opened her eyes. Sitting there on her otherwise perfectly thin frame, were two large orbs. Boobs. She had boobs. They were fairly large, matching Mayuri, but looking ridiculous on Luka's smaller frame.<br>\r\n<br>\r\nMayuri: \"Luka-chan? What's wrong...?\"<br>\r\n<br>\r\nLuka: \"Wha...\"<br>\r\n<br>\r\nThen, the words on the note stuck out in her mind:<br>\r\n<br>\r\n<i>You can altar the world and yourself, and only you will know.</i><br>\r\n<br>\r\nThis must be what it meant. She had changed her bust massively, but Mayuri was clueless. Not that that said much, but Luka knew that even the oblivious Mayuri notices more than people realize. Surely she would notice a change this massive... if she could.<br>\r\n<br>\r\nLuka: \"I-I'm... fine.\"<br>\r\n<br>\r\nMayuri: \"Hm... Mayushii thinks that's a lie... Oh, you're probably dehydrated! We need to get you to the lab, quickly!\"<br>\r\n<br>\r\nWith that, Mayuri dashed off, and Luka followed her hesitantly. pulling out her phone as she did so. Looking back at past pictures, it looked like she had grown to be this size over the last year, mostly exploding in the last month or two. It had gone so smoothly, making herself bigger. And she felt more powerful like this, too... but what else should she do? She should probably be careful with it...</span></div></div>",
            "created":1595130960,
            "id":2871400,
            "title":"Use on herself"
        },
        "152":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Water",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will make her puff up?</span></div></span></div>",
            "created":1592019600,
            "id":2850451,
            "title":"Suzuha"
        },
        "153":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Water",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will make her puff up?</span></div></span></div>",
            "created":1592019600,
            "id":2850452,
            "title":"Kagari"
        },
        "154":{
            "author_id":"bobjoe98765432",
            "author_name":"Bobjoe",
            "choices":[
                "Air",
                "Water",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will make her puff up?</span></div></span></div>",
            "created":1592019660,
            "id":2850453,
            "title":"Maho"
        }
    },
    "info":{
        "author_id":"bobjoe98765432",
        "author_name":"Bobjoe",
        "brief_description":"Testing out this whole inflation interactive thing on the girls of Steins Gate",
        "created":1591634880,
        "description":"<td align=\"left\" class=\"norm\">Welcome, <span style=\"text-decoration:line-through\">Okabe Rintaro</span> Huouin Kyoma, to a world where SERN never attacks. Somehow, in August, you accidentally set the world on a path where Mayuri doesn't die, Kurisu doesn't die... and also nothing is canon. Prepare for inflation escapades!<br>\r\n<br>\r\nRules:<br>\r\n- Preferably no male inflation (Luka will be female, since Okabe didn't need to change him back)<br>\r\n- You can cross other characters into one where it's maybe not supposed to be, but it has to be centered around that character<br>\r\n- Try to stick with the three b's of inflation (bust, belly, butt)<br>\r\n- If you end off a path and I think it's too early or not very satisfying, I will delete the ending chapter<br>\r\n- Have fun and mess around! Nothing here is supposed to be serious</td>",
        "id":2223850,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596956220,
        "modified":1596956220,
        "pretty_title":"Steins Gate Inflation Interactive"
    }
}