{
    "chapters":{
        "1":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Aladdin",
                "Kevin Ryman (Resident Evil)",
                "Drake (Uncharted)",
                "Henry (silent hill 4)",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You just choose someone here and dont be scared to make any contributes</span></div></span></div>",
            "created":1230181200,
            "id":681859,
            "title":"Choose"
        },
        "11":{
            "choices":[
                "Gladly do so",
                "Refuse"
            ],
            "content":"<div class=\"\"><div> <span>You are a genie trapped in a lamp, you were freed by a young arabian man by the name of Aladdin. He's gone through his other two wishes, and now he is on his last of 3. \"Your wish is my command, master.\" Aladdin sat down, the rugged, sexy young man he was, and placed his large feet on the table and thought. \"My feet ache from a long day of walking in the desert, my third wish, genie, is for you to worship my feet.\" </span></div></div>",
            "created":1238389200,
            "id":668968,
            "title":"Aladdin's Third Wish"
        },
        "112":{
            "choices":[
                "Give in and be Aladdin's footslave and give him his last wish",
                "Stay strong and see how long you last under his feet",
                "Negotiate and stay his footslave without giving him one more wish"
            ],
            "content":"<div class=\"\"><div> <span>\"No. I know im supposed to do whatever you please, but i absolutely refuse to be humiliated like that!\" you say.<br>\r\n\"really now?\" aladdin says, with a smirk on his face.<br>\r\nHe grabs you by the ponytail on your head and forces your face into his feet, paying close attention to where your nose is in relation to his toes.<br>\r\nYou try to escape but his strong, manly muscles hold you in place as you are forced to breathe in the rank foot odor emanating from between his toes.<br>\r\n\"What about now, huh? How does that smell, slave?\" He wiggles his toes all over your nose, making sure you take in all the stench.<br>\r\n\"Take a deep breath now. You want to be able to get the full effect from my sweaty, rancid feet if youre going to be near them all the time.\"<br>\r\nAladdin clamps your nose with his toes on one of his feet, forcing the cheesy scent into your nostrils and forces his toes on the other foot into your mouth, making you lick all the grime out from between them.<br>\r\n\"Now, you have 2 choices. 1, you can agree to be my footslave forever and still let me keep my third wish, or 2 I keep you in this position and see how long you last with these smelly dawgs. He wiggles his toes inside your mouth .</span></div></div>",
            "created":1247893200,
            "id":727042,
            "title":"Aladdin's rancid plot"
        },
        "1122":{
            "choices":[
                "You are chained in a dungeon, with Aladdin standing over you",
                "You are an inch tall"
            ],
            "content":"<div class=\"\"><div> <span>Through the sweaty and grimey toes, you tell Aladdin, \"no, i refuse to be subjected to such humiliation!\"<br>\r\nGiving an evil smirk, Aladdin says, \"alright, have it your way.\"<br>\r\nWith that, he adds more force to his foot, shoving his toes farther down your mouth, reaching your throat, where you begin to feel like youre being gagged. He also begins releasing the toes clamping your nose, but in the process moving them around so that your nose is constantly in between the rank dawgs. Toejam and sweat are soaked with Aladdin's manly foot odor and you are close to vomiting or passing out.<br>\r\n\"Wow, these smell way worse than i thought. And im all the way up here. I cant imagine how smelly and sweaty they are down there!\" He wiggles all his toes, causing those in your mouth to tickle the inside of your throat.<br>\r\nThe awful odor gets to you and you pass out. When you wake up...</span></div></div>",
            "created":1248066000,
            "id":728905,
            "title":"The longest 5 minutes with Aladdin's nasty toes"
        },
        "11221":{
            "choices":[
                "Duct tape your mouth and play with you with his nasty feet",
                "Shrink you down and have some more fun"
            ],
            "content":"<div class=\"\"><div> <span>When you awaken, you are chained in a dungeon with Aladdin looking down at you. You try to speak but he immediately covers your mouth with his shoe.<br>\r\n\"Listen, footbitch. Youre taking the orders from me now, so no talking. I had to drag you all across town to get you here so my feet are aching and probably smelling pretty cheesy by now.\"<br>\r\nWith that, he pried off his mocassins, exposing the most foul looking socks youve ever seen, and the room immediately filled with the musky and noxious odor of Aladdin's feet.<br>\r\n\"Oh, God, i feel bad for you. These things REEK!\" He took a little whiff of his sock and made a digusted face.<br>\r\n\"Oh well, here it comes!\" Aladdin pried off the sock with much effort, exposing a stinking and sweating foot.<br>\r\nHe stood over you, with one rank sock in hand and said, \"Here comes the stinkbomb! hope youre ready for some cheesy shit!\"<br>\r\nTime seemed to slow and Aladdin brought the sock to your face and held it over your nose forcefully, forcing you to breathe in all the noxious fumes emanating from the damp piece of cloth.<br>\r\nYou mumble and murmur under the rancid sock, trying to escape.<br>\r\nAladdin merely says, \"What? cant handle the smell?...Fine, i guess ill just have to use this some other way.\"<br>\r\nHe swiftly jams the rank sock into your open mouth and forcefully closes it. Surprised, you try to scream and spit out the salty and sweaty sock, but Aladdin immediately traps your mouth under his disgusting sole, again, with his toes right under your nose.<br>\r\nIf you thought his feet smelt bad before, this was nothing. The sweaty and cheesy scent was magnified 10X with the walk Aladdin took home, and he looked down at you and smiled.<br>\r\n\"Wow, they must smell really terrible if youre starting to tear. Well, whatever, i dont care how smelly or rancid these dawgs are, as long as youre sniffing them, bitch.\" He wiggles his toes all over you, causing toejam and grimy lint to be sent into your nostrils and mouth.<br>\r\n\"How else can i torture you?...\"</span></div></div>",
            "created":1248066000,
            "id":729027,
            "title":"Aladdin's footslave"
        },
        "112211":{
            "choices":[
                "Aladdin shrinks you down to an inch",
                "Aladdin decides he wants to use your slave talents on another part of his body"
            ],
            "content":"<div class=\"\"><div> <span>Aladdin pulled out a roll of what appears to be duct tape and grins mischievously.<br>\r\n\"Now, the real fun begins, bitch.\"<br>\r\nWith that, he removes his foot from your mouth, pries off his other rank sock, stuffs it in your mouth to join the other and duct tapes your mouth closed.<br>\r\nPleased with your condition, Aladdin pulls up a chair and sits down on top of you.<br>\r\n\"Ready to service your masters stinky feet?\" he says with a wiggle of his toes.<br>\r\nWith that, he brings his feet down upon your face, his toes right above your nose, covering your face completely in a thin sheet of sweat and grime.<br>\r\nYou instantly begin screaming, but no one can hear because of the tape on your mouth. Your eyes water at the awful smell, and Aladdin clamps your nose shut with his toes. He keeps playing a game of clamping your nose shut with his fingers until you cant breathe anymore and then puts the spot where his toes meet his sole under your nose when he lets go, forcing you to breathe in all his nasty fumes.<br>\r\nAfter a while, he begins rubbing your face with his soles, spreading all the nasty dirt and grime all over your face.<br>\r\n\"Wow, I never knew how fun it would be to have a foot slave!\" Aladdin says.<br>\r\nYou look up at your master, with just enough time to see him release a giant wad of spit onto your face. He rubs it in with his feet, making sure to get your nose specifically. <br>\r\n</span></div></div>",
            "created":1248670800,
            "id":733324,
            "title":"Now, the fun begins"
        },
        "1122111":{
            "choices":[
                "\"Take a long ride in my sweaty sock!!!!!!!!!\"",
                "\"Lick all the sweat from between my toes!!!!!!!!!\""
            ],
            "content":"<div class=\"\"><div> <span>Without noticing, Aladdin pulls out another lamp and wishes for you to be an inch tall.<br>\r\nHis mischievous grin widens and right before you shrink down, Aladdin pries off the duct tape and you spit out the socks.<br>\r\nYou shrink down instantly, realizing how magnified his foot stench is now that youre so much smaller.<br>\r\nYou look up to see Aladdin's giant left foot, sweat and all, come down upon you, pinning you to the ground and causing your nostrils to flare. Your head is between his two biggest toes and he angles his foot so that your face is forced into the space between them and your mouth and nose becomes filled with toejam and sweat. The stench is unbearable.<br>\r\nStill pinned under his foot, Aladdin sits down and spreads out his legs, causing you to be forced in between the two mammoth feet. He laughs erratically and says \"ARE YOU READY SLAVE FOR WHAT IS SURE TO BE THE SMELLIEST THING IN YOUR LIFE?\" Without waiting for a response, Aladdin slams his two feet together, trapping you in the spaces between his toes and his soles: a small enclosed space where the smell is by far the worst. Everything around you is dark and stinky and Aladdin wiggles his toes while you can hear muffled laughing.<br>\r\nThe smell is causing you to become delirious and you feel faint, finally passing out in between the two feet of the 100 ft god.<br>\r\nWhen you wake, youre laying with your back down looking up at Aladdin's face, who asks...<br>\r\n\"What next, little footbitch?...</span></div></div>",
            "created":1248757200,
            "id":733840,
            "title":"A small problem"
        },
        "11221112":{
            "choices":[
                "\"GOOD JOB, NOW DO THE OTHER ONE!!!\"",
                "\"THAT WAS AWFUL. NOW YOU GET A LONG RIDE IN MY SOCK!!!\""
            ],
            "content":"<div class=\"\"><div> <span>Aladdin stands up, pulls up a chair and sits down on the chair, positioning both his feet right next to you.<br>\r\n\"LISTEN UP BITCH. NOW YOURE GONNA CLEAN OUT ALL THE GUNK AND GRIME FROM BETWEEN MY SWEATY TOES!!!\" he booms.<br>\r\n\"But how? I have nothing to use...\" you reply.<br>\r\n\"OH I WOULDNT WORRY ABOUT THAT...\" he says with a grin.<br>\r\nBefore you know it Aladdin positions his foot right over your head and slams down, forcing you in between his two biggest toes.<br>\r\n\"HERES DINNER, SO ENJOY WHAT YOU CAN!\"<br>\r\nYou look up desperately at Aladdin and realize hes not joking, so you start licking in between his smelly toes.<br>\r\nYou lap up sock lint and cheesy sweat in your tongue and when you attempt to spit it out, Aladdin threatens to stomp you flat. This forces you to swallow all of his rank toejam. You become nauseous, but you keep going, as to please your master. Eventually you finish the right foot, thinking its all over and  you can finally rest...but....</span></div></div>",
            "created":1249362000,
            "id":738814,
            "title":"Aladdin's Sweaty Toes"
        },
        "112211121":{
            "choices":[
                "\"ILL PUT ON A SOCK AND WELL GO FOR A LONG WALK!\"",
                "\"I COULD USE SOME ROLL ON DEODERANT!\""
            ],
            "content":"<div class=\"\"><div> <span>Aladdin pulls his foot up to his face and takes a deep whiff. \"WOW. IM SURPRISED.\" he says, \"THEY ONLY SMELL BAD NOW, NOT AWFUL. GOOD JOB. AS A REWARD, YOU CAN DO THE OTHER ONE!\"<br>\r\nYou thought you were done, and when Aladdin smirked and told you you had another foot to do, a look of exhaustion came up on your face. Aladdin looks down at you and realizes how tired you are.<br>\r\n\"WOW, I DIDNT KNOW HOW HUNGRY YOU WERE. I GUESS THAT MEANS YOURE FULL, SO NO MORE LICKING.\" You immediately get revitalized at the sound.<br>\r\n\"DONT GET TOO EXCITED. MY OTHER FOOT STILL IS REALLY NASTY AND SMELLY SO I THINK A GOOD SMELLING IS IN ORDER.\" Your look of happiness is immediately shattered as Aladdin moved his other foot on top of you, positioning your head between his toes.<br>\r\n\"HERE IT COMES, BITCH. JUST SO YOU KNOW, THIS FOOT IS MUCH SMELLIER THAN THE LAST!!!\" <br>\r\nWith that, Aladdin lowers his foot onto you, clamping your head between his toes and squeezing so that your face is forced against the smelly walls of flesh. You immediately gag but theres nothing you can do. Aladdin repeats the process with every toe crevice, starting with the least foul and ending with the most foul.<br>\r\nAfter that, he clamps you in the space between his toes and sole and then rubs his sole up and down on your face. By the time youre done, you might as well have licked his feet clean because your nostrils and mouth with filled with his toejam anyway.<br>\r\n\"YOURE DONE ITH THAT. SINCE THIS FOOT WASNT LICKED, IT WILL REMAIN THE SMELLIER ONE FOR PUNISHMENTS WHEN YOU DISOBEY ME! BUT UNTIL THEN...\"</span></div></div>",
            "created":1252040400,
            "id":755493,
            "title":"Aladdin shows mercy...or does he?"
        },
        "1122111212":{
            "choices":[
                "youre in a completely different setting",
                "youre in his sock under ALOT of pressure"
            ],
            "content":"<div class=\"\"><div> <span>you shudder at the idea of a completely new rank experience and recoil into Aladdin's sweat soaked sock.<br>\r\n\"WHATS THIS? YOU WANNA BE IN MY SOCK? WHAT A GREAT IDEA!\" Aladdin exclaims, as you've fallen right into his plan. You immediately realize what you just did and decide that what he originally had in mind was the lesser of 2 evils.<br>\r\n\"no wait!!!\" you screech \"id rather be in your nasty armpit than your sweaty sock...\"<br>\r\n\"HM. I SEE....\" he responds, \"WELL THEN YOU SHOULDA HIDDEN IT A LITTLE BETTER BECAUSE BY NOW YOU SHOULD KNOW THAT IM GOING TO DO THE EXACT OPPOSITE OF WHAT YOU WANT!!!\" Aladdin laughed loudly as your heart sank.<br>\r\nHe picked up his moist sock, held it up to his nose and recoiled.<br>\r\n\"OH CRAP. YOURE REALLY IN FOR IT. I FORGOT HOW BAD THESE THINGS STINK!!!\"<br>\r\nwith that, quickly stomped you so your head would be right between his pinky toe and the other, and pried his sock over the foot. The odor intensified tenfold with the combined effort of the sock and the foot, and you pass out in the heat.<br>\r\nWhen you wake up...</span></div></div>",
            "created":1258520400,
            "id":793618,
            "title":"change of plans..."
        },
        "11221112121":{
            "choices":[
                "Hitch a ride in Eric's boot",
                "Sniff Eric's sweat soaked socks"
            ],
            "content":"<div class=\"\"><div> <span>You wake up to complete darkness. The foul smell of Aladdin's sock is gone and you are now completely encased in a fleshy space. Light suddenly floods your vision and you start to make out the outlines of a face. You look up to see.....Prince Eric???? (the little mermaid)<br>\r\n<br>\r\nThe giant uncoils his hand so youre standing in the center of his palm and you look dumbfounded. Noticing this, Eric begins to speak.<br>\r\n\"I bet youre wondering why youre here and what happened to Aladdin.\" All you could do is nod.<br>\r\n\"Well, it turns out that he's had enough of you. Says he got all he needed from you and that if i wanted your services , youre mine...so well, i took him up on the offer.\" <br>\r\n<br>\r\nHoping this master is a little nicer than your previous one, you start getting up and try to speak but he cuts you off.<br>\r\n\"Oh no, dont worry, im no more lenient of a master than Aladdin was...I just wanted you to know how you got here and stuff. Were still gonna have plenty of fun, bud...\"<br>\r\n<br>\r\nYour heart sinks as Eric puts you on the floor by his boots.<br>\r\n<br>\r\n\"soo...where should we start, kid?\"</span></div></div>",
            "created":1262581200,
            "id":815658,
            "title":"Prince Eric????"
        },
        "112211121212":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "\"The Royal Pits\"",
                "\"The Royal ass\"",
                "\"The Royal foot\" (bare foot)"
            ],
            "content":"<div class=\"\"><div> <span>Eric's socks could've been in the ocean for all you knew, considering how damp they were. But it turned out that the once white socks of the hunky prince was soaked with 100 percent sweat. And now, the sweat that coated these massive royal feet were about to become your meal.<br>\r\n<br>\r\n\"Now, let's see if Aladdin was right about you,\" said Prince Eric with a cocky grin. \"Sniff.\"<br>\r\n<br>\r\nYou looked up into the seductive blue eyes of the prince, but your view was soon blocked off by the worlds dirtiest sock covering the world smelliest foot.<br>\r\n<br>\r\n\"Sniff it up, bitch. Or you're gonna be living in my boot.\"<br>\r\n<br>\r\nYou had no choice but to obey and sniff Prince Eric's reeking sock. He laughed and kicked you down while you sniffed.<br>\r\n<br>\r\n\"Alright, little man, you've been well aquainted with my beautifully stinky feet. Now its time for you to meet...</span></div></div>",
            "created":1425790800,
            "id":1945680,
            "title":"Sniff Eric's sweat soaked socks"
        },
        "1122111212121":{
            "author_id":"jalen1",
            "author_name":"Amysios",
            "choices":[
                "The left pit",
                "My stinky ass "
            ],
            "content":"<div class=\"\"><div> <span>“Now slave that you’ve smelled and worshiped my sweaty socks, I think it’s time your get to spend some time with my sweaty, smelly royal pits”. Prince Eric removed his shirt and you could see his sexy figure dripping with sweat. He lift his right arm and gives his pit a sniff and then recoils in disgust. “Your in for a smelly surprise little slave”. You try to run but he picks you up with ease and brings you to his rancid right pit. “Enjoy my man musk little slave” and with that he buried you in his sweaty pit. It was horrible you got tangled him his armpit hair and it smelled horrific. He continues rubbing you in his pit making you absorb any and all sweaty and odor. The sour stench burn your nose and when you scream the salty liquid got in your mouth causing you to gag, the whole experience was sickening. And some time of smelling the sweaty under arm he speaks. “ alright slave now that you got a smell of my royal musk I want you to get a taste, lick my pits clean”. Your horrified at his words but you don't want to see what will have happen if u disobey. He brings you back up to his smelly jungle and you stick out your tongue. As soon as your tongue makes contact with the salty pit you gag. The taste is horrible, he rubs your tongue up and down his pit your mouth collecting all the sweat and stench. “ all right slave now time for...”</span></div></div>",
            "created":1587303240,
            "id":2821086,
            "title":"\"The Royal Pits\""
        },
        "1122111212123":{
            "author_id":"socker",
            "author_name":"Socker",
            "choices":[
                "Yeah we in luck here, down in the muck here, under the feet.",
                "Out of the feet, wish I could be."
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://orig00.deviantart.net/af64/f/2015/359/a/6/dessin_anime_eric_by_final_fantaisies-d9lgiz8.gif\" target=\"_blank\">http://orig00.deviantart.net/af64/f/2015...</a><br>\r\n<br>\r\n\"My loyal subject, I present to you the royal foot!\"<br>\r\n<br>\r\nPrince Eric removed his smelly sweat-soaked socks, and bared his feet on the floor in front of you. Eric's feet were so masculine, yet so smooth. The musky scent from his feet was still strong, even with the socks off.<br>\r\n<br>\r\n\"Bow down before your prince,\" Eric said authoritatively.<br>\r\n<br>\r\n\"Yes, your highness,\" you acquiesced. You bent down from the waist, bringing your already tiny body lower to the ground.<br>\r\n<br>\r\n\"That's right, I'm 'your highness,'\" said Eric, \"And what does that make you?\"<br>\r\n<br>\r\n\"Your... lowness?\" you asked meekly.<br>\r\n<br>\r\n\"Your lowness,\" thundered Eric, \"Well you aren't low enough! Grovel at my feet.\"<br>\r\n<br>\r\nYou further prostrated yourself, so that now you were kneeling at Eric's feet with your knees on the ground. Your bowed head was hovering just above Eric's huge toes. <br>\r\n<br>\r\nWith each breath you took, the sweaty smell of the prince's feet besieged your lungs like a royal invasion. Judging by the heat emanating from his feet, it must have been a long, hot day outside. Eric must have trekked hundreds of miles out where he walked, out where he'd run, out where he'd stay all day in the sun. Strolling around on the street. Walking around on his feet. His perfect, royal feet.<br>\r\n<br>\r\nYou don't know why, but you're dying to try; you wanna -<br>\r\n<br>\r\n\"Kiss the foot,\" said Prince Eric.<br>\r\n <br>\r\nAs much as you want to, you're a bit nervous to kiss the feet of the handsome giant. Your lips land a tentative peck on his toe.<br>\r\n<br>\r\n\"My oh my, looks like the boy's too shy,\" said Eric teasingly, \"you gotta kiss the foot.\"<br>\r\n<br>\r\nYou kiss his feet with more fervor, giving Prince Eric the royal treatment.<br>\r\n<br>\r\n\"Don't stop now! Don't try to hide it how you wanna kiss my feet.\"<br>\r\n<br>\r\nAs you kissed Eric's feet, your kisses eventually turned to licking and sucking. Eric's feet were salty from the sweat; it was like you were drinking water from the sea.<br>\r\n<br>\r\nAfter an hour of you kissing and licking the top of his 's feet, Eric said, \"You know, your lowness, I still don't think you're low enough. Get under my feet.\"<br>\r\n<br>\r\nEric raised a foot over your head and brought it down to pin your body against the floor. Your face lined up to where the base of his toes met the ball of his foot. This is where you belonged, fathoms below his rich and fortunate soles. Do you accept your new position as Prince Eric's footboy?<br>\r\n</span></div></div>",
            "created":1465880400,
            "id":2163990,
            "title":"Under the Feet"
        },
        "1122112":{
            "choices":[
                "Lick those sweaty armpits!",
                "Lick those cheesy feet!"
            ],
            "content":"<div class=\"\"><div> <span>\"Wow, this is awesome, but i think youve done enough on my feet for now. how about you take a trip to...my nasty pits!!!!\" Aladdin exclaimed.<br>\r\nYou try to scream in horror but nothing comes out because of the duct tape.<br>\r\nAladdin hoists you up into his chair and removes his shirt, showing a thin sheet of glistening sweat on his muscular chest.<br>\r\nHe bends down and positions your nose in his armpit and clamps down, forcing you to smell the horrible odor of his sweaty pit. You try to scream and flail but he has you in a strong hold.<br>\r\n\"Youre resisting too much. I think we should try this horizontally.\"<br>\r\nWith that, Aladdin threw you down on the floor and put you in a wrestlers position, making sure your face was directly in his smelly pit, and his rank foot was on your crotch. He clamped down again, suffocating you and causing all air except his smelly B.O. to leave your nostrils.<br>\r\n\"Hows that smell, bitch? Better or worse than the feet\" he asks as he wiggles his toes on your groin.<br>\r\nHe rips off the duct tape, keeping you in the hold, and now allowing you to get the full odor from his sweaty pits.<br>\r\n\"Now, since youre my slave, and youre cooperating so well, ill give you a choice. do you want to lick my stinky feet again, or lick my rank pits?\" he asks with a grin.</span></div></div>",
            "created":1249621200,
            "id":740645,
            "title":"Aladdin's Nasty Pits"
        },
        "11221121":{
            "choices":[
                "\"I'm gonna sit on your face!\"",
                "\"I'm gonna go take a long walk to get the feet all smelly again for you!\""
            ],
            "content":"<div class=\"\"><div> <span>You are speechless at the arabian god and do not respond.<br>\r\n\"no response? alright then, why not just keep going with my pits?!\" He grinned.<br>\r\nDoing everything in your power to resist, you clamp your mouth shut as Aladdin repositions you in his rank armpit. However, his grip on you is strong, so he continues to clamp you until you open your mouth, sending sweat and grime racing down your throat.<br>\r\n\"Lick stupid slave!\" Aladdin commands with force, causing your nose to be crushed into his pit.<br>\r\nNot wanting to upset the muscular man, you take a big whiff of the B.O. infested armpits and give it one good lick.<br>\r\n\"Aw, thats great!\" he exlaims, as you choke on the smelly sweat that was forced down your throat. \"Keep going!\"<br>\r\nYou continue to lick the pit, crying all the way until Aladdin is finally satisfied with the job you did on that one.<br>\r\n\"Alright, on to the next one!\" He says as you thought you were done. Disheartened you move onto the next pit; a fresh new rank pit with even more sweat than the other one. Your nose is bombarded by the rank odor of Aladdin's pit, but you persist until Aladdin says youre done. <br>\r\n\"hm...now what?\" he says...</span></div></div>",
            "created":1254459600,
            "id":769215,
            "title":"A Taste of Aladdin's Pits"
        },
        "112211211":{
            "choices":[
                "Aladdin shrinks you",
                "Aladdin keeps you taped the floor and chooses to do something else...."
            ],
            "content":"<div class=\"\"><div> <span>Without saying a word, Aladdin lays you on the ground face up. you try to struggle but he plants his sweaty foot on your face so youre pinned to the ground.<br>\r\n\"stop moving stupid slave!\" he says as he grabs the roll of duct tape. you lay still, just hoping that your punishment is nothing too bad.<br>\r\nMeanwhile, Aladdin is hard at work taping up your arms and legs to the ground so youre physically immobilized.<br>\r\n\"This can work real nice for a whole bunch of things....i can have you lick my sweaty feet, i can clamp your head in my rank pits, but for now i think ill just sit on your face!!!!\" He says with a mischiveous smile.<br>\r\nwith that, Aladdin's satin pants backside covers your face. The smell is not awful but the plump butt on your face causes you  to begin suffocating, as Aladdin smushes your face by constantly shifting and repositioning his butt. As soon as you begin to think youre going to pass out from lack of air, you hear Aladdin's muffled voice say \"oh, whats that? no air? lemme give you some! hahahahaha\" Aladdin's laughs are quickly muffled by a long, deep fart right into your face. Your mouth was open as you were trying to scream and you swallowed the foul air. <br>\r\nYou try to scream for help but Aladdin merely says \"whats *fart* that? I cant *fart* hear you, *fart* slave!!!\"<br>\r\nThe once tolerable smell quickly becomes intolerable, and the rank air seeps into your nostrils as Aladdin smushes his round butt into your face, positioning your nose under his crack so all of the air reaches into the deepest parts of your nose.<br>\r\nYou finally start to think youre gonna pass out because of the smell until finally, light appears and you gasp for air. You look to see Aladdin looking down at you smiling.<br>\r\n\"Well that was really fun. thanks for letting me release my load!\" he says sarcastically, as a huge wad of spit seeps out of his mouth onto your horrified face.<br>\r\n\"Oh, my bad. lemme clean that right up for ya.\" he says and takes his foot and rubs it all over your face, sending spit and toejam into your nose and mouth.</span></div></div>",
            "created":1261198800,
            "id":807633,
            "title":"The many scents of Aladdin"
        },
        "1122112112":{
            "author_id":"thatstinks",
            "author_name":"KnockOutStench",
            "choices":[
                "Aladdin has a stink-intensifying magic powder.",
                "Aladdin brings in the big, sweaty Dungeon Guard."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I think it's time I tried something new...\"</span></div></span></div>",
            "created":1385269200,
            "id":1698521,
            "title":"Aladdin keeps you taped the floor and chooses t..."
        },
        "12":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Hell Yeah Kevin",
                "No Kevin Please Stop",
                "Start smelling them",
                "Start licking them and sucking his toes",
                "Stuff them down your pants and let Kevin's feet jack you off"
            ],
            "content":"<div class=\"\"><div> <span>You are the assistant to Kevin Ryman, you work for the RPD and you have been given orders to obey Kevin's every command on your mission with him.<br>\r\n<br>\r\nIt was a long walk and you're both exhausted from the longest walk you both have ever taken. Both of you decide to sleep at the nearest hotel which was still a walk away but once you get your room you feel like you finally relax but when Kevin finishes his phone call he sits on the chair across from you and props his big feet up on a foot stool.<br>\r\n<br>\r\nAs he takes his shoes off you imediately notice the smell <br>\r\n<br>\r\n\"I was gonna keep my socks on, but since your a lower rank than me and i hardly know you your gonna worship my aching bare feet\" And with that he removes both his socks to reveal his big, red hot and smelly feet.<br>\r\n<br>\r\n\"Remeber you have to obey my every command, so get to it\" and with that he shoves both his hot stinky feet into your face and rubs them all over.<br>\r\n<br>\r\n\"Aah\" as Kevin slouches in his chair pushing both his bare feet deeper into your face \"do you like that\"</span></div></div>",
            "created":1240722000,
            "id":681877,
            "title":"Kevin Ryman (Resident Evil)"
        },
        "13":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Your begin rubbing Drake's manly feet",
                "You use his feet to jack off",
                "You shrink yourself...",
                "You lick and smell his feet",
                "You decide to do something else to Drake..."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey buddy\" Drake answered the door. \"Hey Drake.\" You reply entering your friends house and closing the door behind you.<br>\r\n<br>\r\nYou and Drake had been good friends ever since you saved him from falling into a manhole and severely hurting himself a year back. Ever since, you two had been great buddies and always welcomed each other.<br>\r\n<br>\r\n\"So what should we do today?\" Drake asked you with a smile. \"I dunno. How about we get something to drink?\" You reply. <br>\r\n<br>\r\nDrake looks a bit confused for a moment, but he never doubted you. \"Sure thing.\" He says before heading into the kitchen and returning with 2 glasses of root bear. \"Hey, wait a second. I gotta use the bathroom\" Drake looks at you while putting the drinks down. \"You make yourself comfortable here al'right?\"<br>\r\n<br>\r\n\"Sure.\" You reply. Soon Drake is gone and completely out of sight.<br>\r\n<br>\r\nThen quickly, you reach into your pocket and pull out a package labeled sleeping powder. On it said, \"Amazing Sleep Powder. Fall asleep instantly. Guaranteed to give 1 hour of good sleep, and never wake up unless user hears a clapping sound.\" <br>\r\n<br>\r\nRipping open the package, you dump all of it into one glass of liquid, while you take the other and gulp it all down, forcing Drake to take the potioned when he returned.<br>\r\n<br>\r\n\"Hey. You sure drink fast.\" Drake says smiling as he returns. \"Uhh.ya.\" You say nervously. \"Here. You drink yours.\" Standing up you hand Drake his glass of root beer.<br>\r\n<br>\r\nWithin seconds, the entire glass is empty, and Drake walks over to the couch and sits down. \"Uhhh..you know what?\" He says, his eyes beginning to close, \"I'm going to take a nap..you just...zzzz\"<br>\r\n<br>\r\n<i>Yes!</i> You think to yourself. Now was your chance to get closer to Drake's sexy feet without him feeling a thing (after all, the powder's label had said that the user would not wake up no matter what for a hour (expect for clapping)</span></div></div>",
            "created":1248584400,
            "id":732878,
            "title":"Drake (Uncharted)"
        },
        "134":{
            "author_id":"aayla8978",
            "author_name":"Aayla8978",
            "choices":[
                "Nate is angry and pummels your face under his grimy feet",
                "Nate loves the feeling and asks you to keep worshipping his feet"
            ],
            "content":"<div class=\"\"><div> <span>you get in close to Drake's bare feet, the closer you get, the more dirt and grime you notice on his soles. when your nose is just an inch away from his foot you take a deep whiff. <br>\r\n'Holy shit.' you said aloud. they were the cheesiest things you had ever smelt. the pungent odour of Nate's feet was invading your nose and mouth. you wondered what he had been doing to get his feet in such a state. <br>\r\nyou recalled one occasion when Drake had been lost in the desert for two days with the same boots on all the time. you were in the room when he finally took them off. everyone in the room gagged from the stench of Nate's sweaty feet. Cutter joked that Marlowe could have just used Drake's feet as a weapon instead of tracking down an ancient poison. <br>\r\n<br>\r\nBack in the present, you decided to clean Drakes dirty feet for him. You slowly dragged your tongue up his long stinky foot and tasted dirt, sweat and grime on your tongue. <br>\r\nYou were about to do it again when Nate's foot twitched and through sheer reflex kicked you right in the nose. <br>\r\nDespite the pain, you loved the feeling of your face being abused by Nate's calloused soles and tried to get him to kick out again by licking the toe jam out from between his toes. <br>\r\nyou had just begun to suck on his big sweaty toes when you heard his voice. <br>\r\n<br>\r\n'what the fuck are you doing?'</span></div></div>",
            "created":1481346000,
            "id":2248177,
            "title":"You lick and smell his feet"
        },
        "1341":{
            "author_id":"jalen1",
            "author_name":"Amysios",
            "choices":[
                "Smell my fucking feet",
                "Lick the dirt and sweat of them "
            ],
            "content":"<div class=\"\"><div> <span>“What the fuck are you doing!” Drake asked angry. “I- I was just” you stutter as you try to speak. “ nah shut the fuck up little bitch I get it your a foot fag” you state at him not knowing what to say. “ don’t worry faggot I won’t tell anyone but from know on your MY personal foot bitch”. And with that he kicks you on the ground and smothers you’re face with his stinky sweaty feet. “This is what what you like right bitch” he says and continue to rub his grimy feet in your face and nose. You don’t know how to feel, happy over the fact drake has his feet in your face or disgusted because there dripping with sweaty and smell like moldy cheese. Either way you have to deal with it.”hey bitch now I want you to”... </span></div></div>",
            "created":1587305040,
            "id":2821089,
            "title":"Nate is angry and pummels your face under his g..."
        },
        "13411":{
            "author_id":"jalen1",
            "author_name":"Amysios",
            "choices":[
                "“Lick the cheese feet clean”"
            ],
            "content":"<div class=\"\"><div> <span>He moves he foot to where his toes are over your nose and his sole is over your mouth he graves your nose with his big and second to.” Yeah little bitch smell that cheese foot funk I know it stinks, I haven’t showered in a long time and my feet have been trapped in my boots for weeks practically swimming in their one sweat”. He was right his feet where rancid sweat dripping off his toes toe jam in between his toes. And his nails where long and yellow. The smell was horrible like stale cheese and vinegar. “ you still like my feet little faggot even when the smell like shit and haven’t been washed” you stay quiet not knowing what to say. “I'm taking that as a yes” he takes his other foot and rubs your cheeks and lips leaving behind trails of slime sweat. “ I think my feet need a cleaning after not being washed an a few weeks use your tongue and get licking bitch”.</span></div></div>",
            "created":1587305760,
            "id":2821091,
            "title":"Smell my fucking feet"
        },
        "134111":{
            "author_id":"jalen1",
            "author_name":"Amysios",
            "choices":[
                "“Clean my other foot”",
                "“Eat my toenails”"
            ],
            "content":"<div class=\"\"><div> <span>You stick out your tongue and lick his soles. You gaged it takes like salty cheese. “Hahah!!! Man are they that bad, I want you to lick from my heel to my toes then in between each one, make sure u get in there real good to clean out all the toe gunk. Then after that lick under my nails I’m   sure there is plenty of flavor there. You grimace at his words his feet your beyond disgusting and you had to lick it. “ GET LICKING BITCH!”. You do want your told and start at the hell, your tongue  collecting all the dirt and sweat from his salty foot. “Yeah bitch that’s good just like that”. You lick his soles fast and hard making sure to get all the dirt off. Time passes and you still haven’t cleaned his toes. “ hey bitch my toes are still fucking filthy clean them shits”. He brings his toes to your lips you can taste the salt. You stick out our tongue in between his fist 2 toes and instantly gag the cheese salty taste was just to much. This angers drake and he stops on your face “ eat my fucking toe jam you worthless faggot”. Drakes reaction scares you not wanting to anger him further you stick your tongue between his toes fighting your gag reflex. “ yeah that’s more like it bitch swallows your masters to cheese”. You lick each toe crevices clean of gunk your throat is on fire and your tongue is sore. Drake examined his feet and toes. “Nice job foot licker but now you need to clean my toenails then my other foot”. Drake brings his foot back down his toenails scratching your upper lip. His toe nails contains more gunk then his toes making the task harder and more time consuming. You eventually finish. “Nice job bitch now I want you to”...</span></div></div>",
            "created":1587306780,
            "id":2821093,
            "title":"“Lick the cheese feet clean”"
        },
        "14":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "His giant feet touch your face and nose (on purpose)",
                "His giant feet touch your face and nose (accidental)",
                "He goes and puts socks on",
                "You ask him if he wants his feet massaged",
                "He asks why your smelling his feet"
            ],
            "content":"<div class=\"\"><div> <span>You have been wondering where you were for quite a while, that was until your new master came in the front door it was Henry Townshend the man you dreamed about seeing his feet, whilst you were lost in your thoughts Henry starred at you in bewilderment \"hey lil guy how'd you get in here\", \"huh\" as you finally came through \"oh im not sure i can't remember anything before i woke up here, i'm sorry for bargeing in\" \"hmm, haha no problem buddy\" and saying that, henry sits of his sofa and sighs\"uggghh, i've been on my feet all day\" he says as he bends down and taking his shoes off. \"my feet are really tired\" he comments whilst putting his huge dirty bare feet on his coffee table slouching down \"ugh what i could really go for right now would be a foot massage\" the smell of his stinky feet soon hit you.<br>\r\n<br>\r\nYou enjoy the smelly feets stench wishing it will never end as it starts to turn you on, Henry's face is hidden behind his huge beefy dirty feet so you decide to crawl nearer to his soles for a better smell. As you get nearer your breathing becomes more faster as his sexy feet get bigger and bigger the closer you get, getting smellier and smellier, henry still hasn't noticed what your doing yet and he starts turning you on even more without realising it as he wriggles his dirty black toes then scrunches his toes causing wrinkles along his soles<br>\r\n<br>\r\nFinally henry slouches deeper causing his feet to move closer to you when...</span></div></div>",
            "created":1230786000,
            "id":634870,
            "title":"Henry (silent hill 4)"
        },
        "141":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "I still want your feet rubbing my face please",
                "Can i massage them for you",
                "Can i suck on em, if thats okay with you"
            ],
            "content":"<div class=\"\"><div> <span>Henry slouches and his hot foot pushes slightly onto your cool nose, Henrys foot pulls back a bit as it twitches before he pushes his feet deep into your face \"sorry about that, your face is cold, thats why my foot twitched and pulled back, so you like my feet eh, enjoy .... now\" Henry says as he stars to grin and rubs both his hot feet all over your cold face \"lets warm your face up then eh, i think you'll find the experience and the smell of my feet to be very arousing\" he wasn't lying the experience of his feet rubbing your face was very arousing and the smell of it made your arousal even harder with each inhale you took of his smelly foot \"this is great\" you groan and mumble through his smelly flesh \"yeah, it feels great for me too, having someone who will tend to my feet and not complain about the smell ... they do smell ... don't they?\", \"hell yeah Henry, thanks\" \"heh, your welcome, so now what\"</span></div></div>",
            "created":1249016400,
            "id":735571,
            "title":"His giant feet touch your face and nose (on pur..."
        },
        "143":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Smell them (so what if there socked the stink might come through)",
                "Massage his feet wth socks on ",
                "Ask why he put socks on (try to get him to remove them again)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He comes back with black socks on (maybe he's on to you ... you decide) and goes in the same posistion as before he left what do you do</span></div></span></div>",
            "created":1230786000,
            "id":634872,
            "title":"Socked feet"
        },
        "1431":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "you remove his socks and get his bare feet",
                "leave his socks on it's so much better than you expected it to be",
                "henry wakes up"
            ],
            "content":"<div class=\"\"><div> <span>You notice that Henry has fallen asleep, so now's your chance, you grab his left socked foot with both hands and you bring it closer to your face. Since your moving his foot your also moving Henry making him slouch more. He still hasn't woken up so now you shove your face deep into his socked foot enjoying the pungent arouma of his manly feet which is giving you so much exciment and a gradual hard on. The feeling of his soft smooth socks also turn you on as you feel his toes under the fabric and then the fact that his bare feet are so easy to get you start to ponder at the thought but eventualy</span></div></div>",
            "created":1235624400,
            "id":652833,
            "title":"Smelling the socked feet of man"
        },
        "1433":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "\"It'll stop you from smelling my feet\" (he saw you)",
                "\"My feet are stinky\"",
                "Suddenly you shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"umm Henry\" you nervouisly say \"yeah whats up\" \"were your feet cold\" \"no, why?\" \"then why'd you put socks on\" whats his reply</span></div></span></div>",
            "created":1230786000,
            "id":634874,
            "title":"Were you're feet cold"
        },
        "14333":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Henry see's you",
                "He dosn't see you (have fun with his socked feet)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You suddenly feel a tingle every where and you start to see Henry's feet get bigger until its a smelly, sexy looking and sexy to feel at pair of skyscrapers </span></div></span></div>",
            "created":1230786000,
            "id":634875,
            "title":"Skyscraper socked feet"
        },
        "143331":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Nice (he dosn't want to tourture/hurt you he wants to help you out)",
                "Mean (he wants to have fun with you)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he treat you</span></div></span></div>",
            "created":1230786000,
            "id":627746,
            "title":"Henry see's you"
        },
        "1433312":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Puts you in doughy quicksand (got it from a shop as a experiment)",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does he do</span></div></span></div>",
            "created":1230786000,
            "id":627749,
            "title":"Mean (he wants to have fun with you)"
        },
        "14333121":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Lets you suffocate",
                "Lets you out once you're under for a bit"
            ],
            "content":"<div class=\"\"><div> <span>\"I know just the place for you\" he grins showing off his white teeth \"i got this stuff years ago it's called quicksand ever heard of it lil guy, well it dosn't matter anyway cause that where i'm gonna put you the question is will i let you out or let you suffocate\" </span></div></div>",
            "created":1232254800,
            "id":634879,
            "title":"Puts you in quicksand "
        },
        "14333122":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Puts you down his pants (cock vore)",
                "Puts you in the socks he's wearing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about any of these</span></div></span></div>",
            "created":1230786000,
            "id":627750,
            "title":"More"
        },
        "143331221":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Your head (you can't see the outside world)",
                "Your feet (you can't move your legs)"
            ],
            "content":"<div class=\"\"><div> <span>He grins at you \"i know just the place for you\" with you in one hand the other he uses to pull off his trousers and open his pants \"in you go\" as he opens his hand you still grasp tightly to his thumb \"tryin to constrict me are ya haha\" <br>\r\n<br>\r\nYour grip soon faiis and you plumet onto his cold soft cock <br>\r\n<br>\r\n\"ugh\" he moans softly as his cock lifts up in the air getting harder and your grip gets more harder \"hey quit it little guy\" he says weakly as he actually enjoys you moving about \"hey\" you begin to say as it lifts even more and becomes even harder \"i'm gonna fall\" \"i'll make sure you don't\" as he grabs you and shoves your in his cock up to your waist ... but which went in first?</span></div></div>",
            "created":1230786000,
            "id":627754,
            "title":"Henry's cock"
        },
        "1433312211":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Slurps the rest of you in ",
                "He lets you out"
            ],
            "content":"<div class=\"\"><div> <span>You can barely brethe as your head is sunk into the squishy wall, from your nose to the front of your ears (its that soft and your heads sank that deep in it)you feel some of the squish wall tighten at your forehead and quickly moves down to your chin then waist constrict them then back to your forehead thus pushing you in deeper into his cock where its more softer, squisher, gooier and sticky now nearly your whole body has sank into his wall to be consumed but it's all up to henry what does he do</span></div></div>",
            "created":1230786000,
            "id":627766,
            "title":"Your head in his strong manhood"
        },
        "14333122111":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "content":"<div class=\"\"><div> <span>Henry laughs before letting you slide in even more. Soon only your feet remain outside. You're covered in Henry's cum since he's about to release everything he's been holding in. Then you head Henry grunt and you're entire body is pulled into his big hard cock. There's no air and you quickly faint with a mouthful of Henry's juice.<br>\r\n<br>\r\nHenry stands up (with his erect penis) and goes about his day. Pretty soon his erection diminishes as you're turned into Henry's cum and is stored until he jacks off.</span></div></div>",
            "created":1243141200,
            "id":696422,
            "title":"Sucked In By A Cock"
        },
        "14333122112":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "You surprise Henry by jacking him off",
                "You shout to Henry you want to be his foot slave."
            ],
            "content":"<div class=\"\"><div> <span>You hear Henry laugh and release the tension on you. Soon you start sliding slowly out of his gigantic cock and land in his boxers. There was a lot of room in here because Henry's cock was fully erect penis was pushing the fabric outwards.<br>\r\n<br>\r\nAs you try to get the bits of cum that got stuck on you, you realize that it smelled kinda good. Quickly you breathe in even more of the scent. It smelled wonderful. Soon you started eating the cum off yourself and become hypothesized by it. It just tasted so good, the warm cum. You wanted more. But then you remembered Henry's smelly feet and realize that you would love to be dominated by Henry. ..what do you do?</span></div></div>",
            "created":1243314000,
            "id":697686,
            "title":"Addiction To Henry"
        },
        "143332":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Smell em",
                "Climb/Stroke/Feel them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will you play with em</span></div></span></div>",
            "created":1230786000,
            "id":627742,
            "title":"He dosn't see you (have fun with his socked..."
        },
        "1433322":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "You fall asleep",
                "Henry sees you"
            ],
            "content":"<div class=\"\"><div> <span>Since Henry couldn't see you, you put your hand on his sweaty socks. The smooth fabric smells really good. Then you go up and rub your face against his sock and take a big whiff of his foot stench. After you start feeling his big sexy feet. It was all so hot, you wanted to cum instantly in your pants. This was like a dream come true for you. <br>\r\n<br>\r\nQuickly you pull your cock out from your pants and start rubbing it all over Henry's feet. It felt so good and soon you cummed all over them. His feet had just jacked you off...</span></div></div>",
            "created":1244091600,
            "id":702423,
            "title":"Masturbation With Henry's Feet"
        },
        "144":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "\"yeah i like your feet\"",
                "\"no, i'm just doing it to say sorry for being in your home\"",
                "\"i don't like em and i dont want to\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Okay, i'll give you one\", \"wha\" Henry, \"i'll massage your feet for ya\", \"well i was only joking but if you enjoy my feet then go ahead\"</span></div></span></div>",
            "created":1247115600,
            "id":721773,
            "title":"You ask him if he wants his feet massaged"
        },
        "145":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Lick em",
                "Massage them",
                "Go wild rub your face in his feet and rub your feet in his face"
            ],
            "content":"<div class=\"\"><div> <span>\"Hows it smell man, good\" he says as he slouches deeper \"go on take a deep smell of em\" as his cool foot now touches your nose <br>\r\n<br>\r\nHenry hears you taking deep breaths and puts his other soft foot against your cheek<br>\r\n<br>\r\n\"you like that don't ya\" as Henry takes the foot on your nose off and puts it on your other cheek<br>\r\n<br>\r\nHe starts rubbing his manly feet over your face before putting them back on your cheeks wrigglin his toes <br>\r\n<br>\r\nwhat'd you do now</span></div></div>",
            "created":1232254800,
            "id":634913,
            "title":"He asks why your smelling his feet"
        },
        "1453":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Henry relaxes and enjoys it",
                "Herny struggles (he wins, and gets your feet off his face)",
                "Henry struggles (you win, Henry has to endure the stench)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will he react</span></div></span></div>",
            "created":1232254800,
            "id":634892,
            "title":"Go wild rub your face in his feet and rub your ..."
        },
        "15":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Kilik (soulcalibur 2)",
                "Tarzan",
                "Caleb (w.i.t.c.h)",
                "Pips (ferngully)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Didnt like the previous choices well how about these</span></div></span></div>",
            "created":1230181200,
            "id":626601,
            "title":"Other choices"
        },
        "151":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "His grip on you is too tight (you can't get near them)",
                "Ask if you can smell em or massage them",
                "Go wild with his feet (lick/smell/rub/place on face ect)"
            ],
            "content":"<div class=\"\"><div> <span>When you awake form nothingness you feel your arms pinned to your side accompanied with two warm,soft hands. Your in a forest lying on Kilik as he lays against a tree. <br>\r\n<br>\r\nKilik's slow breathing and heartbeat is calming and makes you less tense as you wrap you arms around him giving him a long hug <br>\r\n<br>\r\n\"so you're awake now\" Kilik says as he takes his arms off your waist and hugs you too pushing you closer to  his muscular, cool chest <br>\r\n<br>\r\n\"yeah\"<br>\r\n<br>\r\nAfter a long disscussion of what happened Kilik fell asleep again and thats when you noticed his smelly feet<br>\r\n<br>\r\nthey were long, beefy, dirty and smelly but what happens</span></div></div>",
            "created":1232254800,
            "id":634883,
            "title":"Kilik (soulcalibur 2)"
        },
        "1512":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Can i smell your feet",
                "I wanna touch your feet",
                "Can i lick your feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Kilik\" \"yeah pal what is it, i'm listening\"</span></div></span></div>",
            "created":1232254800,
            "id":648895,
            "title":"Ask if you can smell em or massage them"
        },
        "15122":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Kinda",
                "Yeah are you up for one"
            ],
            "content":"<div class=\"\"><div> <span>\"huh\" he says as he opens one eye and looks at them \"Oh you mean massage them\" as he opens both eyes, put his arms behind his head as he slouches down further, looking at you staight in the eyes with his soft, gentle eyes, \"is that what you meant\"</span></div></div>",
            "created":1232254800,
            "id":648898,
            "title":"Touching kiliks feet"
        },
        "151222":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "he agrees",
                "kilik has second thoughs"
            ],
            "content":"<div class=\"\"><div> <span>\"well sure, but\" and before he could finish you get off of him and instantly go close to his feet<br>\r\n<br>\r\n\"which one do you want rubbed first kilik\" you say while you grab his ankles and put both his bare feet on your lap \"ummmmmmmmmm\" kilik says this for about half a minute while he wriggles his toes  \"are you sure you wanna do this buddy\", \"yeah kilik i want you to relax\", \"well ...</span></div></div>",
            "created":1243314000,
            "id":697475,
            "title":"Yeah are you up for one"
        },
        "1512221":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "start massaging his feet",
                "enjoy the fact that his feet are there"
            ],
            "content":"<div class=\"\"><div> <span>\"um... could you start with my right foot buddy ................ please\" he says in a gentle voice \"of course kilik you don't need to be so polite, i'd be an honour to serve you hahahaha\" kilik starts laughing too  and starts to slouch, kilik hasn't noticed but when he slouched both his bare feet pushed up against your crotch quite tightly and when he sighed and closed his eyes he clenched his toes which meant that his feet were now wrapped arout your cock and kilik has no idea where his feet are what are you gonna do</span></div></div>",
            "created":1243314000,
            "id":697484,
            "title":"he agrees"
        },
        "15122211":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Kilik's gay",
                "Kilik knows you have a foot fetish"
            ],
            "content":"<div class=\"\"><div> <span>you do what he says and grab his right foot while you leave his left foot up against your crotch.<br>\r\n<br>\r\nYou get a hard on as you feel how smooth, soft and hot his foot is<br>\r\n<br>\r\nKiliks eyes are still shut and your hard on increases as you bring his foot to your face and prepare for an amazing moment <br>\r\n<br>\r\nyou're about to take a deep smell but then there is a few turn on's, kiliks left foot tightens its grip around you cock and slowly moves up and down, his toes are massaging the cock head, his sole rubs your shaft while the heel rubs your sac, kilik makes a sexy grunt noise and as he does so his right foot twitches and it plants itself on you in the face softly and he keeps it there sideways, covering you nose and mouth, you're cocks never been happier his hot and manly foot is jacking you off while the other dirty foot is plastered to your face.<br>\r\n<br>\r\nYou finally take a deep smell and bear witness to the most pungent smell of feet ever, it makes you cream in your pants instantly, you smell it more and more as you wonder why he's rubbing your cock whilst putting his other smelly foot on your face and allowing you to smell it, why is he doing this</span></div></div>",
            "created":1243314000,
            "id":711346,
            "title":"start massaging his feet"
        },
        "152":{
            "author_id":"aayla8978",
            "author_name":"Aayla8978",
            "choices":[
                "you wake up bound and gagged with a sweaty foot in your face",
                "you wake up to 5 beefy toes shoved down your throat"
            ],
            "content":"<div class=\"\"><div> <span>After years of living in the jungle, tarzan's huge size 13 feet were very rough and calloused. because he rarely, if ever, washed, his feet were almost black with dirt and gunk and stank of vinigar and sweat. <br>\r\n<br>\r\nBecause of being raised by the apes, Tarzan was able to use his feet like a second pair of hands, with his long, thick toes being fingers and his beefy, muscular soles being palms. <br>\r\n<br>\r\nTarzan made sure that he was at the peak of physical strength and because of this, he was capable of lifting somthing as heavy as a human with nothing but 1 big sweaty foot wrapped around the victims face. <br>\r\n<br>\r\none day Tarzan heard of an intruder in the jungle and swiftly investigated.... <br>\r\n<br>\r\nYOUR POV: <br>\r\n<br>\r\nyou had been shipwrecked in this jungle for 2 days now, but were able to survive thanks to all the food growing around and plenty of animals to hunt with a makeshift spear. one morning you were on the hunt when you heard a rustling in the trees behind you. you turned around just in time to see a large dirty sole making its way towards your face and then, nothing... <br>\r\n<br>\r\nnothing but a pungent sour smell coming from the foot that now held your face aloft in the air, you felt its large toes wrapping around the top of your head, and you felt your nose forced into the inbetween of its gunky toes. if your mouth was not covered by a sweaty sole you would have gagged. <br>\r\n<br>\r\nit wasn't long before the dirty foot holding your face smothered you into unconciousness and the last thing you remember is the painful pressure with which the foot squeezed (or maybe 'crushed' would be a better word) your comparably tiny skull.</span></div></div>",
            "created":1472878800,
            "id":2205557,
            "title":"Tarzan"
        },
        "153":{
            "author_id":"hieverysomeone",
            "author_name":"Hey",
            "choices":[
                "Dragon Ball Series",
                "Caleb Guy",
                "Something totally different"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just to check, do you want this guy, or do you want something from the Dragon Ball series</span></div></span></div>",
            "created":1513918800,
            "id":2431306,
            "title":"Caleb (w.i.t.c.h)"
        },
        "155":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Zak (ferngully)",
                "Leon (Resident evil 4)",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a few more</span></div></span></div>",
            "created":1230786000,
            "id":627435,
            "title":"Other"
        },
        "1552":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "You wait and Leon returns",
                "You explore the house's shoe closet",
                "You wander into the dirty laundry..."
            ],
            "content":"<div class=\"\"><div> <span>You could now believe where you were and how everything had happened to you. Why had you snuck into Leon Kennedy's house and shrunk yourself on his bed? And even worse. Why had you done it when he wasn't home? You should have planned this better, figure out when he came home from whatever he did.<br>\r\n<br>\r\nOh well. Now you were stuck on Leon's bed in his bedroom. There was nothing you could do expect wait...or was there? After all Leon could have hours and you had been waiting to explore Leon's height at your size for quite a while now. <br>\r\n<br>\r\nWhat to do?</span></div></div>",
            "created":1243314000,
            "id":697676,
            "title":"Alone and Shruken In Leon's House"
        },
        "15521":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Leon gets in bed",
                "Leon somehow knew you were there and \"finds\" you"
            ],
            "content":"<div class=\"\"><div> <span>Well, there really wasn't anything for you to do. After all, you were at miniature size, in Leon's (not seemingly very big) house, with no idea how you got this way. The best thing to do, you decided, was to wait. Turning around, you see the big pillow where Leon put's his head on every night and crawl over to it. Slowly you laid your whole body down on it, breathing in the smell of Leon's hair shampoo. It was like sleeping on a cloud...soon you drifted off, dreaming dreams of what could happen when Leon finally got home and found you.<br>\r\n<br>\r\nSuddenly, you are awakened from your peaceful slumber by the loud noise of a door slamming. Instantly you prop yourself up (which was kinda hard, considering you were on a soft plushy pillow), and look at the bedside alarm clock. It's 4:30. You dozed off for nearly an hour. Then you hear a voice coming outside the room. \"Oh man. That was tiring.\" It's Leon's, and you realize that he's home.<br>\r\n<br>\r\nQuickly you scramble under the covers of the bed, worried that Leon might be upset if he found out that you had stalked him to his house and then somehow shrunk yourself in it. Your world turns pitch black, as no light is getting into the sheets. Soon you hear Leon enter the room, his giant feet making vibrations big enough for you to feel. You gasp, and wait.</span></div></div>",
            "created":1246338000,
            "id":716961,
            "title":"Leon's back!"
        },
        "155212":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Leon is nice and just wants to have some \"fun\" with you",
                "Leon is cruel and makes you his foot sale >:D"
            ],
            "content":"<div class=\"\"><div> <span>\"So..\" Comes Leon's voice. You stay perfectly still, hoping he won't find you. Unfortunately for you, the sheets you were hiding under are instantly thrown off, revealing you under them. \"So..\" Leon says again, and you slowly turn around to face him.<br>\r\n<br>\r\nWow. Leon was big. He towered over you, a smirk on his face. \"So, I see you've finally got the guts to get to my house. And look at this. You've somehow shrunk yourself.\" Leon looks at you with a grin on his face. \"Well, since you've obviously come here to worship my big sexy feet, I guess we'd better get started!\"<br>\r\n<br>\r\nHuh? Had you heard wrong. How did Leon know of your intentions? And did he just say he'd let you worship his amazing feet? What on earth was going on?</span></div></div>",
            "created":1246338000,
            "id":717033,
            "title":"Huh????"
        },
        "1552121":{
            "choices":[
                "Start licking.",
                "Heck no! you use me as a foot rag and now Im gonna drink up your sweat.? NO"
            ],
            "content":"<div class=\"\"><div> <span>Leon drops his giant socked foot on top of you. The foot is easily three times larger than your body and dominates you with little effort. Giant toes wrap around your body as the foot drags you backwards to Leon who is now sitting cross legged with you between his feet. \"Ah man dude, my feet are sweaty.\" he says with a yawn. Giant hands peel the socks off and almost immediately the smell of Leon's feet smashes against your nostrils. A rather devious smile draws its self upon the hot mans face, before you could realize what was about to happen the bare feet smash together, sandwiching your insect like body between them. \"Ahhhh.. I neaded a sweat rag. Hey bug boy, ya like bein' my foot rag?\" he asked mockingly as he rolled the shrunken you  between his feet for a good five minutes until your body was saturated with sweat. <br>\r\n<br>\r\nFeet parted letting you drop to the bed dripping with Leons foot sweat. The giant feet came together at either side of  you. \"Alright kid, My foot is still fuckin sweaty and you lil body sucked up all that it could. Lick my foot clean. If you don't I wear you like a shoe all day and maybe use your little head to clean between my toes. Don't forget I gotta work out later, unless you wanna be drowning in foot sweat start licking.\" The foot thrusts forward the heel knocking you backwards and causing your face to collide with the foot. You were hardly the size of his heel...this would take a while.<br>\r\n<br>\r\n</span></div></div>",
            "created":1255064400,
            "id":772632,
            "title":"Leon is nice and just wants to have some \"f..."
        },
        "1552122":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Let Me Rub And Worship Your Feet",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Before you can think another thought, Leon plucks you out of his bed and dangles you in midair from his air, upside down. Quickly, a feeling of nausea comes over you and you feel like puking. Leon just laughs at your tiny size and places you back on his bed. \"Now what should I do with my new foot slave?\" He says.<br>\r\n<br>\r\nUpon hearing that, you instantly get a hardon. It was so sexy that Leon was actually going to let you worship his huge sexy feet. \"Umm...Leon?\" You look up at his gigantic form. \"Can I suggest something?\"<br>\r\n<br>\r\nLeon looks surprised for a second but then quickly loses it. \"Fine. What do you want me to do with you?\"<br>\r\n<br>\r\n\"Ummm..\" You think for a moment, tons of crazy thoughts running through your head. \"I want you to...\"</span></div></div>",
            "created":1248584400,
            "id":732881,
            "title":"Master Leon"
        },
        "15521222":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Crush Me?",
                "Let Me Be Your Cock Slave Instead?"
            ],
            "content":"<div class=\"\"><div> <span>It takes you longer than expected, and you just sit there on Leon's bed, tiny and thinking.<br>\r\n<br>\r\n\"WELL? WHAT?\" Leon yells at you, obviously getting very impatient. <br>\r\n<br>\r\nFinally, you make up your mind. \"Hey Leon,\" You begin, \"Can you..\"</span></div></div>",
            "created":1248584400,
            "id":732882,
            "title":"Other"
        },
        "155212221":{
            "choices":[
                "Lets play with some footware Leon!",
                "screw best for last, hit me up with that big bare foot."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Leon,\" you start to speak, staring up at the giant man. Your pants become tighter as you become aroused just thinking that all this is happening. \"Can you crush me?\"<br>\r\nLeon smiles, pulling both of his socked feet onto the bed. \"Heh.. you are a little freak arn't you. Oh well, I'll crush you, but I ain't gonna kill you. Not yet anyway after all when is the next time I find someone your size?\"<br>\r\nYou begin to crawl toward Leon's giant socked foot, the soft cotton flows over the contours of his foot making it appear far smoother than it really was. The sock was irradiated with Leon's sweet scent. As you get close enough to touch the giant foot you realize how small you really are. You estimate you are only three or four inches, alot smaller than the six inches you had originally thought.<br>\r\n<br>\r\nLeon's giant foot raises on its heel and socked toes grasp you by the back of the shirt. With a flick of his ankle you are tossed off the bed and smothered with a socked foot. Leon rolls you beneath his foot like a small ball, up and down the lenght of his foot while he lets out an exasperated \"ahhh\"<br>\r\nAfter boredom strikes Leon applies pressure to you, not enough to completely smash you, but just enough to prevent movement and have your face pressed deep into the socked foot. <br>\r\n<br>\r\n\"Oh shit... sorry..\" Leon says abruptly, quickly removing his foot from your body. A smile plays across  his youthful face as his childish eyes gaze down at you pressed deep into the carpet. \"I forgot this was your idea, so you want me barefoot or socked.. or you want me to slip some skater shoes on?\"<br>\r\nYou stare up, your body shakes with adrenaline from being smothered by the mans giant foot. You ponder.. it all sounds so good. There was of course plenty of time to try it all out, but for now what to choose.</span></div></div>",
            "created":1255064400,
            "id":772780,
            "title":"Crush Me?"
        },
        "15522":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "You have fun with the boot",
                "You see what other shoes were in there"
            ],
            "content":"<div class=\"\"><div> <span>Well you probably were going to be here for a long time...so why not do a little exploring? Quickly you run over to the edge of the bed and jump off, landing on the soft carpet. When you do, you instantly stop once your feet feels the fabric and you realize Leon's big sexy feet probably walked all over it. Touching the carpet with your hands your cock starts to harden.<br>\r\n<br>\r\nThen you leave your miniature fantasy spot and run towards an open closet were a ton of shoes were littered all over the ground. Well not littered. Most of them were in neat piles but some were overturned.<br>\r\n<br>\r\nWhen you get nearer, a smell like nothing you've ever smelled hits you. Leon's foot stench was making you hornier by the second.<br>\r\n<br>\r\nSoon you reach the closet. Directly in front of you was Leon's gigantic boots, which (from spying on him this morning) you knew he wore everyday unless he went out to purchase something (which was now). Since you had snuck into Leon's house only seconds after he left, the boot was still warm from Leon's feet being in them. You can tell by pressing your hands on the fabric.</span></div></div>",
            "created":1243314000,
            "id":697682,
            "title":"Leon's BIG Boots"
        },
        "155222":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "The Dress Shoes",
                "The Black Vans"
            ],
            "content":"<div class=\"\"><div> <span>You couldn't just stand there! Sure you loved looking at Leon's big boots, and imaging how sexy and hot it would be if Leon put his sexy feet in them and crushed you under them, but there were other shoes to view and explore, so you quickly step to the side of the boot. In front of you where another 2 pairs of shoes. One was a black leather dress shoe, shined to perfection. The other one was something strange. Footwear you never thought Leon would be wearing, but apparently he does. It was a pair of black vans. It was strange, seeing you never thought someone like Leon would ever wear such footwear...but still. Seeing Leon's shoes so big was turning you on.<br>\r\n<br>\r\nWell, since you had already abandoned the boot, you definitely was going to \"stick\" with one of these shoes. After all, that was all there was in this closet! But the question (the hard question) was..which one to play around with?</span></div></div>",
            "created":1244091600,
            "id":702419,
            "title":"Dress Shoes and Vans"
        },
        "1552221":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Start Cleaning",
                "Too late! Leon's home!"
            ],
            "content":"<div class=\"\"><div> <span>Who knew that Leon was such a nicely dressed man? <i>I guess even he wants to look nice once in a while</i> You think to yourself. And still. Nothing beats dress shoes. Quickly, you stop gazing at the giant black dress shoe in front of you and instead, take out one hand and touch the heard leather front. It instantly got your cock hard. <br>\r\n<br>\r\nYou could not contain yourself anymore. Throwing your entire body on the polish shoe, you start rubbing yourself all over it, sliding up and down it's smooth sides, and once the shoe appeared to get dirty, you licked it. It was like heaven.<br>\r\n<br>\r\nAfter rubbing yourself against the front of the dress shoe, you started imagining what it would be like to get crushed under them. It was all turning you down so much. Quickly you grabbed your raging erection out from your pants and rub it all over Leon's dress shoe. Soon warm liquid starts coming out, and within seconds the front of Leon's shoe was covered with your cum.<br>\r\n<br>\r\nUh oh. Leon wasn't going to like this. You should probably clean this up....</span></div></div>",
            "created":1246338000,
            "id":717028,
            "title":"You Always Did Like A Well Dressed Man..."
        },
        "15522212":{
            "content":"<div class=\"\"><div> <span>You start to clean it up when suddenly you hear the door open. Leon then walks into the room and sees you holding his dress shoe with cum all over it. Leon is wearing a pair of black loafers and you realize that you want them more than the dress shoes. Leon grabs his dress shoe with cum from you and finishes cleaning it and then gets ready to say something. Before he can you grab his left foot and pull his loafer off knocking Leon over and leaving his black sock hanging halfway off. You then grab his right foot and yank that loafer off also and then proceed to take leons socks off also. Leon gets mad as he is left barefoot and then you put on his black socks and loafers and run out of his house</span></div></div>",
            "created":1267246800,
            "id":843449,
            "title":"Too late! Leon's home!"
        },
        "1552222":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Leon comes home",
                "You notice something else in the closet...."
            ],
            "content":"<div class=\"\"><div> <span>Vans? Now those were strange to find in Leon's closet. But still...Vans were among the few varieties of shoes that could really turn you on. All your clothes melt away as you first put your hand on the front of the shoe. It was just so big....so sexy...<br>\r\n<br>\r\nYou start hugging the front of the vans, running your hand against the rubber on the bottom. You could feel your dick getting hard in your pants. Being next to Leon's big sexy shoes was too much for you...Slowly you start rubbing yourself all over the front of the shoe, your erection getting bigger and bigger with each rub. Your thoughts going insane on how amazing it could be to worship these shoes or even better, the feet that wore them. Pretty soon, you feel something warm in your pants. You've cummed, but you don't stop. Instead you rest your head against the fabric of the shoe for a few seconds.<br>\r\n<br>\r\nThen, all of a sudden...</span></div></div>",
            "created":1246251600,
            "id":716337,
            "title":"Vans Pleasure"
        },
        "15522221":{
            "choices":[
                "Leon puts you in his shoe and goes out to skate and do errands.",
                "Leon crushes you"
            ],
            "content":"<div class=\"\"><div> <span>Something knocks you over. Too unstable from the rush of adrenaline you cant make out what had knocked you over until you saw the vans raise. The giant soles of  the skater shoes shadow your body and finally press you into the ground. A twist is applied, you can feel the rubber soles pressing into you and grinding you into the ground.. it was painful... but ecstatic as well. You could feel a portion of the giant shoe clad foot rubbing against your hard cock with intense pressure, it hurts, but you don't move it.<br>\r\n\"Iil' freak, you like that don't you?\" A voice booms from out side your sole enclosure.It's Leon.. and with the mischievous tone he uses... you know he has something in mind.</span></div></div>",
            "created":1255064400,
            "id":772781,
            "title":"Leon comes home"
        },
        "155222212":{
            "author_id":"engineering",
            "author_name":"Spencer",
            "content":"<div class=\"\"><div> <span>Leon's giant show was forcing you into the floor, grinding your body to the point you didn't think it was going to last much longer. You really didn't care though, you had what you wanted. Leon had you under his foot and was torturing you, or at least that was what he thought he was doing to your little frame. <br>\r\n<br>\r\nSuddenly the shoe lifts up and you see Leon's face, \" Hey there little guy. I see you love my Vans.\"<br>\r\n<br>\r\nYou nodded still on the ground wishing to have them back on you.<br>\r\n<br>\r\n\" I sure do love you being under them too. And I think I might as well just do this,\" Leon said.<br>\r\n<br>\r\nHis Van lifted over your body. You couldn't wait for it to be back on you but that wasn't exactly what was going to happen. It would be on you but not the way you wanted. Leon dropped his foot rapidly, you having no time to reach to the giant shoe. Leon twisted your mangled, destroyed body beneath his giant sole. He loved the feeling of a tiny bug perishing under his might being and knowing it was actually a human, all the better...</span></div></div>",
            "created":1259816400,
            "id":800657,
            "title":"Leon crushes you"
        },
        "15523":{
            "choices":[
                "Leon comes home and puts on his socks.. with you in them!",
                "Leon tramples the sock and then realises you are in it. He looks angry"
            ],
            "content":"<div class=\"\"><div> <span>The smell of sweat  and used deodorant hits your nose as you wander about the room. A hamper lay before you, clothes in disarray all over the floor. A giant white sock, twice your length radiated with the salty smell of sweat, it was alluring. Feeling like a hamster you decide to climb into the sock and lay down, it looks like cotton and appears brand new, bearing fresh Leon sweat from being used just recently. It feels although you are enveloped between two soft blankets and the smell of Leon graced your nostriles from all directions. If only, he was here.</span></div></div>",
            "created":1255064400,
            "id":772626,
            "title":"You wander into the dirty laundry..."
        },
        "1553":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Chris Redfield",
                "Kakashi and Iruka",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>even more choices</span></div></span></div>",
            "created":1230786000,
            "id":627437,
            "title":"More choices"
        },
        "15531":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Stay here and watch tv(smell his boots)",
                "Sure Chris i'll come"
            ],
            "content":"<div class=\"\"><div> <span>You were friends with Chris for a long time.One day after being bored in your house you decided to drop by his house to hang out with him<br>\r\n<br>\r\nYou knocked on his door. \"Hey what's up buddy\" Chris said in a freindly tone which he always used with you. Before you even opened your mouth he got you in a head lock and gave you a playful punch on the head  \"i haven't seen you in a long time, i was beginning to wonder if you'd fell out with me\", \"c'mon Chris you know i've been busy lately\".<br>\r\n<br>\r\nChris finally let you go and he let you in. Once you sat on the couch in his living room Chris went into the kitchen to get a snack, \"Hey pal, you want anything to eat\" , \"No i'm good this now Chris\". <br>\r\n<br>\r\nAfter a few minutes Chris came out of the kitchen then changed from his boots to his trainers. \"Hey i'm gonna go to the shops to get some food, you can either stay here and watch tv or come with me, i won't be long anyway\"</span></div></div>",
            "created":1244610000,
            "id":706146,
            "title":"Chris Redfield"
        },
        "155311":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Chris's smelly barefoot descend towards  your face",
                "Chris is at the doorway"
            ],
            "content":"<div class=\"\"><div> <span>\"I just walked from my house to here Chris, i think i'll just stay here and watch tv\", \"okay won't be long\" Chris said, you switch on the tv and wait till you hear the door close.<br>\r\n<br>\r\nWhen it closes you wait for what seems to be forever due to your excitment, to see Chris walk down the street from his window.<br>\r\n<br>\r\n\"Finally i can smell his boots\" you say as you grab his right boot \"please smell\" you keep saying as you put it over your nose and wear it like a mask letting none of the odur - if any - out of the boot.<br>\r\n<br>\r\nYou finally take a inhale of what you hope is a boot full of Chris's foot odur, and you were right the smell gave you an instant hard on, the strong smell was so unique you doubt you'd smell anything that sexy ever again in your life, you lie on the ground as your arousal by the stench of Chris's feet has made you too weak to sit up, you still keep a hold on his boot and have the entrance to his boot pressed tightly against your nose as you dont want to waste a single part of the stinky gas produced by Chris. The hard on is driving you nuts so you finally give in and stroke your manhood. You close you eyes and fantasise that the stench you are smelling is Chris's barefeet themselves. you push his boot deeper into your face as you imagine Chris forcing his barefeet deep into your face forcing you to inhale his feets stink. You finally open your eyes to see ...</span></div></div>",
            "created":1244610000,
            "id":706161,
            "title":"Chris's smelly boot odur"
        },
        "1553111":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "He really is mad and is gonna crush your face",
                "He was joking and dosn't mind you worshiping his feet"
            ],
            "content":"<div class=\"\"><div> <span>\"Move my boot\" Chris's voice says in a forcefull kind of way \"get it off your face. NOW\"<br>\r\n<br>\r\nYou look shocked to see your best freind standing over you angrily with his right barefoot just inches away from your face as if he's gonna stomp on you. \"Well you wanna smell the source of the odur that came from that boot or don't ya\" he says in a now angry tone. You nod at him with your eyes glistening with held back tears. \"Well then, remove my boot from your face\". After a few seconds of silence you remove his boot, but what will happen</span></div></div>",
            "created":1244610000,
            "id":706171,
            "title":"Chris's barefoot on your face"
        },
        "15531111":{
            "choices":[
                "Roll over, my feet are sweaty I'm gonna use your precious hair as a door mat.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Chris's heavy masculine brow narrows as he proceeds to drop his massive foot onto your face. \"Well here, eat this.\" Chris says snidely.<br>\r\nDarkness takes over as your entire face is dominated by foot majority of your face fitting beneath his arch. The sweet smell of sweat and shoe leather consumes the air you breath. Chris begins to press down, twisting his foot back and forth as he increases in pressure. Your face becomes lubricated with sweat and the droplets of salty foot tears seep into your mouth despite the fact that it is closed. You are amazed at how hard, yet smooth Chris's foot is. Now you begin to feel pain, you know that Chris has completely crushed peoples heads beneath his foot with little effort, you can already feel a foot shaped bruise forming on your face. You grasp the hot sweaty foot with your hands but against his strength and the slippery sweat your attempts are futile. Chris continues to work his foot deeper and deeper into your face his toes grasping your head preventing escape.</span></div></div>",
            "created":1255064400,
            "id":772621,
            "title":"He really is mad and is gonna crush your face"
        },
        "15531112":{
            "choices":[
                "And so the fun begins",
                "Try being in another persons shoes.. with their foot in it."
            ],
            "content":"<div class=\"\"><div> <span>\"So you like feet? Huh pal..\" Chris asks his anger subsiding a bit. As he spoke he poked your nose with his big toe. <br>\r\nYou nod sheepishly still afraid to be smashed like an insect. Chris smiles. \"Well I'll be right back, I got somethin you might like buddy.\"<br>\r\nBefore you could respond the barefoot Chris runs out of the room coming back with a vial of something. Chris steps on your chest, his giant foot occupying most of the torso as he brings himself onto one knee holding the vial of green liquid inches from your face. Something catches Chris's eye however. A small brown dot flashed accross the back ground. Chris growled standing up and running over to the quick dot. The giant muscular foot shot forward dominating the dot below it. Toes and foot worked the creature below them around until finally the creature was held by his toes. It was a mouse.<br>\r\n<br>\r\nYou notice how tiny the mouse looked as it was clenched between the toes of the foot. The foot was easily five times bigger than the mouse. Chris mumbled something to the creature before letting it drop to the ground. Before the animal could retreat the foot dropped down aswell. The small creatures tail poked out from the rim on the giant foot, it flicked a few times as Chris twisted his bare foot working the small furry creature into his sweaty skin. The tail stopped flicking and Chris lifted his foot. Under his heel was the flattened remains of the mouse, stuck via sweat, to the foot. The muscular man walks over to the garbage can not paying mind that the critter is still underfoot. He plants his heel over the can and scrapes downward rendering the cartoonist flat mouse off his sole.<br>\r\n<br>\r\nChris turned back to you with a grin. \"Hey pal, don't you wish you were under my foot? If you like em so much, like isnt that your dream or something?\"<br>\r\nYou give Chris a confused look as he begins to walk toward you. \"No.. well.. yeah but I don't wanna be smashed to death..\" you say fearfully.<br>\r\nChris takes the vial back out of his pocket. \"This shit is a regenerative variant of the T-virus. It was made to shrink parasitic insects like fleas and mosquitos to even smaller sizes so that they could transmit desired genetic material to many hosts without being seen. Strong winds would kill the insects however.. so they put a regenerative gene in it.If you drink this you could shrink to like.. 3-4 inches and be my foot slave. And you don't need to worry about being crushed cuz you'll just regenerate.\"<br>\r\nChris was already opening the vial as you began to reply. \"I.. don't know about this..\"<br>\r\nChris glared at you. \"Pal you were beating off to my boot sweat.. Look either  you play foot slave for me or I'll smash your skull like that mouse. And yes there is a serum for it. I don't got a foot fetish, but having a slave licking, rubbing, and being dominated by my feet sounds pretty good to me.\"<br>\r\n<br>\r\nYou concede by opening your mouth.. you don't have a choice. It looked like Chris was ready to pry your mouth open anyway.</span></div></div>",
            "created":1255064400,
            "id":772644,
            "title":"He was joking and dosn't mind you worshipin..."
        },
        "155312":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Chris is quite interested on what you'd do to feet",
                "Chris pulls out his foot, to tease you with it then hides it, until you get home"
            ],
            "content":"<div class=\"\"><div> <span>After a few minutes Chris came out of the kitchen then changed from his boots to his trainers. \"Hey i'm gonna go to the shops to get some food, you can either stay here and watch tv or come with me, i won't be long anyway\", \"sure i'll come with you Chris, besides i got to tell you something about me but i don't know how to go about it\" instantly after saying this you wanted to die right there and then because you hadn't made your mind up wether or not you wanted to tell Chris about your foot fetish, but now after saying that you know you'll either have to say it or Chris will force it out of you, playfully.<br>\r\n<br>\r\nWhile walking on the street you hoped Chris had forgotten what you said, but even if he didn't,you still have a posstivie feeling, a felling that Chris will accept your fetish, after all he accepted the fact that you where gay after worrying for weeks about it, you were so worried about telling him but when you did you felt so stupid, after all he didn't change his perseption of you, he still saw you as his best friend regaurdless of your sexuality, plus you asked him not to tell any of your other friends, and he has still kept his promise, \"so what is it you wanna tell me man\", finally being pulled out of your own self conscience you looked beside you to see Chris looking down at you, smiling softly and warmly, \"i'm kinda scared that you'll hate me or think i'm a freak, or you'd tell somebody, or\" just before you tried to give another reason Chris put his pale, soft looking palm of his hand inches away from your face, (which gave off a slight odur which was pleasent to you) guesturing for you to stop and let him speak, and in his calmest voice he relaxes you.<br>\r\n<br>\r\n\"Remember when you told me you were gay. I never rejected you did i ?, your still my best friend, i don't care if your gay your still the same person i know, except you prefer to sleep with men, and i didn't see you as my friend because i though you'd sleep with women did i ?, no, your my friend because of your personality, not sexuality, plus i did promise not to tell anyone else and i still, to this day haven't gave them any hint, so don't worry i'll still accept you for who you are, no matter what it is.\" <br>\r\n<br>\r\nStill highly nervous about saying this you finally get the words out \"I ... kinda,,, [gulp] ,,, have a ... kinda fetish Chris\", still making eye contact with you, which is also trying to relax you as his deep eyes have so much kindness and acceptance in them \"and because your gay the fetish you have will involves guys and your scared cause it may or may not involve me, and you don't know if i'll make you vunerable, i promise you, i won't tell anyone, and even if i do laugh, i'll still see you as my best friend\", the tone of his voice creates a sence of understanding within you and it only increases when he hugs you in his big muscely arms, Chris has only hugged you a few times ,after you told him you were gay, he would give you one when you were upset, scared, or even when you asked for one, but you very rarely did as you didn't want to bother him, still being held in his arms \"tell me what your fetish is buddy, don't be afraid, i swear i won't tell anyone else and you'll still be my friend you have my word\", still lying in Chris's hug you put your ear on his chest, listen to his strong heartbeat, enjoy the warmth of his muscles and finally you take a few deep breaths before finally saying it too him.<br>\r\n<br>\r\n\"Chris, i ... have a foot ... fetish ........ i'm into guys ...... feet\", Chris was still hugging you in his big, protective, soft, warm arms and his muscles didn't tense so that was a good sign, and gave you a indication that Chris had no problem with you liking guys feet \"you've saw me barefoot once before did that kinda, you know, turn you on\", not talking as the nerves are getting the better of you as you fear telling him the truth may affect your friendship with him, you simply nod to him, and finally have the strength to whimper out a feeble \"yes\".</span></div></div>",
            "created":1255064400,
            "id":772833,
            "title":"Revealing you secret to Chris"
        },
        "1553122":{
            "choices":[
                "You pick up whatever the object is from the coffee table",
                "Wait for Chris"
            ],
            "content":"<div class=\"\"><div> <span>\"yes...\"<br>\r\nChris remained silent for a moment.<br>\r\n\"Right... Well my opinion still hasn't changed about you.\" he spoke, with no expression. \"Really? Chris... why? Anyone would think I'm a freak...\" Chris looked at you firmly, his expressions tense. \"I told you, you're still the same person i knew before, so my opinion hasn't changed.\"<br>\r\n<br>\r\nChris pulled out his foot, to tease you with it and then hides it, your cheeks becoming a flustered red. \"Funny...\" you laugh, followed by Chris's smirk.<br>\r\n\"Wait here,\" Chris entered the shop, and you wait outside, thoughts of Chris running through your mind. You think hes strange, that hes too kind... anyone would think you are a freak, but he doesn't. And then the thought came to your head, what if hes... your thoughts were interupted by Chris's nudge. \"Lets go.\" You both slowly walk back to the house, wondering where Chris would go from here.<br>\r\n<br>\r\n\"So, I kinda turn you on then... eh?\" Chris asked with a cocked eyebrow.<br>\r\nYou thought for a moment... Thinking of how you would respond with the answer. \"Ermm... No... Kinda.. Yeah...\" you mumbled. Chris slowly nodded, with a smirk. You wonder why he's acting strange, if you told him too much. Chris opens the front door and holds it open for you, and you walk through \"Erm.. Thanks.\" you mumble in a shy way. He shuts the door, \"Sit down, I'll be back in a minute...\" Chris enters the next room, and you follow his command. You relax, and slowly wait for Chris to enter the room. You see something poking under the coffee table...</span></div></div>",
            "created":1259816400,
            "id":800631,
            "title":"Coming clean"
        },
        "15531221":{
            "choices":[
                "You sit, and wait for Chris to say the next word.",
                "You get up and go sit next to Chris."
            ],
            "content":"<div class=\"\"><div> <span>You bend down and pick up the object from under the Coffee table, and to your surprise you see a Homosexual magazine. You can't believe it, thoughts of joy run through your head. He's gay, as you previously suspected. You flick through the pages, naked men with six packs spread across the pages. To your shock, you see Chris standing in the doorway. \"I err.. Erm... just... kinda saw this and...\" you whimper.<br>\r\n<br>\r\nChris's expression remains emotionless, a slight shock on his face.<br>\r\n\"Yeah... I'm gay too.\" Chris sits down on the sofa opposite you and takes off his boots, resting his bare feet on the coffee table, resting his arms behind his head. \"You happy now? I told you... It doesn't make us any different as people.\" It all makes sense now, you think. You try to avoid watching Chris's big, smooth feet rest comfortably on the glass. You gulp, not knowing where to go next.</span></div></div>",
            "created":1259816400,
            "id":800635,
            "title":"You pick up whatever the object is from the cof..."
        },
        "15533":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Martin (Martin Mystery)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more choices still</span></div></span></div>",
            "created":1240722000,
            "id":681851,
            "title":"More choices"
        },
        "155331":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "its been your secret fantasy",
                "try to get another dare"
            ],
            "content":"<div class=\"\"><div> <span>You and Martin go way back to primary, since then you've been the best of friends and still are this day<br>\r\n<br>\r\nYou're both very imature and today you are playing truth or dare, but without the truth option<br>\r\n<br>\r\nFirst you dared Martin to eat a slice of onion<br>\r\n<br>\r\nThen he dared you to lick a worm<br>\r\n<br>\r\nso you dared him to lick your armpits<br>\r\n<br>\r\nMartin did it but he still wanted to out do you with a dare of his<br>\r\n<br>\r\n\"Alright it's my turn now, buddy, since your trying to make me do disgusting things, i'm gonna make yours even tougher to do than mine, i dare you to\" Martin ponders as he scratches his chin trying to think of a tourture even worse than the one you gave him, after a few more seconds he snaps his fingers \"i got it, i dare you to worship my feet for the full day if you can survive from the smell till then\" how'd you feel about this</span></div></div>",
            "created":1246424400,
            "id":717408,
            "title":"Martin (Martin Mystery)"
        },
        "1553311":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Violated and punishes you",
                "Calm and is glad you like them because he likes you playing with them"
            ],
            "content":"<div class=\"\"><div> <span>\"O my god i cant believe it he's really gonna let me do this to him\" of course you didn't say this out loud only in your head<br>\r\n<br>\r\n\"fine i'll do it Martin\" you say in a disgusted manor even though you can't wait <br>\r\n<br>\r\n\"Okay then\" You sit on the floor as Martin sits on the couch you watch him take of his shoe and take a fast glance of his sock before he takes it off<br>\r\n<br>\r\n\"So Martin what am i suppose to do to them for today\" \"well you can do any one or all of them but the coices i am giving you are massaging them, smelling them, llicking em, kissing em and sucking em\"<br>\r\n<br>\r\nyour erection begins as everything you've ever wanted to do to his feet is being allowed by him<br>\r\n<br>\r\n\"Okay thats both my feet bare now, you can start when ready\" you look at them there big and clean looking but already you can smell something in the air, \"my feet are smelly ain't they, i think i'm gonna enjoy this pal\", but so are you as you grab his heel and bring his sole to your face.<br>\r\n<br>\r\nWhen his foot touches your face you feel like you've died as the extreamly smooth flesh gives off a warm heat and a powerfull arousing smell, your hard on become painfull as you fight the urge to jack off, you start to take deep breaths as you crave for his sexy foot odur keeping in mind that he is still watching you, you can't help but  moan when Martin wriggles his suckable toes on your forehead releasing a more arousing odur.<br>\r\n<br>\r\n\"So pal how long have you been attracted to my feet\" \"how'd you...\" \"its okay theres nothing wrong with be aroused by another dudes feet\" \"how long have you known Martin\" \"i just found out a few minutes ago when i saw a erection happening\" <br>\r\n<br>\r\n\"well i first became attracted to them about a year ago, i was staying over night with you, i woke up in the middle of the night and went to the toilet when i came back in i noticed a smell, it was a nice smell so i began to seek out the source, i couldn't find it so i went back to sleep, which was on the ground beside you bed, then a few secondes later you rolled over and you bare foot came out the bed and fell on my face, i loved the smell, so i spent all night smelling them, licking them, even sucking them, i tickled them once or twice only for your foot to retreat back into the covers so i poked my head in to get them, and your foot came back out but as it came out it pushed my face deep into it being caught in the moment i kissed your arch thats when i got hard and knew that i loved them Martin\"<br>\r\n<br>\r\nhow is Martin feeling after being told that <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1246424400,
            "id":717427,
            "title":"its been your secret fantasy"
        },
        "155332":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Shark (A.T.O.M)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>still more</span></div></span></div>",
            "created":1240722000,
            "id":681852,
            "title":"More Choices"
        },
        "1553322":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Hell Yeah",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Trent from Total Drama Island</span></div></span></div>",
            "created":1240722000,
            "id":681855,
            "title":"Other"
        },
        "15533222":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Reed (Fantastic Four)",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>animated series of fantastic four</span></div></span></div>",
            "created":1240722000,
            "id":681857,
            "title":"Nah"
        },
        "155332221":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>okay first of all reed isn't a member of fantastic four <br>\r\nor have super powers<br>\r\n<br>\r\nReed in this story is a human who lives in the countryside and is a farmer he is also young in this about 21, 22 <br>\r\n<br>\r\njust to make it clearer for everybody, the above only applies for the start of the story</span></div></div>",
            "created":1249189200,
            "id":742585,
            "title":"Reed (Fantastic Four)"
        },
        "1553322211":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Talk to him and create a relationship with him ",
                "Remain silent and run away overnight to find your brother"
            ],
            "content":"<div class=\"\"><div> <span>You sit there looking down at the floor occassionaly looking up and seeing more kids leaving with starngers to look after them, its ww1 and all children, including you, have been evacuated to the countryside for safty, you're always shy and quite scared of other people you don't know, usually your big brother would be there for you but he sat beside you until a man decided to take him to care for.<br>\r\n<br>\r\nYour brother fought and protested that he'd have to take you too, but in the end your brother was forced to go and with that you were all on your own, you wern't really a coward but your brother cared for you and protected you after all your parents were abusive towards both of you, you use to spend nights curled up against him in a cupboard in his arms, hugging you, and hugging him as that was the place your parents would lock you in, now without him you were petrified, who knows what person will take you in, mean, cruel, abussive, cold hearted, emotionless, hearless, either way you couldn't think of a single possitive personality, it was only your brother that you trusted.<br>\r\n<br>\r\nWith you still looking at the floor a young man casually dressed comes in and scans the room, he cant help but notice you, the young stranger approaches you but you need not look up, seeing that you are giving no response the stranger bends down and looks at you but you still dont look at his face as it's hanging down so much.<br>\r\n<br>\r\n\"Hey there\" comes in a friendly voice from this stranger \"you okay, huh\" seeing as you are still giving no response he grabs you by the chin gently and tilts you head up softly \"you wanna come home with me, i'll take good care of you i promise\".<br>\r\n<br>\r\nYou finally give him a response and nod to confirm his suggestion \"okay pal i'll go get you registered little guy\", finally gathering all the courage inside yourself you pluck up your bravery and spaek, even if it is quietly \"what's you name mister\", \"huh, oh my name, well i work on a farm so call meeeeeeee ... farm boy\" you tilt your head to the side in confussion, noticing this he says his name \"call me Reed\" after saying his name he holds your hand and walks towards the door and signs your name under his (you have a name tag) \"okay my little friend thats us, come on\" you both walk a long distance making no conversation at all, sure Reed asks questions and trys to start a conversation but you don't answer him, the loss of your older brother is too much for you, only fourty minutes have passed since you last saw him and already you feel like you're going mad \"miss your parents, huh, is that it\" \"no, my brother\", \"Your brother what happened to him\" despite you saying someting to him you took it as an insult when he said you missed your parents after all you hate them, so you had to correct him, but either way he dosn't know how evil they are so your not mad at him, non the less you remain silent again, \"well buddy here we are, your new home, do you like\"</span></div></div>",
            "created":1249189200,
            "id":737434,
            "title":"Continue"
        },
        "15533222111":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "\"Okay\" and puts his bare feet back up",
                "\"Don't, i don't like having me feet touched\""
            ],
            "content":"<div class=\"\"><div> <span>\"i suppose its ...\" the whole world around you began to distort followed by silence and darkness, after a couple of seconds you heard a banging sound then your world was flooded with light as the helment was removed by the real version of Reed, \"dam this hunk of junk, why won't you work\", \"umm Reed whats goin on where are we and whats going on\",\" don't worry your memory loss is only temporary, give it a few minutes to regain what you have forgotten.\"<br>\r\n<br>\r\nYou sat silent watching Reed mess about with the machine, then the memories came flooding in like a tide. Reed was a member of fantastic four, he could strech to amazing lengths, you however, is a helper kind of, Reed tests machines on you to try to get the desired effect, Reed was kind and caring to you and never asked for much apart from, machine testing on you, the latest invention was what Reed called \"Reality 2\", basically virtual reality in which it can fuse with your mind and characters in this second reality can be similar or exactly like the ones in the real reality. <br>\r\n<br>\r\nReed was wearing his casual outfit, so he didn't have his uniform on, he's currently wearing sandles and has his feet proped up on a stool, you approach Reed wanting his feet but fear he may be tempered by it, when you closed in on them he put his heel on the top of one foot and pushed off his sandle and did the same for the other.<br>\r\n<br>\r\nReed made his bare feet stretched a little and flexed his toes, you approach them and grab his right barefoot, heel, imediatley Reed felt you and pulled back, \"what are you doing there buddy\", \"you always work and never rest your feet must be killing you, so you deserve a well earned foot massage by me\".<br>\r\n<br>\r\nhow does Reed react<br>\r\n<br>\r\n<br>\r\n<br>\r\n <br>\r\n </span></div></div>",
            "created":1249966800,
            "id":742668,
            "title":"Talk to him and create a relationship with him "
        },
        "155332221111":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Rub it",
                "Reed's streches his foot"
            ],
            "content":"<div class=\"\"><div> <span>Reed made his bare feet stretched a little and flexed his toes, you approach them and grab his right barefoot, heel, imediatley Reed felt you and pulled back, \"what are you doing there buddy\", \"you always work and never rest your feet must be killing you, so you deserve a well earned foot massage by me\".<br>\r\n<br>\r\n\"Okay\" Reed said and put his bare feet back up on the stool, \"you know, i'm kinda excited 'bout this, never had my feet massaged before, i know this foot rub will feel great,  but won't rubbing my feet gross you out\",\"no, to me theres nothing gross about rubbing your feet Reed after all its just skin\", \"yeah, skin that smells afully bad at times, don't do this if you don't wanna\", \"i don't care how smelly your feet get Reed or how stinky your tired bare feet are, i wanna do this for you, so just relax and enjoy this, you deserve a a long foot massage session, i don't care how much my hands smell like your feet, i've smelt worse than your stinky feet.\" <br>\r\n<br>\r\nIt was a lie, this was the strongest smell ever to enter your nose but you enjoyed Reed's scent coming off his feet and you couldn't wait until you could feel them and smell your hands, which smell like his feet later, but right now you were trying to controll the urge to rub your own face in them<br>\r\n<br>\r\nFinishing this you grab Reed's foot and</span></div></div>",
            "created":1249966800,
            "id":743137,
            "title":"\"Okay\" and puts his bare feet back up"
        },
        "155332222":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Altier (Assasin's Creed)",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about this guy</span></div></span></div>",
            "created":1240722000,
            "id":681858,
            "title":"Others"
        },
        "1553322222":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Alex Shepherd (Silent Hill : Homecoming)",
                "NO"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well maybe him.</span></div></span></div>",
            "created":1243141200,
            "id":696418,
            "title":"How About"
        },
        "15533222221":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Alex comes back in",
                "You go and try to find Alex to get help"
            ],
            "content":"<div class=\"\"><div> <span>\"So thanks for driving me\" Alex Shepherd says to you. He's in the seat of your car as you drive him over to his house. Now that Alex's problems were all over he had brought a house in your town.<br>\r\n<br>\r\n\"Hey, no problem.\" You say back. \"That's what neighbors are for.\"<br>\r\n<br>\r\nHe grins and notices that your car had arrived outside both of your houses. \"Well thanks anyway.\" He says again and you brush it off. \"Hey, wanna come in?\" Alex says all of a sudden.<br>\r\n<br>\r\n\"Uhh, sure.\" You say before turning off your engine. Then you follow him into his house.<br>\r\n<br>\r\nThe inside his house is large and well furnished. You take a seat on the sofa while Alex goes and takes a quick shower. <br>\r\n<br>\r\nThen all of a sudden you see a large piece of plastic on the coffee table. Out of curiosity you touch it and instantly shrink, falling on the coffee table...</span></div></div>",
            "created":1243141200,
            "id":696448,
            "title":"A Shrinking Welcome"
        },
        "155332222212":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "You do and land on the socks",
                "Oh no! You don't!"
            ],
            "content":"<div class=\"\"><div> <span>Uh oh. This definitely wasn't good. You needed Alex's help. And fast! But there was no way of getting off the coffee table. Peering off the side you can see that it was a long way down and there was no way you would survive the drop onto Alex's floor. Alas all your chances of trying to get Alex was destroyed.<br>\r\n<br>\r\nHowever, you spot on the ground nearly, Alex's silk black socks that he took off before heading to the shower. They were a little bit far off but maybe you could reach it. Then again there was the chance of you not reaching it all falling on Alex's floor. <br>\r\n<br>\r\nWell, after a few minutes of consideration, you decide to do it. After all it was his socks. Their smell was reaching you from down there and you just wanted to crawl in them. So you back up 20 spaces to the other edge of the coffee table and take a running dash forward. Do you make it?</span></div></div>",
            "created":1243141200,
            "id":696699,
            "title":"The Sock Cushions"
        },
        "15533222222":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Ya! I love Death Note!",
                "Are you kidding me?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well how about some Death (Note).</span></div></span></div>",
            "created":1243141200,
            "id":696596,
            "title":"Snippy Aren't Ya?"
        },
        "155332222221":{
            "choices":[
                "Light? ",
                "Or..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You choose Death Note! But who from Death Note?</span></div></span></div>",
            "created":1341032400,
            "id":1369788,
            "title":"Ya! I love Death Note!"
        },
        "1553322222212":{
            "choices":[
                "L'S FEET!",
                "Someone else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you want to worship L's feet?</span></div></span></div>",
            "created":1341032400,
            "id":1369789,
            "title":"Oooooor L?"
        },
        "15533222222122":{
            "choices":[
                "Yeah, Near!!",
                "Nope, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Near the someone else you were thinking of? Cause I was. </span></div></span></div>",
            "created":1341032400,
            "id":1369790,
            "title":"Someone else!"
        },
        "155332222221221":{
            "choices":[
                "Take the other sock off and begin to worship both feet",
                "Pull your pants off and rub his left foot on your dick"
            ],
            "content":"<div class=\"\"><div> <span>  Good choice. <br>\r\n<br>\r\n  Near is working on an incredibly hard case that, of course, no one else on the planet would be able to solve. It's sorta disheartening to think about all that crazy stuff that goes on, and no one aside from Near has much of a hope to figure out who did what, how, when, where, why....all that. That's why you hold your friend Near in such high regard. He's the more intelligent human being on the planet (at only 12 years old!), no one else can do what he does, and he has a crazy level of focus. And that focus is your favorite thing about him.<br>\r\n<br>\r\n  You learned something a few weeks ago, after an afternoon at the chess club you and Near are a part of (you honestly don't know why he even bothers with this, no one can come close to beating him.) he invited you over to his place (with his security's permission) because he had taken a liking to you. He isn't the best conversationalist, but you like him too so you accepted the offer and spent a somewhat normal couple of hours with him in his private room. You had dinner, played some chess, some video games, and then he has some work to do but invited you to stay and do homework from your school there with him, he'd answer any questions you had. So you stayed, and this became a routine. After chess, every Tuesday and Thursday, you'd do homework on the ground next to Near's desk, where he sat in a very expensive looking swivel chair working on whatever case he was needed to solve.<br>\r\n<br>\r\n  After a good few months of slowly getting to know each other (there isn't another speed for that with Near) you one day couldn't control yourself as you laid on the floor next to him. Your face was right next to his feet for a few hours two days a week, and today you started to cautiously rub his feet. In the first few months you've snuck a few touches here and there, and are always close enough to smell his size 6 feet, always wearing those white socks. They always smelled so intoxicating, but you've had just enough strength to resist going crazy with his feet, until now. Now, as you're caressing his feet. <br>\r\n<br>\r\n As you pressed your fingers through his socks onto his soft feet, rubbing them around, Near didn't so much as twitch. You weren't even sure if he noticed, though he had to. You had totally ditched the homework and were now giving your full attention to rubbing the tops of his feet, and breathing in the smell of them. However, Near still didn't say or do anything, until about 5 minutes into it when he moved the position of his legs from having both feet planted flat on the floor to crossing his right behind his left, so the bottom of his left foot was open for business. Or, at least, that's how you took it. You started rubbing the bottom of his left foot, massaging it deeply and getting very excited, something you hoped Near didn't notice either. <br>\r\n<br>\r\n  Then, you decided to go for it, and you slid your fingers up his pant leg a bit to grab the top of his sock, and pull it off. His foot was bare, and as you looked up at him he was giving his full attention to whatever was on those papers he was studying. You grabbed his bare left foot with both of your hands and pressed it in your face, taking the biggest whiffs of his foot you've ever taken. You wiggled your nose in his toes, rubbed his sole over your face, and even started to suck on his big toe. After one good suck, though...you spoke up.<br>\r\n<br>\r\n  \"Near?\"<br>\r\n<br>\r\n  \"Hmm?\" Near hardly let out...you weren't totally sure he'd even acknowledged you. But, you decided that he did.<br>\r\n<br>\r\n  \"So...I hope you don't mind that I...\"<br>\r\n<br>\r\n  \"No it feels good, do whatever, I don't mind.\"<br>\r\n<br>\r\n  You already were experiencing this, but a verbal confirmation took you back a little. <br>\r\n<br>\r\n  \"Really? Like...I can do whatever I...\"<br>\r\n<br>\r\n  \"Whatever you want with my feet, it feels good, I could use this. I'm glad you are doing this.\" He said, sticking his big toe against your lips, which you opened, and he fed his toe to you again, sliding it in and out, as your sucks and licks got longer and bigger. <br>\r\n<br>\r\n  This is what you learned that night about his focus, how you can do whatever you want with his feet and he won't stop you. So, on this day, you are on the floor under his desk in the exact same scenario as the one I told you about. His left sock is off, and you've been licking his left foot that he stuck in your mouth. Now, you...</span></div></div>",
            "created":1341032400,
            "id":1369802,
            "title":"Yeah, Near!!"
        },
        "155332222222":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "yeah",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>someone from bleach</span></div></span></div>",
            "created":1243486800,
            "id":698527,
            "title":"Are you kidding me?"
        },
        "1553322222222":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "okay",
                "no thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the mummy animated series</span></div></span></div>",
            "created":1243486800,
            "id":698528,
            "title":"next"
        },
        "15533222222221":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Rick",
                "Alex"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which animated character but</span></div></span></div>",
            "created":1243486800,
            "id":698529,
            "title":"mummy animated"
        },
        "15533222222222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Edward Elric from Fullmetal Alchemist?</span></div></span></div>",
            "created":1246338000,
            "id":716943,
            "title":"Ed"
        },
        "155332222222222":{
            "choices":[
                "Sora",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sora from Kingdom Hearts?S</span></div></span></div>",
            "created":1246338000,
            "id":716946,
            "title":"No"
        },
        "1553322222222221":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "You realize where you are when...\"something\" enters your prison from above",
                "Shockingly, you see Sora's smiling face through the opening above"
            ],
            "content":"<div class=\"\"><div> <span>What? Where were you? You look up. It was almost completely dark, expect for some light that shone through an opening above you. It still took a while though, for your eyes to adjust to the dim light. <br>\r\n<br>\r\nWhen your eyesight has been returned to normal, you realize that the \"walls\" seem to be all around you, and looked as if they were made of large pieces of cloth. You try to stand up to feel the walls, but end up falling into a puddle of salty liquid. <i>Why is the ground so wet?</i> You think, <i>And so....soft?</i><br>\r\n<br>\r\nIndeed, the ground was soft, and extremely wet. It was like a big sponge, and once you tried to push your hand into it, a small puddle of the strange liquid formed around it. And where was that strange smell coming from? It was intoxicating though, and you felt like you wanted more.<br>\r\n<br>\r\nBut still. You couldn't just lie here on the ground, smelling that strange smell. You had to figure out where you were, and how you got here. <br>\r\n<br>\r\nLooking up, you realize that the only escape through your prison is through that strange round hole above you .It was quite large, and you definitely would be able to climb through it..but if only you could actually reach that exit.<br>\r\n<br>\r\nThen all of a sudden, your escape thoughts are interrupted by a startling shaking. It seemed like an earthquake, only the ground wasn't shaking. Instead, you felt like your prison was being moved, and then lifted. What was going on? <br>\r\n<br>\r\n</span></div></div>",
            "created":1246338000,
            "id":716962,
            "title":"What Is Going On?"
        },
        "15533222222222212":{
            "choices":[
                "A Socked Foot",
                "A Sweaty Bare Foot"
            ],
            "content":"<div class=\"\"><div> <span>You then see the face of a boy you recognize from somewhere. His names right on the tip of your tongue....<br>\r\n<br>\r\n<br>\r\n\"Hi! I'm Sora! If you're wondering where you are you're in my shoe! Smell nice? Ha ha ha!\" He laughed as you realized who he was and where you were....with increasing horror. How....is this possible? Why are you in some video game kid's stinky shoe!? Sora sees you are scared and frowns a little, <br>\r\n<br>\r\n\"Aww...don't be scared little man....You should be honored...You'll be the very first ever shrunken person to experience what it's like to smell a foot at a mouse's size! And it's my foot, so it's extra stinky and sweaty! Make sure you get your face in between my toes and lap up all my cheese and crud! Ha ha ha ha ha!\" His face disappears...to be replaced with...</span></div></div>",
            "created":1246338000,
            "id":716970,
            "title":"Meeting Sora"
        },
        "1553322222222222":{
            "choices":[
                "Riku",
                "Someone Else Please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Riku from Kingdom Hearts?</span></div></span></div>",
            "created":1246338000,
            "id":716947,
            "title":"Riku"
        },
        "15533222222222221":{
            "choices":[
                "Strips his socks off",
                "Places a foot on your face"
            ],
            "content":"<div class=\"\"><div> <span>You were wandering around on your island home. Destiny Islands to be precise. When you decided to go visit your neighbor: Riku. He was lounging around in a hammock with his arms behind his head. \"Hey there.\" He greeted you as you came over. You greeted him back and sat down on the ground next to the hammock. You always had had a bit of a foot fetish, and him and Sora were your secret fantasy boys when it came to feet. You found yourself staring at his shoes, Riku caught you staring, even though you quickly looked away. <br>\r\n<br>\r\nRiku smirked as an idea came to his mind. \"Awww man...My feet are soooo sore today.\" He said leaning down and holding his shoe'd left foot. \"Would you mind um...\" Riku pretended to be embarrassed. You cocked your head to the side, \"What is it Riku?\" You asked.<br>\r\n<br>\r\n\"Well um.....Giving me a foot massage...\" He muttered. You tried to hide your excitement as you said, \"Um....Okay.\" <br>\r\n<br>\r\nRiku then leaned down and began to take off his shoes. \"I've gotta warn ya though, My feet are probably swimming in sweat by now....And ya know what that means?\" Riku pinched his nose and fanned the air jokingly. You tried to hold back your erection at this kind of talk. <br>\r\n<br>\r\n\"I have some of the smelliest feet imaginable....Sora can never last my feet for more than a few seconds....\" He said finally getting the shoe which was glued to his foot, off. He sighed as he wiggled his socked toes, his sock was a dingy gray and you immediately noticed the rank odor. You noticed that there was a hole where Riku's big toe was sticking out of the sock. It wiggled and flexed. <br>\r\n<br>\r\nAfter the other shoe was off and lain to his side on the hammock with the other shoe, Riku....</span></div></div>",
            "created":1246338000,
            "id":716960,
            "title":"Riku"
        },
        "155332222222222211":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "All of a sudden, you come right in front of Riku",
                "Riku then tells you to use your tounge...."
            ],
            "content":"<div class=\"\"><div> <span>Riku looked up at you and spoke. \"You can't really give a proper foot massage when there's socks on.\" He wiggled his toes in front of your face. Instantly, you harden and blush slightly. \"Can ...you take them off for me? My arms have no energy left...\" Riku pretended to be extremely tired and leaned back on the hammock. <br>\r\n<br>\r\nWithout hesitation, you reached forward and pulled off Riku's socks. Sneaking a glance at Riku, you notice that his eyes were closed and he wasn't watching you. Quickly you pulled both pairs of socks towards your face and smelled them. The smell was amazing. It instantly sent you into a full hardon. Never had you smelled anything like Riku's foot odor. You could just imagine what Riku's actual feet smelled like. Then you snapped out of your daydream. Why imagine? Riku's sexy feet were right in front of you!<br>\r\n<br>\r\nYou threw the socks on the ground. \"What are you waiting for?\" Comes Riku's voice. You mumbled something back, as to not sound or look eager. \"Uhh..ya..okay.\" Riku sighed and leaned back again, eyes closed.<br>\r\n<br>\r\nFull of anticipation, you grab Riku's left foot gently with both of your hands. The sweat makes your hands slide a little, but you hold on steady. Then you start working your hands on Riku's foot. A sigh escape both of you at the same time (Riku didn't notice yours). You rub Riku's foot more, sneaking in smells whenever you can. Your cock is in total pleasure as you slide your hands all over Riku's sexy feet....</span></div></div>",
            "created":1246338000,
            "id":716983,
            "title":"Barefoot"
        },
        "1553322222222222112":{
            "choices":[
                "Riku Wants You To Lick His Toejam Out ",
                "Riku Wants You To Suck On His Toes"
            ],
            "content":"<div class=\"\"><div> <span>\"Mmmmm that feels good! Hope they don't smell too nasty.\" He said from his hammock. \"Not at all!\" You say while sneaking a whiff of his cheesy smelling feet. \"Then....You wouldn't mind using your tongue to clean them off a bit would you?\" He says pretending to be embarrassed. You pretend to hesitate a little, then nod. He grins and puts his sweaty bare feet in your face.<br>\r\n <br>\r\n\"You can start now.\" He says. You stick out your tongue, and give his sole it's first worshiping lick. It tastes salty, but what do you expect from a teen boy who probably hasn't bathed today. His foot jerks at your tongue's touch, but then relaxes as he sighs in contentment. \"Ahhh....That feels nice, Your tongue feels cool on my hot feet.\" He says flexing and wiggling his big toes. <br>\r\n<br>\r\nYou get hard again, and lick his soles once more. <br>\r\n<br>\r\n</span></div></div>",
            "created":1246338000,
            "id":717024,
            "title":"Riku then tells you to use your tounge...."
        },
        "15533222222222222":{
            "choices":[
                "Roxas",
                "Enough with the Kingdom Hearts characters!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Roxas from Kingdom Hearts II?</span></div></span></div>",
            "created":1246338000,
            "id":716953,
            "title":"Someone Else Please"
        },
        "155332222222222221":{
            "choices":[
                "Start sniffing his cheesy socks",
                "Refuse to go anywhere near the rank feet"
            ],
            "content":"<div class=\"\"><div> <span>After a long game of baseball, you and Roxas head back to your house to relax a little. Roxas is unaware of your foot fetish and  how you watch his feet whenever theyre out of his giant size 14 shoes. When you get to your house,  you both go into your room to watch some tv. before you can turn it on, Roxas locks the door to your room and gives you a malicious grin. You ask whats going on but Roxas walks over to your bed, grabbing you by the hair on the way and pushes you to the foot of it.<br>\r\nHe lays down and kicks off his gigantic shoes, both leaving a thud sound as they hit the floor. Immediately the room is filled with the noxious odor of Roxas' sweaty socks.<br>\r\n\"whats going on?\" you ask.<br>\r\n\"Nothing, im just doing what youve always wanted. Ive seen the way you look at my feet when were at the beach or relaxing at home.\"<br>\r\nYoure completely shocked as Roxas shoves one of his sweaty socks in your face. immediately the foul odor hits  your nose as he presses his sole into it, the damp fabric leaving a rank smell on your face.<br>\r\n\"Well? are you going to get started or not?\" Roxas asks?</span></div></div>",
            "created":1252126800,
            "id":755961,
            "title":"Roxas Knows Your Secret"
        },
        "1553322222222222212":{
            "choices":[
                "Roxas takes off his sock and forces you to suck on his feet",
                "Roxas shrinks you down to size"
            ],
            "content":"<div class=\"\"><div> <span>\"are you kidding? Those things are rank! im not going anywhere near them!\" you say, trying to hide your excitement.<br>\r\n\"Oh, yea you are, even if i have to make you!\" Roxas replies, smiling evilly.<br>\r\nWith that, he gets up off your bed and pushes you to the ground next to the bed. He sits on the bed and shoves both of his rank socks on your face. The awful odor is intensified with the other foot and you can hardly breathe.<br>\r\nRoxas clamps your nose with his socked toes, forcing you to breathe through your mouth, all the while shoving his other socked toes into it. The horrid taste of his toes is noxious. You try to scream but Roxas keeps pumping his toes in and out of your mouth so you suck out all of the sweat from his sock.<br>\r\n\"Wow, my socks smell awful from up here. I cant imagine how nasty and smelly they are for you, little slave!\" Roxas laughs. <br>\r\nHe brings one of his size 14 shoes up to his nose and takes a deep whiff.<br>\r\n\"Oh wow. These might even be worse than the socks!\"<br>\r\nGrabbing a piece of string, Roxas ties the shoe to your face, covering both your nose and your mouth, forcing you to breathe in his stinky foot sweat.<br>\r\n\"hahaha, enjoying my stink slave?\" He chuckles.<br>\r\n\"well then, i guess youre ready for more...\"</span></div></div>",
            "created":1252818000,
            "id":759803,
            "title":"Do not deny Roxas"
        },
        "15533222222222222121":{
            "author_id":"dayday",
            "author_name":"C",
            "choices":[
                "To get a footjob!",
                "To get company. (Invites Hayner over)"
            ],
            "content":"<div class=\"\"><div> <span>Roxas unties the shoe from your face and before you are able to complain roxas shove his toes in your mouth.'' Suck my toes and I probably I'll be much more easier on you. As you hear that you start sucking with all your might.'' ''Oh god yes that's the spot! Suck harder bitch.'' Roxas says moaning with much sexual arousement. After a few hours of sucking his toes. He pulled back and said, \"know it is time to</span></div></div>",
            "created":1301202000,
            "id":1077003,
            "title":"Roxas takes off his sock and forces you to suck..."
        },
        "155332222222222222":{
            "author_id":"meatman",
            "author_name":"Footfetish",
            "choices":[
                "Sure!",
                "Nah, there's got to be someone else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Gohan?</span></div></span></div>",
            "created":1247374800,
            "id":723109,
            "title":"Alright, let's do something diferent"
        },
        "1553322222222222221":{
            "author_id":"meatman",
            "author_name":"Footfetish",
            "choices":[
                "Sayain/Frieza saga",
                "Another saga"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, which Gohan?</span></div></span></div>",
            "created":1247374800,
            "id":723112,
            "title":"Sure!"
        },
        "15533222222222222211":{
            "author_id":"meatman",
            "author_name":"Footfetish",
            "choices":[
                "Saiyan Saga",
                "Frieza Saga"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>alright, which one?</span></div></span></div>",
            "created":1247374800,
            "id":723254,
            "title":"Sayain/Frieza saga"
        },
        "155332222222222222111":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Let's go",
                "Last chance to pick anoher Saga"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The saga that kicked of Dragon Ball Z<br>\r\n<br>\r\nSo many great options</span></div></span></div>",
            "created":1493960400,
            "id":2315188,
            "title":"Saiyan Saga"
        },
        "1553322222222222221111":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Goku it is",
                "another option"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First choice, would have to be Goku </span></div></span></div>",
            "created":1493960400,
            "id":2315189,
            "title":"Saiyan Saga characters"
        },
        "15533222222222222211112":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes please",
                "No, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Kid Gohan?</span></div></span></div>",
            "created":1493960400,
            "id":2315190,
            "title":"Kid Gohan?"
        },
        "155332222222222222111122":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Piccolo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Piccolo</span></div></span></div>",
            "created":1493960400,
            "id":2315191,
            "title":"No, someone else"
        },
        "1553322222222222221111222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Tien it is ",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How abut Tien Shinhan</span></div></span></div>",
            "created":1493960400,
            "id":2315192,
            "title":"Tien?"
        },
        "15533222222222222211112222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes, Krillin ",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, what about Krillin ?</span></div></span></div>",
            "created":1493960400,
            "id":2315193,
            "title":"Krillin"
        },
        "155332222222222222111122222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yamcha or Chiaotzu",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yamcha or Chiaotzu ?</span></div></span></div>",
            "created":1493960400,
            "id":2315194,
            "title":"Someone else"
        },
        "1553322222222222221111222222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Raditz ?",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some bad guys. <br>\r\n<br>\r\nRaditz ?</span></div></span></div>",
            "created":1493960400,
            "id":2315195,
            "title":"Someone else"
        },
        "15533222222222222211112222222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Vegeta or Nappa",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Vegeta and Nappa?</span></div></span></div>",
            "created":1493960400,
            "id":2315196,
            "title":"Vegeta or Nappa?"
        },
        "155332222222222222111122222221":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Vegeta",
                "Nappa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who do you choose<br>\r\n<br>\r\nVegeta<br>\r\n<br>\r\nor <br>\r\n<br>\r\nNappa</span></div></span></div>",
            "created":1493960400,
            "id":2315197,
            "title":"Vegeta or Nappa"
        },
        "155332222222222222112":{
            "author_id":"meatman",
            "author_name":"Footfetish",
            "choices":[
                "Gaint Gohan smiling down on you",
                "A concerned Gohan, wondering if your alright"
            ],
            "content":"<div class=\"\"><div> <span>It was just an average day and you were watching your favorite show, Dragon Ball Z. Is was a filler episode, this one was only staring Krillin, Bulma and your personal favorite character in the show, Gohan.  Then all of the sudden a white flash blasts out from the scene and you pass out.<br>\r\n<br>\r\nWhen you come to, you see a......</span></div></div>",
            "created":1247374800,
            "id":723310,
            "title":"Frieza Saga"
        },
        "1553322222222222222":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "sounds good to me",
                "maybe later"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Someone from the Final Fantasy universe</span></div></span></div>",
            "created":1268110800,
            "id":848543,
            "title":"Nah, there's got to be someone else!"
        },
        "15533222222222222221":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Snow Villiers (aka Mr33)",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>okay here we go then, lets start with my favourite guy</span></div></span></div>",
            "created":1268110800,
            "id":848544,
            "title":"sounds good to me"
        },
        "155332222222222222211":{
            "author_id":"tiplay",
            "author_name":"neon 147",
            "choices":[
                "Normal size",
                "Small"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you want to be note - you cannot change the size </span></div></span></div>",
            "created":1268110800,
            "id":848546,
            "title":"Snow Villiers (aka Mr33)"
        },
        "155332222222222222212":{
            "author_id":"nolanuchiha",
            "author_name":"Nolan Hewitt",
            "choices":[
                "oh hell yeah",
                "ah hell nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about this handsome hunk</span></div></span></div>",
            "created":1485061200,
            "id":2267406,
            "title":"Goku"
        },
        "15533222222222222222":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the green Original yoshi?</span></div></span></div>",
            "created":1273986000,
            "id":883974,
            "title":"Maybe Yoshi?"
        },
        "155332222222222222221":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "A Yoshi saves you",
                "The Bullet Bill hits you knocking you unconscious"
            ],
            "content":"<div class=\"\"><div> <span>You woke up to find yourself standing on a green field with floating Question Blocks and walking goombas. Before you get to your senses suddenly a Bullet Bill comes chasing towards you. You sprint hoping that it won't catch up to you but it just keeps coming towards you...</span></div></div>",
            "created":1289970000,
            "id":995307,
            "title":"Yes"
        },
        "1553322222222222222212":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "4hrs",
                "2days"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How long were you knocked out for?</span></div></span></div>",
            "created":1529609580,
            "id":2510357,
            "title":"The Bullet Bill hits you knocking you unconscious"
        },
        "15533222222222222222121":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "his home",
                "a secret room in peach's castle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where did the yoshi take you after he found you?</span></div></span></div>",
            "created":1536643920,
            "id":2546081,
            "title":"4hrs"
        },
        "155332222222222222221211":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Maybe just one sniff...",
                "Those shoes could use a little cleaning...",
                "Oops! The Yoshi that rescued you has walked in!"
            ],
            "content":"<div class=\"\"><div> <span>After being knocked out by a bullet bill, you remained unconscious for a few hours, Fortunately for yourself, your green saviour rescued you and took you in to his small cottage in the deep forest to protect you from the roaming predators of Bowser's army.<br>\r\n<br>\r\nHours eventually passed and soon enough, you woke up on a large comfy bed, and immediately found your surroundings to be majorly different from when you last remembered. You yawned, feeling rested but with a minor headache, and jumped off the bed. Rubbing and massaging your forehead, you tried to recollect your memories of the moments before you got here.<br>\r\n<br>\r\nAs you struggle, your mind subconsciously diverts its attentions towards the discarded orange shoes on the ground, just laying there, a familiarity of it tingling in your brain.<br>\r\n<br>\r\n<i>\"Wait.. aren't those Yoshi's shoes?\"</i> you think out loud, <i>\"I know I was hit by a bullet bill but did Yoshi save me?\"</i><br>\r\n<br>\r\nMemories were flooding in now but a more important issue was at foot! You pick up one of the shoes and inspect it. They definitely are well worn but you do like feet, so it was an opportunity for you!<br>\r\n<br>\r\nThose shoes seemingly inviting you to take a sniff. They look worn out and dirty too on the inside so maybe they need a little cleaning... with your tongue.</span></div></div>",
            "created":1536766980,
            "id":2546754,
            "title":"Home?"
        },
        "155332222222222222222":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "yes ",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about someone from phineas and ferb</span></div></span></div>",
            "created":1289538000,
            "id":992517,
            "title":"No"
        },
        "1553322222222222222222":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about someone from rocket power</span></div></span></div>",
            "created":1289538000,
            "id":992518,
            "title":"no"
        },
        "15533222222222222222222":{
            "author_id":"artilamaster",
            "author_name":"Banana Boat",
            "choices":[
                "Yes hot !",
                "Ew Dante"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Dante from Devil May Cry?</span></div></span></div>",
            "created":1305608400,
            "id":1107528,
            "title":"Some Devil May Cry"
        },
        "155332222222222222222222":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Chris Thorndyke (from Sonic X). I know it sounds perverted but I might be adding to this one lol.</span></div></span></div>",
            "created":1307422800,
            "id":1121329,
            "title":"Sonic X"
        },
        "1553322222222222222222222":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Yes!",
                "No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I haven't seen a movie character yet so you want a movie character's feet?</span></div></span></div>",
            "created":1314334800,
            "id":1175852,
            "title":"A Movie Character?"
        },
        "15533222222222222222222221":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Yeah sure.",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about \"Yankee Irving\" from that movie, Everyone's Hero?</span></div></span></div>",
            "created":1314334800,
            "id":1175862,
            "title":"Good!"
        },
        "155332222222222222222222212":{
            "choices":[
                "Great Choice ",
                "More ...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about The boy from the movie ... \"The Sixth Sense\"   ?</span></div></span></div>",
            "created":1456117200,
            "id":2108007,
            "title":"no"
        },
        "1553322222222222222222222122":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Giant blue monster feet, heck yeah",
                "No thanks, anyone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lets get into some Disney-Pixar<br>\r\n<br>\r\n<br>\r\nSully from Monster's Inc</span></div></span></div>",
            "created":1507611600,
            "id":2399522,
            "title":"More ...."
        },
        "15533222222222222222222221222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "now that is what i am talking about",
                "naaaaah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about his one eyed bud<br>\r\n<br>\r\nMike Wazowski </span></div></span></div>",
            "created":1507611600,
            "id":2399524,
            "title":"No thanks, anyone else?"
        },
        "155332222222222222222222212222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Yes!",
                "NO!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Andy from Toy Story (1-2 or 3)</span></div></span></div>",
            "created":1507611600,
            "id":2399527,
            "title":"naaaaah"
        },
        "1553322222222222222222222122222":{
            "author_id":"hunky",
            "author_name":"LucasFan17",
            "choices":[
                "Yeah!",
                "No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about dash parr from the incredibles? </span></div></span></div>",
            "created":1536581700,
            "id":2545711,
            "title":"NO!"
        },
        "15533222222222222222222222":{
            "author_id":"packman4life",
            "author_name":"The13thMember",
            "choices":[
                "Yes!!",
                "No, someone else please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about being at the feet of the 11 year old flame headed boy, Johnny Test?</span></div></span></div>",
            "created":1366434000,
            "id":1575174,
            "title":"Johnny Test?"
        },
        "155332222222222222222222221":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "He literally runs into you...",
                "At school..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you meet Johnny?</span></div></span></div>",
            "created":1459573200,
            "id":2126841,
            "title":"Yes!!"
        },
        "155332222222222222222222222":{
            "author_id":"joshuaaa431",
            "author_name":"black tiger",
            "choices":[
                "god yes",
                "NO DX"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about rider from fate zero<br>\r\n<a rel=\"nofollow\" href=\"https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcRzmxcMRLQkXKY7yzJePSw90L_m8tUksRuCJRfjYdllNUG1A3tvkw\" target=\"_blank\">https://encrypted-tbn3.gstatic.com/image...</a><br>\r\na strong hard working must have some pretty nice big feet ;)</span></div></span></div>",
            "created":1368680400,
            "id":1591151,
            "title":"at the king's feet"
        },
        "1553322222222222222222222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Digimon's Veemon feet?</span></div></span></div>",
            "created":1369544400,
            "id":1596935,
            "title":"The digimon's feet"
        },
        "15533222222222222222222222221":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Sticking with Veemon",
                "Eh,Show me the other digimon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Veemon or some other digimon?</span></div></span></div>",
            "created":1369544400,
            "id":1596937,
            "title":"Yes"
        },
        "15533222222222222222222222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Regular Show?</span></div></span></div>",
            "created":1369544400,
            "id":1596936,
            "title":"No"
        },
        "155332222222222222222222222221":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "A bluejay bird, looking at you. (Mordecai)",
                "A brown raccoon, staring at you. (Rigby)",
                "Another character."
            ],
            "content":"<div class=\"\"><div> <span><i>Because everyone loves choice chapters!</i><br>\r\n<br>\r\nIt all started on a relaxing weekend off. With your friends all off on their own vacations somewhere in the world and your family busy with their daily chores, you finally had the day off, with no-one to bother you. A few days prior, you were trying to decide where to go when the free Saturday came up. It took a while but you narrowed it down to either the park or the mall. You checked your wallet, glancing at the tiny amount of money you kept, you realize you needed to save some money. You crossed out the mall in your head and made your plans to go to the park. It was just a regular park after all which was also free coincidently.<br>\r\n<br>\r\nAnd now, today was finally the day. It was a Saturday and you sighed as you walked towards the park entrance. After a few lonely and harsh work-days at work on the weekdays, you could finally smile, knowing you have a lot of free time. Instead, you keep a neutral expression on your face, looking to preserve your energy for the long day ahead.<br>\r\n<br>\r\nAfter walking around the grassy area for a few minutes, you find a perfectly placed wooden bench, sitting under the shade of an oak tree. Satisfied, you sit down on it and close your eyes, lightly drifting off into your happy thoughts. You relax for a few minutes, taking in the sweet smell of city nature. Fresh grass invaded your nostrils.<br>\r\n<br>\r\n\"Hey, can I help you?\"<br>\r\n<br>\r\nYour thoughts are suddenly interrupted as you open your eyes. Looking up, you see...</span></div></div>",
            "created":1459659600,
            "id":2127007,
            "title":"Regular Beginnings"
        },
        "1553322222222222222222222222212":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "\"We can come to my room in the Park!\"",
                "\"I can invite Eileen over!\"",
                "\"I can invite Mordecai over!\""
            ],
            "content":"<div class=\"\"><div> <span>You slowly open your eyes to the sight of a brown raccoon, staring at you weirdly. You blink a couple of times, to make sure you're really not dreaming.<br>\r\n<br>\r\n\"Excuse me?\" the brown raccoon snapped his fingers quite loudly, \"Can you hear me?\"<br>\r\n<br>\r\n\"Yeah, I can hear you alright,\" you hastily respond, as you get up from the grassy floor, \"And I don't need your help.\"<br>\r\n<br>\r\nYou started to walk away from where you were sitting but he starts to follow you as a result, \"C'mon, are you sure? I can show you around the place, I can take you to the toilets, I can even...\"<br>\r\n<br>\r\nAt this point, you realized how desperate he is at helping you and you were growing a bit suspicious.<br>\r\n<br>\r\n\"Why exactly do you want to help me so bad?\"<br>\r\n<br>\r\nThe raccoon froze in his tracks, trying to come up with a probable reason. At this point, you start to notice a name-tag on the animal's body, reading the word \"Rigby\". He must work here.<br>\r\n<br>\r\nYou turn to face him, looking directly into his eyes, \"Rigby, do you work here?\"<br>\r\n<br>\r\n\"U-uh... no,\" Rigby lies unconvincingly, \"I just really want to help people out!\"<br>\r\n<br>\r\nRigby flashed a fake smile, hoping you would buy it. Unfortunately for him, you're not a gullible person and you see straight through him.<br>\r\n<br>\r\n\"Okay, fine!\" Rigby loses it, \"I made a bet with my friend Mordecai to see who can get a compliment from one of the feedback forms first.\"<br>\r\n<br>\r\nYou sigh, feeling sorry for him to a certain degree. You remember the time in primary school where you made a friendly charity.<br>\r\n<br>\r\nYou think for a few moments, pondering on what to do. While you think, you make your way over to one of the nearby wooden benches, a few metres away from the main footpath. You and Rigby proceed to sit down on the bench. After turning your head around, making sure no-one else but Rigby is around, you start to talk to Rigby.<br>\r\n<br>\r\n\"Can you keep a secret Rigby?\"<br>\r\n<br>\r\n\"Totally dude,\" Rigby nodded, with a smile filled with enthusiasm on her face, \"Anything for someone I can help!\"<br>\r\n<br>\r\n\"No need to oversell Rigby,\" you warn sternly, \"I know you're only doing this for a bet.\"<br>\r\n<br>\r\n\"So what's the secret?\" Rigby asked, leaning closer to you, \"I won't tell anyone.\"<br>\r\n<br>\r\nWith 95% certainity that you can trust this mammal, you lean your mouth towards Rigby's ear and whisper quietly, \"I have a foot fetish.\"<br>\r\n<br>\r\nAs soon as you said that sentence, you slowly lean back to your original position a little and let Rigby react. Surprisingly, he didn't burst out laughing or do anything derogatory. Instead he just sat there in silence for a few good moments, thinking of anything to add.<br>\r\n<br>\r\nEventually, he looks at you, not with a sharp glare filled with disgust or anger but with an warm and understanding gaze.<br>\r\n<br>\r\nHowever, you noticed that Rigby was a little bit uncomfortable now that you confessed your love of feet. Now you wished you unsaid what you just said.<br>\r\n<br>\r\n\"You can go find someone else now,\" you break the silence, \"I won't bother you anymore.\"<br>\r\n<br>\r\nBefore you even fully stood up from the bench, Rigby put his hand on you and slowly but gently pushed you back into the bench, \"It's okay. I said I would help you right?\"<br>\r\n<br>\r\nYou sheepishly respond with a yes.<br>\r\n<br>\r\n\"And I can help you explore your fetish!\" Rigby smiled, \"right?\"<br>\r\n<br>\r\nThis time, you respond with just a simple nod.<br>\r\n<br>\r\n\"When was the last time you tried your foot fetish?\"<br>\r\n<br>\r\n\"About a few years ago,\" you admit, trying to hide your embarrassment.<br>\r\n<br>\r\nRigby just patted your shoulder, with confidence, \"Tell you what, I'll make this the best feet experience you'll ever have! Trust me, you'll like it!\"<br>\r\n<br>\r\nNow, it was you who was smiling, but only a little. You were still a bit embarrassed, \"Thanks Rigby but where do we start?\"<br>\r\n<br>\r\nWhat does Rigby say next?</span></div></div>",
            "created":1460350800,
            "id":2131305,
            "title":"Rigby the Raccoon"
        },
        "15533222222222222222222222222123":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Go the nice route (Stranded fun) ",
                "Go the submissive route (Domination)"
            ],
            "content":"<div class=\"\"><div> <span>\"Remember my friend i mentioned? well heh, i never told you what the bet was for, see if i couldn't get a compliment, i would have to give him a foot massage for the rest of the day, because i sorta gave him my jobs, but since you seem to give me a compliment about my feet, he'll be forced to do whatever i want, even if it means to give you his feet\" *Rigby chuckled lightly, what an evil little raccoon but the thought of it made you blush for a weird little bet like that being made but it made you smile to see how the raccoon was going out of his way to make your foot fetish fun great, even if adding another person would double the fun for what the raccoon had planned, before the raccoon suddenly grabbed your arm and begun to run* \"Come on, we will find him in our room\" *He said running with you along, as if purposly trying to build up a small sweat*<br>\r\n<br>\r\n<br>\r\n*Soon you guys reached the room as Rigby grinned and knocked on the door as a slightly taller then you bluejay answered the door, you begun to plus abit, yeah he had two toes instead of 4-5 but his feet were nice and big, Rigby begun to talk* \"Hey Mordecai, i got a nice compliment from this guy here and i wanted to cash it in to give this guy a nice time, he has a major foot fetish hehe\"<br>\r\n<br>\r\n*Mordecai looked at you with such a blushed up face, he didn't react badly about it but was shocked*\" he said something nice to you, are you sure he didn't bribed you?\" *the bluejay asked getting a blushing head shake to him as the bluejay sighs* \"Well fine, i got nothing better to do anyways, come on in\" *Mordecai said with a change of attutide from being kinda shocked to being happy as they walked in before Mordecai shut the door to make sure no one disrupted them*<br>\r\n<br>\r\n\"So we can do this two ways bud, either we can do things nicely/slowly with you giving us a nice foot worship\" *Mordecai stated lightly, sitting on the bed, giving you a slight toe wiggle with his two toes, making you practically lick your lips* <br>\r\n<br>\r\n\"Orrrr\" *Rigby chuckled going into his closet and pulling out some rope* \"We could go the other way of us being the masters and you being the slave under our feet~\" *Rigby said with a grin lightly*<br>\r\n<br>\r\n*They both sound so good but which direction are you willing to go, the nice route or the submissive route?*<br>\r\n<br>\r\n(Sorry if this was bad, getting abit intouch with Writing.com, had a bit of trouble with the keys)</span></div></div>",
            "created":1507611600,
            "id":2399520,
            "title":"\"I can invite Mordecai over!\""
        },
        "155332222222222222222222222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Turtle Feet,Yay",
                "Turtle feet,Boo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok since you don't like cartoon network i am just going to come up with ideas out of the blue now<br>\r\n<br>\r\nHmm....What about some TMNT action</span></div></span></div>",
            "created":1369544400,
            "id":1596938,
            "title":"No"
        },
        "1553322222222222222222222222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "No",
                "Pokemon Feet/Anime feet nice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pokemon time?</span></div></span></div>",
            "created":1369544400,
            "id":1596939,
            "title":"Turtle feet,Boo"
        },
        "15533222222222222222222222222221":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about some sonic x,Tails,knuckles,sonic btw</span></div></span></div>",
            "created":1369544400,
            "id":1596940,
            "title":"No"
        },
        "155332222222222222222222222222211":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Sonic The Hedgehog.",
                "Uh.. No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then, which sonic character?</span></div></span></div>",
            "created":1561829580,
            "id":2680238,
            "title":"Sonic Series."
        },
        "1553322222222222222222222222222112":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Sure, Why Not?",
                "Ahahaha No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How abou his sidekick and best friend, Tails!</span></div></span></div>",
            "created":1561829640,
            "id":2680239,
            "title":"Next!"
        },
        "155332222222222222222222222222212":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "Yes",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I think Sonic X was already mentioned... Anyways, how about some Megaman NT Warrior?</span></div></span></div>",
            "created":1381122000,
            "id":1675557,
            "title":"Didn't We Go Through This Option?"
        },
        "1553322222222222222222222222222122":{
            "author_id":"metalcritic",
            "author_name":"Magnum Fire",
            "choices":[
                "Yes",
                "No, give me something else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would a character from Marvel comics suffice?</span></div></span></div>",
            "created":1444626000,
            "id":2046479,
            "title":"Marvel"
        },
        "15533222222222222222222222222221221":{
            "author_id":"metalcritic",
            "author_name":"Magnum Fire",
            "choices":[
                "Yes",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want Spiderman?</span></div></span></div>",
            "created":1445490000,
            "id":2050652,
            "title":"Spider-Man"
        },
        "155332222222222222222222222222212212":{
            "author_id":"metalcritic",
            "author_name":"Magnum Fire",
            "choices":[
                "Yes",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Deadpool?</span></div></span></div>",
            "created":1445662800,
            "id":2051642,
            "title":"Deadpool"
        },
        "1553322222222222222222222222222122122":{
            "author_id":"metalcritic",
            "author_name":"Magnum Fire",
            "choices":[
                "Yes",
                "Definitely not"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would Hulk do it for you?</span></div></span></div>",
            "created":1449205200,
            "id":2070300,
            "title":"Hulk"
        },
        "15533222222222222222222222222221221222":{
            "author_id":"starshaman",
            "author_name":"Orbital",
            "choices":[
                "Sure !",
                "Anything else ?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Soul Calibur ?</span></div></span></div>",
            "created":1452747600,
            "id":2089020,
            "title":"Definitely not"
        },
        "155332222222222222222222222222212212221":{
            "author_id":"starshaman",
            "author_name":"Orbital",
            "choices":[
                "Mitsurugi",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who it'll be then ?</span></div></span></div>",
            "created":1452747600,
            "id":2089021,
            "title":"Sure !"
        },
        "155332222222222222222222222222212212222":{
            "author_id":"metalcritic",
            "author_name":"Magnum Fire",
            "choices":[
                "That will be interesting",
                "Not interested at all"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Venom, the Spiderman villain?</span></div></span></div>",
            "created":1452747600,
            "id":2089030,
            "title":"Venom"
        },
        "1553322222222222222222222222222122122222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Four Smelly Turtle feet and Cheesy Rat Feet? Sounds like a fun time!",
                "Hell no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They are always fighting and consently having to walk in the sewars, imagine how smelly their feet must be, dying for attention? even Master splinter wants in<br>\r\n<br>\r\nNote: this can be any generation but i like the 2003 turtles better</span></div></span></div>",
            "created":1453438800,
            "id":2092691,
            "title":"Teenage Mutant Ninja Turtles?"
        },
        "15533222222222222222222222222221222":{
            "author_id":"metalcritic",
            "author_name":"Magnum Fire",
            "choices":[
                "Yes",
                "No, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps a character from DC?</span></div></span></div>",
            "created":1445403600,
            "id":2050180,
            "title":"DC"
        },
        "155332222222222222222222222222212222":{
            "author_id":"starshaman",
            "author_name":"Orbital",
            "choices":[
                "Alright !",
                "Nah, keep going."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about gaming's biggest icon ? Mario</span></div></span></div>",
            "created":1456117200,
            "id":2107958,
            "title":"Super Mario"
        },
        "1553322222222222222222222222222122222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Yes",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, How about we keep it up with the Mario characters<br>\r\n<br>\r\nWhat about Luigi </span></div></span></div>",
            "created":1463893200,
            "id":2152234,
            "title":"More Mario Characters"
        },
        "15533222222222222222222222222221222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "mmm yes please!",
                "Nah, what else ya got?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Yoshi, i know there are some Yoshi fans out there!</span></div></span></div>",
            "created":1463893200,
            "id":2152235,
            "title":"Nah"
        },
        "155332222222222222222222222222212222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Sure ill give this a try",
                "Ew, you serious? keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmmm how about two in one, The Wario Broz!</span></div></span></div>",
            "created":1463893200,
            "id":2152236,
            "title":"Nah, what else ya got?"
        },
        "1553322222222222222222222222222122222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Now we are talkin'",
                "Eh, Bowser is overrated, anyone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, here is one that i know you guys will love<br>\r\n<br>\r\nBowser!!</span></div></span></div>",
            "created":1463893200,
            "id":2152237,
            "title":"Ew, you serious? keep going"
        },
        "15533222222222222222222222222221222222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "Hot",
                "Same species, same overrated-ness"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fine, How about Bowser Jr</span></div></span></div>",
            "created":1463893200,
            "id":2152238,
            "title":"Eh, Bowser is overrated, anyone else?"
        },
        "155332222222222222222222222222212222222222":{
            "author_id":"chantheman",
            "author_name":"wolfdoom",
            "choices":[
                "So many hot boys, so much choices, i will take this (characters next chapter)",
                "What is Total Drama Island?, whatever it is, sounds stupid"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There is no pleasing you is there?<br>\r\n<br>\r\nFine off of Mario Characters (for now)<br>\r\n<br>\r\nHow about some Total Drama Island character's feet?</span></div></span></div>",
            "created":1463893200,
            "id":2152240,
            "title":"Same species, same overrated-ness"
        },
        "1553322222222222222222222222222122222222221":{
            "author_id":"shinysmeargle",
            "author_name":"ShinySmeargle",
            "choices":[
                "Duncan!",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok! Now lets decide who..? How about...</span></div></span></div>",
            "created":1509858000,
            "id":2411644,
            "title":"So many hot boys, so much choices, i will take ..."
        },
        "1553322222222222222222222222222122222222222":{
            "author_id":"lionmage",
            "author_name":"Sagacious Luo",
            "choices":[
                "Sure, why not ?",
                "Are you even being serious ? Keep going !"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, how about some of the guys from Mortal Kombat (preferably X) ? A complete tonal shift I know, but...</span></div></span></div>",
            "created":1465362000,
            "id":2161160,
            "title":"What is Total Drama Island?, whatever it is, so..."
        },
        "15533222222222222222222222222221222222222222":{
            "author_id":"lionmage",
            "author_name":"Sagacious Luo",
            "choices":[
                "Umm...okay?",
                "Who? Just keep going."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm certain none of you will know who this is, but...Red Harlow from Red Dead Revolver.</span></div></span></div>",
            "created":1467781200,
            "id":2176208,
            "title":"Are you even being serious ? Keep going !"
        },
        "155332222222222222222222222222212222222222222":{
            "author_id":"drumroll",
            "author_name":"Shattered",
            "choices":[
                "Sure.",
                "Nah."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the guys of Overwatch?</span></div></span></div>",
            "created":1470546000,
            "id":2192216,
            "title":"Who? Just keep going."
        },
        "1553322222222222222222222222222122222222222221":{
            "author_id":"dooopliss",
            "author_name":"...",
            "choices":[
                "Jesse Mccree",
                "Genji Shimada",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Overwatch it is! Let’s get to business, who would you like to choose?</span></div></span></div>",
            "created":1524978000,
            "id":2485748,
            "title":"Sure."
        },
        "15533222222222222222222222222221222222222222211":{
            "author_id":"dooopliss",
            "author_name":"...",
            "choices":[
                "Blackwatch",
                "Overwatch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this Mccree when he was in Blackwatch or how he currently appears in Overwatch?</span></div></span></div>",
            "created":1525017000,
            "id":2485756,
            "title":"Jesse Mccree"
        },
        "15533222222222222222222222222221222222222222212":{
            "author_id":"dooopliss",
            "author_name":"...",
            "choices":[
                "Young Genji",
                "Blackwatch",
                "Overwatch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this young Genji, Blackwatch Genji, or current Overwatch Genji?</span></div></span></div>",
            "created":1525017060,
            "id":2485757,
            "title":"Genji Shimada"
        },
        "15533222222222222222222222222221222222222222213":{
            "author_id":"dooopliss",
            "author_name":"...",
            "choices":[
                "Gabriel Reyes (Reaper)",
                "Jack Morrison (Soldier 76)",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these men?</span></div></span></div>",
            "created":1524978000,
            "id":2485750,
            "title":"Others"
        },
        "155332222222222222222222222222212222222222222131":{
            "author_id":"dooopliss",
            "author_name":"...",
            "choices":[
                "Blackwatch",
                "Talon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this gonna be Gabe when he was in Blackwatch or is it post Overwatch when he turns into Reaper and joins Talon?</span></div></span></div>",
            "created":1524978000,
            "id":2485752,
            "title":"Gabriel Reyes (Reaper)"
        },
        "155332222222222222222222222222212222222222222132":{
            "author_id":"dooopliss",
            "author_name":"...",
            "choices":[
                "Jack Morrison",
                "Soldier 76"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this Jack when he is in Overwatch or is it Jack post Overwatch when he starts to go by Soldier 76?</span></div></span></div>",
            "created":1524978000,
            "id":2485753,
            "title":"Jack Morrison (Soldier 76)"
        },
        "155332222222222222222222222222212222222222222133":{
            "author_id":"dooopliss",
            "author_name":"...",
            "choices":[
                "Lúcio Correia dos Santos",
                "Reinhardt Wilhelm",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alrighty, how about these fine men?</span></div></span></div>",
            "created":1525016880,
            "id":2485755,
            "title":"Others"
        },
        "1553322222222222222222222222222122222222222222":{
            "choices":[
                "Yes!",
                "No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the boys from Teen Titans?</span></div></span></div>",
            "created":1471496400,
            "id":2197884,
            "title":"Teen Titans "
        },
        "15533222222222222222222222222221222222222222221":{
            "choices":[
                "Beast Boy ",
                "Robin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will you choose?</span></div></span></div>",
            "created":1471496400,
            "id":2197885,
            "title":"Yes!"
        },
        "155332222222222222222222222222212222222222222211":{
            "choices":[
                "Massage my feet!",
                "Taste this! (Beast Boy farts on you) "
            ],
            "content":"<div class=\"\"><div> <span>You wake up and the first thing that hits you is the stench: it’s overwhelmingly strong, like a mix of smelly feet, burritos, and farts. You look around, and the visuals only add to your disgust: the floor on which you’re laying is covered in dirty, musty laundry and remnants of food. You see socks and underwear that you assume had once been white are now an alarming cloudy yellow, hanging over the bed and the various other surfaces of the room. To your left, you spy a greasy pizza box with just a few slices left. The sweaty sock odor mixing with the half eaten pizza makes your nose burn and your stomach convulse. <br>\r\n<br>\r\nHow did you get here? Then you remember: the Teen Titans. You would have easily robbed that bank had it not been for the quintet of super-powered teens and their dedication to “justice,” whatever that means. Though you’re similar in age, your life has taken a much different path: as a super-intelligent hacker you’ve busted your way through security at the most heavily-guarded banks and reaped millions. Now, however, you seem to have been bested.<br>\r\n<br>\r\nBut why am I in…a bedroom? you think, as you look around the area. At least, you believe it’s a bedroom, though with the condition it’s in it seems more fitting for a wild animal than a human. <br>\r\n<br>\r\nJust then, you hear a loud, earth-shattering belch from behind you. Startled, you turn around to see a mischievously grinning green teen, holding a soda and a burrito. <br>\r\n<br>\r\n“Hey there” he says, beaming. “Glad to see you’re up!” <br>\r\n<br>\r\nYou recognize him instantly as the purple spandex-clad kid who helped capture you. As he stares down at you with his dumb grin, your anger builds.<br>\r\n<br>\r\n“Who are you?! Where am I?! Let me out of here this instant or I’ll—<br>\r\n<br>\r\nBefore you can fully stand up, the teen forces his foot down on your chest, pinning you back to the smelly laundry-filled floor. <br>\r\n<br>\r\n“I’m Beast Boy” he says, still grinning. “And you’re not going anywhere. Criminals like you need to be taught a lesson. And after all, I’ve always wanted a slave,” he laughs. <br>\r\n<br>\r\n“I’ll never be your slave!!” you yell.<br>\r\n<br>\r\n“Oh, I think you will once you get a load of this--” Beast Boy responds menacingly. “Now…” <br>\r\n</span></div></div>",
            "created":1471496400,
            "id":2197887,
            "title":"Trapped in Beast Boy's room "
        },
        "1553322222222222222222222222222122222222222222111":{
            "choices":[
                "Beast Boy shoves his feet in your face",
                "Beast Boy cups his shoe over your mouth and nose (smelly mask) "
            ],
            "content":"<div class=\"\"><div> <span>As you lay there still pinned to the ground, Beast Boy peels off his sneakers, revealing two green feet pruning with sweat from having been in his hot shoes without any socks. The worst imaginable smell wafts through the room, and you immediately clasp your nose in terror. <br>\r\n<br>\r\n“Hey, your gonna need those hands for the massaging,” yells Beast Boy. “I’m waiting!” <br>\r\n<br>\r\nReluctantly you obey, but only because the smell is so unbearable and you hope maybe if you do what he says, Beast Boy will put his stinky weapons back in his shoes and away from you. <br>\r\n<br>\r\nBeast Boy sits down on his desk chair and allows you to get up in a kneeling position in order to massage his feet. Placing your hands on his soles, you begin to apply pressure in an attempt to appease your captor. It doesn’t take long for you to notice the thick coating of slimy sweat that completely covers Beast Boy’s feet, evidence that he is loathe to washing them. <br>\r\n<br>\r\n“Ahhh,” he moans in pleasure as your hands become more tainted with his sticky sweat. “That’s right, massage them just like a good little slave.” He starts wiggling his toes in glee as you massage his feet, causing bits of toe-cheese to sprinkle to the floor as a result. <br>\r\n<br>\r\nJust when you thought it couldn’t get any worse, Beast Boy begins eating his burrito and soda, belching loudly as he does so. The smell of his burps mixes with his feet to form a truly noxious odor. Overwhelmed, you start to lose strength, your vision fades and begin to slow down in your massaging efforts. <br>\r\n<br>\r\nBeast Boy looks down at you, un-amused by your weak foot-massaging efforts. <br>\r\n<br>\r\n“Looks like I’m gonna have to toughen you up,” he says with a grin<br>\r\n</span></div></div>",
            "created":1471496400,
            "id":2198005,
            "title":"Massaging Beast Boy's feet"
        },
        "15533222222222222222222222222221222222222222221111":{
            "choices":[
                "You’re in a dungeon and surrounded by Beast Boy’s dirty laundry",
                "You’re in another male titan’s room",
                "You're on Beast Boy's bed"
            ],
            "content":"<div class=\"\"><div> <span>With that, beast boy shoved his smelly feet square onto your face, with his sole resting right on your nose. You tried to breath through your mouth, but his heel covered your lips, forcing you to smell and taste his sweaty, dirty sole directly. <br>\r\n<br>\r\n“Why?” you whimper, muffled under Beast Boy’s feet, tears streaming down your face as he pressed harder onto your face, his heel now pressing up against your mouth with sweat salty dripping dripping onto your tongue.<br>\r\n<br>\r\nBeast Boy looked down at you, laughing. “Don’t worry dude, this is nothing. You’re lucky I actually washed my feet yesterday.”<br>\r\n<br>\r\nHe then applies more pressure your to your face, which is now covered in his sweat, and he starts lightly bobbing your head back and forth like you’re a soccer ball and he’s a bored teen looking for something to occupy his time. He then takes his other foot and sandwiches your face in between his two soles, creating a stinky pyramid above your nose. <br>\r\n<br>\r\n“Whoa, your face makes a perfect foot rest!” Beast Boy says in delight. <br>\r\n<br>\r\nYou try to hold your breath under the hot cave that beast boy has made with his feet, but it’s futile. Soon, you begin to suffocate under his fumes, slowly losing your strength.  As you begin to pass out, you can hear Beast Boy chuckling above you…<br>\r\n<br>\r\n….<br>\r\n<br>\r\nYou wake up. <br>\r\n<br>\r\nYou don’t know what time it is or how long you were passed out. The memory of Beast Boy’s feet rushes back to you and you shudder. <br>\r\n<br>\r\n‘Where am I?’ you think. Something’s not right. <br>\r\n<br>\r\nLooking around, you realize…<br>\r\n</span></div></div>",
            "created":1471842000,
            "id":2199974,
            "title":"Beast Boy shoves his feet in your face"
        },
        "15533222222222222222222222222222":{
            "author_id":"bulbaguy",
            "author_name":"Bulbaguy",
            "choices":[
                "Ash Ketchum",
                "Red"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, who do you want, Ash or Red? </span></div></span></div>",
            "created":1473829200,
            "id":2210113,
            "title":"Ash or Red"
        },
        "155332222222222222222222222222222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes! Pokemon",
                "No something else",
                "Another anime"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just double checking, are you sure you want to go with Pokemon, or maybe some other anime?</span></div></span></div>",
            "created":1587445860,
            "id":2821959,
            "title":"Are you sure?"
        },
        "1553322222222222222222222222222222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Dragon Ball",
                "My Hero Academia",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these options:<br>\r\n<br>\r\nDragon Ball (Z, GT, Super)<br>\r\n<br>\r\nMy Hero Academia<br>\r\n</span></div></span></div>",
            "created":1587445920,
            "id":2821961,
            "title":"More Anime"
        }
    },
    "info":{
        "author_id":"tiplay",
        "author_name":"neon 147",
        "brief_description":"a story about you worshiping male characters feet ",
        "created":1230247320,
        "description":"<td align=\"left\" class=\"norm\">not much rules only<br>\r\n<br>\r\nkeep it male<br>\r\nvores okay (any type)<br>\r\ngive a good length<br>\r\n<br>\r\nother than that go nuts</td>",
        "id":1508880,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1587445920,
        "modified":1587445920,
        "pretty_title":"Male characters feet worship "
    }
}