{
    "chapters":{
        "1":{
            "author_id":"waffles976",
            "author_name":"waffles976",
            "choices":[
                "Your house",
                "A friends house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does your story begin?</span></div></span></div>",
            "created":1338958800,
            "id":1354036,
            "title":"Where"
        },
        "11":{
            "author_id":"waffles976",
            "author_name":"waffles976",
            "choices":[
                "Your room",
                "Marissa's room",
                "Christine's room",
                "Sydney's room",
                "Bathroom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in your house do you wake up shrunk</span></div></span></div>",
            "created":1338958800,
            "id":1354040,
            "title":"Your house"
        },
        "111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Marissa",
                "Christine",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You slowly flutter your eyes awake. Not knowing where you are, you think it's a dream. Wherever you are, it's comfortable, like being in a mama kangaroo's pouch. Safe. Like nobody or nothing can harm you.<br>\r\n<br>\r\nBut, you know that your physiological needs call to you; you're hungry! So, you have to decide where you are. You open your eyes, but you can't make sense of it, at first.<br>\r\n<br>\r\nMountainous light blue ridges are in front of you. A memory comes back to you. Of course! It all makes sense now! You were on your bed, shrunken, somehow! You don't have time to wonder, because your door opens and one of your sisters walks in.<br>\r\n<br>\r\nWhich one?</span></div></div>",
            "created":1373000400,
            "id":1623363,
            "title":"Your room"
        },
        "1111":{
            "author_id":"callxmexjesus",
            "author_name":"Jonny",
            "choices":[
                "A cruel, and mischievous grin on her face.",
                "A caring and caressing smile.",
                "Reader's Choice."
            ],
            "content":"<div class=\"\"><div> <span>Your sister Marissa walks into the room a very revealing v-neck and a pair of pink pajama shorts. \"Hey idiot, time to get... Hey, where is he?\" She walks over to your bed and doesn't seem to notice you shrunken right in front of her on your pillow. You try to start to call for her but when you look up to yell you see her giant butt descending right ontop of you. Before you can even react you are crushed by the full weight of your little sister's ass.<br>\r\n<br>\r\nYou are trapped right in between her two massive cheeks so you weren't crushed too bad. Suddenly you hear a large rumbling and then and then a loud ear piercing noise.\"Ahhhhh, felt good to release that one. And I got to do it right on Cory's pillow. Hopefully he gets pinkeye or something.\" You can't believe that Marissa just farted on your pillow, and even more you, but she is still unaware to your presence. You put that behind you for now when the smell from her fart comes wafting in. It smells like something crawled up her ass and died, and to make matters worse you are mere inches away from the odor's cause along with being trapped in a small crevice with little to no breathable air. <br>\r\n<br>\r\nYou begin to struggle with all of your strength. You have to let Marissa know you are here or you might die under her ass. Marissa stands up off the bed. \"Is that a bug on the bed?\" She goes to inspect closer. \"Cory, is that you? What are you so tiny for? And what were you doing under my butt?\" <br>\r\n <br>\r\nYou start to explain what little you know and she just stands there listening. \"So no one else knows you're shrunk like this?\" Yes Marissa, that's why you have to help me.<br>\r\n<br>\r\n You look to see what she says next and she has a .... expression on her face.</span></div></div>",
            "created":1380517200,
            "id":1672608,
            "title":"Marissa"
        },
        "11111":{
            "author_id":"callxmexjesus",
            "author_name":"Jonny",
            "choices":[
                "Marissa leaves you in there for a while.",
                "Marissa was only playing a prank, she takes you out of her butt."
            ],
            "content":"<div class=\"\"><div> <span>\"Well well well, little Cory needs my help, and after what you did to me last week!? Putting gum in my hair, tells Jack I had a crush on him, and telling everyone to avoid me because of my horrible smell? I don't know why you think I would help you, but you can sure help me. Since you say that my farts smell so bad how you help me with my little problem.\"<br>\r\n<br>\r\nYou don't know how you help or what she's talking about. You just wanted to try to calm her down before things got worse. She grabs you from off the bed and brings you to eye level.<br>\r\n<br>\r\n\"Hope you enjoy this as much as I will big... I mean little bro.\" She uses her other hand to pull back her pajama pants and her underwear. She then brings you around and hovers you right over the open chasm that is her ass. You try to beg and plead for her to stop but your cries for help go unanswered. She drops you into her backside and you fall right into her ass crack. It smells worse than you could've imagined, especially after the gas blast she reased just a while ago. She lets her panties snap shut and you think that is the end of it when you feel something poking you from behind. <br>\r\n<br>\r\nMarissa uses her finger to push you as deep as she can into the depths of her butt. You are now face to face with her puckered, pulsating anus. The smell has magnified to the fact where you can badly breathe. \"Make sure you absorb my farts nice and good bro, maybe I'll let you out later if you do a good job. Haha.\" With that she gives her ass a smack and leaves your room. You have to get out of here soon. You don't want to die inside of your sister's ass.</span></div></div>",
            "created":1380603600,
            "id":1672801,
            "title":"A cruel, and mischievous grin on her face."
        },
        "111111":{
            "author_id":"callxmexjesus",
            "author_name":"Jonny",
            "choices":[
                "Writer's Choice.",
                "Writer's Choice."
            ],
            "content":"<div class=\"\"><div> <span>This is, by far the worst moment of your life. You are trapped inside of your younger sister's ass, minscule in size compared to her giant asshole right in front of you. The hot air coming out of it only makes you sweat profusely without her own ass sweet drenching you. You also notice Marissa clearly didn't wipe very well in her last trip to the bathroom. So you are shrunken, inside of sister's butt, covered in her sweat and feces. <br>\r\n<br>\r\nYou feel powerless and she could do whatever she want to you and no one would ever know. She could even leave you inside of her ass for however long she wants. Sure people will start to look for you and your parents will file a police report, but who is going to think you are in the ass of your little sister? <br>\r\n<br>\r\nMarissa can only smile as she goes on her like nothing had happened as she secretly enjoying her brother squirming and begging for mercy inside of her great ass. She just tries to think of what else she can do to you for a little fun and amusement. All the ideas racing through her mind she can barely contain herself.</span></div></div>",
            "created":1380862800,
            "id":1674382,
            "title":"Marissa leaves you in there for a while."
        },
        "1111111":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "Try to close your mouth",
                "Deal with it and take your punishment"
            ],
            "content":"<div class=\"\"><div> <span>She takes you out for some reason. \"Hey you little bug I have to take a wicked shit and we ran out of toilet paper soooo.....<br>\r\nyou know now what she's gonna do and you beg and plead and even made a few tears but none of it worked. She gone to her bathroom with you tightly in her hand.when she gets to the toilet you start to cry cause you know what's coming to you. \"Please I'm begging you I'm SORRY for saying you stink\" but she ignores your pleads as she pulls down her pants the her panties. \"I'm sorry!!\" Was all you can say before she pryes your mouth open and dangles you bye the head. Finally she squeezes her stomac and out comes a lot of shit . And the thing is your kind of dangling under her butt hole so...when the log comes out you mouth is filled with shit. </span></div></div>",
            "created":1449896400,
            "id":2073600,
            "title":"Writer's Choice."
        },
        "11111111":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "choices":[
                "She stops",
                "She doesn't"
            ],
            "content":"<div class=\"\"><div> <span>Finally some good news, you get your mouth closed successfully. However, it seems you've been stuffed so full that your body has become long and fat, like a sausage, with your skin as the casing. More bad news, you can't open your mouth again, as it's glued shut with her sticky shit. Your sadistic sister brings you back up to her face. <br>\r\n\"Ooh, nice body big brother! You're nice and firm and rounded, almost like...\" she trails off and begins lowering you back into the bowl, but the front this time. Your face is pushed into her young, wet slit as you're used as a dildo for your sister. </span></div></div>",
            "created":1523509200,
            "id":2478858,
            "title":"Success!...kinda"
        },
        "11111112":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "She takes you to her friends house",
                "Bring you to her room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are helpless as she fills your mouth with shit. Tears roll down your face while the second log enters out of her butt hole. \"how does that taste little man\" your sister said. When she finishes she looks at you and smiles. </span></div></span></div>",
            "created":1449896400,
            "id":2073604,
            "title":"Deal with it and take your punishment"
        },
        "111111121":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "choices":[
                "Lauren's sister comes in.",
                "Lauren comes back, sweaty and horny."
            ],
            "content":"<div class=\"\"><div> <span>Marissa slowly slides you into an empty water bottle. You hit your head repeatedly and black out as she slips you into her bag, then walks down the stairs to go to her friend's house. <br>\r\nYou wake up, feeling a little cramped in the bottle. It seems that you've grown to about five inches in height, and as you begin to move around you hear your sister's voice boom above you, \"Lauren, check this out!\" Marissa's hand wraps around your bottle and yanks you up out of her bag. As your eyes adjust to the brightness of the room, both the girls start laughing. Marissa uncaps the bottle, turns it upside down and begins violently shaking to get you out. Lauren smiles, \"I'll give you fifty dollars for him.\" You look up at your sister to find her silently debating the deal. Stunned, your expression turns to that of sheer horror as your sister hands you over to your new master, Lauren.<br>\r\n\"Well, I'd better head to the gym now, you wanna come with?\" Marissa asks. Lauren smiles and agrees, tossing you to her soft bed. You get a little show as Marissa leaves, allowing Lauren to strip down and change. Her small breasts were made up for by her smooth, toned white ass. \"I paid good money for you, so you'd better believe I'll have my fun with you. just you wait...\" she trails off as she dons her spandex shorts and sports bra. With that, she grabs her cell phone and heads out the door.</span></div></div>",
            "created":1465102800,
            "id":2159057,
            "title":"Her friend"
        },
        "1111111211":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "choices":[
                "Stay quiet, hoping she ignores you",
                "Get her to notice you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you hear the front door slam closed, you breathe a sigh of relief. You're safe for now, or so you think. You hear Lauren's door creak open and a small toddler waddles in. </span></div></span></div>",
            "created":1538283600,
            "id":2556971,
            "title":"Lauren's sister comes in."
        },
        "111111122":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "choices":[
                "back into her gaping asshole",
                "Into her juicy pussy"
            ],
            "content":"<div class=\"\"><div> <span>As you're about to leave, your sister smiles. \"Uh oh, looks like round two is starting!\" She cackles and stretches your mouth wide open, just in time for her to squeeze out a massive shit directly into your mouth. You can't spit it out, it forces itself down your gullet and swells your stomach. You scream and cry in agony as she finishes and wipes her chocolate starfish with your matted hair. Noticing your new, swollen appearance, she smirks and slowly slips you...</span></div></div>",
            "created":1466226000,
            "id":2166366,
            "title":"Bring you to her room"
        },
        "1111111221":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "choices":[
                "She leaves you in there and starts her day",
                "You are taken deeper"
            ],
            "content":"<div class=\"\"><div> <span>\"Whoops, looks like I need to plug this hole! Hmmm, what to do, what to do...\" she pretends to think. Suddenly she snaps, \"ah, brother butt plug!\" Without hesitation she crams your swollen body directly into her back door, plugging herself up and sealing you inside a chocolate cave.</span></div></div>",
            "created":1541221200,
            "id":2572414,
            "title":"back into her gaping asshole"
        },
        "111112":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "choices":[
                "In my panties",
                "In my pussy"
            ],
            "content":"<div class=\"\"><div> <span> Several minutes pass. As the last breaths of breathable air escape out of her massive anus, a miracle. The finger reaches back in and scrapes you back out. \"Jeez, no need to die on me, baby brother. It was just a prank.\"<br>\r\n\"You could've fucking killed me!\" You shout up at her, enraged and smelly. \"That's not a prank!\"<br>\r\n\"Hmmm, looks like you need a time out. I think you'll serve that time...\"</span></div></div>",
            "created":1523509200,
            "id":2478851,
            "title":"Just a prank, bro."
        },
        "1113":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Sydney"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This one.   </span></div></span></div>",
            "created":1427778000,
            "id":1957064,
            "title":"other"
        },
        "112":{
            "author_id":"foxsk91",
            "author_name":"FOXSK91",
            "choices":[
                "On her bed while she's sleeping.",
                "On her night stand",
                "In a pile of clothes on the floor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up in your sisters room only about an inch tall. Where are you in your sisters room?</span></div></span></div>",
            "created":1413090000,
            "id":1870346,
            "title":"Marissa's room"
        },
        "1123":{
            "author_id":"crossbones19",
            "author_name":"John Smith",
            "choices":[
                "Morning (6:59)",
                "Night (00:01)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay so you are in her clothes but what time is it? You look at yours sisters clock. What time does it display?</span></div></span></div>",
            "created":1456549200,
            "id":2110263,
            "title":"Day and Night "
        },
        "11232":{
            "author_id":"crossbones19",
            "author_name":"John Smith",
            "choices":[
                "Nipple",
                "Cleavage/Cup"
            ],
            "content":"<div class=\"\"><div> <span>0:01? meh. you go to sleep on the clothes as you are exhausted, for some reason. <br>\r\n<br>\r\nBut you awake to the most ear piercing sound you've ever heard (that includes Marrisa) then a slam! as you get up you hear Sydney's voice amplified, \"OH FUCK! I'M LATE!\" You look down and realise that you are on your sisters bra. You try to jump out and stop what is about to happen but too late. You are jostled into the air and placed against your older sisters tit. But where?  </span></div></div>",
            "created":1481864400,
            "id":2250794,
            "title":"Late for school!"
        },
        "113":{
            "author_id":"nwleafshinobi1",
            "author_name":"IronWolf LEAF",
            "choices":[
                "Hide in a sock to regain your bearings",
                "Start looking for higher ground to contact Christine"
            ],
            "content":"<div class=\"\"><div> <span>As you blearily open your eyes, you take a moment to look around. All of the sudden, it hits you- you have no idea where you are! As you rise to your feet, you survey the room. It seems almost like something out of a fairytale! You see a strangely familiar dresser with a picture of- you and your sister?!! You realize with a start that this is Christine's room!!! Sure enough, you see your gigantic sister laying on her bed, fast asleep. According to her clock, it's 8:00 a.m. already- 15 minutes before she wakes up! Do you-</span></div></div>",
            "created":1484802000,
            "id":2265896,
            "title":"Christine's room"
        },
        "114":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Get Sydney's help.",
                "Leave the room.",
                "Someone else walks in before you decide."
            ],
            "content":"<div class=\"\"><div> <span><b>Thump. Thump. Thump.</b><br>\r\n<br>\r\nThe ominous noise awakens you from your slumber. As your mind slowly pulls itself out of its grogginess you come to realize that something is incredibly wrong. Instead of the familiar comfort of a your bedroom, you find yourself laying on what appears to be a vast ocean of carpet. Nearby, you notice gigantic articles of clothing strewn about the room; bras, skirts, and the occasional pair of panty. Obviously a girl's room. You initially chalked up the outrageous size of everything to your morning grogginess, but as your head begins to clear further and further, you are forced to recognize the horrible truth. You've been shrunken.<br>\r\n<br>\r\nUpon realizing this, you begin another survey of your surroundings. Other than the clothes, you notice quite a few beer bottles scattered around the room. Most are empty, but you notice a few with some alcohol left in them. There's only one girl you know of that would be so open about her drinking: Sydney, your 21 year old sister. A self described \"party-girl\", Sydney took pride in her ability to get wasted every weekend, even going so far as to hold it over your head, though you simply shrugged it off. Sydney loved to pick on you, presumably because your future was much brighter than hers. One that likely ended as a trophy wife or stripper.<br>\r\n<br>\r\nIn any case, you need some assistance, so you make your way towards Sydney's bed. Navigating through the graveyard of glass bottles, you notice the human-shaped lump laying on her bed. Assuming it's her, that leaves you with two options. You can try to get Sydney to help, though she can be a real bitch and you don't know how she'd react to finding a miniature version of you. On the other hand, you can try to escape and find someone more suitable at helping you.<br>\r\n<br>\r\n</span></div></div>",
            "created":1341205200,
            "id":1370877,
            "title":"Stuck in Sydney's Room"
        },
        "1141":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Her pants",
                "Her bra",
                "a half-finished beer can"
            ],
            "content":"<div class=\"\"><div> <span>You clamber up Sydney's bed and make it to her face. From the smell of her breath she's been drinking. Not good. You yell at her. Her eyes fluttered, finally opening and looking at you. <font class=\"size4\" style=\"\">\"Whuh...a bug?\"</font><br>\r\n<br>\r\nOh...no...<br>\r\n<br>\r\n<font class=\"size4\" style=\"\">\"Stupid bug, can't you see...tryna get some sleep...\"</font><br>\r\n<br>\r\n\"Wait, Sydney! You have to help me!\"<br>\r\n<br>\r\n<font class=\"size4\" style=\"\">\"Oh...you wanna sleep too? Here...lemme help you in the morning...\"</font><br>\r\n<br>\r\nWith that, your hungover sister grabs you and puts you in...</span></div></div>",
            "created":1482296400,
            "id":2252835,
            "title":"Get Sydney's help."
        },
        "11412":{
            "author_id":"nebors",
            "author_name":"Nebors",
            "choices":[
                "Escape, maybe if you wake her again, she'll help you",
                "Stay there and wait for her to be better."
            ],
            "content":"<div class=\"\"><div> <span>Your hungover sister grabs her bra cup and pulls it out, then drops you inside.<br>\r\n\"Hey! Let me out you big jerk!\"<br>\r\n<br>\r\n\"Oh, you're so funny...\"<br>\r\n<br>\r\nYour sister then releases her bra cup, letting it snap back into place, and she turns on her side, going back to sleep. You, on the other hand, are stuck, pressed tightly against her breast. What will you do now?</span></div></div>",
            "created":1572251520,
            "id":2739344,
            "title":"Sydney Puts You in Her Bra"
        },
        "114121":{
            "author_id":"nebors",
            "author_name":"Nebors",
            "choices":[
                "You accodentally fall in",
                "You wake her up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wiggle with lots of force, pushing your body forward, and out of her bra cup. Her mouth is wide open, and her breath smells horrible. What now?</span></div></span></div>",
            "created":1572251700,
            "id":2739346,
            "title":"Escape That Prison"
        },
        "1141211":{
            "author_id":"nebors",
            "author_name":"Nebors",
            "content":"<div class=\"\"><div> <span>When standing on her face, you lose balance, and your foot slips off the ground, forcing you to fall into her awaiting maw. The massive tongue inside was out of the way, and you couldn't grab onto it to save yourself. You fall into her throat, which forces you down, and into her stomach, where you start digesting.</span></div></div>",
            "created":1572251820,
            "id":2739348,
            "title":"Falling in Her Mouth"
        },
        "114122":{
            "author_id":"nebors",
            "author_name":"Nebors",
            "choices":[
                "Yell for her",
                "Leave"
            ],
            "content":"<div class=\"\"><div> <span>After hours upon hours of waiting, you start to feel sleepy. You close your eyes, falling asleep, and when you awake, you are still in Sydney's bra. Except, you aren't being pressed against her tit. Instead, you are on the floor, in the bathroom, and Sydney is taking a shower. What do you think you should do?</span></div></div>",
            "created":1572252000,
            "id":2739349,
            "title":"Stay there and wait for her to be better."
        },
        "1141221":{
            "author_id":"nebors",
            "author_name":"Nebors",
            "content":"<div class=\"\"><div> <span>\"SYDNEY! SYDNEY!!!!!!\"<br>\r\n<br>\r\nYou yell her name as loud as you can.<br>\r\n<br>\r\n\"Huh? Who said that?\"<br>\r\n<br>\r\nYour sister steps out of the shower.<br>\r\n<br>\r\n\"SYDNEY! DOWN HERE IN YOUR BRA!\"<br>\r\n<br>\r\nSydney walks over to her bra, and squats down. Seeing you, her eyes widen.<br>\r\n<br>\r\n\"JACK?! IS THAT YOU?!\"<br>\r\n<br>\r\n\"Yes! It is me! I need your help!\"<br>\r\n<br>\r\n\"How did this happen?\"<br>\r\n<br>\r\n\"I'm not sure! I just woke up like this!\"<br>\r\n<br>\r\n\"Hmmm...... well if we don't know how you shrunk, then how are we going to get you back to normal?\"<br>\r\n<br>\r\n\"I didn't really think about that...\"<br>\r\n<br>\r\n\"Oh! I have an idea.\"<br>\r\n<br>\r\nSydney turns off the shower, and dries off, then puts on her clothes. She is wearing a long sleeve, button up plaid shirt and a tight pair of jeans.You wonder what she meant when she said she had an idea. Then she picks you up, and brings you into her room. Laying down on her bed, she places you on her stomach. Unbuttoning her shirt from the top, revealing her massive chest, she starts giggling. Oh no..... that wasn't good.<br>\r\n<br>\r\n\"W-what are you doing? Help me!\"<br>\r\n<br>\r\n\"Actually, I think I'm going to keep you like this!\"</span></div></div>",
            "created":1572252420,
            "id":2739351,
            "title":"Yell Her Name"
        },
        "11413":{
            "choices":[
                "Morning finally came",
                "Sydney woke up, and drank you."
            ],
            "content":"<div class=\"\"><div> <span>You fell right into the beer can. There was multiple reasons why is was bad. First off, the beer went up to your waist and you had to be careful not to drink any. You didn't also need to be drunk. Another reason why this was bad is you weren't sure if you could get out, and if she got thirsty, you're doomed. You banged on the side of the can and screamed. You could hear Sydney giggling and hiccuping.<br>\r\n<br>\r\n\"Don't worry little bug, I'll get back to you in the morning, I think.\"  You tried to push against the side, but you couldn't put enough pressure. All you could do was wait till morning. If you were lucky, she might become sober by then and be able to help you. You sat quietly, listening to the crickets and Sydney's snoring.</span></div></div>",
            "created":1492318800,
            "id":2305862,
            "title":"Becoming one with the can of beer"
        },
        "114131":{
            "choices":[
                "Sydney ",
                "Her boyfriend "
            ],
            "content":"<div class=\"\"><div> <span>You woke up from a little nap you took. You heard loud wrestling from outside the beer can. You heard moans. the beer can vibrated every few seconds. You then heard your sister moaning louder and louder and louder and then she let off a little bit of a scream. You that heard a male voice say \"That was amazing\". It took you a minute but you realized Sydney must have had her boyfriend over. And when they woke up they started having sex. You know your parents would kill her for having him over, but realized your parents were gone for the weekend. Just then you heard some coughing, and the can you were in started vibrating extremely hard. Through the opening you saw huge lips and they started to part. you screamed but the person drinking the beer did not hear you. You are about to get sucked into the mouth of</span></div></div>",
            "created":1537765200,
            "id":2552874,
            "title":"Morning finally came"
        },
        "1142":{
            "author_id":"sparky510",
            "author_name":"sparky",
            "choices":[
                "Christine",
                "marissa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you go out of the room, where will you go now</span></div></span></div>",
            "created":1542258000,
            "id":2578269,
            "title":"Leave the room."
        },
        "115":{
            "author_id":"longcharles93",
            "author_name":"Charles Jacob Long",
            "choices":[
                "Mother."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up, and you're laying on bathtub floor at the size of a 1/16th inch tall flea.<br>\r\n<br>\r\nSuddenly, someone enters the bathroom.<br>\r\n<br>\r\nWho is it?</span></div></span></div>",
            "created":1494133200,
            "id":2315917,
            "title":"Bathroom"
        },
        "1151":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Sydney",
                "Your mother",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1506229200,
            "id":2390850,
            "title":"Or is it someone else?"
        },
        "11513":{
            "author_id":"kenkneeheee",
            "author_name":"KenKneeHee",
            "choices":[
                "\"Your ass please\"",
                "\"Your sock please\""
            ],
            "content":"<div class=\"\"><div> <span>You were on top of the counter right next to the sink.(Description of Ashlee if you want to read or look for all caps SHE)Ashlee is Latina, 5'7\"brown hair,with a c cup and a nice ass. She usually wears sweatpants, leggings and sundress type skirts. She was always a little bit of a bitch but not too much to dislike her. She would tease you and mess with your hormones by making you horny without your sister noticing. She never really showed much interest in a relationship or sex but would love showing you her ass and putting her feet on you telling you to rub them. SHE walked in to the bathroom and you noticed she was wearing tight leggings that showed off her amazing ass. She also seemed a little annoyed as she pulled her leggings down and sat on the toilet. She looked around and noticed something next to the sink. When she finished and flushed the toilet, she walked over to the sink to take a closer look at what was there. She picked you up and realized it was her brother. She would always be annoyed of you bothering her and your sister so she decided she would get rid of you for the day. She whispered \"I'm sick of you interrupting your sister and I so I'm gonna make you disappear for the day. What would you prefer, being put in my ass or my sock?\"</span></div></div>",
            "created":1574301840,
            "id":2749519,
            "title":"Your sister's friend, Ashlee"
        },
        "12":{
            "author_id":"waffles976",
            "author_name":"waffles976",
            "choices":[
                "Dacia",
                "Renee",
                "Teigan",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's house do you wake up shrunk in?</span></div></span></div>",
            "created":1338958800,
            "id":1354042,
            "title":"A friends house"
        },
        "121":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Dacia",
                "Dacia's mother Emily",
                "Dacia's 23 year old sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You Wake up on the kitchen counter of your friend Dacia's house. Standing nude, you see</span></div></span></div>",
            "created":1428469200,
            "id":1961119,
            "title":"Dacia"
        },
        "1211":{
            "author_id":"boi901",
            "author_name":"MrBasil",
            "choices":[
                "Try to get Dacia's attention",
                "Hitch a ride on Darcia",
                "Run, no way you're getting near her"
            ],
            "content":"<div class=\"\"><div> <span>Dacia stands next to you, she was as tall as an umpire state building, her massive rack looms over you're body, covered with her trainer shirt and yoga pants, and what appears to be a sport bra under her shirt, she's currently searching around for anything to eat. <br>\r\n<br>\r\nYou began to stand up and decided to...</span></div></div>",
            "created":1572736620,
            "id":2741467,
            "title":"Dacia"
        },
        "12111":{
            "author_id":"boi901",
            "author_name":"MrBasil",
            "choices":[
                "Grabs you and puts you in her cleavage",
                "Wanted to help you"
            ],
            "content":"<div class=\"\"><div> <span>You scream and shout and let it all out, as you try to get her attention, she keep searching the cabinet for anything to eat, and at that moment her marmaries was standing infront of you, <br>\r\n<br>\r\n<b>\"DACIA, DACIA, ITS ME CORY, HEY LOOK HERE!\"</b><br>\r\n<br>\r\nIt didn't end well, her large marmaries SLAMS You're body, trapping him withing the wooden counter and two large water ballons of flesh, you began to scream for her help, struggling to get out of her large bosom. Her marmaries finally lifted up and you see Dacia's face, with shock<br>\r\n<br>\r\nThe next thing you know she... </span></div></div>",
            "created":1572737220,
            "id":2741470,
            "title":"Try to get Dacia's attention"
        },
        "1212":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Jokingly",
                "Seriously ",
                "Half Serious Half Jokingly"
            ],
            "content":"<div class=\"\"><div> <span>You stand up on the metal center in what seems to be the kitchen of your friend Dacia. You see a familiar face walk into the room, as your friends 40 year old mother, Emily walks in. Her blonde hair is in the way of her gorgeous face, she was the very definition of MILF. She had EE boobs, and an ass to kill for.<br>\r\n<br>\r\n She walks into the kitchen and looks on the counter for her keys, and makes eye contact with you. She has a look of pure shock, as she picks your naked body off of the counter. <br>\r\n<br>\r\n \"Who are you?!\" She asks.<br>\r\n<br>\r\n \"Cory mam.\" You respond.<br>\r\n<br>\r\n \"Well, Dacia was right. You are cute. Cute enough to eat!\" She said</span></div></div>",
            "created":1434690000,
            "id":1995311,
            "title":"Dacia's mother Emily"
        },
        "12122":{
            "author_id":"guyman666",
            "author_name":"guymckoolio",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>She eyes you hungrily, \"I missed breakfast today and could really go for a snack righ about know.\" she says in her booming voice.<br>\r\nYeah she was serious alright! Suddenly she brings you closer to her and you get a front seat view into her tits, \"You see these?\" she asks, she then moves you around to her massive ass \"And this?\" <br>\r\nYou nod, \"Well once I eat you those are all that you'll see! You will become part of my beautiful body.\" <br>\r\nShe then moves you close to her face and whispers \"Woulden't you like to help dear old mommy out with them?\" <br>\r\nLured into her trap you nod, intoxicated by her milf beauty. \"Well now you can, so lets's help momma huh?\"<br>\r\nYou nod again still staring her in the eyes, suddenly she sets you down for a moment and gets a glass of cold water, she then picks you up and puts you into it.<br>\r\nYou shiver in the freezing waters, noticing this she reassures you \"Don't worry, soon you'll be warm and safe inside momma.\" looking forward to getting out of the cold you nod along. She then picks up the glass and puts it to her lips and starts drinking, almost immediately you are funneled into her mouth, waking up from her trance you start to freak out but it's already too late.<br>\r\nAs though you were just another droplet of water, Emily gulps you down in seconds and sends you to her stomache. You are squeezed from all sides as you slide down her esophagus, you fall strait into the stomache acid with a splash.<br>\r\nDo you start to break down?</span></div></div>",
            "created":1556773200,
            "id":2653714,
            "title":"A snack for Emily"
        },
        "12123":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "A man that wanted to have sex with her",
                "A giant dildo and string"
            ],
            "content":"<div class=\"\"><div> <span>Emily rubs the tiny man her over lips. It was true ahe wanted to eat him but she also wanted to have sone sexy MILF fun. Emily walks back to her bedroom swaying her hips as her tits bounce around in her lose bra.<br>\r\n<br>\r\n\"Hey put me down.\" you say.<br>\r\n<br>\r\n<br>\r\nIn her room there was___<br>\r\n</span></div></div>",
            "created":1577660160,
            "id":2766669,
            "title":"Half Serious Half Jokingly"
        },
        "121232":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "Tease you about her size",
                "Suck on you and season you in her. ( It dinner time)"
            ],
            "content":"<div class=\"\"><div> <span>She locks the door behind before  going to her nightstand. You struggle in her grip as she pulls out a huge black dildo along with a roll of string. You are tied up to the head of the rubber and latex dick. The sexy Milf walks into her closet and comes back out with a slutty waitress outfit.<br>\r\n<br>\r\nEmily: You know I always liked you. Mmm... You look sooo yummy on that cock. Order up baby!!<br>\r\n<br>\r\nShe starts to...<br>\r\n<br>\r\n</span></div></div>",
            "created":1578058620,
            "id":2768723,
            "title":"A giant dildo and string"
        },
        "1213":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "She walks towards the counter where you are.",
                "She goes to grab something from a cupboard or the refrigerator.",
                "She walks out of the kitchen."
            ],
            "content":"<div class=\"\"><div> <span>You awake to find yourself alone on a vast, featureless plain of smooth, cool stone. The sky above you is not blue, and there are several vast, bright lights above you, not a single sun. Far off, beyond the horizon, are strange shapes, blocky mountains made obscure by distance. Far away on this alien surface you see other shapes, the nature of which eludes you as do so many other things about your situation.<br>\r\n<br>\r\nYou are naked and cold and exposed.<br>\r\n<br>\r\nYou are afraid.<br>\r\n<br>\r\nThis fear is proven justified by a sudden movement in the vast distance that suddenly puts everything into perspective. A human figure is walking towards you, but she stands miles tall; she is a mountain unto herself. The surface you are standing on (a table? No, the stony surface suggests it might be a kitchen counter) is near the level of her hips. The strange, distant shapes are everyday objects that occupy her home. The figure stops moving, still an enormous distance away, and you begin to try to take in the sight. It does not take long for you to recognize her.<br>\r\n<br>\r\nIt's the older sister of your friend Dacia. Samantha, right? You rarely spoke to her so you didn't know her well, but there she stood, and what to normal human eyes was a small, slender woman with blue-dyed hair and a casual dress sense was to you beyond a goddess.<br>\r\n<br>\r\nKnowing this, you begin to recognize your surroundings as your friend's kitchen. You cannot even to begin to imagine how small you must be to so fully convert your surroundings into an alien landscape, but the realization begins to claw at you.<br>\r\n<br>\r\nHowever, the time to panic is past, as Samantha has begun to move again. </span></div></div>",
            "created":1473310800,
            "id":2207575,
            "title":"Dacia's 23 year old sister"
        },
        "12131":{
            "author_id":"blitz19",
            "author_name":"Blitz",
            "choices":[
                "Ask her go inside her mouth",
                "Don't ask"
            ],
            "content":"<div class=\"\"><div> <span>And she notices you. She look at you closely and realizes what you are.<br>\r\n<br>\r\n\"Oh my!... A tiny human!!\" She says surprised and excited.<br>\r\n<br>\r\n\"How come you are so small?\" She ask. <br>\r\n<br>\r\n\"I don't know ... I opened my eyes and I was here\"<br>\r\n<br>\r\n\"Huh?...\" She picks you up and brings to her face<br>\r\n<br>\r\nSuddenly I see her beautiful face in front of my eyes, her greenish eyes are beautiful and her pink lips are sultry, I wanted to be squeezed between them. <br>\r\n<br>\r\n\"Okay~ Speak now little one~\" She said.<br>\r\n<br>\r\n\"I don't know why I'm here... I just open my eyes and then I was here\"<br>\r\n<br>\r\n\"Hmmm... Oh my!!...Your dick!!\"<br>\r\n<br>\r\nAt that moment I realized that I had an erection, blushing I tried to hide it, she giggled softly but sensually too and she opens her maw and she brings her tongue on my parts and  licks. <br>\r\n<br>\r\nShe moans softly, I think she was enjoying my taste. My body was shaking, I was so nervous and excited. I was enjoying a lot, her breath smelled like strawberry and she brings me close to her mouth, feeling her sultry lips on my body.<br>\r\n<br>\r\nShe kisses on my body and I grabs her upper lip, excited my dick starts ejaculate on her tongue. <br>\r\n<br>\r\n\"Hmmm~... I bet that felt good~\" She says sensually <br>\r\n<br>\r\nThat really felt good, my body kept shaking and my heart was rushing. <br>\r\n<br>\r\n</span></div></div>",
            "created":1597779540,
            "id":2887587,
            "title":"Samantha's mouth"
        },
        "121311":{
            "author_id":"blitz19",
            "author_name":"Blitz",
            "choices":[
                "... I should finish my candy~",
                "... I should let you out"
            ],
            "content":"<div class=\"\"><div> <span>It felt so good that you decided to ask if you could go inside her mouth. <br>\r\n<br>\r\n\"You really liked it ... Well, I had a candy before, I wouldn't mind having another one in my mouth\" she said giggling a bit. <br>\r\n<br>\r\nShe then opened her mouth, pushing your little head and upper body inside, you were surrounded by her cute plump lips and you feel her lips squeezing against you. <br>\r\nYou could barely see the inside of her mouth, her tongue began to play with your penis again, making you moan and soon your whole body remain inside her mouth.<br>\r\nShe pushes you with her tongue, playing and savoring you, she moans as she enjoys the taste of your body, licking every part.<br>\r\n<br>\r\n\"Hmmm... So tasty my little candy~...\" <br>\r\n<br>\r\nHear her moans and her words made you more excited, reaching the climax again.<br>\r\n<br>\r\nShe giggles as she felt your cum again. \"Yes~... You love this a lot... Little pervert~\" <br>\r\n<br>\r\nShe keeps licking you and then. <br>\r\n\"Hmmm... Maybe... <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1598637120,
            "id":2893256,
            "title":"Ask her go inside her mouth"
        },
        "12132":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "A soft trench which smells faintly of skin oils and sweat—Samantha's fingertip.",
                "An ocean of boiling water, with powdered broth and noodles raining from above."
            ],
            "content":"<div class=\"\"><div> <span>Samantha turns to a cupboard, removes an item from a box, and tosses it onto the counter. It lands with meteoric force several hundred feet away from you. She then bends down to get something out of a lower cupboard. Thunderous clanging noises reveal to you that she is retrieving something large and metallic, which she soon lifts up, revealing it to be a soup pot, which she then carries to the sink and fills with water. Your ears continue to suffer from her actions as water roars from the faucet into the pan, but at last the sounds stop. She turns, walks to the stove, and places it on top with a final echoing clang. She then leans on the counter, her back to you. Perhaps she is watching the pot until it boils.<br>\r\n<br>\r\nYou decide to move towards the object she tossed onto the counter earlier. Perhaps it will provide you a way to get noticed.<br>\r\n<br>\r\nUpon arrival, it proves to be a packet of some kind. At your size, it's hard to see the big picture, so you're not totally sure of what. Nonetheless, you grab on to its surprisingly rough surface and begin to climb. <br>\r\n<br>\r\nNot long afterward, Samantha turns and moves her hand towards the packet. The sight of the fingers making contact with your surroundings is awe-inspiring. To you, it feels as though a set of enormous pillars, ornamented with richly whorled trenches, had fallen from Heaven to surround you. With a jerk, you begin moving upward rapidly, due to her lifting the packet. A second hand comes from beyond to grasp the packet, and abruptly, she tears it open. The combination of sound and acceleration you experience is overwhelming and you nearly loose your grip. Another movement and you feel boiling-hot clouds of steam around you, threatening to scald you alive. Samantha then turns the packet and you see that she has begun to pour noodle soup mix into the boiling pot. This final movement of hers shakes loose your grip, and you begin to fall. The fall feels agonizingly long, and yet all too soon you find yourself about to collide with something.</span></div></div>",
            "created":1473483600,
            "id":2208368,
            "title":"Samantha gets out some items to prepare a meal"
        },
        "121322":{
            "content":"<div class=\"\"><div> <span>Your naked body landed in the boiling water below. It was the most painful thing you had ever felt. It didn't help that noodles were falling and pushing you down. You shrieked, hoping Samantha would hear you. She simply kept cooking until it was done. She used a metal spoon to put you and some noodles into a bowl. She went over to the table and sat down, licking her lips at the sight of her meal.<br>\r\n<br>\r\n She started to eat, chomping pieces away. You were too weak to struggle or run away. The worst part was Samantha had no idea you were even there. You were soon on her fork, heading towards her giant carnivorous mouth. Her lips parted, welcoming you inside. She pushed you in and swallowed you whole. You slid down her giant esophagus, thinking that no one would ever know the truth about your disappearance. As your body impacted with her stomach, it felt painful, but a different kind of pain than before. Noodles soon landed on you, covering you up and pushing you under the stomach acids. You were slowly digested away to nothing. Meanwhile, Samantha gave a satisfied burp and rubbed her belly.<br>\r\n<br>\r\n\"Man that was really good. I guess I did a good job making it this time.\" She said and giggled. She continued on with her life, never getting to know the truth about that meal.</span></div></div>",
            "created":1492318800,
            "id":2306198,
            "title":"Soup's On"
        },
        "122":{
            "author_id":"waffles976",
            "author_name":"waffles976",
            "choices":[
                "Renee",
                "Makayla- renees evil sister who never liked you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up in horror to find out you have shrunk! But not only that but your in your ex girlfriends bedroom! Before you figure out what to do there is someone coming in.</span></div></span></div>",
            "created":1347166800,
            "id":1423858,
            "title":"Renee"
        },
        "1221":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Yes",
                "No",
                "She sees you as a bug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she see you?</span></div></span></div>",
            "created":1506229200,
            "id":2390878,
            "title":"Renee"
        },
        "1222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Made you kiss her toes",
                "Pleasure her vaginally",
                "Shove you down the back of her pants"
            ],
            "content":"<div class=\"\"><div> <span>\"Well well well,\" came a voice you instantly recognized as Makayla, Renee's sister, \"what do we have here!\" She always treated you like dirt. <br>\r\nMakayla was looking at you, \"looks like you really messed up this time!\" <br>\r\n<br>\r\nShe then...</span></div></div>",
            "created":1556686800,
            "id":2653352,
            "title":"Makayla- renees evil sister who never liked you"
        },
        "123":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "She wants to feel someone in her butt again",
                "She is feeling peckish",
                "Explore her body"
            ],
            "content":"<div class=\"\"><div> <span>You woke up with a bit of a headache.  You weren't entirely sure what had just happened, but you could have sworn you had just been at school.  You have to blink your eyes a few times, as everything seems to look blurry.  Then you realize that it wasn't your eyes that were the problem, you were in a glass!  You look up and see a massive eye staring down at you.  \"Oh good, you're awake.  I thought that I might have accidentally killed you, that wouldn't be very good.\"  She said with a smile.  You recognized the voice as Teigan's.  \"What's going on here?\"  You manage to croak, though your throat is dry.  \"Isn't it obvious?  I shrunk you.  I hope you last longer than the last guy I did this to, I put him up my butt and couldn't get him back out.  Oh well,\" she said dismissively, \"I'm sure you'll be more durable than him!  So, what should we do first?\"  She pondered this a bit.  </span></div></div>",
            "created":1453006800,
            "id":2090470,
            "title":"Teigan"
        },
        "1231":{
            "author_id":"sons0fthesky",
            "author_name":"Schroedinger",
            "choices":[
                "She pushes you in",
                "She pulls you out",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'll stick you in my ass!\" She says as she lifts you out of the glass.<br>\r\n<br>\r\nShe lowers you down to her ass and pulls back her panties.<br>\r\n<br>\r\n\"Wait! Please don't do this!\" you yell to no avail.<br>\r\n<br>\r\n\"Sorry, but I REALLY want this.\" she says as she drops you in between her asscheeks.<br>\r\n<br>\r\nYou plummet down towards her ass and due to the speed you fell at, you slipped right in between her massive cheeks. She begins to walk and the movement of her ass caused you to be slowly dragged towards her asshole. Soon your feet get pressed into her anus, dragging you inside. Her anus begins to pulsate, dragging you in even faster. After being sucked waist deep in her asshole, you manage to hold yourself in place. You stay stagnant for about five minutes when.</span></div></div>",
            "created":1547182800,
            "id":2601979,
            "title":"She wants to feel someone in her butt again"
        },
        "1232":{
            "author_id":"dragonkingrox",
            "author_name":"Ilikesw",
            "choices":[
                "you have some fun with her",
                "you get some more pets"
            ],
            "content":"<div class=\"\"><div> <span>right before she can try anything nasty with you her stomach starts to grumble. \"i'm going to get some food, don't go anywhere\" she says as she leaves the room. with her gone you decide to find a way out of your prison. you look around and see a remote labeled grow&amp;shrink. luckily you are pretty strong and are able to climb out. you make your way over to the remote and think 'this must be what she used to shrink me'. you set the device to grow and return your self to normal height.<br>\r\n<br>\r\nas you finish you hear someone coming up the stairs. you set the device to shrink and hide behind the door. as Teigan walks through the door you blast her in the back shrinking her to 4'', much like with you it knocks her out. you scoop her up and pocket her, you make your way out of the house with out being seen. you go home and dig out your hamsters old cage from the attic. you make a few adjustments so as to make it near impossible to get out of without superpowers. you are thankful that you are a super genius, and within a couple of minuets create an attachment to the gun that wipes all memory of said person.<br>\r\n<br>\r\nyou blast Teigan and the only evidence supporting the fact that she existed is her unconscious body laying in the cage.</span></div></div>",
            "created":1463806800,
            "id":2151787,
            "title":"She is feeling peckish"
        },
        "124":{
            "author_id":"waffles976",
            "author_name":"waffles976",
            "choices":[
                "Kelsey",
                "Your girlfriend Liz",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kelsey or Liz?</span></div></span></div>",
            "created":1338958800,
            "id":1354053,
            "title":"More?"
        },
        "1241":{
            "choices":[
                "Rub her feet",
                "Get some food",
                "Have some fun"
            ],
            "content":"<div class=\"\"><div> <span>You fade in and out of existance as you slowly wake yourself up, this was strange though as you cant remember doing anything to make you feel this dead.<br>\r\n<br>\r\nYou look up and see a vast flat landscape infront of you with huge mountains covering it, but somethings wrong, the ground looks like a bed and the mountains sheets, you look around only to find desks and walls, and then it hits you, you were in a giants room, or you were shrunken.<br>\r\n<br>\r\nYou think back to last night, you were sleeping round your friend kelsey's when you felt ill and went to sleep it off but now somethings happend and before you can think a screen of light blind you as you feel the ground start to move, you look up to see kelsey but she was different, she was as tall as a skyscraper!<br>\r\n<br>\r\n\"Cory you in here?\" She says, you jump up waving your arms trying to get her attention which sounds like a good idea but at this size you dont know, luckily you get your answer as she notices you, \"hey whats that?\" She gets on all fours and looks at you \"it looks like cory...\", \"its because it is!\" You scream, \"cory?\" She asks, \"how did this happen?\" before you reply you try to think but ultimately dont know \"i dont know, i just woke up like this, you think you can help me?\" you plea, youve been friends for so long you hope that will<br>\r\nHelp.<br>\r\n<br>\r\n\"Of course, anyway what are we going to do?\" She says</span></div></div>",
            "created":1380949200,
            "id":1674543,
            "title":"A friendly meeting"
        },
        "12411":{
            "author_id":"lolboy13",
            "author_name":"lolboy",
            "choices":[
                "She makes you keep rubbing. but takes off her socks",
                "She slips you into her sock and goes somewhere.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Of course I'll help you, Cory!\" You smile up at her and she smiles back down at you... but something about her smile just didn't seem right.\"But ... first, I've always wondered what it'd feel like to have a tiny man rub my big strong feet~\" Kelsey giggles and gets into bed, her massive body resting far away. You would have to jog for a good 45 minutes to get to her shoulders; she was so huge!! <br>\r\n<br>\r\n\"W-what are you doing?\" You stammer out, backing away as if that might do something. Kelsey only giggles in response.<br>\r\n<br>\r\n\"Getting a massage from my best friend in the whole wide world~ And Considering I'm your only friend that probably knows where you are in this whole wide world why don't you help a friend out?~\" Kelsey continues to giggle softly as she kicks off her massive shoes before you. They fall off and the scent of her sweaty track feet fill your senses. You blush and cough from how strong it is. \"Coach made us run a few miles today so they're going to be a bit more sweaty than usual but if I recall you don't mind that don't ya?~\" She giggles innocently again and wiggles her socked toes. You cough as you near the giant socked soles, her socks tinted gray from the sweat and dirt from her running shoes. The air around her feet smells entirely of her sweat and only has a hint of the body wash she used from her latest shower, whenever that was.</span></div></div>",
            "created":1548392400,
            "id":2607473,
            "title":"Quid pro Toe"
        },
        "1242":{
            "author_id":"jordanw69",
            "author_name":"Jwheels",
            "choices":[
                "Somebody else walks in",
                "She wants to have fun",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>You wake up with a bad headache not really remembering what happened last night, all you can remember is going over to your girlfriend's house after work telling her that your not feeling well and she offered you some tea you had it and then you went to bed. You groggily get up and notice that your surroundings are different from last night as they seem bigger you now notice there not big your tiny as you try to comprehend what's happening your surroundings move and jiggle a little bit, strange you think then you heard what to you sounded like a beast roaring but in reality was your girlfriend yawning and waking up. Morning baby did you sleep well in between my boobies last night? Uh yeah, but do you want to explain to me how this happened? The tea I gave you last night silly I was walking past a magic shop when I looked over and saw it I just had to get it, sorry for not telling you about this but don't worry I will take care of you. You are glad to here that well thank you sweetcheeks I'm gla to here that the question is what do we do now?</span></div></div>",
            "created":1472446800,
            "id":2203161,
            "title":"Your girlfriend Liz"
        },
        "12421":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "choices":[
                " You land on the tip of Brad's cock",
                "You land on Liz's stomach"
            ],
            "content":"<div class=\"\"><div> <span>Just then, Liz's cell phone went off. Liz squealed in excitement. \"Baby, that's Brad!! We've been sleeping together for a few months now, so sorry you have to find out this way... he'll be over in five minutes.\" <br>\r\nYour world comes crashing down on you as the door opens, revealing Brad, a tall blonde football player with a large bulge in the front of his shorts. Wasting no time, Liz snatches you up and embraces her real boyfriend, kissing him vigorously. Wasting no time, the two begin peeling away their clothes until they are bare naked and start fooling around.<br>\r\nAfter a moment, Liz releases you from her hand and...</span></div></div>",
            "created":1514696400,
            "id":2434857,
            "title":"How about we have some fun ;)"
        },
        "124211":{
            "author_id":"jgstratego",
            "author_name":"JGilliterate",
            "choices":[
                "Liz's mouth coming towards you",
                "Liz hanging off the edge of the bed shaking her ass in anticipation",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still slightly dazed from the landing, you lift your head to only be met with the sight of...</span></div></span></div>",
            "created":1528174800,
            "id":2503145,
            "title":" You land on the tip of Brad's cock"
        },
        "1242112":{
            "author_id":"jgstratego",
            "author_name":"JGilliterate",
            "choices":[
                "asshole.",
                "vagina."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You begin to close on Liz's rear as brad takes slow steps forward trying to decide on which hole he should enter first. Finally making a decision, you feel yourself rocket forwards as your vision is soon completely filled by Liz's...</span></div></span></div>",
            "created":1528174800,
            "id":2503147,
            "title":"Liz hanging off the edge of the bed shaking her..."
        },
        "12423":{
            "author_id":"james.foley",
            "author_name":"James F",
            "choices":[
                "Stacey",
                "Catie"
            ],
            "content":"<div class=\"\"><div> <span>This was actually a good deal, you didn’t like your job, and would quit if you could, and you can spend more time with liz.  “This actually sounds great, liz!” you said, trying to keep eye contact, instead of just staring at her uncovered breasts “glad to hear it,Oh yeah,” Liz said. “You’re gonna have to get along with my roommates.” That was gonna be a problem, her roommates weren’t exactly you biggest Fans.<br>\r\nOne of her roommates is Catie, and she doesn’t like you, If she found a tiny you, she would surely mess with you, humiliate you, or do something else to make you uncomfortable.  She didn’t like you, because you keep coming over  to hang out with Liz, that it annoys her.<br>\r\nHer other roommate was Stacey, You didn’t know Stacey very well, she’s only been living with Liz for a few weeks now, and fro the most part she kept to herself.  But that doesn’t mean she wasn’t attractive.  She was pretty tall, with D cup breasts and a huge ass.  Liz has told you, that even though she does her part, she does tend to be pretty apathetic, and she may not care to look for a 2 inch boy, or care to move if she’s sitting on one.  Also you will soon learn that when Stacey thinks she’s alone, she has some of the worst gas you’ll ever experience.<br>\r\n“What if we just didn’t tell them?” you asked.  That wouldn’t work, if they saw you, they’d either think you were a bug or rodant, and try to kill you, or realize that it’s you, think you’re a pervert, and then torture or kill you.  That kinka scared you, Liz noticed this, and said. “Don’t worry It would be pretty difficult to kill you.  You can be eaten, or some one could try to crush you, or pretty much anything else, and you won’t die, but that’s not saying it won’t hurt, you’ll still feel some pain and discomfort, but not much.” That made you feel a whole lot better.  “So what now?” you asked.  “We have to wait for Stacey and Catie to get back from their classes, It’s Thursday, so I don’t have any.” She replied.  “So what should we do in the mean time?” you asked.  “Oooh there’s something I wanted to try.”  She said. Putting you on her bed.   without warning she turned around and sat her naked but right on top of you.  She then wiggled her butt to make sur you were snug.  “You know, you might be even comfier like this than full size.” She said with a giggle.  Luckily you weren’t against her asshole, so it wasn’t all bad, and it didn’t smell too bad either.  <br>\r\nSoon Catie and Stacey got home, and Liz told them the situation.  As you guessed, they weren’t too excited about hearing what Liz said, that is until she pulled you out of her cheeks, and then Catie agreed suspiciously quickly, and Stacey’s interest was peaked.  So, I’m gonna spend some more Time with Cory today, and he’ll sleep in my room, but tomorrow one of you can spend some time with him.<br>\r\nWho will you spend tomorrow with?</span></div></div>",
            "created":1578032400,
            "id":2768620,
            "title":"meeting the roommates"
        },
        "124231":{
            "author_id":"james.foley",
            "author_name":"James F",
            "choices":[
                "Back",
                "Front"
            ],
            "content":"<div class=\"\"><div> <span>You spent the rest of the day with liz, and for a while it was going pretty good, then Liz fold you she had to go to cheerleading practice.  “Do you really have to go?” you asked.  “Don’t worry Cory, you’re coming with me.” She said nonchalantly.  “Huh, can’t I just stay here.” You asked.  “No way, I want to spend the whole day with my tiny boyfriend, and You’ll have to get used to coming with me to practice.” She said.  She then grabbed her bag, and headed to the practice place, with you in her cleavage.  Once she got there, she went in the locker room to change.  She set you down on one of the benches, and you were amazed at the sight of so many attractive girls, in various levels of nudity.  But then Liz started changing, while you were distracted, you didn’t see her bare butt come down on top of you.  Liz then pulled up her panties and skirt, and whispered to you. “I have to keep you in there, if I left you in my cleavage you could fall out, and its not like I have pockets.”  You didn’t have time to respond, as liz’s panties snapped back into place, and there you were, stuck between your sexy girlfriend’s buttcheeks.  Because liz was captain, she had to do so many flips, and cartwheels, and just all around moving.  This made you feel motion sick, but eventually the practice ended, and you both went back to Liz’s house.<br>\r\nAll of you ate dinner, then Liz took you to the bath, it was one of the best experiences you’ve had.  The water was nice and warm, and you got to explore her body by diving, like scuba diving.  It was definitely worth putting up with the Cheerleading practice.<br>\r\nThe next day, After Liz woke up and got dressed, she took you to Stacey’s room, and opened the door a crack, and dropped you inside.  You both blew kisses, then she left to go to her classes.  Stacey didn’t have classes on Fridays, so she was sleeping in, You approached her be, and climbed some sheets, eventually reaching the top of the bed.  Once you got top of the bed, you were treated to the wonderful site of Stacey’s massive butt, beause she was laying on her side.  It was easily the biggest butt you’ve ever seen.  Cory walked up to it, and put his hand on it, then pushed his whole body against it to feel its warmth.  He then tried climbing her left buttcheek.  Once her reached her crack, he noticed that there was a sizable gap between her cheeks.  He crawled under her right cheek, it was a kind of a tight squeeze, and slowly approached her butthole, but once he got about halfway to her butthole he started smelling an undesireable scent.  You then figured that it was a butt, and would smell bad, so you started making your way back to the bed, but then, Stacey started to roll in her sleep.  She rolled on her…</span></div></div>",
            "created":1578190680,
            "id":2769393,
            "title":"Stacey"
        },
        "1242311":{
            "author_id":"james.foley",
            "author_name":"James F",
            "choices":[
                "Make it up to me",
                "Spend tomorrow with Stacey"
            ],
            "content":"<div class=\"\"><div> <span>You just finished rotating halfway around, when you felt your surroundings shift, as Stacey rolled over on her back, trapping you in place, you stayed there for a while, but the intence heat, and the soft flesh surrounding you made you fall asleep.  Stacey woke up a few hours later, at about noon.  She sat up strait, which woke you up.  She scratched her right cheek, then thinking she was alone, let out some gas.  <br>\r\nPPPPPPPPPPFFFFFFFFFFFFFTTTTTTTTTTTT<br>\r\nIt was the absolute worst thing you’ve ever smelled.  Stacey then got up, grabbed some clothes and put them on.  You were brought closer to her smelly butthole by Her thong.  Then she put on a skirt, and a shirt, and went to her computer.  <br>\r\nYou felt her walk a few steps, then you felt her rear fall into the seat, causing her butthole to come close to you.  \"Whew, that was close.\" you said, feeling releived.  Just then, PPPPPPFFFFFFFFFFFFFFFFTTTTTTT another toxic fart.  You struggled, and kicked, to get Stacey's attention.  She noticed this, but didn't do anything, because she didn't feel like it.  Stacey browsed the internet for a while till she got hungry at around 2:00PM she went into the kitchen, and ate some left over tacos.  After that she went back to her room to continue browsing.  At around 4:00PM Catie, came home, where she saw Stacey.  \"Hey Catie.\" Stacey said.  \"Hey Stacey, how's it going with Cory?\" Catie replied.  \"Stacey was surprised, then remembered, the conversation you all had lastnight, and then she rememebered that annoying itch in her butt.  \"Oh, He must be that itch in my butt.\" Stacey said nonchalantly.  \"Really, that's hilarious, how long has he been in there?!\" Catie asked between laughs.  \"I don't know, I started feeling him when I woke up, so a tleast four hours.\"  Stacey said.  \"Are you gonna take him out?\" Catie asked.  \"Eh, Liz will be here soon enough, I’ll take him out then, It just seems like a lot of work, plus, it serves him right for being a pervert.” Stacey said.  She then walked away, then promptly let out more toxic gas.  PPPPPPPPFFFFFFFFFTTTTTT  Catie and Stacey, laughed, while you had to live through the worst smell ever.  One hour later, Liz got home.  “Hey Stacey, How was your day with Cory?”  Liz said.  “Pretty good.” Stacey said.  “Can I see him?” Liz said.  “okay, gimme a sec.” Stacey said.  She then, pulled down her skirt, and panties, and moved her hands through her cheeks to try and find you.  A couple seconds passed, before Stacey finally pulled you out.  “Here he is.” Stacey said.  “How long was he in there?” Liz asked, astonished.  “All day.”  Stacey said nonchalantly.  “ALL DAY!?” Liz said, bewildered.  “Yeah, I woke up, and I felt this weird itch in my ass, and it turns out it was Cory.” Stacey said. “What was Cory doing in your ass??” Liz asked.  “I don’t know, but I bet he regrets it now.” Stacey said, giggling.  She handed you to Liz, and she brought you to her face for a kiss, but then got a whiff of you and pushed you away.  “PEWW, Cory  smells like crap.” Liz said.  “Yeah, I may have let a few loose on him today.” Stacey said snickering, and walking back to her room.  Liz then brought you to the bathroom, filled the bath, undressed, and stepped in with you.  You told her what happened today, while swimming by her massive breasts.   She thought for a minute, then said.  “I’m not mad, that you tried to be a pervert and spy on Stacey, but it sounds like Cheating.” Liz said.  “I wasn’t cheating.” You said.  “I know, but as punishment, You’ll have to…</span></div></div>",
            "created":1582407240,
            "id":2791337,
            "title":"Stuck in Stacey's ass"
        },
        "1243":{
            "choices":[
                "a shrinking machine",
                "a shrink ray",
                "shrinking formula"
            ],
            "content":"<div class=\"\"><div> <span>My name is Cory. I'm your average 18 year old guy. I'm fairly muscular &amp; athletic from playing football, wrestling &amp; lifting weights. I have blond hair with green eyes. I normally stand 6 feet 3 however I got shrunk down to size when I went over to my best friend Sam's house after school this friday afternoon which was the beginning of spring break. My parents &amp; his parents were both out of town for a couple of weeks so I'm going to be staying with him for a couple of weeks.<br>\r\nSam my best friend is also 18 but is noticeably shorter standing just 5 feet 8 with brown hair &amp; brown eyes. Sam seems to be larger than me because of his shorter yet larger muscular frame from football wrestling &amp; lifting weights. He is very powerful looking as he already had a naturally muscular build &amp; he easily puts on muscle. Sam's dad is a genius scientist that is always inventing stuff &amp; working on different formulas. Sam's mother works in town at the local mall.<br>\r\nAfter school let out for spring break I drove over to Sam's house &amp; walked up to the front door of his large house with my things. I knocked &amp; waited for him to answer. A few minutes later Sam opened the door &amp; let me in. Sam led me up to his bedroom where I set my stuff down on the extra bed. As I was sorting through my things Sam asked, \"hey do you want to check out dad's lab downstairs?\" I replied, \"yeah. I've always been curious about his lab.\" We quickly ran down stairs to his dad's lab.<br>\r\nAs soon as we walked in I started walking around looking at everything. There were all kinds of equipment, tables with test tubes, beakers with different colored liquids &amp; machines. However as I continued looking around, something in the center of the room caught my attention. What was it?</span></div></div>",
            "created":1392786000,
            "id":1748562,
            "title":"Readers choice"
        }
    },
    "info":{
        "author_id":"waffles976",
        "author_name":"waffles976",
        "brief_description":"What happens when you shrink around your friends and family? GP for good chapters",
        "created":1339018920,
        "description":"<td align=\"left\" class=\"norm\">What happens when you are shrunk around friends and family? I won't really delete anything this story is yours as much as it is mine. :)<br>\r\n             <br>\r\nYou: your name is Cory your 18 and an average guy in for the ride of your life.    <br>\r\nFriends:      <br>\r\nDacia- 19has a crush on you. Very flirty. E cup. .<br>\r\nRenee- 19 your ex who didn't like the way things ended between you two. D cup<br>\r\nTeigan- 17 she's a playful girl. Might get kinky if she found you ;). Big ass. C cup<br>\r\nKelsey- 19 friend since grade school. Runs track plays volleyball and basketball. she likes to make you rub her feet all the time. C cup<br>\r\nLiz- 19 your girl friend. She is a cheerleader and She likes to sit on you alot. Huge ass. D cup<br>\r\nCatie: 18 not a big fan of you. <br>\r\nMaggie: 18 curves in all the right places. You two had a slight falling out as friends.<br>\r\n<br>\r\nFamily:<br>\r\nSydney- 23your sister who picks on you alot. D cup<br>\r\nMarissa- 16 your little sister who loves to annoy you. B cup<br>\r\nChristine- 19 your sister who is both playful and mean. D cup<br>\r\n<br>\r\nBONUS GP IF YOU ADD AND START A CHARACTERS STORLINE</td>",
        "id":1872127,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1598637120,
        "modified":1598637120,
        "pretty_title":"Shrunk!? (GP for any adds)"
    }
}