{
    "chapters":{
        "1":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "FUN AT HOME!",
                "WATER PARKS!",
                "SCHOOLS IN!",
                "OTHERS",
                "DIFFERENT START."
            ],
            "content":"<div class=\"\"><div> <span>All your life you had been surrounded by big women who smelt terrible, and that wasn't all. It seemed as though you were next to invisible unless you literally screamed in their faces. All your life you had thought of it as a bad thing but once you had hit puberty you had started to like it. <br>\r\n<br>\r\nAs of right now you were a 14 year old boy living with your gigantic mother and gigantic sister. Your sister was 18 years old and more then once had she sat on you with no clothes on while you were on the couch and then pulled you up with her ass. <br>\r\n<br>\r\nYour mother was about the same in terms of activity but her ass was much larger. You could probably clutch onto one of her ass cheeks with your whole body and barely be able to contain it.<br>\r\n<br>\r\n<br>\r\nNow, what do you want to do with your new fantasies?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<u>FUN AT HOME!</u><br>\r\n<br>\r\nYou decided that you should start your adventure at home with your attractive family members. the question is, which one?<br>\r\n<br>\r\n<u> WATER PARKS!</u><br>\r\n<br>\r\nWater parks had always been a hotspot for skimpy women and when combined with your powers, gigantic women who cannon-balled with panties that were barely visible in their crack. You could even potentially turn yourself into a pair of panties waiting for the women to come back and put you on after their long day.<br>\r\n<br>\r\n<u>SCHOOLS IN!</u><br>\r\n<br>\r\nYou see that it's a school day and decide to take the bus to school. Fortunately for you, the only other women who take the bus are the biggest women in your school.<br>\r\n<br>\r\n<u>OTHERS</u><br>\r\n<br>\r\nOther locations to go to within this scenario.<br>\r\n<br>\r\n<u>DIFFERENT START</u><br>\r\n<br>\r\nStart off the story differently! Perhaps you're a 25 year old office worker or maybe you're even a woman? Who knows!</span></div></div>",
            "created":1560488400,
            "id":2673281,
            "title":"An Epiphany."
        },
        "11":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Sister",
                "Mother",
                "A distant family member moving in?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1560488400,
            "id":2673308,
            "title":"Which family member?"
        },
        "111":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Her Bathroom. More Specifically, hanging out in the bathtub.",
                "Under her bed for now until she comes back.",
                "Inside one of her cushions, each that are big enough to hold one buttcheek"
            ],
            "content":"<div class=\"\"><div> <span>Your sister's name was Claire. She was a brunette with about shoulder length hair. She had a chubby face as well. The big kicker was that she was gigantic in more ways than one. Not only did she have a big belly, but she also had big boobs and a big butt. Her butt could completely cover a 4 person couch as you've experienced more than once before. <br>\r\n<br>\r\nYou decided to go to your sister's room to get up close and personal with her in her \"lair\". You told your mom you were staying the night at a friend's place so she wouldn't worry about where you were and possibly would walk around naked. It was almost dinner time so you waited outside your sister's room for her to leave. Eventually, your mom called her down and you saw her ginormous ass pass by your face, a pleasant smell (To you) wafting over and giving a taste of what's to come. <br>\r\n<br>\r\nYou go inside the dark room and turn on the lights. You look around for places to experience your sister's ass and you decide on... </span></div></div>",
            "created":1560488400,
            "id":2673346,
            "title":"Sister Dearest. "
        },
        "112":{
            "author_id":"meandmyak74",
            "author_name":"darksolgryn",
            "choices":[
                "Her room while shes waking up",
                "Her bathroom while shes taking a bath",
                "Her gym you'll get there before her to set something "
            ],
            "content":"<div class=\"\"><div> <span>          Today you decide to set your sights on your mother a incredibly large lady wide and tall in all the right places even though shes let her self go shes still rocking her curves, At least you had almost always thought that when ever you actually got to see her. Almost every interaction you've had with your unintentionally forgetful mother has ended up with you under her or in some smelly position as her ass alone can easily hide your entire body and. Even for you her gym days are pretty bad your mom isn't exactly the cleanest person and forgetful as she is can just forget to wipe which isn't always a good combo with your desire to be under her.<br>\r\n<br>\r\n          But where will you set your sights on today, you know that today is her gym day so she will be heading to the gym but before she leaves she be in her room and the bathroom as your mom is a pretty pattern heavy person always doing things in certain order and you have time to set up for all 3 so what will it be?<br>\r\n</span></div></div>",
            "created":1561870800,
            "id":2680615,
            "title":"Mother"
        },
        "1121":{
            "author_id":"meandmyak74",
            "author_name":"darksolgryn",
            "choices":[
                "press your luck and crawl in ",
                "hide in her drawers maybe with more than just panties",
                "hide in her home clothes and wait for your sweaty mom to get home and change"
            ],
            "content":"<div class=\"\"><div> <span>          You opt for getting to it as early as possible to ensure your mom is completely unaware of you and what your doing. You know your family is very unperceptive of you but you still wanna give your self the best chance to go unnoticed  so you creep down the hallway, and slowly open your moms door and peek in shes still asleep from her meal last night currently laying on her side and snoring. You slowly let your self in and close the door as quietly as you can behind you. Now in your mother's room you take a good look around to survey your options but something in side you tells you to just go for it and you listen. you climb up your moms huge bed of which she takes up most of, and slowly move under the covers. <br>\r\n<br>\r\n          With you now under the covers you get a rare glimpse you see your moms nude rear in its full glory the two mounds of ass flesh you've been under more than you'll admit but you rarely get to see them on display since your sight normally goes dark immediately afterwords. each one easily weighs as much as two of you or more they glisten with the sweat from the heat there putting off and honestly smell more like your home than your room just from the sheer amount of time you've spent in your moms sweat. you had never had the time to notice but they as large as they are form vaguely heart shape making you joking think your moms ass loves having you there. but as you sit there you notice that you've been moving closer and closer and that if she rolls over you'd be stuck before she goes to the bathroom. <br>\r\n<br>\r\n          You can press your luck and your moms ass and push your self into her cheeks where you know from experience you would be stuck until she goes to the bathroom at least which may end up with you in a unsavory position. You could back off and look for a different place to hide in your moms room knowing her it wouldn't be to hard to put your self in her drawers or closet. or you could go for the long hall and put your self in her home clothes she normally doesn't shower before she gets home so it would be wet work to say the least.</span></div></div>",
            "created":1561870800,
            "id":2680695,
            "title":"Her room while shes waking up"
        },
        "1122":{
            "author_id":"meandmyak74",
            "author_name":"darksolgryn",
            "choices":[
                "throws you into her gym bag (used to wipe your mother or someone else)",
                "back in the tub for your sister to use",
                "into her gym sweat pants to dry her ass's sweat"
            ],
            "content":"<div class=\"\"><div> <span>          You opt for getting to it as early as possible to ensure your mom is completely unaware of you and what your doing. You know your family is very unperceptive of you but you still wanna give your self the best chance to go unnoticed so you creep down the hallway, and slowly open your moms door and peek in shes still asleep from her meal last night currently laying on her side and snoring. You slowly let your self in and close the door as quietly as you can behind you and. After your in you slowly creep past your moms huge bed and into her massive bathroom with everything to you comically oversized you have to work at it for a second or two but you fairly easily manage to climb into her tub and to make sure you pull your moms towel over you knowing your mom will move the towel with out thinking about it and most likely add to your chances of not being spotted and there you wait...<br>\r\n<br>\r\n          After an hour or so you hear her alarm go off and your mom shuffling about with her morning gas as she gets out of bed. Eventually she groggily comes into the bathroom and you hear her shuffle over to the toilet for her morning business. After letting fart after eggey fart she eventually flushed the toilet and then you hear her shuffle over to the tub and. Your plan seemingly goes off with out a hitch your mom climbs into the tub but as her foot steps on your waist you think your covers blown but as she pulls the towel off but much to your surprise she nonchalantly moves the towel and you see her start the water and the next sight you see is your moms huge ass come into view as she steps back onto your waist apparently to out of it still to feel you or your hard on as she moves to sit down you notice she had once again forgotten to wipe and sits down either luckily or unluckily  her brown dirty hole lands right over your mouth as the pressure forces the rest of your face in you try and pull out more so from lack of oxygen than a unwanted situation witch you eventually achieve with a kinda gross *plop*. as you pull your head out you feel your mom move and slightly panic you know it wouldn't be the first time and your mom is pretty forgiving but this is the first time part of you has been inside of her so she might be a bit more unforgiving.<br>\r\n<br>\r\n          these thoughts race through your head as your mom reaches back and grabs a hold of you this time you know the jig has to be up as she pulls you around with one hand on your foot as she easily hoists you to her face. However as she lifted you, you notice that she is still pretty out of it as she only glanced at you before saying<br>\r\n<br>\r\n\"Oh that's where my sponge got to i had been looking for that i had been meaning to clean up in case i sit on *your name* again\"<br>\r\n<br>\r\n          as she unknowingly moved you around back to the grime covered bottom your mom had been meaning to keep you safe from. in a way you were thankful that your mom had her way of caring about you when she did see you but on the other hand as much as you like the smell of your mom normally when she forgets to wipe even for you its was off putting just the sheer smell alone is enough for most people to leave the room but now you were getting shoved straight back into the smelly prison as your mom mistakenly used you as a sponge the smell was terrible but not entirely unpleasant as it wasn't the first time you had been sat on after a no wiper as your mom shoved you deeper though you came once again face to face with her grime covered hole this time taking in the sights and smells you've been close to this hole more than once but what happened next was new. Your mom after smashing and rubbing your face on her hole started pressing your face into it and pushed you into her smelly hole with the added light you notice just how dirty it is but have little time to consider it as your mom shoves you almost entirely into her ass minus your legs where shes grabbing slathering you with the gross stuff as your pulled out thankfully the stuff mostly washes off but it smelled really bad compared to your mother's fairly pleasant scent. your plunged in and out of her dirty hole as she for the first time you can remember properly cleans her ass. as you really have no control over the situation what happens next?<br>\r\n<br>\r\nYour mother thinks your a sponge still but she<br>\r\ndrys you off and throws you into her gym bag, back in the tub for your sister to use, or drys you off and puts you into her pants to dry sweat for her gym visit<br>\r\n</span></div></div>",
            "created":1561870800,
            "id":2680718,
            "title":"Her bathroom while shes taking a bath"
        },
        "11222":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Waiting for your ride. ",
                "From the Top!",
                "WAIT UP MOM!"
            ],
            "content":"<div class=\"\"><div> <span>Your mom then drops you back down in the tub and then leaves, but not before yelling \"HONEY THE BATH IS OPEN!\". Alerting your sister since there's literally no one else in the house she calls honey because she usually calls you by your name. <br>\r\n<br>\r\n<br>\r\nWhen the exhilaration of being literally treated as both a sponge and an asshole cleaner over you stop to realize that your mother only did that because she was tired out of her mind and the fact that she wasn't a morning person. Your sister, on the other hand, was very much a morning person and could be able to have the thought that 'The sponge isn't supposed to be this heavy' and move to investigate. This, of course, would get you caught. So you decided to take a different route to have fun around your sister as well. <br>\r\n<br>\r\n<br>\r\nAfter a bit of thinking you decide to...<br>\r\n<br>\r\nA: Wait for your sister to drop off her after shower clothes and hop in.<br>\r\nB: Lie down like before with the towel and everything and hope your sister doesn't feel you under her. <br>\r\nC: Just leave the bathtub for now and get to your mom before she leaves. </span></div></div>",
            "created":1565067600,
            "id":2697881,
            "title":"Round Two."
        },
        "112223":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Yss",
                "No",
                "You run into your sister as she makes her way to the bathroom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to hop out of the bath and try to catch your mother before she leaves. \"Hold up mom!\" You yell out to your mother. You run out of the bathroom and try to catch up to her, but do you get her before she leaves?</span></div></span></div>",
            "created":1570251600,
            "id":2728388,
            "title":"WAIT UP MOM!"
        },
        "1122231":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "BBW Photoshoot.",
                "Plush Cushion.",
                "Amusement Park Fun."
            ],
            "content":"<div class=\"\"><div> <span>You sprint at full speed through the hallways of your house, clothes dripping from the recent bath you were involved in. As you reached the front door you noticed your mom bending over to tie her shoes, leaving her ass in the air and her asshole basically revealed as the shorts were forced to slide down from the bend. With not a moment to lose you dove into her pants and slid down them as if you were wearing them yourself. Your legs went about a quarter down the legs of her jeans and your face was situated with her lower back. <br>\r\n<br>\r\nOf course, you could've slid yourself to be in front of her asshole but this was only a temporary position, and you'd have alot more to do later at your moms work. Your mom finally unbent and with it her cheeks clenched all around you, locking you in place with a vice grip, not that you minded. Your mom also pulled up her pants, elevating your face to around her middle back, thankfully under her shirt. You noticed her Custom Ordered Bra that she was forced to purchase due to her size hugging her back. It was made to be purple, a color that you knew was her favorite color. <br>\r\n<br>\r\nYour mom started to walk, causing you to pseudo walk as well, considering your legs were basically strapped to her thighs. Your mom got into her car, a very large van with custom seats and steering wheel position as she couldn't fit in other cars safely. With all these custom ordered things, you'd think it would be burdensome to pay but it wasn't, in sole part to your father's insurance. He payed big money for insurance in case something tragic happened to him and sadly, he died in a car crash from a drunk driver. It took a while but your family got over their grief and your mother was looking for a new partner. Surprisingly, your mother came out as Bi-Sexual leaning towards the female side, showing just how much she loved your dad.<br>\r\n<br>\r\nYou felt your mom sit down on the seat, or more accurately you and the seat. She didn't feel you at all which made sense, you probably just felt like more fat. Your mom drove in her car through the summer heat. The Van's air conditioning was broken so she was sweating a lot, but that only made you happier. The heat wasn't a problem either considering you were used to much hotter, generally from Sauna's. <br>\r\n<br>\r\nYour mom pulled up to her workplace after a half hour drive and walked towards...<br>\r\n<br>\r\n<br>\r\nA: A BBW Photoshoot. Your mother is the main star but there's also many other huge BBW's that came for a share of the cash.<br>\r\nB: A Plush Factory. All the pushes are given different faces but are all about the same size as you. Perfect chance to blend in and become a fart cushion for a random woman.<br>\r\nC: An Amusement Park. (Reader's choice as to where in the park she works.)</span></div></div>",
            "created":1574022900,
            "id":2747942,
            "title":"Catching Up."
        },
        "1123":{
            "author_id":"meandmyak74",
            "author_name":"darksolgryn",
            "choices":[
                "to the bench press to take a nap",
                "to the desk to try again with the gym owner",
                "to the locker room to hide for your mom barring something happening"
            ],
            "content":"<div class=\"\"><div> <span>          You decide you'll go for the third option and get dressed before your mom is even awake and start jogging to the local gym you can drive but if you take your moms car you know she'll just not go and that's against your plans for today. the jog is pretty uneventful and you get there in about an hour you and know it will still be an hour or so before you mom gets dressed and gets going the gym. the gym is pretty much built around big and tall women the equipment is all far to large for you to actually use but there is some mattes and a small track for those of smaller/normal stature. you know that you've got time and its still pretty early so you decide to crash somewhere till your mom shows up.<br>\r\n<br>\r\n          to your right is a normally pretty empty area that has benches for pressing but can occasionally get a few meat heads and athletic women, <br>\r\n<br>\r\n          dead ahead of you is the gym owner and desk shes a bbw that is both overweight and ripped beneath her flab is rock hard mussel you remember first meeting her when your mom dragged you to the gym after siting on you while you were asleep on the couch you fell outta your moms ass in the gym shower and woke up the the gym owner slipping and falling on you at first it felt like your moms ass nice and soft but as more weight set in you felt the solid wall that was her muscle unlike your moms ass hers actually hurt between the sheer weight and the solid surface that was her cheeks that alone left bruises thanks to your moms shower you slipped out from under her but not with out some work. currently shes stretching and doing toe touches and not looking half bad.<br>\r\n<br>\r\n          to your right is the locker room where you know you'll run into your mom but you'll have to avoid the other early arriving girls to have your chance with her if you want to avoid them that is</span></div></div>",
            "created":1561870800,
            "id":2680728,
            "title":"Her gym you'll get there before her to set ..."
        },
        "11231":{
            "author_id":"coolcody2005",
            "author_name":"CABurn2005",
            "choices":[
                "go into the showers and wait",
                "hide in a towel and hope for the best"
            ],
            "content":"<div class=\"\"><div> <span>You decide to take a nap on the bench press. You slept for aeound five minutes before feeling something warm and heavy on your face. You wake up to see someone sitting on you, preventing you from moving. They rip a huge, wet fart on you, and tben press their ass against your face. Just when you thought you'd suffocate, they lessened the pressure to allow you to breathe, and then let out a bice, long, huge fart on your face. (30 seconds) They got up and walked away, and you realuze that your mom will be here any minute.</span></div></div>",
            "created":1568869200,
            "id":2720890,
            "title":"to the bench press to take a nap"
        },
        "11233":{
            "author_id":"meandmyak74",
            "author_name":"darksolgryn",
            "choices":[
                "Under the blonde with the colossal ass.",
                "Under the brunette doing leg day.",
                "Shoved into a Locker."
            ],
            "content":"<div class=\"\"><div> <span>          You decide to head into the locker room normally men would be stopped but for whatever reason you never seem to really be noticed unless your yelling at the women in your life. and today is no exception as you walk straight past the gym owner with out so much as a glance and wander on in to the gym's locker room.<br>\r\n<br>\r\n          The locker room is fairly bland with the exception of the pair of girls carrying on a conversation one is a fairly over weight brunette and the other is a blonde with a HUGE ass her sweat pants are currently on the ground as shes pulling out the rest of her clothes your no expert but knowing your moms clothes there is no way those pants are not tight. while the brunette is getting out a pair of jogging shorts she looks like she takes care of her self seemingly sharing in the gym owners style of mussel under flab her mid section is toned but the rest of her is over weight.<br>\r\n<br>\r\n          Your still going over your options when the gym owner comes in behind you unknowingly pushing you aside but where do you end up<br>\r\n<br>\r\n1. You end up on the bench under the fat ass blonde as she works on pulling up her overly tight sweat pants<br>\r\n<br>\r\n2. You end up getting pushed towards the brunette as she finishes pulling on her running shorts<br>\r\n<br>\r\n3. You get shoved into a locker as the door shuts its close to where you think your moms is but your not sure if its hers or just close to it</span></div></div>",
            "created":1562043600,
            "id":2681578,
            "title":"to the locker room to hide for your mom barring..."
        },
        "112331":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Use the Toilet.",
                "Go home and take a shower in her bathtub.",
                "Change her Clothes."
            ],
            "content":"<div class=\"\"><div> <span>You stumble towards the bench and finally land. When you look up you notice an ass that could literally hold an entire person inside of it. Looking down you notice a pair of sweatpants that are only around the legs and not pulled up yet. This is literally the exact scenario you were looking forward too, tight pants squeezing you into a fat girls crack. <br>\r\n<br>\r\n<br>\r\nWith these perverted thoughts in mind you decide to drop off the bench essentially wear the pants. Thankfully, the woman was preoccupied with other things and literally twice your size. You stuff your legs into the legs of the sweatpants and lie down on the floor. Eventually the woman finishes what she was doing before and bends down to pull up her pants. Your head gets pulled up into her crack and you wedge your face into her crack. IT seems as though the woman didn't wear panties and that made you go face to face with her asshole. The woman soon after starts walking towards her workout equipment. After a long time under her sweaty ass (and enjoying every second of it) the woman decides to...<br>\r\n<br>\r\nA: Use the Toilet (Your head is stuck in her ass and you end up substituting her toilet. She finds you and you explain yourself. She figures that having a permanent toilet wouldn't be so bad and let's you stay.)<br>\r\nB: Go home and take a shower in her bathtub. (All the woman in the house are immensely obese so the bath is massive. You decide that staying inside the bath would lead to more women sitting on you.)<br>\r\nC: Change her clothes. (You end up dropping on the floor and the woman runs out. It seems as though this woman was an employee on vacation and the manager asked her to lock the doors. You end up locked inside the empty gym.<br>\r\n</span></div></div>",
            "created":1566622800,
            "id":2707326,
            "title":"Under the blonde with the colossal ass."
        },
        "113":{
            "author_id":"syrotheshifter",
            "author_name":"SyroTheWritten",
            "choices":[
                "Your Aunt",
                "Your Cousin",
                "A different relative"
            ],
            "content":"<div class=\"\"><div> <span>You had almost forgotten! Some of your female relatives were going to be staying over for the week! You remember them from the last family reunion, and the thought of it gets you excited just thinking about them!<br>\r\n<br>\r\n<i>Knock knock</i><br>\r\n<br>\r\nThe knocking at your door brings you back to reality, maybe it's them! You jump up to go open the door when you hear your sister shout<br>\r\n<br>\r\n\"I'll get it mom!\" She bulldozes over you, knocking you to the floor. You hear her open the door, but when you look up you can't see who's at the door through her large thighs and rear. When she moves out of the way though the your eyes focus on the relative who you had fantasized the most about since you realized how much you enjoyed women's rears<br>\r\n<br>\r\n1. Your aunt, Patty, she's shorter than your mom but equally or perhaps even wider than her! An insatiable eater who can spend hours eating, and an equal amount of time lounging listening to her relaxing music playlist, it'd be almost too easy to get hours of time under her!<br>\r\n<br>\r\n2. Your cousin, Amy, a 16 year old girl who you're pretty sure would never leave the house if it wasn't for her mom/your aunt. She's a huge tech addict always tapping away on her phone, doing stuff on the computer, or gaming on any available console. You can only imagine the last time she showered, and you're looking forward to \"spending some quality time\" with her.<br>\r\n<br>\r\n3. A different relative who came with them. Reader's choice</span></div></div>",
            "created":1561870800,
            "id":2680635,
            "title":"A distant family member moving in?"
        },
        "1132":{
            "author_id":"syrotheshifter",
            "author_name":"SyroTheWritten",
            "choices":[
                "She goes to use the family computer",
                "She needs to use the bathroom",
                "She's going back to your room to set up the electronics she brought over"
            ],
            "content":"<div class=\"\"><div> <span>Amy, short for Amelia, your cousin. You have to admit, you've been fantasizing about her for awhile. She's about a head taller than you with curly black hair, and she's pretty fat. Amy's got big belly, and her butt is large and plump, comparing it with your sister by a very small margin Amy has the larger rear. She's wearing a dirty white shirt, and elastic black shorts. Both of which look like they're hanging on by a thread. <br>\r\n<br>\r\nYou're very excited that she's staying over because you never got any chances to be sat on by her during the last family reunion so this was your big chance!<br>\r\n<br>\r\nCurrently she's staring at her phone, ignoring your sister and mom who are both at the door welcoming her and your aunt in. You scramble to your feet as they walk in to avoid being stepped on. Mom and Aunt Patty are chatting it up, and your sister Claire is attempting to coax a conversation out of Amy. All Amy does is look up at her and asks <br>\r\n<br>\r\n\"Which room am I staying in?\" Claire sighs and tells Amy that she's staying in your room. Wait she's staying in your room? You weren't told about this, but it's not unwelcome news at all! After hearing that you're definitely going to sleep in the same bed as Amy and not on the couch like they were probably going to force you to. (though any other time you'd very much like to sleep on the couch, most of the time when you do you're woken up by someone sitting on you) But of course it's midday so she's not likely to go to bed yet. You're going to follow very closely behind her to try and indulge yourself, so what does she do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1561870800,
            "id":2680735,
            "title":"Your Cousin"
        },
        "11323":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "In the Obvious Place. ",
                "Butt Floss Man.",
                "Waiting."
            ],
            "content":"<div class=\"\"><div> <span>You follow behind Amy in a path that's very familiar to you. She was heading straight to your room. For what reason? You could only assume she wanted to get her set up ready. Sure enough, as soon as she enters your room she pulls out 2 consols from her bag and plugs them into your TV. She also sets up a beanbag chair with various marks and stains, presumably her permanent gaming seat. <br>\r\n<br>\r\nRight next to her beanbag chair she drops a bag of towels that are rolled up. On the bag is marked \"butt floss\" which gives you some ideas of future plans. After this Amy leaves the room for whatever reason.<br>\r\n<br>\r\nThe only thing you do know about her going out is that she's going to come back soon. There was one place you wanted to be and that was...<br>\r\n<br>\r\n<br>\r\nA: Right on her cushion so she sits right on top of you. It'll be a long gaming session, that's for sure. <br>\r\nB: In the bag titled Butt Floss. You hold your arms tight together and curve yourself like a towel. You make sure to go a bit deep so she's nice and sweaty by the time she uses you.<br>\r\nC: On your bed for now so you could wait for her to come in and decide then. </span></div></div>",
            "created":1564981200,
            "id":2697845,
            "title":"Big Setup."
        },
        "12":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Changeroom.",
                "Sauna.",
                "Diving Pool.",
                "Towel Area.",
                "Something Happens. "
            ],
            "content":"<div class=\"\"><div> <span>You decide to walk over to the waterpark. Of course, you could've taken the bus but it would be likely that you would be interrupted and taken away from your destination. Thankfully the water park was very close by. You approach the gates and simply walk into an unattended one. Normally, people would be seen doing this and kicked out but your natural \"Stealth\" made it so no one noticed you. You look around and decide to go to...<br>\r\n<br>\r\nA: Changeroom. Lots of women changing giving you the perfect opportunity to hitch a ride.<br>\r\nB: Sauna. A guaranteed place for sweaty women to converge. Also, you could just wait on a bench for someone to sit on you.<br>\r\nC: Diving Pool. Women will be jumping from high up and could land directly on top of you.<br>\r\nD: Towel Area. A bunch of people sunbathing will give you time to situate yourself. Of course, you could also go on an empty towel and wait.<br>\r\nE: Something happens?</span></div></div>",
            "created":1566450000,
            "id":2706183,
            "title":"Getting Wet."
        },
        "122":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "9 Years Old",
                "15 Years Old",
                "21 Years Old",
                "30 Years Old"
            ],
            "content":"<div class=\"\"><div> <span>You had to try and figure out where’s the best solution to get sit on by obese, gigantic females?  Of course there were so many options to choose, but obviously, you wanted to go somewhere private, so nobody would see you doing strange things in particular.  There was one however that stands out the most, and it was your decision to choose where to go.<br>\r\n<br>\r\n“Hmm... I guess the sauna room would be nice to get sat on perhaps?”  You wondered with a curious look on your face.<br>\r\n<br>\r\nSo much so, you decided to head over there with your swimming shorts, and go into the sauna room straight away.  The place is almost beside the changing rooms, so you didn’t have to walk that far to get into the room.  Once you went in, you wanted to make sure nobody was around at this time.  Of course nobody was there, and a relief is when you knew it’s all going to plan.<br>\r\n<br>\r\nSo you went in, and take a seat on the bench, and all you could do now is sit there and wait for any obese females to come and give you some company for a while.  But luckily for you, this didn’t take long to happen, as you can see the door opening, knowing that someone’s coming in too.<br>\r\n<br>\r\n“Oh, I bet it must be someone coming in now.”  You said in a whisper way, so you wanted to make sure you act normal as much as you can.<br>\r\n<br>\r\nThe person that’s coming in, may be the one you’re eager by the look of the size of this female.  She’s fair-headed, and had Caucasian skin.  She is wearing a one-piece navy swimsuit, but her size in obesity rate is much larger than your mother!  Even judging by the look of that pear-shaped body with that ass and thighs much gigantically huge, you simply couldn’t help but blushed like any fourteen year old would get.<br>\r\n<br>\r\nWhen you look at the obese female’s face, you realised that she’s at how old?</span></div></div>",
            "created":1567573200,
            "id":2713468,
            "title":"Entering the Sauna Room"
        },
        "1221":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...tell the girl to come and sit on you.",
                "...keep yourself quiet and let the girl choose to sit."
            ],
            "content":"<div class=\"\"><div> <span>You only expected a obese female to come in and sit on you as such.  But for a nine year old girl?  You couldn’t believe how huge she looks at her age!  She appeared to weigh at the estimate 500 pounds, and she has a pear-shaped body, something that you’ve expected right from the start, but not something like this!<br>\r\n<br>\r\n“Whoa!  That little girl is gigantically huge!”  You whispered in a surprised expression, trying not to let the girl hear from the other side of the sauna room<br>\r\n<br>\r\nThe girl’s obese body jiggles as each step causes her mass to wobble heavily, whilst she had cellulite marks all over her meaty thighs and ass, whilst still wearing her one-pierce navy swimsuit.  By the look on her face, she seems to like her size very well, as it was only her hunger that caused to get so big and fat.<br>\r\n<br>\r\nAs she went right in, the girl looked around the room to see if there’s some seats she can use to sit on.  So much, that she had to say this out loud, with you being in the same room, and it looks like she doesn’t noticed you at all for the moment.<br>\r\n<br>\r\n“Now where should I sit myself down on?”  The girl asked with a curious expression.<br>\r\n<br>\r\nAnd that’s when your eyes lit up, realizing that a nine year old obese girl had no idea where she likes to sit on the bench, since basically she could sit anywhere she wants.  The question is from your thoughts when it comes to mind.  Would you rather want to tell the girl and sit on you, or make a sensible option and just wait until she’ll come over and sit on you?<br>\r\n<br>\r\nIt may be a win-win situation, but you’ll be hoping that opportunity would come sooner rather than later.  So you made up your own mind and decided to...</span></div></div>",
            "created":1567659600,
            "id":2713737,
            "title":"A Gigantically Obese Nine Year Old!? "
        },
        "125":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Makeshift Panties.",
                "New Title: Taco Shack Fart Absorber",
                "Other Places."
            ],
            "content":"<div class=\"\"><div> <span>A: A woman is complaining on the phone about forgetting to bring her panties and has a hula hoop in her arms. You offer to replace her Panties for her with the hula hoop as the waist and she is very grateful (Also huge, can't forget that)<br>\r\n<br>\r\nB: You notice a famous taco shack's manager stressing about losing one of their fart absorbers to prevent the big women who frequent the place from stinking it up too much. There's also going to be a full house in about ten minutes. You offer to replace it as a job and get paid as well as get good fart action. <br>\r\n<br>\r\nC: You see some other places that you could have some fun at. </span></div></div>",
            "created":1569214800,
            "id":2722702,
            "title":"What Happens?"
        },
        "1251":{
            "author_id":"dunamis",
            "author_name":"Jameskii",
            "choices":[
                "\"U-ummm... I think I'd rather be facing your glorious cheeks, my fat goddess!\"",
                "\"I think it'll be easier if my face in in your puss!\"",
                "\"Time to be 'down' there!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Seriously! How could my fat ass put my pants on, but not my panties?\" *Said the the Tan massive women. From where you stood, you could barely see where her pucker and goods where. Just barely, you see her shiny pucker, whenever she moves. Just the way she sways, at least to you, just gave you thoughts beyond your comprehension. Something about her just gave you visions of being tied to that hula hoop, or some ropes, and then being forced to be smothered by her bottom region. You gulp as you slowly make your way to her big, gluttonous, flabby body. Time to see if she's gonna have a new pair of panties, for free!<br>\r\n<br>\r\n\"U-Ummmm, Excuse me miss? I-I couldn't help but hear that you've been needing some panties?\" You say, as you walk up to her, enjoying the smell of the sweat and grime of her. Just being near her gave you a sense of confidence you didn't have a second ago.<br>\r\n<br>\r\n\"Alright, I'm gonna call you in a bit. I think there's someone here that might be able to help me out.\" She said, hanging up the phone, looking at you with her dazzling brown eyes. Her lips were so well taken care of. Her breast were just big enough to support her big Beautiful body! If the question your about to ask of her. \"What's up sug?\" She said, in a kind yet concerned way.<br>\r\n<br>\r\n\"W-Well madam. I'm a bit of a fan of big fat women, and all the stinky things that come with it. Do I sound like a perv? Yes. But I have good intentions. For I was wondering, someone as beautiful and lavious as you, would like you possibly tie me around your waist, and have me as a pair of living panties? I fully understand if you'd rather leave you alone\" You say, as you look at her smiling face.<br>\r\n<br>\r\nThe tan women Laughed as she grabbed your hand, sitting down on one of the lounge chairs. She then sat you down on her chubby lap, giving you a sloppy and sweaty kiss. \"Oh, I've been wanting something like this for a long time sugar!  You would have no idea how long I've been dreaming about having someone being my willing living panties! Just feeling them on my waist just makes me feel so happy! Tell ya what I'll let you have a trial run! You just tell me what way you want be facing upside down, your face in my cheeks, or your face in my glorious pussy! What will it be hun?\"</span></div></div>",
            "created":1596833880,
            "id":2881942,
            "title":"The life of panties"
        },
        "12511":{
            "author_id":"dunamis",
            "author_name":"Jameskii",
            "choices":[
                "Time to get something to eat!",
                "Time to slip and slide!"
            ],
            "content":"<div class=\"\"><div> <span>You gulp as you look into her friendly eyes. You could just tell that she doesn't mean you harm in the slightest, Just happy she can finally have her biggest dream completed. Besides, who wouldn't want to be pinned to a woman for the rest of their life? Just a person, holding up a fat person for who knows how long? You cleared your throat as you said. \"Mam, I'd like to face your ass. You could possibly even stuff my head up your hole, as a but plug if you'd like!\" She giggled as she gave you a big sweaty hug, smothering your head in her cleavage. You moaned as she brought you closer to her body, as if she was the buns to a hot dog, and you're the bun! After a few more mins of the grime and sweat, oozing onto your small, yet thin body, she tore you off herself.<br>\r\n<br>\r\n\"Then, it's settled hun! I hope you enjoy your day, as my panties! Time for us to get you accustomed to what maybe your new life!\" She said getting up, holding you like a baby. She played you down where she was just sitting on. She then sat on your waist, like that of how one does with a pair of panties, or diapers. She smiled gently as she leaned over towards her massive purse, grabbing two pieces of rope. She then Grabbed your hand, and placed it on her Lap. She then carefully tied the Thick rope around your leg, then slapping it to her waist. She then, somewhat roughly, grabbed your hand, doing the same to your foot. She giggled as she did the same to your other limbs. After a while, the task was complete. You were completely and utterly stuck to the bottom of her waist. Nothing more than some skimpy panties, sticking to her waist. You even looked nice from the front side, as your feet somewhat sticked into belly. Your face was nowhere to be seen, just smothered in gorgeous BBW booty.<br>\r\n<br>\r\n\"Aww yeah! You feel nice down there! Wait till the girls at the bar get a load of you! Oh, and for your face...\" She said, placing her flabby hand on your head. She laughed as she began to slide your head onto her booty hole, (Girl, das a booty hole! 10 points to grifindor if you get the reference.) Causing her to moan slightly. She giggled loudly as she began to slide your head into her hole, making your head, her buttplug. After a few more moan, she began to get back up again. She sighed as she began to walk around, getting used to the feel of a living person, smothered and trapped to her body. \"Aw yeah! I can get used to this! Now, time for some fun!\" she says, beginning to waddle to somewhere. <br>\r\n<br>\r\nTo were it may be, the future holds!</span></div></div>",
            "created":1597178340,
            "id":2884174,
            "title":"\"U-ummm... I think I'd rather be facing..."
        },
        "1252":{
            "author_id":"vaji",
            "author_name":"Vaji",
            "choices":[
                "Quality Check.",
                "Spoiled Brat.",
                "Big Mama.",
                "Big Betty, The Behemoth.",
                "Double Trouble. (Reserved)"
            ],
            "content":"<div class=\"\"><div> <span>As you walked along the sidewalk, dodging the neverending stampede of towering behemoths clad in the most absurdly skimpy bikinis, you happened to walk past a small, trashy looking building. Suffering from years of neglect and lack of proper cleaning. Above the entrance was a sign which read. \"Fatima's Farting Funhouse.\" and beneath it on the same sign read \"The Diarrhea Delight\".<br>\r\nThis caught your attention, but what made you intrigued was the woman standing by the entrance. A towering, caucasian lady with an excessively pear-shaped body, her massive hips stretching further than the opening. Long, straight blonde hair which reached to her rear, and thick rimmed sunglasses. She was also wearing a one-piece slingshot bikini designed to conceal as little skin as possible, with her top just barely covering her nipples, while the dangerously thin strings dug deeply into her skin. Her flabby thigs prevented people to discover how little of her nether regions that her bikini managed to cover.<br>\r\n<br>\r\nThough unlike the other shop owners, Fatima wasn't shouting or beckoning customers to enter. In fact, she had a deeply concerned expression on her face while she kept biting her nails.<br>\r\nBeing the considerate gentleman that you are, you approached her, soon realizing your short height only reached halfway up her thigh. With a quick gulp, you extended your arm and nudged her leg. \"Ma'am, is everything alright? Do you need help?\" You calmly asked.<br>\r\n<br>\r\nFatima lowered her shades and glanced at you. \"Oh it's horrible. Absolutely horrible.\" She howled as she burried her face in her palms. \"It's the busiest day of the week, and I'm missing one industrial-strength fart absorber.\" She sighed, \"My fine establishment is known for serving the most potent gut-busting, pucker-punching, sharthole-slappin' food in town.\" She sniveled and wiped her eyes. \"And that's only because my fart absorbers allow my customers to systematically and endlessly pump their meaty fartholes against the cushions and unleash their pent-up gas into them, without having to bother about the smell.\"<br>\r\n<br>\r\nOh, damn. That really sucks, wish there was something I could do to help.\" You responded, quite frankly caught by surprise by her venting. With a slight sniff, Fatima grasped her hands around your frame and lifted you into the air with no effort whatsoever, her saddened face instantly shifting into a wide, beaming smile. \"R-really? You mean that?\" She licked her plump lips as she eyed your embarassingly small frame up and down. \"Oh my gosh, thank you soo much. You really saved my sweet booty!\" She squealed as she brought you inside without a seconds notice.<br>\r\n<br>\r\nAs you made it past the frame of Fatima's Farting Funhouse. You were immediately struck by the disgusting stench of rotting sewage and taco sharts, the wretched and vile odor being worse than anything you've experienced before. But it was accompanied by a searing heatwave which washed over you, almost instantaneously causing you to sweat as you abruptly lost your ability to breathe from the shock.<br>\r\n<br>\r\nHolding you beneath her arm, Fatima approached the counter where she served the food to her customers, and infront was 5 excessively wide chairs designed to withold the crushing weight of their massive rears. Staring at the surfaces which might as well have been tables to you, you couldn't miss the inhumane abuse they've been through. Brown streaks which you thought could only exist inside a toilet, pre flushing. And litteral lakes of buttsweat, and each one could potentially drown you.<br>\r\nAll of the chairs had some form of extra padding on it's center, obviously being the fart absorber, you noticed that the one seat missing one was also the one who had been subjected to the most abuse.<br>\r\n<br>\r\nAs Fatima neared the chair, she roughly dropped you on the floor and squatted down infront of you. \"So...\" She took a short pause and bit her lower lip. \"How would you like to... Work here full-time as a fart absorber? It pays very well, and of course you'll have some perks and whatnot.\"<br>\r\nYou really didn't know what to say, you've never even heard of a fart absorber before. How would it even work for you to be one? Partially because of confusion, and intrigue, you casually shrugged. \"Sure, I guess... I could give it a tr---\"<br>\r\n<br>\r\nFatima swiftly interrupted you as she undid a latch on the solid base of the chair and opened it up, revealing an electic engine beneath a wooden plank, and claiming the remaining space was a massive ball of cotton which bulged out of the chair as soon as she opened it. Wiping a blob of drool from the corner of her lip, she'd coo \"Mnh... Such a good boy~♥\" With that, she kicked her leg and punted you against the opening. With her foot pressing against your backside, she forcefully pressed your small body against the ball of fluff as you eventually found your body submerging into it, and as you sunk deeper and deeper, your face eventually slapped against the thin, red layer of fabric which was the actual cushion. Fatima continued to push the excess cotton into the chair, having to pack it tighter due to the addition of one small boy. The sheer pressure continued to press your face against the laughably thin layer which was so taut and flimsy, it barely made a difference at all, and to think this would be the only protection between your face and Fatima's notorious customers.<br>\r\n<br>\r\nHearing your new boss close and lock the latch, she leaned over the seat and stared at her new fart absorber with a full grin. \"Oh, your face couldn't have possibly been more perfectly centered.\" She snorted.<br>\r\nYou couldn't move a single muscle, your face was pressed to firmly against the seat that Fatima could see your nose poking out like a sore tumor. \"Oh wow, this one even comes with a built in butthole scratcher!\" She shrieked with joy. \"You know, if I squint my eyes, I can almost kinda see your face. How's the view from down there?\"<br>\r\nUnfortunately, even though Fatima's ruthless pushing had caused your mouth to gape wide open, and in a frozen state. You were unable to respond with anything but weak and silent gurgles. Though you could see her, and everything around her perfectly clear.<br>\r\n<br>\r\n<u><b>1. Quality Check.</b></u><br>\r\nWith a few more minutes before she has to open. Fatima decides to make sure her new fart slurper works as intended, with a small roleplay. Hopefully she won't take it too far.<br>\r\n<br>\r\n<u><b>2. Spoiled Brat.</b></u><br>\r\nA spoiled 12 year old enters with her mom. Constantly whining and demanding that she gets to eat whatever she wants.<br>\r\n<br>\r\n<u><b>3. Big Mama.</b></u><br>\r\nYour own mother enters the shack, seems like your first order of business is to make sure you can keep your mom's farthole satisfied.<br>\r\n<br>\r\n<u><b>4. Big Betty, The Behemoth.</b></u><br>\r\nFatima's closest friend and most frequent regular. It was her farts that completely destroyed the previous fart absorber. Let's see if you're an upgrade.<br>\r\n<br>\r\n<u><b>5. Double Trouble. (Reserved)</b></u><br>\r\nKim, your girlfriends mother, enters along with Annie, her 4 year old baby sister. Kim was wearing a daringly short miniskirt, making a futile attempt to conceal the fact that she wasn't wearing any bottoms. And Annie, being just a small toddler, was walking around fully nude.<br>\r\nEven though you've always loved the potent stench your girlfriend could produce. Her younger sister was a monster in comparison. Wherever she went, she always left behind a destructive path of potent butt stenches and excessive diarrhea. But Kim was in a different league entirely, her taco sharts are so potent that even your mom and sister had issues when they were over for dinner.</span></div></div>",
            "created":1569474000,
            "id":2723854,
            "title":"New Title: Taco Shack Fart Absorber"
        },
        "13":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Big Sis.",
                "Abandoning Ship.",
                "According to Plan.",
                "Others."
            ],
            "content":"<div class=\"\"><div> <span>You decide to board the \"special\" bus to school. The reason for it being \"special\" is because the school specifically let only the fattest and smelliest girls on that bus so they could get to school without stinking up the regular bus's. Thankfully, your sister is included in that list which means the bus stops at your house at the same time every single morning. Your sister had slept in today since you were almost always supposed to wake her up but you knew that the bus still opened the doors because the bus recorded the amount of times the door was open to make sure no one gets on or off between stops. <br>\r\n<br>\r\nKnowing that, you decide to wait at the pickup area. Thanks to your special constitution where no one notices you you're able to basically be invisible at the bus stop. While you're waiting...<br>\r\n<br>\r\n<br>\r\nA: Your sister stands right in front of you, haven been woken up by your mother.<br>\r\nB: You see a ginormous jogger running towards you and you consider abandoning your earlier plan. (She doesn't notice you/she notices you but is super open about her smells.)<br>\r\nC: Nothing happens and the bus comes at the same time as always.<br>\r\nD: Other things happen.</span></div></div>",
            "created":1562043600,
            "id":2681561,
            "title":"Free Ride."
        },
        "131":{
            "author_id":"vaji",
            "author_name":"Vaji",
            "choices":[
                "Cushion to a Farthole.",
                "Butthole Slip-n-Slide.",
                "Fartboy Unchained.",
                "Launch in T-Now.",
                "Friendly Exchange."
            ],
            "content":"<div class=\"\"><div> <span>Being in your own thoughts, you failed to notice the eclipsing shadow looming above as you sat on the bench. With a confused expression, you looked above as you were greeted by the all too familiar sight of your sister's unfathomably massive rear end hovering above. Wide enough to easily claim the entirety of the bench, you stared in awe as every slight shift she made caused her blubbery booty to wobble and ripple in a cartoonishly exaggerated way.<br>\r\n<br>\r\nDressed in a white, long-sleeved shirt and a daringly short mini-skirt, you could only assume she was wearing a pair of panties beneath, however whatever trace of it existed had been burried beneath the unending waves of buttmeat.<br>\r\n<br>\r\nWith a drawn out sigh, Claire began to bend her knees as she prepared to seat her rear onto the bench, the noxious stench which had been built up by months and months without showering, and it was no secret she stopped her futile attempts at using toilet paper after her booty grew too large a few years ago.<br>\r\n<br>\r\nOnce Claire was hovering just a few inches above the bench, you quickly realized you were seated in perfect alignment with her unwashed crevice. And as if on queue, Claire moved her hands behind her back and took a generous grasp of each cheek, and pulled them apart, exposing the unending depth of her fartcrack until you could see a feint white and brown line being relentlessly wedged so tight against her asshole, you swear you could see a feint outline of it.<br>\r\n<br>\r\nThough, you had no time to admire the unyielding endurance of Claire's thong as you heard a terrifyingly inhuman gurgle roaring through her jiggling gut as you saw her plump farthole punch and thrash against her skimpy panties in a pulsating manner, beating the fabric senseless for having the audacity to impede the inevitable booty blast.<br>\r\n<br>\r\n\"Gawd, can't believe it took 7 breakfast burritoes before I realized it wasn't the lactose free kind.\" Chloe groaned as her pucker continued to jolt and thrash against the defenseless thong. Before a solid stream of brown gunk trailed down her already filthy pucker, until it expanded further and burst wide open, letting a torrent of liquid diarrhea along with a barrage of wet farts burst out and absolutely drench the last remaining white parts of her panties, as well as a generous portion of the bench.<br>\r\n<br>\r\nYou always knew Chloe's unrivaled levels of filth, which was always heavily amplified by spicy food, but you could never prepare as you stared deep into her crevice and were assaulted by a surge of her chunky booty soup. Though, with little to no time to fully assess the situation. Chloe just let out a relieved cackle. \"Well, at least noone was around to hear that one.\" And proceeded to plant her massive rear onto her baby brother, fully encasing you within her buttmeat. <br>\r\nWith your older sister's flesh restraining you from any form of movement, you felt a quick jolt as Chloe's buttmeat clenched briefly, followed by a slight growl escaping her mouth. \"Urgh, why does my asshole always itch when I fart?\" And with that, you barely had time to brace for impact as she rammed her sausage-like index finger into her asscrack and scooped you up, launching you along into the very depths of her slimey, shitcaked buttcrack until you struck the brick-wall of her clenched pucker. A series of ecstatic groans and gasps escaped her maw as she smeared your face straight against her swollen pucker, skillfully maneuvering you around her pathetically skimpy thong.<br>\r\n<br>\r\nNow completely wedged between the excessively taut thong and her continuously pulsating butthole, you could barely crane your neck to witness her finger disappearing from her crack, only for Chloe to give her thong a gentle tug, squeezing you firmly against her shithole, as another gurgle roared through her belly as she flexed her glutes. With a gulp, you tried to brace for impact, but your limbs were completely imobile and glued to your sides as her creamed pucker started to twitch, relentlessly punching your helpless face into the taut fabric of her thong before a grotesquely slimey fart splurted through the cracks.<br>\r\n<br>\r\nChloe let out another ecstatic howl as she turned her head to look at her monstrous booty, with a dumbfounded open grin, she gave each of her fat cheeks a rough smack.<br>\r\n\"Golly, why does my thong feel sooo good against my asshole all of a sudden?\" She grunted and used her hands to knead the doughy buttmeat, grinding both you and her thong firmly against her slimey hole. \"Hngh, never, ever going to remove my thong if it keeps this up.\" She chuckled as she made an audible smack with her wet lips. \"Hear that? I was gonna throw you out, but I guess you could relive your last few weeks as nothing more than a toy for my asshole.\" She laughed whilst grabbing the back of her underwear beneath her skirt, yanking on it roughly to ram the knot in her thong against her blubbery farthole, unknowingly smearing her baby brother against the shitsoaked, flexing muscle, while simultaneously looking around to make sure noone saw her speaking to her underwear.<br>\r\n<br>\r\n<u><b>1. Cushion to a Farthole.</b></u><br>\r\nThe bus eventually arrives and Chloe quickly enters it as she makes her way to school. Looks like you'll be spending your day pleasuring your older sister's asshole while enduring the unspeakable substances she harbors in her buttcrack. <br>\r\nIt doesn't help that the bus is nearing the end of it's lifespan, as the heater is stuck on the hottest option, while the windows are unable to open. Due to the excessive weight the bus has to carry each day, the suspension is completely busted, resulting in every slight bump in the road essentially tossing it's passengers in their seats. At least it's just a 30 minute ride on gravel and dirt roads.<br>\r\n<br>\r\n<u><b>2. Butthole Slip-n-Slide.</b></u><br>\r\nWhen the bus arrives, it breaks down, with the chaffeur sighing in frustration and the engine splurting out more smoke than Chloe's butthole. Your sister realizes that the only way for her to arrive at school in time is to jog there, and Chloe is well known from expelling gallons of sweat from the slightest exertion.<br>\r\n<br>\r\n<u><b>3. Fartboy Unchained.</b></u><br>\r\nAs Chloe stands up, she releases a potent fart which frees you from the chains of her thong and hurls you back onto the bench. Leaving you stranded as your sister boards the bus.<br>\r\n<br>\r\n<u><b>4. Launch in T-Now.</b></u><br>\r\nChloe's fart was more powerful than anticipated, and her angle caused you to rocket out through her jiggling buttcrack as you were sent soaring into an unknown destination, far too fast to comprehend your surroundings in the meantime.<br>\r\n<br>\r\n<u><b>5. Friendly Exchange.</b></u><br>\r\nAs Chloe looked around, she was shocked to see your neighbour, and one of her closest friends Yasmine staring intensively at her, having heard everything. Yasmine was an african girl the same age as your sister, though with a whole head and a half taller, and a monstrous ghetto booty which put Chloe's to shame. You've actually been crushing hard on her for the past few years, mostly because Yasmine is the only girl you know who's actually nastier than your sister, while also being completely carefree and open about her various stenches, she never cared where she was, or who she's around, if she has explosive flatulence, she'll unleash it wherever she pleases.<br>\r\n<br>\r\nAnd what's absurd is that she's probably the least filthy of her family.</span></div></div>",
            "created":1569474000,
            "id":2723796,
            "title":"Big Sis."
        },
        "1311":{
            "author_id":"benexp",
            "author_name":"Ben Exp",
            "choices":[
                "Gym",
                "Science",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Your prison begins to shift, signifying that the bus has arrived your sister climbs on board the bus sitting down. Straight away you feel the temperature change, the atmosphere changes , it's extremely humid and, your sister has already begun sweating.<br>\r\n<br>\r\n\"Huh it's so warm, \" she moans shifting around trying to get more comfortable unknowingly trapping you further in your sisters swam ass. You can hear the roar of and engine as the bus sets off.<br>\r\n<br>\r\nEach bump causes you to be pushed into your sisters asshole, with every other bump causes her to let out a fart or to. The bus eventually reaches school, your sisters gets off heading to her first class.<br>\r\n<br>\r\nGym: A chance to move to another girl or stick with your sister and witness her sweaty body during gym.<br>\r\n<br>\r\nScience: A special lesson where you happen to be investigating what makes farts smell.<br>\r\n<br>\r\nOther</span></div></div>",
            "created":1585345980,
            "id":2808479,
            "title":"Cushion to a Farthole."
        },
        "132":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "All-Encompassing Ass",
                "New meaning to Towel Boy.",
                "Accidental Half Nudist."
            ],
            "content":"<div class=\"\"><div> <span>While waiting you look around, a skill you had long since learned to do passively without even thinking about it because of your abilities. You notice a gigantic jogger woman jogging down the sidewalk with sweat basically pouring off her face. You immediately notice her two boobs bouncing up and down, each one probably enough to hold you inside if you curled up. <br>\r\n<br>\r\nHer ass is also bouncing up and down at the same rhythm of her boobs. <br>\r\n<br>\r\nYou also notice her carrying a bag, probably holding water bottles and a spare change of clothes. The thing is, it looks big enough for you to just lie down in without even being a terrible nuisance and considering the weight of the woman you doubt 60 pounds would really make much of a difference.<br>\r\n<br>\r\nYou notice her staring at a spot just to the left of you and when you look there you see a large bench. The woman makes it past you and sits down, the bench making a creaking sound at her weight. She leaves her bag right in front of you and takes out a water bottle, leaving it open to the side of the bench and as you assumed, there are some clothes inside even a towel that looks about your size. <br>\r\n<br>\r\nAfter careful consideration, you decide to...<br>\r\n<br>\r\nA: Climb into her jogging shorts and be encompassed by her ass.<br>\r\n<br>\r\nB: Go into her bag and lie inside the towel, hoping to get carried with it and used with it, potentially as a buttcrack cleaner or maybe as a seat. <br>\r\n<br>\r\nC: Before you could do anything, the woman takes off her shirt and tosses it to the side. She seemed to have been aiming for the bag but since you were between her and it, it landed on you with you on the inside. Immediately after the woman seems to realize that she shouldn't exactly take her shirt off and public and puts it back on, this time with a new passenger in toe. </span></div></div>",
            "created":1564808400,
            "id":2696249,
            "title":"Building up a sweat. "
        },
        "1321":{
            "author_id":"verygeneric",
            "author_name":"Totally Generic",
            "choices":[
                "Try to pull the butt plug out",
                "Leave the plug alone and enjoy the ride to her house.",
                "Leave the plug alone and twist around to face her pussy instead."
            ],
            "content":"<div class=\"\"><div> <span>While you're admiring the huge, sweaty beauty next you you, you notice her sky blue running shorts have slipped nearly halfway down her titanic asscheeks. The twin mountains of jiggly pale flesh are separated by a deep crack where a river of sweat is pouring into, a crack that looks just big enough for you to slip into. You can't pass this opportunity up.<br>\r\n<br>\r\n\"Huff... Huff...\" The woman pants, attempting to wipe the sweat from her brow with an equally sweaty forearm. With her arm still raised she leans into her sweaty pit and takes a whiff, an annoyed look immediately showing on her face. \"Well, so much for that 'triple extra strength' deodorant,\" she complains to nobody in particular. Even from where you're standing you can tell what she means, her armpit stink is stronger than most others you've experienced. But you're here for a different odor, so you sneak behind her to get a better look at her booty.<br>\r\n<br>\r\nFrom the side her butt already looked huge, but from the back it takes up almost you entire view. You can faintly see steam rising up from between her cheeks where her sweat is meeting with the incredible amount of heat trapped under her nether regions. The unmistakable stench of swamp ass wafts out with it, mixed with the smell of an all around unclean behind. The alluring sight of her gigantic butt combined with this pungent yet intoxicating stench are too much to resist.<br>\r\n<br>\r\nBeing as quiet as possible you tip toe up behind the sweaty giant and climb up the back of the bench, carefully slipping your legs into her exposed butt crack one at a time. You can immediately feel the heat rising up at you while you're above the opening, and her sweat makes it easy to slip in as it soaks into your clothes. You dick is rock hard as you descend into her sweat soaked shorts entirely, resting in the seat of her pants, the heat between her cheeks comparable to a sauna. The stink of her filthy, sweaty ass is now the only air you're breathing, so much so that you can practically taste it. This is truly heaven.<br>\r\n<br>\r\nAs your eyes adjust to the darkness a bit more you get a better look at the ass you're dealing with. It's huge, of course, but now that you're up close you can also see that, first of all, she isn't wearing any underwear. Second of all, all along her crack, in contrast to her pale cheeks, is stained brown with unwiped shit stains. This girl really doesn't wash at all. Third of all, lodged inside her big, puffy, chocolate donut of an asshole is an equally massive pink buttplug. She's dirty in more ways than one.<br>\r\n<br>\r\nSuddenly things start shifting as the massive woman stands up and pulls her pants back up, pinning you directly against her ass and taint. However, probably used to the feeling of something jammed up her ass she doesn't notice you.<br>\r\n<br>\r\n\"Alright, come on Pauline, one more mile,\" you hear her telling herself. As Pauline resumes her jog you're treated to a very smelly, very sweaty full body massage as her butt cheeks grind against you with every bounding step she takes. You're bounced around in the dark with an absolute waterfall of perspiration drenching you without end, and you happily open your mouth to drink from the salty river.<br>\r\n<br>\r\nAs the jog goes on you decide to get even more daring and get a taste of her luscious asshole, figuring one little lick couldn't feel much different from a drop of sweat to her. As your tongue runs across her wrinkled sphincter your taste buds explode with the bitter, salty flavor, begging you for more. You immediately start licking all around the big pink plug to taste her filthy crack, in love with her chocolate starfish.<br>\r\n<br>\r\n\"Oh no, is it falling out already?\" You hear Pauline say worriedly. Suddenly a huge finger pushes right up against the back of your head though the pants fabric, mashing your face against her asshole while also pushing her butt plug in further. \"Oh come on, not yet. I just have to get home!\" Pauline picks up the pace a little, and you start to wonder why she's so concerned about her plug staying in. Given how smelly this girl is from the outside, you're dying to know what kind of stink she's got bottled up on the inside. Maybe her plug could \"accidentally\" fall out before she gets home?</span></div></div>",
            "created":1569733200,
            "id":2725320,
            "title":"Plugged Up Pauline"
        },
        "13211":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "A wave of sloppy shit",
                "a gigantic fart",
                "Nothing, but the jogger push the plug back in her anus, with you on the tip"
            ],
            "content":"<div class=\"\"><div> <span>The thought of the stink inside this woman is driving you crazy! So you do what your dick is telling you to do, and you grab on to the but plug, and start pulling.<br>\r\n<br>\r\n\"Oh god, pleas don't come out!\" The jogger shouts above you.<br>\r\n<br>\r\nYou smile and give one last big tug, and suddenly the plug pops out, and you're met with...</span></div></div>",
            "created":1574531880,
            "id":2750636,
            "title":"Try to pull the butt plug out"
        },
        "13212":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Shared Mansion.",
                "Hotel; Floor BBW.",
                "Actually at work?"
            ],
            "content":"<div class=\"\"><div> <span>You decide that despite your \"unnoticable\" disposition pulling out a buttplug might get you caught. Then again, perhaps it was because your current position was good enough that you didn't want to rock the boat. The buttcheeks around you constantly rubbed against your body, filling you with immeasurable pleasure. Of course, you continued to lick the sweat around you but stayed away from the buttplug, not wanting to risk being caught. <br>\r\n<br>\r\nAfter a 20-minute jog consisting of you being covered in a waterfall of sweat and basking in the best scent in the world, the movement stopped. Following the end of the movement you heard the jangling of keys. At first, you found it strange that you didn't hear it before but then considered that between Pauline's ass and the distance between you and her bag probably muffled the sound. <br>\r\n<br>\r\nWith a turning sound signifying a door being unlocked and opened you grinned in pleasure at the fact that you were in a BBW's house without her even knowing. What you didn't know, however, was that she lived...<br>\r\n<br>\r\nA: In a shared mansion with a ton of other BBW's who pooled money together to afford it. Time for some fun in the mansion.<br>\r\n<br>\r\nB: In a hotel for the time being. She was going home to her country next week so your time with her was limited. She also lived on a floor specifically made for BBW's. Reinforced walls and floors along with sturdy toilets and baths. A lot of BBW's to have fun within your location, the only problem was getting into their room. <br>\r\n<br>\r\nC: Actually, she wasn't going home. She simply worked somewhere and was just opening the doors for the morning and a late opening. (You decide what job/location)</span></div></div>",
            "created":1569819600,
            "id":2726186,
            "title":"Staying Careful"
        },
        "132121":{
            "author_id":"verygeneric",
            "author_name":"Totally Generic",
            "choices":[
                "Stay in her ass as she goes to the bathroom",
                "Hold on and get tossed down the laundry chute"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, girl! Work up a sweat?\" You hear another voice call out to Pauline as the door opens. A roommate perhaps? What you can't see is that this woman is just as big if not even bigger than Paula, with deep chocolate skin, long black hair, stunning green eyes, and luscious lips that are currently covered with the remnants of food. What you also can't see is that she's completely naked! Her gigantic tits sporting pepperoni thick nipples rest on her enormous, multi layered gut; these too are covered in crumbs and drippings from whatever she's just been eating. <br>\r\n<br>\r\n\"Phew, you know it,\" the sweaty girl replies, stepping inside. \"Also, you know that 'super strength deodorant' I was trying out? It didn't even help one bit!\"<br>\r\n<br>\r\n\"Honey, what have I told you all this time?  Your natural aroma is just too powerful to contain; just embrace it!\"<br>\r\n<br>\r\n\"I know, I know, but I just don't wanna knock out every guy in 100ft every time I lift up my arms.\"<br>\r\n<br>\r\n\"Paula, honey, believe me when I say this,\" her friend says, coming over to put a hand on Pauline's shoulder, \"If a guy can't handle your beautiful, natural smell, he is not the guy for you. You're just weeding out all the weak men until you can find one man enough to admit he loves how you smell, on top of all the other wonderful things to love about you. So don't even worry about it.\"<br>\r\n<br>\r\n\"Thanks Annie.\"<br>\r\n<br>\r\n\"I'm always here for you, girl. And you know what else is here for you? A nice big stack of tacos! The taco place was having a crazy special, ten tacos for ten cents! Jenny and I bought like a fuck-million of 'em.\"<br>\r\n<br>\r\n<span class=\"cgreen\">BBBRRRRRAAAAAAAAAPPPPFFFFFTTTTTTT</span><br>\r\n<br>\r\nA massive fart ripples out from between Annie's massive asscheeks, reverberating through the large foyer.<br>\r\n<br>\r\n\"Sounds like you got into them already,\" Paula says with a smirk. \"Lemme just change and hit the bathroom first, I gotta make some room.\" Pauline's buttcheeks begin grinding on you again as she heads for the stairs, and you can hear some gurgling sounds from behind the butt plug.<br>\r\n<br>\r\n\"Don't take too long, you know how long food lasts in this house!\" Annie calls after her.<br>\r\n<br>\r\n\"You better not eat mine!\"<br>\r\n<br>\r\n\"Oh I won't, but I can't promise nobody else will,\" Annie says with a grin before heading into the dining room.<br>\r\n<br>\r\n\"Yeah, hurry up, they're starting to look good!\" Another new voice yells from the kitchen, followed by other voices giggling. This place is full of girls!<br>\r\n<br>\r\n\"Ughh!\" Pauline groans with frustration and hurries up the steps to her room. She throws open the door and flings her bag next to her bed before quickly peeling off her sweat drenched clothes. As she pulls down her pants, you...<br>\r\n</span></div></div>",
            "created":1577194620,
            "id":2764019,
            "title":"Home Sweet Home"
        },
        "1321212":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Explore the Mansion.",
                "Stay and Wait.",
                "Do something completely different?"
            ],
            "content":"<div class=\"\"><div> <span>Despite how wonderful Paula's ass was, you had decided it was now time to move on. Not because you were tired of it, heavens no.  It's just that she was using the washroom and when she doesn't hear her shit hit the water she'll probably investigate and find you, and you still wanted to stay hidden for now. You held on to her pants as she pulled them off, her hand strength more than enough to dislodge you from her wonderful ass.<br>\r\n<br>\r\nYou felt yourself become weightless as Paula threw you into what you assumed was a metal chute for clothes. Thankfully for you, the clothes around you allowed you to safely bounce off the metal surroundings with minimal pain. Eventually, the ride was over and you were surrounded by glorious smells. You could stay here forever, but then you realized. If there were dirty clothes being sent here that would mean there's gonna be clothes being washed, meaning you could possibly meet your end in a washing machine. You slowly move upwards out of the maze of clothes, making sure not to make a ruckus in case there was someone in the room.<br>\r\n<br>\r\n<br>\r\nYou finally reach the light and see yourself in a room with many washing machines, presumably to keep up with all the clothes. Thankfully, no one was there at the moment so you could jump out of the giant basket which was even taller than you. You land with a dull thud, making sure to land while bending your legs to reduce the impact. At this point, you were at an impasse. You could leave the room and explore, but that would risk you getting found by some kind of security. Then there was the boring option, that being to wait hidden inside the Laundry Room for someone to come back, hopefully, a really fat lady so you could get an express ticket out.<br>\r\n<br>\r\nIf you were going to make a plan now would be the time. You decide to...</span></div></div>",
            "created":1580362800,
            "id":2780303,
            "title":"Down ya go!"
        },
        "133":{
            "author_id":"benexp",
            "author_name":"Ben Exp",
            "choices":[
                "Beth",
                "Rachel",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>The bus arrives just according to your master plan the doors shift open as you crawl on keeping low to the floor to make sure you're out of sight. After a few minutes the doors of the bus close and it begins moving.<br>\r\n<br>\r\nYou sit down on one of the empty back seats admiring the bounty of big women on this bus. <br>\r\n<br>\r\nAfter a while, the bus reaches the next stop two more BBW's get onto the bus they both begin moving to the back either could sit on you.<br>\r\n<br>\r\nBeth: A surprisingly athletic girl, who still retains BBW status, her love for physical activity (Despite her size) she is constantly sweaty and no amount of body spray can stop the smell.<br>\r\n<br>\r\nRachel: A large red, with a massive ass which is known for realseing deadly had that could be used to torture criminals.</span></div></div>",
            "created":1585344600,
            "id":2808465,
            "title":"According to Plan."
        },
        "14":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "The mall",
                "A friend's house",
                "A club/bar",
                "Others.",
                "The park"
            ],
            "content":"<div class=\"\"><div> <span>You don't like any of the previous choices and decide to head elsewhere for find some big chicks.<br>\r\n<br>\r\n<u>The Mall</u><br>\r\n<br>\r\nYou decide to go shopping for some stuff. The chances of you encountering some big women are very likely in your forecast.<br>\r\n<br>\r\n<u>A friend's house</u><br>\r\n<br>\r\nOne of your friends invite you over their place. The thing is that both them and their family are huge.<br>\r\n<br>\r\n<u>A club/bar</u><br>\r\n<br>\r\nA group of your friends manage to get some fake IDs and get into a club/bar that you're obviously underaged to go to. However, most of them are found out by the security and flee before getting caught by them, leaving you all alone, much to your delight as the place is crawling with bbws everywhere.<br>\r\n<br>\r\n<u>Others</u><br>\r\n<br>\r\nIf any of these didn't appeal to you.<br>\r\n<br>\r\n<u>The park</u><br>\r\n<br>\r\nHeading for the park, you will encounter some gigantic women either jogging to lose some weight or having a picnic for fun. But then again, you heard some interesting things about the forest nearby and you may want to check it out.</span></div></div>",
            "created":1560747600,
            "id":2674864,
            "title":"OTHERS"
        },
        "141":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Food Court.",
                "Clothing Store.",
                "Movies."
            ],
            "content":"<div class=\"\"><div> <span>There's alot of places to go to in the mall to experience some big booties, let us sort through our options.<br>\r\n<br>\r\nA: Food Court. You could choose between a place that makes ladies fart a lot or maybe ones that are just normal.<br>\r\nB: Clothing Store. You could hide in a pair of super-sized pants and wait for a woman to pick the pants you're in.<br>\r\nC: Movie Theatre. It's dark in there, further reducing your likelihood of being caught. </span></div></div>",
            "created":1564894800,
            "id":2697178,
            "title":"The mall is a big place."
        },
        "1413":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Comedy Movie (More Bouncing and Accidental Farts)",
                "Kids Movie (Younger Watchers)",
                "Action Movie (A lot of clenched cheeks squeezing you)"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go to the movie theaters for one reason. Well, two reasons. Reason one was that this theater had special seats for really fat women because the obesity rate in your city was through the roof. The second reason was that theaters are dark, further masking you from the sight of the giant women who may or may not be fart machines.<br>\r\n<br>\r\nWith that, you enter the theaters. Since the ticket checker was also a BBW, she didn't even notice you walk by. You looked at the movies and went to a...</span></div></div>",
            "created":1581997980,
            "id":2788939,
            "title":"Movies."
        },
        "145":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "The jogger",
                "The picnickers",
                "The forest"
            ],
            "content":"<div class=\"\"><div> <span>Picking up your jacket, you call out your good byes to your mother, who was currently on the can and crapping out everything from her bowels before you leave the house. It doesn't take long for you to reach the park and walk around until you find your target(s).<br>\r\nStraight ahead of you was the rumored woods, where people have noticed some weird things. One was where a fat horse was living there, which wouldn't sound unusual, if it wasn't for the fact that there was no place for a horse to be at within a few kilometer radius, and another rumor was footprints was found at the size of vans. Those and other rumors of monsters that resembled women were the most common stories told, yet nobody had really bothered to look too deeply into them. The trees towered over you like you were a small Lego piece and you had to admit, it was bit intimating, but you were willing to press on. However, your hormones helped you notice two things on either side of the forest.<br>\r\nThe first one was a woman who was trying to lose by jogging and sweat was rolling off her by the buckets. Wearing some black booty shorts that was unable to contain a good third of her ass, though miraculously surviving her massive fat ass, her gut stuck out at least several feet out and her boobs were only half the size of that in her super strained white sports bra. Her blonde hair was tied up with a blue scrunchie and a green headband was desperately trying to keep the sweat getting into her lively green eyes as her face was red from exhaustion. Spotting a bench, you note you could make it there before her and check out the other side.<br>\r\nA massive ginger woman, standing way taller than your mother was sitting down on a red-white checkered blanket and dressed in a light cyan dress with a sun hat. Beside her is a miniature clone of her, her daughter, in a purple white dress and both were eating the feast before them. Junk food of all types, chilli, burritos, tacos, veggies, and lots of dairy products were flying down their throats as you watched, knowing that their stomachs will purge it downwards.<br>\r\nMake your choice?</span></div></div>",
            "created":1561006800,
            "id":2676488,
            "title":"The great outdoors"
        },
        "1451":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Left Behind",
                "Taken Along",
                "Long Night"
            ],
            "content":"<div class=\"\"><div> <span>The jogger you had been looking at before seemed to be at the edge of passing out from exhaustion, probably due to the running. You looked down the path she was running and saw a completely empty bench that she had also seen. You knew that she was 99% going to take a break on this bench so you start to run towards it. Thankfully, you were much closer to the bench then she was and she was really slow, more from her size than anything else.<br>\r\n<br>\r\nAfter reaching the bench you sit directly in the middle because the woman's ass is just that large, to where she would have to sit in the middle just to fit and even then her fat would roll off. You watch as the sweaty giant jugged towards you, the flab on her body bouncing up and down while flinging sweat everywhere. As she approached you smelt the stench of an extreme workout and you knew that you had chosen the right path. You looked as the woman turned around and positioned her crack right over where you were sitting, not even bothering to check the seat behind her. <br>\r\n<br>\r\nAs the woman sat down you were immediately hugged by her asscrack, the Booty shorts not doing much to prevent it. Due to the size of her ass, your head was level with the bottom of her back and you could clearly see her asshole not covered by the booty shorts due to the insane strain. After a while...<br>\r\n<br>\r\nA. The woman stood up and you plopped back on the bench, having not been deep enough in her ass cheeks. <br>\r\nB: The woman stood up and carried you up with her, continuing her jog home.<br>\r\nC: You noticed that the woman had fallen asleep from exhaustion allowing you to play with her body. <br>\r\n</span></div></div>",
            "created":1561179600,
            "id":2677172,
            "title":"Planning pays off."
        },
        "1453":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "An elf bbw",
                "The lamia",
                "A sleeping giantess"
            ],
            "content":"<div class=\"\"><div> <span>Looking at both options, you sigh sadly as you ultimately decide <b>not</b> to go after them and continue your way into the forest, the trees the looming over you with a dark approval towards your actions. Walking down the path, you could see the trees cover more of the light with their leaves as you get further into their turf and eventually, you reach the threshold where people have reported the unusual sightings while past the part where the trails no longer go into, you couldn't tell if it was night or day over there.<br>\r\n\"It sure is dark over there,\" you say to yourself, trying to steel yourself, but you could still hear a bit of trembling in your tone.<br>\r\nTaking a deep breath, you step off the trail and walk into the darkened area of the woods. Trudging through the woods, the feeling of being creeped out was growing by the second as you trek on, avoiding branches or any roots in your way. Despite the fearsome atmosphere around you, you were slightly annoyed that you haven't seen anything remotely supernatural and you eventually come to the conclusion that all of the stuff you heard about the woods was nothing but fiction made up by some assholes after wandering for about a couple of hours.<br>\r\nReady to leave, you turn around, only to notice something in the corner of your eye and you walk over to it check it out. As you got closer, you could smell something horrendous and stop a moment to hold your nose before continuing on. Pushing aside a bush, you were quite shocked when you find a pile of shit towering over you, logs thicker than your whole body and the stink reminding you of a sewer river gushing down on a landfill before piling on multiple rotting corpses of skunks that are still spraying their smell. But the most worrisome part of it was the fact that bones were inside of it and you were ready to run back before hearing something a few feet away from you.<br>\r\nWhile you were scared by whatever left the manure pile behind, your curiosity made you quietly walk over to the source of the noise and you peer through the leaves of the bush that was hiding you. You gasp as you could see...<br>\r\n<br>\r\n1) An elven mini giantess that was scouring around for some berries as you unwittily entered into another world. Her kind is wary of outsiders, but the one you found is a nice and trusting one, though she may have to either bargain with the elf leaders to let you in or hide from the rest of her species. Did I mention she was also the princess of her people?<br>\r\n<br>\r\n2) A lab experiment where humans were spliced with animal DNA, where the one you're looking at is spliced with a snake and is currently eating someone. However, she's a very friendly scientist underneath her strictly cold attitude (and her massive flab) and is willing to show you her home, where there are other spliced people, like centaurs, mermaids, harpies and others (which are all fat).<br>\r\nHere's what the lamia looks like: <br>\r\n<a rel=\"nofollow\" href=\"https://www.deviantart.com/tabanaki/art/Didn-t-touch-the-sides-498949084\" target=\"_blank\">https://www.deviantart.com/tabanaki/art/...</a><br>\r\n<a rel=\"nofollow\" href=\"https://www.deviantart.com/tabanaki/art/Snake-Science-495288024\" target=\"_blank\">https://www.deviantart.com/tabanaki/art/...</a><br>\r\n<a rel=\"nofollow\" href=\"https://www.deviantart.com/tabanaki/art/Snake-Science-2-496788689\" target=\"_blank\">https://www.deviantart.com/tabanaki/art/...</a><br>\r\n<br>\r\n<br>\r\n3) A giant sleeping on her back as she's rubbing her gurgling her belly, which sounds like she's suffering from some indigestion, as she's pushing out some really nasty SBDs. You don't even reach the middle of her calves and this giant is probably one of the smaller ones around.</span></div></div>",
            "created":1561352400,
            "id":2678042,
            "title":"The forest"
        },
        "15":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Path 1:",
                "Path 2:",
                "Path 3:",
                "Path 4:",
                "Path 5:"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>5 Different Paths, all for the writer to decide!</span></div></span></div>",
            "created":1561870800,
            "id":2680680,
            "title":"DIFFERENT START."
        },
        "151":{
            "author_id":"waluigi99",
            "author_name":"ButterBazooka",
            "choices":[
                "Stay home",
                "Goes to the public pool",
                "Goes to the clothing store for fat girls"
            ],
            "content":"<div class=\"\"><div> <span>Once upon a time, there was a boy named Timmy. Timmy was ten years old and stood at 2 Ft tall. Due to this and having accidental ultra stealth, Timmy wasn't that noticeable. This led to Timmy being squished a lot but thankfully he was durable and couldn't feel pain. Oddly Timmy was mostly squished by heavier women. This included Timmy's mother and five older sisters. Over the years Timmy had grown fond of the feeling of being squished and actively sought it out, both with his family and other women. <br>\r\n<br>\r\nFirst, there was Carla Timmy's oldest sister and the fattest of the sisters, she always makes sure everything is going smoothly. She's twenty years old and is in college. She also believes in \"Large and in Charge\" So she eats a lot believing it'd make her a better leader. <br>\r\n<br>\r\nNext, there was Maria who was nineteen years old and works as a chef, she makes and eats a lot of food. Everything she makes is incredibly fattening, she is quite peppy and a hard worker but out of the kitchen she's quite forgetful. <br>\r\n<br>\r\nThen there were the twins Emilia and Alice who despite being equally fat looked completely different. Emilia was a goth and her wardrobe consisted entirely of black yet had really blonde hair, she's the cynic and sarcastic one of the family but has a soft spot for small things. Alice was a gamer and a nerd. She wears glasses and dresses with comfort as a priority. She's often reluctant to leave the house unless if it had to do with food or games were involved. The twins are 18 years old <br>\r\n<br>\r\nThe final sister was 17 years old  Catherine who is tomboy, who likes working out but her boobs, butt, and belly remain huge. She's been contemplating giving up to start doing competitive speed eating instead. <br>\r\n<br>\r\nFinally, there was Timmy's mom Delilah a massive woman in both height and weight. Loves all her children equally. Works at a mysterious company run by fat women.<br>\r\n<br>\r\nWhat does Timmy do today?</span></div></div>",
            "created":1566709200,
            "id":2707472,
            "title":"Itty Bitty Boy"
        },
        "152":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Amy, The nerdy yet fast working gamer.",
                "Nicole, The personification of punctuality. ",
                "Amber, The sporty chick."
            ],
            "content":"<div class=\"\"><div> <span>You worked as an office worker and you are 25 years old. Your job is just like any other, type stuff, take reports, the usual, but this job has a special detail about it. Every single person other then you is a woman and ginormous, both in height and ass/boob size. It doesn't help that you're miniature compared to even normal people, leaving you level to their thighs at about 3 feet tall. <br>\r\n<br>\r\nOne other important fact, the women are completely oblivious to their surroundings, completely ignoring someone literally punching them in the ass as hard as they could if they were doing something. This had led to them completely sitting on people in the lobby and then standing back up and walking away as if nothing had happened, probably because they didn't even notice they sat on someone. <br>\r\n<br>\r\nThis would be a nightmare job for many but not for you. You actually enjoyed getting sat on and with their obliviousness you could easily get sat on without them even caring or changing at all. There were 3 other people you could name off the top of your head with a description. There were plenty of other girls, so your plan would probably change midday. (Basically saying you can introduce new characters. <br>\r\n<br>\r\nAmy was a nerdy girl yet at the same time very fast at finishing work. She had brown hair in twin ponytails, her face adorned with square glasses. It had gotten to the point that Amy finished her work with hours to spare and the boss let her play games using a projector when it wasn't in use. She even brought in a special bean bag chair that she always sat on. One time a new guy sat on the beanbag chair to relax and was sat on by Amy. He was stuck under there for the remaining hours. Amy also worked up quite a sweat and that, combined with her giant ass successfully kidnapped a person. Last you had heard of him he was traumatized of beanbag chairs and submitted into therapy. <br>\r\n<br>\r\nNext was Nicole. She was the literal personification of hard-working and punctual. She had black hair set in a simple bun with an always bored expression. She finished work at the exact same time every single day and never broke her daily routine at work. She always took the same path, sat in the same place for the exact same amount of minutes. It made it very easy to get sat on by her throughout any time of her daily routine. She wore a business skirt that barely covered anything due to her size. If anyone or anything got her way she just plowed right through it, often ending up stepping over someone because they couldn't handle her unstoppable walk. In contrast to her prim and proper attitude layed a risky girl. She wore a thong and skimpy lingerie. You had heard of someone getting sat on by her once and they slipped right past her thong before she pulled it up and locked them in her asscrack. The person only got out after she had to take a shit, the situation causing him to just plop down on the toilet with shit entering his mouth, acting like her personal toilet which didn't sound all too bad. <br>\r\n<br>\r\nThirdly there was Amber, the sporty girl. Amber had blond hair that was long flowing and freckles on her face. She wore a tank top with a low-cut neck and sweat pants.  Amber's entire life outside of work was sports. She played Soccer, Baseball, Tennis, you name it! She also ran to and from work every day. Considering it's a 10km trek she always works up a sweat by the time she's at work. She's also super carefree, not caring what people around her think. She could spread her legs on a subway while wearing a skirt and not care that everyone was staring. One time a guy approached her while she was sleeping on the job. As he tapped her on the shoulder she grabbed him and hugged him between her boobs. Eventually, all her shifting in her sleep had gotten the guy who had long since passed out from the pressure between her boobs and inside her shirt. She then woke up just in time to go home. He stayed with her the entire trek because of the sports bra she puts on after work to make it so she doesn't \"bounce\" too much during the run. He had eventually fallen out when she took off her clothes in her room to take a shower. The smell of her room temporarily disabled his smelling sense due to the strength. Thankfully for you, you had long since gotten used to those smells. The guy who got brought to her home is now a mega clean freak, last you heard. <br>\r\n<br>\r\n</span></div></div>",
            "created":1566795600,
            "id":2708403,
            "title":"Office Worker."
        },
        "153":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Valerie",
                "Whitney",
                "Frecia"
            ],
            "content":"<div class=\"\"><div> <span>Receiving a letter from a mysterious cousin you never heard of, you were quite doubtful of it, but since you were looking for a home after you decided to leave your folks' home. It took you about a few hours to get there, but you eventually reach her home, which you're shocked by its condition. The paint was peeled, with holes allowing anyone to see into the building's skeleton and some of the parts of it was falling off, giving it the typical haunted manor look.<br>\r\n\"Say, buddy you're not going there, are you?\" An elderly man asks, coming to you as take your eyes off the house.<br>\r\n\"Is there something I should know about this place?\" You ask, the old man widening his eyes before he explains himself.<br>\r\n\"That place is cursed, I tell you! People disappear when they go there and roars shake the ground around it while you can hear screams coming from that place. I hope you're not going there for your sake!\" He said before he leaves, leaving you by yourself.<br>\r\n\"Just a crazy old man! Just a crazy old man!\" You repeat to yourself, to comfort you as just nonsense and a prayer for it to be untrue.<br>\r\nTaking a deep breath, you knock on the door and before your knuckles leave the rotten wood, the door opens immediately. Standing before was a really obese woman covered in a reddish brown fur, a greasy, stained crop top of unknown color and black short shorts. Her head resembled a wolf with sharp, yellow eyes, and temporary bulging out of belly, was the outline of a few people's faces and hands. While you stood at a height of 6'2, she stood at least twice that height, you could barely reach the middle of her calf, but your first thought was arousal at the sight of her.<br>\r\n\"Oh my! My dear cousin is here! ❤️ Whitney, don't touch him!\" Another woman said, coming into view and standing a head over the wolf girl.<br>\r\nThis extremely fat woman had long, curling black hair that touched the middle of her back and wore a black cocktail dress with a matching witch's hat. But the main thing that stood out was her green skin and her purple eyes peered at you with glee.<br>\r\n\"It's been too long since we've seen each other! Look how cute you gotten over the years!\" She said,  grabbing you before kissing you multiple times before returning you to the ground.<br>\r\n\"My name is Wendy and I'm a witch, believe it or not. Over here, is Whitney the werewolf and our guard of the estate. Despite her eating people, being clumsy, and her being a slob, she's a very nice girl and very loyal to the point of obeying almost your every command,\" she said, the wolf woman growling.<br>\r\n\"You also eat people too, you know,\" Whitney retorts, Wendy giving her gut a series of hearty pats.<br>\r\n\"It can't be helped if they're that delicious,\" she replies before they head into the house, you following behind them and the door magically shuts behind you.<br>\r\nAs they walked down the halls, pointing out where was what, your eyes were glued onto their fleshy, jiggling bottoms, and Wendy took note of it.<br>\r\n\"I hope you don't ruin this place, human,\" a pale woman said, snapping you out as she comes out of the shadows while wearing some jeggings and a pink shirt.<br>\r\nThe newcomer had short, blonde hair framing her face, her red eyes staring from it and while she wasn't as fat as the first two, her trice the size of her head breasts compensated for it.<br>\r\n\"Valerie, you're here! She's a noble blood vampire, so she can come off a bit snobbish,\" Wendy said before whispering in your ear.<br>\r\n\"...but secretly, she loves to rip ass!\"<br>\r\n\"I do not fart!\" Valerie shouts, her face red.<br>\r\n\"We all fart! How else did this place ended up looking like this?\" Wendy replies, explaining the house's appearance before a loud rumbling forces everyone to look at its source.<br>\r\nDropping one of her massive cheeks, a pear shaped beauty, covered in stitches and had shaved a part of her multicolored hair off, returns everyone's stares with a bored look.<br>\r\n\"What? I farted,\" she said in a matter of fact tone.<br>\r\n\"I can never tell what Frecia is thinking about and doesn't seem to care about a lot of things, but she's a nice person, if you can see through the flatulence she for Evey minute. If you need anything else, I'll be in my office as one of these girls will be your new roommate and you'll meet the tenants later,\" Wendy said before proofing away.<br>\r\nYou quietly stare at the spot where the witch stood for a while before a shadow covers you and you turn to see it's...</span></div></div>",
            "created":1567659600,
            "id":2713506,
            "title":"Home of monstrous women and sizes."
        },
        "154":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "David’s 42 year old mother, named Helen",
                "David’s 9 year old sister, named Chloe",
                "Both Helen and Chloe"
            ],
            "content":"<div class=\"\"><div> <span>This is a story about one very extraordinary family in two different ways.  There’s a boy named David, who is eleven years of age.  But his height is less than expected since he only stands at one and a half feet tall.  They would call him “Mini Dave” because of his miniaturised size, but he doesn’t mind of it either way.<br>\r\n<br>\r\nAt first, he only wanted to be taller, since he felt tired about being so little, especially this particular size.  But that all changed, thanks to both his mother and younger sister, and both have every extraordinary sizes in general too.  They have normal heights still, but their weight is much gigantic than any human beings usually get.<br>\r\n<br>\r\nDavid’s mother named Helen, is 42 years of age, and weighs at a massive 700 pounds!  His sister, Chloe is only nine years of age, but she weighs at a massive 500 pounds, making herself the fattest kid in the world!  Both have pear-shaped bodies, making their asses and thighs much bigger than the rest, but with their bellies also noticeably fatter too.<br>\r\n<br>\r\nThat’s not the main reason why!  The only reason with this is the way it happened by accident.  At one point, David was sitting on the chair watching TV, when Helen came over to do some chores.  She was stinking at this point, she would needed some rest to take it easily, but what she didn’t realised was that she sat on the chair, as well as in David’s little body!  At first, he urged his mother to let him go, but then with that feeling and getting squished in general, made David react different, and instead started to like being sat on by any obese females in such a way.<br>\r\n<br>\r\nLuckily, he’s been on a receiving end ever since, and the boy wouldn’t want to change of that.  And constantly as well, both his mother and his sister would come in with their obese bodies, weighing nothing but tight t-shirts and undies to come with it.  He couldn’t to get squished even more!<br>\r\n<br>\r\nAnd so to the present day, and David was sitting on the couch, watching the TV for a while.  It was early in the morning, and a young boy could take it easy for himself.  That is until he feel the ground started to shake and loud booms as if someone’s coming to the living room where he’s at right now, and that wide smile to his face says it all!<br>\r\n<br>\r\n“Here we go!”  David says in great anticipation, as he sat still when he see’s who comes in to the living room?</span></div></div>",
            "created":1567659600,
            "id":2713814,
            "title":"Two Obese Females and a ‘Little’ Boy"
        },
        "1541":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Falling Asleep.",
                "Left Behind.",
                "Bathroom Tour. "
            ],
            "content":"<div class=\"\"><div> <span>In walked in David's Mother, Helen. As always with David, his mother didn't even acknowledge his presence and seemed to stare right past him, onto the couch. His mother was wearing her usual home wear, that being underwear and a bra. Her underwear was near invisible, the only indication of it being there was the straps around her sides. The bottom part had been chewed up by his mothers gargantuan booty. <br>\r\n<br>\r\nHis mother walked in front of him and turned around, hovering her ginormous ass above his face. David smiled in glee at the fact that his mother was once again going to sit on him. <br>\r\n<br>\r\nIn almost a second the all encompassing ass suddenly descended upon David and surrounded him, leaving David mostly in between his mothers ass, the only thing sticking out was his head. David tilted up and saw the large expanse of his mothers back, before suddenly she leaned back and put David into total darkness. <br>\r\n<br>\r\nDavid was starting to grow sweaty but this wasn't anything new. He had been under his families ass's for much longer periods of time, like when his sister came into his bed in the middle of the night and crawled right on top of him. Eventually...<br>\r\n<br>\r\nA: David hears snoring. His mother fell asleep!<br>\r\nB: Davids mother stands up, leaving David on the couch.<br>\r\nC: Davids mother stands up, bringing David up for a tour of the washroom.</span></div></div>",
            "created":1567832400,
            "id":2714540,
            "title":"Big and Beautiful."
        },
        "1542":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "David’s Point of View",
                "Chloe’s Point of View"
            ],
            "content":"<div class=\"\"><div> <span><b>*BOOM...BOOM...BOOM...BOOM...BOOM...”</b><br>\r\n<br>\r\nDavid can hear the ground shaking and loud booms, whilst sitting on the couch, and it gives good indication that someone so massively huge is about to come over to the living and take a seat on the couch.  He awaits in anticipation since he couldn’t wait to get squashed again, and so much so when he saw his nine year old sister, named Chloe starts waddling into the living room.<br>\r\n<br>\r\nThe girl weighs at 500lbs, and she looks so gigantically huge from David’s point of view.  She has that pear-shaped body, making her butt and thighs larger than the rest of her obese body, although her belly is noticeably fatter as well, hence that she’s only wearing her tight t-shirt and undies, just to make her 500 pound body comfortable.  Of course for David, he can see Chloe’s cellulite marks all over her lower body, which makes him blushed heavily.<br>\r\n<br>\r\n“Oh my!  Chloe’s getting huge every time I see her like that.”  An eleven year old boy says, since he couldn’t help but admire of her ginormous body, wobbling heavily when taking big steps.<br>\r\n<br>\r\nChloe waddled through, when she stopped over to the couch where you’re at, when she spotted the TV being switched on.  Good thing it was in full credits as all she would do is asking her mother, Helen, who is in her bedroom at the moment, if she would use the TV for a while.<br>\r\n<br>\r\n“Mommy!  Can I watch the TV in the living room?”  Chloe yelled, when asking her mother for a shot.<br>\r\n<br>\r\n“Of course you can, sweetie!  You don’t need to ask me for anything.  Just feel free to use it whenever you want.”  Helen’s voice can be heard in response from her bedroom, allowing her daughter to do anything she wants.<br>\r\n<br>\r\n“I will!  Thanks Mommy!”  Chloe smiled heavily, and grabbed the TV remote as she does. <br>\r\n<br>\r\nShe then waddled towards the couch right in front a 1 1/2 foot tall boy, hovering her ginormous ass above his face. David smiled in glee at the fact that his nine year old sister was once again going to sit on him.<br>\r\n<br>\r\n“Here you go, sis!  Just sit on me and get yourself comfortable.”  David whispered, as he wouldn’t want to distract Chloe, as he was staring at her fat blubbery ass, marked with cellulites and had her underwear, which has chewed up against her gargantuan booty.<br>\r\n<br>\r\nIndeed the shadow casts above a very small boy, as Chloe drops herself down and sits right on top of David, with his body covered entirely as a result, and the length of the girl’s gigantic ass taking up the whole couch as a result.</span></div></div>",
            "created":1568955600,
            "id":2721239,
            "title":"David’s 9 year old sister, named Chloe"
        },
        "155":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Path 5",
                "Path 6",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a couple more paths to choose from.</span></div></span></div>",
            "created":1570597200,
            "id":2730344,
            "title":"Path 5:"
        },
        "1551":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Anthro fox",
                "Anthro cow",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>On your 14th birthday, your mother decided to get you new pet, but while at the pet store she was talked into buying a anthro animal, so on your 14th birthday when you came down stairs, you find a...</span></div></span></div>",
            "created":1570683600,
            "id":2730791,
            "title":"Path 5"
        },
        "15511":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Have your birthday breakfast",
                "You want to go to your room alone with jessie",
                "Somthing else"
            ],
            "content":"<div class=\"\"><div> <span>As you make your way downstairs, you can hear laughter from two woman in your living room. That's strange because normally its just you and your mother for your birthday mornings.<br>\r\n<br>\r\nYou enter the living room and see your mother and an anthro fox sitting on the couch.<br>\r\n<br>\r\n\"So that day after the burrito eating contest, i accidentally sat on him for 5 or so hou... oh hey! Its the birthday boy!\" Your mother said getting up to give you a hug.<br>\r\n<br>\r\nYou give a hug back to your mother \"Thanks mom! By the way, who's this?\" You say pointing to the anthro fox on the couch.<br>\r\n<br>\r\n\"Oh that's jessie! Shes your new pet!\" Your mother says to you.<br>\r\n<br>\r\nJessie gets up and gives you a hand shake. \"Its a pleasure to be part of your family\"<br>\r\n<br>\r\nYou look over this vixens body, and you notice the shape is quite similar to your mothers, just with a tail and more fur. Jessie has some big D sized boobs, and a nice thic ass to go along with her hour glass figure. You shake your thoughts out of your head and say, \"welcome to our home! Your gonna love it here.\"<br>\r\n<br>\r\nYour mother gives a happy smile. \"Awww its good to see you two hit it off. Now what do you want to do for your birthday son?\"<br>\r\n<br>\r\nWhat do you want to do?</span></div></div>",
            "created":1570856400,
            "id":2731661,
            "title":"Anthro fox"
        },
        "155113":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Watch a movie in the livingroom (face sitting by the girls)",
                "Play a game (possible bets)",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could you do?</span></div></span></div>",
            "created":1572152400,
            "id":2738913,
            "title":"Somthing else"
        },
        "1551131":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Your moms but",
                "The foxes but",
                "Someone else's but?"
            ],
            "content":"<div class=\"\"><div> <span>\"I know!\" You say as you get a great idea in your head. \"Lets watch a movie on the TV!\"<br>\r\n<br>\r\n\"Thats a great idea son, Ill grab a dvd.\" Said your mother<br>\r\n<br>\r\n\"Ill go microwave some popcorn!\" Said the vixen.<br>\r\n<br>\r\nYou just smile and lay face up on the couch. You know no one will notice you when they sit down, Its just the way life works for you. Luckily you dont mind one bit.<br>\r\n<br>\r\nAfter a bit of day dreaming, you see a but enter your view. Who's but is it?<br>\r\n<br>\r\n</span></div></div>",
            "created":1572167160,
            "id":2738920,
            "title":"Watch a movie in the livingroom (face sitting b..."
        },
        "15511311":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Use a toilet",
                "Use the lawn",
                "You should use me as a toilet"
            ],
            "content":"<div class=\"\"><div> <span>Soon enough, you see your mothers but start to ascend above your face. She is wearing a skirt with no panties, and your met with a her dirty asshole planted directly on your mouth. You stick your toung out, and start exploring her anus, taking in all the familiar flavors of shit in your mouth. To most people, they would vomit at the thought of licking your moms anus, but you were in heaven!<br>\r\n<br>\r\nAfter a couple minute of rimming, you feel a weight on your crotch area, and realize its Jessie taking a seat on you. This is your best birthday yet!<br>\r\n<br>\r\nYou continue rimming your moms ass for a while. Jessie and your mother were talking above you, and you can hear the occasional explosion from the movie. Then you hear something not like the other sounds, you hear a gurgle from your mother above you, and you feel her anus start to twitch. You open your mouth in anticipation of what's to come, and sure enough, she lets out a massive fart in your mouth.<br>\r\n<br>\r\n*PPPPppppppfffffffffffffffrrrrrrrrrrrrrrrrttttttttttttttt*<br>\r\n<br>\r\nYou nearly cum yourself eating her smelly fart, and you start to rim faster , enjoying the feeling of being at the mercy of her intestines. You eventually hear another gurgle again, and ready yourself for the next gift.<br>\r\n<br>\r\n*FFFFFFFrrrrrrrrrrrttttttttt* <br>\r\n<br>\r\nYou fell the fart rumble in your mouth as you savor the taste. You'll never stop loving her stench!<br>\r\n<br>\r\nThis happens many times throughout the movie, atleast 10 or 11 times, but all good things must come to an end, and your mom and Jessie both stand up, leaving you in bliss on the couch. Jessie then starts talking to your mom \"wow that was an amazing movie! I really liked it!\"<br>\r\n<br>\r\nYour mother laughs at this \"haha ya its one of my favorites\" She then grabs her gut \"Hey listen, im just gonna head off to the washroom real quick. Ill be back in a second.\"<br>\r\n<br>\r\nJessie then grabs your mothers shoulders. \"Hey, why no use the yard? Us canines really enjoy it when its nice out. Much better to squat over grass than it is to sit on a porcelain bowl.\"<br>\r\n<br>\r\nJessie was making a good case, but your mother wasn't so convinced \"I guess we could let my son decide. Where do you mommy should poop son? Should i go In the toilet like regular people? Or do you want to watch me use the yard like a dog?\" She asked.<br>\r\n<br>\r\nWhat do you say?</span></div></div>",
            "created":1579162320,
            "id":2774369,
            "title":"Your moms but"
        },
        "15511312":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "She should go outside",
                "She should use a toilet",
                "I think she should use me as a toilet"
            ],
            "content":"<div class=\"\"><div> <span>Soon enough, you see the foxes but start to ascend above your face, and your met with a tail hole planted directly on your mouth. You stick your toung out, and start exploring her anus, taking in all the new flavors of shit in your mouth. To most people, they would vomit at the thought of licking Jessies anus, but you were in heaven!<br>\r\n<br>\r\nAfter a couple minute of rimming, you feel a weight on your crotch area, and realize its your mother taking a seat on you. This is your best birthday yet!<br>\r\n<br>\r\nYou continue rimming the foxes ass for a while. Jessie and your mother were talking above you, and you can hear the occasional explosion from the movie. Then you hear something not like the other sounds, you hear a gurgle from the fox above you, and you feel her anus start to twitch. You open your mouth in anticipation of what's to come, and sure enough, she lets out a massive fart in your mouth.<br>\r\n<br>\r\n*PPPPppppppfffffffffffffffrrrrrrrrrrrrrrrrttttttttttttttt*<br>\r\n<br>\r\nYou nearly cum yourself eating her smelly fart, and you start to rim faster , enjoying the feeling of being at the mercy of her intestines. You eventually hear another gurgle again, and ready yourself for the next gift.<br>\r\n<br>\r\n*FFFFFFFrrrrrrrrrrrttttttttt* <br>\r\n<br>\r\nYou fell the fart rumble in your mouth as you savor the taste.<br>\r\n<br>\r\nThis happens many times throughout the movie, atleast 7 or 8 times, but all good things must come to an end, and your mom and Jessie both stand up, leaving you in bliss on the couch. Jessie then starts talking to your mom \"wow that was an amazing movie! I really liked it!\"<br>\r\n<br>\r\nYour mother laughs at this \"haha ya its one of my favorites too.\"<br>\r\n<br>\r\nThe fox starts to squirm a bit. \"Hey listen, where do i go to the washroom here, i really gotta poop.\" She says grabbing her gut.<br>\r\n<br>\r\n\"I guess that would be up to my son. You can do your thing outside, like other dogs do, or you could use a toilet like us.\" You mother says thinking about it. \"Where should Jessie go to the washroom dear? Your mother asks.</span></div></div>",
            "created":1578936000,
            "id":2773234,
            "title":"The foxes but"
        },
        "155113123":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "Skip to the party tonight",
                "Play some games",
                "Your mother suddenly needs to poop too",
                "There's a knock on the door",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Well... I think it would be best if she uses me as a toilet.\" You nervously say.<br>\r\n<br>\r\n\"But isn't that a little gross son? I mean, you wouldn't want me to use you as a toilet. Would you?\" Your mother says a bit puzzled by your request.<br>\r\n<br>\r\nYou try to think of some good reasons as to why you should be the new toilet in the house. \"Ya it is a little gross, but I think I can handle it. Plus think of all the benefits to Jessie, or even yourself using me as a toilet! Neither of you would have to waste time going to the bathroom, and I wouldn't need to pick up any piles of poop from the lawn. Oh! And this would offset the cost for Jessies food, considering your feeding 2 mouths for the cost of 1.\" You let out a nervous laugh.<br>\r\n<br>\r\nYour mother thinks for a second and says. \"You make a very good point. We would be saving on food, we would also be saving on toilet paper, only you would be using a toilet, so we're saving money on water. I see this as an absolute win!\" She says happily.<br>\r\n<br>\r\nJessie smiles as she walks over to you. \"I guess it's settled. Hope you enjoy what was Mexican food yesterday.\" She then hops up onto the couch and squats over your face, letting out a final big blast of gas *PPPPPPPFFFFFRRRRRRRttttttttpppppppp* and then you see the head of a giant turd falling towards your mouth. You open wide in anticipation. That's when Jessie sits on your face, sealing your mouth around her ass hole. The tip of the big log hits your toung, and it explodes with flavor in your mouth. You try to chew it to enjoy the moment, but her poop is coming out fast enough that you don't have time to chew, and all you can do is swallow to keep up. \"Wow, your doing great kiddo! It's almost like you've done this before hehe.\" Jessie laughs a little at the thought of useing her owner as a toilet. Meanwhile the flow starts to slow down, and you can finally start chewing to enjoy the full flavor.<br>\r\n<br>\r\nSoon enough. She pushes out the final log, and you swallow it with pride. You give here a rim job to clean her up, as she spoke to your mother like normal. \"So what else are we going to do today?\"<br>\r\n<br>\r\n\"That's a good question. Maybe throw a small party, we could play some games. I guess we will find out when the reader decides on one of the next 5 options.\" Your mother says breaking the 4th wall.<br>\r\n<br>\r\n\"Ooh! I hope it's a good choice!\" Jessie says<br>\r\n<br>\r\n</span></div></div>",
            "created":1593634920,
            "id":2859879,
            "title":"I think she should use me as a toilet"
        },
        "15513":{
            "author_id":"ezone_69",
            "author_name":"Ezone",
            "choices":[
                "A wolf",
                "A deer",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You rub your eyes in shock because you rarely see anthro animals as pets, what do you see in front of you?</span></div></span></div>",
            "created":1570683600,
            "id":2730792,
            "title":"Other"
        },
        "155133":{
            "author_id":"thesnake12",
            "author_name":"ricky",
            "choices":[
                "Skunk",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a truly rank animal?</span></div></span></div>",
            "created":1587988980,
            "id":2825535,
            "title":"Something else"
        },
        "1552":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "The Daycare.",
                "Trip Abroad.",
                "Other Places."
            ],
            "content":"<div class=\"\"><div> <span>You were an anomaly. In a land full of giant women and men, you were born as a minature person. You had grown a little since then, but your size was still incredible. Your family knew about you but your existence was largely kept secret to avoid panic, meaning people didn't know that a person smaller than even the diapers they use to clothe their babies was walking around.<br>\r\n<br>\r\nThe women of the world were also largely flatulent and unhygienic, leading to stink everywhere. The women weren't all fat, it's just that their size compared to you meant their asses could fit 5 of you and still have room.<br>\r\n<br>\r\nYou had used your size many times to take advantage of unaware people, and today was no exception. To start the day off you headed to...<br>\r\n<br>\r\n<br>\r\nA: The Daycare. (As said before, you can fit inside diapers and babies are basically unaware of the world around them, leaving you a free trip to stink central.)<br>\r\nB: The Airport. You had long since moved out from your mom's roof despite her protests by showing her how resilient you were, meaning your safety was assured. You could get a free trip to Hawaii with some inflight entertainment courtesy of the passengers or even the airplane staff.<br>\r\nC: Other Places to start your day off.</span></div></div>",
            "created":1583300640,
            "id":2796407,
            "title":"Land of the Giantesses"
        }
    },
    "info":{
        "author_id":"chaosjeff1",
        "author_name":"Mc Writer",
        "brief_description":"Large and stinky women never seem to notice you. Time to take advantage of that! (REWARDS)",
        "created":1560547020,
        "description":"<td align=\"left\" class=\"norm\">I'll give 1-2k for a decent chapter.<br>\r\n<br>\r\n<br>\r\n<br>\r\n Your entire life has been filled with fat women who never seem to take a shower. At the same time, it's almost as if you're invisible to them as the only way you can get noticed is if you're literally in their face screaming. <br>\r\n<br>\r\nOver the years you started to like being sat on and smelling these fat women. This interactive starts you off on the day you decide to take advantage of your \"luck\".<br>\r\n<br>\r\n<u><i><b>RULES</b></i></u><br>\r\n<br>\r\n1: Any perspective is fine to write in. Me, personally write in the second person.<br>\r\n2: Women either shouldn't notice you or they're listening to a request from you.<br>\r\n3: In addition to #2, women aren't malicious and out to get you, so don't make it like that.<br>\r\n4: You like being sat on and like the bad smells, don't make this a story where you get tortured. <br>\r\n5: Don't do 1 line chapters unless it's a choice chapter and even then, try to stretch it out a bit.<br>\r\n6: ONLY WOMEN. <br>\r\n7: Any age is allowed, you can do stuff with teenagers, fat 5 year olds, or even 70 year olds if you're into that.<br>\r\n8: I will delete anything that obviously breaks these rules. <br>\r\n<br>\r\n<br>\r\n<b>NEW RULE. WOMEN CAN BE JUST FAT, OR JUST SMELL BAD. BOTH WORKS</b></td>",
        "id":2193356,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597178340,
        "modified":1597178340,
        "pretty_title":"Stink Fantasy. BBW. (REWARDS)"
    }
}