{
    "chapters":{
        "1":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "You go to school.",
                "You go to Katie's house.",
                "You suddenly feel sick to your stomach and topple over."
            ],
            "content":"<div class=\"\"><div> <span> Your phone rings.  You're already dressed for school but are lying on your bed.  Rolling over, you see that it's Katie, your girlfriend.  You smile as her Facebook photo shows up with her Caller ID and answer, \"Hey Katie.\"<br>\r\n<br>\r\n\"_____ , I hope your planning on working out after school today.\"<br>\r\n<br>\r\n\"Today is my rest day, so no.\"<br>\r\n<br>\r\n\"Would you do it for me?  I made you an energy drink, and I really want you to like it.\"<br>\r\n<br>\r\n\"How do you -make- an energy drink?  You know what, nevermind, yeah I'll work out today.\"<br>\r\n<br>\r\nThe doorbell rings.  \"Hold up, someone's at the door.\"  Still holding the phone, you exit your room and walk downstairs into the living room.  Before you get to the door, it opens to reveal Katie.  Despite being Fall, she is wearing short shorts and her new 6'' heels.  She beams at you and says, \"Bet you feel short now, huh?\"  Grinning, you wrap your arms around her and lift her up before giving her a kiss and ask, \"Miss me?\"<br>\r\n<br>\r\nShe throws her arms out to the side, \"Put me down, you'll spill it!\"<br>\r\n<br>\r\n\"Spill what?\"  It is then that you notice she has a red solo cup in her hand.<br>\r\n<br>\r\n\"The energy drink I made for you!\"<br>\r\n<br>\r\nIn your mind, you know this is going to taste gross.  Then again, you also know that she just wants to be helpful, so you reply, \"Thanks, you're the best.\"<br>\r\n<br>\r\n\"Drink it and tell me how I did!\"<br>\r\n<br>\r\nBracing yourself, you take the cup from Katie and take a sip.  It tastes pretty good actually.  The drink is tangy and familiar.  You chug the whole thing, \"You know, it tastes like Red Bull.\"<br>\r\n<br>\r\n\"Well, it should.  That's one of the main ingredients!\"<br>\r\n<br>\r\nYou smile and ask if she's ready to go to school.  Instead of answering she just stares at the top of your head.  You roll your eyes up, attempting to be comical, as if ,looking to find what she's staring at.  She's not smiling, just staring.<br>\r\n<br>\r\n\"Is something wrong with my hair?\"<br>\r\n<br>\r\n\"What? Sorry, no.  It's nothing.  I just... kind of dazed off there. You know me.\"<br>\r\n<br>\r\nYou laugh and grab your backpack from the couch.  As you turn to leave, she stops you. \"Oh wait, I forgot my homework!\"  Katie then runs out the door towards her car, calling back behind her, \"If I don't turn it in today, I'll get a zero!\"<br>\r\n<br>\r\nYou try to yell back, \"Wait, I'll go with you!\", but she's already in her car and leaving.  You sigh as you step back into the house.<br>\r\n<br>\r\n----------------------------------------------------<br>\r\nPREVIOUSLY<br>\r\n----------------------------------------------------<br>\r\n<br>\r\nKatie is standing in a dusty and cramped little shop.  It has candles, incense, books by the thousands and just weird sculptures of dragons and bird-people.  She shivers, hating being in some place so bizarre and nerdy.  She turns to the proprietor, wrinkling her nose at the tacky purple streaks in the woman's otherwise raven black hair.<br>\r\n<br>\r\n\"Hi.  I was the one that called about the shrinking potion.\"<br>\r\n<br>\r\nThe woman, dressed in brown linen and old leather sandals, stares back at Katie without expression.  \"You have the $200?\"<br>\r\n<br>\r\n\"Only if you have what I need.\"  Katie grins as she digs for her wallet in her purse.  It's littered with tons of little things.  Toothpicks, mints, gum, nail polish, pens, scrap paper, ect.  It's a big mess.  As she pulls out her pretty pink wallet, she asks, \"And how small does this shrink him?\"<br>\r\n<br>\r\n\"About half an inch.\"<br>\r\n<br>\r\nKatie frowns, disappointed.  \"That's a lot of money.\"<br>\r\n<br>\r\n\"If you don't want to buy it, I won't force you.\"<br>\r\n<br>\r\nKatie bites her bottom lip.  \"And this is the only one you have?\"<br>\r\n<br>\r\n\"We won't have another shipment until next month.  It's very rare.\"<br>\r\n<br>\r\nKatie rolls her eyes.  The plan was to shrink you down two inches.  That way you would still be tall, but she could be taller in her new heels.  Apparently it was going to take a lot longer to accomplish.  Half an inch a month.  Oh well, she had plenty of money to spend, and she thought the idea of being taller than you was just too funny to pass up.<br>\r\n<br>\r\n\"Fine, I'll take it.\"<br>\r\n<br>\r\n---------------<br>\r\nPRESENT<br>\r\n--------------- <br>\r\n<br>\r\nAs your girlfriend leaves in a hurry, you take time to contemplate what to do next. You could just go on to school and meet her at break.  Then again, you could just go to her house to help her find her homework and risk being late again.<br>\r\n<br>\r\n</span></div></div>",
            "created":1332630900,
            "id":1301770,
            "title":"Half an Inch."
        },
        "13":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "It's your step mom, Sam.",
                "It's your older sister Kelly.",
                "It's your younger sister Andrea, too sick for school."
            ],
            "content":"<div class=\"\"><div> <span>  You take a dive into the soft carpet in your living room.  There is a twisting sickening feeling in the pit of your stomach.  As you stare out the open door, you wonder if maybe it's food poisoning from the drink.  You close your eyes and roll onto your front side, hoisting yourself onto your forearms and kneecaps.  Your head starts throbbing.  The pain hurts so much, you grit your teeth down.  You lift your right arm up and punch at the ground out of the terrible mix of surprising pain and frustration.<br>\r\n<br>\r\nAnd then it's all gone.  As swiftly as it had come on, it had left just as soon.<br>\r\n<br>\r\nYou open your eyes.  Or at least you thought you had.  It's still dark.  Oh my god.  You rub your eyes and blink several times.<br>\r\n<br>\r\nYou've gone blind!<br>\r\n<br>\r\nWait, no, there is a light in the distance...<br>\r\n<br>\r\nYou're dead!<br>\r\n<br>\r\nYou stand up.  The ground is weird.  It's like walking on clouds, which goes along with the death theory.  You're in a dark cavern, with hills and crevices.  Everything around you is pretty soft, and there are moments when it feels like the floor is sinking.  Then again, there are fun parts where you decide to slide down especially steep segments.<br>\r\n<br>\r\nStill considering the idea that this is the afterlife, you don't worry too much about your situation.  Denial.  You can't be dead.  So, then where are you?  Can people date in the afterlife?  You're sure you girlfriend will mourn for a few weeks before moving on.<br>\r\n<br>\r\nThen it happens.  You near the edge of the dark cavern.<br>\r\n<br>\r\nHoly shit.<br>\r\n<br>\r\nThis giant world..  It's your living room.  The carpet strands are as tall as you are.  The door is wide open.  You have no idea how small you are, but it's gotta be teeny.  But where the hell am---<br>\r\n<br>\r\nYou're naked!  How did you not notice this before? It might have been being preoccupied with being dead.  Dead people don't need clothes.  Putting two and two together, you realize you're standing in the sleeve of your own shirt.<br>\r\n<br>\r\nThe outside world was a mix of large hums that had simply faded into the background until a series of amplifying booms.  Each louder than the last,<br>\r\n<br>\r\n\"WHY THE HELL IS THE DOOR OPEN?\"<br>\r\n<br>\r\n<br>\r\nYou look towards the door of your living room.  She is so unbelievably huge.  Even from an angle, it hurts to look up.  You know you gotta get her to notice you fast.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1333281600,
            "id":1307274,
            "title":"At Home"
        }
    },
    "info":{
        "author_id":"ijirashii",
        "author_name":"Iji",
        "brief_description":" Your run of good luck ends when your Girlfriend accidentally causes you to shrink.",
        "created":1332628860,
        "description":"<td align=\"left\" class=\"norm\">Hey gts community.  My last story was very short and kind of hard to write.  I didn't want it to be too personal but at the same time, I kind of did.  So, I'm just scrapping that and starting a new one.  This one is tailored to fit the community.  If you have ideas or themes you would like to see here, either post a chapter or mail me the suggestion.  I'll try to incorporate a little something for everyone.<br>\r\n<br>\r\n---------<br>\r\n<br>\r\nBackstory:<br>\r\n     You live with your older sister Kelly (borrowed name :) ), your half-sister Andrea, and your step-mother Samantha.  Your mom died at childbirth with you and your dad passed away about five years ago.  You were scrawny and geeky most of your life.  That is, until last summer.  You started working out real hard with p90x, and now sport a nice sixpack and a tan.  It's still a little overwhelming how different girls treat you now.  Speaking of which, you now have your first serious relationship.  She had always been out of your league, but you two have been together since she asked you out three months ago.  You're doing great in school, becoming really popular and things are really just looking up for you.<br>\r\n<br>\r\nLets meet some of these characters.<br>\r\n<br>\r\nYou - <br>\r\n   17 years old.  You are a senior in highschool this year. Your 6'1'', have pecs, abs and everything else.  You may not be a model, but you're now one of the better looking guys in school.  Not that you have an ego, you've just noticed that most every girl you walk by tends to stare.  Pretty nice, right?<br>\r\n<br>\r\nKelly -  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i809.photobucket.com/albums/zz15/qsz06/DSCF1041.jpg\" target=\"_blank\">http://i809.photobucket.com/albums/zz15/qsz06/DSCF1041.jpg</a><br>\r\n  20 years old.  She still lives at home, working part time while going to college.  She's always babied you and you're very close with one another.  Lately you don't see much of each other, but you still remember her being one of your closest friends when you two were younger.<br>\r\n<br>\r\nAndrea - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://static.tumblr.com/yluujpm/SJaly562l/415536_2921054066734_1272293542_33138860_1786389723_o.jpg\" target=\"_blank\">http://static.tumblr.com/yluujpm/SJaly562l/415536_2921054066734_1272293542_33138...</a><br>\r\n  15 years old.  She's immature and kind of a bitch.  Instead of tantrums, she now just likes to scream at you and keep her door locked at all times.  You would call it a phase, but she's been like this for as long as you've known her.  She also has massive Polly Pocket collection.  What 15yr old girl still plays with dolls?  She's into Britney Spears and Lady Gaga, as she blasts their CDs all day long.<br>\r\n<br>\r\nSamantha - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://allkindsofpretty.com/wp-content/uploads/2010/07/IMG_3932.jpg\" target=\"_blank\">http://allkindsofpretty.com/wp-content/uploads/2010/07/IMG_3932.jpg</a><br>\r\n  35 years old.  She's pretty, you guess.  She doesn't really talk to you nor your sister Kelly.  She opens up to Andrea, though.  It's not like she's an evil step-mother or anything.  She's just very vacant.  She works at home designing websites.  She's very focused on whatever she's doing, whenever she's doing it, but also tends to drift off when she's not trying to complete some task.  Often, you'll call her names several times for something, only just to give up and go do it yourself.<br>\r\n<br>\r\nKatie -  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://2.bp.blogspot.com/-7MZXoQ-8IN8/TfPem8kTbYI/AAAAAAAAAiE/r6N9cXCGLRQ/s1600/hot-hansika-motwani-in-bikini-sexy1.jpg\" target=\"_blank\">http://2.bp.blogspot.com/-7MZXoQ-8IN8/TfPem8kTbYI/AAAAAAAAAiE/r6N9cXCGLRQ/s1600/...</a><br>\r\n  17 years old.  Your girlfriend.  You think she's beautiful.  She's 5'6''.  7 inches shorter than you.  You tease her about her height sometimes, and so she bought a pair of 6'' heels.  You brag that you're still taller even then.  She says she's in love with you.  You haven't said it back yet though.  She can be a ditz and times and seems pretty superficial.  You wonder if she only likes you for your body.  She's very handsy, but then again, it might just be that you're not used to being a magnet for affection.<br>\r\n<br>\r\nKim  - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://kmeyerphotography.com/blog/wp-content/uploads/2010/12/sizinup.jpg\" target=\"_blank\">http://kmeyerphotography.com/blog/wp-content/uploads/2010/12/sizinup.jpg</a><br>\r\n  16 years old.  You girlfriend's sister.  She thinks of herself as a hipster.  Whatever that means.  She wears thick black glasses and has a nosering.  She goes out of her way to spend time with you.  You told you that she was in love with you the first day you met her.  She's forthcoming in her affection, and it often causes her to fight with her sister.  She is a huge nerd,and it sometimes gets weird when you catch her gawking at you.  She would have been more your type were she not so annoying with her advances.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nI'll add more characters as they are introduced.  Some may not get a description, but recurring characters will.<br>\r\n<br>\r\n<br>\r\nRULES:<br>\r\n1) No one-line chapters.  You don't have to be a good writer.  I'm not.  Just advance the story from where it was.<br>\r\n2) Guys are not off-limits, but I will not be writing any in.  If you want to see some Giant action, there are plenty of other interactives.  Or, you could just write the chapter yourself.  I won't delete them, but I'm not going to introduce them either (unless it's a high request.)<br>\r\n3) No size changing.  I like people to have perspective.  <br>\r\n<br>\r\n</td>",
        "id":1857017,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1333281600,
        "modified":1333281600,
        "pretty_title":"Just When Things Were Looking Up"
    }
}