{
    "chapters":{
        "1":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Amanda, in a bitchy mood as always",
                "Crystal, really excited to see you!",
                "Kate, a little shy as always"
            ],
            "content":"<div class=\"\"><div> <span>Earlier today you recieved in the mail the size powders you ordered weeks ago. Since your parents were out on a business trip for a week the timing couldn't have been better. Currently in your room unwrapping the package you recieved moments ago, you retrieve from the box two container labeled \"Growth\" and \"Shrink\"<br>\r\nThinking of the possibilities you could use the powders for your train of thought is broken as the door bell rings. Rushing downstairs, you open the door to see...</span></div></div>",
            "created":1410377400,
            "id":1855209,
            "title":"It begins"
        },
        "11":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "You start shrinking",
                "Amanda grows"
            ],
            "content":"<div class=\"\"><div> <span>\"Great...\" you think the second you see Amanda as you open the door. \"Took you long enough Nick! Now let's get this project done fast so I don't have to be around you\" She says annoyed as she pushes you aside and enters your house. \"How could I forget...\" you think to yourself after remembering you were partnered with Amanda for your science project. Looking back to Amanda as she walked to your living room to set up, you couldn't help but stare at her perfect booty as it jiggled side to side in her tight jeans.<br>\r\n\"What's this Nick? Did you really think this crappy glitter from a dollar bought would make  better?\" Amanda says as she pulls up the growth and shrinking powders you ordered off the coffee table. Immediately you began to panic, how did the serums get there when you left them upstairs and why do they have to be the hands of the worse person!?<br>\r\n\"Don't touch those!\" You shout as you run up to her, \"Don't shout at me asshole!\" she replies. \"Sorry... sorry...\" you say. \"That isn't cheap dollar store glitter, please give it back\". \"Then what is it?\" She says rolling her eyes, pulling her arm away from you. \"Tell me and I might give it back!\" Amanda bitches as you approach her and reach for it. \"Back off asshole!\" She yells as you grab her arm to forcefully take back the powders. \"It doesn't matter, I paid good money for those so give them back!\" You reply now ticked.<br>\r\nWhat you thought would be an easy tug of war turned into chaos when one of the powders opened after pulling too hard and exploded all over you and Amanda. \"You fucking asshole!\" Amanda yells standing up to try and wipe it off herself but suddenly... </span></div></div>",
            "created":1431826500,
            "id":1978991,
            "title":"Amanda, in a bitchy mood as always"
        },
        "112":{
            "choices":[
                "Don't get people involved ",
                "Get Crystal involved ",
                "Get Kate and Crystal  involved "
            ],
            "content":"<div class=\"\"><div> <span> <a rel=\"nofollow\" href=\"https://www.writing.com/main/interact/item_id/1920548-Shrinking-down-to-teenage-girls/map/112\" target=\"_blank\">https://www.writing.com/main/interact/it...</a><br>\r\n<br>\r\n\"Look what you fucking did, You ruined my clothes Nick! You owe me a new set. Got that ?\" Amanda yelled while she brushed off the powder. \"If you'd just given me the packet none of this would have happened\" I responded back. \"Um well you could have told me what they were, and I'd -\" Suddenly Amanda stopped and feel to the floor. \"Nick? What as that powder? It wasn't some rape drug was it?\" Amanda asked me with a concern in her voice. “ Trust me Amanda it was nothing of that sort !” I exclaim “ it's growth powder” I finally confessed. “Growth powder ? Are you kidding me! Nick you don't actually believe that, that stuff actually works do you ?” “Uh Amanda? I think the stuff is working. Look your growing!” I tell her as I Watch her body get bigger and bigger.<br>\r\n<br>\r\nAmanda's face evolved into a more exotic one as the seconds had ticked by. Her long blonde hair added more volume and length, her breasts swelled up, her stomach flattened packing on a slight 6-pack, her waist narrowed down while her hips protruded outwards, her butt inflated while her long luscious legs grow longer and sexier.<br>\r\n<br>\r\nHer soft moans that escaped her lush lips made it quite evident that she had enjoyed the experience.<br>\r\n<br>\r\nThe spectacle that was in front of me had turned me on so much that my hard cock was starting to hurt. Soon I felt myself hit the floor. I started to emit groans as I felt changes take place in my body.<br>\r\n<br>\r\nMy body was consumed by an overwhelming sensation of euphoria.My body was packed on muscles that took up any loose space within my clothing. I felt my cock get lengthier and heavier, my testicles expanded like balloons. Eventually my body started ripped out of the weak fabric. My biceps bulged with power, my chest and abs rippled across with strength, my legs toned up with muscles. every part of my body was enhanced. I had became the perfect male specimen. <br>\r\n<br>\r\nAmanda took notice of the new me ano complimented my new body physique “Shit Nick! I can't believe I'm<br>\r\nSaying this but you look amazing!” “You too” I complimented back. As I regained my senses and got up off the floor I took another look at Amanda's naked hot body. <br>\r\nAmanda was so hot that it drove me in mad lust and love for her. Despite our ugly past.<br>\r\n<br>\r\nAfter our short exchange we stood in awkward silence not knowing what to do next. I kept my eyes on her body and so had she dom to me. We had acknowledged each other's presence. Finally for what seemed like an eternity I broke the silence by asking her, “What should we do now ?”. It seemed to take her by surprise as she had to look of an absent minded student who had just been called on in class. “What do I want to do? You ask?” “Yea what should we do now?” I reminded her of the question. “Oh uh, I guess we should go and find a new set of clothes”. “ Alright then follow me upstairs then” I mentioned to her as I headed for the stairs towards my parents room. When we reached there I showed Amanda my mother's clothes. But unfortunately they did not fit. “What do we do now” I had asked. “ um” Amanda said nervously “We could go and have some fun”. I figured out she was alluding to having sex, so I did something that had surprised both Amanda and myself. I went and firmly planted a kiss on her lips. She was quick to return the favor. Things heated up quickly. We went to the floor and started groping each other. We crushed through furniture as we rolled around. After a while of intense kissing we went straight to hardcore fucking. I trusted in and out of her pussy. Stretching it with my ginormous thick cock. My balls slapped the bottom of her ass with each trust. I kept fucking her over and over. We fucked for hours trying many new positions not even coming once. At some point we started feeling the intense building up and I knew that I was soon going to cum. Amanda had sensed it too. She wrapped her legs around my waist and locked me into her pussy. Both of us came violently. I shot my cum into her. Inflating her womb so much that the slight 6-pack had disappeared and was replaced by a bulge of my cum. Amanda had arched her back at the same time and squirt her pussy juice all over the base of my cock.<br>\r\n<br>\r\nAs we cooled down and I had pulled my cock out we passionately kissed softly until we felt something hit our heads.<br>\r\nIt was the ceiling! Our fuck session had made us grow. We Looked at each other and the we looked around us. The sight of broken furniture and our bodies filling up the room was slowly turning us on again. We kissed a little bit more and conversed weather or not we should get more people in on the fun. </span></div></div>",
            "created":1497903360,
            "id":2338984,
            "title":"Amanda grows"
        },
        "12":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Crystal wants to shrink you!",
                "Crystal wants to grow!"
            ],
            "content":"<div class=\"\"><div> <span>Opening the door your heart almost stopped at the sight of your hot good friend Crystal. \"Nicky!\" Crystal shrieks as she instantly charges at you and hugs you tight. \"What brings you around?\" You ask, \"Well...\" Crystal starts as she steps inches away from you and brushes her bubble butt against you, \"I heard your parents are away for a bit so I was wondering if you wanted to... hang out?\"<br>\r\n\"With you always!\" You reply, making Crystal giggle and sprint out of sight and into the living room. \"Nicky lets watch something ok?\" you hear her shout as you walk. After you walk in, Crystal stands up off the couch and proudly displays the powders that just arrived in the mail. \"What are these Nicky? I almost sat on top of them!\"<br>\r\nAt the sight of Crystal with your size powders all you could think of was how hot it would be to see Crystal tower over you but at the size time how awkward it would be to explain what they were.<br>\r\n\"It's uh... protein powder give it here\" you say only for Crystal to start giggling and hold them back further away from you.\"Your'e lying Nicky, what is it SERIOUSLY?\" Crystals says as she opens one of the powders, making you immediately spilling the beans before anything bad happens.<br>\r\n\"Ok ok! I can't lie to you but you wouldn't believe me...\" you begin as Crystal bites her glossy lip awaiting your answer. \"These powders can make things bigger or smaller you see... I wanted to try it out on vegetables or something...\" You lie but to your surprise Crystal looks excited.<br>\r\n\"I got a better idea Nicky!\" She yells rushing up to you with a huge grin.</span></div></div>",
            "created":1431913320,
            "id":1979552,
            "title":"Crystal, really excited to see you!"
        }
    },
    "info":{
        "author_id":"awesomeghost",
        "author_name":"awesomeghost",
        "brief_description":"Have fun shrinking or make them huge if you wish ",
        "created":1361423280,
        "description":"<td align=\"left\" class=\"norm\">Your name is Nick. Currently 16 years old and alone at home as your parents went on a business trip and leaving you for the week. Being home alone is kinda boring but a surprise visit, things will surely get amusing.<br>\r\n<br>\r\nAmanda: Amanda 16 years old and is flat out not fond of you. She has always been a bitch to you and would surely take complete advantage over you if she could. Even though she is always mean, you've always found her quite attractive. Amanda has bright blonde hair, bright blue eyes, plushy lips, big boobs and a huge booty she always likes to show off in tight jeans<br>\r\n<br>\r\nCrystal: Crystal is 16 years old and you've known her since you were seven and have had a crush on her since. Crystal is loud, fun, outgoing and seems to giggle alot around Nick. Crystal is Asian with jet black hair, green deep eyes, a beautiful face, descent sized boobs and a perfect huge bubble butt she likes to show off in yoga pants.<br>\r\n<br>\r\nKate: Kate is 16 years old and has been one of your good friends for about a year now. She is best friends with Crystal and tends to be a little shy around you. Kate is Indian with black hair, brown eyes, a pretty face, big boobs and nice ass. Kate likes Nick but hasn't pushed in on you as Crystal tends to keep her away.<br>\r\n<br>\r\nNo Rules, have fun shrinking or make them HUGE if you wish ;)  </td>",
        "id":1920548,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1497903360,
        "modified":1497903360,
        "pretty_title":"Shrinking down to teenage girls"
    }
}