{
    "chapters":{
        "1":{
            "author_id":"jfoxx",
            "author_name":"Johnny Foxx",
            "choices":[
                "Jim is allowed into Heaven",
                "Jim is sent to Limbo",
                "Jim is put in Purgatory",
                "Jim is sent back to Earth...as a wondering spirit",
                "Jim is cast into Hell"
            ],
            "content":"<div class=\"\"><div> <span>I never saw it coming. Then again, most never do. I was just crossng the street, positive that nothing was coming towards me, when seemingly out of nowhere this truck comes plowing into me. The next thing I know, I'm standing in some line of people that seems to literally go on behind me for miles, and is only getting longer. The ground seems to be made of clouds, and up ahead at the front of the line, I see a set of gigantic golden gates. Well, it doesn't take a genius to figure out where I was, as much as I couldn't believe it. <br>\r\n<br>\r\n\"So...I'm dead?\" I said out loud to nobody in particular, but still received an answer. \"Yep. Shocker, isn't it?\" I turned around to see a young blonde woman around my age behind me. \"I'm Jessica, by the way.\" She said, holding out her hand. I shook it and introduced myself. \"So, how'd you end up here?\" She asked. \"Let's just say I should have listened to my mother when she told me to always look both ways before crossing the street.\" We both chuckled. It felt kind of weird, honestly, making light of my own death. But that was sort of a habbit of mine, to make jokes in serious situations. Sort of like a personal defense mechanism. <br>\r\n<br>\r\n\"So...what happens now?\" I asked. Jessica pointed to the head of the line. \"When you get to the front, they'll ask your name. If it's in the Book of Life, you can pass on.\" \"How do you know this?\" \"I went to a Catholic school, they taught us a lot about this kind of thing.\" After the line had moved forward a bit, I asked her \"So what happened to you?\" \"Drug overdose.\" She said matter of factly. I turned to face her. \"I thought you were a Catholic school student?\" She gave a nervous shrug. \"Never said I was perfect.\" <br>\r\n<br>\r\nFor what felt like hours I stood in that line, as it moved towards the gates one by one. The entire time, I was getting more nervous by the minute. I was no saint, but I didn't consider myself a bad person by any means, either. Still, I had some things on my conscience I wasn't really proud of. I hoped those things wouldn't beheld against me. <br>\r\n<br>\r\nFinally, I make it to the front of the line, to a large marble podium with a Golden book laid open on top. Behind the podium stood who I assumed was St. Peter. As I stepped forward, he simply asked \"Name?\" <br>\r\n<br>\r\n\"Jim Grey.\"<br>\r\n<br>\r\nI would have been sweating profusely if I had a physical body as he searched for my name in the book. Finally, he looked at me, and...</span></div></div>",
            "created":1594011600,
            "id":2863113,
            "title":"Judgement"
        }
    },
    "info":{
        "author_id":"jfoxx",
        "author_name":"Johnny Foxx",
        "brief_description":"Follow Jim Grey from his divine judgement to the afterlife. This is sure to be interesting",
        "created":1594091820,
        "description":"<td align=\"left\" class=\"norm\">Jim Grey was just your average guy in his early twenties, with nothing particularly special or interesting about his life. When a sudden accident cuts said life short, he finds himself in a seemingly endless line leading to a golden set of gates. That's right, he's about to be judged and either rewarded or punished for the life be lived. Will he be allowed to pass through the gates of Heaven? Or be plunged to the torment of Hell for eternity? Or maybe somewhere in between? Either way, it's sure to make for an interesting story! </td>",
        "id":2226224,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594440780,
        "modified":1594440780,
        "pretty_title":"So I'm Dead. What Now?"
    }
}