{
    "chapters":{
        "1":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "MInato",
                "Kakashi",
                "Jiraiya",
                "Hiruzen ",
                "some one else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well who are we going to be following in this story?</span></div></span></div>",
            "created":1526274000,
            "id":2492968,
            "title":"Leading male "
        },
        "11":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "pre cannon",
                "AU where he lives",
                "different AU",
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does this happen pre cannon, in an alternate AU where he lives, a unique AU,</span></div></span></div>",
            "created":1526274000,
            "id":2492972,
            "title":"MInato"
        },
        "111":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "Jiraiya inspired",
                "found a special jutsu scroll",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what caused this to happen</span></div></span></div>",
            "created":1526274000,
            "id":2493069,
            "title":"pre cannon"
        },
        "112":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "a god interferes",
                "kyuubi does not attack",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how does he live?</span></div></span></div>",
            "created":1527224400,
            "id":2498589,
            "title":"AU where he lives"
        },
        "1121":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "kami, yami, shikigami",
                "amaterasu, susanno, tsukuyomi",
                "other gods"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what god is it?</span></div></span></div>",
            "created":1531112400,
            "id":2517225,
            "title":"a god interferes"
        },
        "11213":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yep ",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about Inari the god of foxes helping him</span></div></span></div>",
            "created":1531112400,
            "id":2517226,
            "title":"other gods"
        },
        "112131":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "its been corrupted by its anger",
                "Readers Choice",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Minato could only look in sadness as he placed his son on the sealing alter. he knew his only choice was the shiki fugen to seal half of the kyuubi into himself and the other half into Naruto. he had faith his son could handle the burden, but he did not want to leave his son. <br>\r\n<br>\r\nbefore he could start the handsigns to summon the shikigami he saw the fox suddenly stop moving along with everthing else around him. \"What what is happening,\" asked minato. <br>\r\n<br>\r\n\"I just asked for a favor from a relative,\" aid a female voice. Minato turned and saw a beautiful  women with long dark hair and brown eyes. she was wearing a shrine maiden uniform. minaot wondered what she was doing here till he saw a fox tail swinging behind her. <br>\r\n<br>\r\n<br>\r\n\"Inari-sama what are you doing here,\" asked Minato. his main concern was that she was here to release the fox. <br>\r\n<br>\r\n<br>\r\n\"Relax MInato im actually here to help you,\" she said. <br>\r\n<br>\r\n<br>\r\n\"help me why,\" minato startd to say before he stopped not wanting to offend the god. <br>\r\n<br>\r\n<br>\r\n\"Why would I help you seal a fellow fox,\" she said with a small smile. \"the reason for this is because________\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nwhy is she helping deal with the fox?</span></div></div>",
            "created":1531112400,
            "id":2517249,
            "title":"yep "
        },
        "1121313":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yep ",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is she doing this for the fun of it</span></div></span></div>",
            "created":1531112400,
            "id":2517250,
            "title":"something else"
        },
        "11213131":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "minato explains what happenedto kushina and hiruzen",
                "hospital visit",
                "the couple returning home"
            ],
            "content":"<div class=\"\"><div> <span>MInato could only blink as he said, \"your helping for the fun of it.\" <br>\r\n<br>\r\n\"Yep you would be surprised how boring it can be being a god and I saw an opportunity for some fun,\" she said with a smirk. she then waived her arm and turned the fox into pure energy she then split the energy in half and inserted half of that energy into naruto and the other half in Kushina. minato looked worried about them both before Inari spoke to him. \"Don't worry they will both be okay. I split the fox energy in half and inserted each half into your wife and child.\" she held up a small sphere of energy in her hand. \"this is the fox consciousness. you will find out what happened with this later.\" she turned to leave before she said, \"oh yeah I would keep it a secret what happened here tonight. some parties may try to take advantage of it.\" she suddenly disappeared. <br>\r\n<br>\r\n<br>\r\nTime suddenly restarted and kushina looked on in shock at seeing the kyuubi disapear. \"minato what happened,\" she manage to say. <br>\r\n<br>\r\n<br>\r\n\"that is a long story kushina-chan. lets get naruto to the hospital to make sure he is okay and check on the village,\" Minato said with a small sigh. <br>\r\n<br>\r\n<br>\r\n\"Ok but i want the full story later,\" she said grabbing naruto. normaly she would want to know right now but she was worried about her son. minato placed a hand on her shoulder and the group dissapeared to the hospital. <br>\r\n<br>\r\n<br>\r\n<br>\r\nIn a tree in the distance inari had a small smirk on her face wondering how this would affect the future. \"I wonder how long it will take before they find my little gift\"<br>\r\n<br>\r\n<br>\r\n<br>\r\nwhat next?<br>\r\n</span></div></div>",
            "created":1531112400,
            "id":2517267,
            "title":"yep "
        },
        "112131313":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "scroll contents number 1",
                "scroll contents number 2",
                "scroll contents number 3"
            ],
            "content":"<div class=\"\"><div> <span>after explaining what happened to Hiruzen and getting Naruto checked out of the hospital the two ninja made their way home. the two could not help but collapse in exhaustion in their living room with kushina carrying Naruto in her arms. <br>\r\n<br>\r\n\"I cant believe a goddess helped us because she was bored,\" said kushina. <br>\r\n<br>\r\n\"I know kushina-Chan,\" said Minato. \"I cant help but feel like this was only the start of her entertainment though\" just as soon as he said they heard a loud banging sound from their room. the two jumped up with kushina holding Naruto in a protective manner. Minato drew his kunai and made his way to the room. <br>\r\n<br>\r\nWhen he entered the room he could not stop his jaw from dropping at the sight in front of him. laying on their floor was a women with long dark orange hair and nine matching fox tails. the only thing she had on was rope used to bind her. her arms were in a box tie connected to a pentagram chest harness. her legs were tied above and below the knees as well as the ankle. the ankle rope was attached to another rope that was pulled through a pulley on the ceiling and tied down to the corner of the bed. this made her legs stick up in the air. her mouth is gaged with a rope bit gag and he could see her staring at him with furry in her red eyes. the nine tails she had were tied togeather with rope and tied down to two hooks in the floor.<br>\r\n<br>\r\n\"Minato what is it,\" He heard kushina yell. <br>\r\n<br>\r\n\"You may want to come up here or you may not beleive me,\" he said with complete honesty after he snapped out of his stupor. <br>\r\n<br>\r\nshe came up a moment later and said, \"What in the world.\" <br>\r\n<br>\r\n\"I think we may have found the next peice to inari-sama's entertainment,\" said minato pointing out a small scroll with a mark of a fox on it. it was tied to a string of wire that was also tieing her big toes togeather. minato grabbed the scroll and opened it. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat did the scroll say?<br>\r\n</span></div></div>",
            "created":1531198800,
            "id":2517297,
            "title":"the couple returning home"
        },
        "1121313131":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "Happy (he was trained by a super pervert afterall)",
                "nervous (Kushina is going to kill him when she reads this)",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Dear Minato Namikaze.<br>\r\n<br>\r\nI hope you like my little gift. this is the kyuubi given human form. her name is kurama. she is now officially your slave congratulations!! now I was originally going to keep her but she started to call me a traitor to foxes and a few other rude remarks so I decided she should be trained first. normally I would do it myself, but unfortunately fate is being a pain with me messing up her plan so ill give her to you to train. she will remain with your family till five generations from now die. <br>\r\n<br>\r\nIf you look at her neck you will notice a red collar on her neck this collar prevents her from harming any one of your blood in any form. unfortunately due to this your wife or any other mates that your family may claim will be susceptible to attack. to prevent this just open the seal on the bottom of this letter and you will find a box of brown collars. she will not be able to attack any one who wears these collars and they will be invisible to all, but who wear the collars and of course of your bloodline. <br>\r\n<br>\r\nsincerely <br>\r\nInari <br>\r\n<br>\r\n<br>\r\nPS I gave you a surprise in your basement to help with training good luck.<br>\r\n<br>\r\n<br>\r\nHow does he respond to the letter</span></div></div>",
            "created":1538629200,
            "id":2559016,
            "title":"scroll contents number 1"
        },
        "11213131312":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "Furious ",
                "accepting",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Minato-kun what is it,\" kushina asked. <br>\r\n<br>\r\n<br>\r\n\"um Kushina please don't me mad I had nothing to do with this,\" he said as he handed her the letter. as she was reading it he was trying to figure out if he should start running from her rage. <br>\r\n<br>\r\n<br>\r\nHow does she react to the letter?</span></div></div>",
            "created":1538629200,
            "id":2559017,
            "title":"nervous"
        },
        "112131313122":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "surprise those collars had a few other features i didnt mention",
                "conditions for my help",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"well this is just great,\" she said as she handed Naruto to Minato. \"don't worry I don't blame you but if I ever meet inari sama I will be having words with her.\" <br>\r\n<br>\r\nshe then takes the scroll and unseals the box of brown collars. they look at the box and find over a hundred collars. \"now why would she make so many? did she think we would have this many descendants in five generations?\"<br>\r\n<br>\r\n\"maybe she just want to make sure we had enough,\" guessed Minato. \"I mean she would probably not want to send more to us if we ran out if she only gave us a hand full.\" <br>\r\n<br>\r\nthinking about it kushina says, \"true I guess it would be annoying for her.\" she then pulls out one of the collars and plaves it around her neck it stretches till it goes around her neck. \"huh guess they must adjust to the wearer. what the hell.\" kushina suddenly exclaims as she is touching the collar.<br>\r\n<br>\r\n \"what is it,\" asked Minato in concern. <br>\r\n<br>\r\n\"the latch to connect the ends of the collars disappeared it doesn't appear to be possible to take these off I know she said they should be invisible but still I would like to take it off sometimes,\" said kushina with her hands going around the collars. <br>\r\n<br>\r\n\"why would she have the connection disappear,\" wondered Minato. before he could come up with a theory a seal on the box lit up and released another letter. \"maybe this will explain it.\" <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat does it say?</span></div></div>",
            "created":1538629200,
            "id":2559025,
            "title":"accepting"
        },
        "1121313131221":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "happy (he was trained by a super pervert)",
                "upset",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Dear Minato<br>\r\n<br>\r\nsurprise Minato at this point your wife should have put on one of the collars for this letter to appear. of course I put a strong compulsion on the box to make her put one on but oh well. now these collars have a few additional features then what I mentioned earlier of preventing the fox from attacking the wearer. first off they will feel compelled to follow any order given to them by you. so congrats your wife is now your slave. another feature is that it will make them horny and increase that for every day they don't sleep with you. the only exception of the first six months after birth so they can focus on the child. <br>\r\n<br>\r\nthe collars will bring out their hidden desires that they are to nervous to mention themselves normally. Hint while your wife may act dominant most of the time she secretly love the times you take over in the bed room so she may enjoy the basement as well. the collars also connect them to your life force so as long as you live they will live as well.<br>\r\n<br>\r\nnow I'm sure you wondered why you have so many collars well that is because I want you to take a few more slaves. some I may send to you, and others will happen due to future events I know is going to happen in the village. when all is said and done I expect you to have ten slaves at least by the end of twenty years and at least ten kids. Hey I'm also the god of fertility so you should have expected something like this. and look at the bright side you already have two slaves and just need eight more. be warned that if you don't meet my expectations ill be forced to use your children as my own personal slaves till I decide they have paid your price. <br>\r\n<br>\r\nSincerely with love ,<br>\r\n<br>\r\n<br>\r\nInari Okami<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nHow does Minato react to this?</span></div></div>",
            "created":1540098000,
            "id":2566928,
            "title":"a few more features"
        },
        "11213131312212":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "leave her there",
                "move to the basement",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"shit I cant believe this I'm so sorry kushina-Chan,\" said Minato as he handed the letter to kushina. <br>\r\n<br>\r\nShe read it quickly and he could see the tick mark forming on her forehead and in a moment of anger aimed to hit Minato only for him to yell, \"stop I have Naruto.\" suddenly she was frozen in place and was unable to move. minato stared at her for a moment waiting for her to respond only to realize that she could not speak. \"um you can move again,\" he said with some hesitation. <br>\r\n<br>\r\n<br>\r\nshe was suddenly able to move again and said, \"what was that? was that what she meant when she said I had to follow your every order?\" <br>\r\n<br>\r\n<br>\r\n\"I guess,\" said Minato. \"I'm so sorry kushina Chan if I had known she was going to do this I would of turned her down on the spot.\" <br>\r\n<br>\r\n<br>\r\n\"that's okay Minato-kun what other choice did you have if you had gone with your original plan then we would be dead and who knows what would of happened to Naruto,\" she said now that she had a chance to calm down from her initial anger. \"lets talk about this in the morning we are both tired and not thinking straight.\" <br>\r\n<br>\r\n<br>\r\n\"what should we do with her,\" asked minato pointing at the kyuubi. <br>\r\n<br>\r\n<br>\r\n<br>\r\n\"what do they do with the kyuubi? </span></div></div>",
            "created":1540184400,
            "id":2566986,
            "title":"upset"
        },
        "112131313122121":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "early (narutos hungry)",
                "shocked (thought it was a dream)",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"just leave her she looks comfortable,\" said kushina as she placed Naruto in the crib next to their bed. hearing this kurama started to yell at the top of her lungs through the gag threatening them. <br>\r\n<br>\r\nAfraid she would wake Naruto Minato said, \"kurama silence.\" the kyuubi then found herself unable to speak she tried repeatedly but nothing would come out. she started to cry in despair at her situation. seeing the tears Minato felt a little guilty so he grabbed a pillow and placed it under her head. \"I'm sorry about this but I can have you waking Naruto.\" with that he went to the bed and joined kushina with the two passing out not long after. <br>\r\n<br>\r\nlooking at the bed where her 'master' now slept kurama felt immense waves of anger. she is the kyuubi the strongest of the bijuu not some toy for the humans to play with. when that insult to foxes said she was going to turn her into a plaything she screamed and yelled at the deity. of course she knew she went to far when the deity gained a dark look. and pulled out some rope. \"you have been a bad girl. unfortunately despite my boredom I just don't have the time to train you so I think ill let the humans do that I just know that will make you understand your future role better,\" she said as she used the rope to tie her into the position she is now in. after fighting the bonds a bit more she decide to rest her head on the pillow and passed out.<br>\r\n<br>\r\nhow do they wake up in the morning?<br>\r\n</span></div></div>",
            "created":1540184400,
            "id":2567168,
            "title":"leave her there"
        },
        "1121313131221211":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "follow minato",
                "follow kushina",
                "follow kurama"
            ],
            "content":"<div class=\"\"><div> <span>at about four am Naruto started to cry at the top of his lungs waking the other occupants of the room. groggily kushina gets up from her bed and tends to Naruto trying to figure out why he is crying. after a minute she figures he is hungry so she starts to breast feed him. <br>\r\n<br>\r\n<br>\r\n\"well since our human alarm woke us up I guess I should head into the office,\" said Minato sadly. \"I would rather spend all day with the two loves of my life but I have to head in a lot happened last night.\" he made his way to the closet only to forget about the kyuubi in his tired state and trip over her. <br>\r\n<br>\r\n<br>\r\nseeing her husband trip and land face first on the ground kushina could not help but laugh. \"maybe we should not have left her in there last night,\" she said between laughs. <br>\r\n<br>\r\n<br>\r\nRubbing his face as he gets up,\" yeah you might be right about that. be safe ill be back hopefully for lunch,\" said minato as he quickly dressed and kissed kushina and naruto before he teleported out. with a dark smirk kushina made a clone and had it lead kurama into the basement.<br>\r\n<br>\r\n<br>\r\nWhat next?<br>\r\n</span></div></div>",
            "created":1540702800,
            "id":2569915,
            "title":"early (narutos hungry)"
        },
        "11213131312212113":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "fucking machine",
                "horse",
                "suspension"
            ],
            "content":"<div class=\"\"><div> <span>\"so you wanted to kill me bitch,\" said Kushina clone as she lead Kurama into the basement. \"well I don't think so. once we are done with you all you will be able to think about is sucking cock.\" she then opened the door to the basement and was surprised at what Inari-sama had given them. \"how did she know about all this anyway? is she a secret dom or sub<br>\r\n<br>\r\n<b>in the god realm</b><br>\r\nInari could only moan into her gag as Susanoo pounded into her asshole while she was tied spread eagle onto her bed. she let out a small sneeze and thought, \"Minato kun must enjoy his new basement I left some of my favorite toys in there after all.<br>\r\n<br>\r\n<b>back in the mortal plane</b> <br>\r\n\"oh well,\" said Kushina figuring she might never know the answer. \"so what should we use on you?\" she looked around the room trying to pick the perfect breaking toy. she saw a mechanical fucking machine with different size dildo attachments, a standard horse, and a series of pulleys clearly to be used with suspension. <br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat does she use?</span></div></div>",
            "created":1573776900,
            "id":2746854,
            "title":"follow kurama"
        },
        "112131313122121131":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "an hour",
                "four hours",
                "not till minato came home ten hours later"
            ],
            "content":"<div class=\"\"><div> <span>with a dark chuckle Kushina lifted Kurama with her chains and set her on a small table. she used her chains to keep Kurama  in place as she strapped her down onto the table. after making sure the straps were secure Kushina released her chains and looked at the variety of dildo options. <br>\r\n<br>\r\nafter a quick debate she grabbed the largest one over a foot and a half in size. \"now this is a good bitch breaker,\" Kushina said. she put the attachment onto the machine and turned in on at a medium speed. she let out a good laugh as kurama moaned into her gag the machine pushed the dildo all the way into her. \"Now be a good girl as I look around and see what else we have to play with. <br>\r\n<br>\r\n<br>\r\n<br>\r\nHow long does Kushina leave Kurama on the machine?</span></div></div>",
            "created":1580761920,
            "id":2782104,
            "title":"fucking machine"
        },
        "15":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "Might Guy",
                "Asuma",
                "Konohomaru",
                "Shikamaru",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well then who else could it be</span></div></span></div>",
            "created":1526274000,
            "id":2492970,
            "title":"some one else"
        },
        "155":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "Hagoromo otsutsuki",
                "hamura ostutsuki",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>well how about the sage of six paths or his brother</span></div></span></div>",
            "created":1526274000,
            "id":2493067,
            "title":"Who else"
        },
        "1553":{
            "author_id":"redfox1818",
            "author_name":"RedFox",
            "choices":[
                "Fugaku",
                "Itachi",
                "someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fugaku or Itachi</span></div></span></div>",
            "created":1536728400,
            "id":2546678,
            "title":"someone else"
        },
        "15533":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "tails 1-5",
                "tails 6-9",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about having one of the bijuus form a harem?</span></div></span></div>",
            "created":1542517200,
            "id":2579406,
            "title":"bijuu"
        },
        "155332":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yep",
                "one of the other bijuu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>it time for kurama the kyuubi to get his own harem?</span></div></span></div>",
            "created":1542517200,
            "id":2579407,
            "title":"kurama"
        },
        "1553321":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "never sealed ",
                "convinced naruto to release him",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so how is he going to pull this off if he was sealed in naruto?</span></div></span></div>",
            "created":1542517200,
            "id":2579408,
            "title":"yep"
        },
        "15533213":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "naruko first slave",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe a female naruto \"naruko\" was his first slave? </span></div></span></div>",
            "created":1542517200,
            "id":2579409,
            "title":"naruko"
        },
        "155332131":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "pre cannon",
                "during training trip",
                "after the war"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>when did this happened</span></div></span></div>",
            "created":1542592500,
            "id":2579410,
            "title":"naruko first slave"
        },
        "1553321312":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "deal",
                "trick",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does he make a deal with naruko or does he trick her?</span></div></span></div>",
            "created":1543768020,
            "id":2584763,
            "title":"during training trip"
        },
        "15533213121":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "you have a deal. ",
                "lets discuss the details",
                "Hell NO!"
            ],
            "content":"<div class=\"\"><div> <span>Kurama was growing bored and annoyed watching his container try to harness its power. he hated feeling helpless to stop her from taking the power. he preferred to have the power over others not to e the powerless one. now after 100 years of being powerless he finally decided it was time to change that. even if he had to make a deal with its container. making up its mind during the night he called Naruko into her mind while taking on a human form. <br>\r\n<br>\r\n<br>\r\nhis human form would have him mistaken for an Uzumaki with his red hair. he had slitted red eyes and fanged teeth when he smiles. he wore a basic t shirt with pants. he had to laugh when his container saw his human form for the first time. her jaw had fallen to the floor and was currently frozen in place. \"Hello ningen,\" said kurama. <br>\r\n<br>\r\n<br>\r\n\"Kyuubi,\" asked Naruko in shock. <br>\r\n<br>\r\n<br>\r\n\"no im the easter bunny,\" he answered in sarcasm. <br>\r\n<br>\r\nshaking her head naruko said, \"sorry no one told me you could take human form,\" she said. <br>\r\n<br>\r\n<br>\r\n\"thats because i never showed this ability off in the past,\" he answered. \"never mind that im here to offer you a deal.\" <br>\r\n<br>\r\n\"a deal,\" asked naruko suspicously. \"what kind of deal?\" <br>\r\n<br>\r\n\"i help you learn to control my power and aid you in battle in exhange for at night while you sleep you entertain me,\" he said with a smirk. <br>\r\n<br>\r\n<br>\r\n\"wha kind of entertainment,\" asked naruko with a look. <br>\r\n<br>\r\n\"why sex of course,\" he answered smiling at her crimson face. \"i may not have shown off this power but i did use it in the past to get a fair shair of pussy.\" <br>\r\n<br>\r\n\"what,\" naruko said in shock. \"you want me to sleep with you everynight in my head.\" <br>\r\n<br>\r\n\"now where would the harm be in that since its in your head you cant get pregnaunt and you will get better control of my power. given my expereince i can guarantee you a good time so its a win win for you. their is just one small detail you need to agree to.\" <br>\r\n<br>\r\n\"what is that,\" naruko asked. <br>\r\n<br>\r\n\"im the dominant in the bed room for the last 100 years i have been forced into a submisive roll and i would perfer to be in charge again,\" he said.<br>\r\n<br>\r\n\"wait last 100 years how have you been sealed that long you only been in me for sixteen years,\" she said. <br>\r\n<br>\r\n\"you are not my first container in fact your mother was my second container,\" he answered. <br>\r\n<br>\r\n\"my mother who is that,\" she asked with hope. <br>\r\n<br>\r\n\"hm lets make the pot a little sweater. if you agree to the deal ill give you what i mentioned earlier and answer all of your questions you were always denied in the past. but in exchange you have to agree with the above and when i ask make a shadow clone for me to occupy so i can walk amongst the humans again,\" Kurama said. <br>\r\n<br>\r\n<br>\r\n\"how does naruko respond?<br>\r\n</span></div></div>",
            "created":1544394540,
            "id":2587629,
            "title":"deal"
        },
        "155332131212":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "yes",
                "maybe just give me some time",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>\"no offense but I want to read all the details in writing,\" Said naruko. \"kitsunes are known for being tricksters.\" <br>\r\n<br>\r\n\"oh kit I figured you would say something like that,\" said kurama. e puled out a scroll from his pocket and tossed it to her. <br>\r\n<br>\r\nCatching the scroll naruko un rolled it and saw it was a contract for what tey were discussing. she looked oer it for alf an our before she reached the end and saw a place to sign her name. \"who is kurama,\" she asked. <br>\r\n<br>\r\n\"its my name,\" said Kurama. \"what did you think my name was kyuubi. that is just a tittle.\" <br>\r\n<br>\r\n\"okay thanks kurama,\" she said as she looked over the scroll. \"what is this proof of ownership in bedroom,\" she asked. and why is there a safe word kurama is the greatest? why would we need a safe word?<br>\r\n<br>\r\nSmirking kurama held up a collar with a fox tag on it. \"when in the bedroom you would wear this and follow all my orders.\"<br>\r\n naruko could not help but look at the collar and rub her neck at the idea of wearing it. \"as for the safe word if you want we could change it. as for why its needed im a big fan of BDSM and it is required for all practices to let the partner get used to the acts. <br>\r\n<br>\r\nBlushing up a storm naruko said, \"thanks for the consideration. if i give you a clone to control what would you do with it? and how could i be certian you wont ruin me while looking like me?\"<br>\r\n<br>\r\n\"ah excelent questions. i will answer the second one first. i would change the image to look more likee i do know just with out the tails or fox ears. as for what i would do i would mainly enjoy being free at first and maybe catch up on what i have missed. in the end you hae my word i wont commit any crimes or use your appearance,\" answered Kurama. <br>\r\n<br>\r\nnaruko still looked hesitant as she re read the contract for any details she may have missed. she asked a few questions to clarify details but eventually kurama grew bored. \"so do we have a deal or not,\" kurama asked. <br>\r\n<br>\r\nHow does she answer?<br>\r\n</span></div></div>",
            "created":1545457560,
            "id":2591790,
            "title":"lets discuss the details"
        },
        "1553321312121":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "that is when the fun begins",
                "those are for later nights for now ill be gentle",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>with a small gulp Naruko said, \"Okay kurama I agree to the deal.\" <br>\r\n<br>\r\n\"excellent just sign the bottom of the contract. I know you are not a fan of the safe word so do you have a different idea,\" asked kurama. <br>\r\n<br>\r\n\"yeah I was thinking kitsune,\" said naruko as she signed the bottom of the contract. <br>\r\n<br>\r\n\"excellent idea,\" said kurama. he then took the contract and looked over it before he closed it up and placed it on a pedestal in the room. \"know lets get started.\" kurama made his way to naruko before he leaned down and gave her a kiss on the lips. <br>\r\n<br>\r\n\"wait you want to get started on that right away,\" asked Naruko in shock. <br>\r\n<br>\r\n\"of course I have spent the last 100 years not ale to get any and I am extremely horny right now,\" Kurama said as he grabbed her hand and dragged her to his conjured bedroom. \"best to get the first ime out of the way now so you dont hesitate in the future anyway.\" he said as they made there way into the bedroom<br>\r\n<br>\r\n<br>\r\n\"yeah sure i guess,\" said naruko as she looked at the king sized bed in  the middle of the room. looking around she saw a bunch of other equipment as well. \"what is this all for?\" <br>\r\n<br>\r\n<br>\r\nHow does he answer her<br>\r\n</span></div></div>",
            "created":1546314840,
            "id":2596938,
            "title":"yes"
        },
        "15533213121212":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "next night",
                "in the morning",
                "training with kurama"
            ],
            "content":"<div class=\"\"><div> <span>\"you will find out another night,\" said Kurama as he handed her the collar. \"for this night ill be gentle.\" <br>\r\n<br>\r\nnaruko looked at the collar with hesitation before she firmed her resolve and grabbed the collar and placed it on her neck. suddenly a leash formed and led to Kurama's hand. he pulled an the leash forcing her closer to him before he planted a kiss on her lips. while he was kissing her he reached down and removed her jacket and started to grope her breast. naruko could not help but let out a small moan as he did so. he lifted her up and placed her on the bed. as he did so he worked her pants free exposing her panties. <br>\r\n<br>\r\n\"now lets get the last of this fabric out of the way,\" said kurama as he used his claws to cut her shirt open. he had also cut her bra as well revealing her d cup breast. kurama then started to suck on one of her breast while he groped the other. Kurama then used his other hand to start playing with naruko pussy. he could not keep the smile as he heard naruko start to moan from his actions. he made sure to stop just short of her reaching orgasm though. <br>\r\n<br>\r\n\"no don't stop I'm so close,\" said naruko as she started to pant. <br>\r\n<br>\r\n\"so close to what,\" asked kurama with a smirk. <br>\r\n<br>\r\n\"please I need a release,\" Naruko begged<br>\r\n<br>\r\n\"is that so then what would you like me to do than,\" asked kurama as he started to play with her breast again. <br>\r\n<br>\r\n\"please fuck me master kurama please stick tat wonderful dick in me and give me release,\" begged naruko. <br>\r\n<br>\r\n\"I'll give in to your request this time,\" said kurama as he got over her and showed her his eleven inch cock for the first time. he then slowly entered her body. \"are you ready I'm going to go all the way now.\" <br>\r\n<br>\r\n\"yes I'm ready,\" said naruko. with consent given kurama fully entered naruko soaking pussy. he then started to pound into her while he sucked on one of her breast. he continued to due this till naruko reached orgasm. she had came twice by the time kurama was ready to release his load into her. \"get ready I'm about to cum.\"  as soon as he finished talking he cummed into her. this  caused her to reach her third orgasm. the two continued till naruko passed out in her own head. <br>\r\n<br>\r\n\"hope you liked it because the real fun starts tomorrow night,\" said kurama as he used the proximity to influence Naruko's mind. he was making her more submissive to him and less trusting of others. he had to go slowly with this manipulation or else she or someone else could find it suspicious. <br>\r\n<br>\r\nwhat next?</span></div></div>",
            "created":1546316580,
            "id":2596954,
            "title":"those are for later nights for now ill be gentle"
        },
        "155332131212123":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "week",
                "two weeks",
                "one month"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how long has it been since the deal was made?</span></div></span></div>",
            "created":1550125140,
            "id":2617467,
            "title":"training with kurama"
        },
        "1553321312121231":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "wind (like cannon)",
                "one of the other four",
                "kekkei genkai"
            ],
            "content":"<div class=\"\"><div> <span>naruko was doing a little heavy breathing after the workout she had just received. \"I hate to say it but you are a much better teacher than the pervy sage,\" she said in her head to kurama<br>\r\n<br>\r\n<br>\r\n\"of course I am he is convinced that all you need I my power to win a fight and wants you to tap into it. I on the other hand want you to grow strong under your own power. now that we've got your chakra control to a better level lets work on your ninjutsu skills. luckily with my connection to your chakra network I know what your element is. <br>\r\n<br>\r\n<br>\r\n\"really which is it,\" asked naruko. kurama stayed silent for a moment before she let out a huff and said, \"which is it master?\" <br>\r\n<br>\r\n<br>\r\n\"il have to punish you tonight for forgeting that. its,____________,\" said kurama. <br>\r\n</span></div></div>",
            "created":1553018280,
            "id":2632297,
            "title":"week"
        },
        "15533213121212311":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "just wind",
                "adamantine sealing chains",
                "someother ability"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it just wind or does she have something else?</span></div></span></div>",
            "created":1565910420,
            "id":2703011,
            "title":"wind (like cannon)"
        },
        "1553321313":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "he traps her",
                "she does not come ",
                "Different story line"
            ],
            "content":"<div class=\"\"><div> <span>Kurama could not help but feel frustrated. he had been sealed in Uzumaki's for about hundred years. he may have an improved relationship with his container naruko but that does not help his main problem. it had been over a hundred years since he has had sex and he desperately wanted to release his  frustrations.<br>\r\n<br>\r\nas he thought about his frustrations he transformed into his human form. he stood at six feet tall with shouldr legnth red hair. he gave him self anbu pants and an open t shirt to show off his abbs. he admired his human form in the reflection of the water thinking about his former harem that has no doubt passed on from the last time he saw them. <br>\r\n<br>\r\nas he was thinking about the past an idea occured to him. he had spent his time in the uzumaki's learning about fuinjutsu and all of its uses. he quickly starts to write seals in his little area of Naruko's mind to keep her from escaping and fighting him. when everything was in place he called her into her mindscape.<br>\r\n<br>\r\n<br>\r\nwhat happens?</span></div></div>",
            "created":1542593520,
            "id":2579417,
            "title":"after the war"
        },
        "155332132":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "anime world",
                "non anime world",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you sure about this Kurama,\" asked Naruto. his once blond hair had turned white and wrinkles were forming on his face.  <br>\r\n<br>\r\n\"yeah I am kit,\" said the giant fox. \"I am proud of you for completing the old mans dream but I can tell change is in the air and me and my siblings would prefer to not see the old mans dream collapse after they have been accomplished.\" <br>\r\n<br>\r\n\"you know we know nothing about the world you are being sent into for all we know it could be a wasteland,\" said naruto as he looked at one of his greatest creations. the interdimensional seal. with this seal it would be possible for a person to travel to a new dimension. the problem was that it took sanbi level chakra to activate and the dimension was different every time. they found that out by the clones he had sent through finding a different world every time. so far they had found a world that's mostly water in the golden age of pirates (One piece), a world with rainbow colored flames (katekyo hitman Reborn), and a world mostly dominated by machines (terminator). <br>\r\n<br>\r\n<br>\r\n\"did you forget who we are,\" said kurama \"we are the bijuu we can handle whatever the new world throws at us,\" said kurama getting agreements from his siblings. <br>\r\n<br>\r\n<br>\r\n\"okay then,\" said naruto. \"good luck old friend.\" <br>\r\n<br>\r\n\"thank you for everything naruto,\" said kurama as he activated the seal. with the door opened kurama and his siblings left the world never to be seen again. <br>\r\n<br>\r\n\"what world do they wind up in?</span></div></div>",
            "created":1544395320,
            "id":2587636,
            "title":"sent to another dimmension"
        },
        "1553321321":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "one piece",
                "katekyo hitman reborn",
                "somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what world do they wind up in?</span></div></span></div>",
            "created":1544395440,
            "id":2587638,
            "title":"anime world"
        },
        "15533213213":{
            "author_id":"dragonlord99",
            "author_name":"Dragonlord99",
            "choices":[
                "dragonball",
                "highschool dxd",
                "somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about the dragonball world or high school dxd?</span></div></span></div>",
            "created":1544395560,
            "id":2587640,
            "title":"somewhere else"
        }
    },
    "info":{
        "author_id":"dragonlord99",
        "author_name":"Dragonlord99",
        "brief_description":"Time for other males in the Narutoverse to gain their own harems.",
        "created":1526278860,
        "description":"<td align=\"left\" class=\"norm\">There are a few stories where Naruto gets a harem or turns the females into his slaves. Well what about the other male characters of Naruto. It is now their turn to form a harem of their own. <br>\r\n<br>\r\nRules:<br>\r\nNO Yaoi <br>\r\nYuri is allowed<br>\r\ncharacters must be 18 + in the stories<br>\r\nintercourse allowed <br>\r\nbdsm allowed<br>\r\nGender bending is allowed <br>\r\nNaruto is not the master of the harem he has his own stories for that (Naruko being a part of the harem is allowed though)<br>\r\nsingle pairings are allowed <br>\r\nno Vore<br>\r\nunless ending a story line always leave at least two options <br>\r\nhave fun<br>\r\n</td>",
        "id":2158022,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1580761920,
        "modified":1580761920,
        "pretty_title":"Ninja Harem"
    }
}