{
    "chapters":{
        "1":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Leon, The male rider",
                "Alia, The female rider",
                "Shade, Leon's partner",
                "Rune, Alia's partner"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we begin this story, who are you?</span></div></span></div>",
            "created":1203829200,
            "id":502440,
            "title":"Getting started"
        },
        "11":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Head to the stables",
                "Get some more food",
                "Listen to what the others are saying"
            ],
            "content":"<div class=\"\"><div> <span>A rider about 6 foot 2 slowly walked down the stone steps, his messy wild but short brown hair, draping over his eyes. Getting up after a long night of nothing but horrified toucher of his roommates wasn't great to start a day off, much less having having them drunk off their ass and banging pots and pans cause they wanted to start a band. It kept him up half the night. Not to mention getting drunk himself, forcing to chugging down a gallon of nothing but wine and beer. <br>\r\n<br>\r\nHis head pounded threw the morning and it didnt help when he entered the dinner hall and hearing the roar of people talking all at once eating there breakfast and chatting about stuff. He sighed sitting at a table with his friends but he started to get caught up in his own world cause he knew, after breakfast they get to go down and care for there life long dragon partners.<br>\r\n<br>\r\nIn this world it was eat or be eaten and humans have become a deliciouses morsel among the creatures eaten in the world. in attempt from humans being whipped out, dragons had made a pack but on one condition. They become there riders and they chose who there rider will be. <br>\r\n<br>\r\nWhen a child hits about 8 to 10 years of age they go in to 3 years of training to build there character and have the strength to defender their partner if it comes down to it. After 3 years, the ones who trained to the fullest gather within an active volcano,deep in to a cave were newly hatched hatchling wait for there rider.<br>\r\n<br>\r\nLeon sighed daydreaming like it was yesterday. 5 years ago it was his third attempt to get a dragon, the first two was a dud cause none of the dragoons chose him as his own. but that year was going to be a night to remember. He was standing on the hot sands of the Hatching Ground, not even thinking or hoping for a silver dragonet to waddled up to him and decide to have him as a rider. Stopping a mere foot away, a small little silver scale dragon stared awkwardly up at him and emitted a happy coo sound. It stood up cutely on its hind legs, tucking both forepaws onto his chest, The little dragon looking at Leon with sky blue eyes until it lost it's balance. Falling over in the soft sand the hatchling looked deep into his eyes and time seem to slow down for the two. The world he thought and knew turned inside out, flip over and break in to a million pieces.<br>\r\n<br>\r\nHis soul was enveloped in a sense of complete welcome and adoration, a security blanket of emotion that wrapped around him and let him know everything was ok. A velvety voice, cream and honey flowing in a stately golden river, filled his mind and named itself... \"I am Shade, and you, Leon, are mine.\" After a moment of nothing but warmth and friendship, the voice shifted tones. \"I am very hungry. Do you know where I could find some food?\"<br>\r\n<br>\r\nLeon snapped out of his trance and looked at his tray seeing his food is all gone. &lt;Not much of a filling meal&gt; he thought.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1203829200,
            "id":502449,
            "title":"Leon, The male rider"
        },
        "111":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Stick the arm in",
                "Dont, just keep petting",
                "Walk away"
            ],
            "content":"<div class=\"\"><div> <span>Soon enough, Leon was the first to leave the dinner room walking a couple flight of steps he entered the stables were his dragon and a few others slept. It wasnt like a horse stable it was like a huge cavern made with a whole bunch of holes in the wall plus one opening that lead outside to a 300 foot drop. <br>\r\n<br>\r\nThe home of humans and dragons is very often living off a huge cavern, the village and castle on top of the cliffs above and in the cavern and caves is were the dragons flew and lived. Most dragonrider villages are like that because it worked out for both kind, and at an addition the close cluster of dragons all at one point, many creatures of air and land had strayed away cause if you mess with one human you mess with all of the dragons living there.<br>\r\n<br>\r\nLeon yawned, rubbing his head as he climbed on to the second row of caves and walked in to were Shade was sleeping. &lt;it's been a couple years since you chose me Shade...&gt; he thought walking to the dragon and reached out to rub his huge head. By now the dragon was about 65 feet in length it was amazing how fast the dragons grew in there first 4 years.<br>\r\n<br>\r\nSince the day the two have become partners he started to feel sort of strange towards the intensity of Shade's hunger. He had started hand-feeding bits of meat to the hatchling when they first met, marveling at the quantities he ate his food. As his friend grew larger in the months ahead, Leon had begun to experience a weird but good giddiness during when the beast was feasting. <br>\r\n<br>\r\nAt first he had shook the feeling this as a feeling Shade felt when he feeds. none the less the dragon had grown quiet large and the rider started taking every opportunity to watch his lifemate fed until he was full. Observing the massive beast tear off pounds of meat, toss it into the back of his maw and joyfully gulp it down. Leon always felt intoxicated with arousal and passionate longing that he could not understand why. <br>\r\n<br>\r\nLooking at the dragon  and how deep asleep he was maybe he could get a hand and rub around his maw. Get a feel of everything inside, and the feeling of his hand encased by the warm flesh thou careful with the the dragon's teeth. Leon looked at the dragon and feared for what his friend might think if he wakes up.<br>\r\n</span></div></div>",
            "created":1203829200,
            "id":502475,
            "title":"Shading the silver"
        },
        "1111":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Climb in",
                "Pull out",
                "Shade wakes up"
            ],
            "content":"<div class=\"\"><div> <span>Leon looked around and smiled to himself as he went in front of his partner's head and forced his jaws to open, thankfully Shade didn't move or wake from his sleep. Just looking at those teeth the dragon made the boy shudder and start to become excited. <br>\r\n<br>\r\nHe reached over to take a rock that was near by and put it between those shark teeth so he can slip his arm in. He smiled, blushing a little as his hand slowly slipped in, feeling Shade's saliva coat his hand and his smooth tongue wiggling a little when his hand slide across the surface.<br>\r\n<br>\r\nLeon smiled sitting there, feeling his hand around in those huge jaws he started to get caught up in the feel. By now, he began to slide his arm in more, up to the elbow causing the dragon to shift softly and start to drool at the human taste. <br>\r\n<br>\r\nThe boy smiled in content at how peaceful his dragon friend and sort of wounder what the big scaly beast is thinking. Leon leaned in looking at within the cave like jaws seeing the drool drip down on the sides and hot air spreading over his face with Shade's deep breaths. The boy started to get more excited, now he wants to experience first hand on whats it like to crawl in and become helpless prey by the mighty beast before him, still he was uncertain if he should attempt to crawl in. After all, what will Shade say to have his friend in his jaws?</span></div></div>",
            "created":1204002000,
            "id":503170,
            "title":"Getting a feel"
        },
        "11111":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Crawl out Fast!",
                "Give in"
            ],
            "content":"<div class=\"\"><div> <span>He looked around the cave before leaning in and started to shack and rubbed hsi arm around to see if Shade will wake. The silver dragon growls as he shakes his head growling softly, looking away in spit of the rubs. He snorted but didn't seem to notice his mouth open the rock or even the feel of those tasty flesh, guess he thought it was a after taste from a meal he had last night. None the less the dragon was sound asleep.<br>\r\n<br>\r\nLeon looked at him and chuckled, laughing as he leaned in and hugged his snout before pulling away and started to strip off his cloths as he didn't want them to get them wet and slimy, the last time they were wet was when they had to catch a frog for the princess in the swamps and he fell in to the water getting his cloths and armor wet, they had to be washed for 4 days cause of all the grim and slime on it. <br>\r\n<br>\r\nThe rider smirked as he soon stood in the nude before his partner, blushing as he looked at those massive jaws. He then looked around making sure no one say him like this, the last thing he need is for someone to ruin his life. Before he stuffed those lean arms in, he took the effort to  stuff those cloths behind his dragon just in case. <br>\r\n<br>\r\nThe damp warmth and followed by his head that slipped past those sharp teeth. the rider blushed as he pushed himself in slowly making sure not to wake Shade. He groaned as it got a bit tighter the more he went in those jaws squishing his head down and arms. he blinked and blushed feeling his hands touch the opening to the throat that was closed. he blushed as he pushed against the wall of the cave then the bottom for help. \"a little more...\" he whispered. as those jaws scraped against his skin in some places, causing discomfort for him. <br>\r\n<br>\r\nLeon finally pushed his feet past those jaws accidentally kicking the rock out from between the teeth and made the jaws close down on him. He looked back as the teeth became a cage as the last of light that poured in the cave showing threw the teeth were now closed, sealing him in. Now he was helpless, under the power of the dragon as it slept. The rider groaned becoming hard from the erotic feeling groaning as it felt so good but his mind screamed as being in there was a very bad thing, still Leon ignored it and just closed his eyes and enjoyed the feeling of being in there.<br>\r\n<br>\r\nIt wasn't long till the bottom floor started to move and shift under him slowly pushing the 'meat' forward. Leon gasped and wiggled around, feeling himself slowly sink in towards the throat that opened. \"Oh god... he's ... going to eat me.....\" he whispered to himself trying to stop but the feeling was too good to pass up. squeezing down the tight throat.</span></div></div>",
            "created":1204347600,
            "id":504424,
            "title":"In he goes"
        },
        "111112":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Leon goes in all the way",
                "Leon stops just before the stomach"
            ],
            "content":"<div class=\"\"><div> <span>With a shock and quick gasp of breath, Leon blushed deeply looking at those jaws that had sealed his faith if he doesn't break free. He shifted around and groaned as he tried to escape but he couldnt as from the tightness around his body. Leon trembled with the sensation of arousal wash over his body. Soon he just gave up and just welcome the tight embreace of his partner's inside. <br>\r\n<br>\r\nShade growled softly as he lapped his tongue around the live and wiggling meat in his jaws making him think it was some pour fish he had caught in his dreams. The large dragon started to drool on the ground tasting the 'fish' over and over. he flexed his claws on the cave ground, digging them into the dirt, shifting his body as he felt a pleasurable feeling enter his mind, amazingly the great dragon remained asleep.<br>\r\n<br>\r\nBack inside the jaws, Leon groaned as he was slowly eased alone the insides of the fleshy and rippling walls. pinned tightly in the muzzle of the dragon, he felt the predator approve of the when the tongue licked over his body more roughly. His heart pounded against his chest making him breathless at the experience. It was beyond anything he ever felt in his life.<br>\r\n<br>\r\nKnowing his ride was gonna end soon as how close his head was to entering the tight throat he reached his arms backwards and started to rub the sides of the wiggling tongue, he often wounder what he must taste like to the big silver dragon. Mere seconds later, Leon felt a sharp forward motion as the prison enveloping him tightly and pushed him in to the rippling throat. This was insane and other wise crazy, he knew exactly what the dragon was doing, his mind screamed to escape the danger and it was  even heart stopping to do this while his friend is asleep, but he couldn't bare himself to care the slightest.<br>\r\n<br>\r\nThe great silver dragon ruthlessly clawed at the ground as he got a taste full of the salty prey wiggling in his mouth, a lazy but quick toss of his head, he gulped hard, jamming the unfortunate 'fish' deep into his throat, beyond the point of escape.<br>\r\n<br>\r\nThe wet, hot and fleshy cage violently squeezed Leon all around his smooth human body with a few scrapped skin here and there. Squeezed painfully against the slick palate ridges above the poor boy, had partially knocked the wind right out of him. Still, the persistent boy didn't want to end. <br>\r\n<br>\r\nPropelled forward in to the throat of his partner was worth having huge tongue, sending him back, deep into the maw of the dragon. He was then squeezed rapidly down the throat of the beast. The top ridges of the maw digging into his back and legs, the elastic surface pressed him in to a heap, moving past the pharynx of the animal. The walls of the chamber gripped him with a welcoming slimy embrace, tugging and pulling him downward the fleshy tube relentlessly downward.  <br>\r\n<br>\r\nShade sighed as he repeatedly gulped down his slightly oversized chunk of living meat and bone. The rider slid down his throat, forming a slight but visible bulge on the outside of his scaly hide. He let the feeling of the salty food as it was pulled deeper inside him. The lump passed beyond view of his long neck and slowly disappear into his chest.</span></div></div>",
            "created":1204434000,
            "id":504741,
            "title":"No turning back"
        },
        "1111121":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Sit back and enjoy it",
                "Yell and scream to wake Shade"
            ],
            "content":"<div class=\"\"><div> <span>Gravity helped the rider pass threw the tight throat of the sleeping beast the peristaltic pulled him down in to the darkness. He felt himself being squeezed through a tight opening into what he now know must be the dragon's stomach. Shoved through  with some powerful gulps, he tumbled into a slippery wall that encased all around his body. the jucies within splashed all around his body coating him with the salvia. He gasped at the tightness feeling alla round him, he kicked a bit but thats a bout it as he was already in a comfortable postion. all of this was so mind numbing.<br>\r\n<br>\r\nThe arrival of food in the beast's stomach made Shade shift around, rolling on his back, sighing in pleasure, rubbing over the budge within his sleep. He had finished off what ever prey he had chased in his dreams and now he was going to lay back and digest it, like good food. <br>\r\n<br>\r\nFeeling the walls push against his body, he wiggled around trying to make it stop as it made him sank in the flesh at the bottom, causing some of the juices to tingle his body. The walls seemed to expand outward to whatever size of a meal that it can hold up too. With little freash air to work with, there was a foul stench that had somewhat snapped leon awake from his trance of pleasure. He felt the slick, muscler flesh around him begin to exude a thick, sticky slime that he suspected would send him to the gods or even bond with his friend forever. All of this was in the name of hunger and pleasure for them both even if Shade doesnt know it.<br>\r\n<br>\r\nGagging a bit on the acrid air that stung his lungs and throat, he realized that if it wasnt for lady luck he would have been gulped down as fuel and not food! ending up in to the fire breathing belly instead. Thinking about the horror thought, Leon laied back in the stomach looking at the darkness ridding of one thing then started with another, such as escaping the belly before he's dragon mush, maybe he should wake up his friend now and get out or he could spend a few more minutes inside it was kind of nice.</span></div></div>",
            "created":1207112400,
            "id":515712,
            "title":"Trapped within"
        },
        "11111211":{
            "author_id":"dannyv",
            "author_name":"DannyV",
            "choices":[
                "Leon pleasure keeps him in",
                "He finally comes to his senses and shouts for Shade"
            ],
            "content":"<div class=\"\"><div> <span>Leon stayed there, the liquids secreting into the stomach slowly filling it it, he knew he should be tring to wake up Shade, but it felt so nice and warm....<br>\r\nThe digestive acids had was making his left side tingle and feel numb, and Leon loved it</span></div></div>",
            "created":1207630800,
            "id":517520,
            "title":"Sit back and enjoy it"
        },
        "111112111":{
            "author_id":"dannyv",
            "author_name":"DannyV",
            "content":"<div class=\"\"><div> <span>Leon can't hold his pleasure as the warm soupy liquid rises up his body, spreading the numbing, tingling feeling up his exposed flesh, before eventually reaching his peak, releasing his load into the acids which bubbled as the white goo was quickly digested<br>\r\n<br>\r\nAs the acids reached his penis he once again hardened in an instant from the wonderous pleasure before it fell numb and quickly softened again, he looked down and saw his left arm and leg were slowly becomeing mush and that the acids were now up to his chin<br>\r\n<br>\r\nHe kept his face as high as possible but eventually it covered even his face and into his lungs, in absolute pleasure his mind began to fade into darkness and he quietly wispered \"I'm sorry Shade\" before dropping into a deep and final sleep</span></div></div>",
            "created":1207630800,
            "id":517522,
            "title":"Leon pleasure keeps him in"
        },
        "111112112":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "2 + 2 = Partner?!",
                "The squirming is just a fish"
            ],
            "content":"<div class=\"\"><div> <span>Leon groaned stroking his harden member before he winced when the acids started to sting him. \"mmm... I .. I cant do this...\" he muttered as he stopped his masturbation for now, and started to wiggle around even more. Kicking and pushing the walls, feeling a little groggy himself. \"ugh... come on Shade, wake up... please\" He muttered wiggling more in the roomie yet cramped belly a few more times, before he stopped for a second when he felt his world starting to move. \"Shade!!\" he called, happy that his partner had woken up.<br>\r\n<br>\r\nOutside Leon moaned and yawned as he slowly rolled on to his side, stretching out in his cave. \"Mm.. what a wonderful dream\" the dragon said feeling his belly. \"that was the biggest and most tasty fish I ever had\" He muttered but felt wiggling in his stomach. \"Oh!\" he sat up suddenly and looked at his gut. \"... Wow... Leon must have gotten me a fish! and a very squirmy one too\" he said poking his slight budged gut a couple times, then smiled proudly. \"I guess I have to find him and thank him\" he murred messaging his gut. <br>\r\n<br>\r\nInside Leon was utterly shocked and scared. \"No Shade! I'm in here! you have to get me out!\" he yelled but it was no good, his flesh and scales were making his voice muffled or silent. \"I .. I cant let it end this way!!\" he screamed kicking and wiggling even more.<br>\r\n<br>\r\nShade merfed and smiled in pleasure. \"oohh.. it squirms so good\" he said licking his lips. The silver dragon got up lazily and walked out of his cave room. He started to walk around the caves trying to sniff out his owner but didn't catch his scent anywhere. \"Where is that boy...\" he gruffed in slight annoyance.</span></div></div>",
            "created":1216270800,
            "id":556905,
            "title":"Too native for his own good"
        },
        "1111121121":{
            "choices":[
                "Digest him",
                "Cough him up"
            ],
            "content":"<div class=\"\"><div> <span>Shade's train of thought twitched for a moment as he made a connection. Leon's absence and his mysterious meal... could they be connected. He returned to his cave and his heart skipped a beat. He edged into his cave and sniffed at the small pile of clothes that had been behind him.<br>\r\n\"These are Leon's\" muttered Shade to himself \"he never removes these... humans don't walk around nude. But that means...\"<br>\r\nHe looked down at his stomach in horror and was lost for words. Leon had to be in there, even large fish didn't squirm this much.<br>\r\n\"What have i done\" he exclaimed \"how did this happen?\"<br>\r\nHe looked over his shoulder sharply, nobody was around. He knew he'd be in trouble if this was found out, he wasn't supposed to eat humans. He had to let Leon out though. He clenched his stomach, trying to force Leon up.<br>\r\nA sudden calm came over him though, he could always leave Leon in. Nobody would accuse him of Leon's disappearance, humans went missing all the time. Besides, Leon did feel good in there... he felt very good in fact.<br>\r\n\"What to do...\" muttered Shade \"I do like him but... oh what do i do...\"</span></div></div>",
            "created":1275829500,
            "id":895295,
            "title":"2 + 2 = Partner?!"
        },
        "11111211212":{
            "author_id":"nobodyx",
            "author_name":"The Languid Lizard",
            "choices":[
                "Shoved his fist down Shade's throat \"Really dissapointed brother.\"",
                "Pulled out a vial. \"Take this, he'll be out in a day or so... scratch free.\""
            ],
            "content":"<div class=\"\"><div> <span>Shaking his head, Shade got up immediately, beginning his decent into more caves. The deeper he went, the darker they became and he knew he'd be getting close to his brother. Shade whined a bit, feeling his friend now struggle even harder inside him. Shade paused, putting a hand to his stomach. <br>\r\nSecond thoughts began to enter his mind, he could already imagine how long he'd be full.<br>\r\n\"Trouble Shade?\" The deep voice woke the dragon from his trance, his eyes locked into another pair. Darkness, Shade's brother lay there, the more larger drake sitting calm and comfortable. \"D-Darkness.. I've done something... something terrible, but it wasn't my fault.\" Shade held his head in shame, his head shaking nervously. A small burp escaped his maw and Darkness noticed a familiar tinge to it.<br>\r\nDarkness stood up and gently walked over to Shade, the silver drake grunting and whimpering nervously. <br>\r\nWith two small sniffs, Darkness knew the scent right away.<br>\r\n\"Shade... you... how long has he been in there?\" Shade jumped in fright.<br>\r\n\"I swear it wasn't my fault, I-I, he- my mouth was- and then- his clothes...\" Shade rambled endlessly, Darkness calm as ever. \"The worst part is.. I kinda like it.\"<br>\r\nDarkness stared at him. \"He's been in there since morning... he's-\"<br>\r\n\"His struggles feel good don't they?\" Shade gasped, staring at darkness before the darker, larger dragon suddenly-</span></div></div>",
            "created":1414833360,
            "id":1880044,
            "title":"Getting Help"
        },
        "11111212":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                ".... I should let him out\"",
                ".... a little longer\""
            ],
            "content":"<div class=\"\"><div> <span>Leon sighed softly looking around the bed rubbing his member slowly as it did feel rather nice to be in here but fear started to set in and he looked all around him a little worried. Now the belly started to move and jolt awake now. The walls moving about and the acids starting to make his sink tingle. \"Ugh ... I .. I need to get out of here\" he muttered pushing around the walls pushing out and kicking about. \"ugh .. Please wake up Shade\" he said. <br>\r\n<br>\r\nOutside the dragon groaned and murred rolling on his side, scratching his belly, enjoying the wiggling and muffled voice in his stomach that gurgled with the food. Yet something was amassed. He slowly opens his eyes, waking up from a dream about a fish he had scarfed down. At first he thought it was a dream until there was squirming movements caught his attention. \"wha-what?\" he said sitting up and looked at his gut. \"... did I eat a fish?\" he said licking his mouth and lips. \"no no a fish dosn't taste like this.... but it seems fami-- Leon?!\" he yelled in shock. <br>\r\n<br>\r\nInside Leon kicked and wiggled, he yelped when the stomach moved and he was now farther then the opening from which he came in. \"Agh! Shade! Help!\" he yelled louder then ever struggling to get out. He blushed as it was rather nice, being squished around by that powerful stomach but being digested wasnt his dish of fantasies. He pushed out on the walls feeling the walls squeeze him around more, coating his body in more saliva and acids.<br>\r\n<br>\r\nShade gulped softly looking at his got. \"Oh god... my partnar in my got... what should I do? ma-maybe he wont mind if I keep him in more.. maybe take one of my potions to heal him...\" he said looking around the cave then back at his gut, reaching a claw down and started to rub his belly. \"mmm...\" he said licking his lips. \"Maybe....</span></div></div>",
            "created":1216270800,
            "id":556769,
            "title":"It's time to wake up now Shade"
        },
        "111112122":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Keep Leon in longer",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You should stay longer\" he said plain and simple and smiled licking his lips going on his four legs. \"hee... you feel rather nice in me\" he said wiggling his belly. Inside Leon feared that answer and wiggle around. \"Sh-Shade! please let me out, ah!\" he yelled when Shade wiggled his belly making him jiggle around. \"well.. take something that stops your acids!\" he called. \"Awww but I wanted to eat something while your in there\" he said reaching a hand over and rubbed his belly. \"mm... just stay there a little longer\" he cooed before he let out a massive belch. He sighed, feeling his stomach squeeze on Leon, making his human partner squirm even harder. <br>\r\n<br>\r\n\"oohhh...\" the dragon couldn't help but flop over on his side and rubbed his belly some more. hearing the belch and the air become thin Leon started to panic and fight some more. \"Shade!!\" he cried out. Finally the dragon rolled back on his paws gulping fresh air down to him. \"alright alright ...... after breakfast\" he grinned proudly. The human grumbles wiggling around before he stopped and just sat away from the acids the best her could. <br>\r\n<br>\r\n\"This is punishment isnt it....\" he grumbles as he just have to sit back and accept this from his friend. \"well yeah ... I mean it seems you had gone willingly anyway, I might as well enjoy you till I get you out.... besides.... I always wanted to try you before when I had matured\" he whispered the last part to him, letting a shade of red spread over his dragon cheeks.<br>\r\n<br>\r\nBack inside, Leon blushed as well hearing the silver dragon say it. \"we-well fine!! but just please stop your acids or something it's really burning\" he said as he had been fighting back the pain and Shad walking about had only made the stomach acids a little stronger. Soon enough the dragon had stopped walking it seemed, but no answer came from him anymore. \".... Shade?\" He called rubbing the walls and pushing out. \"Is everything all ri--AGH!!\" he yelled as he was hit by falling chunks of meat.<br>\r\n<br>\r\nOutside, Shade happily scarfed down his breakfast with some other dragons that were awake. But most where half asleep and groggy so they wouldn't know of Shade carrying more then his own share of meat. After he was done, he begun to murr, feeling his partner wiggling around once again from the food packed in, making his stomach budge. The male dragon trotted out of the cave, jumping off the ledge, and bung to fly off to the forest to be alone with his fresh meal.</span></div></div>",
            "created":1216270800,
            "id":556925,
            "title":"A fresh meal"
        },
        "1111121221":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Give in, fall asleep",
                "Keep awake"
            ],
            "content":"<div class=\"\"><div> <span>Shade smiled flying high up in the air looking down at the little animals down before. \"hee... so many things to eat but such little time\" he sighed gliding down to a secret spot in the woods that he and Leon often go to to train or just hang out.<br>\r\n<br>\r\nWithin his gut Leon giggled around inside pushing along the walls of the stomach. Moving the pieces of meat down below, so he would evade the acids for now. \"ugh ... please let me out soon...\" he muttered and yet, he was bare naked, living on a fantasy, and his friend even admitted he wanted to taste his sweet human flesh. When that idea sank back in his mind he started to blush and his member harden at the idea. \"mm... ok maybe a little longer\" he muttered to himself, reaching down and started to strock his member, smiling softly feeling the stomach walls grind him and the meat harder as the acids worked to turn the food in to mush. <br>\r\n<br>\r\nThe silver dragon landed on the ground of the soft grass looking down to hear his gut gurgle louder. \"hmm...\" Leon are you ok in there?\" he called out to nudge his gut softly. His partner called out from within the flesh, moving around \"I'm fine, I'm just enjoying myself now\" he said. the dragon couldn't help but laugh out loud at his silly friend. \"ah that is good, see? if I had spit you up then you wouldn't like to be in there now\" <br>\r\n<br>\r\n\"but I had no choice either way\" called Leon back at the dragon rubbing the walls somewhat. Content and full the dragon flopped down on the grass, rolling on his back just enjoying the feeling of his friend in there. He started to slowly message his belly, working the food, mush, acids, and Leon around in his gut. Moaning as he just wanted to digest everything but couldn't because he didnt want to lose his partner.<br>\r\n<br>\r\nEither way the dragon rolled back over on his side and closed his eyes feeling sleepy but he fought to keep awake...</span></div></div>",
            "created":1216270800,
            "id":556928,
            "title":"The longer the wait, the better it gets"
        },
        "11111212212":{
            "author_id":"valareos",
            "author_name":"Valareos",
            "choices":[
                "Leon locates the Vial",
                "Leon is still looking for the Vial"
            ],
            "content":"<div class=\"\"><div> <span>Shade merrfed as he fought to keep his eyes open.  He poked his stomach, looking for the lump he presumed was Leon. \"Still with me, Leon?\"<br>\r\n<br>\r\nLeon muttered.  \"Yea, still here.. your lucky you stuffed yourself with meat.. you going to let me out?\"<br>\r\n<br>\r\nShade thought on it.  \"Well, if i let you out, ill lose my breakfast as well.. andim feeling so comfortably full..\"<br>\r\n<br>\r\n\"SHADE! you know how much trouble you will get into if this gets out!\"<br>\r\n<br>\r\nShade snerked and rubbed his belly more.  \"Trying to convince me to keep you in?  My poor rider, attacked and eaten by a vile creature in the forest..\"<br>\r\n<br>\r\nLeon squimed inside the belly of the silver, who shivered in delight once more.  \"Come on Shade, thats not what I meant.\"<br>\r\n<br>\r\nShade sighed and turned around to lay on his belly, the actuon sloshing leon around, who scrambled to stay above the acid.  \"Alright, dont panic.. i think i got something here to help.. \" He looked to their private stash, used for training, and picked up a vial, before swallowing it whole.  \"I swallopwed a vial. .find it, drink it... shoudl keep you safe till my breakfast is digested, then ill release you.<br>\r\n<br>\r\nLeons eyes open wide as he hears the vial land nearby, on some of the meat.. but it was dark, and would be treacherous to find it. Leon.. had no choice, he began to look for the Vial.</span></div></div>",
            "created":1232254800,
            "id":635005,
            "title":"Keep awake"
        },
        "111112122121":{
            "author_id":"nobodyx",
            "author_name":"The Languid Lizard",
            "choices":[
                "It was too late, more of his body slowly pulled through.",
                "His leg becomes unstuck."
            ],
            "content":"<div class=\"\"><div> <span>Leon was hesitant at first but he reached a hand down into the mass of meat bellow him, sifting through the red breakfast in search of the vial. \"OUCH!\" Leon's hand came into contact with a small glob of acid, his hand stung and he couldn't help but whimper a bit; this beginning to become dangerous. It was very hard to figure out where the vial was when the large was constantly being rolled around. \"SH-SHADE! Stop massaging your gut, i cant - AHH- find the vial.\" Leon dug another hand in the now mushier meat, the burning sensation growing. The walls around him still shifted a great number of times \"SHADE! STOP IT!\" <br>\r\n<br>\r\n\"Oh alright.\" The stomach let up a bit and you could have sworn you felt the vial just slip out of your fingers. You had to snap your hand back since it was now located in a pocket of acidic goop. \"Leon...*yawn* i think im gonna take a nap...\" On the outside, the large silver dragon rested his head on the ground and began to drift off to sleep, his own malehood seemed to be poking out of his own sheath. \"Just don't get caught.... in the sphincter... *snore*...<br>\r\n<br>\r\n\"Shade?\" Leon heard the loud rumbling of his dragon partner snoring. \"Damn dragon, always sleeping around and eating.\" While this was an almost dream to him, his skin began to itch crazily. \"Alright, i just have to-\" SQUITCH... \"OW OW OW!\" With the vial in hand, and his hand being almost completely covered in acidic goop, he uncapped the vial and chugged the contents. His body seemed to calm down but the burning was still there. \"It's not working!\" He began to panic a bit struggling to get Shades attention. His hand no longer felt numb or tingly,in fact, it felt quite cool, almost as if his entire body dropped temperature. With new found curiosity, Leon dug his hand back down into the goop of the stomach an was relieved to find no pain or stinging feeling. \"Oh thank goodness.\"<br>\r\n<br>\r\nThe boy reclined into the stomach, letting himself get more comfortable each second. The soft gurgling noises were soothing and harmonious. A familiar feeling filled his loins and Leon began to blush a bit. When he found no reason to resist he began to idly stroke his cock. In pure bliss, Leon was distracted enough so that when he finally came, his cock was almost fully submerged in a warm sticky mess. Chunks of meat littered the soup and his body was half submerged in it. The stomach churned a little and contracted squeezing air out of the sack and traveling up into a-<br>\r\n<br>\r\nBRAAAAAAAAP!<br>\r\n<br>\r\n\"Haha, good one.\" Leon chuckled at his engorged friend. This was truly amazing being able to live out a fantasy and fill Shades too, it was a win win situation. It was so good in fact that he would want to try again sometime, maybe with less food next time. The stomach began to tighten again, this time, it began shifting the goop towards a small hole at the bottom. \"WHAT THE!\" Leon could feel his legs constricted by a small ring, then thought of what his friend said earlier. He certainly did not want to take a trip the whole way through. Leon tugged at his leg.</span></div></div>",
            "created":1369013400,
            "id":1593158,
            "title":"Leon locates the Vial"
        },
        "111112122122":{
            "author_id":"warband2",
            "author_name":"dragon",
            "content":"<div class=\"\"><div> <span>leon is still looking for the vial when Shades acids start to digest the food. before long leon relizes that there is no vial and that he is going to be digested inside his own dragon. <br>\r\n<br>\r\n\"shade there isn't any vial.\" leon screams. \"come on let me out before I become your food.\"<br>\r\n<br>\r\n\"but you already are my food\" says shade with a crule laugh.<br>\r\n<br>\r\n\"shade no don't I will do anything just do not digest me.\"<br>\r\n<br>\r\n\"sorry but you willingly became my food so sorry my friend. but jsut so you know you tasted good.\"<br>\r\n<br>\r\nwith that shade goes to sleep. leaving leon to digest in a few hours time shade returns to the base with out leon saying that he was eaten by an monster. no one would ever know he was curently no more than fat on his dragon. </span></div></div>",
            "created":1273640400,
            "id":882290,
            "title":"Leon is still looking for the Vial"
        },
        "11113":{
            "author_id":"billybobny",
            "author_name":"BillyBob",
            "choices":[
                "Tell him the truth",
                "Stick to the story"
            ],
            "content":"<div class=\"\"><div> <span>\"What are you doing?\" Leon heard the voice echo, slightly groggily, from the large beast.<br>\r\n\"Nothing! I was just checking to see if your teeth were okay! You need to be in perfect health to fight, right?\" He came up with the fastest excuse he could.<br>\r\n\"Then why is there a rock inside my mouth?\"<br>\r\n\"Just to keep it open while I examine your back teeth.\" Leon was slowly showing more nervousness by the minute.<br>\r\n\"Leon, is there something you want to tell me?\"</span></div></div>",
            "created":1204088400,
            "id":503713,
            "title":"Shade Gets Suspicious..."
        },
        "111131":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "\"I understand leon...\"",
                "\"What is the matter with you?!\""
            ],
            "content":"<div class=\"\"><div> <span>Looking down, leon staretd to feel guilty that he has to keep secrets from his partner and closest friend. Looking up at the silver dragon, Leon swollowed his pride and took in a deep breath. \"Shade I wanted to tell you this but I was afride of what you thought of me afterwards... well Ive been feeling diffrent....\" he said, his voice trailed off.<br>\r\n<br>\r\nShade blinked. \"well yeah everyone is diffrent, if everyone was the same the world would be wrong and weird\"<br>\r\n<br>\r\nthe rider slaped his face, groaning softly. \"no! thats not what i mean... what i mean to say is that ... well when ever I watch you eat some kind of food... I feel...\" he blushed looking away. \"well, good... and I mean the kind of good when i want to get in bed with a girl to simpily put it.\" he spoke. Shade was a bit taken back by this, cocking his head to the side. \"Leon ... I .....\"<br>\r\n<br>\r\nThe rider backed away a bit looking down in shame. \"Shade please... I know this is weird of me but I really down want to ruin our friendship.\"<br>\r\n<br>\r\nShade sighed deeply looking down flexing his wings a little bit. \"well ...\" he took a deep breath and said....</span></div></div>",
            "created":1207198800,
            "id":515721,
            "title":"The truth?"
        },
        "1111311":{
            "author_id":"warband2",
            "author_name":"dragon",
            "choices":[
                "leon digests",
                "something strange happens to leon"
            ],
            "content":"<div class=\"\"><div> <span>Shade looks at leon with a embarased look. \" I understand leon you see for a while now I have wondered what it would be like to eat you.\" with that Shade looks down at leon with a strange grin. Before leon can even reply shade lifts leon in to the air and tosses him into his mouth. \"I hope you injoy your tip becaue it will be a long one.\" with that shade swallows leon. who quickly ends up in shades stomach. </span></div></div>",
            "created":1272258000,
            "id":873823,
            "title":"leon becomes dragon chow"
        },
        "1112":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "It's Alia",
                "It's a monster",
                "It's another dragon"
            ],
            "content":"<div class=\"\"><div> <span>Looking at those jaws before him just seem so tempting, to try and get inside and feel around in that damp warmth and run his hands over those pearl white teeth of his. He sighed deeply shacking his head considering what Shade might think, if he found his partner acting all strange. He sighed once more and just hugged his head, going back to petting and rubbing his hands over his scales just enjoying the moment. <br>\r\n<br>\r\nHe leaned in close and heard Shade slightly to murr deeply in his sleep, liking the rubbing his life partner gave him. Leon chuckled as he climbed on to his neck and started to give him a neck message that followed downwards to the dragon's lean shoulders and wings, then his back. Finally he had stopped in the middle of Shade's back flipping around so he was mounted on him. Leon started to image him and his dragon flying threw the skies today maybe do some scouting or taking on missions. Probelly save another human from the clutches of ogres or even gryphons.<br>\r\n<br>\r\nThe boy sighed slowly sitting back and stared at the ceiling becoming lost in his world. he didn't noticed a shadow looming in to the cave and stare at Leon with wild eyes.</span></div></div>",
            "created":1204174800,
            "id":504057,
            "title":"Taking in the moment"
        },
        "11122":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Shade wakes up",
                "He's a heavy sleeper"
            ],
            "content":"<div class=\"\"><div> <span>Leon felt something coming but he was busy thinking of other things and besides who would be stupid enought to come in a dragon's cave too. He closed his eyes for a moment before opening them up and came in to a shock to see a snake's head hovering over his own.<br>\r\n<br>\r\nIt was huge first off, about it's head was big enought to size up Leon's and it's body was about 20 feet but thick with great strenght, maybe be able to take down a desecent size werewolf. Leon gulped as he stay perfectly still, looking as it's head sway back and forth  with some intrust. Slowly, Leon reached for his blade at his side trying to keep at a slow pace. <br>\r\n<br>\r\n&lt;Have too .. reach for it...&gt; looking up to see the snake lend forward with open jaws. leon gasped as he rolled away, off his friends back and to his side. \"Ah!!\" He yelled out in shck as the snake suddenly coiled around him. \"Shade!! help!\" he screamed.</span></div></div>",
            "created":1207371600,
            "id":516412,
            "title":"It's a monster"
        },
        "111221":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Nothing is broken",
                "His left arm is broken"
            ],
            "content":"<div class=\"\"><div> <span>Shade snapped away snarling a little bet. \"grr... you noisey rider will you please be quiet so i can ... Oh god! Leon?!\" he roared out in shock, looking down at the boy. the snake hissed angerly at the dragon but it only made Shade mad. <br>\r\n<br>\r\n\"get away from him you fat boot!!\" he roared snaping his jaws down at the snake cutting it close to leon as the snake was killed instantly as those sharp jaws stabbed threw it's head and some of it's neck. It's grip loosen around the rider, letting him free of the bonds and allowed him to breath easily. <br>\r\n<br>\r\nLeon jumped away and gasped, feeling like his heart was going to jump out of his chest an second now. \"th-thank you Shade\" he sighed looking back to see his partner devour the snake whole laving nothing to waste. \"be glade i woke up to your girlish screaming\" he said sticking his tounge out. Leon stared in annoience. \"ha .... ha ... ha.....\" He looked at himself and checked if anything was broken cause of teh crushing coils from that monster snake.</span></div></div>",
            "created":1207630800,
            "id":517556,
            "title":"Down for the count"
        },
        "111222":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "The thrashing worked, out he goes",
                "Too weak, swollowed alive"
            ],
            "content":"<div class=\"\"><div> <span>\"da-damnit Shade... wake up ....\" he whispered trying to get out of the snake's grip but it was too much for him to handle the coils started to tighten around him. He felt the grip tighten each time he breathed out, thinking about he was going to suffocate to death he suddenly felt the tail tip pull at his cloths while the snake's mouth opened up and engulf around Leon's head. The rider looked up to see the lower jaws come down and whrap around the top of his head. he tried to cry out for Shade's help again but his voice was muffled by those jaws that swollowed over him competely. &lt;Oh god oh god.... this cant be happening....&gt; He thought but it was and the snake swollowed over his neck, taking in it's time. The muscles of the mouth and throat squeezed togather over his head only to run over his body and lend forward, cracking it's jaws to fit his shoulders in next. <br>\r\n<br>\r\nAs he slowly disappeared it felt like someone was watching him from afar but doing nothing to help. He can feel the saliva of the snake drench over his head and on his body, for some odd reason it was toothless, at least he dosnt need to deal with the horrible bite after bite of little sharp teeth pericing his skin. Suddenly, Leon felt the whole world heave further in the hungry snake. Another push followed his shoulders into the esophagus of the oversized snake. Everything was dark, soft, and moist, wet walls of the throat clung tightly to his skin as the snake started working down and over his chest and arms next. he started to wiggle and kick his legs trying to get out but it was near pointless. \"he-help...\" he said in a muffled voice.<br>\r\n<br>\r\nOver looking him a figure smirked at the perdicament of Leon was in. instead of helping he or she lended down and started to strip of his cloths watching him wiggle knowing someone wasnt helping him was worth watching, plus the snake was enjoying it. In fact the snake must have belong to him or her.<br>\r\n<br>\r\nLeon lashing out as he felt hand grab at his cloths and started pulling them apart and off the body. he tried calling for help again from Shade but he was outlike a light, then he started thinking about why he wont answer him, somebody must have drugged him. \"Shade!!\" he screamed out threw the flesh but it was still useless. By this time, the snake was moving its scaly lips over his well built chest drawing him closer into his doom. Leon thrashed harder then ever worried about his life and Shade's as well.</span></div></div>",
            "created":1207371600,
            "id":516434,
            "title":"Snake food"
        },
        "1112222":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Sleep, it's better this way...",
                "Dont give in! Escape!"
            ],
            "content":"<div class=\"\"><div> <span>The snake kept on gulping down the rider with it's owner watching. It wrapped its scaly lips around Leon's waist once he had finished off his chest and abdomen area. he was going be a satisfing meal once he had entered the stomach. Leon's chest and stomach slid past the warm inard mouth to join the rest of his body. The tight throat continued to ripple and squeeze his body deeper and deeper. <br>\r\n<br>\r\nAs more of himself disappeared into its mouth, the body of the snake bulged very nicly to the outline of the boy's body. The snake made a sucking sound making Leon option to squirm and kick about like a helpless fish. With each gulp, the snake leaked a little air into the throat, giving him strenght to wiggle and squirm but it would soon end. <br>\r\n<br>\r\nThe snake ahd worked it's way over his nakkied butt and only had his kicking leg left. gulping again the snake worked over his legs in a nice and slow pace just taking it's woudnerful time in it's nice meal. His legs kicked out uselessly, trying some how to stop the snakes decent, but failing completely. Its firm throat kept him at bay so he can not get out even if with his wiggling. Finally, all that remained was everything below his shins, leaving only part of his legs and his feet still kicking. The snake slowly worked its mouth down enjoying his sweet sweet flavor.<br>\r\n<br>\r\nWith a powerful swollow the snake reached it's open mouth forward engulfing his legs fully and closed it's mouth around his feet, leaving them to wiggle and twitch. Now he was entering the stomach once the mouth whraped around his ankles with little air to work with he just let it be and sliped inside effortlessly. \"nnnggghh... he flt a little groggy from the lack of air now, Now the snake swollowed the last of him, gulping up his feet and sending him fully with in his stomach. The rider was pushed in and was snug tightlywitht he strechy flesh around him, lecking acids to break him down now.<br>\r\n<br>\r\nLeon started to feel dizzy and lightheaded from the air he was using up rapidly. Most of his energy was spent trying to break free, so now didn’t take long for the rider to slowly rocked to sleep. But he was strong and didnt wanna give up, he started to move with what ever strenght he had left.</span></div></div>",
            "created":1207371600,
            "id":516436,
            "title":"Down goes the rider"
        },
        "11123":{
            "choices":[
                "Shade wakes up =_= this could get bad",
                "The dragon starts to drag leon away "
            ],
            "content":"<div class=\"\"><div> <span>As he sat their caught up on his world the shodowy figure jumped out tackling him off shade. He landed with a loud thump and a sickening snap as he was tackled straight into a wall. His vision was blur as he came to with a loud groan \" what hit me ?\" he mummbled to him self and looked up to see another dragon in the dim light it was alot bigger then him but way smaller then shade he tried to push him self up with his left arm but winced in pain then knew that the snap from earlier when the dragon knocked him over that I had broken his arm. He looked at this young dragon tring to figure out what it wanted then it spoke * I'm sorry but I was just so excited to find my mate* it nuzzled his chest purring as he tried to figure out what this dragon was saying then Leon said \" wait what?\" the dragon said \" yes I finally found you my mate it nuzzled his chest again as He tried to figure out what was going on.</span></div></div>",
            "created":1289198220,
            "id":989603,
            "title":"It's another dragon"
        },
        "1113":{
            "author_id":"nuclear",
            "author_name":"Skorentre Vaelstrom",
            "choices":[
                "Take a few weeks to train Shade to digest at will",
                "Risk it every time",
                "The potion"
            ],
            "content":"<div class=\"\"><div> <span>Leon walked away, he could rub Shades maw some other time, preferably when Shade was deep asleep<br>\r\n\"What are you doing here so early Leon? Most riders stay up until the light wakes up all the dragons and they can see what they're doing.\" A voice emanated from somewhere<br>\r\nLeon stopped, looking around \"Jeric? Is that you?\"<br>\r\n\"No, this is Darkness, Jeric is sleeping. But you can see me, just come here\" The voice said again, this time coming from Darkness's cave. Leon hesitated before going towards Darkness, Jeric might kill him if he petted his dragon \"What's the matter scared? I know you want to see me, you have been itching to do so ever since you saw me cough up my rider when he was too injured to ride. I saw you, you wanted to crawl inside Shade's mouth ever since... and I can arrange that\" Darkness hissed in a tone that could dissolve anyones mind. Leon took a step torwards Darkness, he knew him too well, and most of what he said was true. Leon walked towards Darkness \"Stop there... that's good, now wait\" Leon waited as Darkness stood up, walking towards him and looking at him.<br>\r\n<br>\r\nDarkness was another silver dragon (with darker scales, hence his name), slightly longer (80ft long) than Shade and his older brother \"Leon, I know what you want, Shade has asked me what he should do with you since we are brothers, and we both have riders that are alike in some ways\" Leon nodded, knowing what Darkness meant by him and Jeric being alike \"And that is why I needed to speak to you personally, so Shade can fufill your wishes. Now tell me, do I know what you want?\" Leon nodded, remembering that Darkness had a habit of observing riders and figuring them out. \"I thought so, now listen carefully... most dragons have 2 stomachs, one for fuel, and one for food OR storage, now I suppose you know which one you want, but the trick is to make Shade's digestive juices not come in. It will either take weeks to train so he can do it at will, risk it every time, or drink a potion so they don't activate for a day. Now, which one? Unless I already knew\"</span></div></div>",
            "created":1303538100,
            "id":1092900,
            "title":"Shade's brother"
        },
        "11131":{
            "author_id":"nuclear",
            "author_name":"Skorentre Vaelstrom",
            "choices":[
                "Sure",
                "Let's try  a little later, after a mission"
            ],
            "content":"<div class=\"\"><div> <span>\"I know you too well Leon, you're too predictable. Guess what me and Shade have been doing every night for you?\" Leon shrugged, he never really thought about why Shade had been really tired every morning for the past few weeks. Darkness seemed distracted for a second, then he hissed \"Good morning Shade, your rider's over here if you're wondering, just come over here. He knows that you know that I knew that you knew\" <br>\r\n<br>\r\nShade walked over, placing his tail protectively in front of Leon \"What?\" Darkness shook his head \"Leon knows that you know that I knew that you knew about him. Would you like me to repeat it slower, or should I go into deeper details that even a hatchling like you could understand?\" Shade growled \"No, I think I'm fine with how you said it\" Darkness laughed \"You think? That's a new trick, how long did it take you to learn that one Shade?\" Shade was growling louder, usually he would pounce by now but Leon wasn't in the safest spot at the moment \"I'm just kidding, now you two run off, we have several 'star' missions involving several large gryphon nests\" Darkness hissed as he climbed out the entrance to the cave and flew off toward the mountains<br>\r\n<br>\r\nLeon gulped, even Alia wasn't allowed to tackle star missions, mainly because her dragon wasn't fit for 'four on one combat' and a few other reasons. \"Someday, we'll be able to do that\". Shade looked down at Leon and licked him \"Someday we will, but for now let's focus on you. You actually are pretty good\"</span></div></div>",
            "created":1303539840,
            "id":1092906,
            "title":"Darkness has too much free time. Or does he?"
        },
        "112":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Go back upstairs",
                "Check if anyone spares some food",
                "Sneak in to the kitchen"
            ],
            "content":"<div class=\"\"><div> <span>Leon sighed as he didnt want to hear the noise of chatter filling up the cafe hall, each voice trying to speak over the other. the rider walked towards the main lunch line to get some mroe food, being the last they are the most rejected cause if you were the last in line and wanted seconds they will just shut the door on you.<br>\r\n<br>\r\nHe walked right to the door and stared up at a lunch lady who had seen betetr days, a hair net looked to be 50 and was clearly eaten one too make sweets. Leon too a deep breath. \"Is the line closed?\" he said a bit annoied. the women snorted. \"yes!\" she said in a raspy voice about to close the door when leon put his foot in the way. \"can you spare even a bit of food?\" he tried to convenice her. \"No, the scraps we have go to the dogs. if you want some go pick it out of the garbge lizard boy\" She laugehd shoving him back to slamed the door. <br>\r\n<br>\r\nLeon growled glaring at the door like it would help get food but his stomach gurgled sounding like it was done with the misly breakfest he had. \"damnit.... have to find soemthing else to eat\" he muttered, getting up and tossed out his tray.<br>\r\n<br>\r\n</span></div></div>",
            "created":1207112400,
            "id":515454,
            "title":"Seconds please?"
        },
        "1121":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Go for it, spit him out once your done",
                "Nah, go for jason, he looked pretty tasty",
                "Eat the snake if you REALLY can"
            ],
            "content":"<div class=\"\"><div> <span>leon sighed as he might as well go back upstairs before seeing Shade for the day. he walked back up those damn steps once again hoping his roommates don't go and get them selves wasted with hangovers and this early in the morning. <br>\r\n<br>\r\nIn the dorms he walked right in to his room and look down at the place, 2 beds on each side of the room with there stuff on one side such as cloths books weapons, armor, items, or even snacks or even Jason's (one of leon's friend) pet snake that he found and just HAD to keep it. Leon shook his head and just walked over the mess of beer and everything else that was for the so called party.<br>\r\n<br>\r\nIt wasn't till he looked down at Ace, one of his best friends of all time and closest since he came here, he started to feel really and truly hungry. \"hm ...\" he looked down at his stomach, rubbing it a couple times before looking to Ace. \".... I wounder if i could...\" he started to walk towards him, since his bed was next to his own and grab his hand. Coarse he was out like a light and didn't wake even if you pushed out of the bed.<br>\r\n<br>\r\nLending down leon opened his mouth as wide as he could and stuffed the hand in, amazed, he gulped a little, moving his lips over his wrist and started down his arm. He pulled back to look at how far he went at the saliva soaked hand. \"oh wow...\" he said, as he never knew he could do that and started thinking... &lt;maybe I can eat him fully.... like Shade with his meat.... but i cant ... not with Ace&gt;</span></div></div>",
            "created":1207630800,
            "id":548803,
            "title":"Go back upstairs"
        },
        "1122":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Too the stables",
                "Maybe a little detour",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Leon sighed and walked back to the table, taking a seat and just sat there with his buddies. he looked to them for a moment before turning away and closed his eyes. Hungry and tired, he tried to drown the noise of everyone out by thinking of something else. <br>\r\n<br>\r\nhe started thinking of Shade, eating his food like any other day but then would replace the food with himself. Just as that small daydream was happening he was shaken back in to reality by one of his friends. <br>\r\n<br>\r\nStanding beside him was a boy, just as old, tall and well built. The only difference was that he had long black hair with his lightly tan skin and his outfit was sort of forgen because he was an exchange study from the city other the ocean. He was here for about 3 years and one of Leon's close friends. \"Oh .... hey Raven\" he sighed softly. It was rather strange, of everyone in the castle who had a dragon would be the same gender at the human partner. Yet in raven's case he and a female dragon instead. By guessing they must have different rules from where he was.<br>\r\n<br>\r\n\"Hey man .. you look tired... the guys kept you up all night?\" Raven said swinging a hand other his shoulder. \"yeah ..... at least they didn't end up embarrassing me like last time\" He spoke, flopping over on the table and closed his eyes. \"Well yeah, could be worst ... anyway Leon, if your still hungry Ive got some snacks back at the stable and I'm sure if you ask , maybe Shade can share his food with you\" he said trying to reasure him. Leon looked up at his friend and smiled. \"well I guess I can go ... as long you come with me. I heard Alia stay out late again and I rather not run in to her fat ass\" he said.<br>\r\n<br>\r\nRaven chuckled. \"right right ... keep denying that and I'm sure you two would have cute little babies running around. Alia and  Leon jr. What cute names\" he teased. as they went off to the stables. Leon grabbed Raven and started to give him a noogie. \"yeah well maybe Amber should hook up with you!, little dragon babies running around, setting things on fire\" he smirked. The two started to play fight and insult each other just for fun. </span></div></div>",
            "created":1216357200,
            "id":557477,
            "title":"Raven, he's no bird"
        },
        "11222":{
            "choices":[
                "Curiously full...",
                "Empty!"
            ],
            "content":"<div class=\"\"><div> <span>Leon followed Raven to his dragon's stable and looked around with interest. Raven had built a small cupboard in the corner of the stable. He guessed it wasn't such a bad idea, a place to store things. Raven's dragon was jet black and strangely when Leon thought back he'd never actually met her. She looked at him curiously and then looked back at Raven.<br>\r\n\"I keep snacks in the cupboard over there\" said Raven, nodding in the correct direction with his head.<br>\r\nLeon walked past Raven's dragon who moved out of the way and opened the cupboard door. The cupboard was...</span></div></div>",
            "created":1275066480,
            "id":890612,
            "title":"Following Raven"
        },
        "112222":{
            "content":"<div class=\"\"><div> <span>The cupboard was completely empty. Leon was both disappointed and angry. He had raised his hopes.<br>\r\n\"Hey, i thought you said you kept snacks in here\" exclaimed Leon<br>\r\n\"Oh i never said i kept snacks for YOU in there\" said Raven with a sinister laugh<br>\r\nLeon turned to find Raven's dragon had cornered him. He gulped, he was doom unless Raven stopped this.<br>\r\n\"But we're friends\" said Leon \"How can you do this?\"<br>\r\n\"If it makes you feel better i did value your friendship\" said Raven sadly \"however my dragon comes first. When she's hungry she gets fed. Today she just happened to want human meat, you were more than willing. Try to look at it this way, only the strong survive. you were weak of intelect to walk into this trap so you won't survive. I'm sorry for the pain you'll suffer\"<br>\r\nLeon quickly leapt forward, hoping to get past Raven's dragon before it struck. No such luck. The dragon's massive jaws caught him around his waist and he felt his legs get quickly slurped in. His world tipped as Raven's dragon flicked it's head back to swallow. Raven watched the wriggling lump that was Leon slip down his dragon's neck until it merged seamlessly with her scales. He walked away, nobody would find out. After all... humans dissappeared all the time.<br>\r\nRaven's dragon felt the weight of her meal hit her stomach and she sighed contentedly. She stretched herself and made herself comfortable for a nap. A small smile lit her face as she felt the weak struggelings of her prey in her stomach. The human would be digested soon enough but until then she would enjoy every moment of his demise.<br>\r\nLeon was digested away and not even Shade managed to discover where he had gone. Soon people stopped looking, he was just anouther name on the dissappearences list.</span></div></div>",
            "created":1275067380,
            "id":890617,
            "title":"Hey... what's... uh,oh"
        },
        "113":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Run in to another rider",
                "Get there with no problems"
            ],
            "content":"<div class=\"\"><div> <span>Leon closed his eyes as he got up and went to toss out his trash but it was when he heard his friends started talking about a class A mission for the riders. His eyes snapped to them and blinked a few times. his headache felt better now. \"A ... class A...\" he muttered and went back to sit with them and listen in on them. He was a class D or C the most he can handle was almost a B at one point but Alia and her bronze dragon go in the way.<br>\r\n<br>\r\nHis friends started going on about anyone above a class B rank can try the mission only if they are daring to take it on plus they started talking about what it might cause no one knew what it was, or at least never came back once they started. One of leon's friend's turned to him with a grin. \"hey Leon are you-- he's gone?\" the rider blinked a couple times looking around in question, wondering where he went.<br>\r\n<br>\r\nLeon raced down the hall ways to get to the one of the many offices that let you register for a mission and where you get paid after you had completed. The eager rider smiled in hopes that he gets it and proves to the higher ups he can do anything in the A rank level. S ranks where off limits cause only the elite are allowed to take on the missions.</span></div></div>",
            "created":1204174800,
            "id":503943,
            "title":"Mission A? go with C"
        },
        "1131":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Alia makes it",
                "Leon makes it",
                "They both make it"
            ],
            "content":"<div class=\"\"><div> <span>Leon was close to the office when suddenly he bumbed in to someone sending them both on the floor. Dazed for a moment, Leon looked up and was about to say sorry to the person he knocked over when he say it was Alia. \"Oh great .. not you\" he said bitterly. Alia blinked, looking at leon and sent him a smirk. \"well well, if it isnt the small fry\" she said, as they got off the ground and stared at each other angerly. \"what the hell..... are you here for the A class mission as well?\" he growled under his breath, Alia gasped suddenly. \"Your here for it too? well ... this is a sad sight, a runt after a better rider's job. I thought your B rank mission would send you back to the kiddy pool by now\" She boasted to him. The male rider sneared at her with hate. \"Well atleast I didnt sex my way threw the ranks!!\" he yelled and turned, starting to run for the door. The female rider gasped and chased on after him. \"Oh no you dont!! this is my job you shrimp!\"</span></div></div>",
            "created":1207198800,
            "id":515749,
            "title":"Run in to another rider"
        },
        "12":{
            "author_id":"knuckleheadiv",
            "author_name":"SuunYunLi",
            "choices":[
                "They arrive with no complications",
                "The goblins were prepared. Aerial attack"
            ],
            "content":"<div class=\"\"><div> <span>\"Somehow I don't think that it was worth finding and recruiting a dragon for this\" Alia mumbled as she read over her orders again. \"Fighting off orcs? That's work for normal knights.\"<br>\r\n<br>\r\nAlia was a rather average human female of twenty with red hair and green eyes. She wore a set of green armor over a simple cloth skirt. \"Oh well, I guess it can't be to choosy about what I do,\" she looked over to the large bronze dragon snoozing beside her. \"Okay, Rune time to get to work.\"<br>\r\n<br>\r\n\"And,\" she asked, stretching like a cat. \"What would that be this time?\"<br>\r\n<br>\r\n\"It says here that a few goblin tribes have allied together and are conducting raids on the human settlements to the east. We've been hired to get rid of them.\" Alia recited the orders as she climbed onto the special harness on the dragon's back. \"Well, let's go.\"</span></div></div>",
            "created":1203829200,
            "id":502450,
            "title":"Alia, The female rider"
        },
        "121":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Rune somehow manages to swallow down all 200 goblins",
                "Rune can't manage to eat them all and the goblins capture both of them"
            ],
            "content":"<div class=\"\"><div> <span>Rune flaps her wings as she flies over the marching goblin horde. From what Alia could see, the goblins don't have any sort of ranged weapons to use for defense against her dragon. In fact, the only weapons they seem to be carrying are wooden clubs and their armor consists of only loincloths. The problem however, is that there are 200 of them!<br>\r\n<br>\r\n\"I'm not sure I can eat THAT many goblins!\" Rune gasps.<br>\r\n<br>\r\nRune's greedy personality explains why the bronze dragon is the fattest dragon in the dragon stables. But there’s muscle underneath all that blubber. If there wasn’t, then Alia and her dragon would have become some monster’s diner a long time ago. And despite Rune's flaws, Alia can't help but love her big fat dragon.<br>\r\n<br>\r\nAlia smacks her forehead with her hand, \"Rune, you don't have to eat every monster we fight! All you have to do is kill them!\"<br>\r\n<br>\r\n\"What?!\" Rune exclaims indignantly, \"There are starving dragons in third world countries, so I refuse to waste food like that! I'll just have to do my best and hope I can manage to scarf them all down.\"<br>\r\n<br>\r\nAlia sighs as her dragon swoops down on the goblin horde and starts gulping down the three foot tall goblins whole.</span></div></div>",
            "created":1203915600,
            "id":502729,
            "title":"No Complications... Sort of"
        },
        "1212":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Fight free",
                "Talk your way out",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Rune hissed as she swooped down and started to scarf down the the smaller goblins one after another, she didnt notice how dangerously close she was to there reach. Even if they were small, they were large in numbers and started to crowd around the dragon and rider. They grabbed at the dragon limbs climbing on one another like a ladder. <br>\r\n<br>\r\nAlia gasp as Rune was starting to be lower to the ground as more came. in fright and anger she started to hack and swing at the smaller goblins. <br>\r\n<br>\r\n\"Back! Back beasts!!\" She yelled at them trying to get them off her partner. \"Rune you have to fly!\" She called to her. \"I .. I cant too heavy...\" The might dragon whimpered, she looked back at her rider hearing hearing her scream. <br>\r\n<br>\r\nShe saw one of the green monsters grab at Alia's leg, dragging her off the back mount and on to the ground. The goblins laughed and cried out as they piled on the fat bronze dragon. Rune roared out trying to gulp the little beasts down as fast as they came but it was no good. Soon the two of them were over powered by the hord. Alia yelled and growled, screaming like a drunken sailor at the creatures to let them go, cursing and spitting all kind of volger at them. <br>\r\n<br>\r\nThe goblins chose to ignore the women's screaming, as she was the first to be stripped down of her items and tied up with some rope. She was tossed aside like a bag, while the rest of the hord went on to tied up Rune in some special chains just in case they ran in to a dragon. From then on they will decide on what they should do to them next.<br>\r\n<br>\r\nRune and Alia had to think of something fast or you two might end up as a meal to one of the many goblins.</span></div></div>",
            "created":1204002000,
            "id":503204,
            "title":"Not the greatest idea after all"
        },
        "12123":{
            "author_id":"ningishzida",
            "author_name":"Draconic Chronicler",
            "choices":[
                "Alia decides to wait out the night on the ledge, ",
                "Alis climbs down the mountain in search of Rune."
            ],
            "content":"<div class=\"\"><div> <span>The Chief of the Goblins held a sword to Alia's throat and shouted to Rune, \"Bronze Dragon, do as I say or I will kill your rider.\"<br>\r\n<br>\r\nSeeing that she could do nothing without risking Alia's death, the dragon humbly bowed her head in submission.<br>\r\n<br>\r\nSneering because of his power over a great dragon, the Goblin chief ordered, \"First you fat pig of a dragon, vomit up my warriors, for some may still be alive.\"<br>\r\n<br>\r\nRune replied, \"Your wish is my command, Oh Chief, but to do so you'll have to undo the chains, for I must raise my body up to heave.  You don't have to worry for you have my rider.  And be quick about it for they will not last long with the acid and lack of air.\"<br>\r\n<br>\r\nThe Goblin Chief weighed his options.  The monster had swallowed his brother and oldest son.  Could he just kill the dragon, he wondered.  No the monster allowed itself to be bound because the woman was held hostage.  But it would not submit to death, and their weapons could not penetrate its thick hide.  Plus, with the woman as a hostage and the great dragon undrer his control, he would become the greatest Goblin Chief in the land.<br>\r\n<br>\r\n\"Very well\", he said , \"unchain the dragon\".<br>\r\n<br>\r\nRune raisied her back legs high and dipped the front of her body low and began to hack.  In a few moments a great lumpy mass could be seen quickly moving up here throat, and a moment later, with a great retching sound she vomited the mass of writhing, choking goblins, as well as gallons of stinking, acid vomit all over Alia and the Goblin Chief, knocking them both down.<br>\r\n<br>\r\nHer head immediately darted forward to snap up the Chief, shaking the sword out of his hand before bolting him down. And before any of the goblins could react, she snatched up Alia, and with her stomach nearly empty, leaped into the air, and to safety.<br>\r\n<br>\r\nRune dropped Alia on a rock ledge way from the Goblins, and went back to wreak her revenge.  With their leader devoured, the Goblins were demoralized, and seeing the dragon return, caused them to break formation and flee into the woods.<br>\r\n<br>\r\nThis was their death sentence, for divided they were nothing but morsels of dragon food, and Rune began the chase gobbling them up as they ran, and when the remainder went into hiding, her senstive nose ferreted them out.  Very few escaped, and again too heavy to fly, she slowly crawled back to the the spot of the first battle, and gulped down the struggling and dead goblins in the pool of vomit, and like a dog lapped up all of here mess.<br>\r\n<br>\r\nContent and sluggish with her enormous, meal she lulled off to sleep not realizing she had left Alia on a ledge, covered in dragon vomit.   <br>\r\n<br>\r\nAlia paced back in forth on the small rock  ledge, wondering what became of her dragon partner.  She itched, and stunk horribly but there was nothing around to clean the slime off with save for chips of sharp stone.  It would be dark soon, and dangerous predators would begin to lurk, and she wasn't sure if here terrible smell would attract or repel them.  It looked like there was was a way she could climb to the bottom, but then what?  Without her huge companion as protection, she would never make it back to a human settlement.  She weighed her options:</span></div></div>",
            "created":1204347600,
            "id":504562,
            "title":"Alia Alone"
        },
        "121232":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Accepted her as a child",
                "Eats her"
            ],
            "content":"<div class=\"\"><div> <span>Alia looked down the rocky side and then back to where she stood, to reasure herself. \"oh man .... \" she muttered as she clung back against the rock side before she went back to the edge.<br>\r\n<br>\r\n\"Oh man .. I just cant wait for her\" she said as she turned around, and slowly put her foot on the rock below the one she is on. \"ok .. this isnt so hard\" she said, slowly putting the other foot on it. But then suddenly she let out a yell in surpise, as her grip slipped and she fell backwards from the cliff. \"AAAHHH!!!\" she screamed out in fear. The image of her landing on the ground or a sharp rock flashed before her eyes. \"Rune!!\" She screamed before she winced, landing on something soft. <br>\r\n<br>\r\nAlia almost cried in joy as she was saved but examing her setting she found that it was a nest. A big nest with 2 large eggs, one was cracked open with no chick inside the other was not even open yet. She crawled on over too the cracked open egg and blinked. \"huh? what is this\" she said grabbing it and looked inside. Still it wasnt a good idea to use the egg as sapport when someone lended aganst it. <br>\r\n<br>\r\nSoon enough she fell forward, cracking it open and pouring the goo all over her body. At least it had washed the vomit off. \"ugh ... eeewww\" she said looking at her body. Sitting back up on the nest she had to get crawl down the rock side before, what ever lied these eggs had come back. <br>\r\n<br>\r\n\"Have to move quickly befor--\" her body froze as two large wings flapped on down, then a thud as the mommy or daddy came back. Slowly Alia turned back to see who it was, to her surprise it was a couatl, those huge beautiful wings tucked in against it's serphant body. Scales shinning against it's body from the sunlight.<br>\r\n<br>\r\nIt cocked it's head to the side in confusion as it looked to Alia. It leaned in close and started to sniff her. Nudging her form a little then pulled away, the couatl then ....</span></div></div>",
            "created":1216270800,
            "id":557044,
            "title":"She's no mountain goat"
        },
        "1212321":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "It's too hard to eat",
                "Very easy to swallow"
            ],
            "content":"<div class=\"\"><div> <span>The couatl accepted her as one of her own. Alia was sure that she was gonna be eaten but the scent from the goo, that had drenched her body. It could have the been the thing that fool it in to thinking it was it's baby ... and very strange looking baby. Still Alia didnt need to complain as long she didnt end up a snack. <br>\r\n<br>\r\nThe creature opened one of it's wings, folded it over Alia and bring her close to the other egg. Lending it's head in the still unhatched egg the creature started to nuzzle, and lick it. It seems to be waiting for it's other child to be born. Yet while the couatl baby was still developing the couatl mother would turn it's attention back to Alia, nudging her a few times, giving her belly a couple licks. The dragon rider giggled and wiggled softly under it's head. She was rather ticklish about her stomach but the mother wasn't playing. <br>\r\n<br>\r\nThe rider looked on and can tell that the mother was big.. maybe able to swallow 3 or 4 humans at a time by the look of it. Coarse she knew what the mother would do next. It started to bring up it's latest victim from the pits of it's stomach making a very slight budged in the neck. Now Alia started to worry again about what she will be feed. Couatl are snake like creatures and they like to eat things whole. So if she's given food, will she be able to eat it? and keep up the child couatl act?<br>\r\n<br>\r\nThe mother soon leaned in close, coughing up a furry, a small mouse boy who was captured at the wrong place at the wrong time. It was out cold for now and the creature just nudged it close. Alia gulped, as she was hungry but still worried that she cant eat it whole. \"I .. need to try\" she said not wanting to end up as a meal herself. Grabbing the mouse boy she pulled him close, moving it's head to face her then she opened her jaws. <br>\r\n<br>\r\nLike a mother, she helps with her \"child\". Taking her tail and started to stretch her jaws and lips seeing her having trouble with the meal. Alia winced and looked to \"mom\" as she stretched her jaws.</span></div></div>",
            "created":1216270800,
            "id":557107,
            "title":"First time eater"
        },
        "122":{
            "author_id":"knuckleheadiv",
            "author_name":"SuunYunLi",
            "choices":[
                "they dodge",
                "they don't"
            ],
            "content":"<div class=\"\"><div> <span>Goblins weren't known for patience or intelligence or proficiency at ranged combat or a great number of other things for that matter and it showed.<br>\r\n<br>\r\n\"Attack\" a particularly large black skinned goblin yelled as several boulders and arbalest bolts were fired.<br>\r\n<br>\r\nMost of the missiles flew harmlessly short and the others were easily dodged. \"still,, it is rather unusual,\" Alia mused to herself. \"Goblins are mostly known for mass melee and not this meaning perhaps someone else is in charge.....\"<br>\r\n<br>\r\n\"Incoming\" Rune shook her rider out of her trance when a huge rock appeared</span></div></div>",
            "created":1203915600,
            "id":502685,
            "title":"The goblins were prepared. Aerial attack"
        },
        "1222":{
            "author_id":"knuckleheadiv",
            "author_name":"SuunYunLi",
            "choices":[
                "Its Rune",
                "The leader, an ogress"
            ],
            "content":"<div class=\"\"><div> <span>\"that's not good\" Alia said as she was hit by the boulder. Fortunately, Rune was already preparing to dodge so the impact wasn't fatal.  Neither was the landing as some branches on the way down softened it but also made it difficult for her to be found.<br>\r\n<br>\r\nAlia woke up an unknown amount of time later tied up in a goblin tent. \"Oh yeah, that rock\" she said after a while when the memory of what recently happened came back to  her.<br>\r\n<br>\r\nThe sound of heavy footsteps were heard from the entrance of te tent. Odds were against it but there was always the chance that it was Rune to get her. Of course, it was more plausibe that it was just another goblin or perhaps their mysterious leader</span></div></div>",
            "created":1204002000,
            "id":503221,
            "title":"they don't"
        },
        "12222":{
            "author_id":"knuckleheadiv",
            "author_name":"SuunYunLi",
            "choices":[
                "Resist",
                "Don't"
            ],
            "content":"<div class=\"\"><div> <span>The sound of footsteps got closer as a single figure entered. Unlike their male counterparts, female ogres weren't really monstrous in appearance. Indeed, one could easily mistake her for a musculer female with dark skin, a simple green tunic, and a athletic build. That was where the similiarity ended as she was also aout eight feet tall.<br>\r\n<br>\r\n\"Only one?\" she asked in a gruff tone. \"I'll never get recorded as one of the great war leaders at this rate. Well,\" she looked down at Alia and gave a toothy grin. \"I guess we have to start somewhere and at least you are cute. Well for a human anyway.\"<br>\r\n<br>\r\nShe reached down to pick up Alia. The dragonrider's spear is against the other side of the tent, leaving her with a decision. Does she risk fighting the ogress here or does she go with the lrger female and keep the implausile hope of help alive?</span></div></div>",
            "created":1207112400,
            "id":515463,
            "title":"The leader, an ogress"
        },
        "13":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Head to get food",
                "Chase Leon",
                "Go out and get your own food"
            ],
            "content":"<div class=\"\"><div> <span>A 65 feet Silver dragon yawned stretching it's self out in it's own cave nuzzling and snuggling in it's bedding murring as he started to stir from his sleep. he growled slowly opening his eyes and looked at the cave hearing his name called again and again. he growled slowly lifting his head up. \"mmm ... yes Leon?\" he asked looking at the boy that stood at the entrance waving a chunk of meat in his hands.<br>\r\n<br>\r\nThe amused dragon smiled as he got up and slowly walked out of the cave. His name was Shade, a rare Silver dragon that is born ever 14 generations to chose a worthy rider to grow with in this eat or be eaten world. For now the boy was no hero but a starter none the less. Shade growled walking after Leon who just lead him to get lunch. \"careful boy or I am tempted to eat you\" he joked licking his hands. Leon cringed at the thought of it. \"Spoil sport\" He grumble.<br>\r\n<br>\r\nLook outside the dragon flicked it's tail a few times wondering what he should do, he felt like going for his own food on the other claw he can play with Leon before getting the meat he had in his hands it did smell pretty good.</span></div></div>",
            "created":1203829200,
            "id":502488,
            "title":"Shade, Leon's partner"
        },
        "131":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Change to Leon's POV",
                "Keep to Shade's story"
            ],
            "content":"<div class=\"\"><div> <span>Shade sighed as she walked over to the main dish but Leon blinked feeling a bit ignored. \"hey!\" he said and ran after him but as he ran after him Shade stopped sticking her tail out and tripped Leon seeing him roll forward and in to his food dish. The dragon blinked, looking down at his rider then suddenly smirked walking over, leading down and took a mouthful of his rider and the meat. <br>\r\n<br>\r\n\"Gah!! Shade! let me out!\" he yelled wiggling around getting covered in drooled. His partner smiled a tooth grin, and licked him around with the meat. \"mm... why not?\" he mouthed tossing him around swallowing some meat that passed by his head. \"mm... maybe I should just swallow you\" Shade said sitting down on the cave, close his jaws a bit tighter, titling his head back and smiled in glee over his taste.<br>\r\n<br>\r\nLeon wiggled and smirked to get out but being pushed to the back of the throat with the meat on top of him he just sighed and gave up, blushing as he was already happy... to be in his partner. Coarse when Leon had stopped Shade blinked, wondering why he gave in so suddenly. None the less he dad taste pretty good.. and he was already coated in meat... \"alright.. in you go\" he mouthed taking another mouthful of meat and took one large and powerful gulp. <br>\r\n<br>\r\nLeon blushed even more as he was squished down in to the tight throat. \"Sh-Shade! be careful! and you better let me out\" he called even if his voice a bit muffled by the fleshy walls. The silver dragon simple nod in responds, looking down at the great budge in his neck watching it slowly disappear in his body. It felt so good to him .. and exciting. \"mm... Alright Shade pull yourself together. Eat the rest of the food then fly out to the forest to spit Leon out...\" he muttered and groaned feeling that large gulp fill his empty belly. \"agh... curses It feels so good\" he said lending down and scarfed the food down quickly... before the other dragons woke up and smell a certain scent in the air.</span></div></div>",
            "created":1216184400,
            "id":557489,
            "title":"More then a mouthful"
        },
        "132":{
            "author_id":"billybobny",
            "author_name":"BillyBob",
            "choices":[
                "Alia and Bronze",
                "A predator",
                "A rock"
            ],
            "content":"<div class=\"\"><div> <span>He decided not to leave his young partner yet.<br>\r\n\"Not so soon...\", Shade thought to himself.<br>\r\n\"Besides, it would be good to get a little fun in before going hunting.\" He started sauntering up to Leon slowly, but that quickly turned into a trot once his childlike, playful instincts kicked in. Leon started shaking the meat around, causing Shade to start leaping after him, very content with his situation. Shade started thinking about how he couldn't have chosen a better partner, and how loving and caring Leon was. In fact, the two of them got so caught up in the moment, they didn't realize a dark looming figure blocking the sun and casting a huge shadow as it approached. It was...</span></div></div>",
            "created":1204088400,
            "id":503719,
            "title":"Sentiments..."
        },
        "1321":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "There is more then just meat in the dish",
                "Hears Leon yelling in frear",
                "Rune joins him but there's no more yelling"
            ],
            "content":"<div class=\"\"><div> <span>Shade stopped in the play, looking up at the shadow that loomed over them. Leon had stopped but not before tickling his partner's side. When the two looked up they saw  a fat brozen dragon coming in for a landing after a late night adventure. <br>\r\n<br>\r\nIt was Alia and Rune and both looked pretty happy about themselves with a bags of treasure they had. It was a rule where what ever treasure a rider finds, half would go to the dragon's bed and the other would be shared out to the other dragons. Because other riders aren't lucky enough to provide a gold bed for there partner.<br>\r\n<br>\r\nAlia hopped off her dragon and gave her belly a pat as it was still digesting an enemy that was stupid enought to attack Alia while her dragon was right next to her. The female rider looked to Shade and Leon and smiled. <br>\r\n<br>\r\n\"Shade, you really shouldn't play with you food, it not very healthy\" she said with a smirk. Leon glared at her. \"yeah? maybe you should be with Rune so much .. she might think your food... but after eating you I dought you would even add any pounds to her.\" Alia only glared back, Leon hopped off Shade and stood in Alia's face. \"Well pipsqueak why not put your head between your legs .. and kiss your ass goodbye\" Alia spoke with a cold tone. \"at least my ass isn't as big as yours.. it jiggles even in your sleep when you snores at keeping everyone awake, even the head master\"<br>\r\n<br>\r\nLike always the two started arguing and insulting each other. Even if you left them in the same room they would be staring at each other and even more, passing on more insults. It was just to early in the morning for this. \"Ugh ... Hey Rune are you heading to drop that gold off?\" He asked her. but Rune smiled and shook her head. \"nah, I'm gonna watch these two so they wont end up killing each other\" she said. Shade nod and walked off to his food dish, sighing a bit as he could still hear them. \"Just another day...\"</span></div></div>",
            "created":1216270800,
            "id":556765,
            "title":"Old rivals"
        },
        "1322":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Catches up",
                "Doesn't make it"
            ],
            "content":"<div class=\"\"><div> <span>That very shadow was a massive gryphon that had caught wind of fresh meat hanging in the air. Looking down at the ground and noticed the cliff like cave, she saw a tasty human just waving meat around in the air and a silver dragon slowly approaching him. <br>\r\n<br>\r\nLooking over at the dragon she hissed narrowing her eyes, she had to make quick get away once she had the human in her clutches. She flew around for a moment before folding her wings in and started a nose dive to the human.<br>\r\n<br>\r\n~~~~<br>\r\n<br>\r\nLeon smiled waving the meat around. \"Ha! you cant have this\" he smirked. Shade growled happily slowly coming to him. \"oh no? would like to test that theory?\" He growled approaching him more till he looked up hearing a screeching sound. Right before his eyes in mere seconds, Leon was snatched away by a giant turkey! <br>\r\n<br>\r\n\"Leon!!\" He yelled out in surprise looking at the gryphon fly away with his partner in it's claws. The dragon growled as he stretched his wings out  letting the air brush over his body. <br>\r\n<br>\r\nThe dragon then made for a running start jumping off the cliff, letting the wind pick up and lift him up in the air, after the gryphon quickly. If he doesn't catch up soon then Leon will surly become a nice snack for the turkey.<br>\r\n<br>\r\n\"Leon!!\" Shade roared</span></div></div>",
            "created":1204174800,
            "id":504093,
            "title":"Bird of a feather"
        },
        "13222":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Grip is tight, Leon is coming out",
                "Grip too loose, down goes Leon"
            ],
            "content":"<div class=\"\"><div> <span>Shade flapped his wings trying to keep up to the damn bird that held his rider. he closed his eyes trying to gain enough speed egt to the bird and rescue his rider. \"Give him back you flying feather duster!!\" he yelled baring his fangs as he was gaining in on the gryphon but it suddenly did a dive bomb towards the ground to escape Shade and disappear in to a forest. Shade snarled and followed in after it knowing it's wing span cant hold up to the thick trees so it had to land.<br>\r\n<br>\r\nWhen the silver dragon went in to the forest and moved inwards a little he saw Leon and the gryphon, but to his horror the gryphon was half way down with the human. Gulping him whole, letting the wiggle budge side down it's neck and towards the pits of his stomach. The dragon can easily BBQ this bird but he would also set fire to the forest and endanger his rider and the people of the village nearby.<br>\r\n<br>\r\nInstead, he charged forward alerting the bird with a throw of his tail and reach out to grab the dangling legs that hung from it's mouth. \"let go damnit!\" he snarled moving backwards, his clawed hand keeping a firm grip. the gryphon hissed and gulped, following his claw then just go against it when Shade pulled. \"My food\" It screeched, fluffing it's wings up, gulping up past the boy's waist now. <br>\r\n<br>\r\nNow the silver dragon got worried as the only thing left was his legs and every time he tried to pull away the gryphon would follow his grip, and swallow more of him. \"Grrr no way!!\" he yelled, letting go but suddenly clamped his jaws safely around the rider's legs and started pulling and sucking on him. Even if this was a death struggle between a gryphon and dragon, Shade couldn't help but savor the tasty body within his jaws.<br>\r\n<br>\r\nLeon whimpered as he was caught between two mouths, being a eating-o-war toy between two beasts. \"Ah ... Shade .... help\" He cried, suck tightly in the gryphon. He would fight against the tight throat of the bird, trying to help get free.</span></div></div>",
            "created":1207198800,
            "id":557285,
            "title":"Playing catch up"
        },
        "132221":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "Take flight and go somewhere safer",
                "Tell Leon of his plan"
            ],
            "content":"<div class=\"\"><div> <span>The tug of war between the gryphon and Shade continued for a few minutes with Shade slowly but surely gaining ground on the gryphon. Leon had become completely slick with saliva and Shade had wrapped his tongue around Leon while he pulled at him. At a distance it looked like some kind of complicated kissing effort was being undertaken between Shade and the gryphon.<br>\r\n<br>\r\nFinally the gryphon slipped up for a second and Shade wasted no time in pulling Leon completely out of the gryphon's mouth and stepping back.<br>\r\n<br>\r\n\"Yeah! I'm free!\" Leon yelled as he saw the forest once more even though he was still halfway into Shade's mouth.<br>\r\n<br>\r\nBut the victory was short-lived as Leon saw the gryphon lunging for him once again, determined to stuff him down its throat.<br>\r\n<br>\r\nShade on the other hand used his tongue to pull Leon completely into his mouth and closed it. The gryphon was disappointed by this but it figured the dragon would have to let out the human it was protecting at some point. The two stood there for a few minutes while Shade thought of what to do next.<br>\r\n<br>\r\nHe could probably fly away from the gryphon and let Leon out in a safer place but then the gryphon might chase after and catch Leon again. On the other hand he could chase the gryphon away with his fire breath but then he would have to convince Leon to let him swallow him first, wouldn't want to roast his rider.</span></div></div>",
            "created":1294731900,
            "id":1033305,
            "title":"Grip is tight, Leon is coming out"
        },
        "132222":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "Tackles the gryphon",
                "Does Something creative"
            ],
            "content":"<div class=\"\"><div> <span>After tugging back and forth with the gryphon for a minute, Shade's grip slipped all of a sudden. He fell back and watched with horror as the gryphon swallowed down the rest of the boy. Leon was now lubricated from the struggle and easily slid down the gryphon's throat.<br>\r\n<br>\r\nShade could hear Leon screaming for his life as he was pulled further into the gryphon, he had to do something!<br>\r\n<br>\r\nThinking quickly, Shade...</span></div></div>",
            "created":1218258000,
            "id":567460,
            "title":"Grip too loose, down goes Leon"
        },
        "1322222":{
            "author_id":"blueberryjoe",
            "author_name":"Grater",
            "choices":[
                "Convince the gryphon to cough Leon up",
                "Eat him first!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Engulfs the head of the gryphon, to it's protests, thinking that he can either convince the gryphon to cough Leon back up, or maybe even eat the gryphon in the hopes that he can digest the gryphon, freeing Leon. </span></div></span></div>",
            "created":1266210000,
            "id":836501,
            "title":"Does Something creative"
        },
        "13222221":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "The gryphon gives up his prize and releases Leon",
                "The gryphon continues to struggle"
            ],
            "content":"<div class=\"\"><div> <span>As Shade began to work his maw over the gryphon's head, he wrapped his limbs around the rest of the gryphon to hold it in place. He then pushed his maw further, getting the gryphon's head to the back of his throat and started swallowing in the hope that this would convince the gryphon he was serious.<br>\r\n<br>\r\nThe gryphon began to squirm violently in his grip but Shade managed to hold on. Does the gryphon give up?</span></div></div>",
            "created":1266210000,
            "id":836524,
            "title":"Gentle persuasion"
        },
        "132222212":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "The gryphon finally gives up Leon",
                "The gryphon doesn't give up still"
            ],
            "content":"<div class=\"\"><div> <span>The gryphon continued to struggle while Shade worked more of it into his mouth. His throat opened up and Shade started slowly swallowing, bringing the gryphon into his throat. As the gryphon slowly slid into him in small increments at a time, it struggled to get free of his grip.<br>\r\n<br>\r\nAfter some time, Shade started more fervent swallowing motions and lifted the gryphon to get leverage and help more of it in him. As the gryphon slid further into him its feathers and fur became slimy and slid more easily inside his mouth and throat. Soon after, the gryphon's head was exposed to his stomach and the struggles began with renewed vigor but Shade held his grip with just about half the gryphon still outside him.<br>\r\n<br>\r\nDoes the gryphon now see it's futile and give up?</span></div></div>",
            "created":1266210000,
            "id":836526,
            "title":"The stubborn gryphon continues to struggle"
        },
        "1322222121":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "Check on Leon right here",
                "Go back to the safety of the nest before checking on Leon"
            ],
            "content":"<div class=\"\"><div> <span>The gryphon saw that it had no chance against Shade. He stopped struggling and started making squeaking noises to indicate defeat. Shade noticed this and stopped swallowing the gryphon but wasn't going to let the gryphon go just like that without getting Leon back.<br>\r\n<br>\r\nThey gryphon was glad that Shade had stopped swallowing but confused when they just sat like that for a while. The gryphon then realized what Shade wanted and stiffened inside Shade's throat. He started coughing and heaving, trying to regurgitate Leon from his stomach. After much strenuous effort Leon finally started coming up the gryphon's throat and from there he slid out of the gryphon's mouth and down into Shade's stomach.<br>\r\n<br>\r\nShade on the outside had noticed the gryphon moving in a different manner and waited expectantly for results. When Shade's throat started to bulge further he knew that Leon was being released. Shade felt a new lump in his stomach and knew it had to be Leon that was now sitting in his belly. Shade started pulling on the hind legs of the gryphon to get him out while he heaved in tandem. Slowly the gryphon slid out of his mouth and lay next to Shade.<br>\r\n<br>\r\nWhen the gryphon was completely released he got up and tried to shake off as much mucus as he could made his best attempts to fly away as fast as he could, thankful that he was able to avoid being eaten today.<br>\r\n<br>\r\nWhen the gryphon was out of him, Shade stared and watched the gryphon as he cleaned himself up and flew away not wanting to risk the same thing happening again if he was to release Leon immediately. With the gryphon gone, Shade now turned his thoughts to Leon. He poked his belly, trying to get a reaction from Leon. What does Shade do now?</span></div></div>",
            "created":1266210000,
            "id":836560,
            "title":"An internal transfer"
        },
        "13222221211":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "They stay for a while",
                "They go looking for that breakfast Shade was after to begin with"
            ],
            "content":"<div class=\"\"><div> <span>After some poking, much to Shade's joy he felt kicks being returned to his poking.<br>\r\n<br>\r\n\"How are you feeling in there?\" Shade said.<br>\r\n<br>\r\nLeon replied \"I've been better, now let me out!\"<br>\r\n<br>\r\nShade proceeded to do the same as the gryphon before him. He coughed and heaved, pushing his stomach so that Leon would come out the same way he went in. After a bit of effort he finally felt Leon moving up his throat, creating a bulge along the way. Finally Leon ended up in Shade's mouth and was deposited on the ground before him.<br>\r\n<br>\r\n\"Let's get you cleaned up, there's a lake nearby\" Shade said when he saw Leon starting to get up.<br>\r\n<br>\r\nLeon got on Shade's back and the two flew over to the lake Shade had mentioned.<br>\r\n<br>\r\n\"I can't wait for you, Shade\" Leon yelled as he jumped off Shade's back and splashed into the water.<br>\r\n<br>\r\nShade was happy that Leon was still his old self and dove down to the water himself, his body causing great waves that threw Leon about.<br>\r\n</span></div></div>",
            "created":1266210000,
            "id":836565,
            "title":"Check on Leon right here"
        },
        "132222212112":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "Leon makes it into the cave and the gryphon follows",
                "Leon doesn't make it into the cave"
            ],
            "content":"<div class=\"\"><div> <span>After drying off from being in the lake, Leon got back up on Shade's back to go looking for Shade's breakfast. They flew around a bit until they noticed a cave at the base of a mountain. They took a peek inside and found it to be spacious, but with no occupants. Taking to the skies again they scoured the surrounding land until something caught Leon's eye, it was an old friend.<br>\r\n<br>\r\n\"Hey Shade, look who we have here!\" Leon said as he pointed to a small bunch of trees.<br>\r\n<br>\r\nThe gryphon who had eaten Leon was hiding in the trees and still cleaning off from it's encounter with Shade.<br>\r\n<br>\r\n\"Well, well, I think it's time I pay him back for what he did to you, Leon.\" Shade said as his stomach grumbled.<br>\r\n<br>\r\n<br>\r\nThey landed some distance away to discuss how to handle the gryphon. Shade wanted to fly right down there tackle the gryphon immediately, but Leon had other plans, he wanted to have some fun. He told Shade that he wanted to lure the gryphon into the cave they found earlier where Shade would be waiting for him and the gryphon, that way he could rile up the gryphon and completely catch it by surprise like it did him.<br>\r\n<br>\r\nShade agreed to the plan, as it sounded like an appropriate payback for what the gryphon did earlier and he would get his breakfast, not to mention it would be fun. So Shade flew off to the mountain and lay waiting in the cave for Leon to return while Leon walked down to where the gryphon was hiding.<br>\r\n<br>\r\nAs Leon approached the small bunch of trees he shouted out the gryphon<br>\r\n<br>\r\n\"Hey bird brain! You missed me last time! You want another chance at this!?\"<br>\r\n<br>\r\nLeon waved his butt at the gryphon and smacked it before running off in the direction of the cave. The gryphon was embarrassed and angry after the last time he tried to do anything to this human, he was also afraid of the dragon that followed him around. But he did not see the dragon here and was too angry to think that this might be a trap. The gryphon took to the air to pursue Leon through the forest.<br>\r\n<br>\r\nLeon ran through the forest as quickly as he could, looking back over his should every so often to make sure the gryphon was still following him. He shouted taunts to the gryphon saying that it was too slow and couldn't catch him, this only helped to enrage the gryphon further and increase it's efforts.<br>\r\n<br>\r\nThere were a couple times the gryphon dove for Leon in the trees, but it missed each time, getting only more frustrated.<br>\r\n<br>\r\nLeon was just about to the cave and could see the entrance ahead of him, he knew Shade would take over once he got the gryphon inside.</span></div></div>",
            "created":1283333340,
            "id":948155,
            "title":"Breakfast has been found"
        },
        "1322222121121":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "One of them woke up early",
                "They both woke later"
            ],
            "content":"<div class=\"\"><div> <span>Shade waited inside the cave while Leon went after the gryphon. They had found a spot around a bend in the cave that completely covered him in darkness so that he could surprise the gryphon when Leon brought him back. Shade could make out some shapes in the dark but was pretty sure the gryphon would be blind to him, this gave him all the advantage he needed.<br>\r\n<br>\r\nAfter some time waiting he heard the expected sounds of a chase, the gryphon screeching and flapping it's wings, Leon yelling and running, he was almost there. Leon's steps started to echo and Shade knew he had entered the cave. Leon got closer and closer until he appeared around the bend where Shade was waiting. Leon knew the spot and stopped while the gryphon caught up with him. Leon backed up toward the corner of the bend while the gryphon came into sight of Shade.<br>\r\n<br>\r\nThat was the signal he was waiting for!<br>\r\n<br>\r\nLeon grinned suddenly and shouted \"Gotcha!\" to the gryphon.<br>\r\n<br>\r\nShade lunged forward and landed heavily on top of the gryphon, the low ceiling in the cave making it easier for Shade to hold him down. Shade proceeded just like last they met and engulfed the gryphon's head. Shade used his strength to hold the gryphon in place while he struggled and maneuvered him so that Shade could get to work on the rest of his body.<br>\r\n<br>\r\nThe gryphon's struggles were futile as Shade swallowed more and more of his body down his throat. Finally he was almost there, the gryphon's head had entered his stomach and started putting up a renewed fight just like last time. This time though, the gryphon wasn't getting out. As Shade swallowed down the remaining portion of the gryphon outside him he lay down on his side for comfort.<br>\r\n<br>\r\nLeon went around to Shade's front and put his hands to the bulge in Shade's throat and stomach, using his hands to feel out the shape of the gryphon inside. Slowly the rest of the gryphon slipped into Shade until just it's rear end and legs were poking out of Shade's mouth.<br>\r\n<br>\r\nLeon was hugging Shade's throat when he said \"Hey Shade, wait a little. I have a going-away present for our friend.\"<br>\r\n<br>\r\nThe gryphon had become too weak to struggle and just lay there mostly inside Shade. Shade slowed his swallowing and gave Leon some space to work. Leon went straight to the gryphon's sheath and massaged it, trying to coax him into arousal. Before long the gryphon was fully hard and Leon was jerking away at him. It didn't take long before the gryphon reached his orgasm and spurted seed all over Shade's mouth and Leon. When the gryphon finished spurting, Leon walked over to Shade's stomach and patted it saying \"Sleep tight\".<br>\r\n<br>\r\nShade then resumed swallowing down the rest of the gryphon until it was all sitting in his belly, making a protruding bulge in his abdomen. Shade lay down and licked his jaw clean of the gryphon's seed while Leon climbed on top of Shade's bulging stomach.<br>\r\n<br>\r\n\"Look at you, you're as fat as Rune now.\" Leon said to Shade while grinning widely.<br>\r\n<br>\r\nShade retorted \"Not quite, just one human-sized morsel left to reach that goal\" just as he started licking Leon clean from the gryphon.<br>\r\n<br>\r\n\"Haha, I've already been down that road before.\" Leon pouted as he wrestled with the tongue licking him clean.<br>\r\n<br>\r\nWhen Leon was all clean they both lay down for short nap.<br>\r\n<br>\r\nLater on...<br>\r\n</span></div></div>",
            "created":1284162000,
            "id":953967,
            "title":"Leon makes it into the cave and the gryphon fol..."
        },
        "13222221212":{
            "author_id":"warband2",
            "author_name":"dragon",
            "content":"<div class=\"\"><div> <span>shade disides to go back to his nest before checking on leon. by the time shade gets back to the nest he relizes that leon is asleep in his stomach and being digested, but do to the action of the day shade disides to go to bed for in his mind he still got his meal even though It was his rider. </span></div></div>",
            "created":1273640400,
            "id":882302,
            "title":"Go back to the safety of the nest before checki..."
        },
        "1322222122":{
            "author_id":"blueberryjoe",
            "author_name":"Grater",
            "choices":[
                "Let the gryphon up and try to convince it.",
                "Pleasure the gryphon. Or is it rape?"
            ],
            "content":"<div class=\"\"><div> <span>Well, the gryphon STILL isn't giving up. Although rather than continuing to eat it, perhaps you have a few other options. You could let it up and try and convince it to let Leon up, now that it's feathers are so wet it can't escape. Or maybe some pleasure providing or degradation are in order?</span></div></div>",
            "created":1269320400,
            "id":855391,
            "title":"The gryphon doesn't give up still"
        },
        "13222221222":{
            "author_id":"blueberryjoe",
            "author_name":"Grater",
            "choices":[
                "It's a girl! Enjoyment for both?",
                "It's a boy! Well, either he's gettin it up the butt, or..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Well\"\" thinks Shade, \"let's try something more fun. Although I guess I should check this gryphon's gender out, first.\" So shade feels around a bit with his forelegs and finds...</span></div></span></div>",
            "created":1269320400,
            "id":855393,
            "title":"Pleasure the gryphon. Or is it rape?"
        },
        "132222212221":{
            "author_id":"blueberryjoe",
            "author_name":"Grater",
            "choices":[
                "Well, why not giver her what she wants? Perhaps she'll be more amenable after.",
                "She's eaten Leon! She won't be getting any pleasure out of this."
            ],
            "content":"<div class=\"\"><div> <span>One of Shade's foreclaws slips into a damp cavity, getting an instantaneous reaction out of the gryphon.<br>\r\n\"Well, it looks like we have a female here!\" Shade thinks, \"and I'd almost say... she's in heat?\" Meanwhile the gryphon is continuing her squirming, Shade having yet to remove his finger. Shade realizes this, and pulls his foreclaw out, and the gryphon relaxes, but she almost seems, well, dissapointed.<br>\r\n\"Hrm...now which route do I go,\" Shade ponders. </span></div></div>",
            "created":1286348400,
            "id":969873,
            "title":"It's a girl! Enjoyment for both?"
        },
        "132222212222":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "The ball twisting was enough, the gryphon concedes his prey.",
                "The gryphon isn't going to give up that easily, Shade will have to try harder."
            ],
            "content":"<div class=\"\"><div> <span>Shade felt around in the rear end of the gryphon and came across unmistakable evidence for it's maleness, a set a squishy, hairy balls and a sheath extending up along the gryphon's belly.<br>\r\n<br>\r\n\"What luck! Males are easy to coerce when I can just grab them by the balls!\" Shade thought of his discovery.<br>\r\n<br>\r\nShade grabbed hold of the balls and started to pull at them, with immediate results. The gryphon, apparently catching on to what Shade was up to, started fidgeting and twisting to avoid Shade's grasp on his sensitive sack.<br>\r\n<br>\r\n\"It's working! Time to get down to business\" Shade thought.<br>\r\n<br>\r\nShade increased his grip on the gryphon's balls but instead of pulling, he now twisted, slowly but surely. The expected cries of pain came from within him while he continued to twist.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1272258000,
            "id":873562,
            "title":"It's a boy! Well, either he's gettin it..."
        },
        "1322222122222":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "The gryphon can't take this again, it gives up Leon",
                "The gryphon does not respond and simply takes it"
            ],
            "content":"<div class=\"\"><div> <span>The gryphon's cries of pain were plain to be heard while Shade twisted and pulled at it's ball sack, but a little pain wasn't going to part this gryphon from it's meal.<br>\r\n<br>\r\nShade clearly had to try something different, so he started feeling up further from the ball sack and managed to grab at the gryphon's tail. Maneuvering so that he could reach further back, Shade poked a claw beneath the gryphon's tail. He had found the gryphon's tail hole. Shade had anticipated this and was already fully erect, ready to go. He slowly craned his neck down, bringing the gryphon along with it and aimed the gryphon at his erect member. He needed to move around a bit until it hit the right spot, he was poking his dick at the entrance to the gryphon's hole.<br>\r\n<br>\r\n\"I need make sure the gryphon does not like this\" he thought.<br>\r\n<br>\r\nHe quickly thrust into the gryphon eliciting a loud yelp, followed by a wail from inside him. He rapidly thrust in and out of the gryphon trying desperately to let it know exactly what he was capable of. This went on for some time before Shade started thrusting even more rapidly and finally released his seed inside the gryphon. Shade slipped out rested to regain strength.<br>\r\n<br>\r\nThe gryphon had quieted during the onslaught and was only twitching near the end when Shade reached his climax. That is, until Shade poked his once-again erect dick at the gryphon's hole. </span></div></div>",
            "created":1272258000,
            "id":873571,
            "title":"The gryphon isn't going to give up that easily"
        },
        "13222221222222":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "Swallow the gryphon and digest it",
                "Try something else"
            ],
            "content":"<div class=\"\"><div> <span>Try as Shade might, he was unable to coerce the gryphon into giving up Leon with his rear assault. Unless he could think of something else he was left with a risky option, trying to digest the gryphon and free Leon. Sitting there, he considered his options, he could swallow the gryphon down and try to free Leon by digesting only the gryphon, but would he have enough time? He tried to think of another option, to somehow get to Leon and get him out. He supposed he could try to knock the gryphon out and try reach in...?<br>\r\n<br>\r\n\"Surely that can't work\" he thought to himself.<br>\r\n<br>\r\nWhat does Shade do?</span></div></div>",
            "created":1281605580,
            "id":934757,
            "title":"The gryphon does not respond and simply takes it"
        },
        "132222212222221":{
            "author_id":"culex",
            "author_name":"Cule",
            "choices":[
                "It works! Leon is still there!",
                "The plan failed..."
            ],
            "content":"<div class=\"\"><div> <span>Shade decides that the best option to free Leon through digestion.<br>\r\n<br>\r\nHe cranes his neck up and dislodges himself from the gryphon's rear. The gryphon seems to relax slightly, no longer being violated, that is until Shade starts his swallowing motions again. This time however, the struggling of the gryphon won't help it. Shade slowly slides the remaining portion of the gryphon's body into his maw, down his throat and into his stomach. When he finally has the whole gryphon in his stomach, it bulges profusely like it would from several of the largest fish he could catch.<br>\r\n<br>\r\nShade moved himself out of the open and into some cover to sit and wait for his meal to digest. He lay on his side and rubbed his bulging belly that moved every so often from the gryphon shifting around and trying to struggle.<br>\r\n<br>\r\nShade fought the urge to sleep with this gigantic meal in anticipation of saving Leon.<br>\r\n<br>\r\nDoes the plan work?</span></div></div>",
            "created":1281606420,
            "id":934765,
            "title":"Swallow the gryphon and digest it"
        },
        "1322222122222211":{
            "author_id":"hiryu",
            "author_name":"Megaman Dragon",
            "choices":[
                "\"Let me out first, then go home.\"",
                "\"Let's hed home.\""
            ],
            "content":"<div class=\"\"><div> <span>The next day Shade decided to try and connect with Leon somehow.<br>\r\n<br>\r\nHow can I reach him? He thought. Then it hit him, Heart Bond. He and Leon remembered one of their lessons about that. Summing up his mental strength he said, \"Leon, Can you hear me?\"<br>\r\n<br>\r\nNo response.<br>\r\n<br>\r\n\"LEON!!!\"<br>\r\n<br>\r\n\"You don't have to yell, Shade\", Leon replied.<br>\r\n<br>\r\nShade sighed, \"I was worried that you were dead.\"<br>\r\n<br>\r\n\"Ah well, at least it is a good thing I was wearing my dragon armour made from your shaved scales.\" Leon chuckled.<br>\r\n<br>\r\nShade found himself dumbstruck at the very idea. \"Well let's get back home or do you want me to let you out?\"<br>\r\n<br>\r\nLeon considered then said,</span></div></div>",
            "created":1360533720,
            "id":1529277,
            "title":"Saved by the Armour"
        },
        "133":{
            "author_id":"ningishzida",
            "author_name":"Draconic Chronicler",
            "choices":[
                "Leon takes up Shade's offer with the next whore.",
                "Leon just wants to watch Shade eat the rest of the whores in the Inn. ",
                "Shocked, Leon leaps off Shade's back and tries to get help. "
            ],
            "content":"<div class=\"\"><div> <span>The huge dragon eyed the ham-sized chunk of meat with disdain.  \"Are you kidding me boy?  That tiny mouthful is hardly worth the swallow.  But I hunger for a real meal, and if you are not so squeamish, you may go hunting with me.\"<br>\r\n<br>\r\nSecretly, Leon like nothing better in the whole world that to watch his huge companion capture and devour its prey, in the \"dragon way\", which usually meant swallowing smaller animals whole and alive.  He was embarrassed about this fetish however, and did not want anyone else to know how much pleasure Shade's feeding brought him.<br>\r\n<br>\r\nNot wanting the dragon to see how excited this prospect was to him, Leon shrugged, and said, \"Sure, Shade, I'll come with you if you like\".<br>\r\n<br>\r\nShade grinned.  Like most dragonriders, Leon  was unaware of his dragon's ability to read his rider's mind.  Shade  knew of Leon's secret, vorish fantasies, and he decided to use this knowledge best to his advantage.  He pressed his body low to the ground to allow Leon to mount on his back, just at the base of his neck.<br>\r\n<br>\r\nOne he felt Leon securely wedged between two dorsal spines, Shade playfully commanded, \"Hold on tight\", and lept into the sky.<br>\r\n<br>\r\nThe two headed north towards the great valley where the Weyr's herd beasts that made up the bulk of the domestic dragon's diet dwelled,  in plain view of many dragons and riders commencing the morning routine.  Curiously though, once out of sight, Shade dipped low beneath the tree line, and circled back, unseen, south.  In a short tie they came to a stone inn, that was known to dragonriders for its stable of whores.<br>\r\n<br>\r\nShade carefully landed on a huge stone boulder next to the inn, careful to leave now tracks, and promptly stuck his head in one of the inns upper bedroom windows. <br>\r\n<br>\r\nShocked, Leon implored, \"Stop,  Shade what are you doing?  A shrill scream was heard, as the huge silver dragon pulled his head back out with a pair of wildly writhing female legs in its mouth.  His head made a quick jerk forward, and the struggling woman disappeared down Shades rippling, muscular gullet, her screams faintly discernable through the thick dragonhide.<br>\r\n<br>\r\nThe dragon slyly craned his head back to face Leon at uncomfortably close range, and said in a completely nonchanlant tone, \"What am I doing?  Silly boy, I am eating the only prey fit for a noble Silver dragon, besides overly nosy and immature dragon riders, that is.  And I know you won't tell, for if I am banished to the wilderness for breaking the dragon-human covenant, YOU will no longer be a dragonrider.<br>\r\n<br>\r\nThen Shade gave a toothy dragon grin, and shot his long forked tongue into Leon's crouch, were it touched a hard knot of muscle.  The dragon whispered, \"Do what I say and we'll never get caught.  Besides, I know you love this, Leon.  Now, how would you like to make love to the next whore inside my mouth, before I swallow her?   Hmmmmmmmmmmmmm?\"<br>\r\n<br>\r\n </span></div></div>",
            "created":1204261200,
            "id":504373,
            "title":"Shade takes Leon on his morning hunt."
        },
        "14":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "They make it back",
                "Night falls sooner",
                "Something catches their attention"
            ],
            "content":"<div class=\"\"><div> <span>Rune yawned as she laied on her bedding of grass, twigs a pile of leaves and anything else nature gave her to use for a nice and somewhat comffe bed. The brozen dragon sighed softly lookwing over at her owner that checked there items they had found took or even traded with. They were dragon rider's but the kind to chose to take on any work taht coems there way or even head on to some old runes to hord the stuff. <br>\r\n<br>\r\nRune was about 53 feet long from head to tail tip but she was a very fat dragon from all the enemies she had gone out of her way to eat and devour to fill her bottomless gut, still she was very healthy and when she ran, fly or something she can handle it like any other dragon could.<br>\r\n<br>\r\nA deep sigh can from her muzzle when Alia walked over to her friend with a crown and cane they had gotten from a old rune they had ran in too. \"what do you think? does it suit me?\" she asked. The dragon smirked reaching a claw over to knock the crown over. \"Only if you had some land and people to follow.... but who in the world would follow a whinny human\" she smirked. Alia glared at her. \"ha ha ... funny you over sized dragon....\"<br>\r\n<br>\r\n\"thank you thank you, I made this fat myself\" Rune joked. Alia giggled softly.\"anyway Rune we better take our stuff back to the village before night fall\" she said as it was close to sunset. \"oh come on your just worried...\" the dragon go up on all fours. \"you will get eaten by a frog when we were asleep like last time\" Joked the dragon. \"yeah and what fun it was to be stuck in that stomach\" she huffed gathering there stuff togather and mounted her partner. \"alright lets go\"</span></div></div>",
            "created":1207198800,
            "id":515737,
            "title":"Rune, Alia's partner"
        },
        "141":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Shade has been flirting with her too!",
                "Shade is completely oblivious. He can never tell he's being flirted with!",
                "Shade is... less than thrilled, but she believes she'll win him over eventually"
            ],
            "content":"<div class=\"\"><div> <span>Rune lands outside caves of the dragon stables where she and Alia live. Her rider hops down off her back and starts to carry away the loot from the ruin to go and sell it.<br>\r\n<br>\r\n\"Don't forget... you promised to give me a belly rub tomorrow.\" Rune chuckles making her fat gut jiggle.<br>\r\n<br>\r\n\"Do I have to? You're so fat that it takes forever to do.\" Alia jokes.<br>\r\n<br>\r\nRune smiles, she knows that her partner doesn't really mind. The magic process that binds a dragon and a dragonrider together makes them share emotions a little. When one of them is happy the other is happy. So Alia doesn't mind pampering her with a belly rub.<br>\r\n<br>\r\n\"Sorry, but a promise is a promise.\" Rune giggles.<br>\r\n<br>\r\nAlia grumbles as she walks away. Rune watches her leave and chuckles. Rune's mental bond with Alia has caused some of the dragon's habits to rub off on the human. Specifically, over eating. Alia hasn't realized it yet but Rune can tell that the human is starting to get just a little pudgy. Rune doesn't mind though. In fact she thinks that her skinny rider will be much better off with some flab on her, because it would make it a little harder for monsters to swallow her.<br>\r\n<br>\r\nRune turns her attention to the caves of the dragon stables as she thinks for a moment. She could go to her cave and get some sleep. Nah, that would be boring. She'll pay Shade a visit instead.<br>\r\n<br>\r\nShe's had her eye on that sexy silver dragon for awhile now and has flirted with him every chance she gets.</span></div></div>",
            "created":1207458000,
            "id":516664,
            "title":"They make it back"
        },
        "1412":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "The two meet with the riders",
                "The two meet without the riders",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Rune walked around in the dragon stables looking a certain silver dragon's cave. She has been flirting with him for a while but now he just didnt seem too notice her efforts in her flirts, that or he is just a bit native on romance, she couldnt blame him cause he only hangs out with his rider most of the time and the two do rub off one another. <br>\r\n<br>\r\nNone the less she walked towards the cave and had a peak inside, twitching her tail abck and forth happily. \"mmm .. well helllloooo tall dark and sexy\" she cooed walking over to the Silver dragon, seeing him munching on some freash meat his rider got him. \"Hm?\" Shade looked up to see Rune walking too him. \"oh\" he gulped what was in his mouth and gave a toothy grin. \"hello Rune what brings you here?\"<br>\r\n<br>\r\nThe bronze dragon murred swaying her body back and forth. \"oh noting... just came back from a hunt and so my rider is taking some loot back... but nothing else\" she said giving off a sexy coo but whinced when Shade turned away like nothing. \"oh thats good well you and *gulp* Alia make a good team\" he said munching his food. Rune lended in and smiled tot he silver. \"Say Shade.. how about you and me go for a flight.. huh? go too the lagoon and fly udner the moonlight?\"<br>\r\n<br>\r\nShade looekd to her and smiled. \"really? that sounds great!\"<br>\r\n<br>\r\n\"Really?!\" Rune said in excitment, thinking this was it, her and Shade where going on a dragon date. Shade nod his head but then said. \"yeah! I'll ask leon if he wants to come!, dont forget to ask Alia too Rune. oh man .. I better go tell him now!\" he said running off. Shocked and shot down for just an alone date Rune stood there with her ehad ahnging. \"damn... he just soo native....\"</span></div></div>",
            "created":1207630800,
            "id":517562,
            "title":"A failed flirt"
        },
        "1413":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Rune corners Shade in his cave",
                "Rune discovers that Shade is asleep",
                "She discovers that Shade's unconscious and his rider is being eaten by a monster"
            ],
            "content":"<div class=\"\"><div> <span>Shade has been... less than thrilled by her advances (Rune IS the fattest dragon in the dragon stables after all). Although, \"less than thrilled\" is a bit of an understatement. A better description would be \"horrified and disgusted.\"<br>\r\n<br>\r\nShade is too polite to say anything, but Rune has seen the way he tends to look around for the nearest escape route whenever he sees her approaching. She feels a little hurt and sad when she sees that, but she's confident that she'll win him over eventually.<br>\r\n<br>\r\nRune hums to herself as she moves her large fat dragon bulk towards Shade's cave.</span></div></div>",
            "created":1207458000,
            "id":516677,
            "title":"Shade is... less than thrilled"
        },
        "142":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Cant find Alia",
                "Finds Alia buried under some firewood",
                "Gets tangled up by a plant"
            ],
            "content":"<div class=\"\"><div> <span>Rune had taken her time in flying home as they had time to chat and make little detours for some flowers or munches, But half way of getting home the sun was almost gone from the sky. Alia had taken noticed of this and looked back to see what little light they had. <br>\r\n<br>\r\n\"Oh no...\" she spoke. Rune sighed softly. \"lemme guess... we wont make it back?\" she asked looking back at her. The female rider nod her head. \"yeah ... we might as well make camp until day break\" she spoke. \"well.. I chose where we sleep I heard from other dragons that it's not to be in this part of the woods... too many dragons and riders get lost and eaten here... or worst\" she said. \"a fate worst then death?\" Rune just nod her head. \"yes.... Starvation!\" she cried. The rider couldn't help but giggle. \"oh come on .. I'm sure you can catch your own food\" she smiled but the dragon looked unamused. \"Right! and that is the time when pigs fly\"<br>\r\n<br>\r\nThe brozen dragon fly down to the forest and circle around, looking for a cliff or a cave they can settle in and quickly cause at night she cant see all too well. Soon her wish was answer as she flew down and landed in a nice and steep cave side. \"hmm .. big, dark... just like home\" she smiled. Alia jumped off her partner and smiled. \"alright. well you can get our beds ready, I'm gonna go see if I can gather wood\" she said. Rune smirked. \"Careful now\" she said bumping her with her tail.<br>\r\n<br>\r\nAlia smirked sticking her tongue at the dragon before climbing down. Now the fat dragon was alone to make herself a nice soft bed of dead leaves or grass that was in here, still she couldnt help but feel like they were being watched. Shacking the feeling she went back to getting everything ready. <br>\r\n<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\n<br>\r\nAs the time passed and the dragon blowing small puffs of flame out her muzzle, she waited for her owner to come back. She grew more worried as the sun had set and night had settle on the forest, letting the wilderness take on it's true colors. Her eyes had adjucted t mstshape of the forest, moving around on the hunt, some even hiding in the shadows where it was safest. <br>\r\n<br>\r\nRune, no longer waiting for her partner to return from the little wood gathering. The brozen dragon got up and walked out the cave, down the steep hill. She slowly lowered herself down the side, making sure that she wont slip and fall the rest of the way. Last she needs is a broken leg or wing to reindeer her abilities useless when she needed to escape with her rider. Now she was on the forest floor, she went looking for her rider. \"hope she's ok...\" she muttered to herself</span></div></div>",
            "created":1216184400,
            "id":558598,
            "title":"Things that go bump in the night"
        },
        "1423":{
            "author_id":"wolfysky",
            "author_name":"Wolfy",
            "choices":[
                "Wiggles hard enought to get free",
                "Slowly pulled back to the hungry plant",
                "Alia appers and saves her"
            ],
            "content":"<div class=\"\"><div> <span>Rune roamed around the forest squinting her eyes as she tried to see ahead threw the dark forest. \"hmm .. where is she\" she spoke walking around , stepping on leaves, small mammals by accident and some planets like these weird thing vines that just laid on the ground. The dragon took a double step at the weird vines that didnt crush under her. she looked down at the vines and blinked. \"huh .. like stone\" she said.<br>\r\n<br>\r\nWalking away she didnt noticed this man eater plant waking up from a nice nap had it recently eaten something, still alive and wiggling. the plant spotted a new and larger victim that just seem so much more filling then the one in it's plant gut now. <br>\r\n<br>\r\nThe vines that were stepped on rose to life, lifting off the ground and snaked there way to the dragon silently. She was big and nummy looking fat, but the plant worried more about it's flames then it's size and claws. The thing had some knowledge but it's was for hunting either way.<br>\r\n<br>\r\nRune kept walking alone till suddenly she lets out a yelp being grabbed grabbed by something hard and tightening. \"wha-what?!\" she yelled then growled as her muzzle was wrapped as well, losing her will to speak and breath her flames. &lt;Ah! What is this?!&gt; She thought, feeling those vines ensnare around her legs body and tail and more on her muzzle. The dragon kept wiggling and fighting the plant, digging her claws in the dirt as it tried to bring her backwards to where it was hiding.</span></div></div>",
            "created":1216184400,
            "id":556685,
            "title":"Anyone who has a weed waker on them?"
        }
    },
    "info":{
        "author_id":"wolfysky",
        "author_name":"Wolfy",
        "brief_description":"A vore story about dragonriders' and their dragon",
        "created":1203899100,
        "description":"<td align=\"left\" class=\"norm\">You can go by either Leon the male dragonrider with his silver dragon; Shade or maybe Alia and her bronze dragon; Rune. You may even take the role of there dragons as well. Its the life of a dragonrider/or/dragon, taking missions, hanging out or even saving the life of yours or others. Be careful, in this world, humans are a rare delight to have. Don't stray too far from your partner now or you might end up as nothing more then food for any creature that has a hungry belly.<br>\r\n<br>\r\nPlease at lest try keep the two partners together threw the story. Add pretty much what you would like, but anything off topic or chapters will be deleted. A paragraph or more will be fine but if it has a one line or less, will be deleted.<br>\r\n<br>\r\nAlmost anything is allowed but;<br>\r\n1. No blood gushing scenes, like people ripping others in half.<br>\r\n2. No racial slurs or anything too offensive.<br>\r\n3. No killing of the character by stomping or ripping into pieces.<br>\r\n4. No scat, please.<br>\r\n5: Dont be rough on sexual moments.<br>\r\n<br>\r\nAnd Please add a chapter or this will seriously get boring<br>\r\n<br>\r\nThank you very much and enjoy</td>",
        "id":1392686,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1414833360,
        "modified":1414833360,
        "pretty_title":"The Dragonriders"
    }
}