{
    "chapters":{
        "1":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Human",
                "Weybren"
            ],
            "content":"<div class=\"\"><div> <span>It was a quiet, Peacful day in the Village of Kealso. Children were playing and laughing, Adults chatting in the native tounge, which sounded remarkablly like english. All was well. Until...<br>\r\n<br>\r\n\"Don't be such a Coward, Diane.\" Diane's Younger sister spoke as she and her 3 friends wandered through the woods. \"Everyone knows that stupid Weybren story is just a legend made to scare little kids into being good.\"<br>\r\n<br>\r\nDiane glared at her sister, Illea. \"Oh Shut up, I know that. It's snakes and other creatures I'm worried about.\" She looked around, and smiled at her lover, Keane. Keane was following close behind her, followed by Deeke. They were all in their teens and very well built, save for Illea's hight, being only 5'1.<br>\r\n<br>\r\nNow, Before the Story conteuies Are you...<br>\r\n</span></div></div>",
            "created":1120539600,
            "id":259728,
            "title":"It's not just a legend"
        },
        "11":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Diane",
                "Keane",
                "Illea",
                "Deeke"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah, So your one of our 4 heroes? Which one?</span></div></span></div>",
            "created":1120539600,
            "id":259729,
            "title":"A Human Sna...err..Hero"
        },
        "111":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "A rabbit",
                "THE WEYBREN!!! RUN!!"
            ],
            "content":"<div class=\"\"><div> <span>Of Course, your Diane, Eldest of the group and the most attractive female in your tribe. You have long black hair and wear only a very teasing Bra and a pair of panties, the bra barly covers your breasts, which rival your sisters.<br>\r\n<br>\r\n<br>\r\nA twig snaps near by and you jerk to see what the noise was. Your bratty little sister laughs. \"God, Diane, your so lame. Anythign scare you doesn't it?\"<br>\r\n<br>\r\nYou ignore your sister and head towards the source of the sound.<br>\r\n<br>\r\nWhat was it?</span></div></div>",
            "created":1120539600,
            "id":259736,
            "title":"Diane's Story"
        },
        "1111":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Keane Saves you",
                "Your snake Chow"
            ],
            "content":"<div class=\"\"><div> <span>you sigh in relif as a bunny hops out of the woods and past your feet.\"See?\" Your snotty little sister smirks. \"Told you there's no Weybren.\" You smirk back at her when you notice all their eyes go wide. \"What, What is it?\" Keane looks at you and moves slowly towards you. \"Baby, don't move.\" \"Why?\" You than hear a faint hissing sound. You slowly turn around and come face to face with an Enormous Python. You start to Whimper. \"Keane..Help.\" You say in a Whisper. \"Plz...\" The Python beginns to coil around you...</span></div></div>",
            "created":1120626000,
            "id":259840,
            "title":"A harmless Bunny..And his Friend"
        },
        "11111":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Later that night"
            ],
            "content":"<div class=\"\"><div> <span>Keane rushes to your side and begins to pull on the snake, it hisses and snaps at him, bu with Keane's strength he easilly gets the snake off you.You hold him panting as the pissed snake slithers away, another meal escaping it's grasp.<br>\r\nYou look into Keane's eyes and the two of you exchange a passionate kiss. He smiles. \"Come on, let's get out of here.\" \"Well, That was close.\" Deeke said laughing. You glared at him, still a little shaken by the fact you could have died.<br>\r\n</span></div></div>",
            "created":1120626000,
            "id":259958,
            "title":"My Hero"
        },
        "111111":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "\"YEs! Yes Keane I thought You'd Never ask!\"",
                "\"Keane...I can't..\""
            ],
            "content":"<div class=\"\"><div> <span>In the hut you two share you and Keane lay in a single hammock, naked in eachothers arms,covered only by a blanket,both of you satisfied after having sex with one another.You coo softly as you rub hius chest and smile. \"Thanks for saving me today, babe.\" you kiss him softly. He smiles and responds with a laugh. \"It was nothing, You know that, I'm always saving your cute tush from all sorts of danger.\" \"Hmm well maybe that's what I like most about you, a big strong man to take care of me..\" You tease him. He than seems to get serious. \"Diane, I've been thinking...How would...\" HE seems to pause. \"How would I what, Lover?\" You look curiously at him. \"How would you like to be...My tribesmate.\" You can't belive your ears, Tribesmate? As in...His forever?<br>\r\n<br>\r\n</span></div></div>",
            "created":1120712400,
            "id":260012,
            "title":"A proposal"
        },
        "1111111":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Keane Is The Weybren And Your His Mate!",
                "Keane Is The Weybren And Your His Lunch!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A few weeks later you are finally married to Keane. and now it's the honeymoon. Every thing was going great until you discover that...</span></div></span></div>",
            "created":1122526800,
            "id":264045,
            "title":"You Marry Keane"
        },
        "11111111":{
            "author_id":"cliona",
            "author_name":"Cliona",
            "choices":[
                "I screamed and started to run",
                "I stood there dumpfound"
            ],
            "content":"<div class=\"\"><div> <span>We came to the hut after the celebrations were over. Keane looked at me with a weird smile on his face asking me to have a walk with him. <br>\r\n<br>\r\nI smiled back and walked with him holding his hands and he slowly held me closer.<br>\r\nHe kissed my lips and I felt his grip so strong unable to resist. I felt him removing my bra off and caressing my breasts. Then his left hand went down to find the precious gem while suddenly his hands became hairy. I opened my eyes to face Weybren having an intimate time with me.</span></div></div>",
            "created":1203483600,
            "id":500289,
            "title":"Keane Is The Weybren And Your His Mate!"
        },
        "1111112":{
            "choices":[
                "your father finds you first....",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>\"Keane....I can't....and you know why...right?\" you say as he looks chest fallen at you. He gets up off the hammock anger in his eyes as he glares at you....<br>\r\n\"So this was all a chararde?...you just giving me sex for saving your sorry ass?\" he growls at you, his anger washing over your fearful body. You stand up, your breasts jiggling, the nipples sticking out as strawberries, which makes you rub your fingers over the super sensitive nubs. You also feel your clitoris grow harder then ever, and you feel very giddy as you stand there masturbating your now sliming, flooding cunny for no apparent reason.<br>\r\n\"Well?\" Keane states as he approaches your non-answering body, while you are now in an uncontrolled-by-you act....your mind feeling a high of ultimate proportions, you marveling on how or why you have never felt this way before....You even forget Keane is right by you as you stand there, masturbating your creaming sex hole, rubbing your pulsating clitoris, and feeling up your aching, throbbing tittys.<br>\r\nKeane just stands there...then as you are now totally pre-occupied with his aphrodisiac euphoria that he induced onto you he scoops you up into his arms...spreads your legs wide, and slams his thick, long, Weybren's cock into your sliming, sloppy pussy. You just scream out.....<br>\r\n\"OOOOOOOOOO.....YYYEEEEEESSSSSSS!!!!! FUCK ME!\" at the top of your horse voice,...while you hold to his sides. He deeply kisses you, the Weybren with Keane doing things to you now...and the many tentacles that spring up all around you only heightens your arousals,...and your drugged induced mind sees them as the many appendages of Keane's love for you....In an hour or so....you have come so many times, as had Keane... or who you thought was Keane.....you are left laying in the hammock, your slimed filled womb bulging from the many couplings...that you and Keane had. As he was leaving you, with a goofy, smiling look on your drugged induced face he said....<br>\r\n\"I will be back tonight, to do you again,.....you are mine, Nina!\" and he kissed you with the promise of more to come. You could only nod off to sleep, dreaming of Keane and his wonderful, fulfilling cock in your tight-fitting, sensitive pussy.......<br>\r\n<br>\r\nwhat next????</span></div></div>",
            "created":1203483600,
            "id":500348,
            "title":"\"Keane...I can't..\""
        },
        "11111121":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "meet your friends. "
            ],
            "content":"<div class=\"\"><div> <span>you are shaken awake by your father\"  diane wake up\". you slowly wake up and look at your father. he was tall about 30 and was wearing a chieftain robe. \" what is it?\" you asked. ' my daughter my sweet loving l daughter.\" your father said and hugged you.  \" i have been elected village cheif.\" you smiled. ' you mean grandfather is dead?' your father nodded. \" yes and my first order as chief is to send one of the maidens out to be eaten by The Weybren.\" you looked shocked. you remembered the traditional reitual was to feed someone to  The Weybren but it had died out 300 years ago. \" lllea is to be eaten as she is the youngest.\" your father said. \" no not her why are you doing this we never had to before.\" you screamed. \" diane calm down we have tried everything to stop this thing now you and your friends must go to his lair and feed llea to it and mabey it will stop attacking us.\" your father said and he left the room.  you got dressed and sighed as you went outside. </span></div></div>",
            "created":1302168900,
            "id":1083541,
            "title":"your father finds you first...."
        },
        "111111211":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "they agree ",
                "they have a duel "
            ],
            "content":"<div class=\"\"><div> <span>you walked up and there was llea in your mother's old dress. ' oh hey there diane don't i look sweet.\" she said and you sighed. ' you do know your getting eaten right?' you said and llea giggled. ' no beacuse keane is gonna kill that monster right.' keane was sitting by a tree and he was not happy. he was still mad about you not marrying him. \" whatever you say.\" \" i'm sorry ok.\" you say and keane sighed.' tell someone who cares we are through only reason i'm here is beacuse no one else wanted to.\" you stomped your foot. \" what about the sex we had?' you asked and keane looked at you. \" thats all you care about diane sex not love or anything.' deeke came and you both stared in disbelif. he was wearing the same stuff warriors wear and had the same sword keane was holding. ' what the hell is this?' keane said. \" i will protect llea from that evil Weybren\" he said waveing his sword. ' you never used a sword in your life.\" keane said.\" you will teach me.' dekke said pointing at keane.' you can't leave swordsmen ship in 3 days.\" you laughed and llea laughed to. you  \" ok now before i get interrupted again.\" keane said. ' i'm in charge of this venture you do what i say diane will not be our leader today.\" you say down in fury. \" ok first things frist the monster is in a cave about 3 days away and we need to get lea there.\" keane said pointing at llea in her gown. \" yep i'm the princess who will be bait so keane can kill the monster and save the villdge.\" deeke looked at her. \" no i'm gonna save you from that evil monster or die trying.\" keane looked at deeke.\" you are not a warrior take that stuff off or your not comeing with us.' deeke looked at keane.\" i love llea and i don't want her to be eaten whole.\" this was getting out of hand and you were loseing daylight. ' ok guys i know your mad at me ekane but hear me out why don't you both be warriors.\" deeke and keane looked at you. </span></div></div>",
            "created":1302169500,
            "id":1083543,
            "title":"meet your friends. "
        },
        "1111112112":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "right ",
                "left "
            ],
            "content":"<div class=\"\"><div> <span>\" no diane this boy is never going to be my equal.\" keane said and stabbed deeke in the chest.\" ow hey oh god i'm loseing blood.' deeke said  llea ran to him. ' why did you do that for?\" keane just smirk. \" if deeke wants to be a warrior so bad he should have dodged it.' he said and you looked at the stab wound. ' keane he is not going to last out here.\" keane said nothing and looked at deeke with fire in his eyes. the same fire he had when he wanted to fight. \" grab your sword deeke if you want to protect  llea you have to fight me in a duel.\" deeke tried to get up but his wound was to much. ' i can't get up.' he said but keane just sabbed deeke again and deeke fell to the ground dead.  llea looked at keane with fire in her eyes. ' you monster how could you do that to him.' you knew keane had a temper but not like this mabey you should have married him. \" leave him some wolf will eat him. llea looked at keane but you stopped her. ' no we have to move on.\" you said as you both got up. ' but deeke.' you sighed and looked at keane.\" at lest give him a proper send off.\" keane was to far ahead to care. you caught up to keane and saw a fork in the road. ' ok now the beasts  lair is suppose to be to the right path but the there is a short cut on the left path.' keane said. ' then we go right.' you said starting to walk right but keane looks at you. ' but there are more hungry women eating animals on that path. \" then we go left.\" llea said and again keane looks at you. ' there are less women eating animals there but it's a swamp.\" so whitch way. </span></div></div>",
            "created":1302169980,
            "id":1083544,
            "title":"one sided duel "
        },
        "11111121121":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "don't trust the frog ",
                "kiss him "
            ],
            "content":"<div class=\"\"><div> <span>you risk the fact you might get eaten and choose the right path. ' well it is faster.\" said keane as you all walk you look back at deeke's dead body.\" why did you kill him?\" you asked keane. ' beacuse he was an idiot trying to be a warrior.\" he said and you snort.' no your just mad i would not marry you and you never like deeke so that was your  escuse to kill him.\" keane ignored you the rest of the walk. the 3 of you entered a small pond and llea looked around. ' god it feels like we have been walking for hours.\" she said as she dipped her toes in the water. you sat down away from keane and llea thinking. ' mabey i should have said yes mabey i'm just being a.' your words were cut short as you heard rustles. ' hello little girl.' said a voice in the bush.  you saw a huge frog standing in font of you. it was bigger then any frogs you had seen before. ' hello.' you said and the frog looked at you. ' so are you lost my little fly/' the frog said looking at you.' um no i'm not and also i'm not a fly i'm a human.\" you said and the frog giggled. \"  i'm here to help you.' the frog said and looked at you. \" i see your haveing boy trouble well i' was turned into a frog by a witch and if you kiss me i'll turn back\" you looked at the frog and then at keane. you heard stories of princes turing into frogs and keane sure was not your Prince anymore. . </span></div></div>",
            "created":1302170760,
            "id":1083548,
            "title":"right "
        },
        "11112":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "content":"<div class=\"\"><div> <span>Before Keane can do anything the snake pulls you up into the trees. You hear his screams of frustration but know he can do nothing, you struggle as much as you can but it only makes the snake squeeze you tighter. Eventually you black out from the lack of oxegen...<br>\r\n<br>\r\nWhen you awaken you see nothing but black..YOu try to wiggle your toes and see that you can, you than move a bit and conclude that the snake has swallowed you up to your belly, which it is now tasting. You Listen and conclude again that your friends deserted you...leaving you to die. You struggle to get free, but You know better, you were taught as a little girl that once a Human-Eating Python swallows your head, your as good as dead.You relax after a bit and let it swallow you in more. After what feels like an eternity you feel it tasting your small, dainty feet and than finally you feel the sunlight closing off them forever. The snake swallows you whole and alive into it's stomach..than slithers away with your bulge in it's belly.<br>\r\n<br>\r\nIt takes days before it digests you and you finally expire...</span></div></div>",
            "created":1120626000,
            "id":259849,
            "title":"Diane Brand Quailty Snake Chow"
        },
        "1112":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "It catches you and Drags you into the woods",
                "You get away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look up at the lumbering beast in front of you and let out a scream. Your friends turn and see the source of your scream. Even Illea screams and all of you turn to run away. The creature proves to be very fast, but you can out run it....Right?</span></div></span></div>",
            "created":1120539600,
            "id":259741,
            "title":"The Weybren Attacks"
        },
        "11121":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Sorry, But your Monster chow",
                "Congrats, your it's new Mate"
            ],
            "content":"<div class=\"\"><div> <span>It grabs you by your hair and begins to drag you to it's den. You kick and scream and reach for your friends, but it's of no use. The monster has you now, your friends mourn you but keep running, knowing there's nothing you can do, Finnaly it stops in a cave. It sniffs you and licks you. It seems to like your taste...or maybe it's wanting something else</span></div></div>",
            "created":1120539600,
            "id":259743,
            "title":"Weybren Food?"
        },
        "111211":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "content":"<div class=\"\"><div> <span>It lifts you up to it's gaping mouth and all youc an do is kick and scream in it's arms. It's tounge lashes out and pulls you in, tasting every inch of your face and shoulders. It tears off yoru bra and panties in one swoop, leaving you nude and at it's mercy. Your struggles get weaker as it swallows your head into it's throat and focuses on tasting your breasts. You cry softly, knowing it's over. it swallows you again, pulling you in up to your belly, it's tounge moving cruelly on your pussy and ass, obviously enjoying your every flavor.It swallows again and only your feet remain outside, your long legs being tasted and drooled on all around. It finnaly pulls your small, cute feet in and gives them a somewhat soothing tounge bath(You always loved it when Keane licked your feet and toes), enjoying their rich flavor than swallows them to join the rest of you in it's buldging belly. You cry softly as conciousness slips you and you fall asleep, never to awake as the Weybren lays back to assit in your Digestion.</span></div></div>",
            "created":1120539600,
            "id":259753,
            "title":"Supper time for the Weybren"
        },
        "111212":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "\"I will Willingly carry your seed\"",
                "\"Screw This, I'm running like hell\""
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nIt finnaly Drops you from it's grip and you scamper away from it as fast as you can, but with it's tounge it flips your right back onto the ground next to it.<br>\r\nYou whimper, unsure of it's intentions with you, that is until you see it's growing member. You moan in disgust as HE moves towarsds you. \"Do not cry my pet.\" He speaks. \"I do not intend to kill you...yet...\" It snifs you and begins to remove your panties, but you swat it's hand away. \"Ah...A fighter I see, My dear, my cave is thousands of miles away, No one can hear you.Or save you for that matter. I have decided not to eat you, I'm sure yourr joyed to hear tat.\" You can only nodd, still scared. \"However, This is season in which my race breeds, Sadly there are no Females of my kind, only males. Do you know how we breed, young one?\" You shake your head, even though your getting the idea.  \"What is your name child?\" You look up at it and speak in a soft voice. \"Diane.\" \"Well Diane, I have chosen you to carry my seed, If you accept, the breeding proccess will be quick and painless for you and I will let you go afterwards. Decline however and I will rape you and force you to carry it, And than you will know a pain beyond pain.\"<br>\r\n<br>\r\nYou think and than look up at him and say...</span></div></div>",
            "created":1120626000,
            "id":259836,
            "title":"It's Monster Mating Season"
        },
        "1112121":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "It was no Dream"
            ],
            "content":"<div class=\"\"><div> <span>Seeing as how you want to get out of this alive and your not sure you want to know what he means by pain beyond pain, you agree and remove your clothing. You see a rock near by that looks like a bed and lay on it. \"Get this over with...\" You say, crying slightly. He moves over to you and enters you, It's only a little painful sense Keane already took your virgenity. But much to your suprise he doesn't move...He member seems to do all the work. Your soon suprised to see your enjoying this and moan softly allowing him to take you as his mate. He finishes and Leaves you lying there breathless. You feel his seed moving towards your womb. You close your eyes and drift to sleep.<br>\r\n<br>\r\nHours later you awake to see your fully clothed and back in the woods where you were captured. You get up and look around, than walk off towards home. Was it a Dream?</span></div></div>",
            "created":1120626000,
            "id":259837,
            "title":"Mating"
        },
        "11121211":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Red",
                "Blue"
            ],
            "content":"<div class=\"\"><div> <span>You walk slowly back home and enter your hut. Illea's eyes widen to see you still alive. She hugs you crying. \"I was so worried..I thought I'd lost you, Than I'd have nobody.\" You and Illea's mom passed away a long time ago,and your dad was eaten by the Weybren. you petted her Strawberry Blonde hair and shushed her. \"It's ok..&gt;I got away.\" I think, you think to your self, Was that a dream? Did he really mate with me...\"Go to sleep, Little sis.\" She looks at you quizzingly, than goes to her hammock to sleep<br>\r\n<br>\r\nYou look away from her and sneak out to the Witch Doctor's hut.She is suprised to see you of course, Keane, her grandson, having said you were dead. \"you explain your 'dream' to her and she tests you for pregnancy. \"Place a finger in the couldron before you, but know this before you do. If the Water should turn blue, than a baby is not true, but if it turns red, there's a baby ahead.\"<br>\r\n<br>\r\nYou place your finger in the cauldron and look at the water and gasp when it turns...</span></div></div>",
            "created":1120626000,
            "id":260055,
            "title":"Returning home"
        },
        "111212111":{
            "choices":[
                "1 Month",
                "9 Months"
            ],
            "content":"<div class=\"\"><div> <span>The water is red, it was true right now you carry The Weybren's young. A tear rolls down your eyes, the witch doctor comforts you. \"I am sorry my dear, but you carry it's child\" she places a gentle arm on your shouldor. \"Then you must be prepared, when you are nearing birth, you MUST go to the forrest, and he will take you back to the cave, where you will give birth\" you lean over and cry deeply into her arm. After several minutes you look into her eyes they are so like Keane's. \"What happens if I don't?\" you ask still with a sign of defiance in you. <br>\r\n<br>\r\n\"He will hunt you down and destroy the village\" she says with a undertone of understanding. \"How will he know where I am, and when I am due?\" the witch doctor has this answer too. \"He can smell your scent from miles away\" \"How do you know all this?\" this question has been boggling you for many minutes. \"I too was raped by the last Weybren the one that raped you is my son, every carrier of a Weybren's seed becomes a witch doctor to guide those ones who don't know\" after this you return back to Lllea and get back in the bed with her.</span></div></div>",
            "created":1208062800,
            "id":519348,
            "title":"Mother Weybren"
        },
        "111212112":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "\"I can't\"",
                "\"Sure..>LEts.\""
            ],
            "content":"<div class=\"\"><div> <span>You let aout a deep sigh of relief, you weren't preganant with a monster after all...You looked at the Witch docter and she smiled and nodded. \"Go, Play with your friends, live your life Happy young one, for now that the Weybren THINKS your carrying his young, he will not bother you.\" You smile and run off. \"But heed this, if he should find out, you will die a painful death...\" You stop. \"What do you mean?\" \"Dear girl, he will most likly kill you if he finds you in his forest with no child..&gt;ti's best you liv ein the village.\" You smile and nodd. You join Keane, Who kisses you deeply, glad to see you alive, Illea who apologizes for not beliving you and Deeke, Whom tells you he's askd Illea to be his tribesmate and she said yes. You smile and Congradulate them....\"Let's all go to the forest to celebrate...\" You open your mouth and say...</span></div></div>",
            "created":1122008400,
            "id":262808,
            "title":"A sign of Relief"
        },
        "11122":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "content":"<div class=\"\"><div> <span>Oh come on now, The Weybren is super fast, You can;'t possibly out run it on foot, It snatchesyou and your friends up and flies back to it's den, you being the eldest your used as it's mate and are forced to wacth ass it swallows your friends and sister whole...9 months you give birth to it's child and are eaten by the child...NExt time you need to just give up cause you CAN'T outrun a Weybren...Now there's 2 of them in the world and multiplying, Soon the entire world is in peril, But that's another story, Yours ends here...</span></div></div>",
            "created":1121230800,
            "id":261282,
            "title":"Don't be Stupid..."
        },
        "112":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "A Damn Fox",
                "THE WEYBREN!! AND IT'S HUNGRY!!"
            ],
            "content":"<div class=\"\"><div> <span>You are the Handsome warrior in training, Keane. You are fitted in a plain white Tribes man shirt and loin cloth, wearing no form of underwear. Your lover Diane invited you on this little escapade, mostly to keep her from killing her sister. You Had to agre though, her sister was damned annoying...aw well...Not have annoying as her Sister's Boyfriend who insists on asking you questions about being a warrior in training..Sigh. \"Diane, Are we quite finished here, this place is getting boring.\" \"Soon Love...\" She held your arm...*SNAP* You all turned quickly to the sound of a branch snapping behind you...It's...It's...</span></div></div>",
            "created":1121490000,
            "id":261673,
            "title":"Keane's Tale"
        },
        "1122":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "and Hit him Dead on",
                "Annnnnnnnnnnnd....You missed..."
            ],
            "content":"<div class=\"\"><div> <span>You all Scream and huddle together before the thought of RUNNIGN acctua;lly comes to mind...well They run, you don't, You stand yoru ground, Spear in hand. \"I'm not afraid of you, Foul Monster! You will harm my people no more.\" \"Oooh, tough talk for a snack such as you.\" You are suprised to hear it talk. \"How..How are you ab;le to speak...my langauge.\" \"With every puny human aI eat I gain new ablities, Speech was onlly the first...Wonder what I can gain from you...\" He laughed. You don't like being laughed at. You readied your spear and threw it...</span></div></div>",
            "created":1121490000,
            "id":261675,
            "title":"Fighting the Monster"
        },
        "11222":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "content":"<div class=\"\"><div> <span>The spear landed in the ground nextr to the monster. He growled, picked it up and Broke it in two. He than laughed and moved torwards your now trembling self, Picked you up and looked you over. \"Mmm I can all ready tell you'll make a fine meal, Haha\" He Ripped off your shirt and kilt, revwealing yoru penis for all to see. You struggle to escape but it's no use, he places your head in his mouth and licks your face and shoulders, coating you in a sticky..but oddly arousing...slavia,. YOu felt your dick groing hard as you were coated with the slavia and moan softly. \"Ah..Your enjoying your demise..good...HEre let me help your death be a rewarding one...\" With that you feel him running monsterous fingers along your rock hard shaft, he swalosd you up to your belly at this point and than uses is tounge on your penis, You can;t hep but moan loudly as you feel yourself cum for the very last time, the monster licks it all up and swallows you till just your large feet are sticking out, which he sucks in and gives them a niice coatingof the slavia, than swallows them down to join the rest of you in his body...\"Now..To catch the rest of those jkids before they squeal...\" YOu hear him say, Withen a suprisngly short amount of seconds, your joined by Daine, whom you make love to while you digest, and than Illea and deeke, Who make love as well... you all die together, digested into the monster and all end up one big pile of Weybren shit.</span></div></div>",
            "created":1121490000,
            "id":261680,
            "title":"Why yous hould never miss"
        },
        "113":{
            "choices":[
                "A farm house",
                "A pond"
            ],
            "content":"<div class=\"\"><div> <span> Illea despite being only 5’1 was considered one of the prettiest girls in the village. She was almost as beautiful as her older sister Diane. She was extremely fit, and had a voluptuous figure, with long strawberry blonde hair, and green eyes. She was wearing a short blue, and white dress, as she walked with her friends. <br>\r\n<br>\r\n She begins to tees her older sister about what the Weybren likes to do to young girls it catches, when you all hear something near by. As you go, and check it out, you see a...</span></div></div>",
            "created":1120539600,
            "id":259757,
            "title":"Illea"
        },
        "1132":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "It's a person",
                "It's A Tounge, Which lashes out and wraps you up"
            ],
            "content":"<div class=\"\"><div> <span>You lead the 'pack'so to speak to the sourse of the noise. You part the bushes to find a small pond. \"That's funny.\" You say curiously. \"Coulda sworn I heard something...\" Diane laughs now. \"Is my little Sis getting scared now?\" \"No!\" you snap back, even though you have to admit you are a litle scared. You all walk towards the pond and look around. \"All there seems to be is this pond.\" You say, a sign of relif in your voice. You sigh and walk over to get a drink of the cyrstal clear water when you jump back seeing something rise out of the water, yoiur blue and white dress opening a little to expose your bare legs and feet and part of your blue panties.</span></div></div>",
            "created":1120712400,
            "id":260061,
            "title":"At the pond"
        },
        "11321":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "He's for real",
                "It's the Weybren Tricking you"
            ],
            "content":"<div class=\"\"><div> <span>A Human boy, about your age, pops out of the water, he's stark naked and seems to show no sign of shame. He smiles. \"Well hello there, eautiful.\" You blush. \"Come on in, the water's fine.\" You raise a brow andf think than strp down and join him...You tell your friends you'll be fine and they all leave</span></div></div>",
            "created":1122267600,
            "id":263297,
            "title":"the Boy in the river"
        },
        "113211":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "\"Fuck me, Leason, Right here in the water\"",
                "\"let's make out for a while.\""
            ],
            "content":"<div class=\"\"><div> <span>You swim closer to him and he wraps you in his arms. \"I've been watching you in the Village Illea, your very beautiful..&gt;I just..I had to have you.\" You smile and kiss him softly. \"Your so kinmd..mihgt i get your name?\" \"It's Leason.\" \"well LEason..Up for some fu in the water?\"<br>\r\n</span></div></div>",
            "created":1122267600,
            "id":263301,
            "title":"Meeting LEason"
        },
        "1132111":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "He walks you home",
                "A croc in the pond eyes you both for lunch"
            ],
            "content":"<div class=\"\"><div> <span>He smiles ad you feel his erection under your pussy, You lket him enter you and the two of you make passionte sex in the water, moaning as you ru on eachother's private You scream his name as he fucks your dripping piussy and finaly cums inside you. \"Oooh...Leason, That was wonderful...\" He smiles and you kiss each other. You just met the boy and already you want him forever...</span></div></div>",
            "created":1122267600,
            "id":263302,
            "title":"Making love in the pond"
        },
        "11321112":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "No Such Luck, You're Reunited With Your Boyfriend In The Croc's Stomach",
                "You Make It To Shore. Your Safe Now... Right?"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh... Leason, That was wonderful... Aaahhh!\" You suddenly scream as you see what has to be a 20-foot long crocodile behind Leason! You immediately begin to swim for shore as fast as you can.<br>\r\n<br>\r\n\"What's the matter babe..? Noooo!\" Leason wails in terror as you see him slide down the crocodile's throat, making a large bulge in it's middle. But you don't have time to mourn the loss of your new boyfriend because your too busy trying to swim for shore before the crocodile gets you as well.</span></div></div>",
            "created":1124168400,
            "id":267934,
            "title":"Survival Tip: Do Not Swim In Crocodile Infested Wa"
        },
        "113211122":{
            "choices":[
                "You awake in the middle of the night....",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>You make it to the shore, shivering and all alone...the cries of your new friend...as he was devoured by the huge water croc ringing in your ears....<br>\r\nYou look back into the water, but you see nothing, or no one....not even a ripple disturbs the calm looking water.<br>\r\nYou kneel on the cold sand, your nipples getting even harder in the cool air, as you realize you had made love to that boy...you still fill his hardness within your clasping vagina, and the loss of him, makes you groan out. You keep kneeling there...and then you hear your older sister calling out for you.....<br>\r\nIllea!....Illea!...where are you?.....\" you hear her concern,...and you croak out an answering response...cupping your hands around your panting, still scared mouth.<br>\r\n\"I AM OVER HERE!\" you shout out...and your tired, afraid voice even sounds different to you....<br>\r\nYou hear her scream out....<br>\r\n\"I AM COMING....ILLEA!......STAY THERE!\" and you hear her running over to where you kneel...but you seem to fall into a darkness...as your ordeal,...and being naked in the elements takes its toll on your energy.....<br>\r\n<br>\r\nYou wake up, laying in your bed, the comforter covering your nude, stilled body. Your long, black, glossy hair has been brushed, and lays fanned out beneath your head....your eyes unable to properly focus....for a moment.<br>\r\nYou also hear your sister gasp and say to someone else...<br>\r\n\"She is awake....oh,...gods...I am so happy she is alive...\" she tearfully sighs then, as she comes to sit within your eye sight. Her beaming, alluring face looks down into your searching eyes,...and when your orbs lock you feel something else pass between the two of....something that was never, ever felt before...You smile weakly at her...then whisper for some water...<br>\r\n\"Oh...yes...sorry, Illea. Here....here is some water...drink it slowly.....dear sister!\" she whispered back as she helps you drink a sip, then another sip, all the while showing genuine concern and thoughts for you and your health.<br>\r\nYou sigh once more, as you take a third sip, and then she sets the small cup to one side and looks down into your eyes, searching....<br>\r\n\"Why did you go in the water, Illea?.....and where is your clothing?....why was you...?\" she whispered, but you cut her off, by smiling wanly to her, and pressing your slight finger to her lips.<br>\r\n\"You would not believe me even if I told you, Dearest Diane!\" you sigh once more...then feel your eyes droop shut...your eyelids heavy as your body, your soul tries to regain the strength you lost.<br>\r\n\"Yes...yes, dearest Illea...sleep....sleep. I will be right here....I will never, ever leave your side.\" she whispers into your ear, as she watches you go back to sleep...to dream...and to stay as comfortable as you can be....<br>\r\nAnd she smiles......</span></div></div>",
            "created":1199422800,
            "id":483375,
            "title":"You Make It To Shore. Your Safe Now... Right?"
        },
        "1132111221":{
            "choices":[
                "Diane wakes up first....",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>As Illea, you have escaped a wild water croc, who ate up your new lover, the boy in the water. In your fright you even forgot his name. But you made it to the shore...and was found naked, cold, and very confused by your older sister, Diane.<br>\r\nYou now have been resting, sleeping in your warm, safe bed, with your loving, older sister Diane watching over you as a mother hen watches her chicks. You look to see her asleep, propped up in the chair, her marvelous looking body, one that you are quickly becoming as well, exposed in a vanity of ways. You smile knowing she has stayed there ever since you went back to sleep, after she had helped you take a few sips of water.<br>\r\nYou smile once more, then feel the urge to go relieve your bladder...<br>\r\n'ahhhh...need to go pee...' you sigh, and find your strength has returned...\"gotta go now!' you sigh once more. You stand on shaky legs, unsteady, but that too soon passes and you scamper, naked as the day you were born to your bathroom that is right across from your bedroom. <br>\r\nAfter you are finished, you wipe yourself daintily, and a pleasure of being felt up passes through you. You get even more aroused as you stand up, remembering that mysterious boy....and how wonderful it felt when he made love to you in the water....<br>\r\n\"That is...before that croc got him.....\" you whisper to yourself. You scamper back to your bed, and as your getting back underneath your comforter...Diane opens her eyes and yawns and stretches as she awakes.<br>\r\n\"I see you are feeling much better, dear sister....mind if I crawl in with you...I am so very tired....\" she whispers as she stands, then disrobes her alluring sleeping robe....and climbed in with Illea.<br>\r\n:Sure...sure, Diane. and thank you for saving me....I am so sorry I have been a bother...\" she sighed once more, then jumped a little when Diane drew her into a hug, their naked, erect nubs, and titty flesh rubbing against each other.<br>\r\n\"It has been so very long...Illea....that we do this,....and you are no longer the bratty little sister....\" Diane said, as she then kissed Illea full on her parted lips, and sent in her tongue, searching for Illea's. <br>\r\n\"MMMMM.....mmmmffffttt?\" panted out Illea as she felt Diane take her position on top of the aroused younger woman. Both were taken up in the moment, and before Illea knew what was happening....she felt Diane send a firm hand down to her sliming groin and begin to rub, to probe Illea's cunny,...and delve deep into her sliming sex pit.<br>\r\n\"OOOOOOOOOOOOOOOOOHHHHHHHHHHH....DIANE!\" Illea moaned into her older sister's mouth....and for the rest of the night, the two sisters rekindled their deep love they held for each other....It was not until the rays of the morning sun were starting to filter the new dawn that Diane and Illea had had their fill....of loving each other. <br>\r\n\"AAAAAAAAAAAAAAAAAAAAHHHHHHHHHH....COMING AGAIN!\" moaned out Diane, as she arched her body for the umpteenth time.....<br>\r\n\"ME TOO.....MMMMMMMMMMMMMMMMMMMMM!\" answered Illea as her mouth became filled with Diane's ample, sweaty right breast. Illea was now the one on top, to one side of her older sister, the sweat running off of them both in rivets,...as the room reeked of their love-making, the feminine smells of their sex, and the musky, fresh sense that the soiled bed sheets held within them.<br>\r\nIllea then sighed once more as her last after glow from her latest shared orgasm with Diane finished coursing through her.<br>\r\nWhen Diane could speak she weakly hugged Illea to her body, as she moaned out....<br>\r\n\"That was the best come yet....Illea....Thank you!\" she groaned out......<br>\r\n\"Yeah....\" answered Illea as she rose a weak head and landed a light, soft peck on Diane's cheek. Then she resumed nuzzling Diane's ample titty flesh, using her mouth on the right titty, her other hand on the left.<br>\r\n\"OOOhhhhh....I need to sleep, dearest....please....no more!\" Diane grunted out. Her eyes fluttered closed and Illea then felt her start to fall immediately to sleep, a broad smile etched on her alluring, sexual-charged face.<br>\r\nIllea smiled once more...then kissed her older sister's right tit, once more on the puffed out nipple nub.....then said, as she too went to sleep.<br>\r\n\"I love you, my Diane....come whatever that monster does...I love you!\"<br>\r\nThen she closed her eyes and fell asleep....in a sweet dream...making endless love with her sister.....Diane!<br>\r\n<br>\r\n<br>\r\nwhat next???????????</span></div></div>",
            "created":1199422800,
            "id":483383,
            "title":"You awake in the middle of the night...."
        },
        "113212":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Lay back and enjoy the pleasure of being eaten",
                "Fuck you! Struggle!"
            ],
            "content":"<div class=\"\"><div> <span>You smile and swim closer to him, than he gets evil looking. Before you can swim away he grabs you. \"Now I've got you my Tasty little snack.\" Before you can let out a scream his mouth opens wide and engulfs your entire head, his drool drips all over your face as you struggle in his powerful grib, but it seems to come to  no avail as he makes his first swallow, taking you in his mouth up to your breasts, he ggives them a through llicking, espiccaly your nipples, which betray you and become erect and a moan escapes your mouth, maybe being swallowed alive isn't so bad?</span></div></div>",
            "created":1122267600,
            "id":263298,
            "title":"Tricked"
        },
        "1132121":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "content":"<div class=\"\"><div> <span>you figure escapse is impossible and his drool dripping down your face, neck shoulders and breasts does feel very good... and his throat is making a soft, hypnotic glorp sound with each swallow, so you make up your mind, You give your self to the Weybren,your his meal now, best enjoy it. you moan softly as he swallows you to your belly, Licks it and drools on it and swallows, the fact that your soaking wet from the pond and his drool aides in making you slide into his waiting belly, he gives yoru pussy the tounge fucking of it's life and you moan loudly as you cum all over his tounge and mouthhe swalows that down and goes to work on your short but lucious legs, than your small, cute and dantiy feet, he ggives your soles and small little toes good long tounge bath before swallowing them down and lettig them join you. He pats his belly. \"There, That wasn't so bad was it?\" You moan a response and coo. \"You might wana go to sleep, the digestion is very paiful if your awke. \"You smile and nodd off, you ever again awake as you become part of the Weybren forever...</span></div></div>",
            "created":1122267600,
            "id":263299,
            "title":"Dying and loving it"
        },
        "11322":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Deeke runs over and grabs your hands, trying to pull you from it's grasp",
                "Your dragged into the water, hopelessly eaten"
            ],
            "content":"<div class=\"\"><div> <span>before you can react further, a sticky tounge lashes out of the water and wraps it's self around your exposed leg and foot and starts to drag you torwards the water, You scream and kick as you claw at the ground trying to save yourself. \"HELP!!! PLEASE HELP ME!\" You yell to your friends, who are too stunned to move. You feel that all hope is lost when Suddenly</span></div></div>",
            "created":1120712400,
            "id":260063,
            "title":"TOUNGE ATTACK!!!"
        },
        "113222":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "content":"<div class=\"\"><div> <span>Yous cream to your friends to help you, but they still do not move you cry louder than yell to them . \"Thanks a lot, Assholes...\" they still do not move, PEtrified as a large mouth breaches , ready to except you as a meal. You hear your sister scream. \"It's The Weybren!!\" You turn and look and your eyes widen as it pulls you in, It keeps you in it's mouth for a while savoring your delious flavor, it uses it's tounge and manages to get your dress off, spitting it out soon followed by your bra and panties, leaving you nude in its motuh as it tastes every inch of you, it's tounge exploring your face, breasts, pussy and tickling your extra senstive feet and toes.  because of your size, your swallowed in one quick gulp. You lie in it's belly, your last thought as you digest is \"I guess Diane was right...it is real...\" It flies off, the bulge of you sen clearly in the monsters belly.<br>\r\n<br>\r\nDiane takes your clothes back to the village and tells every one how the Weybren claimed another victem...</span></div></div>",
            "created":1120712400,
            "id":260069,
            "title":"Swallowed up"
        },
        "114":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Something Large Swoops Down And Snatches You Away",
                "A Crazy Old Lady Appears And Tells You Not To Talk About The Weybren"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Deeke and you're known as the village prankster. Right now you're sitting in a clearing in the woods with your friends Diane, Illea, and Keane telling them all jokes.<br>\r\n<br>\r\nRight now you're telling them your tenth Weybren joke. \"So a lawyer and the Weybren walk into a bar and...\" But you're suddenly interrupted when...</span></div></div>",
            "created":1124168400,
            "id":267936,
            "title":"Deeke The Jokester"
        },
        "1141":{
            "author_id":"jhutton12",
            "author_name":"J.Hutton",
            "choices":[
                "The girls race out of the jungle leaving Jay, Keane, and Trina behind",
                "Diane and Illea bump into a bloody Deeke",
                "Diane and Illea bump into a bloody Travis"
            ],
            "content":"<div class=\"\"><div> <span>\"What was that?\" Diane asked. <br>\r\n\"I don't know.\" Deeke replied.<br>\r\n<br>\r\n\"Deeke, stop it.\" Illea said as she got up from the rock she was sitting on. \"I didn't do anything.\" Deeke said as he got up too. Keane laughed. \"Are you in on this too?\" Diana asked as she looked at him. \"I honestly don't know what Deeke's up to.\" Keane told her.<br>\r\n<br>\r\n\"Honestly, neither do I.\" Deeke said as he turned and looked at them. \"Deeke, dude, just stop. Come on girls lets get out of here.\" Keane told them. Diane finally rose with the others. <br>\r\n<br>\r\nThere was a loud screech noise from behind them. They turned around. Deeke was gone. \"Deeke?\" Diane asked as she slowly krept forward. \"Where'd he go?\" Keane asked. \"It's the Weybren.\" Illea whispered. \"Come on, Illea, you know better than that.\" Diane said as she turned and looked at her sister. \"Then where is he?\" Illea asked as she searched the swaying tree tops.<br>\r\n<br>\r\n\"It's just yet another Deeke prank.\" Keane told them. They both turned and looked at him. \"You honestly, know nothing about this?\" Diane asked him. \"Nope.\" Keane told her.<br>\r\n<br>\r\n\"Alright, Deeke, come on out. Jokes over!\" Illea screamed. Something moved a few feet away. \"What was that?\" Diane asked. \"Deeke?\" Illea suggested. \"Way to fast to be Deeke.\" Keane told them.<br>\r\n<br>\r\nThere was a silent roar. Diane clutched on to Keane's arm. \"We are getting out of here.\" Illea as she turned to make a run for it. She screamed. <br>\r\n<br>\r\nJay laughed in her face. The girl and boy on either side of him laughed. \"What's wrong? Scared of the Weybren?\" Jay asked in a taunting voice. \"Very funny, Jay. Where's Deeke?\" Keane asked.<br>\r\n<br>\r\n\"How would we know?\" Trina intersepted. Illea looked at Trina. \"Trina, you look pretty today.\" Illea said with a smile. \"I know.\" Trina said as she rolled her eyes. Illea's smile faded and she stepped towards her. \"Down girl.\" Travis said as he stepped between them.<br>\r\n<br>\r\nThere was another loud hiss. They all twirled around. \"What the hell?\" Jay asked. \"Don't play dumb.\" Diana said as she looked at him. \"Come on, Jay. Let's get out of here.\" Trina said as she grabbed Jay by his arm.<br>\r\n<br>\r\n\"We shouldn't have come this far out. Let's go.\" Illea said as she looked back at her sister and Keane. \"What about Deeke?\" Keane asked. \"It's too late for him. He shouldn't have joked about the Weybren!\" Illea cried. <br>\r\n<br>\r\n\"Deeke joked about the Weybren?\" Travis asked. The three of them turned and looked at them. \"Jay, let's go.\" Trina demanded as she searched the trees around her. Suddenly a shoe fell between the two groups of six.<br>\r\n<br>\r\nAll six screamed and jumped back in fear. \"That's Deeke's.\" Keane said as he bent down and looked at the red and white sneaker. There was a huge rip in the side of the shoe. \"What happened to it?\" Illea asked.<br>\r\n<br>\r\n\"It's covered in...Drool.\" Keane said as he looked at the drool dripping off his fingertips. \"Screw this, I'm out of here!\" Trina said as she turned and walked off. \"Trina!\" Tracis said as he went after her.<br>\r\n<br>\r\nThere was a loud roar. The remaing five got to their feet. \"Trina.\" Jay said after a second. There was a loud piercing scream. They all took off running.<br>\r\n<br>\r\nTrina was on the ground, face down. \"Trina!\" Keane cried. He was the first one to reach her. \"Where's Travis?\" Diane asked. \"Let's get out of here!\" Illea screamed. \"Look at her leg!\" Jay cried noticing the huge gash in Trina's leg. \"Help me, help her up!\" Keane cried.<br>\r\n<br>\r\n\"WHERE IS TRAVIS!\" Diane screamed. They all stopped and looked around. \"TRAVIS!\" Jay screamed. Illea took off running. \"Illea, wait!\" Diane screamed as she raced after her sister. </span></div></div>",
            "created":1221541200,
            "id":583093,
            "title":"Something Large Swoops Down And Snatches You Away"
        },
        "12":{
            "choices":[
                "Group of young girls swimming.",
                "A Farm house.",
                "A group of young boys swimming.",
                "A group of people swimming.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span> The Weybren is a stealthy, greenish colored, large, fast, and mighty creature, with wings, and a long tong, it uses to catch its prey sometimes. Like a cat, it loves to torment it’s pray before it eats them alive. It is a highly intelligent creature, that knows when to strike, and when to not too. <br>\r\n<br>\r\n As the Weybren patrols its territory, it sees something through the trees. It sees a...</span></div></div>",
            "created":1120539600,
            "id":259766,
            "title":"Weybren"
        },
        "121":{
            "choices":[
                "Watch them.",
                "Get as many as you can."
            ],
            "content":"<div class=\"\"><div> <span> You see a group of eight young girls swimming in the nude, their ages very between twelve and fifteen. They are the prettiest little things he has ever seen. One thing you like about human’s, besides their taste. <br>\r\n<br>\r\n You love the bouncing action of the female breasts, and of the male penis. They are just really fascinating to watch, and they taste really good too. As you look them over, you figure the female body must be a work of art, especially their butt’s, and god do they have nice butts. <br>\r\n<br>\r\n They are so many of them skinny-dipping, but you know you can get at least five of those little beauties, maybe even more. Maybe I’ll eat some of them, maybe I’ll mate with some of them, but I will play with all of them. As watch, you decide too....</span></div></div>",
            "created":1120626000,
            "id":259833,
            "title":"Swimmers"
        },
        "1211":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "The girl walking your way is too tempting to pass up",
                "Without the leader, the rest will fall,better play it safe and eat the 20 yr old"
            ],
            "content":"<div class=\"\"><div> <span>You decide to wait and plan things out, after all...why settle for just 5 of them if you can think up a way to catch all eight? That way you can have 4 of them for dinner and use the rest for mating...Wait what's this...<br>\r\n<br>\r\nLooking closer you see they are not alone, They are accompioned by an elder, maybe..20 or so. Of course, they would be, it's rare to find such a young group of human girls on their own. There was that one time you happened upon a tasty 10 year old, but that was pure luck... You turn your attention back to the girls and notice one of the younger girls, perhaps 12 or 13 is heading your way, prancing along, her figure boucing in a much enticing way, she looks tasty and if she gets close enough you can easily snag her with out anyone seeing...One the other hand if you sneeak around and snag the Elder, you can get all of them plus a bonus snack...What's a Hungry/Horny Monster to do?<br>\r\n</span></div></div>",
            "created":1120626000,
            "id":259960,
            "title":"Watching the Swimmers"
        },
        "12111":{
            "choices":[
                "Become invisible?",
                "Change into her father, or other male relative?"
            ],
            "content":"<div class=\"\"><div> <span> You have other abilities to, like the ability to read your preys minds, to become invisible, and to change your form, into whatever will scare you’re pray the least. You watch the as the naked young girl gets closer. Her firm breasts bounced a little, as she walks towards you. She is within a few feet of you, well within striking range, when she stops. She turns around to smell a flower. <br>\r\n<br>\r\n Just for a second there, you thought that she had spotted you. As you breathe a sigh of relief, you can’t help but observe her amazing nude figure, and her equally amazing ass. She was so pretty, with her long brunet hair, and her blue eyes. You say it to yourself again; human women are a work of art. <br>\r\n<br>\r\n You are going to play around with her little first, and then you will ether, eat her, or mate with her. As you read her mind, you decide too,</span></div></div>",
            "created":1120798800,
            "id":260224,
            "title":"What will I do? What will I do?"
        },
        "121111":{
            "choices":[
                "Eat her?",
                "Mate with her?"
            ],
            "content":"<div class=\"\"><div> <span> You decide to become invisible, so you can sample her. You walk up behind her, and with your long tong, you gently taste her fantastic ass cheeks. She jumps up, and looks around, and then she decides it must of bin a bug, or something.<br>\r\n<br>\r\n You then lick the area between her sweet legs, and you taste her pussy. You now know that see is indeed ovulating, but she is so damn tasty too. She jumps up again, and looks around. Now that she is standing in front of you, you lick both of her large breasts, and she begins to squirm a little. She then walks carefully back to the other’s. <br>\r\n<br>\r\n You then...</span></div></div>",
            "created":1122354000,
            "id":263480,
            "title":"Yummy or Other?"
        },
        "1211111":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Eat Her Out!",
                "Just Eat Her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well you know you could just eat her, or maybe you could have some fun by eating her out?</span></div></span></div>",
            "created":1122526800,
            "id":264051,
            "title":"Eat Her Or Eat Her Out?"
        },
        "12111111":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "For Some Strange Reason You Can't Pull Your Tongue Out Of Her Pussy!",
                "That Was Fun, Try Her Anus Now!"
            ],
            "content":"<div class=\"\"><div> <span>Smiling evilly to yourself as you decide to have some fun with her. You then suddenly plunge your long tongue deep into her pussy and begin to wiggle it around. When she feels this, the girl's whole body goes rigid as she moans in pure bliss and begins to tightly clench her pussy around your probing tongue.<br>\r\n<br>\r\nYou find her cherry and the girl quickly climaxes with a soft scream of pleasure making her friends point and laugh at her, because to them it looks like she's just had a spontaneous orgasm for no reason.<br>\r\n<br>\r\nSmiling to yourself you begin to remove your long tongue from her now dripping pussy.</span></div></div>",
            "created":1124082000,
            "id":267765,
            "title":"Pleasure From An Invisible Tongue"
        },
        "121111111":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "You Can't Escape!",
                "You Manage To Pull Your Tongue Out"
            ],
            "content":"<div class=\"\"><div> <span>Smiling to yourself you begin to remove your long tongue from her now dripping pussy (causing the girl to moan even more)... Or you try to anyway.<br>\r\n<br>\r\nTo your surprise and confusion the girl's pussy is so tightly clenched around your long probing tongue that you can't pull it out! You then get an even bigger surprise as the girl's vaginal muscles start to pull your tongue in even deeper! You start to panic as the girl's pussy pulls more and more of your tongue into it. When your tongue can't stretch anymore the strong pussy muscles even begins to pull your whole body towards the girl's pussy! The girl is oblivious to all of this as she continues to moan in pleasure.<br>\r\n<br>\r\nIt's like some perverted tug-o-war you realize as you dig your claws into the ground to prevent yourself from being pulled any closer to the girl's pussy. However it doesn't help you for long because the girl's vaginal muscles are so strong that you’re soon faced with two choices. Either let go of the ground and be dragged by your tongue into the girl's pussy or the girl's vaginal muscles would rip your tongue out of your mouth.<br>\r\n<br>\r\nSo naturally you decide to let go of the ground.</span></div></div>",
            "created":1124168400,
            "id":267931,
            "title":"Pussy Got You're Tongue?"
        },
        "1211111111":{
            "author_id":"blueberryjoe",
            "author_name":"Grater",
            "choices":[
                "Open your mouth to eat her!",
                "Keep your mouth closed. You're too big, right?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Trying to think of a way out of this while your being dragged, you...</span></div></span></div>",
            "created":1264666140,
            "id":826901,
            "title":"You Can't Escape!"
        },
        "12111112":{
            "choices":[
                "12 year old Lisa",
                "15 year old Sara"
            ],
            "content":"<div class=\"\"><div> <span>You pull her into your big mouth, as she tries desperately to escape. You taste the soft, bare skin of her body, as she heads toward your stomach. As she lies in your stomach digesting, you look around and see another young girl heading towards you. The girls is  </span></div></div>",
            "created":1132462800,
            "id":284928,
            "title":"A second meal is here"
        },
        "121111121":{
            "choices":[
                "Have Lisa kiss Illea,...whom she thinks is her lost love......",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>You as the very monster the villagers are afraid of...and these fools are inviting you to eat them.....<br>\r\n'What fools these are....my pets!' you think as you get looking for more.....<br>\r\nYou now hear another foolish swimmer coming toward your position in the reeds....<br>\r\nThe pretty, young girl,...looking to be around twelve years old...her breasts larger than most her age,....her long brown hair swimming behind her...then she reached the shore and walked out, unaware that you, the Weybren was so close to her.<br>\r\n'My..my.....my....she is one delightful morsel....mmmmmm....I know that I must mate with her...using my bag of tricks....heh heh heh!' you think.....as you follow her, invisible, unseen.<br>\r\nAnother girl from out of sight ask the girl what she was doing...<br>\r\n\"Lisa?...what are you up to?\"<br>\r\n\"Oh...nothing, just want to be alone...you know?\" she said to the other person....another teen girl that seemed concerned for her friend.<br>\r\n\"Well, be careful...remember, the Weybren is out here...he has been eating like a pig, lately.\" The other girl seemed to be leaving and Lisa looked sadly back at the water...her nudity showing how well developed, her body had become. She sighed....<br>\r\n\"I just wish I was dead...I miss Illea so much....wish she had not gotten eaten by the Weybren....I loved her so much!\" Lisa then started to cry a flood tears and her sobs reached the Weybren, and it felt pity for the well-endowed teen.<br>\r\n'Sorry dear heart....just the part we are given...I am the eater...the monster...you are the cattle...you are all my food......\" the Weybren sighed silently, then made up his mind...knowing what he had to do......<br>\r\nHe morphed into Illea,...and as the recently eaten maiden...swam up unseen to the sobbing girl....<br>\r\nUntil Lisa heard the single slip of water...and with red tear-smeared eyes watched as Illea...or someone that appeared to be her Illea came to her....drawing her into a nice, warm hug.....<br>\r\n<br>\r\nwhat next?????<br>\r\n</span></div></div>",
            "created":1199422800,
            "id":483397,
            "title":"12 year old Lisa"
        },
        "1211111211":{
            "choices":[
                "Have Lisa eat out Illea's pussy!",
                "other...."
            ],
            "content":"<div class=\"\"><div> <span>\"Lisa?...is that you?\" you whisper out...in Illea's voice,..as you assume her form...the form of one of those you have eaten. You stand up in the water, letting the teary-eyed girl see you....and sense you are what she seeks....<br>\r\n\"*sob*....*sniff* ILLEA!\" she shrieks at you....and she comes quickly to you, thinking you are what she wants...what her heart desires.....to hold, to feel, to touch....to love.<br>\r\nYou snicker a little, but knowing others are all around you...or near you, you just stand there, and take her in your warm-feeling arms....your nipples erect, your body giving off signs that you are highly aroused...and wanting her as well...<br>\r\nShe kisses your water covered cheek...then lowers her lips and begins sucking on your torrid tits, taking in as much titty flesh as her small mouth can take. She also, through some inner strength starts directly the two of you toward the shore...her mind intent on not letting you go...to make love to her girl friend.....<br>\r\nYou, with a smile, allow her to guide to two of you to a secluded spot on the shore, isolated from prying eyes...and with a sigh showing to her your are accepting this love making session with her, Lisa gleefully takes the top position...mashing her sucking lips to your puckered tits. <br>\r\n\"OOOOOOOOOOHHHHHHHH...Illea.....please let me make love to you.....please let me suck your pussy.....please?\" she whimpers,...all the while she is moving all over your panting, responding body to her advances....<br>\r\n\"AAAAAAA...go ahead, love.....just be gentle, Lisa......this is my first time with you, beloved!' you pant out, making sure to send an extra feeling into your strange sounding voice....but for Lisa....she hears only what she wants to hear....and then.....<br>\r\n<br>\r\nwhat next???</span></div></div>",
            "created":1199682000,
            "id":484880,
            "title":"Have Lisa kiss Illea,...whom she thinks is her ..."
        },
        "1211111212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Lisa comes along",
                "She's sceptical."
            ],
            "content":"<div class=\"\"><div> <span>The two girls' - or rather, the girl and the girl-eating monster in disguise - pulled into a deep embrace, warm, soft bodies tightly against each other, the yielding, slick flesh of their soft breasts brushing each other's semi-erect nipples.<br>\r\n<br>\r\nLisa's eyes were wide. Illea was here, with her, alive! But... but she couldn'e be! The whole village had heard her screams as the Weybren <br>\r\n<br>\r\n\"Illea... How...\"<br>\r\n<br>\r\nThe monster-in-blonde-girl-skin disentangled just enough to lean back, a finger to her lips.<br>\r\n<br>\r\n\"sshhh... Come with me... I got something to show you...\"</span></div></div>",
            "created":1199768400,
            "id":485199,
            "title":"The fix is in."
        },
        "12111112121":{
            "choices":[
                "Have Lisa think it was a dream....",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>LIsa is overcome with her love's return...she feels her breasts being mashed into Illea's titty flesh. They stay entwined hand-in-hand, as the Weybren, disguised as the dead Illea leads Lisa deeper into the reeds...and further away from the people frolicking in the water.<br>\r\nA soft kiss, a easy feel, a pat on her firm ass cheeks by Illea kept Lisa following whom she thought was her lover, Illea.<br>\r\nHer heart won over reason....as her mind kept trying to tell her this could not be Illea....but Lisa was not caring what happened...<br>\r\n'My love has returned...and I will never let go.....*kiss*...\" she panted out as she lightly got to kiss Illea's fingers. Illea smiled back at Lisa...then with expert ease, as they were now utterly alone, Illea took Lisa into her arms and laid her on her back, while kissing her deeply.<br>\r\n\"OOOOOOOOOOOOOOOOOOOHHHHHHHHHHHHHHHHH!\" was all Lisa could say before Illea was all over her, maneuvering her roaming hands over every accessible part of Lisa's flesh. Suddenly Lisa felt her elongated clitoris get rubbed, sucked on, while her nipples had suckers attached to each of them,....while a hot-feeling, thick object started inserting itself into her suddenly loose-fitting ass.<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAA...MY ASS!\" moaned out Lisa then her grunting mouth was filled with two tentacles, that had sprouted from Illea's back....And she watched in a detached sort of way as she was then laid beneath a pulsating, huge wave of tentacles, that were all concentrated on pleasuring, pleasing Lisa....<br>\r\nThe only sounds now ere the sloppy sounds of many, many tentacles stabbing, rubbing, spewing, secreting, and moving all about as a horror-looking mass that entirely covered the grunting, out-of-her-mind Lisa......<br>\r\nThere was not a part of her hot, overly-charged flesh that was not getting some stimulation from the form that was Illea......and her last controlled thought had been just before she had been taken in by Illea's arms.....<br>\r\nShe groaned out once more....then sighed silently as she fell, fell, fell into a bottomless pit of inky blackness. All the while, The Weybren, as Illea, with many tentacles not moving about that were sprouted from her body smiled....and thought....<br>\r\n'I will use this one.....to breed with....and she will be mine forever!'<br>\r\n<br>\r\n<br>\r\nwhat next? </span></div></div>",
            "created":1200286800,
            "id":487197,
            "title":"Lisa comes along"
        },
        "12111112122":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Just eat her, then.",
                "Illea explains how she met the Weybren..."
            ],
            "content":"<div class=\"\"><div> <span>Lisa takes a step back, shaking her head, both eyes and lips both open in pure shock. Everything looks right, and feels right - those magnificent breasts she fell in lust with even yields exactly the same against her own! But... Illea is dead, eaten, digested... This can't be her! And yet... and yet...<br>\r\n<br>\r\n\"You... you can't be here! We heard you... we found your clothes... you... you were... you were... How can you be...\"<br>\r\n<br>\r\nIt almost worked, you think. Perhaps...</span></div></div>",
            "created":1211691600,
            "id":536017,
            "title":"She's sceptical."
        },
        "121111121221":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Hide yourself somewhere and see if the girl that warned her might come looking..",
                "Go home to your cave and wait out the inevitable search parties..."
            ],
            "content":"<div class=\"\"><div> <span>Pity. If she had fallen for it, the deception might have led to all kinds of fun. Still, it's not a complete waste. The utterly shocked expression on her face as you take your true form, right in front of her, is really something you'll treasure for a while. <br>\r\n<br>\r\nHeck, she is so shocked, she doesn't even scream until her head is halfway down your throat. Of course, by then she screams plenty. No wonder she liked Illea - they sounded about the same going past your maw! Your tongue lick at those delicious, still forming breasts, touching the ass that will never know a boy's cock, and you take your time swallowing those wildly kicking legs as Eva fights desperately - but vainly - to stop her irrevocable plunge to her doom in your belly.<br>\r\n<br>\r\nFinally, you snap your jaws shut. Fresh semen explodes from your monster cock as your balls empty in response to her delicious, final trashing. Perhaps not how she hoped to be reunited with her lover, but it's like you said to that girl last time, who walked alone wishing for a good, hard cock - \"Be careful what you ask for...\"<br>\r\n<br>\r\n<br>\r\nApropos being careful, though... she did scream quite loud, understandably enough. It might be advisable to vacate the premises...<br>\r\n<br>\r\n </span></div></div>",
            "created":1213074000,
            "id":542568,
            "title":"Oh, well, can't win them all..."
        },
        "121111121222":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Tell a tale of awesome sex and a life as the Weybren's queen...",
                "\"THIS happened!\""
            ],
            "content":"<div class=\"\"><div> <span>Thinking quickly, you lean in and silence her stammering with a kiss. She makes protesting noises for a second, and then the feel of those wet, perfect breasts against her own, the lips touching hers, and the hands on her ass gives her other things to think of.<br>\r\n<br>\r\nYou have a new plan, as you break the kiss, you slide in behind her, pressing those great breasts against her back, your hand sliding on the young girl's bare belly and thigh. The feel of 'your' breasts against her back is quite something else. You remember their movement nearly mesmerizing you as you fucked their original owner  senseless (but not so senseless she didn't fully appreciate every second of her digestion in your belly). The sheer force of the memory almost has you just dropping your shape and plunging your cock up little Lisa's ass, but you hold on a little longer, though you actually feel your mouth watering even in this form.<br>\r\n<br>\r\n\"I did meet the Weybren...\"<br>\r\n<br>\r\nLisa's gasp is quite probably because of 'Illea's' admission, but might also have something to do with your hands grabbing onto her breasts. It seems almost a shame to eat her now, before seeing what they'll grow to. She might get a better pair than her digested lover, one day<br>\r\n<br>\r\nShe stammers out...<br>\r\n<br>\r\n\"But... but what happened?\"</span></div></div>",
            "created":1225925700,
            "id":604293,
            "title":"Let's try explaining..."
        },
        "1211111212221":{
            "choices":[
                "You orgasm with her..........",
                "other........"
            ],
            "content":"<div class=\"\"><div> <span>Lisa is too far gone to even resist your pawing and touching of her aroused body. You, as Illea have been kissing and nibbling on her exposed neck. While your ever busy hands have been touching and rubbing her naked body, in all the right places.....<br>\r\nShe stammers out once more,...a weak question.....<br>\r\n\"But,...but....what happened?\" she is now turned around, and being lead to lay down, spread her legs wide, as you climb on top of her. Your lips search out her's and you forcibly kiss her, while sending in your stiff, hard tongue to fence, to battle with her's. Your tongue soon wins, and invades her panting, groaning mouth, her arms at her sides, unmoving and limp. <br>\r\nYou growl a little now as you take over her control, and licking her neck one last time, you bite her with your fangs, making her your's, while drinking in some of her blood, her life-force, her soul.....<br>\r\nYou are now breast to breast, groin to groin and you start to rub, to hump down into her clitoris,....as she starts to do the same up into your groin. She is your's now...and she mindlessly grinds up into your sex, as you grin down at her and relish the feelings swarming over the two of you.....<br>\r\nYou have become new lovers,....you exist only to please the other...and you feel her mind in wonderment as these new feelings....stronger than any love she had felt in her life....overcome her,...become her life....and she falls madly, deeply in love with whatever you have become.....<br>\r\n\"OOOOOOOOOOOOHHHHHHHHHHHHHHHHHHHH....ILLEA!..l..FEELS SO GOOD!!\" Lisa groans out as she then finds great strength in her limp arms....and wraps you with them...her strength like that of a hundred men....<br>\r\n\"AAAHHHHH.....My precious......me love....\" you answer her as you then resume kissing her panting lips and mouth........as you race the two of you toward a joint orgasm...........<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,\" you both moan out, as you reach down and paw one of her bobbing teen's tits, the titty flesh feeling hotter, and more sweat covered, as you both work for the orgasm to end all orgasms....<br>\r\n<br>\r\n<br>\r\nwhat next?????</span></div></div>",
            "created":1246826760,
            "id":719229,
            "title":"Tell a tale of awesome sex and a life as the We..."
        },
        "1211111212222":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "\"And then... I turned her round and fucked her ass!\"",
                "You can't take it anymore. Pump her full and eat her, already!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...\"<br>\r\n<br>\r\nYou stop to see how you should explain it. The memory is quite clear. Blond, topheavy Illea, walking by the lake, no idea in her head she was about to be fucked silly and the eaten. How you crept up behind her. How she stopped, paralyzed with stuttering fear as your hot breath touched her neck. How your sharp claws snapped open teh back of her dress, how she screamed as your monster cock found her slit...\"<br>\r\n<br>\r\nIt's all too much. You're not even really aware of havning dropeed your disguise before you realize Lisa is standing just as paralyzed as her late lover, and that the same cock that gave both Illeas holes a pounding is pressing hard against her back.<br>\r\n<br>\r\nOh well, might as well make the most of it. She draws in her breath to scream, but you place one hand on her back and the other on her stomach and bend her over, pushing the air from her lungs. Then she makes a good try of it as you plunge your cock into her, but of course, with no air...You push her down against a rock, pleased to find your deception had her so wet you slide right up into that unbelievably tight passage, grunting in pleasure as you penetrate her maidenhead and bottom her out in one fell swoop.<br>\r\n<br>\r\nYou pound into her, her gasps and sobs of pain, terror and denial driving you on. She's unbelievably tight, nearly as tight as Illea's ass was. The thought sets you on fire to pound harder, pressure building in your balls.<br>\r\n<br>\r\n\"I snuck up behind her and tore her clothes off\", you manage between your own gasps of pleasure. And bent her over and fucked her... and then... and then...\" </span></div></div>",
            "created":1226798520,
            "id":608183,
            "title":"\"THIS happened!\""
        },
        "12111112122221":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Well... it's a meal, then...",
                "If you save her for your next feedings, she'll be juicier and more developed..."
            ],
            "content":"<div class=\"\"><div> <span>You sense you are either about to climax or just start swallowing the young beauty, but this is the best sex and the most fun you've had since... well, since it was her big-titted lover that bounced up and down your cock and got a nice helping of Weybren sauce up her ass to keep her company while she digested. Reliving it is too good an opportunity to miss!<br>\r\n<br>\r\nYou pull back, and then instead of slamming into her, you pull out. You balls tremble in protest, and its all you can do not to soil her back with your cum.<br>\r\n<br>\r\n\"And then...\"<br>\r\n<br>\r\nYou turn her around, and she is too terrifies to scream, certain you are going to eat her now.<br>\r\n<br>\r\n\"And then I FUCKED HER AAAASSSS!!!\"<br>\r\n<br>\r\nYou slam up into her bowels as you say it, the girl finally finding breath to scream as you slamfuck her up and down your shaft, her breasts jiggling in miniature copy of her late, digested lovers'<br>\r\n<br>\r\nIt can't last. You balls finally empties what feels like gallon of cum into Eva's poor ass, and you fuck her even more wildly as the last drops go up into her...</span></div></div>",
            "created":1239318900,
            "id":673187,
            "title":"\"And then... I turned her round and fucked ..."
        },
        "121111121222212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Outfox the hunters and grab a snack from a farm",
                "Wait and see if some stupid girl or boy comes running alone, first."
            ],
            "content":"<div class=\"\"><div> <span>With a final grunt, you let the used and abused girl slump down on the ground, your twitching cock still dripping the last helpings of gooey monster sauce onto Eva's ravaged ass. That... that was some fuck. Easily the best you've had since... well since last time you were awake, anyway. Illea did have finer bouncing globes, but this little girl... talk about tight!<br>\r\n<br>\r\nThinking of Illea makes you remember what followed the ass-fucking last time. Your stomach nearly rumbles, despite the helpings you've already had. You remember Illea sliding down your gullet, somehow screaming even louder than when you ravaged her, you remember those breasts, that wriggling ass, those desperately kicking legs...<br>\r\n<br>\r\n... and that, in the end, is what stops you from seeing if Eva digests as quick as her big-titted ex. The girl is in shock, pretty much catatonic. Illea was fairly well-used by the time you got her, after all, unlike Eva, and you've fucked the poor girl so hard and you came so much you're actually surprised your semen isn't running out her nose and mouth. She probably won't even make a whimper as she goes down, and where's the fun in that?<br>\r\n<br>\r\nNo, all this screaming should bring a fairly large group of people hunting for you soon. Best to make yourself scarce. Maybe you can re-do that trick you did two sleep cycles ago, when you found your way into one of the cabins they'd placed the girls in, while the men were out hunting?<br>\r\n<br>\r\nEva will keep. A few more snacks, and you can sleep for a while. Either you'll see her again in a few years, and you can finish what you started and give her another ride, or you'll awaken to find she has a daughter or granddaughter about the right age to continue an unpleasant family tradition. You've long since learned the effect your semen has on someone - though most don't have an opportunity to experience their increased sex drive and fertility while screaming and digesting in your belly, of course. You don't know why that is, but it's probably the reason there's still a village here... </span></div></div>",
            "created":1264503180,
            "id":825927,
            "title":"If you save her for your next feedings, she'..."
        },
        "121111122":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "But for his belly?",
                "Or for that raging hard-on?"
            ],
            "content":"<div class=\"\"><div> <span>Your last meal kicks her last, terrified breaths away in your stomach as you slide a bit deeper into the water, just your eyes showing amidst the reeds. A good thing, too. The girl that's coming towards you has you working up a grin that shows every single one of your razor teeth.<br>\r\n<br>\r\nShe's a redhead, not too tall, not too short... and possessed of the second best pair of breasts in the entire village. Well, best now, you suppose, since you finished digesting the blond they called Illea just a few hours ago. Water drips of her skin, sparkling in hte sun, and with every step, those round, soft globes heave...<br>\r\n<br>\r\n<br>\r\n\"Eva? Eva?\" <br>\r\n<br>\r\nLeaning back, you realise she must be calling for the snack you just finished. She's almost inside the reeds with you now, the first strands brushing her naked thighs, water dripping lazily from the red hair between her legs.<br>\r\n<br>\r\n\"You know Amber says we shouldn't go alone. The Weybren could take you.\"<br>\r\n<br>\r\n<br>\r\nOh yes, the Weybren WILL take you...<br>\r\n<br>\r\n <br>\r\n<br>\r\n</span></div></div>",
            "created":1197867600,
            "id":476439,
            "title":"15 year old Sara"
        },
        "121112":{
            "choices":[
                "Have Fey meet you again, as her father.",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>You shift a little watching auburn haired beauty, her blue eyes captivating, her developing body a sight to behold, even for you, The Weybren. You feel a stirring in you groin and smile...to yourself.<br>\r\n'Yes...I have fed enough for the week...Let's have some fun with the young one....\" you think as your thick cock grew to it full length, while watching the young thing move about near your watching spot.<br>\r\nYou see she is now laying down on the thick carpet of grass, intent on exploring her naked body...so you know what you must do....and you walk a little way from her...then your body starts to change.....you had just remembered what her father looked like...you have seen him in the fields...and you smile as you morph into him...<br>\r\n'This will be so easy....seducing my daughter...' you sigh once more as you feel the changing finish...and where had stood the Weybren...there was now farmer Fred Jones.... and the father of the beauty near by....his third dauther.....named Fey, and soon-to-be the new love of his life.....<br>\r\nFey was just starting to finger her wet, sliming pussy, as she had done for the last week, ever since she had found the pleasures of masturbating one's own sex. That had been when her oldest sister Gloria had taught her these unknown joys...and since then she had been hooked....Fey wanted to be naked all the time...and wanted to make herself come and come....She also marveled at how her flat chested self, had suddenly, unexpectedly sprouted these wonderful, feeling, and quickly growing breasts...and the topper were her ever sensitive nipple nubs, that stayed erect, puffed out, like thick strawberries....ready for someone to suck on them, or touch them...Suddenly her revelry was broken by someone coming toward her....and she sat up very afraid.<br>\r\n'Was it the Weybren?' she gasped....and closed her eyes...ready for herself to be eaten up.<br>\r\n\"My, my, my...Fey?...what are doing all the way out here, daughter?\" her father said as he looked down at her, as he stood right over her spread out form. He grinned at her, but her eyes were drawn down to where his farmer's pants were obviously tenting out... showing he was aroused....and his dick was ready for sex.<br>\r\n\"Uh...uh....I can't help it, Father...I am just so horny now.....I just can not help myself....\" fey sighed as she laid back and resumed rubbing her frothing, creaming sex lips. In her ministrations she was also rubbing her elongated clitoris. She closed her eyes and laid there, moaning and groaning as her erotic behavior permeated the area.<br>\r\nHer father said something that Fey never heard....her mind swooning at being this close to a male....in this state of mind....Fey just kept rubbing herself....her hands and fingers now coated with her flood....when she felt more movement...as her father then moved her rubbing hand out of his way....This made her slightly open her eyes,...and squinting up to her Father's beaming face she then felt him guiding a hard device between her spread legs...and to start rubbing it up and down her creaming pussy slit. <br>\r\n\"OOOOOOOOOOOOOOOOOOOOOOOOOOOO...FATHER!\" Fey moaned out as he did that a few times....while she embraced his waist....not knowing what was about to happen, but accepting it as natural....\"Do my pussy,FATHER!\" she sighed once more then pressed herself, her tight-fitting, virgin pussy onto his hard shaft.<br>\r\nThe Weybren, as her father smiled as he answered her wish....as he then in one swift move plunged the thick, full length of his cock deep into Fey's pussy, and held it there as she got over the initial shock of her hymen being busted...and a thick cock deep within her virgin's vagina.<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAA...IT HURTS!\" Fey sobbed, as tears fell, while she laid there, filled to fullness she had never thought was possible...and by her own father's cock. He reached up and calmly kissed away her tears...as grew accustomed to being so filled.....he then reached down with one hand and began lightly, but firmly rubbing around her still elongated, throbbing clitoris....which made it feel better....<br>\r\n\"OOOOOOOOOOOOOOOOOOOOHHHHHHHHHHH, FATHER!\" Fey moans more...overe and over....while not moving....but the pain then starts to recede.....and she feels her sexual awakened body start to respond to her father's rubbing her pulsating clitoris....<br>\r\nAnd to the hardness of his unmoving cock deep inside her belly...and to the nearness of him just above her prone, captive body....captured by his invading dick....maleness!<br>\r\n\"AAAAAAAAAA, Father....it feels.......\" she now pants out....as a switch within her is thrown....and her her young, developing body starts to move on it own accord.<br>\r\n\"I just want to say....dear Fey, that I will never hurt you....And I have done this very thing to your two eldest sisters.....ever since your mother was eaten by the Weybren....\" you gently smile at the now responding Fey, you notice her erect nipples are even more thicker.....then you continue,\" I would never hurt you....but can I move within you now, dear Fey?.....I promise the pain will disappear....you will be receiving a lot of pleasures....in a little bit, my love...\" you sweetly look down onto her tear-stained face and the corners of her mouth curve up into a smile...she nods, then adds in a sexy-laced voice, one you had never heard before...<br>\r\n\"Show me....father.....show me how much of a woman I have become....*pant*...\"  and she draws you even harder into her....as she moans.<br>\r\n\"Good Fey...here I go.....I will start slow.....so you can match my speed....mmmmm!\" you say as you then start the easy, slow pounding of moving your thick cock, in and out, in and out, of her tight-feeling pussy. You then feel her groan once more...then she mashes her lips onto your neck...while she sets her own humping speed....<br>\r\nYou smile to yourself as you feel her speed up another notch,...and with a growl you speed up too.<br>\r\n\"OOOOOOOOOOOOOOOOOOOOOOOOOOOOO..IT FEELS SO GOOD......\" she growls out too...then she adds, \" FUCK ME FATHER...FUCK ME, FATHER!\" and says that over and over....as she becomes lost in the act of being fucked by her own father...and fucking him, loving him back. In her bewildered mind, she was forever her Father's lover, even if she had to share him with her sisters.....she loved him, loved his cock...how he felt,...how he held her.....as she become his lover....and he was her life!<br>\r\nYou, as the Weybren...as her father, smiled down as you read these thoughts, and sped up your fucking this delicious morsel...glad you would never eat her...nor her sisters...<br>\r\n'This girl...will become one of my many wives....along with her sisters...And using their father as the pawn....what better way?' you laugh as you keep ponding Fey, and for how long?....for how many times did you both come?... who was to say?<br>\r\nAs you deposited the exhausted, sleeping, cum-filled girl near the back door of her father's farmhouse, when no one was around, you kissed her once more, bringing a small smile to her flushed face.<br>\r\n\"Sleep little one...we will see each other again....\" you say as her father....then with a 'Poof!' you silently change to air....and disappear into the woods....<br>\r\nFey seems to awake then, and seeing she is right by the farmhouse....and seeing she is covered with juices, she smiles to herself...as she stands on weak-shaking legs. As she walks into the house she smiles to herself....<br>\r\n'Yes, father....we will do this a lot more...from now on!' she thinks as she closes the back door...and goes to get cleaned up....<br>\r\n<br>\r\nwhat next?</span></div></div>",
            "created":1200459600,
            "id":487675,
            "title":"Change into her father, or other male relative?"
        },
        "12112":{
            "choices":[
                "play with her?",
                "watch her, then get her?"
            ],
            "content":"<div class=\"\"><div> <span> Twenty three year old Amber decided that the eight girls would be safe her for the time being. She wanted to go for a walk, and she knew that the males of her village never went into this area. So got out of the water, and decided to walk around the forest in the nude. She decided to stay close by the pond, just in case. <br>\r\n<br>\r\n Amber was an incredibly beautiful young lady. She had greenish eyes, medium length blonde hair, and a killer figure. As Amber walked around, she thought that she heard something near by, so she went to have a look. <br>\r\n<br>\r\n You (the Weybren) see the elder, a beautiful young woman with long blonde hair approaching you. As she gets closer to you, you read her mind; you have many abilities, like the ability to change your form at will, and the power to become invisible. She is within feet of you, and you decide too...</span></div></div>",
            "created":1120798800,
            "id":260225,
            "title":"the elder gets closer."
        },
        "121121":{
            "author_name":"libbylingers",
            "choices":[
                "give in to hunger and ravish the girl",
                "satisfy the lust and carress her from head to toe"
            ],
            "content":"<div class=\"\"><div> <span>Amber, being the oldest in the group was assumingly the smarteast but with loveliness, certain sacrifices had to be made, in Amber's case it was coommon sense.At 23yrs of age, her 5ft9inch frame carried all 118lbs in statuesque finnesse. Silky soft, milky white skin made for a tantalizing vision,trussels of blonde hair gingerly cascaded over her lovely face further adding to her mischievious child-like carefree persona..two beautifully sculpted long legs carried down to dainty ankles that supported the most beautifull bare feet, a tinge of pink nail polish accentuating perky toes. A pair of breasts, so round so perfect, along with her well groomed pubic area only  served to establish her womanhood..a womanhood that saturated the air with her aroma..an aroma that only served to fuel my beastly desire to feed/ravish...\"Silly girl,this Amber,\" I think as I transform into what could be her twin,except for reddish hair..she stands in front of me and holds a tiny hand up touching my face,'Who are you?' she asks bewildered..'..do I know you?' Don't be silly M'Luv..I respond as I cup her hand with both of mine..Please join me and walk together,I say to her. Transfixed, she opts to accompany me as I lead her to the woods far away..</span></div></div>",
            "created":1121576400,
            "id":261896,
            "title":"silly Amnber"
        },
        "121122":{
            "choices":[
                "took her back to his den to mother his child",
                "killed her and had some fun with the girls"
            ],
            "content":"<div class=\"\"><div> <span>Amber slowly walked through the woods, unaware of the pair of orange eyes that followed her, taking in the sight of her breasts bouncing slightly, and deciding her fate. the weybren decided to get a little closer, so transformed into a young man of the same age, but with shorts on. <br>\r\n\"hi\" it called to Amber, running up along side her.<br>\r\n\"ah\" she squealed and attempted to hide behind a bush to conceal her nakedness, but the waybren caught her arm,<br>\r\n\"its ok, ive already seen you naked, so whats the point of hiding? besides, i would like to get to know you better, if thats alright?\"<br>\r\n\"well, ok. but i would still like to get some clothes on\"<br>\r\n\"alright, lets go back to the girls\"<br>\r\nthey both walked back to the pool and amber put some clothes on. they talked for a while while watching the girls, the waybren using all its intelligence of humans to do so, then it said,<br>\r\n\"do you want to go somewhere a little more quiet?\"<br>\r\n\"yeh, sure\" Amber replied, and the two walked deeper into the forest, away from the girls.<br>\r\n\"you know, i was wondering if you want to do something with me\" said the waybren<br>\r\n\"oh sure, whatever\" Amber said. then the waybren unbuttoned her shirt, and threw it on the floor.<br>\r\n\"oh, yes\" she said, removing her skirt, leaving them both in underwear, then the waybren ripped off her bra, and licked her breasts round in circles, then without looking, lowered her panties to the floor, and felt her wet patch.<br>\r\nthen she kneeled, and slowly pulled down his shorts, revealing his huge, erect cock.<br>\r\nhe lay her down on the forest floor and slowly she guided his cock into her wet vagina, and he shoved in, again and again, and he shot his load into her, and she shot hers out.<br>\r\nthen the waybren...</span></div></div>",
            "created":1126933200,
            "id":273494,
            "title":"decievence"
        },
        "1211222":{
            "author_name":"Gradient",
            "choices":[
                "Eat her",
                "Have your way with her"
            ],
            "content":"<div class=\"\"><div> <span>Amber makes a quick and delicious snack, but even your pre-meal activites haven't satisfied you entirely. You creep back to the pond, eyeing the remaining girls. You spot one making her way towards you; she's a little young, but she'll more than do.</span></div></div>",
            "created":1151989200,
            "id":328556,
            "title":"Next victim"
        },
        "12112222":{
            "author_name":"Gradient",
            "choices":[
                "Eat her",
                "Leave her"
            ],
            "content":"<div class=\"\"><div> <span>You rab the girl and drag her into the bushes in one swift movement. Clamping a huge hand across her mouth, you bring your snout close and breathe in her scent with an appreciative rumble. She pants heavily, her eyes wide as you snick away her clothes with ease. She's young, but she looks the right age for this. You grab your member and hold it near her face, whispering, \"guess where this is going!\"<br>\r\n<br>\r\nShe shakes her head vigorously as you guide it down her body. She screams from under your hand as you thrust into her, your body becoming hot as you copulate with the girl. Soon you feel satiated, but you feel another hunger coming on...</span></div></div>",
            "created":1151989200,
            "id":328557,
            "title":"Doing the horizontal monster mash"
        },
        "121122221":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Return to your cave and sleep a while - avoid overeating",
                "One more snack... and fuck."
            ],
            "content":"<div class=\"\"><div> <span>The girl lies on her back, eyes wide with shock, whimpering in pain and fear as you slowly pull your huge member out of her no-longer-very-tight pussy. She looks so delicious, her nude body glistening with sweat and water, long, clotish legs quivering, baely developed breasts heaving... and, of course, thick, gooey semen slowly running out her ravaged vagina, and dripping from your slowly relaxing member onto her lower belly.<br>\r\n<br>\r\nYou just can't help yourself.<br>\r\n<br>\r\nWith a quick motion, you scoop up the terrified girl, stifling a cry by simply pushing her head deep into your throath. Her entire body is shaking, and even though it's reasonably muffled by your flesh, muscle and skin, her terrified screams and denials pretty much makes certain that by the time her budding breasts - ow, how sweet to your teeth, her ravaged pussy and wriggling ass, and those fine, coltish legs have all disappeared down your gullet, your cocl is rock hard and ready for more again...</span></div></div>",
            "created":1158296400,
            "id":346696,
            "title":"bad luck, little girlie"
        },
        "1211222212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Wait for whichever teen sneaks off alone",
                "Hmm... 13 year old Eva and 15 year old Sara seems to go off together..."
            ],
            "content":"<div class=\"\"><div> <span>With both Amber and the girl digesting in your belly, and both of them getting a last roll in the hay before their horrible demise, as well (though only Amber seemed to enjoy it...), one would think that you would have satisfied both your belly and your cock. But that last one was just an appetizer... and her desperate fear turned you so on you don't think you could eat another without spewing your semen all over yourself...<br>\r\n<br>\r\nAnd that's just a waste.<br>\r\n<br>\r\nSo now, all you have to do is choose...<br>\r\n</span></div></div>",
            "created":1197867600,
            "id":476440,
            "title":"One more snack... and fuck."
        },
        "12112222121":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "It's Eva, 13, brunette and beautiful ass.",
                "Doria, 14, dark-haired and mysterious."
            ],
            "content":"<div class=\"\"><div> <span>It seems to take forever. Normally, you are a very patient predator, but just now, your cock is so hard it's almost twitching, your teeth salivating, and your belly rumbling as if a grown woman and a teenaged girl hadn't just spent their last moments trashing about while you digested them.<br>\r\n<br>\r\nAnd all those morsels, right in front of you! Naked, just waiting to be stuffed and eaten! You are slowly stroking that monster erection, waiting, waiting, watching the bouncing breasts and the dripping thighs, the beautiful asses breaking the waterline...<br>\r\n<br>\r\n..until somebody finally does what you've waited for, and gets up alone...<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1212728400,
            "id":541037,
            "title":"Wait for whichever teen sneaks off alone"
        },
        "12112222122":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Eva and Sara are going for some... quality time...",
                "They're gonna meet some boys."
            ],
            "content":"<div class=\"\"><div> <span>You sneak around for a little while, watching the nubile young bodies, your eyes glued to every movement they make. Every bouncing breast, every flash of dripping wet thigh, every ass begging to be fucked... After a short while, you find yourself slowly jerking your foot long monster erection. It just seems none of them are ever going off alone.<br>\r\n<br>\r\nJust when you are on the verge of just storming over and grab one to eat and one to fuck (and then eat, more likely than not...), screaming and discovery be damned, you finally see one of the morsels going away. And what a morsel it is!<br>\r\n<br>\r\nLeggy, chesty and red-haired, Sara has been turning the boy's heads for some time - not that you really know this. You just see that red-haired girl with the great breasts silently slip out of the water while the others play. The straining erection in your hand nearly erupts at the sight. You remember seeing that girl around earlier... one of the boys followed her behind a rock and was trying very hard not to shout to the entire village that he was coming just a minute later. In fact, she's just lucky she's not already met your belly. You were just about to grab her when you spotted Illea, possibly the only teen in the village with a better rack...<br>\r\n<br>\r\nThe thought of what you did to that young, blonde girl almost sends you over the edge again, and by the time you're climbing onto land to follow the redhead, you nearly swear out loud as another girl has beaten you to it. Then you catch sight of said other girl, and think it might have possibilities, anyway. She's a tad younger, about the age of the girl who just screamed away her last seconds in your belly, and not at all badly developed. Not as well endowed as the redhead, perhaps, but that ass...<br>\r\n<br>\r\nAs you wait, you see the naked redhead reappear, silently and quickly beckoning the brunette to follow her.<br>\r\n<br>\r\nShe obliges.<br>\r\n<br>\r\nSo do you. </span></div></div>",
            "created":1201582800,
            "id":492250,
            "title":"Two of them? Hmm..."
        },
        "121122221221":{
            "choices":[
                "a stupid boy....who you.....",
                "other...."
            ],
            "content":"<div class=\"\"><div> <span>Sara, her long red hair falling down her backside, and Eva, a good looking, angel-faced blond go over to a secluded area of the lake. You follow, as an obedient puppy dog, intent on just watching the two...<br>\r\n'I just wonder....would they?' you think as you see Sara leading the other to her 'secret, hidden spot'! As soon as they stop, Sara turns Eva around until they are facing nose-to-nose, breast-to-breast, and takes the willing, obliging Eva into her arms. Sara then starts kissing and rubbing Eva all over, while Eva just holds onto the commanding, controlling older girl, her moans starting to resonate. All the while Sara, maneuvers Eva down onto her backside, spreading Eva legs, and begins administering on her lovely, likeness of her feminine side. Their lips repeatedly collide, then separate as Sara, the one in control, orchestrates the love fest, and is soon diving her head down to start licking, sucking, mauling Eva's breasts, nipples, and opened thighs. <br>\r\nYou, as the Weybren just smile as you stand there, your elongated cock in your mitts, you slowly stroking the tool as you watch Sara at work. Soon you can hear Eva's moans, and you speed up your stroking in time with Sara's now sucking mouth on Eva's sliming pussy slit...<br>\r\n\"Oh...OH....OH....OH.....OH....OOOOOOOHHHHHHHHHHHHH!\" sighs out Eva, as she can only squirm and thrash about, under the total mastery of Sara's expert tongue and hands.<br>\r\n\"MMMMMMMMMMMMMMMMMMMMMMMMMMM...GOOD PUSSY!\" moans out Sara, as she munches and licks, and drinks down Eva's flooding nectar.......unaware that you, the Weybren are watching the two girls love each other. Soon, Eva stiffens and cries out loudly, not caring who hears that she is coming,...and coming, and coming......<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA...COMING, SARA!....COMING, SARA!\" she screams out over and over. All the while Sara just drinks down what she can suck, and lick into her vacuum like mouth. While you, the Weybren shot off your seed, wasting a little, but giving yourself relief......<br>\r\nAs Eva is gasping for breath after her orgasms, as she lays there in her after glow....Sara crawls over her lover, and sits on Eva's face....with her pussy aimed toward Eva's mouth, her lips, her tongue.....with a firm voice she stated simply.....<br>\r\n\"Now, Eva...eat my pussy....please?....Bring me off as I did you.....please?\" she sighs as Eva does start doing to Sara's pussy slit, as Sara had done to Eva's. While that is going on, you notice someone else is watching them, and their private show...so you silently walk over, unseen....to see who it is....<br>\r\n'Maybe I can eat these intruders...and let the girls go....do their thing?....yeah...sounds like a plan to me!' you think....<br>\r\nWhen you get near these interlopers you find?????</span></div></div>",
            "created":1203483600,
            "id":500342,
            "title":"Eva and Sara are going for some... quality time..."
        },
        "1211222212211":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Eat him.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You sneak through the bushes, droplets of semen still swinging from your strangely still rock hard erection, as Sara begins whimpering out in the glade. A few steps bring you right next to the interloper, silent, invisible...<br>\r\n<br>\r\n... not that it would matter if you made noise. The sandy-haired 14-year old hidden from the two girls in the bush wouldn't notice if you started singing \"Deck the halls with teenaged rump-steaks\" right next to him. His eyes are locked onto the two girls, on Sara's heaving breasts and sweat-slick body, on Eva's face disappearing between her older friend's thighs... and his hand is stroking his hard-on so fast you're actually a little impressed.</span></div></div>",
            "created":1209618000,
            "id":526817,
            "title":"a stupid boy...."
        },
        "12112222122111":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Continue watching... for a while",
                "Satisfy your lusts. Both of your lusts."
            ],
            "content":"<div class=\"\"><div> <span>It dawns on you that you have seen this boy before. He's actually unwittingly saved a few girls before, by doing just what he's doing now. Not only that, but you also remember him never being able to shut up when he cums. He must be close now, since he's already grunting, speeding up his handiwork. There's no way the girls are going to not hear him come, and it's a bit too early for that, so...<br>\r\n<br>\r\nThe boy draws in breath to squeal in ecstasy, and then squeals in terror instead as you clamp your jaws around his torso. You hold there for a second, watching his semen spew all over the bush he's hiding behind, and then a quick flick of your neck sends him to an awful demise in your belly, as you open your jaws to let him pass, kicking and screaming, down your gullet.<br>\r\n<br>\r\nThe girls didn't notice a thing. Eva kneels between Sara's thighs, her ass in the air. Boys are never really filling, and that magnificent rump steak is nearly driving you insane. Your cock is rock hard again, the boy's last agonizing squirms filling you with ecstasy.</span></div></div>",
            "created":1210654800,
            "id":531449,
            "title":"Warm-up snack"
        },
        "12112222122112":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Change into that girl you fucked and swallowed and let him do the work...",
                "His ass is probably just as tight as any of the girls'..."
            ],
            "content":"<div class=\"\"><div> <span>Your first instinct is to just swallow the interloper. You've seen him before . at least one girl you were supposed to have your way with was scared away by his total inability to keep quiet when he comes - and he's going to come rather soon, judging by the way he's jerking his admittedly rather impressive tool. Besides, why is he sitting here jerking off when teh little morsel with her ass in the air isn't going to notice him before he's shoved his dick upp her ass? You even know the red head has sucked him off before - you heard him tell the entire island that he was cumming and that \"Sara\" should swallow it all - which she probably did.<br>\r\n<br>\r\nSuch listlessness deserve nothing less than digestion in our stomach, but...<br>\r\n<br>\r\nYou were supposes to fuck that girl so senseless she wouldn't even mind being swallowed. You sort of figure this guy owes you a fuck...</span></div></div>",
            "created":1212901200,
            "id":541737,
            "title":"Debts to be paid..."
        },
        "121122221221121":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "He falls for it!",
                "Uh-oh... something's not kosher."
            ],
            "content":"<div class=\"\"><div> <span>Out in the clearing the red-head is whimpering in oncoming orgasm, and the boy appears to pace himself a little, as if wanting to time it - or just waiting to see if he can get an even better view. Silently, you stop to consider for a while. It has been a long time since you did what you have in mind, but... it's tempting. t's really tempting.<br>\r\n<br>\r\nBesides, you can just eat him if it fails, anyway.<br>\r\n<br>\r\nYou strive to remember the boy's name. You wonder if it's Evan. That might have been what that red-haired little slut was saying, that time.<br>\r\n<br>\r\nYou take a final, long look at the girls. They'll be at it a while longer, you guess... and tehy'll probably lie around for a while after anyway. Worst case scenario, you'll find them again.<br>\r\n<br>\r\nA moment of deep concentration, and you feel your shape begin to change, growing more lithe, smaller, your skin turning smooth and human, long hair growing on your head as your magnificent boner recedes and then turns inward. By your memory of sight and touch, you mold yourself, and within seconds, there's no visible monster behind the boy... just a naked girl his own age, sandy-haired like him and many villagers here, fine, perky breasts, long coltish legs, a tight little ass...<br>\r\n<br>\r\nEven her ladybits are a true copy. You did get to know them quite well, after all.<br>\r\n<br>\r\n<br>\r\nThe sandy-haired voyeur begins speeding up again. You waste a precious second watching his hand sliding up and down that boner. It happens every time you do this. You've never quite known if you are so good that your mind turns female as well, or if you remember some of what your earlier victims felt and fantazised about. The top of your inner thighs are so wet you certainly realize nothing of your horniness diappeared.<br>\r\n<br>\r\nTwo steps, and you're up behind him, touching his shoulder. He whirls around, panic in his eyes, and only you slipping your hand to his mouth and covering it stops him making an outburst that would have scared away those two girls and ruined everything.<br>\r\n<br>\r\n\"Shh! You'll ruin the show!\"<br>\r\n<br>\r\nYou whisper it to him intently, noting that even in his surprise, he still can't keep his eyes from devouring the supple body you're borrowing. You can't really blame him - you devoured her too, after all. </span></div></div>",
            "created":1223614800,
            "id":593496,
            "title":"Change into that girl you fucked and swallowed ..."
        },
        "1211222212211212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Oooops... that's his sister you've eaten and copied.",
                "He watched you fuck and eat that girl... "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something's definitely wrong. After just a look at your naked body, he starts shaking his head and keeps trying to speak! What could have happened?</span></div></span></div>",
            "created":1223614800,
            "id":593500,
            "title":"Uh-oh... something's not kosher."
        },
        "12112222122112122":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "... and it was the hottest thing he's ever seen...",
                "... guess it is time for a quick snack, then."
            ],
            "content":"<div class=\"\"><div> <span>\"I... but... you....\"<br>\r\n<br>\r\n\"SSSSSHHH!\"<br>\r\n<br>\r\nBy a stroke of luck, Eva seems to find some *really* pleasurable spots, and Sara's screams of pleasure easily downs out both his protests and your shushing. <br>\r\n<br>\r\n\"But...\"<br>\r\n<br>\r\nHe is whispering now, though whether it is because of you or some sort of shock is hard to tell.<br>\r\n<br>\r\n\"But it *ate* you!\"<br>\r\n<br>\r\nOh, crap. He saw it...<br>\r\n  </span></div></div>",
            "created":1238290920,
            "id":667881,
            "title":"He watched you fuck and eat that girl... "
        },
        "121122221221121221":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "\"Sure... want to watch? or... help?\"",
                "\"Later maybe...\""
            ],
            "content":"<div class=\"\"><div> <span>... and you can almost see his cock twitch as he remembers it. Your eyebrows rise as you realize he's actually more aroused, not scared. Probably not the smartest boy in the village, this - might be your fault, in fact - every time you wake up hungry, there is quite the reduction in the gene pool selection of young women. Still, at the moment that lack of fear is what saves him a quick trip down your gullet, until you figure this out, so...<br>\r\n<br>\r\nAnother thing strikes you as his eyes keep roaming the supple little body you borrow. He saw what you did to this girl... and yet, there is no alarm, no one shouting that the Weybren is loose, no delectable morsels fleeing in terror. In fact, this guy is sitting here ready to blow his nuts, possibly just hoping he'll get a repeat show.<br>\r\n<br>\r\nEntertained, you lean in and whisper softly \"I did. She was [i]tasty[/i]!\", the alst orgasmic shrieks from the clearing easily masking both that and the sharp intake of breath you are rewarded with. There is a second you think Evan is going to cream all over your thighs just from the confirmation. His voice is hoarse as he whispers back:<br>\r\n<br>\r\n\"Are... are you gonna get Eva and Sarah, too?\"<br>\r\n<br>\r\nThe only reason you aren't exactly sure what he's thinking of is because he probably can't make up his mind if it's Eva's legs kicking desperately while sticking out of your jaws, or Sarah's magnificent breasts bouncing as you fuck her up the ass.</span></div></div>",
            "created":1264475220,
            "id":825801,
            "title":"... and it was the hottest thing he's ever seen..."
        },
        "1211222212211212211":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "He really wants you to, but...",
                "He doesn't mind at all."
            ],
            "content":"<div class=\"\"><div> <span>You grin, shrug and lick your lips. Despite knowing you're really a horrible, disgusting monster, who's been raping and eating the girls (and a boy or two...) of this village for generations, he still looks to your breasts as they jiggle with the motion. It's the knowing look in your eyes and the wickedness of the grinthat causes him to groan and nearly double over, though. Th little pervert's cock twitches rapidly, a few drops of cum leaking from the pink tip before he somehow regains control of himself.<br>\r\n<br>\r\n\"Oh, Gods...\"<br>\r\n<br>\r\nHe breathes deeply, eyes nearly glazed over. Jeez, this kid is really something. He is not the first person like this you've met - you've been trough a few times, after all, but *damn*. A few of them were grown-ups, duringthe times the village organized a cult and gave you a few meals for free, one famously arguing that from the second her name came up in the lottery, his daughter was dead anyway, and it wouldn't be incest - so why not avail himself of her juicy body before it became mush in your belly? Then, of course, there's always at *least* one girl who thinks she can use you to get rid of her rivals or older sisters or such. Usually, they've been the next into your belly. Occasionally, they just get a ride or two, though, jsut like some of your victims impress you enough to let them live. You know your sperm changes them abit to make them both more fertile and more willing, assuring that there will still be a populated village here the next time you awake (on that note, maybe one of those two morsels out there should be allowed to breed? Worth a thought). Perhaps too high a concentration of Weybren juice in their forebears causes people like this? <br>\r\n<br>\r\nIt bears consideration. It's certainly more than interesting enough to let the boy live for quite a while yet. Besides, the echoes of the girl whose form you are in really wants to feel that sperm he's so busily containing on her breasts, or most other places his cock can deposit it.<br>\r\n<br>\r\n\"So... It seems you don't exactly mind me having a snack?</span></div></div>",
            "created":1272762540,
            "id":876595,
            "title":"\"Sure... want to watch? or... help?\""
        },
        "121122221221122":{
            "author_id":"robbierabbit",
            "author_name":"Rabbit",
            "choices":[
                "Decide to swallow him, but you'll only be able to eat one of the girls now.",
                "You toss him into the bush, you'd much rather have two delicious girls instead."
            ],
            "content":"<div class=\"\"><div> <span>...so with that in mind you crawl towards the sandy haired pervert crouching behind the bushes until you're close enough to breath down his bare back. You admire his dedication to his dick as he continues to pump harder and harder, oblivious to your massive body hovering above him. Within a minute he reaches his climax and begins to grunt. However, before he can yell out in ecstasy, you wrap your claws around his mouth and violently grasp his balls with the other as you hoist his naked body up into the air. <br>\r\n<br>\r\nSqueezing his balls causes him to awkwardly cum all over his smooth body, covering his hairless belly with the white sugar. He tries to scream out to the two girls but they're too busy playing with themselves to even hear his muffled cries. <br>\r\n<br>\r\nHe starts to kick his legs but his toes are unable to reach the ground despite his efforts. As he struggles you begin to rub your stiff penis along his tiny butt. Within a few moments his semi-hard cock, his sandy haired balls, and virgin ass are soaked in your leaking semen. Yes, you're definitely enjoying this. You're going to teach this boy that he can't go around stepping on your territory and get away with it. <br>\r\n<br>\r\nAll of a sudden you ram your stiff penis into his fragile body. He screams loudly, forgetting that no one can hear him with his mouth covered up and start pumping louder and louder as you try to keep yourself from moaning. You notice that the boy's penis is starting to grow rock hard again despite having cummed minutes ago. <br>\r\n<br>\r\nCould he really be aroused? You're really impressed by this but soon realize you're fun is going to have to end. You tighten the grasp around his mouth, blocking the air from flowing in. The boy starts to feel a little drowsy as his body starts to go limp on you. Now you think about what you're going to do with him. You could always just gobble him up and be done with him. But then you there's a chance you won't have room for the girls and you've been dying to eat them for a while now. Either way you have to decide fast because you the girls' moaning is getting louder, so you......</span></div></div>",
            "created":1221282000,
            "id":581845,
            "title":"His ass is probably just as tight as any of the..."
        },
        "1211222212211222":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "So cum in the boy's ass, and eat!",
                "But you want to fuck them first..."
            ],
            "content":"<div class=\"\"><div> <span>You pump him up and down, considering and trying to think of something besides your hastily approaching orgasm. What to do, what to do?<br>\r\n<br>\r\nAt last, there are three deciding factors for you. First, the boy's rock-hard penis. A guy who can get it up as fast as this, might make the girls more... appreciative and easier to get alone. The most important parts, though, are Eva's gorgeous ass and Sara's two ripe melons. Not a question. Those two girls are heading for your belly!</span></div></div>",
            "created":1222405200,
            "id":587434,
            "title":"You toss him into the bush, you'd much rath..."
        },
        "12112222122112221":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Eva first! You want to savor the redhead.",
                "The redhead first! Those breasts will be yours!"
            ],
            "content":"<div class=\"\"><div> <span>You can't take it anymore. This is indeed one of the tightest asses you've ever fucked. Your hand slips slightly from his face as you increase the pace, and you here him draw in breath as you slam his body up and down on your cock. Any... second... now...<br>\r\n<br>\r\nOut in the clearing, Sara's whimpering are reaching fever pitch, Eva's untrained tongue finally finding the sweet spots. The redhead's beautiful body starts convulsing, her magnificent breasts shaking and jiggling as she starts coming. <br>\r\n<br>\r\nBack in the bushes, the redhead couldn't have come on a better time. Your balls explode with the last few strokes, hot sperm filling the bowels of the boy. If you had been able to think about anything other than pure bliss and milking your raging climax with the hapless boy's body, you might have grinned at what appetite for sex this boy is going to have, and how easily he will father children... many of whom you will fuck and eat when next you awaken. At this moment, though, it is only your spurting cock and his warm ass.<br>\r\n<br>\r\nYou let him fall to the ground, spilling a few last drops, and idly noting in your post-orgasm daze that fresh semen is spilling from his cock, too. He went and came! <br>\r\n<br>\r\nThe daze leaves as it came.<br>\r\n<br>\r\nTime to eat!  </span></div></div>",
            "created":1225857120,
            "id":604035,
            "title":"So cum in the boy's ass, and eat!"
        },
        "121122221221122211":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "...And now, the main course: Double D redhead a la carte! ",
                "... and look what's ready for action again! Sara canget that ass-fuck she wanted"
            ],
            "content":"<div class=\"\"><div> <span>Sara lay on her back, her orgasm slowly subsiding, but her body still twitching as Eva apparently decided she just didn't want to sop that miraculous little tongue of hers. She'd known she had to get Eva to do this ever since she heard the sounds Rory made as she blew him. Anyone who could make a boy cum like that during her first ever blowjob *had* to be a natural. Assuming Eva didn't just blew out ehr heart with this, Rory would be allowed a good ass-fuck today.<br>\r\n<br>\r\nAnd of course, so he had, just not like Sara intended.<br>\r\n<br>\r\nSomething wet touched the inside of the topheavy fifteenyear old slut's thigh... and tehn the otehr thigh. And Eva's tongue was still in her pussy, but the suddenly disappeard! What..?<br>\r\n<br>\r\nSara opened her eyes, trying to clear the fog of her orgasm from her eyes, and froze, mouth agape.<br>\r\n<br>\r\nThe Weybren was here. The Weybren, huge and green and terrible. The Weybren, with a half-erect, cumdripping cock about the size of her underarm.<br>\r\n<br>\r\nThe Weybren, with his long tongue lifting her 13-year-old lover out between her legs, its long tongue rolled about the sleek, blonde girl's slick thigh and tight stomach. Eva was screaming quite loud enough for the both of them, and then the Weybren's huge arms closed about her, grabbing her breast and between her dripping thighs with a grunt, spread his jaws wide and gulped her down. <br>\r\n<br>\r\n******<br>\r\n<br>\r\nEva begins screaming as her blonde locks pass your teeth, and as you slip her upper body in, retracting your tongue and tasting her small, perky breasts, you groan in contentment. The taste of sex, youth and mind-numbing terror... it is like no other. She kicks desperately, causing your hand to slip on her groin and two figners to slip right up her virgin fanny - which just causes her to kick all the more. You can't take it - you jsut shove her down, licking at her trashing thighs and hearing her scream tun to gargles and then desperate shrieks as she hits your stomach and you start digesting. Oh, what an appetizer... <br>\r\n<br>\r\n<br>\r\n<br>\r\n    </span></div></div>",
            "created":1246411680,
            "id":716948,
            "title":"Eva first! You want to savor the redhead."
        },
        "121122221222":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "A threesome... or foursome? Fivesome? In the making...",
                "Sara's gonna do her boyfriend, and Eva's gonna watch from the bushes."
            ],
            "content":"<div class=\"\"><div> <span>The two girls sneak through the forest next to the water, and you have no problem following them at a distance. Your cock is strutting, pulsing, demanding some satisfaction, and the quick glimpses of naked, young flesh you get up ahead is doing nothing to release it. In your mind, you plow into the red-head's behind while the young brunette disappears screaming down your gullet, and you feel your erection twitch, so hard now it's nearly grinding up into your stomach.<br>\r\n<br>\r\nThe fantasy is exquisite. You can feel the brunette's skin and yielding breasts against your tongue, her legs kicking desperately in the air. The redhead is incredibly tight around your pulsing organ, and as you swallow down her friend, you are going to pump her full of your come, again and again...<br>\r\n<br>\r\nThe daydream almost makes you walk straight into them when they stop, and the moment before you're about to rush out of the bushes, you here other footsteps.<br>\r\n<br>\r\nA trap? You fade into the bushes. Youi don't really think so, however. The redhead is talking about someone named \"Hank\", and both girls are blushing and giggling... and you can easily smell the musk of their arousal... </span></div></div>",
            "created":1201582800,
            "id":492255,
            "title":"Narrowly avoiding horrible death... for now."
        },
        "1211222212221":{
            "choices":[
                "you continue to watch them get each other off.....",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>You can not believe your luck, as you had almost been discovered, yet...you had the presence of mind to get back under cover...From your vantage point, you see that Sara, with the brunette standing by her, talking with the someone named 'Hank\" who also has a few girls around him, hanging onto his muscular body like some god. You snicker to yourself...then smile as the redhead named Sara leads him and the others to this place you are standing in. You slink into the shadows and get comfortable. You are in no rush, your belly is full....and the voyager inside you wants to watch what these kids, these children do......You do not have long to wait....<br>\r\nAs soon as Sara has Hank in position, she bids him to lie down, on his back, his hard cock pointing straight up into the air. She grabs a gentle hold onto it, begins to pump it with her hand, then she leans down and guides the thick, long, meaty cock into her mouth. The other girls all go 'oooohhhhh...and aaaaahhhhhhh' as they watch her start to suck and lick his dick...giving him a good start on a blow job. Hank grabs a dark haired girl, with small tits, and begins kissing her lips, while his fingers start probing her sliming sex, which makes her squeal and hug him with her arms....<br>\r\nSoon the others, all girls, are over each other,....no matter where you look there are girls kissing, sucking, probing pussys with fingers, tongues.....and the place is filled their moans, groans, ahhsss...and ooohhhssss....you smile as you watch...knowing they are doing this for you...a sexual show, that they fill is unobserved....but you know better.....<br>\r\n<br>\r\nwhat next??????????</span></div></div>",
            "created":1203483600,
            "id":500363,
            "title":"A threesome... or foursome? Fivesome? In the ma..."
        },
        "1211222212222":{
            "choices":[
                "you are now the girl you had prior eaten.....Illiya!",
                "other......."
            ],
            "content":"<div class=\"\"><div> <span>Sara, the leggy, red head with a very nice sized pair of teen breasts heaving on her still developing chest kneels before Hank, the boy, and starts sucking on his boys cock. Meanwhile Eva, her brunette girl friend, her own perky tits being mauled and sucked on by the boy's mouth gasped and pawed at her own creaming sex.<br>\r\nYou, the Weybren just stood there, watching the mini orgy as the three kids maneuvered around. Soon Hank was laying on his back, while he and Eva kept their passionate kissing. All the while, Sara was going up and down his hard boy's cock with her mouth....and fondling his heavy ball sacs. Her own hand was now busy prodding her own sloppy getting pussy....her expertize making her moan and groan into his torrid cock meat.<br>\r\n\"OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO...SUCK ME, SARA!\" moaned out Hank, his boy's face contorted with his growing pleasures.<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAA....FINGERING MY CUNT...SO GOOD!\" groaned out Eva, as she tried to sit her pussy on Hank's face....\"NOW EAT ME, HANK! EAT MY PUSSY!\" she groaned.....while she moved her pussy to do just that.<br>\r\n\"Come on...give me your cunt.....Eva!\" he whispered.......all the while you watched these three, and you felt you needed to do something,....anything other than just standing here....<br>\r\nYou felt yourself use your magic....and you morphed ....changed into.......<br>\r\n<br>\r\nwhom?????????????</span></div></div>",
            "created":1204434000,
            "id":504804,
            "title":"Sara's gonna do her boyfriend, and Eva'..."
        },
        "1212":{
            "author_name":"libbylingers",
            "choices":[
                "Weybren is disgusted and goes away pucking",
                "Weybren is just  anxious to continue feeding"
            ],
            "content":"<div class=\"\"><div> <span>The first catch was so easy, almost routine and without challenge rendering the meal bland and without taste; just one swift gulp of the massive jaws and the poor girl(15yrs old or so)was gone as she foolishly swam a not so safe distance from her friends. As she dove she opened her eyes only to be met by the hideuos monster's gaping maw as it accepted her dainty body into it's throat. Above the surface only her bare feet remained as they swiftly dissapeared into the depths giving no indication of her demise to her lovely companiions who nonchalontly played and giggled in complete girly abandon..</span></div></div>",
            "created":1120885200,
            "id":260324,
            "title":"The first, bland"
        },
        "12121":{
            "choices":[
                "She tastes good.",
                "She tastes ok."
            ],
            "content":"<div class=\"\"><div> <span> The Weybren didn't like this particular one, for some reason she didn’t taste right, but that doesn’t mean that these other girls will taste bad. He looked over head, and saw an even younger girl, about twelve, swimming naked above him. Her young breasts where bouncing around as she swam. <br>\r\n<br>\r\n With all the loose weeds around here, he could easily taste her, without her becoming alarmed. If she tastes bad, he will mate with her. If she tastes good, oh well, it sucks to be her ether way.</span></div></div>",
            "created":1120971600,
            "id":260511,
            "title":"taste test"
        },
        "121211":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Don't be cruel to the little girl in your belly, Give her some Company *wink",
                "Hmm..More horny than Hungry, better get a mate"
            ],
            "content":"<div class=\"\"><div> <span>He ran his tounge along her belly, She giggled thinking Seaweed was simply tickling her,She tasted a hell of a lot better than that 15 year old. He laughed and than wrapped his tounge around her, Before she could react he pulled the doomed little girl into his mouth and began to savor her. He could hear her screams inside him whioich somehow only added to her flavor, he moaned at her taste, drooling into the water before finnaly swallowing her down, making a small bulge in his stomach. HE than grinned, patting his belly.<br>\r\n<br>\r\nHE thought to him slef. \"Hmmm..Now do I have room for another?\" HE than thought a little harder. \"Tasting that girl did turn me on...\"</span></div></div>",
            "created":1120971600,
            "id":260517,
            "title":"A Little snack before Pleasure?"
        },
        "1212111":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "You decide To give your Sexual Energy to Jessica",
                "Just eat the bitch and Mate with another girl"
            ],
            "content":"<div class=\"\"><div> <span>Your not quite full yet, you decide it would be better for you, and less cruel to your 'guest' if you swallowed at least one more. You watch under the water and smile as a potential girl starts swimming around. She looks about 14 years of age, \"Kimi? Kimi Where are you?\" Yoiu hjear her calling, \"Little Sis?\" You soon realize she's calling for the girl in your belly...Best have some fun with this one. You shape shift into Kimi, though a little pudger, Kimi having shrunk when you shapeshifted, making it look like you put on a few pounds, You swim up. \"Right here, Sis.\" \"Don't scare me like that sis, You know mom would kill me if anything bad happened to you.\" You giggle. \"Yeah I know..&gt;hey sis, Wanna go play away from these dorks?\" \"Dorks?\" She blushed looking over at a lovly blonde, one you briefly debate mating with. \"Kimi, You know Jessica is my Lover.\" You blink. \"Well she can come to silly.\" \"Fine, whatever, HEY JJESSICA?\" \"Yeah?\" \"My Little sis wants to take a walk, care to join?\" \"SUre Lia, Sweetie.\" Jessica follow, her and your 'sister' hand in hand as you lead them to the woods. \"Hey, Kimi, Did you put on weight in the last few minutes. \"Yeah..I guess so, I must have eaten something fattening, like..another person or something.\" You joke laughing. You lead them well away from the watchful Eye of the group and are pleased to see them making out right before your eyes...You'v enever seen to human girls kiss eachother before and it slightly turns you on...But you decide that's enough and your too hungry to worry about that. \"Hey Jess, Can I talk to my sister alonne?\" \"Sure Kiddo, I just be over there.\" She goes over behind some trees to take a piss. \"Now I have you all alone...my delisious lookign sister.\" Your voice changes as you finish your sentance. \"What..What's gfoing on?\" Lia askes, you shape shift and cover her mouth before she can scream for Jessica. \"Listen to me, bitch, I made a quick meal of your sister and am about to do the same to you, You don't want your sister to be lonly do you?\" Her eyes watered with tears and she shook her head. \"Good. SO you'll be a willing meal than and go queitly?\" She nodded. \"No Screaming?\" \"None.\" SHe said muffled. You release her mouth and she looks up at you. \"Well..I'm as good as dead when mom finds out your digesting her baby girl anyway..so...Eat up!\" She Lies down  on her back and sticks her feet in the air, Willign to let you eat her alive. You take her feet and drag her behind some trees so When Jessica comes back she won't see you eat her lover. You take her feet and place them in your mouth, They taste so delicious, having been cleaned from her swimming, you taste every inch of her soles and toes, suprised to hear her moan. Your enjoying this?\" \"Might as well..Seeing as it's the last thiong I'll ever enjoy. Sides, Jesse used to love to lick my toes...It made me cum every time.\" She sighed. \"So If I just pretend your Jesse, It will help.\"  You nod and contenuie licking her feet and toes, the toes curling in to accept the licking and finnaly you swallow them down. you lock her legs and pussy, making her moan loudly, you make her cum at least 3 times before swallowing her pussy and ass, licking her belly and back \"Yes..YES...Eat me alive...Every inch of me.\" If you had Eye brows to raise, they'd be raised right now. \"Swallow me down, Mr. Weybren, Make me a meal.\" You swallow her to her breasts and give them a good long tounge bath before finnaly swallowing them,, leaving only her Head and longe black hair out, which you take in, Licking her and even giving her the pleasure of one final French kiss, you than swallow the rest of her down, to join her little sister, you feel themmoving in and hugging eachother tightly...You have to admit..That was the single best meal you've ever had. It also made you more horny than you were before<br>\r\n<br>\r\nYou than notice that JEssica was stadnding there, how lng she'd been there was hard to tell but you could see she was about to scream, you close your hand around her mouuth to stop her from screaming..you have to dispose of her but how...<br>\r\nYouc ould Take her back to your nest and mate or simply eat her...</span></div></div>",
            "created":1120971600,
            "id":260745,
            "title":"The Young girl's sister"
        },
        "121212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "A good lay should make her tasty",
                "Nah, let her mature a year or so. FInd another on land."
            ],
            "content":"<div class=\"\"><div> <span>Your long tongue snakes carefully along her naked body, causing the lithe body above you to squirm slightly, the sound of a surprised giggle reaching down through the water to you. For a second, as she looks down, you wonder if you'll just have to eat her, anyway, if she's seen you... but then she looks up, apparently satisfied it was just a reed.<br>\r\n<br>\r\nYou remain beneath her, watching as she swims further into the reeds, perhaps looking for her missing friend.<br>\r\n<br>\r\nShe didn't really taste good, either. It is all this bathing, you guess. It washes away all the lovely taste of exertion, a good roll in hte hay, or horrible fear. <br>\r\n<br>\r\nOh, well, you think, as your eyes stay on the slowly receding rump above you. There are ways to fix the last two...</span></div></div>",
            "created":1199336400,
            "id":482663,
            "title":"Still not the best... "
        },
        "1212121":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Oh, yeah, a good, tight, hopefully virgin pussy...",
                "Real Weybren choose the tightest hole. The ass it is..."
            ],
            "content":"<div class=\"\"><div> <span>As you swim up behind her, allowing her every move to bring her more out of sight of the otehrs, and closer to an awful demise - you can't very well let her go telling on you afterwards, after all - you have an excellent view of her long lithe legs and her ass.<br>\r\n<br>\r\nTime for a luxury problem.</span></div></div>",
            "created":1199336400,
            "id":482665,
            "title":"Choices, choices"
        },
        "12121212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Fuck her, then eat her.",
                "Eat her WHILE you fuck her."
            ],
            "content":"<div class=\"\"><div> <span>The girl turns towards land, and you guess you're just about far enough away from everyone else, now. Beneath the water, your monster erection waits impatiently to be sated. She hasn't at all even noticed you, yet...<br>\r\n<br>\r\n<br>\r\nKaren, 14, stops swimming and finds she can stand here. This side of the island seems deserted, but... you never know. Amber and Sara had said no-one should swim out here, that the Weybren would take them. Ha! Those two sluts were just scared someone would find the spots they allowed the boys to have their way with them. Like she hadn't seen Sara right around that rock, lips wrapped around Even's fat cock, just two weeks ago?<br>\r\n<br>\r\nTwo long steps, and the water only reached to her knees. If there were any boys there, surely they were already grabbing their dicks. Her breasts were bouncing slightly, water running off her smooth skin, small bush between her legs clinging to her sex and dripping wet...<br>\r\n<br>\r\nOh, yeah, she was getting laid here.<br>\r\n<br>\r\nShe barely noticed the water moving behind her before a huge, scaly hand covered her mouth, and something pressed hard against her ass...<br>\r\n<br>\r\n<br>\r\n<br>\r\nSwift like lightning, you reach out of the water, grabbing the little morsel around her mouth, pressing your cock against her ass. The first scream your hand blocked is surprise, then terror, and then in awful pain, as your foot-long cock stabs up into her bowels. The tightness almost makes you cum there and then, and you lift her fully out of the water, only to slam her right back down on your shaft, again, and again, her screams of terror and pain barely leaking out past your hand...</span></div></div>",
            "created":1211691600,
            "id":536019,
            "title":"A piece of ass!"
        },
        "121212122":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Someone's coming!",
                "Seek some more food - and sport - at leisure."
            ],
            "content":"<div class=\"\"><div> <span>Again and again you lift the poor girl up and slam her down on your monster cock. She's so tight, and she struggles so deliciously, hair and boobs jiggling and bouncing, that you're sure you can't hold on much longer. You can actually feel the bulge your cock makes in her belly as you lift her, and her screams begin to grow louder, your hand is slipping from her mouth...<br>\r\n<br>\r\nYou consider for a moment, as much as you can through the ecstasy of fucking the young woman, to just take your chances and let her scream. It's an awkward position, and you could get more force, or feel up her breasts while you fuck her ass, if you didn't have to cover her mouth...<br>\r\n<br>\r\nPerhaps it is a rational decision, perhaps it is just the hunger getting the better of you. As she draws in breath to scream again, skewered on your spit so far down your balls are touching her skin, you open wide, lets go of her head, and... clamp your jaws around her torso. Her screams redouble, now in sheer, nearly mindless terror, your tongue flick over her breasts, and then you can't help yourself at all. Her terror and desperate struggling causes her ass to tighten so much around you, it's almost painful. You begin to thrust like a loon, every thought lost in onrushing ecstasy, every thrust pushing her deeper into your gullet as she twists and turns desperately, until there is nothing but your semen squirting deep into her bowels, shot after scalding shot, nothing but her struggling body going down your gullet, and the screams and throws of her demise in your belly.<br>\r\n<br>\r\nYou lie down on the stony beach for a while, panting. Now THAT was a meal!</span></div></div>",
            "created":1211778000,
            "id":536373,
            "title":"Eat her WHILE you fuck her."
        },
        "12122":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Take little Sarah, 11, lying alone in the reeds and learning to masturbate",
                "Swim right up in the middle of them and eat the rehead with the great tits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A few seconds pass until you're absolutely sure no-one's noticed anything. Not one to question a good deal when you see it, you swim closer to the flock, eyes firmly set on the glistening, laughing morsels ahead...</span></div></span></div>",
            "created":1136264400,
            "id":293622,
            "title":"That wasted good..."
        },
        "121221":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Eat her. Now.",
                "Have the courtesy to let her finish first."
            ],
            "content":"<div class=\"\"><div> <span>A small, soft noise from the reeds catches your attention as you slide through the water. Curious, you change direction ever so much, slippig in between the tall strands. The noise comes again... it is a soft whimper, one you've heard a few times before as you've been out scouting... or eating.<br>\r\n<br>\r\nThe reed thins a little, and there, hidden from the others, little Sarah has retreated to her favorite hidden place. She's spent the last weel prentending to sleep and watching her older sister masturbate next to her in the bed, and she's finally getting the hang of it, her eyes closed as she is approaching her short life's very first (and quite possibly only - if she only knew) orgasm. The gasps she's barely suppressing would form a name if she didn't try to keep it down so much - Keifer, her sister's sometime boyfriend. She's seen them together, too, enough to know just how big a penis can grow and a few places it can fit...<br>\r\n<br>\r\n<br>\r\nOf course, you know nothing of this. All you see is a girl, tall for her age but young, budding breasts ony barely begun to grow, coltish legs shivering as her small fingers play inexperiencedly in her tight, tight virgin pussy.<br>\r\n<br>\r\nAnd you just know she'll be a lot more tasty than hte last one...</span></div></div>",
            "created":1158296400,
            "id":346781,
            "title":"Poor little Sarah, closing her eyes..."
        },
        "1212211":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Saw her kicking legs, and flee in terror",
                "Didn't notice a thing."
            ],
            "content":"<div class=\"\"><div> <span>Sarah begins buckling, her fingers finally finding that sweet spot, what little brain activity that isn't totally taken over by pleasure consumed by thoughts of her sister's boyfriend and a wild, joyful idea that she is about to experience what her sister has been experiencing.<br>\r\n<br>\r\nActually, she's right, though not in the way she thinks. Unknown to her, and unknown to you as well, her sister just a minute ago swam literally right into your maw. Unlike her sister, though, she will die a virgin... and without ever quite getting to that climax.<br>\r\n<br>\r\nShe opens her eyes in shock as you grab her, seeing straight down your gaping jaws, so paralysed with terror she doesn't even scream before she's half-way down your throath. Then, she screams plenty, her dripping, coltish legs kicking wildly to the sky, but your flesh muzzles it, and only you hear her terrified shrieks as she disappears into your belly, never to know it's her dear sister that's digesting beside her.<br>\r\n<br>\r\nLicking your chops, you turn towards the rest, looking out through the reeds. They... </span></div></div>",
            "created":1199595600,
            "id":484520,
            "title":"A light snack..."
        },
        "12122112":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Choose with your belly",
                "Choose with your dick"
            ],
            "content":"<div class=\"\"><div> <span>YES! That was just how it should be like. That mix of sex and terror... that's just the thing. And nobody noticed a thing, either. And that means... you look out through the reeds, seeing those bountiful bodies still swimming around. Still seven of them left - this little snack was a bonus.<br>\r\n<br>\r\nThe last time you were up and about, you did something similar... but if you catch every one, this will be a new record for you. You grin toothily as you consider it. Last time... last time it was six delicious girls on some sort of rite of passage. Every one of them made the passage through your maw, kicking and screaming.<br>\r\n<br>\r\nYou no longer think any of these will taste bad... and even if they do, you remember the way to get them tasty.<br>\r\n<br>\r\nAnd those thoughts have brough a hard-on a full foot long pressing up against your belly.<br>\r\n<br>\r\nTime to choose then... your stomach rumbles, and you're still hungry, but you're gonna need some release soon...</span></div></div>",
            "created":1201064400,
            "id":490145,
            "title":"Still there for the taking..."
        },
        "121221121":{
            "choices":[
                "you watch the show....",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>You lick your lips again....but then think.....with a start....<br>\r\n'but....if I eat them all...like last tiem.....they wont come back...and then I may get tracked down....they almost got me last time....I am not out of the woods...as these humans say...' you think some more...and your grumbling belly will just have to wait.....'Yes, these humans can be resourceful at times!' you add.....as you watch the group....<br>\r\nThe snack that you have had settles down in your belly...and you then notice three girls, nymphets each of them start to go to the side cove of the large lake. Among the reeds you slowly, silently follow them...forgetting the others, and focusing on these....<br>\r\n'Maybe I just watch them...and see if I can get another.....alone....' you slyly think. <br>\r\nThe girls all just sprouting titty mounds, their hips just starting to flare out...the subtle changes from being a girl, to that of a young woman just becoming evident on the three...<br>\r\nThe leader was a black haired girl, her long, wet, hair thick, full, and her more matured breasts showing she was aroused, excited on having these two girls underneath her whim, her control. She had the blond girl by her waist, her one hand getting a feel here and there of the other's tits, while she held onto the red haired girl's hand pulling her along. The two other girls were giggling, and tittering to themselves, while the black haired girl seemed set and very serious. When she was sure they were safe, far enough away from the others, she drew the two other girls out of the water.....then she laid down beside the blond girl taking her face in her hands and kissed her deeply, while she bade the red haired girl to start kissing the blond's tummy....<br>\r\nThe Weybren got closer...and then could hear the sexual whispers the black haired girl was telling her lovers....<br>\r\n\"Yes...that is right, Maria....just lick, kiss Eva's belly...and when she parts her legs...do her sex.....with that stiff tongue of your's....You know how...I showed you that yesterday......just lay back, Eva...let Maria and I, your cousin, Doria service you....teach you the ways of girl-on-girl loving.....and who needs boys....and all those problems they bring??\" so.....Doria stated...as she then resumed kissing Eva lips. She was by now, groaning and panting...and had spread her legs wider, which allowed Maria to dive and start licking, kissing, loving Eva's swollen pussy slit......<br>\r\n\"OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO\", was all Eva could get out as Doria then moved her own pussy on top of Eva's face and mashed her very wet cunny onto her cousin's mouth....<br>\r\n\"Now...eat my pussy as Maria is eating your's.....learn the way to bring a girl off....and you will have many more girl friends.....than you can shake a stick at!\" Doria groaned......as Eva began servicing her too.....<br>\r\n<br>\r\nwhat next?????</span></div></div>",
            "created":1203483600,
            "id":500374,
            "title":"Choose with your belly"
        },
        "1212211212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Let them finish, and then consider...",
                "Just jump in for a fuck and a meal..."
            ],
            "content":"<div class=\"\"><div> <span>The girls are writhing on the bank, their naked bodies glistening with water, sweat and body fluids. You can feel your mouth watering as you watch the nubile morsels shake and scream, Eva's orgasmic cries muffled by her cousin's thighs, and your dick hardening as the black-haired older girl, Doria, reaches out to slip her fingers into the redhead's dripping sex, bringing gasps you can hear despite Maria's similar muffle of Eva flesh.<br>\r\n<br>\r\n<br>\r\nYou slowly begin jerking off. You really weren't planning on having more than one... maybe two... But they are offering themselves so nicely... <br>\r\n<br>\r\nThe older, blackhaired Doria might be totally wrong. These girls won't have many girlfrinds, if you have your way. On the other hand, they will receive a pounding from your foot long dick and the (last) ride of their lives down to your belly...</span></div></div>",
            "created":1212210000,
            "id":538256,
            "title":"other."
        },
        "121221122":{
            "choices":[
                "you approach the sighing, horny red head as she starts....",
                "you look at the two others instead."
            ],
            "content":"<div class=\"\"><div> <span>You feel your Weybren's dick lengthen out of its sheath.,,,and you know you need to relieve yourself...your inner pent-up seed into your new hosts for your children...<br>\r\nYou then smile as your mind reaches out to the group...and three of the young women turn in unison toward your spot....in the reeds...<br>\r\nYou almost laugh out loud as the three young girls, growing into women form a group, linking hands and start to wade your way....im the cool, clear water of the large lake.<br>\r\nYou pull back, back...and they continue to follow you, as they titter and giggle at being further and further away from the others. Those  people do not even seem to miss the girls... and the young women, as they get closer to your hiding spot, seem to disappear to anyone who might have been following them.<br>\r\nYou see them more clearly as they enter your Sphere of Shade. They just think they are in that part of the lake, but little do they know they are now in your domain. You smile another time, as you then send out the rosy smell that will make them your's...and will make their sexual arousals go sky high. As they breath in more and more of the aphrodisiacs that are mingled in the air, the girls get to start breathing deeper. which makes their hearts seem to swoon...and then one-by-one, they lose their hand holds...and with the room now spinning around them they seem to fall on a heavy carpeted floor...<br>\r\nYou know approach them all openly..and the girls are lying where they fell...their legs spread open, their inner fluids streaming out of their slits...completely under your spell...<br>\r\nYou smile once more...then know, all three are going to be your new brides...and will be mothers for your children....<br>\r\n<br>\r\nwhat next???</span></div></div>",
            "created":1201064400,
            "id":490216,
            "title":"Choose with your dick"
        },
        "1212212":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Satiate your raging hunger",
                "Satiate your raging hard-on"
            ],
            "content":"<div class=\"\"><div> <span>You lick your lips and try to suppress the rumble in your belly as your last meal kicks and squirms her agonizing last seconds away. Slowly, you advance, so close now your shadow falls on the quivering girl ahead of you, your extended tongue inches from her bare thigh...<br>\r\n<br>\r\nand something stops you.<br>\r\n<br>\r\nIt could be the look of surprised, onrushing ecstasy on the little girl's face as she finally finds the spot, it could be that you're just for a moment captivated by your next meals trembling limbs and heaving breath...<br>\r\n<br>\r\n<br>\r\nOr it could be that as Sarah finally approaches her first ever real climax, as she spasms and writhes, as her overloading brain flashes between images of Keifer fucking her sister so hard the bed threatened to fall to pieces, and fantasy images of herself in her sister's place... she can't hold back her whispers anymore.<br>\r\n<br>\r\n\"\"Oh... oh Gods!... Keifer... take me, take me!\"<br>\r\n<br>\r\nYou stop and listen. It would be downright cruel not to let her finish this before you...  </span></div></div>",
            "created":1187586000,
            "id":437377,
            "title":"Go on, Sarah, that's the spot..."
        },
        "12122122":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "She's given a good show; just cum on her and leave her mystified.",
                "Give her what she's moaning for."
            ],
            "content":"<div class=\"\"><div> <span>You lick your lips, knowing just how much sweeter meat tastes right after an orgasm, your eyes already tasting every inch of sweaty skin and barely budding curves...<br>\r\n<br>\r\n... and you're suddenly aware that you've grabbed your rock-hard member in your hand and that you're stroking it as furiously as the blond little thing is flicking her clit.</span></div></div>",
            "created":1188190800,
            "id":439677,
            "title":"My, that's a sweet sight..."
        },
        "121221221":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "Just quietly slip away whit whoever's easy to snatch.",
                "They'll run right into your maw! Eat and rape to your heart's content!"
            ],
            "content":"<div class=\"\"><div> <span>You're so close, the very thought of removing your hand seems so wrong, and it's all you can do not to growl as your balls begin to tighten. Young meals are good, but if you wait just a year or two... why, this one will have breasts and hips and you can really savor her. Taking her now, you'd just gulp her down, and we can't really have that.<br>\r\n<br>\r\nSarah finally hits the spot, her small bodyheaving violently as her fingers move of their own accord, stroking her clit at a furious speed, iarticulate words and moans tearing from her mouth. In just a second, everyone's gonna be here... and the thought of what you're gonna do to whoever's easiest to drag off sends you over the edge. with a grunt, you stiffen as thick, gooey semen spurts from your cock, wave after scalding wave, on Sarah's belly, on her small, budding breasts... and just a little hint on her face.<br>\r\n<br>\r\nShe doesn't feel it. Her very first orgasm has rendered her insensate for a little while.<br>\r\n<br>\r\nThe others are coming, attracted by her screams. Some worried, some recognized the tone and come to see the show...</span></div></div>",
            "created":1197867600,
            "id":476446,
            "title":"She's given a good show; just cum on her an..."
        },
        "122":{
            "choices":[
                "The mom",
                "The boys and girls"
            ],
            "content":"<div class=\"\"><div> <span> The Weybren sees a farm house through the trees. As it walks a little closer to investigate the house, it sees a beautiful woman in her mid thirties, hanging clothes on a line to dry. It then spots seven young human boys, and girls playing near by, mostly girls. They look like they are between the ages of eleven and sixteen. It figures out quickly, that the older woman is the mother of those kids. <br>\r\n<br>\r\n As it watches them all, it decides to get who first?</span></div></div>",
            "created":1120798800,
            "id":260191,
            "title":"Farm house"
        },
        "1221":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Just Swoop Down And Fly Away With Her",
                "Turn Into A Cow To Lure Her To You"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The monster decides that the plump woman will make a wonderful meal. But there are too many people around. You have to find a way to lure her over to you... but how?</span></div></span></div>",
            "created":1122440400,
            "id":263801,
            "title":"Kids Are Too Stringy, Go For The Adult"
        },
        "12212":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "You Discover That Your Stuck As A Cow!",
                "Your Pregnant With A Bovine/Weybren Hybrid"
            ],
            "content":"<div class=\"\"><div> <span>You finally decide to turn yourself into a cow and lure her to you by mooing in distress. So you quickly turn yourself into a black and white splotched cow.<br>\r\n<br>\r\nBut before you can start mooing in distress you suddenly feel a heavy weight settle onto your back and to your horror and disgust you see that you have just been mounted by a bull! All thoughts of tring to eat woman are pushed from your mind as the bull's member penetrates your cow pussy.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nAfter enjaculating several loads into your cow pussy, the bull finally dismounts from you and wanders off in search of more cows to service. You decide that eating the human woman is not worth this much trouble so you decide to leave.<br>\r\nBut...</span></div></div>",
            "created":1122440400,
            "id":263810,
            "title":"Like A Bull To A Cow"
        },
        "1222":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Wait for them to come closer and snatch them up one by one",
                "Turn into a cute animal and lure them deep into the forest"
            ],
            "content":"<div class=\"\"><div> <span>The monster decides that those kids will all make a wonderful meal, and maybe when she comes looking for them, he can take the mother away too, but as his mate instead. But it wasn't the weybrens's way to just run in randomly and snatch up the kids, not with the mother seeinganyway...Maybe if they were closer...Or perhaps it can lure them away some how, into the forest, where it can trap them all and feast?</span></div></div>",
            "created":1120885200,
            "id":260466,
            "title":"Young meat always tastes better"
        },
        "12221":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Lure the boy away and eat him",
                "Lure Mirah away and eat her"
            ],
            "content":"<div class=\"\"><div> <span>The Weybren used it's cloaking powers to hide. The children, Much to it's luck, came closer, laughing and playing as kids do, it will so enjoy gobbling up all 7 of them, Feelign it's stomach swell with the tasty young bodies inside will be a delight in deed. To his luck the youngest, an 11 year old girl came toddlign his way, he remained cloaked and waited for her to near than when the others had their backs turned he snatched the girl up, covered her mouth, ripped off her clothing and tossed her into his anxious mouth He tasted her, enjoyign the taste of such young meat than swallowed her down. he set his sites now on a pretty 18 year old girl, listenign in he discovered her name was Mirah. Well Mirah soon your name is going to be Mush, he snickered. He than snuck in unseen...When he than saw Mirah flirting with one of the boys, it dawned oon him this boy wasn't her brother but her boyfriend. Hmm..Better lure them apart...HE pondered how to do this as he snatched up a young lad walking past and swallowed him down to join her sister....</span></div></div>",
            "created":1121144400,
            "id":260957,
            "title":"The Feast begins"
        },
        "12222":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "content":"<div class=\"\"><div> <span>You turn into a small bunny and hop over to them, hoping along when the youngest, a little girl, points at you. \"Look Mommy, A bunny!\" \"Oh Good, We havben't had decent meat in a long time.\" U h oh you think.&gt;That's not good.&gt;Before you can Hop away the little girl Grabs you by the ears and Carries you to the mom...You can't blow your cover so your pretty much doomed. She boils you in a pot and serves you to the children.<br>\r\n<br>\r\nIT's Justice if you thinka bout it, You've terroirzed this village for weeks now, eating and screwing men and wmoen, Boys and girls...Now this family unknowingly stopped your reign of terror...<br>\r\nOn the plus side you fed this family very well</span></div></div>",
            "created":1121058000,
            "id":260751,
            "title":"Bad Move"
        },
        "123":{
            "choices":[
                "Get one at a time.",
                "Watch and wait?"
            ],
            "content":"<div class=\"\"><div> <span> The Weybren sees a group of six young boys skinny dipping. They look like they are between the ages of eleven and fifteen. It likes to watch their near perfect asses, and their young cocks, as the boy’s play, and bounce around in the water nude. <br>\r\n<br>\r\n As the boys play it decides too...</span></div></div>",
            "created":1120798800,
            "id":260192,
            "title":"Boys swimming"
        },
        "1231":{
            "choices":[
                "Taste him, then you play with him, you then?",
                "Just eat him, he's yummy?"
            ],
            "content":"<div class=\"\"><div> <span> You see a young blonde haired boy, about twelve, getting out of the water naked, and walking towards you. He still doesn’t see you. You see his soaking wet; young firm body coming closer towards you. You quickly hide in the bushes, and you can’t help but notice that this young male is a near perfect human specimen. You figure for a boy of his young age, he has a really big penis.   <br>\r\n<br>\r\n As he turns around to look at something, you can’t help but notice his almost perfect young muscular ass. You can’t wait anymore, you.. <br>\r\n<br>\r\n</span></div></div>",
            "created":1122958800,
            "id":265031,
            "title":"Yummy boy"
        },
        "124":{
            "choices":[
                "Wait and see",
                "Attack them all now."
            ],
            "content":"<div class=\"\"><div> <span> The Weybren sees about nine people swimming, three boys, five girls, and a beautiful older woman in her mid thirties. All of the younger people seemed to be under sixteen, but above ten years of age. All of these humans seem to be wearing some kind of funny little bathing suits. As the humans played in the water, it watched them as it decided what to do. <br>\r\n<br>\r\n It decided too....</span></div></div>",
            "created":1120798800,
            "id":260193,
            "title":"Swimmers"
        },
        "1242":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "The Villagers Domesticate You",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>As soon as you burst out of the bushes a large net falls on you. As you see dozens of hunters emerge from the woods you realize that the villagers had set a trap to catch you once and for all. You try and escape from the net but one of the hunters hits you in the back of the head with a club and you fall unconcious.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nYou suddenly wake up to find yourself in a cage in the middle of the village. You quickly realize that what seems like the entire village is having a festival right around your cage. At first you can't figure out why they are celebrating, but then it hits you as you realize that they must be celebrating your capture.<br>\r\n<br>\r\nFor the first time in your entire monstrous life you find yourself afraid. What will the villagers do to you as punishment for all those years that you terrorized them?</span></div></div>",
            "created":1122354000,
            "id":263653,
            "title":"You Should Have Waited!"
        },
        "12421":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "You Become A Knight's Flying Steed",
                "A Farmer Uses You To Pull A Plow"
            ],
            "content":"<div class=\"\"><div> <span>The next day after the festival, you soon discover what the villagers are going to do to you. They tie you up with chains then put a large muzzle on you and drag you to the village blacksmith.<br>\r\n<br>\r\n\"Are you sure this will work?\" One of the villagers asks the blacksmith.<br>\r\n<br>\r\n\"Of course I'm sure! This magic brand will make him obedient to who ever owns him.\" The Blacksmith says as he pulls a branding iron out of a near by fire and quickly puts the heated end against your skin.<br>\r\n<br>\r\nYou howl in pain as your back right thigh is branded with the magical rune.<br>\r\n<br>\r\n\"So who owns him anyway?\" A villager asked.</span></div></div>",
            "created":1122526800,
            "id":264007,
            "title":"The Weybren Is Domesticated"
        },
        "12422":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Your Head Gets Mounted On A Wall",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For the first time in your entire monstrous life you find yourself afraid. What will the villagers do to you as punishment for all those years that you terrorized them?</span></div></span></div>",
            "created":1122354000,
            "id":263654,
            "title":"The Villagers Punish The Monster"
        },
        "124221":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "content":"<div class=\"\"><div> <span>\"And so the villagers celebrated for five days and nights. Once the festival was over, all the hangovers gone, and all the ladies bras were found, the villagers decided to slay the foul Weybren and display the creatures head in the mayor's house.\" Says and old man in a rocking chair.<br>\r\n<br>\r\n\"Gee Grandpa, THATS where that ugly head comes from?\" Asks the little boy sitting in the old man's lap as he points to the monstrous head mounted on the near by wall.<br>\r\n<br>\r\n\"Yes it is sonney. And now it's time for you to go to bed.\" Says the old man. \"And you can sleep soundly knowing that the Weybren is no more.\"</span></div></div>",
            "created":1122440400,
            "id":263776,
            "title":"Bedtime Story"
        },
        "124222":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "The Villagers Use You As A Tourist Attraction",
                "Your Magically Forced To Protect The Village"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For the first time in your entire monstrous life you find yourself afraid. What will the villagers do to you as punishment for all those years that you terrorized them?</span></div></span></div>",
            "created":1122354000,
            "id":263655,
            "title":"The Villagers Punish The Monster"
        },
        "1242221":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "The First Tourists Arrive"
            ],
            "content":"<div class=\"\"><div> <span>The next day after the festival, you soon discover what the villagers are going to do to you as the villagers start putting up signs. You look closely at a nearby sign and read it. The sign says...<br>\r\n<br>\r\nCome See The Horrible, The Amazing, The Evil, And The Freakish Weybren! 5 Gold Coins Per Customer.<br>\r\n<br>\r\n\"Oh no!\" You moan as you realize what fate the villagers have in store for you. The villagers are going to use you as a tourist attraction! You hate tourists! (They always taste terrible!)<br>\r\n<br>\r\nOnce the villagers put up all the signs they then move your cage into a large building (To prevent anyone from getting a free look at you). One of the villagers tosses a smoked ham into your cages which you devour greedily.<br>\r\n<br>\r\n\"Okay everyone, we need to start setting up the giftshops before the tourists arrive.\" One of the villagers tells the other. \"We should all start making cheap novelty items like Weybren T-shirts, Weybren coffee mugs, ect, ect.\"</span></div></div>",
            "created":1124082000,
            "id":267707,
            "title":"The Weybren Becomes A Tourist Attraction"
        },
        "12422211":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "content":"<div class=\"\"><div> <span>You sigh to yourself as the first tourists arrive and start taking pictures of your monstrous form. The flashing cameras drive you wild but no matter how hard you struggle you can't break free of the cage. Looks like this is your fate you realize.<br>\r\n<br>\r\nOh how right you are! You spend the next 5 years of your life as the village's tourist attraction, but then the novelty wore off and the villagers sold you to a traveling circus where you are put in the freak show. You then spend the last 6 years of your life in that freak show but then you were killed when the circus fat lady accidentally sat on you.</span></div></div>",
            "created":1124686800,
            "id":269095,
            "title":"A Freak Show Ending"
        },
        "1242222":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Bandits Attack The Village, Eat Them!",
                "Time To Meet The Villagers"
            ],
            "content":"<div class=\"\"><div> <span>The next day after festival, the village elders gather in front of your cage to pronounce your fate to you and all the villagers.<br>\r\n<br>\r\n\"Monster you have terrorized our village for years.\" The head elder says to you loudly enough for all the villagers to hear. \"You have eaten our women and stolen away our men where you would then steal their seed so you could lay your foul clutch of evil eggs.\"<br>\r\n<br>\r\nThis announcement causes you to gasp. How did the humans know about your eggs?<br>\r\n<br>\r\nThe village elder saw your look of surprise and laughed. \"Yes foul creature, we have found your evil nest and have destroyed all of your evil spawn!\"<br>\r\n<br>\r\nThe announcement causes you to howl in sadness then collapse to the bottom of your cage where you begin to weep in sadness.<br>\r\n<br>\r\n\"Yes, now you know how it felt when you would take our sons and daughters away from us. But despite all you have done to us, we have decided to show mercy to you and not have you slain. Instead your life shall be magically bound to this village forever. That means several thing, first that if this village is ever destroyed you will die. On the plus side it means that if the village is never destroyed you will never die. It also means that you can never leave the village. In other words you must now protect this village for the rest of eternity.\" Then the village elder lifts his staff over his head and a strange beam of light shoots out of it and hits you.<br>\r\n<br>\r\n\"It is done, release the creature from it's cage.\" With that, your cage is quickly unlocked and you leap out.<br>\r\n<br>\r\nYou don't know if what the village elder said is true or not but right now you just want to get out of this village so you spread your wings and leap into the air. But then, when you reach the edge of the village your body is suddenly struck with extreme pain so you are forced to turn around. As soon as you start to fly back to the village the pain immediately stops. To your horror you realize that the elder was telling the truth, you are now magically forced to protect this village.<br>\r\n<br>\r\nSoon after, you find yourself once more in the village square surrounded by the villagers and the village elder.<br>\r\n<br>\r\n\"I demand that you release me!\" You growl at the village elder.<br>\r\n<br>\r\n\"You are not in the position to make demands.\" The village elder states calmly. \"Oh yes, I also forgot to mention that you cannot harm any of the villagers either.\" The village elder says. And as if to prove this point, a little girl reaches out her hand and begins to scratch your enormous cat like head.<br>\r\n<br>\r\n\"Nice kitty.\" The little girl says causing all the near by villagers to laugh. Humiliated by this, you try and lash out at the little girl but before you can so much as bear your fangs your body is suddenly overcome with extreme pain similar to when you tried to leave the village. So you decide to not try to hurt the little girl and as soon as you do the pain stops. So instead you decide to ignore the little girl as she continues to scratch behind your ears (It was beginning to feel very pleasant actually).<br>\r\n<br>\r\n\"How am I supposed to keep from starving, and for that matter where am I supposed to live in this village?\" You ask the village elder.<br>\r\n<br>\r\n\"First of all you can eat anyone who tries to attack the village, and sometimes we will sentence criminals to be eaten by you.\" The village elder replies. \"As to your other question, there is a small cave under the village where you will live.\"<br>\r\n<br>\r\nYour beginning to think that this whole being bound to the village thing wont be so bad.</span></div></div>",
            "created":1122440400,
            "id":263790,
            "title":"Your Forced To Protect The Village"
        },
        "12422222":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Have Some Fun With The Prisoners",
                "The Village Is Being Attacked!"
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to interact with the villagers your now bound to protect, you have one of the villagers and his three friends lead you to the cave beneath the village where you will be living from now on.<br>\r\n<br>\r\nAs soon as you enter the cave you realize that the word \"cave\" doesn't accurately describe the place. It's actually a somewhat large underground chamber. To your surprise you also see that the chamber is full of luxerious items and furniture. The only thing that doesn't look comforting is the small prison in the corner of the chamber that already has about 6 people in it.<br>\r\n<br>\r\n\"Why is this place filled with so many creature comforts?\" You ask the boy and his friends who showed you to your new home.<br>\r\n<br>\r\n\"Well we figured that if your going to be our village's protector we might as well make you comfortable.\" The boy reponds.<br>\r\n<br>\r\n\"Okay, but why is that prison in here?\" You ask.<br>\r\n<br>\r\nThis time one of the boys friends answers. \"So you can prevent any of the village's criminals from escaping. We were told to tell you that if any of them try and escape, the magic that binds you to the village will let you do anything you want with them.\"<br>\r\n<br>\r\nThis makes you smile evilly, at least you still get to have fun every once and awhile.<br>\r\n<br>\r\n\"What's your names anyway?\" You ask the four teenagers.<br>\r\n<br>\r\n\"I'm Keane. Thats Diane, Illea, and Deeke.\" The boy responds.<br>\r\n<br>\r\n\"Nice to meet the four of you. Now if you'll excuse me I would like some time alone.\" You ask them.<br>\r\n<br>\r\n\"Okay.\" They say as they leave.</span></div></div>",
            "created":1124082000,
            "id":267715,
            "title":"The Weybren's New Home"
        },
        "124222221":{
            "author_id":"riptortalon",
            "author_name":"RiptorTalon",
            "choices":[
                "Sexual pleasures.",
                "More hungry than horny."
            ],
            "content":"<div class=\"\"><div> <span>As soon as the humans leave tour chamber you yawn, strech, and fall on the large bed the villagers gave you. Yoou lick your lips as you keep your eyes on the six prisoners. Wondering how should I do to them to have some fun.<br>\r\nWhile you are relaxing you decide that you do not need to stay in the form you were in when you got captured. So you change back to your real form. Your true form is a  slender, black, wingless dragon, with a long jaws on a short neck. You say out loud \"It feels great to be relaxing in my true form... and being with such delicious company\".<br>\r\nYou finally decide what you have in mind to do with the prisoners.</span></div></div>",
            "created":1182229200,
            "id":418269,
            "title":"Relaxing in your new home, with free prey."
        },
        "125":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Attack them and go for a girl",
                "Attack and go for a boy"
            ],
            "content":"<div class=\"\"><div> <span>You peer through the trees and see a group of teen humans, 4 to be exact, bickering about wheather or not you exsist..you laugh and lick your lips, each one of them looks even more tasty than the other. But you could also use one as a mate... What should you do?</span></div></div>",
            "created":1120539600,
            "id":259771,
            "title":"Spotting a Potential Lunch"
        },
        "1251":{
            "choices":[
                "play with her, then mate with her.",
                "play with her, then eat her."
            ],
            "content":"<div class=\"\"><div> <span> You go for the youngest, Illea. You stealth fully goes through the tress, and then you begin to fly. Like a bride of pray, you swoop down, and snatch her from the ground. As you fly away, with the girl kicking, and screaming in your hands, you look back. You see her three friends crying, and yelling at you.  <br>\r\n<br>\r\n You fly back to your nest, high in the mountains, and you drop her the nest. You land near by, and look her over. Then you say something to her, in her own language, “Well my pretty, will you be my lunch, or my mate.” <br>\r\n<br>\r\n She had a look of horror on her face, as you reach out and easily rip off her dress. She covers herself, as she stands there wearing only her bra, and her panties. You then rip off her bra, and she quickly covers her large breasts. You then rip off her panties, with just one finger. <br>\r\n<br>\r\n As she stands in front of you totally naked, trying to cover her body, you begin to tees her a little. You gently pinch her bottom, and grab for her breasts. You take your long tong, and taste her bar flesh. You are very amused, when she tries to fight you off. <br>\r\n<br>\r\n You then decide too</span></div></div>",
            "created":1120626000,
            "id":259829,
            "title":"Illea is mine"
        },
        "12511":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "A nice Ass rape",
                "Her pussy looks inviting"
            ],
            "content":"<div class=\"\"><div> <span>The Weybren fondles her some more, enjoying her squeals of discomfort. Despite her pleas and protests he still has her where he wants her, now what to do with her? He has to admit for a small girl she's beautiful...So he decides to act against his growling stomach and make this young thing his new toy. His erection grew bigger as he closed in on her, She cried \"No...Plz god no...\" He pulledher close and pinned her to the ground. now, Where to begin? She has a nice plump ass, in need of a good pounding, but her pussy is also young and fresh.</span></div></div>",
            "created":1120885200,
            "id":260488,
            "title":"The Weybren's new toy"
        },
        "125111":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "\"You Don't Know How Weybren Reproduce Do You?\"",
                "\"Shut Up And Suck!\""
            ],
            "content":"<div class=\"\"><div> <span>Then before Illea can do so much as let out a muffled protest you impale your monstrous cock deep into her anus. Illea then lets out a squeal that sounds remarkably similar to the sound a pig makes when it's impaled on a roasting spit.<br>\r\n<br>\r\nIgnoring her cries you continue to pound in and out of Illea's tight and plump ass (permanently stretching out the lips of her anus to rediculous proportions) till you feel yourself climax and spurt your seed deep into her anus.<br>\r\n<br>\r\nYou then ease your cock out of her anus with a wet slurp sound.<br>\r\n<br>\r\n\"What? Did you miss my pussy or something?\" Illea says mockingly.<br>\r\n<br>\r\nYou respond...</span></div></div>",
            "created":1122526800,
            "id":264037,
            "title":"Illea's Formerly Tight Ass"
        },
        "1251111":{
            "author_id":"airk",
            "author_name":"Airk",
            "choices":[
                "\"...and the larva'll eat their way out in an hour or so\"",
                "\"...So I guess I can do you for fun, now!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You think we work like humans do?\"<br>\r\n<br>\r\nYou grin, showing long sets of fine, sharp teeth.<br>\r\n<br>\r\n\"Right about now, I'd wager the eggs are finely planted in your intestines...\"</span></div></span></div>",
            "created":1136264400,
            "id":293623,
            "title":"Interesting gestation"
        },
        "125112":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "Place ehr under a sleeping spell and take her to her village at night fall",
                "Too Risky, Better taske her to your cave to live with you the rest of her life"
            ],
            "content":"<div class=\"\"><div> <span>You jsut can't do that ass anyharm, SO to her pussy you go ^_^. You enter her and began your mating procces, she cries as you rape her, Un able to do anything about it. You moan softly as you mate. She cries and looks up at you. \"I hope your enjoying this Asshole. I hope your species dies after fucking the female.\" You just laugh. \"Oh, We live alright. The problem is when we finish matign we have a hard time not eating the female...\" You laugh, kidding just to frighten her of course..No you need her alive, For their are no female Weyybren, just you and  soon she'll be carrying your child...<br>\r\nYou finish and Pick her up, You should probably take her home...</span></div></div>",
            "created":1121058000,
            "id":260753,
            "title":"Mating with Illea"
        },
        "1251121":{
            "author_id":"mikel730",
            "author_name":"mikel730",
            "choices":[
                "9 months pass"
            ],
            "content":"<div class=\"\"><div> <span>YOu smile at her. \"There all done.\" \"Your an asshole.\" \"YEah well, Soon you won't really remeber this, and if you do..Oh Well...\" You Put her to sleep by breathign on her before she can respond. You fly silently away to her village and drop her off...For grins you kidnap a little girl and a little boy and gobble them up in their sleep, you fly away with a belly full of kids, an egg growing in Illea and no cares at all...</span></div></div>",
            "created":1121058000,
            "id":260754,
            "title":"A happy Weybren"
        },
        "12511211":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Illea Lays A Weybren Egg",
                "Illea Gives Birth To A Live Weybren"
            ],
            "content":"<div class=\"\"><div> <span>Over the next 9 months you keep a close eye on Illea as the baby Weybren takes shape inside her. <br>\r\n<br>\r\nBy the third month of her pregnancy, the other villagers notice that she is pregnant and they ask her who the father is. Illea can't answer of course, because you had erased her memory. So the villagers jumped to the conclusion that her friend Deeke must have raped her. So the villagers decided to punish Deeke in the traditional method of punishing rapist. You couldn't help but laugh when poor Deeke was castrated for a crime he didn't do.<br>\r\n<br>\r\nOther than that, Illea's pregnancy went smoothly and after 9 months you swoop down out of the sky and pluck her right out of the village square and take her to your cave where you decide to restore her memory.<br>\r\n<br>\r\n\"Oh, No!\" Illea exclaims as she suddenly realizes just what is growing in her womb. But before she can say more than that, her water breaks.</span></div></div>",
            "created":1122526800,
            "id":264016,
            "title":"Rosemary's... I mean, Illea's Baby"
        },
        "125112111":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "\"Not long, Just 2 or 3 days.\"",
                "\"Not long, Just 5 or 6... Decades.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Oh!\" Illea exclaims, as her feet suddenly get soaked. Illea then grabs her middle with both arms. \"Oh it hurts!\"<br>\r\n<br>\r\nWith surprising gentleness you pick her up and set her down on her back in the nest you had made in your cave just for her. You then silently watch her pant and moan as contractions begin to push a large white object out of her pussy. This continues for about 5 minutes before Illea gives a final push and with a soft thud a Weybren egg about the size of a soccer ball sits in the nest.<br>\r\n<br>\r\n\"Finally it's over, I thought the pain would never end!\" Illea moans.<br>\r\n<br>\r\n\"It's not over.\" You say evilly. \"Human females that are impregnated by a Weybren always lay at least 12 eggs.\"<br>\r\n<br>\r\n\"You mean there’s more...\" Illea starts to ask but is cut off when she starts to have more contractions.<br>\r\n<br>\r\n3 hours and 11 eggs later...<br>\r\n<br>\r\n\"Behold Illea our soon to be wonderful children.\" You say to her sarcastically as you gesture at the nest full of eggs.<br>\r\n<br>\r\n\"I hate you!\" Illea screams at you.<br>\r\n<br>\r\n\"I love you too dear.\" You respond sarcastically. \"But anyway, it's time for you to assume your motherly duties.\"<br>\r\n<br>\r\n\"Like what? They haven't even hatched yet!\" Illea yells.<br>\r\n<br>\r\n\"That's because you’re going to sit on them and keep them warm until they do.\" You tell her as you lift her up and gently place her petite ass in the nest on top of the eggs. Then suddenly, before Illea can move you pull out some rune covered shackles that are attached to the ground by chains and put them on her hands and neck.<br>\r\n<br>\r\n\"What are these for?\" Illea asks.<br>\r\n<br>\r\n\"Those are to make sure that you sit on those eggs until they hatch. Those shackles are magic and will only unlock when the eggs hatch. And don't even think about smashing the eggs, the shackle around your neck would choke the life out of you.\" You respond evilly.<br>\r\n<br>\r\nIllea gasps, clearly she had been thinking about doing that very thing. She then asks. \"H-how long does it take Waybren eggs to hatch?\"<br>\r\n<br>\r\nYou answer...</span></div></div>",
            "created":1124082000,
            "id":267730,
            "title":"Illea's New Clutch Of Weybren Eggs"
        },
        "1251121112":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "56 Years Later"
            ],
            "content":"<div class=\"\"><div> <span>\"Not long, it only takes Weybren eggs 5 or 6 decades to hatch.\" You answer.<br>\r\n<br>\r\n\"I have to sit on these eggs for 50 or 60 years!?\" Illea screams at you in outrage.<br>\r\n<br>\r\n\"Yes, but what’s the problem?\" You respond.<br>\r\n<br>\r\n\"The problem is that most humans only live about 75 years!\" Illea protest. \"If I wait here 5 or 6 decades for these eggs to hatch, I'll be an old woman!\"<br>\r\n<br>\r\n\"Oh!\" You exclaim in shock. \"I always thought that humans live for thousands of years like me. But oh well, I guess you will have to sacrifice the best years of your life to hatch those eggs!\"<br>\r\n<br>\r\n\"B-but...\" Illea stammers.<br>\r\n<br>\r\n\"No buts Illea.\" You start laughing. \"If you couldn't handle the responsibility of being a parent then you shouldn't have gotten pregnant in the first place!\"</span></div></div>",
            "created":1124686800,
            "id":269099,
            "title":"A Long Wait For Illea"
        },
        "1251122":{
            "choices":[
                "You wake up with her sleeping across the cave.",
                "You can't seem to find her."
            ],
            "content":"<div class=\"\"><div> <span>You pick her up and fly her to a cave in the side of a mountain. You set her down. \"Don't go thinking about trying to leave. You'll fall to your death if you go out there. Don't worry, I'm sure you'll make a fine mommy!\" You say as you lay your head down, getting ready to go to sleep. \"Go to Hell!\" She yells, picking up a rock and throwing it at you. You don't even feel it and slowly drift to sleep.</span></div></div>",
            "created":1121662800,
            "id":261974,
            "title":"Getting some sleep"
        },
        "12511221":{
            "choices":[
                "You see some fruit.",
                "A tasty looking girl walks alone through the woods."
            ],
            "content":"<div class=\"\"><div> <span>You walk over and smile at what you see. A small bump, barely noticible, has appeared on her belly. If you didn't have super eyesight, you might not have been able to see it.<br>\r\n<br>\r\nShe suddenly begins to stir, and shes soon awake. \"What the hell?\" She says, stretching and looking around. Suddenly she sees you. \"Oh, now I remember! You kidnapped me and rapped my you asshole!\"<br>\r\n<br>\r\n\"Well, you isn't much you can do about that now is there? By the way, would you like something to eat?\" You say as you hear a soft growling from her stomuch. \"Fine, whatever. But could you bring me some clothes? It's freaking cold in here!\" She shouts as you fly away.<br>\r\n<br>\r\nYou look down, looking for something that humans might eat.<br>\r\n</span></div></div>",
            "created":1121662800,
            "id":261975,
            "title":"What do humans eat?"
        },
        "125112212":{
            "choices":[
                "The child inside her has a different oppinion on the matter.",
                "Oh well, guess it's super time for you."
            ],
            "content":"<div class=\"\"><div> <span>You eat them, so why can't she? You think as you dive down and scoop up the girl. You ignore her screaming as you pull of her clothes so you can give them to you mate.<br>\r\n<br>\r\n\"Here you go.\" as you place the pile of clothes and the naked woman next to her. \"Eat up!\"<br>\r\n<br>\r\n\"What?!? You go me a person to eat?!? Are you stupid?!? I can't eat another person!\" She shouts at you as the crying girl hurredly runs around the cave looking for a way out.</span></div></div>",
            "created":1121662800,
            "id":261976,
            "title":"What do you mean humans can't eat humans?"
        },
        "1251122121":{
            "choices":[
                "The next day.",
                "9 months later."
            ],
            "content":"<div class=\"\"><div> <span>You notice that her stomuch has gotten slightly bigger than what it was earlier. It's still to small for her to notice though.<br>\r\n<br>\r\nSuddenly, a loud gurgle comes from her belly. She moans in hunger, and suddenly looks at the other girl, who is now laying on the floor crying her head off.<br>\r\n<br>\r\nSuddenly, your mate pounces at the other one, opening her mouth wider than you had ever seen a human open there mouths before. She plunges the other girl head first into her gapping maw, gulping down on her up to her waist. Her body bulges as the other woman squirms inside her, her screams emiting through your mates skin. Your mate swings your head back, sending the other girls kicking legs into the air. With a noisy sucking sound, her legs rapidly slide down, making the young girls belly blossom out to make room for its new meal. She sat there, gasping and panting, a terrified look in her eyes as she stares at her oversized belly.<br>\r\n<br>\r\n\"Well, looks like being pregnant with my young has given you a few side effects!\" you chuckle as the terrified girl sits there in a state of confusion.</span></div></div>",
            "created":1121662800,
            "id":261977,
            "title":"Now they can? Make up your mind!"
        },
        "12511221211":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "A Month Later",
                "9 Months Later"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, looks like being pregnant with my young has given you a few side effects!\" you chuckle as the terrified girl sits there in a state of confusion.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nThe next day you wake up to discover to your surprise that your statement about 'a few side effects' was an understatement.<br>\r\n<br>\r\nThere were ALOT of side effects. From the look of Illea's new fur coat, she was apperently slowly changing into another Weybren!<br>\r\n<br>\r\n\"Whats happening to me?!\" Illea wails in terror. \"I'm a freak!\"<br>\r\n<br>\r\n\"Oh, I don't know, I think it makes you look sexy.\" You say as you burst out laughing.</span></div></div>",
            "created":1122526800,
            "id":264019,
            "title":"More Side Effects"
        },
        "125112212111":{
            "author_id":"amrasculnamo",
            "author_name":"Elf King",
            "choices":[
                "learn to be a father",
                "gather humans and use them as slaves to improve your cave"
            ],
            "content":"<div class=\"\"><div> <span>It was a month later and you couldn't believe what had happened to Illea. She was now indistinguishable from yourself except for her obviously female features. She had full, DD size breasts and her fur coat was slightly longer than his. If the breasts weren't a dead give away, her figure and lower body certainly was. She was slim and hourglass shaped, while he was muscular and largely built. Also, she had a spot where the fur was thinner and a slit was clearly visible while he had a large, furry dick.<br>\r\n<br>\r\nShe no longer had any objections to being your mate. Actually, she now seemed to love the idea. Since Weybren gestation is a lot shorter than human gestation, she had already had the first litter. They had, sadly, died off. This was, unfortunately, the way with Weybren babies. The first littler almost always died off.<br>\r\n<br>\r\nShe had been telling you lately that she wanted more babies. Although she admitted she wouldn't be able to stand not having wild Weybren sex with you after they were born. <br>\r\n<br>\r\nIf truth be told, you too wanted kids. After all, you had been the last of your kind until you had changed Illea. Now you wanted to start a new generation. But, you too would miss the sex.<br>\r\n<br>\r\nOne day, as you were out hunting for Illea and yourself, it came to you. You could add a few rooms to the cave and block them with doors, like humans do. You quickly caught a small girl and flew back to the cave to tell Illea about your idea.<br>\r\n<br>\r\nIllea was delighted about this and wondered why she hadn't thought of it before. Smiling evilly at you, she pinned you against a wall and kissed you passionately, her long tongue swirling lovingly yet wildly around in your mouth. Her breasts were pushed firmly against you and you felt the stirrings of a boner.<br>\r\n<br>\r\nSuddenly, you felt your growing cock push against something. Illea broke away from the kiss and again smiled evilly at you. Dropping to all fours, she wrapped her long tongue around your member and began moving it around. <br>\r\n<br>\r\nYou were now hard as a rock. Grabbing her by her shoulders, you spun her around and mounted her doggy style. You guided your hard cock into her waiting pussy then slammed all fifteen inches inside her. You began the age old rhythm of in and out. <br>\r\n<br>\r\nYou were fucking her hard, pounding her cunt until you both came together. She gave an almighty screech that matched your roar in intensity. You then curled up with her and you both eventually fell asleep. <br>\r\n<br>\r\nThe next morning you realized something about humans turned Weybren. When the female is human, the weybren impregnates her through her anus. But after they turn into weybren, they were impregnated normally.<br>\r\n<br>\r\nYou realized this because Illea was now looking very pregnant. She got up and locked you in a powerful embrace, exclaiming, \"Oooh! Honey, its so wonderful! We're going to have babies!\"<br>\r\n<br>\r\nYou were glad, of course. But you were also frightened. You didn't know what to do as a father. You knew the first thing to do was... </span></div></div>",
            "created":1184216400,
            "id":424984,
            "title":"Full on weybrenification"
        },
        "12511222":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "You Fly To The Village To Steal Some Clothes",
                "Just Eat A Human And Give Their Clothes To Her"
            ],
            "content":"<div class=\"\"><div> <span>The next day you wake up to discover that you can't see Illea anywhere in the cave. You start to panic thinking that the stupid human had tried to escape, till you suddenly realize that something is leaning against your side.<br>\r\n<br>\r\nYou look to see what it is and to your surprise (and delight) you see that it's Illea! You realize that the cold temperature of the cave must have forced her to curl up and sleep next to your warm sides.<br>\r\n<br>\r\nYou should probably get her some clothes so she can stay warm.</span></div></div>",
            "created":1122526800,
            "id":264025,
            "title":"Illea Slept Next To You"
        },
        "125112221":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "You Wake Up And See That Illea Is Now Wearing The Outfit",
                "You Wake Up To See that Illea Is Curled Against Your Side Again"
            ],
            "content":"<div class=\"\"><div> <span>You slowly stand up so you don't wake Illea and you leap out of your cave and spread your wings. A few minutes later you’re flying over the village looking down for some clothes to snatch.<br>\r\n<br>\r\nYou see some particular clothes hanging on a clothesline that catches your interest. Smiling evilly at the thought of making Illea wear them, you dive down and pluck all the clothes off the line before anyone sees you.<br>\r\n<br>\r\nYou then fly back to the cave and discover that Illea is now awake and currently sitting in a corner of the cave trying to keep warm so you present her with the clothes.<br>\r\n<br>\r\nIllea takes one look at them and yells at you. \"I can't wear this stuff!\"<br>\r\n<br>\r\n\"Why not?\" You ask her curiously.<br>\r\n<br>\r\n\"Because these clothes are indecent! First of all, these pants are skin tight and has been deliberately designed with these holes in the front and back to leave all of my pussy and most of my butt exposed, also the back is so tight that it would force my rear up slightly and my butt cheeks apart and since you didn't bring any under garments it would leave both my anus and my pussy exposed to the whole world! Second of all, this shirt is so low that it's more of a bra than it is a shirt, except that it doesn't offer any support for my breasts so that they would just flop around obscenely!\" She yells at you in outrage. \"For that matter, why are all these clothes made out of black leather? Just where did you get these clothes from anyway?\"<br>\r\n<br>\r\n\"I snatched them off a clothes line next to building with a red roof.\" You answer.<br>\r\n<br>\r\n\"Well no wonder these clothes are so indecent! You stole them from the village Whorehouse!\" Illea yells.<br>\r\n<br>\r\n\"So what's the problem? They seem like perfectly good clothes to me, so I'm not going to get you any others. If you’re not cold enough to wear the clothes I bring you then I guess you’re not really cold. Besides I don't know what a whore house is anyway.\" You say with faked innocence.<br>\r\n<br>\r\nIllea gasps in outrage at your words. \"How dare you! I would rather go naked than wear those horrible clothes!\" You just shrug your shoulders and lay down for a nap. Illea then stomps off to the corner of the cave she was in when you arrived.<br>\r\n<br>\r\nYou know she's just bluffing though. Even though she's trying to hide it, you can still see her shivering from here. It’s just a matter of time before she gives in and puts the clothes on. Before you fall asleep you can't help but chuckle silently to yourself, of course you knew that building was a whorehouse, that’s actually why you stole those particular clothes. (HA!)</span></div></div>",
            "created":1124082000,
            "id":267756,
            "title":"Illea Gets A Slutty New Outfit"
        },
        "1252":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Have Him Impregnate You",
                "Eat Him"
            ],
            "content":"<div class=\"\"><div> <span>You go for the boy the others call Keane. You move stealthfully through the tress, and then you begin to fly. Like a bird of prey, you swoop down, and snatch him from the ground. As you fly away, with the boy kicking, and screaming in your hands, you look back. You see his three friends crying, and yelling at you. <br>\r\n<br>\r\nYou fly back to your nest, high in the mountains, and you drop him in the nest. You land near by, and look him over. Then you say something to him, in his own language, “Well my pretty, will you be my lunch, or my mate.” <br>\r\n<br>\r\nHe then has a look of horror on his face, as you reach out and easily rip off his pants and shirt. He covers himself, as he stands there wearing only his underwear. You then rip off his underwear, and he quickly covers his pleasingly large maleness.<br>\r\n<br>\r\nAs he stands in front of you totally naked, trying to cover his body, you begin to tees him a little. You gently pinch his bottom, and grab for his cock. You take your long tong, and taste his bare flesh. You are very amused, when he tries to fight you off. <br>\r\n<br>\r\nYou then decide too</span></div></div>",
            "created":1122354000,
            "id":263650,
            "title":"You Fly Away With Keane"
        },
        "12521":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Make Him Screw Your Weybren Pussy",
                "Make Him Pound Your Weybren Ass"
            ],
            "content":"<div class=\"\"><div> <span>The Weybren fondles him some more, enjoying his squeals of discomfort. Despite his pleas and protests she still has him where she wants him, now what to do with him? She has to admit that for such a young man he sure is sexy...So she decides to act against her growling stomach and make this young thing her new toy. Her pussy gets wetter as she closes in on him, he cries out \"No...Plz god no...\" She pulles him close and pinnes him to the ground. now, Where to begin? You have a nice plump ass in need of a good pounding, but your pussy is just screaming for attention.</span></div></div>",
            "created":1122440400,
            "id":263795,
            "title":"The Weybren's New Boy Toy"
        }
    },
    "info":{
        "author_id":"mikel730",
        "author_name":"mikel730",
        "brief_description":"A small village is threatened by an unwanted creature.",
        "created":1120614060,
        "description":"<td align=\"left\" class=\"norm\">a small Village on a large Island has lived in peace for a thousand years, until recently when a strange beast appeared and began to eat any villager who crossed into it's domain.<br>\r\n<br>\r\nAs one of the Younger memebrs of the Village it's up to you and your 3 friends to stop the beast and become local heroes, or Perhaps you'd like to play as the Weybren itself and gobble up a few tasty villegers?<br>\r\n<br>\r\nThe Cast of Playable Chars is as follows:<br>\r\n<br>\r\nDiane(19, F):Diane is the 'Leader' of her friends though she shares that role with her lover, Keane. She's also not the bravest and belives the Weybren is real<br>\r\n<br>\r\nIllea(17, F):Diane's bratty younger sister. she annoys everyone. Despite her small size(she's 5'1)She's considerably brave.<br>\r\n<br>\r\nKeane(18, M):Diane's lover and Warrior in training for the village<br>\r\n<br>\r\n<br>\r\nDeeke(17,M):Illea's Love intrest and local prankster<br>\r\n<br>\r\nThe Weybren: the Monster it'self, loves to make tasty snacks out of anyone it catches and can swallow it's victem whole and alive. But may it doesn't want just food...after all...it can be very lonly being the only one of your kind...<br>\r\n<br>\r\nJust about anything goes in this Vore story so have fun, I won't delete much<br>\r\n<br>\r\nWARNING:The Weybren Storyline contains underage Nudity. ALso plz note that Omce the Weybren's gender has been established DO NOT CHANGE IT, there are now 2 seprate storyline's in which the Weybren is Male in one and Female in another, Plz Make sure of the Gender of the Weybren in those storyline's before adding...</td>",
        "id":987776,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1302170760,
        "modified":1302170760,
        "pretty_title":"The Weybren"
    }
}