{
    "chapters":{
        "1":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "idea",
                "idea",
                "idea",
                "idea",
                "idea"
            ],
            "content":"<div class=\"\"><div> <span>As I see here has done some things. Actually, the story was meant for someone else and it was not planned that someone writes here. But that has now done. I leave the story as it is, except for a few rules. Because here are some allusions were made to things that are not suitable for minors, I increase first the age restriction. Otherwise, just one more thing. I'm not a fan of some things, so I would also not like to see here all. Criminal violence (rape, murder), vore, and die. The three things. Otherwise I will leave you simply write times as you want. Who knows what evolve here for stories.</span></div></div>",
            "created":1399870800,
            "id":1795222,
            "title":"Start"
        },
        "11":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no",
                "me also!",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I want to write some more TG story</span></div></span></div>",
            "created":1399870800,
            "id":1795327,
            "title":"idea"
        },
        "111":{
            "choices":[
                "Sound Good ?",
                "Something Else ?",
                "Your Choice."
            ],
            "content":"<div class=\"\"><div> <span>A story about Billy Monk, a eight year old adopted boy who has not learned of his adoption, but will later find out in a series of events that his \"mother\" is a sweet and loving woman but with a rather large surprise that Billy will find out about.<br>\r\n<br>\r\nBilly's father is out of town most of the time on business trips and appears in the story once in a while.</span></div></div>",
            "created":1400216400,
            "id":1797544,
            "title":"yes"
        },
        "113":{
            "choices":[
                "Body Swap",
                "Gender Swap:",
                "Crossdressing"
            ],
            "content":"<div class=\"\"><div> <span>There are basically three styles of gender bender stories, so what kind would you like to try?<br>\r\n<br>\r\nBody swap: The exchange of bodies between two characters, obviously it should be between a man and a woman. Is a TG story line after all.<br>\r\n<br>\r\nGender swap: A male turns into a female version of himslef and vice versa.<br>\r\n<br>\r\nCrossdressing: There is no real physical transformation, but a \"Trap\" (A guy dressed like a girl that looks cuter or sexier than an actual girl) or a \"Reverse Trap\" (A girl dressed like a guy that looks more handsome than an actual guy) might be pretty interesting.<br>\r\n<br>\r\nSo what kind of Gender Bender you want to begin with?</span></div></div>",
            "created":1400389200,
            "id":1798328,
            "title":"Gender Bender"
        },
        "1131":{
            "choices":[
                "Magical Exchange",
                "Scientific Exchange",
                "Inexplicable Exchange"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you chose: The exchange of bodies between two characters... Male and Female obviously.<br>\r\n<br>\r\nLet's then make the next important choice:<br>\r\n<br>\r\nMagic, Science or Casualty, which is the reason behind the swap?</span></div></span></div>",
            "created":1400389200,
            "id":1798329,
            "title":"Body Swap"
        },
        "1132":{
            "choices":[
                "Magical Exchange",
                "Scientific Exchange",
                "Inexplicable Exchange"
            ],
            "content":"<div class=\"\"><div> <span>So you chose: A male turns into a female version of himslef and vice versa.<br>\r\n<br>\r\nSo... mmm... I don't actually like to copy/paste, but this time is inevitable, sorry.<br>\r\nHowever I'll do it again after this one...<br>\r\n<br>\r\nLet's then make the next important choice:<br>\r\n<br>\r\nMagic, Science or Casualty, which is the reason behind the swap?</span></div></div>",
            "created":1400389200,
            "id":1798330,
            "title":"Gender Swap"
        },
        "11321":{
            "choices":[
                "Boy turned into Girl",
                "Girl turned into Boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And here is the question I'll be photocopying three times at this interactive story (be patient, please):<br>\r\n<br>\r\nWhat was your character before the change?</span></div></span></div>",
            "created":1400389200,
            "id":1798339,
            "title":"Magical Exchange"
        },
        "11322":{
            "choices":[
                "Boy turned into Girl",
                "Girl turned into Boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And here is the question I'll be photocopying three times at this interactive story (be patient, please):<br>\r\n<br>\r\nWhat was your character before the change?</span></div></span></div>",
            "created":1400389200,
            "id":1798341,
            "title":"Scientific Exchange"
        },
        "11323":{
            "choices":[
                "Boy turned into Girl",
                "Girl turned into Boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And here is the question I'll be photocopying three times at this interactive story (be patient, please):<br>\r\n<br>\r\nWhat was your character before the change?</span></div></span></div>",
            "created":1400389200,
            "id":1798342,
            "title":"Inexplicable Exchange"
        },
        "1133":{
            "choices":[
                "Trap, boy as girl",
                "Reverse Trap, girl as boy",
                "Androgynous, what is its gender?"
            ],
            "content":"<div class=\"\"><div> <span>And you chose: the disguise option.<br>\r\n<br>\r\nSo... I don't really need to copy/paste the previous questions. Hahaha.<br>\r\n<br>\r\nThen here is the deal: male as girl, female as guy or simply androgynous (Someone that acts its gender but might get confused as a character of the opposite gender.)</span></div></div>",
            "created":1400389200,
            "id":1798334,
            "title":"Crossdressing"
        },
        "11333":{
            "choices":[
                "A boy (confused with a girl)",
                "A girl (confused with a boy)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So which is the actual gender of your androgynous character?</span></div></span></div>",
            "created":1400389200,
            "id":1798335,
            "title":"Androgynous, what is its gender?"
        },
        "12":{
            "choices":[
                "Go with it",
                "Yes, but with a role reversal",
                "Yes, but with a different idea",
                "No, have both hero and princess work together",
                "No, new idea instead"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a classical story where a hero saves the princess from evil.</span></div></span></div>",
            "created":1400302800,
            "id":1797818,
            "title":"idea"
        },
        "122":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "Prince saves Prince",
                "Princess saves Princess",
                "other idea?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Prince and Princess is too boring. How about? <br>\r\n<br>\r\nPrince of his prince rescues? <br>\r\n<br>\r\nPrincess who saves her princess?</span></div></span></div>",
            "created":1400544720,
            "id":1799213,
            "title":"Yes, but with a role reversal"
        },
        "1221":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "Children's adventure",
                "Youth Adventure",
                "Adult adventure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and the age of the two?<br>\r\n<br>\r\nChildren's adventure: 10-14<br>\r\nYouth Adventure:  15-19<br>\r\nAdult adventure: 20+</span></div></span></div>",
            "created":1400544900,
            "id":1799215,
            "title":"Prince saves Prince"
        },
        "12213":{
            "choices":[
                "Theodore is captured and must be rescued",
                "Keith is captured and must be rescued"
            ],
            "content":"<div class=\"\"><div> <span>Long a go in the distant land of Morondo there were two brothers. Keith a 25 year old prince was next in line for the throne while his younger brother Theodore, who was 24 years old, was to be his partner and ally. The two brothers were looking at the status of the coronation ceremony. All was going well until something went wrong. Zoro the wicked warlock from the west decided to invade and take one of the princes to marry his daughter Agatha the witch of corruption.<br>\r\n<br>\r\n\"Brother! We must make our way to Lumon if we are to take down this heretic and his perverse daughter.\" said Theodore.<br>\r\n<br>\r\n\"Very well, my dear brother we shall split and try to meet up at Avorain Cross. If neither of us makes it out then the one who is left must gather forces to rescue the other.\" said Keith.<br>\r\n<br>\r\nThe two brothers split off and try to escape, but unfortunately one of them gets captured.</span></div></div>",
            "created":1407343140,
            "id":1838125,
            "title":"The tale of two Brothers"
        },
        "1222":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "Children's adventure",
                "Youth Adventure",
                "Adult adventure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and the age of the two?<br>\r\n<br>\r\nChildren's adventure: 10-14<br>\r\nYouth Adventure:  15-19<br>\r\nAdult adventure: 20+</span></div></span></div>",
            "created":1400544960,
            "id":1799217,
            "title":"Princess saves Princess"
        },
        "12222":{
            "choices":[
                "The Secret of the \"Prince\"",
                "The \"Princess\" make her Entrance"
            ],
            "content":"<div class=\"\"><div> <span>Magic is no always just granted by divinity. And that was confirmed as the time passed.<br>\r\n<br>\r\nBy the year 2112 human technology reached the point were there was no difference between it and the magic descrived on fantasy books. But this is not the history of the moder magic, this is a story about those how train and learn about it.<br>\r\n<br>\r\nThe welcoming ceremony of the Pendragon Academy was going to take place surrounded by the shining cherry blossoms of the spring. It was delightful.<br>\r\n<br>\r\nThe students began to arrive about the seven o'clock under the cold light of the morning.<br>\r\n<br>\r\nIt was quite a view observing the boys and girls of the elit. After all, the Pendragon Academy was the number one magic school of the country. <br>\r\n<br>\r\nAnd here it is where everything began.</span></div></div>",
            "created":1400737200,
            "id":1800277,
            "title":"Vermillion Stigmata"
        },
        "1223":{
            "choices":[
                "Yeah children",
                "Teenage dreamers",
                "Perilous Journey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why not have the Princess save the Prince? If so what age are they?<br>\r\n<br>\r\nKid: 5- 12<br>\r\n<br>\r\nYouth- 13 - 18<br>\r\n<br>\r\nAdult- 18 and up</span></div></span></div>",
            "created":1400548680,
            "id":1799237,
            "title":"other idea?"
        },
        "12233":{
            "choices":[
                "traditonal",
                "scifi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What setting would you like?</span></div></span></div>",
            "created":1400891760,
            "id":1801235,
            "title":"Perilous Journey"
        },
        "122331":{
            "choices":[
                "She arrives too late Zuna already destroyed the map",
                "The priest explains the legendary treasure of Rosen to Sarah"
            ],
            "content":"<div class=\"\"><div> <span>It was another day in the kingdom of Rosen. The kind and loving Princess Sarah was expecting her best friend Sir Randal. Despite not being a prince he meant everything in the world to Sarah. She was going to throw a royal ball where there would be dancing and sport as noted by her swordswoman  attire. When all the guests arrived she opened the ball. At the ball she declared that if any man could defeat her in swordplay she would marry the winner. This caused many to from far and wide in hope of besting the princess for she was unrivaled in swordplay. Now Randal actually came close to beating her one time but lost due to being distracted by the beauty. The night was going smoothly until one thing happened. The evil witch Zuna crashed the party.<br>\r\n<br>\r\n\"Ehehehe! Hello there. Mind if I take a few of these lads off your hands? They'll make the most excellent henchmen!\"<br>\r\n<br>\r\nZuna then zaps one of the nobles. The noble slowly transforms into a monster. The former noble then strikes the other party guests transforming them into monsters as well.<br>\r\n<br>\r\n\"Sarah run to the church! There the priest will give you a map to the legendary treasure of Rosen. Only the treasure can save these men. Ouch! ... Run... Now... don't... worry... about... me...\"<br>\r\n<br>\r\nRandal then transforms into a monster. A hairy beast of some kind with a hunger for blood. Sarah then runs knowing that she is unable to save her friend from his cruel fate for now. She then runs to the church in order  to obtain the map to Rosen's legendary treasure.</span></div></div>",
            "created":1400893200,
            "id":1801244,
            "title":"Rise of the Beasts"
        },
        "1223312":{
            "choices":[
                "Stallwark Manor",
                "Sunvalacity"
            ],
            "content":"<div class=\"\"><div> <span>Sarah is relieved to see  that the church is still intact and knocks on its ebony door.<br>\r\n<br>\r\n\"Hello, who is it?\"<br>\r\n<br>\r\n\"It is I Princess Sarah. The wicked witch Zuna has invaded the kingdom and has turned all the nobles into savage beasts. My best friend Randal told me to find you before meeting the same cruel fate.\"<br>\r\n<br>\r\n\"I am truly sorrow your majesty. I'm afraid I don't have the whole map but take this piece of it along with this rune crystal. There's one thing you must know about the beasts and Zuna. The beasts can never be killed for they are protected by Zuna's dark magic. If you slay Zuna she will only reincarnate herself into a much more powerful form with each successive death. The only way to stop the curse is to trap Zuna in the Rosen Medallion. Only the Medallion can stop her for good for she'll be forced to wander for all eternity in the land of torment. I wish you well my friend for you will have a perilous journey.\"<br>\r\n<br>\r\nSarah then leaves the Church to find the next piece of the map to the Rosen Medallion. All seems well until she sees a town under siege. A man who is seriously wounded is seen hobbling on the road.<br>\r\n<br>\r\n\"Please ma'am our town is under attack from monsters. We tried killing them but their wounds heal in a matter of seconds. What's worse is that my friends have transformed into these very beasts before my eyes. I don't know how much longer I can retain my humanity. Aah!<br>\r\n<br>\r\nThe man then transforms into a beast.<br>\r\n<br>\r\n\"Foolish girl, there is no way that you'll defeat Mistress Zuna. For the age has come when she should take her rightful place as ruler of all. Prepare to submit to her majesty.\"<br>\r\n<br>\r\nThe beast attacks Sarah. Sarah outsmarts the beast by using her sword to cut down a beehive. The angry bees start stinging the beast. Knowing that there is no way to kill the beasts or Zuna without dire consequences. When Sarah enters the town she notices that the town is empty. She then checks for survivors. She then notices that the water barrel that was by one of the houses a second ago has moved. Sarah then tips over the barrel only for a young man wearing a robe to fall out.<br>\r\n<br>\r\n\"What's the big idea! Can't you see...\"<br>\r\n<br>\r\nThe magician notices that the beasts had left town.<br>\r\n<br>\r\n\"What happened here?\"<br>\r\n<br>\r\n\"We were attacked by Zuna's henchmen. They were more like a mix between werewolves and demons. Their leader was a blood red by what I call a Zurn. He lead his fellow Zurns to attack the town I hid in a water barrel to avoid death by it seems I was lucky to survive.\"<br>\r\n<br>\r\n\"Your act of cowardice might have potentially made you a useful ally against Zuna. Will you swear to take up arms and serve your country.\"<br>\r\n<br>\r\n\"Sure if that witch is going to destroy towns and cities then you can count me in.\"<br>\r\n<br>\r\n\"Good we need to find the Rosen Medallion so we can return innocent people back into humans.\"<br>\r\n<br>\r\n\"Wait those things were once human?! No wonder they understood what we were saying. I am Nicholas Sparks grand magician at your service your majesty. So where are we going Lady Sarah?\"<br>\r\n<br>\r\n\"First we are heading to...\"</span></div></div>",
            "created":1400969040,
            "id":1801720,
            "title":"The Treasure of Rosen"
        },
        "12233122":{
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"First we are heading to Sunvalacity. We will fins the second part of the map their.\" said Sarah looking into the distance.<br>\r\n<br>\r\n\"I shall be of great service my liege.\" said Nicholas with his fist raised.<br>\r\n<br>\r\nSo with her new ally Sarah was determined to save her love Randal from Zuna's mind control. When Sarah and her friend arrived at Sunvalacity she noticed a woman about her age dressed in priestly robes. She was none other than the priestess of Sunvalacity working to serve the Lord when the darkest hour arrived. For the sun eclipsed every few days and the rise of Zuna could mean doom to the city.<br>\r\n<br>\r\n\"Praise be unto the Lord. He sent two heros to rescue us from our burden.\" <br>\r\n<br>\r\n\"Pardon me holy Mother but what are you speaking about?\" asked Nicholas.<br>\r\n<br>\r\n\"I am Mother Daphne carrier of the map piece that leads to the Rosen Medallion. The Lord has sent you on a quest to save the land from wickedness.\"<br>\r\n<br>\r\n\"I am Princess Sarah Rose and this is Nicholas Sparks. Tell us Mother Daphne what is troubling this fair city.\"<br>\r\n<br>\r\n\"Every few days the sun eclipses and the people outside go into madness. Yet they do not return after the event. I know that they're alive but the Zurns must have bitten them. I pray that I do not join the ranks of the slaves of Zuna for only wickedness lies in her soul.\"<br>\r\n<br>\r\n\"This looks like one mystery that we'll have to solve.\" said Sarah.<br>\r\n<br>\r\n\"Mother Daphne how long has this been occurring?\" asked Nicholas.<br>\r\n<br>\r\n\"A few months.\"<br>\r\n<br>\r\n\"Very well we shall what caused this.\" said Sarah.<br>\r\n<br>\r\n\"Let me guide you to the library. There you should find some useful information on what you'll need.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1401339360,
            "id":1803881,
            "title":"Sunvalacity"
        },
        "122331221":{
            "choices":[
                "Douse them with water",
                "Use a magical chant"
            ],
            "content":"<div class=\"\"><div> <span>Mother Daphne then guides the heroes to the library.<br>\r\n<br>\r\n\"Here we are. This is Sunvalacity Library. Feel free to do some research.\" said Mother Daphne.<br>\r\n<br>\r\n\"Thank you blessed Mother.\" responded Sarah.<br>\r\n<br>\r\nThe two heroes then begin collecting some research. After a few hours Nicholas finds something.<br>\r\n<br>\r\n\"Hey Sarah I found something interesting.\" said Nicholas.<br>\r\n<br>\r\n\"What is it?\" asked Sarah.<br>\r\n<br>\r\n\"It's said that this town has a curse that strikes the city every 100 years. Every 100 years a creature known as a Laloopon causes the people to go mad. The Laloopon is said to feed off of this madness. Once the victim is drained they turn into statues. The statues then become Laloopons after seven months.\" said Nicholas.<br>\r\n<br>\r\n\"Let me get this straight. You're saying that these Laloopons feed off of insanity to procreate more Laloopons?\" questioned Sarah.<br>\r\n<br>\r\n\"That's right.\" replied NIcholas.<br>\r\n<br>\r\n\"So they're similar to Zurns except they stone beasts.\" said Sarah.<br>\r\n<br>\r\n\"Not exactly, but the stone beast part is correct. They're more like related to gargoyles than Zurns.\" replied Nicholas.<br>\r\n<br>\r\n\"So how do we beat them?\" asked Sarah.<br>\r\n<br>\r\n\"Well we...\"</span></div></div>",
            "created":1403232300,
            "id":1814710,
            "title":"Uncovering the Mystery"
        },
        "13":{
            "choices":[
                "Fantasy Setting",
                "Sci-Fi Setting",
                "Daily Life Setting",
                "Another Love-Comedy Setting",
                "Let's change the subject, I don't like corny stories"
            ],
            "content":"<div class=\"\"><div> <span>Love and comedy, that's and awesome mixture.<br>\r\n<br>\r\nWhat about it? Ready to give it a try?<br>\r\n<br>\r\nThought the question this time is: Which kind of setting does this love-comedy will have?<br>\r\n<br>\r\nEpic, magical and lots of fantasy?<br>\r\n<br>\r\nDoes technology is involved?<br>\r\n<br>\r\nIs a story that might be taking place in the real world?<br>\r\n<br>\r\nOr are you thinking about something else?</span></div></div>",
            "created":1400400900,
            "id":1798345,
            "title":"Romanticism"
        },
        "14":{
            "choices":[
                "Mystery",
                "Thriller",
                "Horror",
                "Gore",
                "\"I don't like those story lines\" - Something else"
            ],
            "content":"<div class=\"\"><div> <span>There are some kind of stories I had barely or never seen between the interactive stories of WDC<br>\r\n<br>\r\n&gt;&gt; Mystery: Who did it? How was it done? Which was the trick for the crime?<br>\r\n<br>\r\n&gt;&gt; Thriller: Give me the \"we-are-running-out-of-time\" suspense and a huge persecution.<br>\r\n<br>\r\n&gt;&gt; Horror: Is it really that scary?<br>\r\n<br>\r\n&gt;&gt; Gore: A cute <i>yandere</i> and blood gallons.<br>\r\n<br>\r\nThen... Who wants to begin?</span></div></div>",
            "created":1400430360,
            "id":1798454,
            "title":"You are the culprit!"
        },
        "143":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "I start terrorizing all of Acme Acres.",
                "I decide to terrorize another city instead."
            ],
            "content":"<div class=\"\"><div> <span>My name is Calamity Coyote and this is my horror story about how i turned into a giant rampaging coyote terrorizing all of Acme Acres.<br>\r\n<br>\r\nOne day at Acme University, I Calamity coyote was in my laboratory experimenting with a growth serum that i made and of course drank it down to see if it would work or not.<br>\r\n<br>\r\n\"Okay the serum's been drunk now i have to wait and see if it works or not\" I said.<br>\r\n<br>\r\nSuddenly i started shaking uncontrollably for some unknown reason as i started getting larger while i was taking up so much space in the laboratory and university until i outgrew the roof and was just standing there trying to figure out what happened.<br>\r\n<br>\r\n\"The serum worked, I'm now a giant\" my now booming voice said. <br>\r\n<br>\r\nNow what happens next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1400448660,
            "id":1798637,
            "title":"Horror"
        },
        "15":{
            "choices":[
                "Chad, tries to sleep but cannot rest.",
                "Tyler, spies on his dad and brother through out the day and night.",
                "Tyler finds one of dad's magazines under the bed.",
                "Max, tells Tyler he has a new game to play with him.",
                "Chad see's Max peeking at him in the shower and play along."
            ],
            "content":"<div class=\"\"><div> <span>How about a story involving a Father and his two boys, who all share the same one bedroom house, the father named Chad who is thirty five years of age and his two boys, Tyler who is seven years old and Max who had just turned  nine years old .... follow either the day in the life as Chad and the nights he has to cope with or follow either of the boys as they start to have strange feelings come over them.</span></div></div>",
            "created":1400216400,
            "id":1797311,
            "title":"idea"
        },
        "153":{
            "choices":[
                "Tyler takes a picture of himself naked and puts it in the magazine.",
                "Tyler wants to try stuff like in the pictures.",
                "Chad notices later that the pictures are out of order."
            ],
            "content":"<div class=\"\"><div> <span>Tyler is playing in the house just like any other day and finds himself in the one bedroom in the small house, as Tyler is playing he puts his small hands under the mattress and feels something, as he pulls his hands out he has a magazine in them.<br>\r\n<br>\r\nHe looks at the magazine and sees men with other mens cocks in their mouths, Tyler knows nothing about this but feels his little piece growing, he likes it and keeps looking.<br>\r\nAs he is flipping through the magazine, a couple pictures drop out of the back of the magazine and lands on the floor. Tyler picks them up and sees a boy about his age sitting on a bed naked, a few more pictures shows a large cock close to the young boy and then the last picture shows the large cock in the boys mouth.<br>\r\n<br>\r\nTyler hears his dad and brother downstairs and quickly puts the pictures back in the magazine and stuffs the magazine back under the mattress.<br>\r\n<br>\r\nAll day long Tyler cant get the pictures out of his mind.</span></div></div>",
            "created":1400302800,
            "id":1797690,
            "title":"Tyler finds one of dad's magazines under th..."
        },
        "1531":{
            "choices":[
                "The boy in the pictures.",
                "His father and brother.",
                "A stranger / Man in the pictures."
            ],
            "content":"<div class=\"\"><div> <span>With no time to spare ... Tyler quickly dropped his pants and took pictures of himself naked, nothing showing his face but just two pictures ... one of his small but stiff thingie and the second one was of himself bending over and showing his small balls and little butt.<br>\r\n<br>\r\nAs Tyler was stuffing the pictures into the back of the magazine and quickly putting the magazine back under the bed ... he is startled when in walks _____ as he is finishing pulling up his pants.</span></div></div>",
            "created":1422545640,
            "id":1924991,
            "title":"Tyler takes a picture of himself naked and puts..."
        }
    },
    "info":{
        "author_id":"katarus",
        "author_name":"Searo",
        "brief_description":"A story for writing.",
        "created":1399883820,
        "description":"<td align=\"left\" class=\"norm\">As I see here has done some things. Actually, the story was meant for someone else and it was not planned that someone writes here. But that has now done. I leave the story as it is, except for a few rules. Because here are some allusions were made to things that are not suitable for minors, I increase first the age restriction. Otherwise, just one more thing. I'm not a fan of some things, so I would also not like to see here all. Criminal violence (rape, murder), vore, and die. The three things. Otherwise I will leave you simply write times as you want. Who knows what evolve here for stories.</td>",
        "id":1991070,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1422545640,
        "modified":1422545640,
        "pretty_title":"Just a story"
    }
}