{
    "chapters":{
        "1":{
            "author_id":"napo08",
            "author_name":"napo08",
            "choices":[
                "Kim Possible",
                "Shego",
                "Bonnie",
                "Ann Possible",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In the episode, we saw a Kim Possible's mask maybe he has more female mask but who?</span></div></span></div>",
            "created":1395810000,
            "id":1767976,
            "title":"The start"
        },
        "12":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Spying on Drakken",
                "for fun",
                "having fun on Kim",
                "Ruin Shegos Villain live"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, but why is he becoming Shego?</span></div></span></div>",
            "created":1438965420,
            "id":2018091,
            "title":"Kims enemy"
        },
        "121":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Chip",
                "Bracelet",
                "More things"
            ],
            "content":"<div class=\"\"><div> <span>Ron was in an old Warehouse and had an Shego Costume in his Bag. He was here because he had an Idea how he could help Kim, he would dress himself as Shego and spy him out. He told Wade about his Plan but there was one problem, and Wade had an idea to solve it. he waited in the Warehouse on Wade and after a few Minutes, Wade came with his Robot. \"Hello wade, you use this Robot again?\" asked Ron who had the hope that he would come personally. \"Sorry Ron but my Mother forbade me to leave the House since I deleted some of her Recipes.\" Wade answered. \"Well but I have the Solution for your Problem.\" \"Really? You found a way?\" asked Ron with excitement in his Voice. Wade nodded \"Yes but you have to get dressed first.\" \"Ok.\" Said Ron and began to get into the Bodysuit and the mask on.<br>\r\n<br>\r\nA few Minutes later, Ron stand in front of Wades robot in his Shego disguise. \"Ok wade, now tell me what you did to fix the problem.\" Said Ron now with Shegos voice. \"I created an small gadget that will allow you to fight, act and be like Shego. You will still be yourself, but act like Shego, and having her fighting skills.\" His Robot arms took out an...</span></div></div>",
            "created":1440009060,
            "id":2022809,
            "title":"Spying on Drakken"
        },
        "1211":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "\"Shego\" is by Drakken",
                "\"Shego\" decides to buy some clothes before \"she\" walks to Drakken",
                "The Chip has an malfunction and Ron thinks he IS Shego"
            ],
            "content":"<div class=\"\"><div> <span>Ron looked a bit confused at it. \"A Chip? That's all? Just an Chip?\" \"This is not an normal Chip Ron. on this Chip is all saved what I found out about Shego. Her fighting skills and moves, her acting, likes and dislikes and many more. When I connect it with your Brain, you will be able to spy Drakken out.\" Wade explained it and Ron couldn't really disagree with that. \"Ok wade. So this means I am even able to fight Kim when she interrupts me, right?\"<br>\r\n\"Yes Ron. But be careful with that all. Your feelings for Kim are very strong and when this feelings overcome you, who knows what will happen.\" said Wade in an worried tone while the Robot placed the Chip on Rons Head so, that no one will find it. <br>\r\n<br>\r\nAfter an small pain in his Head Ron was ready. \"When this was all so far, i will go now. Drakken will not know what will happen to him.\" with this words \"she\" left Wade in the warehouse alone. \"Good luck my friend. I hope Kim will understand it, should she find that out.\" and with those words, the robot left the warehouse aswell.<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1440010980,
            "id":2022819,
            "title":"Chip"
        },
        "12113":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will his feelings being changed?</span></div></span></div>",
            "created":1449426000,
            "id":2071042,
            "title":"feelings"
        },
        "121131":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "\"Shego\" wants to turn Kim into her slave",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will his feelings for Kim being changed?</span></div></span></div>",
            "created":1449426600,
            "id":2071047,
            "title":"yes"
        },
        "123":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "get into Kims House to kidnap her",
                "get her in the City",
                "stalk her for a while"
            ],
            "content":"<div class=\"\"><div> <span>Ron was in his room and working on an new Costume. His Parents are on an Trip for at least 4 weeks and Rufus is in vacation. The last missions were a little too exciting for him. He made this time an Costume from Shego, Kims enemy. \"This will be very amazing.\" Said Ron to himself as he get off his clothes and stepped into the Costume. After he took the mask on, he played a bit with \"his\" new Body. Squeezing \"her\" Breasts and rubbing the new Vagina until he came. Then he took an Outfit on that looked Exactly like Shegos and stand in front of the Mirror. \"Time to have fun with you, Kimmie.\" smiled \"Shego\" with the new Voice.<br>\r\n<br>\r\nWhat will he do now?</span></div></div>",
            "created":1438972140,
            "id":2018150,
            "title":"Fun time"
        },
        "13":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Hide her now",
                "Have fun with her",
                "Look into her locker"
            ],
            "content":"<div class=\"\"><div> <span>It was an normal day in the Middleton High School. Ron was watching Kim by the Training with the Cheer Squad but he also was slowly sick about Bonnies attacks and insults against Kim. She tried a lot to make Kim look like an clumsy but she failed. Ron was thinking about something to help Kim against her, and had an idea.<br>\r\nAfter School he waited near by the Girls changing room. Knowing that Bonnie would be the last one who comes out, he waited until all left the Room. Then he prepared an rag with Chloroform and sneaked to Bonnie who was in front of her locker and humbled a Song while she has her eyes closed. He grabed her from behind and before she could scream, Ron forced the Rag into her face. Seconds later Bonnie was out and layed on the ground, naked and helpless.<br>\r\n<br>\r\nRon smiled as he saw her on the Ground. \"Time to get ready. You will not attack Kim again Bonnie. I make sure of that.\" Ron said as he got undressed and opened his backpack he had the whole time. He opened it and took out an Bodysuit with an mask of Bonnie. Minutes later Ron was no more and in the Changing Room where now two Bonnies. \"What shall I do with you now, my dear?\" said Ron with Bonnies Voice and an evil look in the Eyes.</span></div></div>",
            "created":1461250080,
            "id":2136915,
            "title":"Kims Nemesis"
        },
        "14":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "take the Costume on",
                "Hide the Costume and sleep",
                "Take the Costume on and sleep in it",
                "make another Costume"
            ],
            "content":"<div class=\"\"><div> <span>Kims Mother Huh? Ok. <br>\r\n<br>\r\nIt was Midnight and Ron was working on an new Costume. He had made the Bodysuit and was finishing the mask for the Costume. After a few Minutes, he looked at the Mask, and an smile came on his Face. \"This will be amazing.\" said Ron as he looked into the Mask who looked like Ann Possible.<br>\r\nHe looked outside and was Surprised how dark it was, Rufus was already sleeping and he was tired but wanted soo bad to take the Costume on.<br>\r\nWhat shall he do?</span></div></div>",
            "created":1437627600,
            "id":2011482,
            "title":"Kims Mother"
        },
        "141":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "is still his own",
                "is now like Ann Possibles",
                "his own but the Mask has an small gadget to change his Voice"
            ],
            "content":"<div class=\"\"><div> <span>Ron couldn't resist but taking his newest creation on. He undressed himself until he had just his pants on, then he took the Bodysuit and stepped with his legs in it. It was amazing how exactly they got in it, no feeling of tightness or the like. Ron continues to take it on until his Head was only free. He walked to an Mirror and looked at himself. \"I must say I do look mostly like Mrs. Possible. Just one thing is missing.\" Ron grabbed the Mask and took it on. After a few seconds he was looked into the Mirror again and couldn't believe what he saw. \"is that... really me?\"<br>\r\n<br>\r\nHis Voice...</span></div></div>",
            "created":1438059600,
            "id":2013593,
            "title":"Become Kims Mother"
        },
        "1412":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "wake up Rufus and telling him all but keeps it as an secret in front of his pare",
                "just tell it Rufus and his parents next morning",
                "keep it as an secret at all"
            ],
            "content":"<div class=\"\"><div> <span>Ron gasped after he realizes his Voice changed. \"Oh yeah this is so cool.\" He tried not to yell because he didn't wanted to wake up Rufus. \"This will be amazing being Kims Mom. But maybe I should take some clothes on.\" He looked at his new body and was completely naked and blushed. He walked to his Wardrobe and took an bra and an pair of panties. After he has putted them on he really enjoyed the feeling and began to touch his new Breasts, letting out a few moans.<br>\r\n<br>\r\nAfter he was done with exploring the Body, he realized that there were a few Problems. How would Rufus or, worse, his Parents react when they see him like this? He decides to...</span></div></div>",
            "created":1438196880,
            "id":2014055,
            "title":"is now like Ann Possibles"
        },
        "14123":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Ron didn't wanted that anyone will find that out, not even his best friend Rufus. So he took the Ann Possible Costume off again and hide it in his back. After that he took on his pants and went to sleep.<br>\r\nThe next Morning was like every other morning. He woke up, went to school and had this boring Lessons. At the end of the school, he talked with Kim. \"So Kim, did you planned something this weekend?\" asked Ron. Kim answered with an smile. \"My Family is the whole weekend away. And this means I have the whole House just for myself.\" Ron could hear in her Voice that she was very happy. He was it as well, because this weekend he can have a bit fun with his new Costume. \"Sounds Interesting. I have the same plan usual, when you don't have any Missions to do of course.\" said Ron, hoping that no Mission would come.<br>\r\n<br>\r\nAfter they split up, Ron was already thinking about a Plan for Kim. She would be surprised to see her \"Mother\" there.</span></div></div>",
            "created":1441633800,
            "id":2031073,
            "title":"no one has to know it"
        },
        "141231":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Kims Room",
                "another Room"
            ],
            "content":"<div class=\"\"><div> <span>It was now Friday and Ron went to Kims House. He had his bag and in there was the Costume. he brought Rufus to an Hotel for Animals like him to make sure he is alone. As he reached the House, he could see that Kims Parents and the Twins were leaving and no one was watching, the Door to the House wide open. He rushed into the House and had luck that the Car was very loud so no one heard him. In the House he was walking straight to...</span></div></div>",
            "created":1441913880,
            "id":2032587,
            "title":"Continue"
        },
        "1412312":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe the room of Kims parents?</span></div></span></div>",
            "created":1442086080,
            "id":2033405,
            "title":"another Room"
        },
        "14123121":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "an Box",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Ron was getting into the Room of Kims Parents and was closing the door. He panted and was laying down on the bed. \"Wow, I don't think I was so fast in my whole live.\" He said on the bed, a bit sweating and the Bag with the Costume on the Ground. After a few minutes he could hear how Kim was walking into her Room. Ok, now it is time.\" he wisphered to himself and began to take his clothes off until he was naked. Then he grabbed his Bag and took the Costume out. Then he took the Costume on with the Mask in the End. \"Ok now lets see what Miss Possible has in her Wardrobe.\" he opened the Closet and looked around  and he saw something interesting in it.<br>\r\n<br>\r\nWhat is it?</span></div></div>",
            "created":1442253780,
            "id":2034458,
            "title":"an surprise"
        },
        "141231211":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "sexy Lingerie",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>Ron saw an Box in the Wardrobe and took it out. It had the Size of an normal Box when you want to move house. \"I wonder what is in there. Telling from the weight it can't be something heavy.\" He said to himself as he lays the Box down. he was looking out of the Door to see if Kim was close, but to his luck she wasn't so he returned to the Box and opened it.<br>\r\n<br>\r\nWhat is inside?</span></div></div>",
            "created":1444321080,
            "id":2045104,
            "title":"a Box"
        },
        "1412312111":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Ron didn't looked bad as he saw an sexy Lingerie Outfit. His head became red and he felt an small tingling between his legs. \"Booyah. I hit the Jackpot. Now lets see what it is.\" He looked at the Outfits but had to stop for a few seconds since his new Pussy is tingling. He took an deep breath and calmed down. He looked at it and took it on.<br>\r\n<br>\r\n <a rel=\"nofollow\" href=\"http://www.sineros.de/images/product_images/popup_images/408923_0.jpg\" target=\"_blank\">http://www.sineros.de/images/product_ima...</a></span></div></div>",
            "created":1444323240,
            "id":2045113,
            "title":"sexy Lingerie"
        },
        "14123121111":{
            "author_id":"dekra",
            "author_name":"Draka",
            "choices":[
                "go with the idea",
                "an interruption"
            ],
            "content":"<div class=\"\"><div> <span>Ron was looking at himself in the Mirror and was making some sexy Poses. \"My my my am I an Hot chick or not? I didn't knew that Mrs. Possible has that Kind of clothes.\" he said quiet. Then after a while he was grabbing into his bag and took out an rag and an bottle of Chloroform. he was preparing the rag with it and sneaked into Kims Room where she was sitting in front of her Computer. She was in her underwear, just wearing her Panties and her Bra. <br>\r\nKim was on her PC and was looking at some News as Ron was pushing the Rag in her face. She tried to use her Athletic skills and strength to escape but the Chloroform was working too fast she was k.o. Ron was smiling as he was looking his Girlfriends body and had an idea.</span></div></div>",
            "created":1447258920,
            "id":2059810,
            "title":"Ready to Strike"
        },
        "15":{
            "author_id":"napo08",
            "author_name":"napo08",
            "choices":[
                "Monique",
                "Yori",
                "Camille Leon",
                "Betty Director",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Ron uses one of this mask.</span></div></span></div>",
            "created":1438059600,
            "id":2013491,
            "title":"Other"
        },
        "155":{
            "author_id":"napo08",
            "author_name":"napo08",
            "choices":[
                "Warmonga",
                "Tara the cheerleader",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these girls?</span></div></span></div>",
            "created":1438059600,
            "id":2013492,
            "title":"Other"
        },
        "1553":{
            "author_id":"napo08",
            "author_name":"napo08",
            "choices":[
                "Zita Flores",
                "Crystal the cheerleader",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1438059600,
            "id":2013499,
            "title":"Someone Else"
        }
    },
    "info":{
        "author_id":"napo08",
        "author_name":"napo08",
        "brief_description":"Inspired by the episode \"Attack of the killer bebes\". If Ron wears female mask?",
        "created":1395840300,
        "description":"<td align=\"left\" class=\"norm\">No kill<br>\r\nOnly Ron TG with mask and bodysuit<br>\r\n</td>",
        "id":1983587,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1461250080,
        "modified":1461250080,
        "pretty_title":"Kim Possible: Ron masking"
    }
}