{
    "chapters":{
        "1":{
            "author_id":"mullac",
            "author_name":"Lum Cal",
            "choices":[
                "A Huge, Hungry Giantess",
                "An Also Huge, Hungry Giant",
                "A Horny Giant/Giantess",
                "A Giant Smiling Couple",
                "I'm Out Of Ideas, So You Decide"
            ],
            "content":"<div class=\"\"><div> <span>'The World is in chaos!' the news reporter cries over the stamping and crashing of the giantess behind him,<br>\r\n'All self proclaimed 'Macrophiles' are taking over the world!'' as he said this the giantess walked over and swallowed the News reporter. You turn off the t.v.<br>\r\nYou just don't understand it, why can't people just embrace the blessing of these giants. You walk over to the window and watch the giants, they're not doing too much damage, realy. The odd destruction of a building here, the odd vore there...<br>\r\nthere's nothing to realy be worried about, and if these reporters hate the giants so much Why do they insist on going right up to them just to get some good film, they all got eaten in the end anyway!<br>\r\n<br>\r\nThere was a clashing sound from the floor bellow you, and then right behind you! you are blown back and would have broken your neck if you where any further away from the wall! You cough and gag and attempt to wave your hand in front of your face.<br>\r\nYou walk up to the gaping hole in your wall and look out to...</span></div></div>",
            "created":1186462800,
            "id":433251,
            "title":"Yeah it's the start"
        },
        "11":{
            "author_id":"mullac",
            "author_name":"Lum Cal",
            "choices":[
                "Oral vore (BUUURP)",
                "Anal vore (FAAARP)"
            ],
            "content":"<div class=\"\"><div> <span>The Giantess grabs you and lifts you up, she cackles, <br>\r\n'YOU ARE SO CUTE I COULD EAT YOU!'<br>\r\nNot such a bad way to go, you think.<br>\r\n'ACCTUALY, I THINK I WILL!'<br>\r\nShe cackled at her own joke, it wasn't even funny! </span></div></div>",
            "created":1186462800,
            "id":433254,
            "title":"Vore"
        },
        "111":{
            "author_id":"mullac",
            "author_name":"Lum Cal",
            "choices":[
                "You grab it! FREEDOM!",
                "Oh bugger, too late! to the thoat with everyone else you go"
            ],
            "content":"<div class=\"\"><div> <span>She grabs more people (men and women) and lifts them up to her face, to her mouth. This is it then, the end, you can only hope she swallows as you're not too into gore. She lifts you upp to her lips and slowly opens them... but then.... You See It! Your Salvation! one single strand of hair is just within reaching distance, If ... you... could... just... reach it! </span></div></div>",
            "created":1186462800,
            "id":433261,
            "title":"Salvation, or Savation lost"
        },
        "112":{
            "author_id":"mullac",
            "author_name":"Lum Cal",
            "choices":[
                "She sees you and stuffs you back in",
                "You are truly saved, now climb for your life!"
            ],
            "content":"<div class=\"\"><div> <span>She grabs mor people and swings around, she lift up her miniskirt (clothes grew with the people for some reason(?)) and pulls down her panties. Her hole opened up wide, and as it dose so, air is sucked in like a vaccume.<br>\r\nYou fall and... Oh God! you just missed! you are holding onto the hairs of her vagina! and there are some other people just as lucky as you!</span></div></div>",
            "created":1186462800,
            "id":433263,
            "title":"HELPMEHELPMEHELPMEHELPMEHELPME... thankyou"
        },
        "1121":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You are 'released' naturally a few hours later.",
                "They have some fun with you while you're there.  ",
                "You die there. "
            ],
            "content":"<div class=\"\"><div> <span>Sadly, you ruined it for everyone.  You were just a little too heavy, and she felt you tugging on her pubic hair.  \"Ha!  That tickles.  Sorry bud, but you need..to get...in!\"  As she said that, her left had reached down to the source of the tickling, and her fingers wrapped around you and all the others.  \"Oh, look, there are more of you!\" The others glared at you as they were brought up to her mouth.  Soon, their accusing faces were no longer visible as everyone was dumped into her maw.  When it closed, it was pitch black, and you couldn't tell which direction was which.  You heard a few screams followed but gulps and crushing noises.   You were entirely soaked in hot spit, and figured the bumpy surface you were being rolled around on was her tongue.  Finally, after what seemed like eternity, it felt like she was sucking on you, and all the spit came into one space, nearly drowning you.  you were then spit out into her hand, laying in a pool of saliva at the center of her palm and gasping for breath.  You turned around to see that there were a few giantesses around you now, and all were naked.  \"Alright, now made sure he goes in!\"  She dropped you into the palm of a short haired, chubby Chinese girl, who nodded gleefully as her Caucasian friend got on her knees and spread her ass cheeks to reveal her pulsating hole.  You were still dizzy after your time in her mouth and incredibly disoriented.  The chinese girl seemed to lick her hole twice to wet it before slowly pressing you in, leaving you there halfway at first.  The two of them laughed, and she tensed and loosened her pucker to squeeze your tiny body roughly.  \"See ya later little man~\"  The Chinese girl said in a sing-song voice before pushing you the rest of the way into the slimy rectum of your captor.  </span></div></div>",
            "created":1417755600,
            "id":1898024,
            "title":"She sees you and stuffs you back in"
        },
        "12":{
            "author_id":"mullac",
            "author_name":"Lum Cal",
            "choices":[
                "takes a bite out of the building",
                "Turns aroun, Sticks his Arse into the building",
                "Sticks his Dick into the building",
                "Sticks his Bollocks into the appartment building",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You look upwards to see a Giant guy standing over you, he is wearing nothing on his chest, and jeans (clothes grew with the people for some reason) and wears upon his face, a goaty. He looks down at all of the little people (men and women) who share this appartment building.<br>\r\n<br>\r\n'Mmh, Mmh, Mmh!' he says, 'Just gotta love those Little people!'<br>\r\nAnd with that, he...</span></div></div>",
            "created":1186549200,
            "id":433561,
            "title":"A great big Giant"
        },
        "123":{
            "choices":[
                "Dan hits his climax",
                "Another giant distracts him",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The giant unzipped his jeans with a grand smile on his face. Letting the oversized denim fall to the floor he was just left is his boxers, standing over the apartment building. An obvious happy trail being displayed on the brim of his boxers. \"o you littles are in for a treat! Here comes big Dan!\" the giant dropped his boxers revealing an incredibly large appendage, semi erect and surrounded by a bush of thick black hair.<br>\r\n<br>\r\nThe giant got down on his knees and jammed his cock into the street side of the building, smiling with pleasure and you are blasted backwards by the sheer force of the erection slamming into your home. \"So fucking good!\" the giant Dan smiled as he destroyed your home with his godly penis. </span></div></div>",
            "created":1283144400,
            "id":947380,
            "title":"Unzipped the pants"
        },
        "1231":{
            "author_id":"giantworship",
            "author_name":"Giant Worship",
            "choices":[
                "Dan gets up to destroy more of the city",
                "Dan shrinks down to tiny size",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Dan continues to rut away at the building. The apartments inside are totally decimated by his cock. Gripping the sides of the building, Dan thrusts in and out, reaming the hole even bigger. Sweat beads form on his chest as he moans from the pleasure he is getting.<br>\r\n<br>\r\nThe tiny inhabitants try to escape but between the violent shaking of the building and the giant's knees at the lobby entrance, there is no escape. Some of the apartment dwellers open their windows and wave sheets to get Dan's attention. It works, but not to their advantage. Seeing the tinies only made Dan hornier, his thrusts become more forceful as his balls churn up.<br>\r\n<br>\r\nHis cock gets thicker as he nears climax. The sensitive head smashing through more and more walls and floors pushes him over the edge. With a huge roar, Dan blasts his load hard into the building. His first shot rips through the insides and blasts out the other side of the building. Debris is sprayed for blocks. The subsequent shots pool inside, filling up the apartments with his spunk.<br>\r\n<br>\r\nSpent, Dan pulls out of the building and admires what he done.</span></div></div>",
            "created":1382677200,
            "id":1684028,
            "title":"Dan hits his climax"
        },
        "1233":{
            "author_id":"dragonnite",
            "author_name":"The Abysmal Chasm",
            "choices":[
                "\"My cock is hungry.\"",
                "\"Make me cum littles.\"",
                "other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The giant began to speak.</span></div></span></div>",
            "created":1308891600,
            "id":1134050,
            "title":"what?"
        },
        "12331":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "The tip / mouth of his dick.",
                "end up on his balls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Giant licks his lips saying, \" Fe Fi Fo Fuck! My cock is hungry!\" The tip of his dick opens like a mouth and as he thursts you fall into....</span></div></span></div>",
            "created":1573614060,
            "id":2745998,
            "title":"\"My cock is hungry.\""
        },
        "125":{
            "author_id":"hungrychild",
            "author_name":"Hungry Child",
            "choices":[
                "Man",
                "Woman",
                "Teen"
            ],
            "content":"<div class=\"\"><div> <span>\"mmmh, So many people to choose from! Now just who will I eat first?\" As the giant speaks every one begans frantically running and jumping behind furniture. But the giants eyes aren't looking at any of them there looking at you, \"I thinks I'll start with this little _________ !\" and his hands reach for you.</span></div></div>",
            "created":1226034000,
            "id":605242,
            "title":"other"
        },
        "1251":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "18-25",
                "26-35",
                "35-49"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Man.\"<br>\r\n<br>\r\nWhat age group?</span></div></span></div>",
            "created":1428382800,
            "id":1960486,
            "title":"Man"
        },
        "1253":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "15-16",
                "17-18",
                "19-20"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"... How old are you?\"<br>\r\n<br>\r\n\"__\"</span></div></span></div>",
            "created":1402894800,
            "id":1813294,
            "title":"Teen"
        },
        "13":{
            "author_id":"nissen211",
            "author_name":"rer",
            "choices":[
                "giant",
                "giantess",
                "both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it a giant or a giantess?</span></div></span></div>",
            "created":1186462800,
            "id":433291,
            "title":"which one?"
        },
        "131":{
            "author_id":"selphane",
            "author_name":"Selphane",
            "choices":[
                "He's a teenager!",
                "It's an adult!",
                "It's a young kid, under 16 years old."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How young is this giant that's decided to give your apartment a nice big window?</span></div></span></div>",
            "created":1286254800,
            "id":969657,
            "title":"The Horny Giant"
        },
        "1311":{
            "choices":[
                "Someone you know",
                "Stranger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the giant someone you know, or a stranger?</span></div></span></div>",
            "created":1286341200,
            "id":970391,
            "title":"He's a teenager!"
        },
        "13111":{
            "choices":[
                "Your 16-year-old best friend (and secret crush) Dylan",
                "The 18-year-old brat from across the street Ron"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Final question...Who is it?</span></div></span></div>",
            "created":1286341200,
            "id":970395,
            "title":"Who is it?"
        },
        "131111":{
            "author_id":"crazy_coyote",
            "author_name":"C.c.",
            "choices":[
                "go find some more \" friends \"",
                "do it some more! "
            ],
            "content":"<div class=\"\"><div> <span>Scooping you up in 1 giant hand he lifts you up near his face. Standing in the palm of the hand, you look up ruggedly handsome features your emotions begin to overcome you. Please don't eat me you yell. Suddenly, he moves you near his face. His mouth opens in you think this is the end, but he sticks his tongue out and licks you  from your feet to your head. Eat you? He says. I'd never eat my best buddy! Swiftly, he strips off all your clothes. Your dick get hard as a rock, you can't help yourself, your secret love is playing with you like a tiny sex doll. I have wanted to do this for years he rumbles. He puts you in his mouth feet first with only your head sticking out of his lips. He begins to massage your tiny body with huge warm tongue. over, under, and around his tongue caresses every inch of your small body. it slides back under and forces its wake up between your legs and then it bends over and the tip starts to wiggle in your crotch. It's more than you can take and you blow cum all over the place ! Spit you out into his hand and licks your little body clean. I love you! You yell into his giant face. Really? I have wanted to do that for years. But I was afraid you would hate me. He says. Now lets......</span></div></div>",
            "created":1310274000,
            "id":1144635,
            "title":"Your 16-year-old best friend (and secret crush)..."
        },
        "1312":{
            "author_id":"mikelam",
            "author_name":"33",
            "choices":[
                "the giant blows more smoke on you",
                "the giant puts you in his pocket",
                "the giant puts you in his pants"
            ],
            "content":"<div class=\"\"><div> <span>You look out the hole in your wall and see the largest man you have ever seen in your life.  You do some quick math as you stand in awe - you live on the seventh floor, but the building is 11 stories... roughly 13 feet a story... this guy was just under 150 feet tall.  He was also massive.  His belly was the size of a mountain, covered in thick, dark hair.  He had a huge black beard that lay upon his chest, and a shaved head.  He was wearing a pair of mesh shorts, and nothing else.  Realizing you immanent fate, you decided to try to figure out what was going on.<br>\r\n<br>\r\n\"Hey, big guy!\"  you yelled, \"how'd you get so huge?\"<br>\r\n<br>\r\nThe giant lumbered over towards you, his massive belly eye-level, and looked down.<br>\r\n<br>\r\n\"I was sitting at home, wishing I was this big... and then, all of a sudden, I was.  Sorry about punching the hole in your building, but I got pissed.\"<br>\r\n<br>\r\n\"You got pissed you grew?  I thought you wanted to be this big?\"<br>\r\n<br>\r\n\"No, I got pissed because I have two packs of marlboros in my pocket, and not a lighter.  I'd love to have a smoke.\"<br>\r\n<br>\r\nYou were perplexed.  While the giants had simply been ravaging the city, this guy was not attempting to eat you or destroy you - of course he had punched a hole in your building.  While smoking was something you hated, you thought you might be able to help the giant, and keep yourself safe.<br>\r\n<br>\r\n\"Well, I have a lighter I keep here for emergencies,\" you offered.<br>\r\n<br>\r\nThe giant chuckled.  \"That's a nice offer, kid, but my marlboro is bigger than you.\"<br>\r\n<br>\r\n\"Well, I thought about that,\" you said, grabbing the lighter.  \"You willed yourself to be this big, so maybe you can make the lighter big as well.\"<br>\r\n<br>\r\n\"Huh,\" the giant replied.  \"it is worth a try.\"<br>\r\n<br>\r\nWithout warning, the giant wrapped his giant hand around and pulled you out of the building.  He opened his hand, and you sat the lighter in his palm.  The giant looked down at the lighter, and like that the lighter grew to giant size.  The giant laughed out loud, and you could see his enormous belly jiggle.  The lighter was just bigger than you, so you realized to him you were probably about three inches tall.<br>\r\n<br>\r\nThe giant used his other hand to fish a marlboro out of his pocket, and placed it between his lips.  His enormous hand then picked up the lighter, just mere inches from your body.  The giant lit the cigarette, and placed his newly acquired lighter into his pocket.  A smile crossed his face as the cigarette dangled from his lips.  He took a massive drag, and then brought you close to his face.  Removing the cigarette, he blew a torrent of warm, acrid smoke across your body.<br>\r\n<br>\r\n\"Thanks, tiny,\" the giant said.  \"When I first saw you, I wanted nothing more than to do that.  I have both a giant and smoking fetish.  So now you can understand why I was so mad I punched a hole in your building, hahaha.\"<br>\r\n<br>\r\nYou were mortified.  You realized you were now a giant's smoke slave... and, being as this was his ultimate fetish, your stomach shrank when you thought about the only place this could lead...</span></div></div>",
            "created":1350968400,
            "id":1452310,
            "title":"It's an adult!"
        },
        "13121":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Give him a blowjob",
                "Give him a rimjob"
            ],
            "content":"<div class=\"\"><div> <span>The giant takes another breath of his marlboro and blew the warm smoke all across your body.<br>\r\n\"I'm gonna have a ton of fun with you, eh boy?\" He says, bringing you closer towards his lips, giving you a soft kiss. You feel his lips from your face to your abdomen. He begins to rub you against his well muscles left pec. You are forced against his firm pectoral muscles as he \"juggles\" his pecs, going from semi hard to completely hard, as he is quite well muscled, having just a bit more muscle on him than fat, but still enough fat to sport his large gut.<br>\r\nForced against his chest hairs, he rubs all across his chest before moving you towards his left armpit. It smells horrible, like he hasn't bathed in weeks! The sweat evaporates off of him and you are surrounded in the hot mist of his armpit sweat, the musky aroma stifling you. Fortunately, he soon moves you from the wretched place, and you are brought back towards his pecs, his left one to be exact. He leads you towards his left nipple, rubbing you around it until it becomes erect.<br>\r\n\"Lick it.\" He orders,<br>\r\n\"No way!\" you respond, \"You can't make me do that!\"<br>\r\nStill hanging the cigarette in his mouth, lifts you a bit to blow another puff of smoke at you. As you cough from the smoke, the giant gazes at you, giving you a sadistic grin. You know that you're not in the right position to argue, and so does he, and he knows that you know this.<br>\r\nOnce again, he drags you toward his nipple. Angered and humiliated, you try and retaliate by biting down on it, but you guess that you did it in the wrong spot when you hear the giant moan. Biting him only arouses him; you should have figured, given his immense size. You decide to just give up and begin licking.<br>\r\n<br>\r\n\"Oh yeah!\" The giant moans, growing an enormous erection nearly three times the size of your body. Eventually, the nipple begins to poke out, and, thinking of what you'd like in this sort of situation, you begin to suck on it.<br>\r\n\"Oh-hh-h, oh yes!\" The giant moans louder, clearly enjoying himself.<br>\r\n<br>\r\nAfter a minute more of licking this giant man's nipple, the giant begins to speak to you as you continue.<br>\r\n\"Alright, save that mouth of yours, little man,\" he chuckles, \"I've got a new job for you, kid...\"</span></div></div>",
            "created":1395896400,
            "id":1768548,
            "title":"the giant blows more smoke on you"
        },
        "131212":{
            "author_id":"thefireofice",
            "author_name":"Fire of life",
            "choices":[
                "Sucked in",
                "Blasted out"
            ],
            "content":"<div class=\"\"><div> <span>I like you to give me a rimjob\" before you could say anything he picked you up a sperad his ass checks his butt was huge and his anus was the size of a min van it was also filthy he move you in and pressed you right against his asshole  you gut stuck in his hair  he let his hands go and his ass checks slammed shut leve you nothing else but to give him a rimjob</span></div></div>",
            "created":1495688400,
            "id":2324951,
            "title":"Give him a rimjob"
        },
        "1312121":{
            "author_id":"peacefrostwolf",
            "author_name":"frostwolf",
            "choices":[
                "He shits you out later",
                "He somehow pushes you further in "
            ],
            "content":"<div class=\"\"><div> <span>This teacher was notorious for his smells - everyone tended to sit in the back of the classroom due to his pungent odor; specifically, that of his rear. With his newfound privacy and toy, he bent over and rubbed your grimacing face against the puckered anus, hungry for a living, squirming meal.<br>\r\n<br>\r\nHe let out a fart right in your tiny face, blasting you. If it weren't for his hand holding you in place you're sure you would've launched across the room. Instead your face and nostrils burn with the acid wind as it makes a terrible noise past your ears. <br>\r\n<br>\r\n\"You feel amazing down there. Finally, someone to swallow all of my farts.. and my shit, if you're lucky.\" His hand lets go and his asscheeks clamp shut, shuddering you in darkness as the smell becomes locked in. He wedges up his tight briefs which trap the sticky butt sweat and juices up against you and the mountianous mounds surrounding you. Your face nearly presses into the anus, and you feel like crying. It wouldn't do you any good, it feels too amazing to have a squirming, warm butt plug to let him go because he's miserable about it.<br>\r\n<br>\r\nMr. Brown, the teacher, heads out for the day, making sure to change his stride so his buttcheeks grind together and force you deeper and make you squirm to prevent yourself from being crushed.<br>\r\n<br>\r\nSuddenly he slams his ass down into his plush car seat, forcing your face right into the maw of the anal ring. It pulses around your face, dried shit caked to it smearing on your skin. You scream but only manage to get filth in your mouth which you immediately regret. <br>\r\n<br>\r\nMr. Brown blows out a cheeky little fart, opening his asshole wider. As he does this he brings a finger around and shoves the tip against your feet through the fabric; the perfect combination of timing pushes you in further, to your shoulders. You squirm for freedom but his ass has a tight grip. Mr. Brown clutches his stomach. That chilli is not agreeing with him. And while he's not enjoying it quite so much from his stomach, he's going to absolutely love your tiny form shoved between his plump butt cheeks and swallowed whole and alive by his anus. It wetly pops around your shoulders as Mr. Brown wiggles his finger deeper into his crack before settling. Once he gets home he rushes inside to the bathroom, flicks open his pesky work pants, and then tears his briefs off. He turns to the mirror and pulls a mound out, seeing your tiny body wedged into his hot little hole using the reflection in the mirror. <br>\r\n<br>\r\nUnceremoniously, he grabs your ankle and shoves you deeper yet. Your legs flail as your face grinds into the anal walls, contracting and spitting butt juices all over you. His sphincter opens wider to accept your hips as it wetly ingests you, loving the meal its being fed. Your face finally comes into contact with remnants of Mr. Brown's last shit. His one hand jerks his meaty cock off while the other shoves you deeper yet into his bowels. The feeling of you moving to try and get out against his prostate just feels too damn good.<br>\r\n<br>\r\nHe cums just as he lets your feet slip inside his asshole, a hot fart echoing past you, moving his last meal further along his intestines where it'll meet your face and encase you in a living log of shit, nothing more than ass food. </span></div></div>",
            "created":1565585400,
            "id":2700700,
            "title":"Sucked into his ass"
        },
        "1313":{
            "choices":[
                "Your 15 year old (formerly) little brother, Ash",
                "An 14-year-old boy you used to baby-sit for, Caleb",
                "An unknown 13-year-old boy, Luke"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the big young guy?</span></div></span></div>",
            "created":1286341200,
            "id":970397,
            "title":"Under 16-crowd"
        },
        "13131":{
            "choices":[
                "He uses you to help him get aroused",
                "He shows you to his friends who have also grown"
            ],
            "content":"<div class=\"\"><div> <span>You look up and see the smiling face of your younger brother, Ash.  The last time you saw him, he was only around 4' 11\"; you could easily pick him up and dangle him by the armpits.  Now, you are barely taller than his toes! You stagger back, taking in the majesty of this massive youngster.  His feet could easily crush your car, and his knees are level with the roof of your house.  You keep looking up, noticing that he is now completely naked.  His body is fit and lean; he took after you and was an athletic kid, and didn't have much fat on his body at all.  His chest was just beginning to develop pecs, and his stomach had the slight outline of ab muscles starting to form.  <br>\r\n<br>\r\n\"There you are!\" he exclaims, as his massive hand reaches down and scoops you up.  His fingers, each the size of an elephant's trunk, wrap around you, nearly squeezing you to death.  After a few terrifying seconds, he opens his hand and has you sit in his palm, directly underneath his grin. \"What do you think of me now?\" he asks. <br>\r\n<br>\r\n\"Think of you?\" you stutter as you respond.  Luckily, you knew that, overall, your brother liked you; while you would sometimes lord your size over him and pin him down wrestling, you also spent a lot of time with him and helped him out a lot.  You hope that he will remember that now at his new size. \"I think it's pretty cool, don't you?\"<br>\r\n<br>\r\n\"Yeah, it's awesome,\" he replies.  \"All this growing feels really good.\" He takes his other hand and rubs it across his chest.  You look down and notice that his manhood, much longer now than you are tall, is beginning to rise to attention.  Your lips start to salivate at the thought of the power it had within.  You look up and notice that your brother is now starting to twitch slightly with pleasure.  What was he going to do with you now?</span></div></div>",
            "created":1286341200,
            "id":970406,
            "title":"Ash is happy to see you"
        },
        "131311":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "No, he just wanted too scare you. Your family, man!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I wonder how you'll feel in my dick!\" Your brother slowly brings you over to his dick.<br>\r\n<br>\r\nYou panic as it starts bobbing up and down, almost as if nodding.<br>\r\n<br>\r\nDoes your brother follow through?</span></div></span></div>",
            "created":1513832400,
            "id":2431105,
            "title":"He uses you to help him get aroused"
        },
        "1313111":{
            "author_id":"jd1234",
            "author_name":"Jd123",
            "choices":[
                "No he let's you do the work",
                "Yeah he's a hormonal teenager and needs his fix",
                "Somthing else"
            ],
            "content":"<div class=\"\"><div> <span>As he gently placed you on his throbbing cock he began squeezing you and his boyhood, I guess your brother dosent know his own strength because it felt like your bones were about to snap, you let out a small squeak which was an indication to you brother to stop squeezing as he let go of you and his member. You look up at the towering teenager and you're met with a toothy grin you only respond with an uneasy and nervous smile back. Then a booming voice comes from above.<br>\r\n\"Hey bro do you mind umm... Helping me out?\" You quickly realize he's talking about the humongous horse you have between your legs. As you look downwards his balls catch your eye. THEY. ARE MASSIVE! You see that he probably hasn't cum in weeks or maybe even months. just thought of how much cum those nuts contain would be enough to make you hard but that coupled with the feeling of his gigantic cock on your bare skin and the muskiness of his crotch is just over kill. So you respond with a sly.<br>\r\n\"Sure but only if you help me get off after.\" \"little\" brother responds with a quick nod and an over joyed smile. You quickly start to work focusing mostly on the head but also squeezing your legs together and essentially humping his cock to get him off as quick as possible. It seems to be working because from above the jumbo junior high-schooler was making all sorts of moans and groans and starting to tense up. He leaned up against a building that was only slightly taller than him and slowly started sliding down he lied down on the now empty streets as you continued to pound away at his boyhood starting to get exhausted because of this process<br>\r\n<br>\r\nDoes Ash help you out? </span></div></div>",
            "created":1569576660,
            "id":2724085,
            "title":"Yes"
        },
        "13131112":{
            "author_id":"jd1234",
            "author_name":"Jd123",
            "choices":[
                "Yes so you please him more(dick insertion) ",
                "No you hold on and try to not get crushed ",
                "Yes but Ash takes matters into his own hands again (butt stuff) "
            ],
            "content":"<div class=\"\"><div> <span>Ash (like the impatient kid he is) decides to take matter into his own hands. Or hand. He wraps his humongous hand around his boyhood and you and slowly starts closing his fingers around you body and his member there's no getting away now, but the help is almost welcomed because your legs and abdomen. and arms were burning and starting to hurt... Almost welcomed. Unfortunately ash still doesn't know his own strength and starts to crush you into his rock hard cock. You try calling out to him with the squeak that worked before but either ash didn't hear you because he was too focused to listen or he just didn't care. Some pre-cum is start to ooze out of the head, it slides down and lands on your head, the smell of the cum was heavenly and the taste just as much. Does it drive you mad? </span></div></div>",
            "created":1570696800,
            "id":2730804,
            "title":"Yeah he's a hormonal teenager and needs his..."
        },
        "13131113":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "begins to rub you on his cock head, which gives him an idea... (CV)",
                "He dribbles cum on you, then, as promised, he helps you out"
            ],
            "content":"<div class=\"\"><div> <span>Ash grows impatient. \"Hey! Come on, let's go!\"<br>\r\n<br>\r\nThe musty scent coming off his scrotum is actually making you have second thoughts about helping. It seems to have frozen you. <br>\r\n<br>\r\nAsh makes the decision for you when he picks you up and presses you against his balls. He continues rubbing you up and down. He...</span></div></div>",
            "created":1570733640,
            "id":2730968,
            "title":"Somthing else"
        },
        "131312":{
            "choices":[
                "One of them breaks you in",
                "You're forced to worship all four of them"
            ],
            "content":"<div class=\"\"><div> <span>The boy who, yesterday you were able to pick up, now holds you as easily as if you were a pebble. Ash proudly holds you in his palm as he walks down the street. He sees some of his friends on the other side of the neighborhood, and cuts onto the grass to meet them directly. Along the way he downs multiple trees and traffic signs, and you wonder if he's doing it intentionally. Grass and soil is compressed everywhere he places his foot, and he also smashes it through a fence as he cuts through someone's yard. One of his friends, Trey, spots him. \"Hey Ash! You grew too! This is so awesome!\" Trey is 14, isn't exactly skinny bit isn't fat either. He's stronger than he looks and has  a big mouth. You've met him before, and know he's a nice kid. His blond hair is cut neatly. Usually when you've met him before he'd worn khaki shorts but now he was a naked as your brother. <br>\r\n\"Who did you get?\" another boy inquires. His name is Mark. He's 15, a skinny boy with straight black hair. He's usually quiet but you know he's a troublemaker. <br>\r\n\"My new little brother\" Ash responds sarcastically. You'really then presented to the others. The massive boys approach and seem to fill the sky. You see a third boy, Jimmy, who has curly hair and, although he's quite shy, you know he's very sweet and would never even hurt a fly.<br>\r\n\"Anyone want to help me break him in?\" Ash asks. \"He needs a good demonstration of what we're capable of.\"</span></div></div>",
            "created":1442206800,
            "id":2034352,
            "title":"He shows you to his friends who have also grown"
        },
        "1313121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Kiss my dick",
                "Lick my dick",
                "Suck my dick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'll break him in!\" It was Johnny. He unzipped his fly, and ordered you to...</span></div></span></div>",
            "created":1517115600,
            "id":2446028,
            "title":"One of them breaks you in"
        },
        "13133":{
            "author_id":"h4ckedmyg4mma",
            "author_name":"H4ckedmyG4mma",
            "choices":[
                "A 16 year old girl with no connection to Luke ",
                "Luke's 14 year old brother"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we get to the good part, who are you?</span></div></span></div>",
            "created":1438232400,
            "id":2014564,
            "title":"An unknown 13-year-old boy, Luke"
        },
        "131332":{
            "author_id":"hunky",
            "author_name":"LucasFan17",
            "choices":[
                "Luke rummaging through our secret lab full of potions ",
                "Clothes ripping "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were watching tv all alone until your little brother Luke busted in your room and started to pester you. \"Uh get out of here shortty before I beat you up. \"Fine said Luke. Later I heard something quite odd.</span></div></span></div>",
            "created":1515042000,
            "id":2436685,
            "title":"Luke's 14 year old brother"
        },
        "132":{
            "author_id":"shikamaru",
            "author_name":"Mr.Ninja",
            "choices":[
                "she puts you in her bra",
                "kills you in her ass(go on from the giantess' point of view",
                "shoves you in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>it's a giant blonde giantess she picks you up and pulls her pants and panties down time for some fun she puts you by her ass and puts you inbetween her cheeks and starts squeezing her ass together crushing you then </span></div></span></div>",
            "created":1204434000,
            "id":504740,
            "title":"giantess"
        },
        "1322":{
            "author_id":"shikamaru",
            "author_name":"Mr.Ninja",
            "choices":[
                "choice 1",
                "choice 2"
            ],
            "content":"<div class=\"\"><div> <span>that was fun but i'm still horny she grabs a building and shoves in up her ass that's a little better put what about my pussy and boobs i know she grabs a train in you go and she shoves it in her pussy now for my boobs she lays down people you have two chocies 1 you go in my bra or 2 I grow taller and smash you city with my boobs and ass so which 1</span></div></div>",
            "created":1204434000,
            "id":504743,
            "title":"how should they die"
        },
        "13222":{
            "author_id":"shikamaru",
            "author_name":"Mr.Ninja",
            "choices":[
                "eat a city ",
                "sit on a city"
            ],
            "content":"<div class=\"\"><div> <span>no one listened fine she grow intill she was 500 ft tall now for some fun she lays down smashing her boobs in too the city now for my ass she takes her pants and panties off again and sits down on them farting and hearing these squishing sounds gets up and strips naked now what should  i do</span></div></div>",
            "created":1204434000,
            "id":504745,
            "title":"choice 2"
        },
        "1323":{
            "author_id":"inanimate",
            "author_name":"Toriko123",
            "choices":[
                "They have normal sex",
                "Anal sex"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She start to push you in her anus after you got pass her asshole you see the opening closed what happens</span></div></span></div>",
            "created":1554907140,
            "id":2643016,
            "title":"shoves you in"
        },
        "14":{
            "author_id":"mullac",
            "author_name":"Lum Cal",
            "choices":[
                "Hetro, so the giant you're on is a guy",
                "Gay, both giants are guys",
                "Lesbian, both giants are Women",
                "Hetro, the giant you're on is a Woman",
                "Other, if you can think of anything else"
            ],
            "content":"<div class=\"\"><div> <span>You look up and out of the gaping hole in your wall and see a Giant Couple! Both are wearing nothing but jeans and the shorter of the two is draped ofver the taller one's shoulders, they are both grinning from ear to ear.<br>\r\nThere is another tremmor, but you're too stunned to steady yourself! You fall of the edge and scream, but luck is on your side as you are near enough to grab onto the taller giant's jean button! grasping all of your strength, you grab the edge of the jeans and pull yourself up and over, you feel the giants soft, yet somehow firm, skin, and fall down, you grab onto the wirey hairs and find yourself in a forest of pubes!<br>\r\n<br>\r\nLight suddenley bursts in, and you realise the giant has undon his/her flys!<br>\r\n<br>\r\nNow, the only question left is, are the giants...</span></div></div>",
            "created":1186549200,
            "id":433566,
            "title":"Giant Couple, great"
        },
        "141":{
            "author_name":"Xaotheone",
            "choices":[
                "You attempt to wound your captors and try and get away",
                "You endure the inevitable"
            ],
            "content":"<div class=\"\"><div> <span>Being a completely straight guy yourself, you're horrified to find yourself surrounded by a forest  of pubes, and as the fly is unzipped a giant hand open the fabric of the boxer briefs, that's when you realize you're in the underwear of a giant man!<br>\r\n<br>\r\nYou scream as you are sitting right on his long dick. \"HELP!\" yous cream as a hand pushes you against the penis all the more, rubbing you into its soft flesh. Underneath of you you find the titanic organ harden and move, you were smaller than it before, but now it towers over you.<br>\r\n<br>\r\nThe hand then scoops you up and drops you under the giant shaft and begins rubbing you up against the balls. You realize this hand is feminine and you are being used as a sex toy to make the giant man excited, and it's working like a charm.</span></div></div>",
            "created":1187154000,
            "id":436117,
            "title":"In His Pants"
        },
        "142":{
            "choices":[
                "They leave you there.",
                "They take you out.",
                "The taller giant jacks off with you on there."
            ],
            "content":"<div class=\"\"><div> <span>Light flooded in, and you blinked at the sudden brightness. You rubbed your eyes and looked around. You were in the giant's crotch, and looking down, you realized where you had landed. In your plummet, you had fallen onto his cock. It was huge, at least 6 feet long. Your legs could not wrap around it, it was so large. As you sat up, you noticed it was hardening and froze. You looked up, way up. Far above you, the giants peered down at you, grinning happily.</span></div></div>",
            "created":1205384400,
            "id":508422,
            "title":"In the Groin"
        },
        "1421":{
            "author_id":"lastfeelbender",
            "author_name":"That Boi",
            "choices":[
                "Swallows the cum but not you.",
                "Swallows everything including you.",
                "Spits you out onto Cole's chest."
            ],
            "content":"<div class=\"\"><div> <span>\"Aww, Dalen, look at the little guy! He's so cute perched on my cock!\" The giant said. \"Oh, I know, Cole... What do you think we should do with him?\" Dalen said, running his hand down Cole's toned chest all the way to his cock where his fingers started petting your hair. \"Uh-um... H-hi....\" You say weakly. The giants both giggle at how nervous you are. \"Oh, don't worry little guy. We won't hurt you.\" Cole said as he too started petting your body. \"How about you join us? The more the merrier!\" Dalen suggested, already starting to pull your shirt off. \"Um.. Sure! I'd love to!\" You say, as you were bisexual. Dalen pulls your clothes off and you scoot up right behind the head of Cole's 18 foot cock. Dalen winks and takes Cole's member and you into his mouth. You held on tight to the head of the massive penis you were currently riding as Cole began thrusting into Dalen's mouth. All the while Dalen's tongue wrapped around the member, covering it and you in his warm, sticky spit. After a minute of thrusting, Cole cums in Dalen's mouth. The force and splashback of which sends you falling onto the massive tongue just below you. Dalen swished you around in his mouth, covering you with Cole's load. He then...</span></div></div>",
            "created":1567656240,
            "id":2713490,
            "title":"The more the merrier..."
        },
        "14212":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "You survive to become Cole's next snack",
                "Survive to be use by someone else "
            ],
            "content":"<div class=\"\"><div> <span>Dalen swallows sending a bulge down his throat containg his lover's jizz and you to his giant belly. <br>\r\n<br>\r\nDalen: Mmm yummy. Soo gooey and tasty.<br>\r\n<br>\r\nCole sticks his tounge into Dalen's mouth moaning to your after taste that was still on his lover's tongue.</span></div></div>",
            "created":1580264160,
            "id":2779824,
            "title":"Swallows everything including you."
        },
        "14213":{
            "author_id":"lastfeelbender",
            "author_name":"That Boi",
            "choices":[
                "Accept your fate.",
                "Try and crawl out."
            ],
            "content":"<div class=\"\"><div> <span>You land on Cole's toned chest with a splat, as you were still drenched in spit and cum. \"Aww, you like that little one? You like being covered in my cum?\" Cole asks, rubbing you on his nipple. You nod and nuzzle yourself into Cole's perfect chest. Dalen then picks you up and licks the cum off of your miniscule body. \"I think it's my turn with the little cutie now!\" Dalen sings as he places you on the head of his easily 20 foot cock. You couldn't wrap your legs around it was so thick. Cole bends over and reveals his anus. You quickly realized where you were going but you honestly didn't mind. \"One... Two... Three!\" Dalen counted before thrusting his cock into Cole's ass. The heat of Cole's and Dalen's bodies and the smell of Cole's shit was overwhelming. You could hear them both moaning loudly outside. You were suddenly slammed into Cole's prostate over and over again. After what felt like hours, Dalen came in Cole's ass. You tried to grab hold of Dalen's dick but you were so lubed up by shit and cum that it simply leaves you behind. You start to sob as you're trapped in this god's asshole with very little air. You then decide to...</span></div></div>",
            "created":1567657200,
            "id":2713493,
            "title":"Spits you out onto Cole's chest."
        },
        "142132":{
            "author_id":"lastfeelbender",
            "author_name":"That Boi",
            "choices":[
                "\"Yes. You two are my gods...\"",
                "\"No. I don't want to belong to anybody.\""
            ],
            "content":"<div class=\"\"><div> <span>Covered in shit and cum, you're determined to see daylight again. You start crawling your way towards Coles anus. It's slippery enough that you slide a lot of the way. When you finally fall out, you land in a pool. \"We're sorry you had to be trapped in my ass, little guy... We dropped you in a pool so you can clean up some, okay?\" Cole said as he sat down next to Dalen. You wipe the shit and cum off of your body before climbing onto Dalen's firm thigh and snuggling into his perfect abs. \"Awwww, look at him! He's tired!\" Dalen cooed as he rubbed your back. It was night time so you were pretty tired. Dalen scoops you up and holds you to his chest. The two giants then lied down and started cuddling with you between them. Their combined warmth was so soothing and the pressure of being sandwiched between these two muscular gods made you feel so safe and protected. \"He's so cute. Let's keep him as a pet!\" Cole said as he looked down at you as you snuggled into the couple's chests. \"What do you say, little one? You wanna be our little pet?\" Dalen asked as he petted your hair again.</span></div></div>",
            "created":1567658280,
            "id":2713496,
            "title":"Try and crawl out."
        },
        "1421321":{
            "author_id":"lastfeelbender",
            "author_name":"That Boi",
            "choices":[
                "Play with him in our mouths!\"",
                "Take turns sitting on him!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Yes... You two are my gods...\" You say, looking up at their faces. You closed your eyes and relaxed in their embrace, listening to both of their heartbeats which were almost synchronised. Cole and Dalen both looked down at you smiling, tightly sandwiching you between their muscular chests. \"I completely belong to you...\" You yawn as you drift off to sleep. You wake up that morning still tightly pressed between the pecs of the two gods. \"Aww, look who just woke up!\" Cole coos as he rubs your head with his finger. \"Good morning, little pet!\" Dalen says as he also rubs you with his finger. The giants both sit up and start kissing. All you can do is look up and watch. \"Aw, look at him. He's watching us make out!\" Dalen says, looking down at you, followed quickly by Cole. The giants smile down warmly as Cole places you on a building roof. Cole's gigantic, soft, warm balls then start to lower, squishing you gently underneath. \"You like this, little pet? You like being squished under my massive balls?\" Cole asks as he pulls you out and places you at the base of his cock, his pubic hair acting as a cusion. \"Jerk me off, little guy.\" Cole orders. You start rubbing your whole body up and down his cock. Dalen stood by and watched as you tried to make your owner cum. After 5 minutes, you finally get him to climax, his seed raining down all over you. \"Oh, I know!\" Cole said, pacing you on the ground. Cole and Dalen line up and start spraying their cum all over you. \"Look, he's covered in our cum!\" Dalen says, still spraying his load on your tiny form. Cole and Dalen came on you for almost 10 minutes before they finally ran out. You look up and see them both standing, looking down on you like gods. \"What should we do with our little pet now, babe?\" Cole said, looking at Dalen. \"Lets....</span></div></div>",
            "created":1567663380,
            "id":2713523,
            "title":"Submission"
        },
        "14213211":{
            "author_id":"lastfeelbender",
            "author_name":"That Boi",
            "choices":[
                "\"Let's all take turns jerking off with him!\"",
                "\"Let's have a threesome and let him ride our cocks!\""
            ],
            "content":"<div class=\"\"><div> <span>Dalen delicately picks you up and licks you clean. \"He really liked watching us make out. How about we let him join in?\" He suggests, holding you close to his giant, moist, soft lips. Cole giggles and walks over, looking down at you warmly and winking before leaning in to give his boyfriend a kiss, with you directly between their mouths.<br>\r\n     <br>\r\n Their lips and tongues felt so warm, soft and moist as they gently pressed together on you. You can feel the vibrations of their soft moans of pleasure as the two gods made out with you. Cole and Dalen begin making out slightly harder, pressing you tightly between their mouths and drenching you in hot sticky saliva. The hot wet pressure enveloping you makes it almost impossible not to start climaxing.<br>\r\n<br>\r\nA minute later and you finally can't hold it in any longer, and you cum. Both of your owners taste it and pull away from each other and look down on you with satisfied smirks on their faces. \"I think he likes it a little too much...\" Cole cooed, clicking his tongue. Dalen licks your seed off of his lips and eyes you with a warm smirk. \"I-I-I'm so s-sorry! I didn't m-mean to...\" You stammer, thinking your owners are displeased.<br>\r\n<br>\r\nThey both giggle lightly and sit down on a building next to each other. \"Oh, it's okay, little pet... We know you couldn't help it...\" Cole whispers, rubbing your body with his fingertips. Dalen also pets your body gently as they giggle at you in a loving way. You start to calm down after realizing the couple aren't angry with you and you snuggle into them.<br>\r\n<br>\r\n\"Oh! How would you like to meet your third owner, little one?\" Dalen asks softly. You can't help but perk up and nod happily. Dalen giggles and pets your hair. \"Good boy... Now let's go meet Wyatt.\" He says, placing you on the base of his cock. You straddle the gigantic member and lay back, allowing Dalen's pubes to act as a cushion.<br>\r\n<br>\r\nA few minutes of walking later and your owners have brought you to a new place. \"Wyatt! We brought home a pet!\" Cole calls as another godlike giant approaches and gives the first two giants each a kiss on the lips. He's also super toned like Cole and Dalen and he's got a titanic cock along with a beautiful face also lime Cole and Dalen. Dalen hands you to him and Wyatt examines you, gently turning you over in his hands, smiling warmly. \"He's so adorable!\" Wyatt says, holding you to his gigantic lips. \"What should we do with him?\" Wyatt asks, placing you on the head of his cock. The three then think for a moment.</span></div></div>",
            "created":1580235540,
            "id":2779668,
            "title":"Giant kisses are best kisses"
        },
        "143":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "Eat it",
                "Insert it",
                "Keep it as a pet"
            ],
            "content":"<div class=\"\"><div> <span>You are surprised to see a giant vagina in front of your face. It is now that you decide to look up. You quickly notice that both are women and one is necking the other.<br>\r\n\"Look, Jenna,\" the taller one says. \"A small one.<br>\r\n\"What do you think we should do with it, Dana?\" asked Jenna</span></div></div>",
            "created":1194325200,
            "id":461206,
            "title":"Giant Lesbians"
        },
        "1432":{
            "author_id":"australorp",
            "author_name":"Beatrix Amber Robinson",
            "choices":[
                "anus",
                "vagina"
            ],
            "content":"<div class=\"\"><div> <span>\"I think we should ask it,\" said Dana sternly.<br>\r\n\"Insert me!\" you said.  Although you're also female, you're bisexual but have never been with another woman so you're dying to stimulate her from the inside.<br>\r\n\"Where?\"</span></div></div>",
            "created":1217134800,
            "id":561750,
            "title":"I'm a bi babe!"
        },
        "1433":{
            "choices":[
                "You grow to the same giant size and muscularity as the giantesses",
                "You grow bigger and stronger and more muscular and powerful then the giantesses"
            ],
            "content":"<div class=\"\"><div> <span>\"I have an idea Dana,\" Jenna says as an evil looking smile curls across her lips. \"let's keep him as our pet! heheheh\"<br>\r\nThe two giantesses, Jenna and Dana look down on you and start to smile at eachother and giggle mischievously. \"No wait!\" You yell out. \"You can't keep me as a pet! I'm not some kind of animal, I'm a human being! I am a man!\" The two gigantic women begin to laugh at you. \"Hahahahahaaa! You are no man! You're too tiny! You are only a tiny little ant for us to play with.\" Dana mocks. Jenna joins in and runs her hands over her incredible figure. \"You see all of this tiny? THIS is the body of a ture amazon giantess! Only the biggest and strongest of giant men are man enough for women of our super human size and strength!\" Jenna flexed her huge bulging biceps above her head to emphasize her point. Indeed both the giantesses had incredible muscular definition in they're bodies. They looked like pro-fitness models or bodybuilders. Everything about these women was gigantic, muscular and strong. \"We giantesses only like men who are giant and muscular like we are. how the hell is a tiny like you going to be enough for a couple of super giantesses like us?\" Dana asked snearing down at you. Suddenly you start to feel an intence powerful primal force building up inside of your body, super charging all your muscles. \"I'll show you who's tiny!\" you say under your breath.</span></div></div>",
            "created":1289970000,
            "id":995726,
            "title":"Keep it as a pet"
        },
        "14331":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "...jump on you",
                "...fight over you"
            ],
            "content":"<div class=\"\"><div> <span>\"Look, Jenna,\" Dana said, \"I think our pet is starting to grow.\"<br>\r\nShe was thinking correctly. You had started to grow- and quickly. In no time, you had to be put on the ground. You also notice that your muscles started to grow with the rest of you. The two giantesses just stood there startled and staring as they saw you growing past the level of their crotch. You finally stop when you were at eye level with them. Your muscles were comparable to any bodybuilder and you start to flex to prove it. While your pants had partly survived (only becoming tattered shorts), your long cock was still clearly visible and quickly becoming erect.<br>\r\n\"Do you mean giant and muscular like this?\" you asked.<br>\r\nThe two still looked at you, though briefly, because they both started to...</span></div></div>",
            "created":1358917200,
            "id":1514914,
            "title":"You Were Saying?"
        },
        "144":{
            "author_id":"phantom8",
            "author_name":"Phantom",
            "choices":[
                "Join in with their sex",
                "Watch the giants make love"
            ],
            "content":"<div class=\"\"><div> <span>As the light blinds you, you feel a shift in gravity. It a appears the giant you're on is laying down. As you escape the jungle of pubes, you fall into a hole. You soon realize that you have fallen into the belly button and a huge shadow covers you. You look up and you see the massive Titan and he is completely naked. You immediately realize that you are on the giantess. Two giant fingers pick you up. You panic as you stare in the eye of the giantess.<br>\r\n<br>\r\n\"Well what have we here?\" said the giantess with excitement. \"It's a little man! Aww, don't be scared, we're not going to hurt you.\"<br>\r\n<br>\r\nAs you panic, you look down and see a mountain of flesh, which is the giantess' boob. She then places you gently on her nipple. She then says to the giant, \"Hun, I found a little friend. Say, little cutey, want to join us?\" What do you do?</span></div></div>",
            "created":1341291600,
            "id":1371445,
            "title":"Hetro, the giant you're on is a Woman"
        },
        "1441":{
            "author_id":"ghostnxc",
            "author_name":"Nonep",
            "choices":[
                "She puts you in her vagina",
                "She puts you in her mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you nod in agreement as her smile widens and she plucks you up again and holds you up wondering where you should go first. </span></div></span></div>",
            "created":1600238880,
            "id":2903938,
            "title":"Join in with their sex"
        },
        "14412":{
            "author_id":"ghostnxc",
            "author_name":"Nonep",
            "choices":[
                "Completely forgot about you and swallows the cum",
                "Spits out the cum and you into her hand."
            ],
            "content":"<div class=\"\"><div> <span>She smiles as she says “ooo I have an idea just trust me little one”. You are lifted up to her mouth and she opens it her warm breath agents your skin. You are quickly thrown into her mouth and surrounded by darkness. As you stand up you feel her lips part as a massive penis presses agenst your back pushing you further back. You feel the speed increase and her moans are nearly defining you until the penis behind you twitches and shoots cum all over you but what does she do?</span></div></div>",
            "created":1600239420,
            "id":2903942,
            "title":"She puts you in her mouth"
        },
        "15":{
            "author_id":"writer23",
            "author_name":"writer23",
            "choices":[
                "To figure out why they grew and bring you into the fun as a giant",
                "To look for a way to shrink",
                "To the bay for a swim",
                "To meet  another giant or giantess",
                "Enjoy the city at their new size while you watch"
            ],
            "content":"<div class=\"\"><div> <span>You blink to clear the fog from your head and see a finger that is easily three times your size curl up, away, and back through what used to be the wall. <br>\r\nYou are able to see what would be the next building replaced by a tan wall of flesh and briefly glimpse the apartment below yours as your floor rains onto what's left of it's floor.  <br>\r\nInstinctively you scoot backwards and off to the side behind the cover of your couch thinking that it will somehow save you.  <br>\r\n<br>\r\nNot really the most logical way of thinking but then again, A GIANT FUCKING FINGER just came through the building so you aren't exactly thinking clearly.  <br>\r\nThe sheetrock and concrete dust is still floating hazily about what's left of your place when you see the wall of tan start moving.  <br>\r\nThe movement causes sudden gust of wind billowing the dust around once more and you are blinded.  <br>\r\n<br>\r\nIt is quiet except for the screams from the street below and sirens followed by the occasional explosion in the distance.  <br>\r\nYour thoughts begin to form better now with your eyes tearing and closed allowing your brain to focus a little more on the situation.  <br>\r\n\"Ok ok,' you stammer in your head.  <br>\r\n<br>\r\n\"I'm good, nothing broken, little dusty, maybe if I stay very still whoever just did that will see something more interesting then a dust covered empty room. Yeah, I mean I'm well hidden behind this\"...straining you open your eyes and realize that furniture has been thrown all over the apartment and your couch was no exception.  <br>\r\nIt's now kiddy corner and one of the ends has partially splintered through your door.  <br>\r\n\"SHIT!\" you curse quietly.  <br>\r\n<br>\r\nNeeding another way of escape, you carefully peer over the couch.  <br>\r\nYour eyes lock onto the hole in the wall only it's not a hole anymore.  <br>\r\nIt's a person's eye. <br>\r\n<br>\r\nYou catch the movement of it blink, which sends small wisp of air before you retreat behind your cloth castle.  <br>\r\nPraying the movement went unnoticed you wait a minute and begin to peer again before realizing it's now become a waiting game.  <br>\r\nIt's obvious this was not a random occurrence and whoever belonged to the eyeball knew someone was in here.  <br>\r\n<br>\r\nThere is another gust of wind stirring up the dust again and you hear the reverberations of a girl's voice talking.  <br>\r\nThinking this might be the opening you were waiting for you risk a look and half crouch half stand.  <br>\r\nBy the time you see the tan skin moving again it's too late and a face full of cement dust blows through the destroyed apartment again and you get a mouthful.  <br>\r\n<br>\r\nChokingly you are back behind the couch again only this time you are gagging.  <br>\r\nYou hold out as long as you can but can't help but burst into a coughing fit.  <br>\r\n\"I KNEW IT!\" echoes from outside and you hear the rest of the wall being peeled away and falling to the street.  <br>\r\n<br>\r\nQuiet grips the atmosphere again except for a piece of furniture falling over.  <br>\r\nThe tip of a gigantic finger wraps around the top of the couch and a second later, it's gone.  <br>\r\n\"BRETT I KNEW YOU WERE IN THERE!  WHY WERE YOU HIDING BEHIND THE COUCH LIKE THAT?'  Before you get a chance to do anything pressure forces the air out of you and suddenly you feel weightless.  You can't catch your breath and it reminds you of being on an amusement park ride where the bottom drops away.  <br>\r\n<br>\r\nEyes closed gasping for air the movement stops, then you fall.  <br>\r\nFearing the worst having been on the sixth story you begin screaming thinking your street pizza but all the escapes of it is an AAeep as you land softly about a foot below.  <br>\r\nLooking around your standing in the middle of a huge palm and peering down at you is your smiling girlfriend Amber.  Dusting off she leans in closer causing slight dementia and you fall back over.  <br>\r\n<br>\r\nRelieved but scared shitless you stand again and notice she is blushing.  <br>\r\n\"HI BABY!\" she says in her normal tone.  <br>\r\nAt your size, it's loud enough to cause pain and you clasp your hands over your ears reflexively.  <br>\r\n<br>\r\n\"OH, Whoops,\" she says quietly.  <br>\r\n\"I forgot I'm a human bullhorn now.\"  <br>\r\n\"It's alright\" you reply almost shouting.  <br>\r\n<br>\r\n\"What happened?'  She was careful in her tone as she replied, \"Sarah and I were shopping when the next thing we knew everything was tiny. <br>\r\nWe were close so I wanted to make sure you were ok with all these giants around.  <br>\r\nI would have called first but I can't exactly dial with these\" gesturing to her huge digits.  <br>\r\n\"Well your phone DOES have voice recognition you know\" you retort sarcastically causing small trembles of her laughter.  <br>\r\n<br>\r\n\"Don't know where I'd put it\" she replies and extends her arm away from her.  <br>\r\nShe is totally naked.  <br>\r\nLooking around is only when I notice another giant, it's Sarah.  <br>\r\n<br>\r\n\"HI BRETT!  She states waving causing you to clasp your hands over your ears again.  <br>\r\nSarah gets a stern look from Amber and puts her hand to her mouth.  <br>\r\n\"Sorry\" she almost whispers.  <br>\r\n<br>\r\n\"Umm, hi Sarah.  <br>\r\nI see you are also......\"Gorgeous, sexy, voluptuous\" Sarah cuts you off striking various poses before cupping her huge c cup size breasts together and slowly massaging them against one another.  <br>\r\nThe two enormous girls giggle almost carefree as Amber swats her joking friend with her free hand.  <br>\r\n<br>\r\n\"You better be careful Amber,\" Sarah said.  <br>\r\n\"I know you like it rough\" and with that they both burst into laughter.  <br>\r\n\"Ambers arm retracts and your close to her again almost causing you to fall over AGAIN. '  I want to show you something baby.  Hope you don't mind but I'm driving.'  <br>\r\n<br>\r\nWith that, she turned around and headed back down the street they came from making sure you see as she flattens your car.  Looking behind, a naked Sarah blows you a kiss and sexily grinds the flat metal wreckage farther into the ground for emphasis.  <br>\r\n<br>\r\nAnd your off...........</span></div></div>",
            "created":1205470800,
            "id":508744,
            "title":"I'm Out Of Ideas, So You Decide"
        },
        "151":{
            "choices":[
                "You grow!",
                "Nothing happens",
                "Your gf finds you and wants you to grow"
            ],
            "content":"<div class=\"\"><div> <span>You went to the internet to see if there was anything that could possibly explain what caused the growth. After researching for hours you notice a pattern that all the places of where people were  growing just happened to be the dirty places of town. i.e Joe's kitchen was a messy dinner and a young couple grew there, over at the fishing docks a young women grew too, as for your gf and her friend Kathy's Mud Spa seemed to grow those two.The growth must be caused by some sort of bacteria. Now all you had to do was get over to the dirtiest place of all town, the city dump. Luckily it was closed today which would explain why no one was spotted growing over there. However there are the giants that seemed to not go so easy on the little ones. From the hole in your wall you could see that the giant people were eating up the little ones or they were using them as sex toys, or they were just upright killing them. You even saw your girlfriend and her friends eat some people. Yet despite this you didn't squirm at the sight. Over the years of watching giantess porn, reading giantess stories, or writing them yourself you'd became infatuated with this fetish. You loved the pure power it gave to you. The simple fact that you could do what ever you want turned you on like nothing else (except a girls body). <br>\r\n<br>\r\nYou put on your running suite and you make your way down to the city dump. You look carefully to make sure that you are not spotted. Block by block you close in on the city dump. As it is only 2 more block away from your current location. Going through the forest/woods a good idea as so far you haven't been caught. You continue your adventure to the city dump. <br>\r\n<br>\r\nFinally you see the gate of the city dump and you sprint toward the garbage ! You jump the fence and land in the garbage now you wait.</span></div></div>",
            "created":1468904400,
            "id":2183113,
            "title":"To figure out why they grew and bring you into ..."
        },
        "1511":{
            "choices":[
                "Op.1",
                "Op.2",
                "Op.3"
            ],
            "content":"<div class=\"\"><div> <span>As you lay within the garbage pit a tingling feeling comes to your body. “This is it” you thought to yourself as the feeling gradually becomes more intense.<br>\r\n<br>\r\nThe growth starts to kick in and you are overcome with great sensations of pleasure. You groan as your clothes become tighter against your growing body. <br>\r\n<br>\r\nEventually your clothes clothes are nothing but shreds of fabric. You get up and estimate that your around 50 ft.<br>\r\n<br>\r\n Now that you're a giant what will you do ?<br>\r\n<br>\r\nOp.1 go take a bath in the lake (you are dirty after all from laying in a garbage pit)<br>\r\n<br>\r\nOp.2 try meeting up with your girlfriend and her friend<br>\r\n<br>\r\nOp.3 go and mingle with the tinies <br>\r\n</span></div></div>",
            "created":1500872400,
            "id":2358525,
            "title":"You grow!"
        },
        "15112":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "Amber mounts you",
                "Sarah mounts you",
                "Threesome",
                "Destruction"
            ],
            "content":"<div class=\"\"><div> <span>With your new height comes a new level of confidence and physicality. You look down at your body and see some modifications. Your torso has developed a well-defined eight pack and sizeable pecs. Your crotch has expanded in every sense and is having an erection. Your legs have become chiseled with muscles you didn't know you had. You look at your arms and flex them, seeing muscles on muscles. From what you figured, you now had a body that most bodybuilders would envy.<br>\r\nWith all of these modifications, your mind goes right to Amber and Sarah. In your mind, getting their attention was your only thought. Everything and everyone else was never on your mind.<br>\r\nAt your new height, it was easy to find them. When you spot them, you walk in their direction. You hardly noticed the crowds that gathered in awe around you and are now being crushed under your feet. You barely noticed the buildings that you were plowing through. You didn't even notice the police blockade that was trying to stop Amber but got caught up under you.<br>\r\nWhen you did that, Amber and Sarah looked at you. Both of them looked you up and down, biting their lips, almost reflexively cumming simultaneously.<br>\r\n\"Impressed?\" you ask them, getting nods in reply. \"What do you want to do now?\"</span></div></div>",
            "created":1524027600,
            "id":2481440,
            "title":"Hello, Ladies"
        },
        "151123":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "Destruction ",
                "More sex",
                "Find more giants",
                "Have a human snack"
            ],
            "content":"<div class=\"\"><div> <span>Amber doesn't even think about what she wants to do. She impulsively leaps into you with such force that both of you fall to the ground, kissing each other as you land on top of a crowd of people, and she lands on top of you. Before anyone can react, she drives her pussy onto your cock and starts pumping.<br>\r\nNot wanting to be left out, Sarah walks up to your head and, as she moves Amber's head out of the way, lowers her own pussy near your mouth. You waste no time in sticking your tongue deep into her and lapping it up. <br>\r\nAs you thrust both your hips and tongue, you can't help but let your hands wander. Given that Sarah's ass was the only thing in your view, you were blindly feeling up both of them, making sure to take it slow.<br>\r\nThis action serves to enhance the feeling for all three of you, as all of you quickly and simultaneously got orgasm. All of you shoot more fluids than you have ever shot, much to your delight as you lick Sarah's cum.<br>\r\nBoth women end up collapsing on top of you due to exhaustion as you decide what to do next.</span></div></div>",
            "created":1558553520,
            "id":2662629,
            "title":"Titanic Threesome"
        }
    },
    "info":{
        "author_id":"mullac",
        "author_name":"Lum Cal",
        "brief_description":"People grow! Giants everywhere! Macro, Vore n Other Stuff INSIDE\r\nyay",
        "created":1186514580,
        "description":"<td align=\"left\" class=\"norm\">A lot has happened in the world recently, The Macrophile community has grown huge, and giants have FINaly appeared on earth.<br>\r\n<br>\r\nIt started one night (or day, depending on what time zone you were in) and all Microphiles (people who get turned on by small people) grow huge, it is a blessing for both the Micro and Macrophile communities, but everyone who belongs to neither of these communties just screams and runs away. <br>\r\n<br>\r\nRules<br>\r\nNo foot stuff<br>\r\nNo gore<br>\r\nI can't think of any more rules... Oh Yeah!:!!!HAVE FUN!!!*<br>\r\n<br>\r\n*no pressure<br>\r\n<br>\r\nYours sincerly <br>\r\nLC</td>",
        "id":1302325,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600239420,
        "modified":1600239420,
        "pretty_title":"THE GIANTS"
    }
}