{
    "chapters":{
        "1":{
            "author_id":"badman",
            "author_name":"Badman",
            "choices":[
                "Stomps you",
                "Eats you",
                "Crushes you between her breasts",
                "Sits on you on her new throne",
                "Something Special"
            ],
            "content":"<div class=\"\"><div> <span>You look at the lamp in your hands. You found it at the antique store, and bought it just for the hell of it.<br>\r\n\"Hm... Bit dusty...\" you say, rubbing it. At once, a faint purple smoke arises, and from it forms the most beautiful girl you've ever seen. She looks to be about 18, your age.<br>\r\n\"Greetings master,\" She says bowing to you. \"I am Buthayna, the genie.\"<br>\r\n\"Genie... Will you grant me 3 wishes?\" you ask excitedly.<br>\r\n\"I could...\" she says, eyeing you in a sultry fashion. She walks over to you, hips swaying back and forth. \"Or... you could trade them all in to marry me,\" she coos into your ear. You take a whiff of something. Some sweet flowery fragrance was wafting from somewhere.<br>\r\n\"All it takes is one kiss...\" She tells you.<br>\r\nYou look at her, and lock lips. Then you instantly black out. You wake up, and notice her standing several feet above you, giggling.<br>\r\n\"Did I foget to mention that males in genie marriages are the females servants?\"<br>\r\nWith that, she picks you up, and...</span></div></div>",
            "created":1244264400,
            "id":703126,
            "title":"Married"
        },
        "11":{
            "author_id":"bt028111",
            "author_name":"btal",
            "choices":[
                "she really crushes you.",
                "her feet start to sweat and smell.",
                "you are absorbed into her feet.",
                "She puts you into one of her shoes and wears them.",
                "She has more fun, squeezing you in different ways."
            ],
            "content":"<div class=\"\"><div> <span>...brings you up to her face. She grins at you and her eyes twinkle. A tingling sensation comes over your body, but before you realize what's going on, you're falling.<br>\r\n<br>\r\nButhayna drops you to the floor. You are winded by the impact, but unharmed, looking up at the towering woman above you. She smiles down on you, almost lovingly, as she raises one of her perfect feet above you. A shadow looms over you and her enormous foot comes crashing down on you. You barely have a chance to scream for your life.<br>\r\n<br>\r\nThe foot hits you and you can see nothing but blackness and the crushing pressure of her foot. You felt no pain, but can't breathe. \"am I dead?\" you wonder. Suddenly, her foot twists and grinds you against the floor, then slides across your body until your head is under her toes. She spreads them and looks down on you between them, still smiling. The pressure relaxes and you can breathe; her feet are perfumed and smell sweet.<br>\r\n<br>\r\nHer smile widens as she scrunches her toes around you and squeezes you. You realize that you are soft and pliable, almost rubbery; when she stepped on you, you were flattened against the ground, unharmed. Now, her toes dig into you and you are molded around them and squeezed between them. At first, you are off-put by being putty between a woman's toes, but Buthayna's are warm and soft. A strange euphoria comes over you; you don't know if you're being aroused at the situation or if it is part of her magic.<br>\r\n<br>\r\nShe releases you a bit and you slide between her two feet and she starts gently squeezing you between them, applying more and more pressure until you are flattened and caked onto one of her feet. She then slides her feet against each other, rolling you into a ball. She snaps her fingers and you pop back into shape, between her big toe and second toe. She pulls her foot up to her face and looks down at you.<br>\r\n<br>\r\nButhayna giggles softly, \"You didn't think I'd kill you, did you? You are mine forever.\"<br>\r\n<br>\r\nWith that..</span></div></div>",
            "created":1245474000,
            "id":711287,
            "title":"Stomps you"
        },
        "113":{
            "choices":[
                "She uses your treadmill",
                "she teases you and goes to your fridge to step on some bananas",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>\"For- forever...?\" you weakly say. \"Yes....\" She talks as she rolls you into a ball like a cat playing with yarn \"Forever.... and ever.... and EVER.....\" she picks up your gumball like naked body and holds you to her. \"Now before i decide what I'm going to do with you next, i want you to spend time with my feet... up close... and personal...\" she said slowly and lowered you to her right foot, press your round body into her arch and you black out....<br>\r\n<br>\r\nYou wake up, looking at your TV, feeling rather stranger. You can see, and you can smell, you smell something that reminds you of the genies scent. However you feel as though you have no limps. Your mind begins to panic till you start moving! The genie crosses her legs and you look helplessly sideways at her and she says \"Why hello, my cute foot tattoo <img style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\">\" she strokes the sole of her foot which is actually now your face, frozen, unable to blink, your face looks as if it were painted onto her foot. \"Aww don't be afraid.... you should feel honored to be my magical foot, sweety...\" she cooed as she wiggled her toes and scrunched her foot to taunt you.</span></div></div>",
            "created":1246597200,
            "id":718166,
            "title":"you are absorbed into her feet."
        },
        "114":{
            "author_id":"fuzzyboy",
            "author_name":"Fuzzywuzzy",
            "choices":[
                "Snapped her fingers and you were between her breasts.",
                "She snaps her fingers and you turn into one of her nails(Toe nail or fingernail)",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>She grabbs you off her foot and snaps her fingers. You see a pair of flats on the floor and then you start falling. She dropped you and you landed face first in her right shoe. There was no smell until she snapped her fingers and you smelt a nourishing smell. You continued smelling and then you saw a shadow. Buthaynas foot was descending upon you but when you realised, her foot was right on you. She put her shoe on then her other. She started walking around and then she snapped her fingers. You felt pain and then her foot and shoe changed. Her shoes were now high heels and you were under her toes. After a few minutes she took you out and then she laughed. Buthatna then…</span></div></div>",
            "created":1413987420,
            "id":1875821,
            "title":"She puts you into one of her shoes and wears them."
        },
        "12":{
            "author_id":"bt028111",
            "author_name":"btal",
            "choices":[
                "You are fully digested, then reincarnated.",
                "You are digested, but remain conscious.",
                "You are teleported out of her stomach.",
                "You are passed through her digestive tract unharmed.",
                "She keeps you in her stomach."
            ],
            "content":"<div class=\"\"><div> <span>...eyes you hungrily. Her eyes sparkle and you feel her hands getting ever-bigger around you as you shrink.<br>\r\n<br>\r\n\"Um...servants? What do you mean?\", you ask, now terrified.<br>\r\n<br>\r\n\"Mmm, maybe 'servant' isn't the correct term, but do you honestly believe you could ever be my equal? You're really more for me to play with, but yes you will be serving me.\" she replies with a seductive smile. Her breath is warm and smells sweet. You begin to calm down.<br>\r\n<br>\r\nShe brings you closer to her face, running her eyes up and down your body. She then pulls you into a passionate kiss. Soon, her tongue fills your mouth as you continue to shrink. You feel like you should be gagging, but you receive no such reflect. She releases you and grins at you. \"You taste gooood!\" She suddenly pulls you back in. You continue to shrink, and more and more of your face gets enveloped in the kiss. <br>\r\n<br>\r\nOnce you're small enough, she parts her lips a bit and manages to slide your entire head into her mouth. You panic and start flailing and screaming as she runs her tongue all over your face and sucks on your head. She pops you out of her mouth and gives you an angry look. \"What? You don't like it? Don't worry. I'll keep you safe; you'll be mine for millenia to come, but if you cross me, I'll bit your head off.\"<br>\r\n<br>\r\nShe opens her mouth side and, without warning, thrusts your entire top-half into her mouth. She pulls you out a bit and lines your neck up with her teeth. She closes her mouth around you; you feel her teeth on your neck and grimace. She then opens her mouth again, looks at you, and starts laughing. <br>\r\n<br>\r\n\"You're really scared of me, aren't you? Well, I guess I'm not surprised. Being eaten takes getting used to. It's too bad most people only get one chance.\"<br>\r\n<br>\r\nBefore you can ask, she shoves you into your mouth and closes her lips on your midsection. You begin to shrink faster and faster, until she slurps your legs up. With your entire body trapped in the warm, moist cavern of her mouth, she begins sucking on you, rolling you around with her tongue as if to get every last bit of flavor out of you. Soon, you're small enough; her tongue pulls back and her mouth tightens; you are dragged to the back of her mouth and feel yourself forced down her esophagus.<br>\r\n<br>\r\nYou land in a pool of what can only be her digestive juices. She smelled of flowers; even her breath was sweet, but now you lay in Buthayna's digestive tract, where thousands were digested alive during her previous rule. You start crying, knowing your fate.</span></div></div>",
            "created":1244610000,
            "id":705730,
            "title":"Eats you"
        },
        "122":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Fat from your breasts",
                "Fat from your butt",
                "Fat from your belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your body starts to burn, more and more, you scream in pain, slowly you melt, turning into paste, but still conscious, coming into the intestine, you are absorbed by the bloodstream, turning into fat deposit.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1480545540,
            "id":2244111,
            "title":"You are digested, but remain conscious."
        },
        "14":{
            "author_id":"bt028111",
            "author_name":"btal",
            "choices":[
                "She absorbs you into her butt",
                "She grinds down on you, plastering you to her ass",
                "She starts crushing you.",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>...says, \"Hmmm...what should I do first...you know what, I've been trapped in that lamp for thousands of years. It's time for me to sit like the queen that I rightfully am.\"<br>\r\n<br>\r\nSuddenly, the ground below you rockets up what feels like 20 feet. Three walls rise around you, two of them around 10 feet tall, the other much taller. The ground beneath you begins to swell and turn purple. It raises up and softens; you lose your footing and fall over, but as you begin to feel the cushion beneath you, it's softer than any bed you've ever slept on. You feel almost sleepy; the world grows fuzzy and a big smile falls over your face.<br>\r\n<br>\r\nButhayna smiles down on you, then turns around, sensually swaying her perfect hips back and forth. You gaze up at her, hypnotized by her glorious ass. Without warning, it descends upon you, but not a care enters your mind.<br>\r\n<br>\r\nAs her ass lands on you, you suddenly become aware of the situation and panic, but it's too late. She lands square on top of you and you are nestled between her cheeks. The smell is not unpleasant, though her flowery perfume is a bit overwhelming. You feel a yielding, as if either the cushion, her bottom, or your body are molding to conform, so the pressure is not painful. You can even breathe, even with all of her weight upon you.<br>\r\n<br>\r\nShe sits there awhile, enjoying the feeling of having you under her bum, then...</span></div></div>",
            "created":1249189200,
            "id":738270,
            "title":"Sits on you on her new throne"
        },
        "141":{
            "choices":[
                "Buthayna allows you to go look at the other chambers",
                "Buthayna makes you do more stuff in the ass chamber",
                "Buthayna takes you out to do other things."
            ],
            "content":"<div class=\"\"><div> <span>           She snaps and her pants disappear. You are now looking directly into her ass hole. The hole looks menacing as if it is going to suck you in and you would be trapped in her ass. Suddenly you see the hole expand, you become very scared as to what comes next, but you have an idea. A very loud fart comes out and hits you directly in the face. You notice it doesn't smell that bad. It smells like her perfume. Non-the-less you are disgusted and try to escape....to no avail. Your are being held tightly in between her ass cheeks forced to take whatever comes at you. She begins speaking to you, \"How did you like my fart, I know this is what you humans consider a good smell, but what if I did the exact opposite?\" You see her ass hole expand again and try to cover your nose for this one but they are restrained by the two mounds of flesh on either side of you. \"Being an all powerful being I can make my farts have whatever properties I want them to, get ready for a nice, smelly, long one. You close your eyes in fear of the impending doom. \"Nope, I won't even let you do that.\" She snaps her fingers and forces your eyelids open. As well as your mouth. You are now held down forced to take her fart completely, mouth nose and everything. You are overcome by terror as you hear grumbling. *PBTTTTTTTTTTTERRRRRRRRRRPBBBTTTTTTTTTFFFFFFFFF* Literally a 20 second fart comes out of her ass hole. You are forced to take the full blunt of the fart. The smell is like nothing you've ever smelled before. It is the worst smelling thing ever and it felt like it overloaded your sensory organs.(nose). You also tasted her fart which was equivalent to just eating her excrement straight out of her ass. You wanted to just pass out but you couldn't. \"So, how did you like my beautiful gift?\" You are completely unable to speak. Still gasping for air although the only thing there is in the air is her fart. It was never able to escape from the confines of in between her ass cheeks.<br>\r\n      <br>\r\nJust then you see her ass hole expand again. You already know whats coming. But this time, no fart comes out. You become confused as to what's going on. You begin to feel your body being pulled in to her ass hole. Your body starts to rise. A few seconds later your body is plastered against her ass hole and it feels like it's trying to suck you in. Your legs go in first, your arms are restrained at your sides now. You are being sucked into her ass hole. After a few more seconds you find that your body is in her ass hole up to your chest. Your arms already in and your legs as well, you can do nothing but wiggle around like a worm. \"Let me out of here!!\" you scream, but she replies simply, \"No.\" \"You are my servant for all of eternity and you will remain as such\" The next thing you see is the lips of her ass hole. You are sucked in completely. You continue to be sucked in through a long network of tubes. The smell is equally as bad if not worse as the previous fart. Eventually you are squeezed through a very small hole that expands to your body shape to let you through. You are dumped into a vastly large room where all you can smell is her fart. You look around and drop to your knees in awe. The walls, the floor, the ceiling....everything around you is composed of a replica of her ass. Even under you, you see you are kneeling in one of her ass's ass cracks.(You are still tiny). Suddenly you hear a large booming voice, \"Welcome to the rest of eternity slave, this is the ass chamber, every ass in this room will repeatedly fart forever and you will stay in this chamber taking it all in. If I tell you to smell, you will smell, if I tell you to lick, you will lick, or if I just command you to worship my ass you better do all you can to satisfy me or there will be consequences. There are also other chambers you may enter on the other side of this room\" <br>\r\n<br>\r\n           Then, you see 5 naked replica's of the genie coming towards you. You attempt to run but it seems as if the room is endless. They immediately catch up with you. You are surrounded by 5, extremely large Buthayna's. They all turn around and aim their asses toward you and begin to fart. 4 of the replica's disappear and the other one turns around a looks at you smirking. Suddenly you are sucked into the ass crack you are currently standing on, but only up to your chest. Then the remaining Buthayna comes over and sits her naked ass on your head. So more than half your body is in one ass, and the other part is in another ass. There is no escape for you. Buthayna commands you to take large whiffs of your current setting. You lose control of your body and start sniffing against your will. Buthayna has made it impossible for you to vomit, stop sniffing, or close your mouth even though you so badly want to. She also has made it impossible for you to pass out, fully exemplifying her power and your helplessness to her ass. After a few days,(yes days, she can do whatever she wants, to her days are equal to minutes) of sniffing, Buthayna commands you to worship her ass. You don't move at all and refuse to do what she says. Your body starts acting on it's own again and your tongue forcibly comes out of your mouth. You begin to sniff and licks her ass hole unable to do anything about it. </span></div></div>",
            "created":1280905680,
            "id":929731,
            "title":"She absorbs you into her butt"
        },
        "144":{
            "choices":[
                "She gives a sweet fart, just to tease you.",
                "You go deeper into her butt.",
                "She takes you off and place in another part of her body."
            ],
            "content":"<div class=\"\"><div> <span>Buthayna's butt hole is right over your tiny body. You can only breathe your wife’s flowery butt. Sometimes, you squirm, but nothing happens. You hear some muffled voices and sometimes the round ass of your wife shakes a little, squishing you a bit more.<br>\r\nUnder the ass of your giant wife… you wonder if it is a good way of life. Would it be a good thing, to spend all your time there, being squished and smothered? Well, Buthayna DID have a perfect butt, you note, while under there.<br>\r\nSuddenly, the genie stands up and starts to walk, but you still cannot see anything. Her cheeks are pressing on you, step by step, as she swings her hips, back and forth. Still, that overpowering flowery fragrance wafts her butthole. There is no way you are going to fall: You are trapped inside your wife’s perfect ass.<br>\r\nSuddenly...<br>\r\n</span></div></div>",
            "created":1253941200,
            "id":766480,
            "title":"Tight life."
        },
        "1441":{
            "author_id":"badman",
            "author_name":"Badman",
            "choices":[
                "... continues to gas you.",
                "... teaches herself about shopping and takes you to help her pick out under wear",
                "... snaps her fingers, and increases her weight, but not her figure."
            ],
            "content":"<div class=\"\"><div> <span>... you feel a hand suddenly smack against your back, and suddenly all the good parts of your situation except the smell instantly disappear. You feel your bones crack, as you make as you make an indention into her butt. An indention which YOU fill. Your wife looks at herself in a full length mirror, looking at you, spread eagle on her bottom.<br>\r\n\"Straight down the middle,\" She said bubbily. Your face was buried in her crack, and your arms and legs were plastered into her butt cheeks. \"Oh I took the liberty of using my magic to introduce myself to the customs of today. I must say my precious LITTLE husband. I've Quite fallen in love with these things... what is it they are called... beans!\"<br>\r\nYou begin to sweat.<br>\r\n\"I also am interested in seeing the effect on my bottom I have heard so much about,\" she says, lightly patting her ample butt, and burying your face deeper into her crack. \"Come to think of it, I still have yet to bestow on to you a honeymoon present... Here you are darling!\"<br>\r\nYou brace your self as a massive POOF! Comes from her butt. It smells like... Flowers.<br>\r\n\"Did you think I ws going to bring myself down to the level of a meager human and have the gas I pass be anything less than heavenly?\" she giggles. Wile the smell is wondful, it is still extremely overpowering, and you are being completley smothered.<br>\r\n\"Smothered?\" Buthanya asked, reading your mind. \"No, if I wanted to smother you I'd do... THIS!\"<br>\r\nShe cutley plops her bottom back onto her throne, but this time, you feel THOUSANDS of pounds crushing you, as she let's out another massive POOF! Your air supply is completley gone, and you are desperate for breath to which Buthanya responds to by simply wiggling her butt around and letting out another loud POOF! Your ready to pass out, but she won't let you! Your caught in some kind of hell, doomed to suffocate, but never lose conciousness. Then Buthanya giggles and...</span></div></div>",
            "created":1264136400,
            "id":823821,
            "title":"The Lovely Gas from your Lovely Wife's Lovely Butt"
        },
        "14413":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Buthanya's toenail",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You hear Buthanya snap her fingers. For a moment nothing changes, you feel relieved, but then the weight above you increases rapidly. There is nothing you can do trapped under Buthanya's ass as she increases her weight at will. Buthanya weighted over TEN THOUSAND pounds most of that was bearing down on your immobile body. Buthanya farted on you again it, didn't change anything because all the air had been crushed out of your body. The weight on you was so massive that your whole body had been crushed flat under Buthanya's ass, you still remained conscience though. It seems that all Buthanya wants to do is torture you.<br>\r\n\"Do you still exist under there, I can't even feel you\" Buthanya said as she stood up. She examined her butt in full length mirror your body looked the same as before except it was completely flat. Even though you couldn't inhale Buthanya made sure you could still smell. While the flowery smell of Buthanya's farts was nice it was demeaning to know that these were her farts and she was making you enjoy them.<br>\r\nYour body suddenly peels off Buthanya's ass and you start to float to the ground like a leaf. As you fall you see Buthanya looking at you with an amused look on her face. You land on…<br>\r\n</span></div></div>",
            "created":1281191580,
            "id":931853,
            "title":"... snaps her fingers, and increases her weight..."
        },
        "144131":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "She shows mercy, only leaves your there for a short time",
                "She is cruel and leaves you there for a very long time"
            ],
            "content":"<div class=\"\"><div> <span>Buthanya watchers you as you land right in the middle of her big toe. She smirks at your flat body unable to move.<br>\r\n\"Your no good to me if you can't squirm\" with that Buthanya snaps her fingers and your body returns to normal. But you can't stand you Buthanya wont let you move your wrists or ankles, you buck and squirm on her toenail but to no avail. You look up defeated at Buthanya.<br>\r\n\"If you thought my butt was bad then you won't like this. You’re going to be living under my toenail.\" Buthanya said with a wicked smile as she snaps her fingers. Your wrists and ankles sink into Buthanya's toenail. You try and free yourself but it’s like your body is sinking into solid concrete. Your body sinks further into Buthanya's toenail, only your face is above the nail.<br>\r\nYou take one final breath before you are absorbed into the nail. For a moment you are left completely in Buthanya toenail. Then you come through the nail and hit flesh. You are surrounded by flesh and nail you can't roll over and can only move a little to the left and right. Buthanya looks down at your body trapped under her toenail, she can see you roll and squirm trapped lying on her soft flesh unable to escape her toe. You are forced to look up at your sadistic wife's face, you're like a bug under glass.<br>\r\n\"How long should I leave there? A week, month, hundred years, the rest of eternity<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\">?\"<br>\r\nYou shiver at the thought of being trapped under a toenail forever. Suddenly you can't move and are forced to look at Buthanya as she delivers her judgement.<br>\r\n</span></div></div>",
            "created":1281194460,
            "id":931868,
            "title":"Buthanya's toenail"
        },
        "1442":{
            "choices":[
                "She farts on his face",
                "She anal vores you",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>You are jabbed forward suddenly from behind by Buthayna's finger. \"Now my husband I think it's time for you to pleasure your wife!\"<br>\r\n<br>\r\nYou're pressed up against your wife's anus. \"Go ahead, give it a kiss!!\"<br>\r\n<br>\r\nYou begrudgingly lean forward a little and give her anus a small little peck on the hole.<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1279520940,
            "id":920410,
            "title":"You go deeper into her butt."
        },
        "15":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "She forces you to give her a foot massage, and lick the grime off her feet!",
                "She paralyzes your body and starts farting right in your face!",
                "She ties you up with her hair, grows giant, and rampages through the city!",
                "She makes clones of herself to help her abuse you even more!",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what does she do with you?</span></div></span></div>",
            "created":1297468920,
            "id":1052209,
            "title":"Something Special"
        },
        "153":{
            "choices":[
                "To the city",
                "To the beach",
                "To free other genies!"
            ],
            "content":"<div class=\"\"><div> <span>\"I didn't think it would be like this...\" you dare to say as Buthayna picks you up.<br>\r\n\"It's not like I lied to you\", the genie says. \"Don't be scared, I'm not cruel to my toys\" she says. \"Now that I'm free I'm going to have a lot of fun with you tinies though\" she adds with a mischievous smile as she ties you to her long silky hair. <br>\r\n\"What are you doing?\", you ask. <br>\r\n\"Say, shall we go for a walk?\", she says playfully as she starts growing into a giantess. You grow with her until you are your former size, as she outgrows the house. 15, 19, 24, 30, 37, 45... meters she climbs up in height, stopping at 75 meters. <br>\r\n<br>\r\n\"OMG, my house!\" you cry as you recover from the shock. \"My parents are going to kill me\"<br>\r\n\"Geez, stop worrying about every little thing\" she says, not really annoyed. \"I can fix it back with a mere thought\" Indeed, when you look down again it's like nothing happened. <br>\r\n\"Uh, thanks. Anyway Buthayna, I'm not very good with heights...\"<br>\r\n\"Don't worry, as soft as it is my hair is unbreakable\", she says with a smile. \"As long as I don't grow larger you're not falling\" she says, and she begins walking. You swing together with the strand of hair with every step, but it's surprisingly pleasant.<br>\r\n<br>\r\n\"Where are we going anyway?\" you ask.</span></div></div>",
            "created":1302285060,
            "id":1084283,
            "title":"From the lamp to the skies"
        },
        "1533":{
            "choices":[
                "...make new friends!\" (gentle path)",
                "...have fun all together!\" (carefree path)",
                "...take revenge on these puny bugs!\" (evil path)"
            ],
            "content":"<div class=\"\"><div> <span>\"Of course we are going to free my friends, who were locked up like I was\" Buthayna replies \"I can feel they are still in their lamps\"<br>\r\n\"What happened exactly?\" you ask. <br>\r\n\"We came to this planet several milleniums ago, just to have some fun\" she says. \"We had a really enjoyable time here until one day a wizard trapped us in those lamps as genies\"<br>\r\n\"I guess that was harsh\" you say, wondering what could she mean by having fun though. <br>\r\n\"Not really, it was surprisingly roomy and the flow of time was extremely fast. For every second in the lamp several decades went by in real life; I know through my powers. So it feels like I was trapped for just a few minutes\" she explained. \"But for a goddess like me it's a pretty humiliating experience. Let's not talk about that anymore\"<br>\r\n\"Uh, sure. I didn't know magic existed at all, anyway\" you point out, since that got you intrigued.<br>\r\n\"So nobody uses it anymore?\" Buthayna asked, surprised.<br>\r\n\"I guess so\" you reply, shruging your shoulders. \"Most people don't even believe in it\"<br>\r\n\"How do you defend yourselves in this age then?\" she inquires.<br>\r\n\"Well, countries have some pretty powerful weapons nowadays\" you explain in turn. \"Some could even annihilate mankind, like nuclear warfare\"<br>\r\n\"That means nothing to a goddess like me, we are absolutely invulnerable\" Buthayna says happily. \"The only way to overpower a goddess is through that kind of magic. If it has disappeared from this planet, all the better for us.\"<br>\r\n\"Oh, I see\" you say, wondering if you should have kept your trap shut. \"Anyway, how are you going to find them?\"<br>\r\n\"That couldn't be easier\" she replies with a smile. <br>\r\n<br>\r\nSuddenly your surroundings change completely as Buthayna teleports to a street in the outskirts of Mladá Boleslav, a lovely town in the Czech Republic, around 50 kms. northeast of Prague. There aren't many people around, so you can hear a few cries of astonishment and a car screeching as the colossal goddess appears from nowhere, but nothing spectacular. <br>\r\n\"Where are we?\" you ask. <br>\r\n\"How could I know? This world has nothing to do with how it was seven off thousand years ago.\" Buthayna says. \"But I can feel she's here. Right here.\" she explains playfully, bending down to rip the roof of a small house. She messes through the attic with her forefinger and the lamp falls from a box as it is knocked over. Rubbing the lamp with her finger, a girl comes from inside.<br>\r\n\"We're free again, Auglalnya\" Buthayna greets her with a lovely smile. <br>\r\n\"Buthayna! I'm so happy to see you\" Auglalnya replies, flying right towards her lips. As they kiss she immediately grows to Buthayna's size, crushing the house. They're still kissing; actually it's a french kiss. As Buthayna's husband (?) you feel like complaining, but you certainly don't dare to. When they're finished Buthayna kisses the tip of her nose affectionately.  <br>\r\n<br>\r\nAuglalnya is an intoxicatingly cute goddess, with lovely features, beautiful skin and long blond hair, and a most sweet expression. Suddenly she notices you hanging beside Buthayna's waist.  <br>\r\n\"Were you released by this human boy?\" she asks.<br>\r\n\"Yes, he was surprisingly easy to fool\" Buthayna replies mischievously. You sigh in reply. <br>\r\n\"Wow, thank you little guy!\" the blonde goddess says with a lovely smile. \"My name's Auglalnya, I'm glad to meet you.\" <br>\r\n\"Let's see... I'll pick up Fjuxleyna and Nazemflya, while you go for Ealtjseyna and Mzarglenya\" Buthayna tells Auglalnya. \"Then we will meet in Mzarglenya's place. How about that?\"<br>\r\n\"Sure, let's go!\" Auglalnya says cheerfully. \"It's so nice to be free again. I can't wait to...\"</span></div></div>",
            "created":1302732180,
            "id":1087518,
            "title":"Freeing Auglalnya"
        },
        "15331":{
            "author_id":"superxash",
            "author_name":"Shemp",
            "choices":[
                "Protect Humanity! ",
                "Better Humanity!"
            ],
            "content":"<div class=\"\"><div> <span>Buthayna giggled at your puzzled expression. \"Worry not, husband... we're not going to make the same mistakes from before.\"<br>\r\nAuglalnya petted you gently. \"What? He thought we were going to be evil cruel goddesses?\"<br>\r\n<br>\r\n\"Though you say there isn't much prevalent magic anymore, little pet... doesn't mean there ISN'T.\" said your 'wife' as she looked out over the city. \"And to be honest... we were kinda big... what's the word?\"<br>\r\n\"Bitches?\" asked Auglalnya, smirking.<br>\r\n\"I guess there isn't a better term.\" shrugged Buthayna as she giggled.<br>\r\n<br>\r\n\"We want to prove our superiority by being better than before. Instead of destroyers... instead of conquerors... we want to...\"</span></div></div>",
            "created":1500194400,
            "id":2354143,
            "title":"...make new friends!\" (gentle path)"
        },
        "15333":{
            "author_id":"badman",
            "author_name":"Badman",
            "choices":[
                "Mzgarlenya has to punish you now.",
                "Mzgarlenya accomponies her friend to free her fellow genie."
            ],
            "content":"<div class=\"\"><div> <span>\"She means you sweetie,\" Buthanya said, shaking her ample hips to and fro, causing you to be swung into them repetedly.<br>\r\n\"Yup,\" Auglalnya agrees bending down, and rubbing her finger along your body. \"You see, as the one who freed Buthanya, who is freeing the rest of us, that means you've volunteered to be the representive of humanity, and all the revenge that we wish to inflict on your pathetic race will instead go entirely to <i>you</i>!<br>\r\n\"What!? You can't...!\" Poof! With a puff of blue smoke you were suddenly staring into your wife's face, and incapable of moving.<br>\r\n\"Your husband makes a far better breast tattoo than he does a man,\" Auglanya giggled innocently.<br>\r\n\"Yeah, but he's still my <i>little</i> Hoeny Bunny, aren't you sweetie?\" Buthanya said, making moking kissy faces at you. \"Be good to my friends, or everything we do to you will be punishment!\"<br>\r\n\"Yeah, but if your nice, we'll do all the things we were gonna do to you if you were naughty, but it won't be to punish you!\"<br>\r\nThe girls burst out into hysterical laughter, sending Auglalnya's breasts jiggling, and you along with them.<br>\r\n\"Well I'm off.\"<br>\r\nAuglalnya did a graceful turn and vanished in a puff of blue smoke. When the smoke cleared, the two of you were in a dark tomb, with a black lamp with red decor sitting on a stone slab, illuminated by a pair of candles.<br>\r\n\"Aw, poor Mzarglenya! She was always temperamental, so I guess it's no surprise that they tried to bury her away,\" Auglalnya said, rubbing the lamp. Suddenly from the lamp emerged a billow of black smoke, which shifted into a pale sour looking woman with short crimson hair and eyes. Whereas the previous two genie's wore sterotypical harem garb, she wore a black leotard that showed off her bare, incredibly thick thighs.<br>\r\n\"Mzgy!\" Auglalnya cried happily, embracing her lost friend.<br>\r\n\"Is that tattoo the one who freed us?\" Mzarglenya asked.<br>\r\n\"Yup! Once we get the other's together-\"<br>\r\nBefore the blonde genie could finish her senentence, Myzarglenya ripped you off of Auglalnya's breast and slapped you face first into onto a part of her butt that her leotard didn't cover, resulting in a tattoo of the back of your head planted firmly on her rear.<br>\r\n\"I'll meet you at my old palace. While you get the other's, I'll be tormenting your husband for the indignities I've suffered.\"<br>\r\n\"Aw c'mon, it you've waited thousands of years, you can wait a few more minutes! Also he's Buthanya's.\"<br>\r\n\"I don't care, I want revenge NOW!\" Mzarglenya screamed and angrily slammed her butt as hard as she could against the stone wall of the tomb, causing you untold pain as your face is pressed even more into her thick ass. Mzarglenya removed her rear from the hole she had punched into the solid stone with it.<br>\r\n\"Better?\" Auglalnya asked nervous of her friend.<br>\r\n\"A little,\" Mzarglenya admitted.<br>\r\n\"If you still don't wanna come, we were all gonna meet at your place anyway, so you could go there and wait there. Okay Mzgy?\"</span></div></div>",
            "created":1357032960,
            "id":1499451,
            "title":"...take revenge on these puny bugs!\" (evil ..."
        },
        "155":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Readers Choice ",
                "Readers Choice ",
                "Readers Choice "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options....</span></div></span></div>",
            "created":1302250320,
            "id":1084153,
            "title":"other"
        },
        "1551":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "She actually eats you",
                "She doesn't eat you yet",
                "She does something else with you like this"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I need something to fill me up\" Buthayna said smiling. Suddenly a cooking pot appeared in her hand. You felt yourself being lifted off the ground and dropped into the pot. Your giant wife appeared over the rim of the pot she smiled down at you.<br>\r\n\"Come on this has to be a joke\" you said, feeling scared about your current situation.<br>\r\n\"Nope. You belong to me now forever. I want something to eat\" with that she made your body a liquid, but kept you eyes intact so you could see her while she stirred your body. \"I can see the fear in your eyes\" Buthayna said. It was true you were absolutely terrified with your body a liquid you could only watch this woman/genie who you just met mix what you can only guess is seasoning into your body. What will happen when you get eaten? You wonder. Could you become part of those bubbly breasts. Buthayna picks up one of your eyes. You get the strange view of seeing your tiny eye being held in the giant fingers of the cruel genie as well as seeing her smiling face. What does Buthayna do....<br>\r\n<br>\r\n</span></div></div>",
            "created":1302252000,
            "id":1084157,
            "title":"Turned into Soup"
        },
        "1552":{
            "choices":[
                "Panties",
                "Shoes",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>\"Why am I so tiny? I don't want this!\" You scream as loud as you could straining your lungs. \"Sorry but this form is mandatory in all genie marriages, well this and one other form.\" Buthayna said playfully. \"What other form please tell me!\" You plead. \"I can't, all I can tell you is that you will be your old height again, but trust me you don't want this form.\" She said. \"Please! I'll take it I just don't want to be this small!\" You yell. \"Very well.\" She said as a silver bolt of energy shot from her hand and into your mouth.<br>\r\n<br>\r\nYour body tingled and began to grow back to your average height. You looked pleased at the return of your form, but suddenly you could see through your hand and soon other parts of your body. \"What's happening?!\" You scream at Buthayna. \"Your new form is happening my husband.\" She said with a wicked smile. Soon most of your body was transparent. You looked like an ice sculpture of yourself. \"Why am I see through?\" You ask. \"This is called The Pallet Form, whatever I need you will become. For instance say I'm walking into our house but I have some dirt on my feet.\" She said, then your form became brown and furry, and you shrunk into a square flattening out with your face at the top. \"Then you become my doormat! The form is linked to my mind so whenever I need something that I don't have or if I just want to use you I can do so whenever I want.\" She said rubbing her bare feet all over your face. She snapped her fingers and you returned back to your glass like body.<br>\r\n<br>\r\nYou pant hard and begin to panic. \"This isn't what expected when I married you! I'm out of here.\" You declared running for the door. \"Not so fast.\" Buthayna said snapping her fingers. Suddenly your body started to shrink and become wooden. When the transformation completed you were nothing but a stool at the front door with your face at the top. \"You won't be going anywhere unless I want you to.\" She said setting her gigantic butt right on your frightened face. She rubbed her cheeks back and forth enjoying her new toy. \"Alright let's get down to business last time I went in the lamp I forgot one of my prized belongings so your going to fill the void until I get a better replacement. So I need you to be my...\"</span></div></div>",
            "created":1463254740,
            "id":2148000,
            "title":"A Shell Of Your Former Self"
        },
        "15523":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "bra",
                "Finger ring"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You begin to fear, until she says.<br>\r\nBut what?</span></div></span></div>",
            "created":1480629060,
            "id":2244480,
            "title":"More choices"
        }
    },
    "info":{
        "author_id":"badman",
        "author_name":"Badman",
        "brief_description":"You find a magic lamp, and the beautiful genie tricks you into becoming her slave.",
        "created":1244271120,
        "description":"<td align=\"left\" class=\"norm\">A beautiful she-genie comes from a magic lamp you find. Because of this, she shrinks you down, and turns you into her own personal toy, and slave, making you do her most menial tasks, and harming you in various ways for her amusement.<br>\r\n<br>\r\nYou<br>\r\nNo name neccessary.<br>\r\n<br>\r\nButhayna<br>\r\nThe genie, who has not been seen in thousands years, after she conquered the world. She has very dark skin, and long silky hair. Her waist is extremely tiny, and her hips rather large. Her chest is average sized.<br>\r\n<br>\r\nThe only new characters allowed are the genies who haven't yet been revealed from the chapter \"Freeing Auglalnya. If they've already appeared, keep to their portrayals in other chapters. For example Mzarglenya is portrayed as a character who is only interested in causing you pain, and doesn't even pretend to be doing it for your benefit like the others do, so if she appears in any other lines, then this is the interpretation that must be used for her.<br>\r\n<br>\r\n<br>\r\nRules<br>\r\n<br>\r\nGood<br>\r\n<br>\r\nBreast<br>\r\nButt<br>\r\nVore<br>\r\nFoot<br>\r\n<br>\r\nBad<br>\r\n<br>\r\nGay<br>\r\nVaginal<br>\r\nExtreme nudity<br>\r\nToilet<br>\r\nScat<br>\r\n<br>\r\nButhayna uses her magic to instantly revive you if you ever die, or make you indestructible (Not when she eats you).</td>",
        "id":1568373,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1500194400,
        "modified":1500194400,
        "pretty_title":"Genie's Captive Husband"
    }
}