{
    "chapters":{
        "1":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Anna (small)",
                "Sam (small)",
                "Alana (giantess)",
                "Gordon (giant)",
                "other people"
            ],
            "content":"<div class=\"\"><div> <span>A cool twilight breeze blew down the narrow alley which was home to The Velvet Snail, the only club where both giants and little people were allowed to drink at the same time. Rock music blared out of the doors as taxis carrying tiny drinkers swerved hecticly around giant feet. The place was the biggest club in town for most, but a small bar to a few.<br>\r\n<br>\r\n  There was a reason why The Snail was unique: most people considered that alcohol and people over 900 feet tall was a stupid idea... The club <i>did</i> have a reputation for drunken accidents and the odds of never being seen again while small were still too high for most. Only the most reckless or drunk normals ventured there. <br>\r\n<br>\r\n  The doors open. The smell of beer and a blast of sound welcome you to a night to remember!<br>\r\n<br>\r\n  Which patron shall we focus on first?</span></div></div>",
            "created":1362891600,
            "id":1547624,
            "title":"The Velvet Snail"
        },
        "11":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Go in!",
                "Look at someone else in the line",
                "Join the giantess",
                "Meanwhile back at The Happy Pig..."
            ],
            "content":"<div class=\"\"><div> <span>  George sat in the beer garden of The Happy Pig chatting to some people he didn't actually know. It was a nice enough place and he was in a good mood even if the band was terrible.<br>\r\n  <br>\r\n  \"On your own then?\" enquired the wizened sop opposite and George grinned.<br>\r\n   <br>\r\n  \"Heh, no! Just waiting for Anna, my girlfriend; she should be here any minute!\"<br>\r\n<br>\r\n<br>\r\n           ******************************************************************************** <br>\r\n<br>\r\n  Anna sat forward in the taxi as it raced towards The Velvet Snail. She straightened her tartan kilt and brushed her long red hair out of her eyes and hiccuped. She was a little drunk already. Completing her outfit were a black halterneck top and knee high black boots.<br>\r\n <br>\r\n  The driver glanced over his shoulder, \"Are you sure you want to go here? That place is dangerous!\"<br>\r\n<br>\r\n  As if to emphasize the point he suddenly swerved the cab left to avoid a blocky high heel wider than the car which slammed down ahead of them making the car tremble. Expertly regaining control he breathed heavily. \"See?\" he half shouted, \"the giants here have been drinking. They don't look where they're going so good! And you want to go inside, a nice girl like you?\"<br>\r\n<br>\r\n  \"Yes... I've been there before. It's fun!\"<br>\r\n<br>\r\n  The driver continued for a minute in silence and then said, \"I know some good places... If you wanted to..\"<br>\r\n<br>\r\n  \"NO... thankyou! Just get me there will you?\"<br>\r\n <br>\r\n  \"We're there.\"<br>\r\n<br>\r\n  The cab pulled in close to the cliff like facade of The Velvet snail and Anna got out and joined the short queue which hugged the wall to avoid giant feet heading to the thousand and something foot high giants' doors to the right of the normal entrance. Just a hundred feet away a huge foot clad in a gladiator sandal towered upward to a long pale leg. There was no-one she knew in the line, so her gaze turned and followed the leg up and up... a long strong calf .... and up.... the start of a thigh and then the hem of a short white skirt....<br>\r\n<br>\r\n   The queue moved, shaking her out of her reverie. It was time to pay. Shaking a little, she fumbled for her purse and paid the doorman. She stepped inside...</span></div></div>",
            "created":1362891600,
            "id":1547746,
            "title":"Anna"
        },
        "111":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "The bar",
                "The seats",
                "The dancefloor"
            ],
            "content":"<div class=\"\"><div> <span>  Anna automatically checked her handbag for the miniature megaphone which all citizens of New Olympus carried for communication with giants and stepped through the doors. A wave of sound hit her as she surveyed the vast chamber of The Snail. The ceiling was shrouded in darkness over a thousand feet above and the room stretched for kilometers in every direction. Dimly lit and smoky from giant cigarettes the room made her head spin. Giant feet moved and danced to her left in front of the base of a vast bar striped with high speed lifts so that normal people could get served by the giant bar staff. A pair of big flat boots and a pair of bare feet with an anklet; a giant and giantess dancing to the punk pop the DJ was playing. To her right was the seating area. Immediately next to her was the taxi rank providing free transport for them across the huge floorspace.<br>\r\n<br>\r\n  Anna smiled and climbed into a taxi heading for...</span></div></div>",
            "created":1362891600,
            "id":1547772,
            "title":"Go in!"
        },
        "1111":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Silver shoes",
                "Gladiator shoes"
            ],
            "content":"<div class=\"\"><div> <span>  Anna strapped herself in and the taxi accelerated rapidly as the driver floored the pedal. It was exhilarating. The cabbies of New Olympus were some of the best drivers in the world and the car cruised at well over a hundred miles per hour across the empty edge of the giant dancefloor, the five hundred foot cliff face of the bar looming closer. <br>\r\n<br>\r\n  Soon he slowed and turned right driving parallel to it towards the first of the high speed lifts which traced neon lines up the towering ediface. As they approached they drove in front of a huge pair of feet clad in silver strappy sandals. A crowd of people gathered around the lift, overshadowed by the giantess' toes. Further on ahead was another lift near the pair of black strappy gladiator sandals she'd passed on her way in. The owner had effortlessly passed the speeding cab and beaten her to the bar.<br>\r\n<br>\r\n  \"This stop or the next,\" asked the driver.</span></div></div>",
            "created":1363323600,
            "id":1551028,
            "title":"Bar Crawling"
        },
        "11112":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>    As the taxi approached the huge gladiator sandals, Anna realised that they were further away than she had thought. They were just very big even for a giantess. She stared up at pale muscular calves high above her up to powerful but feminine thighs and the white skirt.... and up.... and up... the underside of breasts covered by black fabric and high above that nearly a kilometer up the underside of a chin framed by long jet black hair...<br>\r\n<br>\r\n  Finchenza stood at the bar waiting for her drink. She was a striking woman, standing six feet tall with piercing green eyes and a well defined body betraying time in the gym. She had been a regular in The Velvet Snail for years and loved the place, the music, the hordes of tiny people who made it all more interesting than any other pub or club... She looked down at her feet. She loved how small and powerless the little people looked near them. She saw one of the little taxis, pull up near her left foot near the crowd waiting for the lift. A bug sized redhead got out and walked a little way towards her. She wondered what they were thinking. Playfully she raised her foot and waved it at the new arrival.<br>\r\n<br>\r\n  Anna stared up at the giantess, almost hypnotised, when suddenly a vast foot lifted and flew towards them sending people turning to run and screaming. A huge gust of wind sent her tumbling. She stared up helplessly at what seemed to be the tan coloured underside of a building over sixteen metres across moving toward her. She saw writing on the sole and a number nine, then just as fast it pulled back and tilted down, massive toes bigger than her whole body wiggling at her. A booming voice called down and she realised the giantess was looking down at her.<font class=\"size35\" style=\"\">\"<b>Hello there, little one. I'm Finchenza. Nice to meet you!\"</b></font><br>\r\n<br>\r\n  Other people were climbing to their feet and she heard laughter and someone crying but she just stood transfixed, staring up into the sky. Her eyes widened again. <br>\r\n<br>\r\n  Finchenza wasn't wearing underwear...</span></div></div>",
            "created":1363410000,
            "id":1551050,
            "title":"At Finchenza's Feet"
        },
        "111121":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Answer the phone",
                "Switch the damn thing off!"
            ],
            "content":"<div class=\"\"><div> <span>  Anna stared up... and up at a massive pair of pink lips in a small forest of dark hair illuminated by the diffuse light which filtered through the white fabric of Finchenza's skirt. Behind she saw the curve of well toned pale hills; a perfect peach, bigger than Anna's entire home. Finchenza simply stood. She must know that the hundreds of normal people in the Snail could see this... Anna's heart pounded in her chest, still frightened by her experience under the giant sandal, excited and her mind rushing as she wondered who this giantess truly was. The sandal... She was still far too close to that!<br>\r\n<br>\r\n  She became aware of her immediate surroundings again. She lay between Finchenza's feet, close to a pale white foot which towered above her wrapped by leather straps which looked too strong for her to bend but which creaked at the merest flex of the muscles in the giant foot. The air smelt of Finchenza's sweat and a short distance away at the lift, some people were yelling at her to get to safety.<br>\r\n<br>\r\n  Anna felt a surge of annoyance. She wasn't feeble; she could look after herself. She hated being patronised. She jumped as the giant heel lifted with a groan of tortured leather and rose high into the air. ...<br>\r\n<br>\r\n  *bip-de-boopboop-bip-diddi-bip*<br>\r\n<br>\r\n  Unbelievable! Her phone was ringing!<br>\r\n<br>\r\n  </span></div></div>",
            "created":1364360400,
            "id":1559148,
            "title":"Big Sky"
        },
        "1111211":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Up to the top!",
                "Meanwhile, at The (not so) Happy Pig..."
            ],
            "content":"<div class=\"\"><div> <span>  \"You ringing her then?\" enquired the ancient geezer opposite George through his false gnashers as the band played Fuck On Fire by The Dukes of Hazard for the third time. Dreary forty-somethings swivelled ineptly and cheered as George clenched his teeth. <br>\r\n<br>\r\n  \"No; I'm practicing morse code on a miniature xylophone!\"<br>\r\n<br>\r\n  \"Oh good-oh. I used to play morse xylophone back in North Africa, during the war. Thousands of us there was.... Rommel his self turned to jelly in....\"<br>\r\n<br>\r\n  Mercifully Anna picked up the phone at this point. He pictured her as she'd been when she went off earlier that evening in the short tartan skirt he loved and made up. Just going out for a few drinks with a friend... He fought back paranoia. <br>\r\n<br>\r\n  \"What?!\" Muffled music blared out of the phone.<br>\r\n<br>\r\n  \"Hello...\"<br>\r\n<br>\r\n  \"What?\"<br>\r\n<br>\r\n  \"HELLO! Where are you?\"<br>\r\n<br>\r\n  Anna flinched with annoyance. \"I'm getting a drink! Does it matter?\"<br>\r\n<br>\r\n  George paused in disbelief. \"Yes it matters! You were supposed to be here an hour ago! Where are you?\"<br>\r\n<br>\r\n  \"I said I <i>might</i> meet you.<br>\r\n<br>\r\n  George got up and walked over to a corner of the beer garden. \"You didn't! You said you'd meet me at The Happy Pig at ten! Where are you? I've been waiting an hour now!\"<br>\r\n<br>\r\n  \"I'm in The Velvet Snail. You can join me if you want... I'm not going to The Crappy Pig. I want to go somewhere I like for once!\"<br>\r\n<br>\r\n  George's head reeled feeling suddenly afraid for Anna. The Snail was the giant bar. He'd heard stories. Bad stories! \"The 'Snail! Why? You know how I feel about The Snail! It's dangerous! You could get stepped on and crushed to death or kidnapped by some drunk giant and... and...\"<br>\r\n<br>\r\n Anna rolled her eyes in annoyance. It wasn't bad enough that those strangers here were treating her like a child, now George was too!  \"I'm okay George. Now stop bothering me!\"<br>\r\n<br>\r\n  Where are you to be okay in there?\" George nearly shouted into the phone. The thought of anything happening to Anna made him feel sick.<br>\r\n<br>\r\n  Suddenly Finchenza swivelled her toes round and Anna found herself staring up again at the huge sole of her sandal. \"I'm underneath a fifty foot long gladiator sandal, if you must know! It's a size nine and it's cozy here. I like it! She knows me and I'm safe! So leave me alone!\" Anna was scared but her excitement about Finchenza and annoyance at George for ruining the moment overrode that. George shrieked in horror at the other end of the phone and she hung up and switched the phone off as the giantess bobbed her foot overhead to the music. Anna wasn't scared. The giantess knew she was here and wouldn't step on her. The sole lowered almost on to her and then rose and moved away making the ground shake as it landed off to her left. She was a little disappointed, but now she had to meet this woman! <br>\r\n<br>\r\n  Anna got to her feet and ran to the lift.<br>\r\n<br>\r\n  </span></div></div>",
            "created":1364446800,
            "id":1559172,
            "title":"The Happy Couple"
        },
        "1113":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Left",
                "Right",
                "Neither. Brake!"
            ],
            "content":"<div class=\"\"><div> <span>  Anna sashayed over to the nearest cab in what she had decided was a sexy yet enigmatic way and collapsed onto the back seat. <br>\r\n<br>\r\n  \"Dancefloor,\" she said, waving her taxi pass in the air and the cab accelerated causing her to fall back into the cushioned seat. These cabs drove <i>fast</i>. It had been suggested when New Olympus was established that high speed train lines be built as transport around the giant areas, but it had been pointed out that the tracks would just get destroyed by giants treading on them, so taxis it was. The New Olympus taxi corp. were the elite of global taxi drivers with a rigorous examination requirement, great pay and driving the fastest and best cars. The rate of fatal accidents was still bad, but the opportunity to drive fast cars in such a unique environment attracted thousands of eager applicants from around the globe. This one sounded French.<br>\r\n<br>\r\n  Anna's phone rang making her frown. \"Hey, she said, \"Can we take a shortcut? You know, straight across the giant floor?\" She was feeling good and wanted to check out the dancers up close.<br>\r\n<br>\r\n  \"Non! I regret that I cannot endanger a passengers life in such a reckless manner! I am a professional!\"<br>\r\n<br>\r\n  Anna shoved a fiver in his direction. \"Scared?\"<br>\r\n<br>\r\n  The money disappeared. \"'El no! I learnt to drive in Paris!\"<br>\r\n<br>\r\n  The car swerved left and revved alarmingly as they headed towards the huge dancing feet. As they got closer, Anna peered out of the window, craning her neck to see them. He was over a thousand feet tall and well built with shoulder length light brown hair, wearing a black music t-shirt, denim cut-off shorts and big black boots. She was 920 feet tall with blonde hair and a slim build, wearing a red crop top and matching very short skirt and was dancing barefoot, having kicked her shoes off.  From down here Anna could see her underwear. As they got closer the cab began to vibrate with their footfalls.<br>\r\n<br>\r\nThe driver veered right aiming to miss them by about a hundred metres. \"Are you ready, my fine crazy mad drunk girl? This could get...\"<br>\r\n<br>\r\n  The girl reacted to a shift in the music and a bare sole over forty metres long plunged toward them and crashed to the ground just outside the right windows as the driver frantically swerved left setting the tires screaming and throwing Anna against her belt. The car actually jumped slightly into the air.<br>\r\n<br>\r\n\"Meeeeerrrrrrrddddeeeeee!\" screamed the driver and Anna screamed inspite of herself. Outside the giant girl's left foot swung overhead and plummeted down ahead of them. The driver momentarily panicked. He had to swerve, but which way?<br>\r\n<br>\r\n</span></div></div>",
            "created":1363150800,
            "id":1549667,
            "title":"Vroooooooooooooooommm!"
        },
        "11131":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "content":"<div class=\"\"><div> <span>  The driver swerved left and everything went into slow-motion. Anna heard her phone ringing again as she was flung right. Overhead the giantess moved her leg in time to the music swaying it left so that it followed the car. It got dark and Anna could see the shadowed sole stretching away instead of the sky. There was a deafening boom and then the scream of tortured metal and people as the windows shattered spraying glass over her and then the ceiling collapsed onto her, seats buckled and there was an instant of agony as her bones broke and she was crushed into the wreck as the foot pressed down onto the floor<br>\r\n<br>\r\n  ************************************************<br>\r\n<br>\r\n  In the garden of The Happy Pig George put his phone away and sipped at his pint.<br>\r\n<br>\r\n  \"Anything wrong,\" enquired the old man.<br>\r\n<br>\r\n  \"No,\" he said, smiling, \"she'll be here any minute...\"<br>\r\n<br>\r\n **************************************************<br>\r\n<br>\r\n  Samantha danced to the music and flirted with the guy who was trying to flirt with her. <br>\r\n<br>\r\n  She felt something crunch under her left foot. She stopped and raised her foot to inspect her sole. There was something like a piece of foil stuck to the ball of her foot. <br>\r\n<br>\r\n  The big guy stopped and looked quizzically at her, \"What's up?\"<br>\r\n<br>\r\n  She frowned. \"I think I stepped on a taxi...\"<br>\r\n<br>\r\n  He looked a bit lost. \"What were they doing driving here?\"<br>\r\n<br>\r\n  She felt sorry for the little people inside and there was an awkward silence for a few seconds.  Her favourite song came on and she smiled. These things happened. She scraped her sole against her toe dislodging the wreck and began to dance again.</span></div></div>",
            "created":1363150800,
            "id":1549731,
            "title":"Dance Step"
        },
        "11133":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Anna runs out on foot",
                "She shuts the door and waits"
            ],
            "content":"<div class=\"\"><div> <span>  He hit the brakes and the cab skidded wildly, tires screeching, as the driver fought for control. The deadly foot dipped terrifyingly close plunging them into darkness then flew off to the left as they span round in circles and pounded down bouncing the car and sending Anna's stomach into her mouth. It was just what they needed to break the skid! The driver sagged over the wheel, breathing heavily and Anna sighed with relief. For a moment there she'd thought it was all over... <b>BOOM!</b> The giant girl's right foot slammed down less than twenty feet ahead shaking the car again. They weren't out of danger yet!<br>\r\n<br>\r\n  The driver swore again and tried to drive but the engine wheezed and stalled. He tried again and again... Anna began to panic. She could see and hear the giant feet. She was dancing right over them! Couldn't she see them? <br>\r\n<br>\r\n  \"C'mon! Drive!\"<br>\r\n<br>\r\n  \"What the hell do you think I'm trying to do?\" The engine whined again. \"I'll have it in a minute!\" He sounded shaken.<br>\r\n<br>\r\n  The car jumped again as a heel the size of a house pounded down right next to them blocking the light. \"We don't <i>have</i> a minute!\" Anna screamed. \"I'm getting out.\" She started to fumble with the door.<br>\r\n<br>\r\n  \"What? No! Are you crazy? If you go out there I'm not chasing after you; I'm going as soon as I get this damn car going again!\"<br>\r\n<br>\r\n  The door swung open, and Anna stared out at the giant heel as it raised into the sky again. </span></div></div>",
            "created":1364706000,
            "id":1561923,
            "title":"Swerve Into Danger!"
        },
        "111331":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "This way!",
                "That way!"
            ],
            "content":"<div class=\"\"><div> <span>Anna fell out of the car door and rolled onto her feet. THOOM! The giant foot slammed down just to one side of them shaking the ground and knocking Anna back down. The driver desperately tried the ignition but it was gone. He swore and got out of the car. He was clearly terrified. Overhead, the giantess danced, oblivious to the tiny people under her feet. As the driver picked himself up after the latest tremor, the ball of a huge foot slammed down from the sky onto his cab and with a blast of sound it was gone, the metal pressed flat under the ball of the giantess's foot. He was bowled over by the impact, crashing into Anna, who stared as the vast sole rose into the air, the flattened car stuck to her foot like a piece of foil. It peeled off and fell towards them... <br>\r\n<br>\r\n\"MOVE!\" she screamed and they rolled desperately, just avoiding the mass of crushed metal as it crashed to earth.<br>\r\n<br>\r\nHe was laughing. They both were. Toes bigger than both of them sailed overhead and slammed down, halting the laughter. <br>\r\n<br>\r\n\"We have to run!\" yelled Anna.<br>\r\n<br>\r\n\"Where?!\"<br>\r\n</span></div></div>",
            "created":1380949200,
            "id":1674472,
            "title":"Playing Footsie"
        },
        "1113311":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Stay with Anna",
                "Join the watching giantess"
            ],
            "content":"<div class=\"\"><div> <span>Samantha danced. She danced with the man she liked with her restrictive shoes tossed aside and she lost herself in the music. She didn't know what it was, nor did she care. The moment was everything and her bare feet pounded onto the wooden floor. She felt something crunch under her right foot but it didn't hurt her so she thought nothing of it... Her feet rose and fell slamming down onto the hard floor...<br>\r\n<br>\r\nAt the edge of the dancefloor a slim giantess with short hair saw what was happening and lit her cigarette. The man next to her was oblivious.<br>\r\n<br>\r\nAnna opened her mouth to scream and no sound came out. She was exhausted and suddenly this wasn't fun anymore. A toe bigger than she was kicked her, sending her flying. The taxi driver had taken off. The taxi was scrap. It was all going wrong. The foot lifted and Anna saw the whorls on the surface of the skin lit by the ground lights fitted around. She gasped and rolled and Samantha trod on her, the tiny girl pressing under the arch of her foot. Anna felt her whole body compress in agony and then the giantess's foot lifted taking Anna with it. The tiny girl peeled off and fell smashing into the floor to see her driver disappear with a scream under a heel the size of a house. It lifted and Anna tried to turn away but couldn't move. The foot covered her again.... and then sailed overhead, missing <br>\r\nher. <br>\r\n<br>\r\nSamantha laughed as she danced giving herself over to the moment. Something small like a bug squashed under her heel. She barely noticed.<br>\r\n<br>\r\nBoop de de de boop do beep do boop do! Her phone was ringing! George! Not now! She ran as hard and as fast as she could. THOOM! She was knocked off her feet by the giant foot and her bag spilled it's contents including the phone. A voice called out, reedy through the electronic fog, \"Anna? Anna! It's George...\"<br>\r\n<br>\r\nA boot crashed down next to her and then lifted off. <br>\r\n<br>\r\n\"Where are you? I've been waiting! Don't do this! Where are you?\"<br>\r\n<br>\r\nA shadow covered Anna as she gasped \"The Velvet Sn...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1381640400,
            "id":1678189,
            "title":"Lost in music"
        },
        "11133111":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "10,000 Bitches by Mos Lee Def",
                "Hell Lord in G Major by Masters of Shit"
            ],
            "content":"<div class=\"\"><div> <span>Samantha's foot moved back and slammed down and Anna found herself staring up at the underside of one of her toes. The impact knocked the breath out of her and the phone crackled nearby. She couldn't tell what it was saying. She was too hurt to get up. Her life or death depended on the giantess dancing on her as though she was nothing. <br>\r\n<br>\r\nThe music stopped. Sound squawked out of her phone as the giant foot settled less than a metre from her. She stared up at the wall of hard flesh, and then up the long leg.... <br>\r\n<br>\r\nSamantha sighed. It was a good night. The guy she was dancing with smiled at her. Life was good. What now; dance or get a drink?<br>\r\n<br>\r\nAnna sobbed. She remembered her driver and the terrible sound as he died. She began to crawl but she couldn't tell where she was going and knew she was at the mercy of the giant woman above her.<br>\r\n<br>\r\nThe DJ put on the next track. It was:</span></div></div>",
            "created":1381640400,
            "id":1678196,
            "title":"Dance of Death"
        },
        "111331112":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Anna rolls",
                "Anna stays put"
            ],
            "content":"<div class=\"\"><div> <span>GRWANNNNNNNGGGGGG! <br>\r\n<br>\r\n\"Oh no,\" sighed Samantha, as the guy looked at her expectantly. \"I like metal, I really do, but this is.... \" She shifted her foot covering Anna under her arch. He gestured.<br>\r\n<br>\r\n\"....total shit. Look, if you'll stay with me and talk instead of pretending to like this crap I'll buy you a drink. Deal?\" She raised her foot, scratching her calf and stepped to one side of Anna smothering the remains of the taxi and it's poor driver again.<br>\r\n<br>\r\nHe smiled, (though he really liked The Masters) and agreed. The girl wasn't the best looking he'd ever seen but she wasn't bad and free drink? Sold! \"Okay.\"<br>\r\n<br>\r\nShe walked away and he followed.<br>\r\n<br>\r\nIn the pub garden George was frantic. \"ANNA!\" he yelled into the phone. Anna stirred and saw the dirty sole of a size 12 boot falling towards her. George... \"Sorry George...\"<br>\r\n<br>\r\nGeorge suddenly felt a wave of urgency and yelled \"ROLL LEFT!!!\"<br>\r\n<br>\r\nShe heard it from her phone but it hurt so much to move...</span></div></div>",
            "created":1381640400,
            "id":1678206,
            "title":"This party blows, man"
        },
        "1113311121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Anna's not so lucky this time",
                "Anna sees the shadow, and rolls again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Anna rolls to the left to escape the oncoming foot.<br>\r\n<br>\r\nUh-oh, the other foot is coming down.</span></div></span></div>",
            "created":1425704400,
            "id":1945166,
            "title":"Anna rolls"
        },
        "1113311122":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Silence",
                "Pleasure"
            ],
            "content":"<div class=\"\"><div> <span>Anna gave up and watched the sole fall onto her. It was too big to dodge. It filled the sky and became her whole world. Silly George... The tread of the massive boot hit her and it seemed to last longer than it should. It was so painful as her body collapsed, bones snapping and crunching and her insides sqeezing out. Then....<br>\r\n<br>\r\nGeorge heard a terrible sound and then...<br>\r\n<br>\r\nThe woman with the short hair shuddered with pleasure as she took a drag of her cigarette and watched the foot tread down..</span></div></div>",
            "created":1381640400,
            "id":1678209,
            "title":"Nothing"
        },
        "12":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "The bar",
                "The dancing giantess",
                "The dancefloor",
                "The seats",
                "The gents. It's all been too exciting."
            ],
            "content":"<div class=\"\"><div> <span>  Sam stepped into the vast club and stared about in wonder. He was new in town; from a town with no giants and this was the closest he'd ever been to them. He was in his twenties, with tousled brown hair and wore a Hilarious Rats t-shirt, jeans and Converse style shoes. The room was awe inspiring, bigger than any cathedral it stretched away in every direction. Music blared deafeningly to accompany the spectacle of a bar far away ahead and left like a six hundred foot cliff face and even more astonishingly a pair of god-like dancers, each over nine hundred feet tall. The girl was beautiful, with blonde hair and scant red clothes including a miniskirt which displayed her underwear for them all to see over endless legs and dancing bare feet the size of buildings. <br>\r\n<br>\r\n  \"Oy, boss! You want a taxi or not?\"<br>\r\n<br>\r\n  Sam spun round in a daze. Oh yes, taxis. You would need them to get about in a place this big. <br>\r\n<br>\r\n  \"Er... yes...\"<br>\r\n<br>\r\n  He got in.<br>\r\n<br>\r\n  \"Okay, chief, where to?\"</span></div></div>",
            "created":1363323600,
            "id":1550463,
            "title":"Sam (small)"
        },
        "121":{
            "author_id":"gigatennisstar",
            "author_name":"Giga",
            "choices":[
                "Get back in the cab and take his chances",
                "Continue to the bar."
            ],
            "content":"<div class=\"\"><div> <span>\"The bar,\" Sam replied. The grizzled Taxi driver acknowledged pulling off to the elevator at the bottom of the bar. The driver showed his remarkable skill and prowess at the wheel as he zipped and zoomed in and out of the feet that belonged to the dancing gods. Before long they arrived at the elevator. Sam paid the driver and stepped out of the cab but before he made it too far he began to think of the girl again. He really did want to meet her, but what should he do?</span></div></div>",
            "created":1430888400,
            "id":1974229,
            "title":"The bar"
        },
        "1212":{
            "author_id":"gigatennisstar",
            "author_name":"Giga",
            "choices":[
                "Continue to see what he gets up to at the bar",
                "Something unexpected happens"
            ],
            "content":"<div class=\"\"><div> <span>Walking up to the elevator Sam pressed the button, calling the elevator from tits place at the top floor of the bar down to his ground level. As he waited he found his mind continuing to wander back to that girl. As his thoughts became muddled he began to loose awareness only capable of thinking about her. A ding singling the arrival of his transport snapped him back to reality. As he stepped inside he wondered what would become of his night.</span></div></div>",
            "created":1454734800,
            "id":2100545,
            "title":"Continue to the bar."
        },
        "122":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "\"No.\"",
                "\"No.\""
            ],
            "content":"<div class=\"\"><div> <span>  \"See that big blonde giantess in the red? Follow those legs!\"<br>\r\n<br>\r\n The cab did <i>not</i> roar into life and charge into excitement.<br>\r\n<br>\r\n  \"What?\" asked Sam.<br>\r\n<br>\r\n  \"New in town are you?\" enquired the cabbie in a way that sent Sam's inner bullshit warning system ringing.<br>\r\n<br>\r\n  \"Arr, yes, I be just a simple country boy, what has never seen a tall girl in the flesh and would like to go and get to know that fine example over there over a drink and some munchies. Now mush!\"<br>\r\n<br>\r\n  \"Oh dear oh dear oh dear. Dear me no. You don't want one of those ....\"<br>\r\n<br>\r\n  \"Excuse me. I may be just a country lad, but isn't it customary for you to be driving while you enlighten me with your years of honest down to earth wisdom?\"<br>\r\n<br>\r\n \"<font class=\"size1\" style=\"\">grumble mumble grumble bah smartarse bah harumph</font>\" The car started.<br>\r\n<br>\r\n  \"As I was saying, you don't want some huge great fancy giantess. No! A lad like you? What you want if you don't mind me saying...\"<br>\r\n<br>\r\n  \"...which I might not, not that it would stop you...\"<br>\r\n<br>\r\n  \"...is a nice petite normal girl with dark hair. A nice honest girl and a mug of Horlicks in front of an electric fire. Why, you wouldn't believe some of the stories I've heard about giant girls. I get all sorts in here. Just last week there was this...\"<br>\r\n<br>\r\n  \"So are we actually going to the girl I asked you to drive me to then?\"<br>\r\n<br>\r\n  The cabbie appeared to think, his broad sweaty salt of the earth face creased in concentration.</span></div></div>",
            "created":1363928400,
            "id":1555531,
            "title":"The Wisdom of the Cabbie"
        },
        "124":{
            "choices":[
                "Switch to Hailey (giantess)",
                "Sam wants to go over by Hailey on the dance floor",
                "Sam continues to the seats"
            ],
            "content":"<div class=\"\"><div> <span>\"The seats.\" Sam replied. The taxi driver nodded and floored it, zipping along towards the seats. <br>\r\n<br>\r\nSam looked out the window and watched the giants and giantesses dancing out on the dance floor. Their huge feet pounded against the ground and he saw many of the women were dancing around barefoot, their huge feet slapping against the dance floor.<br>\r\n<br>\r\nThey were close to the seats now when suddenly BOOM, a gigantic silver stiletto sandal heel crashed down right in front of them. They could the massive tan foot of the giantess as well and her skin was perfect. The cabbie hit the breaks and car screeched to a halt. <br>\r\n<br>\r\n\"Shit!\" The cabbie yelled. Sam looked out the window and saw the absolutely massive giantess take a seat and cross her legs. She was a gorgeous blonde with blue eyes and richly tan skin who was over 1000 feet tall with those heels on. She had model like figure and Sam stared intently at her, ignoring the swearing of the taxi driver. She wore a stunning short light blue dress that nicely rested on her breasts exposing just enough and very thin straps that which over each shoulder.  She had toned tan legs and looked like a model. She pulled her heel off on her foot of the leg that was elevated which gave Sam a view of the massive reddened sole of the giantesses which looked slightly sweaty before crossing her legs the opposite way and pulling that heel off slamming her barefeet down. Sam watched her wiggle her massive toes and her toenails were painted white on her massive toes. The cabbie started driving once again but Sam's eyes were fixed on the massive giantess as she stood up and walked back out to the dance floor.<br>\r\n<br>\r\nHailey had come to the velvet snail with a few of her friends. She was a model and had recently finished a shoot in New Olympus and was celebrating. She was tall, standing at 5'11 which meant she was around 975 feet tall to people like Sam and with her heels on she was over 1000 feet tall. She had beautiful blonde hair and blue eyes and richly tan skin. Her hands were perfectly manicured and her nails on both her fingers and toes were painted white which went well with her richly tan skin. She had been dancing the night away with her friends but her feet had started to hurt for dancing in her stiletto sandals. She could use a good foot massage she thought. All of her friends had kicked off their heels and wedges, leaving them at their table so Hailey decided to do the same. As Hailey walked across the dance floor to her seat, eyes were drawn to her gorgeous figure as she cut though. Sitting down on the seat at their she crossed her legs and removed her heels. Her feet were big, a size 10.5 US women's but it didn't bother her the slightest. She slammed her warm feet onto the cool floor of the club, unaware of the tiny taxi, inches (her scale) from her massive feet and wiggled her toes. Much better she thought as she stood up and walked back across the dance floor to her friends. Hailey smiled as her friend handed her a drink and Hailey at once began to dance and laugh and smile. <br>\r\n<br>\r\nSam had followed the massive giantess in light blue dress who was now barefoot with his eyes back out onto the dance floor were he could see her dancing with a group of girls. He had been given a nice view of her ass as she walked away and looked perfect, nice and firm and the dress sure helped. He watched the massive tan feet slam down as the girl laughed and danced to the music. <br>\r\n<br>\r\n\"We're here.\" The cabbie yelled and Sam looked at him.</span></div></div>",
            "created":1465396920,
            "id":2160840,
            "title":"The seats"
        },
        "1241":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Emma",
                "Susan",
                "Tim"
            ],
            "content":"<div class=\"\"><div> <span> Hailey took a swig of... whatever this blue stuff was and a new tarck started up. \"Alright, this ones for all the laidies with junk in their trunk&gt; I wanna see some actiooooooooooon!!!!\"<br>\r\n<br>\r\n A low bass groove started making Hailey's whole body tremble and She and her mates began to grind to:<br>\r\n<br>\r\n <b>Rand E Dix Got De Biggest Tree</b> <i>(Randy Dicks 10years without parole records)</i><br>\r\n<br>\r\n \"Yo, hey shorty get yo' junk in me face<br>\r\n(while me 'av' anovver beer)<br>\r\nShorty look at my face<br>\r\nI a pumpin' nitemare!<br>\r\n(girl you better give it up)<br>\r\nYo think you goin' home <br>\r\n(but you gonna give Dix a fuck!)<br>\r\nGonna give a bitch a bone<br>\r\n(He's a pumpin' nightmare)<br>\r\nYo better grab a phone<br>\r\n(Call a ambulance over here)<br>\r\n<br>\r\n(I wander lonely in the shadows<br>\r\nMy heart is filled with ache and fear<br>\r\nI'll be home soon my baby baby<br>\r\nI'll just stop off for one beer)<br>\r\n<br>\r\n*Yo Dix, Yo gonna cum in that bitches face?*<br>\r\nYeah.<br>\r\n<br>\r\nMotherfucker say he got a claim on you?<br>\r\nWell Dix got his dick inside yo shit<br>\r\n(motherfucker)<br>\r\nGoing down, that both of you<br>\r\n(one in the ground)<br>\r\nIma gonna get shit faced an fuck you<br>\r\n<br>\r\n(I wander lonely in the shadows<br>\r\nMy heart is filled with ache and fear<br>\r\nI'll be home soon my baby baby<br>\r\nI'll just stop off for one beer)<br>\r\n<br>\r\n*Oh Dix, you havva call an amblilance!*\"<br>\r\nFuck yeah!<br>\r\n<br>\r\nMany of the smaller patrons watched as the giant girls danced, their huge feet, endless legs and the rest towering up into the dark, with fear, lust or envy.<br>\r\n<br>\r\n Emma was small and looked with envy at the big dancefloor, wanting to join in, but it was against the rules.<br>\r\n<br>\r\n Susan sat at the tables, the same size as the dancers but with no interest in joining them. She was cringing at the awful music.<br>\r\n<br>\r\n Tim was small and staring with unbridled lust. It was his first time here and he'd never realised how sexy a giant woman could be. He'd just feared them, but his attitude had just changed.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1465436760,
            "id":2161182,
            "title":"Grindhouse"
        },
        "12413":{
            "choices":[
                "Tim manges to get out of the way of Hailey ",
                "Tim can't get out of the way in time, Hailey steps on him"
            ],
            "content":"<div class=\"\"><div> <span>Tim timidly began to approach the edge of the dance floor as he watched the huge women dance. He was particularly drawn to the girl in the light blue dress who was currently grinding her ass against another girl and smiling while she held a drink in her hand. Tim saw several giant man standing around the group trying to dance their way into the group but the girls were careful to not allow any openings. They were having too much fun on their own.<br>\r\n<br>\r\nTim immediately called for a cab. The cab arrived and Tim hopped in the back.<br>\r\n<br>\r\n\"Where to?\" The cab driver said. <br>\r\n<br>\r\n\"Over there,\" Tim said pointing towards the giant dancing girls, \"by the one in the light blue.\" <br>\r\n<br>\r\n\"Are you crazy?\" The cab driver said staring at him wide eyed. \"Those girls are huge! You'll get stepped on while they dance around!\"<br>\r\n<br>\r\n\"I'm not asking you for an opinion.\" Tim said tossing a 20 at the driver.<br>\r\n<br>\r\n\"Alright, your funeral.\" The cab driver signed before speeding off towards the giantesses. <br>\r\n<br>\r\nThe cab zipped across the dance floor around massive shoes, heels and barefeet. Many were stomping around as they danced to the music. <br>\r\n<br>\r\nThe rhythmic booming of the giantess's huge feet as she danced began louder and shook the ground. <br>\r\n<br>\r\n\"Here you go. Be careful kid.\" The cab driver said as Tim paid him and hopped out. <br>\r\n<br>\r\nTim watched as the cab zipped away and was knocked from his feet as the massive tan foot of the giantess slammed down close to him. The foot was absolutely massive. The toenails were painted a beautiful white and he watched the foot lifted up and slam down once again followed by her other foot. He could see up her dress as she danced and saw she was wearing sexy white lace panties. He felt himself getting hard as he stared up momentarily forgetting about the huge feet. The huge feet pounded the ground as she danced, giving him views of her massive reddened soles as her feet passed over him as she danced. <br>\r\n<br>\r\nBOOM<br>\r\nBOOM<br>\r\nBOOM<br>\r\nBOOM<br>\r\n<br>\r\nTim began to realize this was a very bad idea as the huge dancing feet crashed down. He saw the huge rising up and it slammed down next to him with a loud crash knocking him over.<br>\r\n<br>\r\nHailey was having a wonderful time. Having removed her heels, she was now free to dance without her feet getting any more sore. She grinded and danced happily as the music pounded. It wasn't her favorite song but it was alright for a club she guessed. She was completely unaware of the tiny between her feet as she danced. Hailey took another sip of her drink and smiled. <br>\r\n<br>\r\nTim screamed as the huge foot slammed down again nearly crushing him. He watched the giantess grind on another giantess whose massive barefeet were huge but not as big as the light blue dress giantess's tan feet. He just prayed the song would be over soon as he was bounced about on the dance floor by the giantess and her dancing.<br>\r\n<br>\r\nTim saw the huge giantesses begin to move away from him as they continued dancing. It seemed that they were just unaware of their surroundings as they danced.<br>\r\n<br>\r\n\"Want to do some shots?\" Her friend Emma said as the song ended and they stopped dancing. Hailey nodded happily and said, \"I'd love to! Who doesn't like shots?!\" Her and her friends headed to the bar.<br>\r\n<br>\r\nTim watched the huge giantess and her friends walk towards the bar. It was then he realized in horror he was between them and the bar. The blonde giantess with the light blue dress was walking straight towards him. He saw her huge feet crashing against the ground as she walked towards the bar and him.</span></div></div>",
            "created":1465444560,
            "id":2161238,
            "title":"Tim"
        },
        "124131":{
            "choices":[
                "Continue with Tim and Hailey",
                "Switch to the new giantess"
            ],
            "content":"<div class=\"\"><div> <span>Tim watched as the giantess approached. He immediately turned and began to run. Tim had smartly decided to run to the side as there was no way he could outrun her with her massive strides. She was closing in quickly, the shaking of the ground becoming more violent as she approached. Tim didn't dare look up as a shadow came over him, no doubt the massive foot of the giantess. Tim dove just as the massive tan foot slammed down inches from him. <br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nIt was like a thunderclap as her huge foot slammed down. Tim turned and breathed a sigh of relief as he saw just how close he had come to being crushed beneath the foot of the skyscraper sized girl. He could smell a slight cheesy foot funk from the huge tan foot. He watched as the skin on the bottom of her foot turned white as the weight increased as she raised her other foot to take a step. He gazed up the tan, toned leg to the short light blue dress she was wearing. The huge foot lifted and the giantess and her friends continued to the bar.<br>\r\n<br>\r\nTim had to get off the dance floor and somehow get the beautiful blonde's attention. He began to run after her as she and her friends came to a stop at the bar. Hopefully they would stay at the bar long enough for him to get over there. <br>\r\n<br>\r\nTim fortunately drew the attention of a passing cab who picked him and drove him most of the way to the elevator to the bar. The giantess was still at the bar, laughing and talking with her 3 friends. Tim stared up at her, the light blue dress tight in all the right areas as he stared at her legs and ass. Tim got into the lift and took it up to the bar top.<br>\r\n<br>\r\nTim got off the elevator and surveyed his surroundings. Many other people just like him where milling about on the bar top. He made his way towards the blonde giantess and watched as her huge manicured fingers, with her nails painted white just like her toes, wrap around her huge glass and lift it up effortlessly to take a drink. He watched as she then placed the glass back on the bar, a slight tremor shaking him as he ran towards her.<br>\r\n<br>\r\nHailey had walked over to the bar and was now enjoying a drink with her girlfriends while they took a break from dancing. <br>\r\n<br>\r\n\"Is that little guy waving at us?\" Amy, one of Hailey's friends said.<br>\r\n<br>\r\n\"It looks like he is.\" Emma said smiling.<br>\r\n<br>\r\n\"I think he's waving at Hailey actually. Looks like one of your fans.\" Jess said giggling.<br>\r\n<br>\r\nHailey turned and looked down at the tiny man on the bar. He was hopping up and down and waving at her. She smiled and gave him a little wave back.<br>\r\n<br>\r\nTim had been waving at the giantess whose name he now knew was Hailey. One of her friends had noticed him and pointed him out. The giantesses voices were like thunder to him. He was filled with joy as she smiled, revealing her perfect white teeth and waved at him.<br>\r\n<br>\r\n\"HIYA LITTLE MAN.\" Hailey thundered.<br>\r\n<br>\r\nTim couldn't believe it. She acknowledged him! As he gazed at her beautiful face more intently he realized something. This huge blonde who was tall for even a giant was none other than Hailey Ellington the hottest up and coming model around. He instantly was even more smitten with the gorgeous girl than before.<br>\r\n<br>\r\nHailey looked down at her tiny fan. \"Isn't it dangerous for him to be here, I mean he could get crushed!\" She said.<br>\r\n<br>\r\n\"I forgot this your first time here. That's part of the club girl. Little people are everywhere.\" Jess said smiling.<br>\r\n<br>\r\nTim watched as Hailey extended a huge well manicured finger towards him. He slowly backed up as the finger was terrifyingly huge. <br>\r\n<br>\r\nHailey extended her finger and watched the tiny back away. She giggled as he backed away.<br>\r\n<br>\r\n\"I think you're scaring him.\" Emma giggled.<br>\r\n<br>\r\n\"I just wanted to say hi to my little fan.\" Hailey giggled.<br>\r\n<br>\r\nTim watched as the huge finger retracted. He watched her arm go over him as she grabbed her glass and finished her drink placing the class back onto the bar with a shake. <br>\r\n<br>\r\nHailey motioned for another drink and smiled at the tiny man. He waved back at her and Hailey giggled in response.<br>\r\n<br>\r\n\"Come on, let's go dance. I love this song!\" Amy said as she grabbed her drink.<br>\r\n<br>\r\nJess and Emma followed suit, grabbing their drinks from the bar as well.<br>\r\n<br>\r\nHailey grabbed her drink and waved good bye to Tim. <br>\r\n<br>\r\n\"See ya little guy!\" She said before blowing him a kiss and turning around and following her friends to the dance floor.<br>\r\n<br>\r\nTim smiled as she blew the kiss at him and turned to look around. Most tiny people were oblivious to him and what had just occurred. He looked out to the dance floor and spotted the tall, tan, blonde giantess dancing, her huge barefeet slamming down on the dance floor. <br>\r\n<br>\r\nTim groaned. He had been so close to her and wanted her more than ever. She had seemed curious about him just because he was so tiny. He began to think about what he could do next.<br>\r\n<br>\r\nUnknown to Tim but another giantess had seen this little interaction and was eyeing him like a predator eyes its prey. She grinned down at the little man and decided whether she wanted him or not.<br>\r\n</span></div></div>",
            "created":1470376980,
            "id":2191378,
            "title":"Tim manges to get out of the way of Hailey "
        },
        "124132":{
            "choices":[
                "Hailey decides they should go dance again",
                "Hailey decides they should have some fun with the tinies"
            ],
            "content":"<div class=\"\"><div> <span>Tim panicked as he stood there. The huge giantess was approaching him quickly. <br>\r\n<br>\r\nBOOM<br>\r\nBOOM<br>\r\nBOOM<br>\r\n<br>\r\nHe wanted to move desperately but his body wasn't listening. Her huge feet shaking the ground as she covered the distance in seconds. The music was beginning to pick up again and the giantess and her massive friends quickened their steps to the bar. Tom watched as the foot crashes down thousands of feet away from him. The huge tan toes with their white nails making him shake. He watched as the tan foot took the weight of the giantess as her other foot lifted and then slammed down. Tim screamed as he saw the huge tan foot of the giantess begin to lift up. The foot moved towards him and he watched as the huge heel slammed to the ground. He looked up and saw the reddened sole of the giantess which now a bit dirty from her dancing barefoot. He could also smell sweaty feet and a slight cheesy odor. The giantess's size 10.5 foot was massive! Tim felt a warm trickle on his leg and his underwear begin to become wet. The huge foot of the giantess quickly descended. The smell of sweaty feet increased and Tim could do nothing as the foot crashes down upon him. He lifted his arms over his head in a feeble attempt to ward off the massive tan foot of the giantess. For a second, he felt warm, slightly sweaty flesh before his head was at his feet as he was splattered under the massive tan foot of the beautiful giantess.<br>\r\n<br>\r\n-------------------------------------------<br>\r\n<br>\r\nHailey walked along with her friends to the bar to get shots. Her feet slapped against the dance floor as she walked. The music had began to pick up and she became to hurry a little bit more, wanting to get the shots and head back out to dance. She never even noticed the tiny man in her path. She didn't even feel the tiny splat as her right foot landed on Tim. It was just another bit of dirt and grime to become stuck to her colossal sole. <br>\r\n<br>\r\nHailey smiled as she stood at the bar with her friends, Emma, Amy, and Jess. They all talked excitedly and smiled as the bartender came over. <br>\r\n<br>\r\n\"4 Slammers!\" Emma yelled. <br>\r\n<br>\r\nThe bartender returned with the 4 shots and smiled.<br>\r\n<br>\r\n\"These are on the house ladies!\" The bartender replied smiling. The girls all giggled and looked at each with huge grins. It wasn't usual for four very attractive young women to get free drinks here.<br>\r\n<br>\r\n\"In that case, 4 more shots!\" Jess yelled. The girls all cheered raised their shots and gulped them down. The slammed the glasses down on the counter. <br>\r\n<br>\r\n\"Hey look, on the bar.\" Amy said pointing at some small objects moving on the bar. <br>\r\n<br>\r\n\"Ew. Ants.\" Hailey muttered raising her huge hand over the small scurrying creatures. She formed a fist and giggled. She grinned as she saw them trying to get out from under her huge hand. <br>\r\n<br>\r\n\"Hailey!\" Amy said grabbing her by the wrist. \"Those aren't ants! They're tiny people!\" <br>\r\n<br>\r\n\"Oh yeah! I forgot that this club let's them in here.\" Hailey giggled as she lowered her hand. That would have been awkward she thought if she had just slammed her fist on to the bar. <br>\r\n<br>\r\nThe bartender returned with the four shots and the girls gulped those down as well.<br>\r\n<br>\r\n\"You know, accidents do happen here.\" Jess said grinning as she looked at the tinies near their empty shot glasses. <br>\r\n<br>\r\n\"Yeah. I mean sometimes tinies just get in the way you know?\" Emma said with a sly grin.<br>\r\n<br>\r\n\"Oh come on. They're just minding their own business. Let's go dance.\" Amy said.<br>\r\n<br>\r\n\"How about we let Hailey choose? It's her first time here.\" Jess said.<br>\r\n<br>\r\nHailey found all 3 girls staring at her. She knew whatever she chose, they would all go along with. She looked at the dance floor and then back at the bar with she could just make out the tiny specks. <br>\r\n<br>\r\nHailey grinned as she decided what they should do.</span></div></div>",
            "created":1468591680,
            "id":2180611,
            "title":"Tim can't get out of the way in time, Haile..."
        },
        "1241321":{
            "choices":[
                "Hailey's perspective"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's dance!\" She said pulling them towards the dance floor while Amy chuckled.<br>\r\n<br>\r\n\"Ok girl!\" Jess said laughing as they stepped out on the dance floor as the song began. The four barefoot girls, having all kicked their heels off danced and grinded on each other. Hailey was dancing as the song was ending, she looked up at the bar and made eye contact with a man standing there. He smiled at her, downed his drink and began walking toward her with his friend. <br>\r\n<br>\r\n\"Shit...\" Hailey said.<br>\r\n<br>\r\n\"What?\" Amy said.<br>\r\n<br>\r\n\"I just made eye contact with that guy and now he's coming over here.\" She said ducking down a bit.<br>\r\n<br>\r\n\"He's kind of cute.\" Jess giggled.<br>\r\n<br>\r\n\"What?!\" Hailey said. <br>\r\n<br>\r\n\"I'm just kidding. We'll get rid of him.\" Jess said as Amy and Emma smiled.<br>\r\n<br>\r\nThanks! You guys rock!\" Hailey said hugging them all before turning and walking across the dance floor. Hailey decided to duck into the bath retook to fix her hair and pushed open the door. She stopped before she stepped in remembering she was barefoot. I should've grabbed my shoes she thought but then looked at the floor. The white tile was spotless and the bathroom seemed empty and quite clean. That's surprising she thought as she took a step in. The cool tile felt nice on her warm soles. She walked over to the mirror and stood there, running her hands though her hair. She wiggles her hot toes on the cool tile floor and smiled. She then heard a toilet flush and the stall door behind her flew open.<br>\r\n<br>\r\nA girl who was about her age stepped out and came up the sink to wash her hands. The girl was about half a foot shorter than Hailey and was wearing a red top the revealed her stomach where she had a diamond navel piercing and a very short black mini skirt. Her brown hair was a bit messy and she was cute and also barefoot. The girl washed her hands and glanced at Hailey before taking a double take and stopping in her tracks.<br>\r\n<br>\r\n\"Holy shit! You're Hailey Ellington!\" The girl blurted out.<br>\r\n<br>\r\nHailey looked at the girl and smiled warmly as she nodded. She was honestly surprised more people hadn't recognized her here. Not that she was complaining as it was nice to go unnoticed when she was out.<br>\r\n<br>\r\n\"I'm Katie by the way. You're so fucking awesome! What are you doing here? You're like the hottest model right now! You've been on 3 covers this year alone!\" The girl said excitedly. \"Can I take a pic with you? You're so beautiful!\" <br>\r\n<br>\r\nHailey grinned. \"I just finished a shoot and am here with some friends and of course Katie!\" <br>\r\n<br>\r\nThe girl pulled her smart phone out of her bra and wrapped her arm around Hailey's midsection while Hailey put her arm around Katie and her other arm on her hip. <br>\r\n<br>\r\nThe girl snapped the selfie and said \"One more! Can we do a goofy pose?\"<br>\r\n<br>\r\n\"Sure!\" Hailey said as both her Katie made goofy faces and poses as Katie snapped another pic.<br>\r\n<br>\r\n\"Oh my boyfriend is going to be so jealous. He adores you!\"<br>\r\n<br>\r\n\"That's so sweet. What's his name?\"<br>\r\n<br>\r\n\"Josh.\" <br>\r\n<br>\r\n\"Well tell Josh I say hello.\" <br>\r\n<br>\r\n\"I will and that dress is sooooo beautiful! It looks awesome on you, I mean anything would but that dress is great!\" Katie said quickly.<br>\r\n<br>\r\n\"Thanks!\"<br>\r\n<br>\r\nKatie then hugged Hailey.<br>\r\n<br>\r\n\"No problem Ms. Ellington!\" Katie said backing away a huge grin still on her face.<br>\r\n<br>\r\n\"Call me Hailey, Ms. Ellington makes me sound old.\" Hailey chuckled.<br>\r\n<br>\r\n\"Of course Ms. El- I mean Hailey! Have fun tonight! Enjoy the club!\" Katie said as she opened the door back to the club.<br>\r\n<br>\r\n\"You too!\" Hailey said as Katie stepped out of the bathroom.<br>\r\n<br>\r\nHailey smiled as she brushed some of her long blonde hair back. Katie was nice Hailey thought as she glanced to the ground. As she looked at the ground momentarily...<br>\r\n<br>\r\nFlash.<br>\r\n<br>\r\nHailey stopped what she was doing and stared at the ground more intently. She could've of sworn she had saw a camera flash. She took a step back from the counter and<br>\r\nFlash.<br>\r\n<br>\r\nDrew had come to the Velvet Snail once before. Being ant size compared to the giant people all around presented some unique opportunities. As he had stood by the bar a massive, beautiful brunette in a short black dress, and black pumps had stood directly over him. He remembered looking up, and seeing her tight pussy hundreds of feet above him as she wasn't wearing panties. He had been so turned and watched as the huge brunette flirted with a guy who had slipped his hand between her legs and fingered her while they stood at the bar. Drew had been so entranced by what was going on above him, he watched before they left together after the giant had thoroughly fingered the giantess. The rest of the night he had been amazed by how easy it was to stare up the dresses and skirts of the giantesses. Although it was extremely dangerous to be by them, it was so worth it. He decided the next time he came, he would bring a camera.<br>\r\n<br>\r\nNow a week later, holding a high powered camera as he entered the Velvet Snail. He hailed a cab and took it to the women's bathroom. He had to make a pretty substantial \"payment\" to get the cabbie to take him in there but it would be worth it. The cabbie had dropped him beneath the sinks and quickly left. He could see one pair of massive barefeet and ankles directly in front of him, the rest of the giantess obscured by the stall door. The door of the bathroom had then flown open. He couldn't believe his luck as he saw the girl who walked in.<br>\r\n<br>\r\nHailey Ellington. THE Hailey Ellington. The up and coming model that was all the rage right now. She drop dead gorgeous, blonde, tan, tall, young in her early twenties, and was everywhere. Everything about her was perfect. Drew couldn't believe his luck. She was barefoot and wearing a pretty light blue dress. An up dress shot of her would not only be awesome for his new collection he was about to start but he could probably sell the photos to some seedy gossip site or magazine for some good money. <br>\r\n<br>\r\nHe watched the massive tan, toned legs twitch as the muscles worked as she walked  and her huge tan barefeet slap the floor, shaking the ground. She stopped directly in front of him, her massive barefeet on either side of him. The counter blocked her upper body of her blocked by the counter, giving him a view of her massive tan feet with their white toenails, long tan, toned legs and bottom of her light blue dress. he had to do was go forward and he would be between her feet. Suddenly the toilet flushed.<br>\r\n<br>\r\nAnother huge pair of barefeet, these with red toenails joined the massive tan feet with white toe nails of Hailey. He had the thunder-like voices of the giantesses as he moved toward the feet. He could smell their foot funk as he got closer to them. He looked up and saw they were taking selfies together. The brunette hugged Hailey and then began to back away. The thunder-like voices continued talking as he crept forward. Hailey then turned back to the mirror and drew grinned. He walked out and looked up. Her face was obscured by her breasts and he snapped a picture.<br>\r\n<br>\r\nDrew was between the huge feet of the giantess now. Her foot funk washed over him, smelling cheesy and sweaty but he didn't mind. He kind of liked it as he aimed his camera up. He was directly under her, her huge tan, toned legs stretching up like buildings on either side and he grinned as he saw her white lace panties. If only those sexy panties weren't there. He snapped picture after picture as the huge giantess looked in the mirror. He didn't see as he was looking through his camera that Hailey had looked down as he snapped another pic. <br>\r\n<br>\r\nThe ground rumbled and shook as Hailey stepped back. Her huge tan feet were still on either side of him, slightly in front of him. He looked up and saw Hailey's beautiful face, just making it out over her perky breasts. She was like a giant tan skyscraper. She appeared to be looking at the ground. He snapped another picture. <br>\r\n<br>\r\n\"ARE YOU ONE OF THOSE TINY, TINY BUG PEOPLE?\"<br>\r\n<br>\r\nDrew snapped another picture. \"WHAT THE HELL? ARE YOU TAKING PICTURES OF ME?\" The thunderous voice of the giantess rang out, a bit of a shrill to it.<br>\r\n<br>\r\n\"YOU'RE LOOKING UP MY DRESS?!  AND SNAPPING PICTURES?! YOU FUCKING PERVERT!\" The godlike voice roared.<br>\r\n<br>\r\nDrew pulled back from the camera and saw the blonde giantess looked angry and disgusted. What was she gonna do? he thought. He aimed up at crotch but the view through his camera of the white lace panties was replaced by what looked like reddened, dirty flesh. He slowly pulled back from the viewfinder and swallowed. He was looking at the huge sole of Hailey Ellington's right foot.<br>\r\n<br>\r\nShit.<br>\r\n<br>\r\nHe saw a richly tanned arm outstretched, her huge hand on the counter bracing the her as her foot was blocking his view of her crotch. He saw a grin form on her face and her pretty blue eyes seemed to be staring directly at him. <br>\r\n<br>\r\n\"SO YOU LIKE TAKING PICS OF ME HUH PERV? I HAVE SOMETHING YOU CAN TAKE A PIC OF!\" <br>\r\n<br>\r\nThe huge sole was reddened and grimy and dirty from walking around and dancing. It looked sweaty and he watched as she scrunched and unscrunched her foot and toes and then wiggled her toes as if to wave at him. He felt a warm stream running down his leg as he looked up. <br>\r\n<br>\r\n\"YOU'RE NOT EVEN GOING TO TRY TO RUN? LAME. WELL THEN HOW ABOUT YOU SAY HELLO TO MY FUCKING FOOT!\"<br>\r\n<br>\r\nHe saw her pretty face, a wicked grin on it as he watched as she removed her arm from the counter and her foot begin to descend. It soon blocked out her face as the huge grimy sole came racing down. Drew was frozen. He smelled her cheesy, sweaty foot funk and it only got stronger. For a split second he felt warm, sweaty flesh and the overpowering smell of her feet followed by a split second of intense pain all over before it all went black. </span></div></div>",
            "created":1468938180,
            "id":2182941,
            "title":"Hailey decides they should go dance again"
        },
        "12413211":{
            "choices":[
                "A giant man approaches Hailey",
                "Switch to a tiny person who is observing Hailey and her friends"
            ],
            "content":"<div class=\"\"><div> <span>That was definitely a flash.<br>\r\n<br>\r\n\"Are you one of those tiny, tiny bug people?\" Hailey said, her blue eyes narrowing at the tiny speck on the floor, black against the stark white tile of the bathroom. The person looked so small compared to her. Why is it taking pictures of me? she thought. <br>\r\n<br>\r\nFlash.<br>\r\n<br>\r\n\"What the hell? Are you taking pictures of me?\"<br>\r\n<br>\r\nHailey gazed at the tiny speck as another tiny flash went off. She was a bit annoyed now but that would change. Hailey quickly realized what the tiny person was doing. She was pissed.<br>\r\n<br>\r\n\"You're looking up my dress?! And snapping pictures?! You fucking pervert!\"<br>\r\n<br>\r\nWho the fuck did this little shit think he was? Well she assumed it was a he taking up dress shots of her. Hailey was insanely pissed. How fucking creepy could you be? She had dealt with creepers and pervs before, it came with the fame but this was ridiculous. Who takes up skirt and dress pictures of women? Her anger turned to rage and then she got an idea. She grinned as she thought of just how to deal with this little ant of a person. Like Jess and Emma had said, accidents happen and this perv was asking for it. She extended her arm and grabbed the counter to brace herself. The huge blonde then began to lift her perfect right foot and move it over the tiny speck.<br>\r\n<br>\r\nShe grinned as she looked down at the top of her tan foot, admiring her white toenails and her perfect pedicure. She just couldn't wait to stomp this perv like the bug he was but first to have some fun.<br>\r\n<br>\r\n\"So you like taking pics of me huh perv? I have something you can take a pic of!\"<br>\r\n<br>\r\nShe scrunched her toes and foot and then unscrunched them before wiggling her tan toes at the tiny. This little perv was gonna get it. She wanted to play with him a little first. She knew he couldn't outrun her and she wanted to cause him as much fear as possible first. She wiggles her toes and saw the little speck hadn't moved at all as she looked down. She was at least hoping he would have tried to run just so she could draw out the torture but it seemed rooted in place. She just grinned wickedly down as she thought of how terrified the tiny was of her huge size 10.5 foot (U.S. Women's).<br>\r\n<br>\r\n\"You're not even going to try to run? Lame. Well then how about you say hello to my fucking foot!\"<br>\r\n<br>\r\nHailey took her hand after the counter and stomped. Her huge tan foot slammed down onto the cool tile. She very, very faintly felt a small pop under her hot, sweaty sole near the ball of her foot. She grinned as she twisted her foot like she was putting out a cigarette. She placed her foot back on the ground and dragged it back, sporting a tiny red spot on the white tile and a bit of blood smeared from her dragging her foot. <br>\r\n<br>\r\nHailey let out a girlish giggle as she saw this. Fucking perv, she thought, squished under my massive filthy foot. One less perv out there. He deserved it she thought as she wiggles her huge tan toes. She looked into the mirror and smiled as she ran her had through her blonde hair. She thought it was pretty funny that she had just crushed a person like an ant under her foot.<br>\r\n<br>\r\nShe heard the door to the bathroom swing open and heard Jess.<br>\r\n<br>\r\n\"Everything okay Hailey? You didn't puke did you?\" Jess said with a grin.<br>\r\n<br>\r\n\"What? No. Just fixing my hair. I don't puke Jess.\" <br>\r\n<br>\r\n\"I'm just giving you a hard time.\" Jess said laughing. \"Come on, you look great. Oh and we got rid of those guys.\" Jess said smiling.<br>\r\n<br>\r\n\"Good.\"<br>\r\n<br>\r\nHailey turned and walked toward the door. \"You look alright yourself.\" She said as she blew Jess a kiss as she exited the bathroom.<br>\r\n<br>\r\nThe small man was left as a little blood spot to be mopped up when the Velvet Snail closed. Some of the blood had adhered to Hailey's colossal sole, the second little person she had stepped on, added to the dirt and grime of her feet. The night was still young and plenty of tinies could still end up under Hailey's massive barefeet.<br>\r\n<br>\r\nJess in return slapped Hailey's firm ass as she walked by drawing a yelp and giggle from Hailey.<br>\r\n<br>\r\n\"Let's go dance!\" Jess said.<br>\r\n<br>\r\n\"Woo!\" Hailey said as she and Jess ran over to Emma and Amy who handed them drinks.<br>\r\n<br>\r\n\"We made those losers by us all drinks before we told em to fuck off!\" Amy said as they began to dance. <br>\r\n<br>\r\n\"Amy also kissed the losers friend.\" Emma said as Jess and Hailey laughed.<br>\r\n<br>\r\n\"Hey he was cute. His friend, the one you made eye contact with Hailey, was a fucking creep!\" Amy retorted.<br>\r\n<br>\r\n\"Trueeeee.\" Jess aid as they laughed<br>\r\n<br>\r\n\"Fuck those guys!\" Hailey said as the music began to pick up again and her friends cheered.<br>\r\n<br>\r\nAll the girls just laughed as they danced barefoot, huge feet pounding away on the floor. Hailey had already forgotten about the tiny person she had stomped as she drank and danced, her huge feet pounding the ground as she danced while people both giant and tiny looked on.</span></div></div>",
            "created":1468938300,
            "id":2182942,
            "title":"Hailey's perspective"
        },
        "1241322":{
            "choices":[
                "Hailey plays some more with Zach",
                "The girls decide to go dance again"
            ],
            "content":"<div class=\"\"><div> <span>Hailey grinned at the tiny people milling about on the bar.<br>\r\n<br>\r\n\"I've always been interested with these little people.\" She said as she observed them. None of the tinies really paid her much attention.<br>\r\n<br>\r\n\"Come Haliey, let's go dance.\" Amy said seeing the look in her friend's eyes. <br>\r\n<br>\r\n\"A little teasing never hurt anyone.\" Hailey said with a sly grin.<br>\r\n<br>\r\n\"That's the way to think girl!\" Emma giggled.<br>\r\n<br>\r\n\"Don't encourage her Emma.\" Amy said.<br>\r\n<br>\r\n\"Oh quit being such a drag Amy. Like you've never fucked with these little ones before.\" Jess said rolling her eyes.<br>\r\n<br>\r\n\"They just came to have a good time. Not be manhandled by a giantess!\" Amy replied. Hailey leaned over, bringing her pretty blue eyes closed to the tinies.<br>\r\n<br>\r\nSome of the people now noticed the massive face of the giantess, her blonde hair cascading down around them. A few were slightly scared as she grinned revealing massive pearly white teeth.<br>\r\n<br>\r\n\"Hi little ones!\" Hailey said, her alcohol tainted breath washing over the tinies. The people were now afraid of the beautiful giantess and some covered their ears.<br>\r\n<br>\r\n\"I'm not gonna hurt you little ones.\" Hailey said grinning as she scanned the tinies. She spotted a clean cut man wearing a button up checkered pink shirt and jeans. He was pretty cute for a tiny she thought. Hailey slowly reached for him.<br>\r\n<br>\r\nThe people screamed and scattered as Hailey's huge tan fingers with white nail polish closed in. The man tired to run but Hailey plucked him up easily. She raised him up off the bar as she stood up and smiled at him.<br>\r\n<br>\r\n\"Hailey! Put him down!\" Amy said.<br>\r\n<br>\r\n\"Chill out Amy. She's not gonna like, kill him or anything.\" Emma huffed. <br>\r\n<br>\r\n\"Yeah Hailey's a good girl.\" Jess giggled as she swiped several tinies off the bar.<br>\r\n<br>\r\nHailey brought the little man to her face and grinned. \"Hi little guy. My names Hailey.\" <br>\r\n<br>\r\n\"Come on. Let's go get a table in the back.\" Jess said as Emma swiped several more terrified tinies off the bar.<br>\r\n<br>\r\n\"Fine.\" Amy muttered, defeated.<br>\r\n<br>\r\nThe 4 girls walked to the back, their barefeet slapping the floor as they quickly got a table.<br>\r\n<br>\r\nThe girls say down at the and Jess and Emma dumped the tinies on to the table.<br>\r\n<br>\r\n\"So little guy what's your name?\" Hailey said as she held him in her upturned palm. \"Wait, I can't hear you.\" <br>\r\n<br>\r\nHailey brought the little guy up to her ear.<br>\r\n<br>\r\n\"ZACH!\" The man yelled. He was absolutely terrified.<br>\r\n<br>\r\n\"Well Zach, it's your lucky day. I think we'll have a lot of fun me and you.\" Hailey said smiling. <br>\r\n<br>\r\n\"Take off your clothes.\" Hailey said as she picked up her drink in her free hand and took a sip. Zach remained still.<br>\r\n<br>\r\n\"Take off your clothes now or I'll drop you in my drink. Hope you can swim.\" Hailey said grinning down at him.<br>\r\n<br>\r\n\"Haha tell him who's boss Hailey!\" Emma giggled as she prodded a little woman.<br>\r\n<br>\r\nZach quickly obeyed and stripped down to his boxers.<br>\r\n<br>\r\n\"All of your clothes little man. Boxers too.\" Hailey giggled. <br>\r\n<br>\r\nZach hesitated. The girl was stunningly gorgeous. Her richly tan skin, flowing blonde hair, beautiful blue eyes, she was way out of his league but she was also the size of a skyscraper. <br>\r\n<br>\r\n\"Come on little man. A beautiful girl tells you to get naked and you get all shy? Am I not pretty enough?\" Hailey said with a pout. <br>\r\n<br>\r\nZach could feel his dick hardening. He slowly pulled off his boxers and kicked them aside as he felt his member become erect.<br>\r\n<br>\r\n\"There we go little man. Now let's have some fun.\"<br>\r\n<br>\r\nJess and Emma were currently amusing themselves with the tinies they had swiped off the bar. Even Amy was giggling as she chased a tiny man around with her finger. The night was still young and the friends were just starting.</span></div></div>",
            "created":1474702620,
            "id":2213943,
            "title":"Hailey decides they should have some fun with t..."
        },
        "12413221":{
            "choices":[
                "Zach wants a tour of Hailey's body",
                "Zach wants Hailey to put him down"
            ],
            "content":"<div class=\"\"><div> <span>Hailey lifted Zach up closer to her eye so she could take him in. It was then that she noticed his raging hard on and a girlish giggle escaped her lips. It was like cannon fire for Zach.<br>\r\n<br>\r\n\"Oh my god! He has a little hard on! Are you that excited to see me little guy?\" Hailey teased, putting emphasis on the word \"little\" as her friends laughed. Zach turned bright red and covered himself. <br>\r\n<br>\r\n\"Don't be embarrassed little guy. I think it's adorable!\" Hailey thundered.<br>\r\n<br>\r\n\"He likes you!\" Emma teased as she dangled a little woman in front of her face who was screaming.<br>\r\n<br>\r\n\"You're so cute I could just eat you up!\" Hailey said plucking him from her palm and tilting her head back, opening her mouth wide and dangling  him over.<br>\r\n<br>\r\n\"AHHHHHHHH!\" Hailey said lowering him as he screamed. <br>\r\n<br>\r\nThe girls all roared with laughter as Hailey laughed and chomped her teeth lowering and raising him over her mouth.<br>\r\n<br>\r\nHailey brought him down and closed her mouth and dangled him in front of her face. <br>\r\n<br>\r\n\"Relax little guy, I won't eat ya.\" She said before Jess said, \"But I will!\" and reached for him.<br>\r\n<br>\r\nJess and Hailey laughed as they playfully fought for Zach before Jess finally gave up.<br>\r\n<br>\r\nHailey grinned down at Zach who was now in her upturned palm. <br>\r\n<br>\r\nShe looked over at her friends. Jess had a tiny man pinned beneath her finger and another she was dangling in front of her face while licking her lips. Emma and Amy had several tinies trapped between them and were taunting them. Hailey then looked down at Zach.<br>\r\n<br>\r\n\"So little man, what do you want to do with me? I'll let you do anything.\" Hailey said grinning.</span></div></div>",
            "created":1475183820,
            "id":2216632,
            "title":"Hailey plays some more with Zach"
        },
        "1242":{
            "choices":[
                "The giantess toys with the cab",
                "Hailey begins to dance closer to the cab",
                "Sam has second thoughts about this"
            ],
            "content":"<div class=\"\"><div> <span>Sam had never seen a woman as beautiful as the giantess. Her legs were long and sexy, tan and toned and he watched her perfect ass as she walked back out to the dance floor to resume dancing with her friends. Her huge feet slapped the ground carrying her away as Sam watched them with awe.<br>\r\n<br>\r\n\"Actually driver, follow that girl.\" Sam said.<br>\r\n<br>\r\n\"What? Are you crazy? There's no way I'm going out there buddy.\" The cabbie replied.<br>\r\n<br>\r\n\"Here's 20, now take me to her.\" Sam said pulling the money from his wallet.<br>\r\n<br>\r\n\"No way pal. There's too many giants out there, besides, what as you gonna do anyway? She's a skyscraper!\" <br>\r\n<br>\r\n\"30.\" Sam said, \"and don't worry what I'm going to do.\" He watched the massive tan feet of the giantess pound the ground as she danced.<br>\r\n<br>\r\n\"Still no.\" The cabbie replied watching as the giantess stomped around as she danced.<br>\r\n<br>\r\n\"Well I'm not paying you then. You refused to take to me to my destination.\" Sam said opening the door.<br>\r\n<br>\r\n\"What?! You can't do that!\" The cabbie said.<br>\r\n<br>\r\n\"Watch me.\" Sam replied as he began to exit the cab. <br>\r\n<br>\r\n\"Fine. I'll take you. Just don't get squashed Romeo.\" The cabbie replied.<br>\r\n<br>\r\nSam smiled as he got back in.<br>\r\n<br>\r\n\"So about that 30.\" The cabbie said.<br>\r\n<br>\r\n\"You refused that offer so it's no longer an option.\" Sam said smirking.<br>\r\n<br>\r\nThe cabbie huffed. \"Alright, I'll take you.\"<br>\r\n<br>\r\nSam watched as the cab began to enter the dance floor, his eyes locked on the massive tan titan dancing away.<br>\r\n<br>\r\nThe cab swerved left and right as the cabbie had to avoid the feet of the Giants and giantesses. Barefeet, heels, pumps, wedges, sandals, boots, flip flops, sneakers all crashed down around them. Sam looked out the window often to follow the huge legs up to the Titans dancing above. The cab was constantly shaking from the dancing feet of the giant people. <br>\r\n<br>\r\nSam saw they were getting closer to the giantess from the seats. He watched as she was currently dancing with a few other girls, probably her friends, their massive barefeet slamming down on to the dance floor as they danced and laughed.<br>\r\n<br>\r\nAs they drove, a giantess who was dancing noticed the tiny cab as she had just so happened to look down at it. She wondered why it was on the dance floor but grinned mischievously down at it. She was currently barefoot and deciding on if she would toy with the tiny cab, dancing was getting a little boring anyhow.  She watched as it zipped along swerving around another girls barefoot.</span></div></div>",
            "created":1472515500,
            "id":2203492,
            "title":"Sam wants to go over by Hailey on the dance floor"
        },
        "13":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "The bar",
                "The seats",
                "Switch to the girl at the bar"
            ],
            "content":"<div class=\"\"><div> <span>  Alana stood in the doorway of The Velvet Snail and with a guilty start looked down at her feet to see where the nearest little ones were. There was a miniature taxi rank about a foot from her left shoe. A few centimeter tall people seemed to be staring at her cork soled wedge sandal. Looking down while you walked was a necessary pain in New Olympus if you didn't want to become an accidental murderer. It was why most normal sized people lived in their own towns and those that did live here went to other bigger nightspots. She looked at a tiny person smaller than one of her toes and shuddered as she imagined scraping them off her shoe. Well, no harm done, but she'd have to be careful in here, particularly if she carried on drinking as she had. <br>\r\n<br>\r\n  Satisfied that she hadn't killed anyone she looked up and surveyed the room. She'd found this place last week and had been looking forward to coming back. The Snail was a tiny place which had a cosier atmosphere than most pubs she frequented. A man and woman danced on the small wooden dancefloor in front of the tiny square set aside for tinies to dance on. To the left was a bar and to the right, a seating area in an alcove off the main room. The music (some sort of pop rock) was pretty quiet to protect the delicate eardrums of the little patrons, but that made it easier to socialise. <br>\r\n<br>\r\nThe place was about as busy as it ever was. About a dozen normal people; the dancers, a group of girls, a couple and a few others. (Not many men, she noticed.) There was one woman she remembered from last week; possibly even taller than her, with long jet black hair and piercing green eyes wearing a white skirt, black halterneck top and flat gladiator sandals which twined around her calves. She'd missed talking to her properly last time and would have to make amends. She was at the bar. And of course there were the dozens of tiny people scurrying, dancing and driving about which made this place's reputation.<br>\r\n<br>\r\n  While Alana surveyed the bar, some of the other drinkers surveyed her; she was tall, five foot ten with long wavy red hair framing an attractive oval face and blue eyes. Her figure hugging black dress highlighted rather than concealed a trim athletic body leading down to feminine but, frankly, big feet - size nines- enclosed in black leather strappy sandals with cork wedge soles. The guy dancing actually stopped briefly and blatantly checked her out, to the annoyance of his dance partner.<br>\r\n<br>\r\nAlana was oblivious though and headed for...</span></div></div>",
            "created":1363064400,
            "id":1548502,
            "title":"Alana (giantess)"
        },
        "133":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "She sees someone across the room",
                "She plays with the little people on the bar"
            ],
            "content":"<div class=\"\"><div> <span>Finchenza was paying for her Bacardi and Coke and chatting to Beth the barmaid, her head nodding in time to \"Mr. Ironic\" by Print Beating. Her gaze dropped to the miniature bar near her elbow and the little people picking themselves up after dodging the glass as Beth slammed it down. She'd been a regular at The Snail for years and was well used to the tiny people. They were quite good fun when you got to know them and she had always been careful not to squash any. (Actually she had stepped on a few over the years when she was very drunk but hadn't noticed!)<br>\r\n<br>\r\n  Most of the little people were just drinking and talking amongst themselves, while as always a few newcomers stared up in awe at her and a few others were staring up at her breasts. She always found that sort of funny. She paid for her drink. Beth chatted away. She was leaving to move to a new town and job and this was her last night.<br>\r\n<br>\r\n  \"Be sad to see you go,\" Finchenza said and then raised her glass, \"Good luck though. What are you drink.... Are you drinking?\"<br>\r\n<br>\r\n  \"Hell yes. I'm gone after today, so who cares? Are you b...\"<br>\r\n<br>\r\n   \"What are you drinking?\"<br>\r\n<br>\r\n   \"Vodka and coke, thanks!\"<br>\r\n<br>\r\n  Finchenza forked out the cash. What now?</span></div></div>",
            "created":1363064400,
            "id":1549065,
            "title":"Finchenza"
        },
        "1332":{
            "author_id":"technotaz",
            "author_name":"technotaz",
            "choices":[
                "Pov little people in her breast",
                "Pov in her panties front",
                "Pov in her panties back"
            ],
            "content":"<div class=\"\"><div> <span>As soon as Fincezna got her drink she thought it would be fun to play with some of the little people. When she picks up her drink she discreetly swipes a few of the people from the mini bar into her cleavage. Fincezna finishes her drink and heads for the dance floor with the tiny people stuck between her olympian, to them, sized tits.  As she starts to dance the people get tossed around inside her clothing. Some stay on her chest but others get stuck lower on her body.</span></div></div>",
            "created":1368334800,
            "id":1588356,
            "title":"She plays with the little people on the bar"
        },
        "14":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Gordon heads inside",
                "Stay with the girls"
            ],
            "content":"<div class=\"\"><div> <span>   Gordon looked at The Velvet Snail. It was a small place with relatively quiet music audible from the pavement. Sounded like Funk Croissant by Pear Cafe. Not bad. Not good. Sort of average really. It was okay; he wasn't here for the music anyway. As long as they didn't play Fuck On Fire by The Dukes of Hazard he'd be fine. No, Gordon was here to experience little people!<br>\r\n<br>\r\n  He was born and raised in Hodborough, a small town in the big country with no little people. All his life he'd<br>\r\n<br>\r\n a) been truly desperately bored and wanted to leave and<br>\r\n<br>\r\n b) heard stories of the tiny people they shared the planet with. Perfect little replicas of normal people a centimeter tall. In his childhood he'd imagined they lived in the dark corners of his house and behind the skirting boards. He'd put up with complaints from his friends when his days out searching for them ended in disappointment. <br>\r\n<br>\r\n  Finally, he'd managed to escape his boring home town and given a choice of jobs he'd picked the one in New Olympus so that he could finally meet the people who had eluded him. So far he'd been amazed by the sight of the bug sized people and their tiny cars scooting around on the floor and the toy-like sections of town but disappointed too. Nobody seemed to care. There had been no interaction between sizes at all and it was all more than a little dispiriting. After a day out exploring, he'd gone out drinking, and that's when he'd heard about The Velvet Snail. It was perfect! The crowd he'd been talking to had turned up their collective noses and headed off to some huge dance place across town, but Gordon would not be budged. There was only one place <i>he</i> wanted to be!<br>\r\n<br>\r\n On the ground, a group of tiny girls watched the arrival of the giant. He was tall; six foot two to him, but over a thousand feet tall to them, with shoulder length dark wavy hair, wearing a bright yellow Calculator Crab t-shirt, cut off denim shorts and leather  sandals. The ground trembled as he went in.</span></div></div>",
            "created":1364965200,
            "id":1564299,
            "title":"Gordon Arrives!"
        },
        "142":{
            "choices":[
                "The girls decide to move someplace else to meet up",
                "The girls decide to go dance",
                "A giantess approaches the booth"
            ],
            "content":"<div class=\"\"><div> <span>The tiny girls watched the giant man enter in awe.<br>\r\n<br>\r\n\"Damn he's huge.\" Michelle, a short (5'2), cute redhead said.<br>\r\n<br>\r\n\"Yeah he is. That's way to much man for me though.\" Kristy, who was a 5'9 brunette said.<br>\r\n<br>\r\n\"Who cares,\" giggled Sara, a 5'6 blonde who was bubbly and was the stereotypical dumb blonde along with big tits and a nice ass. \"We're here for regular guys.\"<br>\r\n<br>\r\n\"You know how big that cock of his is?\" said Amy, a 5'6 brunette who was on the heavier side of the scale and wasn't exactly a looker but she had a built in sex drive.<br>\r\n<br>\r\n\"Do you ever think about anything?\" said Kelly, rolling her eyes. She was a 5'7 blonde who had toned legs and an athletic build and a bit of a more serious demeanor.<br>\r\n<br>\r\n(All the girls are wearing heels so they are several inches taller than their given heights.)<br>\r\n<br>\r\n\"Chill out Kells. I'm just saying that cock of his is probably like a tower compared to us.<br>\r\n<br>\r\n\"Whatever.\" <br>\r\n<br>\r\nThe girls entered the club and took a cab over to the seats.<br>\r\n<br>\r\nUpon exiting the cab and while talking amongst themselves a group of 3 men approached them. <br>\r\n<br>\r\n\"Well hello there ladies.\" Said the first guy, a tall, thin, blonde haired man. \"Names Brett and these are my friends Tom and Jax.\" Tim had brown hair and was fairly muscular and Jax was a blonde hair man who was well built and had a friendly smile.<br>\r\n<br>\r\nAll 3 guys had their eyes on Sara, who was wearing a revealing dress and killer heels. They had surrounded her and we're all talking at once to the giggly blonde.<br>\r\n<br>\r\n\"Great. Another night of every man in the room drooling over blondie.\" Kristy muttered.<br>\r\n<br>\r\n\"I don't understand how she doesn't realize why men are so nice to her.\" Michelle added.<br>\r\n<br>\r\n\"Who cares. Who wants drinks? I'll buy the first round since little miss sunshine is gonna be getting free drinks all night. Again.\" Kelly said.<br>\r\n<br>\r\nAs Kelly took the girls drink orders, she was about to head out when Sara and the 3 men walked over.<br>\r\n<br>\r\n\"Guess what?\" Sara began, \"These great guys have 2 more friends on the way here. Right now!\"<br>\r\n<br>\r\n\"Yeah we were just telling your friend Sara here, you know there's 5 of us, 5 of you,\" Jax said.<br>\r\n<br>\r\n\"We'd love to hang with you!\" Amy blurt out surprising everyone.<br>\r\n<br>\r\n\"Awesome! We were gonna order drinks? What are you girls all drinking?\" Tim said smiling.<br>\r\n<br>\r\nThe girls face their drink orders and the men and Sara departed for the bar.<br>\r\n<br>\r\n\"It's kind of a bad idea to stay right here. We're right in front of a both for those giant people.\" Kelly said.<br>\r\n<br>\r\n\"You worry to much Kelly, besides, I don't see any giants coming this way.\" Amy said.<br>\r\n<br>\r\n\"Yeah chill out Kells, we're all getting laid tonight!\" Michelle laughed.<br>\r\n<br>\r\nKelly had to laugh as well and the girls talked as they waited for Sara and their new friends to return.</span></div></div>",
            "created":1485406920,
            "id":2269282,
            "title":"Stay with the girls"
        },
        "15":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Mika (Small)",
                "Lisa (Giant)",
                "Luke (Giant)",
                "Michael (Small)",
                "Melissa (Giant/Small)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1417755600,
            "id":1898224,
            "title":"other people"
        },
        "151":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "The Case of the Vanished heiress",
                "The Case of the Club of Death",
                "The Vistimicas Affair"
            ],
            "content":"<div class=\"\"><div> <span>It was a dark and humid night. There were no stormclouds around.<br>\r\n<br>\r\n  Mika Stone stepped out of the cab and tipped the driver with insults as she adjusted her fedora. It was too hot for the trenchcoat, but she was a dick and had an image to maintain.<br>\r\n<br>\r\n Yes, Mika Stone was a dick. A private dick. \"You are the son of a motherfucker!\" The muffled sounds of the Pixies floated on the night air as the striking private eye surveyed the scene. <br>\r\n<br>\r\n  The Velvet Snail had a rep and that made it Mika's kind of dive, but people were missing and the parents of one of those poor shlubs had hired Mika Stone and from where Mika Stone was standing that development meant trouble like a taxi cab driven by the bastard lovechild of the angry guy from Mad Max 2 and a vole on crack, and as Mika turned and gave the finger to the departing cabbie she knew that was a storm she'd already wethered.<br>\r\n<br>\r\n  This town was dangerous. Hell, this town <i>was</i> danger, but Mika Stone ate danger for a light mid-morning snack between extreme dangers. The sidewalk was packed with people. People her height swarming to the Snail like every Friday, Saturday, Sunday, Monday, Tuesday and Thursday.*<br>\r\n<br>\r\nRelax. Mika used her senses. First smell, that most overlooked of senses.<br>\r\n<br>\r\nYuk. Sod it, sight. The bar towered like a mountain and as she stood there a giant couple approached the giant entrance, people running to get clear as huge boots and shoes shook the ground.<br>\r\n<br>\r\nShe hated to even think it, but the game was afoot.<br>\r\n<br>\r\n*Wednesday was folk night</span></div></div>",
            "created":1481785800,
            "id":2250191,
            "title":"Mika Stone, P.I."
        },
        "154":{
            "choices":[
                "Michael and his friends go to the bar",
                "Michael and his friends decide to dance",
                "A giantess comes across them"
            ],
            "content":"<div class=\"\"><div> <span>Michael had just arrived at the Velvet Snail. He quickly headed inside and hailed a cab. He was on his way to meet up with his friends who had came to the club a little earlier. Instructing the driver where to go, he was soon off. <br>\r\n<br>\r\nThe cab weaved its way through the massive club, speeding along as the legs and feet of towering giants and giantesses were all around. <br>\r\n<br>\r\nHe soon arrived by his friends who near a corner of the spacious dance floor. Hopping out of the cab and paying his fare, Michael greeted his friends.</span></div></div>",
            "created":1481757420,
            "id":2249970,
            "title":"Michael (Small)"
        },
        "1542":{
            "choices":[
                "Caylie and Blake continue dancing, trapping Michael and his friends",
                "Another giant interrupts the dancing couple",
                "Michael and his friends manage to escape the dance floor"
            ],
            "content":"<div class=\"\"><div> <span>Michael and his friends Tom and Peter were meeting up with some girls that Tom had met a few days back. When Michael had arrived the three girls had just shown up. The 3 friends greeted the three girls whose names were Daisy, Melissa and Elizabeth. The 6 immediately hit it off and decided they should dance. <br>\r\n<br>\r\n\"Come on, let's dance on the big dance floor.\" <br>\r\n<br>\r\n\"Daisy are you crazy?! Dance on the dance floor with the giants?! We'll get crushed!\" Melissa said.<br>\r\n<br>\r\n\"Not of we just stay over in this area. Look. There's no Giants over here.\" Peter said smiling.<br>\r\n<br>\r\n\"Yeah! Plus the tiny dance floor is like, way over there.\" Daisy said.<br>\r\n<br>\r\n\"I don't see why not. Come on let's dance!\" Michael said as the group of friends all moved out on to the giant dance floor.<br>\r\n<br>\r\nCaylie was a giant, well, to the tinies at the Velvet snail she was at by some measure even in New Olympus.<br>\r\nStanding 5'10 to her fellow giants, she was a massive 962.5 feet tall to the tinies scurrying around at her feet.  Caylie was coming to the Velvet Snail on a date with a guy she had been on a few dates with before. She was feeling and looking good. She had on a nice royal blue dress that came down to her mid thigh and was tight in all the right places along with some black ankle chunky heel booties with a zipper on the sides. She had tan skin, brown eyes and light dirty blonde hair color. She was a pretty girl with an athletic, toned body. She was meeting the guy, Blake, at the Velvet snail. Blake was a few inches taller than her at 6'2 (1017.5ft) although with her booties on she was almost the same height. He was well built and had brown hair.<br>\r\n<br>\r\nHer and Blake had met up and talked for a bit sipping their drinks before they began dancing the night away, drinking and laughing while they did so. As they danced Caylie decided she wanted to take off her booties. As she sat at a booth and unzipped the booties and pulled her tan feet out, her toes well pedicured with pink nail polish which matched her manicured fingers,<br>\r\n<br>\r\n\"Sorry but my feet are killing me.\" <br>\r\n<br>\r\n\"Hey it's alright Caylie, I mean you're not the only barefoot girl I see.\" Blake joked.<br>\r\n<br>\r\n\"Yeah well if you step on my toes while I'm barefoot, you're going home alone mister.\" Caylie teased.<br>\r\n<br>\r\n\"Well what if I step on your toes with my toes?\" <br>\r\n<br>\r\n\"Oh so you're going barefoot now too?\" Caylie smirked as she stood up.<br>\r\n<br>\r\n\"Sure why not. We can go dance in the corner over there where there's no one dancing.\" Blake said pulling off his socks and shoes.<br>\r\n<br>\r\nCaylie and Blake made their way over to the empty corner.<br>\r\n<br>\r\nMichael and his friends and the girls were having so much fun. He was dancing with Daisy, a cure brunette when the floor started shaking more than normal. <br>\r\n<br>\r\n\"Uh guys.\" Tom said who was with Melissa.<br>\r\n<br>\r\nThey all turned to see two massive people coming towards them, a man and a woman, both barefoot approaching rapidly. The giant and giantess were upon them in no time and that's when it hit them. <br>\r\n<br>\r\nTo Caylie and Blake, their feet were far below them and the smell was far from their noses. To the six people at their feet, the smell of feet was overpowering.<br>\r\n<br>\r\nThe giant's feet were musty and vinegary underlying the sweaty smell and re giantess's feet were musky and cheesy underlying the sweaty smell. The foot funk of the giant couple was overpowering to the 6 and they began to cough and gag as the ground shook as the giant couple danced.</span></div></div>",
            "created":1481759760,
            "id":2249987,
            "title":"Michael and his friends decide to dance"
        },
        "15421":{
            "choices":[
                "Michael makes it off the dance floor",
                "A shadow falls over Michael"
            ],
            "content":"<div class=\"\"><div> <span>Caylie and Blake were dancing away, their feet slamming against the dance floor as they danced enjoying each other and themselves. It was a much different story for the tinies below who were dodging the massive stomping feet of the giant couple. No matter where the Michael and his friends ran, they couldn't escape the dance floor with the massive sweaty feet cutting them off. They were trapped.<br>\r\n<br>\r\nThe feet of the giantess and giant smelled sweaty and were a bit dirty on the soles from dancing barefoot. The giant's feet were larger and had a strong sour smell while the giantess's had a cheesy, musky smell. The giantess's feet were tan and her pedicured toes had a pink nail polish. As the colossal soles of the giantess and giant passed over heard, the tinies could see dirt mashed to the massive soles and the soles were reddened. Each time one of the feet of giant couple slammed down, the floor shook like an earthquake and Michael and friends would lose their balance.<br>\r\n<br>\r\nMichael watched as Tom began to run, in almost slow motion, the giantess's massive tan foot lifted up and the massive dropped as the giantess moved her foot to the beat. The gargantuan foot landed squarely on Tom, the heel of the giantess now where Tom had once been running. Seeing this, a man may of them had just been talking to, being crushed beneath the sweaty, smelly foot of a dancing giantess, caused the girls to scream and Peter and Michael to stare in shock at what they had just witnessed. <br>\r\n<br>\r\n\"We have to get out of here! I'm not getting crushed by some giant bitch!\" Peter screamed. \"Oh my god! Oh my god! She killed him!\" Melissa screamed. \"Let's move!\" Michael yelled as the giant couples feet rocked the dance floor as they slammed down. Melissa however, was rooted in place. She was screaming nonsense and crying. \"Melissa! Run!\" Elizabeth yelled. Melissa was suddenly cast in a shadow. She looked up and didn't even have time to scream as the massive sweaty foot of the giant crushed her into the floor.<br>\r\n<br>\r\n\"MELISSA!\" Screamed Daisy. Elizabeth had now taken off running while Peter and Michael tried to pull Daisy back. She was in tears and couldn't even comprehend what ha just happened to her friend. The giant's godly foot twisted and lifted off, slamming down farther away. \"Shit, where'd Elizabeth go?\" Michael said. He turned and saw Elizabeth running for her life. <br>\r\n<br>\r\nElizabeth turned around and saw the foot of the giantess arcing overhead. \"Oh my god! Please don't! I'm down her-\" The stinky tan foot of the giantess slammed down on Elizabeth as the giantess was now stomping her feet to the new song that was playing. They saw the giantess was now dancing closer to the giant and his huge feet were now dangerously close to the group. <br>\r\n<br>\r\n\"We are gonna die!\" Daisy cried. \"No we're not!\" Michael yelled. Daisy suddenly began to run away. Michael went to follow her but Peter grabbed his arm. \"Forget her! She's crazy!\" \"Are you serious Pete? We can't just leave her.\" <br>\r\n<br>\r\n\"Yes we can.\" Peter said. The two men began to run the opposite direction. Daisy ran as fast as she could. She was close to the giant feet of the couple and could smell their sweaty foot funk as it wafted from their massive feet. The massive foot of the giantess slammed down it front of Daisy knocking her off her feet and blocking her path. She turned to run the opposite way but didn't get very far. Without warning, the smelly foot of the giant slammed down on her, smashing her without any resistance.<br>\r\n<br>\r\nMichael and Peter were running as fast as they could, their legs pumping as they ran for the edge of the dance floor. It was still a bit away when suddenly the huge foot of the giant man slammed down in front of them with a loud slam. They were knocked off their feet and immediately smelled the sour sweaty scent of the giant's foot. They quickly stood back up and began to run around the foot. The giant shifted his foot which caused Michael to run one way and Peter to run the other. <br>\r\n<br>\r\nPeter was running as quick as he could, his legs and lungs burning. He didn't think when he came to the Velvet Snail he'd end up running for his life while trying to dodge the feet of some giant dude and his giantess girl. Peter turned to look over at Michael who had run the opposite way. Peter saw Michael running and the giant's smelly foot and then turned his head a little further and saw the giant's other foot farther off. He looked around even more as he ran and noted he only saw one of the giantess's gargantuan tan feet. As he wondered where her other foot could be, he came to a horrible realization as he noticed the ground around get darker. He stopped in his tracks and looked up. Directly over him was a sky of reddened sweaty flesh, dirt and grime stuck to the colossal sole from the titaness dancing barefoot. Peter opened his mouth to scream as the last thing he saw was the sole of the giantess, just as the giantess's foot crushed him into nothing. <br>\r\n<br>\r\nMichael continued running as fast as he could. He had no idea if Peter was still alive but as he saw the giantess slam her foot down in the area Peter had been running, he knew the answer. He snuck a look up at the giant couple. He couldn't make out their faces or much of their upper bodies but he could see the the toned tan legs of the giantess and the hairy legs of the giant going up to his shorts that came down to his knees. These people had just killed his friends and had no clue what they had done. They were just enjoying themselves.</span></div></div>",
            "created":1485901500,
            "id":2271763,
            "title":"A dancing giant couple is hard to avoid"
        }
    },
    "info":{
        "author_id":"benway69",
        "author_name":"Benway69",
        "brief_description":"Adventures in a night club with giants and giantesses over 900ft tall. ",
        "created":1362961140,
        "description":"<td align=\"left\" class=\"norm\">A story co-written with my girlfriend, Anna Philactik (real name). Comments and additions very welcome. <br>\r\n<br>\r\nThis story takes place in a world where giants 165 times bigger than a normal person exist alongside them. Mostly they live apart but in some cities they live together. New Olympus is such a town.<br>\r\n<br>\r\nThe Velvet Snail is the only night club which allows big and small people entry.<br>\r\nWomen outnumber the men but there are a few there.<br>\r\n<br>\r\nShoe sizes are British (men's are the same; add 2.5 to get the US women's size)<br>\r\n<br>\r\nGiants and little people coexist peacefully but anything can happen after a few drinks. Stay in character though.<br>\r\n<br>\r\nAs long as it's well written anything goes including sex and extreme violence except for:<br>\r\n<br>\r\nNo gay sex or men crushing men please (personal preference)<br>\r\nNo Ugg boots allowed<br>\r\nkeep stiletto heels to a minimum</td>",
        "id":1923390,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1485901500,
        "modified":1485901500,
        "pretty_title":"Big Night Out"
    }
}