{
    "chapters":{
        "1":{
            "author_id":"allyboy1351997",
            "author_name":"Alistair",
            "choices":[
                "She decides she is going to dispose of you, but how?",
                "She decides to try the slave idea. ",
                "She decides you’ll be a nice gift for Sarah",
                "Your father comes home early, how will she hide you",
                "You manage to escape while she’s gloating "
            ],
            "content":"<div class=\"\"><div> <span>You wake up lying face down on a wrinkled, tan surface. The last thing you remember was Andrea ranting at you about how unfair it was that you were going to get all of your dads money and she and Sarah would get nothing. You remember telling her smugly that there was nothing she could do to get any of that money and then her smirking, saying “oh I wouldn’t be too sure about that”, and then you passed out.<br>\r\n<br>\r\n“What happened? Where the hell am I?” You groaned as you got up to look ahead of you before the landscape shifted, knocking you back down to your knees. You decided it was better to take in your surroundings from a kneeling position, in case of another tremor like that.<br>\r\nThe surface you are standing on is warm, tan and wrinkled, with large crevices large enough for you to fit your body in dotted around it’s surface. Off in the distance you can see four tremendously tall towers reaching up to the heavens, with a fifth slightly shorter one off to your right. Where were you, what happened, and where did Andrea go?<br>\r\n<br>\r\n“As entertaining as watching you so confused is, I’m going to cut it short, turn around,” an unbelievably loud voice booms out from behind you. It sounds familiar despite being many decibels higher than you remember it. <br>\r\nYou stand up and turn around in confusion and fear to see the face of your stepmother, sporting the same smug grin you’ve learned to despise, only now it takes up your entire field of vision. Somehow she has become enormous, and you realise you are standing on her hand. But as you look around and see various pieces of furniture you recognise, now blown up to massive proportions, you realise that it is you who has changed size, now tiny in the hands of your spiteful stepmother.<br>\r\n“Confused?,” her smug smirk stretched out into a satisfied, victorious smile, ”I’d be surprised if you weren’t, this certainly must be a BIG change in perspective for you. I’ll explain, that money you think you are entitled to just because you’re dad says you are, it’s mine. It’s been mine since the moment I married him, you can probably guess how much it hurt to have so many plans of what to do once I finally get my hands on that money, only for it to be snatched away by some brat who wouldn’t know the first thing to do with it. So I decided to take matters into my own hands, I’ve been saving this particular solution for a while,” as she holds up an empty spray bottle, “I have a friend in an experimental pharmaceutical company who I “convinced” to give this to me a while back. It’s a permanent shrinking solution, and I do mean permanent, you won’t be getting back to your normal size. I’d guess there probably is a way to reverse it, but I didn’t care to ask, it’s not like I’ll need it for you,” she says nonchalantly and shrugs her shoulders as you sink to your knees in despair. How could she do this to you, you knew that you two hadn’t seen eye to eye most of the time but this was too much.<br>\r\n“Please change me back, get in contact with your friend, please. I’ll give you half of the money, I’ll do anything!” You pleaded, which only caused her grin to grow further.<br>\r\n“I couldn’t hear a word you just said. I’m guessing you’re asking me to help you get back to your normal size and offering to do anything for me to do it. Well that’s too bad, with you at this size I already get what I want. I get all your dads money and just as importantly I get to punish you for being such a little shit all these years. I had actually considered using it on your dad at one point, but I’m glad I didn’t because then I would have gotten nothing. Plus, this way is more fun,” she seems to delight in the fear she is clearly causing you, “all I need to do to make this plan work is make sure this little disappearing act is good enough that no one ever finds you,” her face suddenly turned serious, still smirking but with a more sinister expression. <br>\r\n“I suppose the easier way would be to just dispose of you here and now, it would be so easy after all,” as she says this she licks her lips. “All it would take was for me to pop you in my mouth and swallow and you’d be on a one-way trip to my belly, never to be seen again.” As she says this she traces a finger down her long, slender neck, past her generous bosom and down to her stomach, which she pats with her hand. <br>\r\n“Buuut... I think that would be too easy, I want to get some enjoyment out of you before I kill you, and hey if you impress me I might decide not to kill you at all. I could always use a shrunken slave. I’d just have to find a way of keeping you hidden from your dad, can’t have him finding you or this whole plan goes out the window”.<br>\r\n<br>\r\nWhat does she decide to do with you?<br>\r\n</span></div></div>",
            "created":1587604860,
            "id":2822897,
            "title":"A Rude Awakening"
        },
        "11":{
            "author_id":"allyboy1351997",
            "author_name":"Alistair",
            "choices":[
                "Swallowed by Andrea",
                "Deposited in her running shoe",
                "Shoved up her ass",
                "Unaware Sarah",
                "Writer’s choice"
            ],
            "content":"<div class=\"\"><div> <span>“You know what, on second thought I think I will just get rid of you here and now. It would be far more effort to hide you from your father than I’m willing to spend on a worthless speck like you,” she smirked and started to tap her finger on her chin while pouting, feigning that she was thinking when it was obvious she already had made up her mind. “The question is, how do I get rid of you? I’d prefer it to be painful and humiliating. Any ideas? Feel free to speak up”<br>\r\nYou felt anger welling up at how she was talking to you, but also fear at how casually she was talking about murdering you.<br>\r\n“Hmmm, no ideas?” She pretended to frown at your silence. “Probably just as well, you’re so teeny tiny that I probably wouldn’t be able to hear your suggestions anyway. So I guess I’ll just have to make this choice myself.”<br>\r\nAs she continued to think, you looked around her palm for any opportunities to try and get away, but you didn’t see any, you were just too high up. Any attempts at escape from here would just lead to you falling to your death, you’d have to wait for her to make a move first.<br>\r\n“As I said earlier, I could just eat you. Although I feel like that’s maybe a bit too quick, plus I wouldn’t actually be able to see you die. I’d maybe be persuaded to do that one if you promised to squirm in my belly so I could feel you in there,” the sadistic smile that spread across her lips as she said this really showed her hatred for you. What had you done to make you hate her so much? “I could also just toss you in one of my shoes before I go on my daily jog, that could be funny. Or maybe I could get a bit of pleasure out of it and shove you up my ass, would you like that?”<br>\r\nYou were sure there was nothing you wanted less than to be shoved up the ass of your sadistic stepmother, but you didn’t exactly have a choice in the matter. She waited a few moments before finally saying, “Yeah I think I’ll...<br>\r\n<br>\r\n1) ... eat you.” She lifts her hand to her mouth and tilts it, dropping you into her mouth<br>\r\n2) ... drop you in my shoe.” She carries you over to her running shoes before dropping you into one of them.<br>\r\n3) ... shove you up my ass.” Drops you into the back of her pants and uses her finger to push you deeper.<br>\r\n4) ... use Sarah to kill you somehow.” She carries you to Sarah’s room.<br>\r\n5) Writers Choice</span></div></div>",
            "created":1599846660,
            "id":2901214,
            "title":"Andrea decides to kill you "
        },
        "111":{
            "author_id":"allyboy1351997",
            "author_name":"Alistair",
            "choices":[
                "Trying to hide under her tongue",
                "Leap of faith",
                "Swallowed"
            ],
            "content":"<div class=\"\"><div> <span>She shrugged her shoulders.<br>\r\n“I’m not really feeling like putting thought in this, you’re not worth the effort. I think I’ll just swallow you and get it over with. Maybe I won’t get the satisfaction of seeing you die, but knowing you’ll die as nothing more than a snack for me will be consolation enough I think,” Andrea almost seemed bored with threatening you. “The thing is I couldn’t even really see the fear on your face if I smushed you under my big heels because you’re just too small for my liking, I think next time I’ll see if my friend can get me a dose that will make whoever I choose to shrink just a little bit bigger, because let me tell you, I’ll definitely do this again. It’s so fun to watch a tiny little man squirm like this. I think we might have awoken something in me here.” <br>\r\nThe way she talked so casually about murdering more people than just you, and also smiling about it, made your skin crawl at how evil this woman was.<br>\r\n“Hmmm, maybe once they declare you missing and your dear old dad changes the will so that I get his money I’ll shrink him down as well,” she mused, pouting her lip and placing a finger on her chin before shaking her head. “I’m getting ahead of myself, I’ll just dispose of you now and then I’ll have a little brainstorm of the possibilities later.” With that she pinched you between two fingers and hoisted you up above her head, tilting her head back and opening her mouth. <br>\r\nAs you were dangling, legs kicking in fear above her cavernous maw in fear, you began to scream. Your scream was apparently loud enough to reach Andrea’s ears, as moments later she let out a small chuckle, which caused the back of her throat to undulate below you. Her tongue stretched out of her mouth, almost like she was rolling out the red carpet for your one way trip to her stomach. She let you hang above her mouth for a few moments until, seemingly bored with taunting you with the sight of it, she let you go.<br>\r\n<br>\r\nYour fall was short, slapping loudly, to you, onto her slimy, writhing tongue. As her tongue retracted back into her mouth, like a monster retreating into its cave with you as its prize, you got what looked like it would be your last glimpse of the outside world before Andrea closed her mouth, confining you to darkness. The atmosphere in her mouth was slimy and oppressively warm. Her probing tongue pushed you around her mouth, trying to get a taste of you. You tried to let out a scream but all that you achieved was getting a mouthful of Andrea’s saliva, which caused you to cough and splutter.<br>\r\nAfter a few moments of savouring your taste she let out a moan,<br>\r\n“Mmmm, who would have known a little speck like you would have made the perfect little snack,” you had to cover your ears in pain as her voice was unbelievably loud from inside her mouth. “Anyway, I’ve got the rest of my day to get on with, and to figure out how to pretend to be worried that you’re missing. Make sure you squirm around in my stomach so I can feel it!”<br>\r\nAs she tilts her head back to swallow, what happens?<br>\r\n<br>\r\n1) You manage to roll under her tongue, are you small enough for her to not notice you are there?<br>\r\n2) As she is speaking you take a run and dive headfirst out of her mouth. Where do you end up? And does she notice you escape?<br>\r\n3) Nothing, you can’t move fast enough and are swallowed.</span></div></div>",
            "created":1601113740,
            "id":2910194,
            "title":"Andrea’s Mouth "
        },
        "1113":{
            "author_id":"allyboy1351997",
            "author_name":"Alistair",
            "choices":[
                "Call for help",
                "Make her ill",
                "No escape"
            ],
            "content":"<div class=\"\"><div> <span>As you feel the incline of the surface on her tongue begin to increase as she tilts her head back, you look around for any way out of this situation. Panic sets in as you don’t see any obvious way out of this situation so you simply begin to scramble up the increasingly steep slope of her tongue, trying to put as much distance between you and the back of her throat as possible. Between the increasing slope and the slippery nature of the inside of her mouth, you make very little progress and a giggle from Andrea as she feels your pathetic attempts to delay the inevitable is all it takes for your shaky footing to become unstable as her mouth vibrates slightly from the noise. You lose your grip and begin to slide down her tongue towards that dark abyss at the back of her mouth, screaming all the way.<br>\r\nYou hit the back of her throat and Andrea swallows, sending both you and the built up saliva in her mouth down her throat.<br>\r\nYou feel the constricting tube of her throat begin to squeeze and push you down, it wasn’t hard enough for it to be painful, but the constant pressure was uncomfortable and any time you tried to take a breath you got a mouthful of saliva, causing you to gag and cough. You felt like you were going to drown in saliva before you got anywhere near her stomach, but you were proven wrong just as the edges of your vision started to darken, as you feel your legs suddenly enter a larger chamber. With one more push from the oesophagus around you you suddenly start to free fall into the cavernous chamber of Andrea’s stomach. <br>\r\nLuckily for you, you landed on a pile of undigested food and didn’t take the plunge into the sea of acid that you could see surrounding your small island of sanctuary. From your perspective your small island of food was maybe only 50 feet across, in reality it wasn’t even ten inches across. It is humid and blisteringly hot inside of the stomach of your stepmom, and you feel the damp atmosphere begin to cling to your clothes, as well as yourself beginning to sweat profusely.<br>\r\nOne of the walls of the cavernous stomach shuddered, causing the sea around you to form waves as Andrea patted her stomach. As these waves lap at your shelter you scramble backwards in a panic, desperately trying to not be caught in their wake. The areas of the food that the acidic wave retreats from on top of, back into the pool surrounding you, begin to hiss and sizzle as the acids begin to break it down. Suddenly you hear her voice, seemingly rumbling from all around you.<br>\r\n“Well Scott, I guess you were about as useful as a meal as you were as a stepson. You’re just too small, not very filling and you didn’t really taste of anything either. Even in the last thing you do on this Earth you were useless. Oh well, hopefully the next person I do this to will be big enough for me to at least get some pleasure out of them. Goodbye Scott,” her speech gave you a sense of purpose, you had to find a way out of here before it was too late. You couldn’t let her do this to anyone else, but as you look out over the sea of acid that surrounds your small sanctuary, you find it difficult to figure out exactly how you would get out of here. Your eyes had adjusted to the darkness in Andrea’s stomach, but even then it is difficult to see anything. You sit down on the island of food, the edges of which are currently sizzling as the acid is eating away at it. You won’t have very long before your safe haven is dissolved and sinking into the acid below.<br>\r\n<br>\r\n1) You remember you still have your cell phone in your pocket, hopefully you’ll still have signal.<br>\r\n2) You find a way of making Andrea feel ill, hopefully you’ll be able to get her to throw up.<br>\r\n3) You can’t figure out anything, you just have to accept your fate.</span></div></div>",
            "created":1601512860,
            "id":2913222,
            "title":"A snack for your stepmom"
        },
        "12":{
            "author_id":"allyboy1351997",
            "author_name":"Alistair",
            "choices":[
                "Massaging her feet",
                "Shoe cleaner",
                "Becoming her tiny oral hygienist ",
                "Massaging her monumental ass",
                "Writer’s choice"
            ],
            "content":"<div class=\"\"><div> <span>Andrea’s moon sized face smirked down at you, relishing the fact that she literally held your life in her hands.<br>\r\n“Well little Scott, I always told you that you’d amount to nothing. I figured this way your stature matches how I’ve always viewed you, less than dirt,” you sighed internally, too scared about your current situation to roll your eyes like you normally would when she’d get all high and mighty with you, she always did go out of her way to belittle you. Although you never expected that she would be able to find a way to literally make you smaller. <br>\r\n“But I’m feeling generous so I’ll give you the chance to have your life amount to something more than just a little snack for me. As I said earlier there’s an opening for the position of my shrunken slave and I’m thinking you’d be a perfect fit for that job. I mean your dad gave my daughter a job so it only seems fitting that I’d give you one. I think I’ll take you to my bedroom for your try outs though, wouldn’t want anyone to disturb us.” <br>\r\nYour surroundings shifted as she closed her fingers in a fist around you, your surroundings suddenly becoming incredibly claustrophobic. As she walked to her bedroom her arm started to lightly swing back and forth, jostling you around in the cramped confines between her fingers. The slight swing of her arm as she walked made you nauseous, like the worst amusement park ride you’ve ever been on.<br>\r\n<br>\r\nAndrea finally reached her and your father’s bedroom and uncaringly tossed you onto the bed, your rough landing being broken by the pillowy soft sheets. You turned back and saw the monolithic form of Andrea, appearing even larger from this vantage point at her waist height. She stared down at you with an amused grin, although you could see the distain she held for you in her eyes still.<br>\r\n“Wait right there, wouldn’t want to lose you in the sheets while I make sure we’ve got some privacy,” she ordered you before sauntering off towards the door with an extra sway in her step, your situation seemingly giving her a confidence boost she definitely didn’t need. All thoughts of trying to escape quickly left your mind when you saw her cross the room, which would likely have taken you well over an hour, in a few steps. Her steps shook the area around you, even standing up high on her bed. The tremors faded, as she approached the door and locked it, but the volume of their impacts did not lessen. You took the time that she was gone to quickly survey the room around you. The familiar sight of your parents bedroom now looking more like a landscape bigger than the neighbourhood you were used to walking around from your vantage point on the king size bed, stretching out in every direction for huge distances. You could easily get lost in the wrinkled surface of the sheets, the maid obviously having not made the bed yet. Off in the distance you could see Andrea’s massive walk in closet, the door unfathomably large to you, even at this distance. The other furniture seemed larger than even the tallest buildings you’d ever seen.<br>\r\nThe resonant booms of your stepmother’s footsteps grew in intensity, signalling her approach back to your location.<br>\r\n“Good, looks like you can follow orders from your superiors. One of the main traits I looks for in my shrunken slaves,” she stood, looking smugly down at you, with her hands on her hips. “So for your first try out we’ll see how you can handle...<br>\r\n<br>\r\n1) ... giving me a foot massage.” She Props up her monolithic feet, now bare, in front of you.<br>\r\n2) ... shoe cleaning duty.” She dumps you into her heels, which she has just taken off.<br>\r\n3) ... cleaning my teeth, I’ve got something stuck near the back. Try not to fall down my throat.” She deposits you on her tongue.<br>\r\n4) ... giving my big butt a massage.” She lies down and deposits you on her backside, after stripping from the waist down.<br>\r\n5) ... No those ideas won’t do, let me think.” She stood and tapped her finger on her chin. (Writers Choice)</span></div></div>",
            "created":1599142620,
            "id":2896716,
            "title":"Andrea’s slave try-outs"
        },
        "124":{
            "author_id":"fearboy",
            "author_name":"chaos",
            "choices":[
                "She notices and is pissed",
                "She notices and is amused",
                "She doesn't notice"
            ],
            "content":"<div class=\"\"><div> <span>You nearly let out a yelp in surprise as your stepmother starts peeling off her pants, realizing her long legs and her skimpy, tight panties. Your first instinct is to look away, attempting to give the giantess some privacy. A second later you realize how fucking stupid that is. You’ve been shrunken down, turned into this sadistic woman’s slave and she had just decided you were literally going to start serving her ass. Andrea didn’t care whether you saw her undress or not, Hell, she probably got a kick out of it. That thought was confirmed a second later as her snide, booming voice called down at you.<br>\r\n<br>\r\n“What’s wrong, slave? Am I too much for you?” She laughs at you, delighting in how uncomfortable you are as she sways her wide hips back and forth. You decide to try and stick up for yourself and look directly at her, showing you aren’t a complete coward. Andrea just responds by removing her panties, exposing her shaved pussy to you without a shred of shame. You avert your eyes, face going red and the laughter returns. Andrea seems to really relish how much her body affects you, any kind of power she has over your puny existence excites the evil woman it seems.<br>\r\n<br>\r\n“Poor, pathetic bug. I know you’re not used to seeing this much woman, but you better get used to it. As my slave you’ll serve every inch of me, from my feet to my hair to my wet and very warm…” Andrea trailed over, running her fingers along the mounds of her sex as she let out a loud moan. You aren’t sure, but you think she might genuinely be getting aroused by all this, seeing you like this, so beaten down and humiliated seemed to be her thing. Not for the first time you wonder why she hates you so much.<br>\r\n<br>\r\nAndrea moves onto the bed, the massive floor of cloth shifting underneath you, sending you tumbling back. She moves onto her stomach, lazily reaching for you as she gets comfortable. You hold her breath as the giant fingers come towards you, each ten times your size and probably twenty times your strength. You don’t run as she scoops you up, carrying you above her round, bare bottom. You stare down at it, momentarily mesmerized by the giant hills of slightly pale flesh. You’re not going to lie; it looks incredible as each cheek is seemingly perfect with no sag or blemish on its perfect curve. A big bubble butt that you’ve often seen moving away from you as Andrea leaves a room. It’s sexy, but also absolutely terrifying. Each cheek is as big as a house to you. If Andrea tried to sit on you that big booty would be the last thing you ever saw. The idea of rubbing it, worshiping it made you sick. You had to do this for the cruel woman that stole your life, it was a nightmare that you would give anything you escape. But there was no escape other than your own death.<br>\r\n<br>\r\nThe hand tilts and you fall, its sudden and you find yourself plummeting towards the right cheek. You hit the warm, soft cheek hard, bouncing off it a few feet before settling on it as it ripples from your body making contact. Andrea makes a sound, you’re not sure if it’s in enjoyment of you landing on her big ass or just the thought of her puny stepson trapped on her booty. You lay there on the uneven bun, sinking slightly in, trying to wrap your head around how your entire body is currently purchased a top your stepmom’s butt. As you remain still, a cold, commanding voice calls out to you.  <br>\r\n<br>\r\n“I don’t feel any rubbing. Is someone being a bad little slave because if that’s the case we can try seeing if you’re better at rubbing my asshole,” Andrea says with sadistic excitement. Not needing any more motivation, you start rubbing, pressing your entire arms into the supple flesh, and starting to move them in circular motions. Even though your so small, your movements cause the cheek to wobble slightly and the flesh to respond. Andrea must have one tender backside because after a few minutes of massaging she lets out a little moan.<br>\r\n<br>\r\n“Harder, rub your entire body into it.” Apparently your still not good enough. As gross as it feels, and this does feel gross, you throw yourself into the smooth backside, grinding your entire body into the massive glute as you try to be the best slave possible to avoid death. You feel the flesh jiggling like crazy as you pretty much start trying to hug the butt cheek with your whole body, rubbing yourself into it while ignoring the fact that it belongs to someone you absolutely hate. It seems to work a bit too well because all this grinding starts to affect your body. To your shame, you start getting an erection from rubbing into the flesh for so long. You try to calm down but it's hard when you’re also focusing on humping a giant hot milfs ass. You just pray Andrea doesn’t feel it. <br>\r\n</span></div></div>",
            "created":1601070780,
            "id":2909901,
            "title":"First Duty"
        },
        "1242":{
            "author_id":"allyboy1351997",
            "author_name":"Alistair",
            "choices":[
                "Andrea makes good on her threat",
                "A different punishment",
                "You impress Andrea"
            ],
            "content":"<div class=\"\"><div> <span>“Oh what’s this,” Andrea turned her head to look over her shoulder at you and you felt yourself shrinking under her gaze, embarrassed. You began to wish that you could sink down further into the divot your body’s weight was pressing into her ass cheek to avoid giving her the satisfaction of belittling you like this. “Is someone getting all hot and bothered over his stepmom’s big juicy ass? I mean I can’t blame you, it’s certainly a better ass than you’d ever be able to get at your normal size so you might as well enjoy it, but I don’t want you getting too distracted, I still expect you to put your back into rubbing by ass. I know it’s hard for you to focus since you’re such a disappointment most of the time but I can’t have my slave getting too distracted.”<br>\r\nShe finished her little speech with a joking finger wag, as if she was lecturing you on the importance of doing homework on time or something like that, before chuckling and looking at you expectantly. After a few seconds of you, still embarrassed, not getting back to work, Andrea says, “Did you not hear my alternative to rubbing my ass cheek earlier? If you don’t put your back into it right this second you’re getting buried between my buns and you’ll be rubbing my asshole, is that what you want? Maybe it is, being such a little perv. If that is the case and you do actually want a close up inspection of my cute little pucker the by all means, stop rubbing.” <br>\r\nThat was all it took to get you rubbing her colossal right cheek, wondering how much of this she’s actually feeling through all the layers of fat on her ass. She was probably doing it more for the satisfaction of reducing you to this.<br>\r\n“Aw and here I was hoping you’d want to go spelunking,” she feigned a disappointed pouty face, before her smile returned. “Although I suppose I don’t need to make these sort of bargains with my property so if I was to guess I’d say you’ll be getting more aquatinted with my ass soon enough.”<br>\r\nTo emphasise her point she began to raise her backside up and wiggle her ass in the air. The ground beneath you began to shift around, between her shaking her hips and the jiggling it caused her ass to do it became incredibly difficult to keep steady. You felt the undulating cheeks begin to carry you closer to her crack, and you had to scramble away to avoid slipping down into that dark abyss. Your struggles seemed to amuse Andrea, who let out a chuckle.<br>\r\n“Yes I think you’re on track to becoming my permanent ass slave, but enough with the playing around, get back to work and we’ll see how I’m feeling after you finish,” with that Andrea turned away from you and lowered herself back down onto the bed, and began flipping through a magazine, seemingly leaving you alone for now. With that you decide to put your back into it and try your best to get on her good side, maybe if you did you could avoid getting up close and personal with her asshole.<br>\r\nHow do you do?<br>\r\n<br>\r\n1) Poorly, Andrea decides to make good on her threat and shove you up her ass.<br>\r\n2) Poorly, Andrea decides on a different punishment.<br>\r\n3) You do a good job, Andrea moves on to the next try out.</span></div></div>",
            "created":1601128860,
            "id":2910305,
            "title":"Humiliated by Andrea "
        },
        "125":{
            "author_id":"telly123",
            "author_name":"Palegug",
            "choices":[
                "Tits",
                "Clit",
                "Pussy"
            ],
            "content":"<div class=\"\"><div> <span>Andrea grins as she looks down at you after a moments pause. \"You know, I've caught you ogling my body more than once, you little perv, since you like looking at it, maybe I should give you a more in depth view.\" Winking at you slightly playfully, you stepmother gets up to her knees and slowly starts stripping off her clothes, teasing you and waving her hips dangerously close to your new body. \"Mmm, fuck, I'll make you into my sex slave, you'll give me the pleasure you're shitty father can't.\" Wiggling out of her pants and shirt, she starts rubbing her tits and pussy, moaning softly, causing a slight damp spot to appear in her panties. \"I need it now, toy~\" Andrea purrs, tossing off her bra and damp panties, grabbing you swiftly and placing you on her...</span></div></div>",
            "created":1599188460,
            "id":2897072,
            "title":"Writer’s choice"
        },
        "14":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Her Bra Cup",
                "Her Panties",
                "Her Mouth",
                "Her Purse",
                "Underneath A Cup"
            ],
            "content":"<div class=\"\"><div> <span>Trying to shout for help from the evil woman who controlled your fate, she simply let a loud laugh emerge from deep within, poking your tiny body in the chest and knocking you over so that your back was against her warm palm. Her giant face soon began to creep over you, blocking out any light that you were getting from above, instead being replaced by the gorgeous features of Andrea, only amplified by the size disparity between the two of you.<br>\r\n<br>\r\n\"I don't think you understood when I said I couldn't hear you. This isn't a two way conversation, this is me telling you what to do, and you listening. If you can't get that in your teeny little head, then I think I might need to dispose of you before we can have any fun.\" The titanic woman said, before opening her lips and playfully biting her teeth together, in order to intimidate you. The tactic worked quite well, as you sat back in submission, fearful of what the giantess could do with you at this size. <br>\r\n<br>\r\nAs she opened her mouth to speak to you once more, she was suddenly interrupted before she could even start her next monologue, as the front door began to unlock. \"Shit! Your father must be home earlier than expected, I need to hide you!\" She said, quickly looking around her surroundings to see if she could find a good spot. That was when she decided upon</span></div></div>",
            "created":1588114980,
            "id":2826455,
            "title":"Stashed For Later"
        }
    },
    "info":{
        "author_id":"allyboy1351997",
        "author_name":"Alistair",
        "brief_description":"Your father has left you his fortune, your stepmom decides to shrink you so she gets it",
        "created":1587604560,
        "description":"<td align=\"left\" class=\"norm\"><b>Introduction</b><br>\r\n<br>\r\nYour name is Scott, you are the son of a wealthy businessman named Howard who’s job keeps him away from home a lot, leaving you alone with your stepmom, Andrea, and her daughter, Sarah. <br>\r\nAndrea, quite frankly, hates you and has always sided with Sarah over you in every argument you two have ever had, which is a lot.<br>\r\nOne day you are shocked to see that your father has written a will leaving his entire estate to you in the event of his death. Your stepmom, very unhappy with the decision, decides to take matters into her own hands and make you “disappear”...<br>\r\n<br>\r\n<b>The cast</b><br>\r\n<br>\r\nYou (Scott)- 18 years old. Mostly unremarkable, you are average build and height of 5’6” (for now). Slightly pale skin, shaggy brown hair, not amazing or terrible at school and you don’t play any sports. Your only remarkable trait is that you are the son of a very wealthy man.<br>\r\n<br>\r\nHoward- 54 years old. Your father is a businessman who is away from home more often than not, this has lead to your relationship with him being very distant, which is why his decision to leave everything to you in the event of his death came as a surprise to you. The story takes place just after he has made his announcement and then left on a business trip.<br>\r\n<br>\r\nAndrea- 41 years old. Your stepmom, she married your father after your mother died when you were 10, you always assumed it was for your fathers wealth because she is an absolute knockout, drop dead gorgeous and full figured with long blonde hair. She has massive curves in all the right places. She is also very domineering both in personality and in physical stature, towering over you at a height of 6’2” without heels, which she most often wears to make everyone around her feel even smaller than her. She also seems to have the ability to turn everyone against you around the house, often convincing your father to punish you for things your step sister had clearly done and blamed on you.<br>\r\n<br>\r\nSarah- 22 years old. Your stepsister, who has never grown out of the spoiled brat phase despite being 4 years older than you, she knows exactly how to manipulate people around her to get what she wants. You are convinced she learned this from Andrea, who only seems to encourage this behaviour from her. <br>\r\nShe seems to have inherited her mothers hair colour and looks, although she is not as physically imposing and lacks the monumental curves of her mother, at 5’8” she is still taller than you, a fact that she loves to lord over you with, often calling you demeaning names like “shrimp”.<br>\r\nSarah has just graduated from university, all paid for by your father of course, and is set to start a high earning job at your fathers company.<br>\r\n<br>\r\n<b>Rules</b><br>\r\n<br>\r\nNo one sentence chapters, and use proper grammar and punctuation <br>\r\n<br>\r\nNo male giants, Howard can feature but don’t have him interact with Scott in any way <br>\r\n<br>\r\nScott can die, he is more durable than someone his size would be expected to be but he can still be crushed with enough force. If you do include a chapter that will lead to one that involves Scott dying give the option to avoid it so the story can continue <br>\r\n<br>\r\nDon’t add a long chain of choice chapters, I don’t mind a few, but don’t let them get longer than 2 or 3 chapters in a chain.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2219877,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601512860,
        "modified":1601512860,
        "pretty_title":"Stepmother’s Greed"
    }
}