{
    "chapters":{
        "1":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "Nothing happens",
                "something happens"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Jim. Your are 14 and its your first day at high school. The only problem is that your parents have enrolled you for a giantess school that allows human boys because it was cheap. Your on your way to first period. you walk into the classroom. Its filled with giant desks and chairs. You see a desk that has a tiny ladder going up to it. You climb the ladder and find normal desks with kids your size. you introduce your self but no one seems interested. The first bell rings and giant girls start spilling in. The class begins But does it go well??</span></div></div>",
            "created":1339477200,
            "id":1358617,
            "title":"New school"
        },
        "11":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "Lunch",
                "Gym"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Everything goes fine and you head to next period.</span></div></span></div>",
            "created":1339563600,
            "id":1358628,
            "title":"Nothing happens"
        },
        "111":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "Making food",
                "Cleaning the toilets",
                "helping the school nurse"
            ],
            "content":"<div class=\"\"><div> <span>'Lunch second that's great' You think. But just as you head out the door a boy stops you there. \" hold on slow down where do you think your going'. \"Lunch\" you reply. \"oh no your not' he says. \" every human has to do a job at lunch\". \"now lets see what you've got\" he says checking a list. </span></div></div>",
            "created":1339563600,
            "id":1358635,
            "title":"Lunch"
        },
        "1111":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "Making sandwiches",
                "Serving drinks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\" you get to work in the kitchens\" he says. You reluctantly make your way to the cafeteria. They give you the job of.</span></div></span></div>",
            "created":1339563600,
            "id":1358640,
            "title":"Making food"
        },
        "11111":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "She takes a bite",
                "You fall out"
            ],
            "content":"<div class=\"\"><div> <span>You make your way to the bench. You grab the giant bread and filings. you make about three. but the last one you've got your arm stuck in. One of the giantess's working in the kitchen takes the plate away. you try to scream for help but she doesn't hear you. One of the giantess students grabs the sandwich for her lunch.She walks to a table with her friends and starts chatting away. she pick up the sandwich with you hanging from it.  </span></div></div>",
            "created":1339563600,
            "id":1358650,
            "title":"Making sandwiches"
        },
        "111111":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "yes, she spits you",
                "No, She swallows"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she takes a bite with you in it. you land in her mouth. it it dark and damp. you finally rip your arm out of the sandwich just before she bites it off. But did she notice you?</span></div></span></div>",
            "created":1339563600,
            "id":1358652,
            "title":"She takes a bite"
        },
        "1111111":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"Same here! I guess we'll be able to hang out together for a bit longer.\"",
                "\"I've got math next... Sorry, I guess this is where we split up for now.\""
            ],
            "content":"<div class=\"\"><div> <span>As the giant girl was about to take another bite of her sandwich, she felt something squirming around inside her mouth. Without hesitation, she set down her sandwich and put her hand in front of her face as she spat you out. As you landed on the girl's massive palm, coated in saliva and panting for air, you breathed a sigh of relief that you hadn't been swallowed just now. As you slowly regained your composure, you nervously looked up at the giantess who held your tiny body in the palm of her hand. She was a beautiful young blonde who you quickly recognized as the girl who was sitting behind you in class earlier. As you gazed up at her huge face in awe, she simply smiled at you and began to speak.<br>\r\n<br>\r\n\"Hey little guy, what were you doing in there? Last I checked, human sandwiches weren't on the menu.\" She said with a light giggle.<br>\r\n<br>\r\n\"Ummm, sorry about that... I was just trying to make the sandwiches as well as I could, but they were so big and I ended up getting my arm stuck...\" You said nervously.<br>\r\n<br>\r\n\"Oh, don't worry about it! It's not like you did anything wrong, little guy! If anyone should be apologizing, it should be me for not paying more attention to exactly what I was eating...\"<br>\r\n<br>\r\n\"Well, no harm done. It's not like you actually wanted to eat me or something... Right?\"<br>\r\n<br>\r\n\"Of course not! My friends and I are always nice to you little humans. We'd never intentionally hurt one of you, right girls?\"<br>\r\n<br>\r\nAll of the girls who were sitting at the table nodded their heads in agreement, and you breathed a sigh of relief.<br>\r\n<br>\r\n\"So little guy, what's your name? I doubt you really want me to just keep calling you 'little guy' all the time.\"<br>\r\n<br>\r\n\"My name is Jim. And you are?\"<br>\r\n<br>\r\n\"Oh, sorry! I totally forgot to introduce myself! My name is Alice.\"<br>\r\n<br>\r\n\"Well it's nice to meet you, Alice.\" You said with a smile.<br>\r\n<br>\r\n\"It's nice to meet you too, Jim. I hope we can be good friends.\"<br>\r\n<br>\r\n\"Really? You'd want to be friends with me?\"<br>\r\n<br>\r\n\"Yeah, why not? You seem like a nice guy.\"<br>\r\n<br>\r\n\"Thanks Alice... I don't know what to say...\"<br>\r\n<br>\r\n\"Well, I'm still kinda hungry, so I'm gonna have to put you down while I finish eating. Feel free to talk with my friends and get to know them while you wait.\"<br>\r\n<br>\r\nYou nodded your head, and Alice gently placed you down on the table. As she picked up her sandwich from its plate, her friends all introduced themselves to you. You spent the next few minutes just talking with each of them, getting to know them better. After a while, the bell rang and the girls all stood up to head off to class. Alice, having finished eating, reached down to pick you up again.<br>\r\n<br>\r\n\"So Jim, what class do you have next?\"<br>\r\n<br>\r\n\"I have gym next. What about you?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1340686800,
            "id":1367543,
            "title":"Your first giantess friends"
        },
        "1111112":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Your Pov",
                "Alice's Pov"
            ],
            "content":"<div class=\"\"><div> <span>With a loud gulp, you were sent down her throat and into her stomach. Swimming up to the surface, you see swim to chunk of mushed up food in the organ and climb on top of it. As food fell from the sphincter, you scream loudly for help, but, because of the noises around you and outside, you realize that it's pointless and  then try to pound on the stomach walls. An explosion of air outside throws you into the stomach muck, and after returning  to your pile of food mush, you clean yourself and wait for your chance.<br>\r\n<br>\r\nAlice was a freshmen of the school and was eating lunch with her friends. Her brunette hair reached the middle of her back, and had two tuffs of hair behind her ears sticking out like cat ears. Her black shirt with a skull on it, showed off her big breasts and pudgy midriff. Her jeans hugged her wide hips and an ass that spilled over her seat, though it didn't cover half of it. \"Urrp! Fuck, this food tastes good!\" Alice said as she tore into her sandwich again. \"I know right! But I think it`s better if bring your stuff, though. You don`t know what they put in it.\" Alice was listening, when a tiny squeak came out of her belly. Nobody but Alice knew about it and add in a weird tapping inside of her, Alice was about to investigate, when a deep belch emerged from her mouth.<br>\r\n<br>\r\nBlushing, Alice was about to apologise when the bell rang. Going to her locker, thoughts about what happened back there rushed through the teen's head. But as fart came out of her rump, Alice dismissed them and went to her class.</span></div></div>",
            "created":1474261200,
            "id":2212208,
            "title":"Down the hatch"
        },
        "11111121":{
            "author_id":"boicomstuff",
            "author_name":"Boicomstuff",
            "choices":[
                "You don't escape and you get digested",
                "You miraculously get rescued"
            ],
            "content":"<div class=\"\"><div> <span>You clung to a soggy piece of bread crust, floating in the fetid sea of digesting food that was Alice's stomach. Your panic had subsided, and while your current situation was miserable, you had an earnest hope that Alice would come to your rescue, and as soon as she came to her senses, she would get you out of her belly. With that in mind, you'd been conserving your strength, but making sure to pound on the walls every few minutes so she might notice you were down here.<br>\r\n<br>\r\nThe stomach was a volatile place. In addition to its own digestive contractions, every time Alice walked or stood up or sat down or turned a bit to quickly, your whole environment lurched nauseatingly, splashing food and bile everywhere. You were completely soaked in stinging, stinking acid at this point, and you'd been forced to strip off your clothes because they itched so much.<br>\r\n<br>\r\nThe rhythmic sloshing of Alice's waddle stopped, and the whole stomach heaved as she plopped down to sit. You decided this was a good time to make try and make your presence known again, and waded over to the stomach wall to start pounding. This time, though, you received a response. The stomach wall rebounded inward, sending you careening back into the lake of bile. The whole stomach reverberated from the force of the pat Alice had given to her gut.<br>\r\n<br>\r\nAs you started to pull yourself out of the murky swamp, you noticed the sphincter at the top of the stomach open and dump in a wave of liquid, presumably soda. More followed in short order. You couldn't believe Alice had failed to notice you. The more she drank, the harder it would be for you to stay alive in her stomach, and the harder it would be for her to get you out. An anxious knot tightened in your chest. Your churning, digestive doom grew closer by the minute and you were powerless to stop it.<br>\r\n<br>\r\nAlice's soda just kept on coming, and her stomach slowly filled with a torrent of soda, adding to the ocean of digesting food. You had to fight the churning madness to stay above the waterline, sometimes treading a mixture of stomach acid and soda, sometimes crawling up chewed mounds of food. <br>\r\n<br>\r\nThe gas rising from the digesting food collected near the top of the stomach, around where You were. Every minute or so, the stomach would contract violently as Alice belched. Each time she did, the breathable air got thinner for you. Your muscles burned from fatigue and lack of oxygen and your breaths were quick and laboured. You were starting to get tired. You couldn't do this forever.</span></div></div>",
            "created":1602543600,
            "id":2920048,
            "title":"Your Pov"
        },
        "111112":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Kathryn, a clumsy athlete with a big heart and an even bigger butt",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You fall out onto a chair, where _______ sits on you.</span></div></span></div>",
            "created":1492750800,
            "id":2308688,
            "title":"You fall out"
        },
        "1112":{
            "author_id":"vaji",
            "author_name":"Vaji",
            "choices":[
                "The Black Twerker.",
                "Lowriding Leakage.",
                "Skirt Squirt."
            ],
            "content":"<div class=\"\"><div> <span>The girl would look closely at the list, a devious grin forming on her face.<br>\r\n<br>\r\n\"Well, well, well... Looks like your job for today is to clean the women's toilets...\" she'd muffle a slight laugh behind the piece of paper as she'd continue. \"I hope you're a good scrubber, because we aren't exactly known for being clean and tidy\" With that, she'd give her bottom a light smack as she winked at you. She would then pick you up and walk over towards the women's restroom, as the door opened, you were met with a viciously foul stench, one that would make flies cringe, the girl would hold you with one hand, and firmly shut her nose with the other as she placed you on the tiled floor of the bathroom, smirking slightly.<br>\r\n<br>\r\n\"Remember, little guy. Clean every single square inch, or the principal might find something worse for you to do. And you'll better hurry up, it's almost lunchtime... And the girls here don't respond well to Taco Tuesdays.\" With that, she'd close the bathroom door, completely trapping you with the destructive stench which had only built up since this morning, a rather loud laugh echoing on the other side of the door as it slowly quieted down into complete silence.<br>\r\n<br>\r\nYou looked around anxiously, total silence surrounded you except for a faucet which wasn't entirely turned off, as your nose started to adapt to the wretched, disgusting stench of the waste and flatulence the women had created, including a few splotches of a brown, muddy substance covering parts of the tiled floor. The girls here were dirty, you knew this already. But after seeing this place, you got a entirely different picture of them.<br>\r\n<br>\r\nThis place was a hellhole, apart from the immediate stench that slowly gnawed at your nostrils, the big, splotches of shit and sweat coating the floor, random gum stuck on the wall, as well as wet pieces of paper stuck on the ceiling. \"How in the holy hell am I supposed to clean this mess?\" you asked yourself as your eyes darted all around the floor.<br>\r\n<br>\r\nBy the entrance, just beside the door, you spotted what seemed to be equipment suited for a person your size;<br>\r\na ladder, a long piece of string (which was basicly a rope to you), a sponge, a broom, as well as a few other things one might need while cleaning. You quickly walked towards it and picked up the items you felt was required for the job and walked towards one of the stalls. \"Guess it's better to get the toilets cleaned first...\" You thought to yourself, as those are probably what's most important anyway.<br>\r\n<br>\r\nWith your gear at hand, you walked towards one of the stalls, but once you closed up to the only stall where the door was opened, your heart sank deeper than it ever had before. Shit... was litterally everywhere inside, the walls, base of the toilet, and the part of the lid that you could see, all had splotches of shit coating them. \"T-this is a joke right?\" you asked yourself, \"The toilets were cleaned yesterday!\" After a while of yelling, you finally calmed down and shrugged, as you'd grab the ladder and climb onto the lid of the toilet. The stench of asses got even more intense as you reached the rim, as you finally couldn't help yourself and vomited onto the tiled floor below you, resting your head on the edge of the seat, breathing heavily. The back of the seat had layers upon layers of liquid shit on it, as well as the insides of the bowl itself being completely coated in a brown mass, with a lonely turd floating inside the swampy water.<br>\r\n<br>\r\nSwallowing your pride, as well as the leftover vomit that slowly crawled up your throat, you grabbed the sponge to get to work. You'd grab the rope as well, and tightly tying it around your waist, as well as tying the other end around a loose screw on the rim, for safety measures. You were just about to start your daily job when suddenly...<br>\r\n<br>\r\n<br>\r\nLoud voices and giggles would be heard approaching the bathroom door. as it soon swung open, and three girls entered. You remember them from the class photos you viewed when you first enrolled.<br>\r\n<br>\r\nTanya; a black woman who's a little pudgy, wearing a skinny, white tank top that were a few sizes too small, as her breasts stretched the fabric, almost as they'd explode out any minute, she didn't seem to be wearing a bra either. Your eyes darted downwards, towards her immensively huge hips, the kind that seemed to stretch on for miles, and tightly plastered onto her huge, bubbly cheeks, were a pair of spandex shorts, with the letters T and P printed on her cheeks. You quickly wondered what TP would stand for, as she dug her hand into the back of her shorts, scratching her butthole as well as pulling on the fabric simultaniously, thus revealing that the shorts actually spelled \"Twerk Champ\" and \"2015\" underneath.<br>\r\n<br>\r\nKimiko: a japanese exchange student who recently enrolled to this school, a few months ago. She quickly became popular because of her impressive body proportionates, she was wearing a black T-shirt, as well as a pair of incredibly low-riding jeans where half her butt poured out, the waistband hugging her hips tightly as the exposed butt bulged. She would also wear a pink G-string that reached out of her jeans and hid inside her cavernous buttcrack, almost impossible to see behind the vast ammount of butt flesh, just above her panties, she had the tatoo \"Warning, pipe leakage\". <br>\r\n<br>\r\nJamie: a caucasian, famous for her tremendous farts, she was wearing a buttoned shirt, where her chest strained against the buttons, almost ripping them off, on her bottom she would wear a micro-skirt, the kind that barely ended where her butt began, and as far as you could see, she wasn't wearing any underwear.<br>\r\n<br>\r\nThe girls would gather up infront of the sink, giggling and gossiping as they huddled up close together, the butts pointing towards you as they'd wiggle their hips.<br>\r\nSuddenly, Jamie would stand straight up as she yelled \"Oh gawd, not again!\" as she arched her back, her hands reaching behind her as she'd grab onto her buttcheeks and spread them wide, a loud gurgling would be heard from her rectum until she'd grunt, as a loud fart would erupt from her butt, followed by a light spraying of feces onto the floor. The other girls giggled in response.<br>\r\n<br>\r\n\"Damn Jamie, that ass is on fire today\" Tanya would exclaim as she leaned back to take a look at the mess Jamie's asshole made on the floor.<br>\r\n\"Mnh~ If only my ass could do that too!\" Kimiko replied, biting her lower lip as her hips swayed back and forth.<br>\r\n<br>\r\n\"Hngh...\" Jamie would breathe heavily \"It's the dinner I had last night, gave me the shits\" she'd groan as another fart escaped her rectum, this one going on for a couple of seconds. \"Can't wait for lunch though, the tacos are going to put my anus to the test\" they'd all giggle in response as Kimiko grabbed the waistband of her pants and pulled slightly, a small ammount of liquified crap pouring out of her crack as it drained down her pants. \"Uhngh~\" Kimiko would muffle a scream as her pants slid down further, her ass completely exposed as she'd let out a fart, she'd grab her cheeks in response, pulling them far apart before smashing her gellatinous glutes tightly together again, massaging them.<br>\r\n<br>\r\n\"Well, fuck, I haven't taken a shit since last week, though I took some strong laxatives this morning, gonna see if th--\" Tanya was suddenly interrupted by a loud, vicious gurgling in her belly, she groped it in response, cringing as she kneeled onto the floor, the noise making it's way towards her rectum as she clenched, releasing a loud, roaring fart that echoed throughout the room.<br>\r\n<br>\r\n\"Damn, I have to take a shit soo bad now\" Tanya yelled, rubbing her belly.<br>\r\nAnother fart would splurt out of Jamie and Kimiko's behind, as they sprayed their insides onto the floor. \"Fuck, so do I\" they both said.<br>\r\n<br>\r\n<br>\r\nYou just stood there, your jaw completely opened as you watched the three of them. \"Well, I'm not cleaning THAT up...\" You said, still a little shocked by the events presented. Suddenly, you noticed the three turn around, facing you, they'd look at each other viciously, before they'd dart towards your stall, apparently they all had to shit real bad.<br>\r\n<br>\r\nBut shit, you just realized that you were still on the toilet, \"Fuck, I have to get out of here, quick!\" you'd run towards the edge of the rim, looking down. It was way too high to jump down, and you'd never make it to the ladder in time. But before you could figure out a escape route, your vision turned black as someone stood in the opening.</span></div></div>",
            "created":1452747600,
            "id":2089135,
            "title":"Cleaning the toilets"
        },
        "11123":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "get's to lunch sat and farted on during lunch",
                "skip to end of day going home with Jamie"
            ],
            "content":"<div class=\"\"><div> <span>you were on the back of the rim on the toilet seat when you look up to see the upskirt view of Jamie's ass suddenly it rocketed down towards you like and elevator with snapped cables you tried to back up but were caught in the rear of her crack staring at her anus, suddenly you see it slowly open before a large brown log appear then fall beneath you a few more logs appeared and fell below you then you hear what sounds like a waterfall and you realise she's peeing then you see toilet paper enter and wipe her anus and vagina before it falls, you thought it was over, however when she rose you went with her, then you realised that you were stuck in the devil's ass, she then started to walk left then right as you were smushed between her ass cheeks.. </span></div></div>",
            "created":1592825340,
            "id":2854930,
            "title":"Devil's ass"
        },
        "1113":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "a girl comes in",
                "the nurse comes back",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>'Helping the nurse,mmm, interesting' he says. you are led to the nurses office.<br>\r\nshe looks young enough to be at this school.<br>\r\nshe picks you up and puts you on the desk. 'i have to step iut for a couple of hours can you watch the office for me?<br>\r\n'sure' you reply<br>\r\nshe leave with out another word, which you thought was quite rude.</span></div></div>",
            "created":1347426000,
            "id":1425871,
            "title":"helping the school nurse"
        },
        "11131":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "a stupid dare",
                "she has a stomach ach"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a girl walks in looking for the nurse. 'the nurse is out' . 'well maybe you could help me'.<br>\r\n what did she do?</span></div></span></div>",
            "created":1347426000,
            "id":1425872,
            "title":"a girl comes in"
        },
        "111311":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "you see the coin",
                "its in very deep"
            ],
            "content":"<div class=\"\"><div> <span>' my friends dared me to shove a coin as far as I could up my ass' she says embarresment.<br>\r\n'it went to far in to reach, could you get it out?'<br>\r\nyou want to say no but you feel sorry for her. 'fine i'll help' you sigh<br>\r\n' Thank you ! ' she says<br>\r\nshe pulls down ger jean just below her ass and props herself up on the desk.<br>\r\nshe gets both hands and spreads her cheeks. her pink puckered anus huge from your point of view an surprisingly doesnt smell that bad.<br>\r\nyou climb up to her anus and pull it open with your hands.</span></div></div>",
            "created":1347426000,
            "id":1425880,
            "title":"a stupid dare"
        },
        "1113111":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "take a bath then bed nothing happens",
                "take a bath then watch a movie she forgot where she put you "
            ],
            "content":"<div class=\"\"><div> <span>you see the coin and pull out the coin and throw it on the table then you yell up  \"it's out now you can leave\" just as yo are leaving her ass two walls close in as she released her ass cheeks and pulled up her thong so that it was in your face, then she said \"thank you I'll be leaving now\" then she left you don't know what is going on but after hours you see light and then a mirror and her face again as she pulled you out you guessed you were in her house she then said \"Oh no I guess you didn't make it out in time before I closed my ass however you are just to cute and I want to protect you she says you say \"hi I actually do want to say with you\" with that she jumped with joy and placed you on her bed then you look at how sexy she looks <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/33/5d/94/335d944d05fe07b16ae97b1f510faf08.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/originals/33/5d/94/335d944d05fe07b16ae97b1f...</a> then she asks how you like her new outfit that she changed in to earlier oh by the way my name is Melissa...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nMelissa would never hurt you on purpose she is kind, caring but a huge ditz <br>\r\n</span></div></div>",
            "created":1503118800,
            "id":2371499,
            "title":"you see the coin"
        },
        "11131112":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                " she lowers herself on the bed whilst still dancing and you end up in her crack",
                "she slips and the bed bounces you like a trampoline but Dallas caught you"
            ],
            "content":"<div class=\"\"><div> <span>she leaves you on the bed and goes to take a bath and then 2 hours later Mellissa walked in dry but naked and sat on her bed with your lower half under her pussy then she says \"now where did you go my little friend then she looks between her spread apart boobs and sees you and frees you then places you between her open breasts as she lays flat on her back then she says \"oh no I think I hear my mom, stay still\" she says as she closed her boobs together tightly then her mom enters <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/736x/cf/2e/cc/cf2ecc59b7545c29c8d5575ccc9a7667.jpg\" target=\"_blank\">https://i.pinimg.com/736x/cf/2e/cc/cf2ecc59b7545c29c8d5575ccc9a7667.jpg</a> and then sits down next to Mellissa and says \"honey you need to find a boyfriend befo-\" Mellissa cuts her mom off and releasing her breasts showing you and then Mellissa said \"mom this is my boyfriend an we are mad in love\" her mother looks at you and you nod in agreement and then she hugs you and said \" hello there my name is Charlotte I am Mellissa's mother and your future mother in law, so what's your name honey?\" \"my name is Jake it's nice to meet you\" you say before she says \" well Jake if it is ok with you I would like you to stay here if you will allow it\" you respond with a yes and then say \" ,y birth family mistreated me, so I would love to live here\" Charlotte then said \"well Jake me and Mellissa live alone in this big house, we have no pets and 6 maids because I am a CEO of a important company, I will call them in one at a time she says before shouting Barbie\" Barbie entered  \" Barbie this is Jake my daughter's boyfriend be nice to him\" then Barbie left and the five other maids all got the same speech there was<br>\r\n<br>\r\nBarbie<br>\r\n <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://ae01.alicdn.com/kf/HTB1tGRUJVXXXXcZXXXXq6xXFXXX8/-font-b-Hot-b-font-Sale-Sexy-Lace-font-b-French-b-font-font-b.jpg\" target=\"_blank\">https://ae01.alicdn.com/kf/HTB1tGRUJVXXXXcZXXXXq6xXFXXX8/-font-b-Hot-b-font-Sale...</a><br>\r\n<br>\r\nChelsea <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://www.amiclubwear.com/media/catalog/product/cache/1/image/9df78eab33525d08d6e5fb8d27136e95/c/o/costume-sexy-bbbb10-555140black_2.jpg\" target=\"_blank\">https://www.amiclubwear.com/media/catalog/product/cache/1/image/9df78eab33525d08...</a><br>\r\n<br>\r\nSarah <br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.dhresource.com/260x260s/f2-albu-g5-M01-9A-0B-rBVaI1kAaiKAR7nsAADJRt-TZAU420.jpg/wholesale-women-sexy-late-nite-french-maid.jpg\" target=\"_blank\">http://www.dhresource.com/260x260s/f2-albu-g5-M01-9A-0B-rBVaI1kAaiKAR7nsAADJRt-T...</a><br>\r\n<br>\r\nKathrine<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/originals/b0/23/db/b023dbc74816829af2a29f11bf675c14.jpg\" target=\"_blank\">https://i.pinimg.com/originals/b0/23/db/b023dbc74816829af2a29f11bf675c14.jpg</a><br>\r\n<br>\r\nElizabeth<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/originals/bc/58/06/bc5806e5d2842548f31b9cde7e6a5e69.jpg\" target=\"_blank\">https://i.pinimg.com/originals/bc/58/06/bc5806e5d2842548f31b9cde7e6a5e69.jpg</a><br>\r\n<br>\r\nDallas<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/originals/a2/26/15/a226155c7b07d831def9c871e74de52d.jpg\" target=\"_blank\">https://i.pinimg.com/originals/a2/26/15/a226155c7b07d831def9c871e74de52d.jpg</a><br>\r\n<br>\r\nafter introductions Charlotte told Dallas to stay and the other maids to go charlotte then told you \"Dallas will be your personal maid, she will sleep with you, make you food and keep you safe until you are of marriage age\" then Dallas took you to the guest room which is now your room and stripped down to bra and thong placed you on the king size bed and started twerking you see her ass then... </span></div></div>",
            "created":1504242000,
            "id":2378543,
            "title":"take a bath then watch a movie she forgot where..."
        },
        "111311121":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "bath with Dallas",
                "Sleep time sntics with Dallas"
            ],
            "content":"<div class=\"\"><div> <span>you see Dallas is wearing <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img.auctiva.com/imgdata/0/2/1/0/7/0/webimg/588876884_tp.jpg\" target=\"_blank\">http://img.auctiva.com/imgdata/0/2/1/0/7/0/webimg/588876884_tp.jpg</a> and you barely see it as it is wedged deep in her crack then she backs her ass over you giving you a lap dance the you see her anus peering out from the sides of her thong  then her ass gets closer and closer until her cheeks are either sides of you then she twerks which takes you with her then he asks how's the view then she sees your missing and finds you in her ass and takes you out then...</span></div></div>",
            "created":1504328400,
            "id":2378713,
            "title":" she lowers herself on the bed whilst still dan..."
        },
        "1113111212":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "she rolls and you get trapped untill morning",
                "Dallas is a bit horny forgeting about you"
            ],
            "content":"<div class=\"\"><div> <span>you get into bed naked Dallas is also naked then she sleeps on her back next to you then she puts the covers over the two of you, in the middle of the night Dallas wakes up seeing you are not on top of the covers she then checks and finds you then places you between her open breasts...</span></div></div>",
            "created":1504328400,
            "id":2378729,
            "title":"Sleep time antics with Dallas"
        },
        "11131112122":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "nothing bad happens",
                "Dallas mistakes you for an object later in the day"
            ],
            "content":"<div class=\"\"><div> <span>Dallas feeling a bit horny forgets about you between her breasts and slams her huge tits together crushing you then she releases them and you fall down her body looking at her as she opens and smashes her tits together so you decide to get help from Charlotte and find her outside your room then you say \"can i sleep with you, dallas forgo about me and I think she's a bit horny right now\" Charlotte then says \"oh I forgot to tell you Dallas is a huge airhead, yes you can sleep with me, lets go2 she says before she caries you to her room and bed then she places you on the other side of the bed and says goodnight in the morning, you wake up to see Charlotte smiling at you then you say \"good mor-\" you get cut off as a naked ass cheeks smashes into you, it was Dallas she said \"mistress, master Jake is missing\" Charlotte then says \" actually he slept in here last night and was laying where you are sitting Dallas then stood up with her ass to Charlotte then sees nothing there but feels something on her ass and removes you and apologizes then you forgive her...</span></div></div>",
            "created":1504328400,
            "id":2378733,
            "title":"Dallas is a bit horny forgeting about you"
        },
        "111311121222":{
            "author_id":"flamelord",
            "author_name":"Flame",
            "choices":[
                "Dildo",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Later that day you were standing walking down the hall and Dallas picked you up before saying \"I'v been looking for my ____ all day.\" As she took you to both your and her room.</span></div></span></div>",
            "created":1504328400,
            "id":2378863,
            "title":"Dallas mistakes you for an object later in the day"
        },
        "111311122":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Barbie (huge ditz) walks in and accidently sits on you",
                "you make an arragement to do it whilst she's at work"
            ],
            "content":"<div class=\"\"><div> <span>you notice a bit of oil on the floor and then you see her huge naked ass descend on you as she slipped you run backwards and the ass lands behind you sending you flying up and forwards out the door where you land near Kathrine who sees you but has her hands full so she put you in her cleavage and took you to Charlotte who was so busy she just said \"leave it on my bed\" you get placed on the bed and 3 hours entered Charlotte wearing <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://sc01.alicdn.com/kf/HTB1efzqHFXXXXbRXFXXq6xXFXXXT/221396774/HTB1efzqHFXXXXbRXFXXq6xXFXXXT.jpg\" target=\"_blank\">https://sc01.alicdn.com/kf/HTB1efzqHFXXXXbRXFXXq6xXFXXXT/221396774/HTB1efzqHFXXX...</a><br>\r\nthen she sees you and you explain why you are there she then walks over to you and lays on her back with you in front of her pussy and then she says play around I'm going to sleep then she removed her thong and you see <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://teengirlsfucked.com/teenslovehugecocks//wp-content/uploads/sites/3/nggallery/naomi-woods-blonde-teen/Naomi-Woods-blonde-teen2.jpg\" target=\"_blank\">http://teengirlsfucked.com/teenslovehugecocks//wp-content/uploads/sites/3/nggall...</a> then she pulls over her covers and goes to sleep you have a mini flashlight with you and you see her pussy then you place your head on the lips and open the lips with your hands and immediately you get thrown back as a sea of cum wash you away then you hear her say \" oh jack oh yes fuck me jake fuck me\" then you get up and walked to her closed cleavage and you get in the cleavage and go to sleep in the morning you said \"charlotte in your sleep i heard you say you wanted to have sex with me, is that correct?\" she nodded and then she said \"want to do it \" you nodded then...</span></div></div>",
            "created":1504414800,
            "id":2379265,
            "title":"to Dallas...or not"
        },
        "1113111221":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Barbie leaves and you and Charlotte start kissing for hours then go on a date",
                "Your girlfriend enters and takes you for the door"
            ],
            "content":"<div class=\"\"><div> <span>\" yes I wan to have sex with y-\" you get cut off as a titanic naked ass appeared over you and you saw right where you were heading in between her cheeks you try to run but end up with only your head sticking out from under her pussy the Charlotte grabs you just before Barbie starts grinding on the bed then...</span></div></div>",
            "created":1504414800,
            "id":2379386,
            "title":"Barbie (huge ditz) walks in and accidently sits..."
        },
        "1113111222":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "when she gets home she takes you out and takes a bath with you",
                "when she gets home she takes you out andgives you to her daughter for the night"
            ],
            "content":"<div class=\"\"><div> <span>Charlotte then put you in the back of her panties then put on her skirt and blouse and went to her office building after that she closed the curtains locked the door and put all the devices on silent then took off her skirt put her knees on her chair with her asshole near the table then pulled down her panties and then put you on the table then as it turns out she has a supersensitive butt hole then she positioned herself and you see her anus right in front of your cock then you insert your cock in and she moans then you continue thrusting then she stands up to change positions but you were halfway through a thrust and you cock was trapped in her anus as she stood up then she felt you and took you into the living area and laid on her bed with you in front of her pussy then you begin fucking her, after 3 hours you had finally finished sex then she got dressed washes you off then said \"hey jake i have a favour, i tell my secretary to wear appropriate panties and not to play with herself, but i fell like she's ignoring me but i can't catch her in the act, can you sneak into my secretary's office her name is Barbie and on her chair to find out, oh and make sure you're not found\" then she gives you a tiny helmet with a GoPro attached to it and said \" i will take you to her office and have a chat with her whilst you climb out of the back of my panties down my skirt and begin the spying\" with that she put your legs in the back of her panties and carefully walked to her Barbie's office and knocked on and entered Barbie <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/736x/82/9f/4d/829f4dcef83fce2bd9a40b1d7f119b66.jpg\" target=\"_blank\">https://i.pinimg.com/736x/82/9f/4d/829f4dcef83fce2bd9a40b1d7f119b66.jpg</a> wearing <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/736x/60/e6/be/60e6beb111f9d421477f07006475f6a9--short-tight-homecoming-dresses-short-tight-dresses.jpg\" target=\"_blank\">https://i.pinimg.com/736x/60/e6/be/60e6beb111f9d421477f07006475f6a9--short-tight...</a>  then Charlotte sat down on the chair near Barbie's desk and started to talk so you climbed out her panties and slid down her skirt and under Barbie's desk then turned on your GoPro and you climb the inside of the desk as Charlotte left and watched the live broadcast from your GoPro on her desktop at her office, you managed to make it on her chair then you see <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.buyeasyonline.com/ebay_photo/201508/40768/40768-1.jpg\" target=\"_blank\">http://www.buyeasyonline.com/ebay_photo/201508/40768/40768-1.jpg</a> heading to wards you and you jump through the leg hole as Barbie pulls her panties to her ankles unaware of her boss's spy  then you and Charlotte see her fingering herself then she opens a secret compartment in her desk to reveal a dildo, then you hear a voice it was Charlotte calling you though the mini headset she said \"ok i have the evidence now get out of there she can get way to horny\" then you climb down her desk but your leg gets caught in a string of the panties luckily  she had removed her panties so you just kept running, no one noticed the inappropriate pair of panties moving from Barbie's office to Charlotte's office Charlotte opened the door put freed you Barbie's panties in her draw and took to the car where Charlotte said \"whilst i was in my office i used a pen as a dildo and it got stuck in my pussy could you get the pen for me\" you nod then she inserts you then puts back on her panties and skirt and walked out each movement caused you to shake then she got into her car then she drove home and then you found the pen and pick it up then you drag it to her lips but you can't open them so you wait...</span></div></div>",
            "created":1504414800,
            "id":2379330,
            "title":"sex at work"
        },
        "1113112":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "you find it deep inside her rectum",
                "ITS A TRAP!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you cant see the coin. \"how far in is it?\" you ask. \"its in there pretty deep\" she replies. you look reluctantly into the tight endless tube<br>\r\nin front of you. you hold your breath and dive in.</span></div></span></div>",
            "created":1355288400,
            "id":1486621,
            "title":"its in very deep"
        },
        "11131121":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "she gets home and found you and took care of you",
                "she gets home and goes unaware of your presence for a week"
            ],
            "content":"<div class=\"\"><div> <span>you find the coin and haul it on your back as you squeeze through  her asshole back to the outside then she looks in the mirror facing her but and sees a glisten she presumes it's the coin and picks it up whilst you still had it on your back sudden you drop and you see her <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.therackup.com/wp-content/uploads/2015/06/Beautiful-Eyes-and-Big-Cleavage.jpg\" target=\"_blank\">http://www.therackup.com/wp-content/uploads/2015/06/Beautiful-Eyes-and-Big-Cleav...</a> just before you drop into her cleavage she presumes you are on the table then she left with her new boob buddy...</span></div></div>",
            "created":1503205200,
            "id":2372118,
            "title":"you find it deep inside her rectum"
        },
        "11131122":{
            "author_id":"animegeek171",
            "author_name":"Toby",
            "choices":[
                "Goes home ((plays with human more))",
                "Go back to class"
            ],
            "content":"<div class=\"\"><div> <span>Now with you deep in the girl laughed and pulled up her panties and then pants \"you stupid human it was just a trap and you fell for it\"She said as she laughed again \"did you really think I had a coin up my ass\"She asked \"I'm not as stupid as you\"the girl said<br>\r\n<br>\r\nIt was tight in her warm and slimy ass and as you got deeper it had gotten darker until you heard laughing and the girls voice \"w_what let me out\"you cry but she couldn't even hear you as she thought of what to do now </span></div></div>",
            "created":1502859600,
            "id":2369893,
            "title":"ITS A TRAP!"
        },
        "111312":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "boobs ",
                "pussy"
            ],
            "content":"<div class=\"\"><div> <span>well I don't know much about stomach aches she says \"you lie on my naked belly and tell me what you hear\" ok you say she then removes her tight top and lays you on her belly you hear loud noises then she looks down at you and says \"I don't really have a stomach ache I came to see you then she puts you in her purse and puts back on her clothes and left school, but it wasn't her school she was a guest, a few hours the purse opens and it looks like you are in a posh principle's office she said welcome Jim it's good to meet you I am Chelsea this school's principle, this school is a all girls school and these girls have never seen a man before so you are a sample to all the girls, you have a room to yourself and you will have a personal maid just like all the girls here, you then say \" I apologize if this seems rude but I'm tired could you show me to my room\" Chelsea looks at you with a gentle look and says Mellissa you can come in, a few moments later you see <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/65/7f/17/657f1721cc526f50260ccdc7f6ebd5f0.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/originals/65/7f/17/657f1721cc526f50260ccdc7...</a> Jim this is your personal maid Mellissa says the principle then the principle injected you with a serum she then says that'll make you invincible then Mellissa took you to your room where you saw a double bed and then she says that is your bed if you need anything press that button over there with that she left after about an hour you woke up and pressed the button in walks Mellissa and asks what is wrong she then closes the door as you say \"I'm not used to being alone in a bed would you sleep with me\" Mellissa's face went red but she knew she had to obey Jim's every command with that she stripped and laid down next to you in her underwear <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.ebayimg.com/images/i/301971497499-0-1/s-l1000.jpg\" target=\"_blank\">http://i.ebayimg.com/images/i/301971497499-0-1/s-l1000.jpg</a> then she gets under the covers and goes to sleep with you in between her breasts in the morning she fished you out of her cleavage got dressed and took you to the principles office where Chelsea got up fed you put you in a tiny uniform and said today you will be with me she then places you on her desk and explores his body then she said she was going to her room for a few hours and she took you with her then she locks her room and lays you on the bed and lays on her back completely naked <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/236x/41/e3/f4/41e3f4ca2462c616532d0446e4b38479.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/236x/41/e3/f4/41e3f4ca2462c616532d0446e4b38...</a> then she said explore my body but where do you want to start she asks you...</span></div></div>",
            "created":1503205200,
            "id":2372127,
            "title":"she has a stomach ach"
        },
        "1113121":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "she sleeps with you again ",
                "Chelsea sneaks in and sleeps with you"
            ],
            "content":"<div class=\"\"><div> <span>you walk between her huge mounds and says can you pull them apart the release them for me you say as you watch the huge mountains shake it actually knocks you over then you lie in between them, then on top of them and then you ask if she could put her bra back on as she does this you see the tits compress then without warning her personal maid enters <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/ee/f7/b7/eef7b7fd97945ae2ff0f89191980c917.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/originals/ee/f7/b7/eef7b7fd97945ae2ff0f8919...</a> not seeing you as Chelsea said can you get me 2 cola's each with a straw then the maid left and soon returned with the drinks and said \"will that be all miss\" then Chelsea said no, can you can you get a nice hot bath ready without bubbles, oh and can you get the tiny scuba kit ready, with that the maid left and said that was Gloria my made a few minutes later Gloria returned with the kit and told Chelsea the bath was ready so Chelsea picked you up and took you to her bathroom where she put you in a pair of flippers and put on you a scuba mask and oxygen tanks then she dropped you in her bath as she got in and then you explored her body underwater afterwards you both drank your cola's then went to her bed then Gloria entered and grabbed you thinking Chelsea was asleep she then said \"listen you little bug I won't have you harassing my mistress, then Chelsea said \"what are you doing to him Gloria\" Gloria realising that Chelsea was awake the whole time then Chelsea says \"your fired Gloria get out of my school\" with that she left and a few minutes later in walked Elizabeth <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://ak-hdl.buzzfed.com/static/2015-04/21/17/enhanced/webdr07/enhanced-7130-1429652638-14.jpg\" target=\"_blank\">http://ak-hdl.buzzfed.com/static/2015-04/21/17/enhanced/webdr07/enhanced-7130-14...</a> Chelsea then said Elizabeth this is Jim the only male in the whole school then Elizabeth left and in walked Mellissa as she came into to take you back to her room Chelsea told Mellissa not to let anyone see Jim so out him in the back of your thong Mellissa then turns to you saying \" for now see you soon\" you started to fear Mellissa as she dropped you into the back of her thong and walked to your room crushing you with every step after a few minutes you realised you were in your room and a worried look was on Mellissa's face but soon it turned into a sigh of relief then she sees you are freezing so she striped to her underwear and placed you on top of her pussy with a thong stopping you from falling in, after about 10 minutes you wake up and your temperature has risen...</span></div></div>",
            "created":1503205200,
            "id":2372186,
            "title":"boobs "
        },
        "11131211":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Introduction ceremony ",
                "class A"
            ],
            "content":"<div class=\"\"><div> <span>\"Mellissa because I don't think I will be used to sleeping alone for at least a year can you sleep with me every night\" you say then Mellissa said \"of course sir if that is what you desire, if you wish for me to wear something special in bed or if you want me naked I will do that\" then you say \"could you wear\" <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.ebayimg.com/images/i/381366710225-0-1/s-l1000.jpg\" target=\"_blank\">http://i.ebayimg.com/images/i/381366710225-0-1/s-l1000.jpg</a> every night with that she excused herself then an hour later returned wearing it then you said \" you know what I think it's so hot we don't need covers so she slept next to you on her right side then she rolls and you get trapped under her ass then unknown to her she farts on you but soon she rolled back and you got up rethinking her night clothes then you had it you went to the sleeping Giantess and shouted Mellissa she then rolled onto her left side looking at you and said \"yes sir how may I help you\" you say \"I think some accidents might happen if you wear those night clothes so how about you wear\" <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.stanzinos.com/images2/F8013BLACK.jpg\" target=\"_blank\">http://www.stanzinos.com/images2/F8013BLACK.jpg</a> instead with that she said yes sir before placing you between her boobs ready to start the next day...</span></div></div>",
            "created":1503291600,
            "id":2372548,
            "title":"she sleeps with you again "
        },
        "111312111":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "big breasted Class rep",
                "short skinny girl"
            ],
            "content":"<div class=\"\"><div> <span>you wake up dressed and in the Chelsea's hand you ask what's going on before she says \"it's time for you introduction\" you get up and see a microphone and you stand up seeing a hall full of girls you say \" hello my name is Jim am 14 and I now attend this school as a sample of men are like\" Chelsea then says \"each class will get a term with him and each girl will get 1 day and 1 night with him you can do almost anything except crush him, and injure him\" \"first class will be class A\" after a trip to class A Chelsea says ok tomorrow _____ will get him for 1 day and 1 night\"<br>\r\n<br>\r\nwho gets you tomorrow? </span></div></div>",
            "created":1503291600,
            "id":2372558,
            "title":"Introduction ceremony "
        },
        "1113121111":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "puts your lower half in the front of her thong whilst she works",
                "she puts you up to your head in her cleavage and buttons up her to hiding you"
            ],
            "content":"<div class=\"\"><div> <span>the next morning Chelsea takes you to Amanda <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://orig10.deviantart.net/6a16/f/2017/162/1/d/perfetti_2980_by_jessica_beaumont-dbccr08.jpg\" target=\"_blank\">http://orig10.deviantart.net/6a16/f/2017/162/1/d/perfetti_2980_by_jessica_beaumo...</a> as she gets the day off class to spend with you Amanda then takes you to her room and introduces you to her personal maid Charlotte <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/736x/24/b7/76/24b77689448d62a31a565d6f1495e815--maid-costumes-adult-costumes.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/736x/24/b7/76/24b77689448d62a31a565d6f1495e...</a> Amanda then says \"Charlotte this is Jim he'll be spending today and tonight with me, you can ;eave and come back only in the morning\" she says as Charlotte leaves and then you see Amanda get up walk into another room and come out wearing <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img.alicdn.com/imgextra/i3/T1I7PTXeJgXXcCXKwW_023244.jpg\" target=\"_blank\">http://img.alicdn.com/imgextra/i3/T1I7PTXeJgXXcCXKwW_023244.jpg</a> then she lays down next to you and tells you strip so that you're naked, you do that and then she says \"come here and let me look at you\" you follow her commands and follow her demands until it's almost morning, a few minutes later Mellissa walks into Amanda's room and says \"hello sir it's time to go but I can't let people see you\", you knew what was coming next as she lowered you to her ass but turned you around and you see a hole that your head fits through perfectly then she pulls her thong up and walks out Amanda's room you see a lot of girls but none of them stares at Mellissa's ass. Mellissa was walking to your room when the principle asked her to come with her Chelsea told Mellissa to it down on the wooden chair Mellissa started to speak and said \" miss if I could-\" Mellissa got cut off as Chelsea repeated her self Mellissa sat on the wooden chair crushing you Chelsea then said \"so you were just about to get Jim when you get him bring him here\" she said then she let Mellissa speak Mellissa said \" miss I was returning from Amanda's room with Jim in my thong then you told me to sit on him\" Chelsea's eyes went wide as Mellissa pulled you out to show her Mellissa handed you over to Chelsea, then left Chelsea apologised then she... </span></div></div>",
            "created":1503378000,
            "id":2373062,
            "title":"big breasted Class rep"
        },
        "11131211111":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "she gets naked and you explore her body whilst she listens to loud music",
                "you go to sleep as Mellissa goes to the bathroom then sits on you"
            ],
            "content":"<div class=\"\"><div> <span>unfortunately Chelsea was really busy so she took off her skirt  and pulled open the front of {link:http://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/I-IAAOxyffZSVHv9/$T2eC16VHJHoFGlY 9O4!RBSVHv75,3g~~60_35.JPG} (the red one) and put you up to your waist in them then gently let it snap back into place closing your legs in front of her pussy with your head and arms free then she rolls her <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://images-na.ssl-images-amazon.com/images/I/41OP0QW0LTL._AC_UL320_SR214,320_.jpg\" target=\"_blank\">https://images-na.ssl-images-amazon.com/images/I/41OP0QW0LTL._AC_UL320_SR214,320...</a> under her desk and sat there working for 7 hours, by then your legs felt like they were burning from the heat coming off her pussy just then her pussy got all wet and juicy because she was thinking about you then suddenly there is a knock at the door and Chelsea yanks her skirt up and over you  then she took you out and placed you in a draw and closed the draw, and then says \"come in\" in came Mellissa and asked for her to return you, she complied and then Mellissa put you back in her thong and walked to your room, but as she was walking to your room she saw two girls leave with one of your possessions the girls saw Mellissa's cross face and run meanwhile you had no idea what was happening so you rolled over at the same time Mellissa ran after the two of you but just before that she yanked up her thong making your head go inside her anus then she ran and your body gets thrown around in between her cheeks then your head pops free from her anus as Mellissa catches the two girls and brings them to Chelsea and Mellissa told Chelsea what she saw then the girls gave back all of Jim's clothes then left then Mellissa then took your clothes and you back to your room where she took you out and...</span></div></div>",
            "created":1504328400,
            "id":2378944,
            "title":"puts your lower half in the front of her thong ..."
        },
        "111312111111":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "they give you a deployable mech",
                "a knock at the door Chelsea and Mellissa hides you"
            ],
            "content":"<div class=\"\"><div> <span>she puts you on the bed gets naked <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/736x/41/e3/f4/41e3f4ca2462c616532d0446e4b38479--sexy-busty-babes-female-form.jpg\" target=\"_blank\">https://i.pinimg.com/736x/41/e3/f4/41e3f4ca2462c616532d0446e4b38479--sexy-busty-...</a> then she puts on her noise cancelling headphones {<a rel=\"nofollow\" href=\"https://store.storeimages.cdn-apple.com/4662/as-images.apple.com/is/image/AppleInc/aos/published/images/H/GD/HGDS2/HGDS2?wid=572&amp;hei=572&amp;fmt=jpeg&amp;qlt=95&amp;op_sharpen=0&amp;resMode=bicub&amp;op_usm=0.5,0.5,0,0&amp;iccEmbed=0&amp;layer=comp&amp;.v=1465862000407\" target=\"_blank\">https://store.storeimages.cdn-apple.com/...</a>}<br>\r\nand put on some loud music then you see she's laying on her front and you see her massive ass cheeks as they are spread apart a bit so you walk between her legs and climb in her ass, Mellissa had no idea her master was in her ass, she just felt an itch as you rubbed her ass hole with your hands Mellissa then thought to get rid of an itch I can just fart, you had no idea of her intentions then you start to kiss her anus then you lick it and it traps your tongue then it opens and your peer in only to get flown out of her ass and into the air you screamed \"MELLISSA HELP\" but she couldn't hear you she just turned yo lay on her back you landed flat on her right tit she didn't feel you land there then you lay on your front and hover your mouth over her nipple and began to suck, Mellissa feels funny on her breast and grabbed both tits from the top unaware she's pushing her Master in her right tit you fall in and land in a lake of milk then you hear her say \" master where are you?\" you shouted \"MELLISSA DON'T MOVE I AM IN YOUR RIGHT TIT\"  then Mellissa sat up that shook you around and then she said \"I hear you master I will take you to Chelsea to find the best solution\" then she put on a bra and uniform and leaving the room then instead of walking calmly she rushed and made you bounce all around when she reached Chelsea's office when she arrived she told Chelsea what had happened then Chelsea got some string and put it in Mellissa's right tit you grab it and yank it twice then she carefully pilled it and you out then Mellissa apologized and you said it wasn't her fault then...</span></div></div>",
            "created":1504328400,
            "id":2378977,
            "title":"she gets naked and you explore her body whilst ..."
        },
        "1113121111111":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Mellissa takes you back to the room in the back of her thong ",
                "Mellissa escort you back to your room,a girl trips sending you in their cleavage"
            ],
            "content":"<div class=\"\"><div> <span>they say this watch can deploy a special mech called a I.S and this is yours you just have to think about it and it will appear you can fly with it so that helps, then you activate your mech <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://vignette3.wikia.nocookie.net/infinite-stratos/images/7/7c/5442181604_718b78fa8a.jpg/revision/latest/scale-to-width-down/263?cb=20110303190904\" target=\"_blank\">https://vignette3.wikia.nocookie.net/infinite-stratos/images/7/7c/5442181604_718...</a> then you take off but cant control it and end up in <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/originals/2b/53/37/2b5337a2742a37e7c89744b90ba85412.jpg\" target=\"_blank\">https://i.pinimg.com/originals/2b/53/37/2b5337a2742a37e7c89744b90ba85412.jpg</a> she's a maid that works at the office called Sandra she's wearing <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/originals/17/4d/34/174d34852b250fa0467b8e6a35f6628c.jpg\" target=\"_blank\">https://i.pinimg.com/originals/17/4d/34/174d34852b250fa0467b8e6a35f6628c.jpg</a> then she sees you picks you out and gives you back to Chelsea then...</span></div></div>",
            "created":1504414800,
            "id":2379672,
            "title":"they give you a deployable mech"
        },
        "11131211112":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "gets into bed with you ",
                "takes you out to a date at a private resturant"
            ],
            "content":"<div class=\"\"><div> <span>Chelsea puts you in between her two mounds then she says \" oh I remember what today is, today's the day every girl does a marathon, do you want to stay between my boobs or somewhere else?\" she asks you say \" In your cleavage please Chelsea\" she nods then goes to her room and puts on  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.delasredes.com/wp-content/uploads/2015/11/1448021693_hqdefault.jpg\" target=\"_blank\">http://www.delasredes.com/wp-content/uploads/2015/11/1448021693_hqdefault.jpg</a><br>\r\nthen she stands up and puts on <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://images-eu.ssl-images-amazon.com/images/I/51BFR-KPMPL._SY355_.jpg\" target=\"_blank\">https://images-eu.ssl-images-amazon.com/images/I/51BFR-KPMPL._SY355_.jpg</a><br>\r\nfills it up with water and then sets out her breasts bouncing each step, then she gets to the start line and leans forward slightly which moves you forward a bit then there is a bang and your world bounces up and down really fast as she runs a quarter in you slip from in between her breasts to under them  and you are face to face with her left nipple.<br>\r\n<br>\r\nAfter the marathon Chelsea went back to her room covered in sweat and then looked down in her cleavage and didn't find you then she took her clothes off and you fell onto her bed and she saw this and guessed you slipped down during the race then she took you and got in a cold bath with you which got rid of the sweat then she...</span></div></div>",
            "created":1504328400,
            "id":2378763,
            "title":"she puts you up to your head in her cleavage an..."
        },
        "111312112":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "attendance order",
                "random"
            ],
            "content":"<div class=\"\"><div> <span>after getting fed and dressed Mellissa and Chelsea took you to Class A that had about 10 girls Chelsea then announced \" each girl will get one day with Jim then he will have 2 weeks rest then moved on to class B\" \"hello everyone glad to be here\" you said trying not to get on anyone's bad side then Chelsea said \"starting tomorrow Jim will be assigned to one of you for a day you will pick him up from my office at 5:00am and return him to my office at 6:00pm sharp\" \"so Jim\" Chelsea said \"what order do you want the to be with the girls...</span></div></div>",
            "created":1503378000,
            "id":2373127,
            "title":"class A"
        },
        "1113121121":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "she takes you out you waych a movie and then head to bed",
                "she takes you out and Mellissa comes in and you play with both of them"
            ],
            "content":"<div class=\"\"><div> <span>I guess the attendant order will be ok, so who will collect me tomorrow \" I will\" comes a voice then you her <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://photocdn.sohu.com/20150822/mp28745493_1440213815972_2.jpeg\" target=\"_blank\">http://photocdn.sohu.com/20150822/mp28745493_1440213815972_2.jpeg</a> my name is Claire the girls says before you and Chelsea leave.<br>\r\n<br>\r\nabout 4:00 in the morning Chelsea brings you to her office, at 5:00 there is a knock at the door and then Claire entered and dropped you in her cleavage and walked out, at 6:00pm there was a knock at the door and it was Jim and left she looked down at you and said you look exhausted and scared then Chelsea said \" Jim what exactly did she di to you\" as you explained how she tortured you and crushed you, someone enters <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img104.imagetwist.com/th/06521/btls65yb6ha2.jpg\" target=\"_blank\">http://img104.imagetwist.com/th/06521/btls65yb6ha2.jpg</a> she then says \" there you are I was wondering where Claire's sex toy had run off to, I am here to return you\" as it turns out the woman was Anne Claire's maid Anne lunged for you and Chelsea dodged and put you deep in her cleavage as Anne stood up she had no idea where she had put you then she said \" I'm sorry miss, but Claire has lost one of her favourite toys have you seen it\" Chelsea stand up tall and said \" no I haven't seen a toy, I have seen Jim though\" \" ok well miss if you do see the toy return it to miss Claire\" then Anne left and you say \" I think Anne has control over all the students and probably said what u supposedly like aka, being crushed and tortured\" \" in that case no girl will get you and for the next 5 years will be spent with me\" Chelsea said before locking her door and taking of her long skirt revealing <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/7d/43/ee/7d43ee91438e6eef1f6b5f6988a21045.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/originals/7d/43/ee/7d43ee91438e6eef1f6b5f69...</a> then she puts you in her ass puts back on her skirt and heads to the bedroom where...</span></div></div>",
            "created":1503464400,
            "id":2373654,
            "title":"attendance order"
        },
        "11131212":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Chelsea realises she wants to have a meeting about you",
                "Your toilet is clogged so she lets you use hers at the same time Chelsea is"
            ],
            "content":"<div class=\"\"><div> <span>Mellissa gets up and walks to the bathroom, after a few minutes Chelsea sneaked into your room and grabbed you sticking you in the back of her panties and walking off to her room leaving a note to Mellissa from Chelsea. When you opened your eyes your back was on a material and two walls went up and down simultaneously, a few minutes later you are out in the open looking at Chelsea she said \" oh I'm sorry but I couldn't just leave you there\" \" but what about Mellissa?\" You  ask she then said just for tonight you're sleeping with me then you see she was completely naked you went up to her pussy and asked \"can I try something?\" Chelsea said \"yes of course\" then you sick your cock into her pussy, but it appears she can't feel that you you keep thrusting but nothing then you decide to give up and walked back to her huge tits and said \"can I lay in between your breasts she responded with a yes Jim, in the morning...</span></div></div>",
            "created":1503378000,
            "id":2372792,
            "title":"Chelsea sneaks in and sleeps with you"
        },
        "111312121":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Sunbathe with Chelsea",
                "Sunbathe with Mellissa"
            ],
            "content":"<div class=\"\"><div> <span>In the morning Chelsea got dressed in a tight uniform as you get dressed then she sticks you in her tight cleavage and walks into a big room with 7 people in then she takes you out and placed you at a little table in front of her and she says, \"this is Jim he's currently the only male within 20 miles of this school, Jim these 7 girls are 7 class representatives, you have Class A: Amanda, Class B: Helen, Class C: Olivia, Class D: Diane, Class E: Elaine, Class R: Yuri and finally Class S: Caroline\" \"excuse me what does class R and class S mean?\" you ask, <br>\r\nYuri then says \"class R is for the really rich\" \"and class S is for the unique and special\" says Caroline \"ok thank you for explaining that for me\" you say then Chelsea says \"ok so shall the meeting start, now then Jim and I shall have a conjoint room this is because I can therefore protect him from some girls who are a bit too curious and might try to take him so in a year Class A will get him for half a year then Class B, and so on, I'm sorry ladies but this meeting has ended\" with that she picked you up put you in her cleavage and walked to her office then she sat down  and placed you on her chair and you see she has no thong on and rolled her chair under her desk and said \" Jim dear I have a lot of paperwork so could you release my stress\" \"um but how\" you say before she says \"play with my pussy, just don't go in\" \" yes mam you say\" then you open her lips and rub your hand up and down her clit then Chelsea deeply sighed in relief \"oh Jim that is good you good boy\", after an hour she picked you up and placed you in her cleavage where she goes to the joined rooms and say there is a slide wall that can separate and open up our room just then Mellissa walked in and then stripped to show she was naked and you saw her fully naked form for the first time <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://xxgasm.com/wp-content/uploads/2016/06/meg_milf_nude-3180.jpg\" target=\"_blank\">http://xxgasm.com/wp-content/uploads/2016/06/meg_milf_nude-3180.jpg</a> then Chelsea said \"Mellissa catch\" as she chucks you at her Mellissa caught you and said \"hello sir, oh I will put some clothes on\" you stop her and say \"you can stay naked I don't mind\" then you see Chelsea is naked <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://www.writing.com/main/redirect.php?htime=1503428812&amp;hkey=1699181400da2d7cdc1766c2170cace8d43a2b0a&amp;redirect_url=https%3A%2F%2Fs-media-cache-ak0.pinimg.com%2F236x%2F41%2Fe3%2Ff4%2F41e3f4ca2462c616532d0446e4b38479.jpg\" target=\"_blank\">https://www.writing.com/main/redirect.php?htime=1503428812&amp;hkey=1699181400da2d7c...</a> then she says \" Mellissa can you make the beds joined so we can all sleep together\" then she joins the beds together but then came a dilemma who's boobs do you sleep in then you say \"ok my left half will be in Mellissa's cleavage, my right half will be in Chelsea's cleavage, so you both will have to sleep inwards\" with that the two giantesses slept whilst you were awake to make sure nothing would happen, just then both women shifted then you realise your left half was under Mellissa's right butt cheek, and your right half was under Chelsea's left butt cheek, you yell up and they open their eyes and face outwards then placing you on a separate pillow between their heads and all three of you went to sleep as you thought abut you will spend a whole year with Chelsea and Mellissa.<br>\r\n<br>\r\nIn the morning you wake up and see both girls in <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://ae01.alicdn.com/kf/HTB1FwBaLpXXXXbFaXXXq6xXFXXXp/Cheap-Thin-Super-font-b-Sexy-b-font-font-b-See-b-font-font-b-Through.jpg\" target=\"_blank\">https://ae01.alicdn.com/kf/HTB1FwBaLpXXXXbFaXXXq6xXFXXXp/Cheap-Thin-Super-font-b...</a> and you asks what is going on then Chelsea said \"today all 3 of use will go to our private beach\" \" but what will I be wearing\" you question then Mellissa hands you <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://ae01.alicdn.com/kf/HTB1gglzJVXXXXbcXpXXq6xXFXXXi/Free-Shipping-Sharks-professional-swimsuits-XXS-XS-5XL-size-men-speedo-swimwear-mens-swimwear-wholesale.jpg\" target=\"_blank\">https://ae01.alicdn.com/kf/HTB1gglzJVXXXXbcXpXXq6xXFXXXi/Free-Shipping-Sharks-pr...</a> then all of you head out to the private beach and you see that it's just you three, what do you do?...</span></div></div>",
            "created":1503378000,
            "id":2372993,
            "title":"Meeting about Jim"
        },
        "1113121211":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "lay and sunbath on a seperate towel ",
                "Chelsea feels a discomfort in her ass and asks you to help out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"oh Jim dear before you lay down can you lotion me up before she gets some lotion in a dish and you lay in it and roll in it before leaping onto Chelsea's back, after completing your work she asks what you wanted to do next...</span></div></span></div>",
            "created":1503378000,
            "id":2373118,
            "title":"Sunbathe with Chelsea"
        },
        "11131212112":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Class S got the day at the beach and Chelsea and Mellissa have to hide you",
                "skip to the end of the day you sleep, in the morning you go to town with Chelsea"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chelsea then said Jim I think i have something in my ass could you help she then removed her thong and you went in and found a small pebble and got out and then stepped back onto the towel before she put back on thong and then...</span></div></span></div>",
            "created":1503378000,
            "id":2373124,
            "title":"Chelsea feels a discomfort in her ass and asks ..."
        },
        "111312121121":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "Mellissa comes in and sits in a chair keep an eye on you",
                "the bratty girl hides under the desk and gets Chelsea's pussy to the face"
            ],
            "content":"<div class=\"\"><div> <span>Chelsea sees class S heading your way all in different coloured  <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/4a/88/08/4a8808b9d309ad2b587c746350c7d766.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/originals/4a/88/08/4a8808b9d309ad2b587c7463...</a><br>\r\nsuddenly Mellissa said \"master I am sorry\" she said as she sat on you and you get stuck between her ass cheeks then she and Chelsea left grinding you then she released you and then Chelsea gives you a car <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://a.d-cd.net/392f8bu-960.jpg\" target=\"_blank\">https://a.d-cd.net/392f8bu-960.jpg</a> then she says \" this car is fast, has thrusters on the bottom, a grappling hook and nitrogen oxide for a get away, and of course it's your size, now you can roam the halls\" she said as you enter and drive into the hallway, where you stop in front of a mean girl {<a rel=\"nofollow\" href=\"http://cdn.playbuzz.com/cdn/95497c04-a4a6-4cc2-80ee-02bb4b6a0173/ba9cac3d-793e-4e36-87d2-5a6b8dc37a5c.jpg\" target=\"_blank\">http://cdn.playbuzz.com/cdn/95497c04-a4a...</a>} who saw you and said \"you are now my toy\" quickly you reversed and did a J turn and driving away whilst the bratty girl chased you, then you see Chelsea's office door open a bit you slam the pedal in and drift into the room where you see a box and you drive into it, just then the box rises and you see you are on a platform that takes you level with Chelsea's desk where you see Chelsea and then get out and then she said \" so you like the mini elevator then\" \"yes\" you say \"thank you.... Chelsea can I call you mom?\" you ask she then blushes and says \" yes my son\" she says as you walk over to her and then she said \"I'm just going to the toilet I'll be right back\" then she left and in comes...</span></div></div>",
            "created":1504069200,
            "id":2377462,
            "title":"Class S got the day at the beach and Chelsea an..."
        },
        "1113121211212":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "yes but is scared for life",
                "no the principle stands up and finds her and Olivia gets suspended"
            ],
            "content":"<div class=\"\"><div> <span>The bratty girl (known as Olivia) sees Chelsea isn't at her desk and then spots you, and walks towards you, suddenly the door opens a bit, and the girl knowing she will be in trouble hides under Chelsea's desk, then the door was open fully and then closed as Chelsea entered then you notice she has on <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://thechive.files.wordpress.com/2012/09/hot-tight-dress-dresses-35.jpg?quality=85&amp;strip=info&amp;w=500\" target=\"_blank\">https://thechive.files.wordpress.com/2012/09/hot-tight-dress-dresses-35.jpg?qual...</a> and then she walked to her desk and sat down then moved her chair under her desk where she stayed for several hours.<br>\r\n<br>\r\nOlivia's POV: she saw her new toy but before she could grab him the door opened and she hid under the desk then the principle sat down in her chair and you see she has her panties on her ankles, then her shaved pussy gets closer and closer till it swallows your nose then you start to feel the intense heat and then suddenly your face gets squirted on as, you realise the principle cummed<br>\r\non you then you feel something pushing against your back and you realised she was putting on her panties.<br>\r\nDoes Olivia get her head free in time?<br>\r\n</span></div></div>",
            "created":1504155600,
            "id":2377728,
            "title":"the bratty girl hides under the desk and gets C..."
        },
        "1113122":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "she laid next to you",
                "Mellissa comes in and accidently sits on you forcing you in her crack"
            ],
            "content":"<div class=\"\"><div> <span>you head towards the pussy but then you stop and head towards her boobs and say \"I can't see your pussy it just wouldn't be right at my age\" Chelsea eyes went wide and then she said \"well aren't you a gentlemen, very well what do you want to do\" you think and then say \" can I sleep in your open cleavage\" she smiles down at you and nods then you sleep in her soft warm cleavage for 15 hours before waking up to find you really need to pee, then you say \"Chelsea I really need to pee\" Chelsea then says \"what a coincidence\" she then took you to the toilet bowl lowered you in her hand to the same height as her pussy she then said ok you can pee now then you look down and not ahead as she sees you keeping to your word, you both finished and then goy in a hot bath together and then she says with a blushed face \"Jim\" \"yes\" you say \"do..do you love me\" your eyes widened for a moment and then you said \"yes I do I do love you Chelsea I love everything about you\" she blushed even harder now and then she says in a gentle voice \"I love you too\" after that you both got out got dried and laid in your bed and then...</span></div></div>",
            "created":1503378000,
            "id":2373087,
            "title":"pussy"
        },
        "11132":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "nothing much",
                "you get curios as she falls asleep and you explore down below"
            ],
            "content":"<div class=\"\"><div> <span>after the nurse leaves you wait for hours but accidently fall off her desk onto her chair  and you black out, when you wake you hear the nurse say \"I guess he left, such a shame I wanted to look after him\" then she sits on her seat the same time her skirt flips up to reveal <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.uk.thehouseofsilk.com/product.php/1531/mini-silk-g-string\" target=\"_blank\">http://www.uk.thehouseofsilk.com/product.php/1531/mini-silk-g-string</a> and then she squashed you but you live because her chair had memory foam you spent several hours under her ass before she went home with her little passenger when she got home she said \"oh Rachel you had your dream boy in your office but had to go to the toilet what a shame\" she said then she sat on the floor and heard a little \"ow\" then she went to a mirror and saw you were flat stuck to her ass cheek, her eyes widened as she peeled you off.<br>\r\n<br>\r\nwhen you awoke you were laying between two spread apart mounds you thought you were in her ass but there wasn't a hole instead there was a face looking down at you with a gentle smile she then says hello there little guy she then places you next to her and sits up giving you a great view of and her naked form <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/736x/0f/e6/24/0fe6240753c242f523e687d78fbb2b8b--sexy-women-boobies-sexy-bare.jpg\" target=\"_blank\">https://i.pinimg.com/736x/0f/e6/24/0fe6240753c242f523e687d78fbb2b8b--sexy-women-...</a><br>\r\n<br>\r\nshe then puts on {<a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/originals/71/3e/86/713e8696a17eee70130b0c1a1fe04746.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/ori...</a>} and then takes you to her bath (pre made) and you have a bath and...</span></div></div>",
            "created":1503118800,
            "id":2371545,
            "title":"the nurse comes back"
        },
        "111321":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Go to sleep",
                "Have some fun"
            ],
            "content":"<div class=\"\"><div> <span>Nothing much happens. She asks how you got into this situation and you explain everything. \"I'm sorry.\" she says. \" I should have payed better attention.<br>\r\n<br>\r\n\"It's fine.\" You say.<br>\r\n<br>\r\n\"Well since it's already late, I guess you'll be staying over tonight. Is that fine with you?\" She asks.<br>\r\n<br>\r\n\"Yeah\" you say. \"So do will we be going to sleep after our bath?\"<br>\r\n<br>\r\n\"If that's what you want, but I was thinking that we could have a bit of... fun tonight.\" she said seductively. You wondered what kind of games she had planned. After the bath you decide to...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1584766800,
            "id":2804455,
            "title":"nothing much"
        },
        "1113211":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Bed",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm kinda tired, can we just go to sleep.\" You say to the nurse.<br>\r\n<br>\r\n\"Sure we can little guy.\" The nurse said sweetly.<br>\r\n<br>\r\n\"So, what's your name Ms?\" You ask.<br>\r\n<br>\r\n\"It's Angela.\" She responded. She then picked you up and headed of to her room. \"Where would you like to sleep?\" You can sleep on my...</span></div></div>",
            "created":1584908400,
            "id":2805242,
            "title":"Go to sleep"
        },
        "11132111":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Something happens",
                "Nothing happens"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'll just sleep on the bed.\" You tell her.<br>\r\n<br>\r\n\"Ok.\" She said. The two of you began to lie down. You say across the bed hoping she wouldn't roll over an crush you in her sleep. <br>\r\n<br>\r\nDuring the night...</span></div></span></div>",
            "created":1584932280,
            "id":2805388,
            "title":"Bed"
        },
        "111321112":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Of course",
                "I'm not sure"
            ],
            "content":"<div class=\"\"><div> <span>During the night nothing happens. You hear an alarm going off.  It was turned off shortly. Angela sighed before saying \"time for work.\" She looked down at you \"and it's time for you to go to school, little guy!\" She smiled. The two of you got ready shortly and left. \"So, are you going back to your parents today?\" Angela asked.</span></div></div>",
            "created":1584932820,
            "id":2805397,
            "title":"Nothing happens"
        },
        "1113211122":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "You head off to 1st period"
            ],
            "content":"<div class=\"\"><div> <span>Note: So it turns out I really live up to my name cuz I got the nurses name wrong. Unfortunately I can't edit the story so I guess I'm going to ask you to pretend I was typing the name Rachel instead. I also wrote the wrong name in other story lines which sucks even more.<br>\r\n<br>\r\n\"I'm not sure.\" You respond.<br>\r\n<br>\r\n\"Why not?\" Rachel asked.<br>\r\n<br>\r\n\"My parents never really payed attention to me. They probably haven't even noticed I'm gone. So I'm not sure if I want to go back or not.\" You tell her.<br>\r\n<br>\r\n\"Well you can always stay with me!\" She said with a smile on her face.<br>\r\n<br>\r\n\"You sure?\" You ask her.<br>\r\n<br>\r\n\"Of course! You're more than welcome!\" She said.<br>\r\n<br>\r\n\"Thanks you tell her.\" Rachel eventually parked.<br>\r\n</span></div></div>",
            "created":1584935520,
            "id":2805422,
            "title":"I'm not sure"
        },
        "11132112":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Cleavage",
                "Genitals"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You can sleep on my bed. Or my cleavage or genitals.\"</span></div></span></div>",
            "created":1584908640,
            "id":2805243,
            "title":"More choices"
        },
        "1113212":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Bedroom",
                "Living room"
            ],
            "content":"<div class=\"\"><div> <span>Note: in the previous chapter there's a sentence that doesn't make sense. The word \"do\" is not supposed to be in it. You should know what I'm talking about if you read the chapter. Now back to the story.<br>\r\n<br>\r\n\"I guess I would like to have some of that fun.\" you say to the nurse. She smiles down at you and pickes you up. She held you on her palm and kissed you gently. She kissed you again playfully this time knocking you down. You start laughing and started kicking at her lips to get her to stop. She than sticks her tongue out and licks you.<br>\r\n<br>\r\n\"Hmmm you actually taste quite good\" she said.<br>\r\n<br>\r\n\"Well so much for my bath.\" you say ignoring her.<br>\r\n<br>\r\n\"I have a game!\" idea she said. \"Cat and mouse!\" She says exitedly.<br>\r\n<br>\r\n\"Huh!?\" You say nervously.<br>\r\n<br>\r\n\"Oh relax, I'm not actually going to eat you! It'll be just like hide and seek so go hide! I'll give you a minute or two! She says very excited for this game.<br>\r\n<br>\r\n\"Ok\" you say as she lowers you to the ground. You than run into her...</span></div></div>",
            "created":1584766800,
            "id":2804467,
            "title":"Have some fun"
        },
        "11132121":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "The bed",
                "The wardrobe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You head to a room that's close by. You quickly make it out to be her bedroom given that there's a bed in there. You than go to hide under </span></div></span></div>",
            "created":1584766800,
            "id":2804474,
            "title":"Bedroom"
        },
        "111321212":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "She stays there's still trying to grab you",
                "She leaves and comes back with a long object"
            ],
            "content":"<div class=\"\"><div> <span>You quickly run under the wardrobe. \"It'll be hard for her to get me under hear.\" You mumble to yourself. You than hear loud footsteps approaching. <br>\r\n<br>\r\n\"Where are you little guy! Come out and let's get this game over with!\" She said.  She decided to check under her bed first, but it was too dirty with all the boxes and dust underneath. She decided to check under the wardrobe first since it's just a little rusty underneath.<br>\r\n<br>\r\n\"Found you!\" She said excitedly. She reached her hand out to grab you, but couldn't reach. \" Oh come on!\" She said annoyed.<br>\r\n<br>\r\n\"Yes!\" You say to yourself, as she couldn't reach.</span></div></div>",
            "created":1584766800,
            "id":2804678,
            "title":"The wardrobe"
        },
        "1113212122":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "You stay in the same spot",
                "You panic and run"
            ],
            "content":"<div class=\"\"><div> <span>You watch her get up and walk away. \"What?\" You say to yourself. \"Did she give up?\" You don't know if you should leave or not. You see her quickly coming back with a long object. \"Is she gonna push me out with that?\" You wonder.</span></div></div>",
            "created":1584766800,
            "id":2804680,
            "title":"She leaves and comes back with a long object"
        },
        "11132121222":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Spit you out",
                "Swallow you"
            ],
            "content":"<div class=\"\"><div> <span>You see her sticking it under the wardrobe to push you out, so you panic and run. When you make it out she puts her hands around you to trap you. \" Well I thought getting you was gonna be harder than that!\" She laughed. \"I guess you actually wanted to be the little mouse, huh?\" She then opens her mouth and plops you in. \"Mmm\" you hear her moan around you.<br>\r\n<br>\r\n\"Ugh, let me out.\" You say disgusted.<br>\r\n<br>\r\n\"Don't forget, this was your idea little guy.\" She said. She closed her mouth and played with you a little. After a while she decided to...</span></div></div>",
            "created":1584766800,
            "id":2804684,
            "title":"You panic and run"
        },
        "111321212221":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "The next morning",
                "You finish"
            ],
            "content":"<div class=\"\"><div> <span>After a while she decided to spit you out. \"Ughhh, for the record that wasn't my idea!\" You about.<br>\r\n<br>\r\n\"But you chose to have fun with me.\" she said smilies. \"Besides, I thought it was fun.\"<br>\r\n<br>\r\n\"When you said fun I thought you meant, you know...\"<br>\r\n<br>\r\n\"Oh I did mean that, until I licked you that is. Then I found out how good you tasted!\"<br>\r\n<br>\r\n\"Great\" you say. \"Now what!?\" <br>\r\n<br>\r\n\"Well, we could still have some of that fun.\" she said. \"Just let me get one good luck in first.\"<br>\r\n<br>\r\n\"Ughhh.\" you said disgusted as you felt the big wet tongue licking you.<br>\r\n<br>\r\nShe than shoved you into her genitals. \"Go in deep for me.\" She said. You proceeded to follow her instructions. You heard a loud moan come from her. The two of you proceeded to have a good night.</span></div></div>",
            "created":1584865620,
            "id":2805008,
            "title":"Spit you out"
        },
        "1113212122212":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Go at it again",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>The two of you finished. \"Oh that was good.\" She said.<br>\r\n<br>\r\n\"Agreed. I feel like we should've gone over this a lot sooner but what's your name?\" You asked.<br>\r\n<br>\r\n\"Rachel. What's yours.\" Rachel asked.<br>\r\n<br>\r\n\"Jim.\" You respond. After you talk a little the two of you...</span></div></div>",
            "created":1586243880,
            "id":2814750,
            "title":"You finish"
        },
        "11132121222121":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "You lay there until you fall asleep",
                "Go get food or do something else"
            ],
            "content":"<div class=\"\"><div> <span>Go at it again. \"Go in deep for me Jim. Make sure to get a lot more movement in, it'll feel a lot better for me.\" Said Rachel. As she moved Jim back down to her genitals. Jim then jumped in and made more movement for Rachel. Jim began began trying to f*ck a fleshy wall in her vagina, he than heard moans coming from Rachel. \"Yes! Whatever you're doing don't stop!\" She said clearly enjoying herself. She then stuck her index finger in gently to push Jim down further in. Not long after Rachel came. Jim was forced out of Rachel's vagina.<br>\r\n<br>\r\n\"That was better than last time.\" Jim said.<br>\r\n<br>\r\n\"Yeah, it was.\" Rachel responded. She than picked up Jim and brought him to her mouth. \"Jim, cum for me. She said as she put her lips over Jim's penis. It barley was able to fit between her giant lips but managed. Jim than started panting and blew his load not long after. \"Mmm.\" Nice and salty Rachel said.<br>\r\n<br>\r\n\"So was yours.\" Jim responded.<br>\r\n<br>\r\n\"Oh so you got a little drink in, huh? Why don't you go back in!\" Rachel said, shoving Jim back in.<br>\r\n<br>\r\n\"Alright let me out!\" Jim screamed.<br>\r\n<br>\r\n\"What's the magic word?\" She asked.<br>\r\n<br>\r\n\"Please!\" Jim answered.<br>\r\n<br>\r\n\"Alright I'll let you off easy this once!\" Rachel said.<br>\r\n<br>\r\n\"What now? Jim asked.<br>\r\n<br>\r\n\"I don't know. We already spent a lot of time having our little version of sex.\" Rachel responded. \"We can get something to eat, or just lay hear until we go to sleep. Then if you want, we can have more fun in the morning!\" Rachel said seductively.<br>\r\n<br>\r\n</span></div></div>",
            "created":1588476000,
            "id":2829011,
            "title":"Go at it again"
        },
        "11132121222122":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Go to sleep",
                "Go have dinner"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices: After you talk a little the two of you...</span></div></span></div>",
            "created":1586245380,
            "id":2814756,
            "title":"More choices"
        },
        "111321212222":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "content":"<div class=\"\"><div> <span>After a while she decided to swallow you. She began to tilt her head back. \"H-hey!? What are you doing!?\" You scream. You try to grab at her tongue but you get pulled into her throat.<br>\r\n<br>\r\n\"I'm sorry little guy. I know this wasn't the plan, but you just taste so damn good!\" She then swallows.<br>\r\n<br>\r\n\"W-Wait!\" You yell, but you're pulled into her throat. You begin to slide down the esophagus and land into her stomach. You are digested not long after.<br>\r\n</span></div></div>",
            "created":1586048640,
            "id":2813397,
            "title":"Swallow you"
        },
        "111322":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "She remains asleep",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As she slowly falls asleep you become curious as to what's down there and begin to approach.</span></div></span></div>",
            "created":1584766800,
            "id":2804475,
            "title":"you get curios as she falls asleep and you expl..."
        },
        "1113222":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "She doesn't mind",
                "She freaks out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She wakes up and notices you approaching her genitals.</span></div></span></div>",
            "created":1584766800,
            "id":2804479,
            "title":"More choices"
        },
        "11132222":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Noooo!!!!!!",
                "Fine"
            ],
            "content":"<div class=\"\"><div> <span>\"What are you doing!\" She yells as you quickly get away.<br>\r\n<br>\r\n\"Uh n-nothing!\" You say back to her scared.<br>\r\n<br>\r\n\"Really?! Cuz it looks like you're trying to get up in my genitals!\" She yells.<br>\r\n<br>\r\n\"Well, why do you care so much?! You say back to her.<br>\r\n<br>\r\n\"Excuse me?!?!\" She yelled confused.<br>\r\n<br>\r\n\"You're undressed in front of me, and you had me in your cleavage earlier, so why do you care so much?\" You ask her actually wondering why now.<br>\r\n<br>\r\n\"Well I care because you didn't have my permission to go under there and check me out! If you asked I 'might' have gave you permission to go down there! She yelled still annoyed and put emphasis on the word might.<br>\r\n<br>\r\n\"Well, could I go down there? You ask her.</span></div></div>",
            "created":1584863280,
            "id":2804994,
            "title":"She freaks out"
        },
        "111322221":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Went to sleep",
                "Watched T.V."
            ],
            "content":"<div class=\"\"><div> <span>\"Noooo!!!!!!!!\" She yelled disgusted. \"What's wrong with you!?\"<br>\r\n<br>\r\n\"Well you had me in your cleavage without my opinion of the situation!\" You yell back at her. Besides, you didn't totally answer my question of why your so mad!\"<br>\r\n<br>\r\n\"I uh, ... Fine!!!\" She yelled. You get a free pass this time!<br>\r\n<br>\r\nYou smirk knowing she couldn't come up with an excuse. The two of you both got out of the tub and dry off. \"It's dinner time.\" she said. \"We'll be having spaghetti.\" The two of you then head to the kitchen where she serves you.<br>\r\n<br>\r\n\"Thank you Ms...\"<br>\r\n\"Just call me Angela\" she quickly. \"Angie for short.\"<br>\r\n<br>\r\n\"Thank you Angie!\" You say to her. \"This is delicious!\"<br>\r\n<br>\r\n\"Thanks\" she said.<br>\r\n<br>\r\nAfter you two finished you...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1584864240,
            "id":2804999,
            "title":"Noooo!!!!!!"
        },
        "1113222211":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "To go to school",
                "Starting the weekend"
            ],
            "content":"<div class=\"\"><div> <span>Note: I know I got the nurses name wrong but I'm not changing cuz it'll probably just add to more confusion.<br>\r\n<br>\r\nAfter the two of you finished dinner you went to bed. You watched as Angie got in her Pj's. You got undressed and decided to just sleep in your boxers.<br>\r\n<br>\r\n\"S-sorry about earlier.\" Angie said. \"I might have overreacted considering what I did. I just didn't want you looking at me without my permission, but I guess that's unfair to you.\"<br>\r\n<br>\r\n\"It's fine.\" You tell her. \"Let's just go to sleep.\" The two of you go to sleep, then wake up in the morning<br>\r\n<br>\r\n</span></div></div>",
            "created":1586335020,
            "id":2815344,
            "title":"Went to sleep"
        },
        "112":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "You get changed and get out",
                "something get dropped on you"
            ],
            "content":"<div class=\"\"><div> <span>You make your way to gym. You enter the locker rooms and realise that there isn't a separate one for boys. You feel a bit ashamed seeing all the giant girls getting changed but see that the boys are on the bench getting on with changing. You climb stairs onto the giant bench.</span></div></div>",
            "created":1339563600,
            "id":1358656,
            "title":"Gym"
        },
        "1121":{
            "author_id":"flamelord",
            "author_name":"Flame",
            "choices":[
                "Having a free day  do whatever you want",
                "Mandatory lecture about how to get thing unnamed from certaint areas",
                "Playing soccer"
            ],
            "content":"<div class=\"\"><div> <span>Fearing what might happen you quickly get changed and run back out into the gym. Most of the class is already out and lined up for attendance. Once the teacher finishes attendance she turns and says \"alright class. Today we are _____.\" She said.</span></div></div>",
            "created":1503378000,
            "id":2372731,
            "title":"You get changed and get out"
        },
        "11212":{
            "author_id":"flamelord",
            "author_name":"Flame",
            "choices":[
                "Continue "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Meant to be Unjammed! Auto correct!</span></div></span></div>",
            "created":1503378000,
            "id":2372732,
            "title":"AUTO COREECT "
        },
        "1122":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "Thong",
                "a pair of socks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was a....</span></div></span></div>",
            "created":1339563600,
            "id":1358658,
            "title":"something get dropped on you"
        },
        "11221":{
            "author_id":"vaji",
            "author_name":"Vaji",
            "choices":[
                "Twerk Practice.",
                "Volleyball Practice."
            ],
            "content":"<div class=\"\"><div> <span>You were just about to put your shorts on as you felt a shadow loom above you, before your vision turned dark.<br>\r\n\"Guys, come on. Give it back\" a girl's voice would be heard as you felt your whole world turn upside down, jostling you around.<br>\r\n<br>\r\nShe'd grab the waistband as you felt everything steadying, making you able to realize where you were. The wretched stench of ass and sweat quickly fills your nostrils as you felt your hand press against something moist. Looking up, you'd see a towering white girl above as she lowers you towards her feet, your eyes directly drawn to the massive, bubblebutt which stuck out like a shelf as she groaned, huffing at the other girls for bullying her. Her fat ass would jiggle as she shifted around her weight, causing it to clap momentarily as she stuck her feet into the legholes.<br>\r\n<br>\r\n\"I'm in her thong!... H-hey, wait, I'm down here!\" You'd scream up at her but it was no use, she'd jiggle her underwear slightly, causing you to fall face first into the back of her undies as you'd lift your face, realizing a brown streak which stuck to your cheek as your blood ran cold, as if by coincidence, she'd suddenly speak to herself.<br>\r\n\"Oh God, that taco we had for lunch is upsetting my stommach\". You'd whine, squirming around as you tried to find a way out, but her thighs were way too thick to drop down the leg holes, she'd jostle the panties as she struggled to fit them around her hips, causing you to fall backwards and land on your back against the back of her undies as she tugged and pulled. Finally able to get them around her monstrous cheeks as she sent you shooting up into her buttcrack, firmly lodging you against her asshole.<br>\r\n<br>\r\n\"Alright ladies... And boys... It's going to be a hectic gym pass today, and as always, I won't tollerate any slacking whatsoever, first person who gets \"Tired\" will be severely punished. Though you know this already, anyway, on the schedual today we have...\"</span></div></div>",
            "created":1459054800,
            "id":2123749,
            "title":"Thong"
        },
        "11222":{
            "author_id":"lennykappas",
            "author_name":"LennyKappas",
            "choices":[
                "Gymnastics class",
                "Warmup exercises"
            ],
            "content":"<div class=\"\"><div> <span>You felt something damp fall on your body, as you hear some giggling in the distance. It appears that you've had a damp black thigh high sock dropped on you! \"It smells like it hasn't been washed for a week!\" Says one of the girls in the distance.\"I bet the boys will like this~\" taunts annother, you feel the sock being picked up with you in it, it seems like you were the only one to get caught. As the girl begins to pull the black sock over her foot, you gag for air as the air is incredibly hard to breathe. You feel the ball of the girl's foot press against you, as she stretches the sock up to her thigh. The class begins as the girls walk out in just their socks, it seems like they're going to be doing...</span></div></div>",
            "created":1493787600,
            "id":2314537,
            "title":"The Putrid Prison"
        },
        "112222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "soccer",
                "dodgeball"
            ],
            "content":"<div class=\"\"><div> <span>You hear \"okay class, we're going to start with some warmup exercises! Now everyone jog in place!\" You couldn't believe your bad luck!  The girl's foot came up and down right on your face repeatedly. You hear \"Okay, now make a tent with your body!\" The foot lifted, and you slid down to the toe section. The disgusting toes then came down on your face and pressed in on your cheek. <br>\r\nThere were several more warmups, and then the teacher said \"now, we're going to play...</span></div></div>",
            "created":1526274000,
            "id":2493218,
            "title":"Warmup exercises"
        },
        "12":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "she leans back",
                "she gets up"
            ],
            "content":"<div class=\"\"><div> <span>While Your sitting there learning Some of the normal kids decide to have some fun. Two of them grab you from behind. \" so new kid wanna have some fun?\". You don't think this will end well. They shove you to the end of the large desk. you see a giantess sitting in front of you. she's leaning forward so a little bit of her butt is showing. \" meet your new home\" one of them says then they shove you over the edge. you fall for ages until you fall right into the giantess's crack. she doesn't seem to notice. you landed right in between her cheeks so it softened your fall but doesn't mean your safe.  </span></div></div>",
            "created":1339477200,
            "id":1358624,
            "title":"something happens"
        },
        "121":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "You try to get out",
                "You get shoved deeper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She leant back in her chair which shoved you deeper in her crack. The smell suddenly hits you. you definitely don't want to go deeper. </span></div></span></div>",
            "created":1339563600,
            "id":1358625,
            "title":"she leans back"
        },
        "1211":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "Screw it, jump!",
                "Be safe, wait it out"
            ],
            "content":"<div class=\"\"><div> <span>Pushing your feet against the side of her gigantic ass you manage to unwedge yourself and fall into the back of her panties.<br>\r\nLooking up you see the waistband. \"Its just out of reach\" you think to yourself. You could jump for it, but that would probably<br>\r\ndraw attention and you don't know how she would react. Or you could just wait for a better moment.</span></div></div>",
            "created":1360731600,
            "id":1531225,
            "title":"You try to get out"
        },
        "12112":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "She sees you",
                "She doesn't see you"
            ],
            "content":"<div class=\"\"><div> <span>As you're waiting, a gale suddenly hits you hard and sends you into the giant's panties. Recovering from the hit, you immediately recoil from the stench from the girl's SBD, before you feel your surroundings move, indicating your captor is quickly moving. The question is where?<br>\r\n<br>\r\n**************************************************************************** **************************************************************<br>\r\n<br>\r\nMelody Jones was rubbing her uncovered belly, gas at her back door and feeling hungry, when she felt something small go into her butt crack. Thinking it was dust or something of the like, she paid it no mind. Another reason why she couldn't check on it was the fact she needed to fart, so Melody let a SBD out. \"Why do I get hungry when I'm gassy,\" she thought to herself as she got up and headed to the bathroom. Entering the bathroom, she sees herself in the mirror. The blonde was wearing red rimmed glasses, glossy lipstick, a dark pink shirt with a cat head shaped cleavage window, beige sandals, white mini skirt, and a matching set of neon green panties and bra. Holding her double F boobs, and checking out her wide hips, wider than her shoulders, and a massive rump, peeking under skirt, she ponders: \"I won't get a lover, if people found out that I get serious gas from virtually anything. Speaking of, I feel completely starved, so what should I get to eat?,\" A loud, damp fart erupts from her ass, shifting her blue eyes to it and then to a stall, before heading there. After closing the door before her, she pulls down her panties and sits on the toilet, before releasing her farts and poop into it.<br>\r\n<br>\r\n**************************************************************************** ***************************************************************<br>\r\n<br>\r\nLight enters your world as the girl drops her panties, blinding you for a moment. After recovering, you run a good distance and turn to see who you were stuck with. You were impressed by the blonde bombshell, but after being blast twice by her farts, having yourself in the ladies' room, and hearing what she was putting in the toilet, you weren't quite fond of letting yourself of being found. A cramp goes through the giantess's belly, causing her lean forward and release a large stream of feces into the can. Does she see you?</span></div></div>",
            "created":1461128400,
            "id":2136553,
            "title":"You can wait, but she can't"
        },
        "121121":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Believes you",
                "Doesn't believe you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She see's you. \"What the @#$%!!!\" She yells. After a bit she's able to get you out. \"How did you get in there!\" She yelled furiously. You begin to explain the whole thing to her. She...</span></div></span></div>",
            "created":1584853200,
            "id":2804978,
            "title":"She sees you"
        },
        "1211211":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "The next day"
            ],
            "content":"<div class=\"\"><div> <span>\"Ughhh those idiots!\" She says clearly still annoyed.<br>\r\n<br>\r\n\"S-sorry.\" You say nervously.<br>\r\n<br>\r\n\"It's fine, it's not your fault.\" She sighed. \"W-wait! How much did you hear before you got out!\" She yelled.<br>\r\n<br>\r\n\"Uh everything.\" You say still nervous.<br>\r\n<br>\r\n\"Ughhh, please don't tell anyone.\" She says clearly stressed out.<br>\r\n<br>\r\n\"It's fine, I won't tell anyone don't worry.\" You say to her. She looks a little relieved.<br>\r\n<br>\r\n\"Thanks.\" She says relieved. \"So, you want to get revenge on those kids.\" she says in an excited tone.<br>\r\n<br>\r\n\"Definitely!\" you smile back at her.</span></div></div>",
            "created":1584853200,
            "id":2804985,
            "title":"Believes you"
        },
        "1212":{
            "author_id":"texco7",
            "author_name":"tex",
            "choices":[
                "he slips again",
                "he gets his foot out",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>She feels her but showing so she pulls up her pants into a wedgie. This does not work out for Jim, he get push right against her anus. The smell isn't as he thought it might be but it isn't great either.<br>\r\nA pulsing pink hole sits in front of Jim. He tries to move away from it but hes to deep in the giantesses ass. This only causes her pleasure making everything sweaty. Jim tries to kick away but slips from the sweat. His foot is sucked into the hole. It closes around his foot, sucking him in.</span></div></div>",
            "created":1357362000,
            "id":1502296,
            "title":"You get shoved deeper"
        },
        "122":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "teacher trips unaware scoops you up in cleavage",
                "you run into a random room"
            ],
            "content":"<div class=\"\"><div> <span>suddenly the giantess gets up and her ass cheeks close in securing you in place, but as she got up she slipped backwards and her hand (desperately trying to grab something) hits most of the tiny students onto a vacant seat, which was then soon replaced by a cheerleader and her skirt, by then the giantess had grabbed a table and had stood up and had started walking, with each step you would get moved left then right, then finally she stopped walking and entered a room and then into a separate area and closed the door, suddenly you are dropped but land in her panties as it acts as safety next, quickly you make it out of her panties undetected and make it out of the bathroom then...</span></div></div>",
            "created":1577854800,
            "id":2767999,
            "title":"she gets up"
        }
    },
    "info":{
        "author_id":"texco7",
        "author_name":"tex",
        "brief_description":"You have been enrolled to a school for giantess's. Please help out and make additions!",
        "created":1339562220,
        "description":"<td align=\"left\" class=\"norm\">In a world where there are giant people, there are giant schools. And there are separate schools for normal people. But one giant girls school has started to let normal boys ( or tiny form there point of view) enroll into the school. Its a cheap alternative to normal schools, but for the boys its not always a good thing.<br>\r\n<br>\r\n<br>\r\n<br>\r\nOver 7,000 views, which great but i need more additions, please, nearly anything except bad grammar  goes!<br>\r\n<br>\r\n</td>",
        "id":1873397,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602543600,
        "modified":1602543600,
        "pretty_title":"The Giantess School"
    }
}