{
    "chapters":{
        "1":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "Fart torture",
                "Armpit torture",
                "Foot torture",
                "She kisses him",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Sasha was relaxing at last. She had spent the entire day getting everything ready for the most epic sleepover ever! Tonight Kyle would be arriving and she wanted to have a lot of fun!<br>\r\n<br>\r\nDING DONG!<br>\r\n<br>\r\nShe stood up quickly and ran to the door, opening it to let Kyle in!<br>\r\n<br>\r\nWhat's the first thing she wants to do?</span></div></div>",
            "created":1332565200,
            "id":1301502,
            "title":"The sleepover begins"
        },
        "11":{
            "author_id":"liamkennedy",
            "author_name":"LiamKennedy",
            "choices":[
                "She continues to fart",
                "She moves on to scat",
                "She moves on to watersports",
                "Someone breaks in",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Sasha smirked as she pulled Kyle into the living room. She could feel a rumbling in her stomach and she knew what that meant. She pushed him back and he gasped as he landed on the couch. She quickly turned around and backed into him, her butt connecting with his face.<br>\r\n<br>\r\n\"What are you doing?\" He asked, but before she could give him an answer.<br>\r\n<br>\r\nPPPPPPFFFFFFTTTTTTT!!!!!!<br>\r\n<br>\r\nAn explosion of gas errupted in his face, blowing his hair back. A horrible smell followed shortly afterwards. He tried to pull away but she wouldn't let him, backing up further and pressing him back further against the couch.<br>\r\n<br>\r\n\"That's nothing,\" she giggled.<br>\r\n<br>\r\nBBBBBBBBBBBBBBBRRRRRRRRRRRRAAAAAAAAPPPPPPPPPPPPPPPPPPPTTTTTTTTTTTTTTTTT!!!!! !!!!!!!!!<br>\r\n<br>\r\nAn even bigger fart had escaped with an even worse smell.</span></div></div>",
            "created":1332565200,
            "id":1301506,
            "title":"Fart torture"
        },
        "111":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "Sasha deside to smother Kyle with her butt.",
                "Sasha take off Kyple's pants and give him a hand job.",
                "Sasha takes her socks and forced them  in Kyle's mouth."
            ],
            "content":"<div class=\"\"><div> <span>PPPPPHHHHHHHHPPPHHBBBTTTTTTT!!!!!!!\"<br>\r\n<br>\r\nSasha's thrid fart was even worse the the other two.  It smelled of old cabbage, eggs, and even feces.<br>\r\n<br>\r\n\"Oh my God.  It's so bad.\"  Kyle thought.  Kyle could not escape.  He try to move back, but Sasha forced her butt to his face.<br>\r\n<br>\r\n\"Oh, no.  You not going to escape from  methat easily.  She said.  She grab Kyle's hand and forced him into her butt.<br>\r\n<br>\r\n\"Smell it.  Smell my nasty farts!\"  She demanded.<br>\r\n<br>\r\nFFFFBBBBBBAAAPPPTTT!!!!!!<br>\r\n<br>\r\nSasha stood on the couch and foced Kyle on his back.  Kyle head as at the arm of the couch.  Sasha sat on his face, and settle her clothed butthole over his nose.  She unleased a barrel of farts.<br>\r\n<br>\r\n\"Brrupp!, Farrsshh, SSHHHTT, KRuupppp!!!\"<br>\r\n<br>\r\n\"Oh, that feel good.  to get all that out.  \"  Sasha said as she sat on Kyle face.  She slowly got up and stood over him.  She undress, taking off her blouse, shorts and shots.  She was only wearing panties and socks.  She look down and poor Kyle.<br>\r\n<br>\r\n\"Now the real fun begins.</span></div></div>",
            "created":1362632400,
            "id":1545317,
            "title":"She continues to fart"
        },
        "1111":{
            "author_id":"nearwhites",
            "author_name":"Nate",
            "choices":[
                "Farts and make you sniff her asshole",
                "She took off her panties, letting you admire her bare ass",
                "Go upstairs to the bathroom or her room"
            ],
            "content":"<div class=\"\"><div> <span>Sasha was stepped up in the couch, Kyle was looking above, her rounded rear end look huge in the light blue panties that she was wearing, because most part of the panties were stuck in her crack, which let Kyle see the difference in the depth.<br>\r\nHer ass has always been huge, once time Kyle and her were stepped up talking, and suddenly she pushed you with her booty as a joke, you immediately fall to the floor.<br>\r\n<br>\r\nSasha sat right in Kyle's face, making his nose coincide with her coin slot.<br>\r\n<br>\r\n''This feels just so great!'' Sasha said<br>\r\n<br>\r\nKyle at this point could barely breathe, and the smell wasn't pretty nice.<br>\r\n<br>\r\nSasha lift her butt for a few seconds, giving time to Kyle for breathe. After she put her ass closer again and started to grind it, forwards and backwards.<br>\r\n<br>\r\nKyle had the taste of Sasha's back door in his nose, and now, he have in his mouth.<br>\r\n<br>\r\nSasha lay forwards, separating her cheeks, and then pushing harder in Kyle's face.<br>\r\n<br>\r\nThe world that Kyle could see was light blue, soft, and very strong.<br>\r\n<br>\r\n''Hey Kyle... I have and idea for us to play''<br>\r\n<br>\r\nWhat's her idea?...<br>\r\n</span></div></div>",
            "created":1483246800,
            "id":2257525,
            "title":"Real fun"
        },
        "11111":{
            "author_id":"flbkt",
            "author_name":"Flbkt",
            "choices":[
                "Both sides of the coin are heads",
                "When Sasha gets off of him, somebody else will get on"
            ],
            "content":"<div class=\"\"><div> <span>\"Here's how it's gonna go,\" She started to explain \"I have a coin. Every time I fart and you take a big whiff of it during, not before or after, the fart I flip the coin. If it lands on heads, I get to keep going. If it lands on tails, I get off of you. How's that sounds?\"<br>\r\n<br>\r\n\"Since it's a 50% chance of not having to continue smelling your farts, yeah\" replied Kyle<br>\r\n<br>\r\n\"Alright.\" said Sasha as she position her butt. \"Here it comes...\"<br>\r\n<br>\r\nPPPPPPPPPPPPPFFFFFFFFFFFFFFFFFFTTTTTTTTTTTTTTTTT!<br>\r\n<br>\r\nKyle took a big whiff during the fart, his nostrils burned from the foul smell.<br>\r\n<br>\r\n\"Now the coin\" Sasha flipped the coin and it landed on heads. \"Looks like we keep going.\"<br>\r\n<br>\r\nKyle sighed as he prepared for the next one, hoping for tails to come soon. Unknown to Kyle though...</span></div></div>",
            "created":1509944400,
            "id":2411998,
            "title":"Farts and make you sniff her asshole"
        },
        "11112":{
            "author_id":"ernestbesto",
            "author_name":"Wolf",
            "choices":[
                "She farts up his nose",
                "She takes a dump on him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sasha then removed her underwear and gave Kyle the full view of her bare ass. She then sat back on his face sticking his nose right up her asshole.</span></div></span></div>",
            "created":1571007600,
            "id":2732443,
            "title":"She took off her panties, letting you admire he..."
        },
        "1112":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "Kyle resists cumming, so he get a blow job",
                "Kyle resists cumming! Intercourse",
                "Kyle cums, It punishment fart time"
            ],
            "content":"<div class=\"\"><div> <span>Sasha move over Kyle and start to unbutton his pant.  Kyle was still recovering from the nasty farts that he had to endure, so by the time he notice what she was doing, his pants was already down.<br>\r\n<br>\r\n\"Sh-S-Sasha, what are you doing?\"<br>\r\n<br>\r\nSasha gave him a wicked grin.  \"You took my Farts like a Pro, so I'm going to reward you.<br>\r\n<br>\r\nSasha took off Kyle's pants  and underwear completly and grab his cock. and start stroking up and down.  She is rough at first, but she soon develops a patterm that Kyle find it's hard to resist.  His cock become full erect, and his balls are boiling with seman.  He fill himself getting ready to cum.<br>\r\n<br>\r\n\"Don't come yet.\"  Sasha said as she contiune to stroke him.  \"If you can last a little long, I will reward you.  If you cum than....I have to punish you for being such a bad boy.\"</span></div></div>",
            "created":1395291600,
            "id":1763618,
            "title":"Sasha take off Kyple's pants and give him a..."
        },
        "11121":{
            "author_id":"sweet3",
            "author_name":"Chad White",
            "choices":[
                "Sasha decided to go back to business on Kyle",
                "Others join in "
            ],
            "content":"<div class=\"\"><div> <span>Wait! Kyle says. You're gonna make me cum too fast and I want to enjoy myself. <br>\r\nOkay, Sasha says. So what do you want to do?<br>\r\nWell there are more girls here and I personally want to see how Annie smells.<br>\r\nAnnie's eyes widen as she looks at Kyle in shock.<br>\r\nKyle we've been best friends for 3 years! That'd be so weird! <br>\r\nYea and I've always wanted to motorboat between your little ass cheeks. <br>\r\nAnnie was uncomfortable, but slightly aroused by Kyles request. The red head shuffled her way over to Kyle on the couch and said, Well if you really have been waiting this long than you may as well enjoy yourself now while you have the chance. <br>\r\nSasha got off of Kyle and he pulled himself up to the side of the couch where Annie stood. She faced the opposite direction in her floral blouse and grey yoga pants. She leaned over slightly and awaited Kyles nose. Kyle was full of excitement and grabbed both of his best friends ass cheeks. <br>\r\nWell what the hell are you waiting for? Annie said<br>\r\nThen Kyle shoved his face directly into Annie's ass and her eyes bulged from their sockets. She squealed with delight and let lose a small fart. Kyle sniffed it up, and it smelled like strawberry perfume mixed with Annie's personal musk. She began to get more into it and she created an arch in her back, grabbed the back of Kyles head, and shoved it further into her ass so his nose was directly inside of her asshole over the fabric of her thin yoga pants. Kyle rubbed his nose up and down her crack causing it to heat up and she jittered with delight. Suddenly she felt a rumble in her little tummy and she pulled down her yoga pants revealing her pink panties to him. She looked him in the eyes grabbed his head and shoved him back in as she released the most revolting loudest fart she had ever made. All the girls were grossed out, but Kyle was in heaven as he touched her soft porcelain skin and tugged at her ruby read hair.</span></div></div>",
            "created":1432875600,
            "id":1984701,
            "title":"Kyle resists cumming, so he get a blow job"
        },
        "1113":{
            "author_id":"brerfox01",
            "author_name":"applefart",
            "choices":[
                "She moves on to foot torture",
                "She gives him wedgies",
                "Swirly in her poop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sasha is wearing long tube socks and takes one off, shoving it in Kyles mouth. Kyle gags on the salty taste as Sasha holds the sock in his mouth, forcing him to drink her foot sweat.</span></div></span></div>",
            "created":1461819600,
            "id":2140382,
            "title":"Sasha takes her socks and forced them  in Kyle&..."
        },
        "113":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "She farts at the end",
                "She continues the toilet torture",
                "She invites a friend over"
            ],
            "content":"<div class=\"\"><div> <span>She giggled a little. <br>\r\n<br>\r\n\"I need to pee,\" she said, moving away from your face. A moment later, she was hovering over your face again, her pants and panties down. Your eyes went wide as you realised what she intended to do.<br>\r\n<br>\r\nA thick stream of yellow tinted liquid trickled from her vagina, straight into your mouth. You felt sick instantly as you tasted the salty liquid, but you knew that it wouldn't end well for you if you moved your mouth away.</span></div></div>",
            "created":1387774800,
            "id":1712430,
            "title":"She moves on to watersports"
        },
        "1133":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "Lauren",
                "Justin",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Who does she invite over?<br>\r\n<br>\r\nLauren. Aged 21. Lauren is her college friend. She is athletic and thin with brown hair and pale skin. She is about five and a half feet.<br>\r\n<br>\r\nJustin. Aged 18. He is her gay friend who has a crush on you. He is athletic with dark skin and black hair. He is about six feet.</span></div></div>",
            "created":1416286800,
            "id":1889179,
            "title":"She invites a friend over"
        },
        "115":{
            "author_id":"evilguy496",
            "author_name":"evilguy496",
            "choices":[
                "Kyle gets revenge",
                "More people come",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happened?</span></div></span></div>",
            "created":1332651600,
            "id":1302086,
            "title":"Reader's choice"
        },
        "1151":{
            "author_id":"didget",
            "author_name":"didget",
            "choices":[
                "He keeps farting",
                "She overpowers him",
                "He needs to poop"
            ],
            "content":"<div class=\"\"><div> <span>As Sasha got up, Kyle pushed her down again and sat on her face and said, \"now it's my turn to fart in your face.\" Before she knew it a loud FFFFFFFFFFRRRRRRRRRRRRRRRTTTTTTTTTTTTTTTTTTTTT came out of his butt. He then said, \"did you enjoy that because i did,\" and farted again with a long FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFRRRRRRTTTT which hurt coming out. At this point, she was trying to get out with no progress.</span></div></div>",
            "created":1335330000,
            "id":1322411,
            "title":"Kyle gets revenge"
        },
        "11511":{
            "author_id":"gg05",
            "author_name":"brownbooty",
            "choices":[
                "Kyle farts hard",
                "Kyle needs to poop"
            ],
            "content":"<div class=\"\"><div> <span>Kyle continues to fart on Sasha, then takes off his jeans and boxers. \"Oh my God! Nooo...MMMPPHH!\" she<br>\r\nsays, after he sits back on her face. Sasha is now sniffing Kyle's butt. He nose tickles his anus, prompting<br>\r\nhim to fart some more. BBBRRRRUUUMMMPP! \"Ahhh... that feels so good, doesn't it?\" \"MMMPPPHH!\"<br>\r\nSasha mumbles again. The very odor of Kyle's foul butt reveals that he hasn't wiped or he ate some<br>\r\nbeans and cabbage. Sasha's nose is pressed into his butt some more and is forced to sniff hard... </span></div></div>",
            "created":1347858000,
            "id":1429665,
            "title":"He keeps farting"
        },
        "115111":{
            "author_id":"gg05",
            "author_name":"brownbooty",
            "choices":[
                "Kyle eats more gassy food (fart torture)",
                "Kyle gets a blanket (dutch oven)"
            ],
            "content":"<div class=\"\"><div> <span>Kyle lets out a huge butt blast. BBBBBBBRRRRRRRAAAAPPPP! The fart burnt Sasha's nose and she gags non-stop. Kyle's<br>\r\nbutthole now really hurts from that last strain. He spreads his cheeks wide open and Sasha is now facing his hairy and sweaty<br>\r\ncrack. He shoves her pretty little face into it and sits on it. Sasha swirls around to move from the offending odor, until she passes<br>\r\nout.<br>\r\n<br>\r\nKyle, on the other hand feels relaxed. \"That feels so good of you wiggling in my ass, huh Sash? Sasha?\" He turns around to<br>\r\nsee she's passed out in his butt. He then gets an idea...</span></div></div>",
            "created":1348030800,
            "id":1430925,
            "title":"Kyle farts hard"
        },
        "115112":{
            "author_id":"evilguy496",
            "author_name":"evilguy496",
            "choices":[
                "He lets Sasha go",
                "He uses his imagination to do a different style of fart/toilet torture"
            ],
            "content":"<div class=\"\"><div> <span>As Kyle farts on Sasha, her nose tickles his hole again, which triggers his stomach to let go of the poop he had been holding in. \"Oh no, Sasha, I think I may have to use you as a toilet!\" Kyle said. Sasha struggles upon hearing this, which tickles Kyle even more. \"Sorry!\" Kyle shouted as the first wet turd hit Sasha's face. Some of it went into her nose, some of it went into her mouth, and the rest just splattered on her face. Now that Sasha's beautiful face is ruined, what does Kyle do next?</span></div></div>",
            "created":1347944400,
            "id":1430288,
            "title":"Kyle needs to poop"
        },
        "1151122":{
            "author_id":"gg05",
            "author_name":"brownbooty",
            "choices":[
                "tries to escape"
            ],
            "content":"<div class=\"\"><div> <span>Kyle then decides to get a box from the closet. Meanwhile, Sasha shakes the shit off her face and is relieved to get some fresh air, until<br>\r\nKyle returns. He picks up Sasha and sets her head in the box. The box is small with a hole on for the opening. Sasha's face faces the<br>\r\nopening and she struggles to be free. \"Kyle, what is this?\"  \"It's just a box...a fart box!\" he says, sitting down over it. Kyle adjusts his<br>\r\nbutt so far inside, Sasha's nose is inches away from his moist, nasty crack.<br>\r\n<br>\r\n\"Uh-oh, here comes another fart.\" PPRRIPPPPPPP! The fart is now trapped inside with Sasha, waiting to be inhaled. Sasha holds<br>\r\nher breath as long as she can. BBBBRRRNNTTTT! Sasha moans in disgust. \"Lick my butt!\" Kyle says. His butthole is in plain<br>\r\nview, leaving her no choice, but to lick. She sticks out her tongue and runs it over his splincher. Kyle moans when he feels her tongue.<br>\r\nFFRRRRRT! PPPMMMMM! BBRRAAAPPP! Kyle stomach rumbles again. <br>\r\n<br>\r\n\"I'm about to poop again.\" Before his finishes talking, Kyle takes more of a dump on Sasha's face. The shit runs out with more putrid<br>\r\nfarts. FFRRROOPPPTT! BRRUMMPP! Sasha gags and passes out...<br>\r\n<br>\r\nLater, Sasha wakes up and...</span></div></div>",
            "created":1349240400,
            "id":1439577,
            "title":"He uses his imagination to do a different style..."
        },
        "11512":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Kyle remains trapped under her gassy ass, and gets fart blasted.",
                "Kyle challenges her to a fart contest."
            ],
            "content":"<div class=\"\"><div> <span>Kyle let loose another smelly fart, unknowingly lifting his ads. Sasha pushed him off of her face, and sat back on his face, burrying him deep into her hairy smelly butt crack, pinning his arms underneath her feet.<br>\r\n<br>\r\n\"Ugh, that really stunk; but now it's time to smell some REAL farts.\" Kyle shouted into her ass crack as she let her full weight onto his face, and wiggled her ass further into his face, smearing the stink across his mug. Kyle raised his legs, trying to get Sasha's face into his ass only for her to grab his legs into a reverse crab hold, and keep his ass away from her face, and pointing away from her face.  To show how fruitless his attempts to fart on her and remove her were, she let loose a big smelly fart, worse than the two he blasted her.<br>\r\n<br>\r\nPPPPPPHHHHHHHHBBBBBBFFFFFFFFRRRRRRRRRRRRRPPPPPHHHH!!!!!!!!!!!!<br>\r\n<br>\r\nLetting out a mocking sigh of relief, Sasha rubbed her ass and fart further into Kyle's tortured face.<br>\r\n<br>\r\n\"That felt gooood, how's it smell down their fart face? Bet you wish you had farts as big, bad, and smelly as mine.\"</span></div></div>",
            "created":1472619600,
            "id":2204261,
            "title":"She overpowers him"
        },
        "1153":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Belching contest.",
                "Farting Contest",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sasha decides to have more fun with Kyle. What do they do?</span></div></span></div>",
            "created":1335502800,
            "id":1324016,
            "title":"More choices"
        },
        "12":{
            "author_id":"liamkennedy",
            "author_name":"LiamKennedy",
            "choices":[
                "Sasha convinces Kyle to worship her armpits",
                "Sasha forces Kyle to worship her armpits",
                "Sasha and Kyle do exercise to make her armpits worse (Kyle knows)",
                "Sasha and Kyle do exercise to make her armpits worse (Kyle doesn't know)",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sasha really wanted someone to worship her armpits but she wasn't sure if she was ready yet.</span></div></span></div>",
            "created":1332565200,
            "id":1301542,
            "title":"Armpit torture"
        },
        "124":{
            "choices":[
                "\"You're on!\" Let the game begin.",
                "After some more talking, Sasha gets Kyle to sniff her pits willingly. ",
                "\"No... Come to think of it, I don't like the sound of this bet.\""
            ],
            "content":"<div class=\"\"><div> <span>AS A LITTLE SIDE NOTE: Down this arc which will mostly be written by me, this will gradually turn into a BDSM story, or at least a 'Fuck Buddy' relationship with strong humiliation and sadism. If that's your thing, feel free to add to it but please keep it so the arc makes sense. If not, the 3rd option will always differ to Choices 1 &amp; 2 for you to add something... <br>\r\n<br>\r\nSasha opened the door for Kyle; “hey!” the smile on her face was a smile of pure joy with a touch of wickedness. Kyle blushed; looking at her nervously then looking at his feet, “Hi…” the way Kyle said that sounded almost creepy, his voice was unusually lower pitched than usual due to how nervous he was. As he said that he tugged on his colour and his brow began to sweat. Kyle was a submissive, and has had a crush on Sasha for near a year now and Sasha knew this. While she did not share her feelings for him, she was looking for a ‘Playpal’. College left her mentally and physically stressed and she wanted a Boy Toy to abuse and humiliate, as cold as that sounds. <br>\r\n<br>\r\n\"So are you coming in or what\" Sasha stood to the side of the door gesturing for Kyle to come in. She was wearing a thick wooly top with tight jeans and no socks on, the wooly top had a few loose threads and seemed a bit revealing, she looked as if she was not wearing anything on underneath and Kyle went to a great and painfully obvious effort 'not to notice'. He walked inside, facing in the opposite direction to her, he looked around her house in curiosity, the house was well furnished and clean with laminated flooring and Crimson wallpaper. <br>\r\n<br>\r\n\"So what do you want to do today?\" Kyle asked, mustering some confidence. He figured he couldn't be a nervous wreck the entire time he was there. He was not out to impress her, he had accepted the idea that she would never fall for him so he was not quite sure why he came round. Out of desperation perhaps. Sasha smiled and yanked him by the collar pulling him into the front room, she threw him onto one of the couches. \"Alright, what do you want to do, it's your choice! You're the guest, you know!\" She said laughing.<br>\r\n<br>\r\n\"Errrrr, Nintendo Wii? We could play Tennis... or something..\" \"Great! Tennis is good we can do that!\" After the Wii was set up and they began playing; things were going very well, they were having fun. However after about half an hour or so, they were both getting very tired and it had just dawned on Kyle how boiling hot it was in this room. \"Why is it so hot in here?\" Kyle asked, panting moderately. \"Sorry, I like it nice and toastie, I'll turn the heating off if you want. Kyle was surprised that she was not bothered by this, she was red hot, literally, and her body was soaked in sweat. \"I am getting tired though, perhaps I may turn it off... Do you mind if we call it a day with the Nintendo?\"<br>\r\n<br>\r\nKyle was really into playing Tennis with her, and they were tied, having won 2 games each. The games were short, fast paced, very tiring and competitive. \"Wait, can we play one more game? We're tied at 2 games! Why not put a bet on the last game and sees who wins?\" Kyle had such a childish grin it made Sasha smile. \"Okay then, what are the stakes?\" \"I don't know. You decide first, I'll pick something on par with your bet.\" Sasha circled the room twice slowly, looking up at the ceiling thinking for about 10 seconds before she had her answer. \"Let's see how daring you are... If I win, you have to sniff my armpits.\" she said lifting her arms up, you noticed how sweaty she was, but now you were focussed on her armpits, those big black stains gaping from her arm pits. A sudden impulse shot through Kyle's body to his crotch area and he felt it stiffen slightly. He then felt disgusted and embarrassed with himself for enjoying the thought of his nose being up her armpits. He wasn't sure what it was; the domination or just that type of body contact with Sasha. Anyhow, he said, \"You're on. If I win, you have too...\" The confidence from his voice slowly drained as he reached that final word, his head plummeted, \"kiss me.\" </span></div></div>",
            "created":1446786000,
            "id":2057568,
            "title":"Sasha and Kyle do exercise to make her armpits ..."
        },
        "1241":{
            "choices":[
                "Sasha wins.",
                "Kyle somewhat turns it around.",
                "Sasha pounces him and makes him smell her pits anyway. "
            ],
            "content":"<div class=\"\"><div> <span>The final game commenced, it was a long and competitive match, unlike the overs, after what seemed like the longest in the history of Tennis, Sasha slowly started to come out ahead. 15. Kyle was now worried about the possibility of losing, he was also weighing out whether or not he should let her win. He liked the idea of that sort of body contact with her but he did not like the idea of being humiliated in that way by his crush. It seemed like a cruel tease. These thoughts had him distracted, 30, Sasha was climbing ahead now in what was becoming a very one sided game. He began to panic and it had suddenly hit him how exhausted he was. 40, it was almost over...</span></div></div>",
            "created":1446786000,
            "id":2057577,
            "title":"\"You're on!\" Let the game begin."
        },
        "12411":{
            "choices":[
                "She continues with the armpit torture",
                "She stops "
            ],
            "content":"<div class=\"\"><div> <span>And Advantage. Game over. Kyle felt as if he may be sick out of anxiety, but he was also somewhat excited. Sasha looked at him with an evil sadistic grin, \"alright babes, you know the deal. Bet you wish you never bet against me now\" she said mockingly. She sat down on the sofa and stretched her arms, pretending to yarn, you stood, gormless, staring at her in shock over the situation. After 5 seconds, she looked at you fed up, \"are you not getting the hint, come here!\" You walked lifelessly towards her and you sat on the couch next to her, to her right. You slowly inched towards her pit as she laid stretched out over the couch and at that moment she pounced on you, knocking you on over on the couch, she laid on top of you with her armpit right in your face. \"Sniff it, bitch!\" she said authoritatively. You breathed in the sour vinegar stench through your nose.</span></div></div>",
            "created":1446786000,
            "id":2057592,
            "title":"Sasha wins. Armpit time. "
        },
        "124111":{
            "choices":[
                "She takes her jumper off and goes bare",
                "She switches to something else"
            ],
            "content":"<div class=\"\"><div> <span>She remained on top of you, rubbing her armpit into your face smearing the stench and sweat all over. The soaked cotten felt heavy on your skin, like a drenched flannel. \"Sniff harder! I want to hear you sniff!\" Kyle was completely helpless, part of him wanted to fight back, he sniffed her armpit and had followed through with the bet, the other half was in heaven, loving the domination. She moved her forearm behind your head and pushed you into her pit and began violently grinding your face into her pit. \"Why aren't you sniffing?\" You sniffed as hard as you could, *HHHHHHHNNNNNPPHHHHHH* Kyle sniffed as hard as he could, and again, *HHNNNNNNNPPPPHHHH* the smell of hot vinegar was ripe and dominating his senses.  \"You like that don't you?\" she said, continuing to rub her pit into your face. \"Open your mouth\" she said, you obliged and she pushed the sweaty cotton into your mouth and you began sucking on it. Figuring that was what she wanted you to do anyway. Lint was being sucked down your throat along with the sweat. Your mouth now tasted of sourly, like out of date Vinegar and it made you want to wretch but you continued in your attempt to please her. </span></div></div>",
            "created":1446786000,
            "id":2057610,
            "title":"She continues with the armpit torture"
        },
        "1241111":{
            "choices":[
                "Kyle begins licking her armpit",
                "Kyle fights and Sasha has to use force"
            ],
            "content":"<div class=\"\"><div> <span>As Kyle sucked away at her sweater, draining it of the lint, dirt, sweat and stench. The smell and taste was leaving Kyle feeling nauseous. After 10 minutes, Sasha sat back and began slowly peeling her sweater off. It took some effort as the sweat had seemingly glued it to her chest, Kyle realised what she was doing almost instantly and became extremely excited, his penis began to 'stand at attention'. When she finally pulled her sweater off and threw it to the floor, she sat back on your groin area and then jumped back when she felt Kyle's meat against her rear. Sasha began to laugh, \"so you're enjoying this?\" she jeered, leaning over you with her breasts hanging in your face. With the sweater no longer shielding you from her armpits, you could smell them from here and a drop of sweat from her chest dripped onto your forehead. As she began grinding on your groin area, you nodded as you began to lose yourself to the pleasure of her grinding on your groin. \"Well?!\" Sasha jeered again, \"yes I like it!\", Kyle snapped back quick and sharp, out of frustration but he was not unable to look her in the eye. As a responce to that, Sasha slapped him, moderately hard, not hard enough to leave a bruise or really hurt him but not gently, \"don't talk to me like that in my own house!\" her tone of voice when from teasing and friendly to authoritative and angry. It sent enough impulse through Kyle's body and he felt himself becoming more hormonal. Kyle went completely red because of both the slap and him blushing \"sorry...\"<br>\r\n\"It's fine, you can make up for it by licking my pits for me\" Sasha said, stretching her right arm out and slowly lowering it to Kyle's face...</span></div></div>",
            "created":1446958800,
            "id":2058534,
            "title":"She takes her jumper off and goes bare"
        },
        "13":{
            "author_id":"liamkennedy",
            "author_name":"LiamKennedy",
            "choices":[
                "She makes him suck her foot",
                "She makes him lick her foot",
                "He overpowers her",
                "Someone rings Sasha's phone",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Sasha led Kyle into the kitchen. The first thing that he noticed was that there was a chair in the middle of the kitchen.<br>\r\n<br>\r\n\"What's that doing there?\" He asked, turning around.<br>\r\n<br>\r\nSMACK!<br>\r\n<br>\r\nA saucepan hit him in the face and he fell onto the ground. Sasha pulled the chair in front of him and sat down, taking her right shoe and sock off. She placed her foot in front of his face.<br>\r\n<br>\r\n\"That's better,\" she giggled</span></div></div>",
            "created":1332565200,
            "id":1301572,
            "title":"Foot torture"
        },
        "131":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Open your mouth!\" Sasha commanded.<br>\r\n<br>\r\nKyle said \"Sasha Noo-\"<br>\r\n<br>\r\nWhile Kyle was objecting, Sasha shoved all 5 of her dirty, stinky toes in his mouth.<br>\r\n<br>\r\n\"MMMPH! His cheeks were bulging, and his eyes were tearing up.</span></div></div>",
            "created":1358226000,
            "id":1509313,
            "title":"She makes him suck her foot"
        },
        "1311":{
            "author_id":"ubuy271",
            "author_name":"ubuy271",
            "choices":[
                "Good job slave, you've served me well. Now you will receive your reward.",
                "You've failed to satisfy me slave, kneel before me and accept your punishment.",
                "You will make a fine permanent foot slave, Kyle. (Pulls out a shrinking device)"
            ],
            "content":"<div class=\"\"><div> <span>Sasha's sweaty toes continued to probe the insides of Kyle's mouth. She giggled at the sight of her friend, kneeling before her with her toes stuffed between his lips like an apple in the mouth of a roast pig. <br>\r\n<br>\r\n\"Suck! C'mon Kyle, my feet sweat a ton in my slippers, and I've been wearing them for hours just waiting for you to show up!\" Sasha's face seemed to glow with pride at her subjugation of her friend, relishing in the feeling of his tongue twisting in between the crevices of her long, painted toes. <br>\r\n<br>\r\nWhile Kyle's face showed a mixture of fear and disgust at the attack of his best friend, he couldn't deny that being dominated by Sasha was turning him on immensely. As he continued to suck bits of toejam from her foot, a bulge began to grow in his pants. As repulsive as the taste of her feet was, Kyle couldn't help but be aroused by her strong, commanding figure. Sasha raised an eyebrow at the sight of his growing erection.<br>\r\n<br>\r\n\"Really Kyle? I didn't think you were into my feet. If I'd known you would love it this much, I would've done this a hell of a lot sooner.\" The smiling seductress reached down and pushed Kyle down onto his back, guiding his face directly underneath the chair she was sitting on. <br>\r\n<br>\r\n\"Be a good little footstool for Goddess Sasha, and maybe I'll let you play with that little hard-on my feet have so graciously given you!\"<br>\r\n<br>\r\nKyle felt the warm size 11 soles of his friend lay on top of his face, covering his entire head and bathing him in the pungent scent of her foot odor. Kyle had still been trying to resist his urges and salvage the few shreds of dignity that he still had, but the feeling of his face being enveloped by the feet of his goddess drove him over the edge. His tongue lashed out, running over the wrinkles of her soles and feeling the contours of Sasha's immaculate feet as they wiggled in appreciation of his eager worship. Kyle could taste the salty flavor of her foot sweat as he continued lapping at her feet, coaxing a moan out of his friend-turned-goddess. Sasha then placed her left foot flat on his chest, forcing the heel of her other foot into his mouth.<br>\r\n<br>\r\n\"Suck, footstool. Run your little tongue along my heel and chew off the dead skin on my callouses. Serve me well, and you will be greatly rewarded.\" She gave a teasing smile to Kyle, who shut his eyes in ecstasy as his tongue continued to explore Sasha's sole. He nibbled lightly on the flecks of white skin around the edges of her heel, gaining an approving moan from the voluptuous vixen sitting above him. After serving her feet for a while longer, Sasha removed her feet from his face and eyed the bulge in his pants, twitching anxiously as it waited for her next move. Sasha gave him a sly, guarded smirk and said... </span></div></div>",
            "created":1462424400,
            "id":2143794,
            "title":"Continue to Suck..."
        },
        "13111":{
            "author_id":"killa229",
            "author_name":"1HornyMoFo",
            "choices":[
                "armpit torture",
                "Ass torture."
            ],
            "content":"<div class=\"\"><div> <span>\"Stand up and pull your pants down slave.\" He almost tore the butt one on his pants right off trying to get them off as fast as possible. Sash put her feet together and opened up a small space inbetween them. \"Stick your Cock right In there and thrust until you all over my feet.\" \"Yes mistress.\" was his simple reply. He obeyed and began to foot fuck her until he came all over her sexy feet.<br>\r\n<br>\r\n\"Look at the mess you made on my feet. Lick the. Clean.\" Sasha Demanded. \"Yes mistress.\" Was his reply once again. He began to lick his own cum off of his best friends feet. The reality hit him hard as he realized he came over to his friends house to hang out and instead became a foot slave and Sasha was his Mistress... And he loved it. He was so caught up in thinking he hadn't even realized he had stopped licking her feet. \"Slave I don't feel you tongue.\" \"Sorry mistress.\" He couldn't believe that he just apologized for not picking her feet. But he continued to lick until g<br>\r\nThe cum was gone he started at the heel and became to make his way to her toes.<br>\r\n<br>\r\n\"Good slave. Now that we've done that we should...</span></div></div>",
            "created":1474606800,
            "id":2213507,
            "title":"Good job slave, you've served me well. Now ..."
        },
        "131111":{
            "author_id":"killa229",
            "author_name":"1HornyMoFo",
            "choices":[
                "Someone knocks at the door.",
                "Someone on calls Sasha on FaceTime."
            ],
            "content":"<div class=\"\"><div> <span>\"Start cleaning some other parts of my body... Hmmm? I haven't showered in 3 days can you tell?\" She said grabbing his head and sticking it in her armpit \"Sniff. And make sure I can hear you smelling my pits.\" Sasha commanded. \"Mmphhh.\" He said as his face was buried in Miss Sahsa's smelly sweaty armpit. He sniffed exaggeratedly so she could hear him\"how does it smell? Good I would hope cause if they smell good I wonder how they TASTE.\" She let go of his hair and he leaned back a bit. \"Lick my sweaty armpits slave.\" \"Yes mistress he said again as leaned forward and stuck out tongue bracing for impact with her armpit.<br>\r\n<br>\r\nContact.<br>\r\n<br>\r\nThe was awful but he didn't want to find out what would happen if he disobeyed her. She hit over the head with a frying pan God knows she would probably beat him bloody if he didn't listen to her. He kept at the task of cleaning her armpit when suddenly... </span></div></div>",
            "created":1474606800,
            "id":2213508,
            "title":"armpit torture"
        },
        "131112":{
            "author_id":"dinocoat",
            "author_name":"DinoCoat",
            "choices":[
                "\"Okay. You can stop now.\"",
                "\"Faster! Eat more!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Now that we've done that we should do ass torture,\" Sasha says. She lays down on the floor and takes her pants and undergarments off. \"Kyle, eat my ass.\"<br>\r\n<br>\r\n\"Yes, mistress,\" he simply replied. Kyle began licking Sasha's ass. It tasted so good to him. Kyle begins to grow, yet again, another erection.<br>\r\n<br>\r\n\"Aww, little buddy's got another boner! Do good and you will have help with that.\"<br>\r\n<br>\r\nSasha farts in Kyle's face, turnig him on some more. Kyle is quickly eatting her tasty ass, his tongue enveloped in the sweet juices and massaging it. He can also see that Sasha is clearly pleasured by it.</span></div></div>",
            "created":1541589360,
            "id":2574323,
            "title":"Ass torture."
        },
        "14":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "Someone knocks on the door",
                "She takes it further",
                "Someone breaks in",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kyle turned around.<br>\r\n<br>\r\n\"So what do you want to do?\" He asked, looking at her. She took a deep breath and stepped forward, pressing her lips to his. He looked at her in shock but then began to kiss back.</span></div></span></div>",
            "created":1332565200,
            "id":1301503,
            "title":"She kisses him"
        },
        "141":{
            "choices":[
                "Sasha's best friend Virginia with pizza",
                "Sasha's cousin Rina with beer",
                "Sasha's older sister with movies and games"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"go get ready I will get the door.\" Kyle looked at her and said, \"Get Ready?\" Sasha looked at him and said, \"I forgot I was surprising you go sit on the couch.\" At the door was </span></div></span></div>",
            "created":1462510800,
            "id":2144053,
            "title":"Someone knocks on the door"
        },
        "1411":{
            "choices":[
                "kyle had an idea",
                "one of the girls had an idea"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They had a fun little pizza party, Sasha and her friends were always into the same things as Kyle so they didn't really have a conflict of interests. After pizza they tried to decide what to do, that is when</span></div></span></div>",
            "created":1478754000,
            "id":2235270,
            "title":"Sasha's best friend Virginia with pizza"
        },
        "14111":{
            "choices":[
                "Sure",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hey! Lets play truth or dare.<br>\r\n<br>\r\nThe girls responded...</span></div></span></div>",
            "created":1485234000,
            "id":2268611,
            "title":"kyle had an idea"
        },
        "141112":{
            "choices":[
                "He played with them again",
                "They got their revenge, playfully"
            ],
            "content":"<div class=\"\"><div> <span>Oh come on! The girls looked at him and said, \"We've decided what we'll do right now. Your annoying us. We'll start this night with teaching you a little restraint.\" Kyle tried to fight back but within a couple seconds Sasha's belt was over his arms, and Ginny's belt was holding his legs. The girls looked at him. \"strip high/low. Every right answer means Gin and I will strip one article of clothing, every wrong answer means you do. First side to be naked will spend until dinner tied up and left out on the deck.\" and they started playing before he could answer. 5, high, queen, the girls took off one shoe, low, 7 the girls take off their other shoe, low, king, Kyle takes off on shoe, low, queen, the girls take off one sock, low, 8 the girls take off the other sock, low, 6 the girls take off their shirts, high, queen, the girls take off their shorts and begin regretting playing this game, low, 10, the girls take off their bras, low, jack, Kyle takes off his other shoe, low, 9 the girls take off their panties and Kyle takes them out back. Kyle, \"Bondage high/low, for each necessary bondage piece every right answer will cause the most comfortable bondage to happen to that area, a wrong answer will mean the most uncomfortable bondage to happen to that area, and yes, I'll even include your lady parts. first off your pussies, 3, high, 10 you don't have crotch-ropes, your titties, low, 6 you don't have breast bondage, your ears, high, ace, you're not deafened, your eyes, low, 4, your not blinded, but with this sun that might be worse, your thighs, high, 5, taped, your arms, high, 6, taped, your ankles, high, ace, taped, your wrists, low, 7, taped, your mouths, low, 10, Kyle put dental gags on them and cranked them higher than the girls could without pain. Kyle, \"So what did you order for dinner?\" Sasha, \"Fh fhnt wm dndn't hrdmr dnnnmr\" Kyle, \"Well since we ordered pizza for lunch I think a nice, slow cooked meal is in order.\" Both girls yelled, \"Plmhfm dhn't wm'll dh hnnthnng.\" Kyle, \"Anything? Well in that case, in about five hours, given it's noon and dinner is still hours away, I'll order something.\" He looked at them and said, \"and I'll make sure it doesn't require extensive jaw work in it's chewing. Five hours later the girls, with sun burns and bleeding jaws, were let in. Kyle ordered soup and the girls loved him for it.<br>\r\n<br>\r\nThe girl's parents weren't happy that somehow the girls got full body burns, meaning they were butt naked outside. They were both grounded for 3 months for indecent behavior.<br>\r\n<br>\r\nBy the time they got out Kyle had struck it rich with an invention and he invited his two lovely playthings to join him in his private Bahamian island. At his mansion...</span></div></div>",
            "created":1501131600,
            "id":2360585,
            "title":"Nope"
        },
        "14112":{
            "choices":[
                "Sasha",
                "Virginia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one had the idea?</span></div></span></div>",
            "created":1478754000,
            "id":2235272,
            "title":"one of the girls had an idea"
        },
        "141121":{
            "choices":[
                "sure",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Play a sex game</span></div></span></div>",
            "created":1486443600,
            "id":2274595,
            "title":"Sasha"
        },
        "1411211":{
            "choices":[
                "heads",
                "tails"
            ],
            "content":"<div class=\"\"><div> <span>They watched a romance movie and it was actually Virginia that suggested romance. Sasha didn't want to and settled for a kinky game of being tied up. Once Sasha was nude, cuffed and laying on a mattress, and gagged with a ball gag that had had a built on blindfold, Gina took Kyle upstairs. Virginia, \"Whose getting tied?\" Kyle, \"coin flip?\"<br>\r\n<br>\r\nHeads-Kyle is tied up<br>\r\nTails-Virginia is tied up</span></div></div>",
            "created":1496120400,
            "id":2328264,
            "title":"sure"
        },
        "14112111":{
            "content":"<div class=\"\"><div> <span>Kyle looked at her handy work. He saw his wrists tied together and tape covering the knots, and knew the rope holding his arms ran through the headboard and under the bed to the rope, covered in tape for symmetry, that tied his ankles together, making the freeing knot far out of his reach. He could feel the tape over his mouth keeping him quiet. He tested the tape to make sure he couldn't push it off his face, he was quieted until the beauty standing over him released him. Virginia, \"You secure?\" Kyle nodded and tested the sound cancelling quality of his gag, \"Nmf mnftrmff Vnrgnnnh. Hm hm fmghrm, qhnmtmd, hnd rmhdn fhr whhtmvmr nhh wnfh.\" Virginia, \"Good, time for us to have our real fun.\" Kyle laid there looking up at her with inviting eyes, his sweaty naked body heaving in anticipation. Virginia checked on everything one last time and crawled up next to him. She softly rubs his body while says, \"What should I do to you.\", and kisses his taped lips. \"Fhgg mm\" Kyle said. Virginia, \"Maybe...or Maybe not.\" She stripped and Kyle felt his heart begin to race. She mounted him and said, \"What would you do if I let you go all the way?\" Kyle, \"Lhvm Hmt hnd bm grmhtfhl. Plmhfm Mnftrmff Vnrgnnnh, fhgg mm!\" Virginia then stopped and said, \"and how would you feel if I didn't fuck you?\" Kyle, \"Lhvm Hmt hnd bm grmhtfhl. Plmhfm Mnftrmff Vnrgnnnh, fhgg mm!\" The bed creaked as she rode him hard, he moaned and let out his load. She removed the condom and threw it away. Virginia, \"Was that good?\" Kyle nodded \"What should I do now?\" Kyle laid there and didn't answer. Virginia walked over to her clothes and put them back on. Kyle looked at her and took realization what she was doing right before she closed the door and freed Sasha. Kyle could here the girls downstairs doing cool sleepover things while he just laid there and had to wait out the night.</span></div></div>",
            "created":1496206800,
            "id":2328865,
            "title":"heads"
        },
        "14112112":{
            "content":"<div class=\"\"><div> <span>Kyle looked down at his handy work. Virginia laid there looked up at him with inviting eyes, her sweaty naked body heaving in anticipation. Kyle checked on last time the ropes that held her wrists and ankles to the posts of the bed and crawled up next to her. He softly rubs her body while says, \"What should I do to you.\", and kisses her taped lips. \"Fhgg mm\" Virginia said. Kyle, \"Maybe...or Maybe not.\" He stripped and Virginia felt her heart begin to race. He entered her already moist body and they went at hit. The bed creaked the stretched from the force she put on them and she arched and moaned in pleasure. He released her the next morning at which she said that was the best sleepover ever.</span></div></div>",
            "created":1496206800,
            "id":2328861,
            "title":"tails"
        },
        "1411212":{
            "content":"<div class=\"\"><div> <span>They hung out in the hot tub and thought about it. Then they fell asleep. They woke up the next morning to the door unlocking and Sasha's parents coming home. They weren't happy a boy was over but at least you didn't make love to their daughters.</span></div></div>",
            "created":1500958800,
            "id":2359439,
            "title":"no"
        },
        "141122":{
            "choices":[
                "sure",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gaming tournament. Winner gets to dominate the other two, with the 2nd place getting less punishment than last place.</span></div></span></div>",
            "created":1486443600,
            "id":2274594,
            "title":"Virginia"
        },
        "1411221":{
            "choices":[
                "The next sleepover at the girls",
                "Sleepover at Kyles"
            ],
            "content":"<div class=\"\"><div> <span>strip/bondage blackjack. Rules 2nd place loses 1 clothing or gains 1 bondage 3rd place loses 2 clothing or gains 2 bondage<br>\r\nRound 1 V-20 S-17 K-26<br>\r\nV-shirt, skirt, bra, panties, socks <br>\r\nS-tank, shorts, bra, panties, <span style=\"text-decoration:line-through\">socks</span> <br>\r\nK-shirt, shorts, boxers, <span style=\"text-decoration:line-through\">socks</span>, <span style=\"text-decoration:line-through\">hat,</span><br>\r\n<br>\r\nRound 2 V-21 S-26 K-19<br>\r\nV-shirt, skirt, bra, panties, socks <br>\r\nS-<span style=\"text-decoration:line-through\">tank</span>, <span style=\"text-decoration:line-through\">shorts</span>, bra, panties, <br>\r\nK-shirt, <span style=\"text-decoration:line-through\">shorts</span>, boxers,<br>\r\n<br>\r\nRound 3 V-24 S-17(3 cards) K-17(two cards)<br>\r\nV-shirt, <span style=\"text-decoration:line-through\">skirt</span>, bra, panties, <span style=\"text-decoration:line-through\">socks</span> <br>\r\nS-<span style=\"text-decoration:line-through\">bra</span>, panties, <br>\r\nK-shirt, boxers,<br>\r\nThe girls hoped that with his girlfriend topless and her sister revealing her panties Kyle would make game breaking mistakes<br>\r\n<br>\r\nRound 4 V-18(two cards) S-18(3 cards) K-19<br>\r\nV-<span style=\"text-decoration:line-through\">shirt</span>, <span style=\"text-decoration:line-through\">bra</span>, panties, <br>\r\nS-<span style=\"text-decoration:line-through\">panties</span>, <br>\r\nK-shirt, boxers,<br>\r\nWith Sasha nude and another punishment needed they started the bondage, first off they took the tape and wrapped her ankles together.<br>\r\n<br>\r\nRound 5 V-23 S-16 K-19<br>\r\nV-<span style=\"text-decoration:line-through\">panties </span><br>\r\nS-ankles, <br>\r\nK-shirt, boxers,<br>\r\nVirginia was stripped and had her ankles taped too, Sasha had her thighs taped<br>\r\n<br>\r\nRound 6 V-19 S-18 K-21<br>\r\nV-ankles,<br>\r\nS-ankles,  thighs, <br>\r\nK-shirt, boxers,<br>\r\n<br>\r\nGinny had her thighs taped, Sasha was gagged and had her arms taped to her sides<br>\r\n<br>\r\nRound 7 V-29 S-22 K-11<br>\r\nV-ankles, thighs,<br>\r\nS-ankles,  thighs, arms, gag, <br>\r\nK-shirt, boxers,<br>\r\nKyle bluffed the girls by staying with a low hand, forcing the girls to both bust. Sasha had her wrists taped behind her, Ginny had decided to have her arms and wrists taped instead of a gag. If Sasha gets a 3rd she will be subject to pain. If 2nd she will be given a lesser punishment.<br>\r\n<br>\r\nRound 8 V-19 S-20 K-21<br>\r\nV-ankles, thighs, arms, wrists,<br>\r\nS-ankles,  thighs, arms, wrists, gag, <br>\r\nK-shirt, boxers,<br>\r\nSome how through it all Virginia was the one to fail and get last. She was gagged and blindfolded with tape. Sasha was also blindfolded. Kyle got dressed and took both girls to their respective rooms. <br>\r\n<br>\r\nVirginia-She was untied and retied to the post of her bed standing up. With rope he tied her wrists over her head, her waist to the pole, and her ankles together and to the bottom of the post. He shoved Sasha's gym socks in her mouth, taped it shut, and used her sleep mask to blind her. He then placed tape over Virginia's clitoris and nipples. He then went to re-position Sasha.<br>\r\n<br>\r\nSasha-He used her padded, leather cuffs to cuff her to the four posts of her bed. He used her sleep-mask to blind her, placed enough strips of tape to silence her again, and then fucked his girlfriend until he was finished with her. Then he slept in their parents bed.<br>\r\n<br>\r\nThe next morning. He woke up and untied Sasha, she was a little sore in places but generally fine. Virginia on the other hand was in serious pain, and it only got worse when Kyle ripped off the tape from her nipples and clitoris making her scream through the gag. He untied her waist, and her ankles, and Sasha untied Virginia's wrists making her fall into Kyle's arms. Kyle than laid her on the floor and removed the gag her. Their parents came home about an hour after Kyle left.<br>\r\n<br>\r\n</span></div></div>",
            "created":1500958800,
            "id":2359464,
            "title":"sure"
        },
        "1411222":{
            "choices":[
                "Kyle went first",
                "The girls competed against each other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kyle suggested an escape bondage challenge. They liked it and...</span></div></span></div>",
            "created":1501131600,
            "id":2360587,
            "title":"no"
        },
        "14112221":{
            "choices":[
                "set the time and yelled, \"Go!\" ",
                "didn't set the time and yell, \"Go!\" prompting Kyle to call a forfeit"
            ],
            "content":"<div class=\"\"><div> <span>The rules of the game, 1, I will not start trying to escape until I start the timer 1.1 you must start the timer within a minute of finishing tying me or the game is forfeit, 2, if I don't escape within 30 minutes 2.1 you get to do whatever you want no questions asked 2.2 I cannot continue to try to escape 2.3 you can change my ties if you wish but only if you say you're doing it after i failed and 2.4 if one girl does not want to retie it does not negate the other's privilege to one retie herself.<br>\r\n<br>\r\nHe was naked before he finished the rules. Then he had his ankles roped to the legs of the chair, a belt holding his thighs and arms to the chair, a scarf blindfold, his socks shoved in his mouth and taped shut, and he was handcuffed. the girl's looked at their handy work and </span></div></div>",
            "created":1501304400,
            "id":2361638,
            "title":"Kyle went first"
        },
        "141122212":{
            "choices":[
                "got free",
                "couldn't get free"
            ],
            "content":"<div class=\"\"><div> <span>\"fnxtn, fnftnnnnm, fnftnmnght, fnftnfmvmn, fnftnfnx, fnftnfnvm, fnftnfhhr, fnftnthrmm, fnftntwh, fnftnhnm, fnftn, fhrtnnnnm, fhrtnmnght, fhrtnfmvmn, fhrtnfnx, fhrtnfnvm, fhrtnfhhr, fhrtnthrmm, fhrtntwh, fhrtnhnm, fhhrtn, thnrtnnnnm, thnrtnmnght, thnrtnfmvmn, thnrtnfnx, thnrtnfnvm, thnrtnfhhr, thnrtnthrmm, thnrtntwh, thnrtnhnm, thnrtn, twmntnnnnm, twmntnmnght, twmntnfmvmn, twmntnfnx, twmntnfnvm, twmntnfhhr, twmntnthrmm, twmntntwh, twmntnhnm, twmntn, nnnmtmmn, mnghtmmn, fmvmntmmn, fnxtmmn, fnftmmn, fhrtmmn, thrntmmn, twmlvm, mlmvmn, tmn, nnnm, mnght, fmvmn, fnx, fnvm, fhhr, thrmm, twh, hnm, Thht'f Hmt tnmmf hp, hntnm mm nhh fhrfmntmd thm ghmm.\" Kyle sat there. The girl's came back from where ever they were and Kyle said, \"Nhh dndn't fmt thm tnmmr. Nhh'vm fhrfmntmd thm ghmm.\" The girls didn't respond so he struggled and...</span></div></div>",
            "created":1501304400,
            "id":2361644,
            "title":"didn't set the time and yell, \"Go!\"..."
        },
        "1411222122":{
            "content":"<div class=\"\"><div> <span>He can't get free, \"I guess he lost.\" \"Nh nhh lhft, nhh dndn't fmt thm tnmm. Thm bmt Hmf fhrfmnt.\" \"What don't be silly, you were the timer. You were so worried about the time that you didn't even try escaping.\" He struggled to no avail. \"Hey lets go shopping using his credit card.\" \"Great idea.\" The girl's mom came home and released you, \"I'm so sorry about what my awful daughters did to you. Luckily someone caught their deception and locked them up for the felony they did. They're going to prison for a long time for kidnapping you and trying to steal from you.\" It seemed Kyle was tied up for days. A cashier noticed the name on the card and called the police. They notified you but your mom said she hadn't seen you in days. Without Kyle there was no evidence that they were doing it in a kinky game and so before anyone released Kyle they were already charged with kidnapping an conspiracy to steal an identity. Finding you was only considered more proof. 15 years later the girls finally were released and you had moved on with your life.</span></div></div>",
            "created":1506056400,
            "id":2389352,
            "title":"couldn't get free"
        },
        "14112222":{
            "choices":[
                "Someone escaped",
                "No one escaped"
            ],
            "content":"<div class=\"\"><div> <span>The rules of the game, 1, Do not start trying to escape until I start the timer, 2, I'll tie you up, 3, if you don't escape within 30 minutes 3.1 I get to do whatever I want no questions asked 3.2 you cannot continue to try to escape 3.3 I can change your ties if I wish but only if I say I'm doing it after you failed and 4, if one of you does escape before the timer, all the rules about running out of time applies to the loser except the winner girl is the one that has the first decision 4.1 if the winner does not want to retie do not negate my privilege to NOW AT ANY TIME have one retie my self.<br>\r\n<br>\r\nThey were both naked before Kyle finished the rules. Then both had their ankles roped to the legs of the chair, a belt holding their thighs and arms to the chair, a scarf blindfold, each other's socks shoved in their mouth and taped shut, and they were handcuffed. Kyle looked at his handy work and set the time and yelled, \"Go!\" </span></div></div>",
            "created":1501304400,
            "id":2361636,
            "title":"The girls competed against each other"
        },
        "141122221":{
            "choices":[
                "Sasha",
                "Virginia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which sister escaped first</span></div></span></div>",
            "created":1502082000,
            "id":2366318,
            "title":"Someone escaped"
        },
        "1411222211":{
            "choices":[
                "California",
                "Private Island"
            ],
            "content":"<div class=\"\"><div> <span>She escaped and retied Ginny to the bed and left her with Virginia's favorite dildo. They let her have a day of nothing but toy sex as they actually fucked. The next day the girl's parents came home and the girls decided it was time to move out. They picked up Kyle and moved to,</span></div></div>",
            "created":1505710800,
            "id":2387966,
            "title":"Sasha"
        },
        "1411222212":{
            "choices":[
                "Aruba",
                "Texas"
            ],
            "content":"<div class=\"\"><div> <span>She escaped and retied Sasha to the bed and left her with Sasha's favorite dildo. They let her have a day of nothing but toy sex as they actually fucked. The next day the girl's parents came home and the girls decided it was time to move out. They picked up Kyle and moved to,</span></div></div>",
            "created":1505710800,
            "id":2387967,
            "title":"Virginia"
        },
        "141122222":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He didn't retie them, he just called the boys and emptied the house of all their parents possessions, including the girls. They were never heard from again.</span></div></span></div>",
            "created":1505710800,
            "id":2387965,
            "title":"No one escaped"
        },
        "1412":{
            "choices":[
                "ZAP with a ray gun, \"You are all now pregnant with a baby from each partner.\"",
                "MAGIC, \"You are now cursed. You rotationally be one of the other two forever.\"",
                "OTHER, \"I cound not think of another option so I will leave it up to whoever.\""
            ],
            "content":"<div class=\"\"><div> <span>The party was wild, and they woke up the next morning feeling sore down there. That is when all three of them jumped up, naked, shit.<br>\r\n<br>\r\nThey went down stairs and saw Sasha's parents, and they were pissed. \"Since you three love each other so much, you will now have a three way marriage and...</span></div></div>",
            "created":1485234000,
            "id":2268613,
            "title":"Sasha's cousin Rina with beer"
        },
        "1413":{
            "choices":[
                "Watch a cheesey romcom",
                "play MORTAL KOMBAT!",
                "Kyle did not know due to some circumstance"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did they do first</span></div></span></div>",
            "created":1464930000,
            "id":2158175,
            "title":"Sasha's older sister with movies and games"
        },
        "14131":{
            "content":"<div class=\"\"><div> <span>But they knew Kyle wouldn't comply, so they didn't ask him.<br>\r\n<br>\r\nSasha, \"Hey, how about we play a game, to choose who picks the film.\" Kyle, \"Sure.\" Abby, \"(sigh) fine, (winks at Sasha).\" Sasha, \"Since me and my sister will agree I think only the two of you should compete, for fairness.\" Kyle and Abby agree, \"Cool. So I'll tie you both up, first one to get out decides what movies, and how many, we'll watch, and the other will remain tied up until the end of our movie marathon. Kyle, \"And you?\" Sasha, \"If you win I'll let you tie me up so as to not complain, but the idea is loser remains quiet. Kyle and Abby agree. Abby, \"And to spice things up lets all get naked and only the winner or winners get redressed.\" Kyle, \"Yeah, it would be great to see both of your naked bodies tied up, I'll accept.\" They all stripped and Sasha blindfolded both her sister and her boyfriend, \"Sit down on theses chairs.\" The sat and Sasha began taping her sister, \"Lady's first right?\" Abby giggled and said, \"Yep, wouldn't want Kyle thinking we cheated him.\" Kyle watched as Abby had her arms and legs taped to the arms and legs of the chair. Then Abby had her back and seat tied to the back and seat. Finally for quietness Abby had Kyle's underwear shoved in her mouth and strips of tape applied to her mouth firmly keeping it all in. Kyle put his blindfold back on and with the exception that it was Abby's panties in his mouth the same thing was done to him, well also Abby was taped up with duct tape that had perforated edge built in to prevent the tape from being used in kidnappings, yes it actually exists, and Sasha quickly switched it up to tape with out these intentional weaknesses. This meaning that with a realistic struggle Abby ripped the tape and freed herself as Kyle remained to his chair tight. Sasha removed the blindfolds to both as a start to not only set a start the competition but also so that Kyle was sure that he was not cheated, yeah right.<br>\r\n<br>\r\nThey spent the night watching girly movies and femdom bondage porn.</span></div></div>",
            "created":1486616400,
            "id":2275674,
            "title":"Watch a cheesey romcom"
        },
        "14132":{
            "choices":[
                "Sasha's sister Kim",
                "Sasha"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They decided to play a betting game. Kyle got to tie up which ever girl lost nude. Which won lost the bet</span></div></span></div>",
            "created":1486875600,
            "id":2276764,
            "title":"play MORTAL KOMBAT!"
        },
        "141321":{
            "choices":[
                "yes, nice and slow",
                "no, take her damn clothes off"
            ],
            "content":"<div class=\"\"><div> <span>Kim grew up the girly sister and because in her time video games were a boy's toy she never got good. Her young sister was master, but would sometimes let her sister win. Her sister thought Sasha would throw the match so that her boyfriend wouldn't be inches from her sister's naked body, she was wrong. The best 3 out of 5 matches would be the winner and each match was your typical best 2 out of 3. Kim looked through an decided on which characters she would choose. Sasha figured that her sister thought she would throw the match so she played a little bit with her sister. Sasha also guessed her sister's strategy, pick strong looking characters and/or ones she knew, and button mash the fuck out of it. That is also why Sasha picked fucking mortal kombat, Sasha already had the season pass so she was able to predict four of Kim's five picks, Xenomorph, Predator, Jason Vorhees, and Leatherface. Honestly Kim would probably go for Toro too because he had four arms instead of two. Sasha was absolutely correct.<br>\r\n<br>\r\nRound 1<br>\r\nToro v Subzero<br>\r\n<br>\r\nSasha was willing to allow her sister to win this round, she was a Scorpion Fan girl anyways. She made it look believable for Kyle, not really, and by a close margin Kim won.<br>\r\n<br>\r\nRound 2<br>\r\nLeatherface v Devorah<br>\r\nTo make it look good Sasha made the fight look close.<br>\r\n<br>\r\nRound 3<br>\r\nJason Vorhees v Scorpion<br>\r\n<br>\r\nSasha repeated the same closeness but won, to make it look random.<br>\r\n<br>\r\nRound 4<br>\r\nXenomorph v Melina<br>\r\n<br>\r\nSasha, lost this round too, making it go to the clincher.<br>\r\n<br>\r\nRound 5<br>\r\nPredator v Katana<br>\r\n<br>\r\nSasha, whooped Kim, who sat there shocked. Sasha just said, \"I have enough times being Kyle's toy, its your turn.\"<br>\r\n<br>\r\nDid they make Kim do a strip show</span></div></div>",
            "created":1486875600,
            "id":2276901,
            "title":"Sasha's sister Kim"
        },
        "1413211":{
            "choices":[
                "Kim won",
                "Kyle won"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Double or nothing. Me against Kyle, if I win you both get tied up, if I lose, I'll accept my punishment.\" They agreed and...</span></div></span></div>",
            "created":1493182800,
            "id":2310956,
            "title":"yes, nice and slow"
        },
        "14132111":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>Kyle knew Kim wouldn't throw the match. The best 3 out of 5 matches would be the winner and each match was your typical best 2 out of 3. Kyle switched it to Injustice 2 because it was new. Sasha looked through and decided on which characters she would choose. Kyle figured that his girlfriend thought he would throw the match so he played a little bit with her.<br>\r\n<br>\r\nRound 1<br>\r\nSuperman v Subzero<br>\r\n<br>\r\nKyle was willing to allow her to win this round. He made it look believable for Kim, making her think she learned from MKX, however she won too easily and he didn't want to lose.<br>\r\n<br>\r\nRound 2<br>\r\nBatman v Bane<br>\r\nTo make the loss hurt more she then beat him with a bottom tier character.<br>\r\n<br>\r\nRound 3<br>\r\nWonder Woman v Dark Seid<br>\r\n<br>\r\nKyle whooped Kim, but it was all part of her plan to make him think he could come back.<br>\r\n<br>\r\nRound 4<br>\r\nSupergirl v Brainiac<br>\r\n<br>\r\nKyle fought hard but almost lost.<br>\r\n<br>\r\nRound 5<br>\r\nAtrocitus v Scarecrow<br>\r\n<br>\r\nKyle, having been whooped by Kim, sat there shocked. Sasha just said, \"You had to lose.\"<br>\r\n<br>\r\nDid she make them do a strip show for her?</span></div></div>",
            "created":1498021200,
            "id":2340332,
            "title":"Kim won"
        },
        "141321111":{
            "choices":[
                "Sasha",
                "Kyle"
            ],
            "content":"<div class=\"\"><div> <span>Kim, \"Wait! Why would you want to see your sister naked? right? you've got to beat Kyle to protect your sister from unimaginable embarrassment.\" Kyle, \"If you accept and I win then you'll share her fate, she's already lost to us both so she's already forfeit but I havn't beaten you, true double or nothing, loser is stripped and tied up with her.\" Sasha, \"I accept.\"<br>\r\n<br>\r\nWho won</span></div></div>",
            "created":1498453200,
            "id":2343112,
            "title":"yes"
        },
        "14132112":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Kim thought Sasha would want Kyle to throw the match so that he wouldn't be inches from her sister's naked body, she was wrong. The best 3 out of 5 matches would be the winner and each match was your typical best 2 out of 3. Kyle switched it to Injustice 2 so that Kim would find more characters to play as and therefore, be easier to beat due to the fact that comics were indefinably a boys thing in Kim's day. Kim looked through and decided on which characters she would choose. Kyle figured that her girlfriend's sister thought he would throw the match so he played a little bit with her. <br>\r\n<br>\r\nRound 1<br>\r\nSuperman v Subzero<br>\r\n<br>\r\nKyle was willing to allow her to win this round. He made it look believable for Kim, making her think she learned from MKX, and by a close margin Kim won.<br>\r\n<br>\r\nRound 2<br>\r\nBatman v Bane<br>\r\nTo make the loss hurt more he even allowed her to win this round and make it a comeback clincher.<br>\r\n<br>\r\nRound 3<br>\r\nWonder Woman v Dark Seid<br>\r\n<br>\r\nKyle whooped Kim.<br>\r\n<br>\r\nRound 4<br>\r\nSupergirl v Brainiac<br>\r\n<br>\r\nKyle even allowed her to knock him down to his second bar before whooping her.<br>\r\n<br>\r\nRound 5<br>\r\nAtrocitus v Scarecrow<br>\r\n<br>\r\nKyle, whooped Kim, who sat there shocked. Sasha just said, \"We have a bondage twice as punishing for you now.\"<br>\r\n<br>\r\nDid they make Kim do a strip show</span></div></div>",
            "created":1498021200,
            "id":2340140,
            "title":"Kyle won"
        },
        "141322":{
            "choices":[
                "Of course",
                "Nah"
            ],
            "content":"<div class=\"\"><div> <span>Kim grew up the girly sister and because in her time video games were a boy's toy she never got good. Her young sister was master, but would sometimes let her sister win. Her sister thought Sasha would throw the match so that her boyfriend wouldn't be inches from her sister's naked body, she was wrong. The best 3 out of 5 matches would be the winner and each match was your typical best 2 out of 3. Kim looked through an decided on which characters she would choose. Sasha figured that her sister thought she would throw the match so she played a little bit with her sister. Sasha also guessed her sister's strategy, pick strong looking characters and/or ones she knew, and button mash the fuck out of it. That is also why Sasha picked fucking mortal kombat, Sasha already had the season pass so she was able to predict four of Kim's five picks, Xenomorph, Predator, Jason Vorhees, and Leatherface. Honestly Kim would probably go for Toro too because he had four arms instead of two. Sasha was absolutely incorrect.<br>\r\n<br>\r\nRound 1<br>\r\nFerra/Torr v Subzero<br>\r\n<br>\r\nSasha was willing to allow her sister to win this round, she was a Scorpion Fan girl anyways. She made it look believable for Kyle, not really, and by a close margin Kim won.<br>\r\n<br>\r\nRound 2<br>\r\nErron Black v Devorah<br>\r\nTo make it look good Sasha made the fight look close.<br>\r\n<br>\r\nRound 3<br>\r\nShinnok v Scorpion<br>\r\n<br>\r\nSasha repeated the same closeness but won, to make it look random.<br>\r\n<br>\r\nRound 4<br>\r\nReptile v Melina<br>\r\n<br>\r\nSasha, lost this round too, making it go to the clincher.<br>\r\n<br>\r\nRound 5<br>\r\nErmac v Katana<br>\r\n<br>\r\nSasha, got whooped by Kim, and who sat there shocked. Kim just said, \"I have enough times letting you win for your ego Sis, its your turn to inflate my ego.\"<br>\r\n<br>\r\nDid they make Sasha do a strip show</span></div></div>",
            "created":1486875600,
            "id":2276906,
            "title":"Sasha"
        },
        "1413221":{
            "choices":[
                "Sasha won",
                "Kyle won"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Double or nothing. Me against Kyle, if I win you both get tied up, if I lose, I'll accept my punishment.\" They agreed and...</span></div></span></div>",
            "created":1493182800,
            "id":2310957,
            "title":"Of course"
        },
        "14132211":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>Kyle knew Sasha wouldn't throw the match. The best 3 out of 5 matches would be the winner and each match was your typical best 2 out of 3. Kyle switched it to Injustice 2 because it was new. Sasha looked through and decided on which characters she would choose. Kyle figured that his girlfriend thought he would throw the match so he played a little bit with her.<br>\r\n<br>\r\nRound 1<br>\r\nSuperman v Subzero<br>\r\n<br>\r\nKyle was willing to allow her to win this round. He made it look believable for Sasha, making her think she learned from MKX, however she won too easily and he didn't want to lose.<br>\r\n<br>\r\nRound 2<br>\r\nBatman v Bane<br>\r\nTo make the loss hurt more she then beat him with a bottom tier character.<br>\r\n<br>\r\nRound 3<br>\r\nWonder Woman v Dark Seid<br>\r\n<br>\r\nKyle whooped Sasha, but it was all part of her plan to make him think he could come back.<br>\r\n<br>\r\nRound 4<br>\r\nSupergirl v Brainiac<br>\r\n<br>\r\nKyle fought hard but almost lost.<br>\r\n<br>\r\nRound 5<br>\r\nAtrocitus v Scarecrow<br>\r\n<br>\r\nKyle, having been whooped by Sasha, sat there shocked. Kim just said, \"You had to lose.\"<br>\r\n<br>\r\nDid she make them do a strip show for her?</span></div></div>",
            "created":1498021200,
            "id":2340330,
            "title":"Sasha won"
        },
        "141322111":{
            "choices":[
                "Kim",
                "Kyle"
            ],
            "content":"<div class=\"\"><div> <span>Sasha, \"Wait! Why would you want to see your sister naked? right? you've got to beat Kyle to protect your sister from unimaginable embarrassment.\" Kyle, \"If you accept and I win then you'll share her fate, she's already lost to us both so she's already forfeit but I havn't beaten you, true double or nothing, loser is stripped and tied up with her.\" Kim, \"I accept.\"<br>\r\n<br>\r\nWho won</span></div></div>",
            "created":1498453200,
            "id":2343110,
            "title":"yes"
        },
        "14132212":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Kim thought Sasha would want Kyle to throw the match so that he wouldn't be inches from her sister's naked body, she was wrong. The best 3 out of 5 matches would be the winner and each match was your typical best 2 out of 3. Kyle switched it to Injustice 2 because it was new. Sasha looked through and decided on which characters she would choose. Kyle figured that his girlfriend thought he would throw the match so he played a little bit with her.<br>\r\n<br>\r\nRound 1<br>\r\nSuperman v Subzero<br>\r\n<br>\r\nKyle was willing to allow her to win this round. He made it look believable for Sasha, making her think she learned from MKX, and by a close margin she won.<br>\r\n<br>\r\nRound 2<br>\r\nBatman v Bane<br>\r\nTo make the loss hurt more he even allowed her to win this round and make it a comeback clincher.<br>\r\n<br>\r\nRound 3<br>\r\nWonder Woman v Dark Seid<br>\r\n<br>\r\nKyle whooped Sasha.<br>\r\n<br>\r\nRound 4<br>\r\nSupergirl v Brainiac<br>\r\n<br>\r\nKyle even allowed her to knock him down to his second bar before whooping her.<br>\r\n<br>\r\nRound 5<br>\r\nAtrocitus v Scarecrow<br>\r\n<br>\r\nKyle, whooped Sasha, who sat there shocked. Kim just said, \"We have a bondage twice as punishing for you now.\"<br>\r\n<br>\r\nDid they make Sasha do a strip show</span></div></div>",
            "created":1498021200,
            "id":2340143,
            "title":"Kyle won"
        },
        "14133":{
            "choices":[
                "trick him into bondage",
                "have someone call him away so he is busy and doesn't ruin the night"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The girls had no intention of actually spending the night with Kyle, they just knew that if Kyle was not in on what they were doing he would never leave them alone. So they enacted their plan to invite him here and then...</span></div></span></div>",
            "created":1475557200,
            "id":2219015,
            "title":"Kyle did not know due to some circumstance"
        },
        "141331":{
            "choices":[
                "both girls",
                "only one"
            ],
            "content":"<div class=\"\"><div> <span>Sasha actually shared Kyle with Lara, but because that type of sexual behavior and Kyle was just recently old enough to have relations legally with Lara, who was already 18 when he and Sasha had started dating at only 16, Kyle was officially Sasha's boy but secretly Lara's too. So who did the tricking?</span></div></div>",
            "created":1475557200,
            "id":2219020,
            "title":"trick him into bondage"
        },
        "1413311":{
            "content":"<div class=\"\"><div> <span>The girls smirked at each other and said, \"Hey Kyle how about a threesome?\" Kyle, \"Sure.\" Lara, \"But one condition.' Kyle, \"What condition?\" Sasha, \"We will tie you up.\" Kyle, \"What! but what about the night?\" Lara, \"Oh, you will be the fun beginning of the night, and we promise to have fun with you, in fact, we will fuck you together and sometime during the night each one of us will have our way with you giving you three fucks tonight, but we have to make sure we can find you before our euphoria fades, right?\" Kyle, \"oh, yeah, so tie me up, threesome, come back when you are ready a couple minutes later, fuck me, give me a little time to recoup, fuck me a third time, and the fun will continue?\" Sasha, \"That's the plan, bondage threesome, when we feel rejuvenated and feel you are ready we take you one by one, and then the night's festivities will continue. Is that plan fine with you cause we cannot guarantee to release you soon, we will only promise that before dawn you will be fucked three times, but of course we will finish our obligation to you quickly so you don't have to worry about waiting in anticipation for too long.\" Kyle thinking he was still a crucial part of the night agreed and began stripping. The girls put his clothes in a pile and took him to the guest room. They put down the plastic sheet, Kyle thought because of the cum, to protect the mattress from pee, and proceeded to tie him spreadeagled to the bed with rope they had for this kind of occasion. They then asked Kyle, \"So before we gag you, you consent to us fucking you at any time and that you consent to stay bound and gagged here even if we leave you all night?\" Kyle, \"All night, well if you feel that be best but of course you will be quick.\" Lara, \"Well we will only release you when we feel like it, if we want you here all night we will keep you here all night and you technically already can't do a thing about it, you will lay here until we release you, your only freedom is this, will you not consent to all the terms and lay here blue-balled, or will you consent and give up all freedoms, even that of staying here until we release you, but get rewarded with three instances of sex?\" Kyle, \"Yes my mistresses, I am you slave until freed.\" Sasha, \"Great! One more choice for our Kyle, we will gag you however you want, so how do you want it? Kyle, \"I feel like having my mouth taped shut.\" Sasha went to grab the tape as Lara put a sleep mask over his eyes. Sasha came back and asked, \"strips or wrapped?\" Kyle, \"strips is fine.\" RIIIP one strip over his mouth RIIIP a cross piece RIIIP a second cross piece. The girls fucked Kyle and left him. Time crept by for Kyle and he thought they were taking years to fuck him. An hour later, Sasha came back and rode Kyle. Another hour later, Lara fulfilled her promise. Kyle began realizing he was alone again. At this time it was only 10 and it sounded like they were preparing the fun, so he waited. Kyle fell asleep thinking that the girls would wake him when they released him, and he was right.<br>\r\n<br>\r\n8 o'clock in the morning<br>\r\n<br>\r\nKyle felt a gush of air as the door opened. He stretching thinking he only napped, the light blinded him as they took off the sleep-mask. His legs were freed by the time his eyes adjusted and his wrists by the time he found the clock and read the time. As he pulled the tape off he asked, \"did I fall asleep?\" Sasha, \"Yeah\" kissing him, \"So we closed the door.\" Kyle, \"Why didn't you wake me?\" Lara, \"Why would we?\" Kyle, \"The night of fun.\" The girls looked at each other and Sasha said, \"He never figured it out.\" Kyle, \"Figure what out?\" Lara, \"Boys can be so stupid sometimes.\" Kyle just sat there slack jaw. Kyle, \"You tied me up to get rid of me!\" They looked at him and said, \"We did reward your sacrifice with three sexual intercourse's in one night.\" Kyle just got dressed and came out to eat breakfast. That is when their parents came home. \"Oh hey Lara, Sasha, Kyle, you having breakfast?\" Lara, \"Yep.\" \"And what did you three do all night?\" Sasha, \"Girls night.\" \"So Kyle wasn't here.\" Lara, \"Oh he was but we kept him 'occupied'\" \"naughty girls.\" Sasha, \"What like you didn't know since Kyle and I started dating.\" Kyle was shocked, \"Why did we keep it secret if your parents knew.\" \"To torture you.\"</span></div></div>",
            "created":1477026000,
            "id":2226775,
            "title":"both girls"
        },
        "1413312":{
            "choices":[
                "Lara",
                "Sasha"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1475557200,
            "id":2219022,
            "title":"only one"
        },
        "14133121":{
            "choices":[
                "Dawn",
                "End of weekend"
            ],
            "content":"<div class=\"\"><div> <span>Lara gave the cue and Sasha said, \"Hey I'm going out to pick up, dinner.\" and left, Lara grabbed Kyle's groin and said, \"Lets see how much trouble we can get in before she comes back.\" Kyle was elated \"Ah okay.\" Lara seductively led him into the laundry room in the basement, the most secluded part of the house. Then Lara undid her hair and shook it, letting it fall across her shoulders. She pulled the zipper down on the cocktail dress she was wearing from work. \"I don't need this anymore today, even when I get dressed again.\" Kyle could barely hold himself back and reached for his clothes but Lara stopped him, \"No, no! A woman doesn't let her man work when she is pleasuring him.\" Lara pushed him against the wall and pulled off his shirt, which he grabbed. She playfully batted his hands and said, \"No! Bad boy! You grabbed your clothes working when I was trying to pleasure you, I will do everything just, just relax and take it like a man. (giggles)\" Kyle reached out to begin rubbing Lara but she grabbed his wrists and held them back, \"I said, relax.\" \"Don't you want me to pleasure you.\" \"Thoughtful but tonight I find my pleasure in a different way.\" \"So what.\" pushes a finger against his lips and said, \"Shhhh. Relax.\" Lara stepped back and unclasped her bra letting her breasts fall she then began pushing her panties down while slowly walking forward. Kyle reached for his pants, stopped, and said, \"Sorry.\" Lara began putting her plan into its true action. \"Tsk tsk, naughty boy, I guess there's only one way to keep your hands out you drawers, turn around and hands behind your back.\" He obeyed and Lara left and a minute later came back clinking, CRRRP went the handcuffs. She turned him around and said, \"Now be a good boy.\" and kissed him. While slowly edging him further into the closet she continued to distract him with her kisses, while slowly undoing his pants, letting him step out of them and then dropping his undies. She then handed him a blindfold, and undid the handcuffs making it seem like it was toy handcuffs with releases on the side of the cuffs. She had a blindfold too and put it on and said \"Lets fuck blind.\" She saw him put on the blindfold and felt him up like she was blinded too and resumed the makeout, now pushing him into the closet with her kisses. She saw him begin feeling her and she stopped, pulled back and said, \"Do we need the handcuffs Kyle?\" and before he answered hugged him, felt up his wrists, still like she is blindfolded, and re-cuffed his wrists. She put her blindfold on her head to look like she just raised it, raised his and said, \"we need the sight to kneel right?\" and they both knelt and she blinded him again. She straddled him and began making out again, slowly rubbing him, he cummed. \"Kyle! Too soon, ugh, wait here, I'll be back.\" Lara actually anticipated this all, even when Kyle rolled to his feet and began feeling his way out. Lara saw him, knelt him down again, this time cuffing his ankles and said, \"Stay!\" Kyle, \"Lara, it's just, I'm sorry, you still wanna fuck right?\" Lara, \"Well I think I need to give you time to resupply, right? and plus, that was bad not cumming before me. You are in time out wait until Sasha hears about this.\" Kyle, \"Don't tell Sasha, it, well.\" Lara walked back up to Kyle and belted his thighs together and his arms to his side. Kyle, \"Lara, are you being playful or are you really mad?\" no answer \"Lara!\" she stood in waiting. \"LARA,guff\" She waited for him to open his mouth wide before shoving his own underwear in his mouth, then she held it into place with a scarf she had ready tied in a stuffed cleave gag. She pushed him back causing him to fall. He protested but heard the door slowly creak. Then the front door opened and Lara said, \"Shit I need to get dressed. I'll be back. After the girls night in we planned.\" and slammed the door shut to run up stairs, Kyle was left there realizing they were not releasing him, he tested the cuffs, real. He laid there until</span></div></div>",
            "created":1477371600,
            "id":2228046,
            "title":"Lara"
        },
        "141331211":{
            "choices":[
                "9 months later",
                "a year later"
            ],
            "content":"<div class=\"\"><div> <span>They kissed him good morning. Sasha, \"So he's where I left him, so obviously he is really secure. You wanna leave him.\" Kyle started mmphing. Lara, \"I don't know he does look cute here and I really would like a day with my sister without this brat getting in my way. Kyle started mmphing angrily. Lara, \"Aw is the little Kyle grumpy?\" Kissed him, \"I'm just playing up the sexual tension.\" began rubbing herself on him, she was nude. Sasha also joined in and Kyle could tell that she was also nude. They baited him to the edge and got up and said, \"Lets have a girl's night out\" and left. After Kyle was released he asked them if it seemed weird for them to have a three way together. Their answer, \"No. We fuck each other all the time.\" Kyle got excited and they released all his built up tension. Both girls however got pregnant so he had to marry both which lead to some interesting stories post birth.</span></div></div>",
            "created":1489122000,
            "id":2287715,
            "title":"Dawn"
        },
        "1413312111":{
            "choices":[
                "about a week later",
                "That morning after breakfast"
            ],
            "content":"<div class=\"\"><div> <span>The babies were born and the girl's parents were appalled that their daughters did sexual things with each other. Their kids never saw their mothers' parents but they shared a mansion with their father's parents, who took up babysitting duties when the parents wanted private time. The day the girls came home after birthing they were full of life and so deprived by their pregnancies of Kyle's true sexual pleasure that they decided to have fun with him and then with out him. Knowing he wanted them they used it to their advantage. He found himself tape mummified to a chair with only his nose and penis exposed. They both fucked him until they were satisfied and left to have a night out. They came back and made out with each other while Kyle listened. The next morning he was awoken by the girls releasing him. The next time they had fun was</span></div></div>",
            "created":1501304400,
            "id":2361203,
            "title":"9 months later"
        },
        "1413312112":{
            "choices":[
                "one random night when the kids were asleep",
                "a week later"
            ],
            "content":"<div class=\"\"><div> <span>The babies were born and the girl's parents were appalled that their daughters did sexual things with each other. Their kids never saw their mothers' parents but they shared a mansion with their father's parents, who took up babysitting duties when the parents wanted private time. One day the girls came home and they were full of life and so deprived by their pregnancies of Kyle's true sexual pleasure but they both also wanted to have their second kid. Knowing he wanted them they used it to their advantage. He was fucked until hit hurt. They both became pregnant. After their second children they all agreed to have their tubes clipped. The girls and Kyle were given their respective surgeries and were now unable to have another kid. Now they could play without consequence. The next time for that was...</span></div></div>",
            "created":1501477200,
            "id":2362691,
            "title":"a year later"
        },
        "141331212":{
            "content":"<div class=\"\"><div> <span>They kissed him good morning. Sasha, \"So he's where I left him, so obviously he is really secure. You wanna leave him.\" Kyle started mmphing. Lara, \"I don't know he does look cute here and I really would like a day with my sister without this brat getting in my way. Kyle started mmphing angrily. Lara, \"Aw is the little Kyle grumpy?\" Kissed him, \"I'm just playing up the sexual tension.\" began rubbing herself on him, she was nude. Sasha also joined in and Kyle could tell that she was also nude. They had an amazing three-way. After Kyle was released he asked them if it seemed weird for them to have a three way together. Their answer, \"No. We fuck each other all the time.\" Kyle pondered that answer for the rest of his life, especially after marrying his real crush Paul, Lara and Sasha were not pleased.</span></div></div>",
            "created":1489122000,
            "id":2287714,
            "title":"End of weekend"
        },
        "14133122":{
            "choices":[
                "After the girls left the next morning",
                "When he escaped realizing he was tricked"
            ],
            "content":"<div class=\"\"><div> <span>Lara went upstairs and came back down in sweats. \"Hey Sash, I'm going to go order dinner to be delivered, so you two be quiet.\" As soon as Lara left, a sign to start the plan, Sasha said, \"Hey lets play a kinky game, a...scavenger hunt of sorts. I'll hide, you, naked and tied up and Lara will have to find you, it will be a great little pre dinner game.\" Kyle said, \"Sure, but quietly.\" Kyle left his clothes in a path and Sasha grabbed the least quiet thing, tape. Since Lara was outside this would give them a quick tie. Kyle sat down on the chair, placed in the backroom, behind the media room, speakeasy style, in the basement. Kyle put his arms and legs against the armrests and legs of the chair, and Sasha quickly, but securely, wrapped up the prize of their non-existent game. RIIIP, RIIIP, RIIIP, RIIIP, \"Can you move your arms or legs?\" \"Nope.\" RIIP, RIIIP, now wrapping his arms an torso to the back of the chair and his thighs to the seat. \"Are you secure against the back and butt of the chair?\" \"Yep\" \"Good open up.\" \"But sweetie if the game is me not being found do I need the gag?\" \"Yes, you will obviously make sounds to be found. Now open up or I will make you open up.\" Kyle obeyed and Sasha put a ball gag in his mouth, then put strips of tape over his mouth, on his chin, then wrapped the whole thing by wrapping his head. She finished it off by putting a leather eye mask, \"to prevent mmphing when he saw Lara\" and then said, \"and I will deafen you with sound cancelling earmuffs to prevent you from mmphing when you hear us.\" and then deafened him. Kyle was alone in his own world unable to realize that just above him the girls were having a literal party, with multiple girls, who never knew of the secret room or Kyle. When did Kyle get freed.</span></div></div>",
            "created":1477371600,
            "id":2228054,
            "title":"Sasha"
        },
        "141331221":{
            "content":"<div class=\"\"><div> <span>They pulled off the ear muffs and kissed him good morning. He had realized he was stuck when the anticipation died down and he got bored. Sasha, \"So he's where I left him, so obviously he is really secure to the chair. You wanna leave him.\" Kyle started mmphing. Lara, \"I don't know he does look cute here and I really would like a day with my sister without this brat getting in my way. Kyle started mmphing angrily. Lara, \"Aw is the little Kyle grumpy?\" Kissed him, \"I'm just playing up the sexual tension.\" began rubbing herself on him, she was nude. Sasha also joined in and Kyle could tell that she was also nude. They had an amazing three-way. After Kyle was released he asked them if it seemed weird for them to have a three way together. Their answer, \"We just got home, who do you have a three way with? Just kidding. No we fuck each other all the time.\" Kyle pondered that answer for the rest of his life, especially after marrying Lara, Sasha was not pleased. </span></div></div>",
            "created":1487912400,
            "id":2281809,
            "title":"After the girls left the next morning"
        },
        "141331222":{
            "choices":[
                "The next sleepover",
                "During the girl's vacation"
            ],
            "content":"<div class=\"\"><div> <span>He easily freed himself. The bass was pumping but they had left Tim in the room with the surge box. The lights went out and the girls huddled. Then the lights started flickering and the girls ran away. Kyle was gone before either girl could find him, however, the next time they saw him they demanded he repay them for the party.</span></div></div>",
            "created":1489035600,
            "id":2287162,
            "title":"When he escaped realizing he was tricked"
        },
        "1413312221":{
            "choices":[
                "The next sleepover pt 2"
            ],
            "content":"<div class=\"\"><div> <span>\"Get over here, Now!\" texted Sasha. Kyle rushed over. \"Hi Kyle, it's your weekend to repay us for last weekend.\" Kyle tried to turn around but Jessica, Sasha's older sister, slammed the door, and her and Chelsea, Sasha's twin sister, barred Kyle's escape. He was surrounded by the girls that attended the other sleepover. <br>\r\n<br>\r\n8 A.M. Friday<br>\r\nKyle knew he was in serious trouble. Kyle stepped forward to protest when he was grabbed from behind by Jessica, on his left arm, and Chelsea, on his right arm. Emily, Sasha's cousin walked up with her hands behind her back. Sasha, \"You thought I wouldn't be mad or that the girl's wouldn't be mad. Emily, make him hurt.\" Emily walked to him and smiled, she was holding a paintball gun. Kyle, \"Emily I.\" Thump thump, the paintball was a perfectly aimed shot at his nerve center of his inner thighs, spots more painful than any on the body, yes ANY. Kyle dropped to the floor screaming in pain holding his legs. Emily, \"Yeah Kyle, being a martial artist I know where to hit you to make you feel pain so bad you'll wish I just shot your widdle balls.\" \"I don't-\" Thump, right in his solar-plexus making him lose his breath. Emily walked up, \"I'll continue except for one condition, Sasha.\" Sasha walked up, \"Weekend long bondage marathon.\" \"Bondage Marathon?\" Kyle wheezes out, Sasha nods. Kyle nodded and the girls squealed in excitement.<br>\r\n<br>\r\n8:30<br>\r\nThey let him go and handed him a silk sleep mask. \"What's that for.\" He said. He realized they wouldn't answer his questions. \"Take off your shoes and socks.\" He did and she blindfolds him and begins walking. The sisters grab him and led him to where he would spend an undisclosed amount of time. They continued to their basement. \"Take off your shirt, your pants, and put your hands behind your back.\" He stood there in his underwear and one of the girls handcuffed his wrists and used his belt to hold his arms to his side, collared him, and pulled his leash. He took the hint and followed again. He heard a click and she said, \"Now that the collar is locked out of you reach we can continue.\" She took off his underwear and said, \"Open up so I can shove your boxers and you socks in your mouth.\" Kyle, \"What! No!\" Sasha, \"Excuse me.\" Knee. Kyle drops to his knees and whimpers out, \"Why did you knee me in the crotch?\" Sasha, \"To show you whose boss, now get up and open up!\" He did wandering what her plan was. She shoved his dirty, sweaty underwear and socks deep in his mouth and used duct tape to wrap his head, holding the boxers in. She then took off her belt, and belted his thighs together after tucking his junk behind his legs. Then she used another pair of handcuffs to lock in his ankles. \"Alright time for the fun.\" and began walking away. Kyle just stood there defeated. He heard the girls giggle and say, \"Hey look girl's his wallet in his pants. We can have this right Kyle?\" \"Whht! Nh plmhfm.\" Sasha smirked at her sisters and cousin and said, \"Well ladies, I can't understand a fucking word he says, and honestly he agreed to anything. That anything will include, the girl's, lets see, today's and tomorrow's lunch and dinner, we need groceries so there we'll buy stuff for tomorrow and Sunday's breakfast and today and tomorrow's dessert, you know before he is fully released from his payment. \"Ghhld nhh plmhfm mht fhmm mmhlf Hmn?\" The girls looked over, \"Sounds like he's pleading. I guess he wants us to eat in.\" He nods furiously. \"Oh don't worry all the meals will be eaten here, we wouldn't want a restaurant asking way a group of women have a man's credit card. All our deliveries will be made by ladies who are in on the punishment and will probably come over after their parts are played.\" \"Bht Hm ghn't hffhrd h dhzmn mmhlf fhr hhpmfhlln nht thh mhnn mhrm gnrlf hnd mnfmlf.\" Sasha, \"You can afford it though. Did you say myself?\" \"Hh nhw nhh hndmrfthnd mm hnd nmf mnfmlf.\" Sasha laughed, \"Oh sweetie you will only eat if we are merciful.\" \"Whht?! Hm mhn nht mht! Bht Hm fgnppmd brmhgfhft bmghhfm hf nhh Hm ghn't gh thrmm dhnf wnthhht fhhd!\" Emily, \"The human body can go weeks without food, and days without water. You'll survive.\" Kyle than looked defeated and could imagine how anything could be worse. Chelsea, \"And what about entertainment?\" Kyle looked back, \"Whht!\" Jessica, \"Isn't a cute guy helpless to stop you from doing anything enough?\" Kyle sighed relief. The girls gave in a second and laughed. Sasha, \"How does pay per view porn on his credit card sound.\" the girls wooed and Kyle yelled, \"Nh! Thht'f wmrm Hm drhw thm lnnm, Hm hm nht phnnng fhr nhhr phrn bnngm, Hm hm nht phnnng fhr thnf wmmgmnd, hnd nhh'll lmt mm gh hr Hm fwmhr Hm wnll...dh fhmmthnng bhd. Hrm nhh bntghmf ftnll thmrm? Dhn't gh hpfthnrf. Plmhfm.\" The girls just walked away and before closing the door Sasha yelled, \"We can tell your grumpy so we'll just leave you here until we get back from the groceries store.<br>\r\n<br>\r\nThe other girl's were texted an all's a go and they prepared to have their fun.<br>\r\n<br>\r\n11:45<br>\r\nKyle was untied and now he saw a small group. Sasha, Jess, Chelsea, Emily, and Sasha's friends Melony, Felicity, and Laurie led him to the living room. Jess, \"Hey I'm hungry you wanna get lunch.\" \"Sure!\" They untied Kyle and said, \"Time to secure you while we pick up, lunch.\" They handed him a leather blindfold. He put on the blindfold they now pushed him into the linen closet. They then cuffed his wrists above his head to the top shelf, cuffed his ankles to the bottom shelf, and said, \"Stay!\" Sasha, \"Open up.\" he did and she shoved a sponge in his mouth, then she held it into place with a scarf she had ready tied in a stuffed cleave gag. Sasha, \"You want anything for lunch? No! okay.\" \"Plmhfm fmmd mm.\" Sasha, \"Well if you don't use words I don't know what to get so you don't eat.\" she closed the door hard knowing that the knobs would slam into his dick and not budge until he was released. He pleaded but heard the door slowly creak shut and the girls left.<br>\r\n<br>\r\n12:30 P.M.<br>\r\nSasha, and the group returned. They sat down and began eating in her living room, the had bought burgers from the shop down the street. John, Chelsea's boyfriend, \"Hey I'm hungry serve out the food, the guys and I only have an hour.\" \"Sure!\" The girls said. The other girls had invited their boyfriends over for lunch and to keep Kyle kept quiet. Hank, Jesse's boyfriend, \"So where's Kyle?\" Kyle's heart raced. Sasha, \"I don't know he was supposed to meet us here for lunch. We even got him a burger.\" Kyle was relieved they were going to feed him. Lunch finished and the guy's had to go back to the shop. Mike, Emily's boyfriend, \"So Kyle didn't show?\" Sasha, \"Nope, jerk.\" Mike, \"What do you wanna do with the other burger.\" Sasha, \"Whatever, he didn't show so you guys wanna split it.\" John, \"Oh brutal, but yeah sucker.\" Hank, \"Hey he wasn't here so he misses out.\" Sasha, \"Yeah no use wasting a burger cause he got himself tied up somewhere.\" Kyle's heart sank as the burger was cut up an eaten by his friends. The guys left.<br>\r\n<br>\r\n1:35<br>\r\nNow sure the guys left Sasha, Jess, Chelsea, Melony, Felicity, and Laurie released Kyle. Sasha, \"You know what Kyle we'll reward you for being such a good boy during lunch.\" Kyle, \"Finally I get something to eat.\" Kyle was led by Sasha to the dinning room, \"I'm gonna take care of your needs Kyle but obviously I you can't be left untied. Kyle, \"Fine.\" She put on the blindfold again. \"Hey I'm hungry you feed me right?\" \"Sure! It just may not be in a way you expected\" She said. Then they said, \"Time to secure you.\" She now pushed him into the pantry. They then cuffed his wrists above his head to the top shelf, cuffed his ankles to the bottom shelf, and said, \"Stay!\" Kyle, \"Standing spread eagle again?\" Sasha, \"Quiet and open up.\" se did and she shoved a penis gag in his mouth. Kyle, \"Whht nhh fhggnng prhmnfmd th fmmd mm! Thnf Hmf hnhthmr ghg!\" Sasha, \"This isn't just any gag it's a giant bottle nipple and it's connected to a hose. What goes in that hose is dependant on how you act when the boys come back over. Be good and you'll get something tasty, act up and after the guys see you we'll put something nasty down the tube. He protested but heard the door slowly creak shut and the girls left.<br>\r\n<br>\r\n2:00<br>\r\nThe guys came back with more guys. The guys talked about their days and wondered if Kyle ever came over. Sasha, \"No but he did call me and said (In a sarcastic way), 'Oh sorry babe I got all tied up and couldn't come over, make it up to you later.' and hung up. Oh when I see him later he's going to get what he deserves.\" The guys all tease around and said, \"Give the poor guy a break he works hard to pamper you.\" Sasha, \"Yeah he's a sweatheart but I swear sometimes I need to bust his balls to keep him from acting stupid.\" The guys all teased and said, \"Yeah he's a dumb-ass sometimes\" \"Thanks guys.\" thought Kyle. \"But hey he's loyal and not hard to keep focused on you.\" Sasha, \"Yeah at least I know how to keep him tied down and happy.\" \"Yeah well we won't stay too long, you girls have been talking about this weekend sleepover since the power went weird last time. You ever figure it out?\" Sasha, \"Yeah Kyle pulling a prank.\" He blew up my surge box. He made it up to us though and helped us fund this one girl's night in though.\" <br>\r\n<br>\r\n2:30<br>\r\nThe guys left and the girls came back. Sasha, \"Good boy Kyle.\" and gave him some beer and a protein shake for energy. Kyle was set in a chair and a roll of duct tape was brought out. His arms and legs were taped to the arms and legs of the chair, his back and seat tied to the back and seat, and finally for quietness the rag used to clean the dishes that still had soapy water was shoved in his mouth and strips of tape applied to firmly keeping it all in. Mw! Thnf rhg thftmf lngm fhnt! Sasha slaps him and says, \"No talking from the prisoner. or you won't get your reward.\" They spent the rest of the day watching manly movies and maledom bondage porn. They ordered and ate Asian, without giving Kyle any. </span></div></div>",
            "created":1496120400,
            "id":2327746,
            "title":"The next sleepover Pt 1"
        },
        "14133122211":{
            "choices":[
                "Sasha's next party",
                "His honeymoon"
            ],
            "content":"<div class=\"\"><div> <span>Midnight Saturday<br>\r\nThey untied Kyle and said, \"Hey bitch. we will fuck you in a big orgy. Then sometime during the night each one of us will have our way with you giving you five fucks tonight.\" Kyle just nodded and yawned. The girls tied him spreadeagled to the bed with rope they had for this kind of occasion. Sash came back with the duct tape and asked, \"strips or wrapped?\" Kyle, \"strips is fine.\" RIIIP one strip over his mouth RIIIP a cross piece RIIIP a second cross piece. The girls fucked Kyle and went to sleep. Every hour the alarm went off startling Kyle awake and another girl would fuck him.<br>\r\n1:00 A.M.<br>\r\nSasha<br>\r\n2:00<br>\r\nJesse<br>\r\n3:00<br>\r\nChelsea<br>\r\n4:00<br>\r\nEmily<br>\r\n5:00<br>\r\nSasha woke up and fuck him again, said she didn't need an alarm to have fun with her glorified dildo.<br>\r\n<br>\r\n8:00<br>\r\nKyle felt the bed shake as the girls awoke. The light blinded his tired eyes and his penis hurt from all the fucking. They went to until him but stopped. Sasha, \"Does my widdle Kyle wanna sleep in for a little while?\" He nodded and a sleep mask was put over his eyes so that he could fall asleep. <br>\r\n<br>\r\n9:00<br>\r\nKyle felt a gush of air as the door opened. The light blinded him as they took off the sleep-mask. His legs were freed by the time his eyes adjusted and his wrists by the time he found the clock and read the time. As she pulled the tape off. Kyle, \"What's next?\" Sasha, \"Lets go and find out.\" Down stair was Jess, Chelsea, Emily, Melony, Felicity, and Laurie waving goodbye and Sasha said, \"They only had you yesterday, I brought in a new stock of mistresses for you. In walked Sasha's friends Nora, Valery, and Christina, all ready to abuse him. Kyle was set in a chair and a roll of duct tape was brought out. His arms and legs taped to the arms and legs of the chair, his back and seat tied to the back and seat, and finally for quietness the rag Sasha used to clean herself in the shower this morning, filled with her dirty, soapy water was shoved in his mouth and strips of tape applied to firmly keeping it all in. \"Nhh hfmd thnf th glmhn nhhrfmlf, Hm lhvm nhh bht mw.\" Sasha slaps him and says, \"No talking from the prisoner.\" then slaps him again, \"And what do you mean ew, you think I'm gross?\" Kyle pleaded, \"Nh thht'f nht whht Hm mmhn, Hmt'f jhft, Hm mmhn, fhrgnvm mm.\" Sasha, \"I do and mainly because you can't complain about me being dirty since you've licked every dirty hole of me.\" The girls cooed and teased Kyle. They spent until lunch watching girly movies and femdom bondage porn.<br>\r\n<br>\r\n12:00 P.M.<br>\r\nThey untied him and said, \"follow us.\" They took him outside in the shed and ball tied him, ball gagged him, and for ball continuity's sake, CBTed him. They left him locked in the shed and ordered in lunch. <br>\r\n<br>\r\n12:30<br>\r\nSasha, and the group returned. They sat down and began eating on her pool deck, the had bought subs from the shop down the street. The delivery girl, Mia, a cute Asian that Kyle had a crush on before Sasha, was giving an extra special tip by being allowed to fuck Kyle however she wanted for however long she wanted. <br>\r\n<br>\r\n1:00<br>\r\nThe girls went inside and Mia was on her third orgasm and Kyle was in pain. The girls returned around the time Mia came for the fifth time and Kyle was crying. Mia said, \"I haven't had a fuck this good since Marshall.\" and left. The girls swam in the pool and had fun playing normal pool games. Then they soaked it up in the hot tub and talked about girl stuff.<br>\r\n<br>\r\n3:30<br>\r\nThey led him out of the shed and into the basement. They set Kyle down on the pool table. Sasha put his arms together above his head and Valery tied his hands with rope while Christina did the same for his legs. Nora came back with a roll of duct tape and RIIIP, RIIIP, taped over the knots so Kyle didn't untie himself. \"Can you move your arms or legs?\" \"Nope.\" RIIP, RIIIP, now wrapping his torso and thighs to the table. \"Are you secure?\" \"Yep\" \"Good open up.\" Kyle obeyed and Sasha put a ball gag in his mouth, then put strips of tape over his mouth and chin, then wrapped the whole thing by wrapping his head. Then they stripped and went back outside.<br>\r\n<br>\r\n5:00<br>\r\nAfter swimming, sunbathing, and chatting about whatever. They all came inside. Sasha, \"I wonder if Mia wants to come back over?\" Kyle pleaded no but they called Mia. She came and kept Kyle company as they ordered Pizzas. They untied Kyle and made him answer the door dressed in drag. Kyle answered the door to pay for the pizza's, it was Malory, Tiffany, Bessy, and Jen, the pizza girls, join in and all the girls ate dinner.. They just walked in past Kyle and said, \"Thanks for opening the door slave, the pizzas are already paid for\" He was led to the coffee table and told to lay down. They hogtied and bit gagged him and ate pizza, still in a full set of women's clothes.<br>\r\n<br>\r\n6:00<br>\r\n\"Take off your shoes and socks.\" He did and they blindfolds him and begins walking. They continued to her basement, \"Take off your shirt, your bra, and put your hands behind your back.\" He stood there topless and was handcuffed, collared, and they took off the skirt and panties and said, \"Open up.\" Kyle did and they shoved his dirty, sweaty bra, panties, and socks deep in his mouth and used duct tape to wrap his head. They then used her belt, and belted his thighs together. Then he used another pair of handcuffs to lock in his ankles. He heard the girl's leave and wasn't sure what they were doing.<br>\r\n<br>\r\n7:00<br>\r\nThey untied him and led him outside to the pool hall and put Kyle down on a pole looking out to the pool. Kyle put his arms together behind the pole and legs together Sasha quickly, but securely, wrapped up his wrists and ankles. RIIIP, RIIIP, \"Can you move your arms or legs?\" \"Nope.\" RIIP, RIIIP, now wrapping his torso and his thighs pole. \"Are you secure against the pole?\" \"Yep\" \"Good keep your mouth closed.\" Kyle obeyed and Sasha put strips of tape over his mouth, chin, then wrapped the whole thing by wrapping his head. The girls just ignored him and swam, naked of course, in the pool while Kyle watched.<br>\r\n<br>\r\n8:00<br>\r\nThey then lounged about and began talking about sensual things to tease Kyle. They all came inside. <br>\r\n<br>\r\n9:00<br>\r\nThey untied Kyle and Sasha said, \"Same situation as last night.\" The girls fucked Kyle and went to sleep, except the alarms.<br>\r\n10:00<br>\r\nSasha<br>\r\n11:00<br>\r\nMelony<br>\r\nMidnight Sunday<br>\r\nFelicity<br>\r\n1:00 A.M.<br>\r\nLaurie<br>\r\n2:00<br>\r\nTiffany<br>\r\n3:00<br>\r\nBessy<br>\r\n4:00<br>\r\nNora<br>\r\n5:00<br>\r\nValery<br>\r\n6:00<br>\r\nLara<br>\r\n7:00<br>\r\nSasha having a second go again.<br>\r\n<br>\r\n9:00<br>\r\nKyle felt the girls wake. He the light blinded him. The girls ate then left. He was freed, but Sasha was not done with Kyle. He spent the rest of the day cleaning up the mess they made.<br>\r\n<br>\r\n9:00 P.M.<br>\r\nShe untied Kyle and said, \"Good night.\" Kyle awoke the next day and went about his business. The next time he was tied up was</span></div></div>",
            "created":1496120400,
            "id":2327750,
            "title":"The next sleepover pt 2"
        },
        "141331222111":{
            "choices":[
                "Kyle obeyed, excitedly",
                "Kyle tried to talk his way out"
            ],
            "content":"<div class=\"\"><div> <span>Kyle walked through the door and it was slammed again. Sasha had brought even more girls. Kyle, \"Haven't I already payed back for the escape?\" Sasha, \"Yes but the girls think it's great that you accept the natural order of control now take your place boy and prepare for domination.\" Kyle just stood there slack jawed then said, \"What! No, I was just paying the girls back for a ruined night.\" Sasha, \"I told them how your so used to being tied up because I tie you up.\" Kyle, \"Okay, whatever, even if I did that's you and me not the whole town!\" Sasha, \"Tsk tsk, questioning the Peking order.\" she looked down, \"and lying about your feelings. We'll have to punish you for that, now strip.\"</span></div></div>",
            "created":1496379600,
            "id":2329804,
            "title":"Sasha's next party"
        },
        "1413312221111":{
            "choices":[
                "the doors lock",
                "the girls strip and sit in the hot tub"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright the joke is over. I'll strip and allow you to have your fun.\" Sasha, \"Just like that, you won't protest and you'll allow us to have our fun.\" Kyle, \"Protest! I've let all of you have fun with me before.\" Sasha, \"There's girls here that were not at the last party and you said I was your first partner.\" Kyle said, \"Oh yeah except them.\" The new girls nodded their head and said, \"I've never fucked him.\" Sasha, \"Oh, thought I would have to really punish you. Alright shut up and strip. Kyle stripped and began to walk past the girls. That was until Sasha punted Kyle's balls making him drop. Sasha, \"Did we tell you to move.\" Kyle, \"Sorry just following our routine.\" Sasha, \"Change of routine.\" They led him to the back deck. They tell him to stay and he does waiting for what will come.</span></div></div>",
            "created":1500008400,
            "id":2353370,
            "title":"Kyle obeyed, excitedly"
        },
        "1413312221112":{
            "choices":[
                "an hour later",
                "after he started sweating"
            ],
            "content":"<div class=\"\"><div> <span>\"come on the joke is over. I'll leave and allow you to have your fun.\" Sasha, \"If you leave you won't allow us to have our fun.\" Kyle, \"I don't want to-\" Sasha, \"I have made up my mind and don't care what you want.\" Kyle turned around and began to walk past the girls. That was until Sasha punted Kyle's balls making him drop. Sasha, \"Strip him and tie him up.\" Kyle began fighting back but the girls were too strong. Kyle, \"Please stop I'll do it, I'll do it.\" Sasha, \"Good.\" They let Kyle go and he begins stripping. They led him to the attic. They tell him to stay and he does waiting for what will come.</span></div></div>",
            "created":1497848400,
            "id":2338999,
            "title":"Kyle tried to talk his way out"
        },
        "1413312222":{
            "choices":[
                "an island in the carribbean",
                "On road trip around the country"
            ],
            "content":"<div class=\"\"><div> <span>You wake up to a group of girls standing around your bed. You jump up and said, \"What's going on.\" Sasha, \"You know whats going on. Your going to go on vacation with us girls, don't worry, you won't have to worry about anything.\" They grabbed you and said, \"Lets go.\" They stripped you blindfolded you, gagged you, bind you, and threw you in the back of a van, covered you, and took you to...</span></div></div>",
            "created":1498107600,
            "id":2340814,
            "title":"During the girl's vacation"
        },
        "141332":{
            "choices":[
                "they never called",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But something went wrong. What?</span></div></span></div>",
            "created":1478494800,
            "id":2234021,
            "title":"have someone call him away so he is busy and do..."
        },
        "1413321":{
            "choices":[
                "nothing at all, the world was empty of life",
                "an oppressing military force, and they saw you"
            ],
            "content":"<div class=\"\"><div> <span>In fact they didn't answer either. In fact, the phones didn't even work. They turned on the tv and to their horror all that played was a message, \"emergency, stay inside your homes, do not leave you homes.\" repeating on loop on every station.<br>\r\n<br>\r\nA week past and nothing changed, except you ran out of food. So you all now need to venture out to find food. What do you find?</span></div></div>",
            "created":1478667600,
            "id":2234791,
            "title":"they never called"
        },
        "14133212":{
            "choices":[
                "aliens",
                "American"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You all ran but they captured you and took you to the internment camp. That is when you saw one of the militia's faces they were...</span></div></span></div>",
            "created":1486616400,
            "id":2275614,
            "title":"an oppressing military force, and they saw you"
        },
        "1413322":{
            "choices":[
                "something scifi",
                "something fantasy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That being</span></div></span></div>",
            "created":1478494800,
            "id":2234023,
            "title":"something else"
        },
        "142":{
            "choices":[
                "Condom?",
                "Pregers",
                "Hard and fast"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shasha looks at kyle and sais '' why don't we move this to the bedroom?''<br>\r\n\"I agree klyle sais as he leans in to kiss her.</span></div></span></div>",
            "created":1345957200,
            "id":1413599,
            "title":"She takes it further"
        },
        "1421":{
            "choices":[
                "You undress",
                "He wants to do some rolplaying first."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You ask kyle if he brought a condom.<br>\r\n\"I always have a condom,baby\" kyle sais</span></div></span></div>",
            "created":1345957200,
            "id":1413602,
            "title":"Condom?"
        },
        "14211":{
            "choices":[
                "You have good hard sex",
                "The parents walk in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He knows you want to fuck and pulls of your shirt. Then takes off his. He uncips your bra with his teeth then strips down... Your bolth completly naked.</span></div></span></div>",
            "created":1345957200,
            "id":1413606,
            "title":"You undress"
        },
        "142111":{
            "author_id":"rightyou",
            "author_name":"SubShow",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm not going to even describe what happens. They then slept together and Kyle left next morning.</span></div></span></div>",
            "created":1529211600,
            "id":2508315,
            "title":"You have good hard sex"
        },
        "142112":{
            "choices":[
                "you close and lock the door then keep it going",
                "have a four way (with your parents)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your sucking his dick,giving im the best blow job he has ever had. He pulls it away a little then starts to cum in your mouth...then you find out your parents are home early when they walk in. Your parents are shocked they thought you were a virgin</span></div></span></div>",
            "created":1345957200,
            "id":1413960,
            "title":"The parents walk in"
        },
        "1421121":{
            "author_id":"winxclub10",
            "author_name":"WinxClub4ever",
            "choices":[
                "\"Sure, honey.\"",
                "\"No...let's keep the condom\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You shove your parents out the door and lock it. Then you continue the sex. Then you ask Kyle \"Kyle, do you want to try it without a condom? I mean, we're both overage.\"<br>\r\n<br>\r\nWhat does Kyle say?</span></div></span></div>",
            "created":1346475600,
            "id":1418535,
            "title":"you close and lock the door then keep it going"
        },
        "14211212":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "its cool i understand",
                "no you either do me with out one or its over between us"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>kyle \"no sorry babe, I'm not going to risk you getting pregnant just yet, cause we dont have a place, we dont have a steady income and were still in collage\"<br>\r\nyou \"...</span></div></span></div>",
            "created":1356930000,
            "id":1498889,
            "title":"\"No...let's keep the condom\""
        },
        "142112121":{
            "author_id":"lina1105",
            "author_name":"Lina Black-So Far Behind!!!",
            "choices":[
                "You ask for the condom and put it on him.",
                "You squeeze light and stroke him up and down."
            ],
            "content":"<div class=\"\"><div> <span>\"Its cool, I understand.\" You say and step back closer to him. You grab for his still semi hard erection then pause midway. <br>\r\nYou start to feel the embarrassment of your parents walking in on you in a way no one would ever want their parents to see. <br>\r\nKyle notices the indecision on your face and ask. \"Hey babe, you all right? Have you changed your mind? I hope not-\" he paused and stepped closer.<br>\r\nHe took your hand back and placed it on his cock. -\"cause I'm hot for you. You can't leave me hanging.\"<br>\r\nYou bite your lower lip in thought.</span></div></div>",
            "created":1374728400,
            "id":1634341,
            "title":"its cool i understand"
        },
        "14212":{
            "choices":[
                "realistic",
                "fictional"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the genre you are role playing more realistic or more fictional</span></div></span></div>",
            "created":1462165200,
            "id":2142511,
            "title":"He wants to do some rolplaying first."
        },
        "142121":{
            "choices":[
                "Action Adventure",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>action adventure themed roleplay? or was it something else</span></div></span></div>",
            "created":1462165200,
            "id":2142513,
            "title":"realistic"
        },
        "1421212":{
            "choices":[
                "detective theme",
                "spy theme"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>detective or spy</span></div></span></div>",
            "created":1477458000,
            "id":2228765,
            "title":"other"
        },
        "14212122":{
            "choices":[
                "That was cheesey but yeah",
                "That was so cheesey I lost my drive, lets just hang out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hey Baby I'm Agent 007 you wanna have fun.\"</span></div></span></div>",
            "created":1494306000,
            "id":2317244,
            "title":"spy theme"
        },
        "142122":{
            "choices":[
                "scifi",
                "fantasy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Main genre Scifi or Fantasy</span></div></span></div>",
            "created":1462165200,
            "id":2142516,
            "title":"fictional"
        },
        "1421221":{
            "author_id":"killa229",
            "author_name":"1HornyMoFo",
            "choices":[
                "Space ",
                "Future"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sasha asks Kyle if he prefers SciFi or Fantasy to which he replies ScIFi.</span></div></span></div>",
            "created":1474606800,
            "id":2213500,
            "title":"scifi"
        },
        "14212212":{
            "author_id":"killa229",
            "author_name":"1HornyMoFo",
            "choices":[
                "Taking off her pants",
                "Taking off his pants"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Can we base this in the future?\" Kyle asks, \"I don't see why not.\" Sasha replies with a slightly questionable look but shrugs it off and gets to action. She starts by...</span></div></span></div>",
            "created":1474606800,
            "id":2213502,
            "title":"Back To The Future!"
        },
        "142122121":{
            "author_id":"killa229",
            "author_name":"1HornyMoFo",
            "choices":[
                "Pulls her panties down and eats her out",
                "Pulls out his cock and tells her to suck it."
            ],
            "content":"<div class=\"\"><div> <span>She undoes her pants button and slides off her jeans. \"Do you like what you see-\"  \"Zaxxar. Thad my roleplay name.\" \"Ok Zaxxar. Do you like what you see?\". \"You know it babe.\" Kyle says already solid at this point. He then...</span></div></div>",
            "created":1474606800,
            "id":2213503,
            "title":"Taking off her pants"
        },
        "143":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "Scarlett",
                "Jordan",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>There was a loud bang and they broke apart quickly, looking towards the hallway. There was another loud bang and they watched as the door flew off of its hinges.<br>\r\n<br>\r\n\"Who is it?!\" Sasha shouted, her voice faltering a little.<br>\r\n<br>\r\n<br>\r\n<b>Who is it?</b><br>\r\n<br>\r\nScarlett - A tall girl with long brunette hair, brown eyes and a big chest.<br>\r\n<br>\r\nJordan - A average height boy with brown hair that just reaches his eyes.</span></div></div>",
            "created":1332565200,
            "id":1301505,
            "title":"Someone breaks in"
        },
        "1431":{
            "choices":[
                "\"All because Sasha denied her advances romantically\"",
                "\"All because Kyle denied her advances romantically\"",
                "\"All because Sasha and Kyle both cheated on her\""
            ],
            "content":"<div class=\"\"><div> <span>Scarlett busted in the room, \"You little mother fucker.\" Kyle and Sasha began running. They locked the door and hid. They both knew why Scarlett was so mad and they were not going to be caught by her. Scarlett kicked down the door and saw the open window. \"Fuck!\" She walked out the door and went outside. Sasha and Kyle sat there until morning and finally the morning broke. They stood up to go outside and the door didn't budge. Scarlett, \"I was wondering how long you would wait in that closet until you would try getting out. I put both doors over the door, plus I also scooted the couch, the bed, some cabinets, and other assort pieces of furniture. All in all there is probably about a half a ton of weight keeping you in your little prison. I might let you out for a price, or I might burn this house down with you inside. I haven't decided yet.\" Sasha and Kyle thought, </span></div></div>",
            "created":1488430800,
            "id":2284166,
            "title":"Scarlett"
        },
        "1432":{
            "author_id":"jaylianw",
            "author_name":"B. A. Lupis",
            "choices":[
                "Jordan grabs Sasha",
                "Jordan tries to humiliate Kyle",
                "Sasha gets mad at Jordan"
            ],
            "content":"<div class=\"\"><div> <span>As jordan broke through the door, Kyle grabbed Sasha from around the waist, pulling her behind him.<br>\r\n\"Hey man!\" Jordan said as he seen Kyle. Jordan knew that Kyle was going to be here alone with Sasha.<br>\r\nKyle and Sasha knew Jordan from around town and also knew that he was absolutely crazy, hence him breaking down the door instead of just knocking.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1336107600,
            "id":1329523,
            "title":"Jordan"
        },
        "14322":{
            "content":"<div class=\"\"><div> <span>Jordan swings at Kyle, but Kyle just catches his fist and bends Jordan's hand back breaking his wrists. Jordan cries out and Kyle takes the second distraction to give Jordan a jaw breaking hook. Jordan's jaw crunches under the force of Kyle's fist and is out like a light. The sudden show of machismo makes Sasha want to ravishingly fuck Kyle she takes off her cloths and <br>\r\n<br>\r\nKNOCK KNOCK, \"Kyle time to get up.\" It's your wife Sasha, same girl, and she comes in to give you a morning kiss, you have been married for a couple of years now and that event actually happened and ended with you two fucking all night long. You sit up, \"Hey babe.\" Sasha, \"You sleep well.\" Kyle, \"Yeah just dreaming of the night I beat up Jordan and won you love.\" Sasha looks at you, \"Where did I wake you?\" Kyle, \"right at the moment you stripped I was taking you into your room about to have sex and wham, woken up.\" Sasha, \"I'm sorry, you wanna fuck me in an 'I'm sorry for waking you before sex in a sex dream' sex?\" Kyle, \"yeah babe.\" She comes over and begins kissing you as she strips, she begins to mount you<br>\r\n<br>\r\nKNOCK KNOCK, \"Kyle get the fuck up I need to talk to you.\"<br>\r\n<br>\r\nKyle gets up, a damn sex dream inside of a sex dream. sex-dreamception. Kyle gets up and walks over to kiss Sasha, \"Hey babe you wouldn't believe the dream I had.\" Sasha, \"Oh what was that?\" she said, defensively. Kyle, \"so it was the night I beat up Jordan and won you love.\" Sasha's tone left, \"Oh\" Kyle, \"Yeah, so I was about to have sex with you, when you woke me but it was a dream inside a dream and as you woke me I told you of the dream and we were about to have sex when you woke me.\" Sasha, \"So you looking for 'I'm sorry for waking you before 'I'm sorry for waking you before sex in a sex dream' sex in a sex dream' sex?\" Kyle, \"if you want?\" Sasha, \"Maybe, since you did remember the anniversary of when you proposed which was exact a year before the day we married therefore, you remembered our anniversary.\" Kyle, \"Of course I'm going to take you out to dinner and since I never seem to get you the right gifts for anything, I'll let you pick out your gift. Why are you looking at me that way, I really did remember.\" Sasha, \"Oh really and do you have reservations or any kind of proof that you remembered?\" Kyle, \"Yep.\" pulling out the reservation. Sasha sigh in relief and they in fact did have sex.\"</span></div></div>",
            "created":1477544400,
            "id":2229167,
            "title":"Jordan tries to humiliate Kyle"
        },
        "14323":{
            "choices":[
                "writer's choice 1",
                "writier's choice 2"
            ],
            "content":"<div class=\"\"><div> <span>Sasha, \"Get the fuck out Jordan.\" He looked at her and back handed her, Kyle tried to stop it but Jordan picked him up and threw him across the room. Then Sasha stood back up and as soon as Jordan turned Sasha unleashed upon him. Unbeknownst to either guy Sasha was trained in multiple martial arts Jordan tried to fight back but was greatly overwhelmed. Than Jordan tried to run but Sasha also ended that quick by twisting his ankle temporarily paralyzing him in pain. In only seconds Sasha had Jordan laying on the floor in a arm bar, crying and begging to be let free. Kyle had realized what she was doing and called the police. They came and took Jordan away. Sasha closed the door the best she could and continued the sleepover. They both knew that this would be the end of all the hatred and fear Jordan had spent over a decade building. Sasha, \"So what does my little man want to do now.\" Kyle, \"Little man but...\" Sasha, \"I'm Sorry who beat up the big bad bully and who was thrown against the wall?\" Kyle, \"But.\" Sasha, \"Shhh it's okay you don't have to explain, you are by big strong man still, I can still protect you while you do other manly things like grass cutting, mechanic work, and loving me. You just will have to admit that you are my little bitch.\" At this she slapped him on the butt. Kyle got excited, he was always looking for a woman that would take control and be the boss in the home. However, to make it seem like he didn't he said, \"Well, okay, if it makes you happy, I want to keep you so, I am your bitch.\" She looked at him and said, \"part of my training is spotting a liar, you like me taking control and you know it.\" Kyle, \"Wha, no I, no, No!\" Sasha, \"Your getting defensive, and cute.\" She then pinched his chin and giggled. Kyle, \"Fine, yes, I like femdom.\" Sasha, \"Yes you do and you better remember it. Now what should I do to you\"<br>\r\n<br>\r\nNote:Let's try and do something different than the choices already laid out for us. We already have fart, armpit, and foot domination, lets avoid these in this feed, please.\"</span></div></div>",
            "created":1462510800,
            "id":2144058,
            "title":"Sasha gets mad at Jordan"
        },
        "143231":{
            "choices":[
                "you cooperate",
                "you try to get away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sit down and shut up, we are marathon watching princess movies, and if you don't cooperate it will only get worse for you</span></div></span></div>",
            "created":1477112400,
            "id":2227015,
            "title":"writer's choice 1"
        },
        "1432311":{
            "author_id":"rightyou",
            "author_name":"SubShow",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>kyle obey for the rest of life. is now a slave.</span></div></span></div>",
            "created":1529211600,
            "id":2508314,
            "title":"you cooperate"
        },
        "143232":{
            "choices":[
                "tell your parents you moving in with me in our own house",
                "clean up the mess Jordan made"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Strip naked, now! Only the strong deserve clothing.<br>\r\n<br>\r\nHe stripped<br>\r\n<br>\r\nNow go...</span></div></span></div>",
            "created":1477112400,
            "id":2227012,
            "title":"writier's choice 2"
        },
        "1433":{
            "choices":[
                "something seemingly out of fiction",
                "They didn't know who it was but it's best not to ask the burglar questions",
                "both sets of their parents, DUN DUN DUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUN!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sasha screamed and Kyle grabbed her and began running, dragging his petrified girlfriend with him. Through the door came the most frightening thing imaginable</span></div></span></div>",
            "created":1478494800,
            "id":2234027,
            "title":"Other"
        },
        "144":{
            "choices":[
                "a magical land of fantasy",
                "a wonderful world of fairytale",
                "the other side of the room, magical"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kyle pulls back and realizes that Sasha transported him to...</span></div></span></div>",
            "created":1462510800,
            "id":2144066,
            "title":"Reader's Choice"
        },
        "1443":{
            "content":"<div class=\"\"><div> <span>At least until she pushed you onto the couch and started stripping. You were finally gonna get, HOLY SHIT SASHA'S A MAN. You were dating a hermaphrodite this whole time. You told him you were not gay and he told you that neither was he. Then you asked, \"Well then why are you trying fuck me.\" His response was, \"What's gay about a man and a woman who love each other making love?\" You looked down to see a female frame. You spent the rest of you life, happy but, trying to figure out how you both switched genders.</span></div></div>",
            "created":1501650000,
            "id":2363477,
            "title":"the other side of the room, magical"
        },
        "145":{
            "choices":[
                "being tied up",
                "being my petboy",
                "being my babyboy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Knee<br>\r\n<br>\r\nKyle drops to his knees and whimpers out, \"Why did you knee me in the crotch?\" Sasha, \"To show you whose boss, now get up and lets get you ready for your night of...</span></div></span></div>",
            "created":1462510800,
            "id":2144067,
            "title":"Reader's Choice"
        },
        "1451":{
            "choices":[
                "To the bed",
                "To a chair",
                "To the rafters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She made him strip and planned out how she would tie him</span></div></span></div>",
            "created":1501650000,
            "id":2363172,
            "title":"being tied up"
        },
        "14511":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Waxing strips",
                "razor and foam"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sasha managed to tie Kyle to the bed naked and then after she got you going she got up and left the room and about 5 minutes later she returned. <br>\r\n<br>\r\nwith.....</span></div></span></div>",
            "created":1508475600,
            "id":2403818,
            "title":"To the bed"
        },
        "1452":{
            "choices":[
                "walk him down the street",
                "force him to do dog things until she released him",
                "locked him in a cage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She made him strip and slipped a collar on his neck. What did she do with him</span></div></span></div>",
            "created":1502082000,
            "id":2366316,
            "title":"being my petboy"
        },
        "14523":{
            "author_id":"speedy1242",
            "author_name":"speedy",
            "choices":[
                "No",
                "Yes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she call more girls over afterwards </span></div></span></div>",
            "created":1530054540,
            "id":2512336,
            "title":"locked him in a cage"
        },
        "15":{
            "author_id":"liamkennedy",
            "author_name":"LiamKennedy",
            "choices":[
                "An alien attack",
                "Sasha clones",
                "Sleepover becomes a party",
                "Time travel",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one of these things happen...</span></div></span></div>",
            "created":1332565200,
            "id":1301805,
            "title":"More"
        },
        "151":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "Sumurians :  (Lizard/snake humaniod aliens)",
                "Standard Grey Aleins",
                "Some other type of Alien"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Unknown to both Sasha and Kyle, Sasha's parents' house to about to have an attack from Aliens from Outer Space.<br>\r\n<br>\r\nThe Type of Alien are: </span></div></span></div>",
            "created":1462424400,
            "id":2143808,
            "title":"An alien attack"
        },
        "1511":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "Sasha come closer to a kiss (Making out)",
                "Sasha straddle Kyle and pin him to the sofa  (Wrestling)",
                "Sasha  suddenly retreat and sit on the other sofa (Do nothing("
            ],
            "content":"<div class=\"\"><div> <span>Over 10000 meter above the Earth, an Undetected Alien Space Ship is spying on the your human couple.  The Sumurians are scaly, bipedal sentient beings whose's home-world is 600 light years away.They had slender body, rough scales, and often long lizard-like snouts on their faces.  <br>\r\nNormally, they are pirates and raiders, but today, they are mercenaries.  This group, head by the female Mal La-lar, had been given the task of kidnapping some humans, this time from the North American continent.    They are already halfway through their quota when they spotted the two humans.  <br>\r\n<br>\r\n\"Mal La-lar,\"   A tall, skinny Sumurian began.  \"It look like we have found some young humans who are part of the quota.  <br>\r\n<br>\r\n\"Oh, \"  Mar La-Lar said as she moved over  to the screen where the tall, skinny Sumurian was over. \"Is one of   a brunette?\"  she asked.<br>\r\n<br>\r\nThe male Sumurian gave his boss a big toothy smile.  \"Both of them.\"<br>\r\n<br>\r\nMal La Lar have her own toothy grin on her snout.  \"Well, I like to take the couple, personally. Prepare the Teleportation Ray!\"<br>\r\n<br>\r\n<br>\r\n****<br>\r\n<br>\r\nMeanwhile Kyle had just enter the home admiring his girlfriend.  He was serceting hoping that his girlfriend was going to invite him over at some point, but coming in the house just as her parent left for vacation.  He couldn't believe his luck!  Yep, it was just the kind of night where anything can happen.  <br>\r\n<br>\r\nSasha led Kyle to the living room sofa, and sat down next to him.  Kyle was wearing a T-shirt, jeans and sneakers, but Sasha was greeted him in nothing but a T shirt and panties.  Instead of a flirt, coy aura  that she usually had with him, Sasha has a....determined face.<br>\r\n<br>\r\n\"Kyle,..we been dating for a while,...so I want to go further than we had before.\"<br>\r\n<br>\r\n\"All the way?\"  Kyle asked hopefully.<br>\r\n<br>\r\n \"Maybe, but we are going to do it my way!  \"<br>\r\n<br>\r\nKyle knew that Sasha could be bossy, but the face she gave him look a lot more...dominate.\"<br>\r\n<br>\r\nOk..\"  Kyle said nervously.<br>\r\n<br>\r\nSasha's face soften as she moves closer.  \"So..Let see what happens.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1462510800,
            "id":2143838,
            "title":"Sumurians :  (Lizard/snake humaniod aliens)"
        },
        "1513":{
            "choices":[
                "Predators",
                "Xenomorphs",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They were...</span></div></span></div>",
            "created":1490677200,
            "id":2295851,
            "title":"Some other type of Alien"
        },
        "15133":{
            "choices":[
                "yeah",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Humans from another demesion</span></div></span></div>",
            "created":1493182800,
            "id":2311451,
            "title":"other"
        },
        "152":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "He meets Sasha's clone",
                "He meets someone else",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>As Kyle and Sasha walked into the living room, a bump could be heard from upstairs.<br>\r\n<br>\r\n\"What was that?\" Kyle asked, looking up at the ceiling.<br>\r\n<br>\r\n\"Nothing,\" Sasha said quickly, standing between him and the doorway, \"Something probably just fell over.\" Kyle nodded slowly and the two of them sat on the couch to watch horror films together.<br>\r\n<br>\r\n\"I need to go to the bathroom,\" Kyle said after a while. Sasha nodded and told him the way. As Kyle walked up the stairs...</span></div></div>",
            "created":1332651600,
            "id":1302135,
            "title":"Sasha clones"
        },
        "1521":{
            "author_id":"redz028",
            "author_name":"hey you 64",
            "choices":[
                "25 clones",
                "100 clones",
                "every girl in his school"
            ],
            "content":"<div class=\"\"><div> <span>\"What's this\" Kyle asked.  \"Its nothing, you weren't supposed to find out yet.  I was going to clone myself to torture you with my feet; well, our feet.\"  \"But i hate feet, why would you do that\"  Kyle said while slowly backing toward the door.  \"Mostly because i knew that you hated feet.  And because i'm a total bitch. And you're going to smell every last stinky foot, toe and heel.  And you will thank every last one of me.\"  Kyle turned to run but ran stopped in his tracks.  He looked in terror as he saw...</span></div></div>",
            "created":1417150800,
            "id":1895034,
            "title":"He meets Sasha's clone"
        },
        "15213":{
            "author_id":"whoppop",
            "author_name":"Whoppop",
            "choices":[
                "100",
                "1000"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How many girls were there?</span></div></span></div>",
            "created":1419742800,
            "id":1908273,
            "title":"every girl in his school"
        },
        "152131":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "It was just 10.  More than enough anyway.  ",
                "Nope it is crazy land there are a 100.  "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Were there really a hundred or were there just 10?  I mean seriously a hundred?  </span></div></span></div>",
            "created":1419829200,
            "id":1909092,
            "title":"100"
        },
        "152132":{
            "choices":[
                "her's feet time",
                "your's time to free yourself from the oppression of feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and since I also hate feet and wanted to do something with this feed I will give an option<br>\r\n<br>\r\nWhose side was this massive army of girls on</span></div></span></div>",
            "created":1462165200,
            "id":2142519,
            "title":"1000"
        },
        "1521322":{
            "choices":[
                "Sasha and her feet of fury",
                "The army of girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a battle ensued and of course the Sasha army mostly fought with their feet. The dust cleared and Kyle saw the victor was </span></div></span></div>",
            "created":1462165200,
            "id":2142520,
            "title":"your's time to free yourself from the oppre..."
        },
        "15213222":{
            "choices":[
                "their lustful eyes looking upon you",
                "they were rebel sasha clones"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is when you realized something was strange. You look upon the army of girls now more closely and realize...</span></div></span></div>",
            "created":1462424400,
            "id":2143537,
            "title":"The army of girls"
        },
        "152132221":{
            "choices":[
                "A night of femdom bondage",
                "playing chess with them, had to have one non-sexual option"
            ],
            "content":"<div class=\"\"><div> <span>\"why are you looking at me like that?\", said Kyle. Lola, the now graduated former head cheerleader of the high school said, \"well obviously the damsel in distress will reciprocate his hero's kindness with sex, just like in all those movies.\" \"Sex! But there is literally a thousand of you!\" said Kyle but Lola just said, \"Aw, don't worry little Kyle we're not talking about at the same time, you will be paying us off individually and only when all thousand of us have had our reward are you free of you debt.\"<br>\r\n<br>\r\n(obviously this is an impossible task for us as the writers but we can create creative solutions and scenario's to \"fulfill\" this order)<br>\r\n<br>\r\nAt this Lola and all the alumni cheerleaders that ever went to the school, 250 in all, stepped up. Lola, \"So Kyle, we wanted to get our fun done and since a quarter of you repayment will be done on Friday you will be 25% closer to freedom. Your repayment is, you will spend a week in the cheer-leading squad at the high school. Every night you will come over to my house and you will learn how to be a proper female cheerleader, and everyday you will spend the whole day as a girl and go to cheerleader practice after school. After Friday's game we will hand you over to the next girl or girls.\"<br>\r\n<br>\r\nAfter the game, and a week of being Kylie, Kyle was handed over to the 15 girls who were part of the chess club, and since nerds make the freakiest partners they decided to put Kyle through...</span></div></div>",
            "created":1462424400,
            "id":2143543,
            "title":"their lustful eyes looking upon you"
        },
        "152132222":{
            "choices":[
                "he got what he wanted",
                "she had different interests"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They did not want to do feet, and they also did not want to share, so they started a gladiator league where the last girl standing would have Kyle forever. Kyle hoped that the girl who one shared his interest in role-play. Unfortunately for him...</span></div></span></div>",
            "created":1462424400,
            "id":2143544,
            "title":"they were rebel sasha clones"
        },
        "1523":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "She's not joking",
                "She's joking",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kyle finishes in the bathroom and on the way back hears another bump coming from behind a door. Curious, he tries the door and finds it unlocked. When he opens it he is shocked to see several Sashas in large tubes at different levels of development. Not only is Sasha there, but so is her whole family. One of them moves and hits the side of the large tube they're in. It's then Kyle realizes they're alive. \"What the fuck\", Kyle exclaims! He then hears Sasha from behind say, \"I see you found my dad's secret lab. I guess you have to die now.\" </span></div></div>",
            "created":1597405920,
            "id":2885470,
            "title":"Reader's Choice"
        },
        "15232":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "They make a copy of Kyle's brain",
                "They make a copy of Sasha's brain",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kyle turns to see a knife in her hand and turns white. She then smiles and shows the sandwich she has in the other hand. \"I'm kidding\", she states. \"What is this\", Kyle asks? Sasha shrugs and replies, \"Clones, my dad is a cloner.\" \"Are they alive\", Kyle asks? Sasha answer with, \"Well, yes and no. They're alive, but they have no mind, memories, or personalities. Dad calls them blanks. He uses that machine over there to copy a living person's mind and then down loads that into the blanks empty mind, or whatever. It's pretty technical.\" Kyle realizes right away the potential and states, \"You could kind of live forever.\" Sasha shrugs and states, \"Yeah, that's what my dad says all the time. Do you want to see how it works? Dad showed me how.\" \"Hell yeah\", Kyle responds.  </span></div></div>",
            "created":1597406340,
            "id":2885478,
            "title":"She's joking"
        },
        "152321":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "Sasha",
                "Sasha's older sister",
                "Other family member"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, sit down in the chair and we'll get started\", Sasha states. Kyle steps back and responds with, \"I thought we were going to copy your brain and make two of you.\" Sasha laughs and says, \"Oh, you were looking for a three-way. Well, I have to operate the controls. Dad says you have to copy and download right away or the whatever starts to degrade. I'll put a copy of your mind into one of the blanks.\" Kyle looks shocked and retorts, \"You're going to turn me into one of your family members?\" Sasha shakes her head and answers, \"No, you copy will be going into one of the blanks. You will stay you. Come on, I'll make it worth your while.\" Kyle can't resist that offer and sits in the chair. Sasha lowers the headpiece down and soon after the machine whirls to life. \"You'll probably blank out for a second. Don't worry it's normal\", Sasha states. \"Wait, normal? Have you done this already\", Kyle asks? Sasha giggles and answers with, \"Who do you think is on vacation with my parents right now?\" With that Sasha hits a button and Kyle blacks out. When he next opens his eyes he see he's in a tube. He also sees his reflection on the side of the tube and sees he's now in the body of.... </span></div></div>",
            "created":1597407480,
            "id":2885496,
            "title":"They make a copy of Kyle's brain"
        },
        "1523211":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "Kyle/Sasha tries to escape",
                "Kyle/Sasha sees this as an opportunity ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm Sasha! She said she wasn't going to turn me into someone else\", Kyle thinks panicking. The tube suddenly drains of fluid and Kyle drops to the floor. She feels arms pull her up and a towel placed around her. The next thing she hears is a familiar male voice ask, \"So, did it work? Is there a copy of my mind in your clones body?\" \"Yep\", responds Sasha. Kyle looks up and realizes it far worse than she thought. She hasn't been turned into Sasha. She's just a copy of the original Kyle placed in a Sasha clone. \"Dad never tried putting a man's mind in a female clone body. Hope nothing bad happens. Well, I can always hit the abort button and dissolve her\", Sasha states. </span></div></div>",
            "created":1597407900,
            "id":2885498,
            "title":"Sasha"
        },
        "15232112":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "She's not up for it",
                "She's all in",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kyle/Sasha opens up her towel and looks down at her breasts. \"This is so cool\", she states feeling herself up. \"Right for the boobs. Typical man\", Sasha says. Kyle/Sasha and Kyle original both exclaim in unison, \"Hey!\" Sasha laughs and responds with, \"I guess we can all have fun together. You were looking for a three-way.\" Kyle smiles and so does Kyle/Sasha unti she realizes she'll be one of the females in this three-way.</span></div></div>",
            "created":1597408080,
            "id":2885501,
            "title":"Kyle/Sasha sees this as an opportunity "
        },
        "152321122":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "Put on the brakes",
                "Keep going",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>While the chance of lesbian sex has its appeal having sex with himself, or rather herself, or whatever does not. \"First, I want to see you two make out\", Sasha states. Kyle/Sasha and Kyle look at each other. Kyle/Sasha sees, well himself looking back. Kyle/Sasha still has an image of herself as being a man. Kyle on the other hand is feeling a little conflicted. This naked person looks like his girlfriend, but he knows it's really a copy of his mind in that body. She knows every perverted secret thought he's ever had. Shit, he's even thought once if he was a chick he'd ride every dick he could find, be a total slut. Kyle/Sasha is having a similar thought, but never imagined it would be her dick she'd be riding. Curiosity though starts eating at her. \"Ok\", she replies to Sasha's request. Kyle looks surprised. Kyle/Sasha drops the towel and walks over to Kyle giving him a kiss. It's awkward at first, but things start loosening up. \"Can I take lead since I'm still the guy\", Kyle states. Kyle/Sasha is a little put out by this but then realizes, \"I am a chick, so I can see his point. Well, it's also my point.\" Kyle starts undressing and soon they're both naked with their hands all over each other. For Kyle this has been a moment he's been waiting for. He has been wanting Sasha's, but she had been putting this off. For Kyle/Sasha it's weird and kinky, but also a real turn on. It's sort of like masturbating but better. \"This is so hot\", Sasha states loudly! They both look over and see that Sasha has also stripped down and is now fingering herself. \"Keep going. I want to watch you two fuck\", Sasha demands. Though Kyle is all is Kyle/Sasha is starting to wonder about letting a cock in her. \"Fuck, that would be gay, right? I'm a girl now though, well a girl clone body with my mind and its my cock that would be fucking me. Shit, this is confusing\", Kyle Sasha thinks to herself. </span></div></div>",
            "created":1597492560,
            "id":2885907,
            "title":"She's all in"
        },
        "1523211221":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "They're both ready to keep going",
                "Kyle/Sasha is still resistant ",
                "Kyle is resistant"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm not so sure about this\", Kyle/Sasha states stopping. Kyle pauses to. He's starting to feel a little cheated. He was hoping to have sex with Sasha tonight, not her clone with a copy of his mind. Sasha sighs and states, \"It's real simple. You fuck her, or I hit this button and she goes bye bye. You got it? I don't care if she doesn't want to. Take that ass.\" Kyle and Kyle/Sasha suddenly realize just how twisted Sasha is. \"She'll do it\", they both think in unison.</span></div></div>",
            "created":1597492860,
            "id":2885912,
            "title":"Put on the brakes"
        },
        "152322":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "yes with the real sasha",
                "yes with the clone",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Kyle stood along side Sasha's dad as Sasha went and stood inside the machine which copies someones mind... Her dad did the normal checks and then proceeded with the memory scan... once done sasha walked out but so did the clone... was there a problem during this</span></div></div>",
            "created":1597409700,
            "id":2885520,
            "title":"They make a copy of Sasha's brain"
        },
        "153":{
            "choices":[
                "The next party",
                "When she moved out",
                "Her 'freed from imprisonment from last party' party happened"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The beat was pounding and the house was shaking. Eventually everyone passed out drunk. They were awoken by Sasha's parents coming home. She was grounded for literally a year.</span></div></span></div>",
            "created":1496811600,
            "id":2332715,
            "title":"Sleepover becomes a party"
        },
        "1532":{
            "choices":[
                "When he took her to their new home",
                "Her birthday",
                "His birthday"
            ],
            "content":"<div class=\"\"><div> <span>She had a decent apartment. She actually invited Kyle over, and decided to reward him for being so faithful. She left a note to guide him to the basement. She left in the laundry room and continued to the back of the basement. She used rope to tie her legs apart each leg to a different pole far out of reach. When that was tight she uses more rope to tie a crotch rope and she tied her breasts. She wrote on her stomach, \"Your little fun-hole needs a dick.\" She made sure the rope she would tie her arms with was ready and she then blinded herself with a scarf. She made sure there was no chance of seeing and used the other half of the scarf to tie a knot in her mouth creating a knotted cleave gag. She taped over her mouth and reached up to the rope above her head. She slipped her wrists in and gave the slipknot a tug, tying her wrists tightly together bounding her securely. About an hour later Kyle came home and found her. He untied her legs and retied them together. He untied the rope holding her to the roof and carried her to the bed. There he raised her arms up again and tied her wrists to the headboard, and used the excess leg rope to tie her to the foot board. He then said, \"If you stay here like a good girl maybe I'll give you what you want.\" and left her to do guy things around the house. He fell asleep caressing her. In the morning he fucked her and decided to leave her. It was only on the third morning that he freed her, all-in-all he fucked her thrice and she loved the whole weekend.<br>\r\n<br>\r\nThe next time she was tied up was</span></div></div>",
            "created":1501131600,
            "id":2359968,
            "title":"When she moved out"
        },
        "15321":{
            "choices":[
                "during breakfast",
                "after breakfast"
            ],
            "content":"<div class=\"\"><div> <span>Of course she needed to be tied up for the trip. He decided to pack her in the u-haul like furniture. So he grabbed the packing tape and grabbed his wife. He mummified her and placed her in a place where she'd be air conditioned. Then he packed all his other objects in, causing no escape. <br>\r\n<br>\r\nAfter a long 21 hour drive he arrived in his newly acquired estate and he unpacked his furniture and left it all wrapped up as he returned the truck. Then he unpackaged his furniture from most to least importance. After unpacking all his important objects he unwrapped his least important but most useful object, Sasha's breasts and vulva, and only those parts of her. The next morning the rest of her was unwrapped and she thanked him for the fun and putting her in her place. They had sex and Kyle made sure she wasn't upset her put her at the bottom of the importance. She just kissed him and said, \"It's was all a game, I know I'm the most important thing in your life.\" and went to cook breakfast.</span></div></div>",
            "created":1508475600,
            "id":2404015,
            "title":"When he took her to their new home"
        },
        "154":{
            "choices":[
                "THE PAST",
                "THE FAR FUTURE",
                "THE 5 SECONDS IN THE FUTURE WHEN THEY WOKE UP FROM PASSING OUT"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They felt weird and passed out and when they woke up they were in</span></div></span></div>",
            "created":1486530000,
            "id":2275252,
            "title":"Time travel"
        },
        "1541":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "De-age",
                "Back to the past"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">Do they stay in the present and de-age or do they go back to a specific point in their lives?</font></span></div></span></div>",
            "created":1571886600,
            "id":2737589,
            "title":"THE PAST"
        },
        "15412":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "When they were 10 years old (back to school)",
                "when they were 4 years old (back to daycare)",
                "Before they were born (back to the womb!)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">How far did they go back?</font></span></div></span></div>",
            "created":1571886900,
            "id":2737591,
            "title":"Back to the past"
        },
        "155":{
            "author_id":"evilguy496",
            "author_name":"evilguy496",
            "choices":[
                "Let Kyle torture her",
                "Nothing special, really",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmm... What to do....</span></div></span></div>",
            "created":1332651600,
            "id":1302085,
            "title":"More"
        },
        "1551":{
            "choices":[
                "fart torture her",
                "armpit torture her",
                "foot torture her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She sits back and allows him to...</span></div></span></div>",
            "created":1462510800,
            "id":2144061,
            "title":"Let Kyle torture her"
        },
        "1552":{
            "author_id":"beastocity1089",
            "author_name":"TheClone",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yep, nothing special happens. They watch a movie on the couch and then say their goodbyes</span></div></span></div>",
            "created":1541333580,
            "id":2572919,
            "title":"Nothing special, really"
        },
        "1553":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "Sasha phones a friend to come around",
                "Sasha's younger sister is at home and comes downstairs",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe you'd prefer one of these options:</span></div></span></div>",
            "created":1332651600,
            "id":1302136,
            "title":"More options"
        },
        "15531":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What gender is this friend</span></div></span></div>",
            "created":1462165200,
            "id":2142512,
            "title":"Sasha phones a friend to come around"
        },
        "155311":{
            "choices":[
                "at home",
                "during the ride"
            ],
            "content":"<div class=\"\"><div> <span>She was on the couch texting. Kyle leans over, \"Who you texting sweetie?\" She pulls the phone away and teasingly said, \"None of your business. You're being naughty.\" She grabs his testicles and gives them a hard squeeze. She kept her grip one second longer than was comfortable before letting go and began softly rubbing. She just said, \"Follow me and do what I say.\" \"What...I...Why?\" She gripped hard again after slapping him and said, \"Because I said so.\" This time not letting go until he whimpered, \"Whatever you want.\" She led him off the couch and stopped him, \"Place your shoes next to the door and your socks in your shoes.\" Then she led him to the stairs of the basement, \"Take off your pants, but carry the belt, I might use it.\" She led him downstairs, \"leave your underwear at the foot of the steps.\" She led him to the back of the basement, \"Leave your shirt at the door.\" He walked in and she shut the door. She picked up his shirt, his underwear, his pants, and his shoes, and put them in a bag that she put on top of the closet. She went back downstairs and looked at Kyle, \"You're sexy, but smaller than I hoped.\" Kyle, \"I'm not small!\" Sasha, \"My current boyfriend is a foot long. How big are you?\" Kyle, \"I'm five inches but that's closer to normal than a foot.\" Sasha, \"Yes, five and a half is average, your smaller than average but why do you think I want you, your more comfortable but I need you to do something. Something you'll definitely like...in the end.\" She walked up to him and put a ski mask on him. The door bell rang and she said, \"Stay here that's Aaron, I'll come back for you.\" She went up and let him in.<br>\r\n<br>\r\nThey watched a raunchy rom-com and Sasha began rubbing Aaron. After the movie they sat and chatted. She grabs his testicles and gives them a hard squeeze. She kept her grip longer than was comfortable and then whispered, \"You wanna fuck?\" before letting go and began softly rubbing. She just said, \"Follow me and do what I say.\" \"What you say, I'm the man and you won't get any of my foot long sub unless your a good girl?\" She gripped hard again after slapping him and said, \"I'm the woman, therefore, I choose when something is put in me.\" This time not letting go until he whimpered, \"Whatever you want.\" She led him off the couch and stopped him, \"Place your shoes next to the door and your socks in your shoes.\" Then she led him to the stairs, \"Take off your pants, but carry the belt, I might use it.\" She led him upstairs, \"leave your underwear at the top of the steps.\" She led him to her room, \"Leave your shirt at the door.\" He walked in and she shut the door. She then texted Kyle. He jumped when his phone went off. She put it on vibrate so Aaron didn't hear. It said, 'come up and wait out of sight, I'll give you the cue.\" He picked up Aaron's shirt, underwear, pants, and shoes, and put them in a bag that he left on the loveseat. He went upstairs and watched. In the time he took picking up all the things of Aaron, Sasha had already gotten him stripped and used his belt to tie his wrists above the headboard, \"You're sexy, but your personality is awful.\" Aaron, \"What! fuck you bitch. You know what fun time is over.\" Sasha, \"fun time has been over since a week ago!\" Aaron, \"Bitch what are you talking about?\" Sasha, \"I found another man, one that has a bigger heart, and a more comfortable penis, yeah, riding the 'foot long sub' was a huge pain in my cooch. Meet my new boyfriend.\" Kyle walked in, wearing a ski mask and holding his belt. Aaron, \"Oh so you dumped me for a cracka?\" Sasha, \"I am a cracka, you racist black fuck.\" Aaron, a black man, was pissed. Sasha, \"smack that disgusting foot long turd around a bit with that belt wont'cha Murphy.\" Aaron, \"Do it and I'll hunt you down, Murphy.\" Kyle smiled and THWACK, THWACK, THWACK, etc until Aaron was senseless from pain. They left Aaron in the middle of the shopping mall 10 miles from his house. His clothes were left at his house with a note that said, \"Aaron left these at my house -His white ex-girlfriend Sasha.\" The next day Aaron was bouncing around in stolen clothes asking, \"Where's Murphy.\" Murphy McMulty. Murphy, \"So your the man that beat up my cousin Sasha.\" Aaron, \"She's fucking her cousin?\" turning around to see a six and a half foot tall bodybuilder. Murphy, \"No, she just said that so that to throw you off. So your the one abusing my cousin.\" Aaron yelled, \"I ain't afraid of no whitey.\" and swung. Murphy, a heavy weight MMA fighter, quickly beat the shit out of Aaron. Murphy left him at his house and Aaron woke to his parents waking him up. His mother, \"You've been drinking boy,\" slap, \"Get your ass inside.\" He staggered up, tripping on bottles around him, and came in to the bag with the note. His parents, racist as well, literally beat him up for dating a white girl. Then the neighbors called the police who arrested all three individuals, his mother and father for assault and battery, and Aaron for theft.<br>\r\n<br>\r\nAll-in-all Kyle learned to never mess with his girlfriend. Sasha decided to move away so Aaron would not find them. She was an heiress of a multi-billion dollar airline and had her own personal mansion on a private island off Key West. She also decided Kyle was going her so she put on an engagement ring showed Kyle and said, \"You're marrying me right?\" He said yes and he packed his things. They were packed and went to their new home.</span></div></div>",
            "created":1500526800,
            "id":2356765,
            "title":"Male"
        },
        "1553112":{
            "choices":[
                "The next morning",
                "After they married"
            ],
            "content":"<div class=\"\"><div> <span>She was driving and said, \"I want some alone time. Go back there in the back of the Camper and play a little self bondage game. I'll release you if I need you.\" He obeyed and said, \"Any particular fashion.\" She just said, \"Your treat, but obviously I need the eye candy so you can ditch the clothes.\" <br>\r\n<br>\r\nShe had a decent Rv, it had a living area, a raised master bedroom, and any amenity he could imagine. He left his clothes in his suitcase and continued to the back of the Rv. The Rv's shades were drawn and it was impossible to see in, or out. Kyle decided to tie himself up in front of the Tv and watch porn. He turned on the tv and put on some girl on girl bondage porn. He used unused packing tape to tape his ankles and thighs together, tape his arms to his body. When that was tight he used some string tie cbt. He taped over his mouth and wrapped his wrists with the tape and watched. About an hour later Kyle felt the Rv stop. Sasha came back and saw what he did and said, \"passable but I need to improve the situation.\" He was untied and taken to the Master bedroom. There she raised his arms up again and tied his wrists to the headboard and his ankles to the foot board with rope. He then said, \"What are you gonna do with me?\" She took a foam ball gag shoved it in his mouth, belted it, taped over it with packing tape, then undid the cbt and retied it tighter, and finally after he showed signs of discomfort, turned on guy on guy bondage porn and left his to do her business and then start driving again. About an hour later Kyle felt the Rv stop again. She walked up to the room and said, \"I'll allow you one thing make your pick.\" He thought about it and said, \"hntnm thm ghgg hnd bhll thrthrm\" she untied his manhood and went to get lunch. When she came back she decided to have him drive while she napped. She awoke about an hour from their new home and she began formulating how Kyle would spend the night for being a good boy. She fucked him and gave him the best night of his life.</span></div></div>",
            "created":1501131600,
            "id":2359975,
            "title":"during the ride"
        },
        "155312":{
            "choices":[
                "with him being a third girl",
                "without him"
            ],
            "content":"<div class=\"\"><div> <span>She was on the couch texting. Kyle leans over, \"Who you texting sweetie?\" She pulls the phone away and teasingly said, \"None of your business. You're being naughty.\" She grabs his testicles and gives them a hard squeeze. She kept her grip one second longer than was comfortable before letting go and began softly rubbing. She just said, \"Follow me and do what I say.\" \"What...I...Why?\" She gripped hard again after slapping him and said, \"Because I said so.\" This time not letting go until he whimpered, \"Whatever you want.\" She led him off the couch and stopped him, \"Place your shoes next to the door and your socks in your shoes.\" Then she led him to the stairs of the basement, \"Take off your pants, but carry the belt, I might use it.\" She led him downstairs, \"leave your underwear at the foot of the steps.\" She led him to the back of the basement, \"Leave your shirt at the door.\" He walked in and she shut the door. She picked up his shirt, his underwear, his pants, and his shoes, and put them in a bag that she put on top of the closet. She went back downstairs and looked at Kyle, \"You're sexy, but smaller than I hoped.\" Kyle, \"I'm not small!\" Sasha, \"My last boyfriend was a foot long. How big are you?\" Kyle, \"I'm five inches but that's closer to normal than a foot.\" Sasha, \"Yes, five and a half is average, your smaller than average but why do you think I want you, your more comfortable and you'll let me do anything. Are you willing to share me with another girl?\" He nodded and she dropped his stuff at his feet, \"Follow me.\" The door bell rang and she said, \"Stay here that's Erin, I'll come back for you.\" She opened the door up and let her in. Erin walked in and said, \"This must be our boytoy.\" He nodded and she said, \"What do you like? You know Sexually.\" He said, \"I'm open for anything.\" Both girls cooed and Sasha looked at the door and said, \"go hide for a minute out of view of the door.\" He did right before the doorbell rang. It was a male voice and Kyle realized it was a pizza delivery guy. They paid him and called Kyle back out. Kyle, \"So are you going to strip?\" Erin, \"Maybe, when we want, Oh by the way, this is a femdom night so you're bottom rung got it.\" Kyle, \"Yes Ma'am and Mistress.\" The girls giggled and Sasha said, \"I'm obviously mistress right slave.\" Kyle said, \"Yes mistress.\" The girls played the dominance thing loose and Kyle knew that just as long as he didn't question them and waited his turn he'll get whatever they give him. They ate pizza on the back deck and said, \"Slave get the hot tub turned on, we'll be back to soak. They came back a minute later wearing wet-suits. Kyle, \"Why wet-suites?\" Sasha, \"To hide our bodies.\" They told Kyle to sit and they snuggled with Kyle and talked of girl's interests things, sometimes asking Kyle for an opinion. Then they told him to jump in the pool. He did and they asked him the temperature. He told them that besides the drastic temperature change the water was fine. They told him to wait and came back in one-pieces and dove in. They swam and all three then climbed out. The girls ordered Kyle in the shed and they locked him in and went skinny dipping. They let Kyle out, after drying off and getting fully dressed again and went inside. They watched a raunchy rom-com and Sasha began rubbing Kyle. After the movie the girls sat and chatted. They went upstairs and came back in long sleeve pj's and said, \"Proof of your good behavior is our slow stripping b t dubs. Now we are lingerie-less and barefoot. Speaking of rub our feet slave.\" He did and they continued to talk. They got up and got ice-cream and ate it, allowing Kyle to have some too. Then they sat back down on the couch and played video games while Kyle rubbed their backs, feet, and gave comment on their questions. They looked down at Kyle and then each other and told him to follow. They told him to start the shower and he did. When he told them it warmed up they came in, nude and took a shower, while still talking of girl's things, and had Kyle soap them up, shampoo and condition their hair, and then dry them off. They took Kyle to the bed and fucked him. Then they went to sleep.<br>\r\n<br>\r\nThe next morning they had Kyle cook breakfast and took him upstairs to prepare him for their day out</span></div></div>",
            "created":1500872400,
            "id":2358750,
            "title":"Female"
        },
        "1553121":{
            "choices":[
                "At home",
                "while moving"
            ],
            "content":"<div class=\"\"><div> <span>They put a chastity cage over his 'wrong' parts and then tucked him and used tape to hold him flat. Then all three girls put on their panties and bras. They shoved 'chicken fillets', latex pads that are inserted making a woman look bigger, in his bra to fill them and make it look like they're naturally filled. Then They all put on some tight fitting jeans, tee shirts, and their socks. They then put hair extensions on Kyle and styled his hair into a pony tail and then styled their own hair. Then they did all their make-up and walked downstairs. They put on their heels and walked out the door. They had a nice girls-day-out and no one suspected a drag walking through the mall, and the bathroom, which kinda emasculated Kyle. They then rewarded him with more sex at home. They then decided to make this a permanent gig and move away with him. They flew off to a remote town and began their new polygamist life together with Kyle and his two dominant wives.</span></div></div>",
            "created":1500958800,
            "id":2359128,
            "title":"with him being a third girl"
        },
        "1553122":{
            "choices":[
                "at the house",
                "during the trip down"
            ],
            "content":"<div class=\"\"><div> <span>They put a chastity cage over his boy parts. They then took him down to the basement away from windows and sat him on a chair. They handcuffed his wrists, \"I'm not going with you today?\" Kyle said. instead of answering they just shoved a penis gag in his mouth and tape it shut. They used Sasha's belt to hold his arms/torso to the chair. They used Erin's belt to hold his cuffed wrists to the chair. They then taped his legs together and continued wrapping his legs to the butt of the chair. They then tied his ankles apart to the legs of the chair with rope. They put a collar on him, blindfolded him with a leather mask. and went shopping. They had a nice girls-day-out. They then rewarded him with more sex at home. They then decided to make this a permanent gig and move away with him. They flew off to a remote island Erin got when her parents died in an accident, and began their new polygamist life together with Kyle and his two dominant wives.</span></div></div>",
            "created":1500958800,
            "id":2359138,
            "title":"without him"
        },
        "15532":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "10",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is Sasha's younger sister?</span></div></span></div>",
            "created":1332651600,
            "id":1302139,
            "title":"Sasha's younger sister is at home and comes..."
        },
        "155321":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "nothing, removed her clothing up the stairs",
                "a school outfit",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sashas younger sister Haley was 10 years old, looking at her you can see she is currently dressed in</span></div></span></div>",
            "created":1599381780,
            "id":2898341,
            "title":"10"
        },
        "155322":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "15",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is she 15?</span></div></span></div>",
            "created":1336712400,
            "id":1334638,
            "title":"Other"
        },
        "1553221":{
            "author_id":"connorb90",
            "author_name":"ConnorB90",
            "choices":[
                "Eva",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is Sasha's sister like?<br>\r\n<br>\r\nEva - Tall and blonde, blue eyes. Head cheerleader at school. Got large breasts for her age. Often wears skimpy clothing that shows off a lot of her skin.<br>\r\n<br>\r\nOther?</span></div></span></div>",
            "created":1344315600,
            "id":1399619,
            "title":"15"
        },
        "15532212":{
            "choices":[
                "Glenda",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Glenda - average height, plump, blond, blue eyes, wears leggings and tank tops</span></div></span></div>",
            "created":1489986000,
            "id":2292413,
            "title":"Other"
        },
        "1553222":{
            "choices":[
                "18 but minutes younger",
                "other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these options</span></div></span></div>",
            "created":1462165200,
            "id":2142510,
            "title":"Other"
        },
        "15532222":{
            "choices":[
                "2",
                "a robot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Actually she is...</span></div></span></div>",
            "created":1464152400,
            "id":2153745,
            "title":"other?"
        },
        "155322221":{
            "choices":[
                "15 minutes later",
                "they fell asleep waiting, the next morning"
            ],
            "content":"<div class=\"\"><div> <span>Kyle! Your girlfriends sister absolutely loved you. Sasha just shewed her sister away and said, \"it is past your bedtime young lady now go up to stairs and go to sleep.\" Her sister started walking upstairs and said, \"K sissy have fun wif Kyle.\" It felt weird having a toddler around but you knew that she wanted you to come around so much that these secret meetings were safe, for the fact of having you two year old admirer keeping you around. Sasha also went upstairs and made sure her sister was asleep before continuing her fun.</span></div></div>",
            "created":1470632400,
            "id":2193292,
            "title":"2"
        },
        "1553222212":{
            "choices":[
                "he heard a noise",
                "the door unlocked"
            ],
            "content":"<div class=\"\"><div> <span>You both woke up and realized it was 8:45 and at 9 Sasha's aunt was picking up Jen, Sasha's toddler sister. Jen knew better to mention Kyle so your playtime was still safe. Kyle said goodbye to Jen, Sasha got Jen ready and Kyle waited until the coast was clear. Aunt Isabelle came around right on schedule, spend 5 minutes talking to Sasha, who kept her cool, asked Jen if there were any boys in the house, Jen's response was \"do my ken dolls count?\", at which Isabelle said, \"Aw that's cute, ok Sasha, don't invite any more boys over and don't get too rowdy with those Ken dolls.\" Both Sasha and Jen giggled when Sasha said, \"Alright Auntie I promise that the only boys that will be in this house are already in here and I will not invite anymore, and I also promise that I will not be too rowdy with the Kens.\" Isabelle, \"Alright you know I have a link to the alarm so if that goes off I will be making a call, and if you don't answer a visit.\" Sasha locked the door, set the front door alarm and came up to Kyle. Sasha, \"Alright the alarm is set, since our house sits on a hill that means that the front door is off limits but not the door to the pool deck, you wanna swim?\" After an hour of swimming Sasha got a call from her aunt, \"Hey Sasha, do you wanna meet us for a girl's night out?\" Sasha, \"Um sure, just let me get ready, I'll meet you at your house.\" Sasha told Kyle to stay hidden, this was Isabelle's little tricks, her uncle Larry would be swinging around to make sure there were no movement or lights on so Kyle would have to spend the night in a dark house with the shades shut. Kyle understood and hung out all night, that was until...</span></div></div>",
            "created":1470718800,
            "id":2193567,
            "title":"they fell asleep waiting, the next morning"
        },
        "15532222122":{
            "choices":[
                "force Kyle to clean her house for having her uncle arrested",
                "do something sci-fi"
            ],
            "content":"<div class=\"\"><div> <span>At that moment the alarm went off and after a couple of keypad tones the alarm stopped. Sasha reacted to the notification on her phone but her aunt just said, \"oh it's just your uncle checking the house, no need to worry.\" Sasha turned on her voice notification said, \"Uncle Larry's in my house.\" and quickly sent the text but made it look like she was asking her aunt as she turned off her phone. \"Yep, to make sure there are no burglars in the house.\"<br>\r\n<br>\r\nKyle got the notification and hid, Larry had a gun. As Larry passed he sneaked out the house, waited a minute or two, called the police, waited for them to come and approach the house, needless to say Larry was arrested for armed burglary, which was straightened up at the station when his wife explained the situation, getting herself arrested for conspiracy to armed burglary. It didn't help that neither niece knew about the search and so what their aunt and uncle did could be considered armed burglary, and unfortunately for them they had to sit in jail until Sasha's parent came home at the end of two weeks. The police said a neighbor called it in, thinking Kyle was a neighbor, but Sasha knew better. Kyle, \"What the fuck was I supposed to do, your uncle had a real gun that he would really use to really kill me.\" Sasha, \"That is true.\" Jen had been dropped off at her grandparents house meaning she was literally an hour away and Sasha could be uninterrupted in her playtime with Kyle.<br>\r\n<br>\r\nSasha decided to...</span></div></div>",
            "created":1473310800,
            "id":2207504,
            "title":"the door unlocked"
        },
        "155322221222":{
            "choices":[
                "Me",
                "Other options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Follow me, she said. Kyle listened and followed, there was a machine. \"Here is your punishment Kyle you will spend the rest of the two weeks as.\"</span></div></span></div>",
            "created":1473829200,
            "id":2210251,
            "title":"do something sci-fi"
        },
        "1553222212221":{
            "choices":[
                "ground you and release your uncle and aunt",
                "go pick up all your siblings, +1 day to prison time"
            ],
            "content":"<div class=\"\"><div> <span>Before he could react there was a flash and they switched, talk about freaky Friday, Sasha, as Kyle, then said, \"Well sweetie, I gotta get home before my parents get back, or yours.\" and ran out the door. It was morning and \"your\" parents came home early, due to the alarm. You decided to punish Sasha by slowing \"your\" uncle and aunt's release from prison. You, \"Oh good, I was worried I would have to be home alone for two weeks, so are we picking up everyone?\" everyone as in all your siblings. Your mom, \"Yeah, but I really think we should release your aunt and uncle.\" You, \"Why? They broke into our house, because they didn't trust me. ME! Larry and Isabelle can rot for all I care, they are dead to me.\" Your mother was appalled, \"Young lady, I\" Sasha, \"Don't scold me like a child, she lured me out of the house so that her husband could burglarize us, he had a gun, what was he going to do if someone was here? It's better that he didn't find someone or Larry and Isabelle would be in prison for murder and conspiracy to murder with no parole!\" Your parents then decided to</span></div></div>",
            "created":1477458000,
            "id":2228730,
            "title":"Me"
        },
        "1553222212222":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "female version of himself with a reality change",
                "dog"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>he must spend the next two weeks as a</span></div></span></div>",
            "created":1486443600,
            "id":2274642,
            "title":"Other options"
        },
        "15532222122221":{
            "choices":[
                "That weekend",
                "The day they were married"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Basically Kyle became Kylie and Sasha became Shawn. To everyone else they were always Kylie and Shawn.</span></div></span></div>",
            "created":1489208400,
            "id":2288058,
            "title":"female version of himself with a reality change"
        },
        "155322221222211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "details",
                "out of the cellar!"
            ],
            "content":"<div class=\"\"><div> <span>Kyle never realized that there was such a machine in their cellar….<br>\r\nActually he was resisting, but it was too late, somehow Sasha has trapped him inside and the door was closed. Then she pressed a button…<br>\r\nWithin some moments both of them went through the weird transformation!<br>\r\n</span></div></div>",
            "created":1501736400,
            "id":2363750,
            "title":"That weekend"
        },
        "15533":{
            "choices":[
                "sexy object",
                "more options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She dangles an object that he know all to well as being one of humiliation, pain, and pleasure.</span></div></span></div>",
            "created":1462510800,
            "id":2144059,
            "title":"More Choices"
        },
        "155331":{
            "choices":[
                "babyplay",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>object variant 1: since everyone seems to be into the dirty fetishes here the first object is a diaper</span></div></span></div>",
            "created":1462597200,
            "id":2144471,
            "title":"sexy object"
        },
        "1553312":{
            "choices":[
                "petplay",
                "bondageplay"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>other two dimensions<br>\r\n<br>\r\nvariant 2: she was holding his collar<br>\r\n<br>\r\nvariant 3: she was holding an object that pertains to bondage, I will expand upon it.</span></div></span></div>",
            "created":1462597200,
            "id":2144473,
            "title":"other"
        },
        "15533121":{
            "choices":[
                "dog",
                "cat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She made him act like a...</span></div></span></div>",
            "created":1475298000,
            "id":2217530,
            "title":"petplay"
        },
        "15533122":{
            "choices":[
                "yes",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>variant 3.1: She was holding silk blindfold</span></div></span></div>",
            "created":1462597200,
            "id":2144474,
            "title":"bondageplay"
        },
        "155331221":{
            "content":"<div class=\"\"><div> <span>\"What's that for.\" He said coy. She put her finger on his lips and said, \"I wanna have fun tonight and I don't want you to spoil the surprise.\" Kyle, \"This is my reward for the 100 billion dollar sale I made, ensuring we never have to work again.\" She shook her head no, \"This is my reward for being such a good an faithful girlfriend while you struggled to make ends meet and I had to lend you money, your enjoyment is meaningless today and all depends on your perspective on how this night goes. Oh and btdubs, you will also be paying me back for the rest of your life by marrying me.\" roughly grabs his balls and squeezes, \"and you better never, like ever, think about leaving me, I am your perfect goddess and you will remember that.\" Kyle, \"Y-yes mistress.\" unable to contain himself. \"Good, take off your shoes and stuff your socks in your shoes.\" He does and she blindfolds him and begins walking, yanking on his junk, \"Follow me.\" They continued to her basement. \"Take off your shirt, your pants, and put your hands behind your back.\" He stood there in his underwear and she handcuffed his wrists used his belt to hold his arms to his side, collared him, and pulled his leash. He took the hint and followed again. He heard a click and she said, \"Now that the collar is locked out of you reach I can continue.\" She took off his underwear and said, \"Open up so I can shove your boxers in your mouth.\" Kyle, \"What! No!\" Sasha, \"Excuse me, I own you now, last warning open up.\" He did wandering what her plan was. Kyle, \"One quemmph.\" Sasha, \"No, you can not ask me anything, not until I feel like releasing you, which will be after I have fun.\" She shove his dirty, sweaty under wear deep in his mouth and used duct tape to wrap his head, holding the boxers in. She then took off her belt, and belted his thighs together after tucking his junk behind his legs. Then she used another pair of handcuffs to lock in his ankles. \"Alright time for the fun.\" and began walking away knowing he would mmph out in surprise. \"Aw, what you thought the fun was sex, no, I am going on an all night shopping spree with you credit card, like I said, I emphasis I wanna have fun, this is MY emphasis my reward, and your enjoyment is due to your perspective of the night but is meaningless until I release you, whenever that is.\" Kyle pleaded with Sasha but she just walked away, that was until he needed to learn his lesson after cussing through the gag. She walked up, punched him as hard as she could in his tucked dick, and walked away as he fell to the floor unable to stand again and now with only inches of slack to his leash.<br>\r\n<br>\r\nShe came back the next morning and Kyle said he did in fact have a fun night and they had nights like that for the rest of their lives together.</span></div></div>",
            "created":1480136400,
            "id":2242278,
            "title":"yes"
        },
        "155331222":{
            "choices":[
                "yes",
                "the other yes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>variant 3.2: She was holding a journal that had all the ways she wants to tie you, some are done and crossed off, the other we write stories about<br>\r\n<br>\r\nvariant 3.3: She was holding a sex toy right when Kyle was grabbed from behind.</span></div></span></div>",
            "created":1462597200,
            "id":2144476,
            "title":"next"
        },
        "1553312221":{
            "choices":[
                "The next morning",
                "At the end of the weekend"
            ],
            "content":"<div class=\"\"><div> <span>You've been a naughty boy and need to be punished.<br>\r\n<br>\r\nThat cliche phrase was enough to tell Kyle what to expect. He stripped naked, she led him to the in-law suite, sat him down and began going to work. First she blindfolded him with a leather blindfold. She normally didn't talk during tie up games and Kyle was now expecting anything. Sasha used a belt to bound his thighs together and his arms to his side. She then taped his legs to the butt of the chair and his torso to the back. Then She spread his lower legs and used rope to tie his ankles to the legs of the chair. Next she placed his wrists to the arms of the chair and used handcuffs and cuffed him to the arms of the chair. She then clamped clothes pins to his nipples and locked a chastity belt to his manhood she then took a rag shoved it in his mouth, used a scarf to cleave gag in the rag, put a ball gag over that to further push in the rag, and then tape wrapped the whole thing to make sure he was not heard. She left and Kyle waited for the end of the game. release came...</span></div></div>",
            "created":1490763600,
            "id":2296770,
            "title":"yes"
        },
        "15533122212":{
            "content":"<div class=\"\"><div> <span>Sasha, \"Hey girls.\" Girl 1, \"Hey, free from Kyle this weekend.\" Girl 2, \"Yeah, I know he loves you but he's a pain in the ass.\" Sasha, \"You can kinda say that. You know Kyle is a sweet guy though.\" Then all three girls laugh, grabbed some wine, and started complaining about their guys and their short comings. Sasha always found a way to not only do that but also further tease Kyle about his present situation. After a overnight girl's party the other girls went home and Sasha, came in and released all the tension in her body as she complained about how she kinda wishes she was a guy sometimes \"cuz girls as friends are so annoying.\" She released him and they continued to have fun together. They both feel asleep and woke up the next morning. Sasha had already made breakfast and ate her's. She looked at Kyle and said, \"You know you haven't repaid me for tying you up over night. He tied her up the same way she did and spent a day having a guy's day, finishing it off with sex. Then he released Sasha and made breakfast. That is when Sasha realized something missing, her period. Sasha, \"Kyle?\" Kyle, \"Yeah?\" Sasha, \"My period was supposed to be today.\" Kyle fainted.<br>\r\n<br>\r\nNine months later a baby was born but Kyle and Sasha still found time for private times. But for all extensive purposes that baby meant...</span></div></div>",
            "created":1508389200,
            "id":2403750,
            "title":"At the end of the weekend"
        },
        "1553312222":{
            "content":"<div class=\"\"><div> <span>8 A.M.<br>\r\nKyle knew he was in serious trouble. She was holding a sex toy used by Kyle to pleasure a different woman. Kyle stepped forward to protest when he was grabbed from behind by Jessica, Sasha's older sister,  one your left arm, Chelsea, the girl you cheated on Sasha with,  one your right arm, and Emily, the girl you were dating who you cheated on with Sasha. Sasha, \"You thought I wouldn't know about Chelsea or that I ever started trusting you after I learned you were still with Emily when we fucked. Emily you have one shot at him before I ask you to leave. Emily stood up walked to his front and smiled, she was holding a paintball gun. Kyle, \"Emily I.\" Thump, right in the chest. Emily, \"Bye Kyle.\" Emily walked out. Sasha, Jessica, and Chelsea told Kyle what was going to happen. They were going to have a girl's night in, they would tie up Kyle however ever, and however often, the wished. The three of them will not be the only girls there tonight, he will be public property to any of the girls, and finally, he had no say in the matter. Kyle bowed his head in shame and said, \"Do as you wish.\" <br>\r\n<br>\r\nThey let him go and handed him a silk sleep mask. \"What's that for.\" He said. He realized she wouldn't answer his questions. \"Take off your shoes and socks.\" He did and she blindfolds him and begins walking. The other two girls grab him and led him to where he would spend an undisclosed amount of time. They continued to her basement. \"Take off your shirt, your pants, and put your hands behind your back.\" He stood there in his underwear and one of the girls handcuffed his wrists and used his belt to hold his arms to his side, collared him, and pulled his leash. He took the hint and followed again. He heard a click and she said, \"Now that the collar is locked out of you reach we can continue.\" She took off his underwear and said, \"Open up so I can shove your boxers and you socks in your mouth.\" Kyle, \"What! No!\" Sasha, \"Excuse me.\" Knee. Kyle drops to his knees and whimpers out, \"Why did you knee me in the crotch?\" Sasha, \"To show you whose boss, now get up and open up!\" He did wandering what her plan was. She shoved his dirty, sweaty underwear and socks deep in his mouth and used duct tape to wrap his head, holding the boxers in. She then took off her belt, and belted his thighs together after tucking his junk behind his legs. Then she used another pair of handcuffs to lock in his ankles. \"Alright time for the fun.\" and began walking away. \"Aw, Kyle looks flustered and confused, he doesn't know our plans. At least tell him sis.\" Sasha smirked at her sister and said, \"Well Jessica, I told him most of it, the girl's night in with lunch, dinner, and pay per view porn on his, credit card.\" \"Whht! Nh, plmhfm Nh! Dhn't hfm mn grmdnt ghrd fhr nhhr rmvmngm. Plmhfm!\" Kyle pleaded with Sasha but she just walked away.<br>\r\n<br>\r\nThe other girl's were called and they all came down to move Kyle.<br>\r\n<br>\r\n9:30 A.M.<br>\r\n<br>\r\nThe girls took a shopping trip spending Kyle's money on things they wanted.<br>\r\n<br>\r\n11:30<br>\r\n<br>\r\nKyle was untied and now he saw a small group. Sasha, Jess, Chelsea, and Chelsea's friends, Melony, Felicity, and Laurie led him to the living room. Jess, \"Hey I'm hungry you wanna get lunch.\" \"Sure!\" They untied Kyle and said, \"Time to secure you while we pick up, lunch.\" They handed him a leather blindfold. He put on the blindfold they now pushed him into the linen closet. They then cuffed his wrists above his head to the top shelf, cuffed his ankles to the bottom shelf, and said, \"Stay!\" Sasha, \"Open up.\" he did and she shoved a sponge in his mouth, then she held it into place with a scarf she had ready tied in a stuffed cleave gag. Sasha, \"You want anything for lunch?\" \"Nmhh, whhtmvmr, Hm'm fthrvnng.\" Sasha, \"No! okay.\" \"Nh! Hm fhnd Hm whntmd fhhd, Hm'm fh fhggnng hhngrn!\" Sasha, \"Well if you don't use words I don't know what to get so you don't eat.\" \"Gmt mm fhmm fhggnng fhhd. Plmhfm.\" He protested but heard the door slowly creak shut and the girls left.<br>\r\n<br>\r\n1:00 A.M.<br>\r\n<br>\r\nSasha, Jess, Chelsea, Melony, Felicity, and Laurie came back with their friends Nora, Valery, and Christina, all ready to abuse him. Kyle was set in a chair and a roll of duct tape was brought out. His arms and legs taped to the arms and legs of the chair, his back and seat tied to the back and seat, and finally for quietness the rag used to clean the dishes that still had soapy water was shoved in his mouth and strips of tape applied to firmly keeping it all in. \"Fhgg thnf fhhp Hmf grhff!\" Sasha slaps him and says, \"No talking from the prisoner.\" They spent until lunch watching girly movies and femdom bondage porn.<br>\r\n<br>\r\n5:00 P.M.<br>\r\n<br>\r\nThey led him outside to the pool hall and put Kyle down on a pole looking out to the pool. Kyle put his arms together behind the pole and legs together Sasha quickly, but securely, wrapped up his wrists and ankles. RIIIP, RIIIP, \"Can you move your arms or legs?\" \"Nope.\" RIIP, RIIIP, now wrapping his torso and his thighs pole. \"Are you secure against the pole?\" \"Yep\" \"Good open up.\" Kyle obeyed and Sasha put a ball gag in his mouth, then put strips of tape over his mouth, on his chin, then wrapped the whole thing by wrapping his head. She finished it off by putting a leather eye mask. \"Thnf phlm Hmf blhznng hht!\" The girls just ignored him then swam, naked of course, in the pool while Kyle listened.<br>\r\n<br>\r\n7:00 P.M.<br>\r\n<br>\r\nAfter swimming, sunbathing, and chatting about boys. They all came inside. Sasha, \"Hey lets order dinner!\" Kyle, \"Please no! I can't afford this day!\" The girls smirked at each other and said, \"Hey Kyle how about a deal?\" Kyle, \"What\" Lara, \"We'll stop the spending on one condition.' Kyle, \"What condition?\" Sasha, \"You know what I'll tell you after dinner. Lets order a bunch of pizzas and since it's the end of the girl's shift they can come over for our fun girl's night too. Kyle was led to the coffee table and told to lay down. They hogtied him and bit gagged him. Then Sasha, Jess, Chelsea, Melony, Felicity, Laurie, Nora, Valery, and Christina, all got ready for dinner. Then, Tiffany, Bessy, and Jen, the pizza girls, join in and all the girls ate dinner. \"Give me some food please I'm starving!\"<br>\r\n<br>\r\n8:00<br>\r\n<br>\r\nThey untied Kyle and said, \"Hey Kyle. remember our one condition.\" Kyle, \"Yeah.\" Sasha, \"Here it is. We will tie you up again.\" Kyle, \"Okay.\" Lara, \"and we will fuck you in a big orgy, rewarding you for being such a good boy. Then sometime during the night each one of us will have our way with you giving you thirteen fucks tonight.\" Kyle, \"Fine, if it will stop the shopping.\" Sasha, \"Well of course it will, we burnt through your checking. Price you paid for cheating.\" The girls tied him spreadeagled to the bed with rope they had for this kind of occasion. They then asked Kyle, \"So before we gag you, you consent to us fucking you at any time and that you consent to stay bound and gagged here even if we leave you all night?  Your only freedom is this, will you not consent to all the terms and lay here blue-balled, or will you consent and get rewarded with three instances of sex?\" Kyle, \"You've already done everything else I might as well get something out of this day.\" Sasha, \"Great! One more choice for our Kyle, we will gag you however you want, so how do you want it? Kyle, \"I feel like having my mouth taped shut again, at least it would be comfortable.\" Sasha came back with the tape and asked, \"strips or wrapped?\" Kyle, \"strips is fine.\" RIIIP one strip over his mouth RIIIP a cross piece RIIIP a second cross piece. The girls fucked Kyle and left him. Time crept by for Kyle and he thought they were taking years to fuck him. Every hour on the hour a girl came in to fuck him.<br>\r\n9:00<br>\r\nSasha <br>\r\n10:00<br>\r\nJess <br>\r\n11:00<br>\r\nChelsea <br>\r\n12:00<br>\r\nMelony <br>\r\n1:00<br>\r\nFelicity <br>\r\n2:00<br>\r\nLaurie <br>\r\n3:00<br>\r\nTiffany <br>\r\n4:00<br>\r\nBessy <br>\r\n5:00<br>\r\nJen <br>\r\n6:00<br>\r\nNora <br>\r\n7:00<br>\r\nValery <br>\r\n8:00<br>\r\nChristina<br>\r\n<br>\r\n9:00<br>\r\nKyle felt a gush of air as the door opened. He the light blinded him as they took off the sleep-mask. His legs were freed by the time his eyes adjusted and his wrists by the time he found the clock and read the time. As he pulled the tape off. Sasha, \"Your free to go.\" Kyle, \"When can I see you again.\" Sasha, \"Depends. Our escapades could be online, just like your adultery, and that would be the end of our relationship. Or you can choose option number two and become the husband aka, the permanent sex slave to, all us girls, twelve wives. Either way you have twelve pregnant women to support.\" Kyle excepted his fate.</span></div></div>",
            "created":1490418000,
            "id":2294471,
            "title":"the other yes"
        },
        "155332":{
            "choices":[
                "Himdom",
                "next"
            ],
            "content":"<div class=\"\"><div> <span>In the \"Lets Kyle torture her\" there are the kinds of things that are found on the main page but he does them to her. Now I want to offer the other dominations I have been adding but put a feed where he dominates her. Is it you thing? If not skip on by.</span></div></div>",
            "created":1462510800,
            "id":2144062,
            "title":"more options"
        },
        "1553321":{
            "choices":[
                "bondage",
                "some non-human play"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He take hint and begins to set up their fun night of</span></div></span></div>",
            "created":1462510800,
            "id":2144063,
            "title":"Himdom"
        },
        "15533211":{
            "choices":[
                "sitting",
                "laying down"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She stripped naked, no point in sexual play if she is clothed right? How was she tied?</span></div></span></div>",
            "created":1480050000,
            "id":2241626,
            "title":"bondage"
        },
        "155332111":{
            "choices":[
                "Tape",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He tied her breasts and tied a crotch-rope through her vulva, and she sat down. That was when Kyle grabbed the...</span></div></span></div>",
            "created":1490418000,
            "id":2294671,
            "title":"sitting"
        },
        "1553321111":{
            "choices":[
                "a couple strips of tape holding in her panties",
                "tape wrapped around her head holding in a rag"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He tied her wrists and ankles together, then he grabbed the sleep mask and blinded her. Next he held her in place to the back and butt of the chair with more tape. Finally he gagged her with</span></div></span></div>",
            "created":1492750800,
            "id":2308586,
            "title":"Tape"
        },
        "15533211111":{
            "choices":[
                "take advantage of the house",
                "talk about his feelings, for 4 hours"
            ],
            "content":"<div class=\"\"><div> <span>The rag was shoved in her mouth and the tape placed over her mouth, keeping her mouth filled, preventing any sound. Sasha began wondering what was in her mouth so she asked, \"Hrm thmfm mn glmhn, nmvmr whrn, bhndhgm phntn ghg phntnmf hr dnd nhh fhhvm hnhthmr phnr Hmn mn mhhth? Gnlm? Whnt! Hrm thmfm phntnmf hht hf mn drhwmr hr hff mn bhdn? Gnlm? Gnlm Hnfwmr mm. Nhw!\" Kyle, \"What?\". Sasha, \"Hrm thmfm mn glmhn, nmvmr whrn, bhndhgm phntn ghg phntnmf hr dnd nhh fhhvm hnhthmr phnr Hmn mn mhhth hnd Hmf thmn hrmn't mn bhndhgm phntnmf, hrm thmfm phntnmf hht hf mn drhwmr hr hff mn bhdn? Hnfwmr mm, Nhw!\" Kyle, \"Ah, I can't understand you, probably not important.\" At that moment Kyle decided to</span></div></div>",
            "created":1492750800,
            "id":2308726,
            "title":"a couple strips of tape holding in her panties"
        },
        "15533211112":{
            "choices":[
                "film her for future fapping, and say that ten times fast",
                "tease her and leave her, and come back and repeat"
            ],
            "content":"<div class=\"\"><div> <span>The rag was shoved in her mouth and the tape wrapped tight around her head, keeping her mouth filled, preventing any sound. Sasha began wondering what was in her mouth so she asked, \"Gnlm, fwmmtnm, whht'f Hmn mn mhhth?\" Kyle, \"What?\". Sasha, \"Whht! Whn! Whn whhld nhh pht mn fhggf Hmn mn mhhth? Gnlm? Gnlm! Whmrm thm fhgg hrm nhh? Hmllh? Hrm nhh ftnll hmrm. Hh! Hh thnf thftmf lngm mn fmmt. \" At that moment Kyle decided to</span></div></div>",
            "created":1492750800,
            "id":2308724,
            "title":"tape wrapped around her head holding in a rag"
        },
        "1553321112":{
            "choices":[
                "rope",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was actually the</span></div></span></div>",
            "created":1490418000,
            "id":2294673,
            "title":"other"
        },
        "15533211121":{
            "choices":[
                "balled cleave gag",
                "stuffed cleave gag"
            ],
            "content":"<div class=\"\"><div> <span>He tied her wrists and ankles together, took a third rope and tied the two coils of rope together, then he grabbed the sleep mask and blinded her. Next he grabbed another rope and held her in place to the back and butt of the chair. Finally he gagged her with</span></div></div>",
            "created":1492750800,
            "id":2308584,
            "title":"rope"
        },
        "155332111211":{
            "choices":[
                "Leave the radio on the station Sasha hates and have a day out",
                "Leave Sasha for the weekend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The scarf knotted in the center then tied tight around her head, keeping her mouth filled, preventing any sound. Then Kyle decided to</span></div></span></div>",
            "created":1492750800,
            "id":2308720,
            "title":"balled cleave gag"
        },
        "155332111212":{
            "choices":[
                "tickle her",
                "slowly tease and deny her orgasm"
            ],
            "content":"<div class=\"\"><div> <span>The rag was shoved in her mouth and the scarf tied tight around her head, keeping her mouth filled, preventing any sound. Sasha began wondering what was in her mouth so she asked, \"Gnlm, fwmmtnm, whht'f Hmn mn mhhth?\" Kyle, \"What?\". Sasha, \"Mn mhhth Whht Hmf Hmn Hmt?\" Kyle, \"Your bra.\" Sasha, \"Whht! Whn! Whn whhld nhh pht mn brh Hmn mn mhhth? Gnlm? Gnlm! Whmrm thm fhgg hrm nhh? Hmllh? Hrm nhh ftnll hmrm. Hh! Hh nmp nhhr ftnll hmrm. Dhn't! Nh! Dhn't dh thht! Plmhfm Fthp!\" At that moment Kyle decided to</span></div></div>",
            "created":1492750800,
            "id":2308717,
            "title":"stuffed cleave gag"
        },
        "15533211122":{
            "choices":[
                "belts",
                "cuffs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He grabbed the</span></div></span></div>",
            "created":1490418000,
            "id":2294675,
            "title":"other"
        },
        "155332111221":{
            "choices":[
                "ball gag",
                "ring gag"
            ],
            "content":"<div class=\"\"><div> <span>He cuffed her wrists and ankles together with leather cuffs, took a ziptie and locked the two chains together, then he grabbed the leather blindfold and blinded her. Next he grabbed a belt and held her in place to the back of the chair. Finally he gagged her with</span></div></div>",
            "created":1492750800,
            "id":2308582,
            "title":"belts"
        },
        "1553321112211":{
            "choices":[
                "watch lesbian porn",
                "call their cuckold girl over and have fun"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The strap was belted tight around her head, keeping her mouth open and her jaw as far away from her skull as possible, preventing any mouth movement. Sasha sat there now waiting for anything. Kyle decided to</span></div></span></div>",
            "created":1492750800,
            "id":2308714,
            "title":"ball gag"
        },
        "1553321112212":{
            "choices":[
                "get a blow job",
                "take advantage of the house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The strap was belted tight around her head, keeping her mouth open and her jaw as far away from her skull as possible, preventing any mouth movement. Sasha sat there now waiting for anything. Kyle decided to</span></div></span></div>",
            "created":1492750800,
            "id":2308712,
            "title":"ring gag"
        },
        "155332111222":{
            "choices":[
                "a dental gag",
                "a metal muzzle that keeps her from moving her mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He cuffed her wrists and ankles together, took a third and locked the two chains together, then he grabbed the leather blindfold and blinded her. Next he grabbed a belt and held her in place to the back of the chair. Finally he gagged her with</span></div></span></div>",
            "created":1492750800,
            "id":2308581,
            "title":"cuffs"
        },
        "1553321112221":{
            "choices":[
                "Kyle was taking a cooking class and needed a test subject for his food",
                "just left her and took advantage of the house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The four prongs were placed in and screwed wide, Sasha sat there now waiting for anything. Kyle decided to</span></div></span></div>",
            "created":1492750800,
            "id":2308709,
            "title":"a dental gag"
        },
        "1553321112222":{
            "choices":[
                "snoop through Sasha's private stuff",
                "take advantage of the house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The device was belted tight around her head, keeping her jaw tight against her skull, preventing any mouth movement. Sasha sat there now waiting for anything. Kyle decided to</span></div></span></div>",
            "created":1492750800,
            "id":2308711,
            "title":"a metal muzzle that keeps her from moving her m..."
        },
        "155332112":{
            "content":"<div class=\"\"><div> <span>\"Bondage Marathon?\" Kyle nods, \"Bondage Marathon baby!\" For those who don't know Kyle and Sasha had a challenge they called 'bondage marathon' basically Sasha would spend all day being tied up, and Kyle's only challenge is filling her day with different positions though out the day by changing her situation every hour. He could repeat a tie, use her however he saw fit, leave her in the same tie for longer than an hour, release her early, not feed her, show her off to friends, or just about anything, no real rules.<br>\r\n<br>\r\n8 A.M.<br>\r\n\"Take off your shoes and socks.\" She did and he blindfolds her and begins walking. They continued to her basement, \"Take off your shirt, your bra, and put your hands behind your back.\" She stood there topless and Kyle handcuffed her wrists and used his belt to hold her arms to his side, collared her, and pulled her leash. She followed again. She heard a click and she said, \"Now that the collar is locked out of my reach are you gonna leave me?\" He took off her pants and panties and said, \"Open up.\" Sasha, \"What! No! Please!\" Kyle, \"Excuse me.\" Twist. Sasha drops to her knees and whimpers out, \"Please stop twisting my nipples I'll be a good girl?\" She opened up and he shoved his dirty, sweaty underwear and socks deep in her mouth and used duct tape to wrap his head, holding the boxers in. She twitched in surprise and he just said, \"Well I knew my pretty little girl didn't want to taste her own undies and sockies.\" He then used her belt, and belted her thighs together. Then he used another pair of handcuffs to lock in her ankles. \"Alright time for the fun.\" and began walking away. She shot a glance at him and said, \"Whnt? Whht! Hm lmt nhh dh thnf th hhvm fhn nhh fhggnng hffhhlm.\" Kyle started walking back looking pissed and Sasha knew she was fucked. Sasha, \"Hm'm fhrrn! Hm'm fh fhrrn! Hm whn't qhmftnhn nhh hghnn. Plmhfm! Nh! Dhn't phnnfh mm!\" Kyle picked her up by her collar and gave you a swift knee to the G-spot. \"Whn dnd nhh gnmm mm Hmn thm grhtgh?\" Sasha whines. Kyle lets her drop to her knees and leaves.<br>\r\n<br>\r\n9:30 A.M.<br>\r\n<br>\r\nKyle invited some guys over to torture Sasha.<br>\r\n<br>\r\n11:30<br>\r\n<br>\r\nKyle untied Sasha, and now had a small group. They led her to the living room. John, \"Hey I'm hungry you wanna get lunch.\" \"Sure!\" They said. Then they said, \"Time to secure you while we pick up, lunch.\" They handed her a leather blindfold. She put on the blindfold they now pushed her into the linen closet. They then cuffed her wrists above her head to the top shelf, cuffed her ankles to the bottom shelf, and said, \"Stay!\" Kyle, \"Open up.\" she did and he shoved a penis gag in her mouth. Kyle, \"You got your lunch so now we can have ours?\" \"Whht nh Hm hm fhggnng fthrvnng!\" Kyle, \"Well if you don't use words I don't know what you need.\" \"he protested but heard the door slowly creak shut and the boys left.<br>\r\n<br>\r\n1:00 A.M.<br>\r\n<br>\r\nThe guys came back with more guys. Sasha was set in a chair and a roll of duct tape was brought out. Her arms and legs taped to the arms and legs of the chair, her back and seat tied to the back and seat, and finally for quietness the rag used to clean the dishes that still had soapy water was shoved in her mouth and strips of tape applied to firmly keeping it all in. Mw! Thnf rhg thftmf lngm fhnt! Kyle slaps her and says, \"No talking from the prisoner.\" They spent hours watching manly movies and maledom bondage porn.<br>\r\n<br>\r\n5:00 P.M.<br>\r\n<br>\r\nThey led her outside to the pool hall and put Sasha down on a pole looking out to the pool. Sasha put her arms together behind the pole and legs together Kyle quickly, but securely, wrapped up her wrists and ankles. RIIIP, RIIIP, \"Can you move your arms or legs?\" \"Nope.\" RIIP, RIIIP, now wrapping her torso and her thighs pole. \"Are you secure against the pole?\" \"Yep\" \"Good open up.\" Sasha obeyed and Kyle put a ball gag in her mouth, then put strips of tape over her mouth, on her chin, then wrapped the whole thing by wrapping her head. He finished it off by putting a leather eye mask. \"Thnf phlm Hmf blhznng hht!\" The guys just ignored her then swam, naked of course, in the pool while Sasha listened.<br>\r\n<br>\r\n7:00 P.M.<br>\r\n<br>\r\nAfter swimming, sunbathing, and chatting about bitches. They all came inside. Kyle, \"Hey lets order dinner and have naked Sasha answer the door!\" Sasha, \"Please no! I can't afford this day!\" Sasha answered the door to pay for the pizza's, it was her best friend Malory. Malory, \"Sasha! This is indecent! You think this is a joke! Take your damn pizza's!\" After destroying her lifelong friendship she was led to the coffee table and told to lay down. They hogtied her and bit gagged her and ate pizza.<br>\r\n<br>\r\n8:00<br>\r\n<br>\r\nThey untied Sasha and said, \"Hey Sasha. we will fuck you in a big orgy. Then sometime during the night each one of us will have our way with you giving you five fucks tonight.\" Sasha, \"Finally, I've been aching for sex all day! Wait! did you say all of you\" The guys tied her spreadeagled to the bed with rope they had for this kind of occasion. They then asked Sasha, \"So before we gag you, you consent to us fucking you at any time and that you consent to stay bound and gagged here even if we leave you all night? Your only freedom is this, will you not consent to all the terms and lay here blue...tubed? I don't know sorry, or will you consent and get rewarded with five instances of sex?\" Sasha, \"You've already done everything else I might as well get something out of this day. Plus I already consented\" Kyle, \"Great! One more choice for our play-pussy, we will gag you however you want, so how do you want it? Sasha, \"I feel like having my mouth taped shut again, at least it would be comfortable.\" Kyle came back with the tape and asked, \"strips or wrapped?\" Sasha, \"strips is fine.\" RIIIP one strip over her mouth RIIIP a cross piece RIIIP a second cross piece. The guys fucked Sasha and left her. Time crept by for her and she thought they were taking years to fuck her. Every hour on the hour a guy came in to fuck her.<br>\r\n9:00<br>\r\nKyle<br>\r\n10:00<br>\r\nJesse<br>\r\n11:00<br>\r\nHarry<br>\r\n12:00<br>\r\nTony<br>\r\n1:00<br>\r\nPete<br>\r\n<br>\r\nThey went to bed and she fell asleep.<br>\r\n<br>\r\n9:00<br>\r\nSasha felt a gush of air as the door opened. The light blinded her as they took off the sleep-mask. Her legs were freed by the time her eyes adjusted and her wrists by the time she found the clock and read the time. As she pulled the tape off. Kyle, \"Your free to go.\" Sasha, \"When can we play again.\" Kyle, \"Depends. Will you promise to spend the rest of your life paying me back for cheating on me with Jesse, Harry, Tony, and Pete\" Sasha, \"What! but! You tricked me. But I'll accept your natural dominance as my husband.\"</span></div></div>",
            "created":1490677200,
            "id":2296378,
            "title":"Multiple ways"
        },
        "15533212":{
            "choices":[
                "babyplay",
                "petplay"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>that play was</span></div></span></div>",
            "created":1462510800,
            "id":2144064,
            "title":"some non-human play"
        },
        "155332122":{
            "choices":[
                "dog",
                "cat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what pet did they act out</span></div></span></div>",
            "created":1475038800,
            "id":2216238,
            "title":"petplay"
        },
        "1553322":{
            "choices":[
                "Sasha's older sister, Leslie",
                "Sasha's male twin, Mark"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He hears someone come downstairs it's...</span></div></span></div>",
            "created":1464152400,
            "id":2153743,
            "title":"next"
        },
        "15533221":{
            "choices":[
                "Make him her's",
                "share him with her sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She was 21 and always had a thing for Kyle. Today was the first time since he turned 18 that she saw him. What was her plan</span></div></span></div>",
            "created":1484974800,
            "id":2267106,
            "title":"Sasha's older sister, Leslie"
        },
        "155332211":{
            "choices":[
                "getting rid of her sister",
                "kidnapping him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did she take him away?</span></div></span></div>",
            "created":1486357200,
            "id":2274408,
            "title":"Make him her's"
        },
        "1553322112":{
            "choices":[
                "upon Kyle's return home",
                "Kyle was called by Sasha as soon as she was given the news"
            ],
            "content":"<div class=\"\"><div> <span>Tim awoke, he was on an island all alone. It had been years since he had seen another human. It happened on the night Leslie kidnapped him. She had drugged both Sasha and Tim and probably had less than legal intentions for him. He had escaped and was trying to wrest control of the ship as the storm hit. They actually crash landed on Leslie's intended island and in the crash she hit her head and was knocked out. Tim escaped into the island. Even though he knew she knew this island better them him he had to find a way to save himself. For the next two days she hunted him, he did not eat, he did not sleep, he just tried to stay free. On the morning of the third day she found him. She began walk through the door saying, \"Oh, I'm going to do awful things to you now that you.\" Shilkt! Tim had rigged one of her traps to the door and it had the unanticipated effect of impaling her. She fought and clawed to get off but she just died slowly.<br>\r\n<br>\r\nThat was a lifetime ago.<br>\r\n<br>\r\nThe sun was at high noon when he heard it, laughter. He looked, a young couple making out. He ran out and they both screamed. The woman, \"John I thought you said this island was empty. John, \"Don't say my name Vicki he might be crazy. Vicky, \"And now he knows both of our names. Kyle, \"I can understand you, since I know your names I might as well introduce myself, I am Kyle. For who knows how long I have been trapped on this island with no way of escape. I need to get home and straighten out all of this craziness.\" John, \"Vicki I think we should drop him off at the hotel, it's the least we can do.\" Vicki, \"Yeah, I agree.\" They took him back to their resort and drove back, most likely to the island. He explained it all and the police began their investigation.<br>\r\n<br>\r\nBack on the island, John, \"So we are finally alone.\" Vicki, \"Yes and OH FOR PETE'S SAKE!\" John and Vicki both looked in frustration as the police came up in a fleet of boats, checking the island for any clues to the crime that almost happened here. Officer, \"Are you two the couple that took a Mr. Kyle O'shananagan home?\" John, \"We didn't get his last name but yeah we took a Kyle back to the resort.\" Officer, \"Well it seems that he was taken here to be most likely raped, murdered and buried. This whole island had been quarantined for a police investigation.\" The radio crackled, \"Yeah guys I found Leslie's base of operations, we have confirmation that this island was used as her hideout for her sick serial rapist and serial killing spree. Vicki just looked and John and John said, \"How the fuck was I supposed to know.\"</span></div></div>",
            "created":1486875600,
            "id":2276581,
            "title":"kidnapping him"
        },
        "155332212":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They had a three way.</span></div></span></div>",
            "created":1490331600,
            "id":2294356,
            "title":"share him with her sister"
        },
        "15533222":{
            "choices":[
                "On the way to kyles house",
                "at kyles house"
            ],
            "content":"<div class=\"\"><div> <span>Now Mark hated you, especially since you were banging his, \"little\" sister. Mark, \"What the fuck did I fucking tell you you fucking son of a bitch, stop fucking fucking my sister.\" Kyle, \"Heh, fucking fucking. Do you think that adding as many fucks in your sentence as you can cram will change my mind on loving you sister, I haven't even done anything, we are waiting until after we get married, which will be soon due to the fact that she said yes to my proposal.\" \"What the fuck Sasha you fucking said yes to this douche bag.\" Sasha, \"okay Mark be sexist too, douche bag.\" Kyle, \"yeah and like I said, I haven't squirted my medicated out of the tube connected to my bag in you sisters vagina, I am not a douche bag, but thank you for the compliment, thinking I get some, unlike you.\" Mark turned red and grabbed Kyle saying, \"You will not marry my sister, you will not fuck my sister, I don't care if I have to kill you, I am the only man fucking my sister.\" Mark looked shocked at what he said and Sasha got scared, \"W-we have never fucked Kyle I swear, I-I will never fuck you Mark.\" Now going from fear to anger because of fear \"I do not want to fuck my own brother, your sick Mark, SICK!\" Mark let go of Kyle, \"Sasha it's just-\" Sasha, \"No! We are siblings, TWINS! The only uterus I will ever share with you is mom's and I am sickened to know I shared that with a pervert.\" Mark looked angry, \"I am the only man you will ever fuck and if you deny me I will rape\" THWACK Kyle came in and sucker punched Mark, then got on top of him and kept punching \"You\" punch \"will\" punch \"never\" punch \"touch\" punch \"Sasha\" punch. Mark laid there beaten and bloody Kyle got off of Mark and said, \"Sasha, I think it's best if we leave and call the police. My family will keep you safe until your parents come back. Get whatever you need.\" Sasha ran up stairs and Kyle stepped over Mark. Mark gurgling through the blood, \"You hit harder than I thought, must be your criminal ties.\" Kyle, \"Yeah, and my ties will make sure you go to a prison that will kill you.\" Mark, \"How did you do it, I have never wanted my sister sexually.\" Kyle, \"Yes you did, you just didn't know it, the drug I put in you water during your football practice was only a CIA interrogation level truth drug. Your a sicko who wants his sister sexually, if you don't kill yourself one of my men will.\" Sasha came down, Kyle conjured up tears of anger, \"And if I eve see you around my wife or kids again I will kill you Mark, KILL YOU!\" Both walked out the door and Kyle looked back at Mark and smiled the smug smile of victory. The police found Mark and sent him to prison, after a few fights it was found that Mark had a violent streak and had to be kept in a mental prison until his conditioned was cured, they never did, a gang doctor kept giving Mark drugs that heighten his violent tenancies until he was at a point where he spent the rest of his life in a straight jacket, in a padded cell, ignored due to \"violent delusions of sanity.\" and never let out until the day he died, at a ripe old age of 100, he outlived Kyle and Sasha. However, the story is not about Mark, its about the happy life that Kyle and Sasha will live together, a life that started at Kyle's house.</span></div></div>",
            "created":1473397200,
            "id":2208023,
            "title":"Sasha's male twin, Mark"
        },
        "155332222":{
            "choices":[
                "sex, just sex",
                "something kinkier"
            ],
            "content":"<div class=\"\"><div> <span>His parents were understanding, mainly because they were in on it, and accepted Sasha in their mansion. Kyle's wing, yes he had a wing of the house to himself, was bigger than most houses and his parents actually encouraged sexual relations between them, so how did they start their life together.</span></div></div>",
            "created":1473483600,
            "id":2208649,
            "title":"at kyles house"
        },
        "1553322221":{
            "choices":[
                "The next day",
                "After her parents returned"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was great, no need to worry about being heard, no need to worry about getting caught, just a man and a woman and a night of pleasure.</span></div></span></div>",
            "created":1473915600,
            "id":2210549,
            "title":"sex, just sex"
        },
        "1553322222":{
            "choices":[
                "The police came to do their report",
                "Sasha's parents came to check on their daughter"
            ],
            "content":"<div class=\"\"><div> <span>\"What if I tied you up and went on a shopping spree with you money?\" \"There is a back door to my suite so my parents will never even know your gone, and I have more than enough supplies to do the first part, and money to do the second.\" Kyle stripped and placed his keys next to her bag, \"Remember to lock up.\" Sasha led Kyle down to his personal basement and had him lay on the ground. She thoroughly mummified him in tape leaving him blind, gagged, and bound from neck to toe, except his man parts which were 'conveniently' forgot to be covered. She left and came back with a whole new wardrobe. She decided to only uncover his eyes and take the time to show him every piece of clothing she bought. It was the next morning when he was finally freed.<br>\r\n<br>\r\nAt breakfast...</span></div></div>",
            "created":1496552400,
            "id":2330637,
            "title":"something kinkier"
        }
    },
    "info":{
        "author_id":"connorb90",
        "author_name":"ConnorB90",
        "brief_description":"Sasha invites her friend Kyle for a sleepover. Little does he know what's in store for him",
        "created":1332597420,
        "description":"<td align=\"left\" class=\"norm\">Sasha (female) and Kyle (male) are both 18 years old with brunette hair. Sasha invites Kyle over for a sleepover one day since her family are visiting family abroad. Anything can happen!<br>\r\n<br>\r\nNo ending unless absolutely necessary.<br>\r\nNo killing off the characters.<br>\r\nAdd more characters if you want but focus on Sasha and Kyle.<br>\r\nHave fun!</td>",
        "id":1856921,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599381780,
        "modified":1599381780,
        "pretty_title":"The sleepover"
    }
}