{
    "chapters":{
        "1":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Jackson Stewart",
                "Oliver Oaken",
                "Robbie Ray Stewart",
                "Rico",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose the boy that you want to be victimized.</span></div></span></div>",
            "created":1295975580,
            "id":1041972,
            "title":"Choose the boy!"
        },
        "15":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Travis Brody",
                "Jake Ryan",
                "Jessie",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or maybe these!?</span></div></span></div>",
            "created":1295976300,
            "id":1041980,
            "title":"Others"
        },
        "152":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "takes his boxers off and mounts Jake",
                "begins to stroke Jake's penis",
                "kisses Jake"
            ],
            "content":"<div class=\"\"><div> <span>Jake Ryan (Cody Linley) was on is way to the Disney set for the first time in a while. He had guest starred once before, but it been over two years. He arrived at the studio and was escorted by a page to the right sound stage. The male page was excited to drive him in a golf cart. He introduces himself to Jake...Peter. Jake was dressed in a casual polo shirt, khaki shorts and sports shoes with blue socks with a golf cap on his head. Peter kept on glancing at Jake's shoes as he drove. Just then, he got a message on his radio to drive Jake to wardrobe and makeup before dropping him off on the set. <br>\r\n\"I'll escort you in so you won't get lost\" Peter tells Jake. Jake thanks him. <br>\r\nThey arrive at the building and Peter walks Jake inside. Jake is told that he needs to change into some beach wear since his scene is on the \"beach set\". He was given a swim suit and flops for his feet and told to change in a nearby dressing room, then go to makeup. Peter smiled as Jake took his swim suit and walked into the dressing room. A moment later, he emerged bare chested and barefoot with only a knee length swim suit on him. Peter looked down at Jake's tan and semi-hairy bare feet with pedicured, plump toes. Jake wiggled his toes as he walked down the hall barefoot to make up carrying his flops in his hands. He was tan all over, his legs, hairless chest and backside, so the make up tech had to do very little. <br>\r\nPeter watched as Jake got his face powdered and hair combed. He again glanced down at those bare beauties of Jake's and fantasized about touching them somehow. When Jake was done, he escorted Jake back to the cart. Jake kept his flops off, walking barefoot which didn't upset Peter at all. <br>\r\nArriving on set, Jake was shown his dressing room and told to wash the soles of his feet since the director noticed they were dirty. His first shot was Jake laying out on a lounge chair with his bare soles facing the camera. Peter jumped in and offered to get some soap and water. Jake smiled and sat down on the couch in the room. Peter arrived and knelt down before Jake and stuck Jake's bare feet in a small plastic bin filled with hot soapy water. He picked up Jake's right foot and scrubbed it all over causing Jake's toes to splay. He did the same with his other bare foot, then rinsed both of them off and dried them with a warm towel. Peter even slipped <br>\r\nthe flops onto Jake's feet for him.<br>\r\nJake replied \"Wow, I like the personal service, do you give massages as well?<br>\r\nPeter smiled saying \"It's our pleasure Mr. Ryan and yes I just got my license...I can give you one this afternoon\".<br>\r\nJake smiled and thanked Peter as he walked out the door and onto the set. Peter watched from afar as Jake was set up for his first scene. He took off his flops after laying down on the lounge chair and wiggled his golden toes. Peter gets another call and leaves, but a few hours later arrives back on set. He is told to report to Jake's dressing room.<br>\r\nHe knocks on the door and Jake's voice tells him to enter. Peter enters and somewhat taken back as he sees Jake naked, drying his hair. <br>\r\nJake says \"I decided to take a shower before the massage, I hope you didn't mind\"<br>\r\nPeter replies \"Not at all Jake, do you work out? Your body is perfect\"<br>\r\nJake replies \"Now and then, I run ten miles everyday and go the gym twice a week, where do want me?\"<br>\r\nPeter points to the sofa and places a towel for Jake to lie on. <br>\r\n\"I love to stay completely naked with no draping when I get massages, so you can get comfortable if you wish\" Jake says to Peter.<br>\r\nPeter smiles as Jake lays face down on the sofa. He kicks off his shoes and pulls off his dress shirt and undershirt. Jake notices Peter's bare chest is tan and a bit hairy. <br>\r\nJake says \"You must work out too...you can take off your pants if you wish, so you won't get oil on them. My masseuses usually are dressed only in their underwear.\" Peter smiles and pulls off his pants and lays them over a chair. <br>\r\nPeter begins to pour warm oil over Jake's backside including his bare soles and toes, then works it in deeply. Jake moans and tells him it feels good. Jake's right arm hits the floor near Peter's stocking foot. As the massage continues, Peter feels Jake's hand around his socked foot, then feels his sock being pulled down and off his foot. <br>\r\nJake peeks down and says \"Nice...feel good to be barefoot?\" Peter is somewhat startled as Jake peels off his other sock exposing Peter's tan, hairless bare feet with pedicured, slender toes. <br>\r\nPeter replies to Jake saying \"I love going barefoot\" and wiggles his toes. He continues down Jake's back to his buttocks, legs and bare feet. Jake closes his eyes and moans as Peter begins to tickle Jake's bare soles and toes with his fingers. Jake's toes splay in delight. <br>\r\nPeter asks Jake to turn over onto his back. Jake does so slowly. Peter is taken back by Jake's semi-erect penis growing as he spreads oil on his front side. Peter begins at Jake's bare feet wiping off his big toes with at towel and engulfing them into his mouth. <br>\r\nJake moans saying \"Oh, that feels so good\" and splays his toes. He moans even more as Peter begins to kiss his bare feet and toes all over. Jake's erect member is at full staff.<br>\r\nPeter then...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1511527860,
            "id":2419554,
            "title":"Jake Ryan"
        },
        "1521":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Jake and Peter are relaxing with only a towel around each other's waist",
                "Peter has his way with Jake",
                "each of them are dressed except they are still barefoot, kissing."
            ],
            "content":"<div class=\"\"><div> <span>laying opposite Jake and begins to worship and lick his bare feet. Jake is surprised but loves to see Peter's bare beauties right next to his face. He engulfs Peter's big toes into his own mouth and swirls his tongue around them while tickling his other toes and bare soles. Jake confesses that he has a foot fetish as does Peter to him.<br>\r\n\"I absolutely adore your perfect bare feet Jake and those beautiful toes. I was in awe when I first saw you and was surprised when you asked for a massage...a naked one at that\" said Peter.<br>\r\n\"I felt the same way when I first saw you. I caught you looking at my shoes and then bare feet so I figured you had a foot fetish\" Jake replied. They continue to lay naked on top of each other while worshiping and tickling each other's bare feet. <br>\r\nJust then, there is a knock on the door. Both Jake and Peter immediately scramble to find their clothes and dress fast. Jake slips on a pair of boxers and Peter grabs his clothes, shoes and socks and runs into the bathroom. Jake answers the door. A stagehand hands him a message and leaves. Jake opens up the note as he closes the door and locks it. It reads \"Due to illness, taping has been canceled for the rest of the day\". He smiles and walks into the bathroom to a surprised Peter. <br>\r\n\"Today's taping has been canceled, we have the rest of the day to have fun\" Jake exclaims to Peter as he pulls off his boxers and turns on the shower. \"Want to join me?\" Jake says seductively to Peter.<br>\r\nPeter has redressed all the way except for tying his shoes. He looks at Jake and moves toward him. Jake begins to pull off his shirt, then stoops down and pulls off his shoes and socks, then his shorts and boxers. They stand there naked, facing each other, then enter the shower and close the door. Laughing and giggling plus some moaning can be heard from behind the steamy shower door. The only thing seen are Peter's and Jake's bare feet intertwined and tickling each other with their toes.<br>\r\nLater,</span></div></div>",
            "created":1511535840,
            "id":2419580,
            "title":"takes his boxers off and mounts Jake"
        },
        "15213":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Let's go to my place for some more fun",
                "I have a foot fetish",
                "I love your feet...do you love mine?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>kissing and licking each other's bare feet that is. Jake's bare toes are wrinkled as are Peter's from the all the licking, sucking and nibbling that went on. Jack says to Peter...</span></div></span></div>",
            "created":1511572800,
            "id":2419820,
            "title":"each of them are dressed except they are still ..."
        },
        "152131":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "\"Come on buddy, take the speedos off and jump in naked\"",
                "\"Don't tell me your shy about your privates showing\"",
                "\"Are you sporting a woody or something?\""
            ],
            "content":"<div class=\"\"><div> <span>Jake puts his shoes and socks back on as does Peter. Peter checks with the studio about driving Jake home. He gets the okay and tells Jake. <br>\r\nPeter drives Jake using his car. Jake gives them directions and leans back to take a quick nap. Peter pulls up to beautiful mansion overlooking the Pacific Ocean and can't believe Jake lives here. A servant comes out and wakes up Jake, then valet parks the car as Peter and Jake walk into his house. Jake shows Peter around after offering him some lemonade. They walk out to his backyard complete with a pool, hot tub and a spectacular view of the ocean.<br>\r\n<br>\r\n\"Want to take a dip in the pool Peter?\" Jake asks Peter as he pulls off his polo shirt, kicks off his shoes and peels off his socks.<br>\r\n<br>\r\n\"Uh...sure, but I don't have a suit to wear\" Peter replies. Jake smiles and pulls off his shorts and boxers and jumps naked into his pool.<br>\r\n<br>\r\n\"Who needs a suit when you have your birthday suit\" Jake says in a laughing voice while swimming.<br>\r\n<br>\r\n\"Come on in, the water's fine\". Peter sees Jake climb out of the pool naked, does a silly pose on the diving board, then jumps off back into the pool. Jake is sporting a woody which Peter spots while Jake is posing.<br>\r\nPeter quickly pulls off his shoes and socks, then peels off his shirt, shorts and boxers and jumps in naked. They both swim around for a while before a servant announces Jake's friend, Argo has just arrived. Jake says to show him in as he gets out and wraps a towel around his naked waist. Peter marvels at seeing Jake's wet bare feet.<br>\r\nArgo walks out from the house and Jake surprises him by jumping on his back. His towel falls to the ground in the process. Jake is bit embarrassed as Argo pulls him off and throws him back into the pool. <br>\r\n<br>\r\n\"Hi, I'm Jake's friend Argo\" Argo says to Peter who is hanging on the side of the pool. Peter returns his salutation with a hand shake. Argo is about two or three inches taller than Jake, same build with sandy blonde hair, tan skin and wearing a jersey shirt, running shorts and sports shoes with calf high socks on his feet.<br>\r\n<br>\r\n\"Jake always was a joker and loved to surprise me while we worked on the series last year\". Jake swims over and apologizes to Argo. <br>\r\n\"Sorry about jumping on you and the towel falling off...still buds? Jake exclaims. Argo smiles. <br>\r\n<br>\r\n\"Why are you two skinny dipping anyways?\" Argo asks Peter and Jake. <br>\r\n<br>\r\n\"No suit?\" Peter replies. \"I like wearing nothing, besides it's my house\" Jake replies. \"Want to join us...the water is cool\". <br>\r\n<br>\r\nArgo contemplates for a moment then sits down on a chair and unties his shoes and takes them off. Peter waits with anticipation on what Argo's bare feet will look like, but Argo instead takes his jersey shirt off exposing his semi tan, hairy chest. He sits there for a moment soaking up the sun, before peeling off his socks exposing two lightly tan, semi-hairy feet with pedicured, slender toes. He wiggles his toes as they touch the hot cement deck. Argo then takes off his shorts leaving him with only some speedos on. Argo stands up and is about to walk over to the diving board.<br>\r\n<br>\r\nJake pipes in...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1511705640,
            "id":2420530,
            "title":"Let's go to my place for some more fun"
        },
        "1521311":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "and takes Argo's clothes off and goes down on him",
                "carries Argo and Peter to his bedroom, strip them naked and screw them both",
                "and wakes up Argo by biting his big toe"
            ],
            "content":"<div class=\"\"><div> <span>Argo does a slow strip tease with the speedos and flings them off with his foot. Argo is very well endowed with a 9 inch flaccid size penis. It becomes semi erect as he dives in and swims over to Jake and Peter. All three young guys begin to wrestle with each other, throwing each other over their shoulders and into the water again. Jake gets out and beats his chest like Tarzan and jumps back into the pool near Argo. Argo grabs his arms as Peter grabs his bare feet and begin to tickle him all over. Peter tickles Jake's bare feet with his tongue as Argo's strong arms hold Jake and he gets tickled with his right hand. Jake tries to buck them off, but in the process becomes erect. <br>\r\nArgo yells out \"Seems like somebody is getting excited\". Peter agrees \"Yeah, and they love their bare feet tickled and sucked\". Peter continues sucking his big toes. Argo pulls Jake to the side of the pool and lets him rest up on the side of the pool. Jake is tired and completely relaxes as his penis deflates a little. <br>\r\nA while later, all three of them are inside Jake's house eating lunch in the TV room. All of them are dressed in their clothes except Jake is still barefoot. His bare feet are resting on the ottoman sharing it with Argo's stocking feet. Peter is sitting on the floor near the ottoman. <br>\r\nArgo says to Jake \"So what's with your fascination with getting your toes tickled and sucked on? You never got excited when I tickled them in school. Remember when we were in PE and I trapped you underneath the wrestling pads, then took off your shoes and socks and tickled the hell out of your toes and soles? You laughed and asked for mercy, but you didn't pop a woody\". <br>\r\nJake replies \"I don't know, I guess because our classmates were around. Are your feet ticklish?\". Peter smiles and grabs hold of Argo's right foot and begins to tickle it. Argo flinches and tries to kick Peter away. Jake grabs his other foot and peels off his sock and engulfs his big toe.<br>\r\n\"Ohhh...awwww...\" Argo exclaims...\"that does feel good\". Peter peels Argo's other sock off and tickles his bare sole and toes. Argo's toes splay as it begins to excite him. Jake and Peter continue their foot fest of Argo's bare feet. Peter takes off one of his own socks and sticks his bare foot near Argo's mouth. Jake does the same with one of his bare feet. Argo takes their big toes an sucks on them both simultaneously. They all continue their toe and foot fest until they all fall asleep. Each with another's toe in their mouth. <br>\r\nJake awakes first... </span></div></div>",
            "created":1511801700,
            "id":2420955,
            "title":"\"Come on buddy, take the speedos off and ju..."
        },
        "15213113":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Brady makes Argo explode as he does Jake",
                "Brady ends up stroking both of their packages"
            ],
            "content":"<div class=\"\"><div> <span>that is resting my his mouth. He kisses Argo's other toes and nibbles on them causing them to splay. Argo slowly wakes up and looks around. He sees Peter asleep next to him with his left bare foot resting on his shoulder. Jake says \"Morning buddy. We all must have fallen asleep having fun with each other's feet\". He kisses Argo's bare sole before taking it off his chest. <br>\r\n<br>\r\nArgo says \"Yeah, I think I fell asleep with your big toe and his big toe in my mouth\". He sits up and places Peter's foot on the couch.<br>\r\nJust then, there is a knock at the door. Jake's servant answers it and announces a Mr. Brady West. Brady walks into the TV room as Jake, Argo sit up quickly and cover up a sleeping Peter including his bare feet. Brady is about 5 foot 9 inches tall with blackish-brown straight hair and semi-built tan body. He is wearing a t-shirt with a unbuttoned blue shirt over it, khaki stripe shorts and designer sports shoes with white socks on his feet<br>\r\n<br>\r\n\"Hi, I'm Peter's friend Brady. I was told he was visiting you Jake and he was supposed to go to the beach with me today\". <br>\r\nJake gets up and shakes his hand and invites him to take a seat. \"Nice to meet you. Peter and my friend Argo and I had a late night last night and fell asleep watching TV\". Brady sees socks strewn about the floor. \"Oh, do you want me to remove my shoes. I notice that everyone is barefoot\". He begins to untie his shoes. Jake and Argo look at each other and smile. \"Uh, yeah, please take them off and hand them to me. I'll put them in the foyer\" Jake says to Brady. Brady finishes untying his shoes, pulls them off and hands them to Jake. \"Nice shoes bro...\" Jake replies and takes Brady's shoes to the front foyer. <br>\r\n<br>\r\nBrady notices Peter still sleeping. Peter moves about and adjusts his sleeping position causing his left bare foot to become exposed. Argo notices it and tries to cover it back up, but Peter's toes are still exposed. <br>\r\nBrady exclaims \"He actually hates blankets over him especially his bare feet. He spends the night at my place quite a bit and likes to tall asleep on my recliner. Most of the time, I just take off his shoes and socks and leave him there barefoot and with no covering. <br>\r\nOnce in a while, he gets up and falls into the guest bed\". Jake returns and offers him some water. \"No thanks, but your house is breathtaking\" Brady says to Jake. He gets up and looks around and walks in his stocking feet to the window overlooking the backyard. \"and you have a pool, a jacuzzi and a great view of the ocean...wow\". <br>\r\n<br>\r\nJake looks over at Argo, then says \"Well, we were just about to take a dip to wake ourselves up. We thought about throwing Peter in, but I'll let him sleep. Want to join us?\". Brady replies \"Uh...my swim suit is at my house. Do you by chance have an extra suit?\".<br>\r\nArgo pipes in and says \"I just go a la natural\". Argo quickly takes off his shirt, shorts and boxers and runs naked into the backyard and into the pool. Jake laughs and says \"Come on, just join us...\". He stoops down and lifts Brady's right foot and peels off his sock and then does the same with his left foot exposing a beautiful pair of tan, hairless bare feet with slender, pedicured toes. Brady wiggles his bare toes as he strips off his button shirt and undershirt. Jake quickly strips off his own clothes as Brady gets his shorts  off. \"Last one in is a rotten egg\" Jake says as he pulls off his boxers and runs naked out the door and into the pool. Brady quickly pulls his boxers off and races naked to the backyard, but sees that Jake and Argo are already in the pool. He stops and steps up on the diving board. Brady has a nice package similar to Argo, but Jake likes his tan bare feet more. Brady dives in and swims over to Jake and Argo in the shallow end. <br>\r\n<br>\r\n\"Are you into any fetishes Brady...particularly a foot fetish?\" Argo asks him. \"Jake and I see you have beautiful tan bare feet and want to explore them\". Jake smiles at Brady and picks up Brady's right leg and holds onto his barefoot and sticks his big toe into his mouth. Brady sighs and nearly faints. Argo catches him and slowly moves him to the pool edge and lifts him out of the water. He takes Brady's other barefoot and tickles his tan toes, then engulfs his big toe. Brady lays back and moans. Jake notices Brady's penis is already erect and taps Argo. Argo stops tantalizing Brady's foot and instead gives him a blow job. Brady almost explodes immediately, splaying his toes in the process. <br>\r\n<br>\r\n\"That was mind-blowing, I never had anyone suck on my toes before, much less my penis\" Brady says. \"Peter has asked me if he could suck on my toes, but I declined. He offered to let me suck his toes, but I again declined. His bare feet are nice, but I thought it was kind of weird\". Brady jumps back into the pool as Jake and Argo jump out and sit with their feet still in the pool. <br>\r\n\"You can have your chance now Brady...\" Argo says as he lifts his right barefoot to Brady's mouth. \"And my barefoot too\" says Jake. Brady looks at both of their bare feet and toes up close and gives in. He first tickles both of them before kissing their toes and engulfing their big toes into his mouth. Jake and Argo smile and splay their other toes. <br>\r\n<br>\r\n<br>\r\n <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1511973300,
            "id":2421817,
            "title":"and wakes up Argo by biting his big toe"
        },
        "152131132":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Peter extends his right foot out to Brady who sucks his big toe",
                "Peter strips naked and joins Brady in the pool",
                "Jake, Argo and Brady attack Peter and pleasure him all over"
            ],
            "content":"<div class=\"\"><div> <span>Peter wakes up and walks out to the backyard only to see Brady sucking on Argo and Jake's big toe while at the same time giving them both hand job with both hands. Argo's toes splay as he explodes first followed by Jake's toes splaying and exploding. Jake and Argo lay down on the warm cement with their semi-erect penises standing up. Brady continues pleasuring their bare feet and toes as Peter walks closer. <br>\r\nBrady notices Peter's bare feet standing there and looks up.</span></div></div>",
            "created":1512658140,
            "id":2425087,
            "title":"Brady ends up stroking both of their packages"
        }
    },
    "info":{
        "author_id":"googooplexxxi",
        "author_name":"Googooplexxxi",
        "brief_description":"Tickle the boys of hannah montana, NO GIRLS! ",
        "created":1295975220,
        "description":"<td align=\"left\" class=\"norm\">This interactive is for those who enjoy M/M tickling and some stories will probably contain some worship as well. There are no girls allowed in these stories. You are free to do whatever you would like otherwise. Please have fun and remember that these are for the fellow lovers of male feet. ENJOY!</td>",
        "id":1745202,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1512658140,
        "modified":1512658140,
        "pretty_title":"The Boys of Hannah Montana Tickled"
    }
}