{
    "chapters":{
        "1":{
            "author_id":"mmjmm",
            "author_name":"heyyya",
            "choices":[
                "nate",
                "ben",
                "anso",
                "vince"
            ],
            "content":"<div class=\"\"><div> <span>all real guys (nates gaining some weight in real life):<br>\r\n<br>\r\n<br>\r\nnate--15 years old, plays football, nice round buns<br>\r\n<br>\r\nben-15 years old, soccer player<br>\r\n<br>\r\nanso--15, pothead<br>\r\n<br>\r\nvince--15, hockey player<br>\r\n</span></div></div>",
            "created":1224805320,
            "id":599030,
            "title":"choice"
        },
        "11":{
            "author_id":"mmjmm",
            "author_name":"heyyya",
            "choices":[
                "he gains 25 lbs",
                "he goes to the shower..."
            ],
            "content":"<div class=\"\"><div> <span>Nate had always been athletic. He was good at football, and on the varsity football team.  everyone liked him.  he was very muscular, and had the perfect body.  He always wore the same thing: jeans, a t-shirt, a hoody, and white under armour boxer briefs that were always visible-his jeans always seemed to slide down below his muscular butt. Our story begins at the very beginning of the year before football practice.  As everyone got into their equipment, nate noticed some people were looking unusually tubby.  He still had a perfect body.  As his coach noticed this, he told him, jokingly, that he wouldn't stay like that for long. Nate didn't know what he meant.  After football practice, he went home, had dinner, and then went to the mall with his friends. they all stopped at a pizza place inside, and ordered food.  Nate had already had dinner, but he chowed down anyways.  Then, as everyone was full, they dared him to eat the remaining pizza.  at the end, he felt incredibly bloated.  Then they went to the movies and he ordered a jumbo drink and popcorn, smothered in butter.  He suddenly felt hungry again, so he ate all of it during to movie and got 3 more refills.  As he got home, he went to the shower and stripped down to see his bloated belly.  He jumped up and down, and it jiggled.  He decided to weight himself-the scale said 125, which was fairly normal.  He went out with his friends nearly every night during football season.<br>\r\n<br>\r\nwhat happens?</span></div></div>",
            "created":1224806460,
            "id":599041,
            "title":"nate"
        },
        "111":{
            "choices":[
                "Nate likes it. ",
                "Nate is worried. "
            ],
            "content":"<div class=\"\"><div> <span>It had been two weeks. Two wonderful, glorious weeks of football victories, a new girlfriend, and food, food, FOOD!!! Nate went to school so happy every day of the week, and the weekends were filled with wild parties and laughter and nothing but good times. <br>\r\nIt all went sour, worse than lemons and Warheads, when Nate realized how rounded his belly had grown. He was in the locker room, changing out with the team to go home, and one of his teammates made a comment about \"that big ol' Nate-belly.\" And he had reached over and patted Nate's stomach, grinning, and Nate sort of laughed and shrugged it off. But when he got home, the first thing he did was race upstairs to the bathroom and pull out the scale. <br>\r\nNate's eyes widened when the red 150 sneered at him from the scale's screen. He placed his hands on his gut, feeling how tight his skin was, and how warm his belly was, and how very soft it had gotten. <br>\r\n</span></div></div>",
            "created":1253839200,
            "id":765438,
            "title":"he gains 25 lbs"
        },
        "1111":{
            "choices":[
                "Nate stuffs himself but continues to eat anyway. ",
                "Nate goes to sleep when he runs out of food. ",
                "Nate decides to start working out after he's gained some serious weight. "
            ],
            "content":"<div class=\"\"><div> <span>Nate gaped down at his plump little body, his hands slowly moving to rest on either side of his belly, and he started to rub without even thinking. It felt good... his eyes were wide as he realized that this belly thing... was really... <br>\r\nNate then thought back to what the coach had said: \"Not for long...\" <br>\r\nNate turned to the side, a smile starting to appear on his face as he slowly jiggled his belly up and down. He moved his hips side-to-side just to watch it sway in front of him. <br>\r\nNate went to the kitchen and opened the cupboard, pulling out a box of cookies, some chips, and other junk food. He took it all back to his bedroom... </span></div></div>",
            "created":1267497720,
            "id":844609,
            "title":"Nate likes it. "
        },
        "112":{
            "choices":[
                "he agrees to lose his muscular physique",
                "he refuses to gain weight"
            ],
            "content":"<div class=\"\"><div> <span>After he showered, Nate's mom called for him from the kitchen, so he went to see what she wanted. He walked into the kitchen and saw that she had brought two more large pizzas and two 2-liters of pop from a party at her work. THere wasn't any room  in the kitchen she explained, so anything that Nate didn't eat would be thrown away. Nate didn't like to waste food, and even though he wasn't sure why, he was hungry again, so he sat down at started wolfing down the pizza. Pretty soon all of the food was gone, and Nate was stuffed beyond belief. Since it was a Friday, he went to his room and started playing some video games. After about half of an hour, his Mom walked in and told him that a bunch of his friends who were coming over to spend the night had arrived. Nate and his friends had been playing around for a while longer when Nate's mom came back again, only this time with a tray with 30 chocolate chip cookies, and 2 gallons of ice cream. THis was normal for when Nae had sleep over's, his mom made th best cookies on the planet. His friends said that they weren't hungry though, and dared him to eat all of the food that his mom had brought.Nate was getting awfully hungry again despite all of the food that he had eaten that day, so he accepted, and started to cram the food into his mouth when one of his friends took the next one from him as he picked it up from the tray. Before Nate could ak why, hisfriend had brought it up to his lips, and he took a big bit out of it without thinking. The rest of cookies and the ice cream went away like this, with Nate being fed by his friends who also rubbed his swollen and distended belly and muttered soft words of encouragement to him as he put away all of the food. As Nate lay in overfed glory on the couch(they had layed him down towards theend to make feeding him easier) they all explained to him that coach wanted to get him fat. Next year a kid was going to be the Freshman QB, and coach really thought that Nate would make a good Lineman, he just needed to gain a lot of weight first. So coach had asked all of the other plaers if they would try their hardest to stuff Nate full of food 24-7. Coach had also talked with Nate's mom, and had gotten her to start giving Nate an experimental appetitie enhancer every morning instead of his vitamin. Nate's mom had always thought that it would be better if her boy was chubby, she thought that he was far to skinny for his age, so she agreed immediatly. Listening to all of this, Nate couldn't help but notice that he had a massive hard-on, as did all of the other boys.</span></div></div>",
            "created":1241242560,
            "id":684975,
            "title":"he goes to the shower..."
        },
        "1121":{
            "choices":[
                "Darrel goes home with Nate to stay the night",
                "Nate goes home alone"
            ],
            "content":"<div class=\"\"><div> <span>Nate sat in silence as the other boys stared at him for a response. After a few minutes of this silence, Nate sat up, rubbed his belly and said, \"Well, what are you all waiting for? Get me some food!\"<br>\r\nThe other boys cheered and got some chips from the kitchen. Nate removed his shirt and began rubbing his belly some more. The boys who weren't getting chips were looking at the bloated stomach in admiration, as well.<br>\r\n<br>\r\nThe next morning Nate stepped sleepily into the dining room, he was still shirtless, and still pretty bloated, but he was still hungry, as always. His mother has prepared a feast of pancakes, eggs, and sausage. Nate piled up ten flapjacks, eight servings of scrambled eggs, and lord knows how many sausages he scarfed down.<br>\r\n<br>\r\nHe slipped on a shirt to head to the park for his friend, Darrel's, birthday party, he swallowed an entire bottle of orange juice on his way out.<br>\r\n<br>\r\nNot very many people were at the party, just the football team and a few of Darrel's relatives, but his mother was hoping for more and made two cakes. After the guests ate one of the cakes, Nate devoured the other. He sat down and was given an entire bag of Doritos to eat, and a few can of pop.<br>\r\n<br>\r\nDarrel admired Nate's belly, and while Nate was eating chips, Darrel came over to feel it. Nate was used to it, and even liked it, when the other boys felt his belly. It wasn't like they weren't just as big. As a matter of fact, Nate was looking even bigger than the others now.<br>\r\n<br>\r\nThat night,</span></div></div>",
            "created":1249766100,
            "id":741101,
            "title":"he agrees to lose his muscular physique"
        },
        "11211":{
            "choices":[
                "Eat more",
                "Sleep"
            ],
            "content":"<div class=\"\"><div> <span>Darrel went home with Nate to stay the night. His mom wasn't expecting Darrel to come over, but was prepared with the usual food. Darrel was in on the coach's plan and didn't eat any of it, but insisted that Nate all of it. Darrel helped stuff Nate by forcing cookies, ice cream, pizza, and soda into his mouth. Nate seemed to notice he liked being fed and Darrel seemed to like feeding him even more.<br>\r\n<br>\r\nIn about half an hour Nate had eaten all of it and was rubbing his content, bloated belly. He'd eaten a carton of ice cream, three plates of cookies, a pizza, and a two liter soda and was stuffed. Darrel helped massage Nate's stomach  while he leaned back on the couch and rested.</span></div></div>",
            "created":1275851640,
            "id":895448,
            "title":"Darrel goes home with Nate to stay the night"
        },
        "112111":{
            "choices":[
                "The next morning",
                "That night"
            ],
            "content":"<div class=\"\"><div> <span>Darrel left the room for a few minutes and came back with more food; half a leftover cake, two jars of peanut butter, a gallon of milk, and another pizza. Darrel put handfuls of food into Nate's mouth at a time, puffing his cheeks with food.<br>\r\n<br>\r\nDarrel put huge chunks of cake into Nate's mouth, soon finishing the entire cake. Nate had icing and crumbs on his belly and soon had tiny drops of peanut butter to join them as Darrel filled Nate's belly with the jars.<br>\r\n<br>\r\n\"What better to wash down peanut butter and cake than milk?\" Darrel said, showing Nate the gallon.<br>\r\n<br>\r\nNate new he shouldn't, his belly was already round and bloated, but Darrel held Nate's nose closed and put the gallon to his lips. Nate had no choice but to chug it as fast as he could, quickly emptying the entire gallon into his quickly growing gut.<br>\r\n<br>\r\nNate belched loudly while picking up his first pizza slice. Three minutes later he'd finished the whole thing. Darrel felt Nate's belly and rubbed it. They were both so fascinated by it, neither of them noticed their boners while Darrel rubbed Nate's belly.</span></div></div>",
            "created":1275855420,
            "id":895475,
            "title":"Eat more"
        },
        "1121111":{
            "author_id":"mastermp95",
            "author_name":"blaze",
            "choices":[
                "continue all day?",
                "skip to ''after school''?"
            ],
            "content":"<div class=\"\"><div> <span>Darrel woke up next to Nate more like hugging him! then, he remembered rubbing Nate's belly and he fell asleep like that. Darrel got up and went downstairs and ran into Nate's mom. carrying a tray he said without thinking '' let me help you with that.''<br>\r\n''oh! ok thank you Darrel'' she said walking back down the stairs. Darrel placed the tray on the side of Nate and took a slice of a cheese cake and placed it in Nate's mouth then his eye's opened on the spot and began chewing on his own minutes later he was completely awake he began rubbing his belly as Darrel fed him.<br>\r\nlater after the cheese cake, cupcakes and a gallon of milk. After they both looked at the time. 7:15<br>\r\n''We're gonna be late for school'' Darrel said helping Nate sit up.<br>\r\n''ok'' Nate said tiredly. He slowly got up and went to get dressed he put a clean shirt on that could barely cover his new belly. then his shorts ''... can't.... ugh... button.... ah these shorts!'' he grunted then he finally got them to button. then 5 seconds later<br>\r\n''POP!'' of flies his button. ''aww man...''<br>\r\n''oh hey, you reminded me of some clothes i bought you'' he says with a smile reaching into his duffle bag and pulls out a large pair of pans i bought them because of the gaining, so you can wear a belt until your waaaaay to big for them....... now lets get going'' Darrel said. They lived right down the street from their school. As the walked they caught up with Darien, Melvin and Blaze. Darien was short yet pudgy but you could still see signs of muscle. Melvin was Muscular not buff and Blaze was just skinny. The four get to school and they talk.<br>\r\n''Oh so guys guess what.'' Melvin said.<br>\r\n''what?'' Darrel and Nate questioned were in a new class FYB 101 the football team, Blaze and Darien helped set it up!''<br>\r\n''uuuuuuuum.....'' they looked at each other ''What does FYB stand for?'' Nate asked.<br>\r\n''Oh you'll see and i'll think you'll like it!'' Darien said<br>\r\nthey walked through the doors and ran into the Football coach ''hey boys, i see some ones been eating well'' he said stepping up to Nate and poking him in the gut then started rubbing it. while Nate was chewing on a twinky ''you boys tell him about the new class?''<br>\r\n''yea'' Blaze said<br>\r\n''Well its now your new homeroom and we meet after school on Mondays, Wednesdays and Friday and sometimes Saturday.'' Coach said.<br>\r\nNate's eyes went wide he rubbed his gut ''what are we waiting for i'm hungry!'' he said ''so where is this new homeroom?!?!?!'' Nate asked.<br>\r\nthe coached laughed a  and said ''your already here!'' the coached said and led him to a room next to the gym the whole football team was in there and Darien and Blaze. (if you haven't guessed Melvin is on the football team).<br>\r\nthey took the front for the room then the teacher came in.<br>\r\n''Good morning boys i'm Mr. Avlis...'' he had a strong physique but fat like around 230 pounds.<br>\r\n''and this is Feed Your Buddies 101 or FYB now the Coach told me about how Nate needs to gain weight. Trust me we got that covered!'' he pointed to another door at the back of the room. ''Now lets feed each other shall we!'' they all paired up and fed each other darrel took nate, and Melvin, Darien and Blaze fed each other. there was food for the whole school but ment for the boys. all kinds of junk food pizza, cake, doughnuts all kinds of pastries and meats! it was like Heaven!<br>\r\nLATER!<br>\r\nAll the boys are fatter then the bell rings for 1st period</span></div></div>",
            "created":1276907220,
            "id":901981,
            "title":"The next morning"
        },
        "11211112":{
            "choices":[
                "Jacob stays over Nate's house for the night",
                "Nate goes home alone"
            ],
            "content":"<div class=\"\"><div> <span>Before the school day was over during Nate's fouth block class, Darrel fell ill and began puking so they sent him home. But as the bell rung the school day was now over so Nate rushed over to his homeroom class. As he got there he saw the coach and explained what happen with Darrel. The couch told him not to worry that someone new is coming to be his FYB partner. Nate got excited to see his new partner for FYB 101 class.Before the coach let him inside the classroom he rub Nate's belly after giving it a good poke then handing him two cupcakes and a twinky. Nate soon made it over to his seat and quickly ate the cupcakes and the twinky before Mr. Avlis introduced the new student. A teenager enetered the room. The teenager stood next to the teacher and he asked what was his name? And then teenager said Jacob. Well, your Nate's FYB partner.said Mr.Avlis Who is Nate? Jacob asked Nate soon stood up and Jacob quickly moved next to him. As Jacob turned to look he began blushed at Nate.Nate soon noticed this and took advantage of it. He quickly grabbed Jacob's chin and pulled him into a kiss. Soon Jacob kissed back saying Wow. Nate smiled at how red Jacob was now. But he quickly got back his composure and said what is this class anyway. It's call Feed Your Buddies 101. And you are suppose to feed that delicious food over there into my belly. Nate explained Another question do you want to be my boyfriend. said a blushing Jacob Nate leaned in and kissed him then said That answer your question.After Mr.Avlis blew the whistle Jacob rushed to the five tables and brought over two tables worth of food to him.There were pastries,meats, dairy, snack cakes, birthday cakes,chips,pizza,soda. It was Nate's paridise. Nate quickly tore down all the food Jacob gave him. In a matter of minutes the food was gone into Nate's belly. Nate soon burped out loud that was able to shock everyone by the sound. BBBBBBBBBBBBBBBBBBBBUUUUUUUUUUUUUUUUUUUURRRRRRRRRRRRRRRRRRRRRPPPPPPPPPPPPPP!!!!! ! After being blown back by Nate's extremely powerful burp Jacob quickly being rubbing his boyfriend belly until they both had boners. Soon as Nate felt full class was over and Jacob managed to help Nate up and they began walking walking home together.</span></div></div>",
            "created":1293955920,
            "id":1027485,
            "title":"skip to ''after school''?"
        },
        "1121112":{
            "choices":[
                "That next morning",
                "Later that night"
            ],
            "content":"<div class=\"\"><div> <span>After they soon fell asleep, Darrel unknowingly heard someone walking down the stairs. As Darrel turned in the bed he saw that Nate was nowhere to be found. So he decided that he'd go downstairs to find Nate. Darrel soon walked the  downstairs and start heading towards the kitchen. As he made it inside the kitchen he saw that the cabinets, pantry, jars empty. Darrel quickly turned to fridge then saw that Nate's eyes were closed while he was forcing into his mouth. \"I can't belive he's eating.\"Darrel thought as he moved closer to Nate. Seeing as there was no more food in the fridgerator Nate turned towards Darrel. Still in his daze, Nate grabbed Darrel then lifted him towards his mouth. Soon as Darrel's woke up from his daze he noticed that he was about to be eaten by his lover. As Darrel moved down through Nate's mouth reaching his belly. In a few more gulps Darrel was completely down inside of Nate's belly, but soon Nate belly was now the size of an over-inflated basketball. Still inside his newly streched boxers, Nate soon let out one huge burp. BBBBBBBBBBBBBBBBBBBBUUUUUUUUUUUUUUUUUUURRRRRRRRRRRRRRRRRRRRRRRPPPPPPPPPPPPP. After feeling satisfied with his meal, Nate walked back upstairs to his room then got in his bed after falling fast asleep. Later................</span></div></div>",
            "created":1296964140,
            "id":1048403,
            "title":"That night"
        },
        "12":{
            "choices":[
                "He was still bloated",
                "He was normal again",
                "He had gained a few pounds"
            ],
            "content":"<div class=\"\"><div> <span>Ben was a sports jock at his school. Everything about him was centered around his physical state.He worked out constantly and was the most muscled person in his class, constantly showing off his biceps or pulling up his shirt to show his Six-pack. <br>\r\n<br>\r\nIt was off season for him so he didn't have much of an incentive to work out and had gone off course a little bit with his diet. The last night at dinner his family was out doing something he didn't join in on, so he ate by himself. He searched the fridge and couldn't decide what he wanted so he just pulled out everything and ate as much of it as he felt like. By the end, he'd eaten a weeks worth of leftovers and drank a two-liter of soda.<br>\r\n<br>\r\nHe groaned as his stomach swelled and churned. He was uncomfortable in his clothes and his family wasn't going to be back until much later so he stripped down to his briefs and layed on the couch. He sat up and looked at his bloated gut, pressing against it. He stood up and looked in a mirror, shaking it around to hear the sloshing noises it made.<br>\r\n<br>\r\nThen he remembered his mom had bought a three-quart bucket of ice cream the day before so she wouldn't have to go shopping for more anytime soon. She probably wouldn't notice if it went missing since she'd only bought it a while ago. He'd just say it was never there.<br>\r\n<br>\r\nHe stumbled to the freezer where he pulled it out, opened the lid, and started eating with an ice cream scoop. After about 20 minutes it was empty and his belly was full to bursting. He let out a mighty belch and went back to his room where he fell asleep on his bed.<br>\r\n<br>\r\nThe next day...</span></div></div>",
            "created":1275713460,
            "id":894579,
            "title":"ben"
        },
        "121":{
            "choices":[
                "He should call Jake and get him to feast with him",
                "He should ignore Jake and keep gaining",
                "He goes back to the old Ben and starts building his muscles again"
            ],
            "content":"<div class=\"\"><div> <span>Ben's belly was still hard and round from the night before, but he didn't have to go anywhere today. His mom came in and asked how he was feeling, and he told her he felt terrible.<br>\r\n<br>\r\n\"I'm going to the store today with your father, you stay here and rest,\" she said as she walked out the door. Ben pulled back his sheet and stroked his magnificent belly. It was starting to get softer, but it still had a hard feel to it.<br>\r\n<br>\r\nAfter his mom left, Ben dove for the pantry, eating cookies and all the snack cakes he could get his hands on. They were shopping today anyway, so why couldn't Ben make sure there wasn't too much in the house?<br>\r\n<br>\r\nHe took down three boxes of different snack cakes, two boxes of cookies, and had two big slices of the pie his mom had sitting out.<br>\r\n<br>\r\nWhen he was done he went back to his room to rest and rub on his belly. He layed down and started massaging the lump when the doorbell rang. He opened the door and saw it was his gym-rat friend Jake coming by to see how he was. He took a few steps in the door before noticing Ben's big stomach buldge.<br>\r\n<br>\r\n\"Ben, what the hell happened to you, you've only been away for four days and, I mean, well, that's. I don't know what to say,\" Jake said.<br>\r\n<br>\r\n\"Don't say anything, this actually feels better than anything I've ever felt before,\" Ben said, stoking his belly.<br>\r\n<br>\r\nJake reached out and touched it. Ben had stuffed himself so much it was like Ben had swallowed a really big rock whole. <br>\r\n<br>\r\nJake pulled his hand back and shook his head, \"I have to go, this is just... too weird,\" as he backed out of the door. Ben rolled his eyes and closed the door behind him and went back to his room, massaging his gut the whole way.<br>\r\n<br>\r\nHe didn't know what to do...</span></div></div>",
            "created":1275719700,
            "id":894653,
            "title":"He was still bloated"
        },
        "1212":{
            "choices":[
                "Later that night",
                "Morning",
                "This evening"
            ],
            "content":"<div class=\"\"><div> <span>After Jake freaked out and ran off, Ben decided to go back to eating. Ben soon went back into the refrigerater then open it to see a birthday cake that was three days old along with a whole pizza,two-liters of soda, a tray of cookies and a tray of cupcakes. Ben's belly soon growled as his mouth began to drool. Ben quickly brought up the cake, trays of cookies and cupcakes, and the two-liters of soda bottles upstairs to his room while he re-heated the pizza and brought upstairs to his room. Ben quickly went into a food fenzy and started tearing down the food like there was no tommorrow. Soon he came back out of when he heard a knock coming from his door and was his best friend Dustin. Dustin said Wow, Ben how did you belly so big so fast. Can I touch it. Of course, you can Dustin.said Ben grabbing Dustin's hand and place it on his belly. It felt kinda hard but soft and squishy. Um.......Ben can I stay over so I can help you make this thing grow and rub it when ever it got to full, so It can eat me so that it would pleasure your hunger. Ben didn't know what to say but the first thing that came to his mind was Yes which he accidently spoke out loud. Dustin was so happy that he kissed both Ben and his bulging belly. As they both went upstairs to Ben's room Dustin saw empty trays and one pizza slice left with a little bit of soda left so he walked over to Ben ans told him to open his mouth. Ben did what he was told and Dustin put the pizza slice in then Ben swallowed it whole but soon after he felt thristy. So Dustin handed the soda to Ben and he quickly down it, leaving a loud burp behind. BBBBBBBBBBBBBBBBUUUUUUUUUUUUURRRRRRRRRRRRRPPPPPPPP. Ben soon got back in his bed along Dustin cradling his belly. But oddly he began to love Dustin he thought as he rubbed his belly he the sloshing sound again.</span></div></div>",
            "created":1293956820,
            "id":1027496,
            "title":"He should ignore Jake and keep gaining"
        }
    },
    "info":{
        "author_id":"mmjmm",
        "author_name":"heyyya",
        "brief_description":"high school guys are about to feel the joys of eating & being lazy, & what comes with it",
        "created":1224805080,
        "description":"<td align=\"left\" class=\"norm\">these high school guys are discovering the joys of overeating and being lazy, and what comes along with it.<br>\r\n<br>\r\n-no magic<br>\r\n-realistic weight gain only<br>\r\n-at least one decent-length paragraph<br>\r\n-no girl weight gain</td>",
        "id":1487998,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1296964140,
        "modified":1296964140,
        "pretty_title":"high school boys weight gain 2"
    }
}