{
    "chapters":{
        "1":{
            "author_id":"jddsjjj",
            "author_name":"justin",
            "choices":[
                "Giantess Selena Gomez",
                "Giantess Bella Thorne",
                "Giantess Debby Ryan",
                "James (Tiny person)",
                "Dylan (Tiny person)"
            ],
            "content":"<div class=\"\"><div> <span>In the year 2014, a couple of giantess's were roaming the earth and crushing everything in their way, till 2 tiny people managed to change the hearts of the giantess's<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWHO WILL YOU FOLLOW</span></div></div>",
            "created":1359328680,
            "id":1518338,
            "title":"Where we Begin"
        },
        "14":{
            "author_id":"jddsjjj",
            "author_name":"justin",
            "choices":[
                "Walking To London"
            ],
            "content":"<div class=\"\"><div> <span>James: AAARRGHHH<br>\r\nWhat is wrong with you people!!!<br>\r\n<br>\r\nMan: Nothing, just getting rid of some useless trash.<br>\r\n<br>\r\nJames: *holding leg* Stabbing me with a knife isn't going to get rid of me.<br>\r\n<br>\r\nMan: It will if your not breathing any more.<br>\r\n<br>\r\nWoman: Just let him go John!<br>\r\n<br>\r\nJohn: After he punched me in the face? Sarah, i thought you wanted him out of the house anyway.<br>\r\n<br>\r\nSarah: Yes i want him out because he has problems, no i don't ever want to see him again, but that doesn't mean you have to kill him.<br>\r\n<br>\r\nJohn: Fine... *pointing at James* You have 3 minuets to pack everything you need and leave.<br>\r\n<br>\r\nJames: *limping to grab a back that says medical on it* I'ts not like i wanted to stay anyway.<br>\r\n<br>\r\nAs James leaves his house, he starts hearing thuds on the ground.<br>\r\n<br>\r\nJames: Huh, Must be another earthquake, ever since that giantess left we've had a lot of them lately. Guess i better start walking, its a long way to London.</span></div></div>",
            "created":1359329460,
            "id":1518351,
            "title":"Kicked out"
        },
        "141":{
            "author_id":"jddsjjj",
            "author_name":"justin",
            "choices":[
                "Sunken City"
            ],
            "content":"<div class=\"\"><div> <span>As James was walking to London, the closer he got the louder the thuds kept getting.<br>\r\n<br>\r\nJames: This has got to be the weirdest earthquake i have ever heard. And it seems to be getting worse.<br>\r\n<br>\r\nAs he was thinking this, someone was riding a motorcycle and slammed the brakes right next to him.<br>\r\n<br>\r\nBiker: Kid, what the hell are you doing!!!!!!! That giantess is going to crush you if she catches to going to London!!<br>\r\n<br>\r\nJames: What are you talking about? The giantess here left years ago.<br>\r\n<br>\r\nBiker: yeah well guess what? She's back and she's pissed, and her names Bella.<br>\r\n<br>\r\n*Biker takes off*<br>\r\n<br>\r\nJames: That was weird, but i guess that explains all the thuds. But there's no point in not going to London, it's not like my life can get any worse.<br>\r\n<br>\r\nAs James continued to walk, he couldn't get that name out of his head. Bella.<br>\r\n<br>\r\n</span></div></div>",
            "created":1359330720,
            "id":1518367,
            "title":"Bella Thorne"
        },
        "1411":{
            "author_id":"jddsjjj",
            "author_name":"justin",
            "choices":[
                "During the night"
            ],
            "content":"<div class=\"\"><div> <span>(I just want to clear one thing up real quick before someone get's really confused, James is American, but was forced to move to Europe)<br>\r\n<br>\r\nWhen James was a few miles from London, he noticed a ton of smoke was rising into the sky.<br>\r\n<br>\r\nJames: So that biker dude was right, she is pissed. Maybe i can sneak through the city fast and catch a boat to America.<br>\r\n<br>\r\nJames then started running to reach London before all of the Boats left, Little did he know that Bella was leaving London and walking right to him.<br>\r\n<br>\r\nBella: Well that was fun, destroying the city and all, but i'm really tired now so i think ill have a little rest on this hill.<br>\r\n<br>\r\nAs Bella sat down, she felt something  squirming under her butt.<br>\r\n<br>\r\nBella: A little guy? Way out here?<br>\r\n<br>\r\nBella plucked the little guy out from under her.<br>\r\n<br>\r\nBella inspected the little guy and noticed he could be no older than 14.<br>\r\n<br>\r\nBella: Hey little guy, what are you doing way out here? There's no houses for miles.<br>\r\n____________________________________________________________________________ ___________________________________<br>\r\n<br>\r\nAs James got to the top of the hill, he noticed it got really dark.<br>\r\n<br>\r\nJames: What? It's getting dark already? but it's only 5:00 P.M. AAARRGGHHH<br>\r\n<br>\r\nJames then felt dizzy as something big and heavy fell on top of him.<br>\r\n<br>\r\nJames: (muffling) What the heck? the the sky fall or something?<br>\r\n<br>\r\nJames suddenly became scared as he was picked up and brought in front of a giant girls face.<br>\r\n<br>\r\nBella: Hey little guy, what are you doing way out here? There's no houses for miles.<br>\r\n<br>\r\nJames: (Freaking out) Please don't hurt me! Please Please Please!!!!!!!<br>\r\n<br>\r\nBella: (confused) Why would i hurt you?<br>\r\n<br>\r\nJames: Y-you're a giantess, don't giantesses hurt people?<br>\r\n<br>\r\nBella: Not really, we only destroy cities really.<br>\r\n<br>\r\nJames: But you kill a lot of people doing that!<br>\r\n<br>\r\nBella: I know but it doesn't mean i have to like it. So why are you out here again?<br>\r\n<br>\r\nJames: My \"family\" kicked me out of the house...<br>\r\n<br>\r\nBella: I'm so sorry. Oh my god! You're hurt!!!<br>\r\n<br>\r\nJames: yeah, I got stabbed on my way out.<br>\r\n<br>\r\nBella: That must have been terrible... Who are you any way?<br>\r\n<br>\r\nJames: I'm...... Nobody i guess.<br>\r\n<br>\r\nBella: That's impossible, everyone's somebody.<br>\r\n<br>\r\nJames: ...could you just put me down?<br>\r\n<br>\r\nBella placed James on her chest as she laid back on the hill.<br>\r\n<br>\r\nBella: What's your name kid?<br>\r\n<br>\r\nJames: It's James.<br>\r\n<br>\r\nBella: James, do you have a place to stay anymore?<br>\r\n<br>\r\nJames: No, I was going to head back to America to start over, I guess.<br>\r\n<br>\r\nBella: Why don't you just stay with me?<br>\r\n<br>\r\nJames: (Looking hopeful) Really?<br>\r\n<br>\r\nBella: Yeah, it could be fun. Just promise me you won't run away.<br>\r\n<br>\r\nJames: I promise.</span></div></div>",
            "created":1359334440,
            "id":1518389,
            "title":"Nobody"
        },
        "14111":{
            "author_id":"jddsjjj",
            "author_name":"justin",
            "choices":[
                "2 Giantesses and the Tiny"
            ],
            "content":"<div class=\"\"><div> <span>As night came closer, James and Bella found a place to sleep. Bella would sleep behind a hill while James slept under a tree next to the giantess.<br>\r\nThey both slept peacefully, until the G/T Ban Clan (GTBC) came and kidnapped James right from under Bella.<br>\r\n<br>\r\nLater that night, James woke up in a strange warehouse.<br>\r\n<br>\r\nGTBC Leader: Wake up kid.<br>\r\n<br>\r\nJames: Where am I? Last i remember I was falling sleeping under a tree next to Bella.<br>\r\n<br>\r\nGTBC Leader: You are in the \"Giantess Ban Clan\" warehouse. you won't have to worry about that evil giantess anymore, we brought you here to save you from being her next meal.<br>\r\n<br>\r\nJames: Wait, what are you talking about? Bella's not evil, she told me i could stay with her.<br>\r\n<br>\r\nGTBC Leader: Maybe, until she get's tired of you, trust me kid, you're safe here with us.<br>\r\n<br>\r\nJames: Please tell me you didn't just take me without leaving an explanation.<br>\r\n<br>\r\nGTBC Leader: no we didn't leave an explanation, why? <br>\r\n<br>\r\nJames: Giantess101- Never take anything that the giantess is protective of.<br>\r\n<br>\r\nSuddenly, the whole warehouse started shaking and everyone heard buildings collapsing.<br>\r\n<br>\r\nJames: She might get pissed off...<br>\r\n<br>\r\nGTBC Leader: Shit, Everyone downstairs now before she crushes you!!!!!!!<br>\r\n<br>\r\nAs everyone started heading downstairs below ground for safety, James took off running to the entrance.<br>\r\n<br>\r\nGTBC Leader: Kid! What are you doing!?<br>\r\n<br>\r\nJames: I'm going to try and fix this mess!<br>\r\n<br>\r\nGTBC Leader: How do you plan on doing that?!<br>\r\n<br>\r\nJames: I'm going to confront Bella...<br>\r\n<br>\r\nJames finally reached the entrance and  ran out onto the street full of panicking citizens.<br>\r\n<br>\r\nGTBC Leader: Good luck kid, you're gonna need it.  <br>\r\n</span></div></div>",
            "created":1359437640,
            "id":1519261,
            "title":"During the night"
        },
        "141111":{
            "author_id":"jddsjjj",
            "author_name":"justin",
            "choices":[
                "Confront Bella in the Open",
                "Get Selena's Help"
            ],
            "content":"<div class=\"\"><div> <span>Dylan: Can you let me out of your breast Selena? It's so freaking dark.<br>\r\n<br>\r\nSelena: Fine, i'll let you out for a little while.<br>\r\n<br>\r\nSelena plucks Dylan from her breast and places him on her shoulder.<br>\r\n<br>\r\nSelena: Better?<br>\r\n<br>\r\nDylan: Yeah, I can actually see someth- what happened here?<br>\r\n<br>\r\nSelena: I think someone pissed Bella off.<br>\r\n<br>\r\nDylan: do you mean the giantess that's heading toward us?<br>\r\n<br>\r\nSelena: Yep that's the one.. Quick we have to hide you!<br>\r\n<br>\r\nDylan: you don't mean...<br>\r\n<br>\r\nSelena: Sorry sweetie.<br>\r\n<br>\r\nSelena picks Dylan up and places him in between he breast again.<br>\r\n<br>\r\nDylan: Again everything's so dark!!!!!<br>\r\n<br>\r\nSelena: Shut up for a minuet Dylan!<br>\r\n<br>\r\nBella: What are you doing in London Selena?<br>\r\n<br>\r\nSelena: Just travelling a little bit, what are you doing here?<br>\r\n<br>\r\nBella: Oh not much, just crushing the city because a tiny broke his promise.<br>\r\n<br>\r\nSelena: Well have you found him yet?<br>\r\n<br>\r\nBella: No, that's why i'm crushing the city, i figure since i can't find him if i step on everything, he'll be crushed under my foot.<br>\r\n<br>\r\nSelena: Bella that's crazy, what was the promise he broke?<br>\r\n<br>\r\nBella: he said he wouldn't run away, and he did during the night.<br>\r\n<br>\r\nJames: *hiding behind a tree* That's what i figured, she thinks i ran away... Should I walk out there and tell her the truth, or should i get Selena to help me?</span></div></div>",
            "created":1359438600,
            "id":1519276,
            "title":"2 Giantesses and the Tiny"
        }
    },
    "info":{
        "author_id":"jddsjjj",
        "author_name":"justin",
        "brief_description":"2 giantess find and befriend some tiny people and travel the word and stuff",
        "created":1359328320,
        "description":"<td align=\"left\" class=\"norm\">WARNING: The following story will contain giantess themes, you may encounter feet, vore, butt crush or anything else giantess related, if any of this offends you PLEASE DO NOT READ!!! Thank you. This story is by me and a couple of my friends so please do not add to it unless you have my ok because i will delete your chapter, Thanks<br>\r\n<br>\r\nCHARACTERS:<br>\r\n<br>\r\nGiantess Selena Gomez: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://docop.deviantart.com/art/Giantess-Selena-Gomez-in-City-2-342635570\" target=\"_blank\">http://docop.deviantart.com/art/Giantess-Selena-Gomez-in-City-2-342635570</a><br>\r\n<br>\r\nGiantess Debby Ryan: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://docop.deviantart.com/art/Giantess-Debby-Ryan-Part-2-281342240\" target=\"_blank\">http://docop.deviantart.com/art/Giantess-Debby-Ryan-Part-2-281342240</a><br>\r\n<br>\r\nGiantess Bella Thorne: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://megalover93.deviantart.com/art/Giantess-Bella-Thorne-330462353\" target=\"_blank\">http://megalover93.deviantart.com/art/Giantess-Bella-Thorne-330462353</a><br>\r\n<br>\r\nGiantess Victoria Justice: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://fc06.deviantart.net/fs71/f/2012/123/3/c/request_12_by_ilikemercs-d4ygxma.jpg\" target=\"_blank\">http://fc06.deviantart.net/fs71/f/2012/123/3/c/request_12_by_ilikemercs-d4ygxma....</a><br>\r\n<br>\r\nJames<br>\r\nAnd<br>\r\nDylan</td>",
        "id":1915802,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1359527820,
        "modified":1359527820,
        "pretty_title":"The Journey of a Life Time"
    }
}