{
    "chapters":{
        "1":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Born as a Shiny Pokemon.",
                "Human turned into a Pokemon.",
                "Reader's Choice",
                "Reader's Choice",
                "Readers's Choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One other thing I forgot to add Try and make at least a Paragraph for each choose. Also try and make as many choices as you can. Don't make it a one way story. If you can't that's fine but please try.</span></div></span></div>",
            "created":1300510800,
            "id":1072689,
            "title":"Choices, choices and even more choices."
        },
        "11":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Boy",
                "Girl",
                "Mixed. (Sorry not sexist just don't remember what their called.)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Please pick a gender</span></div></span></div>",
            "created":1300510800,
            "id":1072690,
            "title":"What are you?"
        },
        "111":{
            "author_id":"firechu227",
            "author_name":"pikachu",
            "choices":[
                "Electric ",
                "Fire",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok! Now, wich type are you?</span></div></span></div>",
            "created":1516185360,
            "id":2441931,
            "title":"Boy"
        },
        "112":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Fire",
                "Water",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of Pokemon are you</span></div></span></div>",
            "created":1300510800,
            "id":1072692,
            "title":"What type of Pokemon"
        },
        "1121":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "I'm still new to this world",
                "A bit more mature but not adult yet",
                "Adult"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay now how evolved are you?</span></div></span></div>",
            "created":1300510800,
            "id":1072704,
            "title":"Fire"
        },
        "11211":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Growlithe",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay what are you?</span></div></span></div>",
            "created":1300510800,
            "id":1072707,
            "title":"I'm still new to this world"
        },
        "112111":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Keep going",
                "New Story"
            ],
            "content":"<div class=\"\"><div> <span>Ever since I was born I was different from everyone else in my pack. A regular Growlithe is born they are born with orange coat with black lines across our backs and feet. We also have a cream color fur on our under belly, top of our heads and on our tails. I have two out of three. I have black strips on my body like the others, I have the creamy color on my body just like everyone else but I have one true difference. I don’t have orange fur all over, I have yellow fur. I was able to tell by the differences between me and everyone else in the pack. See us Growlithes and Arcanines stay in packs. Not very large packs but about ten to fifteen other members. As being one of the few females in the pack I don’t get made fun of a lot but I still get insulted here and there. An Arcanine is a Growlithe that I much large, (Growlithes are 2 ft. 4 in, Arcanines are 6 ft. 3 in.) They have the cream color fur all over their face and are better built. In our pack there are the four Arcanines, my dad, leader, track, and the female alpha. Then us Growlithes there is the eight males, Joy, Roy, Leo, Mark, Kyle, James, Will, and Patrick. Then there is us four girls, me, (Rosa), Lisa, Mary, and the spoiled brat Jasmine.<br>\r\n<br>\r\nWe travel over Kanto and some parts of Johto. When we travel we run into other packs of different Pokémon and other Growlithes and Arcanines. We share stories with them, have little brawls here and there, or just walk by because we don’t like one or another. No a lot truly happens when travel. Once and awhile we’ll run into a trainer who will catch a Growlithe, because some of them try to challenge an Arcanine and most fail. Some win but that’s when they have nothing but six water types all at once. I’ve seen some of my brothers and a sister be caught but never me and my dad. I know my mom was taken before I could remember, dad told me. Partly because I hide behind my dad, the pack’s hunter, and I’m never seen by them. When they do catch one of us they either leave or try again to catch more of us. When they try to catch more of us we us flamethrower at the person and they always run away. When they catch one and walk away we just let them. It’s all really about honor as a Pokémon. They fight us and win so we let them take the loser with no problem.<br>\r\n<br>\r\nAs I grew up from being a puppy to a matured dog I knew I was going to be I had lot of hard ships on me. I had to learn how to hunt, fight and survive if I ever got lost from the pack. I also had to learn how to take care of others when they get hurt in fights or on hunting trips, (learning what plants to rub on their wounds.)When I have time to relax is when I’m usually insulted by other Growlithes, usually by the other three girls in the pack. They just make fun of me because of my fur being yellow instead of orange. My dad says “Stick and stones can break bones but words shall never hurt me.” What I take from that is just ignore them and they’ll leave sooner or later and it works.<br>\r\n<br>\r\nWhen we travel return to Kanto we found a couple of strange rock. At first we, Growthlithes, didn’t know what they were until one of the males licked on and evolved right in front of everyone. That’s when we knew they were firs stones. (Stones that grow from being super heated in a volcano and take on a fire like color to them. When a Growlithe, or any other Pokémon, us it they lose their color and turn into regular rocks.) The seven other males even changing at them trying to evolve but the four adults stopped them and told them “The first thing we do is evolve some of the girls and then some of the guys.” They looked at the four left and said, “Two males and two girls shall evolve and become the new Arcanines of the pack.”<br>\r\n<br>\r\nAll the boys and girls ran towards the rocks as I just sat back and watch them choose Leo and Mark, the fastest and strongest of the boys, and Lisa and Mary, the best female fighters there are. That night a party was thrown for the new Arcanines as us Growlithes are sent back into the den to rest. Everyone was so ecstatic and hoping they could find a firestone and evolve as well. I didn’t care because my dad told me that when/if I evolve I turn into an Arcanine with yellow fur. I like to stay as a Growlithe with yellow fur because I think I look better like this.<br>\r\n</span></div></div>",
            "created":1300597200,
            "id":1073326,
            "title":"The World of a Shinny Growlithe"
        },
        "1121111":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Waken in a PokeCenter",
                "Waken in a Pokeball"
            ],
            "content":"<div class=\"\"><div> <span>The next morning we continued on to our den in Kanto. We have to go throw a jungle before we are there. As we journey have way throw the jungle a trainer comes up right behind us. He then throws out a ball that released a Maril. The Maril stood about a foot tall and yelled out “Finally fresh air. Boy you have no idea how stuffy it is in there.”<br>\r\n<br>\r\nThe boy looked at his Maril and then said “You ready?” He then looked at us trying to find the one he wanted to fight, maybe even catch. He looked through the whole pack and saw me. The boy looked about twelvish, having the lower have of his body in a dark blue color different from the rest of him, (a pair of dark navy blue jeans.) His feet were white and had some strange features that I never took notice till now, (white sneakers.) As for his chest, it was white with nothing to special about it, (a plain white t-shirt.) He had something on his head that cover his eyes from the sun it was blue, (a blue hat.) As for his face he had blue eyes that looked like the sky, he had black hair, if not very dark brown, that went only to his ears, a nose that wasn’t too large or small for the rest of his face. His ears were nice size compared to his head. Head also had a smile on him as if he was playing some game of tag with his friends. He didn’t look dangerous so I let my guard off a bit.<br>\r\n<br>\r\nAs he looked at me he yelled, “Maril use WATER GUN on the shiny Growlithe.”<br>\r\n<br>\r\n“Right away sir,” the Maril said before he shot at me with his water gun. I jumped out of the way and ran at him using TACKLE on the Maril. (Everything in capital is the moves that the Pokémon use for thoses that don’t know what they are.) I hit him dead in his gut sending him flying right back at the boy.<br>\r\n<br>\r\nThe Maril flipped right back to a fighting stance and aid, “Your good, but I’m better.”<br>\r\n<br>\r\n“I doubt that!” I yelled back as I used FLAMETHROWER. The flames were as large as an Arcanine.<br>\r\n“Maril dodge it and use WATER GUN again!” the boy yelled.<br>\r\n<br>\r\n“”Already on that,’ the Mail said as he ran to the left and shot at me again. I was about to jump out of the way when I saw the flames were heading right at the little boy. I didn’t even think as I ran towards him, dodging the WATER GUN, and pushed him out of the way of my attack. (Growlithes are very fast when they force themselves to be.) As I pushed him out of the way I was now hit with my own attack. Because I’m a fire type the damage doesn’t hurt as much as it should but because I made it so powerful I still had a hard time getting up.<br>\r\n<br>\r\nThe boy looked at me shocked that I did that his eye widen, hi mouth was open and all. His eyes popped out even further when he saw me get up and try to shack it off. He looked at his aril and said, “Maril that’s enough.”<br>\r\n<br>\r\n“Uh she can still fight…. Can you?” he asked me a little concern in his voice.<br>\r\n<br>\r\nI try to walk but I feel my legs strain from me even trying to. I collapsed where I stood and I look up at the boy and his Maril. I have lost and he now had the rights to do whatever he pleased with me. He then grabs a ball from his belt and said, “Maril return.” The Mari then turned into a red light that flowed right back into the ball. The boy then walks over to me and picks me up. I look at him as he looks back at my pack, “Is it okay if I keep her as my own?” he asked the pack. I was shocked to say at least. This kid has now told a Pokemon to fight me, for me to almost hurt, if not kill him, and for me to take that blow for him, and he asked her pack… my DAD if he could keep me?!?!? I looked back at pack and see my dad look at me and shack his head yes. I was now dumbfounded. The Arcanine that has raised me and has kept me safe was now telling this strange being to keep me?!?!? I now started to feel the strain of releasing such a strong FLAME THROWER and I start to black out.</span></div></div>",
            "created":1300597200,
            "id":1073328,
            "title":"No longer with my family"
        },
        "11211111":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>As I awoke I found myself in a very strange room. It was whitish pink on the walls and had a yellow floor that was cut up into tiny squares, (tiles) I saw a window to my left and also saw the boy who beat me was right there asleep in a strange log next to me (chair.)I yawned a little and got up to see what I was sleeping in. I was large and square like but it was soft. I saw that there was something on top of my lower half, (she is on a bed and under a blanket.) I crawled under it to see if there was anything else in the thing on me. There was nothing under there but the strange thing kept falling on me when I pushed it up. I turned to my back and started to kick it and I was starting to have some fun. It lasted for a moment or two. That when I realized that I was completely healed and not a single part of me hurt. I was so happy but confused. Nothing that grew in any of the places I wondered through ever had anything that healed in one day. That’s when I started to wonder how long I was asleep? That’s when I remembered that I’ll never see my dad again. The others I really don’t like but I did care about my dad. That’s when I started to whimper about the whole situation I was in.<br>\r\n“You okay girl?” said a voice from the other side of the thing I was under. That’s when I saw the thing I was under be removed and the boy was there looking down at me. He had a smile on him that was warm and made me feel al little better about the situation I was in. I nodded to his answer remembering that humans don’t know how to speck Pokémon. Another person walked into the room. She had pink hair, had a very beautiful face that couldn’t be forgotten, (Nurse Joy.) She had blue eyes blue sea blue eyes and a very warm smile. As she entered the she had a Chansey right behind her.<br>\r\n“Well it’s good to see that your Growlithe has woken up. She had some pretty burn marks on her,” the woman said, (from here on out I’m going to call them by their names.)<br>\r\n“My name is Bell.” The Chansey said. “How did you get so burnt?”<br>\r\n“I used my flamethrower,” (Lower case when they take about the move.) “and his Maril jumped out of the way making it aim right at the kid and I just jumped in front of it.” I was at this time I was noticing the humans were having a conversation themselves but I didn’t care since I was in the middle of one myself.<br>\r\n“So what were you thinking when you jumped in front of it?” Belle asked as she put a wet cloth on a burn mark.<br>\r\n“That’s the thing though I didn’t think I was the flamethrower coming at him and then I just ran in front of it. There was no thought in it.” I said with my head down. “My name’s Rosa by the way.”<br>\r\n“Did the kid name you that or is that your birth name?”<br>\r\n“My birth name.”<br>\r\n“Do you want to keep it?”<br>\r\nI knew that the kid would have named me anything he wanted but I just wanted to keep this name so that no matter what I would always remember my dad. So I said, “Yes I want to keep my name. But how? Humans don’t understand us.”<br>\r\n“Do you know that physic types can talk to their trainer using telepath? I can get one in here and make it so you two can have a little talk.”<br>\r\nI look up at the kid to find he is looking down at me smiling. He then put his hand down on my head and started to pet me. “Yes I would.”<br>\r\n“Okay I’ll be back in a moment,” and Belle looked up at Nurse Joy and pointed to the clip board she was holding. Nurse Joy looked at it and shook her head yes.<br>\r\n“Oh she wants to have a talk with him. Okay let me see if I can get James in here.” They both now walked out of the room leaving me and him alone again.<br>\r\n“Who is James?” the kid asked.<br>\r\nI shrugged my shoulders letting him know I have no idea either.<br>\r\n“Well I guess I should introduce myself to my first Pokémon, I’m Tom.”<br>\r\nI looked at him confused and saw his bell that had the strange balls on them, (Pokeballs.)<br>\r\n“Oh you’re wondering about the Maril. Well he was my dad’s Pokémon and he let me borrow his Pokémon so I could catch my first.” Tom said with a smile.<br>\r\nI smiled and walked up into his lap and laid there showing him I trusted him.<br>\r\n“Now you need a name. Hmmm how about…” Tom said.<br>\r\n“No I have a name.” I said although he didn’t understand me.<br>\r\n“You don’t want a name?”<br>\r\nI shook my head and saw that Belle and Nurse Joy have come back with an Abra.<br>\r\n“Sorry it took so long.” Nurse Joy said.<br>\r\nTom said, “It’s okay but what’s with the Abra?”<br>\r\n<b>Well I’m James and I was told that your Growlithe wanted to talk with you.</b><br>\r\nMe and Tom were shocked this Abra just told us both what he was doing here and we both understood him. Tom yelled, “That’s so cool. Where can I catch an Abra?!?!”<br>\r\n<b>Well we’re hard to catch since we’re very shy and teleport way from anyone we come in contact with. Anyway I’m here so both you and your Growlithe can talk.</b><br>\r\n“Wait does everyone get this treatment?” Tom asked.<br>\r\n“Well no not really. Unless the Pokémon wishes to talk with their train we don’t really do this.” Nurse Joy informed us.<br>\r\n“You wanted to talk with me?” Tom asked me.<br>\r\n“Yes I would.” I said. Then James did something strange. He grabbed me by the throat and made me float in mid air. Then I felt my throat catch on fire and then I feel right back on the bed. I looked right at James ready to kill him when I saw he fell to the ground and started to pant.<br>\r\n“Why did you do that?!?!” I yelled at the James.<br>\r\nTom gasped as he heard me and I was far too angry to realize that I now spoke human, (English.)<br>\r\n<b>I……  made it…….. so that when…… you talk you…… spoke English.</b><br>\r\nI was about to look at Tom when he grabbed me and hugged me. “Oh thank you James. Thank you.” Tom said. He then looked under the chair and pulled out a bag, after putting me down on the bed again. He then pulled out an Oran berry, (A berry that heals a Pokémon that eats It.) and hand it to the James. James ate it and stood right back up and bowed in thanks for the berry.<br>\r\n“We’ll leave you two alone so you can talk for a bit.” Nurse Joy informed us.<br>\r\nI looked at James and Belle and said, “Thank you.”<br>\r\n“Don’t thank me thank James he’s the one that did it.” Belle informed me.<br>\r\n<b>No thanks are needed. I like to help when I’m needed.</b> And with that they walked out.<br>\r\n“So now back to your name.” Tom said.<br>\r\n“It’s Rosa I would like to keep it so I can remember my past.” I said a little surprised to hear my ‘new’ voice. It was feminine and a little childish as if I wasn’t a pup anymore but I still had some room to grow.<br>\r\n“That’s a nice name.” Tom said as he petted my head. “Is there anything else I should know before we leave?”<br>\r\n“That I don’t want to evolve into an Arcanine. I don’t like the idea just yet. I also…. Like being scratched behind the ears.” I say with a faint blush. HE then scratches there and I was enjoying myself. It felt so nice that I ran up his lap and jumped on to his shoulder.<br>\r\n“What are you doing?” Tom asked me.<br>\r\n“I’m just trying to find your favorite place to be scratched.” I answer him scratching his back with my paws. I was careful not to scratch him with my claws but for him to feel my paws on his back.<br>\r\n“A little to the left.” He instructed me and I reply. He gave a nice long sign before picking me up. “Okay well since I didn’t catch you in a pokeball I might as well get it over with.” He raised a pokeball in the air in front of me.<br>\r\nI had one thing to ask him before he did truly catch me. “Can I not stay in the pokeball?”<br>\r\nHe tossed it softly over my head and said “Sure,” and with that I felt my body start to feel strange. It started to feel like my legs very weak and my body was turning into a ditto, (Basically she felt like jell-o.) Then I felt it all start to flow into the pokeball over me and start to fill it in. I closed my eyes not sure what it be like in that tiny thing, (Pokeball is about 5 inches all around, not too big.) I open my eyes when I fell myself stop flowing and I was it was much roomier then I imagined it would be. Some room to move my legs and curl up to sleep in. Then I felt the whole thing shack side to side for a couple times before I heard a ding.<br>\r\n</span></div></div>",
            "created":1300770000,
            "id":1074524,
            "title":"A whole new life"
        },
        "112111111":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "They go and start their pokemon Adventures ",
                "Tom goes home to tell his parents"
            ],
            "content":"<div class=\"\"><div> <span>          Thinking all the shacking was over I then fell the whole ball lift up and being thrown at one direction. That’s when I see light again and the whole felling like jell-o and being pulled to one spot felling is over, again, I see Tom walk over to me and pick me up and hold me in his arm.<br>\r\n          “Thanks for releasing me.” I said.<br>\r\n          “No problem. I would like to carry you around and show you off a little.” Tom said as he walked up front to Nurse Joy and Belle. “Thank you again.”<br>\r\n          “No problem it’s our job to help you guys out.” Nurse Joy said.<br>\r\n          “And if you guys can come by once and a while to tell us your stories about your adventures then that is more than enough payment for us.” Belle said.<br>\r\n          “Will do.” I answer back. “One question though why don’t you have James make it so you can talk too?”<br>\r\n          “Because it puts a lot of abuse on him and it hurts me to see him or anyone in pain.”<br>\r\n          I then remember how he was panting and I said, “Okay but would it always hurt him if he does that?”<br>\r\n          “No, see his been training to use that power and from when he first started to use it he has had come a lot fur having control over his powers.” Belle said with a smile.<br>\r\n          “Nice maybe one day when we come back we can have a battle with him.”<br>\r\n          <b>I would like that.</b> James told us. We looked around but he wasn’t here. <b>Sorry I’m with another patient right now but I would like to have a battle with you guys sometime.</b><br>\r\n          “Alright then when we beat each gym will come back here with a new story and hopefully a new team mate.” Tom said. “Maybe even more.”<br>\r\n          I smiled because now I had a new life ahead of me. One that didn’t have me working everyday for my life but maybe once and a while. No one makes fun of me because of my rarity. If anything I get to make more friends because of the newest one I have just made. Maybe Tom catching wasn’t such a bad thing after all.<br>\r\n</span></div></div>",
            "created":1301893200,
            "id":1081798,
            "title":"Sorry the past chapter was a little too long"
        },
        "1121111112":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Continue good",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>          As we left the Poke Center I was what seemed to be a town. (Her pack has traveled near them enough to know what they are but not what’s in them.) I seemed to be such a weird place. There were people walking along not even paying attention to each other. There were some kids playing with their Pokémon. A young girl, about five years old, was playing tag with her Bulbasaur, while a boy, about fifteen, was having a fight with his Hitmonchan in the middle of town. Was Tom was walking along  the sidewalk and the boy with his Hitmonchan saw us, “Hey where do you think you’re going, kid?”<br>\r\n          “Home to tell my parents I’m starting my journey today. I already caught a Growlithe using my dad’s Maril.” Tom said raising me up into the other boy’s face. I had a better look at him and saw that there was nothing about him that seemed nice. He looked like just the average angry man would be. His face was as if it was sculpted out of stone but instead of being warm feeling it gave me a chill. I guess it’s a bad omen. He was incredibly fit for his age compared to others I’ve seen. He had blue eyes that looked like the sea but during a storm. In general he creeped me out.<br>\r\n          “How about a Pokémon battle my Hitmonchan versus your Growlithe?” the boy said with a small snicker.<br>\r\n          “Sure, do you mind Rosa?” Tom asked me. I wasn’t sure what the other boy wanted from this fight but hey I may as well get Tom his first true win with her. Instead of talking I shook my head up and down showing I was ready.<br>\r\n          “Alright now you know the true rules of a Pokémon battle kid? The one where if you lost you have to give the losing Pokémon to your opponent.” He said with a snicker wide across his face.<br>\r\n          Me nor Tom could believe this he tricked us and made us bet me versus and the Hitmonchan to see who would win. Tom was in shock and didn’t believe what he heard. “No I won’t bet Rosa I….”<br>\r\n          “Too bad you agreed and if you forfeit I still get her. One way or another she’s mine.”<br>\r\n          <b>“Don’t worry I hate Chad’s guts I won’t let him win,”</b> said the Hitmonchan.<br>\r\n          I shook my head showing I understood and was also ready to fight. “Looks like your Pokémon is more than ready to be mine.” Chad said in a cold voice.<br>\r\n          “Are you sure about this Rosa?’ Tom asked me. I shook my head showing I was more than ready. “Alright then.”<br>\r\n          “Ready?” Chad said.<br>\r\n          “Ready.” Tom said with a little doubt in his voice.<br>\r\n<b>“I may let you win but don’t think I’ll go out without a fight.” </b>Hitmonchan said with a smile. I smiled back at him. I’m not sure how to turn off my Pokémon to human translation James gave me.<br>\r\n“Hitmonchan use FOUCUSE PUNCH.” Chad said. Hitmonchan ran at me with his right fist glowing and ready to strike me.<br>\r\n          “Rosa dogde and use FLAMETHROWER.” I jumpedto his left making it so he had to turn more if he wanted to hit me and I unleashed the strongest FLAMETHROWER I’ve done in my life. Hitmonchan was put out on Chad’s word of ‘Go’. I looked at him thinking he was faking. I took a step close to check and he was out. I looked back at Chad and he was speechless. His face said it all. He was angry that Hitmonchan lost but then he let out a big sighed.<br>\r\n          “Looks like this pathetic runt is all yours kid.” Chad said tossing Tom Hitmonchan’s poke ball to him. The kid walked away as if nothing happened. If we meet him again I would love to hit him across his face with a good solid kick. I turned to Tom and he smiled at me. He returned Hitmonchan back to his poke ball and picked me up again.<br>\r\n          “Looks like we have a new member to the team.” Tom said as he put Hitmonchan’s ball on his belt. The belt looked like it had a falcon claw on it that grabbed the ball and held it there. First time I saw what a trainer’s belt looked like. It was weird but nice to know about it.<br>\r\n          “I know but was it me or did Chad give you the creeps too?” I asked.<br>\r\n          “I know he always give me chills just looking at him. If we run into him again it would be too soon.” And with that we walked to Tom’s house. It was nothing special from any other house other then the fact he lived in it. A one story tall, white paint, just a plain house that you don’t think too much about. As Tom walked in we heard two people talking, probably Tom’s parents. He can’t hear them but I could.<br>\r\n          “Look I think he’s a little too young to become a Pokémon trainer.” said a feminine voice probably his mom.<br>\r\n          “Well he needs to go out and explore a little don’t you remember when we did that? In fact isn’t that how we came to be a couple?” said a deeper voice sounding male. Most likely his dad.<br>\r\n          As I was listening I then heard Tom yell, “Mom, Dad I’m home and I have some good news!!” Tom was so happy he could hardly contain himself. It was far too easy to read on his face.<br>\r\n          “What is it dear?” Tom’s mom asked as she walked into the room we were in.<br>\r\n          “I caught my first Pokémon using dad’s!” Tom said with a big smile on his face as he put me on the ground.<br>\r\n          “You did! Wait how did you get my Pokémon?”<br>\r\n          “I…uh found them in a drawer and I asked dad if I could play with his Pokémon. He said okay so I took Maril and went into the woods. Then….” Tom said looking at the ground.<br>\r\n          “You stole my Pokémon?!?! Why would you do that?!” Tom’s dad yelled.<br>\r\n          “So I could show I’m ready to become a trainer!” Tom said still trying to stand tall even though he was doing a bad job. The parents exchanged glances and then looked at Tom again.<br>\r\n          “What have we told you? You can’t take our Pokémon without permission. You know that.” Tom’s mom said. I didn’t want Tom to think he was alone so I walked over to him sat on his foot so he know I stood right next to him. I looked at Tom’s parents and they smiled seeing what I’ve done. “We’ll talk about your punishment later. Right now I think it would e best if me and your dad had a talk.”<br>\r\n          “But mom you know Chad?” Tom asked.<br>\r\n          “The kid that bully’s everyone?” Tom’s dad asked.<br>\r\n          “Yes me and Rosa,” he said and pointed at me to let his parents know that was my name,” won against his Hitmonchan and he gave him to us. Look.” Tom then took the ball Hitmonchan was in and threw it into the air. He popped up right next to Tom and stood just a tall as Tom too.<br>\r\n          <b>“*Yawn* that was a good nap.” </b>Hitmonchan said stretching a bit.<br>\r\n          “You did?” they both asked.<br>\r\n          “Yes we did.” I said with a smile. I then saw that not just Tom’s parents looked at me funny but so did the Hitmonchan.<br>\r\n          “She can talk?!” Tom’s mom asked.<br>\r\n          “Yes long story short we were at the Pokémon center and an Abra gave me the power to talk English.” I said with a smile.<br>\r\n          “We are so going to have a talk about this later.” Tom’s mom said. “Right now though is that I want the three of you to go into your room and relax. It’s been a big day and it’s about six o clock. I’ll have dinner made and that’s when we talk about this. Okay?”</span></div></div>",
            "created":1301893200,
            "id":1081820,
            "title":"A Whole New Adventure"
        },
        "11211111121":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Dinner they tell Tom he can Begn his journey",
                "Their still not sure if should and he runs away"
            ],
            "content":"<div class=\"\"><div> <span>          Okay mom.” Tom said as we all started to walk in Tom’s room. As we walked in this room I took notice that there was a bed in the corner of the room with a strange box next to it. (T.V.) The ground had some weird feeling to it. It was blue but felt like soft grass. (Carpet.) There was a window on the wall and the walls were sky blue. (The average kids room only without the mess of toys.) The three of us sat on Tom’s bed and then sighed. It felt good to sit down and think about what had happened today. As I was about to think about today’s adventures my thoughts were interrupted by Hitmonchan.<br>\r\n          <b>“So you can speak English?”</b><br>\r\n          “Yes why?” I asked. Tom was sitting to my left and Hitmonchan to my right. He was watching us talk. I know he doesn’t understand what Hitmonchan was talking about so if asked I’m sure I would be the translator for him.<br>\r\n          “<b>Can you tell the kid my name’s Roy for me?”</b> Roy said with a sound of hope in his voice.<br>\r\n          “Sure anything else?”<br>\r\n          <b>“Nothing else except thanks for getting me away from Chad.”</b><br>\r\n          I looked at Tom knowing he wanted in. “Roy,” I said having a paw point to the Hitmonchan, “Said thanks for getting him away from Chad.”<br>\r\n          Tom looked at Roy and smile. “No problem.” He raised his fist to Roy and Roy flinched. “It’s a fist pound. You take your fist and hit mine.” Bad move on Tom’s part because Roy hit the fist a little too hard and shook his hand in pain. “Good, not so hard next time alright?”<br>\r\n          <b>“Sorry”</b> Roy said putting his head down. I was about to tell Tom what he said but Tom know what he said off of his head movement.<br>\r\n          “It’s okay your learning.” Tom said. “I would think Chad treats his Pokémon better then people but it looks like I was wrong.” Tom said that with a sigh. From past memories I guess. “Don’t worry I’ll never do that to you guys at all. I’ll treat you the same way I want to be treated okay?”<br>\r\n          Roy and I both answer “Yep.”<br>\r\n          “Tom it’s time for diner keep your Pokémon out okay.” Tom’s mom called form the other room.<br>\r\n          “Okay mom.” Tom said. “Let’s go” and with that we walked to the dining room. I was a large room that had a huge table in the middle of it. The table had a turkey on it with all other things I could imagine. I’ve never seen or smelled so good food so close before. I took a glance next to the table and saw a couple of bowls filled with poke blocks. (Food for Pokémon.) I knew that the food was meant for the human’s but I couldn’t stop thinking how good it would taste.<br>\r\n          “Okay well before anything happens I would like to know Rosa what do you and Roy want?” Tom asked us.<br>\r\n          <b>“I’m good with the poke blocks. It’s better then what Chad feed me.”</b><br>\r\n          “What did Chad feed you?” I asked.<br>\r\n          <b>“His scrapes, mostly bones really.”</b> Roy said sadly.<br>\r\n          “Don’t worry, you don’t have to worry about that remember?” I told Roy. He smile and walked to the poke blocks.<br>\r\n          “What he say?” Tom asked.<br>\r\n          \"Uh…. more things he likes about you then Chad. The fact you feed him is another one.” I said noticing Tom’s frown at the fact that Chad didn’t care about his Pokémon. It’s is truly a saddening thought for most but there are those people in the world and it’s just that way sometimes.<br>\r\n          “So what do you want to eat?” Tom asked me. I was in a war be a good Pokémon and eat the poke blocks or ask for some human food. I bit my lip and thought for a bit.<br>\r\n          I sighed and said, “I’ll have the poke blocks.” Tom looked at me confused but didn’t say anything. As I walked over to the poke blocks I noticed that there were bowls full of different ones. Some bowls had red, blue, yellow, orange, and purple poke blocks. As I walked over I saw the same Maril I fought before with a Ditto, Raichu, and a Charizard. They all walked over to the bowls and all sat down. Roy and I walked over closer to the bowls and sat down as well.<br>\r\n          <b>“So little Tomas caught you guys?” </b>the Ditto asked. She had a young gentle voice as if she was about my age. (<br>\r\n          “He caught me and won Roy from a boy named Chad.” I answered.<br>\r\n          <b>“The kid, Chad, does he give you chills just looking at him?” </b>asked the Charizard.<br>\r\n          <b>“He gives everyone the chills. Even his own mom has chills just by looking at him. It’s a real shame.”</b> Roy said.</span></div></div>",
            "created":1301979600,
            "id":1082398,
            "title":"Meet the family's pokemon"
        },
        "112111111211":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Route 1",
                "Route 29"
            ],
            "content":"<div class=\"\"><div> <span>As we began to eat I was listening to Tom and his parents talk. \"Tom you do know that your in trouble for taking my Pokemon without permission right?\" Tom's mom said.<br>\r\n          \"Yes I know it's just that you both started at my age and had your first six by the first week. I was just hoping that I could prove I was capable by catching a Pokemon.\" The parents stared at each other thinking what to do.<br>\r\n<br>\r\n\"We'll talk about your journey tomorrow but for your punishment you shall only start with Rosa.\" his mom said.<br>\r\n<br>\r\n“What? You mean I can start tomorrow?!” Tom said starting to cry.<br>\r\n<br>\r\n“Yes but you won’t have Roy for when you start out. We’ll send Roy with you after about a week. That shall be your punishment.” Tom’s dad said.<br>\r\n<br>\r\n<b>“Well I may not be going with Tom but at least I’m away from Chad.”</b><br>\r\n<br>\r\n“Thank you guys your the best.” Tom said as he got up and hugged both his parents as hard as he could.<br>\r\n<br>\r\n“Your welcome dear now before you need to get some food for both you, Rosa and any other Pokemon you catch. And you need a sleeping bag so you don’t have to sleep on the ground. Also...” Tom’s mom went on telling her son what he’ll need to be safe for when he travels around to different towns and what he may need in case of hard times. The whole dinner went on like this and tom’s dad chuckled. The ditto and charizard also laughed as well.<br>\r\n<br>\r\n“What’s so funny?” I asked the two laughing Pokemon.<br>\r\n<br>\r\nThe charizard spoke first, <b>“May never planned ahead and me, and Carly would be the ones that suffered with her. It’s just funny seeing how much she learned from her first mistakes.”</b><br>\r\n<br>\r\n”How many mistakes?”<br>\r\n<br>\r\n<b>”More then we want to remember.”</b> Carly, the Ditto, giggled.<br>\r\n<br>\r\nAs the evening went on Tom had two backpacks ready for tomorrow. Enough food and water for a month, a sleeping bag, a bag or two of pokeblocks. He also had five types of clothing, what he wore today, something classy, some warm then others and a bathing suit. They gave him twenty pokeballs because of how annoying it is to buy more when there are better types out in the world. Tom then gets everything ready I help him by stuffing his clothes and other stuff in his backpack. Once we were all done and pack it was dark out so we called it a night.<br>\r\n<br>\r\n“Good night Rosa,” Tom said as we got comfortable in his bed.<br>\r\n<br>\r\n“Good night Tom, tomorrow is a big day,” I said before I fell asleep.<br>\r\n<br>\r\n****Next Day****<br>\r\n<br>\r\nI woke up to see Tom waking to his parent’s goodbye as he walked off. I noticed I was in his backpack as he was walking.<br>\r\n<br>\r\n“So Tom were are we going?” I asked hoping that my pack would be close by to say a goodbye to my dad.<br>\r\n<br>\r\n“We’re going...</span></div></div>",
            "created":1309150800,
            "id":1135580,
            "title":"Fixed!!!"
        },
        "1121111112112":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Run in with Chad.",
                "Get there with no problem."
            ],
            "content":"<div class=\"\"><div> <span>“We’re going to route 29,” Tom said with a smile. “It’s the only way out of New Bark town without a Pokémon that knows surf. And I also know that if you look into the trees there might be a Heracross in one, to think to start right after leaving home with a Growlithe and a Heracross. That would be so cool!” Tom is now getting pumped about finding a new team mate.<br>\r\n<br>\r\n“Hey don’t forget that you also will have a Hitmonchan to after a week. So that should be even better,” you say smiling too.<br>\r\n<br>\r\n“I know but hey I’m happy I’m starting it with you though. Just to be able to have someone to talk to and talk back with helps a lot.”<br>\r\n<br>\r\n“Hey we all understand you it’s just that you don’t understand everything we say. Some of you do but don’t understand everything we say.”<br>\r\n<br>\r\n“Oh well it just helps to hear someone’s voice from time to time. But I guess you’re right. Sorry,” Tom said picking me up.<br>\r\n<br>\r\n“Hey why did you do that?” I asked looking up at him.<br>\r\n<br>\r\n“This is how I’m going to show how sorry I am, and if ever disappoint you tell me and I’ll give you an ear scratch.”<br>\r\n<br>\r\n“Oh no, picking me up without telling me makes me so sad,” I said sarcastically.<br>\r\n<br>\r\n“Oh then let me fix that,” Tom said putting his hand on my ear and scratching me into please. By the time I looked up I noticed we were in Route 29. “We’re here Rosa.”<br>\r\n<br>\r\n“Cool now how are we going to get a Heracross down?” I asked looking on the trees to try and find one.<br>\r\n<br>\r\n“There are a few ways to get them down. One is to climb up and pull them down. Second is to make a Pokémon use headbutt on the tree. But my favorite one is the honey trick.”<br>\r\n<br>\r\n“The honey… oh rubbing honey on the tree low enough to make them climb down and fight. Do you have any?”<br>\r\n<br>\r\n“Sadly I don’t have any and I heard that if a Pokémon uses headbutt too much they might get mental damage so I better start climbing. Want a lift?” Nodding my head we, well Tom, start climbing the tree and there was no Heracross there. “Uh I guess we’ll just have to try and climb another treeeeee!!” Tom yelled as we strated to fall out of the tree.<br>\r\n<br>\r\nI looked around and saw a blue blur fly fight into us and landed us on the ground. <b>“I can’t believe you two were so stupid to try and climb a tree to get a Pokémon! I mean honestly what type of Pokémon is worth the risk of your life. Let me answer that for you. NONE!”</b> the female Heracross yelled.<br>\r\n<br>\r\n“Sorry about that it’s just that we don’t have honey and I don’t know how to use headbutt without hurting myself so Tom thought it would have been a good idea to climb the tree and see if we couldn’t find a Heracross,” I informed her.<br>\r\n<br>\r\n<b>“You were looking for a Heracross? Why try something that dangerous? Oh I’m Jackie,”</b> she said holding out her hand.<br>\r\n<br>\r\n“I’m Rosa and this is my train Tom,” I said pointing at Tom, who just sat there and let us talked.<br>\r\n<br>\r\n“Um yeah thanks for the save and we’re sorry about busting your wing,” Tom said to Jackie.<br>\r\n<br>\r\n“Oh my Arceus! I’m sorry Jackie; I didn’t notice your wing oh…”<br>\r\n<br>\r\n<b>“Oh, its okay, I’m just going to have to walk everywhere for a bit. But uh can you guys take me to a PokeCenter to see if Bell can heal me up?”</b><br>\r\n<br>\r\n“You know Bell?” I asked.<br>\r\n<br>\r\n<b>“Of course! All Pokémon that stay in one region know where the PokeCenters are and the Chanseys that work there. Since I’ve seen Arcanines and Growlithes wondering here and there I guess I can understand why you wouldn’t know that,”</b> Jackie said standing up.<br>\r\n<br>\r\n“Okay well take you there on one condition, you must join our group,” I said taking a pokeball of Tom’s belt and in front of Jackie. “The choice is yours.” She looked at the pokeball and at you two and down again.<br>\r\n<br>\r\n<b>“Will he let me walk around like you do?”</b><br>\r\n<br>\r\n I repeated the conversation to Tom and he respond, “Of course but you’ll have to be in it until we get to the PokeCenter and then you’re aloud to do whatever you want,” and with that Jackie touched the ball and went right in. “Okay now let’s hurry, I don’t want to keep her waiting any longer then needed.”</span></div></div>",
            "created":1317358800,
            "id":1197891,
            "title":"Jackie"
        },
        "11211111121122":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "You Teleported!",
                "Didn't work."
            ],
            "content":"<div class=\"\"><div> <span>As we hurry up to the Pokecenter no Pokémon attacked us, partly because fire versus bug is useless and the Pidgeys all flying in the sky so no worries from them. As we reached Cherrygrove City Tom saw his old friends, “Rick, Sam!” Both kids turned and saw Tom running at them.<br>\r\n<br>\r\n“Tom where are you going?” said the girl. She is about as tall as Tom but she had light blue hair tied in pigtails. Her eyes are a lighter pair of blue. She has a white shirt with a black leather coat over it, a red bow sticking out under her collar. She is warring navy blue skirt under with long black leg socks going down into her shoes. It seemed that she wants to stick out from the crowd and have a good look to her as well.<br>\r\n<br>\r\n“Is that a shiny Growlithe?!” The boy said. He is taller than Tom by a head or more. He has black hair and dark brown eyes. A look that made him looks like the average teenager, nothing too special about him other than his height.<br>\r\n<br>\r\n“Yeah hey can you guys meet us at the Pokecenter?” Tom said jogging by,<br>\r\n<br>\r\n“Sure,” they both said and followed. A moment or two later we all arrive at the Pokecenter. Tom hands Jackie to Nurse Joy and turns to his friends. “So are you going to tell us how you got a shiny Growlithe?” the boy said.<br>\r\n<br>\r\n“Simple isn’t it?” I said. “He beat me in a fight so I became his Pokémon.” Both now look at me astonished that I said that. “Would you like to explain it to them as I find Bell,” remembering he doesn’t know who Bell is, “the Chansey.”<br>\r\n<br>\r\n“Okay have fun,” Tom said as I jumped out of his hands. Looking around I see Bell and James together talk.<br>\r\n<br>\r\n<b>“Rosa!”</b> they say running up to you. The three of us shared a hug for a moment. <b>“So Rosa, what are you doing back here?”</b> Bell asked. Telling them what has happen with Chad, winning with one hit getting Roy to Jackie’s condition. <b>”You should know better than climbing up trees!!” Bell yelled hitting me on the head with a MEGA FIST on me.<br>\r\n<br>\r\n“OUCH! I thought Chanseys healed others not hurt them?!” I yelled rubbing my head.<br>\r\n<br>\r\n<b>“Because everyone knows this. EVERYONE! You could have killed yourself and trainer. You should know better than that,”</b> Bell said.<br>\r\n<br>\r\n<b>”Well Bell, some trainer are able to climb trees. So I wouldn’t yell at Rosa like that,”</b> James said. <b>”By the way, where is your trainer?” </b><br>\r\n<br>\r\n“He’s talking to some friends of his I just wanted to talk and see if James was strong enough to use that ability on Jackie,” I said.<br>\r\n<br>\r\n<b>“I might be able to,”</b> James said, <b>“I do have the strength and it would be good training too.”<br>\r\n<br>\r\n<b>“Fine James you can but just be careful okay?”</b> Bell said.<br>\r\n<br>\r\n“Be careful?” I asked.<br>\r\n<br>\r\n<b> “James and give more than the ability to talk to their trainers. He can give some of his psychic powers too. That though hurts him to the point where he’ll be on life support. With you he did a little extra but we’re not sure what though,” </b>Bell said.<br>\r\n<br>\r\n<b>”Best you can have Rosa is teleporting the least is most likely being able to use telekinesis, nothing more or less. But if you do have teleporting I will warn you, think to where you want to teleport beforehand. Because when first teleporting you might teleport to your old group,”</b> James said.<br>\r\n<br>\r\n“Oh I’ll won’t try and teleport unless I have someone trained to help me,” I said. “Uh, James can you teach me?” Nodding I then thought of where teleporting to Tom and his friends and…</b></b></span></div></div>",
            "created":1319432400,
            "id":1212014,
            "title":"Old Friends"
        },
        "112111111211221":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Go with them",
                "Stay and wait for Jackie"
            ],
            "content":"<div class=\"\"><div> <span>I look up and I see Tom and his friends talking to each other. I look next to me and I see James next to me.<br>\r\n<br>\r\n“OH MY ARCEUS!” I yelled in excitement.<br>\r\n<br>\r\n“What Rosa?” Tom said looking at me.<br>\r\n<br>\r\n“Watch!” I said thinking of being on Tom’s shoulder and Boom I was there.<br>\r\n<br>\r\n“Wait! How did you do that?!” Tom asked,”<br>\r\n<br>\r\n<b>“When James used his power he gave me a little more then he thought,”</b> I told Tom using telekinesis.<br>\r\n<br>\r\n“Wow that is cool, thank you James,” Tom said shacking his hands.<br>\r\n<br>\r\n<b>”No problem, to be honest it was an accident but I can’t take it back now,”</b> James asaid rubbing his head. <b>“I hear you have a new Pokémon, wish for me to teach her the how to speak too?”</b><br>\r\n<br>\r\n“It won’t drain you like last time right?” James nodded. “Alright I would like Rosa to ask her first, just to make sure she wants to,” Tom said<br>\r\n<br>\r\n“She’s in room 5-21,” Nurse Joy said.<br>\r\n<br>\r\n“Thanks” we all said and like that I teleported into the hallway. <i>Okay now room 5-3, 5-5.</i> Once I find the room I go in and see Jackie napping in the center of it. <i>I’m going to take a Meowth nap with her.</i> And I jump on bed and join her in dream land.<br>\r\n<br>\r\n<i><u>In Jackie’s Dream</u></i><br>\r\n<br>\r\nAs I look around I notice that this is dream isn’t mine for a lot of reasons. First, there was hundreds beyond hundreds of honey everywhere. Second Jackie was swimming around in it, and finally I was sort of in a bubble that separated from the rest of the dream. I popped it and landed right next to Jackie.<br>\r\n<br>\r\n“Rosa!? What are you doing in my dream?” Jackie asked still swimming in the honey.<br>\r\n<br>\r\n“I…I don’t know? One minute I was sleeping next to you. Next minute I’m here,” I say swimming next to her. “Oh and I have two psychic moves, telekinesis, and teleporting.”<br>\r\n<br>\r\n“Cool, hey is the Abra going make it so I can speak human?” Jackie asked as we started to float there.<br>\r\n<br>\r\n“If you want to, you have a say in it.”<br>\r\n<br>\r\n“Well to be honest I don’t want it. I uh, I have a hard time watching what I say. I don’t want to curse someone out on “accident”,” Jackie said eating some of the honey.<br>\r\n<br>\r\n“Okay I understand, so is this your perfect dream world or does it get better?”<br>\r\n<br>\r\n“Oh honey, you haven’t seen nothing yet,” and like that the honey then turned into a large medieval castle, still made of honey, “Want a look inside?”<br>\r\n<br>\r\n“Sure,” I say swim next to her as we enter the castle.<br>\r\n<br>\r\n<i><u>Reality </u></i><br>\r\n<br>\r\n*Yawn*“That was a great dream,” I said as Jackie starts to stir.<br>\r\n<br>\r\n<b> “Good she gone. *Snore* time for ….. fun.”</b> Jackie said turning over. <i> Okay next thing I ask her is her age, Dittos as maids, and/or butlers. </i><br>\r\n<br>\r\nThe door starts to open and Tom and his friends are now walking in. “You know Rosa I’m not going to get used to you teleporting everywhere, and I hear when a Growlithe gets energetic they jump all over, now teleporting,” he started to shiver a little.<br>\r\n<br>\r\n“I don’t get hyper easily so no worries, but I must say I’m going to be enjoy this for a while,” I say teleporting onto Tom’s shoulder.<br>\r\n<br>\r\n“So Tom, are you going to introduce us?” the girl said.”<br>\r\n<br>\r\n“Oh yea, Rosa this is Luna, and this is Kyle, my friends.” Tom said. “Kyle, Luna, this is Rosa my first Pokémon.”<br>\r\n<br>\r\n“Nice to meet you two, I hope he told you how we meet.”<br>\r\n<br>\r\n“Yea he did,” Luna said giving me a handshake.<br>\r\n<br>\r\n“Strange I didn’t think an Abra could do that,” Kyle said shaking my paw.<br>\r\n<br>\r\n“I didn’t either, but I must say I’m very thankful to James because of this,” I say looking around for James, “Where is he anyway?”<br>\r\n<br>\r\n<b>“Oh, James read her mind while we were walking and he smiled before teleporting away,”</b> Bell said.<br>\r\n<br>\r\n“Oh okay well she’s still asleep,” I say looking over at Jackie is mumbling something.<br>\r\n<br>\r\n<b>“Well her wounds will heal in an hour or so she should be good.”</b> Repeating what Bell said made Tom smile.<br>\r\n<br>\r\n“So you guys heading out on your journeys soon?” Tom asked.<br>\r\n<br>\r\n“Actually Tom,” Luna said, “My dad let me start about a week ago, I was just waiting for you.”<br>\r\n<br>\r\n“Yeah Tom my Grandfather gave me his baby Aerodactyl two days ago,” Kyle said.<br>\r\n<br>\r\n“Wait, what’s an Aerodactyl?” I asked.<br>\r\n<br>\r\n“An ancient Pokémon that should be extinct, but there are some scientist that can bring fossils back to life. In fact there are now over two hundred Aerodactyls in the world right now,” Kyle said.<br>\r\n<br>\r\n“So once Jackie’s healed we all set out like the old days?” Tom asked<br>\r\n<br>\r\n“No, better now that we can learn how to talk to our Pokémon,” Luna smiled.<br>\r\n<br>\r\n“Huh?”<br>\r\n<br>\r\n<b>”James’s powers can make it so that trainers can understand pokemon too, the difference is that they can turn it off we can’t, that’s another reason why I don’t want it.” </b> Bell said writing on her clip border.<br>\r\n<br>\r\n“He offered it to them? Won’t that hurt to teach them all at once?” I asked afraid of James health.<br>\r\n<br>\r\n<b>“Not really it takes less energy for them to learn then us, for ome reason,” </b>Bell shrugged.<br>\r\n<br>\r\n“Okay well then, when are you guys getting the treatment?” I asked, happy not having to be a translator for anyone.<br>\r\n<br>\r\n“When she wakes up, but seeing on how we have an hour, we’ll go find him,” Tom said, and then he and his friends left the room.<br>\r\n<br>\r\n“What else happened while you guys walked to here?” I asked.<br>\r\n<br>\r\n<b>“Nothing James just mentioned that and Tom talked about what you guys were going to do.\"</b><br>\r\n</span></div></div>",
            "created":1319691600,
            "id":1213667,
            "title":"The Teleporting Growithe"
        },
        "112112":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Charmander?</span></div></span></div>",
            "created":1310792400,
            "id":1148840,
            "title":"Charmander"
        },
        "1121122":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is Vulpix gold</span></div></span></div>",
            "created":1315544400,
            "id":1183905,
            "title":"Vulpix"
        },
        "1122":{
            "choices":[
                "basic",
                "stage one",
                "stage two"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a basic, stage one, or stage two</span></div></span></div>",
            "created":1306213200,
            "id":1111978,
            "title":"Water"
        },
        "11221":{
            "choices":[
                "squirtle",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Pokemon are you?</span></div></span></div>",
            "created":1306213200,
            "id":1111979,
            "title":"Squirtle"
        },
        "112212":{
            "choices":[
                "Totodile",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> do i really need anything here?</span></div></span></div>",
            "created":1306213200,
            "id":1111982,
            "title":"Totodile"
        },
        "1122122":{
            "choices":[
                "mudkip",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>to many pokemon...</span></div></span></div>",
            "created":1306213200,
            "id":1111983,
            "title":"Mudkip"
        },
        "11221222":{
            "choices":[
                "piplup",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>                                           </span></div></span></div>",
            "created":1306213200,
            "id":1111985,
            "title":"other"
        },
        "112212222":{
            "choices":[
                "oshawott",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>                                                    </span></div></span></div>",
            "created":1306213200,
            "id":1111986,
            "title":"other"
        },
        "1122122222":{
            "choices":[
                "Magickarp",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>just kill me</span></div></span></div>",
            "created":1306213200,
            "id":1111987,
            "title":"other"
        },
        "11221222222":{
            "choices":[
                "Psyduck",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>no really please</span></div></span></div>",
            "created":1306213200,
            "id":1111988,
            "title":"other"
        },
        "112212222221":{
            "choices":[
                "real story",
                "hurrdurr"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you lose  </span></div></span></div>",
            "created":1306213200,
            "id":1111989,
            "title":"Psyduck"
        },
        "1122122222212":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>www.hurr-durr.com<br>\r\nhave fun<br>\r\n<br>\r\nIf you go to the website please tell Chatzoo.</span></div></span></div>",
            "created":1306213200,
            "id":1111990,
            "title":"hurrdurr"
        },
        "112212222222":{
            "choices":[
                "poliwag",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>                           </span></div></span></div>",
            "created":1306213200,
            "id":1112173,
            "title":"other"
        },
        "1122122222222":{
            "choices":[
                "tentacool",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>                               </span></div></span></div>",
            "created":1306213200,
            "id":1112174,
            "title":"other"
        },
        "11221222222222":{
            "choices":[
                "slowpoke",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>                 </span></div></span></div>",
            "created":1306213200,
            "id":1112175,
            "title":"other"
        },
        "112212222222222":{
            "choices":[
                "seel",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>to many water types like for real</span></div></span></div>",
            "created":1306213200,
            "id":1112177,
            "title":"other"
        },
        "1122122222222222":{
            "choices":[
                "shellder",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you really like just one water type? </span></div></span></div>",
            "created":1306213200,
            "id":1112179,
            "title":"other"
        },
        "11221222222222222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Krabby",
                "other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chatzoois righthis list is so long</span></div></span></div>",
            "created":1307336400,
            "id":1120919,
            "title":"Krabby?"
        },
        "112212222222222222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shellder? </span></div></span></div>",
            "created":1308114000,
            "id":1126550,
            "title":"other."
        },
        "1122122222222222222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Horsea?    </span></div></span></div>",
            "created":1308114000,
            "id":1126551,
            "title":"Other"
        },
        "11221222222222222222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Goldeen?<br>\r\n</span></div></span></div>",
            "created":1308114000,
            "id":1126553,
            "title":"Other"
        },
        "112212222222222222222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lapras?<br>\r\n<br>\r\nSorry but until I can finish this list thats it.</span></div></span></div>",
            "created":1308114000,
            "id":1126554,
            "title":"Last one"
        },
        "1123":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Grass",
                "Electric",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Grass, electric, or others?</span></div></span></div>",
            "created":1306213200,
            "id":1111907,
            "title":"Try this"
        },
        "11232":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "pichu/pikachu/raichu",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what pokemon are you</span></div></span></div>",
            "created":1348894800,
            "id":1437262,
            "title":"Electric"
        },
        "112321":{
            "choices":[
                "You're a Pichu",
                "Choices for a Pikachu/Raichu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So Senor? (Don't know if spelled correct or incorrect)</span></div></span></div>",
            "created":1349240400,
            "id":1439530,
            "title":"pichu/pikachu/raichu"
        },
        "11233":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "pyshic yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To move things with your mind!!</span></div></span></div>",
            "created":1307941200,
            "id":1124941,
            "title":"Others"
        },
        "112331":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "Shiny latias",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I wanna know if you are a Elegant Beautiful Shiny Latias?</span></div></span></div>",
            "created":1357724880,
            "id":1504921,
            "title":"pyshic yes"
        },
        "1123311":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>All your life people called you weirdo, monster, and a bunch of other names because of this you don't really talk much even to mom and dad as they are worried one day you go up to them and say \"Mom Dad why am I a golden color instead of red?\" they sigh and mom speaks up \"Honey there isn't anything wrong with you you are just really special because you a shiny latias.\" \"So I'm not a freak or a weirdo?\" \"Where did you here that?\" \"All the other pokemon tease me because of this.\" As you lay on the ground and sigh you then get up go hug mom and dad and say \"Can I go on an adventure by myself I'm 16?\" They think before saying sure we trust you and you might find an understanding trainer. \"Thanks mom and dad I'll miss you and I'll try to come see you sometime.\" as you head into the woods you come upon a trail you follow it to a town there you see tons of kids and trainers but this one was good with dragons and caught your eye.<br>\r\n<br>\r\nWhat gender was the trainer?</span></div></div>",
            "created":1357725660,
            "id":1504923,
            "title":"Shiny latias"
        },
        "11233112":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "Yes Iris",
                "No someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it Iris the dragon master in training?</span></div></span></div>",
            "created":1357725960,
            "id":1504924,
            "title":"Female"
        },
        "112331121":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "Sure",
                "Sure but you must prove yourself"
            ],
            "content":"<div class=\"\"><div> <span>As you turn invisable you fly over to the girl with the axew and the dragonite as you get closer the dragonite seems like it sees you and distrusts you you sigh at this you fly over to the young trainer and become visable instantly startling her as she tells dragonite Ice beam he does but you are way too fast for him. \"Please stop attacking me\" \"Dragonite stop\" he does but keeps his guard up still weary of trusting you as she pulls out her pokedex it says latias the eon pokemon data... But she says \"Your gold not red are you sick?\" \"No I'm a shiny pokemon.\"<br>\r\n<br>\r\n\"Shiny pokemon?\" \"Yes I don't know what causes it but I am even more rare than a latias since I'm shiny.\" \"I see so why did you come to me?\" \"I seen you are good with dragon types.\" \"Yesh so?\" \"I wanted to know ificouldjoinyou?\" \"what?\" \"I wanted to know if I could join you? \"Wait you want to join my team?\" \"Axew Dragonite what do you think axew says yes dragonite doesn't really trust me. <br>\r\n<br>\r\n\"Dragonite why don't you trust her?\" \"it's ok I understand a new pokemon out of nowhere is hard to trust I agree still though he should at least give me the chance to be trusted.\" \"Yeah dragonite give her a chance\" \"He says fine.\"<br>\r\n<br>\r\n\"So can I join the team?\"</span></div></div>",
            "created":1357727040,
            "id":1504928,
            "title":"Yes Iris"
        },
        "1123311211":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "Practice battle dragonite",
                "Practice battle axew"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure you can join the team I would love to have a rare pokemon such as you in my team.\" \"Thank you ummmm...\" \"The names Iris.\" \"Thank you Iris. I appreciate your understanding.\" \"Lets get back to training being a gym leader isn't easy I suspect it would be very stressful.\" \"Thats why we always get a little time off. To rest our minds we don't have to be back for three days.\"<br>\r\n<br>\r\nNow back to training as she remembers \"Oops forgot to catch you...\" As she pulls out a pokeball she says \"K Latias come here.\" you fly over expecting her to through it at you, but she taps you on the head and you are sucked in the thing rolls around a few times before you hear a click sound. You soon are pulled out of it.<br>\r\n<br>\r\nWhat happens next? </span></div></div>",
            "created":1371553320,
            "id":1612978,
            "title":"Sure"
        },
        "1123312":{
            "author_id":"wizard0209",
            "author_name":"wizard0209",
            "choices":[
                "YES!",
                "no!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Don't want to play as a legendary perhaps? that's fine, how about an espeon instead?</span></div></span></div>",
            "created":1541545260,
            "id":2574116,
            "title":"How about an espeon?"
        },
        "112332":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To freeze your oppents?</span></div></span></div>",
            "created":1307941200,
            "id":1124942,
            "title":"Ice"
        },
        "1123322":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "FINALLY",
                "nah "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>normal types?</span></div></span></div>",
            "created":1348894800,
            "id":1437266,
            "title":"normal"
        },
        "11233221":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "yes yes yes yes",
                "no something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about a cute adorable eevee? who doesn't love eevee huh?</span></div></span></div>",
            "created":1348894800,
            "id":1437270,
            "title":"eevee"
        },
        "112332211":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "boy/girl trainer",
                "professor/scientist"
            ],
            "content":"<div class=\"\"><div> <span>the cutest silver eevee you wake up in a field and yawn you feel different from last night you tossed and turned under the covers and now *poof* you wake up a shiny eevee you sit thinking when you hear a *snap* you look and see a ______ standing there</span></div></div>",
            "created":1351400400,
            "id":1455711,
            "title":"yes yes yes yes"
        },
        "1123322111":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "boy",
                "hotty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so rough tough boy<br>\r\n<br>\r\nor a sweet hot girl</span></div></span></div>",
            "created":1351474620,
            "id":1455712,
            "title":"boy/girl trainer"
        },
        "11233221112":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "bat eyelashes",
                "wink"
            ],
            "content":"<div class=\"\"><div> <span>5'6 D-cup blond girl stands staring at you. you are too scared to move as she walks up to you as you slowly back into a tree a territorial tangla poisons you as you collapse from the powerful atack and say eeve... before you black out you wake up in a red room you see a chansey and nurse joy plus the girl and her eevee she looked at you and...</span></div></div>",
            "created":1351478880,
            "id":1455749,
            "title":"hotty"
        },
        "112332211121":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "male/female eevee",
                "trainer"
            ],
            "content":"<div class=\"\"><div> <span>The eevee bats her eyes at you then walks over to you sits by you and says \"Hi there partner/mate\" you just sit there and listen to the girl and nurse joy talking \"so what's with it's silver color\"? \"you see this is a rare eevee he's a shiny eevee\" \"shiny\"? \"yes shiny pokemon are different colors than regular as you can tell by your female eevee's color.\" \"Is it your eevee\"? \"yes i caught it after i got rid of that tangela that poisoned him with toxic\" \"well he will be fine he just needs some rest and he will be fine.\" as she finishes saying that the blond girl says \"eevee's return\" and you are struck by a red light you are in a dome pitch black you look for an exit but only hit walls.<br>\r\n<br>\r\n<br>\r\nwho's view male/female eevee or trainer?</span></div></div>",
            "created":1351480860,
            "id":1455776,
            "title":"bat eyelashes"
        },
        "1123322111212":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "pokemon view",
                "human view"
            ],
            "content":"<div class=\"\"><div> <span>i'm amy by the way on the way home I run into damon my boyfriend he said he was coming over for some fun *hint hint* as we head to my house we get there I unlock the door and we talk about our day he said he finally was defeated as kanto champion he is now off and can finaly be together most the time he calls out his team moltres,articuno,zapdos,mewtwo,mew,and dragonite all at max stats and lvl 100 some one finally beat his unbeatable team :( so he lost the throne as champion. I let my two eevees, pichu, and my togepi.<br>\r\n<br>\r\nnext...</span></div></div>",
            "created":1351482360,
            "id":1455795,
            "title":"trainer"
        },
        "11233221112122":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "bed *hint hint*",
                "couch for a movie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where are they at?</span></div></span></div>",
            "created":1351482600,
            "id":1455798,
            "title":"human view"
        },
        "112332211121222":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "SEX",
                "after the fun"
            ],
            "content":"<div class=\"\"><div> <span>When we sit down we watch paranormal 3 as i hold on to damon in fear he hugs me when i jump to calm me down. As we watch the pokemon come and sit with us my pokemon sat by me and damons pokemon sat where ever mew sat near me to because he has a friendly relationship with me. When we get done with the movie we call our pokemon into their pokeballs as we go up to our bed for some fun before bed *hint hint*</span></div></div>",
            "created":1351815000,
            "id":1458099,
            "title":"couch for a movie"
        },
        "12":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Fire",
                "Water",
                "Grass",
                "Psychic",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what type of pokemon are you?<br>\r\n<br>\r\nIf you are mixed then your pokemon shall be listed twice in it's catigories.</span></div></span></div>",
            "created":1306213200,
            "id":1111880,
            "title":"Human turned into a Pokemon."
        },
        "123":{
            "author_id":"assassination1",
            "author_name":"Dan",
            "choices":[
                "bulbasaur",
                "oddish",
                "paras"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are lots of choices, but let's try first evolve forms. Bulbasaur the bulb Pokemon starter. There is oddish seed Pokemon, and paras the first bug and grass. Pick now. </span></div></span></div>",
            "created":1462649580,
            "id":2144462,
            "title":"Grass"
        },
        "125":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Dark",
                "Ghost",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a ...</span></div></span></div>",
            "created":1306213200,
            "id":1111881,
            "title":"others"
        },
        "1252":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Okay",
                "Secong Gen.",
                "Third Gen."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First Gen. there is only Gastly.</span></div></span></div>",
            "created":1307422800,
            "id":1121463,
            "title":"Ghost"
        },
        "1253":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Poison",
                "Dragon",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay are you ....</span></div></span></div>",
            "created":1306213200,
            "id":1111882,
            "title":"Others"
        },
        "12533":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Flying",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are a few more.</span></div></span></div>",
            "created":1306213200,
            "id":1111884,
            "title":"Other"
        },
        "125332":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Eletric",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about try some Thunder</span></div></span></div>",
            "created":1306213200,
            "id":1111893,
            "title":"Other"
        },
        "1253322":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Rock yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rock?      </span></div></span></div>",
            "created":1306213200,
            "id":1111894,
            "title":"others"
        },
        "12533222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes no thunder moves can touch me",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ground? Is that good?</span></div></span></div>",
            "created":1306213200,
            "id":1111897,
            "title":"No"
        },
        "125332222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Steel to make you look shinnier</span></div></span></div>",
            "created":1306213200,
            "id":1111898,
            "title":"no"
        },
        "1253322221":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Magnemite ",
                "Oh well."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are no first Gen. Steel types.<br>\r\nBut there is an eletric steel.</span></div></span></div>",
            "created":1307422800,
            "id":1121456,
            "title":"Yes"
        },
        "12533222212":{
            "author_id":"jstory",
            "author_name":"JStory",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Don't worry as soon as I can add more I will have more.</span></div></span></div>",
            "created":1307422800,
            "id":1121459,
            "title":":("
        },
        "1253322222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ice?      </span></div></span></div>",
            "created":1306213200,
            "id":1111899,
            "title":"others"
        },
        "12533222222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes a better fighter",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fighting type?</span></div></span></div>",
            "created":1306213200,
            "id":1111900,
            "title":"no"
        },
        "125332222222":{
            "author_id":"jstory",
            "author_name":"JStory",
            "choices":[
                "Yes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is the last one so no choice</span></div></span></div>",
            "created":1306213200,
            "id":1111902,
            "title":"Last one Bug"
        },
        "13":{
            "author_id":"yveshku",
            "author_name":"Tao Dragon",
            "choices":[
                "ice",
                "fire",
                "electric",
                "dragon",
                "one of the other fourteen types"
            ],
            "content":"<div class=\"\"><div> <span>Perhaps you were a normal pokemon originally. Then maybe you were kidnapped, you volunteered, etc, to be experimented on. The experiments could have been to make a shiny, maybe discover more about shinies, for something else but it went wrong and you turned shiny, or whatever might be imagined.<br>\r\nNow, what type might you be?</span></div></div>",
            "created":1487592420,
            "id":2279852,
            "title":"Genetic Experiment"
        }
    },
    "info":{
        "author_id":"jstory",
        "author_name":"JStory",
        "brief_description":"Your are a shiny Pokemon. This story can go any way but PLEASE ADD ON!!!!",
        "created":1300559820,
        "description":"<td align=\"left\" class=\"norm\">Look this story I'll let almost anything happen. There are a few things I will not allow, but I'll give you a message if you do. It just matters on how appropriate it is.<br>\r\n<br>\r\nRules:<br>\r\n1: You can start the story anyway you want. (You were born a Shiny Pokemon, turned into on, anything you want can happen.)<br>\r\n2: I'll let there be sex but keep it controlled. NO OVER DOING IT!!<br>\r\n3: Please watch grammar I'm not too picky but I think we don't need text talk.<br>\r\n4: Try and keep everyone's names right. If you need to write the names do before hand it's okay.<br>\r\n5: CAN\"T KILL THE MAIN CHARACTER!!!<br>\r\n6: Have fun!!<br>\r\n7: Because of so many pokemon I will only let starters, and the first pokemon generation. (First start of pokemon before Johto)<br>\r\n<br>\r\nSorry about there being 50 chapters and only 10 chapters that you can read but there are too many pokemon.</td>",
        "id":1760962,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1541545260,
        "modified":1541545260,
        "pretty_title":"The life of a Shiny Pokemon."
    }
}