{
    "chapters":{
        "1":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Zack wakes up after they've healed him.",
                "Switch to Cloud's POV.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span><u><b>A few miles outside Midgar</b></u><br>\r\n<br>\r\nSOLDIER 1st Class Zack Fair panted heavily, blood flowing from bullet and sword wounds all over his body. Despite killing at least 300 Shin-Ra troops, he was still outnumbered at least 100 to 1. He could barely see straight and was struggling to hold the Buster Sword, the sword that had served him so well in the past.<br>\r\n<br>\r\n<i>\"Damn it! This doesn't look good.\" </i>Zack thought, pain coursing through his mind. <i>\"Aerith...forgive me. I wasn't strong enough.\"</i>. The remaining Shin-Ra troops prepared to open fire, but before they could pull the trigger, a dozen fireballs hit the ground between them and Zack. As the smoke cleared, Zack could see a man wearing a SOLDIER 1st uniform land in front of him, sword at the ready. The newcomer stood slowly, facing the Shin-Ra troops, who looked at their commanders nervously.<br>\r\n<br>\r\n\"Sorry, but I can't allow you to kill this man. If you want him, then you're going to have to take me down first!\" he shouted, holding his sword with both hands. At that, the Shin-Ra troops shook off their fear and opened fire. The SOLDIER 1st's sword was a blur, deflecting all of the bullets that threatened to end his and Zack's lives. The barrage continued until the troops' guns ran out. The 1st smirked. \"Not bad, now it's time to end this. Ultima!\" he shouted, his hand glowing with blue energy, which then released a blue shockwave, killing all of the remaining troops instantly. The SOLDIER replaced his sword, then turned around and walked over to Zack. \"Hang in there, buddy. You're going to be fine.\" he told Zack.<br>\r\n<br>\r\n\"W-Who are you?\" Zack asked, his voice barely a whisper.<br>\r\n<br>\r\n\"Save the questions for later. We need to fix you up first.\" he replied.<br>\r\n<br>\r\n\"But I-\" Zack couldn't finish his sentance as he lost consciousness, the other 1st catching him and picking up the Buster Sword. Just then, a small truck rolled up and stopped beside the two. The driver's door opened, and a blonde woman wearing the Turks uniform jumped out.<br>\r\n<br>\r\n\"Looks like you were just in time.\" she observed.<br>\r\n<br>\r\n\"I'll say. Anyway, lets get going, before Shin-Ra shows up.\" he replied. The woman nodded. Together, they placed Zack in the back seat, his sword being secured on the truck bed. Then they climbed in and drove off, towards Gongaga, Zack's hometown.</span></div></div>",
            "created":1307526600,
            "id":1121817,
            "title":"Survival."
        },
        "11":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Departure.",
                "Meanwhile...",
                "Cloud's POV."
            ],
            "content":"<div class=\"\"><div> <span>A few hours later, Zack woke up with a start. Realising that he wasn't dead and that he wasn't in the plains surrounding Midgar, he tried to siy up, but found he couldn't. Looking down, Zack saw that his torso was wrapped in bandages, which were stained red in places. <br>\r\n<br>\r\n<i>\"Well, I guess I really did fight the army. But where am I now?\"</i> he wondered. Looking around, he recognised his surroundings. <i>\"Wait a sec, this is my room! Then that means I'm back on Gongaga!\"</i> Just then, the door opened, and in came a woman with long black hair and blue eyes, concerned look on her face. \"Mom?\" Zack asked, in disbelief.<br>\r\n<br>\r\n\"Zack!\" cried Marie Fair, as she ran over and embraced her battle-scarred son in a loving hug. \"I'm so glad you're okay!\"<br>\r\n<br>\r\n\"Mom, don't worry, I'm fine.\" Zack replied, hugging her back. His mother released him, sitting down in a chair next to the bed.<br>\r\n<br>\r\n\"When that very polite man and woman brought you here and told us what had happened, I couldn't believe it. Is it true that you've been on the run all this time?\" she asked.<br>\r\n<br>\r\n\"Yeah, it is.\" he replied, his voice growing solemn, as he realised Aerith still had no idea he was alive. \"You said a man and woman brought me here. Who were they?\" Zack asked.<br>\r\n<br>\r\n\"Why don't you ask them. They're just downstairs. Can you walk?\" his mother asked.,<br>\r\n<br>\r\n\"Hopefully.\" he replied, swinging his legs off the bed, then standing slowly. Apart from a slight ache in his chest, he felt fine. Satisfied, Zack's mother led they way down the stairs and into the living room, where Zack could see a SOLDIER 1st Class and a blond female Turk sitting on the couch. As he noticed Zack's entrance, the 1st spoke up.<br>\r\n<br>\r\n\"Hey, Sleeping Beauty! I thought you'd never wake up!\" he exclaimed. The blonde Turk giggled, whilst Zack, his mother, and his father, who had just entered, laughed.<br>\r\n<br>\r\n\"Hey, you try going without proper sleep for a few days! I was worn out.\" Zack protested, sitting down in on of the armchairs, his parents doing the same. \"So, how long have I been asleep?\" he asked.<br>\r\n<br>\r\n\"About a week, give or take a few hours.\" replied the Turk, her voice like music.<br>\r\n<br>\r\n\"So,\" Zack asked. \"Mind telling me why a Turk and SOLDIER 1st came to my rescue? And who exactly are you?\"<br>\r\n<br>\r\n\"I knew you'd ask.\" replied the 1st. \"Name's Strato Christon, and this lovely lady here is Elena. You probably don't remember, but I was one of the rookies that you gave that little speech to after you changed your hair.\" Zack thought back to that day, remembering his \"order\".<br>\r\n<br>\r\n\"I vaguely remember a rookie called Strato. Wow, so you managed to make 1st! When was that?\" Zack asked.<br>\r\n<br>\r\n\"About a year ago, however, when Elena and I learned about what really happened in Nibelheim, I decided to leave Shin-Ra to try and find you and Cloud. Elena stayed, so she was able to leak information to me, that's how I managed to find you.\" Strato replied. Zack suddenly remembered about Cloud.<br>\r\n<br>\r\n\"Oh no! I left Cloud behind!\" he exclaimed, but Strato spoke up.<br>\r\n<br>\r\n\"Don't worry about Cloud. Elena hasn't heard anything about him, so it's safe to say that he's fine in Midgar somewhere.\"he told Zack. \"However, there's something much worse that we need to focus on.\"<br>\r\n<br>\r\n\"What?\" asked Zack. Strato looked grim.<br>\r\n<br>\r\n\"You remember Sephiroth?\" he asked. Zack nodded.<br>\r\n<br>\r\n\"Yeah, but Cloud and I bastard what he deserved.\" he replied.<br>\r\n<br>\r\n\"Well, sadly it looks like you didn't finish him off for good.\" Strato told him.\"We've heard that AVALANCHE broke into the Shin-Ra building. Apparently they stole a research sample, but from what I've managed to find out, it was actually your girlfriend.\"<br>\r\n<br>\r\n\"Aerith?! Hojo's gone too far.\" Zack exclaimed, cursing himself.<br>\r\n<br>\r\n\"Luckily, it seems that a certain blond friend of yours was involved with AVALANCHE, so Aerith should be fine.\" Strato replied, at which Zack breathed a sigh of relief. \"However, after this happened, President Shinra was found dead in his office. Want to guess whose sword it was they found?\"<br>\r\n<br>\r\n\"Sephiroth's\" Zack answered.<br>\r\n<br>\r\n\"Exactly. Sephiroth is alive, and he's after something. But we've got no idea what.\" Strato told him, obviously worried. Zack wondered.<br>\r\n<br>\r\n<i>\"Could it have something to do with Jenova? Sephiroth's so-called mother?\"  </i> He spoke up. \"Maybe it's got something to do with Jenova. You know, the thing that they used to create Sephiroth, Genesis and Angeal?\" he asked. Elena let out a gasp.<br>\r\n<br>\r\n\"That must be it! Since Jenova is an Ancient, Shin-Ra must have thought they could learn something from Aerith. So maybe that group Cloud's with that rescued knows something about Sephiroth.\" she suggested. Zack and Strato both nodded.<br>\r\n<br>\r\n\"Sounds like you might be on to something, Elena. Zack, when you're ready we should probably follow AVALANCHE and see what happens. At least you'll be able to see Aerith again.\" Strato announced. Zack immediately brightened up.<br>\r\n<br>\r\n\"Ok! Then we'll leave tomorrow.\" he announced, standing up.<br>\r\n<br>\r\n\"Zack, please be careful.\" his mother begged.<br>\r\n<br>\r\n\"Don't worry mom.\" Zack replied. \"Nothing's gonna stop two SOLDIER 1st's, right Strato?\"<br>\r\n<br>\r\n\"Right.\" agreed Strato, as they shook hands.</span></div></div>",
            "created":1307540520,
            "id":1121849,
            "title":"Awakening and Introductions."
        },
        "111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "A few weeks later.",
                "Back at the truck.",
                "Seventh Heaven (AVALANCHE secret meeting place)."
            ],
            "content":"<div class=\"\"><div> <span>The next day, Zack, Strato and Elena were preparing to head off. After saying goodbye to Zack's parents, the trio got in the truck and headed towards Midgar.<br>\r\n<br>\r\n\"So, what's the plan?\" Zack asked.<br>\r\n<br>\r\n\"Well, since Elena srill works for Shin-Ra, I thought that she could try and find out anything Shin-Ra might have planned. That okay with you?\" he asked, turning to Elena, who smiled.<br>\r\n<br>\r\n\"Sure thing. sounds good to me.\" she replied.<br>\r\n<br>\r\n\"Good. As for me, I'll go visit Aerith and see if she knows anything about what Sephiroth might be up to.\" Strato told Zack.<br>\r\n<br>\r\n\"You two know each other?\" Zack asked. Strato grinned.<br>\r\n<br>\r\n\"Yeah. I've been helping her cope with you being prenounced KIA.\" he replied. \"Don't worry, Zack. She still believes you're alive somewhere. You're lucky to have her, dude.\"<br>\r\n<br>\r\n\"Yeah, I guess so.\" Zack replied, smiling. A few hours later, the truck pulled up just outside Midgar. Elena immeditely headed off to the Shin-Ra building, leaving Strato and Zack with the truck.<br>\r\n<br>\r\n\"Hey Zack, how about you stay and watch the truck? If you come with me Shin-Ra might spot you.\" Strato asked. Zac nodded.<br>\r\n<br>\r\n\"Right, be careful in there.\" Zack replied. Strato gave him the thumbs up, then headed into the city. Heading through the Sector 5 slums, Strato still drew glances with his uniform and large sword. Arriving at the church, he wondered again what the church would look like if it was in one piece. Entering the church, Strato saw Aerith in her usual place, tending the flowers, wearing her newer outfit (<a rel=\"nofollow\" href=\"http://finalfantasy.wikia.com/wiki/File:Dissidia_Aerith.png\" target=\"_blank\">http://finalfantasy.wikia.com/wiki/File:...</a>). Aerith had told Strato that when Zack bought her the ribbon she wore, he suggested that she wear pink every time they were together. Aerith had protested, but had decided to wear pink to surprise Zack when he came back. She looked up when she heard Strato's boots on the wooden floor, smiling.<br>\r\n<br>\r\n\"Hi Strato, what brings you here?\" she asked. \"You looking for some flowers for Elena?\"<br>\r\n<br>\r\n\"Where did you get that idea?\" he asked, embarrased.<br>\r\n<br>\r\n\"Oh come on, it's obvious you have feelings for each other, you just haven't noticed it yet.\" Aerith replied, giggling.<br>\r\n<br>\r\n\"You might be right there.\" he agreed. \"Aerith, you're an Ancient, right?\" Strato asked. Aerith frowned slightly.<br>\r\n<br>\r\n\"Yes, why?\" she asked.<br>\r\n<br>\r\n\"Do you know about a guy named Sephiroth?\" he asked.<br>\r\n<br>\r\n\"Zack mentioned him a few times, yes.\" she replied.<br>\r\n<br>\r\n\"Well, he was supposedly killed by Zack in Nibelheim, but from what I know he's come back and he's searching for something of the Ancients, any idea what it might be?\"<br>\r\n<br>\r\n\"Hmm, no, I can't think of anything, sorry.\" she replied.<br>\r\n<br>\r\n\"Well, thanks anyway. But Aerith, if you see Sephiroth, be careful. Whatever he's after, it might have something to do with you.\" Strato told her. Aerith nodded, saying that she would and wishing Strato a good day as he left the cnurch.</span></div></div>",
            "created":1307628420,
            "id":1122479,
            "title":"Departure."
        },
        "1111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Elena joins them, to the Northern Crater.",
                "Cloud's memory clears up.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Over the weeks that followed, Zack, Strato and Elena continued to gather any information relating to Sephiroth and AVALANCHE. Occasionaly, Zack would stay behind with his parents to catch up. Strato and Zack would usually spar whenever they could, since Zack felt he was a little out of shape. One day, Zack was practicing his magic, when he spotted a Shin-Ra helicopter approaching. Zack immediately hid, thinking Shin-Ra might be there for him. However, he was surprised when Strato, Elena and Cissnei stepped. Zack figured that he'd be all right, seeing as Strato wouldn't get captured easily. He left his cover and approached the chopper.<br>\r\n<br>\r\n\"Hey Strato, what's going on?\" Zack asked. Cissnei shook her head.<br>\r\n<br>\r\n\"Zack, there's no time for that, we need to move! Strato'll fill you in on the way.\" she told him, sternly. Zack nodded, then they all climbed onboard and took off. Strato then turned to Zack. <br>\r\n<br>\r\n\"Zack, here's the deal. Elena just heard that Tseng had found what he believed Sephiroth was after. It's called Black Materia, and it has the power to summon Meteor, which has the potential to wipe out the planet. The Ancients knew this, so they hid it, inside the Temple of the Ancients.\" he told Zack. \"Tseng was sent to get it, but Sephiroth almost killed him. Cloud and his group tried to get their hands on the Black Materia as well, but Sephiroth managed to get it and escape.\"<br>\r\n<br>\r\n\"Damn you Sephiroth!\" Zack exclaimed. \"What now?\"<br>\r\n<br>\r\n\"Apparently, there is a materia that can stop Meteor, called White Materia, which Aerith possesses.\" Strato explained. \"She's gone to the Forgotten Capital, the lost Ancient city, to try and use it to summon Holy, which will stop Meteor is Sephiroth summons it. We're heading there because Sephiroth almost certainly knows about this and Aerith is in grave danger if he finds her.\" Zack nodded, his fists clenching.<br>\r\n<br>\r\n<i>\"Sephiroth...you won't take Aerith.\" </i>he thought. After a few hours, the helicopter touched down outside the ruins. Strato and Zack got off, while the helicopter moved out of sight.. Strato lead the way through the ruins to a ledge where they could see both the entrance and an altar. Strato then turned to Zack. <br>\r\n<br>\r\n\"Here's what we'll do. Zack, you protect Aerith, got it?\" Strato asked. Zack nodded. \"Good. As for me, I'll take Sephiroth if he shows up. Now we just have to wait.\" After a few minutes, Aerith entered the ruins, and knelt in front of the altar, the White Materia in her hands. Strato signalled to Zack to wait and be quiet. Shortly after, Cloud and a few others, who Zack presumed were the members of AVALANCHE, entered as well. Cloud started to approach the altar. <br>\r\n<br>\r\n\"Aerith, I-\" Cloud began, but suddenly clutched his head, groaning. \"No..stay out of my head!\" he yelled. Then, he stopped, a blank look on his face. \"Yes..kill her...for mother.\" Cloud mumbled, raising his sword, walking towards Aerith, despite his groups protests. Zack wasted no time. Just as Cloud was about to attack, he jumped down, landing in front of Cloud, the Buster Sword easily blocking Cloud's blade. Zack then kicked Cloud in the stomach, knocking on his back a few metres away.<br>\r\n<br>\r\n\"Cloud, what the hell is wrong with you?!\" he shouted. Then someone called out to him. <br>\r\n<br>\r\n\"Zack? What are you doing here?\" they shouted. Looking at the group, Zack saw a familiar face.<br>\r\n<br>\r\n\"Hey, Tifa!\" he replied, waving. Then Tifa pointed above Zack. <br>\r\n<br>\r\n\"Look out!\" she cried. Zack turned to see Sephiroth descending on Aerith, his Masamune ready. Before Sephiroth could act, Strato landed and blocked the Masamune with his Excalibur.<br>\r\n<br>\r\n\"What?\" Sephiroth exclaimed, surprised.<br>\r\n<br>\r\n\"Sorry, but you're not killing anyone here!\" Strato shouted. Pushing Sephiroth back, he then charged at the former SOLDIER. The two exchanged a series of rapid blows of such force, they produced shockwaves of energy. \"Now, it's time to go, Sephiroth!\" Strato shouted, knocking Sephiroth into the air, where he was caught by a horizontal slash from Strato, which left Sephiroth bound to a glowing white bar of energy. \"Crucifixion!\" shouted Strato, as he brought his blade down from above Sephiroth all the way to the ground, leaving the former hero on a glowing white cross, which exploded, throwing him against the far wall.<br>\r\n<br>\r\n\"What...power.\" Sephiroth said, clearly in pain. The others, including Aerith, were speechless.<br>\r\n<br>\r\n\"Damn, he's tough.\" announced a big man with a metallic right arm.<br>\r\n<br>\r\n\"No way!\" exclaimed Zack. Sephiroth then began laughing menacingly.<br>\r\n<br>\r\n\"Hahahaha! Well done, Strato. However, this battle is far from over.\" he told them. Then Sephiroth's body morphed into the form of Jenova, before dissolving into the Lifestream. <br>\r\n<br>\r\n\"Was that...Jenova?\" asked Zack.<br>\r\n<br>\r\n\"I'm not surprised. I knew it wasn't Sephiroth.\" Strato replied, as the rest of Cloud's group joined them, Tifa kneeling beside Cloud. Aerith stood up, turning to towards Zack.<br>\r\n<br>\r\n\"Zack? Is it really you?\" she asked, choking slightly. Zack turned to face his love, who promptley tackled him, wrapping her arms around him. \"You reaaly did come back.\" Aerith, sobbed, crying into Zack's chest. Zack held Aerith close, stroking her hair as she continued to cry. The man with the metal arm addressed Strato and Zack.<br>\r\n<br>\r\n\"Who the hell are you two?\" he asked.<br>\r\n<br>\r\n\"Name's Strato and that's Zack. We're SOLDIER 1st Classes.\" Strato replied. The man's eyes widened, then his arm turned into a gun, aimed at Strato. A man in red drew a three-barrelled shotgun as well.<br>\r\n<br>\r\n\"You're with Shin-Ra?! Then you're a dead man!\" he yelled. Before he could attack, Tifa spoke up.<br>\r\n<br>\r\n\"Barret, stop! They're not our enemy.\" she told him. \"Zack left Shin-Ra, and I guess this guy did as well.\" Barret and the other man put their guns away, then turned to Strato again.<br>\r\n<br>\r\n\"Well, if you're against Shin-Ra then that's all right with me. So, how did you know that wasn't Serphiroth?\" Barret asked.<br>\r\n<br>\r\n\"When I went through the surgery to become a SOLDIER, I was given a special ability that was being experimented with. It allows me to 'see' mako and mako energy. I could tell it wasn't Sephiroth because the kind of mako energy he has wasn't there.\" Strato explained.<br>\r\n<br>\r\n\"That makes sense. Shin-Ra only cares about mako. It's not surprising they would try and develop a race that could easily find any.\" stated the man in red. After that, introductions were made. The man in red introduced himself as Vincent Valentine, a former Turk. Also present was Yuffie, who Zack remembered from his mission in Wutai. Finally, Zack introduced himself, and Tifa introduced herself to Strato.</span></div></div>",
            "created":1307788860,
            "id":1123643,
            "title":"Reunion and Remembrance."
        }
    },
    "info":{
        "author_id":"anzac",
        "author_name":"Anzac",
        "brief_description":"The events of Final Fantasy VII are drastically rewritten, by a new SOLDIER.",
        "created":1307521320,
        "description":"<td align=\"left\" class=\"norm\">Set in the Final Fantasy VII universe, this story picks up midway through Zack's battle against the Shinra army. However, Zack is aved by another SOLDIER 1st Class and a Turk who have left Shinra after learning the truth about Sephiroth and Nibelheim.<br>\r\n<br>\r\n<u><b>Characters</b></u><br>\r\n<br>\r\n<b>Strato Christon</b><br>\r\nAge: 22 years old.<br>\r\nHeight: 6'2\", or 183cm.<br>\r\nSOLDIER Rank: 1st Class.<br>\r\nWeapon: Excalibur (<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://1.bp.blogspot.com/_BXQEtzdiB4M/TSfb5U0lrXI/AAAAAAAAACw/W8FSgKxITEo/s1600/attachmentsfate63excali.jpg\" target=\"_blank\">http://1.bp.blogspot.com/_BXQEtzdiB4M/TSfb5U0lrXI/AAAAAAAAACw/W8FSgKxITEo/s1600/...</a>)<br>\r\nAppearance: Short black hair, royal blue eyes, muscular build.<br>\r\nPersonality: Laid back and eay-going normally, but a fierce fighter when in battle.<br>\r\nLimit Break: Crucifixion.<br>\r\nMiscellaneous: Boyfriend of Elena.<br>\r\n<br>\r\n<u><b>Rules</b></u><br>\r\n1. Storyline doesn't have to follow FFVII.<br>\r\n2. Descriptive fight scenes.<br>\r\n3. Decent grammar and spelling.<br>\r\n4. Sex is allowed, but not crazy explicit (I have standards, people!\"<br>\r\n<br>\r\nFollow these rules rules and write on! Enjoy!</td>",
        "id":1783333,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1307939820,
        "modified":1307939820,
        "pretty_title":"Final Fantasy Crisis Core: A New Story."
    }
}