{
    "chapters":{
        "1":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Start from the very beginning",
                "Start from a medium level (servants are still alive)",
                "Start at a point after a couple servants have fallen",
                "Be a total cheater and use a file that's at the end boss"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The first thing to do: Determine your starting point. Do you want to build your party from the ground up, or do you want to bum a save off someone?</span></div></span></div>",
            "created":1244588100,
            "id":705466,
            "title":"File select"
        },
        "11":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you start as the male hero, or the female?</span></div></span></div>",
            "created":1244588160,
            "id":705468,
            "title":"Start from the very beginning"
        },
        "112":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Toward the forest",
                "Toward the cave. There's always treasure in caves, right?",
                "Nowhere. You're ambushed on the spot!"
            ],
            "content":"<div class=\"\"><div> <span>Today was, at last, the fated day. Your life had been leading up to this moment, with every bead of sweat in training, every swing of your sword in practice. Your journey would begin today, to sever the root of evil in your world and free the people from the oppressing fear that held them in its unshakable grip. The first step awaited you and your comrades, the mighty city gates creaking open before you. Gathering your courage, you stepped forward.<br>\r\n<br>\r\nThe sun shone warmly on your group, a slight breeze licking at your faces. Your plodding footsteps padded along the dirt road. Only a few steps along, you heard the familiar creak of Tasnaltai's city gates. You all turn unanimously to see them shut, and as they do, a simultaneous bracing feeling comes over all of you. The heavy slam is the end of practice; what would happen from this point on would be absolutely real. No do-overs, no second chances. Your hands tightened into fists. This was everything you had waited for. <br>\r\n<br>\r\n\"So, do we actually have a plan of action?\" Nadia, the wizard of your party, seemed less caught up in the romanticism of the moment than the rest. \"We can't just stand here all day. Unless Azaria wants to haul herself out here.\" Myrrie shuddered. The young fighter wasn't too keen at the idea.<br>\r\n<br>\r\n\"The village of Onler is about a day's hike from here,\" piped in Majh. The merchant held his thumb and forefinger on his fuzzy chin, thinking. Of the group, he was the only one to whom being outside the city wasn't new. He'd made treks across the continent, but not outside a caravan. \"There's a cheap inn there. And a cheaper one out back.\" He raised an eyebrow as he was met with glares. \"I guess we can find a middle ground...\" <br>\r\n<br>\r\nYour own gaze turned back toward the road. There was a forest a good ways away, beyond which lay Onler, and mostly open road until then... except for a small cave entrance a short ways off a fork no more than a mile away. Not wanting to waste daylight, you direct the group...<br>\r\n</span></div></div>",
            "created":1244760540,
            "id":707187,
            "title":"The epic quest begins! (Female Hero)"
        },
        "1122":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "You find the place to be a winding maze",
                "The first room is wide open...?",
                "Ambush!"
            ],
            "content":"<div class=\"\"><div> <span>You tap your head twice, and point the party toward the cave. You weren't all setting out with the greatest level of funding, and caves tended to house treasures... they were safer than banks, since barely anyone ventured outside the city, and most beasts had no use for gold. They also were subject to the golden rule: Finder's keepers.<br>\r\n<br>\r\nThe wind picked up a little as your group walked along the road, no longer blocked by the large city walls. The warmth of the sun was just about ideal; enough to invigorate, but not so much that any of you would sweat. Except, of course, for Majh, who seemed to have a permanent shine to him. The ocean was just to your left - or the south - as you walked, exuding a cool wave of moist air whenever the wind shifted. Aside from it, there wasn't much in the way of scenery. Only the odd tree sprang up near the road, none of which were wide enough to hide behind. The grass that crept over the dirt road shortened as you made progress, and nearing the cave, the tone changed from a lush green to a bleached yellow. <br>\r\n<br>\r\nApproaching the mouth of the cave, you stop. Nadia steps forward, hands on her hips. Without saying a word, she holds out her hand. A dull glow begins to form around it, which then draws inward. Just before it disappears, a white flash blots out everything in view. You were apparently the only one unfortunate enough to be watching it, as the other two had turned away. When your eyes adjust, you see a strong, wide beam of light shining from Nadia's palm. <br>\r\n<br>\r\n\"That should take care of sight,\" she explained. \"One of my hands will be busy while we're in here, so we'll only be at half strength. Make a note of it.\" Myrrie glared daggers at the back of Nadine's head. Majh raised his eyebrows in a sort of passive agreement. <br>\r\n<br>\r\nWasting no time, you all step forward into the cave...</span></div></div>",
            "created":1244844960,
            "id":707197,
            "title":"Toward the cave. There's always treasure in..."
        },
        "11223":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "A ferocious creature, all claws and teeth",
                "An elegant centauress, wielding a bow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just as you take that first step, a black shadow rushes out of the cave, passing by you and scraping against your cheek. You whirl to see what form this threat takes, and as your eyes adjust from the shade to the glare of the sun, you see...</span></div></span></div>",
            "created":1245037980,
            "id":708419,
            "title":"Ambush!"
        },
        "112232":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "You catch up with the centauress befor you notice hes missing ",
                "you notice hes missing and stop the cetauress circles back."
            ],
            "content":"<div class=\"\"><div> <span>I was a centauress standing 16 foot head to hoof she had large breasts CCcup, her horse half looked like a red clidesdale with black tail and socks (those are the tofts of fur above there hoofs) On her human half she hard red hair with black tips and gold eyes.<br>\r\n<br>\r\nShe truned about and fire 3 arrows in to tha cave. \"Run or she'll get you!\" she shouted <br>\r\n<br>\r\n\"Hehehe.... Oh yum. More food.\" You and the others turn to see what looks like a yung woman naked with ghost pail skin with long black hair that covers her eyes.<br>\r\n<br>\r\nThe merchent walked up to her \"Oh Dear you must be cold and ungry i can cut you a-a..... a.....\" H stoped when her head lifted and her 3 glowing red eyes could be seen glowing brightly.<br>\r\n<br>\r\n\"Run!!!\" you shout and the group turns to flee.<br>\r\n<br>\r\nAs the merchant truned the girl opened her mouth and a thick tongue shot out wraped around his faice and draged him bacwards head frist in to her maw. She then started swallowing rapidly. her musles and tongue had stfuled his screms for help so his comrads didn't know e wasent behind them. In miunts he was cunsomed but ther was no boulge on the girls body. She rubbed her belly and bealched befor she vanished.</span></div></div>",
            "created":1320814080,
            "id":1220202,
            "title":"An elegant centauress, wielding a bow"
        },
        "12":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did you get the male hero, or the female?</span></div></span></div>",
            "created":1244588220,
            "id":705472,
            "title":"Start from a medium level (servants are still a..."
        },
        "13":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did you get the male hero, or the female?</span></div></span></div>",
            "created":1244588280,
            "id":705470,
            "title":"Start at a point after a couple servants have f..."
        },
        "14":{
            "author_id":"maxtwenty",
            "author_name":"MaxTwenty",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did you get the male hero, or the female?</span></div></span></div>",
            "created":1244588340,
            "id":705474,
            "title":"Be a total cheater and use a file that's at..."
        }
    },
    "info":{
        "author_id":"maxtwenty",
        "author_name":"MaxTwenty",
        "brief_description":"Dragon Quest's got nothin' on this.",
        "created":1244587380,
        "description":"<td align=\"left\" class=\"norm\"><i>A black shadow falls over the land, and hungry monsters await at every turn. The people live in fear, but one band of adventurers chooses to fight the approaching menace. Take up arms against this monstrosity, and free your world! </i><br>\r\n<br>\r\n<br>\r\n<br>\r\nMain characters in this epic:<br>\r\n<br>\r\n<b>Protagonists:</b><br>\r\n<br>\r\n~Hero: Gender is chosen at the start. The male is accompanied by the Thief, Cleric, and Warrior, while the female is partied with the Wizard, Martial artist, and Merchant. The hero's physical description is left up to the imagination. (The hero's personality is expected to change; imagine each new chapter like someone ganking a save file.)<br>\r\n<br>\r\n-Male's company-<br>\r\n<br>\r\n~Thief: A clever woman in light clothing with minimal armor. Her method of fighting is indirect, and she's only sporadically seen by monsters. Her wits serve her well, but her agility and tactics do nothing for her once in a monster's clutches. <br>\r\nPhysical description: Silver hair, light blue eyes, slim build, medium height.<br>\r\n<br>\r\n~Cleric: A scatterbrain most of the time, this holy woman has the divine gift to enact the benevolent will of the gods themselves; pity she still has to read her spells from a book. Her healing skills are invaluable, but she won't stand up to a monster by herself in terms of power or will. <br>\r\nPhysical description: Red hair, hazel eyes, slim-medium build, short height.<br>\r\n<br>\r\n~Warrior: A mighty man, both strong as an ox and dumb as one. The heaviest armor and weapons go to this member, and his massive strength will bowl over the toughest of monsters. Though a one on one will invariably find him the victor, this particular soldier has an unusually pronounced weakness to spells...<br>\r\nPhysical description: Brown hair, brown eyes, meaty build, tall height.<br>\r\n<br>\r\n-Female's company-<br>\r\n<br>\r\n~Wizard: A seductive, imposing woman well versed in the arcane arts of magic. Her robes provide little protection from claws and teeth, but her spells will likely fry a monster before they can get close. The highest of her order can transform into dragons... she's a ways off, yet. Her confidence is a serious asset in battle, but a little more to tip the scales will make it a serious liability.<br>\r\nPhysical description: Dark red hair, green eyes, curvy build, medium height.<br>\r\n<br>\r\n~Martial Artist: A young girl just recently passing into adulthood, out to journey the world in training. She uses no weapons or spells, instead relying on her toned body for protection. Her strength is deceptive, and it seems she can always muster a little more than one would think. She can fight her way out of the grubby paws of most monsters and give them a concussion to boot, but she's not omnipotent; a giant of a beast would barely feel her strikes. At least, at the outset.<br>\r\nPhysical description: Black hair, brown eyes, slim build, short height.<br>\r\n<br>\r\n~Merchant: A slimy customer who would bargain over his mother's life. He's the absolute best at finding deals, though he's sometimes seen running from the business afterward. His lechery knows no bounds, as his hands are almost always on a female curve. His combat skill is... complicated, to say the least. It's almost as though he haggles for a monster's defeat. Although invaluable to the team, his character may get the others to forget to protect him at the worst possible time...<br>\r\nPhysical description: Horseshoe-balding brown hair, hazel eyes, potbellied build, short height.<br>\r\n<br>\r\n<br>\r\n<b>Antagonists: </b><br>\r\n<br>\r\n~Azaria: The grand poobah villain. Her body is a titanic, voluptuous form, with pale blue skin and silver hair, and glowing green eyes. Her limbs are many, possessing six arms and a set of 8 back-mounted tentacles. Her sheer size borders ridiculous in her true form; the exact height has never been estimated by anyone who returned. If she has no need for battle, however, she tends to stay in her human-like size for ease of movement. Her power over both the physical and ethereal pyramid of combat is unreal, certainly unrivaled, and such a being would have certainly conquered the world by now if not for one thing; she is confined to her dark lair by her need for evil energy, which she can only obtain efficiently through her castle's machines. Unfortunately for the world at large, she has servants to do her work for her...<br>\r\n<br>\r\n~Lord James Renard: A man with the cunning of a fox and the body of... a fox. This anthropomorphic beast exercises control over the forest, forcing its denizens to do his bidding. While not physically strong himself, he's practically invincible in his home environment, with an endless shield and sword of woodland creatures. This control, however, doesn't seem to come from an innate ability of his own...<br>\r\n<br>\r\n~Callipy Amplis: A master of the more unusual types of magic, controlling size, sound, and even time to some degree. Her shape is undeniably curvy (she insists she is on par with Azaria on this, though it remains to be seen) and bound only by enough shimmering, ocean blue cloth to cover her, arranged into a miniskirt and a revealing top. Her hair seems to flow into this, being of the same color and depth. She wields no staff, but rather a set of rings she taps to activate. While a formidable foe to begin with, adventurers may find themselves in for more than they can chew. This mistress of magic has an unhealthy obsession with her own rear end, and will go to any lengths to ensure everyone she comes across shares the appreciation. <br>\r\n<br>\r\n~Chef Natasha Broil: A goddess of the kitchen knife. This red-haired villain is never seen without her chef uniform, complete with her hat that seems to fall off any chance it gets. Her entire lair is a multi-room kitchen, designed to prepare intruders into sumptuous meals for her and her apprentice chefs. Each room holds a theme, such as the dessert room, appetizer room, meat room, buffet room, with many malevolent machinations to assist the process of edibility enhancement. Her only real weakness may be her obsessive appreciation for a good meal...<br>\r\n<br>\r\n~Master Drak: Chief of Azaria's servants, and with good reason. Though he may appear gentlemanly and refined, his silver hair and blazing red eyes betray the truth. His true form is that of a mighty dragon, with power beyond measure and hunger beyond voracity. If he has a weakness, nobody has ever discovered it, and his reclusive nature makes discovering it difficult.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nNow, on to the rules. Every interactive has them. These are going to be kept short and sweet. <br>\r\n<br>\r\n<b>1.</b> Common sense. I'm going to forgo a lot of common rules in favor of this one. Please exercise it. <br>\r\n<br>\r\n<br>\r\n<b>2.</b> Vore (of any kind, any severity, any orifice, digestion/scat, etc.) is allowed. Sex is allowed. But please pay attention to rule #4 on this one.<br>\r\n<br>\r\n<br>\r\n<b>3.</b> Imagination and interpretation is to be expected. However, the following must either remain intact or a reason must be supplied for the change:<br>\r\n-Party groupings<br>\r\n-Genders<br>\r\n-Physical descriptions (except the hero)<br>\r\n-Plotline<br>\r\n<br>\r\n<br>\r\n<b>4.</b> Storytelling. This is not meant to be a mindless \"You crawl in the dragon's mouth\" (It digests you/It craps you out whole) type story. The adventurers have a goal in mind of bringing down Azaria, and just hopping into or fornicating with every given creature that comes along is not part of that goal. Obviously there would be voracious monsters along the way, maybe even a promiscuous innkeeper or a slippery merchant with some shrinking dust, etc. No quest is complete without harpies, sirens, dragons, snakes, that kind of thing. The basic concept to remember is good vs. evil. <br>\r\n<br>\r\nThis rule is particularly important, because there are already plenty of interactive stories out there meant for a quick wank. There's nothing wrong with that, but that is not this story's purpose.<br>\r\n<br>\r\n<b>5.</b> Party members can be revived in town, or the cleric can try her hand at it. They probably *will* die more than once, but it remains the right of the storyteller.<br>\r\n<br>\r\n<b>6.</b> When it comes to random encounter type battles, anything goes. Any kind of monster(s) can be made up. Total free reign here.<br>\r\n<br>\r\n<b>7.</b> Each party will have different names. These are to be determined in their respective first chapters. If they're not determined by another user here, I'll add them as a note.<br>\r\n<br>\r\n<b>8.</b> Game Over *is* allowed.<br>\r\n<br>\r\n<br>\r\n<br>\r\nWith all that said, your quest begins! Have fun!</td>",
        "id":1569671,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1320814080,
        "modified":1320814080,
        "pretty_title":"Role-playing game I (Vorish)"
    }
}