{
    "chapters":{
        "1":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Physical",
                "Mental",
                "Supernatural",
                "Tranformation",
                "Technological"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Know first of what type of power do you get?</span></div></span></div>",
            "created":1263618000,
            "id":821214,
            "title":"start"
        },
        "11":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Superhuman strength",
                "Superhuman durability",
                "Superhuman speed",
                "Superhuman agility, flexibility and dexterity",
                "other choices"
            ],
            "content":"<div class=\"\"><div> <span>Now what type of power?<br>\r\n<br>\r\nA)Superhuman strenth,you get stronger, your body or muscle size does not change though, you also start at 600 pounds to 50 tons,<br>\r\n<br>\r\nB)Superhuman durability, Your skin and body becomes much harder, say to the piont where bullets bounce of you.<br>\r\n<br>\r\nC)Superhuman speed, you can run at speeds from 50 km to 300 km a hour and faster if you want more.<br>\r\n<br>\r\nD) Superhuman agility, flexibility and dexterity, quite self explanitary.</span></div></div>",
            "created":1263704400,
            "id":821504,
            "title":"Physical"
        },
        "111":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Female",
                "Male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, What sex are you?f</span></div></span></div>",
            "created":1263704400,
            "id":821541,
            "title":"Superhuman strength"
        },
        "1111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "on the school bus.",
                "in her second class, PE",
                "in front of the school, where her bully Betty Brutus was awaiting her."
            ],
            "content":"<div class=\"\"><div> <span>Jenny Weasley woke up slowly on the morning of her thirteenth birthday by the loud rumble of thunder which could be heard from the distance.<br>\r\n<br>\r\n“Man… what a way to wake up…” she groaned, as she stumbled out of bed. she groggily looked at her digital clock, which indicated that it was only 4:55 AM in the morning. “I’d better unplug my computer!”<br>\r\n<br>\r\nShe moved his mouse over the mouse mat so that the screen came on, and she tapped on the keyboard, curiously looking to see if there were any new emails for her, before she would shut down the laptop and unplug it from the wall, due to the oncoming thunderstorm, which was so common in the state of Alabama during the hot summer months.<br>\r\n<br>\r\n“Ahh… birthday wishes… more birthday… what’s this? ‘Greetings from the Greek Gods?’” Jenny thought, as she was quietly reading the email subjects. The last subject sounded interesting, as she clicked on the title.<br>\r\n<br>\r\n“Dear Jenni Weasley, Greetings on your thirteenth birthday. Today, you will discover your great strength and your true origin will be revealed. You’ll learn that you’re one of us. Have a Happy Birthday! Signed, Hercules, your real father.”<br>\r\nJenni gasped out loud. “Is this some kind of a joke?”<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\n“I’d better unplug my laptop!” Henry said, as panic set in. Flashes of light lit up the dark sky outside, and she could see the flashes through the window. <br>\r\n<br>\r\nJenni quickly shut down his laptop and unplugged the cable from the power. She did it just in time, as there was another loud rumble of thunder when the power went out for two seconds, before coming back on.<br>\r\n<br>\r\n“Me? The son of Hercules? That has got to be some sort of a joke!” Jenni murmured to herself, as she  quietly walked to the bathroom. She was only 5 foot 4 inches tall with short, light brown hair and brown eyes. She was skinny as a board and she only played a little tennis in middle school. She was just starting the seventh grade and she was certainly no athlete. She was very average in everything she did and she often got bullied since she wasn’t very big, tall, or popular.<br>\r\n<br>\r\nShe did her business before going back to bed.She knew that his mom loved him, even though she had been adopted as a baby. She had no idea who his real father was. She had told him that his father had died in Iraq. But, there was no way his father was a Greek God. Or, was there?<br>\r\n<br>\r\nShe woke up again that morning. It was a school day and she hated it. She flexed her biceps but felt nothing different. Jenni said ' well, it must be just a dream.  She got dressed and ate her breakfast.  <br>\r\nWhile she waited for the school bus, FATE had plans for her to discover her strength.  It happens </span></div></div>",
            "created":1510608660,
            "id":2414886,
            "title":"Female"
        },
        "1112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Henry Storm discovers his superhuman strength"
            ],
            "content":"<div class=\"\"><div> <span>Henry Storm woke up with a start on the morning of his thirteenth birthday by the loud rumble of thunder which could be heard from the distance.<br>\r\n<br>\r\n“Man… what a way to wake up…” he groaned, as he stumbled out of bed. He groggily looked at his digital clock, which indicated that it was only 4:55 AM in the morning. “I’d better unplug my computer!”<br>\r\n<br>\r\nHe moved his mouse over the mouse mat so that the screen came on, and he tapped on the keyboard, curiously looking to see if there were any new emails for him, before he would shut down the laptop and unplug it from the wall, due to the oncoming thunderstorm, which was so common in the state of Florida during the hot summer months.<br>\r\n<br>\r\n“Ahh… birthday wishes… more birthday… what’s this? ‘Greetings from the Greek Gods?’” Henry thought, as he was quietly reading the email subjects. The last subject sounded interesting, as he clicked on the title.<br>\r\n<br>\r\n“Dear Henry Storm, Greetings on your thirteenth birthday. Today, you will discover your great strength and your true origin will be revealed. You’ll learn that you’re one of us. Have a Happy Birthday! Signed, Hercules, your real father.”<br>\r\n<br>\r\n“Say what?” Henry gasped out loud. “Is this some kind of a joke?”<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\n“I’d better unplug my laptop!” Henry said, as panic set in. Flashes of light lit up the dark sky outside, and he could see the flashes through the window. <br>\r\n<br>\r\nHenry quickly shut down his laptop and unplugged the cable from the power. He did it just in time, as there was another loud rumble of thunder when the power went out for two seconds, before coming back on.<br>\r\n<br>\r\n“Me? The son of Hercules? That has got to be some sort of a joke!” Henry murmured to himself, as he grabbed quietly walked to the bathroom. He was only 5 foot 4 inches tall with short, light brown hair and brown eyes. He was skinny as a board and he only played a little tennis and volleyball in middle school. He was just starting the seventh grade and he was certainly no athlete. He was very average in everything he did and he often got bullied since he wasn’t very big, tall, or popular.<br>\r\n<br>\r\nHenry took a leak before going back to bed. He knew that his mom loved him, even though he had been adopted as a baby. He had no idea who his real father was. She had told him that his father had died in Iraq. But, there was no way his father was a Greek God. Or, was there?<br>\r\n<br>\r\n</span></div></div>",
            "created":1309669200,
            "id":1139690,
            "title":"Male"
        },
        "11121":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Justin takes Henry to the gym for a workout",
                "Henry grows even more at the gym down the street"
            ],
            "content":"<div class=\"\"><div> <span>Cindy Storm had woken up while the thunderstorm was still raging outside. She pulled out the small chocolate cake from the fridge and set it out on the dining table, so that her son would see it. She knew that her boy was an early riser, and she wanted to be ready for him when he would get up. The chocolate cake had the words “Happy Birthday Henry” written on it in bright blue frosting on the dark brown chocolate background, knowing that this was the type of cake that Henry requested every year for his birthday.<br>\r\n<br>\r\n“Mom…” Henry moaned, as soon as he got out of the bedroom.<br>\r\n<br>\r\n“Happy Birthday, sweetheart!” Cindy grinned, as she gave her boy a big hug. “I got you your favorite: Chocolate cake!” <br>\r\n<br>\r\nThe two sat down early in the morning as she cut two pieces from the cake and served them up on two small plates. <br>\r\n<br>\r\n“Thanks, mom…” Henry smiled, as he took his spoon and began to take a bite out of his first piece. <br>\r\n<br>\r\n“Justin, the boy next door, had invited you over to play video games when he’s up. I have to go to work, sweetie, so you got the house all to yourself, okay? Call me on my cell if you need anything!” Cindy said, as she continued to eat her slice of cake.<br>\r\n<br>\r\n“Thanks, mom! I’ll be here. I’m not going anywhere, with this bad weather. I’m just happy I don’t have to go to school in the pouring rain!” Henry noted, since it was in the middle of summer.<br>\r\n<br>\r\nCindy quickly finished her cake before she showered and got dressed to go to work. She worked in a large office building near the downtown area in Miami, and she was already looking forward to the weekend so she could take Henry to the beach.<br>\r\n<br>\r\n“Well, take care and lock the house if you go out to Justin’s. We’ll go to the beach this weekend, okay?” Cindy said, as she was about to walk out the door.<br>\r\n<br>\r\n “Okay, see you tonight. Bye, mom!”<br>\r\n<br>\r\nHenry finished his cake and put everything away in the fridge for later. Then he just put on his shoes and a pair of shorts and a t-shirt before he headed out to the house next door. As soon as he knocked on the door, a tall, lanky kid with curly hair opened up.<br>\r\n<br>\r\n“Hi, Henry! Happy Birthday, dude!” Justin said; as he held the door open wide for the shorter boy. Henry ran inside since the rain started up again, and the two sat down on the couch for a few minutes until Justin led him to the garage.<br>\r\n<br>\r\n“Dude, I wanna finish my work out before I hit the video games, okay? You can spot me if you want!” Justin instructed as he got down on the bench and wrapped his hands on the bar. He began lifting the bar up and started pressing the bar up and down as he lay flat on his back. Henry just stood there, where Justin’s head was, and looked down while he watched Justin do his work out.<br>\r\n<br>\r\nWhen Justin did his final rep, he struggled to lift the bar back up. It took him longer to raise the bar up to the metal post, where the bar would rest on. Henry saw that Justin was struggling with lifting the bar, and he realized that Justin needed help. He quickly reached under with his hands and grabbed hold of the bar, raising it up and gently placing the bar on the posts.<br>\r\n<br>\r\n“Dude! Are you okay? You had a hard time during that last rep!” Henry noted, as Justin got off the bench.<br>\r\n<br>\r\n“Yeah… I couldn’t lift it. Do you want to give it a try?” Justin asked him.<br>\r\n<br>\r\nHenry got on the bench and began lifting the bar with the weights. Immediately, he felt as if his arms and his pectorals began getting tighter and stronger. It almost seemed weird. It was as if his muscles started growing right away!<br>\r\n<br>\r\nHenry did about fifteen reps, when he set the bar back on the post. He wasn’t even tired at all! He sat up, and flexed his arm. He noted that his chest felt very firm and hard as well.<br>\r\n<br>\r\n“Dude! Have you ever worked out before?” Justin asked him.<br>\r\n<br>\r\n“No! This is my first time… ever!” Henry replied.<br>\r\n<br>\r\n“What? You look like… Your arms and your chest… You look like you’ve already gained some muscle! That is amazing!”<br>\r\n<br>\r\nHenry just shrugged. Nobody grows muscle that fast, could they?<br>\r\n<br>\r\n</span></div></div>",
            "created":1309669200,
            "id":1139769,
            "title":"Henry Storm discovers his superhuman strength"
        },
        "112":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, What sex are you?</span></div></span></div>",
            "created":1263704400,
            "id":821543,
            "title":"Superhuman durability"
        },
        "113":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Female",
                "Male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, What sex are you?</span></div></span></div>",
            "created":1263704400,
            "id":821548,
            "title":"Superhuman speed"
        },
        "114":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, What gener are you?</span></div></span></div>",
            "created":1263704400,
            "id":821549,
            "title":"Superhuman agility, flexibility and dexterity"
        },
        "115":{
            "choices":[
                "Get diffrent powers as you go (darker)",
                "Get diffrent powers as you go(lighter/not as freaky)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1263877200,
            "id":822856,
            "title":"other choices"
        },
        "1151":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or Female?</span></div></span></div>",
            "created":1263877200,
            "id":822857,
            "title":"Get diffrent powers as you go (darker)"
        },
        "1153":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Invisibility",
                "Vision powers",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Invisibility: power to make your self and your clothes completly invisible, you can also make others invisible, but that is exhausting.<br>\r\n<br>\r\nVision powers:explained inside.</span></div></span></div>",
            "created":1263963600,
            "id":823181,
            "title":"other"
        },
        "11532":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "All",
                "One"
            ],
            "content":"<div class=\"\"><div> <span>So do you get one Vision power or all of them?<br>\r\n(Listed below are all the vision powers, there definitions and what colour they have to be)<br>\r\n<br>\r\nHeat Vision: it has to be red, you can fire blasts of heat that burn, ignite, melt or destroy what ever they hit, you can also control there intensity,<br>\r\nFreeze Vision: it has to be light blue, you can fire blastes of pure cold that freeze whatever they hit, you can control there intensity<br>\r\nHypno-Vision: it has to be orange, you can fire rays that allow you to mentally program or control what ever you hit, it also works on animals,<br>\r\nForce Vision: it has to be purple, you can fire rays that allow you to make whatever the rays move, float or break, as long as the rays are still touching the object,<br>\r\nT-Vision: it must be grey, you can fire to beams of pure energy that can interact with objects like they were real, you can also control what shape they are and they can be any shape.<br>\r\nX-ray Vision: it has to be white, quite self explanitory, you can see through anything except lead, you can also control its intensity,<br>\r\nNight Vision: it has to be yellow, allows you to see perfectly in complete darkness, thanks to two yellow rays,<br>\r\nSize Vision: it has to be pink, allows you to change the size of whatever object it hits,<br>\r\nAge Vision: it has to be turquoise, allows you make any creature older or younger, to a point you decide, its quite tiering,<br>\r\nPlant Vision: it has to be green, you can fire beams that cause all plants to grow, you can also mentally control the plants after the ray hits them</span></div></div>",
            "created":1278219600,
            "id":911465,
            "title":"Vision powers"
        },
        "115321":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your hero will gain all the cool vision-powers!<br>\r\n<br>\r\nPlease select whether your hero is a male or a female!<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1278219600,
            "id":911718,
            "title":"All"
        },
        "1153211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Tom discovers other vision-powers",
                "Tom goes to visit his best friend first"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Thomas Dworakowski, you're 16 years old, and you're a sophomore in high school. It was the fourth week of the summer vacation, and you had just acquired a part-time job at a sandwich restaurant. During the day you help your mother around the house, and you take care of Lucas, your 12 year-old brother. Your parents are divorced and you're pretty much the man of the house.<br>\r\n<br>\r\nThat night, you're laying in bed, and you're having a hard time falling asleep. You look up through the large window, which is right above your bed, which is in the corner of your small bedroom, and you see what appears to be a falling star in the nighttime sky. Then, moments later, a bright light appears shining through the window, lighting up your bedroom.<br>\r\n<br>\r\n\"Oh man, why is someone shining their flashlight at my window?\"<br>\r\n<br>\r\nThe light grows brighter, and you can't even look at it.<br>\r\n<br>\r\nThen, out of nowhere, a man appears standing in your room. He is tall and muscular, and he's wearing a strange jumpsuit, all white. It almost looks like some sort of superhero costume.<br>\r\n<br>\r\n\"Thomas! You have been chosen to receive our special vision powers!\" the man spoke in an authoritative voice.<br>\r\n<br>\r\n\"What? Who... Who are y-y-you?\" You stutter, as you begin to tremble with fear.<br>\r\n<br>\r\n\"I cannot reveal my identity to you, my human friend... I don't have much time... My mission is to grant you your powers! When I'm done, your memory of this encounter will be permanently erased!\"<br>\r\n<br>\r\n\"Hey! W-what? What... What are you d-d-doing?\"<br>\r\n<br>\r\nThe strange being extended his right hand and aimed his index finger at your face. Then, a blue beam of light shot from the tip of his finger, striking you in the forehead, and instantly knocked you unconscious!<br>\r\n<br>\r\nYou woke up, hours later, not remembering anything that had happened and finding yourself all alone in the bedroom. Nothing was moved or touched, and everything seemed the same as before.<br>\r\n<br>\r\n\"Man... What a weird night...\" you say groggily, as you slowly roll out of bed.<br>\r\n<br>\r\nBy the bright light shining through the windows you could tell that it was already daylight.<br>\r\n<br>\r\nMom had already gone to work and Lucas was sitting in front of the TV, playing his video games, when you stumble into the kitchen.<br>\r\n<br>\r\nSuddenly, you hear the sound of a car passing and stopping in front of the house. You just look up, at the front door. Next thing you know, the door, and the entire front wall of the house seems to become transparent to you, allowing you to see the front lawn, the sidewalk, and the street, which ran in front of the house! You saw the mailman pulling up, and placing the mail in the mailbox!<br>\r\n<br>\r\n\"The mail just got delivered!\" you mumble out loud.<br>\r\n<br>\r\n\"How do you know?\" Lucas replied.<br>\r\n<br>\r\n'I... I just saw it!\" you say.<br>\r\n<br>\r\nLucas just turned and stared at you with a confured look on his face.<br>\r\n<br>\r\n\"What are you talking about? How can you see that from inside of the house?\"<br>\r\n<br>\r\nThen it dawned on you: You have x-ray vision!<br>\r\n<br>\r\n\"Oh man... I... Uhh... I have no idea how I did that...\" you whisper to yourself.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1278219600,
            "id":911719,
            "title":"Male"
        },
        "11532111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Tom uses his powers at the restaurant",
                "Tom shows his powers to his friend"
            ],
            "content":"<div class=\"\"><div> <span>You're pretty hungry in the morning and you had a craving for a bowl of Frosted Flakes cereal with cold milk.<br>\r\n<br>\r\nYou walk up to the fridge and grab the open cereal box with one hand. Then you go up to the cupboard and you grab a glass with the other hand. Now both hands are full, and you realize that you need to walk over to the table, set everything down, and then come back to the cupboard and get the bowl.<br>\r\n<br>\r\nThen it dawns on you, that you might have other vision-powers, and now would be a great opportunity to use them!<br>\r\n<br>\r\nYou stare at the bowl, which is on the top shelf, and you concentrate. Something inside of you tells you that you possess some kind of \"force vision\" in addition to the x-ray vision, which you had just used for the very first time.<br>\r\n<br>\r\nPurple beams of light shoot from your eyes and strike the bowl, making it rise up from the cupboard, hover towards you, and float in front of you as you turn and walk towards the dining table. There, you gently set the bowl on the table, and you cut off the \"force vision\".<br>\r\n<br>\r\nLuckily, Lucas didn't see any of it!<br>\r\n<br>\r\n\"That was so cool!\" you chuckle to yourself. \"I gotta test my other powers!\"<br>\r\n<br>\r\nYou eat your cereal and think about where you may go to test your powers later on. Of course, you know that you have to go to work that night as well...<br>\r\n</span></div></div>",
            "created":1278219600,
            "id":911720,
            "title":"Tom discovers other vision-powers"
        },
        "115321111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Tom arrives at work",
                "Something happens on the way to work"
            ],
            "content":"<div class=\"\"><div> <span>You decide to sit on the couch in the living room for awhile, watching your little bro play HALO on the Xbox. As you look around, you spot mom's little plant in the pot, that appears to be whithering.<br>\r\n<br>\r\n\"Oh man, I better give the plant some water...\"<br>\r\n<br>\r\nYou grab the little pot and take it to the kitchen, where you hold it under the faucet. After you give it a little water, you stare at it for a few seconds. <br>\r\n<br>\r\nYour plant vision kicks in, as green laser beams flash from your eyes and strike the plant, causing it to grow several inches taller!<br>\r\n<br>\r\n\"Whoa... That is just totally cool!\" you say with a wide grin on your face, as you carefully set the plant back on the coffee table. \"Mom will be happy with that!\"<br>\r\n<br>\r\nAs you look around some more, you spot the little, round ash tray on the coffee table. The ash tray was made of aluminum, and it was about three inches in diameter.<br>\r\n<br>\r\nYou let your size-vision kick in, as pink beams of light strike the ash tray, and enlarge it to 5 inches in diameter!<br>\r\n<br>\r\n\"Whoops! A bit too big...\"<br>\r\n<br>\r\nPink beams shoot from your eyes and hit it again, reducing the ash tray to 4 inches in diameter. You're happy now!<br>\r\n<br>\r\n\"Much better!\" you laugh.<br>\r\n<br>\r\nWhen it's almost time to go to work, you get up and gather your clothes. While you're in the shower, there is a brief power outage, which lasted about two minutes. During that outage, you were left completely in the dark, while you were stark naked in the bathroom.<br>\r\n<br>\r\nThen, broad, bright yellow beams of light came from your eyes, illuminating everything in front of you, like you had your own built-in flashlights inside of your eyes.<br>\r\n<br>\r\n\"Hey! This is pretty useful, having this night vision!\" you giggle.<br>\r\n<br>\r\nWhen the power comes back, you switch off your night vision.<br>\r\n<br>\r\n\"Ha ha! I don't need any batteries, either!\" you laugh, as you dry off and get dressed for work.<br>\r\n<br>\r\nFinally, you get outside and drive to work...<br>\r\n<br>\r\nYou wonder how much fun you'll have with your powers at the restaurant!<br>\r\n</span></div></div>",
            "created":1278219600,
            "id":911726,
            "title":"Tom uses his powers at the restaurant"
        },
        "1153211111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Tom uses his vision powers on his brother at home",
                "Tom shows his vision powers to one of his friends"
            ],
            "content":"<div class=\"\"><div> <span>You arrive at the restaurant and you're assigned two tables right away. You take their orders and you pass them along to the cooks in the kitchen. One of your guests, an elderly man, had ordered a hamburger. You serve him his burger and pour him a large sweet tea. Right away, he complains that his hamburger was cold.<br>\r\n<br>\r\nYou apologize and take his plate containing the burger and walk back to the kitchen. Inside, you see that everybody's super busy and nobody has time to heat up your burger. So, you quickly remove the bun, and fire up your heat vision. Red beams of light come from the pupils of your eyes and strike the beef, heating it instantly until it starts to simmer. Then, you cut of the heat vision, and replace the bun. You walk back to the table with a smile on your face.<br>\r\n<br>\r\n\"Here you go, sir\" you say politely, as you set the plate on the table. \"I heated it up for you. I'm sorry about that!\"<br>\r\n<br>\r\nThe man took a bite and smiled. He was happy. You knew you did good and you anticipated getting a good tip from him.<br>\r\n<br>\r\nNext, you served up some sweet tea but you forgot to pour some ice into the lady's cup.<br>\r\n<br>\r\n\"Young man! My sweet tea isn't cold!\" the lady complained.<br>\r\nYou take the cup and walk back to the bar, but the bartender still hasn't refilled the ice machine yet.<br>\r\n<br>\r\nSo, you think of a solution. You remove the lid from the cup and fire your freeze-vision, cooling the sweet tea just enough so that it doesn't turn to ice. You walk back to the table and set the cup back down.<br>\r\n<br>\r\n\"Here is your sweet tea, ma'am. Nice and cold!\" you tell her. \"I'm sorry about that!\"<br>\r\n<br>\r\nYou end up getting a good tip!<br>\r\n<br>\r\nIn the end, by the time it was time to go home, you were really happy you had your cool vision powers!<br>\r\n</span></div></div>",
            "created":1278306000,
            "id":912048,
            "title":"Tom arrives at work"
        },
        "11532111111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Time to hang out at the mall",
                "Time to meet up with some friends"
            ],
            "content":"<div class=\"\"><div> <span>You finally come home after a long afternoon and evening at work, feeling pretty tired but satisfied. After all, you made almost fifty Dollars in tips, and you made up for several stupid mistakes, thanks to your cool vision powers!<br>\r\n<br>\r\nAs soon as you walk in the door, Lucas comes jumping around the living room. You wonder why your little brother is still awake, at 11 o'clock at night?<br>\r\n<br>\r\n\"Lucas! Why aren't you in bed?\" you say to your 12 year-old little bro.<br>\r\n<br>\r\n\"I was home all day! I was bored!\" he whines. <br>\r\n<br>\r\nYou wish he were older so he could also go out and get a job, or at the very least, get a girl friend. Then it dawns on you...<br>\r\n<br>\r\n\"Hey, Lucas... See mom's plant and ash tray, on the table?\"<br>\r\n<br>\r\n\"Yeah! Did you make them bigger?\" he asks you.<br>\r\n<br>\r\n\"I wonder... if I have a vision that can make him older... Hmmm...\" you mumble to yourself.<br>\r\n<br>\r\n\"What's a vision?\" he asks you.<br>\r\n<br>\r\n\"Go stand by the coffee table for a sec, will ya?\"<br>\r\n<br>\r\n\"What are you gonna do?\"<br>\r\n<br>\r\n\"I'm gonna make you older!\"<br>\r\n<br>\r\n\"Oh COOL! Can I be older than you?\" he just had to ask that.<br>\r\n<br>\r\n\"Fine, Lucas... Now stand still, will ya?\"<br>\r\n<br>\r\nYou swear the boy can't stand still for three seconds!<br>\r\n<br>\r\nThere! Now, you fire the Age vision at him, with the intent of making it age your brother. As the turquose rays leave your eyes and strike Lucas in the chest, you see him suddenly growing taller and bigger at the same time! It's working!<br>\r\n<br>\r\n\"Oooohh Cooollll\" he says, as he feels his body expand rapidly.<br>\r\n<br>\r\nLucas' arms are growing longer and his feet are expanding. His hands are expanding, while his muscles are bulging everywhere. Your brother is aging before your very eyes, thanks to you! You see a 12-year-old boy go through puberty in a matter of seconds, as he passes through 13, 14, 15 years-old. He shoots up like a weed, and he's the same height as you in no time the moment he turns 16. Then, he passes you, as he grows older. Hair sprouts everywhere, and his face ages gracefully. He grows a thin beard and a mustache, while his muscles continue to expand. <br>\r\n<br>\r\nFinally, you cut off the hypno vision when you guess he has reached age 20.<br>\r\n<br>\r\n\"Whoa!\" Lucas says, in a deep, baritone voice. \"This is amazing!\"<br>\r\n<br>\r\nYou're now looking UP to your former \"little brother\", who is about 6 foot 4 inches tall.<br>\r\n<br>\r\n\"You were 4 years younger than me, and now you're 4 years older!\" you say to the big, tall man standing before you.<br>\r\n<br>\r\n\"Thanks, Tom... I owe you one!\" Lucas replies with a chuckle.<br>\r\n<br>\r\nThere, that took care of the little-brother-problem!<br>\r\n<br>\r\nYou realize that if you can make people older, you can also make them younger! You really begin to love your vision powers!<br>\r\n</span></div></div>",
            "created":1278306000,
            "id":912237,
            "title":"Tom uses his vision powers on his brother at home"
        },
        "115321111111":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "You went down the stairs",
                "you relised something"
            ],
            "content":"<div class=\"\"><div> <span>Smiling you walk up the stairs to bed, tommorow you had a the day off so you decided that you would go hang out at the malll, smiling you steatled down in your bed and then looking up for one last time you fired you force vision at the light switch and the room turned black, smiling you steled down, and in moments you were asleep.<br>\r\n<br>\r\nCrash<br>\r\n<br>\r\nYou jumped right up, what was that noise you had heard, you got up and thunbled serching for your tourch, then the memory of your powers came back to you, and you just let your night vision do the job, you paused and listened, and then again you heard the crashing noise, it was coming from below you, you looked at the ground and the yellow beams were replaced with bright white ones, you looked down at the darkness.<br>\r\n<br>\r\nOf course, you couldn't use to different visions at once, but it didn't matter because you saw what you needed to see, the small flickering beams of tourches, someone was burgling you house, quickly you ran to the stairs when...</span></div></div>",
            "created":1278392400,
            "id":912620,
            "title":"A unwanted visitor"
        },
        "1153211111111":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Fight back",
                "Just stand there frozen in fear"
            ],
            "content":"<div class=\"\"><div> <span>You shrugged and ran down the stairs, there in the center of the room stood the figure, \"Right\" you shoughted \"I don't know who you are, but get out\", the person turned round and you saw one of the most horrible sights ever, were the man face should be there was a large flat metal slab, with two red glowing slits for eyes, bolts were hamered in round the whole thing and on its chest it had two tape winders like really old computers.<br>\r\n<br>\r\nAt its full height it must have been about seven foot tall, all could manage was \"Wha wha what are you?\", the thing did not reply it just lumbered towards you, started you backed away, the thing looked at you and said \"Surender or perish\", it spoke in a low metalic deep voice, you looked at it, you had no idea what it was, or what was doing here, the only thing you knew was it was after you.<br>\r\n<br>\r\nThe thing was blocking the door and it was lumbering closer to you, it got closer and closer, as it did it raised two enourmous hands, and still it got closer...<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1278392400,
            "id":912663,
            "title":"You went down the stairs"
        },
        "11532111111111":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "You awake in some sort of a cell",
                "You awake in container of some sort, like a incubation chamber"
            ],
            "content":"<div class=\"\"><div> <span>Then it suddenly hit you, why were you cowering in fear you had super powers, shurlly you deafeat this hunk of tin, quickly you jumped up on to the coffee table and fired heat vision at full intensity at it, the robot twisted and lumbered towards you, the heat however was taking effect on it and as you watched it started to melt, the red hot liquid metal poured on to floor, but you didn't stop till all that was left of it was a white hot puddle.<br>\r\n<br>\r\nYou smiled and started figuring how you would explain this to mum, when suddenly through the window came you next opponent, this one looked more like the tin man from the wizard of oz, it was thin, narrow and looked strangely morre menacing then the first, the turned towards you and charged, you fired but dodged your blasts.<br>\r\n<br>\r\nWack, you were hit round the head by the thing, dazzed you tried to regain and fight back but the thing, clobered you in the stomach, winded you colaspsed, coughing blood, you looked up at it as it did one final kick and sent you flying, the last thing you saw before you passed out was the long thing reaching down to pick you up...</span></div></div>",
            "created":1278392400,
            "id":912700,
            "title":"Fight back"
        },
        "11533":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Radiation.",
                "Gravity."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Radiation: your body is constantly emitting high levels of radiation, you can release controlled bursts of radiation. Can affect atoms.<br>\r\n<br>\r\nGravity: you can manipulate gravity in various ways.</span></div></span></div>",
            "created":1308373200,
            "id":1129107,
            "title":"Radiation & Gravity."
        },
        "115331":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Male.",
                "Female."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?<br>\r\n<br>\r\nMale or Female?</span></div></span></div>",
            "created":1308373200,
            "id":1129114,
            "title":"Radiation."
        },
        "1153311":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "The Blessed show up.",
                "Nothing strange happens...yet."
            ],
            "content":"<div class=\"\"><div> <span>BEEP! BEEP! BEEP!<br>\r\n<br>\r\nArtemis groaned, trying to stay asleep despite the alarm. After a few attempts, his hand found the snooze button, stopping the constant beeping. He slowly sat up, his royal blue eyes slowly opening. As he went to get dressed for another day at school, he heard an audible clicking sound. Looking around, he saw it was the Geiger counter his dad had given him. Artemis had always been interested in anything nuclear, so his dad had given him an old counter from the power station he worked at. This time, however, the clicking sped up rapidly as Artemis picked up the counter.<br>\r\n<br>\r\n\"Huh, weird. It's never done that before.\" he said. After getting dressed, he put the counter in his bag, to see if it kept going like that. As he biked to school, he listened to the radio on his MP3.<br>\r\n<br>\r\n<i>\"In other news, there have been numerous outbreaks of crime throughout the world. Many of the witnesses reported the crimes were committed by children or teenagers with bizarre abilities, such as throwing a car through a wall. Apparently, these individuals call themselves 'The Blessed'. Anyone who sees one of these people is urged to call police as soon as possible.\"</i> they reported.<br>\r\n<br>\r\n\"No way. This is too weird.\" Artemis muttered, as he arrived at the gates to the school. After securing his bike, he met up with his friend Cynthia.<br>\r\n<br>\r\n\"Hey Artemis, you hear what they said on the news?\" she asked.<br>\r\n<br>\r\n\"Yeah.\" he replied.<br>\r\n<br>\r\n\"Think they'll show up here?\"<br>\r\n<br>\r\n\"Nah, nothing exciting happens around here.\" he replied, as the two headed off to class.</span></div></div>",
            "created":1308459600,
            "id":1129262,
            "title":"Male."
        },
        "11533111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Stay with Artemis.",
                "A month later."
            ],
            "content":"<div class=\"\"><div> <span>As the day went on, Artemis kept thinking. He couldn't work out why the Geiger counter was stiil reading far higher than normal. At the beginning of each class, the teacher would first warn the class about The Blessed, and to watch out for them. Finally, Artemis and Cynthia made it to lunch.<br>\r\n<br>\r\n\"Man, The Blessed sure ahve the teachers spooked.\" Artemis said.<br>\r\n<br>\r\n\"Yeah, but with those powers, why wouldn't they be worried?\" Cynthia asked him.<br>\r\n<br>\r\n\"I guess you-\" Artemis was cut off, as the wall they were all near was destroyed. As the dust cleared, three boys and a girl walked through.<br>\r\n<br>\r\n\"All right everyone! Don't move!\" ordered the tallest boy, clearly the leader. \"We are The Blessed, and we have reason to believe someone here has powers as well. They have two choices; die, or join us. So, which of you is it?\" Cynthia grabbed Artemis' arm, while Artemis suddenly wondered.<br>\r\n<br>\r\n<i>\"Could the Geiger counter's weird behaviour mean I'm the one they're after?\"</i> he thought. The boy, obviously irritated, turned to the girl.<br>\r\n<br>\r\n\"This is going nowhere. See if you can figure out who it is.\" he told her. The girl nodded, closing her eyes. After a few seconds, she opened them again. Then she pointed at Artemis.<br>\r\n<br>\r\n\"It's him.\" she said,<br>\r\n<br>\r\n\"You sure?\" he asked. The girl nodded. The boy then approached Artemis, as everyone else stared. \"So, what's it gonna be?\" he asked.<br>\r\n<br>\r\n\"No.\" Artemis replied.<br>\r\n<br>\r\n\"What;d you say?\"<br>\r\n<br>\r\n\"I said no.\" Artemis repeated. Then, some invisible force began choking him. Artemis fell to his knees, gasping for air.<br>\r\n<br>\r\n\"Artemis!\" cried Cynthia.<br>\r\n<br>\r\n\"Well then, time to die.\" announced the boy. Artemis was then thrown into the wall, leaving a small crater. As he struggled to his feet, he was hit by chunks of ice from one of the other boys. Then, Artemis felt a large pain shooting through his head.<br>\r\n<br>\r\n\"ARGH!\" he cried, kneeling on the ground clutching his head. At that moment, the leader of the group noticed the Geiger counter that had fallen from Artemis' pocket. Instead of a steady clicking, the device was screaming like a siren. Then, the third boy charged at Artemis.<br>\r\n<br>\r\n\"No, wait!\" the leader shouted. But the boy kept running. However, once he got close to Artemis, the boy screamed, before collapsing on the ground, dead.<br>\r\n<br>\r\n\"That idiot! Everyone back off! This guy's putting out serious radiation!\" he shouted. Turning to Artemis, he said \"You monster! Look at what you've done! You'd better leave this place before I kill you, and don't come back!\" Artemis realised the boy was right. He couldn't control his powers, and he was dangerous. Artemis concentrated, focusing the radiation around his body, By ionising the air, itr made surrounding air rush in, creating thrust. Artemis lifted up off the ground, before soaring away.<br>\r\n<br>\r\n<i>\"Cynthia, Mom, Dad, I'm sorry.\"</i> he thought, crying as he flew away.</span></div></div>",
            "created":1308459600,
            "id":1129337,
            "title":"A Power And A Curse."
        },
        "115331111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "He stays there",
                "He is driven out"
            ],
            "content":"<div class=\"\"><div> <span>As Artemis flew, a realisation hit him. He realised that the radiation his body was generating had to have come from somewhere else, otherwise it would stop after a while.<br>\r\n<br>\r\n<i>\"So that means, if my body absorbs radiation, I can survive on radiation alone.\"</i> he thought. After this, Artemis decided where he could go, so that there would be no people around, and the background radiation would be more than sufficient; Chernobyl. Aboandoned following a nuclear meltdown at the local nuclear reactor, the city had been a ghost town for years. His route decided, Artemis headed for Chernobyl.<br>\r\n<br>\r\n<b>A day later</b><br>\r\n<br>\r\nAfter what seemed like an eternity, Artemis landed on the outskirts of Chernobyl. It looked just like what the documentaries showed; buildings falling into disrepair, cars abandoned on the street, complete silence.<br>\r\n<br>\r\n\"Still, at least here, I can't hurt anyone.\" he said, walking off to look around. Surprisingly, he didn't find it as spooky as he'd imagined. It almost felt...peaceful. After a few hours wandering, Artemis found a building with a reasonably intact top floor, which still had galss in the windows and a decent view of the city, and the power plant beyond.</span></div></div>",
            "created":1308546000,
            "id":1129897,
            "title":"Learning."
        },
        "1153311111":{
            "author_id":"llamas2000",
            "author_name":"llamas2000",
            "choices":[
                "Artemis returns home, only to notice The Blessed have taken over.",
                "Artemis returns home, reunites with his family/friends, and continues his life."
            ],
            "content":"<div class=\"\"><div> <span><b>Before anyone asks, Sv/h is a way to measure radiation levels.  It stands for Sieverts per Hour.  uSv/h is microsieverts per hour, etc.</b><br>\r\n<br>\r\n\"Well, this seems like a nice place to live for a while.\"  Artemis said to himself, shedding a tear.  He realized that until he understood his powers, he's have to quarantine himself in the Chernobyl Exclusion Zone.  \"Well, for starters, my powers seem to be tied to radiation.  So, I need to lots of things out.\"  Artemis continued talking to himself.  \"Well, I'm obviously not harmed by the radiation.  So, there's that.  Maybe more radiation makes me stronger...\"  He pondered.  Artemis whipped out his trusty Geiger counter, and looked at the reading.  It said 5 uSv/h.  Higher than the average background radiation of Earth (0.1 - 0.2 uSv/h), but not high.  He decided to see if his physical strength was augmented by the radiation.  The teen walked up to a large wall, and punched it.  He noticed many small cracks in the wall that were not there before.  \"Now, let's go somewhere with more radiation.\"  He said as he walked out of the room.<br>\r\n<br>\r\n\"Chernobyl Reactor #4.  Caution, deadly radiation.  Perfect.\"  Artemis grinned as he entered the building.  He checked the Geiger counter, and noticed that it overflowed.  However, he realized that he was able to measure radiation levels himself.  He measured that the control room, where he was standing, was reading at 300 Sv/h.  To a normal person, this would mean a lethal dose of radiation in one minute.  However, radiation acted differently with Artemis.  He noticed that he felt very powerful in the room.  However, he was there for testing purposes.  He figured that if he was going to notice any differences in strength, it would be in this room.  Scanning the room, Artemis found a large piece of debris on the ground.  Artemis walked towards it, and tried to lift it.  While it was larger than him, he lifted the debris like a piece of paper.  \"Okay, more radiation equals stronger me.  Good to know.\"  Artemis said to himself as he put the debris down.  \"However, I need to figure out what exactly I can do, and how to make sure I don't continue emitting radiation.  I don't want to give people cancer.\"  Artemis used the same tactic he picked up in the school to fly out of the reactor, and into the heart of Pripyat, a city in the exclusion zone.  He noticed that the radiation calmed to a relatively low 1 uSv/h.  Artemis held his Geiger counter next to himself to see how much radiation he was emitting.  It read 10 uSv/h.  Too much.  He wanted to lower it to that of the natural background radiation of Earth, and somehow, it worked.  Artemis had no idea how he did it, but it worked.  \"So, if I can lower the amount I'm emitting, I must store it somewhere.  I wonder if I can use it as an attack or something...\"  Artemis wondered.  He did just absorb a lot of radiation in the reactor, so he theoretically could do something with it.  He tried concentrating the radiation in his body into a beam coming out of his hand.  Immediately, a beam of white shot out of his hand and impacted a building, causing a large explosion.  As the smoke subsided, he noticed the building was completely destroyed.  \"Okay, too much.  Maybe try something smaller.\"  He focused on making a beam again, but much smaller.  Another white beam appeared, and hit a tree.  Rather than cause a large explosion, there was a small explosion.  The tree did not survive it though.<br>\r\n<br>\r\nAs he continued testing out his beam power, trying to figure out how to control it's strength better, Artemis noticed that he started feeling weak.  He was using all his radiation reserves.  He needed more.  Artemis looked around, and noticed that there was a lot of radiation coming out of the site of his first beam.  He walked up to it, and noticed that there was a lot more radiation at that one site than he absorbed in the reactor.  Artemis found that he was a source of radiation.  He didn't just absorb it, he created it out of nowhere.  He violated the laws of physics.  \"Huh, that's very interesting.  I have an idea.\"  Artemis figured that if he wanted to stop The Blessed, he would need to become some kind of superhero.  He's always loved the idea of Iron Man, and how the suit was powered by the Arc Reactor.  Maybe Artemis could channel the radiation he created naturally to make his own kind of Arc Reactor, and become a real life radiation-driven Iron Man.  Artemis figured that if he could pull it off, he would.<br>\r\n<br>\r\n<b>One month of hard work, practice and learning new abilities later...</b><br>\r\n<br>\r\n\"All done!\"  Artemis smiled as he gazed upon his masterpiece.  \"I guess those engineering classes payed off.\"  Standing in front of him was a 6'4\" metal suit.  It was very similar in design to the iconic Mark VII Iron Man suit.  However, looks were the only similarity.  During the month he spent building the suit, Artemis learned that he could perform different kinds of radioactive decay on elements in metals.  He could also alter the properties of the metal so it could be what he wanted it to be.  In the case of his suit, nigh indestructible yet very flexible.  He also learned about his physics-breaking energy creation, and was able to use it to power the suit.  He also took a bunch of Uranium from the reactors and lined the interior of the suit with it.  That way, he was constantly absorbing more radiation.  Artemis also made sure that the suit was insulated enough to not let people outside be damaged by radiation from the inside of the suit.  While the interior of the suit averaged 100 Sv/h, right outside never reached above 1 uSv/h, which is a very safe amount.  That's about as much radiation as a bushel of bananas.  When in the suit, Artemis had super strength (100 tons), heightened agility, supersonic flight (Mach 3), the beam ability, and the ability to control radiation outside of the suit.  The suit, as stated prior, was nigh-indestructible.  Bulletproof, concussion proof, and able to take a very strong beating.  The suit is durable enough to withstand a tactical nuke, extreme temperatures, underwater pressure up to a depth of 1 mile, space, and a blow equivalent to being hit by a tank going 100 mph.  Needless to say, this suit was very strong.  Artemis was very proud of his creation.  He put on the suit, and flew back to his hometown, ready to take on The Blessed.<br>\r\n<br>\r\nEnd of Chapter.</span></div></div>",
            "created":1462598520,
            "id":2144252,
            "title":"Learning Control"
        },
        "115331112":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Artemis returns.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>It had been a month since that day at Artemis' school. Since then, he'd been living alone within the highly radioactive city of Chernobyl. With no other people around, he couldn't hurt anyone. Also, he'd discovered that he could live off natural background radiation, meaning the location was perfect. However, Artemis was still worried about what The Blessed might be doing back home. So, he decided to create a suit that would contain the radiation he gave off, meaning he wouldn't have to worry about accidentally killing anyone again. The suit would need to be big however, as due to the radiation, Artemis had quickly grown to 7 feet tall.<br>\r\n<br>\r\nFirst, he went around the city, collecting all the steel he could find. After a week, he had roughly ten tonnes of it. By using his radiation, he altered the steel's structure to be like that of diamond, increasing its strength by about 100 times. Then, he forced the atoms as close together as possible, to the point where the electrons were touching nuclei. This meant that the new steel took up the same space as 100kg of normal steel. After this, Artemis shaped the steel into a suit of armour, giving it a very squared appearance, since he wasn't going for aesthetics. Despite the suit's immense weight, by fitting powerful motors, Artemis could easily move around in it. The motors and the suit's systems, such as navigation, were powered by a small reactor driven by Artemis' own radiation, preventing a build up and explosion. To get off the ground, the suit was equipped with twin rocket engines on the back, and one on the back of each leg. However, as these were special nuclear-propelled rocket engines, they would never run out of fuel, and each produced roughly 100,000lb of thrust, more than enough to get the suit aitborn, and up to a speed of at least Mach 2. Also, the huge density of the steel meant that it was virtually indestructable, short of a nuclear bomb blast.</span></div></div>",
            "created":1308546000,
            "id":1129964,
            "title":"Power Contained."
        },
        "1153311121":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Cynthia takes Artemis to his parents. Artemis explains what has happened.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>It had been almost two months since Artemis had left. Cynthia still hoped that he would come back soon, especially since The Blessed had been increasing their numbers. She was especially afraid, because one of her other friends, a girl named Anna, had told Cynthia that she had powers as well. Her power was telepathy, so she'd been able to hide from The Blessed for quite a while, but she was worried that they would find her soon.<br>\r\n<br>\r\nOne day, Cynthia and Anna had been talking during lunch, when the same group of Blessed from two months earlier, minus the boy that Artemis had accidentally killed, stormed into the school again. Anna threw up her telepathic barrier, hoping to conceal her powers.<br>\r\n<br>\r\n\"All right people, we know someone else here has powers. Now, this time we'll do things differently. If you don't join us, we'll start killing each of you until you decide to fess up!\" the leader announced, as one boy in the group created a  wall of ice, trapping everyone inside. The girl again searched for the person they were looking for. Despite Anna's best efforts, the other telepath was too powerful and broke through her barrier.<br>\r\n<br>\r\n\"It's her.\" the girl said, pointing at Anna. However, before the leader could respond, a loud rumbling sound was heard. The leader turned around, as something dropped from the sky and slammed into the ground. As the dust settled, it revealed a large humanoid figure, covered in thick, genmetal-grey armour, red eyes glowing in its helmet. Another red light, circular this time, glowed in its chestplate.<br>\r\n<br>\r\n\"What the hell? Titan, get rid of that pile of scrap metal.\" the leader shouted, gesturing to the tall, strong boy behind him. Titan nodded, charging towards the figure. His fist slammed into its chest with such force that the air shook. Amazingly, the armoured figure didn't budge. Then, it grabbed Titan's head with its large armoured gauntlet, lifting him off his feet. Suddenly, a red-coloured wave of energy erupted from the gauntlet. Titan screamed, as the energy coursed through his body. After a moment, his head exploded, blood splattering over the figure's armour. The figure slowly started to walk forward, its armour clanking loudly with each step.<br>\r\n<br>\r\n\"You monster!\" yelled the leader, trying to lift the figure with his telekinetic powers. However, he discovered the armour was so dense, that he couldn't lift it, no matter how hard he concentrated. The girl tried to blast the figure's mind, but the armour's density meant her thoughts couldn't get through.<br>\r\n<br>\r\n\"Leave, now!\" shouted the figure, raising its right gauntlet again. The Blessed, already terrified, ran ffor their lives, desparate to get away from this nightmarish thing in front of them. The figure then approached Cynthia and Anna. the twpo girls screamed, afraid of what the armoured figure might do.<br>\r\n<br>\r\n\"Please don't be scared. I don't want to hurt you\" the figure told them, its deep voice now quiet. It then knelt in front of the girls. \"Are you alright, Cynthia, Anna?\" it asked.<br>\r\n<br>\r\n\"H-How do you know our names?\" Cynthia asked, still frightened.<br>\r\n<br>\r\n\"Cynthia, it's me.\" the figure replied, removing its helmet. Cynthia gasped. Even though his hair was now bleached white, presumably a side effect of the radiation, and his eyes were glowing green, she recognised that smile.<br>\r\n<br>\r\n\"Artemis?!\" she gasped, her eyes brimming with tears. Artemis nodded slowly.]<br>\r\n<br>\r\n\"I'm glad you're still okay.\" he said. He was surprised when Cynthia hugged him tightly, despite the blood on his armour. Artemis placed his hand on her back, careful not to crush her with his armour's strength.</span></div></div>",
            "created":1311829200,
            "id":1156251,
            "title":"Artemis returns."
        },
        "12":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Telepathy",
                "Teleportation",
                "Telekineas",
                "Mind control",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>A)Telepathy, you can read minds and send telepathic signals.<br>\r\n<br>\r\nB)Teleportation, you can  teleport to anywhere. Warning teleporting inside something will very badly wound or even kill you, also the further you teleport the more exhausting it gets.<br>\r\n<br>\r\nC)Telekinease, you can make objects move or break with the thought, the limit in how much you can move is your choice, but the heavier the more exhausting. You can also use to make your self fly. <br>\r\n<br>\r\nD)Mind control, you can take control over anyone or any animal, there are only three rules, rule 1: you can't make them do something that they would never do (IE you can't make some one who is affraid of water learn to swim), 2: you can't have them kill them selfs, 3: you can control only five people at one time, but it is at that point exhausting. </span></div></div>",
            "created":1263704400,
            "id":821473,
            "title":"Mental"
        },
        "121":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Female",
                "Male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, what gender are you?</span></div></span></div>",
            "created":1263704400,
            "id":821551,
            "title":"Telepathy"
        },
        "1211":{
            "choices":[
                "It was Toby.",
                "It was someone else.",
                "She didn't bother to find out who it was and kept walking."
            ],
            "content":"<div class=\"\"><div> <span>Clarice walked down the street, holding her bag with one hand and pressing her forehead with the other. She had been experiencing weird things since the morning.<br>\r\n<br>\r\nWhen she was heading to her class, she heard a teacher badmouthing the principal, and when she turned to look at the teacher, she was just looking out of the window.<br>\r\nWhen the teacher asked the class a question, she heard someone answer. She looked around to look for the source of the voice.<br>\r\n\"No one knows the answer to this question?\" The teacher said with a stern look. Clarice was puzzled. \"Someone answered just now,\" she thought to herself.<br>\r\n\"If I just keep quiet, she'll keep blabbering until class is over,\" The voice ended with a chuckle.<br>\r\nClarice looked beside her. Three seats away, she could see Toby, the smartest in class. He was sneering while looking at the angry looking teacher.<br>\r\n<br>\r\nClarice could not understand what was happening to her. She pressed her forehead harder. She was so preoccupied with the strange happenings that she paid no attention to where she was walking and bumped into someone.</span></div></div>",
            "created":1277874000,
            "id":909219,
            "title":"The Symptoms"
        },
        "12113":{
            "choices":[
                "She said she was fine, got up, and walked away",
                "She said she was scared and needed help"
            ],
            "content":"<div class=\"\"><div> <span>The voices in Clarice's mind had started to outnumber her ability to endure that pressure. Suddenly, she fell to the floor beneath her and one of the teachers rushed towards her. \"Are you okay?\" asked the teacher. What did clarice answer?</span></div></div>",
            "created":1280034000,
            "id":924070,
            "title":"She didn't bother to find out who it was an..."
        },
        "121131":{
            "choices":[
                "She asked the lady to leave her alone and ran off.",
                "She felt that the old lady knew something, so she decided to talk to her."
            ],
            "content":"<div class=\"\"><div> <span>Clarice walked outside the school, something made her feel stronger. At a distance she spotted an old woman staring at her, \"what are your staring at old lady?\" thought clarice to herself. \"Nothing really, you just look troubled\" Clarice heard a voice. She was shocked, especially when the old lady started walking towards her. What did clarice do?</span></div></div>",
            "created":1280034000,
            "id":924083,
            "title":"She said she was fine, got up, and walked away"
        },
        "121132":{
            "choices":[
                "He asked clarice to go see the nurse and leave home.",
                "He asked clarice to have a little talk with him and tell him how she was feeling"
            ],
            "content":"<div class=\"\"><div> <span>The teacher looked amazed at Clarice and felt very confused to see her cry that way. He helped her up and said that it would be better if she rested for a while. Clarice was astonished by her teacher's response, so she yelled out loud, \"I'm not lying! There's something wrong and I'm terrified!\" What did the teacher do next?</span></div></div>",
            "created":1280034000,
            "id":924076,
            "title":"She said she was scared and needed help"
        },
        "122":{
            "choices":[
                "Fredwick Jones-SpiritChild or The Shadow",
                "Jennie Knox- Wind Spirit or The Escapist"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>title says it.</span></div></span></div>",
            "created":1281416400,
            "id":933842,
            "title":"boy or girl"
        },
        "123":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you Male or Female?</span></div></span></div>",
            "created":1265950800,
            "id":835199,
            "title":"Telekineas"
        },
        "1231":{
            "choices":[
                "On the way...",
                "You fall asleep during the car and awake at your destination..."
            ],
            "content":"<div class=\"\"><div> <span>Shane was walking home from high school, fuming about the crazy project due the next day.   It had been issued by none other than the insane horror that goes under the name of Vick Arwood, a teacher at his school.   His anger smoldered even more when he remembered that the only reason he had to do this task, was because some idiot kid had to open his smart mouth for five seconds.   The result ended in the hulk of an assignment due tomorrow.<br>\r\n<br>\r\nSuddenly he heard what sounded like someone balling their eyes out in a nearby alley.   It sounded like a man, and his voice was wailing, as if he was in agony.   Shane walked over to see what was going on, he heard whispered voices.   Suddenly Shane was surrounded by three men, the \"crying one\" (who seemed to be the leader) flanked him from the front, while the other two had him from the back.   <br>\r\n\"Give us all the money in your wallet!\" demanded the leader, a tall muscled man wearing sunglasses and a bandana around his head.<br>\r\n\"Yeah, and all your loose change,\" shouted the smallest of the three, still quite bigger than Shane.   He was then smacked across the head.   \"Shut up Jerry,\" said the other man, who was only wearing a vest and was coverd in tattoos.<br>\r\n\"You always make us sound like a bunch of idiots,\" he continued.<br>\r\n\"You can't make anyone sound like anything their not,\" Shane muttered under his breath.<br>\r\n\"That's it!\" shouted tattoos, and he came at Shane with a punch to the gut.   Shane dodged and kneed him in the face, only sucseeding in bloodying his nose a little.<br>\r\n\"Ooh, tough guy,\" said the smallest and Shane replied by punching him in the gut.<br>\r\n<br>\r\nYou then fell over, feeling like a hammer just smashed in your skull.   The leader had slugged you and the blow sent you off your feet.   You were then picked up, by other two and, outmatched, they took all Shane's money and possesions.<br>\r\n  <br>\r\n\"Let's go,\" says tattoos, seeming nervous, but was still holding you, along with the smaller one.<br>\r\n\"I don't know,\" starts the smaller one himself, \"he did screw your nose up, mabey you should teach him a lesson,\"<br>\r\n\"sure but keep him still,\" says tattoos laughing.<br>\r\nAt the moment you are more than furious.   You just wished that you could... i don't know stop them somehow, hurt them.   Blow himself out of the guy's grasp.   Suddenly, Shane feels immense energy that just had to come out, so powerful that it felt that the smaller one's grasp was flimsey.<br>\r\n<br>\r\nHe couldn't take it any more, he let the energy out and he found himself free.   The man who was holding you was knocked against the wall.   Confused but almost understanding, Shane focused on a trash can, and imagined it hitting tattoos.   He felt a small strain, then the can catapulted into him, knocking him out.<br>\r\n<br>\r\nFinally their was just the leader, standing amazed.   Shane narrowed his eyes and sent the man flying up, and then crashed him on the ground, knocking him out.  <br>\r\n<br>\r\nSuddenly you notice someone behind you.   She was a small woman who looked very bookish.   She didn't look at all suprised at what just happened.   \"Come with me,\" she ordered in a bored voice and started walking.   Confused, you follow her to her car, and she drives off with you.</span></div></div>",
            "created":1265950800,
            "id":835228,
            "title":"Bad, to worse, to just plain WHAT"
        },
        "12311":{
            "choices":[
                "Ann starts up a conversation...",
                "You arrive at your destination..."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, whats going on?\" Shane asks dazed for some reason.<br>\r\n\"I'm taking you to a special school,  where they will teach you to use your power,\" she explains, still in a bored voice.<br>\r\n\"Oh, because I was wondering why you didn't run away screaming,\" he says, still feeling like he is missing something vital, usually he wouldn't have gone into the car, but when he thought about it he stopped thinking about it.   As if he had ran out of thought for that time, and everything seemed natural.   Like he SHOULD be their.<br>\r\n\"Even if I didn't know about the powers people can posses,\" she explains, as if talking to a child, \"I don't think that I would run around screaming, for one, I am old as you see and can't go running around all crazy.   And two, not everyone is your steriotype citizen, everyone has different reactions to different situations,\"<br>\r\n\"Oh,\" Shane said simply, like before usually he would have more to say, but he couldn't think of it. <br>\r\nThey two sit for awhile in silence.   Shane is bored out of his mind but for some reason he doesn't want to say anything.   It's a strange feeling.   The weird thing is, he would usually  think he would be pretty annoyed.   But for some reason he is just content (but somehow bored at the same time) to just sit their.<br>\r\nShane decided that he didn't want to be silent, no matter how strange this is.   So he started the conversation up again.   \"So what is your name?\" he asks, feeling proud that he fought back the feeling,\"<br>\r\n\"Its Ann,\" she says in an annoyed voice.<br>\r\nSuddenly Shane grasps it, he shouldn't be here and he should be asking more important questions.   \"Hey do you have any powers?\" he asks.<br>\r\n\"Yes,\" she says.<br>\r\n\"What can you do?\" Shane asks.<br>\r\n\"Actually, I can make people to do almost anything I want, which is how I got you in here, actually most people can't struggle past the first wave I send toward them, but maybe your just stubborn,\" she explains.<br>\r\n\"Oh,\" Shane thinks that there was a compliment somewhere in their, but the feeling came back again.   He didn't fight it this time.<br>\r\n </span></div></div>",
            "created":1266382800,
            "id":838061,
            "title":"Short explanation"
        },
        "123111":{
            "choices":[
                "Continue asking",
                "You arrive at your destination"
            ],
            "content":"<div class=\"\"><div> <span>\"Now,\" Ann says, \"Do you know how you found your power?\"<br>\r\n\"No. It just came out like... I can't even describe it.\"<br>\r\n\"Hm. That's how it often starts. Virtually every hero started that way.\"<br>\r\n\"Speaking of which, why haven't I heard of any people like this?\"<br>\r\n\"There are two main reasons. One, people are often scared of what's different. Second, they don't know how we are going to use them. So news networks and the government have done their best to suppress the information. Sometimes to the extent of killing people.\" Shane just looks at her, hoping for her to crack a smile. She doesn't. Wow, Shane thinks. This is some serious business. <br>\r\n\"Is there any limit to what super powers a person can have?\"<br>\r\n\"Not as far as I can see. Some powers I've seen are pathetic. There was one person who could transform their hands into any inflatable object. Others, however, are incredible. One called himself Midas. You know the story?\"<br>\r\n\"Yeah... So this school-\"<br>\r\n\"That you will find out in due time.\"</span></div></div>",
            "created":1275714000,
            "id":894826,
            "title":"Ann starts up a conversation..."
        },
        "1231111":{
            "choices":[
                "She realizes what your doing",
                "You keep up the conversation until you get to your destination"
            ],
            "content":"<div class=\"\"><div> <span>Shane still wants to know, so he devises a strategy, hoping to open up one conversation to unlock another.   He decided with the previous one,<br>\r\n\"so Medusa,\" he trailed off.<br>\r\n\"Yes, yes,\" says Ann exasperatedly, \"she had the power to turn those who look upon her to stone.   Pity, I heard she was a charming young lady, not at all like that 'hero' said of her.\" she finished not sounding sorry at all.<br>\r\n\"So wait, is like, 'The Hulk' real?\" you ask, knowing the answer already.<br>\r\n\"What?   That's just pure nonsense, I hope your not as dull as you seem boy,\" she pauses and adds reluctantly, \"but Spider man is real.\"<br>\r\n\"What kind of other powers do people know of?\" Shane asks.<br>\r\nAnn seemed to be getting very miffed, \"Vampires, Werewolves!   Think!   We just made them out to be a fairy tail, but their are some people with powers like that.\"<br>\r\n\"Do you know many?\" you ask inncoently.<br>\r\n\"Well I am sort of a teacher their,\" she says, \"but only a very small amount, I mostly only gather new students.\"<br>\r\n\"What bugs you the most about the school?\" you ask. </span></div></div>",
            "created":1276059600,
            "id":897200,
            "title":"Interagation Methods"
        },
        "12311111":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "The frist option",
                "The third option"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you pick that option or do you pick the option third option?</span></div></span></div>",
            "created":1277787600,
            "id":908667,
            "title":"She realizes what your doing"
        },
        "123111112":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "You woke up in a bed somewhere ",
                "You woke up in a hospital bed"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly fromm out of the sky came an enourmos orange blob like thing (it must of been about fifteen feet tall), it let out an unholey roar and with a swish of its arm sent the car fly. Ann grabbed your arm and pulled you out through the door, she gracefully, you not so. You both turned to look at your attacker, Anns expresion changed to shock and in a dead breath said \"el sinecho\". You looked at her, \"What\" you said. But before she could answer the beast turned and charged towards you, Ann turned to you and said \"Run, I'll stop him\", you looked at her in disbelief, but she just shoughted \"go\", and you ran.<br>\r\n<br>\r\nLooking back your saw her, she put her hand to her and head and consentrated on the beast, but thing wouldn't stop, it snalled and jumped at her, she dived and did a perfect rowl and evaded it, but for its size it was extrodinarly fast, it turned and whack, its long lizard like tail connected with her and she went flying. She landed around twenty foot away, the thing turned and prowled towards her, you couldn't let that monstrosity kill her, taking in all your courage you climed out from behind the wall and shoughted \"O Ugly, leave her alone, whats the matter not brave enough to get me, your humongous blod of orange fat\", it heard you and snalling charged towards you. Quickly you searched your self for the power, but you could not find it, and before you could react it was leaping through the air towards you.<br>\r\n<br>\r\nForetunatly for you the fact you did gymnastica and were physically nimble ment you managed to move out of the way just before it landed, unfourtanly you weren't fast enough to dodge its tail and like Ann you were sent flying, fortuanlly you managed to stay consius, but before you could react the thing turned round and jumped at you, you tried to escape it but you couldn't and the thing sent you flying, it let out what seemed to be a chuckle, now this made you mad, and thats when it hit you.<br>\r\n<br>\r\nAnger, that was it, when you first used your powers in the alley, you had been angry, and now you thought about it, strange things had always happened when you were angry, when you were fired from your first from your first job, the electrics burst, when simon mesably stole your girlfriend his house burned to the ground, and when you were very young you had memories of things falling or shatering when you through at tantrum, you consentrated on all the things that annoyed, that assesment, that annoying brat across the street, simon gibson, and you felt the power building inside you, it was growing it needed to come out at some point but you still surpressed it, you new that you couldn't let it out, at least not yet, you looked up the creature was feet from you, it jumped folward its arm out first, it was going to hit you, you waited then at the last minute you let it go.<br>\r\n<br>\r\nThe creature was sent flying in to the wall, but that didn't stop it it jumped out and charged you, but you were ready it swung it fists but deflected each punch and waving you han you knocked it back again, snalling it swung and surprised you its tail sent you flying again, you landed on the ground with a fund looking round you saw you were in a construction site, you sucked in your power and with every bit of power you possesed you consentrated, every brick, slab and and stone shot into the air and crashed into the beast, at first it worked but then the thing started fighting back, waving its arms it smashed threw your projectiles and charged towards you, you a different stratergy and then one occured to you.<br>\r\n<br>\r\nThe bricks and slabs and stone stopped flying and just plummited to the ground, you consentrated and held you power in, and let grow, strugling you thought about every thing in your life that you hated, anything and everything that annoyed you, and let that add to the power, you could feel it growing inside you, growing larger and larger, you had to keep it inside you, you consentrated, harder than you ever had before, your muscles felt they were going to burst, your eyes were poping out of their sockets, your cloughs started to rip, but still you kept it in, the creature at this momment was feet away, snalling it jumped towards you, you smiled and the last minute let it out, in that split second before you did the thing saw it in your eyes and tried to stop its self, but it was to late, the thing was sent flying, up, up and up again then with a far greater force it was pulled down and plumeted into the earth, it basically exploded, and the whole area was covered in orange goo, the last sight you saw before you pasted out was Ann, she looked at you with an expresion of shock, she had seen the whole thing...</span></div></div>",
            "created":1277787600,
            "id":908695,
            "title":"a suprise attack"
        },
        "124":{
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>male or female?</span></div></span></div>",
            "created":1275541200,
            "id":893612,
            "title":"Mind control"
        },
        "1241":{
            "choices":[
                "his house",
                "a park",
                "a school"
            ],
            "content":"<div class=\"\"><div> <span>Wolf was walking home from school thinking how boring his class is nothing ever happened in it he open his mouth to correct the teacher and he could not help but make it sound like a insult. Well it was funny he thouht to him self how red the teacher got wen he said it. But now he had to make a scale repica of one of the devinchy works. he was just going to make a simple brige that devinchy came up with. as he walk he saw two guy fallowing him. Wolf duck in to a store he thought when he look around he found him self in a empty aley way.<br>\r\n\"hay Kid give us your mony and we might let you live.\" one of them said as he came closer.<br>\r\n\"Don't try to be a hero Just give in.\" the other guy said as he pulled a knife out of his pocket.<br>\r\nthey moved him in to a corner he had no where to go they moved closer.<br>\r\nSuddenly his vison as blurly and he could see him self all so he felt some thing in his hand he look and saw the knife he was in the guy mind he wastedno time and stabed the guy next to him. the same time Wolf real body move in the short gab and ran as he let the two fight it out. he finnly stop at </span></div></div>",
            "created":1275541200,
            "id":893619,
            "title":"male"
        },
        "12412":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Wolf stayed in the park",
                "Wolf went to a friend's house"
            ],
            "content":"<div class=\"\"><div> <span>Wolf ran as fast as he could from the thugs who tried to attack him and rob him in the deserted alley, and ended up at the public park, which was three blocks away, and across the street.<br>\r\n<br>\r\nHe was tired and thirsty, but luckily there was a water drinking fountain there, where he was able to get a drink of water. He sat down on the park bench, where he tried to clear his mind and think about what had just happened a few minutes before, in the alley. He realized that he came dangerously close to being robbed, or even stabbed with a knife, but in the end, he was able to enter his attacker's mind and make him stab one of the other guys instead! It was as if he could control the minds of other people! Did he possess some kind of super power?<br>\r\n<br>\r\nJust then, he heard a girl screaming from a distance.<br>\r\n<br>\r\n\"Stay away from me!\"<br>\r\n<br>\r\nWolf got up and ran towards her voice and spotted a tall boy running after a younger girl. The girl seemed about 12 and the boy was about 15 or so.<br>\r\n<br>\r\n\"It's my lunch money!\" the girl shouted.<br>\r\n<br>\r\n\"Give it to me!\" the boy yelled back.<br>\r\n<br>\r\n\"Hey! Leave her alone!\" Wolf said to the boy.<br>\r\n<br>\r\n\"Mind your own business, you twerp!\" the boy said. Clearly, the boy was taller and stronger than Wolf, who was only 13.<br>\r\n<br>\r\n\"Go away!\" Wolf shouted back.<br>\r\n<br>\r\n\"I'm gonna break your neck...\" the boy said, in a threatening tone of voice, as he approached Wolf.<br>\r\n<br>\r\n\"GO AWAY!\" Wolf shouted again.<br>\r\n<br>\r\nThen, the boy suddenly turned around, and started to run. <br>\r\n<br>\r\n\"Hey! I'm.... What... is... going... on...\" he panted, as he started to run farther and father away from Wolf and the girl.<br>\r\n<br>\r\nThe boy ran and ran, until he was out of sight. That's when he stopped running.<br>\r\n<br>\r\nThe boy then turned around and started running towards Wolf.<br>\r\n<br>\r\n\"Run around those trees over there!\" Wolf commanded, while pointing at three trees, which were located close to each other.<br>\r\n<br>\r\nThe boy jogged over to the trees and started running laps around them, in a wide circle, until he nearly collapsed from exhaustion.<br>\r\n<br>\r\n\"He won't bother you anymore...\" Wolf said to the girl. \"Are you alright?\"<br>\r\n<br>\r\n\"Yeah.... How... How did you do that?\" she asked him.<br>\r\n<br>\r\n\"I... I don't know...\" he replied.<br>\r\n<br>\r\nThen he turned around and walked away. He stopped by the tree, and saw the boy, who was breathing very deep. He was extremely tired and his face was all sweaty.<br>\r\n<br>\r\n\"Leave the girl alone!\" Wolf said to him.<br>\r\n<br>\r\nHe just stared at him, with a touch of fear in his eyes.<br>\r\n<br>\r\nWolf then turned around and walked away.<br>\r\n<br>\r\n</span></div></div>",
            "created":1278306000,
            "id":912264,
            "title":"a park"
        },
        "124122":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Wolf tells Jake about his powers",
                "Wolf decides to keep his powers a secret a little longer"
            ],
            "content":"<div class=\"\"><div> <span>Wolf turned around and walked along the outer edge of the park, which was luckily inside a large neighborhood subdivision, where he lived. It was summer, in the middle of July, and he had nothing else to do, so he just stumbled around for awhile. <br>\r\n<br>\r\nFinally, he came across a grass field where he spotted two boys, who were wearing soccer cleats, socks, shorts and jerseys, and they were kicking around a soccer ball. Wolf recognized them as Jake and his younger brother Kyle, who lived just down the street from his house. Jake played on the same soccer team as Wolf did, on Saturday mornings.<br>\r\n<br>\r\n\"Hey, guys! What's up?\" Wolf said to them.<br>\r\n<br>\r\n\"Yo, Wolf! Kick it back!\" Jake said, as he sent the ball straight to Wolf.<br>\r\n<br>\r\nWolf stopped the ball from rolling past him, with his right foot, before he kicked it back to Jake.<br>\r\n<br>\r\n\"Hey! What about me?\" Kyle cried out.<br>\r\n<br>\r\nJake just ignored his little brother and kicked the ball back to Wolf, but this time, Wolf kicked it to Kyle instead.<br>\r\n<br>\r\n\"Kick it over here, Kyle!\" Jake ordered.<br>\r\n<br>\r\nBut Kyle just kicked it to Wolf, when Jake ran in front of him, and intercepted the ball. Jake rolled the ball out of the way, until he was standing farther away from both Kyle and Wolf.<br>\r\n<br>\r\n\"Hey! That's cheating!\" Kyle protested, as Jake kicked the ball back to Wolf.<br>\r\n<br>\r\n\"Come on, you guys! We can all play!\" Wolf sighed.<br>\r\n<br>\r\n\"Jake's not sharing!\" Kyle protested.<br>\r\n<br>\r\n\"Okay... Jake, pass to Kyle!\" Wolf ordered, after he had kicked the ball back to Jake.<br>\r\n<br>\r\n\"What? But I don't wanna... Uhh...\" Jake began to say, when Wolf concentrated his power on him.<br>\r\n<br>\r\nThen Jake looked down at the soccer ball and kicked it straight at Wolf, who kicked it to Kyle.<br>\r\n<br>\r\n\"Now, kick it to me!\" Wolf told Kyle.<br>\r\n<br>\r\n\"What... Oh... Okay...\" Kyle replied, who kicked it right back to Wolf.<br>\r\n<br>\r\nWolf just smiled. He didn't really want to use his mind control powers on his best friends, but it was the only wat to stop the two brothers from arguing.<br>\r\n<br>\r\nAfter they had finished kicking the ball around for a few minutes, they decided to walk over to Jake and Kyle's house for a little while...<br>\r\n</span></div></div>",
            "created":1278478800,
            "id":913567,
            "title":"Wolf went to a friend's house"
        },
        "1241221":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Wolf shows Jake more mind control tricks",
                "Wolf makes Jake run a lap around the house"
            ],
            "content":"<div class=\"\"><div> <span>After the time spent playing soccer at the park, Wolf followed Jake and Kyle to their house. They walked in, and got some cold water to drink in the kitchen, before Jake took Wolf upstairs to his bedroom. There, Jake closed his bedroom door, so that his little brother wouldn’t be able to come in and bother them anymore.<br>\r\n<br>\r\n“Dude, I got something really cool to show you…” Wolf mentioned, as he sat down at the edge of Jake’s bed, while Jake sat down in the chair by his desk.<br>\r\n<br>\r\n“Oh? What were you going to show me?” Jake wondered.<br>\r\n<br>\r\n“I… I think I gained some weird superpower or something…” Wolf said in a soft tone of voice.<br>\r\n<br>\r\n“Say what?”<br>\r\n<br>\r\n“Like… I was able to control the minds of other people and make them do stuff…” Wolf continued.<br>\r\n<br>\r\n“Whoa! That’s freaky! I mean… Are you sure?”<br>\r\n<br>\r\n“Yeah… I used it on your little bro while we were playing soccer outside!” Wolf explained.<br>\r\n<br>\r\n“You’re kidding me!”<br>\r\n<br>\r\n“Nope! He was about to argue with you, but I made him kick the ball to you!” <br>\r\n<br>\r\n“Oh, no way! No freaking way!” Jake said.<br>\r\n<br>\r\n“I swear!”<br>\r\n<br>\r\n“Prove it!”<br>\r\n<br>\r\nWolf stared at Jake and concentrated on making him stand up and walk towards the middle of the bedroom.<br>\r\n<br>\r\nSuddenly, Jake got up from his chair, and remained standing right by his desk.<br>\r\n<br>\r\n“Hey! What…. What the heck?” Jake gasped. <br>\r\n<br>\r\nThen Jake started to take three steps towards the middle of the bedroom, facing Wolf.<br>\r\n<br>\r\n“Hey! HEY! Are… Are you doing this to me?” Jake protested, while he was walking towards the middle of the bedroom.<br>\r\n<br>\r\n“Yeah…” Wolf replied calmly.<br>\r\n<br>\r\nThen, while standing in the center of the room, Jake flexed his calves, and stood on his toes for a few seconds, before lowering his heels again.<br>\r\n<br>\r\n“Whoa! That… That was wicked!” Jake shouted. “You made me stand on my toes!”<br>\r\n<br>\r\n“Alright, Jake… Now… HOP!” Wolf commanded.<br>\r\n<br>\r\nJake hopped in the air and landed on his feet.<br>\r\n<br>\r\n“WHOA!” Jake gasped. “What the---?”<br>\r\n<br>\r\n“HOP… HOP… HOP!” Wolf ordered.<br>\r\n<br>\r\nJake’s legs flexed and launched him straight into the air, and then he landed back on his feet, every time Wolf said the word “HOP”.<br>\r\n<br>\r\n“HEY! STOP… STOP IT!” Jake gasped. “I… I believe you!”<br>\r\n<br>\r\n“Ha ha!” Wolf laughed. “I can make you hop like a bunny rabbit, every time I say the magic word!”<br>\r\n<br>\r\nJake just stared at his friend with his mouth wide open as Wolf grinned at him…<br>\r\n<br>\r\n</span></div></div>",
            "created":1281243600,
            "id":932776,
            "title":"Wolf tells Jake about his powers"
        },
        "12412211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Wolf uses his powers on another student at school",
                "Wolf uses his powers on Jake once again"
            ],
            "content":"<div class=\"\"><div> <span>“Dude, that is so awesome that you can make me do stuff!” Jake panted, as he was just regaining his composure. “I can’t believe it!”<br>\r\n<br>\r\n“Just wait till I try this out in school!” Wolf replied.<br>\r\n<br>\r\nWolf then left Jake alone for the rest of the day, and the boys just played video games.<br>\r\n<br>\r\nThe next day, they boys sat next to each other in English class during first period, when Mrs. Ward walked in and decided to give a pop quiz!<br>\r\n<br>\r\n“Okay, we’re going to give an oral exam!” she said to the class. All the students gasped out loud. “We had to memorize the books of the New Testament last week, and I’m going to see who did their homework!”<br>\r\n<br>\r\nMrs. Ward then scanned the classroom for the first student to call on.<br>\r\n<br>\r\n“Jake!” she said.<br>\r\n<br>\r\nJake looked up with a startled expression on his face.<br>\r\n<br>\r\n“Give me the first four books of the New testament!” she requested.<br>\r\n<br>\r\n“Ummm… Uhhh….” Jake stammered, racking his brain. He clearly had not studied for the pop quiz. Wolf knew the answers, so he used his mind control powers to take over Jake’s mind.<br>\r\n<br>\r\n“Umm… Matthew, Mark, Luke and John!” Jake replied.<br>\r\n<br>\r\n“Very good, Jake!” Mrs. Ward replied. “For a moment it looked as if you didn’t know the answer…”<br>\r\n<br>\r\nMrs. Ward then asked another student a question, leaving Jake to let out a deep sigh of relief. Jake just smiled, however, as he turned and looked at Wolf, who returned a wide grin. Jake knew that Wolf had helped him out, using his awesome mind-control powers!<br>\r\n</span></div></div>",
            "created":1289192400,
            "id":990190,
            "title":"Wolf shows Jake more mind control tricks"
        },
        "124122112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Wolf makes Jake do stuff in school",
                "Wolf makes Jake talk for him in school"
            ],
            "content":"<div class=\"\"><div> <span>Jake and Wolf were walking down the hall at school the next day when Jake spotted Cindy, a girl he really liked. He stared at her the whole time and Wolf took notice.<br>\r\n<br>\r\n\"Who's that?\" he asked.<br>\r\n<br>\r\n\"It's Cindy, I think she's cute...\" Jake replied.<br>\r\n<br>\r\n\"Have told her you liked her?\"<br>\r\n<br>\r\n\"No...\"<br>\r\n<br>\r\n\"Why not?\"<br>\r\n<br>\r\n\"Too scared and too shy...\" Jake sighed.<br>\r\n<br>\r\n\"Let me help you overcome your shyness!\" Wolf grinned.<br>\r\n<br>\r\nRight away, Jake felt Wolf's powers take control of his mind and body. Jake suddenly realized that his legs started to walk towards the spot where Cindy was standing!<br>\r\n<br>\r\n\"Ummm.... hi, Cindy!\" Jake said to her, even though he was under Wolf's control.<br>\r\n<br>\r\n\"Oh, hi there, Jake!\" the cute girl replied with a smile.<br>\r\n<br>\r\n\"Cindy... I just saw you standing there, and... I just wanted to let you know that... I think you're very beautiful!\" Jake said softly.<br>\r\n<br>\r\n\"Ooooohh.... How sweet of you, Jake! Thank you!\" Cindy said, as she bent over and kissed Jake on his cheek, before stepping back. \"I think you're cute!\"<br>\r\n<br>\r\nThen Cindy turned around and walked away, giggling...<br>\r\n<br>\r\nWolf looked on and laughed.<br>\r\n<br>\r\n\"Come on, Romeo, let's go to class!\" Wolf said, as Jake joined him. \"I just noticed something about my powers....\"<br>\r\n<br>\r\n\"What?\" Jake asked him.<br>\r\n<br>\r\n\"The more I control you, the easier it gets...\" Wolf said. \"But, it's becoming a bit too easy for me to control you from now on....\"<br>\r\n<br>\r\nJake turned towards him with a confused look on his face.<br>\r\n<br>\r\n\"Huh?\"<br>\r\n<br>\r\n\"My powers won't let go of you... I feel like I can control you all the time now!\" Wolf stated.<br>\r\n<br>\r\nJake's mouth dropped open. In a way he thought it would be cool to be controlled by his best friend all the time, every day...<br>\r\n<br>\r\n\"Really?\"<br>\r\n</span></div></div>",
            "created":1299214800,
            "id":1064425,
            "title":"Wolf uses his powers on Jake once again"
        },
        "1241222":{
            "choices":[
                "He left right then and there.",
                "He told them and said he was sorry"
            ],
            "content":"<div class=\"\"><div> <span> Jake and Kyle were hungry after a game of catch and began to prepare turkey sandwiches in the kitchen. Wolf stayed in the living room constantly flipping channels. A dog lazed beside the couch motionless. Wolf slurped his pop and looked at the dog. She slept there, groaning away the pain of her weak old bones. Wolf decided to experiment.<br>\r\n<br>\r\nHe pointed to the door behind him and focused really hard on the old dog. To where only Oprah shouting Johnny Depp's name could be heard. He breathed, making straining sounds. As he stared at the sleeping dog. Soon the dog opens it's eyes and Wolf began to grin in growing excitement as the dog got up and walked to the door. <br>\r\n  \"Yes\" Wolf said filling himself with acheivment. Then he pointed to his feet and focused on the dog again. Wolf squints as a sweat bullet slowly inches its way to his cheek.<br>\r\n\"Wolf, do you want a soda?\" Jake shouted, startling Wolf and breaking his concentration. Wolf feels his heart beating rapidly. \"Wolf?\"<br>\r\n \"I got one! Wolf shouts back out of breath.<br>\r\n<br>\r\n The bothers re-enter with their sandwiches as Wolf attempts to clear his throat. As Wolf's friends take their seat on the green couch next to the lounge chair, Kyle looks at Wolf's feet and giggles in delight. Wolf look and sees the dog is laying on his feet. <br>\r\n \"How did you get her to do that?\" Jake asked. Wolf just held up a piece of sandwich and feed it to the dog. \"That dog don't do anything on command. You must have mind powers or something.\" Wolf gagged on his food. Causing them to laugh. \"I was just kidding, Wolf.\" Just felt ashamed. At the same time he felt vengeful. But how. He watched Jake carefully to seek his chance.<br>\r\n<br>\r\n Kyle took a bite out of his sandwich enjoyed watching SpongeBob flunk his driving test with Patrick's radio broadcasted advise. Jake look at his best friend as he picked up his pop can drew it closer to his mouth. He grinned as Jake stared feeling awkward with his friend staring at him. Jake readied to sip his soda. <br>\r\n\"Drop it\" Wolf whispered. Jake's pop gets closer as tips it's opening for his mouth. That is when it dropped and spilt itself all over.jake's lap.<br>\r\n\"Mom Couch!\" Kyle yelled, standing up.<br>\r\n \"Shut up!\" Jake said standing up. He heads for the kitchen until he stops and turns around. Kyle looks at Wolf who whispers under his breath, then his attention turns to his bother. Jake gets down to his knee and rubs his face in the spill.<br>\r\n \"Jake!\" Kyle shouts with concern. Jake finally lifts his face while Wolf sit there watching. Kyle steps closer to his brother. <br>\r\n \"are you ok?\"<br>\r\n \"yeah! I need to get some towels for my face\"<br>\r\n 'If you didn't want a sticky face then why did you...? \"<br>\r\n\"I-I hmm uh.\" Jake felt ashamed \"I don't know\"<br>\r\nThey left the room. It got very quiet as Wolf sat there with the chance to have the realization of the power he holds to sink in. It did. Wolf swallowed. It terrified him.</span></div></div>",
            "created":1281934800,
            "id":937522,
            "title":"Wolf decides to keep his powers a secret a litt..."
        },
        "1242":{
            "choices":[
                "A secret cove in the Beach",
                "A tree in the corner of the park",
                "An old shack in the woods"
            ],
            "content":"<div class=\"\"><div> <span>\"Pay attention Julie!\"<br>\r\nI looked up,starteled,Oh brother what had I done now.\"Yes,Mrs.Green.\"<br>\r\n\"Perhaps you would like to answer the question I just asked the class.\"<br>\r\n\"No I really wouldnt like to.\" I reaplied,wanting to smack myself the instant the words left my mouth<br>\r\n\"Feeling disrespectfull are we?\".<br>\r\n\"Well,I don't know about you,but yeah I kinda am.\" Shutup! I told myself,as the class went into hysterics around me. Then time froze. I could feel Mrs.Green's anger radiating towards me in waves.James beside me though laughing was terrified,I could just feel it,yet his grin made me nearly doubt myself.I looked at Mrs.Green,and felt a small almost undetecteble pull towards her,My balence seemed to shift and I could see myself.Not the same way I could still see Mrs.Green from my seat,but like seeing a daydream.I decided to speak,but not as myself,I wanted to speak for Mrs.Green.<br>\r\n\"Go see the nurse dear,you must not be feeling well.\" I said,squelching the desire to add,A sweet and loveing person such as yourself would never be rude to even a cranky old goat like me unless something were teribly wrong, or somthing equilly childlike and ridicules. Time flowed once more.<br>\r\n\"Yes Mam.\" I said nearly sprinting for the door. I went to the nurse and tried to speak for her,I told myself to go home and rest,I might be coming down with something.I ran all the wa to my secret place nearly out of breath by the time I reached...</span></div></div>",
            "created":1278392400,
            "id":912642,
            "title":"female"
        },
        "125":{
            "choices":[
                "Yes(darker)",
                "Yes(lighter)",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Get powers as you go?</span></div></span></div>",
            "created":1263877200,
            "id":822858,
            "title":"Other choices"
        },
        "1251":{
            "choices":[
                "Showing people their fear in their mind",
                "Shadow/magik(but not really magick)stuff",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you start off with?</span></div></span></div>",
            "created":1263877200,
            "id":822859,
            "title":"Yes(darker)"
        },
        "12511":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male/ Female</span></div></span></div>",
            "created":1263877200,
            "id":822860,
            "title":"Showing people their fear in their mind"
        },
        "125111":{
            "choices":[
                "Go to the leaders...",
                "Try to escape..."
            ],
            "content":"<div class=\"\"><div> <span>\"Wake up!\" shouts an angry voice.   \"It's time to go, so stop lazing around and get up!!!\" it's Jess, a junior leader in this little \"pack\" your in.   You joined this when you found yourself abandoned at six, now they won't let you leave.   Apparently your smarts helped them excel in their little gang and they aren't about to let you leave.<br>\r\n<br>\r\n\"I said wake up!!!\" Jess says, kicking you this time.   Like he has room to talk about lazing, you two were suppose to be the lookout last night and he didn't show up for his shift, forcing you to do both, you would never point this out to him of course do to your meager strength.   So you get up to talk to the inner leaders who treats you like trash but excpect you to plan everything for them anyway.<br>\r\n<br>\r\nYou decide to....</span></div></div>",
            "created":1263877200,
            "id":822862,
            "title":"Male"
        },
        "1251112":{
            "choices":[
                "Jess and his buddies..",
                "Someone who caught you pickpoketing someone earlier befor you escaped..."
            ],
            "content":"<div class=\"\"><div> <span>You decide to take another escape attempt, you couldn't take this anymore.   You knew it would be a matter of minutes before Jess came back in so you worked quickly and quietly.   First, you slid the beat up hardly working air conditioner out of place(for some reason they didn't seal up the window) and quietly slid out of the small window.   Then, you put the machine back into place only fastening the bolts tighter with a makeshift screwdriver.  YOu gather some thick sticks from right outside the window and barricade it by shoving the sticks in with your foot until they got lodged in place, you had to use your legs, a benifit they don't have sense the window is head-level.<br>\r\n<br>\r\nYou rush quietly through the narrow alley, your feet hit the ground noislesley(you picked up this skill do to the fact that they made you into a theif) and ran until you found a car to hide under, no doubt they will be looking for you.<br>\r\n<br>\r\nYou hear footsteps approach and stop near the car, and hand reaches down and drags you out from under the vehicle, you see that it's....</span></div></div>",
            "created":1263877200,
            "id":822878,
            "title":"Try to escape..."
        },
        "12511121":{
            "choices":[
                "You feel pain and see freaky images cross your head",
                "you glare at him and he and his freinds double over, as if in pain"
            ],
            "content":"<div class=\"\"><div> <span>Jess drags you out by the scruff of your neck and held you to face level, you glare at him while he yells,unacisarily \"hey guys, looks like the weasle hunt is over!\"   He then sighs dramaticly and places you down his big and stupid freinds towering over you, cracking their knuckles.   \"Looks like we're going to have to teach you a lesson buddy,\"   He approaches violently and.....</span></div></div>",
            "created":1263877200,
            "id":822882,
            "title":"Jess and his buddies.."
        },
        "125111211":{
            "choices":[
                "You start to leave quickly",
                "Someone approaches"
            ],
            "content":"<div class=\"\"><div> <span>You glare angrily at Jess as he approaches, suddenly he screams and crouches to the ground in a featle position, his friends do the same.   Suddenly your head lances in pain that can only be described as red and you see images cross through your head, you feel as if all your fears are coming to life.   Suddenly you wake up and look over to see Jess and his friends, still unconsious.   Muttering to themselves as if crazy.<br>\r\n<br>\r\nWhat was that you think to yourself as...</span></div></div>",
            "created":1263877200,
            "id":822884,
            "title":"You feel pain and see freaky images cross your ..."
        },
        "125111212":{
            "choices":[
                "A rude passerby bumps into you on purpose and you stare into his eyes",
                "You leave, pondering this mystery"
            ],
            "content":"<div class=\"\"><div> <span>Without warning Jess and his idiots start screaming, begging for... something to stop.   You glare at them harder and their pleads intensify.   Finally they fall unconsious, still muttering and you start running, trying to make sense of the madness.   You look over in the reflective mirror of a nearby car to see that your irises are blood red with black spirals lacing them, you blink, and they are your old color again....</span></div></div>",
            "created":1263877200,
            "id":822889,
            "title":"you glare at him and he and his freinds double ..."
        },
        "1253":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Electrokinesis",
                "Hydrokinesis",
                "other choices"
            ],
            "content":"<div class=\"\"><div> <span>more choices<br>\r\n<br>\r\nElectrokinesis: the ability to create and control electricity.Using this ability you could shock someone and mess up reception on tvs or radios and such things.   shoot electricity out of your fingers, other abbilities include: electro-ball, thunderball, thunder punch, electricity iving and electricity drain.<br>\r\n<br>\r\nHydrokinesis: the ability to control water</span></div></div>",
            "created":1281589200,
            "id":935000,
            "title":"No"
        },
        "12531":{
            "choices":[
                "male ",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>male or female</span></div></span></div>",
            "created":1299214800,
            "id":1064388,
            "title":"Electrokinesis"
        },
        "12533":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Photokinesis",
                "others"
            ],
            "content":"<div class=\"\"><div> <span>Even more choices<br>\r\n<br>\r\nPhotokinesis: The abbility to control and creat light, with this ability, you could control lighting, change the color of light, bend small lasers, make yourself invisible to others, and much morel  You could also create minor illusions.</span></div></div>",
            "created":1281589200,
            "id":935024,
            "title":"other choices"
        },
        "13":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Magic",
                "Alchemy",
                "Possestion",
                "Element control",
                "other choices"
            ],
            "content":"<div class=\"\"><div> <span>A)Magic, you gain the powers of a wizard, as such you can cast spells, and do all that you see in the over rated films, you can do this by movements or incarntations.<br>\r\n<br>\r\nB)Alchemy, you can change something in to something elsel,<br>\r\n<br>\r\nC)Possestion, you can posses others bodies<br>\r\n<br>\r\nD)Element control, you gain control over one (or all) or the elements Earth, Air, Fire, Water, Energy and Time, you have to give the choice over which one.</span></div></div>",
            "created":1263704400,
            "id":821497,
            "title":"Supernatural"
        },
        "131":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Magic",
                "Charms",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To widen the range, what type of Magic? Definitions inside.</span></div></span></div>",
            "created":1283922000,
            "id":952568,
            "title":"Magic"
        },
        "1312":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>Firstly here is what Charms means, it means you can now cast enchantments that cause objects to behave in ways that they would not nomally, you can't change a objects form, a Charm might cause something to flash different colours. It might cause an object to levitate or even fly through the air. Charms can make water able to stand on, or fire that doesn't burn or even create a bubble of breathable air around a person's head.<br>\r\n<br>\r\nHowever the thing is still made of the small thing, and still posses its strengths and weakneases, if the objects wood, then it will still burn like wood, if its metal it will still conduct heat, electricity and melt.<br>\r\n<br>\r\nIt can't change the object any way what so ever, expect for making it do something it shouldn't,<br>\r\n<br>\r\nIt doesn't effect living things though, expect for plants.<br>\r\n<br>\r\nOkay now that's sorted what gender are you Male or female?</span></div></div>",
            "created":1284008400,
            "id":953141,
            "title":"Charms"
        },
        "1313":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Transfiguration",
                "Jinxes, Hexes and Curses (Three in one)",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1283922000,
            "id":952569,
            "title":"others"
        },
        "13131":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>Transfiguration means you now have the art of changing the form and appearance of an object , you can change any object into anything, say stone to water, feather to fire, you however can't make all objects change, only ones you can see, it also doesn't work on animals only plants, you also can't transform inanimate things into living things, if you change living things then there still living in there new form.<br>\r\n<br>\r\nNow thats cleared up, what gender are you? </span></div></div>",
            "created":1284008400,
            "id":953172,
            "title":"Transfiguration"
        },
        "13132":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>You know posses those three powers, but first, here are there definitions:<br>\r\n<br>\r\nJinx: A jinx is something that causes discomfote but is basically harmless, its mainly just irritating, for an example you can stop a person being able to do a minor thing, but it can't harm them in away like the other two, Jinxes are in princible just like minor bad luck, they are easy for you to do but wear off after a short while,<br>\r\n<br>\r\nHex: A Hex is less dark than a curse but darker than a jinx. Hexes cause a certain degree of pain and discomfort, However nothing major, you could knock a person over, or cause them to vommit slugs or make then fall down the stairs, the are more difficut and harder to do than a Jinx, they can also last longer.<br>\r\n<br>\r\nCurse: A Curse has the most negative effects. Curses are used with the intention of causing harm, control, or even death to the victim. They are very tiering but last till the victum dies if you want them too.<br>\r\n<br>\r\nThere are however some who are more ressilant to the effects than others,<br>\r\n<br>\r\nand you can cancell all but the one that kills instantly by thought.<br>\r\n<br>\r\nNow thats cleared up, what gender are you?</span></div></div>",
            "created":1284008400,
            "id":953183,
            "title":"Jinxes, Hexes and Curses (Three in one)"
        },
        "131322":{
            "choices":[
                "Good",
                "Evil"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, Are you good or evil?</span></div></span></div>",
            "created":1299214800,
            "id":1064738,
            "title":"Female"
        },
        "1313222":{
            "choices":[
                "My Birth",
                "My Training with the protectors"
            ],
            "content":"<div class=\"\"><div> <span>Hello, my name is Annabeth. You are currently reading a book that contains the storry of my life. I have left it here in the a wall crevice within my cave. Yes, you heard right, my cave, it is and will forever be. Until you come along. I give this cave to you now, along with this book, my spell book, the medallian with a serpant on it, and The Rose. The rose is dried, and in a glass case in the back. Please I beg of you, never touch it! It is the single most inportant object in my life, take good care of it. <br>\r\nI will now tell you my story,<br>\r\nIt starts much differently than you may think. I was born in a orphanage, to a poor mother who died in giving birth to me. She loved my father very much, he was a Protector. He died guiding her to the orphanage. But They found me anyway, They are the Protectors. My father wanted me to have no part in thier ways, in thier magic. However, he was powerfull, and the Protectors knew I would be to. So they watched me, when I was five, they stole me. They took me to their training center, they told me about my parents, about themselves, their duty. They told me about magic. They taught me my first spells, how to use my gifts, how to fight, how to run, how to live, and to always, always love.<br>\r\nThen I was taken, again, only this time, it was by the bad guys.<br>\r\nThey were the Shadows. I was kept in a room all by myself they had taken me for my power. They hoped they could turn me.The Shadows had done this many times before to many people. I was seven at the time, I could see into the room next to me. In that stall there was a boy of eight,I watched him. He was do to leave for their training village, he had already been turned. He looked at me through the bars, I will never forget his eyes. There was never any others like them.<br>\r\nThey were the most stunning shade of green ever to exist. They glowed bright, electrically, jumping like energy. He was handsome even then, but thin, like a skeleton. <br>\r\nI was rescued only moments after he left, my teacher had come to save me. Later at the age of ten I was captured again, they took me straight to thier camp, not bothering trying to convert me first. He was there, his name was Johnathen. I spoke with him often, I fell in love with him. <br>\r\nMany people, in many stories turn good for the ones they love. But he was not good, he did not love me, but I needed him, he was all that mattered to me. So I turned bad. I could never leave his side, so even after opertunity after oppertunity presented itself for escape, I stayed.<br>\r\nThis is the briefest outline of my past, I will elaborate in further chapters but this is my warning before you read further,<br>\r\nI am not the good guy, I am, for the man I love evil. If you can not stand this, and can not read this through, then do not read any farther. Sighn you name on the list in the back so that whomever  can will know how many hands this has passed through. If you can not read this leave, and never come back, this is not your cave, nor are these your belongings. For if you can not bear an evil womens life story you must not hold her possesions. Leave them for someone who can.<br>\r\nIf you can then please, Read on.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1299214800,
            "id":1064792,
            "title":"Evil"
        },
        "13133":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Healing",
                "Voodoo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Final Two Choices, which will you take?</span></div></span></div>",
            "created":1283922000,
            "id":952574,
            "title":"others"
        },
        "131331":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>You can now heal, but first the definition,<br>\r\n<br>\r\nIt is quite straight forward, you now have the power, to heal others, you can cure illnesses, fix cuts, bruses, burns, broken limibs, even disabilities (You could make a blind man see, even if they were born that way), you can also heal other animals and plants, you can heal them even if what's wrong with them is fatal, just as long as you heal them before they die.<br>\r\n<br>\r\nYou can also heal, inanimate things, for example, cracks in potery, bends in metal, or even shatered glass, In short you can heal anything, you can't cause things to regenerate though, for example if someones lost a limb, you can't cause it to regrow, only heal the wound, however if you got the severed limb though, you could reatach it, and make it work, good as new,<br>\r\n<br>\r\nAlso the more serious the wound, the harder and more tiering to heal it,<br>\r\n<br>\r\nYou can also cure things that aren't physically broken, for example mad people, but this doesn't always work.<br>\r\n<br>\r\nNow what gender are you?</span></div></div>",
            "created":1299214800,
            "id":1064608,
            "title":"Healing"
        },
        "131332":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Female",
                "Male"
            ],
            "content":"<div class=\"\"><div> <span>You now posses the power of voodoo, but first the definition<br>\r\n<br>\r\nThis allows you to posses great powers, but (I'm not making this up, I did a lot of research before I wrote this) you must honour the loa to gain it (loa are a bit like voodoo gods) there are two types of loa, the Rada and the Petro, the Rada are the good, they are helpful and will only hurt you if you don't show them respect, but the Petro are evil, they will give you great power, but you must repay them, and they demand a lot.<br>\r\n<br>\r\nIt is only the Petro's followers who can create Zombies.<br>\r\n<br>\r\nBellow are a list of Loa, with there name, what they are, what they are loa of, and what powers you can gain by honouring them:<br>\r\n<br>\r\nLegba (a rada) lord of the sun, gives you power over light, heat, fire and images.<br>\r\nGhede (a Petro) lord of history, and the dead, gives you power over the past (traveling, warping ect) and over the dead,<br>\r\nAgwe (a rada) Lord of the sea, gives you power over water, boats, sea, and water vapour.<br>\r\nOgoun, lord of the sky, thunder, fire and metal, gives you power over the weather, the fire and the metal,<br>\r\nErzulie, Lady of love, dreams, beauty and riches, gives you power over those things.<br>\r\n<br>\r\nYou can honour any of them, and all of them, but you can only honour one of them at once, and a such your powers will remain for a week, then your beable to either swap, or keep your powers.<br>\r\n<br>\r\nNote: Any deals with Petro's must be kept, or else you will suffer unimaginly horror.<br>\r\n<br>\r\nBy following any of these, you can create Voodoo dolls, with these dolls, you can bind a person to there like ness, and use it to curse, or heal the person, they can also be used for sending messages to the other world.<br>\r\n<br>\r\nFinal note: Watch out for baka's!<br>\r\n<br>\r\nNow that's settle what gender are you?</span></div></div>",
            "created":1322197200,
            "id":1229073,
            "title":"Voodoo"
        },
        "132":{
            "choices":[
                "one",
                "two",
                "three"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>well this should be interesting</span></div></span></div>",
            "created":1299214800,
            "id":1064389,
            "title":"Alchemy"
        },
        "1321":{
            "choices":[
                "male",
                "female",
                "."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>this is realy standered<br>\r\nmale or female</span></div></span></div>",
            "created":1299214800,
            "id":1064399,
            "title":"one"
        },
        "13211":{
            "choices":[
                "sure",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Kyle.<br>\r\nhe sould be interesting</span></div></span></div>",
            "created":1299301200,
            "id":1065028,
            "title":"male"
        },
        "132111":{
            "choices":[
                "He try his power out ",
                "he try his power out"
            ],
            "content":"<div class=\"\"><div> <span>Kyle was thinking in chemisty class, the class was revewing the test that every student seemed to fail. But Kyle, some how Kyle answered every question right and got the score higher then what was posable. So as he was thinking about the chemical formula for wood burning. Then he recalled that could incress the fire danger if you incress the O2 you could make a self burning fire. For some reson Kyle Put his hand on the table and smoke sarted to form after a light came off. Kyle pulled his hand back And the fire sarted up faster. Kyle was freak out here was a bright red fire burning in the middle of his desk. with nothing around him to sart it. The teacher try and put it out only to have it steam the room up. Kyle and the other student are evacuated from the school. Kyle smiled as he thought adout his power he had he look at a steel bar and tryed to change it, it morfed and tern in to a ring. only the same amout that was needed. Kyle figured you have to have the same amout to change that amout.</span></div></div>",
            "created":1299387600,
            "id":1065601,
            "title":"sure"
        },
        "1321111":{
            "choices":[
                "FIGHT",
                "Hello"
            ],
            "content":"<div class=\"\"><div> <span>Kyle walked over to a the bar agin he placed his hand on it and thought about the amount he needed for a arm gard he made it solid all around and thick. Kyle looked it over befor he engaved a bio hazzered simbole as a joke. After some time Kyle pulled his shirt arm down over the arm gard and he desided to take a walk. After some time Kyle look and saw he was in a park. More over they was some one watching him.<br>\r\nwhat should kyle do fight this stranger.......<br>\r\nOr<br>\r\nsee who this stranger is?</span></div></div>",
            "created":1310101200,
            "id":1142964,
            "title":"He try his power out "
        },
        "133":{
            "author_id":"cale55",
            "author_name":"Sonic42",
            "choices":[
                "Your sister, Aelita",
                "Krystal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One night, you got a wierd message in your mind saying that \"you can now possess people.\" Who should you possess?<br>\r\n<br>\r\nAelita: 18 yrd Sister. <a rel=\"nofollow\" href=\"http://editthis.info/images/code_wiki/4/42/Empreintes_063.jpg\" target=\"_blank\">http://editthis.info/images/code_wiki/4/...</a><br>\r\n<br>\r\nKrystal: 17 yrd Sister. <a rel=\"nofollow\" href=\"http://ps3media.ign.com/ps3/image/article/830/830927/krystal-forscutt-20071028042323066-000.jpg\" target=\"_blank\">http://ps3media.ign.com/ps3/image/articl...</a></span></div></span></div>",
            "created":1342933200,
            "id":1385579,
            "title":"Possestion"
        },
        "134":{
            "choices":[
                "Air",
                "Fire",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Choose one of the elements.<br>\r\n<br>\r\nAir: You have complete control of the air, including the gases that make it up: hydrogen, oxygen, nitrogen, carbon dioxide, carbon monoxide, helium, Chlorine ect, you can also to an extent control the wind (but not the rest of the weather) and other things that resing in the air, (metors for example), you can also produce and expell gases from your self.<br>\r\n<br>\r\nFire: You can control and creat fire to any extend you wish, you can also control products of fire (ie smoke), or things that create or are like fire (Coal, lava) or though they are far more limited, you are also imune to fire and burning.</span></div></div>",
            "created":1275541200,
            "id":893585,
            "title":"Element control"
        },
        "1341":{
            "choices":[
                "Go to school",
                "Try to master your powers",
                "Go home and fall back asleep"
            ],
            "content":"<div class=\"\"><div> <span>You wake up one day to find yourself with a huge headache. Your vision is also blurred, but you figure its just from hanging out way too late last night. You walk over to the bathroom and run some cold water over your face. You can see somewhat better than before but you still have that enormous headache. You hurry downstairs and gobble down your breakfast, for you dont want to be late for school. <br>\r\n<br>\r\nAs you're walking to school you your nose is runny. You have the urge to sneeze and ah...ahchoo!!! You go flying ten feet into the aIr but still manage to land on your feet. You are scared at this nee ability. You have no idea what it is or how you got it. First thing on your mind is to see if anyone saw you fly in the air. You then realize that you're late for school. Do you</span></div></div>",
            "created":1275541200,
            "id":893590,
            "title":"Air"
        },
        "1342":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, What gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933568,
            "title":"Fire"
        },
        "1343":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Water",
                "Earth",
                "next"
            ],
            "content":"<div class=\"\"><div> <span>Choose one of the elements<br>\r\n<br>\r\nWater: You can control all water and all forms of water (Ice and steam), you can't control rain though, your abilities also alow you to breath under water, stay dry unless you want to be wet, control boats and ships telekinetically, are unharmed by water pressure or weight, have exact cowardiates while at sea, very ressistant to burning, can release the oxygen diffused in water and force the surrounding water to recede making an air bubble, heat or freeze water, inclease its surface tennsion till the point where you can stand on it, summon tidal waves, whilpools, ect. You can't create water though. <br>\r\n<br>\r\nEarth: You can control the earth, cause earthquakes, landslides, molten mud, mudslides, clay, rocks and the earth in general, you can make the earth move to your will, but not to a great degree, you also can control metal and other things of the earth but not to the same degree.</span></div></div>",
            "created":1281330000,
            "id":933093,
            "title":"Next"
        },
        "13431":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933576,
            "title":"Water"
        },
        "134311":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "13 years old",
                "16 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is your hero in the story?<br>\r\n<br>\r\nHe is...<br>\r\n</span></div></span></div>",
            "created":1282366800,
            "id":940995,
            "title":"Male"
        },
        "1343111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Arnon discovers his powers of the sea",
                "Richard must reveal the secret to the young god of the sea"
            ],
            "content":"<div class=\"\"><div> <span>Author’s Note: In Hebrew, the name Arnon means “roaring stream”.<br>\r\n<br>\r\nA big brown dump truck, loaded with trash, had arrived near the beach. This was just a few miles south of Miami, in the state of Florida. The truck had arrived there, and was heading towards a small concrete platform, which lowered straight into the water. It was 3 o’clock in the morning, and nobody was around.<br>\r\n<br>\r\nThe driver put the large dump truck in reverse and allowed the truck to slowly slide down the concrete slope until the rear tires were barely reaching the water. Then, the driver reached down, and pulled another lever, causing the engine to engage and rise up the big dump bin in the back, which contained all the trash. As the dumper raiser up higher and higher, the rear side remained level, so that all the trash slowly moved to the back until it fell out of the back of the dumper and poured out of the dumper into the ocean.<br>\r\n<br>\r\nOnce the dumper bin was completely raised up and had dumped all of its contents into the ocean, the driver pulled the lever back up, and the front end of the dump bin got lowered back onto the chassis of the dump truck. This time, the dumper was empty, and all the trash had been dumped into the ocean.<br>\r\n<br>\r\nThe driver then put the truck into its first gear, and drove off, having completed its job, of adding more trash to the ocean, not knowing that he was being watched by two mysterious beings.<br>\r\n<br>\r\nA man and a woman were standing there, observing the scene from a distance. They were clearly troubled by what they had seen. The couple was young, tall and strong. They wore sandals and they were completely dressed in long, white robes.<br>\r\n<br>\r\n“Modern man has no respect for the sea! This is a crying shame!” the man shouted out angrily. “What must I do to teach these humans to respect the seven seas? They use the sea to dump their trash! It is a disgrace!”<br>\r\n<br>\r\n“Maybe we should show the humans that the sea can be used for good things… Not just to dump their trash… Maybe…” the woman thought out loud.<br>\r\n<br>\r\n“I will use the sea to destroy them! ALL OF THEM! The sea that takes their trash and their refuse will flood them! I will flood their cities and beaches and towns! I will make them respect the seas!” the man growled.<br>\r\n<br>\r\n“Honey! Come down! You won’t teach them anything by doing that!” the woman pleaded to her husband.<br>\r\n<br>\r\n“Do you have any better ideas, my love?” the man asked her calmly.<br>\r\n<br>\r\n“Show them, how powerful the seas can be! Show them, what the sea can do! Live among them for a while!” she said.<br>\r\n<br>\r\n“My love, I’m a god… I do not wish to live among ordinary mortals who eat fish and who pollute the seas with their filth… It disgusts me…”<br>\r\n<br>\r\n“Then… Send someone else… Or… Let’s… Let’s create someone… “<br>\r\n<br>\r\nThe man stared at the woman.<br>\r\n<br>\r\n“My love… If we create a son… He will be a god on Earth… he will live and walk among ordinary humans as a deity… He will stick out like a sore thumb…” the man said angrily.<br>\r\n<br>\r\n“Yes, but he will be able to command the seas… he will command water and live in the ocean… he will be a hero among ordinary men…” she replied.<br>\r\n<br>\r\n“I don’t like it…”<br>\r\n<br>\r\n“What if… he were a boy… a child?” she wondered.<br>\r\n<br>\r\nThe man and turned to face the woman and smiled…<br>\r\n<br>\r\n“We will create a young boy from the sand and the stones and the sea shells found on this beach… He will be a god who will live among ordinary people… He will have the divine power to command the oceans and he will learn at a very young age to demonstrate that power before all other human beings. And, because he will be a god, he cannot be harmed or hurt in any way…” the man said calmly. “So, it will be done…”<br>\r\n<br>\r\nThree days later…<br>\r\n<br>\r\nRichard and Maria were a young couple who had moved from Michigan to Florida. They had been in Florida for twenty years and they both worked as part of a cleaning crew for a large hotel near South Beach near Miami. They had managed to work their way up and save some money so that they could afford a small house and buy a used car so they could get around town.<br>\r\n<br>\r\nEvery Sunday they would go to church and they would help collect food for the homeless shelter and they would teach poor or homeless children as well. Eventually, they had a son and a daughter of their own, named Miguel and Diana, ages 3 and 2. <br>\r\n<br>\r\nOne day, after both Richard and Maria had come home from work and Maria had just serving chicken soup and beans for dinner, there was a loud knocking on the door. Since they lived walking distance from the beach, Richard thought that it was one of the fishermen, asking for something to eat.<br>\r\n<br>\r\nWhen Richard opened the door, he found, sitting at his front doorstep, a large wooden basket with a little baby boy, wrapped in fine blankets and a small card attached to his blanket. <br>\r\n<br>\r\nThe card read: “Please take care of Arnon and raise him to be big and strong. Treat him special, for he is a god of the sea. Poseidon and Amphitrite”.<br>\r\n<br>\r\n“What?” Richard wondered, as he looked down at the little baby in the basket. The baby looked up at him and smiled. Realizing that he couldn’t just leave the baby outside, Richard took the basket with the baby boy, and took him inside.<br>\r\n<br>\r\nArnon grew up quickly and became a strong, healthy boy. He was never sick. He never even got a cold. When Miguel and Diana came down with the flu, with chicken pox, or even with dengue, Arnon never caught any of it. He was always perfectly healthy and strong. <br>\r\n<br>\r\nRichard always wondered why that was. He had hidden the card, which said that Arnon was a god of the sea. He decided to keep it a secret, until the day would come, that the secret had to be revealed to Arnon about his origin…<br>\r\n</span></div></div>",
            "created":1282453200,
            "id":941423,
            "title":"13 years old"
        },
        "13431112":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "The young god's first day of school",
                "Hanging out with the god of the sea"
            ],
            "content":"<div class=\"\"><div> <span>Thirteen years after the mysterious basket was left at Richard and Maria Medina’s doorstep, the young baby, named Arnon, had grown into a strong, young man. He was short, with black straight hair and bright blue eyes, but he was far more muscular than most other boys of his age. He wasn’t taller than them, but he seemed to be more athletic.<br>\r\n<br>\r\nOne day, a young couple was visiting and they were wading in the water. They had just gotten married the previous week, and the man was showing his new wife the new wedding ring. The wife had placed the ring on her finger and decided to go swimming, when she suddenly let out a loud shriek.<br>\r\n<br>\r\n“Oh no! MY RING!” she shouted. “I lost my ring!”<br>\r\n<br>\r\nHer husband quickly waded over to where she was standing, since they were both about knee-high in the water, and they frantically started searching for the ring, which had slipped from her finger and dropped in the water.<br>\r\n<br>\r\nMiguel, Diana and Arnon had heard the commotion, along with Aaron and Paul, two boys who lived right down the street from Miguel and Arnon. All of them suddenly raced into the water and started searching for the missing ring.<br>\r\n<br>\r\n“Where were you standing, when you lost the ring?” Arnon asked the lady.<br>\r\n<br>\r\n“Right here!” she replied. “I just can’t see a thing, because of all the water!”<br>\r\n<br>\r\nArnon walked over to where she was standing, and then he took a few steps back. The water wasn’t clear, so it was pretty much impossible to see where the ring would have landed on the ground.<br>\r\n<br>\r\nStrangely enough, Arnon began to feel a sense of calling, as if the sea began to call out to him. Something inside of him told him, that he could utter silent commands, and that the seas would obey them. He wished for the water around him and the lady to pull back, so that he could see the ground. That way, he would spot the missing ring and find it for the lady, who was so upset about losing her wedding ring.<br>\r\n<br>\r\n“Seas… Go away!” he said out loud.<br>\r\n<br>\r\nThen, it happened. The moment Arnon had uttered his command, the seas pulled back, right where he was standing, uncovering all the ground where Arnon, the couple, and the other kids had been looking for the missing ring. Now, they were all standing in wet sand, surrounded by rocks and shells.<br>\r\n<br>\r\n“Ahh… I see it!” Arnon, smiled, as he bent down and picked up the ring, which was covered with sand. “Here you go, ma’am!” he smiled, as he handed the wedding ring back to the lady.<br>\r\n<br>\r\n“Oh my gosh… Thank you! Thank you so much!” she stuttered. “But… How… What… W-w-what happened? Is there… l-l-low tide?”<br>\r\n<br>\r\nArnon turned to face the ocean and wished for the water to rush back.<br>\r\n<br>\r\n“Seas… Come back!” Arnon commanded.<br>\r\n<br>\r\n Just as he commanded, the sea returned and soon, the boys found their legs surrounded by flowing sea water.<br>\r\n<br>\r\n“Whoa!” Miguel gasped.<br>\r\n<br>\r\n“Hey! How did you do that?” Aaron said to him.<br>\r\n<br>\r\n“I… Uhmm…” Arnon stuttered. “I don’t know… I just did…”<br>\r\n<br>\r\nJust then, Richard was walking past the beach, when Miguel ran up to him, with Diana right behind him.<br>\r\n<br>\r\n“Daddy! Daddy! Guess what just happened? Arnon made the water go away from the beach, so that he could retrieve the ring for that lady! He made the whole beach grow wider by pushing back the water for a minute or so! Isn’t that cool?” Miguel shouted at his father.<br>\r\n<br>\r\n“Oh dear… Ooooh dear….” Richard sighed. “Arnon, Miguel, and Diana… Let’s get in the house…” Richard ordered his children.<br>\r\n<br>\r\nMiguel and Arnon dashed out of the water and ran towards the house, with Diana running right behind them.<br>\r\n<br>\r\nAs soon as they got to the door, they grabbed the towels, which were hanging from the stairway by the door, and they dried off. Then they took turns to shower and they put on some clean shirts and t-shirts.<br>\r\n<br>\r\nMiguel and Arnon shared the same bedroom, and both boys were sitting on Arnon’s bed, when Richard walked in the room, carrying a small card. Maria and Diana also joined him.<br>\r\n<br>\r\n“Arnon… I got this when you were delivered to our doorstep, thirteen years ago…” he said, as he handed the boy the card.<br>\r\n<br>\r\n“Uhmm… Arnon… that’s me… god of the sea… Poseidon and Amphitrite?” Arnon wondered out loud, as he read the text on the card.<br>\r\n<br>\r\n“Yes. Poseidon and Amphitrite are your real parents, Arnon…” Richard said calmly.<br>\r\n<br>\r\n“What? You… You’re not my real dad? Mom?” Arnon replied, with a tear coming from his eyes.<br>\r\n<br>\r\n“No, my boy. You’re the son of Poseidon. You’re a god of the sea. You were left on our doorstep for us to raise…”<br>\r\n<br>\r\n“A god of the sea? No way!” Miguel said out loud. “My little brother is a god?”<br>\r\n<br>\r\n“This is a joke, right? This can’t be true! I’m just a kid! I’m a normal kid! I’m just like Miguel and Paul and Aaron!” Arnon shouted back.<br>\r\n<br>\r\n“I’m afraid not, Arnon…. “Richard responded.<br>\r\n<br>\r\nRichard and Maria walked up to Arnon and they embraced him.<br>\r\n<br>\r\n“We still love you like our son, Arnon…” Maria spoke. “You’re still our son… No matter what the card says…”<br>\r\n<br>\r\n“I… I love you too, mom….” Arnon replied, no longer able to hold back the tears.<br>\r\n<br>\r\nMeanwhile, Miguel and Diana had gone back outside, where they had spotted Paul and Aaron.<br>\r\n<br>\r\n“You guys want to come and play with us?” Miguel asked them.<br>\r\n<br>\r\n“I dunno dude… I saw what your little bro did at the beach…. That was really, really weird…” Aaron sneered.<br>\r\n<br>\r\n“Guys… Arnon can do that… He’s a god of the sea….” Miguel said honestly.<br>\r\n<br>\r\n“WHAT!? Ohmygosh…. Now this is really getting weird!” Paul laughed. “Well I’m not going to bow down and worship your little bro if he’s the god of the sea! Forget it!”<br>\r\n<br>\r\nPaul turned around and walked away, angrily….<br>\r\n<br>\r\nMiguel became very sad and worried, wondering what it would be like when the new school year started the following week. Paul was in the same class as Arnon, and now that he knew about Arnon’s powers, things could only mean trouble…<br>\r\n<br>\r\n</span></div></div>",
            "created":1283058000,
            "id":946931,
            "title":"Richard must reveal the secret to the young god..."
        },
        "134312":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "13 years old",
                "16 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how old is your super hero                                                                                                           she is?</span></div></span></div>",
            "created":1385010000,
            "id":1697297,
            "title":"Female"
        },
        "13432":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933579,
            "title":"Earth"
        },
        "13433":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Energy",
                "next"
            ],
            "content":"<div class=\"\"><div> <span>Choose one of the elements<br>\r\n<br>\r\nEnergy: You can control and create energy, (Light, electricity, magnatisium, heat, radioation ect), you can also fire enegy blasts, fly and move at great speed, you are not immue to energy you aren't creating or controling.</span></div></div>",
            "created":1281330000,
            "id":933095,
            "title":"next"
        },
        "134331":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933591,
            "title":"Energy"
        },
        "134332":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Time",
                "next"
            ],
            "content":"<div class=\"\"><div> <span>Choose one of the elements<br>\r\n<br>\r\nTime: Gives you control over time, you can travel to the past or future, see the past, present and future, create and/or trap beings in time loops, speed up, slow down or stop time for everyone but you, age or deage things, you can also evolve or devolve creatures, summon beings and objects from the past or future, you also have limited control over a lot of things as all things are part of time, however your control of them is quite limited and exxhausting. Also as you are fed by time, stopping or slowing time for too long greatly weakens you. You also gain super strength, flight, blue hand rays and red eye beams, which have great destructive power, teleportation and durability, you are most powerful at the turn of something like the year or the century. This is the most powerful element and gives you the greatest power. </span></div></div>",
            "created":1281330000,
            "id":933099,
            "title":"next"
        },
        "1343321":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933607,
            "title":"Time"
        },
        "1343322":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Plants",
                "next"
            ],
            "content":"<div class=\"\"><div> <span>I decided to add four more to the list, here are your new choices:<br>\r\n<br>\r\nPlants: You have control over plants, you can animate them, control them, make them grow extrodinarilly fast, combine them to make new ones (iE apple trees and plum trees, Venus fly traps and branbles ect), make the sentite ect, basically do anything as long as it does change the basics of plants (They need sunlight, water, carbon dioxide, there roots must be in the ground ect), your powers strech to all plants.<br>\r\n<br>\r\nDreams: You can control dreams, not only your own dreams, but you can visit and control other peoples dreams to, you can also bring dreams to life, ie monsters from nightmares, sanarios that happen in dreams, but you must get out of the persons dream before they wake up, or you can't leave there mind till they start sleeping again, you can also make or prevent someone form sleeping, and awaken them.<br>\r\n<br>\r\nWeather: You can control and summon the weather, sun beams, storms, wind, tornados, hurricans, snow, blizards, any weather ect, you can not control more than one type of weather at once though, and you can not make them go above natural limits (Sub zero temperatures, winds that can move countrys ect), you can also use them in other ways, (Use the wind to fly, fire lightning out of your hands, blow gale force winds, create tornados by spinging ect).<br>\r\n<br>\r\nAnimals: You can talk to and control animals, you can also change your form into any animal or parts of you, you can also combine animals together to make new ones, you can't change others into animals thought.</span></div></div>",
            "created":1281330000,
            "id":933145,
            "title":"next"
        },
        "13433221":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933616,
            "title":"Plants"
        },
        "13433222":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Animals",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Chosen one of the elements.<br>\r\n<br>\r\nAnimals: You can talk to and control animals, you can also change your form into any animal or parts of you, you can also combine animals together to make new ones, you can't change others into animals thought.</span></div></div>",
            "created":1281330000,
            "id":933148,
            "title":"next"
        },
        "134332221":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933624,
            "title":"Animals"
        },
        "134332222":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Dreams",
                "Weather"
            ],
            "content":"<div class=\"\"><div> <span>Choose on of the elements<br>\r\n<br>\r\nDreams: You can control dreams, not only your own dreams, but you can visit and control other peoples dreams to, you can also bring dreams to life, ie monsters from nightmares, sanarios that happen in dreams, but you must get out of the persons dream before they wake up, or you can't leave there mind till they start sleeping again, you can also make or prevent someone form sleeping, and awaken them.<br>\r\n<br>\r\nWeather: You can control and summon the weather, sun beams, storms, wind, tornados, hurricans, snow, blizards, any weather ect, you can not control more than one type of weather at once though, and you can not make them go above natural limits (Sub zero temperatures, winds that can move countrys ect), you can also use them in other ways, (Use the wind to fly, fire lightning out of your hands, blow gale force winds, create tornados by spinging ect).<br>\r\n</span></div></div>",
            "created":1281330000,
            "id":933150,
            "title":"Next"
        },
        "1343322221":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933630,
            "title":"Dreams"
        },
        "1343322222":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just one more thing, what gender are you?</span></div></span></div>",
            "created":1281416400,
            "id":933639,
            "title":"Weather"
        },
        "135":{
            "choices":[
                "handling",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>object controle<br>\r\nor handling<br>\r\n<br>\r\nyou can make objects move under your hand with just a thought.<br>\r\n<br>\r\nexample you have a chain you can make that chain move in th air like a snake.</span></div></span></div>",
            "created":1263963600,
            "id":823302,
            "title":"other choices"
        },
        "1351":{
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or female?</span></div></span></div>",
            "created":1264136400,
            "id":824104,
            "title":"handling"
        },
        "13511":{
            "choices":[
                "you freak out and hide",
                "you get up and wait"
            ],
            "content":"<div class=\"\"><div> <span>you wake up in your room and look around and see a black painted room. you can hear voices out side.<br>\r\n\"you sure the slime took all right?\" <br>\r\n\"took it? like the body was made for it. If her show any thing it will be interasting.\"<br>\r\n\"so how do we test him?\"<br>\r\n\"the stander way pain, stimulate emoshale responce, and play around with a fuw other idea of testing.\"<br>\r\n\"just don't brake him like the last one. I hate having to paint the room back over and over agin.\"</span></div></div>",
            "created":1264136400,
            "id":824108,
            "title":"male"
        },
        "135112":{
            "choices":[
                "Run for it",
                "go back to sleep"
            ],
            "content":"<div class=\"\"><div> <span>\"so you are up?\" the man came in, he was in a larg heavy coat that was blackend to a crisp. \"so exparment number 013 -S? do you feel any effect of your treatment?\" he ask as he flip around some notes.\"<br>\r\n\"treatment? what treatment?\" you ask<br>\r\n\"013 -S has no memory of his treatment?\" he look at you, jot down some more thing then walk out, \"see you soon I think thiswill be interasting.<br>\r\nwhen he walk out you have two chouses ether go thoue the open door or stay.</span></div></div>",
            "created":1264482000,
            "id":826166,
            "title":"you get up and wait"
        },
        "1351121":{
            "choices":[
                "there a chain around your arm.",
                "there a chain moving by it self in your hand."
            ],
            "content":"<div class=\"\"><div> <span>you figuer you run for it but the hall way is long and you keep running and running untill you fall in to a dark hole in the ground the shock wake you up.<br>\r\n\"Dame that was freaky.\" you say as you get out of your bed. <br>\r\nyou look down to see.</span></div></div>",
            "created":1278392400,
            "id":912794,
            "title":"DREAM"
        },
        "1351122":{
            "choices":[
                "you try and you move the clay",
                "nothing happends"
            ],
            "content":"<div class=\"\"><div> <span>ypu deside that it would be uselass to try and run. whre could you go even if you wanted to.<br>\r\n<br>\r\n<br>\r\nthe next day.<br>\r\n<br>\r\n\"013-S time for your testing get your lazy ass up.\" you see the same guy, he waited for you to get up and fallowed him to a white room with a simple bowl of clay.<br>\r\n\"sit down in the chair.\"<br>\r\nas you do so you wonder what was going to happen.<br>\r\n\"now move the wet clay with out touching it.\"<br>\r\n<br>\r\nyou look at him he just say the same thig agin</span></div></div>",
            "created":1266382800,
            "id":838154,
            "title":"go back to sleep"
        },
        "1352":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Time travel",
                "Sight",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>other options<br>\r\n<br>\r\nTime travel: the abbility to travel any where and any when in time, past or future/<br>\r\n<br>\r\nSight; able to see the future</span></div></span></div>",
            "created":1278219600,
            "id":911481,
            "title":"other"
        },
        "13523":{
            "author_id":"totalotaku",
            "author_name":"Rolf Halfhearted",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Momentum Arrest?<br>\r\n<br>\r\nYes, I just made that one up; however, it allows you to stop things from moving just by touching them. How about it?</span></div></span></div>",
            "created":1287896400,
            "id":980696,
            "title":"Momentum Arrest"
        },
        "135232":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Generation — the ability to create something out of nothing (e.g. making a car appear out of nowhere). </span></div></span></div>",
            "created":1367384400,
            "id":1582558,
            "title":"Generation"
        },
        "1352321":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so you will be able to create objects out of thin air. Are you a male or a female?</span></div></span></div>",
            "created":1367384400,
            "id":1582561,
            "title":"Male or Female Generation?"
        },
        "14":{
            "choices":[
                "Animal Transformation",
                "Gender Transformation",
                "Television Transformation",
                "Celebrity Transformation",
                "Other Transformations"
            ],
            "content":"<div class=\"\"><div> <span> Before we start the story, we need to specify what type of transformation this will be.<br>\r\n<br>\r\nA) Animal Transformation, you can change into any animal on this planet by thought, and doing so you gain there strengths and weaknesses, but without loss of your intelegence. You can also although it is very exhausting, can other living things in to animals.<br>\r\n<br>\r\nB) Gender Transformation, pretty much self explanitry, you can now swap your gender by thought, you can also change others gender but it is exhausting.<br>\r\n<br>\r\nC) Television Transformation, You can change in to any character you have seen on tv, you also gain there strengths and weakneses, you can also change others in the same way.<br>\r\n<br>\r\nD) Celebrity Transformation, You can change in to any celebrity, even the ones that are not a live any more, and in doing so you gain there strengths and weaknesses, you can also change others in the same way but it is exhausting.<br>\r\n<br>\r\n</span></div></div>",
            "created":1263618000,
            "id":821282,
            "title":"Which Transformation?"
        },
        "141":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, what gender are you?</span></div></span></div>",
            "created":1263704400,
            "id":821531,
            "title":"Animal Transformation"
        },
        "1411":{
            "author_id":"nick101",
            "author_name":"Jared Murphy",
            "choices":[
                "Zack Green",
                "Mark Fitzpatrick",
                "Jack Douglas"
            ],
            "content":"<div class=\"\"><div> <span>Who are you?<br>\r\n<br>\r\nZack Green, 13 years old. Smart, sporty, good looking and extremely popular. Favourite animal is the Dolphin. brown hair and green eyes.<br>\r\n<br>\r\nMark Fitzpatrick, 16 years old. Nerdy, shy and quiet, Mark usually spends his days doing homework or reading in the library. Has thick glasses and red hair. Freckly.<br>\r\n<br>\r\nJack Douglas, 17 years old. A bully, very tough but not very stupid. Average IQ. Floppy blonde hair and red eyes due to contacts.</span></div></div>",
            "created":1344661200,
            "id":1402290,
            "title":"Who are you?"
        },
        "14111":{
            "author_id":"nick101",
            "author_name":"Jared Murphy",
            "choices":[
                "Tell her what you can do",
                "Tell her it's just a dream"
            ],
            "content":"<div class=\"\"><div> <span>\"Show us again, Zack.\"<br>\r\nZack Green was in the courtyard of his normal school. His dozen or so friends were leaning against the wall. It was Alex who was urging him to show them again, but Zack wasn't eager to rip his clothes again.<br>\r\nHe sighed and tried relaxing his muscles. He wanted to become something small so his stuff wouldn't get ruined again. He was going to become a squirrel.<br>\r\nHe thought and his body started to glow. Alex looked on in awe and so did the rest as Alex twisted his body as fur broke out, bones shrank, a tail started to grow. It felt like nothing was happening except water was flowing through him. He sighed and when he looked he was a squirrel.<br>\r\nHis clothes had fell to the floor as he scampered out and Alex smiled. Alex was a determined bully who used his age to bully smaller people. And now he had found a new way to bully. Perfect.<br>\r\nAlice, Zack's crush, came walking over. \"Hey, what's up?\" She looked at the clothes. \"Wasn't Zack wearing those?\"<br>\r\nZack didn't want to transform naked, so he ran into them and felt the flowing sensation. When he opened his eyes he had just fitted into his shirt and was lying down, trying to put on his underwear. Alice screamed. \"What's going on?\"<br>\r\nWhat does Zack do? Does he tell his crush what he can do or does he tell her its just a dream?</span></div></div>",
            "created":1344661200,
            "id":1402297,
            "title":"Zack Green"
        },
        "1412":{
            "choices":[
                "You will transform yourself",
                "You will transform a friend",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span> As you come into understanding your newly found transformation powers, you decide you want to try them out.  You've always wondered what it would be like to see through the eyes of a different creature.  You've also wondered what it would be like to transform someone else into one of your favorite animals.  You decide that it is time for someone's life to change, for better or for worse.</span></div></div>",
            "created":1263704400,
            "id":821537,
            "title":"Time to Transform"
        },
        "142":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "female",
                "male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>one more thing, what gender are you</span></div></span></div>",
            "created":1263704400,
            "id":821533,
            "title":"Gender Transformation"
        },
        "1421":{
            "author_id":"yumijapansmith",
            "author_name":"Yumi Smith",
            "choices":[
                "Super Speed",
                "Flight",
                "Force Fields"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is your super power?</span></div></span></div>",
            "created":1396674000,
            "id":1773916,
            "title":"female"
        },
        "1422":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "13",
                "16",
                "17"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which age are you?</span></div></span></div>",
            "created":1350622800,
            "id":1450057,
            "title":"male"
        },
        "14222":{
            "author_id":"heroes14",
            "author_name":"something else",
            "choices":[
                "one week later",
                "later today"
            ],
            "content":"<div class=\"\"><div> <span>You were an average guy with quit an average build with the height of 5ft.9 and facial features that would allow you to date any girl, if you eveb like any girls you only stood up for them because you felt that it was the right thing to do. Your name is alex stevenne truthe (pronounced truth) and you have two younger siblings and one older.<br>\r\n<br>\r\nAnthony lee truthe: 38 and husband of kate and father of you and your siblings. He has a tendancy to leave you out of the sports and man stuff he goes on with your brothers, which is fine with you because you really never liked sports or cars. He works at a major science company working for the government name scico ( i no weird name right).<br>\r\n<br>\r\nKate ashely truthe: 39 wife to anthony lee truthe and mother to you and your siblings.she is always so depressed when you talk about getting in a fight, eating without manners like most boys, shes extra protective of you getting hit in the groin instead of your other brothers, and last but not least she makes you hang out with your little sister and wont let you do anything around the house but dishes and laundry.<br>\r\n<br>\r\nMichael spade truthe: 19 your older brother and always looks at you with sadness in his eyes and is way to over protective almost as if he knew a secret you didnt, he is attending college but is still.living with you he says its because hes watching over you but you know its because freshmen cant have an appartment.<br>\r\n<br>\r\nAlex stevenne truthe: 16 brother of his siblings (main character) always felt a little of and offten protects the girls at school(l from their usually abusive boyfriends which makes your mom sad when you tell her thats why you got in a fight.<br>\r\n<br>\r\nKelly nina truthe: 14 sister of you and your siblings who sometimes wishes to have a sister in the house and often tries to dress you up as one in your sleep since you two share a room which is completely pink.<br>\r\n<br>\r\nLye ire truthe: 11 named after your mothers grandfather lye and your fathers great grandmother ire. Brother of you and your siblings who happens to be happy that your mom gave him his own room and stuck you with your sister for some reason you may never understand.<br>\r\n<br>\r\nYour family is quit wealthy due to your mom sueing some company a little after you were born<br>\r\nYou came home which is very fancy due to a lawsuit your mom won from about 16 years ago. You came home one day and were excited because you were doing an experimentbin class with blood to demonstrate the diilfferent chromosomes in boys and girls like boys have x and y chromosomes while girls only have x chromosomes but first you needed your parents signature so you got your moms and now in one week you will demonstrate how its done   <br>\r\n<br>\r\n-</span></div></div>",
            "created":1404795600,
            "id":1824451,
            "title":"16"
        },
        "142221":{
            "author_id":"heroes14",
            "author_name":"something else",
            "choices":[
                "agree to be female for one week",
                "stay male"
            ],
            "content":"<div class=\"\"><div> <span>After your experiment you went down to the hospital to get exact answers and when you got your answer you were biologically female but you had the parts of a normale 15 almost 16 in two weeks boy and to top it all off when you asked your mom and father about your condition they said \" we know \" you screamed \" what \" and then your mother said that shortly after you were born the doctors were experimenting with this thing called swapotomi which only a very small amount in the world existed and they asked me if i needed any extra cash and i said yes then they said that they needed something that was pure which ment not introduced to smoke carbon dioxide or any thing like that and said that my baby was just that and soon after i signed a paper with them agreeing that nothing permenant would happen so they kept you for a week and when they returned you they said that the experiment had been a failure and that the syrum the gave you to change your gender you became imune so they used the entire world supply to try and change you back into my sweet alexis Stephanie  truthe and when that didnt work we gained all their money in court and your father took over their company and rename it scico  because your first words were that because you heard us call the doctors that.\". You were stunnex so all you could say was \" how\" your father then said that \" the syrum changed your body to where it could flow freely inside you changing you to where your testosterone was so high you developde male parts and then when i took over the company i spent 3 years trying to find a cure but all i could figure is that by nex week on your 16 birthday that you will run out of syeum but your body would start making more of it then if you wanted but if you dont you could revert back to my little girl again\". </span></div></div>",
            "created":1404795600,
            "id":1824469,
            "title":"one week later"
        },
        "1422211":{
            "author_id":"heroes14",
            "author_name":"something else",
            "choices":[
                "one week later",
                "shoping for girl clothes"
            ],
            "content":"<div class=\"\"><div> <span>You asked your mother  \" does anybody else know \". Your mother replied with a sad tone \" your older brother michael knows because he was old eneogh to remember you being a girl, most of your teachers know exept for that scuence teacher that has it bad for your father, and the higher up agents at scico\".you were still in shock qhen your morher said this but despite the shock you ended up asking \" so..n is there umm... any way to change me back\". Your mother then got a little bit of an annoyed look on her face and then she said\" were you even listening i said that on your 16 birth day next week you would turn into a girl again and then can comtrol if you change back or not and the syrum to keep you male will be week eneogh that you can change instantly basically anytime you want\". You got a little angry rlthat your mother raised her voice at you when she was the one whoo messed up with the whole gender bender soyou stormed off to your room and couldnt beleive your mother didnt tell you anything about this and was just going to let you freak out on your birthday when you notice you were a girl.you went to your room and then to your rooms bathroom with your sister kelly was in it, so you waited in your pink room until she got out and noticed for the first time why your mom made you share a room with your sister, because she thoght that if placing you with a girl would make it easier that morning you woke up to find you changed into a girl. You got less mad at your mother and decided that you would stay female for one week just to make up for that daughter she never had but did have because of kelly. When she got out of the bathroom you noticed one more thing that your mother never ler you cut your hair and it made you look like a punk rocker guy because you were white with a slight tan had blondish hair like your mom and your sister while your father and your brothers had jet black hair. You also had smoothe skin you never could explain until now but other than those you were a very good looking guy. When you got out you went straight up to your mom and apologised for being so rude earlier and asked if you could go to your friend austin wayne guinns house and she said \"seriously after what you just heard you still feel like going to one of your friends house and play\" you were irritated by this question and said \" yeah im a guy no matter what and i feel like i deserve to hang out with my friends for this entire week since im goung to be a girl next week for one week\" your mother was surprised by this and had a happy face on and then said in a singsong voice \"would you like to borrow my car\" you were more surprised by this than your mom was about m you staying a girl and said confussed \"but i dont even have my license only a learners perment\" your mom replied \"i know\" you then realised that your mom was just happy she was goung to get her first born  <br>\r\n</span></div></div>",
            "created":1404795600,
            "id":1824664,
            "title":"argument"
        },
        "14222111":{
            "author_id":"heroes14",
            "author_name":"something else",
            "choices":[
                "happy birthday to you and your beautiful",
                "you slept through half the day"
            ],
            "content":"<div class=\"\"><div> <span>It was the night before your birthday and your father said that the changes would occur over night so they all gave you your favotite foods MCchickens from MCdonalds fries chocolate milk shake and for desert vanilla ice cream with chocolate sauce peanuts yogaurt sprinkles and oreos. The rest of your family thought that this was some kind of special treatment because of my birthday being tommorow but you and your parents knew the real answer was that they were spoiling you because it was the last night before your agreed arrangment that if you atleast remain in girl form for a month that they would buy you tickets to a rock concert that all of your friends were going to, the onluly probleme with that was that you have to tell all of your friends about your condition and you have to go to the concert during the month of the swap. Before you went to sleep that night your parents made you shave your legs and then you and your parents explained everything to your brothers and sister and when you said that your older brother michael just said that he thought that you being a girl was simply a dream. Later in the night when you were up getting a snack you noticed that you were several inches shorter your hands and feet were smaller and your face was a little more feminen then you went back to sleep and in the morning you woke up to...</span></div></div>",
            "created":1404795600,
            "id":1824719,
            "title":"twas the night before the birthday"
        },
        "142221111":{
            "author_id":"heroes14",
            "author_name":"something else",
            "choices":[
                "you decide screw it and go to school this week",
                "you do prank calls"
            ],
            "content":"<div class=\"\"><div> <span>You woke up in the morning a little dazed and disorientated. The first thing that occured to you is that you need to pee. You basically sprinted to the bathroom. When you enter the bathroom you see something strange in the mirror when you remember what was supposed to happen today and this is what you see( <a rel=\"nofollow\" href=\"https://p.gr-assets.com/540x540/fit/hostedimages/1380429850/861479.jpg\" target=\"_blank\">https://p.gr-assets.com/540x540/fit/host...</a> ) you dont think you look half bad and comment on the fact that even as a girl you still look similar to your male self ( <a rel=\"nofollow\" href=\"http://s4.favim.com/orig/48/boy-long-hair-blond-bridge-photography-Favim.com-439196.jpg\" target=\"_blank\">http://s4.favim.com/orig/48/boy-long-hai...</a> ) you dont know what it is but you feel more cofortable than you ever felf before. You just feel so warm on the inside and then the next thing that you realized is that you are grinning wildly because you just feel so cheerful, but you must admit that you hate being so small and fragile, but you love it at the same time. You soon finish up what you came to do in the bathroom in the first place ( through some hassle i must add) and were now on your way downstairs. 1 term of your agreement that you made sure to get in was that during your first week of being a girl you would have that week off of school to get used to being a girl. When you arrived downstairs you are greeted by a big \"supprise\" and some teary eyes from your mother. You then say \" wow jesus you guys nearly gave me a heart attack\" when you hear your voice it supprises you how sweet it sounds. You are starting to really enjoy the new supprises that keep on happening to you.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat do you do next?</span></div></div>",
            "created":1416676620,
            "id":1892145,
            "title":"happy birthday to you and your beautiful"
        },
        "143":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, what sex are you?</span></div></span></div>",
            "created":1263704400,
            "id":821535,
            "title":"Television Transformation"
        },
        "1431":{
            "author_id":"colomajared",
            "author_name":"killerwhale99",
            "choices":[
                "Wonder Woman (DC)",
                "Rey (Star Wars)",
                "Black widow ( Marvel)"
            ],
            "content":"<div class=\"\"><div> <span>You are a 13 year old kid, You love Tv and Movies ever sense you were a little kid. You we’re fascinated by all the tv shows that were out there and were mainly interested in the Superhero’s and Star Wars. One day, during the summer you gain the power to transform into your favorite hero. You decided to become</span></div></div>",
            "created":1514324880,
            "id":2432882,
            "title":"male"
        },
        "1432":{
            "choices":[
                "You decide to transform into Bud from Married...With Children",
                "You decide to transform into Riley from Boondocks",
                "Other options or transform someone else"
            ],
            "content":"<div class=\"\"><div> <span> You are a female, a seventeen year old girl.  You're addicted to television.  Your powers allow you to transform yourself or anyone else into any television character you wish.  You get an idea.  You want to transform yourself into one of your favorite characters, even though the character may, and most likely will, be a male.  Who will you become?</span></div></div>",
            "created":1263704400,
            "id":821680,
            "title":"Time to Change the Channel!"
        },
        "144":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, what gender are you?</span></div></span></div>",
            "created":1263704400,
            "id":821538,
            "title":"Celebrity Transformation"
        },
        "1442":{
            "choices":[
                "Transform into a singer, like T-Pain",
                "Transform into an actor, like David Faustino",
                "Other or transform someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> You're a teenage girl with a wide range of celebrity interests.  Most of them are males and you've often fantasized about what it would be like to be them.  </span></div></span></div>",
            "created":1263704400,
            "id":821696,
            "title":"Who Wants to Be a Celebrity?"
        },
        "145":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Age tranformation",
                "Body transformation",
                "Other transformations"
            ],
            "content":"<div class=\"\"><div> <span>more choices<br>\r\n<br>\r\nE) Age tranformation, you gain the powere to change your or others age, you can't make the you or someone else older that eighty or younger than 5 months though.<br>\r\n<br>\r\nF) Body transformation, you gain the ability to change any part of your body in to anything that anogther human ever had<br>\r\n</span></div></div>",
            "created":1263704400,
            "id":821526,
            "title":"Other Transformations"
        },
        "1451":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "female",
                "male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One morething what gender are you?</span></div></span></div>",
            "created":1263704400,
            "id":821530,
            "title":"Age tranformation"
        },
        "14511":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "You start to consider it",
                "Nothing, its bullcrap"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Sophie, your a 18 year old brunette and you are enjoying the summer, lucky your parents were gone for the entire summer on a vacation to Europe so you had the entire house to yourself. One day your walking to the computer room, when sudenlly you hear a big boom outside, you look out and there is a crater outside, you look and there is a chest, then you open it and dust starts to fly out and hit you. You think what the hell is this stuff, then you look and there is a paper in the chest, you read it saying you have the power to change ages of anybody, including yourself. You think that is bullcrap, but then....</span></div></div>",
            "created":1310965200,
            "id":1149763,
            "title":"female"
        },
        "145111":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Younger",
                "Older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, it wouldn't hurt to try it out, so you decide to go in the bathroom and make yourself,</span></div></span></div>",
            "created":1310965200,
            "id":1149766,
            "title":"You start to consider it"
        },
        "1451111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Continue in first person",
                "Third person sounds cool"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Real quick, anybody mind if we continue this in third person?</span></div></span></div>",
            "created":1409720400,
            "id":1851963,
            "title":"Younger"
        },
        "14511112":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Yes",
                "No, she loses control"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sophie gazes at herself in the mirror. 'I guess I wouldn't mind be a little bit younger.' She concentrates on herself and imagines being 16. Is she able to control her powers?<br>\r\n</span></div></span></div>",
            "created":1409720400,
            "id":1851964,
            "title":"Third person sounds cool"
        },
        "145111122":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Just a little",
                "A lot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>By how much?</span></div></span></div>",
            "created":1409720400,
            "id":1851965,
            "title":"No, she loses control"
        },
        "1451111221":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Girl friend",
                "Boy friend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She opens her eyes and gasps. <br>\r\n\"What the freak?!\" She exclaims as she looks at a ten year old her in the mirror. She is shocked by the fact that it worked and that she is younger than planned. Suddenly there is a knock at the door.</span></div></span></div>",
            "created":1409720400,
            "id":1851966,
            "title":"Just a little"
        },
        "14511112211":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "She is scared",
                "She is happy"
            ],
            "content":"<div class=\"\"><div> <span>Sophie heads down stairs and heads towards the door. As her hand touches the door knob she stops. 'What will they think? What if it's some weirdo who kidnaps me? Or what if it is my boyfriend?' She considers and decides just to peek. she opens the door slightly and sees her friend Susie standing on her front porch. <br>\r\n\"Susie!\" Sophie shouts as she opens the door more but freezes when she remembers her situation.<br>\r\n\"Oh.... um  hi there kiddo, is um Sophie here? Is she  babysitting you?\"Susie replies with confusion.<br>\r\n\"B-but Susie..... I am Sophie!\" Susie has wide eyes and stands there with a blank look. Sophie takes her hand and leads her inside as she closes the door.<br>\r\n\"Alright kid, that was funny but there is no way you can be the real Sophie\" Susie says with hopeful disbelief.<br>\r\n\"No really, I can show you! I gained these weird powers and I can change peoples age!\" Sophie closes her eyes and gives a slight smirk as she imagines Susie being six.<br>\r\n\"Um what are you smiling at?\" Susie asks.<br>\r\nSophie opens her eyes and points at Susie \"Ha!\" But Sophie feels her clothes fall to the ground. \"Oh wait crap, um I don't exactly have perfect control of it yet...\" Sophie grabs for her clothes as she is now in a five year old sized body. How does Susie react?</span></div></div>",
            "created":1409770860,
            "id":1851968,
            "title":"Girl friend"
        },
        "145111122112":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Sophie looks up at Susie who has a massive smile on her face.<br>\r\n\"D'awwwwwww you are so precious!\" Susie says as she scoops up Sophie.<br>\r\n\"Hey! I ain't precious!\"<br>\r\n\"Oh I am sorry you are right, you are adorable and cute and so itsy bitsy!\" Susie says as she tickles her now child friend.<br>\r\n\"Haha! Stop it! haha! I am not a real kid! and hey haha I could turn you into a baby!\" Sophie says not being able to contain her laughter.<br>\r\n\"Oh really? Cuz I am pretty sure you just tried that, am I right? You wouldn't wanna turn yourself into a baby now would you?\" Susie smirks.<br>\r\nDoes Sophie try?</span></div></div>",
            "created":1409771100,
            "id":1851973,
            "title":"She is happy"
        },
        "1451111221122":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Try to fight back",
                "Might as well give it a shot, it won't be forever, right?"
            ],
            "content":"<div class=\"\"><div> <span>Sophie looks away and blushes as she knows that will probably be her fate.<br>\r\n\"Heh that's what I thought\" Susie says \"But that won't stop me from diapering you up!\"<br>\r\n\"What?!?!\" Sophie shouts. Soon Sophie is being carried out to Susie's car and is soon strapped into a toddler seat Susie had in the trunk.<br>\r\n\"Wait wait... why do you have a toddler seat?\"<br>\r\n\"Oh I just um babysit sometimes and it comes in handy... yeah\" Sophie gives Susie a questioning look as she is strapped in. Susie get's in and drives to her apartment. Sophie realizes she is about to be played with liked a doll and wiggles and struggles even more. <br>\r\n\"Hey now settle down little one\" Susie chuckles as she undoes Sophie from her seat. \"Will it really be that bad?\"<br>\r\nWhat does Sophie do?</span></div></div>",
            "created":1409771400,
            "id":1851975,
            "title":"No"
        },
        "14511112211222":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Only diaper",
                "Maybe some cute toddler clothes"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine\" Sophie pouts as she is carried into Susie's apartment.<br>\r\n\"There's my girl!\" Susie says cheerfully. Susie takes Sophie into an extra room she has never seen, it looks almost like a nursery.<br>\r\n\"Susie what is this place?\"<br>\r\n\"Oh well like I um was saying before I babysit remember? I do it very often.\" Susie places Sophie on a changing table and strips her down. Sophie blushes and tries to cover up. It doesn't do her much good because her hands are quickly removed as powder is soon coating her bum, she just stares at the ceiling blushing as she feels the padding slide under her butt and she hears the crinkle as it is fastened.<br>\r\n\"There! Fresh and clean and no caffeine! teehee\" Susie giggles as she steps back and admires her work. Sophie sits up and looks down at her now padded crotch. It is an unusual diaper. It is much poofier than any baby diaper she has seen, and but it has all the babyish designs. She swigs her legs over the edge of the changing table and leaps off. She lands and as she tries to stand she notices the diaper is too thick for her to even close her legs. She stands there with her arms folded, poofy bottom, and a pouty face.<br>\r\n\"Well?\" She asks<br>\r\n\"Well what?\" Susie replies confused.<br>\r\n\"Are you just gonna leave me in a diaper? No other clothes?\"</span></div></div>",
            "created":1409771880,
            "id":1851978,
            "title":"Might as well give it a shot, it won't be f..."
        },
        "145111122112221":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Try to use her powers",
                "Might as well go with the flow"
            ],
            "content":"<div class=\"\"><div> <span>\"Hehe no\" Susie says with glee<br>\r\nSophie pouts even more.<br>\r\n\"Aw come on, cheer up sport!\" Susie says as she playfully pats Sophie big bum. \"Come on, I have some toys.\"<br>\r\nSusie goes over to a box and closet in the corner of the nursery and she pulls out many many baby toys as well as a mobile jumperoo. Sophie finds herself being placed in the jumper and has baby toys laid out in front of her. She glares at Susie who has a smile bigger than she has ever seen. What does Sophie do?</span></div></div>",
            "created":1409772120,
            "id":1851982,
            "title":"Only diaper"
        },
        "1451111221122211":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Does Sophie take control?",
                "Or does she stay the same?"
            ],
            "content":"<div class=\"\"><div> <span>Sophie closes her eyes and concentrates. She imagines Susie being ten. Even if it backfires and turns on herself at least it will make her old enough to do something.<br>\r\n\"Awww is my baby girl using her diaper?\" Susie giggles but then stops and realizes her voice is much higher now. Sophie opens her eyes and smirks as she sees a eight year old Susie standing in front of her.<br>\r\n\"Ah! You turned me younger!\"<br>\r\n\"Yeah! and I can do it again and make YOU the baby!\"<br>\r\n\"Wait wait wait! You still need me!\"<br>\r\n\"Get me out of this jumper and then I will decide that\" Sophie demands. She is lifted out and placed on the floor. She stands their considering her options. Susie is grabbing at her clothes trying to make them stay on. <br>\r\n\"What are you doing?\" Sophie asks<br>\r\n\"What do you mean? I am doing exactly what it looks like, trying to stay clothed!\"<br>\r\n\"Why? I am standing here in only a diaper, I think you can stand to be naked.\" Sophie demands with her hands now on her hips. Susie blushes and drops her baggy clothes. As they hit the floor Sophie's jaw almost does the same.<br>\r\n\"Is... is that a...\" Sophie stammers pointing at Susie's waist. Susie blushes and nods as she fixes her loose diaper by adjusting the tapes.<br>\r\n\"Why are you in a diaper already?! Did I do that?\" Sophie asks<br>\r\n\"N-no, I did. I actually was wearing them just now, when I was a teen. All this baby stuff is for me, I don't actually babysit\" Susie says with her face now being beat red.<br>\r\nSophie bursts into laughter.</span></div></div>",
            "created":1409772720,
            "id":1851989,
            "title":"Try to use her powers"
        },
        "1451112":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Nothing happened",
                "Sudden change"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Of course you want older, that way you can see your future self, so you set the age of 26 in your head, then</span></div></span></div>",
            "created":1310965200,
            "id":1149767,
            "title":"Older"
        },
        "14511121":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Your bra snappen",
                "Seem taller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look at yourself, nothing changed, you were kinda dissappionted, but you knew this would happen, so you walk out of the bathromm, and go into the kitchin, when suddenly</span></div></span></div>",
            "created":1310965200,
            "id":1149768,
            "title":"Nothing happened"
        },
        "145111211":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "This is awesome",
                "This is scary,"
            ],
            "content":"<div class=\"\"><div> <span>You heard a snapping noise, it was your bra. You look and see both strapps have broke. You wonder what could of cause this when suddenly a sensation when through your body, you fall to the ground and your body changes. Your shirt was becoming tight on you and everything else. After it ended you got up, and you seemed quite taller, you look in the mirror, and you seem much older then what you were before.</span></div></div>",
            "created":1310965200,
            "id":1149771,
            "title":"Your bra snappen"
        },
        "1451112111":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Get changed, you decide what she wears."
            ],
            "content":"<div class=\"\"><div> <span>This is awesome you think, so you go back to the bathroom to see your new body, and to your suprise it was amazing. Your boobs were now as big as can be, the were now F cup, suprising as they were as big as your older sisters now. You grew at least half a foot and your hair was down to your waist. Lucky you lived next door to your big sis, and she wasn't home, so you pop in with here spare key, and you go through for clothes, and you see a bikini, some shorts, t-shirts, and skirts. You take some of each and go back home.</span></div></div>",
            "created":1310965200,
            "id":1149781,
            "title":"This is awesome"
        },
        "14511121111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Shirt and Skirt",
                "Bikini or other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she wear?</span></div></span></div>",
            "created":1318827600,
            "id":1208267,
            "title":"Get changed, you decide what she wears."
        },
        "145111211111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Your friend",
                "Your sister or other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You slip on the shirt and skirt and realize that they are even a little tight, the shirt shows just a little of your stomach and the skirt is above your knees. You go into the living room and here a knock on the door. It's.......</span></div></span></div>",
            "created":1318827600,
            "id":1208277,
            "title":"Shirt and Skirt"
        },
        "1451112111111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "girlfriend",
                "boyfriend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A girlfriend or boyfriend?</span></div></span></div>",
            "created":1318827600,
            "id":1208279,
            "title":"Your friend"
        },
        "14511121111111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Explain to her your power.",
                "Hide your power."
            ],
            "content":"<div class=\"\"><div> <span>It's not only one of your girlfriends but your best girlfriend, Suzie. \"Whoa.......\" She says as she looks at your new body. She has always been on the short and skinny side. She stands at barely 5'0\" and you have never seen her look or weigh more than 70 or less. She just stands there with her jaw open and finally asks. \"I'm sorry is this not the right house?\" You giggle a little and....</span></div></div>",
            "created":1318827600,
            "id":1208282,
            "title":"girlfriend"
        },
        "145111211111111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Her",
                "Yourself"
            ],
            "content":"<div class=\"\"><div> <span>You grab her and walk her inside. \"Ofcourse it is, silly.\" You laugh and sit down with her on the couch. You explain to her about your power. \"So you can really change the age of anyone?\" She asks. You nod with a big smile on your face. \"Amazing! Can you show me?\" You think about it and give a demonstration on......</span></div></div>",
            "created":1318827600,
            "id":1208286,
            "title":"Explain to her your power."
        },
        "1451112111111111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Younger",
                "Older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Younger or older?</span></div></span></div>",
            "created":1318827600,
            "id":1208288,
            "title":"Her"
        },
        "14511121111111111":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Younger but still teen",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How young?</span></div></span></div>",
            "created":1318827600,
            "id":1208290,
            "title":"Younger"
        },
        "145111211111111112":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "10-12",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alrighty, how much more?</span></div></span></div>",
            "created":1318827600,
            "id":1208291,
            "title":"Younger"
        },
        "1451112111111111122":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "6-9",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>K how much more?</span></div></span></div>",
            "created":1318827600,
            "id":1208293,
            "title":"Younger"
        },
        "14511121111111111222":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "4-5",
                "0-3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>K last one.</span></div></span></div>",
            "created":1318827600,
            "id":1208294,
            "title":"Younger"
        },
        "145111211111111112221":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "5",
                "4"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>K which one?</span></div></span></div>",
            "created":1318827600,
            "id":1208295,
            "title":"4-5"
        },
        "1451112111111111122211":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Change her back.",
                "Play with her a bit."
            ],
            "content":"<div class=\"\"><div> <span>You think 5 years old and then smile. \"Come on let me show you.\" You grab her by the hand and start walking towards the attic. While you are walking she starts to get smaller, and smaller. She finally trips over her jeans and almost lands face first but you catch her in time. She looks up at you now a 5 year old. \"W-wha did you do?\" She asks. \"I showed you what I could do.\" You say smiling down at her. \"I didn't mean on me!\" She says in a high squely voice. You.....</span></div></div>",
            "created":1318827600,
            "id":1208301,
            "title":"5"
        },
        "14511121111111111222112":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Complies",
                "Keeps struggling."
            ],
            "content":"<div class=\"\"><div> <span>You smile and pick her up. All her clothes fall of except her panties, which she is using to cover up. \"Hey come on, change me back.\" She cries. \"Aw but you look so cute. Why don't we have fun with this?\" You say to her craddling her in your arms as you head up to the attic. You put her down and slide out a box with 'baby stuff' written on it. She sees this and tries to run but trips over her baggy panties. You sweep her up again. \"B-b-but I'm fwive, not one! I don nweed baby stwuff!\" She says as she tries to struggle from your arms. \"Don't forget i could make you younger.\" You threaten. She.....</span></div></div>",
            "created":1318827600,
            "id":1208311,
            "title":"Play with her a bit."
        },
        "145111211111111112221121":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Feed her.",
                "Play with her."
            ],
            "content":"<div class=\"\"><div> <span>She shuts up and relaxes. You lay her down and take away her panties. You take out some baby powder and cover her rear in it. Then you get out the package of diapers and take one out. You slide it under her butt and do the tapes up. You look at your work and smile, she on the other hand is frowning and trying to cover up the diaper with her small hands. You grab her hands and push them off to the side and put your mouth on her stomach and blow. A loud 'FTTTTTTTTTT' echoes in the attic, followed by her uncontrolable laughter. \"Haha, no stop, hahaha, please!\" She can't help but laugh, you do that for a couple of minutes then you pick her up and walk down the stairs. You.....</span></div></div>",
            "created":1318827600,
            "id":1208319,
            "title":"Complies"
        },
        "1451112111111111122211211":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Baby food",
                "Milk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Baby food or milk?</span></div></span></div>",
            "created":1318827600,
            "id":1208320,
            "title":"Feed her."
        },
        "14511121111111111222112112":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Breast",
                "Bottled"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Breast or bottled?</span></div></span></div>",
            "created":1318827600,
            "id":1208323,
            "title":"Milk"
        },
        "145111211111111112221121121":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Play with her",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You sit down on the couch and take your shirt off revealing your huge breasts. She tries to struggle but you push her head against your chest and she can't resist the instinct. She starts to suck, she tries to pull away every now and then but keeps on sucking. After a minute or so of feeding you put her over your back and patt her, she burps and you can feel the blush on her face. You smile and bring her around front, sure enough her face is bright red, you cue her a little and tickle her tummy. You then decide to......</span></div></div>",
            "created":1318827600,
            "id":1208332,
            "title":"Breast"
        },
        "1451112111111111122211211211":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "Goes with it",
                "Resists"
            ],
            "content":"<div class=\"\"><div> <span>You set her down on the floor just standing there in the middle of the living room with nothing but a diaper on. She looks down and observes it, she reaches her hand down and feels it. She brings her hand back up, blushing even more now. You giggle and get up to leave, you pat her padded butt before leaving. You come back downstairs dragging the 'baby stuff' box. She is now sitting on the big rocking chair all the way back, you laugh at the adorable sight of her engulfed in the massive chair. You pull a rattle out of the box and go over and shake it at her, she.......</span></div></div>",
            "created":1348290000,
            "id":1432555,
            "title":"Play with her"
        },
        "14511121111111111222112112112":{
            "author_id":"elek",
            "author_name":"elek",
            "choices":[
                "I love being a mother",
                "I want to join her"
            ],
            "content":"<div class=\"\"><div> <span>She turns her head and pouts. \"I am not a baby!\" She said. \"Oh? Well that diaper could have fulled me and oh!...... I would say you are in fact a baby.\" You say looking at her with a smirk. She looks at you confused then feels the diaper and realizes it is loose. She looks at her body and realizes she is now three. \"Why awe you dowing dis to me!\" She says in her new adorable voice. \"For fun!\" You say with a glowing smile as you fasten her diaper to fit again. You and her the rattle and this time she plays with it. \"Smart girl.\" You say as you go back to the box and pull out a foldable play pen. You set it out and set her in it with some play things and stuffed animals. You stand up and admire your work. You think......</span></div></div>",
            "created":1348290000,
            "id":1432559,
            "title":"Resists"
        },
        "145111211112":{
            "author_id":"stabatron",
            "author_name":"Woogie, Destroyer of Worlds",
            "choices":[
                "Bikini...",
                "Something else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, do you don the bikini, or something else?</span></div></span></div>",
            "created":1335416400,
            "id":1322961,
            "title":"Bikini or other?"
        },
        "1451112111122":{
            "author_id":"stabatron",
            "author_name":"Woogie, Destroyer of Worlds",
            "choices":[
                "Shirt and Shorts...",
                "Bikini Top and Skirt..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you put on?</span></div></span></div>",
            "created":1335416400,
            "id":1322962,
            "title":"Something else..."
        },
        "14512":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Start to wonder if it is real",
                "Go do something else"
            ],
            "content":"<div class=\"\"><div> <span>It was a normal day in the the neighboorhood you lived in, a sunny day during the summer was something you always adord. You were 18 year old Jack and you were excited for the summer before you had to go off to college, and you wanted it to be a fantastic summer to remember, although you did not know ahead of time, but this will be a day that will change your life forever. You wake up on a Saturday morning and go into the kitchen, of course its empty since your parents are on vacation. Then thoughts went started to come up, what were you going to do that day, when suddenly you look out your window and see a small crater outside. Apon examining the crater, you see a chest in it. You take the chest back to the kitchen, and when you open it, a weird power comes out and gets all over you. You start to dust if off and spit it out as well.<br>\r\n<br>\r\nThen you see a note saying \"Congratulations, you have been given the power to alter peoples age, further explination on the back.:<br>\r\n<br>\r\nYou think what kind of nonsense is this, then you</span></div></div>",
            "created":1310965200,
            "id":1149751,
            "title":"male"
        },
        "145121":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Go Younger",
                "Become Older"
            ],
            "content":"<div class=\"\"><div> <span>The paper did sound interestion, the power to alter age itslef. So you decide to see if it is true, you go to your batheroom because there is a huge mirror there and you could see if there was any progress. You think to yourself what would be a good age to test it out on, and you think something either much younger or much older would work. </span></div></div>",
            "created":1310965200,
            "id":1149753,
            "title":"Start to wonder if it is real"
        },
        "1451211":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "10-15",
                "Younger then 10"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You felt sorta nostalgic today, and decide to go with the younger route, so you read the paper again, and it said to just think of the age and it will happen to yourself or the person you look at, then you decide to go with the age of...</span></div></span></div>",
            "created":1310965200,
            "id":1149754,
            "title":"Go Younger"
        },
        "14512112":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Nothing at first",
                "Sudden Change"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You thought if this was real, you wanted to have a lot of fun, so you decide to turn into a three year old for the hell of it. You think that, then...</span></div></span></div>",
            "created":1310965200,
            "id":1149758,
            "title":"Younger then 10"
        },
        "1452":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One more thing, what sex are you?</span></div></span></div>",
            "created":1263704400,
            "id":821528,
            "title":"Body transformation"
        },
        "14521":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "He is 13 years old.",
                "He is 16 or 17 years old."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is the main hero, who gains the ability to transform himself, or others?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1279947600,
            "id":923701,
            "title":"male"
        },
        "145212":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "16",
                "17"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is he 16 or 17?</span></div></span></div>",
            "created":1351227600,
            "id":1454129,
            "title":"He is 16 or 17 years old."
        },
        "1452122":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Jane shakes me awake",
                "One of my other friends shakes me awake"
            ],
            "content":"<div class=\"\"><div> <span>I will not say my name. For now, you should call me John Smith. I know this is hard to believe, but I am a super hero. I can alter my body as well as others around me. I lived a happy life with my powers, using them to help people, but then one day, one terrible day, it was all gone. <br>\r\n<br>\r\nMy story begins at a high school. Myself and my friends are hanging about in the playground when a box flies over the wall and lands beside us. Jane, oh Jane, where did it all go wrong, picked it up and looked at it. As we gathered around, studying the box, it opened of it's own accord. A blue mist came out and circled around us, then went back into the box. A red mist followed the same trajectory then it too went back to the box. A rock floated out of the box and circled us followed by a gust of air. Once the strange mists and rock had gone back into the box, the box glowed and the glow enveloped all of us. After that, we found ourselves on the ground exactly where we had found the box, only the box was gone.</span></div></div>",
            "created":1351227600,
            "id":1454133,
            "title":"17"
        },
        "14521222":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Do you or any of your friends discover powers on the way to class?",
                "Do you skip to the end of the day?"
            ],
            "content":"<div class=\"\"><div> <span>I come too to find Ben shaking my shoulders. <br>\r\n\"What happened?\" I asked<br>\r\n\"We all lost consciousness after the box vanished\" said Jane, who was also standing up. <br>\r\n\"What do you think it was?\" asked Ben <br>\r\n\"Should we take another look at it?\" you asked. I looked around for the box. It was nowhere to be seen. <br>\r\n\"It's a pity\" said Ben \"That box was unnatural, I wonder if that mist did anything to us\" <br>\r\n\"Nothing we can do about it now\" said Jane \"Lets head to class, we've got English\" <br>\r\nBen groaned. We had talked him into taking English further because of his imagination, but he was falling asleep in the class most of the time.<br>\r\n\"You can groan later, we need to get to class now\" said Jane, dragging him behind her as the three of you head to English.</span></div></div>",
            "created":1351227600,
            "id":1454135,
            "title":"One of my other friends shakes me awake"
        },
        "145212222":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Jane teleports to her house and back",
                "Jane tells you to copy one of her body parts"
            ],
            "content":"<div class=\"\"><div> <span>I suggest to my friends to go back to my place. They agree and we go back. As I get to my room, a strange voice comes from my desk. The three of us run over to see the box. <br>\r\n\"You have been chosen\" said the box \"You shall receive powers, John, you shall receive the power of body transformation, you can transform your own body into any other body part that has ever been in existence, and also change other peoples body parts, but this will drain your energy, Ben, you have the ability to conjure and manipulate fire and water, and lastly, Jane, you will be given mind reading and controlling powers as well as he ability to tele-port, have fun with your powers\" And with that, the box dissolved into nothingness. <br>\r\n\"Do you believe that crap?\" asked Ben<br>\r\n\"Well, can you think of a better explanation for a talking box that spits out rocks and mist?\" asked Jane<br>\r\n\"Jane's right\" you say \"There must be a way to test if it's actually real\" <br>\r\n\"I think I have a way to test it\" said Jane</span></div></div>",
            "created":1351227600,
            "id":1454154,
            "title":"Do you skip to the end of the day?"
        },
        "1452122222":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Jane teleports behind you",
                "Jane reads your mind"
            ],
            "content":"<div class=\"\"><div> <span>\"There's only one way to test if we have these powers in a controlled way\" said Jane \"You need to copy one of my body parts\" <br>\r\n\"What part do you have in mind?\" I asked<br>\r\n\"Well, I was thinking hair, since mine is long and blonde and yours is short and black, it would be an appropriate change\" Jane suggested<br>\r\n\"I thought, since it said I could have any human body part, I should try a body part that doesn't come from a male to make it a proper test\" I said \"Perhaps I could copy your breasts\"<br>\r\n\"I don't think that would...oh\" Jane trailed off as two mounds started pushing out of my t-shirt.<br>\r\n\"Well, I guess it wasn't a prank\" I said, prodding my new breasts, not quite believing they were real. <br>\r\n\"Uh, John, you do know that's not polite, don't you?\" said Jane. I suddenly realised what I was doing and turned red in shame.<br>\r\n\"Well, we know mine works, what about yours?\" I asked Jane  </span></div></div>",
            "created":1351227600,
            "id":1454156,
            "title":"Jane tells you to copy one of her body parts"
        },
        "14521222221":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Our 'friend' pays us a visit",
                "We continue to prepare"
            ],
            "content":"<div class=\"\"><div> <span>You feel a tap on your shoulder from behind. You turn to find Jane standing behind you. <br>\r\n\"Wow that's cool\" I said \"But what do we do with these powers?\" <br>\r\n\"We could protect people from evil\" said Jane \"With your powers, you could become the fastest or strongest man alive, and with my teleporting powers, we would be able to go anywhere\" <br>\r\n\"It's a great idea, your mind reading powers would give us an edge\" I said, getting excited. <br>\r\nThat was how we got our powers. After that, the three of us travelled the world, helping people, defeating villians, you know, all that super hero crap. Our powers could not be equalled by the non powered villians and mostly, they just gave themselves up and came quietly. Then, he came. Some say he came from another dimension. Some say he came from a far away world on the other side of the Universe. But we knew better. He was someone we knew. A good friend who was somehow corrupted by power and greed. His father had become head of a large company developing weapons for use in the military. It was during an experiment to create a serum to create bullet proof skin, our friend got caught in the middle of two fusion lasers. The lasers were not calibrated right, so the bullet proof skin wasn't the only effect of the change. Any bullets shot at him were absorbed and his skin became tougher. He took over his fathers company and used the machines to create an army of robots imbedded with the bullet proof serum. He eventually took over most of the United States and moved on to conquer Europe. In Britain, we prepared for the worst. </span></div></div>",
            "created":1351314000,
            "id":1454640,
            "title":"Jane teleports behind you"
        },
        "145212222212":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Too late for strategy. The Bullet Man and his army are here!!!",
                "I have a strategy"
            ],
            "content":"<div class=\"\"><div> <span>Out on the sea, far enough away from the mainland and islands, we stood on board a large platform. We would not allow Bullet Man (as we called him) to get to our home in Britain. The boats were surrounding the whole of Britain. \"Activate the shield\" said Ben. A large shimmering purple dome rose up from the boats, covering all the area around Britain. Our plan was to force the Bullet Man to take the Channel Tunnel. It was easily defensible and it made flanking almost impossible. The British Defense Force was getting ready for the battle. The copper bullets had been replaced by iron. Ben had had a theory that if we could force the bullet robots to absorb iron instead of the copper that other people had been shooting at them, they would eventually corrode. Since Iron was a stronger metal than copper, the bullet serum would reject the copper in favor of the iron. It was a good theory. We stepped into a speedboat and were taken back to Britain. <br>\r\n\"Iron needs air and water to rust\" said Ben \"Dam the rivers and direct them towards the Channel Tunnel, do not release the water until the men have shot at least one bullet at each of the Bullet Men\" <br>\r\n\"We should get ready too, Ben\" I said \"We're going in too\" <br>\r\n\"Yeah\" said Jane \"We still need a strategy for the Bullet Man\" <br>\r\n</span></div></div>",
            "created":1351314000,
            "id":1454657,
            "title":"We continue to prepare"
        },
        "1452122222122":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "The battle",
                "Yet more preparations"
            ],
            "content":"<div class=\"\"><div> <span>\"The Bullet Man is not a robot like his soldiers, he won't be able to breathe if we can force him to stay underwater, I hope it doesn't come to this, I hope we can reason with him, he was our friend, if anyone can get through to him, it's us\" I said \"If it comes to the worst, we'll have to drown him, I see no other way\" <br>\r\n\"I don't like it\" said Ben \"I don't want to kill a friend\"<br>\r\n\"I promise we won't use it except as a last resort\" I said \"But if it comes to it, you will have to bring up the water to kill him\" <br>\r\n\"Your right\" said Jane \"Ben, you'll have to do it, we wouldn't ask you to do it if we could see another option\" <br>\r\nBen took a deep breath. \"All right\" he said \"But this is the final option, until we've tried everything else, we don't try this\" <br>\r\n\"Understood\" I said \"Let's go finish preparations\"<br>\r\nI should have seen it then. Ben had great power, great potential, but he had a great weakness, although most would not call it a weakness at all. Ben cared about his friends. The Bullet Man had once been one of our friends. We hung out together, went to school together. From this closeness, Ben had developed a small loyalty to him. This loyalty would prove to be our undoing. </span></div></div>",
            "created":1351573200,
            "id":1456888,
            "title":"I have a strategy"
        },
        "14521222221222":{
            "author_id":"kipgrowth",
            "author_name":"Kip",
            "choices":[
                "Great idea! It should work!",
                "I dont know..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"WAIT\" Jane exclaimed, \"John, you can change body parts! You can copy his power, or even force regular skin on Bullet man! You could make him human again that way!\"</span></div></span></div>",
            "created":1390194000,
            "id":1730809,
            "title":"Yet more preparations"
        },
        "14522":{
            "author_id":"meepyweepy",
            "author_name":"Loops",
            "choices":[
                "She will be 9 or 12",
                "She will be 16 or 20"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is the main hero of this story? </span></div></span></div>",
            "created":1578082920,
            "id":2768823,
            "title":"female"
        },
        "1453":{
            "author_id":"fivefooteight",
            "author_name":"tom darcenn",
            "choices":[
                "Transformation",
                "Size Transformation",
                "other choices"
            ],
            "content":"<div class=\"\"><div> <span>Even more choices<br>\r\n<br>\r\nTransformation, the abbility to transform your body into any shape or form, only not your colours and you have limits to how large you can become or how far you can strech, your overall weight doesn't change, you do gain what you turn into's physical properties, to an extent, if you turn into a brick wall you become hard like one, but you don't gain animals or mechines abbilities if you turn into one.<br>\r\n<br>\r\nSize transformation<br>\r\n<br>\r\nThe abbility to change size, ether growing up to fifty feet or shrinking to an millimeter, your strength stays the same in your smaller forms, as does your stamina and your durabillity, put it increases up to a point as you grow taller, you can't stay in any greatly different form for to long as you soon get extreamly hungry and thirsty, due to the ammounts you need to sustain your self, I also would like it if people payed attention to the force by mass, as they get smaller. (For anyone who doesn't know what that means, email me.)</span></div></div>",
            "created":1281589200,
            "id":934982,
            "title":"Other transformations"
        },
        "14531":{
            "choices":[
                "male ",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you male or female?</span></div></span></div>",
            "created":1310965200,
            "id":1149803,
            "title":"Transformation"
        },
        "145311":{
            "choices":[
                "Yes",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Alex.<br>\r\nhe has no clue what he can do or why he can do what he can.</span></div></span></div>",
            "created":1310965200,
            "id":1149816,
            "title":"male "
        },
        "1453111":{
            "author_id":"mistywriter",
            "author_name":"Shadow Writer",
            "choices":[
                "\"Front door. And you first Marcene...\"",
                "\"Back door's safer... your crazy Marcene...\""
            ],
            "content":"<div class=\"\"><div> <span>\"Explain to me again why we are here\" Alex asked Marcene.<br>\r\n\"Because you need to get out more and try new things\" Marcene hissed back at him.<br>\r\n<br>\r\nMarcene pushed back her black hair as she and Alex lay on a hill overlooking the factory beneath you. Well, Factory was the incorrect term, 'crazy testing facility' would be more accurate.<br>\r\n\"I'm not breaking into a government lab!\" Alex pouted. \"So maybe I DO need to get out more, but that doesn't mean I have to do illegal things!\"<br>\r\n\"Come on, have some fun once in a while!\" Marcene groaned.<br>\r\n\"Fun for me is curled up in my room playing games on my console!\"<br>\r\n\"Only fun for so long...\"<br>\r\n\"I've done it for years!\"<br>\r\n\"Well now you can try something new!\"<br>\r\n<br>\r\nAlex sighed. He was never going to win against Marcene. She was always trying to drag him on harebrained adventures - half of them illegal - just for the sake of doing it. Either way, there was no way he was getting out of this one.<br>\r\n\"Alright. Fine. We'll try and break in. Oh wise one, tell me how break into a GOVERNMENT FACILITY\" Alex said with a heavy heart of sarcasm.<br>\r\n\"I swiped a keycard\"<br>\r\n\"Marcene!\"<br>\r\n\"What? It was... lying around...\"<br>\r\n\"On someone's belt?\"<br>\r\n\"Well he wasn't using it\"<br>\r\n\"I bet...\"<br>\r\n<br>\r\nYou and Marcene watched as the last of the lights went out in the facility. Your parents were away for the weekend so they wouldn't be questioning why you weren't home before it got dark.<br>\r\n\"Front door or back door?\" Marcene asked, grinning at you.</span></div></div>",
            "created":1481016240,
            "id":2246356,
            "title":"Yes"
        },
        "14531112":{
            "author_id":"mistywriter",
            "author_name":"Shadow Writer",
            "choices":[
                "You get away safely.",
                "Too late, security has found you!"
            ],
            "content":"<div class=\"\"><div> <span>\"Back door's safer... Your crazy Marcene...\" You told her.<br>\r\n\"Crazy enough to break into a government facility? Yes, I should think so\" She grinned.<br>\r\n<br>\r\nAvoiding the rotating automated spotlight, you crept up to the door and Marcene pushed the swipe card through the reader. It gave a satisfied double beep and you heard the door click open. Marcene crept in slowly, with you behind her.<br>\r\n\"Anything in particular you wanting to swipe?\" You asked her. You didn't even know what went on here.<br>\r\n\"No idea what they even do here. I'm makin-\"<br>\r\n\"-Making it up as you go... figured\" You finished her sentence.<br>\r\n<br>\r\nYou and Marcene made your way through the dark corridors, taking care to avoid the light so as to try and stay out of vision of the cameras.<br>\r\n\"Hey, a lab - wanna check it out?\" Marcene asked you.<br>\r\n\"Like I gotta choice\" You shrugged.<br>\r\n\"Can you at least try and enjoy this?\" Marcene pouted.<br>\r\nYou rolled your eyes and opened the door.<br>\r\n<br>\r\nThe lab was mostly dark except for the far corner which had a table lamp still on, focused directly down on a small vial of green, translucent liquid.<br>\r\nAround the rest of the lab was machinery far beyond your comprehension - all of which seemed mostly for working with various liquids - heating and cooling them... and mixing? You couldn't tell at all.<br>\r\n\"Anything interesting?\" Marcene asked, perusing the shelves before turning to you.<br>\r\n\"Not really. I don't understand any of this\" You said. \"Although that vial there under the light looks weird\"<br>\r\nBoth you and Marcene moved to inspect it.<br>\r\n\"Dare you to drink it\" She teased.<br>\r\n\"Hell no!\"<br>\r\n\"What's the worst that could happen?\" She asked.<br>\r\n\"I could... I dunno... DIE?\" You snapped.<br>\r\n\"Alright, chill.\" She said, losing interest in it and moving away to look at something else.<br>\r\n<br>\r\nYou looked away to find anything else interesting in the lab. It couldn't have happened at a worse time, but you suddenly slipped on the polished floor and your bottom hit the ground. Reaching out to save yourself, you caught the edge of the bench, knocking it badly and smaking the vial, causing it to tip over and pour the liquid right out... conveniently into your mouth as you lay on the ground dazed.<br>\r\n<br>\r\nThe liquid burned as it sizzled down your throat. You tried to cough it out but to no avail.<br>\r\n\"Damn! You alright Alex?\" Marcene was by your side, pulling you up.<br>\r\nThe best you could do was hack and cough to try and get it out, but it was all for naught.<br>\r\n\"Uhhh, we should get out of here!\" She cried, dragging you to the door.</span></div></div>",
            "created":1481016900,
            "id":2246359,
            "title":"Where it all goes wrong."
        },
        "145311121":{
            "author_id":"mistywriter",
            "author_name":"Shadow Writer",
            "choices":[
                "It works - all too easily...",
                "It doesn't work. Maybe something else?"
            ],
            "content":"<div class=\"\"><div> <span>The escape from the facility was barely memorable. You stumbled the whole way, your vision blurred and your chest burning. By the time you made it back to your place - Marcene having dragged you for most of it - you were feeling a little bit better.<br>\r\n\"The hell was that stuff?\" She asked.<br>\r\n\"Dunno... but if I ain't dead now I guess I'll be okay\" You huffed.<br>\r\n<br>\r\nYou unlocked the door, went to your room and crashed in the bed with a resounding thump.<br>\r\n\"It's probably best for you to not be alone tonight\" Marcene said.<br>\r\n\"Your house is crazy and noisy at night. I am not going there\" You responded, waving your finger in there.<br>\r\n\"Then I'll crash on your couch\" Marcene laughed.<br>\r\n\"Whatever\" You replied, falling asleep.<br>\r\n<br>\r\n-----<br>\r\n<br>\r\nYou awoke with a start, sitting up in bed and looking around with a daze. Some loose hair was in your face so you pushed it back with your hands.<br>\r\n\"That's odd... I don't have long hair\" You murmured. Then you shouted with a start.<br>\r\n\"My voice! What the hell!?\" You shouted - noticing that your voice had changed to a female. Looking down you discovered that your entire body was different - now female. You even had breasts.<br>\r\n<br>\r\n\"Please be a dream...\" You cried. But nothing changed. You had no idea that you'd change into a woman over night - what was in that vial?<br>\r\n<br>\r\nGetting out of bed carefully, through the daze and confusion you at least made out that you retained your clothes from last night - that was a relief. If Marcene was about though, she'd either freak out or find it totally cool.<br>\r\nOpening up your phones camera, you looked at the display and found your new face was... oddly familiar. Very familiar.<br>\r\n\"Eianna?\" You murmured.<br>\r\nEianna was a popular female from an RPG you had been playing recently on your console. She was a significant person to the main protagonist and despite getting into trouble many times, she made a useful companion and a decent fighter. She had become quite popular on the internet and even had a few meme's made about her. Though you'd never admit it, you had fantasized about you and her as a couple.<br>\r\n<br>\r\nPraying against all odds and closing your eyes, you thought about trying to change back...</span></div></div>",
            "created":1481017560,
            "id":2246363,
            "title":"You get away safely."
        },
        "14533":{
            "author_id":"bob365",
            "author_name":"Bob365",
            "choices":[
                "Continue—will award points"
            ],
            "content":"<div class=\"\"><div> <span>Will award points to anyone who adds to this chapter accurately;<br>\r\nMother transformation—You have the uncontrolled power of accidentally turning people you see into their mothers. Once they are transformed, they forget who they are and are convinced they were always their mother.</span></div></div>",
            "created":1509342600,
            "id":2408784,
            "title":"Mother transformation—will award points"
        },
        "15":{
            "choices":[
                "You a robot in some way (Astroboy or Iron Man)",
                "You can control technology",
                "You own countless gadgets (batman)",
                "you wear a time controling watch",
                "maricle matter (can make anything)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm not going to use fancy comic book words but here it is.</span></div></span></div>",
            "created":1281416400,
            "id":933856,
            "title":"Technological"
        },
        "151":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Full on robot",
                "A cyborg",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A full on robot or a cyborg?</span></div></span></div>",
            "created":1397970000,
            "id":1783565,
            "title":"You a robot in some way (Astroboy or Iron Man)"
        },
        "1512":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One last thing. Male or female?</span></div></span></div>",
            "created":1397970000,
            "id":1783567,
            "title":"A cyborg"
        },
        "15122":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Parts",
                "Nano machines"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How are these cyborg parts implated into her?</span></div></span></div>",
            "created":1397970000,
            "id":1783642,
            "title":"Female"
        },
        "152":{
            "author_id":"writersblock19",
            "author_name":" Scythe",
            "choices":[
                "nearby electrical box",
                "drill left in the dumpster",
                "your choice of technical object"
            ],
            "content":"<div class=\"\"><div> <span>The robber ran down the street, carrying a large bag of money.<br>\r\nThe cops shouted for him to stop, but he just laughed.<br>\r\n\"Stupid cops...like i'd just stop.\"<br>\r\n<br>\r\nThe robber ran down down a nearby alley, but stopped short.<br>\r\nA seventeen year old boy stood in the alley facing him.<br>\r\n\"Move kid..i'm in a hurry.\"<br>\r\nHe looked at the robber and pointed at him.<br>\r\n<br>\r\n\"Return it.\"<br>\r\n\"What?\"<br>\r\n\" I said..return it.  Return the money and i'll let you go.\"<br>\r\nThe robber laughed.<br>\r\nWho did this kid think he was?<br>\r\n<br>\r\nHe looked harmless...skinny, long blonde hair, jeans and a t-shirt.<br>\r\nWhat could this kid do?<br>\r\nThe robber pulled out a gun and pointed at the kid.<br>\r\n\"Last chance kid..move or die.\"<br>\r\n<br>\r\nHe sees the kid reach for a....</span></div></div>",
            "created":1344488400,
            "id":1401133,
            "title":"Techno"
        },
        "155":{
            "author_id":"writersblock19",
            "author_name":" Scythe",
            "choices":[
                "Janis summoned a horrifying creature",
                "Janis creates a giant elemental monster",
                "Janis creates copies of the men in suits"
            ],
            "content":"<div class=\"\"><div> <span>Janis LaRue ran down the sidewalk, trying to get away. Three men in suits ran after him, shouting for him to stop.<br>\r\nHe rounded the corner..cursing to himself.  You'd think it would be easy to lose someone on the busy streets on New York.<br>\r\n<br>\r\nAs he got close to the end of the street, he stopped.  In front of him were 7 men with guns pointed at him.  The three men behind him finally caught up.<br>\r\n\"Surrender Janis..there's nowhere you can go.\"<br>\r\nJanis turned and faced the men behind him.<br>\r\n\"Is that so?\" The man shifted anxiously.<br>\r\n<br>\r\nFrom what he saw...Janis had a scary side.  Even the doctors that worked on him feared him to some extent.<br>\r\n\"Remember this..i am unstoppable.  I can do anything..go anywhere...create anything.<br>\r\nFools like you can hardly scare me.\"<br>\r\n<br>\r\nA couple of the men opened fire.<br>\r\nJanis twisted quickly and dodged the bullets.<br>\r\n\"What?\"<br>\r\nJanis faced the men.<br>\r\n\"Not going to listen...then i'll show you!\"<br>\r\n<br>\r\nJanis clapped his hands together and lightning flew from his hands.<br>\r\nJanis shouted \"Now beg for your lives you pathetic fools!\"</span></div></div>",
            "created":1344488400,
            "id":1401127,
            "title":"a miracle worker?"
        }
    },
    "info":{
        "author_id":"fivefooteight",
        "author_name":"tom darcenn",
        "brief_description":"You gain super powers, but how are you going to use them? And are you good or evil?",
        "created":1263688620,
        "description":"<td align=\"left\" class=\"norm\">Due to some reason you gain one (or if your luckly several) superpowers due to some reason that you can decided.<br>\r\nYou decided how you use them.<br>\r\n<br>\r\nHere are the rules,<br>\r\nYou have to give the choice about your gender,<br>\r\nThe potanginist has to be either 13, 16 or 17 no other age (unless you power is to change age),<br>\r\nno wieght gain (or wieght loss) TF or object TF,<br>\r\nYou start off having limited control over your power but you quickly learn to control it comletly, IE you can turn it on and off when you want to. <br>\r\nNO SEX,<br>\r\nNO NUDITIY<br>\r\nNO DRUG USE OR REFFERANCE<br>\r\nNO SWEARING<br>\r\nNO TOILET STUFF<br>\r\nNO INSULTING ANY RELIGON<br>\r\nand keep this in the age limit<br>\r\n</td>",
        "id":1636724,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1578082920,
        "modified":1578082920,
        "pretty_title":"The Power"
    }
}