{
    "chapters":{
        "1":{
            "author_id":"sdmmfxv",
            "author_name":"SpaceMedafigtherX",
            "choices":[
                "Corona agrees with Eliza's request and sends her.",
                "Corona decides to send an artifact with her power instead.",
                "Corona has already been talking to the girl and altering her subconscious.",
                "The girl is into the occult, and has already made direct contact with Corona.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The stars twinkled below, the minuscule universe appearing as an infinitesimal speck within her hands as Corona Ognas, queen of all succubi, smiled seductively, licking her lips as she looked into the countless worlds below.<br>\r\n<br>\r\n“Found something interesting?” Elizabeth asked as she gave her mother a brief but sensuous kiss. “Or perhaps some<i>one</i>?”<br>\r\n<br>\r\n“Someone interesting indeed,” Corona nodded as she used her magics to show Elizabeth what she was looking at. “You see that one right there? She’s going to be your new sister.”<br>\r\n<br>\r\n“She is cute... Although she doesn’t seem to be ready yet. Shall I go and prepare her for you?” Eliza asked.</span></div></div>",
            "created":1301467620,
            "id":1078609,
            "title":"And so it begins..."
        },
        "11":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "The two goddesses find their mark uninterrupted.",
                "The lovers seek Corona's blessing before departing.",
                "Eliza and Athena are stopped by someone along the way to the mortal realm.",
                "One of their sisters wants to come along with them.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Do I really have to ask?” Corona chuckled. “I’ll leave the method of her acquisition up to you... Surprise me, Elizabeth. Show me why I should still dream of handing you my throne someday.”<br>\r\n<br>\r\n“Yes, Mother,” Eliza bowed before her. “I shall not disappoint you.” <br>\r\n<br>\r\nTaking flight, the daughter of the queen of all succubi immediately sought out her lover/wife Athena. Finding the red-headed angelic succubus only seconds later, Eliza hovered before her and began to inform her of her most recent assignment.<br>\r\n<br>\r\n“My darling goddess Athena,” the demoness began, “I have another fun day planned ahead for us. Would you like to guess what we’ll be doing?”<br>\r\n<br>\r\n“Hmmm...I’d have to guess adding another daughter to your mother’s exquisite family,” Athena chuckled.<br>\r\n<br>\r\n“My, such a smart pet, aren’t you?” Eliza asked as she slowly descended and kissed her mistress/pet on her lips, letting their tongues dance a familiar rumba that they had come to enjoy. “But yes, Mother has found quite the cute one this time. Are you ready to leave, my dearest Athena?”<br>\r\n<br>\r\n“But of course, my lovely pet,” the other succubus replied as she spread her angelic wings and took flight. “Lead the way, Eliza.”<br>\r\n</span></div></div>",
            "created":1301469300,
            "id":1078617,
            "title":"Preparations for Retrival"
        },
        "111":{
            "author_id":"sdmmfxv",
            "author_name":"SpaceMedafigtherX",
            "choices":[
                "Athena decides to seduce the elf directly by joining her in the lake.",
                "Athena decides it better to pretend that one of them is injured.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Compressing their powers so that they could fit upon a mortal plane, Elizabeth and Athena soon found themselves in a world akin to that of Abeir-Toril or Middle Earth, with medieval equivalent technology, but possessing powerful magics.<br>\r\n<br>\r\nThey found themselves in the middle of the Viridian Sea, a forest surrounded by mountains which was named for the way the leaves swayed in what looked like waves from the mountains above. Within the forest lived several clans of elves, as well as a herd of centaurs, and various non-sentient woodland creatures.<br>\r\n<br>\r\nSmiling to her lover, Eliza pointed to a lake in which a lone elf was bathing, \"That's her: Olara'orsa.\" The elven woman had dark brown skin, long silvery hair, gentle blue eyes hidden behind a pair of glasses, a pair of bountiful C-cup breasts, and of course, the signature long pointed ears of her race.<br>\r\n<br>\r\n\"Oh, she <i>is</i> a cutie...\" Athena whispered as she licked her lips. \"And I think I know exactly how we should get her.\"</span></div></div>",
            "created":1301548320,
            "id":1079238,
            "title":"Target acquired."
        },
        "1111":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "Athena begins to seduce Olara'orsa",
                "Eliza decides that Athena shouldn't be allowed to have all the fun...",
                "Olara'orsa screams, causing her villagers to rush to her aid"
            ],
            "content":"<div class=\"\"><div> <span>\"And how would that be, my goddess?\" Eliza asked.<br>\r\n<br>\r\n\"Watch and learn, my adorable little pet,\" Athena chuckled as she gently glided over to the elf's location. Landing just at the edge of the shore, the red-headed angel girl gently began to walk into the cool blue water. \"Mind if I join you?\" she asked her soon-to-be sister.<br>\r\n<br>\r\n\"Why sure! Feel free to...\" Olara'orsa turned around to see Athena's full form for herself, \"...come...in...?\"<br>\r\n<br>\r\n\"Why thank you sooooo much, my dear,\" Athena said calmly, ignoring the woman's gaze of surprise. \"My body could definitely use a nice bath...and having someone to share a bath with is soooooo much more enjoyable, isn't it?\" <br>\r\n<br>\r\n\"Ummm...You...You're...an angel?!\" the woman Olara'orsa exclaimed.<br>\r\n<br>\r\n\"Indeed I am. But, I'm a special kind of angel...\" Athena chuckled as she slowly began to walk towards the attractive elf, \"...one that is about to make your wildest dreams come true...\"</span></div></div>",
            "created":1301550120,
            "id":1079251,
            "title":"Fun in the Local Lake"
        },
        "11111":{
            "author_id":"sdmmfxv",
            "author_name":"SpaceMedafigtherX",
            "choices":[
                "Olara agrees, and quickly kisses Athena.",
                "Olara tries to flee, but runs right into Elizabeth."
            ],
            "content":"<div class=\"\"><div> <span>Athena quickly jumped at Olara, tackling her as she wrapped her arms and wings around the elf and forced her into a luscious kiss, forcing her tongue past Olara's lips. At first, Olara resisted, futilely trying to push Athena away, her body struggling to break free.<br>\r\n<br>\r\n\"Shhhhh... Don't resist... Give in, and let yourself become so much more than you could have imagined...\" Athena whispered, her voice entrancing the elf as she sent images of lust and vileness into the elf's mind. \"Soon, you will be my sister... A goddess to do whatever you please with your world.\"<br>\r\n<br>\r\n\"A-a goddess?\" Olara'orsa asked, then shook her head. \"No! You think I don't know what this is? You're going to try and make me sell my soul, and then devour it when my life is up!\"<br>\r\n<br>\r\n\"Your soul?!\" Athena burst into laughter. \"If I wanted to devour a soul, I would not have picked one so beautiful, so alluring... I am no mere demoness, but a goddess of lust... Come, join us... Become our sister, and drown yourself in an eternity of lust and pleasure!\"<br>\r\n<br>\r\nThe images were quickly overtaking Olara'orsa's mind... Images of her tormenting those who mocked her, making a harem of all the girls that were her friends, and ruling over what she thought to be the entire world. She would be beautiful beyond denial, powerful beyond reckoning... But she wouldn't be who she once was. Her mind would forever be warped by the dark power, and she wasn't sure if that was a sacrifice she was wiling to make...</span></div></div>",
            "created":1301553240,
            "id":1079280,
            "title":"Athena's Temptations"
        },
        "111112":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "Eliza and Athena inject Olara with their venom",
                "Eliza and Athena seduce Olara the old fashioned way"
            ],
            "content":"<div class=\"\"><div> <span>\"N-No! Never!\" the elf shouted as she managed to push herself away from the angelic deity. \"I'll never become like you!\" <br>\r\n<br>\r\nOlara began to run away as fast as her legs would carry her, though she was slowed down significantly by the water in the lake. As she began to approach the shore, a shadowy figure began to emerge from deep within the forest.<br>\r\n<br>\r\n\"Letting our newest sister get away, are we, my pet?\" the figure asked.<br>\r\n<br>\r\n\"Pet? What does she...?\"<br>\r\n<br>\r\n\"She means me, dear,\" Athena interrupted as she appeared behind the elf woman, causing the mortal to freeze in place from the shock of someone possessing such speed. \"I'd like you to meet your new 'big' sister and my lovely wife and lover, Eliza Ognas.\"<br>\r\n<br>\r\n\"Why Athena, you flatter me,\" the demoness chuckled. \"Now, Olara, are you ready to join us?\" Eliza asked as both she and Athena began to circle around their future sibling. \"Come now, you know you can't resist it. Stop fooling yourself and give in to your lusts.\"<br>\r\n<br>\r\n\"Eliza, I think she could use some 'encouragement', don't ya think?\" the angel-succubus asked. \"From <i>both</i> of us...\"</span></div></div>",
            "created":1301556600,
            "id":1079294,
            "title":"Double Trouble"
        },
        "1111121":{
            "author_id":"sdmmfxv",
            "author_name":"SpaceMedafigtherX",
            "choices":[
                "Eliza and Athena decide to help Olara'orsa.",
                "Eliza and Athena step back and let Olara masturbate."
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'm going to have to agree with you my pet,\" Elizabeth nodded as she brought her tail to Olara'orsa's leg and stung her, injecting her with her aphrodisiac venom and flooding her mind with lust.<br>\r\n<br>\r\nIn the haze of lust, Olara didn't even notice that Eliza and Athena had switched their order on the pecking chain, and instead simply fell to her knees, the water coming up to the bottom of her breasts, making it feel almost as though the lake was tickling at her.<br>\r\n<br>\r\n\"Do you like that feeling?\" Athena chuckled as she removed a single plume from her wings, and poked Olara with the quill, injecting her venom into the elf as well.<br>\r\n<br>\r\nOlara couldn't control herself any longer, and eagerly began to fondle her breasts, relishing the sensation of feeling them mold in her hands.</span></div></div>",
            "created":1301891640,
            "id":1081647,
            "title":"A Couple of Stings"
        },
        "11111211":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "The goddesses proceed with their \"fun\"",
                "Olara somehow interjects"
            ],
            "content":"<div class=\"\"><div> <span>\"Goodness, look at her go,\" Eliza chuckled.<br>\r\n<br>\r\n\"It's always wonderful to see them finally realize their true selves, isn't it, my dear pet?\" Athena asked her lover.<br>\r\n<br>\r\n\"Indeed,\" the demoness confirmed. \"What do you say we help her out a bit further?\"<br>\r\n<br>\r\n\"Oh, you always know exactly how to have fun, my goddess,\" Athena smiled as the two of them began to advance on the elf woman.<br>\r\n<br>\r\nOlara, still lost in lust, was completely oblivious to the two goddesses as they quickly approached her form in the lake.<br>\r\n<br>\r\n\"Now there, Olara, keep doing what you're doing...\" Eliza began.<br>\r\n<br>\r\n\"...and just let us take care of the rest,\" Athena giggled as the succubi began their work. </span></div></div>",
            "created":1301892480,
            "id":1081656,
            "title":"Four Helping Hands"
        },
        "111112111":{
            "author_id":"sdmmfxv",
            "author_name":"SpaceMedafigtherX",
            "choices":[
                "The group begins to grow right then and there.",
                "Olara'orsa has someone she wants to bring along first."
            ],
            "content":"<div class=\"\"><div> <span>Olara simply nodded contentedly as she felt Eliza's lips grace her own, eagerly taking in her new elder sister's tongue as the two of them began to exchange a dance in which their tastes and saliva intertwined, mingling and mixing as one. Meanwhile, Athena took the feather she plucked from herself earlier, turning it around and circling Olara'orsa's slit with it.<br>\r\n<br>\r\n\"Don't fight it Olara... You're our sister, and we only want to help you...\" Eliza whispered into the elf's ear.<br>\r\n<br>\r\n\"Accept us... Become more than you ever imagined that you could be,\" Athena whispered into her other ear.<br>\r\n<br>\r\n\"I'll do it... I'll become your sister,\" Olara nodded, gasping in pleasure.<br>\r\n<br>\r\n\"No, you won't <i>become</i> our sister,\" Elizabeth shook her head.<br>\r\n<br>\r\n\"You already are, you're simply just now realizing it,\" Athena explained.</span></div></div>",
            "created":1301895360,
            "id":1081667,
            "title":"Three-way"
        },
        "1111121111":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "Olara has someone in her village she wants as a pet.",
                "Olara decides none of the people in her village are worthy to survive."
            ],
            "content":"<div class=\"\"><div> <span>\"Yes, I've been your sister this entire time,\" Olara'orsa moaned in lust. \"P-Please...show me what I've been missing out on!\"<br>\r\n<br>\r\n\"My, eager, aren't we?\" Eliza chuckled. \"Well then, shall we give her a taste of her new self, my dearest Athena?\"<br>\r\n<br>\r\n\"A taste? We'll give her the main course!\" the angel woman agreed as she cast a quick spell, causing her feather to pleasure the elf woman without her manual movement of it. Floating over to her lover, Athena quickly embraced Elizabeth in a passionate kiss before continuing, \"And now, Olara, prepare to ascend...just like you have always meant to...\"<br>\r\n<br>\r\nOlara'orsa soon found a different sensation flowing throughout her body, a wave of pleasure similiar to the succubi's venoms yet carrying with it a strong sense that she was overflowing with limitless amounts of power. Almost instantaneously, Olara could see the effects of this new wave of pleasure as her entire body began to enlarge, growing about three feet taller in the span of a few seconds.<br>\r\n<br>\r\n\"We don't want to grow you <i>too</i> fast now,\" Athena chided.<br>\r\n<br>\r\n\"Just get used to the sheer euphoria of growth first, and then we shall show you the true pleasures of becoming bigger,\" Eliza chuckled as she looked out towards the elf's nearby village. \"I can't wait until you wipe out your former home, all to gain the slightest amount of pleasure from it!\" </span></div></div>",
            "created":1302071100,
            "id":1082928,
            "title":"Olara's Ascension Progresses"
        },
        "11111211112":{
            "author_id":"sdmmfxv",
            "author_name":"SpaceMedafigtherX",
            "choices":[
                "Olara'orsa destroys her former family- she is an Ognas now.",
                "Olara'orsa tries to protect her old family, so Elizabeth and Athena punish her."
            ],
            "content":"<div class=\"\"><div> <span>\"Why wait?\" Olara'orsa asked with a wicked grin, looking back in the direction of her home, still growing, now at twenty feet tall, and growing a few inches every second, with Eliza and Athena easily keeping such a slow pace. By time they reached the village, Olara was forty feet tall, the small buildings only coming up to her waist at best. \"My... I never realized how small it all was... How... Insignificant it all seems.\"<br>\r\n<br>\r\n\"That's right Olara... The people are so tiny... But as long as we're this small, they still have use,\" Elizabeth chuckled, picking one of the villagers up in her hand, biting them in half and handing it to Athena, who swallowed the legs.<br>\r\n<br>\r\n\"Delicious as always Eliza... But I think our new sister might need something to fill her belly... After all, it's her first time growing,\" Athena said, picking up a bystander and burning them with a fire spell. \"Here you go Olara- fried elves make great appetizers.\"<br>\r\n<br>\r\nOlara hesitated for only a moment before closing her eyes and placing her former neighbor in her maw, swallowing them whole. When she opened her eyes, she let out a relieved sigh, \"That... That was actually pretty good! I think I'll have to chew the next one...\"<br>\r\n<br>\r\n\"That's my sister!\" Eliza smiled, giving Olara'orsa a quick peck on the cheek. \"You'll be a full-fledged IGSYG in no time!\"<br>\r\n<br>\r\nBut what Olara heard next shook her resolve... Her mother's voice called out to her: \"Olara... Please tell me that isn't you...\"</span></div></div>",
            "created":1314075480,
            "id":1173451,
            "title":"Wipe them out... All of them."
        },
        "111112111121":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "Elda'ra begs for mercy, and they end her life quickly.",
                "Elda'ra mocks them, and they decide to prolong her punishment."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh? Who's that Olara?\" Athena asked, knowing full well who called out to the elven giantess. <br>\r\n<br>\r\n\"Is that your 'mother', my sister?\" Eliza added. \"Well, well, this ought to be interesting. This shall be your final test: Do you choose to remain tied down to your mortal past, or shall you look towards your future, your destined future, as a goddess that shall become more than these pathetic vermin could ever imagine?\"<br>\r\n<br>\r\nOlara looked down at the slowly-shrinking woman before her, the woman who had given her life, who had raised her, who had brought her up to be the woman she was today before the succubi's interference. <br>\r\n<br>\r\n\"Olara, my precious daughter, answer me!\" her mother called out to her once again. \"Please tell me this isn't you! Do not tell me this is my Olara!\"<br>\r\n<br>\r\nOlara'orsa paused for a moment to gather her thoughts and to make her decision. After thinking over the situation, Olara realized that what was happening was not actually a test as Eliza had alluded to, but rather an inevitable outcome: No matter which option she chose, she would sever her ties to her life as a mortal and ascend into an IGSYG, becoming a permanent member of the Ognas family. With the decision already made for her, Olara smirked wickedly as she began to enact her plan.<br>\r\n<br>\r\n\"Yes, it is me,\" Olara replied to her mother, her voice steadily growing angrier. \"I'm going to destroy the entire village with my sisters, my true family, and after that, annihilate this entire pathetic planet! I shall become what I was always meant to become, to take the life that you have always held me back from! My ascension cannot be denied, and no one shall stand in my way!\" In an instant, Olara raised her right foot high into the air and swiftly dropped it down upon her mother, crushing her instantly beneath her sole. <br>\r\n<br>\r\n\"Well done, Olara Ognas,\" Eliza and Athena said in unison as they kissed their new sister.<br>\r\n<br>\r\n\"Thank you, my sisters,\" Olara smiled proudly as she returned their affection. \"Now that I am freed from that wretched woman's 'love', there is only one more who I must eliminate before I can truly ascend.\"<br>\r\n<br>\r\n\"Oh, and who is that?\" Eliza asked the growing woman, all three of them now about seventy feet in height and still climbing. <br>\r\n<br>\r\n\"My former elder sister, Elda'ra. That witch who pretended to be my mother always praised her; she was always better than me at everything: Hunting, fishing, cooking, repairing, literally everything. She was even considered to be a candidate for village chieftain when the next elections were to take place. Only when she is gone shall I finally be ready to take my place alongside of the two of you.\"<br>\r\n<br>\r\n\"Then what are we waiting for?\" Athena chuckled. \"Let's find her, Olara.\"</span></div></div>",
            "created":1314082560,
            "id":1173499,
            "title":"Olara'orsa Ognas"
        },
        "1111121111211":{
            "author_id":"sdmmfxv",
            "author_name":"SpaceMedafigtherX",
            "choices":[
                "The three of them continue to grow, and Olara begins to transform.",
                "The three of them continue to grow, but Olara stays in an elf-like form for now."
            ],
            "content":"<div class=\"\"><div> <span>It didn't take long for Olara to find her former family's house, which she carefully picked apart, tossing aside her former father without care, but wanting Elda'ra to see the look in her eyes, to know what was coming before the proverbial hammer fell.<br>\r\n<br>\r\nOlara lifted the mortal elf into her hands, and shouted: \"Elda, look into my eyes, I want you to see death's gaze before you get what's coming to you...\"<br>\r\n<br>\r\n\"O-Olara... Is that... Is that you?\" Elda'ra asked fearfully, unable to believe that her once little sister now held her in the palm of her hand with ease.<br>\r\n<br>\r\n\"Yes, it's me, you sniveling coward. What's the matter? No one here to save you this time? You always thought you were better then me, everyone did! But now look at us! I'm a goddess, and you're just a fly that's landed in my divine grasp!\" Olara'orsa laughed wickedly, reveling in the power she held over Elda'ra at this point.<br>\r\n<br>\r\n\"Please... Please don't hurt me...\" Elda'ra cried.<br>\r\n<br>\r\n\"Don't just beg, apologize! Apologize for always pushing me aside, for always treating me like I was second best, for always acting like you were superior to me somehow! Apologize for not worshiping me like the goddess I've always been!\"<br>\r\n<br>\r\n\"I must say, Olara is quite the natural at this,\" Athena chuckled happily.<br>\r\n<br>\r\n\"Did you really expect anything less form one handpicked by mother herself?\" Elizabeth smiled.<br>\r\n<br>\r\n\"I'm sorry Olara... I'm sorry for everything... You're right, I should have treated you better... Please... Just stop this... I'm begging you, don't make me watch as you destroy everything I know and love.\"<br>\r\n<br>\r\n\"Don't worry Elda... You won't have to watch a single moment more...\" Olara grinned wickedly as she crushed her former sister in her hand, then licked up and swallowed the corpse in a single gulp. \"That was wonderful... Thank you, sisters, for awakening me. I can't believe I've been missing out on this for so long!\"<br>\r\n<br>\r\n\"Don't thank us yet sis, the fun has only just begun... You haven't even seen your true form yet...\" Elizabeth smirked.</span></div></div>",
            "created":1314168660,
            "id":1174068,
            "title":"It Can All End in but the Blink of an Eye"
        },
        "11111211112112":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "The castle's defenses manage to stop Olara, until she becomes large enough...",
                "The castle's defenses stand no chance against Olara from the beginning."
            ],
            "content":"<div class=\"\"><div> <span>\"My...true form...?\" Olara'orsa asked with a hint of excitement present in her voice.<br>\r\n<br>\r\n\"But of course,\" Athena answered. \"You're beautiful as you are, dearest Olara, but you can be so much more...\"<br>\r\n<br>\r\n\"How can I unlock my true self, my sisters?\" <br>\r\n<br>\r\n\"Well, you need quite the impressive act of lust in order for that to occur, be it an amazing act of destruction or even expressing your true feelings towards Athena or myself,\" Eliza explained with a wicked grin. \"So, does anything come to mind?\"<br>\r\n<br>\r\nOlara'orsa thought for a moment before coming up with her reply. \"Indeed. The castle to the north is home to the king of this region, and it's known for its incredible defenses, rumored to even be impregnable. So, I will put those rumors to rest by storming the castle and killing its pathetic monarchy myself, and then, I shall celebrate by finally showing my gratitude towards both of you...\"<br>\r\n<br>\r\n\"Ooooh, not the most original idea, but I'll certainly take it,\" Athena laughed as she drew Elizabeth in for a kiss. \"How about you, my love?\"<br>\r\n<br>\r\n\"It sounds perfectly wonderful to me, my pet,\" the succubus chuckled as she returned the angel woman's affection. \"Well then, you have a castle to destroy and two of the most lustful goddesses ever created in your presence just waiting to be satisfied. Will you not progress with your plan?\"<br>\r\n<br>\r\n\"Yes, my sisters!\" Olara bowed before running off towards the castle to the north.</span></div></div>",
            "created":1314427320,
            "id":1175951,
            "title":"One Final Task"
        }
    },
    "info":{
        "author_id":"sdmmfxv",
        "author_name":"SpaceMedafigtherX",
        "brief_description":"An immeasurably large and powerful succubus decides her family needs some new members.",
        "created":1301467320,
        "description":"<td align=\"left\" class=\"norm\">This interactive is about Corona Ognas, a woman known as an Infinitely Growing Succubine Yuri Goddess or “IGSYG” for short- also sometimes referred to as an Infinitely Growing Monster-girl Yuri Goddess (IGMYG) due to the fact that many of them do not look like traditional succubi and take the forms of many different sorts of women. The vast majority of IGSYGs begin human, although Corona herself is an exception to this rule: Corona is known as a “Sangobus”, a succubus who has the facial features of Sango from Inuyasha since she is a “defective clone” of the original (For more information on this background, please see our IGSYG story, Dark Ascension: Reflection, Defection, and Ascension, at  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://awesomex18.deviantart.com/#/d38d4w9\" target=\"_blank\">http://awesomex18.deviantart.com/#/d38d4w9</a> and <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://awesomex18.deviantart.com/#/d392kre\" target=\"_blank\">http://awesomex18.deviantart.com/#/d392kre</a> ). While she does have the face and hair of the demon huntress, along with her bountiful posterior and beautiful body, her breasts are large F-cups in size and she possesses several standard succubine features: Large leathery wings that are about as long as she is tall, obsidian claws that protrude from her hands and feet, black irises with red pupils, a spaded tail stretching out from just above her butt three times her height in length, snaking around her legs, a pair of sharp ram's horns adorning her forehead, and finally a long serpentine tongue.<br>\r\n<br>\r\nCorona is the queen of all IGSYGs, immortal, unaging, and possessing immeasurable power, seemingly omnipotent to mortals. Over the countless aeons she has existed, she has given birth to an equally limitless amount of daughters, both through her original creation and by rebirthing those chosen mortals who she has deemed worthy enough to become her children. Her children, much like Corona herself, are lust goddesses with immeasurable power, cosntantly seeking to find new sisters to add to their family.<br>\r\n<br>\r\nCorona’s most favored daughter is Elizabeth, her firstborn and one of the few daughters that she actually mothered within her own womb. Elizabeth looks very much like a “typical” demoness, in stark contrast to her favorite lover and wife, Athena, who commonly takes the form of an angel (but never acts the part). Elizabeth and Athena both have powers which rival Corona’s, but have not quite surpassed her, although Corona has made it quite clear that they both will eventually do just that.<br>\r\n<br>\r\nThe main focus of this interactive will be upon Corona and other IGSYGs going to various worlds and inducting new daughters and pets into her family. This is done many ways, but they all boil down to seduction, temptation, and sometimes outright mind control. Some of her favorite methods include embedding a shard of her power into a piece of armor or jewelry and sending it to some world for a girl to find. Othertimes, she’ll have one of her daughters temporarily shrink down and directly seduce their target. Still other times she’ll be summoned by a lust-worshipping cult, where she’ll often grant one woman from among the cult the honor of being her daughter.<br>\r\n<br>\r\n<br>\r\nRules of the Interactive:<br>\r\n<br>\r\n1) The main themes of this story are yuri (F/F sex), growth, corruption, and transformation.<br>\r\n2) Themes which conflict with the above themes- such as shrink, redemption, or M/F and M/M sex- are not allowed. Additionally, excessive weight gain (if their belly starts to grow larger than the width of C-cup breasts), toilet play, bestiality (anthros are fine and encouraged), futanari, and necrophilia (this includes zombies and vampires) are not allowed.<br>\r\n3) Male characters are allowed, but they must be turned <b>fully</b> female by the succubi's magics before they can join in on anything fun.<br>\r\n4) Due to the nature of WDC's limited interactive branches, I realize that option chapters are inevitable. However, if you add an option chapter, you <b>must</b> make another chapter following it with actual content within 24 hours, or I will delete the option chapter(s) in question.<br>\r\n5) Chapters should be 2-7 paragraphs in length. Any shorter, and you're really not adding much. Any longer, and you can probably divide it into two chapters to allow for more branches.<br>\r\n6) No “cliffhanger” sentences at the end of your chapters. Finish your sentence- make the choices completely separate from the chapters.<br>\r\n7) Rewards of 50 to 100 giftpoints will be given out for good, well written chapters. This means you must use proper spelling and grammar, and pay attention to the previous chapters within the story, and keep the characters within their personalities (mind control and alteration not withstanding).<br>\r\n<br>\r\n<br>\r\nAnd for those of you curious, here are some pictures of Corona, Elizabeth, and Athena:<br>\r\n<br>\r\nCorona Ognas: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://fc01.deviantart.net/fs70/f/2011/052/6/9/succubus_queen_corona_ognas_by_reverse_will-d3a1rrp.jpg\" target=\"_blank\">http://fc01.deviantart.net/fs70/f/2011/052/6/9/succubus_queen_corona_ognas_by_re...</a><br>\r\nElizabeth and Athena Ognas: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://fc04.deviantart.net/fs71/f/2010/065/9/a/Request__Athena_and_Eliza_by_Inisen.jpg\" target=\"_blank\">http://fc04.deviantart.net/fs71/f/2010/065/9/a/Request__Athena_and_Eliza_by_Inis...</a></td>",
        "id":1763674,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1314427320,
        "modified":1314427320,
        "pretty_title":"Corona's Evergrowing Family"
    }
}