{
    "chapters":{
        "1":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Andrew",
                "Bradley",
                "Candice",
                "Daniel",
                "Erin"
            ],
            "content":"<div class=\"\"><div> <span>This story is about 5 college students: Andrew, Bradley, Candice, Daniel and Erin<br>\r\n<br>\r\nAndrew is confident and outgoing. He likes Candice but she has turned him down on numerous occasions, saying she just want to be friends. He has heard the rumors about this house and hopes to use it to get Candice.<br>\r\n<br>\r\nBradley is Andrew's friend. He is gay and has a bit of a crush on Andrew. However, he'd never admit any of this to anyone.<br>\r\n<br>\r\nCandice is an attractive woman, she doesn't dislike Andrew but keeps turning him down because the one she really wants is Bradley.<br>\r\n<br>\r\nDaniel is rather quiet. He likes Erin but is too shy to ask her out. He doesn't know why the others keep inviting him to hang out.<br>\r\n<br>\r\nErin is Candice's slightly nerdy friend. She is not unattractive but generally wears unflattering clothes. She is interested in Daniel. She is the one who asked Candice to get Andrew and Bradley to invite him to hang out with the group.<br>\r\n<br>\r\nEach of them also has their own sexual fetish which the house may provide the opportunity to explore:<br>\r\n<br>\r\nAndrew: Watching two girls make-out<br>\r\n<br>\r\nBradley: Spanking, being spanked and watching others getting spanked<br>\r\n<br>\r\nCandice: Keeping other people (male or female) in diapers<br>\r\n<br>\r\nDaniel: Being tied up and dominated<br>\r\n<br>\r\nErin: Boys dressing up like girls<br>\r\n<br>\r\nWhose perspective will you experience this story from:</span></div></div>",
            "created":1380862800,
            "id":1674327,
            "title":"Meet the gang"
        },
        "11":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "You",
                "Bradley",
                "Candice",
                "Daniel",
                "Erin"
            ],
            "content":"<div class=\"\"><div> <span>\"You want to break into someone's house?\" Erin asks.<br>\r\n<br>\r\n\"It's nobody's house.\" you say. \"It's been abandoned for years. The doors aren't even locked.\"<br>\r\n<br>\r\n\"But why?\" Candice asks.<br>\r\n<br>\r\n\"I just think it will be a cool place to hang out.\" you say. You don't want to admit the real reason. You've heard rumors that the house has magical properties and you plan to use it to get Candice.<br>\r\n<br>\r\n\"I think it's a Good idea.\" Bradley agrees. He usually does.<br>\r\n<br>\r\n\"Okay.\" Candice seems to have a change of heart. \"We can have a look anyway. If Erin comes.\" then after a thought. \"Oh and of course Daniel.\"<br>\r\n<br>\r\n\"Fine.\" Erin agrees.<br>\r\n<br>\r\n\"Yeah.\" Daniel says. \"I'll come.\"<br>\r\n<br>\r\n\"Cool.\" you say, leading the way.<br>\r\n<br>\r\nIts a large two-story house. As you promised, the front door is unlocked. Inside you find the house fully furnished and very clean.<br>\r\n<br>\r\nAfter allowing the others a brief look around, you begin the next phase of your plan. \"Let's play truth or dare.\" you suggest.<br>\r\n<br>\r\n\"What?\" Candice asks. \"Are we 13 years old now?\"<br>\r\n<br>\r\n\"Come on.\" you say. \"It will be fun.\"<br>\r\n<br>\r\n\"Fine.\" Candice says. \"Who goes first?\"</span></div></div>",
            "created":1381037160,
            "id":1674931,
            "title":"Andrew"
        },
        "111":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Candice",
                "Erin",
                "Bradley"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"It was my idea.\" you say, eager to find out if the rumors are true. \"I'll go first.\"<br>\r\n<br>\r\n\"So who are you going to ask?\" Bradley asks.</span></div></span></div>",
            "created":1381037280,
            "id":1674932,
            "title":"You"
        },
        "1111":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Dare her to kiss you",
                "Dare her to strip naked",
                "Dare her to have sex with you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Candice.\" you say. \"Truth or dare?\"<br>\r\n<br>\r\n\"Dare.\" she says.</span></div></span></div>",
            "created":1381539540,
            "id":1677708,
            "title":"Candice"
        },
        "1112":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Ask if she is bisexual",
                "Ask if she is attracted to Candice",
                "Ask if she is turned on right now"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Erin.\" you decide, to see if the house really works before trying it on Candice. \"Truth or dare?\"<br>\r\n<br>\r\n\"Um.\" she says. \"Truth.\"</span></div></span></div>",
            "created":1381542240,
            "id":1677733,
            "title":"Erin"
        },
        "1113":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Dare him to wet himself",
                "Dare him to mess himself",
                "Dare him to masturbate in front of everyone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You.\" you decide, to see if the house really works before trying it on Candice. \"Truth or dare?\"<br>\r\n<br>\r\n\"Okay\" He says. \"Dare.\"</span></div></span></div>",
            "created":1381543200,
            "id":1677741,
            "title":"Bradley"
        },
        "11131":{
            "choices":[
                "Erin",
                "Candice"
            ],
            "content":"<div class=\"\"><div> <span>\"I dare you to pee yourself.\" you say trying to sound casual and nonchalant about the whole thing.<br>\r\nBradley laughs but before he can tell you to \"fuck off\" a large wet patch appears on his jeans and the ground beneath him starts to grow wet. Everyone is looking down with interest, including Bradley though you can't help but notice that Candice is looking a little different. Her mouth is open and she seems to be struggling to catch he breath at the sight. Also is it your imagination or is she rubbing herself slightly.<br>\r\n\"Well uh there you go, I did your stupid dare.\" said Bradley trying to sound like he meant to do that.<br>\r\n<br>\r\nNext is..........</span></div></div>",
            "created":1448117400,
            "id":2064959,
            "title":"Dare him to wet himself"
        },
        "111311":{
            "choices":[
                "Andrew\"",
                "Candice\""
            ],
            "content":"<div class=\"\"><div> <span>You're kicking yourself for wasting your first turn on that when it seems you could have jumped right to the good stuff as the house does seem to work as you had heard. But you didn't want everyone to start freaking out or anything so you had to play it cool and let the turns follow around the circle and simply wait for it come back to you.<br>\r\nNext to you was the timid mousy, looking Erin who is thinking over her go.<br>\r\n\"Come on Erin we don't have all night.\" you say a little impatient.<br>\r\n\"Okay, uh........\" who does she choose</span></div></div>",
            "created":1448117580,
            "id":2064960,
            "title":"Erin"
        },
        "1113112":{
            "choices":[
                "\"Truth..........",
                "Or Dare?\""
            ],
            "content":"<div class=\"\"><div> <span>Erin looking over at Daniel, picturing him in a little schoolgirl uniform. She had had that image in her head since she had heard what they were planning to do. Of course she couldn't say that out loud. She liked Daniel and was mortified about how he might react. They would all laugh or worse. Her eyes met Daniel's briefly before she looked over to her friend Candice and instantly said her name.<br>\r\n\"Yeah?\" asked Candice.</span></div></div>",
            "created":1448117760,
            "id":2064962,
            "title":"Candice\""
        },
        "11131122":{
            "choices":[
                "Daniel",
                "Bradley"
            ],
            "content":"<div class=\"\"><div> <span>\"Truth or Dare.\" Erin asked quickly, trying to sound confident and not like she had been spacing out.<br>\r\n\"Dare\" said Candice eyeing up the mousy girl trying to imagine the worst she could come up with.<br>\r\n\"I dare you to swap underpants with Bradley.\"<br>\r\nThere was a pause before both looked at each other got up and walked out of the room without saying a word as though struggling to think of what to say.<br>\r\nThey returned a few minutes later both walking a little funny and before they sat down you spoke,<br>\r\n\"Well at least let us see, you could have just stood out there doing nothing.\" you say. You didn't particularly want to see Bradley in women's underwear and your fantasy certainly hadn't had Candice in wet boxer shorts but you needed to know the house was working.<br>\r\nThey both blushed and lowered the hem of their pants a little so everyone could see that they had indeed swapped.<br>\r\nNext up was</span></div></div>",
            "created":1448118060,
            "id":2064964,
            "title":"Or Dare?\""
        },
        "112":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Choose truth",
                "Choose dare",
                "Take Bradley aside and tell him about the house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Bradley can go first.\" you say.<br>\r\n<br>\r\n\"Okay then.\" Bradley says. \"Andrew Truth or Dare?\"</span></div></span></div>",
            "created":1381543440,
            "id":1677742,
            "title":"Bradley"
        },
        "1121":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "content":"<div class=\"\"><div> <span>\"Truth.\" you say.<br>\r\n<br>\r\n\"Are you gay?\" he asks.<br>\r\n<br>\r\n\"What?\" you start to argue and try to say no but find yourself answering \"Yes.\"<br>\r\n<br>\r\nYou've confirmed the at the magic works but you'e no longer interested in Candice. However, you find yourself noticing what a great body Bradley has.</span></div></div>",
            "created":1381544760,
            "id":1677750,
            "title":"Choose truth"
        },
        "1122":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Choose Candice",
                "Choose Daniel",
                "Choose Erin"
            ],
            "content":"<div class=\"\"><div> <span>\"Dare.\" you decide.<br>\r\n<br>\r\nThe thinks for a moment then says. \"I dare you to strip completely naked, throw your clothes into one of the rooms and leave them there for the rest of the game.\"<br>\r\n<br>\r\nYou find your the urge uncontrollable and begin removing your clothes. The others watch, laughing. Once you are completely naked, you bundle up your clothes and throw them into the nearest room.<br>\r\n<br>\r\nYou return to the others with your hands over your privates. At least you've confirmed the house works.<br>\r\n<br>\r\n\"My turn.\" you say.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1381545480,
            "id":1677753,
            "title":"Choose dare"
        },
        "113":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Tell him to choose Erin",
                "Tell him to choose Bradley",
                "Volunteer yourself"
            ],
            "content":"<div class=\"\"><div> <span>\"You can go first.\" you tel her.<br>\r\n<br>\r\n\"Okay\" she says. \"Daniel. Truth or dare?\"<br>\r\n<br>\r\n\"Um.\" he says, looking around uncomfortably. \"Truth.\"<br>\r\n<br>\r\n\"Do you like Erin?\" she asks.<br>\r\n<br>\r\nHe blushes deeply and even tries to deny it for a moment before answering \"Yes.\"<br>\r\n<br>\r\nThat's still not proof that the house is magic. Maybe Daniel already did like Erin. Hopefully the next turn gives more definitive answers.<br>\r\n<br>\r\n\"Your turn.\" Candice tells Daniel.<br>\r\n<br>\r\nDaniel looks at the rest of you, clearly not confident choosing someone.<br>\r\n<br>\r\n </span></div></div>",
            "created":1381544040,
            "id":1677745,
            "title":"Candice"
        },
        "114":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Tell him to ask Bradley",
                "Tell him to ask Candice",
                "Tell him to ask Erin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Daniel.\" you say, he's too shy to ask anything really outlandish.<br>\r\n<br>\r\n\"Um.\" he says looking at each of the rest of you uncertainly, clearly unable to decide who to ask.</span></div></span></div>",
            "created":1381544160,
            "id":1677746,
            "title":"Daniel"
        },
        "115":{
            "author_id":"immaturity",
            "author_name":"Immaturity",
            "choices":[
                "Tell her to choose Bradley",
                "Tell her to choose Candice",
                "Tell her to choose Daniel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Erin.\" you say. She's too shy to ask anything really outlandish.<br>\r\n<br>\r\n\"Um.\" she says, looking at each of the rest of you uncertainly, clearly unable to decide who to ask.</span></div></span></div>",
            "created":1381544460,
            "id":1677748,
            "title":"Erin"
        }
    },
    "info":{
        "author_id":"immaturity",
        "author_name":"Immaturity",
        "brief_description":"A cursed house makes a game of truth or dare much more intense.",
        "created":1380720240,
        "description":"<td align=\"left\" class=\"norm\">A group of college students sneak into an abandoned house and decide to play truth or dare.<br>\r\n<br>\r\nHowever this room has a curse. <br>\r\n<br>\r\nWhenever someone chooses \"dare\" they are compelled to carry out whatever they are dared, no matter how much they don't want to.<br>\r\n<br>\r\nWhen someone chooses \"truth\" then whatever they are asked becomes the truth.<br>\r\n<br>\r\nThe characters:<br>\r\n<br>\r\nAndrew is confident and outgoing. He likes Candice but she has turned him down on numerous occasions, saying she just want to be friends. He has heard the rumors about this house and hopes to use it to get Candice. His fetish is watching two girls make-out.<br>\r\n<br>\r\nBradley is Andrew's friend. He is gay and has a bit of a crush on Andrew. However, he'd never admit any of this to anyone. His fetish is spanking.<br>\r\n<br>\r\nCandice is an attractive woman, she doesn't dislike Andrew but keeps turning him down because the one she really wants is Bradley. Her fetish is other people wearing diapers.<br>\r\n<br>\r\nDaniel is rather quiet. He likes Erin but is too shy to ask her out. He doesn't know why the others keep inviting him to hang out. His fetish is bondage and domination<br>\r\n<br>\r\nErin is Candice's slightly nerdy friend. She is not unattractive but generally wears unflattering clothes. She is interested in Daniel. She is the one who asked Candice to get Andrew and Bradley to invite him to hang out with the group. Her fetish is boys cross-dressing.</td>",
        "id":1955724,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1501087800,
        "modified":1501087800,
        "pretty_title":"Truth or Dare"
    }
}