{
    "chapters":{
        "1":{
            "author_id":"storeviewer",
            "author_name":"Writinguy",
            "choices":[
                "3 inches",
                "1 inch",
                "1/2 an inch",
                "1/4 of an inch",
                "1/8 of an inch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>since this is an interactive to what extent are you shrunk</span></div></span></div>",
            "created":1086670800,
            "id":202294,
            "title":"height?"
        },
        "11":{
            "choices":[
                "go into micheal shanks room",
                "go into ashton kutchers room",
                "continue down the hall"
            ],
            "content":"<div class=\"\"><div> <span>you look around and find yourself near the right rear wheel of a maids cart, you wonder how big you are so you go up to the wheel and measure yourself against it, you know for a fact that the wheels are 3 inches in diameter and you are just as big as it, so you must be 3 inches tall, you hear the maid coming so you run and hide under a potted plant. The maid does not see you and walks away. You look around and notice that you are also near 2 doors, one is marked M. Shanks, and the other is a.kutcher. You guess that M . Shanks is Michael Shanks, the actor from star gate sg-1, and that a.kutcher is Ashton kutcher, from the punked series, you decide to...</span></div></div>",
            "created":1280289540,
            "id":925597,
            "title":"3 inches"
        },
        "111":{
            "choices":[
                "his bed.",
                "the bathroom.",
                "on top of a pile of his cloths."
            ],
            "content":"<div class=\"\"><div> <span>you decide to go into micheal shanks room, you have always had a slight crush on him and figure that this would be a good time to meet him. you walk up to his door which to you is like walking a 200 yard dash, and army crawl under it. you are amazed at how big everything in the room seems, you realize he isnt in his room you decide that the best place to wait for him would be...</span></div></div>",
            "created":1280289900,
            "id":925601,
            "title":"go into micheal shanks room"
        },
        "1112":{
            "choices":[
                "His foot",
                "His condom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you walk in you are horrified to see that Michael Shanks is about to have a jacking off session, he walks over to where you are, and something falls on you<br>\r\nWhat is it</span></div></span></div>",
            "created":1370347200,
            "id":1603899,
            "title":"the bathroom."
        },
        "1113":{
            "choices":[
                "his massive underwear",
                "his gigantic jockstrap",
                "his socks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you figure that micheal will need to put clean cloths on sometime, so you scramble to the top of the pile, the top of which turns out to be...</span></div></span></div>",
            "created":1280290320,
            "id":925602,
            "title":"on top of a pile of his cloths."
        },
        "11132":{
            "choices":[
                "you get cought in micheals foreskin.",
                "you get trapped under his balls"
            ],
            "content":"<div class=\"\"><div> <span>you get to the top of the pile and cant tell what you are on because you are so close to it, but you can smell a faint trace of lavender, this makes you sleepy and you soon fall asleep in the puch of his jockstrap. you are suddenly awakened whenyou feel movement, you realize that micheal is putting his jockstrap on.you see his massive four foot long [to you] testies and his 70 foot long dick racing towords you. you scream for him to stop but at your size he cant even hear you.</span></div></div>",
            "created":1280291520,
            "id":925608,
            "title":"his gigantic jockstrap"
        },
        "111321":{
            "choices":[
                "a strip club for his brothers bachelore party.",
                "his acting job."
            ],
            "content":"<div class=\"\"><div> <span>as micheals massive manhood races towards you you kick out to try and get his attention, but all this accomplishes is that your legs go in before the rest of you, your feet even going into his dickslit stightly. you feel yourself get crammed into the giant space behind his foreskin with only your head sticking out allowing you to breath. you then hear from above you micheal say in his deep, sexy voice. what the fuck? as he feels you body slide into his foreskin. he decides that there must have been a wrinkle in the fabric so he adjusts himself by reaching down and grabing th fabric and pulling backat this you move slightly outand he thinks that he thought was the wrinkle in the fabric so he stops adjusting and put on his pants. then socks then shoes you feel him start walking out the door where is he going? </span></div></div>",
            "created":1280292840,
            "id":925621,
            "title":"you get caught in micheals foreskin."
        },
        "1113211":{
            "choices":[
                "bathroom",
                "backrooms"
            ],
            "content":"<div class=\"\"><div> <span>unluckily for you he is heading out to a strip club for his brothers bachelore party. at the strip club you felt your already tight confines begin to get harder as he begins to get a hard on. your legs are forced into his dick slit, micheal his attention focused so much on the strippers he didnt even notce as you were slowly forced deeper and deeper into his cock as his hard on progressed, wventually your head was pulled into his now pre-cum dripping penis, you thought you were going to drown in his pre cum which was not your preffered way to die even if you did have a crush on the guy. as your head was pulled into his dick you realized that you didnt even seem to need any air you realied that at your size you probably used extremely little oxygen and would probably live for a while. suddenly you were jared from your thoughts by micheal getting up,he was heading for the...</span></div></div>",
            "created":1280293800,
            "id":925629,
            "title":"a strip club for his brothers bachelore party."
        },
        "11132111":{
            "content":"<div class=\"\"><div> <span>as micheal gets up and heads torward the bathroom jostling you around in the process, he tells his brother hell be right back then he heads to the bathroom, once he gets there he goes to a stall gets in and jlocks the door then puts the seat down and pull down his pants pulling out his fully erect 18 inch cock, he then grabs the top immediatly and pushes down, forcing you down, deeper into his dick. until you are at the base, at which pint he starts back up his monster cock moaning in pleasure the whole time. then around 20 minutes later you suddenly feel him slow down and the walls around you start to pulsate each onepushing you further and further into his body, until finally you get pushed into a testical, suddenly hi comes forcing all the cum out of the testicle but leaving you in the testie where oddly enough you form an umbilical cord to his body where you are now forever going to be.</span></div></div>",
            "created":1280295240,
            "id":925639,
            "title":"bathroom"
        },
        "113":{
            "choices":[
                "enter",
                "continue down the hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see a door marked B.Cooper. </span></div></span></div>",
            "created":1325374920,
            "id":1250206,
            "title":"bradley cooper's room"
        },
        "1131":{
            "choices":[
                "Bradley decides to eat you",
                "Bradley sticks you in the back of his pants"
            ],
            "content":"<div class=\"\"><div> <span>The door is slightly ajar so you enter. Sure enough, there was Bradley Cooper; looking like a greek deity at his size. You decide that contacting the giant was a bad idea so turn around back towards the door but suddenly, a deafening voice spoke. \"What the hell is that? A bug? These conditions are disgusting. Wait a minute- is that a <i>person</i>?\" Before you had time to react, Bradley reached out his hand and plucked you between two of his gargantuan fingers and lifted you through the sky up to his face. \"Woah, it is a person. What are you doing in my room little guy? Come to gawk at me? Don't blame you: I am pretty amazing. Take a look at my ass.\" He then moves you to his backside and wiggles it in your face and then lifts you back to his face; his pungent breath surrounding you. \"Anyway, where were we? What should I do with you...?\"</span></div></div>",
            "created":1325377860,
            "id":1250221,
            "title":"enter"
        },
        "11311":{
            "choices":[
                "You are spat out. Bradley's not happy",
                "You're just making him hungrier"
            ],
            "content":"<div class=\"\"><div> <span>The giant lifts you so you are at level with his nose and begins to look at your tiny form and speak \"Hmmmm since I have no use for you, I guess I'll just eat you.\" The giant declares whilst stroking his washboard abs. You are completely bewildered.<br>\r\n\"WHAT?! I am a human being; not some snack for you!\" You burst out.<br>\r\n\"Oh I think you are. I was hungry and BAM you arrive in my room on all ready to be devoured.\" The giant licks his lips as he brings you to his nose and sniffs you. \"Oh yeah, you smell great little dude. Sorry in advance for digesting you and...you know...the bit after that...!\" He laughs heartily and shivers are sent up your spine. \"Anyway, let's get down to business.\" Still whilst being pinched between two massive fingers you are dangled high above the goliath's face. \"See ya on the other side, runt.\" Without warning you are sent plummeting into what will be your tomb. You land on the dripping tongue and almost immediately after it wraps around you. It moves you around the behemoth's mouth whilst he savors your flavor. You realize that you will not be released from your prison so have to take matters into your own hands. You bite the colossal tongue and the giant yelps in pain...</span></div></div>",
            "created":1325382240,
            "id":1250234,
            "title":"Bradley decides to eat you"
        },
        "113112":{
            "content":"<div class=\"\"><div> <span>\"That was a bad mistake you piece of crap. I'm gonna enjoy absorbing you and turning you into my shit.\" You are moved towards the throat of the titan and you admit that there is no hope. You are swallowed and whilst waiting to be digested in the stomach Bradley speaks to you whilst lying on the couch and stroking his abs. \"That was a good meal. I can't wait to sit back and watch you become part of me. Just think: you might even become part of my ass. Now <i>that'd</i> an honor, little dude. I'll be here on the couch the whole time. Cya!\" The next morning Bradley expels your remains and continues his life.</span></div></div>",
            "created":1325421420,
            "id":1250463,
            "title":"You're just making him hungrier"
        },
        "14":{
            "author_id":"storeviewer",
            "author_name":"Writinguy",
            "choices":[
                "walk under either of the 2 closest doors. A. Kutcher  T. Welling",
                "continue down hall (not done yet)",
                "continue down hall (not done yet)",
                "continue down hall (not done yet)",
                "continue down hall (not done yet)"
            ],
            "content":"<div class=\"\"><div> <span>Just a typical day at the leisure center.<br>\r\nYou have heard about a stunt the staff are trying to pull by getting stars to come to make money.<br>\r\nWhatever.<br>\r\nYou walk down the hall after just entering but as you do with each step you take the hall gets bigger and you begin to run causing the shrink process to increase and when you stop you find yourself in an area of suites where the stars will be staying.<br>\r\nYou measure yourself against objects and find yourself to be 1/4 of an inch.</span></div></div>",
            "created":1086670800,
            "id":202295,
            "title":"star suite 1/4"
        },
        "15":{
            "author_id":"storeviewer",
            "author_name":"Writinguy",
            "choices":[
                "go under the closest doors",
                "go back to the reception",
                "proceed down the hall",
                "proceed down the hall",
                "proceed down the hall"
            ],
            "content":"<div class=\"\"><div> <span>Just a typical day at the leisure center.<br>\r\nYou have heard about a stunt the staff are trying to pull by getting stars to come to make money.<br>\r\nWhatever.<br>\r\nYou walk down the hall after just entering but as you do with each step you take the hall gets bigger and you begin to run causing the shrink process to increase then you trip and fall spewed on the ground. You look up and find yourself in an area of suites where the stars will be staying.<br>\r\nYou measure yourself against objects and find yourself to be 1/8 of an inch. <br>\r\n<br>\r\nthe closest doors are marked with golden name plates one saying Ahston Kutcher and another Tom Welling<br>\r\n<br>\r\nThe others you cannot see</span></div></div>",
            "created":1086757200,
            "id":204001,
            "title":"1/8 of an inch"
        },
        "151":{
            "author_id":"storeviewer",
            "author_name":"Writinguy",
            "choices":[
                "ashton",
                "tom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>under ashton kutchers door or tom wellings?</span></div></span></div>",
            "created":1086757200,
            "id":202404,
            "title":"closest doors"
        },
        "1511":{
            "author_id":"storeviewer",
            "author_name":"Writinguy",
            "choices":[
                "head into his boxers",
                "climb his crotch and set course for an eye or ear"
            ],
            "content":"<div class=\"\"><div> <span>You walk under the door with no need to duck as you are now so small.<br>\r\nThen it hits you: if you even met and ant at this size it would be able to rip you limb from limb so now is the time to be careful. You turn and see a pair of sandles and they are at least 36 feet high just to the sole.<br>\r\nYou can see ahead is the bedroom and to the left is the bathroom.<br>\r\nYou decide the bedroom as you are more hidden so after a certain amount of time you reach the bed a few thousand feet high but the covers and sheets reach the ground and woven just right so you can really just almost climb like a stairway you reach the top and walk around on the flat plain when the door opens and Ashton walks in.<br>\r\nHe locks the door and strips to his boxers and colapses on the bed.<br>\r\nYou close your eyes as you see him decending down on you but thankfully he misses you.<br>\r\nYou open to find yourself at the crotch area of his boxers you cant tell the brand from where you are though.<br>\r\ndo you...</span></div></div>",
            "created":1086757200,
            "id":205425,
            "title":"ashton at 3300 feet"
        },
        "15111":{
            "author_name":"Notebooker",
            "choices":[
                "Climb his cock",
                "Wait and contemplate your actions"
            ],
            "content":"<div class=\"\"><div> <span>You climb up into his boxers.<br>\r\n<br>\r\nHe turns over in bed and you squeal as the massive cock comes crashing down, it misses you by a fraction of an inch.<br>\r\n<br>\r\nYou don't know what to do next. You want to get his attention but arent sure how.<br>\r\n<br>\r\nDo you...</span></div></div>",
            "created":1087880400,
            "id":204273,
            "title":"In the boxers"
        },
        "15112":{
            "author_name":"Marty",
            "choices":[
                "Shout into Ashton's ear for help.",
                "Make your way to his bedside desk."
            ],
            "content":"<div class=\"\"><div> <span>As you begin your climb up Ashton's huge crotch, he begins to move and turn over. You scream as you are thrown to the side of the bed and look up to see ashton's gigantic hand moving toward you.<br>\r\nHas he seen you?<br>\r\nNo, as you look to your right, you see he is reaching for his phone. <br>\r\nAs he is distracted you begin once again to climb up to his ear by moving along the bed until you are on top of the pillow. <br>\r\n'Should I get his attention or not?' you think to yourself.<br>\r\n</span></div></div>",
            "created":1087621200,
            "id":203901,
            "title":"Ear Ear"
        },
        "151121":{
            "author_name":"Marty",
            "choices":[
                "Try and climb your way to the top of the Basket.",
                "Try and find a little gap to escape through."
            ],
            "content":"<div class=\"\"><div> <span>You decide it's better to get his attention, since, what's the worst he could do?<br>\r\nAs you peer inside his cavern-like ear, you take a deep breath and and scream as loud as you can into the giants ear<br>\r\n\"ASHTON!!!!!!!!\"<br>\r\nYou're thrown back as Ashton jumps of his bed and sticks a huge finger in his ear, while cursing out loud. It looks like you might have got his attention, as he looks around on his bed.<br>\r\nYou frantically wave your arms in the air, hoping he will see you.<br>\r\n\"Damn it! What was that?\" <br>\r\nHis loud deep voice echos as he begins to move the pillow that is near you. You are once again thrown around as Ashton moves the pillow that you are stood on.<br>\r\nYou are thrown into his dirty laundry basket as he makes a move back on his bed and open his drawer to his bedside table. He lifts something out and begins to eat something.<br>\r\nMeanwhile you are trapped in Ashton's laundry basket, with heavy sheets and things on top of you. <br>\r\nNow what are you going to do?</span></div></div>",
            "created":1087794000,
            "id":204055,
            "title":"Maybe this wasn't such a good idea......?"
        },
        "1511212":{
            "author_name":"Marty",
            "choices":[
                "Walk towards what look likes a Resturant Area.",
                "Walk towards what looks like a Gym Area."
            ],
            "content":"<div class=\"\"><div> <span>As you look frantically around, you see a tiny gap in the basket. It looks like it leads to the laundry chute.<br>\r\nThe heavy sheets and pillows are starting to really hurt your tiny body. You're really going to have to make a move as if you stay in here much longer, you're going to run out of air.<br>\r\nYou stretch over to the gap in the basket and try to pull your self forward. The musty smell of dirty laundry reeks as you manage to reach the gap and lean over the side.<br>\r\nThe long drop below looks like a never ending fall as you peer long and hard at the metal tube below you.<br>\r\nYou take a deep breath and throw yourself forward. <br>\r\nYour eyes closed tight, as you fall down all the way down the laundry chute and land at the bottom in a pile of washing at the bottom.<br>\r\nYou take a look around and notice that you are in some kind of kitchen area. <br>\r\nStill shaken from your fall, you stand up and begin to climb down out of the washing pile.<br>\r\nThe strong smell of food is in the air as you walk a little further ahead. <br>\r\nLooks like there's two ways to go here.</span></div></div>",
            "created":1087794000,
            "id":204092,
            "title":"Down the Chute."
        },
        "151122":{
            "author_name":"Marty",
            "choices":[
                "Jump down and feast on one of the sweets.",
                "Head back to Ashton."
            ],
            "content":"<div class=\"\"><div> <span>You decide not to get Ashton's attention as he may mistake you for a tiny bug and squash you.<br>\r\nYou make your way to the bedside cabinet and notice that the drawer is slightly open.<br>\r\nAs you peer inside you can see what it contains within.<br>\r\nThere's a huge packet of chewy sweets and a stack of magazines.<br>\r\nYour stomach rumbles as you haven't eaten all day.<br>\r\nMore than likely a quarter of one of the sweets would easily be a feast for your tiny self.<br>\r\nYou glance back to the huge giant and back to the drawer.</span></div></div>",
            "created":1087707600,
            "id":203969,
            "title":"A Sweet Tooth?"
        },
        "1511221":{
            "author_name":"Marty",
            "choices":[
                "Scream for help.",
                "Try to climb out of the packet."
            ],
            "content":"<div class=\"\"><div> <span>You take a chance and leap down into the drawer. You land with a thump on the packet and fall back. <br>\r\nAs you stay still you hear Ashton's deep loud voice.<br>\r\n\"Hang on a sec\" You hear him moving and a huge shadow casts over you. Its Ashton. <br>\r\nIn a panic moment, you dive into the packet and hide until you know its safe.<br>\r\nYou can see from the outside of the packet a gigantic hand descending toward you. <br>\r\nYou start to panic as you feel yourself being thrown forward as Ashton picks up the packet and peers inside.<br>\r\nLucky for you, you're underneath a sweet which is concealing you.<br>\r\nYou look upward in fright as you see Ashton lick his lips as he brings his hand down to the packet. </span></div></div>",
            "created":1087707600,
            "id":203970,
            "title":"Ashton's Snack"
        },
        "15112211":{
            "author_name":"Marty",
            "choices":[
                "You continue screaming for help.",
                "Ashton's phone rings."
            ],
            "content":"<div class=\"\"><div> <span>You yell as loud as you can as Ashton's huge hand reaches in and knocks you to the side.<br>\r\nIt delves in and reaches the bottom of the packet as you are puled down with it.<br>\r\nFighting for breath, you try and climb upward to the surface of the packet but Ashton's hand pulls you down as he rummages for a handful.<br>\r\nSuddenly you find the side of your arm is stuck to the side of a sweet. As you try and break free, you get stuck to the sweet opposite.<br>\r\nNow you really begin to panic as you are sandwiched between two sweets and Ashton begins to pull his hand back up to the top. <br>\r\nYou are pulled upward and Ashton grasps the two sweets that you are stuck to. <br>\r\nYou feel yourself lifted upward to about 3000 feet high. <br>\r\nAs you look ahead, you see Ashton's huge jaws open wide to reveal his open mouth. You again scream once more in the hope that he will hear you. <br>\r\nYou decide close your eyes and pray for a miracle as you are brought closer to Ashton's large open mouth.  </span></div></div>",
            "created":1087707600,
            "id":203971,
            "title":"Sticky Sweet Sandwich"
        },
        "151122111":{
            "author_name":"flyboy",
            "choices":[
                "Jump to sheet and climb up bed",
                "Take shoe tie to ground to get out of there"
            ],
            "content":"<div class=\"\"><div> <span>when you begin to scream for help as your pulled to Ashton's teeth, it sounds as though it's a humming noise, such as a bee or dragonfly.  startled, Ashton drop the sweets your attached to and you fall in the waste basket along side his bed.  Thankfully, his trash has not been emptied and the water bottle leans against the side over the top of the can, which is easy to climb onto, when you reach the top of the waste basket you find that your a canyon off the ground and if you were to slip, you would surely end up mangle like a squashed fly under the swatter.  A loose sheet is hanging off the bed, but looks very slippery, there is also a shoe tie hanging above your head that you could pull down to reach the floor,   you look behind you and see that being squashed from falling is the least of your worries.  I spider is eying it's next meal bye staring straight at you.  You freeze for a minute trying to run by your head how you got into this situation in the first place, but all that is put aside when the spider walks a step forward clutching his jaws for his next meal.  Ashton walks by this instant and accidently hits the basket with his foot while sitting down on the bed.  Frightened, the spider slides down into the waste basket and jolted, you loose your balance and stumble on your back.  You don't want to wait for the spider to get brave again so you have a descision </span></div></div>",
            "created":1088053200,
            "id":204478,
            "title":"Prey"
        },
        "1511221111":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Your surroundings haven't changed",
                "Where are you?"
            ],
            "content":"<div class=\"\"><div> <span>Carefully, you climb up the sheets.  You make your way over to where Ashton is lying on the bed.  This is very tiring work, but you keep on going.  Hiking across the fluffy matress, you eventually make it to Ashton's huge form.  You climb his bare torso, which gently rises and falls with each of his breaths.  By the time you reach the top, you are exhausted.  You know you have to keep going.  His belly button is not that far away and would provide an adequete shelter for the night.  Snuggling into it, you drift off to sleep.</span></div></div>",
            "created":1162616400,
            "id":357090,
            "title":"Shelter"
        },
        "15112211111":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "You explore the trays",
                "You climb onto his bed"
            ],
            "content":"<div class=\"\"><div> <span>You awaken to a loud rumble.  Climbing out of the pit you're in, you examine your surroundings.  Ashton is still asleep, and you're standing atop his well-toned, growling stomach.  He's hungry!  Suddenly, Ashton begins to stir.  Without thinking, you jump back into his navel.<br>\r\n<br>\r\nThere is a knock at the door and he wakes up, groggily stretching.  You're carried with him as he walks over to answer the door.  On the other side, a butler hastily shoves a tray into Ashton's outstretched arms.  The tray contains several plates--breakfast.  Ashton shuts the door and sets the tray down on his bed.  You decide to jump onto the tray just as Ashton turns around to use the bathroom.  He hasn't seen you.  You're left on his tray and wonder what to do next.</span></div></div>",
            "created":1162767780,
            "id":357295,
            "title":"Breakfast"
        },
        "151122111111":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "Ashton sees you",
                "He doesn't"
            ],
            "content":"<div class=\"\"><div> <span>You make your way through the maze of plates, glancing up to observe each of the meals.  One plate contained what looked like raw oysters.  Another had eggs and bacon.  But, the last shocked you.  It was a plate full of people.  Although they were not chained in any way, all of them felt it was pointless to leave.  They'd be caught anyway.  Most of them were everyday, normal people who had been shrunken for hotels like this one.  Hotels that catered live humans to male actors.  It was a sad story.<br>\r\n<br>\r\nJust then, your conversations with these victims were interrupted when the bathroom door burst open.  Ashton was shirtless, dressed only in board shorts.  \"Boy am I huuuungry,\" he said as he rubbed his ravenous, bare belly.  Quickly, you ran off the plate onto the tray.  Shouts behind you said it was pointless to run.  But, you didn't listen and sprinted faster.  You just made it when Ashton picked up the tray and set it on your lap.  You turned around and were instantly transfixed by his huge frame.</span></div></div>",
            "created":1162768980,
            "id":357300,
            "title":"Discoveries"
        },
        "1511221111112":{
            "author_id":"windrider4000",
            "author_name":"Anonymous",
            "choices":[
                "The pool",
                "The tennis courts"
            ],
            "content":"<div class=\"\"><div> <span>You stop and gaze up at Ashton.  He doesn't see you and begins to eat.  The second plate you saw with the eggs and bacon quickly dissapear into his awaiting mouth.  Many other food contents including sushi, oysters, bagels, and such are gone in the same fashion.  You shiver.  How much can Ashton eat?  All the food is gone--except for the humans.  They are apparently saved for last.<br>\r\n<br>\r\nBringing the plate towards him, Ashton gets ready to feast.  His mouth waters in anticipation and deep resounding growls are emitted from his beautifully-toned abs.  Ashton picks up his first victim, an 8-year-old girl.  She screams as he places her in his mouth.  Slowly, he gulps her down and her shape moves down his throat.  He grins, rubbing his tummy.  Each of the humans follow until there are none left.  At the end, he let's out a disgusting, wet belch.  Quickly, you scramble into his belly-button, your only protection for now.  The dark cavern surrounds you and you can hear the screams and gurgles of your friends digesting.  You blink back tears and are carried on to your next destination.</span></div></div>",
            "created":1162769820,
            "id":357305,
            "title":"D-E-L-I-C-I-O-U-S"
        },
        "151122112":{
            "author_name":"Marty",
            "choices":[
                "Leap into Ashton's Backpack and see where he is going.",
                "Wait till Ashton has gone and leave his room under the door."
            ],
            "content":"<div class=\"\"><div> <span>As Ashton brings the sweets and you to his open mouth, you close your eyes and prepare for the inevitable.<br>\r\nSuddenley you hear ringing. When you open your eyes, you realize you're not moving anymore and Ashton's open mouth is no longer open. <br>\r\nYou feel yourself being lowered down and placed on the table as the giant walks over to his bed and picks up his ringing phone.<br>\r\n\"Hey! What's up?\"                              You manage to wiggle yourself from one of the sweets and pull the other (still attached to your side) to the side of Ashton's bedside lamp. There you manage to catch your breath and listen in on Ashton's conversation.<br>\r\n\"Oh yeah! We'll Punk him good!\" he laughs. \"Okay, see you guys later\" <br>\r\nYou watch as the huge giant star stands up and grabs his backpack from the side of his bed. He leaves it open as he turns and goes into the bathroom. <br>\r\nYou finally manage to pick the rest of the sweet off you and walk over to the edge of the table. You can see the inside of his backpack and hear Ashton's loud footsteps coming back.<br>\r\nThis may be your only chance of getting outside again.</span></div></div>",
            "created":1087707600,
            "id":203987,
            "title":"Close Call"
        },
        "1511221121":{
            "author_name":"Marty",
            "choices":[
                "You thought he said Justin Timberlake.",
                "You thought he said Matt Leblanc."
            ],
            "content":"<div class=\"\"><div> <span>It may take days, even weeks, to make it back outside, so you decide to chance it with Ashton's backpack.<br>\r\nBefore he comes back in the room, you see a piece of string hanging from his table to his pillow. You grab it and tie it to the lamp on his table. Quickly you lower yourself down to the edge of his backpack and drop in. <br>\r\nA huge bump awaits you as you hit the bottom of the backpack. Inside are lots of paper and some clothes that he must have worn earlier.<br>\r\nYou look up to see, a now fully clothed Ashton, zipping the backpack up and you are thrown into darkness. <br>\r\nViolently, you're thrown backward and forward as Ashton swings the backpack round his shoulders and leaves his room.<br>\r\n\"Okay, who's first?\" <br>\r\nYou hear him talking to himself but don't quite hear who he says next.</span></div></div>",
            "created":1087707600,
            "id":203998,
            "title":"Travelling Ashton Style"
        },
        "15112211211":{
            "author_name":"Marty",
            "choices":[
                "Head along the Counter to the Burger Grills.",
                "Try and find a way to the other side of the Counter where the Milkshakes are mad"
            ],
            "content":"<div class=\"\"><div> <span>You are positive he said 'Justin' so you take that into mind as Ashton continues walking and you are bouncing along with his backpack.<br>\r\nThen something in you're mind clicks!<br>\r\nDid Ashton before say something about \"Punk'd\"?<br>\r\nYou bet that he's going to Justin to \"Punk\" him for his television show.<br>\r\nYou cant believe that you're about to come face to face, (well face to feet), with one of the most successful pop artists of the past few years!<br>\r\nAs you sit there, bumping along while Ashton must be walking, you begin to see a beam of light coming through the top of the backpack.<br>\r\nNow you can hear, what sounds like busy traffic, and people talking. <br>\r\nYour curiosity has got the better of you as you decide to climb up and take a peek.<br>\r\nStanding on Ashton's magazines, you take a look through the tiny gap of the backpack. <br>\r\nYou see lots of giant people walking around and it looks like Ashton has reached his destination.<br>\r\nYou look at the building as Ashton walks inside and to your shock you see a large yellow letter \"M\" on the top.<br>\r\nThen you realize... you're at a Mcdonalds!!!<br>\r\n\"Hey man, how's it goin?\" <br>\r\nYou hear that familiar voice and know it can only be one person... Justin Timberlake!<br>\r\nTheres a big bump as Ashton puts his backpack down and you remain still. When its gone quiet, you emerge from the backpack and squeeze through the little gap and clamber down onto a large counter. <br>\r\nNow what are you going to do?</span></div></div>",
            "created":1087707600,
            "id":204006,
            "title":"I'm Lovin It!"
        },
        "151122112111":{
            "author_name":"Marty",
            "choices":[
                "Hide in the Box at the side of you.",
                "Leap into the Ice Bucket below you."
            ],
            "content":"<div class=\"\"><div> <span>You walk along the wide open counter to the burger grills and look straight ahead. <br>\r\nThe only way to the exit of this building is over the grills and make your way down from there.<br>\r\nLucky for you the grills aren't turned on so you begin your walk along the greasy walkway.<br>\r\nMacdonalds musn't be opening as there is no-one in the building at the moment and you have no idea where Ashton and Justin have gone.<br>\r\nThe grease and grime beneath your feet are sticky as you quickly try and dash across the grill ahead of you. <br>\r\nEventually, you wake it over the first grill and decide to take a rest for a while. As you lean back against a box, the swinging door from the other room flies open and a giant walks in. <br>\r\nQuicky you must hide somewhere and fast! <br>\r\nTheres an ice bucket below you and a box at the side of you. <br>\r\nHurry! </span></div></div>",
            "created":1087794000,
            "id":204107,
            "title":"Greasy Grills."
        },
        "1511221121111":{
            "author_name":"Marty",
            "choices":[
                "Try to get back to Ashton's Backpack.",
                "Sneak over to where Bryan is."
            ],
            "content":"<div class=\"\"><div> <span>You clamber into the box and hide as a huge giant walks over to the counter.<br>\r\nAs you look up, you recognize his face off television. Its Bryan Mcfadden, ex-member of the boy band, Westlife!<br>\r\nHe is dressed in a MacDonald's uniform so he must be working here now or he's making a movie or something. <br>\r\nYou watch as he moves over to the box and reaches inside. You quickly dodge the huge fingers of the giant star as he grabs a burger bun from the box.<br>\r\nHe walks away and is on the other side of the counter. This is your chance to escape from this room as he is not watching. <br>\r\nYou begin to climb out of the box when a door opens and Justin and Ashton return. You quickly dive back into the box and hold your breath.<br>\r\nThey appear to be talking together and you decide to take a quick peep. <br>\r\nJustin is sat at a table with a napkin at the side of him with sachets of salt and sauces.<br>\r\nHe must be doing a campaign for MacDonald's or something. <br>\r\nBryan is at the counter and looks like he's got the milkshake machine working. He walks over to a switch on the wall and presses it. The flames from the burger grill shoot up and heat begins to fill the room.<br>\r\nYou can't go back the way you came as crossing the grills would be fatal.<br>\r\nBryan isn't looking at the moment and Justin is talking to Ashton. <br>\r\nYou decide to make a break for it!</span></div></div>",
            "created":1087880400,
            "id":204264,
            "title":"Celebs Galore!"
        },
        "15112211211112":{
            "author_name":"Marty",
            "choices":[
                "Try and make a run for it before Bryan comes back.",
                "Stay in the Burger Buns and hope Bryan will choose another one."
            ],
            "content":"<div class=\"\"><div> <span>You are curious as to what Bryan is doing so you decide to sneak over to where he is doing on the other side of the counter.<br>\r\nYou look around you and quickly make a dash to where Bryan is and hide behind the till near him.<br>\r\nIt looks like he is preparing a burger.<br>\r\nYou watch as he puts the large burger buns together and places a burger on the grill. Steam rises from the grill as the burger begins to slowly cook. The smell is overpowering as you stand there and lift your nose up to get a good sniff of the aroma around you.<br>\r\nFrom behind you, Ashton stands up and grabs his backpack and turns to Justin.<br>\r\n\"Catch you guys later\" <br>\r\nYou knew you should have got to the backpack in time, as you watch your only way to get out of here, walk out of the door.<br>\r\nAshton has now gone.<br>\r\nYou're trapped in this room with two giant stars and Bryan is right next to you now!<br>\r\nHe is chopping up onions and cheese with a huge silver bladed chefs knife.<br>\r\nIt look like he is making a cheese burger.<br>\r\nJustin is still sat the table and is placing a napkin on his knees.<br>\r\nLooks like the burger is for him.<br>\r\nBryan is moving to the grill so you decide this is the best time to get out of here. You sprint across the chopping board toward the end of the counter. It looks like you've made it when Bryan comes walking back and you side track back and spin round.<br>\r\nThe first thing you see is the burger buns. You dive inside them.<br>\r\nThen you know you have made a big mistake. <br>\r\nBryan is walking back over with the now cooked burger!<br>\r\nHow will you get out of this one?<br>\r\n</span></div></div>",
            "created":1087966800,
            "id":204401,
            "title":"Adios Ashton!"
        },
        "151122112111122":{
            "author_name":"Marty",
            "choices":[
                "Roll to the side and pray the teeth dont crush you.",
                "Move forward and try and grab onto Justin's lip."
            ],
            "content":"<div class=\"\"><div> <span>Making a run for it would mean instant discovery, so you quietly stay between the two buns as Bryan comes back over with the burger.<br>\r\n\"Hey man, how long you gonna be? I'm starved!\"<br>\r\nYou hear Justin's voice coming from the table and as Bryan turns to face him, the top bun is removed and the giant burger comes down on top of you.<br>\r\n\"Its comin\" <br>\r\nYou hear Bryan answer him as the top layer of the bun is put on top of you.<br>\r\nThe hot burger meat burns your arms and legs and a force pushes it down on you. Not knowing it, it's Bryan flatting it before he lifts the whole burger, and you, up and begins to walk over to Justin. <br>\r\nYou manage to squeeze your head out and look forward to see Justin rubbing his hands together and smiling. You're stomach churns as the burger is placed down below him and you see the famous face peering down with a hungry look.<br>\r\n\"Well, let's get to it\"<br>\r\nYou look to see Justin's huge hands coming down and lifting you up high so you are face to face with Justin's face.<br>\r\nThen he opens wide. You see everything. His huge tongue, his brilliant white teeth and the gaping maw that lies in front of you.<br>\r\nYou frantically begin to panic as you move forward toward Justin's open jaws.<br>\r\nYou have to move quick before his huge teeth come crashing down on top of you!</span></div></div>",
            "created":1087966800,
            "id":204415,
            "title":"Burger for Mr Timberlake?"
        },
        "1511221121111221":{
            "author_name":"Marty",
            "choices":[
                "Make your way to the Front door and out into the Street.",
                "Make your way to the Back door and out into the Garbage Bins."
            ],
            "content":"<div class=\"\"><div> <span>You roll yourself up in a tiny ball and move to the side. With your eyes closed tightly, you pray that your death will end quickly and that a gigantic molar will put you out of your misery.<br>\r\nAs you turn back, you see the gigantic teeth tearing through the burger, as you realize that you are inside Justin's mouth.<br>\r\nAs you lie there, everything moving in slow motion, you await the inevitable of being swallowed alive.<br>\r\nSuddenly a flash of light appears in front of you and a great force throws you forward.<br>\r\nYou feel yourself flying through the air at a tremendous speed. If it hadn't had been for the  milkshake machine being turned on, you would probably have been killed.<br>\r\nYou splash as you land hard in the slushy milkshake and go under immediately. Fighting for your breath, you manage to reach the surface and swim to the side, where you grab onto the side and pull yourself out.<br>\r\nThere you collapse in a heap on the side of the container of milkshake, as you fight for your breath. You can voices from beyond the counter, it must be Justin.<br>\r\n\"Yuk! Oh man! You call that a burger?\"<br>\r\n\"Hey I must have under-cooked it or something\"<br>\r\n\"You're telling me! I nearly choked!\"<br>\r\nYou then realize that you have been saved by a dodgy burger! You listen as you hear Justin and Bryan continue arguing.<br>\r\n\"No way! I'm so out of here!\"<br>\r\n\"Wait Justin! Let me try again!\"<br>\r\n\"What so you can try and poison me again? No thanks, man! I'm leaving!\"<br>\r\nYou watch as you see Justin grab his things and walk out of the restaurant.<br>\r\nBryan slams his huge fist on the table and curses out loud. He walks out through the door after Justin.<br>\r\nLying there, you slowly begin to get up and wipe the rest of the milkshake from your tiny body.<br>\r\nNow you can finally get out of this restaurant.<br>\r\nThere is the front door and there is the back door.<br>\r\nWonder which way would be the best?</span></div></div>",
            "created":1088226000,
            "id":204752,
            "title":"Im \"Not\" lovin It!"
        },
        "15112211211112212":{
            "author_name":"Marty",
            "choices":[
                "Go to Romeo's bag.",
                "Go to Orlando's bag."
            ],
            "content":"<div class=\"\"><div> <span>You have had quite enough of the giants contact for one day, so you decide going out the back door would be a better option.<br>\r\nYou manage to reach the end of the counter and see a large bag of rubbish below you. It isn't a big drop but still its quite a fall. <br>\r\nAs you look around, you notice the back door is ajar from when Justin and Ashton came through. So you can go out through that door.<br>\r\nWith a deep breath, you hold your hands behind you and throw yourself forward. You fall down and land with a bump in the bag.<br>\r\nThe rotting smell of raw food fills your nostrils as you manage to reach the top of the bag and climb down onto the kitchen floor.<br>\r\nYou look forward and see the open door in front of you. Walking over you hear the sound of movement coming from the outside.<br>\r\nAs you get closer, you hear that its voices.<br>\r\nYou reach the door and look around the corner to see three enormous giants talking in a large alley. Looking closer you see that the three are people you have seen off television!<br>\r\nTo the right of you is r'n'b star and singer, Romeo! He is wearing jet black pants with a red jacket and white shirt underneath.<br>\r\nIn the middle is actor and heart throb star, Orlando Bloom! He is standing there with dark blue pants and a cream t-shirt on.<br>\r\nBefore you get a chance to see the other giant, he turns and walks down the alley and turns the bend out of sight.<br>\r\nBoth the giants are still chatting and are handing each other pieces of paper. They must be making a movie of some sort.<br>\r\nYou quietly walk besides the huge black bins and look ahead. You see the stars both have bags with them besides their feet. Walking down the alley could take a while, so why not hitch a ride with one of the giants?<br>\r\nYou glance around and they are still in deep conversation.<br>\r\nMake your choice quick!<br>\r\n</span></div></div>",
            "created":1088312400,
            "id":204879,
            "title":"Three's a Crowd."
        },
        "151122112111122121":{
            "author_name":"Marty",
            "choices":[
                "Climb out of the Bag and explore the Airport.",
                "Get out of the Bag and make your way to Romeo."
            ],
            "content":"<div class=\"\"><div> <span>As you look that little bit closer, you see that Romeo's bag is a little closer to you, so you decide to take a chance on him.<br>\r\nYou make a dash to his bag and clamber up the side and fall down into the inside.<br>\r\nDeep in the bag, you see all kinds of things from a huge bottle of mineral water, to a load of cd's piled high at the side of you. You pick yourself up and take a look around. There dosen't look like there is anything edible, which is a real shame as you're very hungry.<br>\r\nSuddenly the bag shakes and you fall to the side. Romeo has started to pick up the bag and you are on the move, it seems. <br>\r\nAs you bounce along, you see the cd's and that large bottle shake and bang all around the bag.<br>\r\nYou just hope you don't get crushed by anything.<br>\r\nRomeo continues walking along and you have no idea where he is going to.<br>\r\nMaybe back to his apartment or house?<br>\r\nOr maybe he's going making a new video?<br>\r\nYou ponder these thoughts as you bounce along in his bag.<br>\r\nAfter about ten minutes, the bouncing stops. You stay still for a moment and all is quiet.<br>\r\nSuddenly a bright beam of light fills the inside of the bag as a gigantic hand comes in and lifts the big bottle of water from the bag.<br>\r\nYou look up to see Romeo unscrew the cap and take a big gulp of water and watch him swallow it down. <br>\r\nHe puts the top back on and drops it back into the bag, just missing you by an inch.<br>\r\nWith the bag zipped back up, its dark again.<br>\r\nYou now bouncing along again but you can hear ringing. <br>\r\nIt's Romeo's phone and you hear him answer it.<br>\r\n\"Hey, hows it hanging?\"<br>\r\nYou hear a lot of laughter from the giant singer, then you stomach turns as you hear where abouts he is heading next.<br>\r\n\"Oh yeah man, my flight's in about half an hour, yeah\"<br>\r\nThe Airport!<br>\r\nThe bag will be searched and you will be discovered.<br>\r\nYou instantly go into panic mode as you hear Romeo handing his bag to someone. You are thrown to the side and hear a loud buzzing noise. Then you hear another voice.<br>\r\n\"Welcome Sir. Your flight is waiting\"<br>\r\nYou're at the airport!<br>\r\nYou jump up an manage to stick you head out of the side pocket of the bag and see Romeo passing something to someone else.<br>\r\nYou've got to act fast!<br>\r\nWhat should you do?</span></div></div>",
            "created":1088312400,
            "id":204928,
            "title":"Where For Out Thou Romeo?"
        },
        "1511221121111221211":{
            "author_name":"Marty",
            "choices":[
                "Jump out of the Case and attempt to get down off the Belt.",
                "Stay in the safety of the Case and see where Orlando is going."
            ],
            "content":"<div class=\"\"><div> <span>You want to get away from Romeo's bag as quick as you can so you climb out and drop to the floor.<br>\r\nYou watch the gigantic trainers of Romeo begin to move away from you, which seems like the ground is shaking.<br>\r\nDesparate and scared, you dash to a bin at the corner of a wall and hide behind it.<br>\r\nThere are a huge amount of giant feet thundering past you and you conclude that trying to get out of here on the ground would be instant death.<br>\r\nYou look up and see that you are next to a luggage carousel and that there are suitcases above you moving along it.<br>\r\nMaybe if you could get onto the conveyor belt, you could reach a suitcase. Then you would at least be out of the Airport!<br>\r\nYou start to climb up the bin, via the plastic bag hanging out of it, and manage to reach the lid. There, you jump up and grab hold of something going past.<br>\r\nYou're swept along hanging onto the strap of a case. As you look down, you see the tiles on the floor zooming past.<br>\r\nYou quickly manage to pull yourself up and robe climb up the strap until you are on top of the case.<br>\r\nYou instantly fall as the case is moving quite fast. Being on her might not be such a good idea, if you don't want to be seen so you pull the large zip from the side pocket of the case and it opens slightly.<br>\r\nAs you dive in, you manage to keep it a little bit open so you can see ahead of you. <br>\r\nThere is someone waiting for a case coming up close but you cant quite make it out.<br>\r\nThen as he comes into focus, you suddenly get a moment of past memory.<br>\r\nIt's Orlando Bloom!<br>\r\nHis hands are spread out wide ready to grab the case.<br>\r\nThere's still time to get out!</span></div></div>",
            "created":1088398800,
            "id":205043,
            "title":"From One to the Other."
        },
        "15112211211112212112":{
            "author_name":"Marty",
            "choices":[
                "Head into the Kitchen.",
                "Go through the Door to the Garden."
            ],
            "content":"<div class=\"\"><div> <span>Staying in the case might be safer than getting on the conveyor belt, as it is moving quite fast.<br>\r\nYou look to see that you getting closer to Orlando as he prepares to grab the case from the moving carousel.<br>\r\nThere's a bump as you are thrown deep down to the inner parts of the case. Orlando must have picked up his case.<br>\r\nYou remain still for a movement then you feel like your in motion but not bumping.<br>\r\nLittle do you know, but Orlando is wheeling the case away where he is heading toward the Airport exit.<br>\r\nYou are sat in the dark deep parts of the inner case and begin to wonder where you are heading this time.<br>\r\nThere is not a lot of noise coming from outside as you stand up and put your ear to the side of the case.<br>\r\nRoughly ten minutes later, there's a loud bump and you fall down deeper into the case.<br>\r\nLuckly the clothes broke your fall and you manage to get yourself back on your feet.<br>\r\nYou hear a door bang and all is quiet.<br>\r\nYou stay silent yourself as you listen for any movement from Orlando.<br>\r\nThen there is the noise of the case zipping undone and you begin to try and find a way out.<br>\r\nFrantically, you manage to find a small hole where the stitching has come loose and you squeeze through it, where you leap to the floor below. <br>\r\nYou're in Orlando's apartment!<br>\r\nYou instantly run to the nearest object to you.<br>\r\nA water cooler. You hide behind the cooler and watch as you see the gigantic giant unzips the case and begin to move his clothes around and take things out.<br>\r\nMaybe you had better find somewhere safer for the time being?<br>\r\nOr maybe you want to explore Orlando's apartment while he's busy?<br>\r\nYou look around to see the next room in the house is the kitchen. <br>\r\nAs you look the other way, you see that a door leading to the garden is wide open.<br>\r\nWhich way do you want to go?</span></div></div>",
            "created":1088485200,
            "id":205201,
            "title":"Home Sweet Home?"
        },
        "152":{
            "author_id":"storeviewer",
            "author_name":"Writinguy",
            "choices":[
                "Zach",
                "Jonathan"
            ],
            "content":"<div class=\"\"><div> <span>Thankfully you are already close to the reception area as you passed it on your wanders.<br>\r\nYou turn back and  enter the reception area under the doors.<br>\r\nYou hear a voice from behind the desk.<br>\r\n\"i suggest you try the sauna, the swimming pool and the tanning room during your stay, thank you.\"<br>\r\nThere before you are Zachery Ty Bryan and Jonathan Taylor Thomas both are reaching in their pockets for money and you have time to reach both of them.<br>\r\nZach's wearing sandles with little grooves on the bases so they're easy to climb, while Jonathan's pants which are quite baggy are slightly ripped on the bottom with lots of loose strands so now is your option to climb to both of them.<br>\r\nWhich will it be?</span></div></div>",
            "created":1087707600,
            "id":204004,
            "title":"Reception"
        }
    },
    "info":{
        "author_id":"storeviewer",
        "author_name":"Writinguy",
        "brief_description":"a newer and hopefully more active version of shrinking at celeb swimming etc.",
        "created":1086738120,
        "description":"<td align=\"left\" class=\"norm\">This story is another shrinking with male stars story but in order to add more stars i need your help...<br>\r\nplease view the sister item in my portfolio called shrinking with male stars it has a quiz that i would like quickly done in order to add storys the people who read this want<br>\r\n========================<br>\r\nstorylines in preparation and coming soon:<br>\r\nDerek Jeter<br>\r\nEnrique iglesias<br>\r\n========================<br>\r\nI am writing a new story on my personal website about leonardo dicaprio turning into a giant so please view at <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://hishrinkingtales.tripod.com/ld.html\" target=\"_blank\">http://hishrinkingtales.tripod.com/ld.html</a></td>",
        "id":856278,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1370347200,
        "modified":1370347200,
        "pretty_title":"shrinking with male stars"
    }
}