{
    "chapters":{
        "1":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "Yoko Ritona",
                "Nia Teppelin",
                "Adiane the Elegant",
                "The Bachika Girls(Kiyoh, Kinon, and Kiyal)",
                "Darry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So which lucky girl is it going to be?</span></div></span></div>",
            "created":1342587600,
            "id":1381779,
            "title":"It begins now"
        },
        "11":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "Weight gain",
                "Pregnancy",
                "Expansion",
                "Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what's going to happen to the leading lady of this franchise?</span></div></span></div>",
            "created":1342674000,
            "id":1382751,
            "title":"Yoko Ritona"
        },
        "111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip",
                "Inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Yoko(age 15) or post Timeskip(22) or inbetween?</span></div></span></div>",
            "created":1342674000,
            "id":1382891,
            "title":"Weight gain"
        },
        "1112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "She heads home first to change into something less...old-like",
                "She heads straight towards a nearby seafood place",
                "Hmm? She sees a familiar face on the sidewalk. Who could it be?"
            ],
            "content":"<div class=\"\"><div> <span>Yoko sighed sadly as she went over the quizzes within her classroom, the students having left for home an hour ago.<br>\r\n<br>\r\nIt has been several months since Simon and Nia's wedding, which resulted in the latter's inevitable and sad death and the former's disappearance to places unknown. The redhead teacher looked out the window, seeing the setting sun and gave another sigh.<br>\r\n<br>\r\nC<br>\r\n<br>\r\nShe turned 23 last week, having received some gifts via mail from her old Dai-Gurren comrades. The Brigade was still helping in rebuilding the world after the Anti-Spiral conflict and many are calling for the creation of a naval fleet so that Earth can meet with the people live amongst the stars.<br>\r\n<br>\r\nC<br>\r\n<br>\r\nAnd she will have no part in it, content with raising the young generation to take the current's place in society. She was content with her friends showing that they stilled cared for her in some way or form.<br>\r\n<br>\r\nA<br>\r\n<br>\r\nWhat she was not content with...was the loneliness...<br>\r\n<br>\r\nF, it was Dunki's quiz again. He really needed help...<br>\r\n<br>\r\nFirst it was Kamina, dying to the beastman eight years ago, then it was Kittan nearly a month ago...they had kissed her and right after was forced down into the River Styx, the former unwillingly, the latter willingly.<br>\r\n<br>\r\nB<br>\r\n<br>\r\nShe knew some of the island's bachelors tried to flirt with her several months ago, but she turned them away, not wanting to form companionship at the time when she started teaching as a way of respecting Kamina in some way.<br>\r\n<br>\r\nB<br>\r\n<br>\r\nBut now, the same men are avoiding her, and with good reason, she's nearing the threshold where after a certain age she's \"undesirable\" the ripe age of 24.<br>\r\n<br>\r\nD, Umia. She was usually being a plastic beauty queen most of class.<br>\r\n<br>\r\nWhy did fate have to be so cruel to her to condemn her with the men avoiding her either out of aiming for the younger girls, or out of nervousness...<br>\r\n<br>\r\nB.<br>\r\n<br>\r\nShe finished the last set of quizzes and set them in her folder, hearing a growl from her slim stomach.<br>\r\n<br>\r\n\"Guess I'll be eating out tonight...\" She thought as she placed her folders into her briefcase and walked out of the classroom and locking it. She proceeded out of the school and out down the path to the parking lot. She placed the key into the ignition for her hover scooter and drove into the town on the island.</span></div></div>",
            "created":1347296580,
            "id":1424614,
            "title":"Nearing the Date"
        },
        "112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip",
                "Inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Yoko(age 15) or post Timeskip(22) or inbetween?</span></div></span></div>",
            "created":1342674000,
            "id":1382892,
            "title":"Pregnancy"
        },
        "113":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip",
                "Inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Yoko(age 15) or post Timeskip(22) or inbetween?</span></div></span></div>",
            "created":1342674000,
            "id":1382893,
            "title":"Expansion"
        },
        "1131":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "Breast",
                "Ass",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Breast, Ass or Both?</span></div></span></div>",
            "created":1577857140,
            "id":2767731,
            "title":"What type of expansion?"
        },
        "11311":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "Naturally",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Yoko's already big breasts get bigger?</span></div></span></div>",
            "created":1577857260,
            "id":2767732,
            "title":"Method"
        },
        "113111":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "Canon size(At least DD-cup)",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How big do her breasts start at?</span></div></span></div>",
            "created":1577858700,
            "id":2767736,
            "title":"Starting size"
        },
        "1131111":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "Simon",
                "Kamina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is Yoko's love interest?</span></div></span></div>",
            "created":1577861280,
            "id":2767742,
            "title":"Love interest"
        },
        "11311111":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "Come right out and tell him.",
                "Take it slow. It could be fun to tease him for a while."
            ],
            "content":"<div class=\"\"><div> <span>These last few days have been pretty crazy for Yoko Littner. At first it was business as usual, fight off some Gunmen with a rag tag team and try not to die. Then the Gunmen crashed it's way into an underground village and Yoko followed after it to help the villagers. There she met Simon, a short, rather timid but cute digger, and Kamina, a loud, reckless, but loyal and charismatic young man. With the Gunmen hot on their heels Simon lead them to a Mecha that he found while he was digging earlier and with the Drill Key found from an earlier dig(and Kamina getting his but in gear) he piloted the Mecha(named Lagann by Kamina) and defeated the Gunmen in rather spectacular fashion.<br>\r\n<br>\r\nYoko was mesmerized by the determination and power that shined in Simon's eyes as he tore the Gunmen to pieces with Lagann's drill. She never would have imagined such fighting spirit could be found in such a small boy. And as they soared into air as the Gunman exploded and Lagann's head case opened to show a stunning view of the surface in the midst of Twilight Yoko found her heart stop at the look of sheer hope and joy on Simon's face. It was in that moment were she vowed to herself that she would keep that hope and joy alive and protect Simon at any cost. As she playfully introduced herself she felt her heart skip a beat as Simon simply smiled at her(while Kamina introduced them both). And as they fell back to earth in rather comedic heap Yoko wasn't annoyed or embarrassed when she found Simon's face buried in her cleavage like she would be with any other boy. If anything she felt endeared to him, especially with his adorable reaction when he realized where his face was. And when she saw more Gunmen coming for them her first action was to bring his face back into her bosom in a protective manner, while with anyone else she would have just put herself in between them with her rifle raised to shoot the danger in the face.<br>\r\n<br>\r\nWhen Simon tried to dig his way back to his village she couldn't really blame him for being so scared. He had lived underground digging whole his whole life, this was the first time he had been to the surface let alone faced a Gunman. While she had been trained to fight this things her whole life and she still gets scared, in fact this was the first time in years that they were able to defeat a Gunman without anyone getting injured or killed. So she knew better then most how dangerous fighting these things is. And with Kamina constantly put himself in danger with his reckless bravado Simon and Yoko had to step in and save manly ass. The dude nearly shot himself with the gun Yoko gave him using it as a blunt weapon for gods sake. It was a miracle he didn't get himself killed with all his showboating. But if nothing else he had a knack for spurring Simon into action with his unique form of charisma. And when he actually manages to back his big words he is pretty cool. But he's not her type, no matter how much Leeron teases her about it.<br>\r\n<br>\r\nBut when she thought back to last night when Simon was staring at her right before his Drill Key glowed with power, she then remembered how Leeron told her earlier how when Simon was struggling to activate Lagann before he realized that his parents were killed by the Gunman causing earthquakes in his village. This proved to him that Lagann(and possibly other Gunman Mecha's) were powered by powerful emotions. Willpower, Rage, Love just to name a few. So the meant that that the feelings that he had for her were powerful enough to activate Lagann. She didn't know if it was love or just lust but felt incredibly flattered none the less. And when she found Simon and Kamina cuddled up together in their sleep(in a manly, brotherly way mind you) it took all her willpower to not squeal with glee at the adorable sight and smother Simon's face with kisses. <br>\r\n<br>\r\nAll these things made it clear to Yoko that she was falling in love with the young digger. And she wasn't quite sure how to deal with it, I mean she was 14 and this was the first time she ever felt this way. Should she just tell him how she felt? But that could make things awkward if he didn't return her feelings. Especially if it turns out if he already had another girl he likes from his home village. So maybe she should take things slow since this is new territory for her. Give him hints of her feelings, playfully flirt with him and see if he returns her advances. But if he already likes her then she shouldn't have to, I mean she new he thought she was pretty at the very least. So maybe it's best to just get it over with. What should she do?<br>\r\n</span></div></div>",
            "created":1577938380,
            "id":2768088,
            "title":"Love at first battle."
        },
        "113111112":{
            "author_id":"wolfboy0618",
            "author_name":"Wolfboy",
            "choices":[
                "Tomorrow. Hunting trip.",
                "Time Skip."
            ],
            "content":"<div class=\"\"><div> <span>So with her plan of attack in mind she went off to find Simon. It didn't take to long to find him still in his Lagann no doubt coming to grips with all the craziness that happened today. In the background Kamina was retelling the story of today's battle with much gusto in spite of learning of his father's fate.<br>\r\n<br>\r\n\"So why is one of today's heroes looking so glum?\" she asked with a pleasant smile on her face. Simon was surprised to see such a beautiful girl taking the time to talk to him let alone call him a hero. He figured that she would much rather hang around his bro, he's the the real hero.<br>\r\n<br>\r\n\"Hero? No I'm no hero.\" he said rather glumly.<br>\r\n<br>\r\n\"You think so? I think you were very brave out there.\" she said encouragingly.<br>\r\n<br>\r\n\"No, bro is the brave one. He faced the enemy with no fear or hesitation. While my first instinct was to run away.\"<br>\r\n<br>\r\n\"Being brave isn't the same thing as being fearless Simon.\" she rather wisely. Simon looked at her confused. \"Being brave means taking action despite the fact that you are afraid. And it's okay to be afraid. It's human to be afraid. Fear is what allows us to realize when our lives are in danger. It makes us aware and helps us to take the actions needed to insure our survival. Of course that's how it can work in your favor if you know how to control your fear. If you can't you will make rash even dangerous decisions that could get yourself and others killed. The same could be said for being fearless. Take that idiot for example.\" she pointed to Kamina making his signature \"Pierce the Heavens\" pose to his audience \"He may have proven that he's not all talk today, but that's only because you and I were always there to bail him out when he gets in over his head.\"<br>\r\n<br>\r\n\"But bro he..well he..uh..\" Simon tried to defend his bro but as much as he may love and admire Kamina(who doesn't) he will admit that bro can be a real dumbass most of the time.<br>\r\n<br>\r\n\"Exactly.\" Yoko said with a knowing look. \"In fact I think the reason why he seems to have no fear is because he knows that no matter what happens you will always be their to save him.\" <br>\r\n<br>\r\nSimon was dumbfound. Him Save Kamina?! When did that happen?! Yoko seemed to read his mind as she then said \"You saved him when the Gunmen was attacking your village and saved him from getting squashed by another Gunmen when we got to the surface. You were there to help him force a Gunmen's jaws open so he could pilot it. And you were able to execute his insane plan to use your drill on the Gunmen after he threw you at them. Even though you missed at first he knew you would drill your way back and finish the job and he was right. You inspire him. Just like he inspires you. And that is why you are a hero Simon.\" she finish with gleam in her eye that showed she meant every word she said.<br>\r\n<br>\r\nAll Simon could do was stare at Yoko with a stunned look on his face. Him, a puny little digging coward, inspire someone as cool, manly and awesome as Kamina?!?! Inconceivable!! But as he stared at her gorgeous face with no doubt whatsoever in her eyes and thought back to all the things he did in the last 2 days, things that never in his wildest dreams he thought were possible, he found himself starting to believe her. And thus for the first time in his life start to believe in himself. With that his Drill Key began glowing brighter then it has before. Curious he inserted it into Lagann's ignition and turned it. A bright green energy engulfed the cave as all the dirt, grim and damage that Lagann accumulated seem to vanish. After few seconds the glow dimmed until it revealed a fully repaired and polished Lagann.<br>\r\n<br>\r\n\"It seems that Leeron was right.\" Yoko said with awe \"It's powered by the human spirit.\" She the looked to Simon with a fire in her eye and bold smile that would make Kamina proud \"And the more powerful your spirit the more powerful Lagann and by extension you will become. So remember to believe in not just in yourself, but also the Kamina and the me that believes in you! If you do that then there is nothing you can't do!\" she said with passion that could rival Kamina at his best.<br>\r\n<br>\r\nSimon felt a fire in his heart much like when he first used Lagann to drill up to the surface while destroying the Gumen that attacked his village. Only this one was much stronger. He seemed to stand taller as he looked at Yoko with more power and determination then before causing her heart to pound in her chest.\"I believe.\" he said with such authority Yoko almost came where she stood. It took all her willpower to not tackle him and make sweet love to him. Had to remember the plan.<br>\r\n<br>\r\n\"Good.\" she with a breathless voice and rather weak knees.<br>\r\n<br>\r\n\"Yoko are you okay?\" he asked concerned about her flustered state. Yoko took a few deep breaths to calm down, her sniper training really coming in handy right now.<br>\r\n<br>\r\n\"Yeah yeah I'm good.\" she said with steadier breath and legs. She then walked up to Simon and a quick but heartfelt kiss on the cheek. This caused Simon to turn completely red and fall into his seat. Yoko grind at his cute reaction \"That is the first part of your reward for being today's big hero.\" But her grin turned to a smirk as she leaned forward to give him a better view of her supple bust. \"And for the second part I'm going to let you in on a little secret.\" she said with a very sultry voice. She leaned even closer until all he could see was her divine bikini clad tits. \"These tasty morsels as Kamina called them are..still..growing.\"<br>\r\n<br>\r\n\"HUH?!?! was all Simon could utter.<br>\r\n<br>\r\n\"Mmhm. In fact just a few weeks ago I was completely flat.\" she said honestly before returning to sultry \"Then all of the sudden I'm packing DD's. But everyday I have to adjust my bikini because it gets tighter.\" She the starts to slowly bounce them up and down \"If they keep growing at this rate in few days I'm going to be an E-cup. The an F. G. H. I. J. K. MMM!\" she moaned at the amazing thought her breast growing so big \"I wonder if they will ever stop. I hope they never stop. That's right Simon. I want my breasts to keep getting bigger and bigger and bigger. Do you want that too Simon? Do you want my boobies to get so big they engulf the heavens?\" Simon was so overwhelmed by the pure sexiness he was seeing that he was rocketed up into the air from all the blood shooting from his nose. Yoko blinked in surprise \"I think I over did it a little.\"</span></div></div>",
            "created":1577955480,
            "id":2768157,
            "title":"A heroes reward. Yoko's faith and Growth."
        },
        "114":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip",
                "Inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Yoko(age 15) or post Timeskip(22) or inbetween?</span></div></span></div>",
            "created":1342674000,
            "id":1382901,
            "title":"Inflation"
        },
        "12":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "Inflation",
                "Weight gain",
                "Pregnancy",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what will happen to the love intrest of Simon?</span></div></span></div>",
            "created":1342674000,
            "id":1382755,
            "title":"Nia Teppelin"
        },
        "121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip",
                "Inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Nia(age 12) or post Timeskip(19) or inbetween?</span></div></span></div>",
            "created":1342674000,
            "id":1382903,
            "title":"Inflation"
        },
        "122":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip",
                "Inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Nia(age 12) or post Timeskip(19) or inbetween?</span></div></span></div>",
            "created":1342674000,
            "id":1382905,
            "title":"Weight gain"
        },
        "124":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip",
                "Inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Nia(age 12) or post Timeskip(19) or inbetween?</span></div></span></div>",
            "created":1342674000,
            "id":1382908,
            "title":"Expansion"
        },
        "13":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "Expansion",
                "Pregnancy",
                "Inflation",
                "Weight gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will happen to the sexy supreme general with a freaky scorpion tail?</span></div></span></div>",
            "created":1342674000,
            "id":1382761,
            "title":"Adiane the Elegant"
        },
        "14":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "Kiyoh",
                "Kinon",
                "Kiyal",
                "All thre of them."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one of the girls is it going to be?</span></div></span></div>",
            "created":1342674000,
            "id":1382765,
            "title":"The Bachika Girls(Kiyoh, Kinon, and Kiyal)"
        },
        "141":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Weight Gain/Pregnancy",
                "Expansion",
                "Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will the eldest of the Bachika sisters expand?</span></div></span></div>",
            "created":1342674000,
            "id":1382887,
            "title":"Kiyoh"
        },
        "1411":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Weight Gain",
                "Pregnant",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, will Kiyoh be getting fatter or carrying a child? Or both?</span></div></span></div>",
            "created":1342674000,
            "id":1382909,
            "title":"Weight Gain/Pregnancy"
        },
        "14111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Kiyoh(age 18) or post Timeskip(25)?</span></div></span></div>",
            "created":1342737420,
            "id":1382920,
            "title":"Weight Gain"
        },
        "14112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Pre-timeskip",
                "Post-timeskip"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will it be pre-timeskip Kiyoh(age 18) or post Timeskip(25) or inbetween?</span></div></span></div>",
            "created":1342737420,
            "id":1382921,
            "title":"Pregnant"
        },
        "1412":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Breasts",
                "Butt",
                "Belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What sort of expansion will Kiyoh undergo?</span></div></span></div>",
            "created":1342674000,
            "id":1382910,
            "title":"Expansion"
        },
        "1413":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Air",
                "Water",
                "Blueberry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will Kiyoh will be inflated?</span></div></span></div>",
            "created":1342736880,
            "id":1382911,
            "title":"Inflation"
        },
        "142":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Weight gain/Pregnancy",
                "Expansion",
                "Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will the middle sister of the Bachikas expand?</span></div></span></div>",
            "created":1342674000,
            "id":1382889,
            "title":"Kinon"
        },
        "1421":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Weight Gain",
                "Pregnant",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, will Kinon be getting fatter or carrying a child? Or both?</span></div></span></div>",
            "created":1342737000,
            "id":1382913,
            "title":"Weight gain/Pregnancy"
        },
        "1422":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Breasts",
                "Butt",
                "Belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will Kinon expand?</span></div></span></div>",
            "created":1342737060,
            "id":1382914,
            "title":"Expansion"
        },
        "1423":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Air",
                "Water",
                "Blueberry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What sort of inflation will she go under?</span></div></span></div>",
            "created":1342737120,
            "id":1382915,
            "title":"Inflation"
        },
        "143":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Weight Gain/Pregnancy",
                "Expansion",
                "Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will the youngest of the Bachika sisters expand?</span></div></span></div>",
            "created":1342674000,
            "id":1382890,
            "title":"Kiyal"
        },
        "1431":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Weight Gain",
                "Pregnant",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, will Kiyal be getting fatter or carrying a child? Or both?</span></div></span></div>",
            "created":1342737120,
            "id":1382916,
            "title":"Weight Gain/Pregnancy"
        },
        "1432":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Breasts",
                "Butt",
                "Belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will Kiyal expand?</span></div></span></div>",
            "created":1342737180,
            "id":1382918,
            "title":"Expansion"
        },
        "15":{
            "author_id":"spoofinator",
            "author_name":"joey",
            "choices":[
                "Pregnancy",
                "Weight gain",
                "Inflation",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what will happen to this pink-haired beauty?</span></div></span></div>",
            "created":1342674000,
            "id":1382767,
            "title":"Darry"
        }
    },
    "info":{
        "author_id":"spoofinator",
        "author_name":"joey",
        "brief_description":"The girls from the gurren lagann franchise are about to expand in various ways.",
        "created":1342644240,
        "description":"<td align=\"left\" class=\"norm\">For those of you who don't know what this anime is check the link below.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://en.wikipedia.org/wiki/Gurren_Lagann\" target=\"_blank\">http://en.wikipedia.org/wiki/Gurren_Lagann</a><br>\r\n<br>\r\nWhat is is allowed:<br>\r\nWeight gain<br>\r\nexpansion(breasts, butt, belly, etc)<br>\r\ninflation (air, water, blueberry, etc)<br>\r\npregnancy<br>\r\n<br>\r\nWhat's not allowed:<br>\r\nKilling<br>\r\nFuta<br>\r\nextreme WG<br>\r\nvore of any kind<br>\r\nTentacles<br>\r\ntoliet play<br>\r\nfoot feitsh<br>\r\n<br>\r\nAll entries must be at least five sentences long.<br>\r\n<br>\r\nHappy writing</td>",
        "id":1880370,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1577955480,
        "modified":1577955480,
        "pretty_title":"Gurren Lagann expansion"
    }
}