{
    "chapters":{
        "1":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A female micro furry...",
                "A male micro furry...",
                "A female macro furry...",
                "A male macro furry...",
                "Human options/More options..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, where would you like to start?</span></div></span></div>",
            "created":1388206800,
            "id":1716159,
            "title":"The Beginning."
        },
        "11":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Milly, The Quater-Inch Tall Fox",
                "Story 2...",
                "Story 3...",
                "Story 4...",
                "Story 5..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716183,
            "title":"A female micro furry..."
        },
        "111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Milly is stuck tight and Bella comes home...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>As long as she could remember, Milly had always been a tiny fox, as were her whole family. She was adamant that they were the only tiny furries anywhere, as she hadn't seen nor heard of any other miniscule species before.<br>\r\n<br>\r\nMany years ago, the quarter-inch tall fox had lost her family when she slept, tired from her ventures in the house that they had occupied under the floorboards. With no idea what had happened to them, Milly had to fend for herself, to survive for herself. At the age of 18, it was incredible how mature she was. The harsh reality of her world forced her to be so, just gathering food for herself was a dangerous feat.<br>\r\n<br>\r\nThe house she lived in sure didn't belong to her, but to a female huskey of \"normal\" height. Of course, height was relative to Milly as the huskey was hundreds of feet tall from her point-of-view. Bella, she was called. <br>\r\n<br>\r\nBella was a Syberian Huskey, 26 years of age. As far as Milly could tell from living in her house, hidden in plain sight, Bella was a student, but of what she was not sure. Milly did her best to stay away from her, only coming out of living space whenever Bella was out of the house and only then would she go looking for supplies to keep her living. It was a shallow life to some, but the basics of nature is to survive, after all. And this was her life.<br>\r\n<br>\r\nWhen Bella was in the house, Milly would be resting under the floorboards in the living room that was thankfully the room next to the kitchen. Small bits of food and crumbs could be found everywhere here, and if it happened to be that Bella had cleaned her house, it wasn't far for Milly to venture to go to the kitchen. <br>\r\n<br>\r\nLife under the floorboards was no fun though. Whenever Bella or her friends walked around, the thought that the were mere feet above her scared Milly to the core. When Milly was younger, she sometimes had nightmares of a giant paw falling through the ceiling just above her, crushing her into nothing but bloody matter. However, as she grew older, her fear subsided and it was nothing more than everyday reality to her, something she just dealed with on a day-to-day basis. <br>\r\n<br>\r\nMilly had always wondered what would happen if she had revealed herself to Bella, but just the shear sight of the giant dog was too much to bare and it was better to be safe than sorry especially for a fox who was as small as she was. But there were times when she observed the giant hound, that she would become jealous the simple things. Clothes were one such example. Milly was fine in her natural orange and white fur, with the hot water pipes only mere inches away from her in the floor keeping her warm, but she thought that it would be nice to be able to dress up once in a while. Being able to have a wash whever you wanted would be nice too. But life went on for Milly and she was never bitter about her situation.<br>\r\n<br>\r\n--- --- ---<br>\r\n<br>\r\nMilly had waited under the floor, her usual 30 minute wait to make sure the silence she heard meant that Bella had left the house confirmed she was alone. It was early afternoon, and it was time for her rounds to find food.<br>\r\n<br>\r\nAs she made her way to the surface of the living room through the small cracks between the boards, she hoped for what she might find. <i>I'm sure I could smell bacon cooking earlier...</i> Milly thought to herself. She had been living on bits of cheese and bread for the past couple of weeks. She hoped one day she could have a choice in what she had to eat, somehow, someway. <br>\r\n<br>\r\nShe crawled onto the laminate floorboard and began to make her way to the kitchen, an easy 10 minute walk for her, but she liked to have a run and get her exercise, it was a cramped life under the floor so why not. As she ran for the kitchen, she scanned the living room for any bits of food, anything she could grab to keep her going. <br>\r\n<br>\r\nAnd to her luck, she spotted some bread in the direction she was heading. And she could smell bacon too! Maybe, just maybe, there may be a small slither of meat for her to nibble on. As she closed in on the bread, the smell of bacon became stronger. And it wasn't long until her paws began to stick to the floor. Before she could wonder what it was her feet were sticking to, she slipped and tripped with a splat on her back, her fur and tail instantly becoming stuck to the...<br>\r\n<br>\r\n<i>\"Grease... Oh God...!\"</i> Milly yelped. It was grease that must've dripped from Bella's sandwhich! She had never had a problem like this before, this was a new situation. She was glued to the floor, in the middle of the living room of the giant female huskey...</span></div></div>",
            "created":1388379600,
            "id":1717788,
            "title":"STORY START: Milly, The Quater-Inch Tall Fox"
        },
        "1111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Alive and smelling of bacon...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Minutes flew by as Milly was glued to the floor, her fur was gripped to grease and there was no way she could move an inch. Eventually, she had to rest. Lying on her back and panting, Milly was stuck tight and in desperation to think of a plan to get her out of this mess. All the meanwhile, the smell of cooked bacon reeked all around her.<br>\r\n<br>\r\n--- --- ---<br>\r\n<br>\r\nMilly woke with a startle, jolting as a loud bang boomed from somewhere in the house. Milly was panting as her she quickly gathered her thoughts; \"<i>...Bella!</i>\" Shelifted her head to look down past her bare body and her legs, down the length of the room at the tall door and held her breath, waiting for another noise or lack of like she hoped.<br>\r\n<br>\r\nIt didn't take long before she heard the unmistakable boom that Bella made when she took off her boots at the door and with that, Milly got back to trying to pull herself of the fat that kept her glued to the spot. Mere seconds ticked by and within a moment, the living room door opened and there stood the giant Huskey in all her might.<br>\r\n<br>\r\nMilly was breathless as she gazed at the stunningly-colossal anthro-hound standing in the door way. The huskey's hair was mostly snowy-white with black dashes around her body. She was wearing a blue tank top and tight jeans that hugged her legs. Her thick tail wafted behind her softly and her hair hung on her shoulders and her cute face. But the main highlight that Milly was focusing on, as she lay stuck, was thet fact that her gigantic paws were now lifting in the air as Bella began to walk in the direction Milly happened to be in. <br>\r\n<br>\r\nThere was nothing she could do but watch as Bella walked slowly towards her and from her perspective, it seemed like it was happening in slow-motion as if to tease her of the inevitable. The chest of the giant bitch bounced and bobbed behind the top as she appreached towards the kitchen and her legs throbbed of her muscle's working her legs. And again, Milly was more focused on her giant paws that lifted and boomed to the floor, getting closer closer, to the point where Milly was literally been rattled by the tremors rippling through the floor.<br>\r\n<br>\r\nMilly braced and gasped as Bella was onto a simple pawstep away from her now and her body went cold. She watched as the giant paw, that was the size of an aircraft carrier, bent at the toes and lifted of the floor in front of her and lifted into the sky towards her. <br>\r\n<br>\r\nMilly deeply gasped once again and nearly making her pass out as the paw of the giantess raised and floated over her, casting a shadow from beneath the pads and the flicks of white fur that was her sole and now was the sky.<br>\r\n<br>\r\nThe tiny fox jolted uncontrollably as the paw slowly lowered towards her and there was nothing that she could do as the pad of the giant wolf closed in on her and in no time, Milly's life went black with an Earth-shattering boom.</span></div></div>",
            "created":1388552400,
            "id":1719428,
            "title":"Milly In The Way"
        },
        "11111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Milly is going in...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Milly yelped into the leathery paw that pressed on her tiny body, the weight of the paw flattening around her. She couldn't breathe and the air was squashed out of her and her whole body smushed further into the soft black pad. And as Milly began to suffocate, the paw lifted back into the air.<br>\r\n<br>\r\nThe stomach of the tiny fox churned as she was lifted into the air too, and it didn't take long for Milly to notice that the grease that covered her body stuck to the surface of this giant huskey's paw. <br>\r\n<br>\r\n\"Eww...\" Milly heard Bella's voice boom from above her. As her face was still squashed and facing into the paw and with no understanding of which was was where, she couldn't see Bella with a face of mild annoyance look down upon the up-turned paw and lowering her forefinger towards Milly. \"Gross...\" <br>\r\n<br>\r\nThe tiny fox heard Bella again but she was too muffled to hear what she was saying but it didn't take long for Milly to feet the stroke of a colossal finger rub up her legs and back, her tail pushed down and soon her whole body pushed into the foot further before feeling herself being scraped onto the digit.<br>\r\n<br>\r\nLight blinded her as she was lifted miles high into the air and once again, the sensation of being moved at such velocity never felt by Milly before, her stomach lurched and spun as she was lifted into the air.<br>\r\n<br>\r\nA shadow loomed over the tiny fox once again and Milly was no longer blinded. However, her jaw dropped as did her ears as she looked ahead of her. She was now looking into the snout that loomed in front of her and she braced herself. <br>\r\n<br>\r\nAn almighty rush of air and the feeling of her body being pulled suddenly rocketed Milly as Bella took a long sniff of the greasy fox on the tip of her. The air from the tiny lungs was forced from Milly when she tried to scream, she gripped onto the thin fur on the finger with dear lift but she could feel that she was coming loose.<br>\r\n<br>\r\nThankfully, just as she was about to be sucked in the nostril of the giant hound, Bella lowered her finger away from her face as recongised the smell. <i>\"Bacon...\"</i> she said in realisation. <br>\r\n<br>\r\nMilly now wondered whether she should get the attention of Bella, a giant beast with a tiny naked fox on her finger. Milly was sure it probably wasn't a very good idea, but...<br>\r\n<br>\r\n\"What the hell?!\" Milly snapped out of her pondering as she now looked into the cold grey eyes of this Syberian Huskey. Bella's hair, the silver hair slowly collapsing over the side of her face as she looked down at the tiny fox that was spread on her finger. \"A tiny fox? A foxxy lady too! <i>How did you get her foxxy?</i>\"<br>\r\n<br>\r\nMilly wasn't quite sure what to say. This was her first real interaction with anyone in a very long time, so bad even that she struggled to remember what to say and she stuttered in front of the enormous moon-like eyes that locked onto her tiny body. Bella's voice was loud and threatening, even if she wasn't trying to be imtimidating, it was just the sheer volume booming into Milly's ears. She stuttered and stammered as she gawped at the beautiful woman in front of her.<br>\r\n<br>\r\n\"You don't talk much do you. You must've been looking for food if you got stuck in that fat. Sorry about that by the way.\" Bella winked at Milly and smirked too, but Milly couldn't see her grin below her.<br>\r\n<br>\r\n\"Th-that's OK...\" Milly managed to mutter quietly, nervously.<br>\r\n<br>\r\n\"Oh you do talk after all! What's your name little fox?\"<br>\r\n<br>\r\n\"Mill-Milly...\"<br>\r\n<br>\r\n\"Milly... <i>Milly...</i> Lovely name for such a little thing like you! How did you get in my house?\"<br>\r\n<br>\r\n\"I live here...\" Milly spoke again, the shaking of her voice was unmissable.<br>\r\n<br>\r\n\"You live here? I think you find that I live here, have done for a few months now. So, I ask again. How did you get in my house?\" Bella asked more sternly this time. <br>\r\n<br>\r\nMilly shuddered and shaked. Could she finally reveal herself to Bella now, who she really was? She hadn't killed her and she literally held Milly in front of her. There really was no option. <br>\r\n<br>\r\n\"Under your... Under the floorboards.\" Milly replid hoping that she had made the right decision in telling Bella where her precious home dwelled. She could see that Bella raised her frown.<br>\r\n<br>\r\n\"<i>Really</i>? So, how long have you lived here? Longer than me?\" <br>\r\n<br>\r\n\"Y-yes, but I'm not sure for how long. I don't even know how old I am. I don't really have any understanding of time, being me. Being this small...\"<br>\r\n<br>\r\n\"Well, that's interesting...\" Bella mumbled, more to herself. \"So what, you live of my food?\"<br>\r\n<br>\r\n\"I have to, it's the only was I can survive.\" Milly retorted honestly. She gazed at the eyes ahead, understanding that Bella was studying her quietly. The fox had no idea how Bella was taking all this news.<br>\r\n<br>\r\n\"So you're my housemate then?\" Bella said sofly.<br>\r\n<br>\r\n\"Y-yeah... I guess...\" Milly said, not quite understanding what she meant but took a guess regardless.<br>\r\n<br>\r\n\"Nice to meet you, Milly the Housemate!\" Milly was beginning to feel more relaxed as Bella casually welcomed her new mate. She smiled a little and breathed a little easier. \"Sorry to have stood on you, I'lll er... Try to avoid you next time. To be fair, you were in my way and stuck on the floor.\"<br>\r\n<br>\r\n\"Erm, it's... OK...!\" Milly said back, feeling awkward from recieving an apology yet again from the same person who nearly crushed her to death just moments ago.<br>\r\n<br>\r\n\"...And stuck in that grease. By the way, you stink of bacon now, you should really get cleaned up!\" And Milly hear a giant chuckled bellow below her as Bella couldn't confine herself. Milly lurched slightly as she was moving again, moving away from the giant cold eyes in front of her, down the long white snout and down past her giant black nostril to being hovered in front of the giant lips that lined as a giant grin. \"God I love bacon...!\" Bella slowly teased.<br>\r\n<br>\r\nMilly gasped at the sight of the giant mouth opening in front of her and the sheer heat and wind blown from the mouth of this beautiful goddess. She pushed against the finger and finally managed to rip herself free, some flicks of fur left behind. She began to motion backwards as she witnessed the long mouth open above and before her. She now gaped into the long dark cave and with it, the long sharp teeth and the impossibly long tongue slithering and sloshing in the drool, as if itself was drowing in the goop that flooded the infinitely-gigantic maw.<br>\r\n<br>\r\nShe continued to walk backwards slowly, but now the fat tongue literally dropped out of the mouth and flopped onto the tip of the finger with a loud <i>SPLAT</i> literally right in front of her, the weight of the red muscle made it flop around the sides on the finger and more and more drool slid down the length of the long pink monster.<br>\r\n<br>\r\nWith no hesitation Milly began to run along the length of the finger towards the great palm that lay before her and not long after, she heard the sound of the tongue dragging along the finger behind her. She nearly reached the palm of this giant beast as she prepared to dive, the hot tongue tripped her as Bella dragged her tongue over the tiny fox, letting her tongue naturally press down on her body and making sure she was stuck on... </span></div></div>",
            "created":1388898000,
            "id":1722469,
            "title":"The Smell Of Bacon..."
        },
        "111111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "It's not over yet...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Milly yelped as the giant wet muscle snagged her feet as she made to dive to the open palm before her, but ended up face first on Bella's outstretched finger. Milly shook her head as she felt the hot breath of Bella tingle and whisp at her fur. In a mad panic, Milly tried to grasp on to the thin fur on the finger, but in no time, she felt the ewet dripping tongue slip over her feet and legs, and the rest rolled up her bum and back, before completely laying on top of her. <br>\r\n<br>\r\nShe tried to push herself free from under the tongue but nothing was working. She yelled and yelled but it was no good, and soon enough, she felt the folded-over tongue begin to lift off from her. She thought she was safe but only for a moment, for the tongue that was reeling back into the giant dark maw of Bella, Milly found that her tiny tiny body was stuck onto the bumpy surface of the wriggling tongue. <br>\r\n<br>\r\n\"NOOOO!\" Milly yelled as she tried once again to grip onto something but she was too slow and too small to be able to save herself. Milly wept as her body rolled of the finger, her back stuck to the wet taste buds, and the tip of Bella's tongue flicked out in front of her, and begin to curl upwards as the giant huskey reeled her tongue back into her mouth, with the tiny morsel attatched.<br>\r\n<br>\r\nAll Milly could do was watch in front of her, as she lay on her back, the giant tip of the long tongue curling up slowly, with the world of the living room blurring past which made the tiny fox dizzy. It wasn't long before her dizzy trance ended as a giant drop of hot sticky saliva dropped onto her tummy, which almost winded her but it certainly nearly burned her purely from how hot it was. Which was another point. Milly looked up and saw the top row of large sharp teeth pass over her, and soon she was staring right up at the ribbed palatte of Bella's mouth. <br>\r\n<br>\r\nSpeaking of which, Belle was panting through her mouth, which was giving Milly a hard time adjusting to what was happening to her. In a mad panic, Milly quickly lurched off the tongue, which tugged at her fur like velcro, and immediately stood on her feet on the tongue. But seeing as Bella was panting through her mouth, the gust of hot air when she breathed out pushed Milly onto her front with a splat on the wet monster.<br>\r\n<br>\r\n\"Bella no! PLEASE DON'T DO THIS!\" Milly was reaching out for the sanctuary of the outside world but as Bella slowly closed her jaws ahead of her, the light dimming in the wet cave, the tongue rolled over Milly and pressed her into a tongue sandwhich..</span></div></div>",
            "created":1405746000,
            "id":1829940,
            "title":"Into Bella's Mouth..."
        },
        "1111111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Pillow...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>The hot sticky air blew out through the closing gap of light ahead as Bella hummed as she continues to press Milly into her fat slobbering tongue. The tiny fox was forced to bury her snout into the lumpy meat and soaked her face in the thick drool. All she could do is watch the light disappear and plead for mercy, but none came and the light extinguished, just as Milly was nearly launched from the dripping maw as Bella hummed a deep hum from her through not far behind.<br>\r\n<br>\r\nAll the lgith was gone from the mouth and there was nothing but darkness, the endless drool and the tongue that was now wrestling Milly. The tony fox whimpered and ground as the hot wet meat slithered all over her minisculy body and all the little taste buds rubbed deep through her fur. And now even her fur was heavyily soaked and weighed the micro fox even more. <br>\r\n<br>\r\nMilly dipped and slid wherever the tongue forced her to, mostly keeping her in the middle where the crevice down the spine of the tongue was. The drool gathered there too, bathing Milly over and over agin, and Bella was loving every minute of this. Milly could hear it as the gigantic huskey moaned at the taste of the little new-found housemate of hers.<br>\r\n<br>\r\nBella strecthed as she sucked on her new mate and decided to put her college stuff away and head to the bedroom a little early today. It was a special day after all. The huskey sighed as she wafted her thick grey mane from her face and stood on her paws and went to collect her college stuff and grinned as Milly had no idea what she had planned for her. And even the things that hadn't come to mind yet...<br>\r\n<br>\r\nMilly however was unaware of the current events, she had no idea that Bella had even stood up, but she was blinded by the stickingly bright light that burst though Bella's jaw and once again, a huge blast of hot wet air sighed from behind and before Milly could do anything at all, the jaws snappped shut once again with the hot air breezing through her legs and wafting all over her womanhood.<br>\r\n<br>\r\nMilly moaned too, even if she hadn't realised it. But she was experiencing pure enjoyment from all attention Bella was given the little fox. She couldn't do anything without the giant huskey letting her. The fox tried over and over again to wriggle free from the soaking cave but she was forced entirely by the tongue that wrapped around her, crushed her, petted her... It was a never ending battle and when Bella sucked on her, it was like all the air espacing from her lungs in an instant and the fat wet muscle crushing into her little body. <br>\r\n<br>\r\nBut with all this, the rubbery skin rubbed the little fox's lips, her things and breasts and everywhere else, lighting her excitment beyond anything she could ever dream of. And this was her first interaction with any other fur anyway! There was no doubt she was scared for her life, but in this instant, she couldn't help herself but cry out in helpess ecstasy. And it went on and on and on...<br>\r\n<br>\r\nThat was until once again, after only God and Bella knows how long, light flared into the dank cave and blinded the little fox again. But now Milly was no longer facing the exit, she was now looking where the fat base of the tongue lifted and curved down into the deep black abyss below the dangling bauble above it. Milly gulped. And she hoped to dear God that Bella wouldn't. <br>\r\n<br>\r\nBut the tongue slammed Milly into the ribbed palatte above and squeezed her there, with Milly still having clear sight into the depths of the gullet below. She watched as the sea of drool pool into the dark pit and continued in morbid curiosity to watch the throat flex and the gallons os saliva funnel down to the stomach below. Milly gulped again and before she could do anything to prevent her from falling in herself, she felt herself get harshly catapulted from the wet pink maw and out to the light and landed on something firm, and very much different from the tongue that was wrestling her just moments ago.<br>\r\n<br>\r\nMilly shook her head fratically to shake the heavy drool from her fur and shook her body in a wave motion but her fur still hung heavy. She pulled the hair from her eyes and looked around, and found that she sitting on Bella's...</span></div></div>",
            "created":1423285200,
            "id":1929261,
            "title":"The Heat Of The Moment"
        },
        "11111111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Repay the favour...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>The big soft pillow was like standing on a cloud for the tiny Milly, who was now on her feet, feeling heavy from her thick fur hanging with thick drool and feeling humiliated. Her legs were shaking from the ordeal she had just gone through in Bella's maw, feeling battered and wrestled to the nth degree. Milly glanced upwards and saw Bella sitting on her feet under her round bum, her tail curled on the bed and the elegant giantess husky looking down on her with a cute smile.<br>\r\n<br>\r\n\"Hmm, you didn't cum huh?\" Bella softly whispered as she licked her dark lips. Milly however, was confused.<br>\r\n<br>\r\n\"C-cum?\" She never knew of the concept of having an orgasm or \"cumming\" as Bella put it. She had never met another micro or anybody else that could even begin to tell her about adulthood and all the fun bits. This was the first Milly had heard the word. And with that, Bella giggled, bouncing the mattress slightly and upsetting Milly's balance on the pillow and tumbled on her backside.<br>\r\n<br>\r\n\"Yeah, silly! Have you... Oh my God, I guess you probably haven't, have you?\"<br>\r\n<br>\r\n\"HAVE WHAT?!\" Milly yelped back at Bella, getting frustrated with what she was missing out on. And when she yelped, she felt a small tinge of courage and strength in her little body, but that would soon go again.<br>\r\n<br>\r\n\"Oh... My... Well, don't you worry little Milly, my little house mate. You'll find out soon enough!\" Milly began to shuffle on her behind as Bella reached out fer her with a pointed finger, and before Milly could make a run for it, the tip of Bella's digit pushed into Milly's belly and pinned her down to the pillow, pushing her into the endless puffiness. The tip of the finger started to rub her up and down and around her belly, and not long before the finger was brushing against her bare breasts and her mound between her legs, causing Milly to twitch and flinch. Her legs bent up at the knees and began to squeeze on the finger. And she didn't know why. All she knew, was that it felt amazing. <br>\r\n<br>\r\nWith her eyes closed, Milly moaned as Bella continued to rub on her sensitive bits and while Milly tried to pull herself away from the finger as she tried to resist, Bella just pushed down on her harder, pinning her further still to her soft pillow. And then, Bella's nail scratched at Milly's swollen lips ever so gently, but it made her squeal and yelp and made her want to grind Bella's thick digit even more. Why was she feeling this good? How was Bella doing this to her? She just didn't understand but she didn't want it to stop.<br>\r\n<br>\r\nThen, Bella's finger curled under the length of her back and now a giant thumb came into play. Milly only opened her eyes for a second and then closed them tight again as she saw the approaching thumb dive for between her legs. A second or two went by before Milly felt a firm pressure press onto her womanhood, and the forefinger stoking her back and curling around her. She was being pinched at her crotch firmly but not painfully and she was being rubbed from both sides. <br>\r\n<br>\r\nMilly gripped the pillow and bit on her bottom lip, moaning and grinding at the digits that sent her senses in a spiral like never before. Her foot paws pressed and slid along the surface of the pillow as she continued to be pleasured by the giantess high above. Which reminded her amidst the chaos, that Bella was doing this to her. <br>\r\n<br>\r\nHer managed to open one of her eyes as she was panting heavily, feeling warm ooze seep from between her legs, and saw Bella looking down on her with a wide smile and Bella noticed Milly looking up at her, as Bella gave her a wink and brushed her nail on Milly's sensitive lips again.<br>\r\n<br>\r\nThis made Milly's back twist and bend without her will as Bella continued more on her sensitive lips, pushing the tip of the thumb against her and stroking her legs and back and arse. She was getting a full body workout. And with one last pinch from Bella, Milly yelped. She came.<br>\r\n<br>\r\n\"Mmm, there we goooo...\" Bella cooed as Milly screamed and twitched in absolute pleasure, fluids rushing from her hot body all over Bella's digits. Milly panted and sighed and cooed after all that, and when she felt Bella's finger leave her, she rested on the pillow and continued to pant, trying her best to get her breath back. She could hear Bella sucking on her fingers high above her and Milly frowned ever so slightly. \"So, little Milly, that was cumming. Hehe! How do you feel?\" <br>\r\n<br>\r\nMilly didn't answer back.<br>\r\n<br>\r\n\"I know exactly what you mean!\" Bella said with a giggle, once again rocking the pillow slightly as she bounced the mattress. \"But I think, you need to repay the favour. Once you get your breath back of course!\"</span></div></div>",
            "created":1429419600,
            "id":1966945,
            "title":"Cum?"
        },
        "111111111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Suddenly, lights!",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Milly continued to pant whilst she laid on her back and feeling her nerves tingle all over as she came down from her orgasm that Bella had provided for her. But why was Bella doing this to her? They had met literally not more than 10 minutes ago!<br>\r\n<br>\r\n\"Wh...Why are... You doing... This... To me...?\" Milly managed to speak midway through her heavy breathing. Bella laughed high above her and with Milly still having her eyes closed, she could feel Bella moving around on the bed.<br>\r\n<br>\r\n\"Why? My dear, I've just found out that I have a house mate that doesn't pay rent or board. And as much I love the idea of having a house mate, I don't like freeloaders. Which is what you are! And I'm guessing you can't get a job at your size so you won't be able to pay your share. So, with that in mind, this is your payment for what you owe. Enjoy it! You get the benefits of not having to work!\"\" Milly was confused by all of this. The concept of money was unknown to her.<br>\r\n<br>\r\n\"Rent? Job? What do you mean?\" Milly asked, with confusion definitely set in tone.<br>\r\n<br>\r\n\"Mm-hmm. Exactly. So, I say you can still live here if you want...\"<br>\r\n<br>\r\n\"Of course I do... This is my home!\" Milly opened her eyes and sat up and almost immediately regretted doing so. Milly gasped as Bella, still sat on her foot paws on the bed, was now naked, save for her red  tank top she was still wearing. Milly couldn't help wander her eyes to Bella's nether-regions and she knew that Bella saw her, as the giant husky giggled once again. <br>\r\n<br>\r\n\"Well, if you want to stay, then you have to play!\" Bella giggled whilst stroking her thick silver hair from her face and letting it hang over her right shoulder and down on her plump breasts still struggling to be contained within the top. <br>\r\n<br>\r\nMilly was stunned by this proposition. It wasn't like she had a choice. How could a micro like herself survive outside the walls of this place she called home? And her whole world? <br>\r\n<br>\r\n\"I-I'm staying...\" She mumbled, defeated. Bella yelped with glee.<br>\r\n<br>\r\n\"You're staying? Well that's good news little one! I think we'd make great house mates! And, to be a good house mate, you have to repay your favours!\"<br>\r\n<br>\r\n\"B-but how could I...\" Milly started but Bella interrupted.<br>\r\n<br>\r\n\"Oh don't you worry pet. We'll figure it out...\" And with that Milly gasped yet again in shock at the sheer sight of Bella raising herself onto her knees and slowly began to make her way to the pillow, her gigantic breasts swaying in majestic motion. Milly tried to move back on the pillow but her arms and legs were too weak from Bella's finger massage she was given just moments earlier. And with that, all she could do was watch as the mountainous giantess shuffle to the pillow, and eventually, the pillow and Milly were being cast in Bella's shadow as the husky pulled on the pillow and moved it so it was between her thick thighs that towered high above. <br>\r\n<br>\r\nThe tiny fox just stared up in astonishment as Bella towered high above her. She couldn't see that giantess' face, only the underside of the giant round breasts instead. But, more concerning, was the plump lips that swelled high above her. That was where Bella had been paying Milly most attention through the massage earlier and it didn't take Milly long at all for her to figure out that Bella was going would still be thinking of Milly in that area. Just not the tiny innocent foxes womanhood.<br>\r\n<br>\r\n\"Please Bella, don't...\" Milly pleaded to deaf ears, as Bella's crotch began to lower towards her...</span></div></div>",
            "created":1429533240,
            "id":1967135,
            "title":"The Favour"
        },
        "1111111111":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Millly starts to multiply! Clones!",
                "Bella Shrinks smaller than Milly!",
                "Milly Grows! From Micro to Macro! Mega Milly the Fox Giantess in the City!"
            ],
            "content":"<div class=\"\"><div> <span>\"Please Bella, don't...\" Milly pleaded to deaf ears, as Bella's crotch began to lower towards her.<br>\r\n<br>\r\nCloser and closer Bella grew until she stopped. Strange sounds could be heard from outside as if from the sky.<br>\r\n<br>\r\nThe sounds grew louder and louder then abruptly stopped. Then a blinding light came shining through Bella's window. The light grew steadily more intense and both girls had to sheild their eyes.<br>\r\n<br>\r\n\"What the heck\" exclaimed Bella.<br>\r\n<br>\r\nThe light lasted for what seemed like several hours but really was only a few minutes then it started to slowly fade before disappearing completely. A few more strange sounds were heard briefly then they stopped.<br>\r\n<br>\r\nOnce the girls were both reasonably certain the light was gone they began to open their eyes and wait for their eyesight to readjust.<br>\r\n<br>\r\nOnce their eyes had a chance to readjust they both looked around. Nothing seemed different at least not yet.<br>\r\n<br>\r\n\"Now then where were we\" began Bella until the two noticed something happening.<br>\r\n<br>\r\nThat something that started to happen was..<br>\r\n</span></div></div>",
            "created":1429780860,
            "id":1968183,
            "title":"Stange Lights"
        },
        "12":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                " Where The Dreams Come To Die",
                "A Little Life",
                "Story 3...",
                "Story 4...",
                "Story 5..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716185,
            "title":"A male micro furry..."
        },
        "121":{
            "author_id":"carlosanchez",
            "author_name":"Hazari",
            "choices":[
                "Avian...",
                "Reptilian...",
                "Mammal..."
            ],
            "content":"<div class=\"\"><div> <span>Since the beginning the humans are maked questions abot the  time and space, how this things started and when it will end.<br>\r\n<br>\r\nThe answers for all answers and more can be located  far beyond of the infinte, the  Supreme House of the Eternity, where the Master Beings rule in secret all the multiples variations of the multiverse.<br>\r\n<br>\r\nThe Supreme House of the Eternity or the Fate how the inferior beings who work there call it, was a infinite dimension with portals to every point in space and time. Was the work of the Fate control every great moment of the Multiverse accord the Master Plan and every member of this noble organisation have a task. Starting with the Master Being wwho start the universes and create his cosmic laws, descending for classes each one more small and weak that the immediately supperior tofinally come to the most inferior class of all,  the Observers.<br>\r\n<br>\r\nThis infinitely vast group was conformed for recruits from the multiverse, who choose reborn in this dimension after their deaths.When they unite to the corp discover that their originals forms were gone forever and that their new bodies were designed for resemble the small creatures of the spacetime sector assignated for each one of them.<br>\r\n<br>\r\nThe mission of a Observer was overview the life of  determinated keystone persons and interfere in very subtle ways for make them unconsciously follow the Master Plan, for that task they have a few of powers over the physical reality . Normally an Observer is always happy with this eternal job, what can be better thaat work for the Tate and literally make the history happens.<br>\r\n<br>\r\nThat question was in the head of you that after 800.000 years of continous work you was starting to be tired of this job and that was a problem, one can't return to the universe with the  knowledge of how works the Fate, that information was forever imprinted on him for al eternity.<br>\r\n<br>\r\nTraiting of forgets that thoughts he nearly forget overview the pretty girl who was his assignation, for 18 years she was under his guard, making her the best person possible and sadly that was his principal problem with the Fate, they never tell you the final proposite of you mission, always give you simply tasks like don't cross that street, don't meat that person and so on  The worst part was when you learn how your person have to die or when your precious kid it's destined to be killer oo a tyrant.<br>\r\n<br>\r\nFor his hapiness this girl looks destined for be a great person, after all she is so precious good adn sexy...<br>\r\n<br>\r\nSuddenly a mysterious voice orders you to stop your thoughts a observer never will fall in love. You say, Sorry Inspector was a simple mistake.<br>\r\n<br>\r\n<i>The Eternity never make mistakes.</i>- responds the incorporeal voice in a mysterius way<br>\r\n<br>\r\nTo the same time a memo come from the Office of Rightful Decitions, the order say:<br>\r\n<br>\r\n<b>Person in specific space time position, negative apparent movement for comparation to local area in specific time. Event provocate for second person in Immedietely future have effect in life functions of  first person. Life Functions of first person end in immediatety future after Event provocated for second person. Second Person change position of body of first person in inmediately future after end of life functions...</b><br>\r\n<br>\r\nYou can't end  of read the memo what in cold and impersonal words order you to leave to your girl to be murderer. Your reaction was the anger, was this a cruel joke, a test or was simply a punishment, what ever was he don't will permit to his girl die of that way and even if that condemm you to a eternity of suffer you will save to your precious girl.<br>\r\n<br>\r\nWith that desition in your heart you decide use all your powers for cruise the portal to the position in the space-time whrere your precious girl await be rescued and before a second happen you has crossed the interdimensional barrier revealing your 1 inch body to the phisical reality.<br>\r\nFor your luck you love one its here in all his glory, sadly for you she only can see a micro...</span></div></div>",
            "created":1422594000,
            "id":1925458,
            "title":"STORY START: Where The Dreams Come To Die."
        },
        "122":{
            "author_id":"lonevagabond",
            "author_name":"Aimless Vagabond",
            "choices":[
                "Somebody walks in...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>\"...OK guys, go and get your lab stuff and remember to put your protection on!\" Mr Steves finished, shouting over the crowd of pupils getting on to their feet. The teacher, a 6'8\" stallion by the name of Edgar Steves was teaching his science class today and he busied himself with his own lab equipment.<br>\r\n<br>\r\n\"Move over short stuff, hehe!\" Drax snorted as he shoulder barged the fox that was nearly a foot shorter than him.<br>\r\n<br>\r\n\"Shut it Drax, I'm not short!\" Ben retorted, turning to face the wolf bully standing in front of him, nearly a foot taller with Ben having to nod his head upwards to look into the brown eyes baring back at him. \"You're just tall you big jerk.\"<br>\r\n<br>\r\n\"Haha, don't get upset little Bennie, you'll grow up one day. Now move aside...\" and Ben was shoved a few steps to his right as Drax shoved him away, his grey fur swishing in the breeze in a cool way that caught a lot of attention and reached for a beaker and wandered back to his own desk, chuckling as he did. Ben sulked as he watched the big built wolf wander back to his desk, nodding to the other classmates in the room. Drax had been picking on him all week, all month and pretty much the entirety of his school career, even going as far back as the first couple of years at nuresry. They had known each other for so long. Been friends, fallen out and become enemies, tastes and likes changed and they've become further and further apart as they were getting into their mid-teens. It was strange how they used to be good friends at one point, and just the other day, Drax had Ben shoved against the locker and threatening with a thorough beating. Ben had only gotten out of that mess simply because an older, bigger student had walked in on them, and Drax immediately backed off, smirking as he left Ben a whimpering mess.<br>\r\n<br>\r\n\"Ugh, don't listen to him Ben, he's a big jerk, like you said.\" Ben turned once again to the comforting sound of his friend's voice. He was now looking at a cute otter looking back at him with a frustrated face, Beth. \"Look, we've just gotta do this experiment and then it's our lunch break and we won't have to see him til Monday.\" <br>\r\n<br>\r\nBen nodded, frustrated that Drax had yet another laugh at his expense, it must've been the tenth time this week at least. Thank God it was Friday, Ben thought to himself with a huff. He grabbed a beaker himself and and a few of the chemicals they were using today and Beth got the rest, both of them ignoring Drax's attention seeking banter he was offering the rest of the class, whether they wanted it or not. <br>\r\n<br>\r\nBen didn't really care what they were making, he just followed Beth's instructions, and every now and then getting a jab from Drax from across the room and Ben radiating his hate. <br>\r\n<br>\r\nNot concentrating, Ben knocked a beaker over that thankfully had been emptied just moments earlier, only getting a few drops of the contents on his fur without noticing. <br>\r\n<br>\r\n\"Hey, come on Ben! Wake up will you?\" Beth snapped. \"We're only here for another ten minutes, just don't knock anything over!\" Beth hinted strongly at the tripod holding a beaker of boiling chemicals over a roaring bunson burner. She nodded and straightened her Black Rabbeth tee and continued with her work.<br>\r\n<br>\r\nAt the end of the lesson, Ben learned nothing but the fact he hated Drax even more, especially when he wolf whistled at Beth before she turned to leave the room with Ben following close behind. They had almost made it to the canteen before...<br>\r\n<br>\r\n\"Aww crap, I left my homework planner in the classroom...\"<br>\r\n<br>\r\n\"I'll go and get it,\" Ben muttered. \"I think I left mine in there too.\" He quickly thought up an excuse. He really liked his friend and had done for a long time, and he would often find excuses to do things for her. Beth, was clueless to Ben's liking for her and continued her life in bliss, or so it seemed to Ben. He always wondered whether she liked him too, but Ben was too shy to ask or ever to bring it up. There had been many oppurtunities, but finiding the courage in him to ask or say anything at all was too much. So, he turned and sulked back to the science labs. <br>\r\n<br>\r\nHe walked through the door and saw Beth's diary on the desk. He walked to the desk and picked up the diary, just when his arm started to sting where the contents of the beaker had splashed on him. And then, eveything grew larger all around him, even his clothes and backpack...</span></div></div>",
            "created":1422766800,
            "id":1926568,
            "title":"STORY START: A Little Life"
        },
        "1221":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Drax",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>...But who?</span></div></span></div>",
            "created":1426050000,
            "id":1947076,
            "title":"Somebody Walks In..."
        },
        "12211":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Drax spots him...",
                "Drax doesn't spot him...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Before Ben's clothes slumped on top of him, the tiny fox thought quickly and dived out of the collar of his sweater and landed on top of the pile of clothes. He huffed in relief and laid on his back, wiggling his bare paws and noticing he was now naked, covering himself instinctively and then realising that that was a little bit foolish.<br>\r\n<br>\r\n\"So that's why we have to wear gloves in the labs...\" Ben thought to himself as he looked at his arms where the liquid had splashed on him. \"How the hell am I going to get out of this?\" He turned to face the door that seemed far away now and sighed. That would be a good start he felt, and even though it seemed like nearly half a mile away, he began his sprint.<br>\r\n<br>\r\nHe ran under the tables and chairs that towered all around him like a city with many-a-skyscraper and shortly he was nearing the door when he watched the door suddenly swing open and Ben halted in his tracks and gasped as he watched the gigantic creature step into the room with a loud thud, shaking the floor enough to send the micro fox onto his hind with a bump.<br>\r\n<br>\r\nBen watched with his mouth hung open as his long time enemy stepped into the room and letting the door close behind him. Drax walked in with his bushy tail sweeping through the door before it clicked shut and sighed. \"Detention, seriously? I just pushed the little shit out the way is all...\" he huffed. Ben watched as the colossal wolf yawn and take a step to his desk, thankfully away from the tiny fox who was sat stunned by the sight before him. He just watched as the evil wolf walked on by, his soft bare paws pressing into the floor with each booming step and Ben gulped at the thought... No... No, he couldn't think about that, and the way the jeans held tight to his muscular form in the same way his dark tee held tight to his big torso. He waited and waited and he finally got up once he knew Drax hadn't seem him and began to run again.<br>\r\n<br>\r\nHe was running for what seemed like a few minutes, getting closer and closer to the titanic door ahead when he heard Drax speak again. And this time, Ben's fur stood on end too when he stopped on his heels and froze.<br>\r\n<br>\r\n\"What the hell is this...? Are they... Ben's clothes...?\" Ben turned to see his long-time enemy begin to walk to his pile of clothes that he had left behind. \"..The fuck is he doing?\" Ben watched the wolf walk up to his clothes and pick them up, shaking them and then dropping them on the floor. \"Is he fucking that slut? Game on, man!\" Drax laughed as he wandered back to his desk, Ben feeling the thudding vibrations through the floor less and less as the giant wolf walked away. Ben sighed and didn't think twice about waiting around. <br>\r\n<br>\r\nHe took off and headed to the door again but it wasn't long before Drax changed his mind. \"Fuck this, I'm not staying in detention...\" Ben heard Drax mumble and suddenly he froze once again. He didn't turn to look behind him, he just looked around for somewhere to hide but he was now standing in a clear area of the floor, in between the door and tables, in clear sight. He was panicking now, his heart was beating hard and fast, especially now that he heard and felt Drax's thuddering footsteps getting closer... Until...<br>\r\n<br>\r\n\"Holy shit...!\"</span></div></div>",
            "created":1426050000,
            "id":1947098,
            "title":"Drax"
        },
        "122111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Continue...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Ben made himself turn on the spot, and now faced the towering teen wolf that took one more step closer towards him, watching the soft pink pads on the sole of the gigantic paw that pushed down onto the floor. He gulped as he looks up the thick legs and up the big torso up to the stunned face of his enemy, Drax. <br>\r\n<br>\r\n\"...Ben? Is that really you down there? You're so small!\" Ben felt like a joke... \"You're really short stuff now!\" There it was. Ben felt as stung as he was afraid right now. \"How did you get like this? Was it that stuff in the beaker? Didn't you put your gloves on? Oh my God, this is gold!\"<br>\r\n<br>\r\nBen began to slowly tread backwards away from the laughing wolf, he could tell this was not going to go well for him. The sheer size of his enemy was just insane and the fact that the wolf had spotted him... He didn't know what to expect next, nothing good that was for sure.<br>\r\n<br>\r\n\"And nobody around... Nobody saw you did they?\" Drax said in wonderment and Ben gulped again as the wolf began to grin an evil grin. \"Interesting... I might just have myself a little toy fox to play with... How about that itty bitty Bennie? Wanna be my little toy?\"<br>\r\n<br>\r\n\"FUCK NO!\" Ben yelled up, making the wolf laugh at him. <br>\r\n<br>\r\n\"Ha, I don't think you have a choice in the matter little guy, this is gonna be fucking sweet...\" And before Drax could do anything, Ben yelped and took off sprinting, but he didn't get far before he heard Drax laughing again far above him and he watched a shadow form all around him, stretching over the horizon. \"Oh, it's so easy...\" Ben stopped and turned and looked upwards and yelped a loud cry. <br>\r\n<br>\r\nAbove him, the unbelievably gigantic sole of Draz hovered above Ben like a ship in the sky. The tiny fox could see all the wisps of fur between the pink puffy pads of the paw above, it was insane! How could this ever happen to him? Ben began to cry. His enemy could crush him on the spot and no one would ever know... And to die like this? It was a nightmare! <br>\r\n<br>\r\n\"DON'T YOU DARE DRAX!\" Ben yelled up to the wolf, not sure whether or not Drax could even hear him but he was going to try one way or another. <br>\r\n<br>\r\n\"Haha, dare what? This?!\" Drax laughed and Ben yelped as the colossal sole that loomed over him lowered towards him and the world around him got darker. <br>\r\n<br>\r\nBen thought quickly on his feet and pounced to his right side, and diving and he felt the wispy tip of his tail brush against the side off Drax's paw as it landed and flattened on the floor just behind the tiny fox. He rolled right back onto his paws and ran again, and between Drax's paws he went at high speed. Or so it felt to him. He ignored that Drax laughed down at him as he watched his little pet run between his paws quite slowly, but looked like the tiny being was putting a lot of effort in getting away.<br>\r\n<br>\r\nTo Ben, he felt like he was making great headway but he was still surprised just how long Drax's paws really were and the ever-looming shadow was getting more uncomfortable for him by the second. Anybody's else's shadow, mostly, would be welcoming in a way, but Drax's was a thing of impending doom. Especially when Drax lifted one of his paws again, and on Ben's left, the paw that had nearly crushed him before took off in the air like a weird plane taking off, it was an incredible sight to see, but a thing of awesome power and destruction and Ben desperately didn't want to be found underneath it, but unfortunately, Drax was not in his favor.<br>\r\n<br>\r\nBen continued to run and looked up, just as Drax had turned to face Ben again and began to crouch to his knees, laughing as he did. \"Where are you gonna go man? Ain't no one here to save you, you're my little rodent now...\" And again, he laughed and again, Ben looked behind him to see Drax's paw reached for him, finger stretching forward at him. He yelped and quickly changed direction and ran under a stool and behind the leg. \"I know you're there dude, haha!\" Ben scrambled and luckily, he just managed to dive between Drax's fingers and able to continue running, with him dodging Drax's gripping fingers, the nails scratching into the floor as they tried to grip him.<br>\r\n<br>\r\nBen wasn't paying attention, he just ran as fast as he could as soon, he found himself boxed into a corner of the room, the two walls joining in a right angle and soon, a shadow began to rise on the wall ahead of Ben, and that familiar booming sound returned.<br>\r\n<br>\r\n\"You're fucked now itty bitty Bennie...\" Drax said with a sense of graceful state of ownership. Ben turned and faced Drax who, with his hands on his hips, lifted his paw off the floor once again with an evil laugh and began to slowly hover it over Ben, covering him in another layer of his shadow,<br>\r\n<br>\r\nThe tiny fox quickly looked around but there was nowhere to go, the paw that lowered towards him was simply too large in all directions. He weeped as he looked up again instantly the warm pads of the ball of Drax's paw pressed against his face, knocking the fox over giving him time for one last cry for help before the paw landed on him and the floor, pushing down on him slowly.<br>\r\n<br>\r\n\"Fuck yeah...\" Drax muttered to himself, feeling himself get hard at the thought of having Ben under his paw, quite literally. He groped at his crotch as he began to slowly lift his paw, and lower it again, without ever taking the paw off the tiny being.<br>\r\n<br>\r\nBen wanted to scream as loud as he could, the warm leathery flesh pushing down on him and squashing him onto the floor meant he never had the chance. He couldn't move his arms or legs at all, he couldn't breathe and he was near suffocating completely. And worse is that he felt Drax begin to tease him under there too, feeling the weight of the paw getting heavier and lighter... Heavier and lighter... Playing with his new toy...</span></div></div>",
            "created":1426050000,
            "id":1947113,
            "title":"Drax Spots Him..."
        },
        "1221111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Go to the next class...",
                "Go to lunch...",
                "Head home..."
            ],
            "content":"<div class=\"\"><div> <span>The thick air in Ben's tiny lungs were inflating and deflating every time the heavy paws pressed on him, and raised ever so slightly creating a compressor effect on his lungs. He tried to yell and scream but it was continously being muffled by the thick leathery pads of Drax's paw that continued to push down onto him. <br>\r\n<br>\r\nIt was dark, dark everywhere. There was no chance of a glimpse of light as the tiny fox was completely surrounded by his enemy's paw and it didn't help that he was so insignificantly tiny. He was nothing more than a speck to the giant teen-wolf bully that chuckled to himself at the very idea of having his punch bag, his old friend at his enormous paw. <br>\r\n<br>\r\nBen even tried to push the paw off of him but it was no use, he was going nowhere. But it wasn't too long before the paw lifted off him, blinding him for a few seconds and now he could hear Drax chuckle much more clearly. And much more loudly...<br>\r\n<br>\r\nBen rubbed his eyes and looked up and instantly his tail curled between his legs as he laid on his back, staring up at Drax, now bent to his knees and looking down upon him with a monstrous grin.<br>\r\n<br>\r\n\"Now that was pretty cool... I don't think I'll get used to having you under my feet. But I guess we have the rest of our lives, right? Hahaha!\" Drax roared a laugh so evil that Ben shot to his legs and began to run with tears in his eyes. \"Oh, you think running will help you? Bennie, Bennie, Bennie... Let me help you understand...\" And soon Ben was running with a shadow looming over him once again. He instantly got a vision in his head of Drax's paw hanging over him again, but he snapped his head round whilst running as fast as he could, only to see Drax's hand outstretched and reaching for him.<br>\r\n<br>\r\nThe tiny helpess fox yelped as he watched the thick furry digits reach for him and it only took him a tiny hole in the floor to trip him up, and soon Ben was sent sliding on his front on the floor. He groaned as he stopped, his head spinning from tripping and hitting his head on the floor, but he hadn't forgotten his predicament. <br>\r\n<br>\r\nHe tried to get back to his feet, but Ben's paws were snatched from under him, once again sending him on his front, but this time he was pulled from his ankled and hoisted into the air. <br>\r\n<br>\r\nFurther and further the tiny fox was lifted in the air, and it took Ben a few seconds for his brain to adjust to being upside down so rapidly, and now Drax was standing up, sending Ben's head into a frenzy. BUt upside down he was, and further he was lifted.<br>\r\n<br>\r\nBen looked down his body, or upwards, and could see the tips of Drax's giant fingers pinching his ankles together and the paw that was curled round as the thumb and forefinger continued to hoist him upwards. He looked around to see Drax's dark tee scaling up his chest and it wasn't long before he was hanging right in front of Drax's giant round amber eyes.<br>\r\n<br>\r\n\"This is definitely going to take time to get used to, I'll give you that...\" Drax said seemingly honestly to his tiny captor. \"But like I said, we have the rest of our lives, huh? Haha!\" Drax laughed at Ben flailing in his grip that he had on the tiny pet.<br>\r\n<br>\r\n\"Drax you asshole! Put me the fuck down! This isn't fair!\"<br>\r\n<br>\r\n\"Life isn't fair though, is it Ben? Survival of the weakest and all that! And now, I think it's time to...\"</span></div></div>",
            "created":1428296400,
            "id":1960080,
            "title":"Hanging About"
        },
        "12211113":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "In my pants...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>\"...head home, whaddya say Bennie? Hehe. I'll just say I'm ill, the fuck are they gonna do about it...\" <br>\r\n<br>\r\nBen realised that Drax was talking to himself more than to him, and as he continued to be dangled upside down and looking at the monstrous eyes that frowned in on him as he grinned at his little prize, the tiny fox continued to flail in the grip Drax had on him. <br>\r\n<br>\r\n\"You asshole Drax, just put me down already!\" Ben yelped at Drax, only to get a laugh from the giant wolf, the bass notes of his chuckle rumbled his tiny body. This frightened Ben much, much more. <br>\r\n<br>\r\n\"Maybe later. But for now, we've gotta get out of here..\"<br>\r\n<br>\r\n\"DRAX YOU-\"<br>\r\n<br>\r\n\"Dude be quiet will ya! You'll get us both caught! I need to get us out of the school so we can go home, and I can get to play with my new little toy. That's you itty-bitty-Bennie!\"<br>\r\n<br>\r\n\"...Come on Drax, you can't be serious man!\" Ben was literally panicking now, he believed that Drax was wouldn't go through with actually keeping him, but now he was really starting to believe it. His tiny body began to shake in fear. And it only got worse when Drax leaned in closer so his right eye was now mere feet away from Ben who started into the round disc that was the pupil, like a black hole he'd never return from. <br>\r\n<br>\r\n\"Oh, I'm serious Ben. Dead serious. Now, I'm going to sneak you out, so where should I put you, huh?\"</span></div></div>",
            "created":1429419600,
            "id":1966923,
            "title":"Head Home"
        },
        "122111131":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Goes home...",
                "Goes to an acquaintances...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>\"I suppose I could put you in my pocket, but where's the fun in that? No, I need somewhere extra <i>special</i> for you little Bennie!\" Drax laughed once again, sending Ben's tiny body in a flurry of vibrations and jostling from the fingers that held him by his ankles. \"Y'know, I have been wondering how you taste. For a little tiny guy, you do look fit to be a snack for this God, don't ya think?\" Drax growled with a sinister tone. If Ben could turn white, he would have.<br>\r\n<br>\r\nDrax moved his little body away from his eye and down his long snout and finally, Ben was staring at Drax's thick black snout, the leathery texture dry and coarse. But that soon changed as Drax's giant thick tongue swiped across his lips and along his muzzle, leaving a trail of gooey drool that reflected the classroom's light. Ben gulped.<br>\r\n<br>\r\n\"Don't do this Drax!\" Ben yelped and flailed.<br>\r\n<br>\r\n\"No? You don't want to go in here?\" Ben could only watch as Drax's giant maw open and closed and waved as he spoke, he could see the long tongue wriggling and flapping around in there, glistening in the dark wet cave. And things only got worse when Drax slowly opened his maw and stretched out his tongue before the little micro. Ben could see right into the dark cave, the wet pink rippling and waving naturally as Drax stretched open his jaw further, and Ben's tiny eyes scaled along the length of the thick tongue that stretched out before him and he could see right to the back, where a dark pit laid underneath a dangling ball of flesh.<br>\r\n<br>\r\nAs Ben was upside down through al of this, he could see very clearly, the ribbed palate that scaled all the way back too. It was an odd sight to see, but not any worse than the sharp teeth and fangs that rimmed the whole mouth. And the lakes and lakes of drool that washed around in there... Ben could easily throw up.<br>\r\n<br>\r\n\"NO! DRAX YOU SICK BAST-\" Ben yelped as he was suddenly let go and his tiny body fell through the empty air for only a moment, before his head and then his front landed with a splat on something hot and sticky. Ben groaned as he lifted his head and he quickly clicked on that he was now lying on Drax's runway-like tongue that was slowly starting to pull back into the maw behind. Quickly, without hesitation, Ben dived for the air and leapt off the meaty springboard and once again, fell through the air. <br>\r\n<br>\r\nHe heard Drax say something, but with the rushing of the air blasting through his ears, he didn't make out what he said. Ben had no idea what to do now, he was diving through the warm air, falling down the length of Drax's incredible chest and abdomen. It was like having jumped off the top of a skyscraper and watching the the building as you fall. But now Ben was looking up (or down) towards the floor, down the rest of Drax's abs, waist, legs and paws and it was an unreal sight to see, but he had a bigger problem. <br>\r\n<br>\r\nHe was going to hit the floor. He had no parachute and there was nothing to land on. But something caught his attention completely. He could see, even through all the blurriness from everything passing by, Drax's crotch was getting bigger and bigger quicker than Ben was falling. He could see a giant hairy hand that belonged to Drax lift up the bottom of the tee and with the hook of a thumb, the pants were being pulled open from the waist.<br>\r\n<br>\r\nBen couldn't scream, the air was taken from his lungs and he was kicking and grabbing at the air, trying to change his path that he was currently on, but he was destined to continue.<br>\r\n<br>\r\nWith Drax pulling open his pants from the waistband, Ben could see darkness and not much else, but he knew exactly what would be waiting for him, but he had no idea just how big. Seeing as he had no choice, Ben closed his eyes and waited for the inevitable.<br>\r\n<br>\r\nNearly a minuet went by before Ben's vision in his eyelids went darker and darker before...<br>\r\n<br>\r\n\"OOOOUMFPH!\" Ben landed with a hard thud which made him bang his head harshly against Drax's hardening meat. Ben shook his head and rolled on to his back, his vision clearing ever so slowly. And soon, he felt that familiar sense of dread once again as he was now looking way up Drax's torso as Drax himself looked down upon him with a gigantic grin.<br>\r\n<br>\r\n\"Yeah, this works much better little guy! Enjoy my epic dick for the rest of your life...\" Ben screamed for mercy as Drax teasingly slowly closed the waistband, shutting off light from Ben.</span></div></div>",
            "created":1429535400,
            "id":1967143,
            "title":"I'll Take You"
        },
        "13":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1...",
                "Story 2...",
                "Story 3...",
                "Story 4...",
                "Story 5..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716186,
            "title":"A female macro furry..."
        },
        "14":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Story 1...",
                "A Giant Alien Anthro Hunter",
                "A Giant Alien Anthro Couple",
                "Story 4...",
                "Story 5..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716169,
            "title":"A male macro furry..."
        },
        "141":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Choice 1",
                "Choice 2",
                "Choice 3"
            ],
            "content":"<div class=\"\"><div> <span>Berkeley from Bad Dog the animated series as he is also known as the Doggy Dough Boy was a 112 ft tall fat gigantic dough monster with a gigantic appetite for food especially greasy fast food and delicious sweets along with an appetite for destruction.<br>\r\n<br>\r\nOne day the Doggy Dough Boy was heading towards downtown New York City as he was leaving a path of destruction behind him whilst eating everything in sight.<br>\r\n<br>\r\nMeanwhile in downtown New York City it was but a normal day for everyone until the sound of giant footsteps could be heard as the Doggy Dough Boy was now in downtown New York City as everyone who was in the area started fleeing for their lives as the doggy dough boy started terrorizing everyone whilst eating everything in sight.<br>\r\n<br>\r\nOne building or skyscraper after another was currently being devoured by the Doggy Dough Boy himself as he was already devouring whatever was in his path as he left nothing standing.<br>\r\n<br>\r\nThe Doggy Dough Boy made his way over to Madison Square Garden as he... </span></div></div>",
            "created":1533598380,
            "id":2529982,
            "title":"Story 1..."
        },
        "142":{
            "choices":[
                "The Giant Anthro gets only the tiny couple for now...",
                "The Giant Anthro gets all of them...",
                "The Giant Anthro, well you choose..."
            ],
            "content":"<div class=\"\"><div> <span>Amber Wilson is seductively walking over to her nude husband of fifteen years, dressed in nothing but a sexy, low cut bathrobe. Adam Wilson excitedly sits in the outdoor, second floor Jacuzzi, watching his sexy thirty five year old wife slowly undoing her rob, and tossing it to the floor, revealing her nude body to him. Adam lustfully looks over his gorgeous wife’s completely nude body, and loves every inch of her. He loves her smooth, bare, lightly tanned skin, her long, curly, strawberry blond hair that comes down to the crack of her lovely round ass, and he loves her emerald colored, cat like eyes. He also loves to watch her perky, yet natural grapefruit size breasts as they bounce around a bit. Her body is something that a Playboy Playmate would envy. Amber too is excited about making love to her handsome husband. She loves his muscular, well-defined body, his clean-shaven face, his hairless chest, and his lovely brown eyes. As she gets into the hot tub with him, they passionately kiss, and embrace each other’s nude bodies. Amber runs her fingers through his well-trimmed, lit-brown hair, and over his smooth, bare, light tanned skin. As they embrace, Adam asks her, “Before we get too far, where are the kids?”<br>\r\n<br>\r\n “They are down stars watching a popular movie that has just been released. We should be uninterrupted for an hour or so, but just in case, I locked the door,” Amber responds.<br>\r\n<br>\r\n As they kiss, they both quickly remember how they first met and fell in love during their junior year of college, where Adam was a starting quarterback of his college football team, and Amber was co-captain of the college cheerleading team. After graduating, they married and had three kids, two hot daughters and a cute son. Their daughters are twelve-year-old Emily, and nine-year-old Sara. Their son is eleven-year-old Kevin. Their attractive eleven-year-old niece Rachel Wilson and their cute thirteen-year-old nephew David are also spending the night, watching the movie. While the five kids watch the movie downstairs, the hot naked couple begins to make love upstairs, in the outdoors, in their hot tube. <br>\r\n<br>\r\n The Wilson home is a two-story house located near the United States and Canadian border, and tall, lush trees are everywhere. A small town is located ten miles away, along with a large blue lake, some camps, and some mountains. The three nearest homes are a half mile away, so curtains are rarely used. As they kiss and make love, Amber moans as her husband’s rock hard cock enters her wet pussy. Five minutes into their passionate lovemaking, the nude couple notice small vibrations around them. They believe them to be small Earthquakes, nothing more. So they continue, oblivious to the giant alien anthro creature that has seen them, and is going to collect some great specimens, a breeding pair of humans, maybe the kids as well. As the giant danger approaches, one of the young girls has decided to go upstairs to take a shower, and her curtains are wide open.</span></div></div>",
            "created":1424754000,
            "id":1939227,
            "title":"STORY START: Giant Alien Anthro Hunter"
        },
        "1422":{
            "choices":[
                "The twelve-year-old daughter Emily?",
                "The eleven-year-old niece Rachel?",
                "The nine-year-old daughter Sara?"
            ],
            "content":"<div class=\"\"><div> <span> Adam and Amber are still going at it, oblivious to the fact that two huge, curious, and cruel monsters hear their tiny, squeaky lovemaking moans of pleasure. Not helping the tiny human couple is the fact that they are in an outdoor hot tube, the sun has gone down, and a bright outdoor light is shining directly on them. The first alien creature, which looks like a giant, one-hundred foot tall, humanoid shaped, reddish colored male fox, is walking towards the sounds, curious about what he will find. The fox’s name is Ralf, and he along with his stepsister Cleo, a giant hundred foot tall golden female cat came to this world to collect some unusual specimens for their high school science class. They heard about this world from their close friend, a humanoid shaped lizard teenage boy named Lenny, who is waiting for them on-board their personal star ship, which is orbiting two hundred miles above them both. Their ship is invisible to the naked human eye, or radar. Lenny heard about this world from his father, a space pirate. <br>\r\n<br>\r\n If the two step-siblings and Lenny were human, they would all be considered nerdish looking, fifteen to sixteen year old thrill seeking brats from wealthy crime families. The three of them came to this world to collect some exotic lifeforms they heard about called humans. The three of them are hoping that by showing them to their class, their biology class instructor, a one hundred and thirty foot tall male gorilla named Mr. Kong would give them all A’s for the semester, instead of F’s. <br>\r\n<br>\r\n As the two giants carefully walk through this miniature forest, where only the trees are as tall they are, they see to their amazement a large, two-story dollhouse in front of them. They both quietly walk over to the house and see the source of the squeaky noise. They see two naked, three-inch tall, nearly hairless, pink skin apes sitting in a warm bubbling cup of water mating. “They both look like miniature versions of slavers, the race we liberated ourselves from, and wiped out three hundred years ago,” Ralf says softly.<br>\r\n<br>\r\n “That can’t be, the slavers are extinct now, and they were all our size, not tiny like them,” Cleo says whispering.<br>\r\n<br>\r\n “Well they sure do look like them, just miniature versions of them, and they both are extremely nice to look at. I wonder how they taste” Ralf asks softly?<br>\r\n<br>\r\n “I don’t know, maybe like chicken? Any ways, a healthy breeding pair of miniature slavers or as they call themselves, humans would defiantly get us an A and make us rich. Imagine, our former masters are now our tiny slaves,” Cleo says purring. All of the various giant anthros members of their huge world are bisexual, and omnivorous.   <br>\r\n<br>\r\n The two horny, hungry, and greedy siblings slowly walk towards the dollhouse. Ralf opens up a glass specimen jar, getting it ready. Cleo quickly, yet gently grabs the tiny nude human couple as they are about to orgasm together. Amber and Adam are too busy feeling the rush of their joint orgasms to feel themselves being lighted out of the water, and up into the air, than placed inside a glass prison. A minute later, they both stop moaning and realize that something is wrong. They notice they are surrounded by glass, and they see some giant animal eyes looking them over. They both naturally panic, and attempt to hide their nudity from the giants hungry eyes. Not wanting their two lovely specimens injured, or stressed, Ralf places them both in suspended animation. Adam and Amber are now frozen in time together, until they are released. Ralf secures the specimen jar, and hands it to Cleo.<br>\r\n<br>\r\n They are about to walk away, when Ralf notices a light coming on in one of the upstairs bedrooms. Interested, Ralf kneels down and sees a juvenile miniature human walking into a bedroom. “Holly crap, there is another one, a younger female, and she is getting ready to undress” Ralf says excitedly but quietly, as he gets a hard on.<br>\r\n<br>\r\n Cleo Responds, “She is probably the offspring of these two. Is she hot?”<br>\r\n<br>\r\n “Hell yes and she is beginning to undress,” Ralf says softly. <br>\r\n<br>\r\n Before we go on, who is the tiny undressing girl?</span></div></div>",
            "created":1425790800,
            "id":1945440,
            "title":"The Giant Anthro siblings get them all."
        },
        "14223":{
            "choices":[
                "To check out a cheerleading camp or a nudist camp for youth?",
                "Another house nearby?",
                "To go back up to the ship?"
            ],
            "content":"<div class=\"\"><div> <span> Sara walks into her upstairs bedroom, and closes the door behind her, paying no attention to her bedroom window. If she had, she would have seen a huge k9 eye watching every move she makes. With her curtains wide open, Ralf could see everything. Sara walks over to her dresser and grabs a pink low-cut bathrobe, putting it on her bed. She then takes off her shoes and socks, tossing them to the side. She takes her t-shirt, lifting it up, and over her head, tossing it to the side as well. She unbuttons her blue jeans, lowers them to her bare feet, and kicks them away. She reaches back to unsnap her white training bra, and it falls to the ground, reveling her budding young breasts to the horny giant. Finally, she bends over a bit to remove her pink bikini style panties, which gives the giant a good view of her hairless pussy, and her fine round ass. They fall to her bare feet, and she kicks them to her side as well. Now completely naked, the young girl is unaware that a giant male fox is studying every part of her now exposed body. Sara grabs the bathrobe, puts it on, and walks naked into the adjoining bathroom. Ralf only needs to move to the next window to see the show continue. <br>\r\n<br>\r\n Sara walks over to the shower and turns on the water. The curtains are still wide open, so Ralf is still getting a good view of the tiny blonde haired girl. He watches as she removes her bathrobe, and it falls to her feet. As Sara steps into the shower, she cannot shake the feeling that she is being watched, but that is silly she thinks to herself as she closes her see through shower curtain behind her. As she slowly washes her nude body off, she is unaware that Ralf can see her naked form through the shower curtain. As he watches the tiny human girl, Cloe smiles and decides to help her brother out. Ralf nearly squeals when he feels his stepsister slowly touching and massaging his huge cock. As his sister jerks him off, Ralf becomes hornier and hornier, and he wonders how the tiny girl would feel in his hand, or how she would taste. <br>\r\n<br>\r\n After Sara finishes her shower, she steps out of the shower and begins to dry herself off. She is nearly finished when she looks up, and sees a giant eye looking back at her. Naturally she attempts to hide her nude body with her towel, and she tries to scream, but she cannot, she is too afraid. This is too much, and the excited fox blows a load on the ground near a window. Cleo continues to jerk him off until he has finished. At the same time, Ralf reaches through the window and easily smashes through it. He quickly yet gently grabs Sara, and lifts the scared girl out of the house. As she cringes in his huge paw like hand, Ralf yanks the towel away from her, and the two giants inspect the terrified young girl’s naked body. “No cuts of any kind, she is uninjured,” Ralf says lustfully. <br>\r\n<br>\r\n “Damn your right, she is hot. I wonder how she would tastes,” Cleo says as she cleans her paw like hand. <br>\r\n<br>\r\n “I am tempted to eat her as well, or maybe feed her to one of our pets, but remember, this little girl could get us an A for the semester, so we shouldn’t eat her just yet,” Ralf says.<br>\r\n<br>\r\n Cloe responds, “It’s not like she or her family is really going to die no matter who eats them. After she gets swallowed alive, and digested, her body is then cloned, creating a perfect copy of her now, and her mind will then be downloaded into that identical clone to be humiliated and eaten all over again. It’s kind of like that human movie Ground Hogs Day, except they never die and they get eaten over and over again.”<br>\r\n<br>\r\n “Well let’s have the ships computer scan her first, along with her family; otherwise we cannot do it over and over again. After we do that we can humiliate them, eating them over and over again,” Ralf says.  <br>\r\n<br>\r\n Just then, the rest of the family walks outside to investigate the loud noises.  Twelve-year-old Emily, eleven-year-old Kevin, eleven-year-old Rachel, and thirteen-year-old David walk outside to see two giant animals standing above them. Before the four terrified kids could react, Cloe’s hand reaches down and gets them all. Ralf places Sara inside a jar with her nude parents, and freezes her in time too. Cleo drops the four still fully clothed kids inside a separate specimen jar, and freezes then in time as well. “Well we have two jars now, one with nude humans in and one with soon to be nude humans,” Ralf says laughing. <br>\r\n<br>\r\n “Well remember bro, those humans have to be completely undressed before the computer can scan them,” Cloe says purring. <br>\r\n<br>\r\n The twisted giant brother and sister decide?</span></div></div>",
            "created":1425790800,
            "id":1945949,
            "title":"Nine-year-old Sara is being watched."
        },
        "142233":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "enlarge Sara to his size for some fun!",
                "uh-oh accident! Sara is Enlarged to where the Anthros are dolls to her!",
                "readers choice or switch to the female Anthro "
            ],
            "content":"<div class=\"\"><div> <span>The twisted giant brother and sister decide to go back to their ship!<br>\r\n<br>\r\nThe journey to the ship takes about 10 minutes. Along the way the pair decided to split up. The sister went in search of her own fun while the brothers continued with the specimens to the ship.<br>\r\n<br>\r\n<br>\r\nHe went into the ship and unfroze the family and undressed the portion that were still clothed. 1 by 1 he plucked them from the jars scanned them into the computer, downloaded their minds contents , returned them to the jar and repeated the process.<br>\r\n<br>\r\n<br>\r\nHe saved Sara for last lusting over the fresh memories of her shower he watched. He was getting horny and turned on once again as he scanned her into the computer. <br>\r\n<br>\r\n<br>\r\nHis gaze taking her in fully. The brain download seemed to take longer with Sara than the others for some reason but he didn't mind it was more time to ogle her. He then remembered he had split up from his sister for now thus this family and more importantly Sara were all his and his alone for the time being.<br>\r\n<br>\r\nThen he gets an idea....</span></div></div>",
            "created":1426050000,
            "id":1946859,
            "title":"To go back up to the ship?"
        },
        "143":{
            "choices":[
                "North America...",
                "Europe...",
                "Philippines..."
            ],
            "content":"<div class=\"\"><div> <span> Dragger the Terrible is piloting his star cruiser towards a primitive planet named Earth. His ship is pitch-black, and if seen by a human would look like a cross between a gigantic bat and a flying spider to the people below. However, terrifying the primitive humans below no matter how satisfying it may be is not his mission on this primitive world. His mission on this world is not one of conquest, at least not yet, but one of exploration. He and his wife Liras the Devourer, his copilot were sent to the newly discovered world by the Imperial Trogon Senate in order to study it, and its inhabitants. <br>\r\n<br>\r\n Dragger orders are to study the dominate species called humans, collect many living human specimens of various ages, avoid detection by their primitive authorities and return to their home world of Trogon Prime with as many collected human specimens as possible, then file a report. His report will determine the future of this world. If he does not discover these humans are of value to the Empire, then they will be left alone for now. However, if he discovers these humans are of value to the Empire in some way, then an invasion force will be sent to subjugate them, and collect them to be farmed both on Earth and off world. <br>\r\n<br>\r\n Dragger and Liras got their names from the conquered species of the eight worlds they helped to defeat in the name of the empire. This alien couple known for their ruthless cruelty, greed, and endless curiosity have become extremely powerful; mainly because of the many slaves, they have captured and sold. Dragger hopes these tiny exotic hairless apes will make him even more money. Dragger and his wife, along with their giant robot servants get their ship ready for service, as they enter Earth orbit. Liras cloaked their ship, and after an hour of preparations, the giant anthro couple beams down to the Earth’s surface. <br>\r\n<br>\r\n Before we go on, where have they beamed down too? Remember, they must avoid the attention of the Earth’s authorities.   </span></div></div>",
            "created":1424754000,
            "id":1939303,
            "title":"STORY START: A Giant Alien Anthro Couple"
        },
        "1433":{
            "choices":[
                "To the attractive White Mormon family. Mom, Dad, 5 sons & 7 daughters under 16?",
                "A skiiny dipping pond or nudist camp for youth?",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span> Dragger and Liras transport down to a lush tropical forest, near a wealthy human settlement. The town they are near is full of wealthy families, mostly women from the Philippines that married men from North American, Australian, or European, along with some transplanted white families from those same areas as well. This small town may be in the Philippines, but it is highly American and Europeanized. The homes in this town are mostly two story wooden homes. There is a western style school in the center of town for grades four through twelve, and it is complete with various athletic style teams for both genders. The younger kids go to school in another town. The majority of the humans in this town are of mixed Philippine/Caucasian ancestry with some African ancestry mixed in. <br>\r\n<br>\r\n Dragger and Liras are just slightly shorter than the lush one hundred and fifty foot tall trees that surround them both. The one hundred and twenty foot tall aliens are dressed in silver colored suites, and they are both carrying bags filled with scientific tools, a giant robot looking creature named D9 follows them. Dragger strongly resembles a humanoid shaped lizard or frog, with greenish colored scaly skin, big black eyes, big bat like wings, and a long forked tong. His wife Liras strongly resembles a Bangle tiger, but in human female form. They both see the small town before, and begin their hunt. First, Liras grabs a long flute like device, and activates it, which effectively disables all form of communication, including all phone service, radios, the internet, and satellite service. However, the town still has water and power. Now cut off from the outside world, they begin their attack. <br>\r\n<br>\r\n Dragger sees their first target. He sees a nice SUV driving down the road. With ease, he picks it up, and they both look inside. Inside they see a terrified attractive family inside panicking. The giants see a handsome middle-aged white dad trying to comfort his hot thirty something Filipino wife and their five kids of mixed ancestry. They see three hot girls and two cute boys inside. The kids look like they range in age from thirteen to eight. Dragger has the robot open up its wide mouth, and Dragger easily rips open the doors of the SUV, and then gently drops the seven scared humans into the robots huge mouth. The panicking family believes they are about to be digested, but that will not happen, at least not yet. Instead, they suddenly stop falling. They are now floating around in its storage like belly. A few seconds later, a burst of green light engulfs the storage room, which instantly vaporizes all of the families clothing, including any jewelry. A split second later, all seven members of this floating naked family are frozen in time, and moved to a second storage area for safekeeping. <br>\r\n<br>\r\n Next, Liras sees a yellow school bus driving nearby. She picks it up, and again, the two giants look inside the bus. To their amazement, they see a bus full of young female athletes only, no males. Some are cheerleaders and members of the pom pom squad, some are members of the schools swim team, or the volleyball team, and the rest are ether dancers and gymnasts. They counted about sixty young girls in all between the ages of sixteen to nine years old. Most of these girls are of mixed Filipino heritage, and there are many young White girls on the bus as well, along with three girls of African descent. Liras easily ripped open the bus door, and again she gently drops all sixty of these sexy girls into the robots mouth. The sixty girls are convinced they are about to be eaten alive, but again they begin to float around inside its robot stomach. Again, there was a light that completely removed all of their clothes, and soon afterward, they were all frozen in time, and then placed in a second storage area with the family. <br>\r\n<br>\r\n These two alien hunters decide to go where next?</span></div></div>",
            "created":1425790800,
            "id":1945815,
            "title":"Philippines, near a wealthy town. "
        },
        "144":{
            "author_id":"ayan0904",
            "author_name":"My son is gone",
            "choices":[
                "He barely fit in the house ",
                "He outgrew the house"
            ],
            "content":"<div class=\"\"><div> <span>David, a husky lives his newly wedded wife, Mary, a lab. He lives in a nice sub urban home. He first met Mary on a macro website as it was his fetish. They felt a connection and started dating. They would role play each other being bigger than the other on multiple occasions. <br>\r\n<br>\r\nOne day however, as he woke up, David felt different, his clothes were tighter and he seemed taller. He checked and found he had grown to 6’5, an entire foot in height. He told Mary and she got turned on, she had always dreamed of a giant husband. That evening David grew another foot and was now 7’5. That night they had sex and David role played as the giant. They went to bed after but Mary woke in the middle of the night and saw David grow bigger. He was quickly outgrowing the bed and his clothes. They soon ripped and he was naked. He kept growing and growing which turned on Mary even more.<br>\r\n<br>\r\nShe wished he’d grow more and almost instantly he shot up another foot. His legs were hanging off the bed and he took up 80% of the bed. Mary stroked his cock and it slightly hardened. It was massive even only half hard. His growth stopped for now and Mary had to sleep on top of him.<br>\r\n<br>\r\nThe next morning, David woke up at 15ft, he barely fit in the room. He had to sit on the floor to have breakfast. While they ate Mary tested something out and imagined his dick bigger. And soon it grew close to Davids chest. It seemed she could control his growth. She imagined him grow bigger and he shot up to 16ft. David wanted to grow more so Mary did so. He grew and grew. Even though he was sitting down his head hit. He kept growing until.</span></div></div>",
            "created":1558489620,
            "id":2662432,
            "title":"Story 4..."
        },
        "15":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A normal-sized female furry...",
                "A normal-sized male furry...",
                "A micro human...",
                "A macro human...",
                "A normal-sized human..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options!</span></div></span></div>",
            "created":1388206800,
            "id":1716160,
            "title":"More Options"
        },
        "151":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1...",
                "Story 2...",
                "Story 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716187,
            "title":"A normal-sized female furry..."
        },
        "152":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1...",
                "Story 2...",
                "Story 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716188,
            "title":"A normal-sized male furry..."
        },
        "153":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Female...",
                "Male..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A micro human!<br>\r\n<br>\r\nSo is the character...</span></div></span></div>",
            "created":1388206800,
            "id":1716162,
            "title":"A micro Human"
        },
        "1531":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "The Club - Mel",
                "The Stepped-On Step Mom",
                "More choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716189,
            "title":"Female..."
        },
        "15311":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Oscar...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Mel groaned as she was coming to. The young adult's head was banging and throbbing as she regained conciousness, her vision blurred as she struggled to open her eye lids. Mel's entire world bobbed and bounced with every second, loud noises thrummed and boomed her sensitive ears.<br>\r\n<br>\r\n\"What the hell man...?\" She managed to mumble. Flashes of moments from mere hours away when she was leaving work boared her inner vision, forcing her to try and remember what had happened to her. Maybe a car had hit her?<br>\r\n<br>\r\nMel's vision was slowly becoming focused, but it didn't help her in the slightest. She was looking up through giant black... She wasn't sure what they were, but light flashed between the four giant black things. Mel shaked her head in confusion. She was sure she was moving and she was soon beginning to realise her more personal predicament.<br>\r\n<br>\r\nShe was naked. As light continued to flash through his confinement, she could see her soft bare skin and her modest breasts swayed lossely. She gasped as she covered herself and sat up on her bum, and desperately, she hastened to figure out what was going on.<br>\r\n<br>\r\nShe wasn't sure how long she was in this odd room as it bobbed around and moving in some kind of space, but it shook Mel to her core as the giant black things lifted from above her, uncurling and flatening out in front of her. It was strange, Mel thought, that they kind of look like... And that she was sitting on... Before she could react, the surface of the hand she laid on tipped and sent her rolling down the long pink surface that rolled out before her and landing on something hard, making him bang her head.<br>\r\n<br>\r\nMel groaned in pain and Mel grabbed the back of her crown to stifle the sharp sting she recieved, but oddly the pain disappeared in no time and she felt fine. Mel snapped back to reality as she studied her surroundings, what the noise was, where she was, who was around and what shocked her made her heart drop to her stomach.<br>\r\n<br>\r\n\"Giant. People.\" Mel said with her breath taken from him completely. There in front of her, stood a giant man who was retracting his hand away and Mel thought that she was indeed sat on a giant palm, but nothing could prepare her for this. The giant looked as though he was in his forties, with short waxed hair and a stubbly beard. Mel had to strain her neck to look up at the giants face which was looking down on her, scanning his light blue shirt that was hung toght on his body. It was a dimly lit room, with only a single light blooming down on Mel as she stood on this surace, or perhaps a table.<br>\r\n<br>\r\nMel gawked as she looked around the room, and she could see the shapes in the dark come closer to the table. All sorts of voices echoed around her as the silhouettes talked amongst themselves.<br>\r\n<br>\r\n\"...She's smaller than they usually...\"<br>\r\n<br>\r\n\"...ook at her fine little body, I better wi...\"<br>\r\n<br>\r\n\"...has to be our week! She's so cute...\"<br>\r\n<br>\r\n\"...ait until I get my hands on you, pretty gir...\"<br>\r\n<br>\r\nAs she stood on the table, bare naked and confused, she heard lots of conversations and all of them, not one of the conversations sounded remotely beneficial to her.<br>\r\n<br>\r\n\"Mel...\" The giant behind him softly said down to her. Mel turned around and gaped at the giant who had crouched down to have his head level to the table. \"My name is Eric. Welcome to the Club! You've been chosen...\"<br>\r\n<br>\r\n\"Whoa, whoa, whoa, wait a minute, what he hell is going on here? Where are my-\"<br>\r\n<br>\r\n\"I'm trying to explain it to you. You've been chosen to be shrunk and to be used as the chosen master wishes. You currently stand at a quarter inch tall, you happen to be indestructable and you will live a long, long life. Your entire existence has been wiped from all records, you never existed nor will you ever be recorded of ever having existed. You are now property of the Club.\"<br>\r\n<br>\r\nMel stood stunned as she stared at the giants eyes, the talking of the other people in the room hustling in the dark.<br>\r\n<br>\r\n\"The Club,\" Eric the giant continued, \"is a prenium society of a maximum of thirty attendants at any one time, is given a ticket with a number on it. I will pick out a random ticket and whoever has that number, will have you for a maximum time of one week. You are then returned here to be available for the next selection. Do you understand?\"<br>\r\n<br>\r\nMel was still stunned, still in complete denial of her situation. \"What the hell am I supposed to say to that? Grow me back you dick!\" There was some giggling and some muted talk all around the tiny woman as she stood her ground. Who did these people think they were?<br>\r\n<br>\r\nEric grinned at Mel as he began to stand to his full height again. \"I cannot grow you back, nor can anybody else. You are and always be what you are now. A tiny woman for us to play with for the rest of your life. And nothing more, unless you are bought which sometimes does happen but I wouldn't count on it. Now then, shall we proceed with the draw?\" Eric asked the room which mumbled and murmured and someone from behind Eric handed him a small plastic tub that had rolled up bits of paper.<br>\r\n<br>\r\n\"But... Hey!\" Mel shouted to get Eric's attention, and anybody else's for that matter, but nothing happened. Everyone in the room excitedly got their tickets out and waited for Eric to draw.<br>\r\n<br>\r\nIn a matter of seconds, he pulled out a scrunched piece of paper and read out the number. \"Fourteen!\" There was lots of sighs in the room of disappointment, all but one voice...</span></div></div>",
            "created":1412744400,
            "id":1868773,
            "title":"STORY START: THE CLUB - Mel"
        },
        "153111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Oscar is bi...",
                "Oscar is gay...",
                "Oscar is on his own..."
            ],
            "content":"<div class=\"\"><div> <span>\"About damn time!\" A voice was heard from somewhere deep in the room.<br>\r\n<br>\r\nA loud noise of a mass of people groaned a laughed in the room.<br>\r\n<br>\r\n\"Oh you would win, wouldn't you? I wanted him so...\" said a woman's voice.<br>\r\n<br>\r\n\"... They haven't won it in ages...\" said another woman's voice.<br>\r\n<br>\r\n\"Go easy on the little guy...\" said a man's voice.<br>\r\n<br>\r\nMel could see the mass of silhouettes to the left of her part as someone was coming through. She gulped and slowly started walking back in apprehension of who was about to claim her. A thunderous booming got louder and louder as the anonymouos person walked to the table through the crowd.<br>\r\n<br>\r\n\"Oh God I can't wait for this...\" Mel went dead cold, dead quick. That was an excited man's voice. The silhouettes vanished and now he was along with this man and Eric...<br>\r\n<br>\r\nShe gulped and started to walk back faster as the man walked into the light, nearly knocking the table with his crotch, that was hidden behind a pair of tight black briefs. The silhouettes disappeared instanly. And hidden in there was something big and of course, Mel knew what it was. The rest of the giant man was naked, showing off his ripped abs and incredible sculpted chest with a fine mash of hair on it. His nipples were hard and ready, Mel noticed, as she looked further up into the man's face, which was handsome and finely attended to. He sported a fine stubble and chizzled cheekbones. He was grinning and looking down on him with hazel-brown eyes that matched his short brown hair.<br>\r\n<br>\r\n\"She looks great Eric, I think we're going to love her!\" The man couldn't stop staring down at Mel, who was still backing away, taking in the sheer sight of the giant man standing in front of her.<br>\r\n<br>\r\n\"No problem Oscar, you know the rules. One week from now...\"<br>\r\n<br>\r\n\"...Yeah, yeah I know. What's his name again?\"<br>\r\n<br>\r\n\"Mel.\"<br>\r\n<br>\r\n\"Mel... Thanks Eric. Now little girl, you're coming with me!\" Mel screamed as Oscar reached for her with his giant hand open, his fingers reaching for her. Mel took off running but it was no good. Oscar slammed him hand in front of her like a wall and began to slide it towards her. <br>\r\n<br>\r\nMel yelped and began to run back towards Oscar unknowingly as the wall of hand rushed towards her. But then Mel DID notice Oscar ahead and she hasitated for only a moment, a moment that caused her to slow down and soon the palm of Oscar's left hand pushed her over and made her slide along the smooth surface of the table. Mel screamed as her soft round rear rubbed along the surface unforgivingly, and she could see ahead that Oscar had now pulled open his briefs and started bending at the knees, leaving the opening just below the lip of the table.<br>\r\n<br>\r\n\"PLEASE GOD NO!\" Mel screamed as she was rushed towards the edge of the table, but as she was right at the edge, she stopped. Confused and scared witless, Mel stood up on the edge of the table and looked down into the dark musky abyss that was Oscar's briefs. She could just see the unimaginably gigantic limp cock far below in the cofinements of the pants. Mel was literally about to make a run for it again, but she felt a light tap on her bum, which sent her falling off the edge and falling further still, into the abyss...</span></div></div>",
            "created":1412744400,
            "id":1868775,
            "title":"Oscar"
        },
        "15312":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Adam walks in...",
                "Jennie walks in...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>\"W-what the hell just happened?!\" Sarah said, stunned by the blinding blue-white light that had flared in front of her in a strong wave of heat and energy just moments ago, and her skin was still prickling in the now-dark abyss that surrounded heavily on her, pushing her to her knees and crouched.<br>\r\n<br>\r\nSarah had only just been cleaning up her step-son's bedroom when she had stepped on a little black device under a t-shirt on the floor. The 31-year old was the wife to a 42 year-old Michael, father of four and had an ex-wife of six years. Mel and Michael had been married less than eight months but things were going well in the family. Although Sarah was younger than Michael's ex, Beth who was 40, the kids of Michael respected her as their step-mom which made things fairly easy for Sarah in terms of taking over a new family. <br>\r\n<br>\r\nToday, she was looking after the kids as Micahel as gone for the weekend, and today was Friday. Sarah had the next week off and didn't want to waste it by tidying up the house, so today was a good day to get the house work done. Unfortunately however, Sarah's fortunes have changed. As she stepped into Adam's bedroom after having cleaned up the bathroom, she felt a crunch under her heel and that's when everything went bright, and loud and thrumming... And now she was awake, even though she hadn't realised she had been stunned. For a few hours no less.<br>\r\n<br>\r\nAs she crouched under the heavy black veil that weighed on her, she realised her bare breasts were pushing onto her bare thighs and that she was indeed naked in the dark. She started scrabbling through the dark, seeing whisps of faint light through the abyss... Eventually, she could see a permanant source of light and headed for it with great steed. Soon, she crawled through the loop of light and out... Out into Adam's room...<br>\r\n<br>\r\n\"WHAT THE FUCK?!\" Sarah screamed as she scrawled out of the sleeve of her blouse and onto the soft light brown carpet of her step-son's room. She was now tiny, no bigger than a thumbnail and she was now stood in the 13 year old's room with no clue what to do with her new-found situation. She looked around and saw the black device that she had stood on and it was taller than her! <br>\r\n<br>\r\n\"I... I've got to find help!\" Sarah scrambled for the door that was far, far away and she still had to navigate through the un-tidy room. This was by far an excellent reason to tidy the room, if she didn't have one already. And an even better one seemed to be entering the room, the heavy oak door creaking open...</span></div></div>",
            "created":1423371600,
            "id":1930119,
            "title":"STORY START: The Stepped-On Step Mom"
        },
        "153122":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Jennie spots Sarah and decides to play...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Sarah had waded through the thick carpet she had been just about to tidy moments before and she had no idea how long for. It was like a desert with giant objects scattered around the land, so giant that she was still finding it hard to adjust her sense of scale. But that was easily fixed when the door creaked open far ahead on the end of the room and Sarah gasped as Jennie pushed the door open.<br>\r\n<br>\r\nJennie was Sarah's 16-year old step daughter who now stood in her giantic for in the doorway. She no longer had the height of a 16-year old but that was Sarah's point of view. Jennie's long black hair flowed arond her soft round face and her thick black eyeliner and mascara brought out her deep brown eyes. Her soft lips pushed out by her wide toothy grin and her smile was a wonder to see. As a 16 year old, she had grown early and although she wasn't fat or chubby, she did have some extra size on her and her breasts were fairly big for her age. <br>\r\n<br>\r\nHer punk-goth make up went well with her band tee and shirt, along with some teared up jeans and some skater trainers. She pushed the door open and peered into her brother's room. <br>\r\n<br>\r\n\"Sarah? You in here? Sar-\" Jennie halted as she saw Sarah's clothes dumped in a pile in the middle of the room. \"Ugh- Sarah...\" Jennie called out in to the house, turning to walk down the corridor. <br>\r\n<br>\r\n\"JENNIE! DOWN HERE!\" But Jennie was gone and thundered down the corridor. If Jennie was back from college, Adam wouldn't be far behind. Maybe an hour or so! Sarah conitnued to run towards the door and she heard Jennie kick off her shoes in the next room, thudding against the wall and floor and talking to someone about the whereabouts of her step mom.<br>\r\n<br>\r\nIt wasn't long before Jennie came back and stood at the doorway and Sarah was now closer than ever to getting her attention. \"JENNIE! FOR GOD'S SAKE JENN-\" Sarah was stunned suddnely when Jennie's now barefoot caught all of Sarah's attention as Jennie, still unaware of her step mom below, began to take a step. And as Sarah was standing naked pure as day in her line of direction, Sarah decided to take a move and run for dear life. But it took a while for her legs to respond to the situation. It was as if she was glued to the spot as she gasped watching the giant barefoot lift from the ground and up in to the air. The doughy sole lifted over the tiny woman and when she could see the balls of the foot loom over her and the arch quickly following, Sarah decided to run from the shadow under the giant foot and moved as fast as she could.<br>\r\n<br>\r\nSarah ran as fast as she could, and barely made it past the toes that slammed down behind her and blowing a huge waft of air behind her, sending her on her front. She flipped on her back to watch her step daughter take a huge step over her and continued into the room. Sarah let her head hit the floor and sighed a heavy sigh, thanking the stars that she made it. But as Jennie mumbled to herself as she scattered the clothes of the missing step-mom, and pacing around the room, Sarah got up again and made for the door. Getting Jennie's attention wasn't as easy as she thought it was going to be and she now knew the danger she was in. <br>\r\n<br>\r\nSarah had been running without looking nehind her at Jennie for a long while as she ran as fast as she could. But soon it was no use as she was still in Jennie's way as the young woman began to pace back out of the room and soon Sarah could see the ominous black shadow loom over her again and the loud thudding boomed behind her. She froze and groaned with a tear in her eye as she spun slowly on her heel. Now she stood, staring up at the giant girl looking ahead through the door way, confused as to why Sarah's clothes were on the floor of her brothers room and just didn't pay any attention to what was now on the floor. <br>\r\n<br>\r\nSarah stood stunned once again and whimpered as Sarah began to lift her right foot up off the floor once again and this time, Sarah noticed the black nail polish on her little piggies. There was no point in running, she was right where her foot was going to land and as she watched the pale foot lift over her slowly once again, Sarah could do nothing but watch the white wrinkly skin and the pink skin that circled her sole slowly hover over her, blotching out the sight of the rest of the giant girl. Sarah raised her hands when the foot slowly lowered back down to her and she was destined to be flattened. The room got darker around her as the arch of the doughy foot lowered more and more towards her. She could see every detail now, she could see the skin more clearly, had it was strectched and folded as the foot bent and flexed. Sarah conciously laid on her back, now screaming with her arms still raised as the room sloly dissappered from sight completely, as her hands touched the warm flesh as it pressed down on her without restraint and Sarah's face buried into the foot that pressed down into the carpet...</span></div></div>",
            "created":1423371600,
            "id":1930151,
            "title":"Jennie Walks In"
        },
        "1531221":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Continue...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>A soft *whummpf* sound boomed all around the tiny Sarah as the colossal right foot of her step-daughter landed on the carpet around her, and her soft naked body was squashed heavily by the sole of a teenager. Sarah tried to scream but it ended up as nothing but muffled noise, noise that no one would or could hear. <br>\r\n<br>\r\nBut Sarah felt no pain, it was feeling like nothing felt before. Where there should be pain, there wasn't and where the tiny woman should be suffocating, she didn't. Sarah, however, was not thinking about this anyway. More so, she was just screaming for mercy. The heat and the sheer pressure bearing down on her was far too much to bare, but she was going nowhere.<br>\r\n<br>\r\nThat was until the gigantic foot lifted off her suddenly, instantly sending waves of thick air down Sarah's throat and into her lungs, almost inflating herself back to shape. She didn't hesitate though, as soon as there was enough space between the foot and the floor, Sarah got up and dashed once again.<br>\r\n<br>\r\n\"If I've stood in gum...\" Jennie grumbled to herself in an annoyed tone overhead as Sarah didn't stop to even try and get Jennie's attention not at this size. Or so she thought. \"What the f...\" Jennie's sentence flatlined towards the end. This was when Sarah stopped running and froze. She slowly turned her head, and followed the legs in the tight jeans upwards, past the black band tee and red flannel shirt, and up to the face and more specifically, the large round eyes that beared down right at her. Their eyes locked and time stopped.<br>\r\n<br>\r\nIt seemed like forever, but it was only a moment when Jennie hesitated as she slowly tried to comprehend what she was looking at, and it seemed to Sarah that Jennie hadn't figured it out yet. And when Jennie dropped to her knees slowly in front of her, Sarah still did not move, but her heart was racing now.<br>\r\n<br>\r\n\"No... No, it can't be...!\" <br>\r\n<br>\r\n\"Jennie...?\"<br>\r\n<br>\r\n\"...Sarah?!\" Sarah watched as Jennie's mouth dropped in shock as her step-daughter was still observing her. This was when Sarah remembered that she was indeed naked and large... or Small... And present. She quickly wrapped her arm around her breasts and cupped her crotch. The corner of Jennie's mouth twitched.<br>\r\n<br>\r\n\"H-hey... Jennie... How was college?\" Sarah asked, nervously and shakily.<br>\r\n<br>\r\n\"... E-erm...\" Jennie stumbled. \"It was OK I guess... Sarah, how-\"<br>\r\n<br>\r\n\"That black thing over there! Jennie, just over there past the trainers. It looked like a remote! Don't touch it though!\"<br>\r\n<br>\r\n\"Black device...?\" Jennie said as she whipped her head around, looking for the mysterious device. \"Oh... Yeah I'm not gonna touch it, I'll just kick it under the bed for now...\"<br>\r\n<br>\r\n\"No, Jennie! It might have a grow button or something on it that can change me back! Please, just have a look!\"<br>\r\n<br>\r\n\"Ugh, OK fine!\" Jennie said as she stood back on her feet, and walked over to the small black rectangle. Sarah watched in anticipation as Jennie picked up the remote. With Jennie's back turned to Sarah, the tiny woman could only wait to see what the hold up was. \"Urm... Sarah... It's not good...\"<br>\r\n<br>\r\nSarah nearly cried as Jennie turned around and showed Sarah the bad news. The remote had been crushed under Sarah's heel, shattered from the middle outwards and there was no chance it was going to get repaired anytime soon. If it could even be repaired, that was. And all she could do was watch Jennie toss what was left into the bin.<br>\r\n<br>\r\n\"Well, looks like that's not going to work, huh? Do you think you'll be stuck like this?\" Jennie asked, almost plainly down to her 1/4 inch tall step mother. Sarah just stared down at the floor, at her feet. They've never looked smaller to her now.<br>\r\n<br>\r\n\"I-I don't know. That thing came from somewhere and your brother knows, he must do!\" Sarah tried to think logically about this but it was hard, so hard when your gigantic step-daughter takes a step towards you. <br>\r\n<br>\r\n\"Yeah, maybe... But then,\" Sarah looked back up at Jennie's who to her was miles closer from taking that one soft step towards her and peering down curiously at her. \"I think you'd make a better step-mom... Being the way you are now... Don't you think?\" With that, Sarah was now the one with her jaw hung open in shock.<br>\r\n<br>\r\n\"Jennie... Please, stop being so silly! Come on, you need to help-\"<br>\r\n<br>\r\n\"Yeah, I think you'd be so much more fun being this small... Was that actually you I stepped on?! And you're still alive...\" Sarah took a step back as Jennie took another step forward, lifting her heavy pale foot and landing it in front of Jennie some hundred feet away, it seemed. But Sarah still felt the wave of air that wooshed under giant girl's foot. \"That's pretty amazing you know...\" <br>\r\n<br>\r\n\"Jennie... Please...\" Sarah mumbled whimply to herself more than anything, it seemed like Jennie had no interest in saving her step mom anytime soon.<br>\r\n<br>\r\n\"I tell you what else is amazing... How fast you can run for a little woman! A little itty-bitty woman!\" And Sarah stood aghast still, and now she was staring at her daughter intentionally raising her foot slowly into the air. Higher and higher and forward, towards Sarah and slowly the sole floated over her head. Again, she was looking up at the giant fine details of the bottom of her husband's daughter's foot. \"Better run, <i>mom</i> hehehe!\"<br>\r\n<br>\r\nSarah didn't need any more motivation than that. Once again, she took off and headed to doorway. Her hair flew behind her and she ran at full speed, and it was a matter of a few seconds when a loud boom was heard, and felt, by Jennie's foot landing onto the soft carpet. It was one things that Jennie had stepped on her moments ago, and Sarah got lucky. This time, Jennie seemed intent in causing Sarah misery. And this was the start of it. And now wasn't the time to figure out why.<br>\r\n<br>\r\nSarah hadn't even realised she had passed the doorway already and that Jennie was still close behind, her feet still booming on the carpeted floor. <br>\r\n<br>\r\n\"Look at you go! Oh, Sarah you look so cute down there!\" Jennie giggled and Sarah, under her skin, burned in rage of the defience and recklessness that Jennie was showing her. The light was different on the landing and the light flooded the floor in front on Sarah the shadow that Jennie cast down on her. Sarah yelped and turned to her right and headed for the doorway ahead of her. She heard Jennie giggling again above her, behind her and Sarah just continued to run. <br>\r\n<br>\r\nSarah's life flashed before her eyes as the pale right foor of Jennie's boomed to the floor to her right, Sarah being somewhere near the centre of the length of the hot foot. It was simply unbearably enourmous. It was like a cruise liner that had crash landed from the sky next to Sarah. Sarah yelped and dived to the floor and rolled on her back, and stared back up at Jennie's heavily painted eyes and her cocky grin. Jennie made her last step with her left foot crashing near Sarah, just like the right foot had and Sarah was now beyond paralytic.<br>\r\n<br>\r\n\"Well, you're pretty much just outside my room. How about we play a little more in here huh?\" And with that, Sarah screamed as Jennie bent on her knees in front of her and Sarah watched as Jennie, still grinning and flashing her shiny white teeth, slowly and teasingly opened her had in a claw like fashion as Sarah watched the hand slowly lower to her. Sarah curled up and shut her eyes and weeped. And it wasn't long before Sarah's body was wrapped in the soft puffy hand of Jennie as she stoof back up, and paced into the room...</span></div></div>",
            "created":1423458000,
            "id":1930883,
            "title":"Well, Well, Well..."
        },
        "15312211":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Continue...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>The tiny step-mom barely had any time to even take in what the inside of Jennie's hand looked like, as moments after she heard Jenni's door close, the thick fingers that wrapped around her released off her and Sarah rolled down the length of the digits and fell only a short distance to a soft landing. With a fall to her back, she landed with a cushioned blow and barely felt a thing. Sarah never realised that just being so small affected her pull towards the Earth. Strange little details like that, she would have to get used to. Because, when little Sarah looked back at the towering sixteen year old punk who stared back down at her with a cock-sure grin, Sarah believed that she wasn't going to return to normal anytime soon. If ever.<br>\r\n<br>\r\nAnd with that thought alone, it struck fear right into her very soul. <br>\r\n<br>\r\nSarah looked around and quickly she deducted that she was now laying on the thick bed covers of Jennie's bed. Her room, filled with canvases and posters of bands and movies and everything else. Her room smelt nice but a faint arome of marijuana was present too. Sarah chose to ignore this little fact for now. Instead she cast her mind back to the long field of purple bed covers, and the two thick pillows at the head of the bed. A small lamp on a small dresser table beside the bed filled the room with an ambient light, along with the light that shone brightly through the window. <br>\r\n<br>\r\nThe sun had warmed the bed up consideralbly and it didn't take long for Sarah to begin to sweat, that along with the constent fear taking it's toll on her little body. And her mind. Then, she cast her eyesight back to Sarah, who was still grinning down at her. <br>\r\n<br>\r\n\"I guess you must still be getting used to it all, huh? Well dont't you worry, I'll be gentle...\" Jennie said with her grin more pronounced than ever.<br>\r\n<br>\r\n\"...J-Jen-\"<br>\r\n<br>\r\n\"...At first.\" Jennie finished. She winked down at her step-mom and rested her hands on her hips and puffed out her chest subtly. \"So what do I do with you, I wonder?\"<br>\r\n<br>\r\n\"You could help me of course!\" Sarah said half-hazardly. It was incredibly intimidating for her to stare up to the young giantess that was now definitely pushing the bar beyond what was ever acceptable. <br>\r\n<br>\r\n\"I could... But then I could also help myself. I'm going to be brutally honest Sarah, I've always thought you were pretty hot. I've just never really liked you. I'm good at putting on a face, and oh how I put on a face for you. But like I said, it's a good thing you're hot hehe!\" Jennie giggled. <br>\r\n<br>\r\nSarah was stunned. She never thought she would be hearing these words from Jennie in this situation, ever. She had known Jennie for little over a year now and Jennie never really gave Sarah any bother at all, apart from the odd arguement here and there. Things, she thought, were pretty good between the two. Obviously not.<br>\r\n<br>\r\n\"Jennie! How can you be saying these things... Who do you think you-AAARGH!\" Sarah yelped as she watched her young step-daughter crouch in front of her, lowerering her body so that Sarah was now in line with Jennie's throat, Sarah only having to crane her neck a small bit to look into the bearing hazel eyes staring right back at her, Jennie's black hair bobbing as she crouched and her smooth lips still twisted in a grin.<br>\r\n<br>\r\n\"Well, I'll tell you what I do know. I'm your ste-daughter, and you're my tiny step-mom, ready and willing for stepping on! Because if you're not willing, I'll just flush you down the toilet. So what do YOU think, teeny Sarah?\" It was no surprise that Sarah had nothing to say, and the noise that did escapce her lips was naught but a whimper. \"Yeah, I thought so. God, just look at you... Did I mention you were so hot? I wish I could get breasts like you one day. But I guess mine are much bigger than yours aren't they? Here...\" Sarah yelped and started to crawl backwards as fast as she could as Jennie began to reach for her once again, her pale hand and fingers stretching out for him. <br>\r\n<br>\r\nThe tiny woman got to her feet and turned to run but it was too late; she was wrapped up once again in Jennie's warm hand but the fingers didn't clamp around her, more so that the giant hand she laid in was now cupping around her. Jennie's face never vanished from view and constantly grinning down at the tiny woman in her hand. <br>\r\n<br>\r\n\"Why don't you take a look for yourself!\" Jennie giggled and Sarah braced herself as Jennie reached down for her with her other hand and pinched her at the waist with her enormous thumb and forefinger. Sarah felt the cupped hand leave her bottom and legs, leaving her dangling between two walls of skin. And as she looked at Jennie who was now stretching open her black tee from the neck, Sarah knew it would be two different walls of flesh that will be squashing her.<br>\r\n<br>\r\n\"JENNIE DON'T YOU DARE!\" Sarah screamed as she was brought closer to the opening of the stretched-open collar. And it wasn't long before she was dangling over the opening and looking down at a valley of round skin, squashed together by the bra that supported the 16 year old's breasts. It was rare that Sarah saw any skin of Jenni's breasts as she always work tees and shirts, always covered but when she was granted a glimpse, it was easy to see that Jennie had developed early in life and she was reaping the benefits of being a woman with a woman's body earlier than most girls her age. <br>\r\n<br>\r\nSarah's soles tingled as the warmth from within the shirt rose and warmed her skin, and the waves of Jennie's perfumem and natural scent, along with the tee smell of detergent filled Sarah's head and it was only just bearable. It was almost blinding at first. Sarah looked up at Jenni's lips, unable to lift her head any higher as Jennie was tilting her head downwards now. And her lips were still warped by her toothy grin. \"This is awesome.\" Jennie whispered with a small giggle at the end. </span></div></div>",
            "created":1423717200,
            "id":1932707,
            "title":"The Valley Below"
        },
        "153122111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Turned to leave...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Sarah felt her stomach lurch as she felt the giant finger tips leave her sides and suddenly her arms were free and flailing all the as the tiny woman fell. It wasn't long until she was falling in darkness that the tee cast upon Jennies chest and within a couple of seconds, that's exactly what Sarah fell into.<br>\r\n<br>\r\nAs her body was free, Sarah screamed and kicked her legs widely in the air and her arms and hands trying to reach for a hold that wasn't there. The single bloom of light coming from the next of the stretched open tee gave Sarah enough light to see, within those couple of seconds, Jennies flesh of her chest rush and weirdly grow as she fell and before she could yell out for Jennie again, suddenly Sarah's feet and legs snapped together as slipped bang on in the cleavage and now she was wedged up to her hips in her step-daughters breasts, and as she looked back up at Jennie as she struggled and squirmed to get free, the round walls of the enormous breasts rose up and away from her, really giving Sarah a sense of scale and how small she really was as she was stuck in between these flesh mountains. And seeing Jennies face, all the way up her chest and neck, bearing down from way high above her and the grin had never left her face.<br>\r\n<br>\r\n\"Oh my God... Look at you down there! You're so cute in there Sarah!\" Jennie bit on her bottom lip and giggled again. \"But I don't think you're safe enough, you could slip out! Here, let me help you...\"<br>\r\n<br>\r\nSarah whimpered as Jennies forefinger loomed over the edge of the opening and soon, it was coming towards her and Sarah knew what Jennie intended to do. \"Please, Jennieeee!\" Sarah moaned as she lifted her hands to try and push away the finger tip as it was now mere metres away from her. The tiny woman could already feel her feet and legs getting warmer and warmer and even starting to go numb, they were that badly squashed just in the crevice of this epic cleavage that was begging to have her prisoner. <br>\r\n<br>\r\nJennies face and pretty much everything else was blotted out by the tip of Jennies finger, which Sarah's hand pressed into the fine lines in her skin, but her arms bent at the elbows against her will and quickly she nodded her head downwards and avoided a broken nose, and now the tip pushed on the top of her head and kept on pushing. Sarah tried to scramble as her body slipped between the soft skin that willingly swallowed her up. As the fingertip continued to push and Sarah now being up to her navel, she tried to grip on the walls that rose around her but she couldn't get a grip. And now her breasts began to push into the side of one of the breasts and back into her and now she was trying to push Jennies titanic wall of breast off her, and as she did, Jennies finger pushed more firmly on her head and Sarah's tiny hands slipped off the skin and with a silent bang, and a muffled scream from Sarah, the wall of the giant 16 year-old's breast slammed into her and now she was in deep enough for all the light to extinguish, apart from the tiny rays of light that Jennies finger allowed as it continued to push the squashed woman deeper into her deep unforgiving cleavage.<br>\r\n<br>\r\nSarah's tiny naked body slid deeper and deeper into the dark canyon and everything was getting tighter and hotter and soon Sarah was sweating and she was sure that Jennies skin was getting damper too, but that might've been because she was right in the middle of Jennies breasts, deep down and squashed tight and that was where Jennies finger left, Sarah's head. Sarah looked up with tears in her eyes as the finger left her, and the wall of breast flesh began to roll over her.<br>\r\n<br>\r\n\"JENNIE NOOOO-!\" Sarah's pleas for help was muted as the tiny woman disappeared between Jennies breasts. And Jennie looked down upon where she was pushing down the tiny woman, and now she had vanished. Jennie took out her hand and let the tee snap close against her chest. With a smile and a sigh, she...</span></div></div>",
            "created":1423976400,
            "id":1934617,
            "title":"Wedged"
        },
        "1531221111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Her friends...",
                "Her SO (significant other)...",
                "Other,,,"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But to where?</span></div></span></div>",
            "created":1429419600,
            "id":1966910,
            "title":"Turned To Leave..."
        },
        "15313":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Choice 1...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices...</span></div></span></div>",
            "created":1435865640,
            "id":2002284,
            "title":"More choices!"
        },
        "1532":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "The Club",
                "When You Swipe Right",
                "More stories..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716191,
            "title":"Male..."
        },
        "15321":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Oscar",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Paul groaned as he was coming to. The young adult's head was banging and throbbing as he regained conciousness, his vision blurred as he struggled to open his eye lids. His entire world bobbed and bounced with every second, loud noises thrummed and boomed his sensitive ears. <br>\r\n<br>\r\n\"What the hell man...?\" He managed to mumble. Flashes of moments from mere hours away when he was leaving work bored his inner vision, forcing him to try and remember what had happened to him. Maybe a car had hit him?<br>\r\n<br>\r\nHIs vision was slowly becoming focused, but it didn't help him in the slightest. He was looking up through giant black... He wasn't sure what they were, but light flashed between the four giant black things. Paul shaked his head in confusion. He was sure he was moving and he was soon beginning to realise his more personal predicament.<br>\r\n<br>\r\nHe was naked. As light continued to flash through his confinement, he could see his bare skin and his modest package just limp and present. He gasped as he covered himself and sat up on his bum, and desperately, he hastened to figure out what was going on.<br>\r\n<br>\r\nHe wasn't sure how long he was in this odd room as it bobbed around and moving in some kind of space, but it shook Paul to his core as the giant black things lifted from above him, uncurling and flatening out in front of him. It was strange, Paul thought, that they kind of look like... And that he was sitting on... Before he could react, the surface of the hand he laid on tipped and sent him rolling down the long pink surface that rolled out before him and landing on something hard, making him bang his head.<br>\r\n<br>\r\nHe groaned in pain and Paul grabbed the back of his crown to stifle the sharp sting he recieved, but oddly the pain disappeared in no time and he felt fine. Paul snapped back to reality as he studied his surroundings, what the noise was, where he was, who was around and what shocked him made his heart drop to his stomach.<br>\r\n<br>\r\n<i>\"Giant. People.\"</i> Paul said with this breath taken from him completely. There in front of him, stood a giant man who was retracting his hand away and Paul thought that he was indeed sat on a giant palm, but nothing could prepare him for this. The giant looked as though he was in his forties, with short waxed hair and a stubbly beard. Paul had to strain his neck to look up at the giants face which was looking down on him, scanning his light blue shirt that was hung toght on his body. It was a dimly lit room, with only a single light blooming down on Paul as he stood on this surace, or perhaps a table.<br>\r\n<br>\r\nPaul gawked as he looked around the room, and he could see the shapes in the dark come closer to the table. All sorts of voices echoed around him as the silhouettes talked amongst themselves.<br>\r\n<br>\r\n\"...He's smaller than they usually...\"<br>\r\n<br>\r\n\"...ook at his fine little body, I better wi...\"<br>\r\n<br>\r\n\"...has to be our week! He's so cute...\"<br>\r\n<br>\r\n\"...ait until I get my hands on you, pretty bo...\"<br>\r\n<br>\r\nAs he stood on the table, bare naked and confused, he heard lots of conversations and all of them, not one of the conversations sounded remotely beneficial to him.<br>\r\n<br>\r\n\"Paul...\" The giant behind him softly said down to him. Paul turned around and gaped at the giant who had crouched down to have his head level to the table. \"My name is Eric. Welcome to the Club! You've been chosen...\"<br>\r\n<br>\r\n\"Whoa, whoa, whoa, wait a minute, what he hell is going on here? Where are my-\"<br>\r\n<br>\r\n\"I'm trying to explain it to you. You've been chosen to be shrunk and to be used as the chosen master wishes. You currently stand at a quarter inch tall, you happen to be indestructable and you will live a long, long life. Your entire existence has been wiped from all records, you never existed nor will you ever be recorded of ever having existed. You are now property of the Club.\"<br>\r\n<br>\r\nPaul stood stunned as he stared at the giants eyes, the talking of the other people in the room hustling in the dark.<br>\r\n<br>\r\n\"The Club,\" Eric the giant continued, \"is a prenium society of a maximum of thirty attendants at any one time, is given a ticket with a number on it. I will pick out a random ticket and whoever has that number, will have you for a maximum time of one week. You are then returned here to be available for the next selection. Do you understand?\"<br>\r\n<br>\r\nPaul was still stunned, still in complete denial of his situation. \"What the hell am I supposed to say to that? Grow me back you dick!\" There was some giggling and some muted talk all around the tiny man as he stood his ground. Who did these people think they were?<br>\r\n<br>\r\nEric grinned at Paul as he began to stand to his full height again. \"I cannot grow you back, nor can anybody else. You are and always be what you are now. A tiny man for us to play with for the rest of your life. And nothing more, unless you are bought which sometimes does happen but I wouldn't count on it. Now then, shall we proceed with the draw?\" Eric asked the room which mumbled and murmured and someone from behind Eric handed him a small plastic tub that had rolled up bits of paper. <br>\r\n<br>\r\n\"But... Hey!\" Paul shouted to get Eric's attention, and anybody else's for that matter, but nothing happened. Everyone in the room excitedly got their tickets out and waited for Eric to draw.<br>\r\n<br>\r\nIn a matter of seconds, he pulled out a scrunched piece of paper and read out the number. \"Fourteen!\" There was lots of sighs in the room of disappointment, all but one voice...</span></div></div>",
            "created":1402722000,
            "id":1812007,
            "title":"STORY START: THE CLUB - Paul"
        },
        "153211":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Oscar is bi...",
                "Oscar is gay...",
                "Oscar is on his own..."
            ],
            "content":"<div class=\"\"><div> <span>\"About damn time!\" A voice was heard from somewhere deep in the room.<br>\r\n<br>\r\nA loud noise of a mass of people groaned a laughed in the room.<br>\r\n<br>\r\n\"Oh you would win, wouldn't you? I wanted him so...\" said a woman's voice.<br>\r\n<br>\r\n\"... They haven't won it in ages...\" said another woman's voice.<br>\r\n<br>\r\n\"Go easy on the little guy...\" said a man's voice.<br>\r\n<br>\r\nPaul could see the mass of silhouettes to the left of him part as someone was coming through. Paul gulped and slowly started walking back in apprehension of who was about to claim him. A thunderous booming got louder and louder as the anonymouos person walked to the table through the crowd.<br>\r\n<br>\r\n\"Oh God I can't wait for this...\" Paul went dead cold, dead quick. That was an excited man's voice. The silhouettes vanished and now he was along with this man and Eric...<br>\r\n<br>\r\nHe gulped and started to walk back faster as the man walked into the light, nearly knocking the table with his crotch, that was hidden behind a pair of tight black briefs. The silhouettes disappeared instanly. And hidden in there was something big and of course, Paul knew what it was. The rest of the giant man was naked, showing off his ripped abs and incredible sculpted chest with a fine mash of hair on it. His nipples were hard and ready, Paul noticed, as he looked further up into the man's face, which was handsome and finely attended to. He sported a fine stubble and chizzled cheekbones. He was grinning and looking down on him with hazel-brown eyes that matched his short brown hair. <br>\r\n<br>\r\n\"He looks great Eric, I think we're going to love him!\" The man couldn't stop staring down at Paul, who was still back away, taking in the sheer sight of the giant man standing in front of him. <br>\r\n<br>\r\n\"No problem Oscar, you know the rules. One week from now...\"<br>\r\n<br>\r\n\"...Yeah, yeah I know. What's his name again?\"<br>\r\n<br>\r\n\"Paul.\"<br>\r\n<br>\r\n\"Paul... Thanks Eric. Now little guy, you're coming with me!\" Paul screamed as Oscar reached for him with his giant hand open, his fingers reaching for him. Paul took off running but it was no good. Oscar slammed him hand in front of him like a wall and began to slide it towards him. Paul yelped and began to run back towards Oscar unknowingly as the wall of hand rushed towards him. But then Paul DID notice Oscar ahead and he hasitated for only a moment, a moment that caused him to slow down and soon the palm of Oscar's left hand pushed him over and made him slide along the smooth surface of the table. Paul screamed as his rear rubbed along the surface unforgivingly, and he could see ahead that Oscar had now pulled open his briefs and started bending at the knees, leaving the opening just below the lip of the table. <br>\r\n<br>\r\n\"PLEASE GOD NO!\" Paul yelled as he was rushed towards the edge of the table, but as he was right at the edge, he stopped. Confused and scared witless, Paul stood up on the edge of the table and looked down into the dark musky abyss that was Oscar's briefs. He could just see the unimaginably gigantic limp cock far below in the cofinements of the pants.Paul was literally about to make a run for it again, but he felt a light tap on his bum, which sent him falling off the edge and faling further still, into the abyss...</span></div></div>",
            "created":1405746000,
            "id":1829948,
            "title":"Oscar"
        },
        "1532112":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Choice 1",
                "Choice 2",
                "Choice 3"
            ],
            "content":"<div class=\"\"><div> <span>Inside, his guts were churning. As Paul fell through the air, the weightlessness took over him as he near glided towards his new prison. His heart was racing, even throbbing in his throat as the wall of tight and tanned flesh blurred by and things started to get darker.<br>\r\n<br>\r\nIt wasn't long before Paul landed with a thud as his body crumpled to a halt and he smacked his head against something soft. He groaned and held his head as he winced and looked around. Right in front of him was a wall of black cotton, and it didn't take him long to remember where he was headed. The tiny man gasped as he stood up on the giant flesh that curved at the sides. He was standing atop of Oscar's limp cock! <br>\r\n<br>\r\nAnd then the musk hit him. The briefs were clean and fresh, there was no doubt about that. But there was also the scent of man crotch seeping up Paul's nose. He looked up to see Oscar looking down on him with a grin, a \"naughty\" grin you could say. The giant's face, up past the immense wall of abs and his hard round pecs, beamed down upon the tiny man, and it was obvious to Paul that he was now nothing at all of any significance. Nothing at all, apart from being a thing to this incredible giant. <br>\r\n<br>\r\n\"You suit it down there you know,\" Oscar said. \"I wonder where else you'd look good!\" He chuckled to himself, making the wall of abs ripple and wave way above Paul. Meanwhile, the knob that Paul was standing on also began to shake and so he fell on his back, still able to look far up to the giants face again. \"See you soon!\" And with that, that was a giantic snapping sound as everything suddenly went dark and Paul was held tight to the giant's cock. \"Eric, see you soon too haha!\"<br>\r\n<br>\r\nAnd soon, Oscar was gone with his teeny tiny pet.</span></div></div>",
            "created":1413349200,
            "id":1872326,
            "title":"For I Am Oscar"
        },
        "15322":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A female...",
                "A male...",
                "A couple..."
            ],
            "content":"<div class=\"\"><div> <span>His heart punding in his chest, he pressed the doorbell. He heard the doorbell even through the thick dark brown door, but it helped too that it was about 10:30pm and the neighbourhood was quiet and restful and all Alan could hear was the usual ambience in a quiet residential estate. If anything, the silence added to Alan's nervousness.<br>\r\n<br>\r\nHe almost ran away right there and then, but after days of talking to his new friend on a mobile app after they both swiped right for each other, and days of building up the courage to meet with the new flirt, his feet were grounded to the doorstep and stood waiting at the door he did.<br>\r\n<br>\r\nAlan was a 19 year old student that had recently moved to this town he was now in. It wasn't far from his college and everything was new to him. And ever since the big move from his home and family, some 200 miles away, Alan had been keen to make a move on a curiosity of his, to just have a oen night stand. That was all. He just wanted to meet someone and just have a non-strings attatched session and make it as wild as he/they could. And now his time had finally come.</span></div></div>",
            "created":1424494800,
            "id":1938119,
            "title":"STORY START: When You Swipe Right"
        },
        "153221":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A female human...",
                "A female furr...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Meeting a female... what?</span></div></span></div>",
            "created":1424494800,
            "id":1938122,
            "title":"Meeting A Female..."
        },
        "153222":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A male human...",
                "A male furr...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Meeting a male... what?</span></div></span></div>",
            "created":1424494800,
            "id":1938124,
            "title":"Meeting A Male..."
        },
        "1532221":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "John, 43...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>The fact was that Alan had been playing with the idea of meeting a guy for a while now, he had never done anything before and now that he had moved away from his family and friends, now was the perfect time to open his mind on his sexuality. He was still attracted to women, there was no doubt there. But still, it was a curiosity that had been inside him for quite some time, longer than he can remember. He never had the oppurtunity until now to satisfy his curiosity.<br>\r\n<br>\r\nAnd as the door suddenly creaked open after a swift turn of the doorknob, the door opened to...</span></div></div>",
            "created":1424494800,
            "id":1938132,
            "title":"The Nature Of Curiosity"
        },
        "15322211":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "John is straight...",
                "John is gay...",
                "John is bi-sexual..."
            ],
            "content":"<div class=\"\"><div> <span>John, and Alan looked into his bright blue eyes and his striking blonde haircut, shaved to the skin nearly front, back and sides and a thick flock of blonde hair on top that waved as the gust rustled his hair. Alan gulped as John smiled a toothy smile. Alan half expected him to be naked right away for some reason, but John wasn't. Indeed, he was wearing a white tee and blue jeans with white sports socks. And by the looks of it, this 43 year old kept himself in good shape.<br>\r\n<br>\r\nAs Alan's eyes did a quick scan of his host, he could see that even though John wasn't a tank-like build, he certainly had the muscles to compensate as the the tee and jeans strapped tightly to his stocky build. It was only when John spoke that Alan returned his attention to him, rather than his body. He had an inkling that John may have noticed him checking the fella out.<br>\r\n<br>\r\n\"Hey Alan! You're definitely more handsome than you look in the pictures!\" John said in a soft welcoming tone. Alan felt himself reddning in the face as John said that to him. It was strange to hear a guy say that to you for the first time. <br>\r\n<br>\r\n\"Erm, thanks man. Nice place you've got here!\" Alan said with genuine praise. It was a really big house for one guy, he must have a high paying job but Alan didn't really want to go into that now. \"Bit cold out here!\"<br>\r\n<br>\r\n\"Oh yeah, well please come in, come in!\" John said and moved to the side and let Alan step into the warm house. As he walked in, he had burning feeling that John was checking him out from behind. \"So, you said you were straight?\" John said as he closed the door and locked it. \"Well don't I feel lucky then!\"<br>\r\n<br>\r\nFor a couple of hours, Alan and John talked and joked between themselves, getting to know each other. This wasn't a date, Alan had to remind himself. He just didn't want to jump right in head first without really getting to know the guy he would spend the night with, potentially. As they sat in the living room, talking among themselves, Alan felt that John was a pretty decent guy all in all, if not a bit pushy. He kept making remarks about how he was going to completely blow Alan's mind and how he'd never look at another woman again. Alan wasn't looking to change his lifestyle or sexuality, he just wanted a fun night of experimentation.<br>\r\n<br>\r\nWith that in mind, he pressed to John that that was all he was really looking for, and not any form of relationship. John would say \"I know, I know!\" jokingly. This was when Alan started to feel nervous again. Maybe John was taking this all a little personally. He wasn't even sure on John's sexuality. He could have guessed but honestly, he couldn't tell that... </span></div></div>",
            "created":1424494800,
            "id":1938158,
            "title":"John - 43"
        },
        "153222112":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "What Alan is to John...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>...That John was gay. Apart from a little flamboyance here and there in his dialect, there wasn't anything that gave away his sexuality and Alan was too shy to ask. He assumed that John thought he knew by now. Either way, this was male and male talking here. And one of them was, at least, straight.<br>\r\n<br>\r\nThey talked late into the night, it was nearly 2am and they hadn't even so much as touched each other apart from shaking hands when John walked him through to the living room. And it was a nice house inside, decortated to feel warm and cosy with light, warm browns and yellows and such. Thick carpets and a spongy sofa. John seemed to be quite comfortable to live in a cushy home and that's certainly how he designed his house.<br>\r\n<br>\r\nBut Alan was not cosy, nor was he comfortable. As John was talking to him, Alan could see that John was eyeing him up and as the night wound on, John would put his large hand on Alan's thigh as he told a finish to a story or a joke and that put Alan off considerably. But it was just nerves, just nerves.<br>\r\n<br>\r\nIt soon got to about 3am when they started to run out of things to talk about, and that was when John made his move.<br>\r\n<br>\r\n\"So, Alan, I think it's safe to safe that we know each other now.\" John said as he put his glass of wine on the table, Alan still had his first glass in his hands. He coughed and smiled.<br>\r\n<br>\r\n\"Yeah, yeah I think so haha.\" Alan said, stifling a yawn at the same time with his fist and that's when he lost balance of the glass in the other hand and John reached out and held onto Alan's hand holding the wine glass that it's content was sloshing in. The tiredness was taking over Alan, where as with John, it was evident the 5 or 6 glasses he had were definitely taking effect. Alan looked into John's eyes after John grabbed his hand to stop Alan dropping his drink all over the carpet. <br>\r\n<br>\r\n\"Easy tiger haha! As I was saying, I think we know each other now. However,\" John said as he let go of Alan and took of his t-shirt and standing to his feet, which Alan had failed to noticed that John had taken his socks off some time ago. Alan gulped as the 6'4\" tall man stood up as Alan stayed seated. Alan eye's were locked on the hard, sculpted body that loomed in front of him. John's chest was massive and defined, as well as the abs underneath. \"I think I'd like to get to know you a little more, handsome.\" John said with a wink and a soft grin.<br>\r\n<br>\r\nAlan stood up, his nerves had gotten the best of him. <br>\r\n<br>\r\n\"I-I'm sorry John, I just can't... It just... I just don't feel...\" Alan started but John shushed him.<br>\r\n<br>\r\n\"Oh, shhhh, Alan, hush! It's OK to feel nervous, I promise I'll be-\" But then Alan interuptted him now.<br>\r\n<br>\r\n\"No! No, I'm sorry John, I can't do this!\" And Alan put his glass on the table and took out his hand to shake John's. \"Look, I'm sorry, and I totally respect you and it was lovely meeting you, you're a really nice guy and thank you for welcoming me to your home. But this is... I'm just not ready...\" Alan trailed off shyly, his hand still held in the air in front of John.<br>\r\n<br>\r\nJohn smiled. \"OK. OK, fair enough Alan. Promise me one thing though,\" John said as he gripped Alan's hand. \"As soon you think about me, or you change your mind or think you're making a mistake or something... Promise me, your mine!\" John laughed as he shook the younger mans hand. Alan smiled, he was expecting a big farse but instead, John was kind and understood where he was coming from, and for that alone, Alan had a lot of respect for John.<br>\r\n<br>\r\n\"Haha, I promise man. Thanks!\" Alan said as he let go of John's big hand and proceeded to put his shoes back on, grab his coat and leave. As he trying to find his shoes, he couldn't help think that John really was a great guy. If there was anyone that he would feel safe with in terms of disovering new horizons, John would certainly be in. Alan then remembered he left his shoes by the front door. As he said goodbye to John and standing back onto his feet, and began to walk out of the living room door, an instant thought came to Alan's mind and he whispered that thought to himself.<br>\r\n<br>\r\n<i>\"I'm making a big mistake... I have to do this...\"</i><br>\r\n<br>\r\nAnd then, there was a blinding flash, like a camera had gone off right in front of his face and dazzled him for a moment.<br>\r\n<br>\r\n\"What the fuck?!\" Alan said, rubbing his eyes. For a moment, there was silence. And then, there was John.<br>\r\n<br>\r\n\"Well Alan! I didn't think you you'd change your mind so quickly! At least you didn't change your mind in the car or something!\" John laughed and it bellowed into Alan's head. Alan opened his eyes and looked around to see everything rising up all around him... Including the carpet fibers he was now in... And standing on this very carpet, was John. Alan gulped.</span></div></div>",
            "created":1424494800,
            "id":1938169,
            "title":"John The Host"
        },
        "1532221121":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "The sofa...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>\"What the hell just happened to me?!\" Alan questioned to himself in pure shock, hardly being able to comprehend the situation and trying his best not to pass out too. His head went light and he felt dizzy, soon his legs gave under him and he landed on his arse and into the thick fibers of the carpet. He could only about half an inch tall, maybe less. Right now, it was hard to tell and even harder when John's laughter was soon followed by a booming thump, shuddering the whole floor all around Alan, and shook through him it did. <br>\r\n<br>\r\nAlan looked up to see John had taken a step toward him, casting the tiny guy in his shadow and now Alan sat on the carpet, just a foot or so from the looming giant smiling down upon him. <br>\r\n<br>\r\n\"It's great you decided to live up to your promise Alan, I think... Well, I know that we'll have an amazing life together, don't you think?\" John chuckled slightly, his abs tensing and vhest bouncing as he did. Alan didn't think John was a tank before, but looking at him now changed his perception entirely. Alan had to crane his head to be able to see way up to John's handsome face, and hje had to look up past his legs and crotch, and his bare tight torso and it was a sight to behold. Like seeing a skyscraper for the first time, only human. And gay.<br>\r\n<br>\r\n\"P-promise?\" Alan stuttered, he had completely forgotten, or hadn't paid full attention in the first place, the promise he had made to John before leaving.<br>\r\n<br>\r\n\"You promised that you would be mine, if you admitted to yourself you had made amistake or something. You said something either way, and now the promise is fulfilled, you're mine tiny man!\"<br>\r\n<br>\r\n\"WH-WHAT?! YOU CAN'T DO THIS!\" Alan screamed up to the giant man, laughing down at Alan's pleas. <br>\r\n<br>\r\n\"There's no point denying it now little guy, you're like this forever now! I bet you didn't tell anyone you were coming here did you? No one knows your here, do they? Hmm?\" John asked teasingly, knowing full well the circumstances that Alan had arrived in. <br>\r\n<br>\r\nAlan nearly pee'd himself. <br>\r\n<br>\r\n\"No... No this... You can't!\" <br>\r\n<br>\r\n\"I have little guy! I have, and I intend to keep you forever as my partner, my pet... And my toy, all in one. And boy, are you in for a treat!\" John laughed again, his light drunken slurrs didn't shave away the sharp message that reached Alan's heart and brain. He was nothing now. Not a man nor a member of a family or a part of a cohort. He was just John's... <i>thing</i> now. And nobody would ever know what happened to him, his family, his friends and other fellow students. He would be nothing more than a forgotten face, all the while in the care and full attention of the looming giant before him.<br>\r\n<br>\r\n\"Oh, and one more thing,\" John said and quickly clicked his fingers. Alan felt his clothes warm up and suddenly, as if they had evaporated into nothing as well as the contents in his pocket like his phone and wallet, were gone too. Alan quickly covered his crotch in a frenzied panic and stood up. \"You won't be needing those anymore! Haha, my my, look at you down there. Here, let me help you up...\" And John began to crouch down on his knees and Alan took off running. John's laughter boomed into Alan's head as he laughed closer to him now. <br>\r\n<br>\r\nThe tiny man was running blindly through the carpet, running as fast as his little legs could carry him and all the while a shadow began to loom over him. Alan didn't dare look and the little guy dashed and dived to the side, just as John's thick fingers crashed into the carpet in a claw-like fashon, but the little guy had avoided the grasp of the giant by the hair of his neck and he tumbled and rolled under another shadow.<br>\r\n<br>\r\nAlan gasped and looked around, thinking the worst when actually, he found himself under...</span></div></div>",
            "created":1424581200,
            "id":1938681,
            "title":"Big Guy / Little Guy"
        },
        "15322211211":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "It was his fate...",
                "It wasn't his fate...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>...John's sofa and he was looking up at the underneath of the black couch. He got up on his feet again as he heard John chuckle and grunt as his knees plummeted to the floor and Alan quickly dashed behind one of the sofa lefgs. He also cursed John to high heaven that he kept his living room spotless, even underneath the furniture. There was even little to no dust here, Alan noticed.<br>\r\n<br>\r\nBut now, he had his back turned to the giant, hiding behind one of the large feet that pressed heavily into the floor. He heard John crouch lower and underneath the sofa, the ladscape got darker in his hulking shadow. <br>\r\n<br>\r\n\"Now, now Alan come on, I won't hurt you! Where did you go...?\" Alan was breathing heavily now, trying to stop himself from bolting it was a huge drain on his mental state and the fact that John was little inches away from him was a horrific thought in itself. He could smell the giant's warm breath, with the hint of the red wine that he had been drinking earlier in decent volumes. <br>\r\n<br>\r\nAlan heard, and felt, the giant grunt in annoyance, not being able to see Alan obviously. And Alan breathed a little lighter now, getting his calm back and started to figure out how he was going to get out of this mess. But he was thinking about his plans for only moments, as he froze and a calm panic washed over his body as he watched John's giant thick hand slowly glide under the sofa, patting the ground and the giant fingers feeling out for Alan. Feeling out for him.<br>\r\n<br>\r\nAs the hand slid in further and further, his thick forearms came into view and Alan gulped as his eyes scanned the thick bulgings veings that wrapped around his toned muscles. He could see that the hairs on John's arm were standing on end, and Alan could feel his doing exactly the same.<br>\r\n<br>\r\nHe didn't dare move. One wrong move and he would surely be captured. But maybe this was his fate...</span></div></div>",
            "created":1424581200,
            "id":1938693,
            "title":"Under The Sofa"
        },
        "153222112111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Tongued.",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>As Alan was glued to the spot in the gloomy darkness under the sofa, with John's giant hand feeling for him, Alan saw an oppurtunity. He saw a hole in the carpet, like a cigarette burn perhaps. If he could get to that hole and hide under it and wait until John went to bed or gave up looking for him, then maybe Alan would have a chance to escape. And he couldn't let that oppurtunity go. And he would have to go now, or he would have to wait to see if by chance, John finds him or not. And he didn't want to find out the hard way.<br>\r\n<br>\r\nAlan waited. He assumed that John's line of sight was directed where the giant hand and fingers were gliding over. He waited and waited, until finally John's hand moved to the other side of the sofa, to the left and he heard John grunting as he move his body to reach more easily. <br>\r\n<br>\r\nAlan waited a few more moments, just to make sure John wasn't going to swoop his hand over again. Moments crawled by and finally, Alan slowly breathed out and began to pace quickly towards the gap in the carpet. He didn't know why he was trying to be quiet, there was no way John could hear his feet on the thick carpet at his size, but it was that extra shade of confidence that he wasn't going to attract the attention of the giant.<br>\r\n<br>\r\nThe hole was about 50 meters away now and Alan could taste freedom and as he picked up the pace...<br>\r\n<br>\r\n\"Ah, there you are!\" John said with a tone of amusment and Alan yelped and ran at full pace. He got nowhere near the hole in the carpet before three impossibly gigantic fingers clawed around his tiny body and ticked under him, forcing the tiny fella to roll around in John's now cupped hand as he brought the tiny man out from under the sofa.<br>\r\n<br>\r\n\"I see you like to play games! That's good to know, I think there are plenty of games we could try in our future.\" Alan heard John say through the wrap of giant fingers in the cupped hand. He continued to roll in the soft skin until John finally opened his hand up and Alan looked right up at John, who was looking down on him with a satisfied smile. \"Look at you. Aren't you precious.\" John said, blowing Alan a small kiss.<br>\r\n<br>\r\nAlan cracked.<br>\r\n<br>\r\n\"Fuck you.\" John only laughed at the tiny man's burst of anger whilst helaid in his very hand, impossibly tiny and impossibly vulnerable.<br>\r\n<br>\r\n\"Oh, you'll get your chance, don't worry. I can't believe the magic worked... Bought a spell from the internet as a laugh when I was drunk one night, thought it'd be pretty funny to try out. Didn't actually think it'd work! And now, I have a tiny Alan in my giant hand. Aww!\" John said with a light chuckled and lowered his face towards his hand.<br>\r\n<br>\r\nIn the hand, Alan nearly fell off the side as the crawled backwards away from the giant face quickly looming closer into the space of the cupped hand, and as it got closer, John's giant lips was the cfeature closest to Alan and taking all of his attention.<br>\r\n<br>\r\nAlan had never seen anything like it before! A giant pair of lips were looming right above him, tinted in a dark red from the wine that the giant had been drinking earlier. If Alan stood, tip-toes and reached as far as he could, he could probably touch the soft skin of the thick lips. He watched as the cracks and creases strecthed, as well as the whole pair stretched as John grinned.<br>\r\n<br>\r\n\"You,\" John whispered quietly, softly and warmly. \"You are mine, Alan and this is your fate.\" John said matter-of-factly and Alan screamed as the giant lips puckered high above him and lowered onto him, pushing his tiny naked body into the soft moisturised hand of this horny giant.<br>\r\n<br>\r\nThe soft lips crashed into the tiny guy and Alan yelped, pushing his hands into the puffy lips that now pushed down on him, sliding up and down him as John pecked at him, making quiet smooching noises that was almost defaning to Alan. <br>\r\n<br>\r\nIt went on and on, and as it went on and on, John got more intense and more vigarous with his kissing, and soon Alan could feel the inside of John's upper lip sliding down over his head and torse and legs, softly dragging over him and all Alan could do was kick weakly and scream pathetically. As a combination, it did nothing for him but amuse John further..<br>\r\n<br>\r\nAnd then, as if Alan thought it couldn't get any worse... </span></div></div>",
            "created":1424581200,
            "id":1938702,
            "title":"Alan's Fate"
        },
        "1532221121111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Continue...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Alan felt large wafts of hot drunk air as John laughed a little at the tiny man's pleas, the giant finding it amusing that he would even try to call for help. For Alan however, it was the only thing he could think of doing and it was the only hope he had as he pushed and thrashed against the soppy lips that rubbed and smothered him. His body pushed into the giant's hand as the giant's lips pushed into him and it was relentless.<br>\r\n<br>\r\nSo much so, that Alan started to feel something extremely hot and wet and heavy slap onto his legs. He snapped his head up to look down his body and he had to push John's top lips off of him to see something that made his blood turn cold and now not only the hairs on his neck were on end. <br>\r\n<br>\r\nBefore him, laying on his feet and legs was John's epic whale-like tongue and it looked light it's entire weight had pulled itself out of John's mouth as it sagged on his lower body. Alan didn't dare move. The thick dark red tongue pulsed and undulated on it's own accord, twitching at every moment on his legs. Alan could see in great detail all the little lumps and cracks on the wide surface of the tongue. And now, on his waist, there was a pool of tainted drool that was dripping down the length of the tongue and onto him and on John's hand. <br>\r\n<br>\r\nAlan was forced back into a laying position as the thick tongue rolled over him entirely with ease, Alan not being even a quarter of the width of the giant beast, and covered him in hot slithering flesh. It was like it was burning him, the hot sticky, thick drool that covered him entire body, as well as the alien-like gooey beast that was now slithering all over him, tasting his tiny body and rubbing and grinding his entire front and making Alan twitch and jolt in sexual excitement against his will. And he guessed that John could feel his excitement as the giant chuckled once again.<br>\r\n<br>\r\nThe tiny man tried to push the heavy wet beast off of him but it was no use and quickly, the tip of the tongue scooped under his head and slithered under him, the tip now curling at his feet and, with John now tilting his entire head back to normal level, Alan felt his tiny body slip into the middle crease down the length of the wild monster as it circled under him. He was facing the outside world as the wide pink monster curled higher and higher, whilst pulling him in...</span></div></div>",
            "created":1424581200,
            "id":1938717,
            "title":"Tongued"
        },
        "153223":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A human couple...",
                "A furry couple...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Meeting a couple of... what?</span></div></span></div>",
            "created":1424494800,
            "id":1938125,
            "title":"Meeting A Couple..."
        },
        "1532231":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "M/F",
                "F/F",
                "M/M"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of human couple?</span></div></span></div>",
            "created":1429493940,
            "id":1966946,
            "title":"A Human Couple"
        },
        "1532232":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "M/F",
                "F/F",
                "M/M"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of furry couple?</span></div></span></div>",
            "created":1429494000,
            "id":1966947,
            "title":"A Furry Couple"
        },
        "15323":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Choice 1...",
                "Choice 2...",
                "More stories..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1425963600,
            "id":1946767,
            "title":"More stories..."
        },
        "154":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Female...",
                "Male..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A macro human!<br>\r\n<br>\r\nSo is the character...</span></div></span></div>",
            "created":1388206800,
            "id":1716179,
            "title":"A macro human..."
        },
        "1541":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1...",
                "Story 2...",
                "Story 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716192,
            "title":"Female..."
        },
        "15411":{
            "choices":[
                "She has a genius level IQ (self controlled growth/shrink ray path)",
                "Some freak accident (GTS Emma/multiple giantesses/shrunken people)"
            ],
            "content":"<div class=\"\"><div> <span>Fifteen year old Emma McEvoy was your average teenage girl, in many ways. She liked anime and loud music, tried to fit in at school, and hated studying. With long, dark red curls reaching her waist, brown eyes and a well developed form for a girl of her age, she was definitely considered good looking. Boys would hit on her on occasion, mostly because they were teenage boys, and wanted only one thing. However, Emma didn't swing that way. She never had done. A severe lack of girlfriends attested against her for this, with only one relationship that lasted all of three days; and even that was a dare at her expense. <br>\r\n<br>\r\nOutside of school, she practically lived in jeans and t-shirts, and lived on internet and snacks. Practically normal in every way. However, something about Emma has always made her seem a little... different. Her behaviour wasn't anything out of the ordinary, and as far as her peers were aware, she was just that. Normal. Maybe 'kinda weird', to quote one, however 'kinda' didn't really cut it; not when you took her 'little' secret into account.<br>\r\n<br>\r\nThe main reason Emma hadn't had any real girlfriends was because they were all way too... big for her. She wanted them much smaller; like half her size <i>at best</i>. Ideally, she wanted them smaller than even that, but she knew that wasn't exactly possible. So she wasn't going to be all that picky about it. <br>\r\n<br>\r\nHowever, little did Emma know that her dreams were about to come true; but <i>how?</i><br>\r\n<br>\r\nPerhaps you can shed some light on that situation?</span></div></div>",
            "created":1432262220,
            "id":1981185,
            "title":"Emma's tale"
        },
        "154112":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Secret Experiment",
                "Alien Mistake",
                "Meteorite of mystery"
            ],
            "content":"<div class=\"\"><div> <span>What kind of \"freak accident\" ?<br>\r\n<br>\r\n<br>\r\n___________________________________<br>\r\n<br>\r\nOption 1:<br>\r\n<br>\r\nSecret Experiment Gone Wrong -<br>\r\n<br>\r\nIn need of money Emma secretly signs up to join a so called study looking for experimental subjects.<br>\r\nThe odd part Emma seems to be the only test subject and this test seems to be at a deserted abandoned military facility. Feels like a trap or a trick.<br>\r\n<br>\r\n<br>\r\nThe end results of the experiment? Let's just say Emma will get her wish for smaller girlfriends in a bigger way than she expected.<br>\r\n<br>\r\n<br>\r\n_____________________________<br>\r\n<br>\r\n<br>\r\nOption 2:<br>\r\n<br>\r\nAn Aliens final Mistake-<br>\r\n<br>\r\nEmma may be into Anime but she never expected her life to sort of turn into one.<br>\r\n<br>\r\nOne night Emma is watching Anime on her Cell Phone and taking a break from stargazing outside of her town unaware of Alien explorers visiting the area too.<br>\r\n<br>\r\n_______________________<br>\r\n<br>\r\nOption 3 :<br>\r\n<br>\r\nMeteorite Mystery -<br>\r\n<br>\r\nEmma was camping in the woods with her family dispite her protests. 1 night she was taking a walk away from the campsite when a Meteorite fell from the sky. Emma was the first person there but little did she expect something from it to drastically change her view big time.<br>\r\n</span></div></div>",
            "created":1432292340,
            "id":1981312,
            "title":"Some freak accident (GTS Emma/multiple giantess..."
        },
        "1541121":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "100 Feet tall and chained down to the warehouse floor",
                "Outside 150 Feet tall laying on top of a crushed truck surrounded by people",
                "Naked chained to a lab table 3X her normal size but growing still"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nThe main reason Emma hadn't had any real girlfriends was because they were all way too... big for her. She wanted them much smaller; like half her size at best. Ideally, she wanted them smaller than even that, but she knew that wasn't exactly possible. So she wasn't going to be all that picky about it. <br>\r\n<br>\r\nHowever, little did Emma know that her dreams were about to come true.<br>\r\n<br>\r\n<br>\r\n<br>\r\nEmma McEvoy  was into Anime , Manga and gaming but alas she didn't come from a very financially secure family. They were average and moderate income as such her interests weren't always easily accommodated.<br>\r\n<br>\r\n<br>\r\n1 day she got a letter in the mail addressed to her oddly.<br>\r\n<br>\r\n<br>\r\nDear Emma:<br>\r\nAs result of online surveys you have recently taken for compensation your information was shared with us.<br>\r\n<br>\r\nWe would like to offer you and other selected females ages 15 and under who are receiving this invite too a very special opportunity. <br>\r\n<br>\r\nWe are seeking human female test subjects who are willing to partake in a research study on an exciting new experimental process.<br>\r\n<br>\r\n<br>\r\nFor your participation in this clinical trial you will receive the following compensation:<br>\r\n<br>\r\n$550 Cash<br>\r\n2 $75 Gift Cards to your retailers of choice<br>\r\n3 Free DVD's or Blu-Rays of choice even box sets<br>\r\n1 Free Gaming Console of choice<br>\r\n<br>\r\nAnd a Lifetime Premium or top tier Subscription to the online website or streaming service of your choice.<br>\r\n<br>\r\n<br>\r\n<br>\r\nBased on your age and local laws where you live parental consent is NOT Required to join this study.<br>\r\n<br>\r\n<br>\r\nIf interested simply report to <br>\r\n<br>\r\n1001 Old Hangar Mill Road<br>\r\nOff Route 420 <br>\r\n<br>\r\nDirections are enclosed.<br>\r\n<br>\r\nHave your ride if you get a ride from guest park in <br>\r\nLot A12 then wait there. Enter Bldg A11.<br>\r\n<br>\r\nONLY Study participants and staff are permitted inside the facilities no exceptions for safety, security and privacy reasons as well as to help ensure study results aren't skewed.<br>\r\n<br>\r\n<br>\r\nParticipants should report<br>\r\n<br>\r\nSaturday May 22 <br>\r\nAt 930am <br>\r\n<br>\r\n<br>\r\n <br>\r\nEmma knew the date was close. She made arrangements with 1 of her failed girlfriends promising to compensate her.<br>\r\n<br>\r\n<br>\r\n<br>\r\nA few days later the day had arrived. Sneaking out of the house Emma met Lynn age 17 and a good 1 1/3 foot taller than Emma. Lynn was otherwise average.<br>\r\n<br>\r\n<br>\r\nHer car much to her displeasure was her parents old station wagon. <br>\r\n<br>\r\n<br>\r\nEmma got in the car and helped navigate. On the way her and Lynn talked occasionally.<br>\r\n<br>\r\n<br>\r\n\"So Emma any chance you've reconsidered getting back together\" asked Lynn.<br>\r\n<br>\r\n<br>\r\n\"I told you I'm still into girls but I need someone shorter than me. It's just so damn hard to find\"<br>\r\n<br>\r\n<br>\r\n\"Are you still unhappy with your height?\"<br>\r\n<br>\r\n<br>\r\n\"Not really but since I'm never going to find someone shorter than me besides a midget or a child I wish I could get like a late puberty boost in height\"<br>\r\n<br>\r\n<br>\r\n\"Well you never know it could happen. I'm still here for you if you change your mind\" said Lynn trying to get a little frisky with Emma.<br>\r\n<br>\r\n<br>\r\nEventually they pulled into a sprawled out complex. They found the right parking spot and both exited the car.<br>\r\n<br>\r\n<br>\r\n\"You can't come in Lynn remember\"<br>\r\n<br>\r\n<br>\r\n\"Yea but their stuck up rules didn't say I couldn't watch you go in or stretch my legs\"<br>\r\n<br>\r\n<br>\r\n\"Whatever just stay put\"<br>\r\n<br>\r\n<br>\r\nWith that Emma went into the big warehouse like complex. <br>\r\n<br>\r\n<br>\r\nMeanwhile while Lynn was waiting outside she got shot with tranquilizer darts. <br>\r\n<br>\r\n<br>\r\nInside the building Emma was looking around for anyone but the building seemed empty except a few storage crates.<br>\r\n<br>\r\n\"Is anyone here? Don't tell me this was some prank\" <br>\r\n<br>\r\n<br>\r\nLittle did she know she was being watched. <br>\r\nOnce she was in the middle of the warehouse she was shot at with what appeared to be a couple of tranquilizer darts.<br>\r\n<br>\r\n<br>\r\n\"Ouch\" she yelled a 3 hit her.<br>\r\n<br>\r\nEmma plucked them out and noticed only one was a tranquilizer. The other 2 seemed to be more like syringes.<br>\r\n<br>\r\n<br>\r\n\"What the bell?! Someone drugged me! And... I feel sleepy..Dizzy ... and st-strange\" she said before falling unconscious.<br>\r\n<br>\r\n<br>\r\nElsewhere Emma and Lynn's families had no clue yet that either girl had snuck out much less went so far out of their city.<br>\r\n<br>\r\n<br>\r\nSometime later Emma woke up......</span></div></div>",
            "created":1432404180,
            "id":1981818,
            "title":"Secret Experiment"
        },
        "15411213":{
            "choices":[
                "Face.",
                "Pussy."
            ],
            "content":"<div class=\"\"><div> <span>Her vision groggy and her head pounding, Emma slowly began to re-awaken. Her memory was also conspicuously blurry, however that wasn't what roused her suspicions.<br>\r\n<br>\r\nNo sir. It was the fact that she couldn't move. <br>\r\n<br>\r\nEvery time she tried, the tell-tale clinking noise of chains rattled her eardrums, and her eyes burst wide open, \"...what the?\"<br>\r\n<br>\r\n\"Oh good! You're finally awake.\"<br>\r\n<br>\r\n\"Hunh...?\" Emma grunted, the voice registering in her drug-addled mind. Squinting and looking downwards, to try and find the source of the voice, it took her all the strength she had not to scream!<br>\r\n<br>\r\nNot only had she just realised that she was naked, but there was also a tiny person sitting across her waist!<br>\r\n<br>\r\nSomeone she vaguely recognised...<br>\r\n<br>\r\n\"...Lynn?!\" Emma shrieked, going into full panic mode now, her memory flooding back to her now that she remembered meeting the brunette earlier, \"Wh-what's goin' on?! Why're you so tiny?! Why-\"<br>\r\n<br>\r\n\"Whoa, whoa!\" Lynn yelled, flailing her arms in an attempt to calm her down, \"I'll explain everything, don't worry!\"<br>\r\n<br>\r\n\"Forget explaining! Just get me outta here!\"<br>\r\n<br>\r\n\"But why? Lynn smiled deviously, \"Don't you wanna take part in the experiment?\"<br>\r\n<br>\r\n\"E-experiment?!\" Emma screeched, \"What kinda experiment is this?!\"<br>\r\n<br>\r\n\"Ohh, just testing a few things.\" Lynn answered vaguely, \"You said you wouldn't date a girl taller than you, right? How 'bout now?\"<br>\r\n<br>\r\n\"S-so you <b>shrunk</b> yourself just so you could date me?!\" <br>\r\n<br>\r\n\"No, of course not! I grew you, silly!\"<br>\r\n<br>\r\n\"What's the difference?!\" Emma cried, straining to escape from her shackles, \"It's still really <i>weird</i>, and I don't wanna do this any more! Get me outta here right now Lynn, or I'll-\"<br>\r\n<br>\r\n\"Or you'll what?\" Lynn grinned, \"Somehow escape, run off naked into the wilderness in the vague hope someone will listen to you, and then expect them to listen when you tell them you got a mysterious letter in the post, told no one, and came back a twenty foot tall giantess?\" <br>\r\n<br>\r\nEmma's lips parted. But no words came out. Clearly Lynn had thought this through.<br>\r\n<br>\r\n\"Heh. I thought not. Now, you stay still like a good girl, and we can have some fun, huh?\"<br>\r\n<br>\r\nLynn readied herself to move, but Emma's struggling only increased at this revelation, \"N-no way! I said I didn't wanna date you, Lynn! D'you really thinking making me bigger would change that?!\"<br>\r\n<br>\r\n\"Oh, so you don't wanna fuck this <i>little</i> girl?\" Lynn giggled, leaning forwards and cupping her hands over both of Emma's nipples, provoking a tortured moan from the redhead.<br>\r\n<br>\r\n\"Nyyyuhhhh...\" Emma gasped, her hips wrenching forwards in an obvious display of arousal, \"N-no Lynn! This is wrong!\"<br>\r\n<br>\r\n\"Ohh, but your body isn't agreeing with you, Emma...\" Lynn cackled, gently squeezing both nipples, \"I dunno what you're complaining about, to be honest. I'd take full advantage if I were in your situation.\"<br>\r\n<br>\r\n\"Well I'm not as fucked up as you, Lynn!\" Emma growled, fighting desperately to suppress her urges, \"This is rape! You can't do this!\"<br>\r\n<br>\r\n\"Then maybe you could just let me?\" Lynn asked, sounding genuine for the first time since Emma's waking, \"That'd remove the 'rape' problem, and I'll do <i>anything you want.</i>\"<br>\r\n<br>\r\n\"Anything...?\" Emma's eyes widened. Her hips gave another involuntary buck forwards, and Lynn took the hint, \"Heh. Looks like your body's speaking for you.\"<br>\r\n<br>\r\nAnd before Emma could so much as object, Lynn was already on the move, clambering towards her...</span></div></div>",
            "created":1434074760,
            "id":1991194,
            "title":"Triple trouble!"
        },
        "154112132":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Began shrinking back to normal size",
                "Growing to 50 Feet tall still chained.",
                "Growing to 120 Feet tall!  Free of chains but very horny"
            ],
            "content":"<div class=\"\"><div> <span> Before Emma could so much as object, Lynn was already on the move, clambering towards her pussy.<br>\r\n<br>\r\n<br>\r\nLynn reached forward and massaged the enlarged pussy lips before her. Emma let out more involuntary moans as she became slightly moist.<br>\r\n<br>\r\n<br>\r\n<br>\r\n\"Lynn please this isn't right besides me and you are over\" panted Emma.<br>\r\n<br>\r\n<br>\r\n\"But how can we be over when we've barely even started? All those times you got me all hot and bothered only for us to cut it short... I think you have it wrong Emma we are just getting started\" said Lynn slyly.<br>\r\n<br>\r\n<br>\r\n<br>\r\nLynn then balled her right fist and inserted it into Emma's vagina. More moans and gasps were heard. Lynn could feel her fist becoming wet as Emma was getting wet too.<br>\r\n<br>\r\n<br>\r\nTaking advantage of this Lynn inserted her arm a bit deeper about another 3 inches getting more moans. Lynn then begins to twist her arm.<br>\r\n<br>\r\n<br>\r\n\"Mmmpphh L-Lynn p-p-please\" Emma panted and begged getting closer and closer to her breaking point.<br>\r\n<br>\r\n<br>\r\nBy now Emma's nipples had gotten hard too and the draft in the room was delivering more small jolts of pleasure.<br>\r\n<br>\r\n<br>\r\nEmma was on the verge of orgasm when she felt strange. She couldn't place the feeling but it was adding fuel to her pleasure.<br>\r\n<br>\r\n<br>\r\nSuddenly Emma...</span></div></div>",
            "created":1434097200,
            "id":1991343,
            "title":"Pussy."
        },
        "1541121322":{
            "choices":[
                "I could just eat it up!\"",
                "it could just eat me up!\"",
                "it wants someone to play with!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm...\" Lyn mused, watching the already huge Emma grow to even larger sizes, still somehow remaining chained to the table, \"I guess I wasn't 'little' enough for you, huh?\"<br>\r\n<br>\r\n\"Lynn, please...\" Emma half moaned, half sobbed, \"Just let me go, please. I'll do anything...\"<br>\r\n<br>\r\n\"You're a towering giantess, begging for mercy from a tiny girl who only wants to please you?\" Lynn raised a cynical eyebrow, \"Hell, I bet you could probably break free of these chains right now, and have your wicked way with me!\"<br>\r\n<br>\r\n\"But I don't wanna do that...\" Emma sighed, \"I-I... just want things to be normal again....\"<br>\r\n<br>\r\n\"Ah. Well you're boring, aren't you?\" The tiny teenager spoke from between the fifteen year old's thighs, \"Are you <i>sure</i> there's nothing I can do to make this experience more... interesting?\"<br>\r\n<br>\r\n\"...let me go?\" Emma asked, the dim light of hope still present in her eyes. However, those hopes weren't lasting long, \"Hell, if you could get me back to... I dunno, ten feet tall, I'd be forever grateful.\"<br>\r\n<br>\r\n\"But I wouldn't be <i>little</i> enough for you if you were ten feet tall, would I?\" Lynn smirked, forcing an almighty moan and lurch from the fifty foot redhead, \"And if I can't turn you on at that size, what's the point in you being smaller?\"<br>\r\n<br>\r\n\"Being NORMAL?!\" Emma shrieked, shaking the walls with the sheer volume of her voice, \"I never signed up for this!\"<br>\r\n<br>\r\n\"Err, you kinda did.\" Lunn pointed out, \"Remember, that thing you literally <i>signed?</i>\"<br>\r\n<br>\r\n\"But I didn't sign up to being made into a freaking giantess!\" Emma cried, thrashing against her surprisingly sturdy restraints, \"I'm gonna be such a freak now, and everyone else is so tiny, and- Nnngggh!\"<br>\r\n<br>\r\n\"Sounds like a bunch of tiny people is what you <i>want</i>, Emma dearest.\" Lynn smiled, running her hands along the giantess' pussy, large enough to swallow the brunette whole, \"Wouldn't that be nice? A bunch of <i>little </i> slaves, to do your sexual bidding?\"<br>\r\n<br>\r\nEmma let out another moan, \"Nng! Quit it, Lynn! And get away from there!\"<br>\r\n<br>\r\n\"Aww, but it looks so juicy...\" Lynn mock complained, resting against the giantess' mound and forcing more squirms out of her, \"Why, I bet-</span></div></div>",
            "created":1436216940,
            "id":2004211,
            "title":"Growing to 50 Feet tall still chained."
        },
        "15411213221":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Use the power of orgasm to change Emma’s mind",
                "Emma breaks free! Fix me or else! Lynn’s deception and Emma enlarged more",
                "The enlargement wears off for now! Lynn’s disappointment Emma’s temporary relief"
            ],
            "content":"<div class=\"\"><div> <span>Emma let out another moan, \"Nng! Quit it, Lynn! And get away from there!\"<br>\r\n<br>\r\n\"Aww, but it looks so juicy...\" Lynn mock complained, resting against the giantess' mound and forcing more squirms out of her, \"Why, I bet I could just eat it up”<br>\r\n<br>\r\n<br>\r\nEmma’s eyes widened.<br>\r\n<br>\r\n“In fact I think I will”<br>\r\n<br>\r\nLynn began to lick, bite, kiss and suck on the glory that was in front of her.<br>\r\n<br>\r\nGasps and moans of pleasure kept interrupting Emma’s protests.<br>\r\n<br>\r\n<br>\r\n“Nng-huff- Lynn P-please s-stop nng this.... mmm.. isn’t right. I don’t want this..<br>\r\nMmm. P-please I just... nngg... want to end this and return to normal”<br>\r\n<br>\r\n<br>\r\n“Silly Emmy that’s not what your body says” said Lynn slyly.<br>\r\n<br>\r\nNext</span></div></div>",
            "created":1512498000,
            "id":2424317,
            "title":"I could just eat it up!\""
        },
        "1542":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1...",
                "Story 2...",
                "Story 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716193,
            "title":"Male..."
        },
        "155":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Female...",
                "Male..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A normal-sized human!<br>\r\n<br>\r\nSo is the character...</span></div></span></div>",
            "created":1388206800,
            "id":1716182,
            "title":"A normal-sized human..."
        },
        "1551":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A Rumble In The Night",
                "Story 2...",
                "Story 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716195,
            "title":"Female..."
        },
        "15511":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Choice 1...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Jenna awoke with a jump.<br>\r\n<br>\r\nShe lay on her bed, still slightly drunk from the night out with her colleagues having celebrated her friends promotion in the city. For some reason, her heart was beating a bit more rapidly than normal. Maybe, she thought, that she had a nightmare that snapped her from her slumber. Or maybe even someone had slammed a door somewhere down the corridor. The joys of living in an apartment building on a Friday night in the city, it was hard to get a moments peace.<br>\r\n<br>\r\nThe apartment. Her apartment. She was confused, how the hell did she even get back here? She lived on the 24th floor of this high-towering sky-scraper and she was positive she was far too drunk to make it here herself. She lazily wafted her arm around the bed, but she was definitely alone.<br>\r\n<br>\r\nShe slowly parted one of her eyelids and glanced at her clock on her bedside table, struggling to focus on the illuminated display.<br>\r\n<br>\r\n<i>05:18</i><br>\r\n<br>\r\nThe dark red numbers glared at her in the dark. <br>\r\n<br>\r\n\"Ugh...\" she groaned. The 27 year old woman stretched in her bed and sighed. She could feel the hangover creeping on her already, her head lightly throbbing and her mouth dry, her throat coarse. She hated smoking and she instantly regretted her social smoking, as per usual whenever it was the day after having a night out. Even though the thought of getting out of bed right now was painful but the on-coming storm of a horrible hangover loomed and so Jenna forced herself to stagger from her bed.<br>\r\n<br>\r\nAs she stood on her hardwood floor, her long oak-brown hair cascaded down her naked back. As she took her first step, she stumbled slightly and just managed to keep her balance. With her next step, Jenna pointed herself in the direction of her en-suite bathroom and walked slowly to the door. It was a pain having such a large bedroom at this state, she just wanted a glass of water in an instant but instead it felt like an Earth-age to get there. But before she knew it, her hand gripped the handle and swung the door open and pulled on the light chord and suddenly she was blinded.<br>\r\n<br>\r\nJenna groaned again from the bright light, squinting and almost blindedly reached for the cabinet above the sink and pulled out her pain killers and a small glass. Shutting the cabinet door, she looked at her face reflecting back at her in the small bathroom. She looked a state, but she was still beautiful nevertheless. <br>\r\n<br>\r\nFilling her glass of cold water, she popped a couple of tablets into her mouth and took a swig from her glass and swallowed. Jenna accepted that this wasn't going to be her first tablets for the day and it was a good thing she wasn't working later. She yawned and filled her glass again.<br>\r\n<br>\r\nAs she turned off her tap, a rumble of thunder in the distance theatened her already-throbbing head.<br>\r\n<br>\r\n\"Great,\" she muttered to herself. \"Just what I need.\"<br>\r\n<br>\r\nThe light flickered but Jenna hardly noticed as she pulled on the chord and closed the door, walking back to her bed with the glass of water in hand.<br>\r\n<br>\r\nAnother rumble, but sounding closer this time.<br>\r\n<br>\r\n\"Oh go away for fuc-\" before Jenna could finish her sentance, an impossible blinding light shone through her big black curtains, which were thick for good reason, and her whole apartment basked for only a moment in this light before fading to darkness. A shattering boom near blew open her head, making her ears shriek with pain and it shook her whole world with Jenna falling face forward with a scream and dropping her glass that smashed as it hit the floor.<br>\r\n<br>\r\n\"Holy shit! What the fuck was that?!\" For a moment, she thought that maybe it had been an earthquake, but she knew full well that earthquake don't produce a bright light and a boom like the one that had nearly sent her completely deaf. <br>\r\n<br>\r\nAnd then there was nothing. Nothing but rain beginning to patter against her windows.<br>\r\n<br>\r\nShe was shaking in the dark, paralysed on the floor in shock and slight fear. Jenna waited for another rumble from the storm, but nothing came. Nothing but...<br>\r\n<br>\r\n\"What... <i>What is happening out there?</i>\" she thought. She could just hear what she thought like screaming. And car alarms whailing and even horns beeping way below on the city streets. And then there was more commotion, more panicking noises.<br>\r\n<br>\r\nShe slowly forced herself onto her feet and treaded carefully to her wall-to-wall window, and slowly, she pulled the curtain away. There was nothing there but the city that could be seen from her living space, the countless lights twinkling in the dark night sky, the rain on the window giving it a look of water-painted beauty. Curiously, she opened the curtain more so that she could look down the city on her left and all seemed fine. But what she couldn't really see was that far below, people were running in panic in the direction she was looking. <br>\r\n<br>\r\nShe frowned, confused as she could still hear the panic below, but as she turned her head to the right and looked at what finally was causing the commotion, her heart was in her throat and she was turning white very quickly, feeling her legs begin to shake...<br>\r\n<br>\r\n<i>\"No, no it... Can't be...!\"</i><br>\r\n<br>\r\nJenna backed away from her window and in an instant she slammed them shut again. Her heartbeat was booming in her ears now, her throat felt like it was swelling and her breathing became erratic from the shear shock that had just washed over her in an instant from the sight of the...<br>\r\n<br>\r\n<i>\"How is this possible...?! It..\"</i> But no matter how much Jenna tried to re-assure herself, there was no way that she oculd lie to herself of such an impossible truth.<br>\r\n<br>\r\nShe stood frozen on the spot for moments longer than she knew, balancing herself on the balls of her feet. But if she could see it, and everyone else could see it then surely...<br>\r\n<br>\r\nShe snapped from her funk and dashed to her TV that was mounted to the wall and quickly turned it on. In the few seconds that it took for the screen to come on, more panic could be heard not only from the city below, but from the rest of the occupants in her building. She could hear her neighbours beginning to scream and run wild along the corridors just outside her own door.<br>\r\n<br>\r\nWhen the screen flicked on, nothing but black and white noise was brightly shining at her. She picked up her remote and tried to flick through the channels, looking for some kind of news but none came. Nothing, but signal noise. In panic, she dashed for her phone on her bedside table, but she quickly found that there was no signal, no way of communicating to and from the outside.<br>\r\n<br>\r\nShe sat frozen, staring at the animated pond water animated wallpaper on her phone, wondering what to do. What could she do? What could anybody do? She glanced back to her clock that had caught her eye in the light from the TV and quickly fiddled with the knobs and switched the radio on.<br>\r\n<br>\r\nA distorted woman's voice that sounded that it had been recorded in the fifties quietly spoke through the mono speaker. \"...gency transmission. This is an emergency transmission. This is an-\"<br>\r\n<br>\r\n\"OH FOR FUCKS SAKE!\" She screamed at the radio, slowly beginning to weep in sheer fear and panic like nothing she had ever felt before. Holding her hands on her lap, she listened to the repeated message over and over again hoping that another voice would interrupt the woman's recording but after a few minutes, the message was still repeating in the gloom.<br>\r\n<br>\r\nThis had given time for Jenna to think about what she had seen. Was she going crazy? Had someone drugged her? But it couldn't be drugs, surely, that could make such a vivid reality around her so extreme.<br>\r\n<br>\r\nHow could something be so gigatnic, how could it be physically possible? As she pondered and pondered, sobbing as she did, she came to wonder why...<br>\r\n<br>\r\nWhy hadn't it moved yet? Surely she would have felt it, seen it move...<br>\r\n<br>\r\nWas she even sure she saw what she saw? Jenna's eyes locked onto the curtains that she had hastily closed. She wanted another look, another reason to doubt her sanity.<br>\r\n<br>\r\nSlowly getting back to her feet, she made her way to the window with the laminated floor creaking under her feet. Gripping onto the curtain again, she breathed heavily and slowly with her heart still racing in her throat. She closed her eyes and opened the curtains, and hesitated.<br>\r\n<br>\r\nTurning her head, Jenna opened them again and saw what she hoped wasn't still there, lingering in the darkness. She pressed her naked body to the cold glass, pushing the side of her face to see if she could get a better look from her window. This was probably the only time that she damned the fact that her windows didn't open. But still, she did indeed get a better look.</span></div></div>",
            "created":1391576400,
            "id":1739871,
            "title":"STORY START: A Rumble In The Night"
        },
        "155111":{
            "choices":[
                "Sees some more older kids, teens, and adults taking showers or having sex?",
                "He goes back to the ship?",
                "Henry cheats and undresses some tiny young people?"
            ],
            "content":"<div class=\"\"><div> <span> Jenna looks out the window to see a giant, humanoid shaped creature walking down the street. The giant’s face is invisible to her, because it is wearing a silver colored, science fiction looking spacesuit, and helmet. Behind the astronaut looking giant is a mountain size spacecraft that has landed on part of the city. Fires are blazing behind the giant, and there appear to be other giants as well behind it, working on the spacecraft. She could also see fighter jets, tanks, helicopters, and ground troops firing on the approaching giant, and on the mother ship. However, nothing is getting through. All of these creatures and the mother ship seem to be protected by some kind of energy shield. The shield is allowing slower moving objects to pass through like people who are fleeing the battle zone, but it is stopping vehicles, and any projectiles from hitting these giant alien creatures. <br>\r\n<br>\r\n She could also see that the giants seem to be making every effort to avoid stepping on the fleeing civilians, and they are not retaliating against the tiny human military forces. She also hears on the radio, “Reports are coming in that many of the people from the destroyed section of the city have suddenly reappeared in a nearby city, unharmed.” However, the military continues its fruitless assault on these aliens. She watches as the giant, space suited creature carefully walks towards her building, and its black tinted face is pointed in her direction. She notices it is carrying an empty see through, hamster like cage, big enough for several humans. <br>\r\n<br>\r\n At the same time, on a floor above hers, Alex has just gotten out of the shower. The 29-year-old male model/actor is drying himself off, when he hears rumbling, and explosions outside. Curious, the blue eyed, brown haired, single, Caucasian hunk wraps a towel around his bare waist, and looks outside. He sees a giant spaceman walking towards his building, and he slaps his smooth, clean-shaven face to make sure he is not dreaming. He still does not wake-up, and out of a sense of shock, he drops his towel and leans his naked body against the window as well. <br>\r\n<br>\r\n In an apartment below Jenna’s, two naive, but extremely attractive naked White teenagers are making love. Emily is currently in her bed, resting on her back, with her longtime boyfriend Eric riding her on top. Emily’s parents are away for a few days, so she invited her boyfriend over. Wanting to experiment a bit, the two attractive science fiction nuts are making love with the lights on. The 16-year-old couple is going at it, when they see the huge UFO landing on the other half of the city. They are about to stop, when they decide that they are about to die anyways, so they might as well die making love to each other. As they hump each other, they see a giant spaceman walking towards them, and get excited. Emily asks, “Do you think he, she, it sees us?”  <br>\r\n<br>\r\n “I hope so, maybe he wants us for his zoo, or as living dolls,” Eric responds.<br>\r\n<br>\r\n “Do you think it is going to eat us,” Emily asks while licking her lips.<br>\r\n<br>\r\n “Or feed us to its pets,” Eric says.<br>\r\n<br>\r\n The naked young blonde haired couple get up, run over to the curtain less window as it approaches. Still standing, Emily bends over while Eric does her vaginally from behind. As he does her from behind, Emily’s large perky are bouncing around. The nude couple watch as the giant spaceman reaches out its huge hand towards the building. <br>\r\n<br>\r\n Meanwhile, the 150 foot tall spaceman who is walking towards the building thought the scavenger hunt the others sent him on was going to be fruitless. The others wanted to get rid of him, so they told him to go collect some living human specimens for study. The only catch, the humans have to be nearly, or completely naked. He knew from the reports that he read that humans nearly always wore clothes. Imagine his surprise when he saw a healthy looking, tiny female standing in the window naked looking at him. He also saw a healthy looking, tiny naked male, in the floor above hers looking at him too. Then he saw a younger naked couple making love in the window below the lone female.” Jackpot,” he thought to himself. “At least two breeding pairs of humans found.”<br>\r\n<br>\r\n With little effort, the giant who we will call Henry gently smashes through the two window and abducts the Jenna and Alex. The two tiny naked human specimens are fearful but unharmed. He then reaches his hand into the lower apartment. The window is wide open, and he can tell that the young couple is climaxing together as he gently grabs the tiny nude couple. The couple is now finished as they are placed inside the giant hamster cage with the other two. Henry continues to look inside each window, hoping to see another healthy looking, tiny naked person to add to his collection. Henry, the giant anthro…</span></div></div>",
            "created":1426309200,
            "id":1948363,
            "title":"Jenna the tiny specimen."
        },
        "15512":{
            "author_id":"colin",
            "author_name":"Hereward",
            "choices":[
                "Choice 1...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Jenny Parkinson taught history at Bromfield Community College. She was a brunette in her late thirties, 5'5\" with hazel eyes. Last year she had faced the rather bothersome situation of a divorce, which left her with three children. However her eldest daughter, Alice, had left home to study a graduation course. The bad news was that her son, Michael, was the bad apple who was starting the upcoming school year as one of her students, which would give him the misplaced belief that he could get away with murder... metaphorically speaking. As to her other daughter, Carol, she was quite well-behaved both in terms of being the youngest of her kids and in terms of being a preteen.<br>\r\n<br>\r\nJenny had spent a well-earned break over the summer at the seaside while Alice kept the home and her ex had the opportunity to care for the other two. Being something of an amateur archaeologist she had spent some of the daytime digging and scraping about the beaches and sea cliffs when she happened upon a most mysterious artifact, a whistle apparently carved from a stag's antler. In her leisure hours after returning home she cleaned and buffed this item and found an inscription upon it... <i>Iere avertentem et gelu.</i> She took the opportunity to pass on a copy of this to a colleague who had a rudimentary knowledge of Latin who provided a translation of <i>They went, misleading the frost.</i><br>\r\n<br>\r\nEventually the school term started. Her classes were somewhat rowdy but bearable in the initial weeks, but after a month had passed she then found herself walking into a scene of total anarchy. She strained to keep the class under control but her son kept stoking the fire of discord, whereupon she remembered having the self-same whistle in her jacket. Pulling it out she prepared to silence the mob with a blow that would surely be taken in the manner of a whistle signaling the end of a break. She looked upon the whole class, put the whistle to her lips, and blew.<br>\r\n<br>\r\nShe was shocked by what she witnessed while she blew. Before her very eyes all the students in her class, everything they wore or were physically carrying at the time, shrank away so fast that, by the time she stopped blowing, she could barely see them. She was now transfixed as she looked between her find and the now deceptively empty classroom. What had she found?</span></div></div>",
            "created":1397970000,
            "id":1783287,
            "title":"STORY START: Whistle 'n' Dwindle"
        },
        "1552":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "An Unexpected Adventure",
                "Story 2...",
                "Story 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1388206800,
            "id":1716196,
            "title":"Male..."
        },
        "15521":{
            "author_id":"nobodyx",
            "author_name":"The Languid Lizard",
            "choices":[
                "Choice 1...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Andre felt the rain and cold in the air, the soaking wet clothes sticking to his skinand streams of fresh rain water poured off his skin. He was not in the most ideal of conditions, as he was lost, tired and hungry. The mountain slope had been unkind to him, falling and tumbling into the valley, losing all his possesions and items in the process. He had no means to survive, no ways of communicating with anyone nad he certainly did not know a way out of the valley forest he was in. Andre felt hopeless.<br>\r\n<br>\r\nSitting down on a log, he rested his head in is hands and sighed heavily. \"I may as well just give up.\" He had planned the trip to be simple, yet fun filled camping trip. His life had become boring and dull and he needed adventure. Packing up a weeks worth of supplies and food, he traveled out in search of something yet he didn't know what, he just wanted an adventure. Now it seemed to be all so hopeless. Endless cracks of thunder and lightning shook the skies and the rain came down even harder.<br>\r\n<br>\r\nKTHUMP!<br>\r\n<br>\r\nAndre's eyes opened widerthan he could open them. The large massive boom he had heard and felt did not come from the sky, but in fact from something hitting the ground. Andre slowly turned his head and looked at an amazing site he found both thrilling and wondrously chilling: it was a large foot, but not just any foot. It looked as if it belonged to a..</span></div></div>",
            "created":1388293200,
            "id":1716441,
            "title":"STORY START: An Unexpected Adventure"
        }
    },
    "info":{
        "author_id":"nicknack",
        "author_name":"NickNack",
        "brief_description":"A variety of stories with a variety of sizes. 15,000+ views!",
        "created":1388265300,
        "description":"<td align=\"left\" class=\"norm\">--- --- ---<br>\r\n<b>UPDATES</b><br>\r\n--- --- ---<br>\r\n<br>\r\n<b>20/04/15 - Added a few choice chapters and added a few chapters myself of course. Enjoy!<br>\r\n<br>\r\n22/02/15 - Done some cleaning up in the chapters, and I've also put STORY START: on the beginning chapters of all the stories, so it's easier to navigate and see where the stories chain up when you're looking at the chapter list. Enjoy!<br>\r\n<br>\r\n16/02/15 - Been a busy year, but I'm going to start adding chapters on a regular basis, as such I've uploaded a few chapters just within the last couple of weeks. As well as a title change, the story is back! <br>\r\n<br>\r\n05/02/14 - This was primarily a furry story, but I have now added choices for human stories an/or a mix between the two. I have therefore changed the title of this story.<br>\r\n<br>\r\n28/12/13 - I have finished creating all the story choices, and there is a lot!</b><br>\r\n<br>\r\n<b>*I'll fill this out soon in more detail*</b><br>\r\n<br>\r\nPlease enjoy this size-changing epic. I wanted to start this to create a universe with furries and/or humans of all sizes.<br>\r\n<br>\r\n<b>Rules</b><br>\r\n<br>\r\nThe reason I add such rules is because when I read other stories, they are usually full of inconsistencies and endless options. I would like to make this piece of work something that a reader can jump into and immediately become engrossed in the story. So, please follow these simple rules and let's make something great!<br>\r\n<br>\r\n- <b>Please keep the writing in third-person.</b><br>\r\n<br>\r\n- If you wish to add to the story, please keep your chapters <b>at least 1000 characters long</b>. If they are short and doesn't add anything to the story I will either edit or delete your chapter. If you want to create more options for the reader, please clearly explain their choices. <br>\r\n<br>\r\n- <b>Do not add chapter-after-chapter with yet more choices or \"options\" as this goes on forever and adds nothing to the story and I will delete them accordingly.</b><br>\r\n<br>\r\n- If you are wanting to start a new story, then make a new story using one of the \"intro-options\". Do not give readers endless options as to what character they want to be/read. Just start your story and go from there.<br>\r\n<br>\r\n<b>- No blood/gore and bodily waste<br>\r\n- No deaths</b>. </td>",
        "id":1968860,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/101809.jpg",
        "last_full_update":1558489620,
        "modified":1558489620,
        "pretty_title":"A Variety Of Sizes"
    }
}