{
    "chapters":{
        "1":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "you are abducted as a seven year old",
                "you were abducted as a seven year old and have grown up",
                "you are abducted as a teenager",
                "you are abducted as an adult",
                "your parents were abducted and you were born a gladiator"
            ],
            "content":"<div class=\"\"><div> <span>The arena world called pyros is made of three main parts, the planet’s surface is wild like a jungle with plants from throught the universe and some from earth but the conditions are terrestrial and so survival is possible and is treated as a communal area in which gladiators live and harvest natural supplies such as wood and rocks, the orbiting space stations above the surface holds the numerous arenas and is the second part the third part is the lockers, boxes the size of a small room, one for each gladiator in which he can store his weapons and food and perhaps sleep in the if they so choose, finally on the north and south poles of the planet where there can be no life at those temperatures lies fortified towers that control the teleportation of the gladiators between the three areas. what age are you when you are abducted?</span></div></div>",
            "created":1304312400,
            "id":1098565,
            "title":"the new guy "
        },
        "11":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "male and competent",
                "female and competent",
                "male and incompetent",
                "female and incompetent",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female? And are you competent or incompetent as a gladiator?</span></div></span></div>",
            "created":1304312400,
            "id":1098574,
            "title":"you are abducted as a sven year old"
        },
        "113":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Another new young gladiator - a girl your age, with the same equipment as you.",
                "A young gladiator a couple years older than you. He looks tough and has a spear.",
                "A wild boar, taken from earth. Its tusks look sharp."
            ],
            "content":"<div class=\"\"><div> <span>You are a seven year old boy abducted to fight in the arena for the entertainment of aliens. You are small, weak and slow, with no experience in fighting or surviving. Unless you are smart, you will probably die a lot. At least if you do die, you will be reborn as your brain is cloned, although dying still promises pain and humiliation. Consistently poor gladiators will eventually stop being reborn for being too useless, leading to permanent death. For your first fight, you are going to be given a fairly easy fight to evaluate your capabilities and ease you into your new life. You are made to wear only a loincloth and are given no armour, although you are at least given a small knife so that you have some means of defending yourself. The arena master tells you this will be the only time you are given such a privilege, however. The pit master gives you three choices to take for your first fight. None of them look TOO threatening, although each seems to promise a pretty tough fight.</span></div></div>",
            "created":1447909200,
            "id":2064206,
            "title":"male and incompetent"
        },
        "1131":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Raise your knife up high and charge her",
                "Stand your ground - wait for her to attack",
                "Observe your surroundings and see if you can get an advantage"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go with the young girl. As you are both equipped the same and both lack experience in fighting, you decide it would be the easiest fight of the three choices. You recognise her vaguely - she was probably abducted at the same time as you. The arena master nods at your choice, and sends both of you to the gates on opposite sides of the arena. As this is a new pair fighting, you have been put into a smaller side arena rather than the large, main arena where well known gladiators fight. As you walk towards the gate, you can hear the crowd cheering in anticipation of the bloodshed. You know that people will be watching. You become a little embarrassed - you hope that you aren't overpowered by a young girl in front of thousands of people. You can see her through the gate on the other side of the arena. You don't have time to notice much other than her small size and lack of armour - much like you - before the announcer booms the pre-match commentary. It is in a strange, alien language, and you don't understand, although you realise the announcer is hyping the fight, explaining who is taking part and trying to get people to bet. After a minute of his talking, the gate in front of you crashes open, and you are pushed into the arena by a forcefield. The girl stands looking at you, trying to find a weakness. What do you do?</span></div></div>",
            "created":1447909200,
            "id":2064212,
            "title":"Another new young gladiator - a girl your age."
        },
        "11311":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Keep charging",
                "Leap at her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You raise the small metal knife above your head, lead out a cry and charge forward. The girl adopts a defensive pose, ready to dodge out of the way or block your attack. You are nearly upon her. How do you attack?</span></div></span></div>",
            "created":1447909200,
            "id":2064214,
            "title":"Aggressive Fighting"
        },
        "113111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Swing your knife as soon as you are in range",
                "Barge into her and swing the knife down"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You keep running straight at her - how do you plan to attack her?</span></div></span></div>",
            "created":1447909200,
            "id":2064216,
            "title":"Keep charging"
        },
        "1131111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Attack her",
                "Defend - wait for her to attack you"
            ],
            "content":"<div class=\"\"><div> <span>You charge at the girl, as she tenses herself and prepares to counter attack. As soon as you are in range, you suddenly stop and swing your knife. The girl is caught off guard by your sudden change in momentum, and you manage to cut her arm. She gasps in pain, and takes a step back, preparing to fight you. How do you fight?</span></div></div>",
            "created":1447909200,
            "id":2064223,
            "title":"Swing your knife as soon as you are in range"
        },
        "11311111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Launch another attack - teach her not to hurt you!",
                "Step back"
            ],
            "content":"<div class=\"\"><div> <span>Seeing her on the defensive and injured, you continue pushing the attack, and make a wide swing towards her. However, it is a poor, slow attack and he easily dodges, jabbing the knife into your side before pulling it out. The wound hurts, but luckily it is a minor injury. You will still be even less effective now though.</span></div></div>",
            "created":1447909200,
            "id":2064224,
            "title":"Injured!"
        },
        "113111111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Try to hit her",
                "Try to free your arm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You angrily swing your knife at her again. However, once again the attack is slow and weak, and she easily steps aside, grabbing your arm and twisting it, forcing you to drop the knife. The girl has your arm twisted painfully and you are unarmed.</span></div></span></div>",
            "created":1447909200,
            "id":2064225,
            "title":"Launch another attack - teach her not to hurt you!"
        },
        "1131111111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "You wake up in a strange room..."
            ],
            "content":"<div class=\"\"><div> <span>Furious, you try to swing your free arm at her. She is surprised for a moment, and you manage to hit her lightly on the chin. However, this just seems to anger her, and she quickly knees you in the face and releases your arm, before stabbing you in the stomach before you can react. The pain is sharp and you fall to the ground, clutching your bleeding abdomen. As you lie there, the girl slits your throat and ends your suffering. Despite your defeat, you hear the cloud cheering as your vision goes dark. You might have been an easy kill, but your aggressive nature made for an exciting show!</span></div></div>",
            "created":1447909200,
            "id":2064226,
            "title":"An entertaining fight"
        },
        "1131112":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "You wake up in a strange room..."
            ],
            "content":"<div class=\"\"><div> <span>You keep running straight at the girl - she doesn't flinch, and her eyes stare straight at you. As you prepare to bring your weapon down, she springs like a snake, jabbing her knife straight at you. It pierces your unclothed chest and goes straight into your heart. Blood starts pouring from the wound, although you are dead before you can feel anything, and your corpse drops to the ground face first as the girl removes the dagger. The crowd applauses politely, although they are disappointed in your poor performance. The girl, although frightened, bows and walks out of the arena, taking your knife with her. That is the last thing you remember until you are reborn - just like that, you have lost your first fight.</span></div></div>",
            "created":1447909200,
            "id":2064219,
            "title":"Poor Strategy"
        },
        "11311121":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Follow the alien through the door"
            ],
            "content":"<div class=\"\"><div> <span>You slowly open your eyes - there is a bright light, and you can't see for a moment. As your eyes adjust, you see you are in a clean white room, like a doctors office. There are strange alien machines marked with odd runes from the aliens' language. You try to move your arm, but you can't; it seems to be strapped to the chair you are sat in, as are your legs. You look down and realise the precarious situation you are in. You are completely naked, and are strapped to a large chair, like what you might find at a dentists. Your arms and legs are shackled to the chair, and you can't move them an inch. You wonder where you are - is this hell? You clearly remember getting stabbed in the chest, yet your chest feels fine and you can't see any signs of injury or surgery. Before you can ponder too much though, an alien enters from the door behind you. You can't get a good look at him, but he is bipedal and large bodied. He is wearing a metal outfit around him, leaving only his head exposed. He has grey, wrinkled flesh and two black eyes. His mouth must be inside his outfit, because you can't make it out.<br>\r\n<br>\r\n\"Oh, you are awake.\" The creature notes in an accented voice. \"At least you can be reborn properly.\"<br>\r\n<br>\r\nYou can't respond, as you feel terrified and confused in equal measure. <br>\r\n<br>\r\n\"Don't worry. I shan't hurt you. After all, why would I have revived you if that were the case?\" The creature asks, chuckling to himself. \"I suppose I should explain what is going on. You are a slave to us. We don't expect you to work - rather to fight in our arena, as I'm sure you are aware. Your first fight was rather pathetic, though. I hardly wanted to rebirth you. How does that work, I suppose you wonder? Well, we clone your brain straight from your corpse, and use your DNA to create a new body. You are exactly the same as you were when you died, physically at least. Anyhow, I shall let you go. I doubt much was explained to you before your fight. Sorry about that, but one of our champions didn't show up so we had to arrange your fight quickly. Come, walk with me, I shall explain your situation.\"<br>\r\n<br>\r\nWith that, your shackles unbuckle, and the alien leaves the room, humming a strange song. You look around, and finding nothing you can take, decide to follow him.</span></div></div>",
            "created":1447909200,
            "id":2064233,
            "title":"Reborn"
        },
        "113111211":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Go to the planet",
                "Go to the arena"
            ],
            "content":"<div class=\"\"><div> <span>The alien leads you down a well-lit corridor. The walls are metal and clean, and electric lights leave the corridor well lit. You are still naked, and feel embarrassed as you walk past several other aliens, as well as the odd human, although barely anybody cares enough to look at you. <br>\r\n<br>\r\n\"This is the rebirth station. When you die, if we choose to, we can recreate you exactly the way you were when you died. This is what happened to you. After all, abducting humans is dangerous and expensive. If we get seen, we are in huge trouble, so we have to do it carefully. We can't take too many at once either - if a bunch of people go missing, people would get suspicious. We brainwash you as soon as you are aboard - nothing too much, otherwise your brain would get fried, but just enough that you don't worry about going back, and that you accept us as your leaders.\"<br>\r\n<br>\r\nYou turn a corner, and one of the walls is decorated by large, floor to ceiling windows. Through them, you can see a huge city, the most predominant building being a large oval structure that you think must be a stadium - probably the arena. <br>\r\n<br>\r\n\"Some of you can be put to work, but most get brought here to amuse us. We enjoy watching you tear each other to pieces. You are a barbaric race, but you come up with fantastic ways of killing. Very entertaining. And so you fight for us. You die for us. And then you are reborn, if we choose it. This time we did choose it, but if you are a disappointment...\" <br>\r\n<br>\r\nThe creature shrugs.<br>\r\n<br>\r\n\"Why would we bring you back? No fun in watching someone pathetic. Usually we just execute you - have you butchered in the most brutal ways imaginable - and leave you dead forever. Anyway, you lost your first fight, and with it, your only equipment. We don't give out freebies. You want something, you have to take it. Ah, that reminds me. You never got to see the planet before your fight did you? You see, this structure is not where you will live. It is where WE live. When you are not wanted to fight, we leave you to roam on a wilderness planet. There are no shops, so you have to find or make things yourself. Sometimes we leave loot lying around to spice things up. There are safe zones that we patrol and keep clear of wild beasts. Yes, you heard me. You have to survive down there. Its televised of course. Sometimes watching a human die spontaneously is great fun. But anyway, there are safe zones where you cannot be harmed by the wilderness or other humans, but don't expect to find much there.\"<br>\r\n<br>\r\nThe alien stops in front of a row of glass tubes. \"<br>\r\n<br>\r\nThese are teleporters. They move you around the planet and our fine city. I shall give you a choice now... you can go to the planet, and try to survive until we need you, or go to the arena and see if there are any fights available. Of course, you will be summoned to fight eventually anyway. The choice is yours.\"</span></div></div>",
            "created":1447909200,
            "id":2064240,
            "title":"A guide to your new life."
        },
        "1131112112":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Explanation",
                "Straight to the locker room"
            ],
            "content":"<div class=\"\"><div> <span>You tell the alien you wish to go to the arena, and he complies, sending you there. You arrive in another glass tube, and step out. You see a larger alien in metal armour bossing another young boy around. This one is tall and imposing, with green, scaly skin and a lizard-looking head. The boy is probably in the same situation as you, as he is naked and unarmed too. As you approach, the alien sends the boy off to the locker room.<br>\r\n<br>\r\n\"Ah, another one.\" The alien remarks. \"Do you want something of an explanation, or do you just want to go straight to the locker room?\"</span></div></div>",
            "created":1447909200,
            "id":2064242,
            "title":"Arena visit"
        },
        "11311121121":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Head into the locker room"
            ],
            "content":"<div class=\"\"><div> <span>You ask the lizard alien for an explanation.<br>\r\n<br>\r\n\"Well, human, I'm sure you are aware of your purpose here. But I doubt you know how it works. I shall explain.\"<br>\r\n<br>\r\nThe creature beckons for you to follow him, and he leads you to a bank of windows. You see a great arena, the size of a small town, surrounded by thousands of seats. <br>\r\n<br>\r\n\"This is the great arena. There are smaller ones as well. As you know, humans fight and die in them for our entertainment. We group you by age and capability, so unless we want a bloodbath, you should stand a chance. As for you, your pathetic performance in your last fight means you are the lowest of the low. Lose a couple more times, and you will find yourself in that great arena being executed in a horrible way to entertain us. So my advice is don't lose a couple more times.\"<br>\r\n<br>\r\nThe creature takes a minute to laugh at his own joke, before continuing. <br>\r\n<br>\r\n\"You will fight in the lowest arena. There are several arena ranks, and each arena adds something new and more exciting. Your fights will be harder, but you cannot be permanently left dead unless you are in the lowest few ranks. Its far too expensive to kill seasoned, capable warriors off for good. You will never be given weapons, clothes, armour or food. You must take them from your dead opponents, or find them on the surface. You will find safe places to sleep on the surface, and you humans tend to stick together down there. You must still be careful though. We televise the surface for a reason. When you are wanted for a fight, a ship will come and collect you as soon as you are available.\"<br>\r\n<br>\r\nHe leads you to a door. <br>\r\n<br>\r\n\"This will lead you to a locker room in the lowest arena. Prepare yourself, and go to the gate when we call you. You will be fighting that boy I was talking to, You are both unarmed and unclothed, so it will be an even fight. Because you both fought pathetically in your first fights, the loser of this fight will be executed. That should encourage you! Now get out there and put up a good fight!\"</span></div></div>",
            "created":1447909200,
            "id":2064245,
            "title":"Explanation"
        },
        "113111211211":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Let battle commence"
            ],
            "content":"<div class=\"\"><div> <span>You take a look around the locker room. As is befitting for the lower arena, it is dirty and small. There are no lockers, so it probably doesn't even classify as a locker room. There is a bench with hooks for getting changed - not that you have anything to get changed in or out of - and a shower that, after a brief test, you realise doesn't work. You prepare yourself, but you are scared. You will fight another human in front of hundreds, if not thousands of aliens laughing and cheering at you. If you lose, certain death, and not in a nice way, awaits you! Before you can put much thought into it, a voice booms from some unseen corner, telling you to progress to the gate. You walk towards to exit, noticing the blood pouring down the walkway, and take your place by the gate. A voice booms an introduction in the alien tongue, and the gate crashes open, a forcefield pushing you forwards into the arena with your opponent.</span></div></div>",
            "created":1447909200,
            "id":2064248,
            "title":"Locker room"
        },
        "1131112112111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Hold your ground and wait for him to make a move",
                "Attack him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The boy opposite you looks older than you, maybe about 10, but small for his age. He seems terrified, and you can see why he lost. Not that you are much better. How do you progress?</span></div></span></div>",
            "created":1447909200,
            "id":2064251,
            "title":"The fight"
        },
        "11311121121112":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Punch him!",
                "Tackle him!"
            ],
            "content":"<div class=\"\"><div> <span>Unarmed, you charge the boy. You don't mean to, but you can't help but notice his features. He is skinny - you can see his ribs through his skin, and his limbs are narrow and spindly up to the joints - with short, messy black hair. You doubt that information will help you. You are nearly upon him, how do you attack?</span></div></div>",
            "created":1447909200,
            "id":2064252,
            "title":"Attack him"
        },
        "113111211211122":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Use your legs to kick him off",
                "Try to free your arms"
            ],
            "content":"<div class=\"\"><div> <span>You dive at the boy, taking him off of his feet and leaving you both on the ground, with him underneath you. You can feel his skin against your own, and feel the terror in his breath. You launch a punch, and connect, hitting him in the face. You repeat this action a few times, before he pushes you off of him and onto the ground. He now climbs on top of you, pinning your arms with his legs, and punching you in the face. What do you do?</span></div></div>",
            "created":1447909200,
            "id":2064254,
            "title":"Tackle him!"
        },
        "1131112112111221":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Get on top of him",
                "Catch your breath"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are able to get your legs under the boy, and you kick him off. He falls back onto the ground, stunned. You might be able to attack, but you feel weak from the beating he gave you.</span></div></span></div>",
            "created":1447995600,
            "id":2064497,
            "title":"Freedom!"
        },
        "11311121121112211":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Leave the arena"
            ],
            "content":"<div class=\"\"><div> <span>You clamber on top of the boy. Completely stunned, he is unable to resist, and you pin his arms down. You hit him a couple of times, and then you strangle him. He struggles, but you manage to hold on and soon he stops struggling. You keep hold until you are certain he is dead. The crowd goes wild, and the gate clanks open, letting you free.</span></div></div>",
            "created":1447995600,
            "id":2064498,
            "title":"Success!"
        },
        "113111211211122111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Ask for advice",
                "Don't ask"
            ],
            "content":"<div class=\"\"><div> <span>You head to the locker room, and the Lizard Alien greets you. He ushers for you to follow him, and leads you to teleporter. You arrive at another row of teleporters near a bank of screens. The alien appears in a separate teleporter a moment later.<br>\r\n<br>\r\n\"Watch this.\" The alien commands, pointing at a screen.<br>\r\n<br>\r\nOn it, you see the boy you fought stood naked in a dusty arena. <br>\r\n<br>\r\n\"This could have been you!\" The alien enthuses, as a huge door clanks open on the side of the arena.<br>\r\n<br>\r\nFrom the door, a huge reptilian creature, kind of like a dinosaur, storms out. It notices the now terrified boy, and charges. The boy falls over and screams, only to be picked up by the monster, thrown into the air and eaten. You see blood poor from the aliens mouth, but you don't get a great view of the action. The last thing you notice before the screen turns off is one of the boy's severed legs falling out of the creatures mouth.<br>\r\n<br>\r\n\"Now, you can't fight for a little while, so you are going to the planet for a bit.\" The lizard alien tells you. \"Have fun!\" He cackles as you are shoved into a teleporter.<br>\r\n<br>\r\n You arrive in a bank of teleporters in what seems to be a small fortress. It is hot, and you can make out a dense rainforest around the fort. Some aliens patrol the perimiter, armed with laser and plasma rifles. You see several other kids, varying in age, size and equipment milling around camp-fires or making there way to and from the teleporters. You are embarrassed for a moment at your own lack of modesty, but see plenty of other humans who also lack clothing.<br>\r\n<br>\r\nYou see an older looking boy, probably about 12, standing around wearing a metal chest-piece over some tattered cotton clothes, and wonder if you should get some advice.</span></div></div>",
            "created":1448035800,
            "id":2064502,
            "title":"Close Call"
        },
        "1131112112111221111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Nod your head, and move on"
            ],
            "content":"<div class=\"\"><div> <span>You approach the boy, and he turns to greet you. He is average height, but quite well built for his age, with short blond hair. He is holding a metal tipped spear that looks dangerously sharp. Before you can even ask for help, the boy starts talking.<br>\r\n<br>\r\n\"You're new, right? I can tell from your lack of weapons... or clothes.\" He says, smirking. You are embarrassed, but he continues. \"This is the planet. The only place we can find and get new materials. You want food, weapons or armour? You have to get it down here. Or loot it in the arena.\"<br>\r\n<br>\r\nHe points at the jungle.<br>\r\n<br>\r\n\"As you can see, it is not a hospitable planet. You are safe inside forts like these, but outside, there are plenty of wild animals, dangerous environments and bandits. Generally, killing others on the planet is frowned upon, but it happens, and there are no rules against it. You can get out of here and try to get some equipment, or you can wait until they need you. If they need you, they send a small robot down to alert you. By the way, don't die down here. Unless you are a worthy opponent, you will be left dead for good. Too much effort to reach your corpse. Of course, lose up there too much and its goodbye as well. So its up to you. Leave and maybe die, but get an advantage, or stay, but get no advantage.\"</span></div></div>",
            "created":1448036160,
            "id":2064505,
            "title":"Help"
        },
        "11311121121112211111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Wait in the fortress",
                "Go into the jungle"
            ],
            "content":"<div class=\"\"><div> <span>You can leave the compound and try to find equipment, but if you die, you will stay dead, or you can stay here. You have no food, so you will be weak before your next match if you don't go. The environment is a dense jungle, and while there are teleporters leading to other climates, an alien turns you away. You have to stay in the jungle for a while. What do you do?</span></div></div>",
            "created":1448036280,
            "id":2064506,
            "title":"Choices"
        },
        "113111211211122111112":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Go Fish",
                "Search the pyramid"
            ],
            "content":"<div class=\"\"><div> <span>You head out into the jungle. You are unarmed and naked - not the best equipment. Fortunately, they have removed disease from this world, as it is no fun to watch a human die of illness. There are still plentiful dangers around though. You remember one of the aliens saying that sometimes loot is hidden in puzzle rooms, but if you lose the puzzle you will not have a good time. You see two places of interest in the distance: A small stone pyramid, about the size of a small bungalow, hidden in the forest and a wide, murky river. You could search the ruins and see if you can get loot, or try to fish.</span></div></div>",
            "created":1448036580,
            "id":2064509,
            "title":"Welcome to the jungle"
        },
        "1131112112111221111121":{
            "author_id":"dasdad",
            "author_name":"Dasdad",
            "choices":[
                "Find a stick",
                "Go for a swim"
            ],
            "content":"<div class=\"\"><div> <span>You quickly realise you are famished - equipment would be nice, but food is the priority. You head towards the river, arriving at a muddy bank amongst the foliage. The river seems fairly slow flowing, although you can't tell tge depth through the murky brownness of the water. You could try and find a sharp stick to fish, or wade in to test the waters.</span></div></div>",
            "created":1461021720,
            "id":2135469,
            "title":"Go Fish"
        },
        "11311121121112211111212":{
            "author_id":"dasdad",
            "author_name":"Dasdad",
            "choices":[
                "Wade in slowly, checking your footing with each step",
                "Walk in confidently - aliens might be watching, better impress them!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to check the waters before doing anything else. No point in fishing in a river that might be empty, right? How do you proceed?</span></div></span></div>",
            "created":1461021780,
            "id":2135471,
            "title":"Go for a swim"
        },
        "113111211211122111112121":{
            "author_id":"dasdad",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><div> <span>Taking it slow, you realise the river bottom is soft and treacherous. Finding firmer ground, you wade into the middle of the river. It goes up to the bottom of your ribs, and you can easily keep your balance in the slow water. In the murky depths below, you feel something brush against your leg. Before you can guess what it is, a sharp pain begins to spread across your lower body. You fall backwards, your legs quickly becoming unusable. In between agonised breaths, you catch sight of your assailants moving in for your now submerged upper body. Your screams are not heard above water, and the tiny, razor mouthed fish finish their grim work. Within a few seconds of noticing the creatures, you have been completely devoured. Chewing through you so fast you didn't even have time to react or try to escape, your flesh is entirely gone within 15 seconds of the first bite. Your flesh stripped skeleton washes up on the muddy beach, not even a scrap of skin clinging on. Anything that wasn't bone is now fish food. The most you can hope for now is that your naked skeleton will warn other gladiators to avoid wading in to the dangerous river. </span></div></div>",
            "created":1461022380,
            "id":2135477,
            "title":"Wade in slowly, checking your footing with each..."
        },
        "113111211211122111112122":{
            "author_id":"dasdad",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><div> <span>You stride into the river, although a few steps in you realise it is becoming difficult to walk. The thick mud at the bottom is sucking you down, and before you can try and step back, you are up to your shoulders. You scream as the water rises, but are cut off as the water covers your mouth. Your world plunges into darkness as you desperately struggle in the water, although you are firmly stuck. Eventually, your struggling ends, and you drown, hidden from site at the bottom of the river. Nobody will ever find your body to confirm it, but this is probably <b>The End</b> for you.</span></div></div>",
            "created":1461021960,
            "id":2135474,
            "title":"A watery grave"
        },
        "1131112112111221111122":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Left lever",
                "Right lever"
            ],
            "content":"<div class=\"\"><div> <span>Entering the pyramid, you find it is lit by some dim torches. In the small amount of light available to you, you make out a note written on paper.<br>\r\n<br>\r\n\"To the finder of this note: Here is your challenge. A weapon awaits you in the vault if you can beat three puzzles. They are dangerous and require good luck, skill and knowledge, in that order. To begin, pull a lever and hope...\"<br>\r\n<br>\r\nYou see two levers attacked to the wall. This is the luck test. You will have to pull a lever and hope it is the correct one. Before you can turn around, a large stone door slams shut! You have to pick a lever now...</span></div></div>",
            "created":1448036760,
            "id":2064510,
            "title":"Trap room"
        },
        "11311121121112211111221":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><div> <span>You pull the lever, but nothing happens. Suddenly, the ceiling begins to slide open. You look up, and open your mouth to scream. Before you get the chance, a huge amount of sand and earth hidden in the ceiling pile down on top of you, burying you alive. You chose the wrong lever, and as you suffocate slowly, you realise this is <b>The End</b>.</span></div></div>",
            "created":1448036880,
            "id":2064511,
            "title":"Sandtrap"
        },
        "11311121121112211111222":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Run and jump across",
                "Take your time"
            ],
            "content":"<div class=\"\"><div> <span>You pull the right lever, and with a click the wall slides open. It reveals a large chamber, with a huge pit in the floor, filled with sharp iron spikes. To reach the other side of the pit, you must jump across four small stone pillars. You see a camera in the corner of the room, televising your every move to an audience hoping you fall and die. What do you do?</span></div></div>",
            "created":1448037060,
            "id":2064513,
            "title":"Skill puzzle"
        },
        "113111211211122111112221":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><div> <span>You attempt to run and leap across the four pillars, but you barely clear the first one before you trip and fall headfirst into the pit. With your last breath, you see the rotting corpses and skeletons of several other children who were just as careless as you. Then your head lands on a spike, and your world goes black as your brain is pierced. The rest of your body follows a split-second later, and soon you are just a small corpse impaled on several iron spikes at the bottom of a pit. It is too late to reconsider your options, because as blood pours from the many holes in your body, this is <b>the end</b></span></div></div>",
            "created":1448037240,
            "id":2064514,
            "title":"Impaled..."
        },
        "113111211211122111112222":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "You don't know...",
                "You know it!"
            ],
            "content":"<div class=\"\"><div> <span>You carefully progress over the pillars. You almost lose your balance a couple of times, but you successfully make it to the first pillar. From there, you tentatively leap from pillar to pillar, and finally do a large leap onto the final platform, pulling yourself up with your arms. You progress through a door into the last room.<br>\r\n<br>\r\nThe room is short and rectangular shaped. Inside, you see several nozzles in the wall. What will spew out of them should you fail is uncertain, although a charred, blackened skeleton lying on the ground in front of your, about the same size as you, suggests heat may be involved. You hope you don't end up that way.<br>\r\n<br>\r\nOn the wall is a riddle:<br>\r\n<br>\r\n\"At night they come without being fetched,<br>\r\nAnd by day they are lost without being stolen.\"<br>\r\n<br>\r\nWhat is the answer?</span></div></div>",
            "created":1448037660,
            "id":2064519,
            "title":"Take your time"
        },
        "1131112112111221111122221":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><div> <span>You panic as you realise you don't know the answer. You freeze, and fail to answer. After a ten second wait, the door behind you slams shut, and you hear a hissing noise inside the nozzles.<br>\r\n<br>\r\nBefore you can react, flames spew from them, filling the room. You are completely enveloped You barely manage to scream before your lungs are fried. Your flesh blackens, and you fall to your knees, cooked. The flames keep even after you stop living, and only when you are a charred skeleton do they stop. Your black burned bones fall to the ground, a warning to anyone else who comes of the price for failure. You are too charred to know it, but this is <b>the end.</b></span></div></div>",
            "created":1448037900,
            "id":2064520,
            "title":"Crispy Kid"
        },
        "1131112112111221112":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Click here to skip!<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1772785-intergalactic-gladiators/map/11311121121112211111\" target=\"_blank\">http://www.writing.com/main/interact/ite...</a></span></div></span></div>",
            "created":1448036400,
            "id":2064508,
            "title":"Redirection centre!"
        },
        "1131112112111222":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Continue struggling",
                "Try to shuffle out from under him with your legs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You struggle to free your arms, but despite your opponents small size, you can't get them free. He continues hitting you, and your vision goes dark. You feel woozy - what do you do?</span></div></span></div>",
            "created":1447909200,
            "id":2064256,
            "title":"Woozy"
        },
        "11311121121112221":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Wait to see what happens..."
            ],
            "content":"<div class=\"\"><div> <span>You keep trying to free your arm, but to no avail. Your vision goes black as the boy keeps beating you, terrified of execution should he lose. The last thing you hear is the crowd screaming with excitement, and the choking dust of the arena floor blocking your throat as you go unconscious, leaving you as an easy target for the boy to finish off. <br>\r\n<br>\r\nYou awake in the same chair as before, naked. This time, a different alien comes, and wordlessly leads you to a teleporter. You are moved to the locker room in a larger arena - even your death didn't warrant the grandest of the arenas - and the lizard alien leads you into the outside. <br>\r\n<br>\r\n\"I told you what would happen.\" The alien states, leading you to the centre of the oval field, which is roughly the size of a football field. \"This will be fun, though! Well, not for you.\" He cackles as he retreats back to the locker room.<br>\r\n<br>\r\n</span></div></div>",
            "created":1447909200,
            "id":2064257,
            "title":"TKO"
        },
        "113111211211122211":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "choices":[
                "Die"
            ],
            "content":"<div class=\"\"><div> <span>You are left standing alone in the arena, unarmed and unclothed, completely defenceless. There is a large crowd, jeering at you as you stand there. The floor is made of dusty earth, and you can make out several bones lying around.  Clearly, they don't resurrect those who die here. Suddenly, an alien voice booms out, and the crowd goes quiet. You figure our he is reading your details, and your sentence. As he finished, the crowd goes wild, which is probably not a good sign. <br>\r\n<br>\r\nSuddenly, a large door opens on the side of the arena. A huge, reptilian creature, a little taller than a girraffe, but far more muscular and well built, stomps in. You can't help but be reminded of a dinosaur, what with its small, cold eyes and broad, flat mouth full of inward facing teeth. It has a narrow, stretchy underbelly for storing large prey, and runs on four large, clawed legs. And it is bearing down on you. Fast.</span></div></div>",
            "created":1447909200,
            "id":2064261,
            "title":"Execution"
        },
        "1131112112111222111":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><div> <span>You barely have time to turn before the creature is upon you. It grabs you, flicking you into the air, before catching you in its mouth. Your terrified scream is cut short as the creature chews you, reducing you to a few gory chunks that used to be a boy. Your pieces are swallowed, visibly filling the creatures stretchy stomach. All the while, the crowd cheers manically, relishing in your brutal demise. The creature stalks back into the entryway, satisfied with its easy meal. What is left of you is passed a few days later by the huge creature along with the rest of its meals, and is unceremoniously burned. You are quickly forgotten, and leave the world without a single kill to your name, merely acting as entertainment for the bloodthirsty aliens and a tasty meal for a predator.<br>\r\n<br>\r\nYou are far too digested to know it, but this is certainly <b>The End</b> for you.</span></div></div>",
            "created":1447909200,
            "id":2064263,
            "title":"Lizard Food"
        },
        "11311121121112222":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><div> <span>You are too weak from his beating, and soon fall unconscious. The boy beats you to death while you are out. <br>\r\n<br>\r\nYou wake up in the chair again, and the Lizard Alien from the arena frees you and leads you to a large arena. <br>\r\n<br>\r\n\"We told you what would happen, kid. Now you get to die. Try to make it a show, huh?\"<br>\r\n<br>\r\nWith that, you are pushed into the arena. <br>\r\n<br>\r\nClick here to continue.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1772785-intergalactic-gladiators/map/113111211211122211\" target=\"_blank\">http://www.writing.com/main/interact/ite...</a></span></div></div>",
            "created":1447995600,
            "id":2064496,
            "title":"You are too weak"
        },
        "11311121122":{
            "author_id":"lampshade11",
            "author_name":"Dasdad",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Click here to skip the explanation!<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1772785-intergalactic-gladiators/map/11311121121\" target=\"_blank\">http://www.writing.com/main/interact/ite...</a></span></div></span></div>",
            "created":1447909200,
            "id":2064246,
            "title":"Straight to the locker room"
        },
        "115":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "go back to other choices for the current story",
                "choose the minecraft thing",
                "some other thing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok im not going to lie, i wanted to create more story's but cant afford  premium membership so im writing a new story in as a branch of this because this was most similar<br>\r\n the main one is a minecraft interactive but there are others</span></div></span></div>",
            "created":1357448400,
            "id":1503151,
            "title":"other"
        },
        "12":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "male and competent",
                "female and competent",
                "male and incompetent",
                "female and incompetent",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female? And are you competent or incompetent as a gladiator?</span></div></span></div>",
            "created":1304312400,
            "id":1098577,
            "title":"you were abducted as a sven year old and have g..."
        },
        "121":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "poison wapons",
                "repare a peace offring for the Trobian once it respawns",
                "talk to your paents"
            ],
            "content":"<div class=\"\"><div> <span>It makes more sense that you are competent because after all you have been doing this all your life. You are in your hut on the surface of Pyros; your hands are coated in thick green-black blood because you were just in a fight and had won, you put down the body of your former foe, it is a large grey translucent squid called a Trobian. Last time you tried to eat a Trobian meat you were sick for days because they are poisonous but that does not mean that they are useless, you can take out all the blood and use it to poison your weapons, but is that the most important thing at the moment?  </span></div></div>",
            "created":1310792400,
            "id":1148749,
            "title":"male and competent"
        },
        "1213":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "they are bussy",
                "only your mother is human",
                "only your father is human"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go to see your parents because they would often tell you what earth was like because you have never been there yourself and you are fascinated by it, however.</span></div></span></div>",
            "created":1310792400,
            "id":1148750,
            "title":"talk to your parents"
        },
        "12132":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "she awnsers all of your questions",
                "she has somethig else to tell you"
            ],
            "content":"<div class=\"\"><div> <span>Your father was not human; he was similar enough to a human to be your father but he came from a distant planet orbiting proxima centauri he looked like a human from the outside except for the Wight of his eyes were black, he was slightly taller than normal and he was smatter but he did not have the instincts to apply his intelligence to survival so he respawned a lot, a lot of this was passed through to you, you were tall and had grey eyes but you had his intelligence combined with human survival instincts for survival.When you meet your mother you find her picking cherrys off of a tree so you start to ask her various questions about earth such as “what colour was the sun” and “what other animals lived there”.</span></div></div>",
            "created":1310792400,
            "id":1148758,
            "title":"only your mother is human"
        },
        "13":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "male and competent",
                "female and competent",
                "male and incompetent",
                "female and incompetent",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female? And are you competent or incompetent as a gladiator?</span></div></span></div>",
            "created":1304312400,
            "id":1098580,
            "title":"you are abducted as a teenager"
        },
        "131":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "they defeat you",
                "you beat them without a scratch",
                "you beat them but are wounded"
            ],
            "content":"<div class=\"\"><div> <span>Your name is max you are 15 and you have excellent skills in fencing, archery, biology and history but because of your ability in biology and history you were regarded as a nerd and rejected from your peers, this rejection causes you to feel a terrible angst which you worked out in fencing and archery but it was only temporary satisfaction you only delayed the lonely anger and always wanted to spill some real blood. <br>\r\n<br>\r\nOne day some of your classmates decided that simply rejecting you wasn’t enough of a punishment for being smarter than them and as you turned the corner they surrounded you and demanded your wallet not because they wanted the cash but because they wanted an excuse to attack you, you immediately reached into your fencing bag and pulled out your prized sabre, each of the boys pull out a switch knife and although you have  more skill on the lesser half of your toenail then they have combined their weapons are sharp but yours is not, was this a good idea?<br>\r\n</span></div></div>",
            "created":1304312400,
            "id":1098602,
            "title":"male and competent"
        },
        "1311":{
            "author_id":"hailrazor",
            "author_name":"Decendant_Of_Thr3e",
            "choices":[
                "You wake up a few hours later in the middle of nowhere..",
                "A teacher finds you behind the school and sends you home..",
                "You wake up to find the unconscious bodies of the boys that attacked you.."
            ],
            "content":"<div class=\"\"><div> <span> Before you could even finish that thought, another boy rushed behind and knocked you onto the ground. There was a sting on your lips, and the taste of blood and dirt filled your mouth. You turned on your back while using your hand to clean your busted lip, and found yourself surrounded by shadows. They began to kick and punch you as you covered your<br>\r\nhead. Your prized sabre laid just a few feet from you. You watched as the dust picked up and the blows kept coming. You stretched one arm in an attempt to get up, and your fingers found themselves under the weight of someone's boot. You let out a cry that was interrupted by a kick to your stomach. Saliva had been added to that sour taste, and unfortunate meal, as you swallowed trying to catch your breath. In the midst of the pain a thought ran through your head. Did the whole Confederate Army feel this way when they were losing the civil war? History.. what garbage it, and waste of time. What goes is it doing you now. And you guess fencing hasn't taught you much about dirty fighting either. You hear the yells of more kids in the distance. For a moment, you get a glimpse of the clouds above you. You enjoy it, time stands still, and then, your feel a thump on your face as it meets the same fate your fingers did. Everything goes black...</span></div></div>",
            "created":1304312400,
            "id":1098759,
            "title":"they defeat you"
        },
        "1312":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "the lockers",
                "the arena",
                "the surface of pyros"
            ],
            "content":"<div class=\"\"><div> <span>It was easier than you thought because nobody wanted to attack fist until bill a large boy with more brawn than brain and probably the biggest there, lunged to stab you, this wasn’t  a problem, his blade has too short to pare so you sharply jabbed him in the chest to force him back then made a very basic attack, a kilogram of steal travelling at thirty miles an hour hit bill on the fore head and struck him unconscious,  as most of the boys were smaller and smatter than bill they ran for it knowing that if they attacked they would face the same crushing defeat.<br>\r\nWhen you got home you lost consciousness as soon as your head hit your pillow but when you awoke you found yourself in a very strange place little did you know that it was called the<br>\r\n</span></div></div>",
            "created":1304312400,
            "id":1098604,
            "title":"you beat them without a scratch"
        },
        "13121":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "h tes you about the lockers first ",
                "he ells you aout the surface and aenas first"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself in a small room, 3 meters by three meters, the walls were pure Wight and despite there being no lights in the room it was very bright, naturally you assumed that in a bright Wight place that you had died and gone to heaven until one of what you will soon know as the cameras appears right in front of you. The cameras are a bit hard to describe so think of them as the sentinels from halo. The camera then spoke in plain English “attention biotic 152438 it is time for your orientation”.</span></div></div>",
            "created":1310792400,
            "id":1148761,
            "title":"the lockers"
        },
        "131211":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "go to the suface to make a weapon",
                "go to see this pillar"
            ],
            "content":"<div class=\"\"><div> <span>“The area you are in now is storage space 152438 it is assigned to you to access it say enter locker to exit say exit locker. If you exit the locker you will be teleported to the surface of the planets to your species native hex the surface of the planet is divided into these hexagonal areas that match the ecosystems of various home planets so that you can survive. You are now a gladiator the time of all fights are clearly marked on pillars on the corners of the hex’s  the edges of these hexagons are marked with a foot high barrier, this is not in place to limit your travel you are free to move between hex’s. We are the cameras we will be recording your actions most of the time and some of it will be broadcasted thought the empire. It is strongly recommended that on the first day you make a weapon and use the locker as your shelter.”</span></div></div>",
            "created":1310792400,
            "id":1148767,
            "title":"he tells you about the lockers first "
        },
        "1312111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "sharpend stick",
                "ambitious"
            ],
            "content":"<div class=\"\"><div> <span>You say exit locker and find yourself in a dense forest of tall pines, there is a hexagon of sky is blue with Wight clouds directly above you but next to that there are all sorts of weird skies. You don’t know when your first fight is so do you make a simple sharpened stick or go for something more ambitious.</span></div></div>",
            "created":1310792400,
            "id":1148773,
            "title":"go to the suface to make a weapon"
        },
        "13121111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "other gladiators",
                "one of the pillars"
            ],
            "content":"<div class=\"\"><div> <span>The sharpened stick is safer because you will be done in time for a fight, you pick up a stone, about the size of a half brick and rough like granite and hold it firmly in your hand as you smash it into the side of a pine sapling slightly taller than you but wide enough not to break when used as a weapon, eventually the base of the tree splintered, you grind the roughest part of the stone against the sapling to remove all the bark and branches to make it easier to hold, then use the rock at an angle to sharpen each end of the stick so that it is sharp enough to pierce flesh. You notice that you still have some time before the fight so you begin to explore until you find.</span></div></div>",
            "created":1310792400,
            "id":1148776,
            "title":"sharpend stick"
        },
        "131211111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "you act well to this",
                "you react badly"
            ],
            "content":"<div class=\"\"><div> <span>You find seven aliens crowded around a small fire cooking chunks of meat, none of the aliens appear the same, you say “hello” and one of the aliens, a large orange reptile, turns around and looks at you and says “ewyi tyram shalbox” you realise that he speaks a different language and just then one of the cameras flies down ad says “I will translate” and the camera changes to a very different voice and says “are you new here” “yes I just arrived, what I....” he interrupts and says “the cameras would not have told you a few vital things firstly..” this time you interrupt “wait you just spoke English” “no I didn’t it’s just the way the cameras translate, you only hear the translation instead of what I am actually saying”. “Now if there are no more interruptions firstly if you die in a fight you will be respawned at the last place you fell asleep but you will lose everything you were wearing, that means armour, weapons and also physical strength if you have trained your body above what your genes say you should be, also that means don’t feel bad about killing anyone in a fight just make sure you give a peace offering after they respawn and most importantly if you win a fight your prize is the body of the looser that means armour weapons and food” “food?” you ask “yeah what do you think we are cooking?” you look closer at the chunks of meat and notice that they are all body parts of one of the creatures huddling around the fire, “don’t worry it’s not like its disrespectful to their memory because they’re not really dead”.</span></div></div>",
            "created":1310792400,
            "id":1148784,
            "title":"other gladiators"
        },
        "1312111111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "you have to fght one of the aliens you saw around he fire",
                "you have to fight a stranger"
            ],
            "content":"<div class=\"\"><div> <span>“The eating fellow sentients is kind of gross and I kind of guessed that this was a thing to do with aliens based on the flying robots and the fact that this sort of thing does not happen on earth but the fact that I won’t die if I get killed is enough of a relief to make the other things not matter so much” “so do you have a name or should we call you earth monkey” “my name is jack” ”my name is rex says the large muscular orange reptile” “I am trivian” says a humanoid wolf like creature armed with a club made from a bone with some teeth and claws stuck to it. “My name is phry zeal but you can call me phry” said a blue-purple bird creature. “hi I am blarg” said the creature whose past body they were cooking and reminded you of an ork “hey im red” said a large crab thing. “im pincer” said a part spider part man creature “hello I am zerk” said a translucent black blob with no facial features. The camera interrupts and says “it is time for your first fight biotic 152438” a whirl pool of blue light surrounds you and you appear in an arena</span></div></div>",
            "created":1310792400,
            "id":1148791,
            "title":"you act well to this"
        },
        "13121111111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "rex",
                "phry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1310792400,
            "id":1148801,
            "title":"you have to fght one of the aliens you saw arou..."
        },
        "13122":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "a blue bird thing",
                "an orange retile thing"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself standing on a platform made of a very strong stone; the platform is surrounded by a deep abyss, above which is a massive glass dome encasing you and on the other side of the glass are hundreds of alien creatures all small, weak and laughing at you because you are different and you are smaller than most gladiators and you are going into battle in your pyjamas. Above you hear a voice say (in English) “well our champion has had a tiring day so as the final fight they will be fighting a small little thing we found on a primitive planet in the Solaris system” you suddenly realise that they are talking about you, and that you will be expected to fight an alien, your mind is racing, the voice said that they were a champion, what would this alien look like and then you notice standing on the opposite side of the arena there is a...</span></div></div>",
            "created":1304312400,
            "id":1098687,
            "title":"the arena"
        },
        "13123":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "forest",
                "somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where are you on the surface</span></div></span></div>",
            "created":1340686800,
            "id":1367268,
            "title":"the surface of pyros"
        },
        "131231":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "food ",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you look around the forest and there are some trees that you recognise and some that you dont what should your first priority be</span></div></span></div>",
            "created":1340686800,
            "id":1367269,
            "title":"forest"
        },
        "1312311":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "weapons",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>your walking along trying to find fruit on one of the trees but they apear baren but then OUCH something prickly fell on your head on closer inspection it was a horse chesnut  which is a more prickly conquer and non poisones to eat. you hold it through your pockets to spare your fingers and strip of the casing of the nut to leave a brown nut the size of a curled finger, biting into it you realize that it is edible and will help but you will need more so you stand next to th tree and ram into it as hard as you can repeatedly causing the chestnuts to fall to the ground and after picking them up and striping the down both your stomach and all your pockets are full so you decide what to do next.</span></div></div>",
            "created":1340686800,
            "id":1367276,
            "title":"food "
        },
        "13123111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "lake",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>you remember what the camera said aboutthe lockers so you said \"enter locker\" and you were teleported to your locker it was completly empty and here you made a pile of the chestnuts that you didnt eat then you go back to the surface and spot a regular chestnut tree which grew poisonus sharper and denser nuts which could be used as thowing weapons if nothig else was available, ramming this tree did not work as it was bigger and stronger than the other so you tie your jacket to your wrists to act as a climbing aid and when you were up there you picked pleanty of the projectiles and decided that this would be a good base, it was shaded and sheltered by the leaves the tree limbs formed a sort of bowl shape and it had a ready supply of projectiles and it was above the rest of the canopy so you could see almost everything inact you could see a...</span></div></div>",
            "created":1340686800,
            "id":1367279,
            "title":"weapons"
        },
        "131231111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "you are called into a fight",
                "no your not"
            ],
            "content":"<div class=\"\"><div> <span>you tied your tie onto the lowest branch of the tree so that it could be recognied later, the lake was only a short walk away and the water was fresh so you drank as much as you could and noticed clay on one side so you built a small fire and shaped the clay into a pot cooked it on the fire then filled it with water and took it back to the tree base then made five bowls and filled them with clay for later use. by this time night falls</span></div></div>",
            "created":1340686800,
            "id":1367280,
            "title":"lake"
        },
        "1312311111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "butcher the animal",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>when the moon is high in the sky you wake up in an arena already stood up with the chestnut in hand and pockets, the enemy was like a wild bore but with pure white fur which looked very niceit charged at you but it was hungry and thirsty whilst you were well fed and rested, you through the conquers as hard as you could but due to the creatures thick coat it was little more than a distraction but it was enough andyou as you ran round behind it and leapt onto the things back  pinned it so that it could not bite  you then you wrapped your arms round its head and snapped its neck you then listened to the chearing and were teleported back to the tree and the sun was just coming up</span></div></div>",
            "created":1340686800,
            "id":1367286,
            "title":"you are called into a fight"
        },
        "13123111111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "go fishing",
                "make an animal trap"
            ],
            "content":"<div class=\"\"><div> <span>you use the clay to make four trays and a rudementry knife and cut the boar into edible meats, skin, bones and other like eyes and guts you used the rest of your clay to make a smoking furnace to smoke the meat which would dry it out and preserve it you then whent back to the lake and brought back more clay and water with you and you then used the clay and bones to make a pickaxe, an axe, a sword, several knives and a shovel, you then used the shovel and pick to dig out an area under the tree for storage and made more pots for the nuts and smoked meat, you also made a hemet and sholder pads out of the extra bones and you made a cloak and quilt out of the fur and you rinsed out the things stomach to make a water skin and used the rest as bait to</span></div></div>",
            "created":1340686800,
            "id":1367291,
            "title":"butcher the animal"
        },
        "131231111111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "brewing alcahol",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>you used your axe to get enough wood to make lobster pots and you made a net and rod out o vines and a ladder for the tree base whilst you were at it and whent to the lake with your bait and various traps, you set out the traps and started to fish by the time that you had used all you bait the sun was going down and you had reset all the traps and you had several crabs, pleanty of fish and a large lobster, you decide to eat the crustacia tonight because it will not keep and then preserve the fish, you had a good dinner and a good breakfast and decided that it was time to start...</span></div></div>",
            "created":1340686800,
            "id":1367293,
            "title":"go fishing"
        },
        "1312311111111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "smelt metal",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>you used your axe to chop down a tree, thriped off the branches, divided the trunk into three large cylinders and hollowed them out to make three make do barels, you used the branches and sap to make lids and broght them to the hollow under the tree, you then ground up the hourse chestnuts and added them to water from the lake, it was enough to fill one barel and hopefuly the natural yeast already on the nuts would take to ferment it but it might not happen, you then left it to fermnt, what next.</span></div></div>",
            "created":1349499600,
            "id":1441653,
            "title":"brewing alcahol"
        },
        "13123111111111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "a sword",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>you go from place to place digging up the dirt to find only roks until on your seventh try by which time your fealing damn tired you find iron ore, you mine as much as you can carr which is less than usal and take a second to memorise the area before taking the ore back, you then cook some wood into charcoal in your furnace, you then grind up the charcoal and ore and cook them in a wooden bowl in the furnace and repeat several times, you then broke off the remains of the wooden bowl and chiped off the solidified slag leaving you with pleanty of relativly simple steal, you then steap in your white quilt , in the morning you will use the iron to make:</span></div></div>",
            "created":1349499600,
            "id":1441666,
            "title":"smelt metal"
        },
        "131231111111111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "you are called to another fight",
                "no your not"
            ],
            "content":"<div class=\"\"><div> <span>you knew that hard steal would be good at cutting but would break more easily and could be made by cooling the steal quickly in water but soft steal made by cooling slowly in air would absorb impacts better but be a worse cutting edge, so you decided to go for the katana design of layering from a soft steal in the centre to hard steal on the outside. it took a day of adding layer after countless layer of adding innoticibly different layers of steal until it was finished, it was perfectly straight and double edged and had a grove running down the middle with a sharp point on the end and studs on the hilt to be used as a mild bludgen, it was perfectly weighted so that it made perfect slices of its own accord when moved by the handle but still light enough to be controlled, you warped the handle in intricate patterns of leather and made it a leather scabbard and a belt to attach it to and at sunset you  engraved the name \"Michael\" into its gaurd and then fell asleep dreaming of this magnum opus.</span></div></div>",
            "created":1354338000,
            "id":1479607,
            "title":"a sword"
        },
        "1312311111111112":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yeah",
                "nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>shal we do a time skip to the future to see where this is going?</span></div></span></div>",
            "created":1369544400,
            "id":1596975,
            "title":"no your not"
        },
        "13123111111111121":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "ok",
                "no, a different length of time"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>about a year later then</span></div></span></div>",
            "created":1369544400,
            "id":1596976,
            "title":"yeah"
        },
        "131231111111111211":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "a camera announces something special",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>In one whole year much progress has been made you have gone out and found all types of plant to cultivate, olives for oil, wheat and barley for bread and beer, sweet fruits and reliable vegetables, you had found natural veins of coal, malachite(copper ore), amber, limestone, clay and rock salt, you kept a horse and livestock in a paddock but this meant that compared to the other creatures on Pyros you were relatively wealthy and this made you a key target for raiders and marauders such as the Orks.<br>\r\n<br>\r\nThe Orks were initially brought to Pyros as just one Ork like all the other gladiators but Orks are able to reproduce asexually meaning that there were now massive clans dominating life on Pyros, the Orks had no social instincts as they had never needed to interact with each other to reproduce so unlike human evolution where intelligent and relatively friendly specimens thrived, in Ork evolution the strong and aggressive thrived regardless of intelligence.<br>\r\n<br>\r\nThis meant that groups of Orks would come to your base to plunder your supply's however in this year you have been building defenses beyond your simple tree house, you now had a stockade fortress encompassing a granary, an armory and a windmill which gave you mechanical power that could be used to open and close the heavy gates, and remotely operate automatic crossbow turrets which you had built. The fortress itself consisted of concentric walls of wooden palisades covered in simple plaster for fire protection , the gate had the skulls of deceased Orks on spikes from previously attempted raids as a disincentive to attack, the keep was a tower connected to the gate for control and defense it had a hypercaust system under it to keep the place warm, it was lit by mechanical oil lamps which could be toggles for brightness and you had made an automatic cooling system for your pantry.<br>\r\n<br>\r\nThese defenses meant that over time the Orks just stopped trying so you were enjoying a now easier lifestyle until...</span></div></div>",
            "created":1369544400,
            "id":1596987,
            "title":"ok"
        },
        "131232":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "sure",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a vally perhaps</span></div></span></div>",
            "created":1340686800,
            "id":1367337,
            "title":"somewhere else"
        },
        "1312321":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "a camera apears",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>there was a long twisting river that ran through the vally with grey rocks of all shapes and sizes sticking out of it, the walls of the vally were steep and sometimes formed large hills, there were one or two trees dotted about and lots of bracken and thistles</span></div></div>",
            "created":1343019600,
            "id":1386546,
            "title":"sure"
        },
        "13123212":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "sure... why not?",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you notice something in the distance?</span></div></span></div>",
            "created":1343019600,
            "id":1386617,
            "title":"something else"
        },
        "131232121":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yep",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a forest mabey</span></div></span></div>",
            "created":1343019600,
            "id":1386618,
            "title":"sure... why not?"
        },
        "1312321211":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "you meet a creature",
                "nothing goes wrong"
            ],
            "content":"<div class=\"\"><div> <span>you pick up a sharp medium sized stone whick could be used as a sort of axe head and use it to slice a branch off of a tree and use it as a handle and use the stems of small weeds to tie it to the stone and you start using your improvised axe to cut down young oak trees</span></div></div>",
            "created":1343019600,
            "id":1386623,
            "title":"yep"
        },
        "13123212111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "try to be friendly",
                "kill him"
            ],
            "content":"<div class=\"\"><div> <span>whilst sort of chopping down trees you saw something green in the corner of your eye but not leaf green a sort of dirty yellowish brownish green and you noticed it, like a big green ape with tuffs of thin grey hair wearing scraps of leather and armour and it was charging right at you, you jummped out of the way last second and you heard it say in english with a grough accent \"stay still lil thingy, i is hungry\" </span></div></div>",
            "created":1343019600,
            "id":1386879,
            "title":"you meet a creature"
        },
        "131232121111":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "make it in the forest",
                "make it in the vally"
            ],
            "content":"<div class=\"\"><div> <span>\"WHAT THE HELLLlllo, er hello, who are you\"<br>\r\n\"i is an ork and you is food\"<br>\r\n\"im sure we can talk this out and besides we would stand much better chances of survival if we worked as a team\"<br>\r\n\"there is lots a orks, i 'as a team but camera says you is teh only humie 'ere\"<br>\r\nsuddenly the ork charges and you swing the axe and it embeds itself in the orks face, the creature twitche a bit and then goes limp<br>\r\nyou now knew that not only were these creatures are dangerous but also that they were numerous so you need a shelter that could be defended but where to build it?</span></div></div>",
            "created":1357448400,
            "id":1503318,
            "title":"try to be friendly"
        },
        "1312321211112":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "take the ork",
                "don't it might be infectious"
            ],
            "content":"<div class=\"\"><div> <span>The valley would be a good choice because you could build your strong hold on a steep hill for natural defence and plenty of fresh water and stone were near by but it mean having to go further for wood and possibly food, the forest may have fruit or nuts but as best you could tell food in the valley was more scarce but for tonight should you use the dead ork as a food supply?</span></div></div>",
            "created":1366434000,
            "id":1575294,
            "title":"make it in the vally"
        },
        "1312322":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yay neolithology (yes)",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a smooth plain grassy area with wild cereal plants</span></div></span></div>",
            "created":1369544400,
            "id":1596973,
            "title":"nope"
        },
        "14":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "male and competent",
                "female and competent",
                "male and incompetent",
                "female and incompetent",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female? And are you competent or incompetent as a gladiator?</span></div></span></div>",
            "created":1304312400,
            "id":1098581,
            "title":"you are abducted as an adult"
        },
        "15":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "male and competent",
                "female and competent",
                "male and incompetent",
                "female and incompetent",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female? And are you competent or incompetent as a gladiator?</span></div></span></div>",
            "created":1304312400,
            "id":1098585,
            "title":"your parents were abducted and you were born a ..."
        }
    },
    "info":{
        "author_id":"megidramon",
        "author_name":"megidramon",
        "brief_description":"a human is abducted and enslave as a gladiator to fight aliens",
        "created":1304341140,
        "description":"<td align=\"left\" class=\"norm\">You play as a normal person who was abducted by aliens and sold as a slave to an arena in space where they televise their fights to the death, after combat the loser is cloned and their brain reprogrammed with memories taken from the corpses brain so that the company does not have to buy new gladiators, the gladiators are not given food or armour or weapons but must use the corpses of theses they defeat to arm themselves and feed themselves.</td>",
        "id":1772785,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1461022380,
        "modified":1461022380,
        "pretty_title":"intergalactic gladiators"
    }
}