{
    "chapters":{
        "1":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "harry",
                "zayn",
                "nial",
                "liam",
                "louie"
            ],
            "content":"<div class=\"\"><div> <span>The fangirls are screaming and the musics playing loudly, in a huge stadium where your listening your favorite band One Direction. You were lucky enough to win a free ticket and a backstage pass to meet the band. As you head for there dressing room after the show, you start to feel dizzy and  collapse.When you wake up you smell something awful and look up you see harrys giant shoe in front of you. Knowing this is may be your oh chance to contact the giant, you quickly scramble up his shoe and trying to climb all the way up to his ear. By the time you makeup up to his shoulder your drenched in sweat and the band is pissed that you never showed up and decide's to leave. As Harry makes his way to the limo you slip off his shoulder and fall straight into Harry's pocket. The band heads for their limo, talking about tonight's concert . As Harry walks you go swinging left and begin to feel rather sick. He makes it to the limo and they head to their hotel room. When they get up to there room Harry says he going to take a shower and strips naked as he heads off towards the bathroom you scramble out of his pocket after he steps out of his shorts. You are now trapped in a hotel with five horny guys who do you find to help you</span></div></div>",
            "created":1340946000,
            "id":1369051,
            "title":"the guys"
        },
        "11":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "Try to wake him up",
                "Head towards those big soft feet.",
                "look at that big juicy cock",
                "look at that tight ass of his",
                "Go explore his mouth"
            ],
            "content":"<div class=\"\"><div> <span>You see harry walking into the room with a towel around his waist. He closes the door to his room and drops his towel. Showing you that giant piece of meat in between his legs. He turns off the light and walks to his bed nearly smashing you under one of his godly feet. He climbs into bed  and a few minutes later you hear him start to snore. This is your chance to get his attention you quickly climb up the bed using the sheets to hoist yourself up.  And see harry on his bed completly naked. This is a once in a life time chance to explore Harrys massive body. Though you also need to get back to normal size to so you </span></div></div>",
            "created":1340946000,
            "id":1369291,
            "title":"harry"
        },
        "113":{
            "author_id":"lastfeelbender",
            "author_name":"That Boi",
            "choices":[
                "You decide to crawl inside.",
                "Harry wakes up and sees you.",
                "You move to his big smooth balls."
            ],
            "content":"<div class=\"\"><div> <span>     You stared in awe at Harry's massive cock and gigantic balls. So long, thick, and veiny... And it was still flaccid. All the times you fantasized about Harry thrusting that cock up your ass or down your throat... You can't help but snuggle yourself into Harry's manhood. His musk was somehow both unbearable and the most amazing smell in the world at the same time. As you rub yourself into the teen's cock it begins to harden, growing to at least 10 inches. A drop of precum oozes out of Harry's tip and falls onto your head.<br>\r\n     You can't help yourself. You start climbing the titanic penis and once at the top stick your tongue into his slit. His precum was so hot and salty. You sit on the tip of Harry's cock, legs spread as if it could penetrate you and you start grinding. More and more hot, gooey, sticky precum oozes out and drenches your own crotch and legs.<br>\r\n     Finally...</span></div></div>",
            "created":1586304960,
            "id":2815152,
            "title":"look at that big juicy cock"
        },
        "114":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "Farts again",
                "gets up",
                "or shit starts to fill up his ass"
            ],
            "content":"<div class=\"\"><div> <span>You see two mounds of soft perfect flesh its harrys gorgeous bubble but. You climb up and stand in between his cheeks. Even though he just got out of the shower his ass still smells horrible. You press your nose up to his big slimy asshole. And slowly you slip your tongue inside when all the sudden he farts and your waist up slips in to his hungry asshole. You kick your legs trying to get out but your stuck in between his buns of steel. You can barley make out the inside of his ass its filled with strands of slime and smells horrible. You dont see any shit lucky for you he used the bathroom before his shower. But your stuck in there for hours before you see the pink fleshy walls start to shift as he </span></div></div>",
            "created":1340946000,
            "id":1369305,
            "title":"look at that tight ass of his"
        },
        "1141":{
            "author_id":"yazminbaskin1d",
            "author_name":"llamalittle",
            "choices":[
                "go over the rules and punishments",
                "says the rules and punishment but dose the punishments",
                "someone comes in"
            ],
            "content":"<div class=\"\"><div> <span>'fptptpffptptptp' you feel a big nasty fart come out of his butt. Harry go's to scratch his but when he feels you. He now is slowly waking up and brings you to his face. \"what? your a tiny person! why were you in my butt?\" \"Harry I need help getting back to normal!\" \"why were you in my butt tho?\" \"ummmm... because...\" \" you like my butt don't you, you like the way its smells and feels you nasty.\" \"well umm.. um\" \"you do and you know what i wouldn't mind having a pet and sitting on my pet,I'll even tell the lads and they can do the same to you,and more.\" \"Harry thats not what-\" \"it's master Harry to you,and you are now Liam,Niall,Zayn,and my boobear Louis and I's pet and you will do as siad or we will punish you,here are the rules and punishments......\"</span></div></div>",
            "created":1464752460,
            "id":2156968,
            "title":"Farts again"
        },
        "1142":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Continues to fart!",
                "Pushes his smelly load over you!",
                "Keeps you inside his ass for good!"
            ],
            "content":"<div class=\"\"><div> <span>You eep as you feel this sexy giant get up, causing you to get stuck inside the slimy hole while slipping in further! You blush as you feel him move about, occasionally letting a fart out over you, causing to sink further into the smelly slime! After more hours of anal torture, you slip into the empty chamber, causing the giant to moan out deeply with a grin!<br>\r\n<br>\r\nthe giant then...</span></div></div>",
            "created":1347253200,
            "id":1424939,
            "title":"gets up"
        },
        "115":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "He swallows you",
                "You manage to climb out of his mouth",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>While you want to explore his entire body, one thing has to be done first. Look at  Harrys massive mouth with his plumb pink lips and shiny white teeth.You start to walk up his chiseled body You run your hand along his leg, which is covered in thick bushy hair . You stare at him. His eyes closed, his mouth open. He looks exhausted from a day of performing, and you can smell his meaty breath .Only arms length from his mouth you stop. you place your hands on his lips there thick and juicy but so soft to the touch. You slip your hands into his mouth and feel his slimy tongue.Your hands are now wet, covered in a film of spit that smells like nothing else than his saliva does. Standing at the at the black hole, your entire body pressed up against his thick lips, you peer your head in the hot celebs breath was intense and had a nasty stench of meat to it. With your head in his mouth, you see the tongue, twitching in its sleep like a separate being. It too is covered in Harrys saliva, bubbling and pulsing. You lay your head down to it, your body resting on this sleeping guys lips. A slight 'mmm' from the back of the throat surprises you, he likes your taste! Then the lips purse around your body and you feel a pressure infront of you. Your entire body is squeezed inbetween his lips and onto his tongue, sliding along it into the hot darkness. Your feet slide in with a slurp and your belly, dick and face is being smothered by his tongue coating you in his saliva. Its dark tight and it reeks so much inside a guys mouth, but for you its incredibly hot. When suddenly</span></div></div>",
            "created":1341032400,
            "id":1369801,
            "title":"Go explore his mouth"
        },
        "1151":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "Explore",
                "Try to wake up Harry",
                "Try to escape"
            ],
            "content":"<div class=\"\"><div> <span>His tongue starts to slide all over you. You hear another loud 'mmmmmmmmmmmmmmmm' as he licks all the flavor off you. You feel his tongue start to rise and the black whole of his throat opens up eager for you to slide down it. Time seems to almost stop as you hear a loud gulp and you slip into his tight slimy throat. His throat his so tight and constricting you can only wiggle as you slide down the teen idols throat into his gurgling stomach. You drop down into the supriseingly small stomach.Your absolutely drenched in slime and saliva as you look around at the pink walls of Harry's stomach. His belly gurgles in contempt as you feel Harry rub his his belly in his sleep. You sit down trying to decide what to do.</span></div></div>",
            "created":1347253200,
            "id":1424892,
            "title":"Gulp!"
        },
        "11512":{
            "choices":[
                "Harry Wakes Up",
                "Harry Carries on Sleeping "
            ],
            "content":"<div class=\"\"><div> <span>It took all your energy, but you got up from the saliva and slime mess and tried to kick Harry's stomach walls to wake him. Each punch and kick stabbed his pink fleshy walls but did nothing, he was still fast asleep. But suddenly the stomach started shake, as Harry moved over in his sleep to his other side, his face slammed the pillow and his gut and abs twisted. The walls flipped and you landed face first in the pool of green acid and slime, the sensation was something you have never felt before. It was a mixture of joy and hatred, you was mad at yourself by getting into this, but who could not be joyful in the best experience nobody had the honour to have. Who else can say they was eaten by Harry? You gave up fighting, Harry was always going to win. He ate you and there is nothing to do about it than sit and wait to be digested. Harry carried on sleeping, and didn't know you was in his stomach waiting for something to happen. You sat in the middle of the acid, and listened to Harry's gut rumbling and groaning. You knew that soon the acids would rise and you would die, but you didn't get sad over it because your body was going to make up Harry's and that is worth your life for.</span></div></div>",
            "created":1393131600,
            "id":1750429,
            "title":"Try to wake up Harry."
        },
        "115121":{
            "choices":[
                "The pain goes away.",
                "Harry goes to a doctor."
            ],
            "content":"<div class=\"\"><div> <span>Hours passed, and Harry's putrid green stomach acids were as high as your tiny chest. The fleshy walls never stopped moving, and his acids never stopped bubbling. But you carried on being hopeful that Harry will realise you was in here and get you out when he woke up. <br>\r\n<br>\r\nAnother hour or two passed, and Harry finally rose from his bed. The curtains in the room were closed, which kept him in the dark. Harry sat up, and rubbed his eyes. But suddenly he felt a weird feeling coming from behind his stone abs. He patted and rubbed his gut hoping to reduce the feeling, but it didn't work. Harry thought he must of ate something the day before that didn't go well with him. It was a sensation like having a small stick poked into your skin, and Harry had no idea what to do. He got up from the bed, and jumped up and down. Shaking his stomach so the pain would go away. You was in current of saliva, acid and undigested food, being smashed around the slimy pink stomach walls. There was nothing you could do.</span></div></div>",
            "created":1393218000,
            "id":1750655,
            "title":"Harry Wakes Up"
        },
        "11513":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "Acid fills the stomach",
                "Harry feels really sick."
            ],
            "content":"<div class=\"\"><div> <span>you walk up to one of the fleshy pink walls of Harry's gurgling stomach,and press your hand to the wall. It's covered in slime,and it reeks just like the rest of his stomach.You start to bang on the stomach walls screaming\"Harry let me out!\" as you continue to bang on the walls. His belly sloshes you around knocking you into a pile of slime.You get back up and keep struggling not wanting to be trapped in Harry's stomach for the rest of your life. The next morning Harry wakes up and feels a weird tickle in his stomach. Assuming it's just because he's hungry he goes into the kitchen and starts to cook some eggs and bacon. The sound of the sizzling bacon makes his stomach rumble around you,and it also brings the rest of the band running in to get breakfast. Harry yawns and rubs his belly as he fells your struggles increase. He sits down at the table and takes his first bite of food. His stomach starts to gurgle as you feel the eggs splash into his stomach. His belly starts to gurgle even louder and.</span></div></div>",
            "created":1347858000,
            "id":1429918,
            "title":"Try to escape"
        },
        "115131":{
            "choices":[
                "You cry for help.",
                "You take your fate."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The acid fills the stomach, you feel your skin getting softer and Harry's acids decay your body, the wall of the stomach twist and turn. </span></div></span></div>",
            "created":1376802000,
            "id":1648185,
            "title":"Acid fills the stomach"
        },
        "1151312":{
            "choices":[
                "See how long you last",
                "Give up and become food for Harry"
            ],
            "content":"<div class=\"\"><div> <span>The walls of the stomach continue to move and shake as Harry is digesting his breakfast. It has been hours since you were eaten by Harry, and you still have not died.<br>\r\n<br>\r\nHarry got up from the table and walked to mini bar. Harry felt the need for a water after  a long night sleep and an upset stomach. He downed two small bottles until he left hydrated.<br>\r\n<br>\r\nMeanwhile in his stomach you are about to drown in the mixture of stomach acid and water, your head has just made it to a pocket of air. But the air wont last long and the stomach in retracting to a smaller shape.<br>\r\n<br>\r\nYou have the thought that this might be the end of you.<br>\r\nYou were born to become Harry's meal and you take your fate.   </span></div></div>",
            "created":1376888400,
            "id":1648202,
            "title":"You take your fate."
        },
        "11513121":{
            "content":"<div class=\"\"><div> <span>After breakfast Harry let out a massive burp. <br>\r\nThe was band members said \"Man, What did you eat?\" Harry turned and lifted his shoulders. \"Just Bacon,Eggs and Water, Nothing more\" The band members thought nothing of it. But what they didn't know was that the winner the backstage pass was being digested in Harry's Gurgling Stomach.<br>\r\n<br>\r\nHarry felt hungry again at 4pm as his breakfast was gone, his unexpected meal was now travelling down his intestines. The protein that once made your body entered Harry's blood stream.<br>\r\nZayn entered the room, \"Hey Harry want to get some pizza.\"<br>\r\n\"Sure\" Harry said ,patting his stomach.<br>\r\n............................................................................ .....................................................................<br>\r\nThe next day Harry hit the gym and used your protein to make his Abs and Pecs bigger and sexier. Well, thats what you was born to do, become a giant Harrys meal.</span></div></div>",
            "created":1376888400,
            "id":1648262,
            "title":"See how long you last"
        },
        "1153":{
            "author_id":"lastfeelbender",
            "author_name":"That Boi",
            "choices":[
                "Wakes up and notices you.",
                "Keeps sucking on you in his sleep.",
                "Swallows you."
            ],
            "content":"<div class=\"\"><div> <span>     Harry begins sucking on your tiny body as he sleeps. He moans softly as his giant muscular tongue manhandles you. It was like Harry was massaging your entire body with his tongue. You slide gently over his molars and get pushed into his cheek. The tongue can't seem to reach you so you decide to be a good little fan and crawl back onto it. It was honestly a very pleasant experience aside from the smell and sweltering heat. This goes on for a few hours before Harry sticks your head out of his mouth, your neck pressed tightly between his lips. Harry's massive tongue then caresses every bit of your tiny body, even sticking itself between your legs, pressing into your crotch. A few minutes of this full body massage later and you cum onto Harry's tongue. He then...</span></div></div>",
            "created":1586304300,
            "id":2815148,
            "title":"Little Candy"
        },
        "12":{
            "choices":[
                "concern",
                "a evil smile",
                "hunger",
                "confusion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hear loud foot steps and when you look up you see the giant Persian god Zayn. He looks down at the pile of harrys clothes and his eyes lock on you. His expresion changes to</span></div></span></div>",
            "created":1340946000,
            "id":1369325,
            "title":"zayn"
        },
        "122":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "\"Become my foot slave\"",
                "\"Become my ass slave\"",
                "\"Become my muscle slave\""
            ],
            "content":"<div class=\"\"><div> <span>\"Ooh, lookie what we have here! A tiny guy trying to hide.\" Zayn laughed. \"This is going to be fun!\"<br>\r\n<br>\r\nI gulped hard, afraid what he could do to me.<br>\r\n<br>\r\n\"Hmm... What do I wanna make you do?\" Zayn smirked. \"I'll let you decide...\"</span></div></div>",
            "created":1462457460,
            "id":2143516,
            "title":"an evil smile"
        },
        "1222":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "Try to escape... and succeed",
                "Try to escape... and fail with punishment",
                "Give in to Zayn and become obedient"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll become your ass slave...\" I said dejectedly.<br>\r\n<br>\r\nZayn laughed. \"What a wonderful choice! My ass needs some good worship right now!\" He picked me up and stuck me on a chair next to him, then he pulled down his pants to reveal a really tight pair of underwear. \"You ready?\"<br>\r\n<br>\r\nI gulped again. \"No, wait. I changed my-\" I got cut off by being engulfed in his large ass on top of me. I tried yelling and pushing him off, but it was no use.<br>\r\n<br>\r\n\"Oooh whatever you're doing, keep doing it.\" he moaned.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1462457940,
            "id":2143520,
            "title":"\"Become my ass slave\""
        },
        "12222":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "He gets food to make him gassy",
                "He prepares to eat you"
            ],
            "content":"<div class=\"\"><div> <span>I kept squirming because his ass was suffocating and crushing me. What other options did I have?<br>\r\n<br>\r\nAfter a few minutes of trying, I finally free myself and run like hell to the door. I see it's a crack open and dart towards it. Suddenly it slams shut and I smack right into it! I fall to the ground and cringe in pain. Then I look up and see there's Zayn looking down at me menacingly.<br>\r\n<br>\r\n\"What the hell do you think you're doing?\" he yells.<br>\r\n<br>\r\nI stood there silent and tried to come up with the \"best\" excuse I could... \"I thought you'd like some food.\" Why did I just say that?<br>\r\n<br>\r\n\"Hmmm... not a bad idea!\"<br>\r\n<br>\r\nWhich does he do?</span></div></div>",
            "created":1462811880,
            "id":2145264,
            "title":"Try to escape... and fail with punishment"
        },
        "12223":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "Make you smaller as punishment for disobeying Zayn",
                "Make Zayn bigger so he can dominate you at a bigger size"
            ],
            "content":"<div class=\"\"><div> <span>I began to kiss and lick his ass through his underwear, causing Zayn to moan. Then I wriggled around a bit because I knew that aroused him. I unintentionally slipped out but Zayn didn't really notice. I noticed a ray gun and ran back to Zayn with it.<br>\r\n<br>\r\n\"How did you get out from under me? And what is that?\" Zayn picked up the gun and I gripped it with dear life.<br>\r\n<br>\r\nZayn read the label: <b>Size Changing Ray Gun</b> - Makes anything grow bigger or become smaller. Caution: Not meant for constant use.<br>\r\n<br>\r\n\"Ooh! This must be how you shrunk! Hmm... What should I do with it though? Oh! I know!\"</span></div></div>",
            "created":1466603700,
            "id":2168505,
            "title":"Give in to Zayn and become obedient"
        },
        "122231":{
            "author_id":"1d5soslover",
            "author_name":"1D5soslover",
            "choices":[
                "they are all mean and like zayn",
                "they are nice and make zayn be nice to you"
            ],
            "content":"<div class=\"\"><div> <span>\"As punishment for disobeying me I will shrink you to 1 inch\" He points it at me and I yell.<br>\r\n\"Zayn plz no,i wont disobey anymore I'm sorry\" but he shrinks me anyway and laughs. He picks me up and brings me close to his face.<br>\r\n\"Maybe the lads would like to have some fun to\" Zayn runs down stairs and I see Harry,Louis,Niall and Liam all sitting there,giant.</span></div></div>",
            "created":1471299900,
            "id":2196345,
            "title":"Make you smaller as punishment for disobeying Zayn"
        },
        "122232":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "\"Get back to worshipping my glorious ass!\"",
                "\"Worship my massive feet!\""
            ],
            "content":"<div class=\"\"><div> <span>You watched in horror and arousal as Zayn shot the gun at himself. This was both a dream and and nightmare for you. His muscles grew stronger and his ass grew fatter and more plump.<br>\r\n<br>\r\n\"Ooh I feel so powerful!\" Zayn cooed. \"Now what to do with you? Hmm... I wonder. Oooh I know!\"</span></div></div>",
            "created":1489152240,
            "id":2287507,
            "title":"Make Zayn bigger so he can dominate you at a bi..."
        },
        "123":{
            "choices":[
                "Mouth",
                "Dick",
                "Ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see that look on his face its pure primal hunger he picks you up and brings you towards his massive.</span></div></span></div>",
            "created":1340946000,
            "id":1369327,
            "title":"hunger"
        },
        "1231":{
            "choices":[
                "Yes the acid disloves you",
                "No your immune to acid"
            ],
            "content":"<div class=\"\"><div> <span>You hear a loud gurgle coming from his belly as you quickly realize whats going on he has you lifted over his open mouth you see his pearly white teeth glistening with saliva. You beg for him to stop but all he does is let go and you plummet into the hot and slimy cave that is zayns mouth. You land on his boiling hot tongue. And get a with of his stinky pizza breath as he starts to swish you around getting you covered in his sticky salvia. You try to scream but end up getting a mouthful of his spit. He lifts up his tongue and you slide backwards into the dark cavern that is his throat. You hear a loud gulp as you slip into his throat you feel the muscles massaging you as they send you down to your tomb. You plumet into his stomach and land on part of a pizza. You see his stomach churning getting ready for digestion. LET ME OUT!!! you scream only to feel zayn pat his belly and start to get ready for bed. The acid starts to disolve the slice of pizza your on. Will you die in zayns massive gurgling belly.</span></div></div>",
            "created":1340946000,
            "id":1369335,
            "title":"Mouth"
        },
        "12312":{
            "choices":[
                "You shout continually until someone hears you. ",
                "You wait it out."
            ],
            "content":"<div class=\"\"><div> <span>The last piece of pizza dissolves into his stomach acids, \"I am going to die.!\" you think to yourself as your body finally touches the acid.<br>\r\nHowever there was no pain, as you expected. There was no burning or anything.<br>\r\nThe walls of the stomach continue to gurgle but you don't get digested but sit in the acid of his stomach.<br>\r\nYou saw two outcome to this:<br>\r\nA) You still live another day and not turn into Zayn's meal.<br>\r\nB)You were still stuck in the stomach of Zayn and had noway of getting out.<br>\r\n<br>\r\nAs Zayn get ready for bed you come up with your plan. </span></div></div>",
            "created":1376802000,
            "id":1648190,
            "title":"No your immune to acid"
        },
        "123122":{
            "choices":[
                "Harry",
                "Fan"
            ],
            "content":"<div class=\"\"><div> <span>Morning came, and after a long night not being able to sleep because of Zayn stomach rumbleing, you feel like life could not get worse. Well it didnt get better when Zayn when down to the lobby and got breakfast. He ate cereal which curdled in the acid, He then ate a<br>\r\nBanana which turned into a saliver filled mush as it entred him. And finally he had eggs which looked gross in the Banana much, Crudled Milk acid<br>\r\n<br>\r\nLater you tryed shouting but he just laught back. But he was amazed at how you werent died. At lunch he has somemore leftover pizza with soda.<br>\r\n<br>\r\nAfter everything was digested it was just you in the small stomach of Zayn.<br>\r\nYou shout \"Zayn get me out.\" <br>\r\nAfter 5 minutes he made him self sick in the bathroom toilet, to let you out. <br>\r\nYou fell in the cold water and swam out to the rim.<br>\r\n<br>\r\nJust then Harry entred the bathroom<br>\r\n\"Hay Zayn were going in... Wait whats that?\"qustioned Harry.<br>\r\n\"Well, the person who was going to meet us, well, it got shrunk and i ate it, but it turned out to not digest in my stomach.\" Said Zayn<br>\r\n<br>\r\n\"Well, what we can do is, give it to me and I will eat it ,or we give it to a fan a dare them to eat him. Either way somone going to get somthing to eat.\" Harry said.<br>\r\n<br>\r\n</span></div></div>",
            "created":1376888400,
            "id":1648287,
            "title":"You wait it out."
        },
        "1231221":{
            "choices":[
                "H",
                "H"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't be bothered to get fan, you might as well eat him. I'm not ,I feel sick.\" Zayn said in a worn out voice.<br>\r\n\"Thank god, I am starving.\" at that moment a gurgle came from his stomach, he looks at you with hungry eyes.Harry picks you up from the seat,you smell a meaty smell coming from Harrys mouth.<br>\r\nYou see his pure white teeth with bits of he last meal leftover, you could tell he had beef.<br>\r\nHe lowers you to his pink cave, but he stopped and lets out a massive Burp! <br>\r\nThe smell of beef and vegetables comes out of his mouth.<br>\r\nHe then continues with you, until you are in his mouth feeling the hot wet tongue below you.You try to struggle but what is the point. You feel the tongue push back as you go down he throat and into his stomach,   As you fall in you fall into a pile of meat and vegetable in a soup of cola. You wait it out again.<br>\r\nBut Harry loves every moment of it.<br>\r\n </span></div></div>",
            "created":1376888400,
            "id":1648363,
            "title":"Harry"
        },
        "1232":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "no",
                "yes",
                "someone knocks on the door"
            ],
            "content":"<div class=\"\"><div> <span>He picks you up and quickly goes to his room and locks the door. He stares at you and winks before bringing you up to his mouth and licks your entire body drenching you in his sticky saliva. \"Have fun little guy he says as he pulls his pant down and you see his massive piss slit. You see he is hard as a rock and precums leaking out of dick. He slowly brings you towards his massive organ and sticks your feet in. you feel something slimy all over your feet at he slowly pushes you down to your waist. He moans in pleasure he's in absolute bliss. His tongue is hanging out of his mouth and hes practically panting  from all the pleasure. Thats when you realize your going in know matter what. With another push you slide up to your neck. He starts to jack off knowing there is no way for you to escape him. You feel his hand clamping down on you he starts to jerk off moments later you feel a flood of cum slamming into you do you shoot out</span></div></div>",
            "created":1340946000,
            "id":1369383,
            "title":"Zayns hungry dick"
        },
        "12321":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "harry comes in",
                "nial comes in"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cpink\"></span>unlucky for you his dick sucks you up completely and your trapped in his massive dick he moans again watching you bulge slip all the way down his dick and slip into his nuts. He watches in amazement as the ball your trapped in swells up to accommodate you the trips alot less fun for you though. The walls are slimy with cum and his dick reeks of piss. and even worse it is unbelievabley tight and all you can do is wiggle around causing zayn to moan. As you feel you foot slip into a more open space. The rest of your body follows and your head slips in with a loud slurp. You are now trapped in his reaking ball sac. he goes about the rest of the day like you never existed going to the beach with the band having dinner and when he finaly get back to the hotel he feels you squirming weekly in his nuts.He massages his balls and says what the matter little guy dont like it in there. He laughs at your pitiful struggles that are only giving him more pleasure im going to bed night little guy. just when he gets in to bed and is about to fall asleep </span></div></div>",
            "created":1340946000,
            "id":1369401,
            "title":"into the balls you go"
        },
        "12323":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "titty fucks ",
                "Blowjob. Down in a shemale's belly you go."
            ],
            "content":"<div class=\"\"><div> <span>Zayn opens the door and sees his secret boyfriend Lance. He was crossed dressed wearing a bra that covered his shemale D cup tits. Lances sees you struggling and licks his lips. The giant kneels down and rubs his boyfriend's dick. You get a good look at Lance and notice he's eyeing you like a piece of candy.<br>\r\n<br>\r\nLance: Mmm you look tasty. How about it love? Feed my chubby belly with your rich jizz or fuck theses giant mounts with him squirming?</span></div></div>",
            "created":1581765180,
            "id":2787538,
            "title":"someone knocks on the door"
        },
        "123232":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "Cums ( vore )",
                "Decides to do something else "
            ],
            "content":"<div class=\"\"><div> <span>Zayn: Mmm Suck on me whore.<br>\r\n<br>\r\nYou struggle trying to get unstuck from Zayn's penis but suddenly feel the saliva from Lances mouth as he came towards you.<br>\r\n<br>\r\nYou: No!!<br>\r\n<br>\r\nLances tongue muufles your screams as he gives his lover a blowjob. The shemale giant enjoying the mixed flavors. <br>\r\n<br>\r\n<br>\r\nZayn....<br>\r\n</span></div></div>",
            "created":1586979780,
            "id":2819312,
            "title":"Blowjob. Down in a shemale's belly you go."
        },
        "1232322":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "To swallow ",
                "Feed you back to Zayns with a kiss "
            ],
            "content":"<div class=\"\"><div> <span>Zayns cuckles as his boyfriend sucks fast. Zayns was just about to cum as pleasure was pushing you outwards.<br>\r\n<br>\r\nZayns: oh he's gonna eat somebody. Look like it's gonna be you!! Ugh!!!!<br>\r\n<br>\r\nZayns climaxes and you land on Jeans lizard like tounge. Looking at you with lust and hunger he sways his chubby hips in a dancing motion. You struggle but Zayns jizz and Jean saliva was like glue. Jean knowing the song that's  Zayns was quoting as he came. Decides to finish it in his slutty tone of voice.<br>\r\n<br>\r\nJean,  🎵 mmm kick it one time. Get in my whore belly.<br>\r\n<br>\r\nYou : no no no no<br>\r\n<br>\r\nJeans,  \" Wel 'cum' to the foodchain 🎵<br>\r\n<br>\r\nBefore you could beg for your life his tongue slurps you end. He decides<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1573966800,
            "id":2747726,
            "title":"Just feed you to him already"
        },
        "12323221":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "Die",
                "Get spat up later on"
            ],
            "content":"<div class=\"\"><div> <span>Jeans tilts his head back and slowly swallows you down. Zayns laughs while watching you struggle and scream down his whore boyfriend's throat. Jeans moans swaying his shemale hips loving the fact you would add to his sexiness.<br>\r\n<br>\r\nJeans: Mmm hmm mmm<br>\r\n<br>\r\nZayns: Bye Bye tiny fuck!<br>\r\n<br>\r\n\"<b>Nooooo!!!</b>\"<br>\r\n<br>\r\n*Slurp ! Gulp !*<br>\r\n<br>\r\nJeans sends him down his she-male throat and with a sinister smiles the Giant rubs his chubby belly.<br>\r\n<br>\r\nJeans: Mmm..So yummy and gooey. Too bad there's not more of you tiny Cum Snacks. Tee hee hee. ~<br>\r\n<br>\r\nDo you...<br>\r\n</span></div></div>",
            "created":1575262800,
            "id":2754606,
            "title":"To swallow "
        },
        "13":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "Bathroom to shower before bed",
                "kitchen for a midnight snack",
                "his bed to go to sleep",
                "to one of his band members rooms ;)"
            ],
            "content":"<div class=\"\"><div> <span>nialls massive form towers over you as he yawns and stretches before bed. he starts walking towards the you and you don't notice until his massive foot is right over you that your about to get squashed under his sweaty soles. you don't have enough time to react as his foot smashes down on top of you. leaving you wedged in between his big and second toe. your stuck breathing in his his rank foot stench as he walks to the. </span></div></div>",
            "created":1340946000,
            "id":1369310,
            "title":"nial"
        },
        "131":{
            "author_id":"xsadxstar98",
            "author_name":"luxury",
            "choices":[
                "Toilet",
                "Shower."
            ],
            "content":"<div class=\"\"><div> <span>You feel almost unbelievable pressure on your head as Niall's firm meaty toes clench as he lifts his foot up and takes his first step towards the bathroom. You feel like your heads going to explode from all the pressure as he begins the short journey to the bathroom. Your forced to breath in his foot odor which is worse than you could ever imagine for such a clean cut young man. He steps onto the cold tile floor in the bathroom and quickly strips off his shirt giving you a amazing view of his chiseled abs.He then removes his boxers unveiling his thick juicy cock which you can tell is bigger then you soft. He stands in the bathroom completely naked and steps towards the.   </span></div></div>",
            "created":1360040400,
            "id":1525157,
            "title":"Bathroom to shower before bed"
        },
        "1312":{
            "choices":[
                "You (You've been discovered)",
                "Shampoo (Front row seat to Niall's shower)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You feel yourself being carried by Niall enormous foot onto cold, wet tiles and you start to peel off of his foot. You stand and see a fully nude Niall before you. He turns on the water and turns to see...</span></div></span></div>",
            "created":1373518800,
            "id":1626335,
            "title":"Shower."
        },
        "13121":{
            "choices":[
                "...how about I clean you up?\"",
                "...how about I return the favor?"
            ],
            "content":"<div class=\"\"><div> <span>Niall's eyes wander towards his feet and suddenly his expression change to one of pure disbelief. He leans over and squats to get a better look at what he has seen all while you stand there petrified  of his next move. <br>\r\n<br>\r\n\"Well would you look what we got here! A little man!\"<br>\r\n<br>\r\nHe reaches down and you feel his forefinger and thumb pinch your torso before you can run. He brings you up to his face and lays you on his palm. He smiles and you manage to give a weak smile back, hoping he would be kind. <br>\r\n<br>\r\n\"How did you get here? And why are you so small\" he asks curiously.<br>\r\n<br>\r\n\"I'm not sure how I shrunk, but after I did, you kinda stepped on be and brought me in here.\"<br>\r\n<br>\r\n\"Hahaha! That must've been a wild ride. As long as we're here why don't you give me a hand with cleaning up. I could use a little washcloth.\" His grip becomes tighter and your eyes go wide with fear.<br>\r\n<br>\r\n\"B-b-but....I r-really don't think...\"<br>\r\n<br>\r\n\"And I really don't care. You're not really in a position to argue little guy\"<br>\r\n<br>\r\nHe reaches for the soap and rub your front roughly against it. This, against your will, was rough enough to stimulate your tiny pecker and you moaned with forced pleasure. <br>\r\n<br>\r\nNiall then takes your miniature body and rubs you over his smooth chest and abs. He makes sure to rub a little more over his nipples. He stops over his right nipple and you hear him say, \"Suck it.\"<br>\r\n<br>\r\nNot wanting to upset your giant, you wrap your lips around his nipple and start licking and sucking. You hear his moans from above as he moves you away from his chest. You wonder where he's taking you until you start to feel large hairs gathering around you and you realize he's dragging you through his pubes! You wriggle and squirm, but it's too late. You feel his enormous manhood underneath your feet and he pulls your legs apart so that you're riding his monstrous dick. He gently lays you down so that you're forced to cling to his penis for fear of falling. His hands wrap around your body and he starts jacking off with you. Your world is rocking so heavily now, not to mention a face full of precum with every stroke,and you squirm even harder. This only speeds up the process and he squirts his ocean of a load on you, his stomach and the shower floor.<br>\r\n<br>\r\nHe grabs your arms and pulls you to his face and he says, \"You've made quite a mess...</span></div></div>",
            "created":1373518800,
            "id":1626340,
            "title":"You (You've been discovered)"
        },
        "132":{
            "author_id":"gianthazza",
            "author_name":"Gianthazza",
            "choices":[
                "In a burger",
                "On a pizza",
                "On your own"
            ],
            "content":"<div class=\"\"><div> <span>Nialls large hand shadows over you. The hot irishman lifts you to his face but before you could say anything his stomach let out a large gurgle. A smirk appeared on his face. And he lifted up his hairy sweaty blonde armpit and said \"i cant wait to take you to the kitchen god i am hungry but for now i want to flavour you in my stinky pits.\" Nialls pushed you into the jungle of moist marinade and closes his pit.<br>\r\n<br>\r\nNiall makes his way down to the kitchen with you still absorbing the intense flavour. Finally after an hour he lifts up his horrible wet pits and revels you. \"Now how shoud i eat my little morsel\"</span></div></div>",
            "created":1460350800,
            "id":2131373,
            "title":"kitchen for a midnight snack"
        },
        "1322":{
            "author_id":"gianthazza",
            "author_name":"Gianthazza",
            "choices":[
                "Harry getting put in nialls undies and gobble down",
                "Zayn getting the pit treatment and devoured in an instant",
                "Double whammy louie and liam  feet and quenching nialls gut"
            ],
            "content":"<div class=\"\"><div> <span>You are pulled out of the giants pits and slammed onto what appears to be dough.<br>\r\nNiall looks down at you and says \" hey you tasty bit a pepperoni your my mid night snack. But you wont be alone. He reached into his pants and pulled out harry zayn<br>\r\nLouie and liam they also get slammed down onto the pizza\" hey boys i found that guy who didn't show up\" niall said with hunger in his eyes. \" why are we here\" the naked louie said. \"Well my tasty little squirt you guy have always made me hungry an i have always wanted to gobble you up and torture you and nows my chance but first let me eat my starter a lovely cheese and dweeb pizza.<br>\r\nNiall puts you in the oven on top of the pizza and waits untill you are golden brown.<br>\r\nThe giant pulls the pizza out of the oven and pulls the slice with you off. \" thisi gonna be good\" nial says as he starts to devour the pizza.he is at your feet and is now starting to rise up your body at tis point you have a full on boner and the feel of his tongue on it is enough to make you explode. And fortunately for niall you did \"cheers mate this pizza needed something salty. Niall has finally got you in his mouth and you fall in to the wet hole you are being mixed around with his saliva and cheese.<br>\r\nNiall takes one big gulp and you drop into his massive gut he lets out a burp scratches his hairy chest and looks at the others \" ahh whos next<br>\r\n<br>\r\n<br>\r\n<br>\r\n               You will be in the pov</span></div></div>",
            "created":1460350800,
            "id":2131383,
            "title":"On a pizza"
        },
        "13221":{
            "author_id":"gianthazza",
            "author_name":"Gianthazza",
            "choices":[
                "In the beasts belly"
            ],
            "content":"<div class=\"\"><div> <span>You are harry<br>\r\nNiall picks you up and says \" see you soon my little toy\" you get drop into nialls undies and bounce off of his huge dick. You then get tangled in the giants sweaty blonde pubes. \" you having fun in their harry\" niall says <br>\r\nSlowy the massive pole turns hard and you get squashed on the top. Niall demands you start giving him a hand job and he is loving it. After a few second he reaches a climax and he explodes and his white stuff is spilt all over you. The hottie pulls you of and licks you clean. \" as we have been friends for years i will let you choose how i eat you\" says niall. \"I dont care just get it over with\" you say<br>\r\n\" my favourite answer\" he lifts you up and drops you in his mouth enjoying that sweaty and creamy taste you have. \" ughh yes this is amazing i need to do this more often!!<br>\r\n\"GULP\" and your in his belly <br>\r\nNiall lets out<br>\r\nBURP UGGHH BURP\"</span></div></div>",
            "created":1460387640,
            "id":2131384,
            "title":"Harry getting put in nialls undies and gobble down"
        },
        "1323":{
            "author_id":"gianthazza",
            "author_name":"Gianthazza",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Niall peels you of of his pit and looks at you small tasty body.\" God i am hungry i have been for ages since the show acctually i was ready to eat all my fans i can imagine it now a giant me scooping them all up and placing them in my mouth uuggh amazing<br>\r\nAnyway i have you\"<br>\r\nNiall picks you up and places you in his hot mouth his tounge swirls you around and lick all that sweat off of you. Within one big gulp you are in his belly<br>\r\n<br>\r\nNiall lets out a huge burp scratches his pubes and walks away to go find some more prey.<br>\r\n</span></div></div>",
            "created":1460350800,
            "id":2131376,
            "title":"On your own"
        },
        "133":{
            "author_id":"yazminbaskin1d",
            "author_name":"llamalittle",
            "choices":[
                "Breakfast with the boys ",
                "Someone picks you up",
                "you fall in someones lap"
            ],
            "content":"<div class=\"\"><div> <span>Niall gets in to his bed and  you scream for help. \"NIALL,NIALL! HELP!\" Niall looks down at his foot and see's you he picks you up. \"oh my god are you ok im sorry if i hurt you.\" \"it's fine i just need your help to get me back to normal.\" \"but your so cute like this kind of like a baby,omg ok your my new baby\" \"Niall i need help\" \"shhhh quite now baby time for bed and tomorrow i will show you to the lads.\" <br>\r\n<br>\r\n------tomorrow-----<br>\r\n<br>\r\nYou wake up to someone poking you. \"time to get up baby i have to show you to the lads\" Niall dose not even wait for a response he picks you up and bring you to what looks like a hotel dinner room. You see 4 other teen boys sitting at a table. \"so lads i found a tiny person who is our new baby!\" Niall shows you to everyone. \"Niall were did you find him?\" Liam asked. \"on the bottom of my foot.\" \"i'm so hungry,lets eat then talk about him,\" Louis said \"ok\" everyone said.   </span></div></div>",
            "created":1464751680,
            "id":2156963,
            "title":"his bed to go to sleep"
        },
        "14":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Hides me IN his shoe",
                "Shoes me to the group",
                "Shows me to Harry",
                "Shows me to Louie",
                "Shows me to Zayn"
            ],
            "content":"<div class=\"\"><div> <span>You do what you can to dodge the 8 pounding feet of the giant teen singers. There are sneakers pounding everywhere. You can’t believe for just being kids how big they are. You see Liam settle in on a chair in the corner of the hotel room, seated slanted and with one leg slung over the arm. The other foot firmly planted on the floor. You look up at the dangling sneaker high above you over the arm of the chair. He is wiggling his foot in it and it works its way to just being dangled by his toes. You’re mesmerized. Then as if in slow motion the shoe falls from his socked toes and heads straight for you. You are frozen in place and all you can think to do is duck before the gigantic sole lands directly on top of you, flattening you beneath it. <br>\r\n<br>\r\nHe stops looking thru his phone and leans down to pick up the fallen converse. <br>\r\n<br>\r\n“Eiew, I must have stepped in something” he says. Then looks closer. <br>\r\n<br>\r\nYou body squished at the pressure of the fall but you are now reanimating and start to pop back into shape. He sees you and focuses in. “Aren’t you the guy that was suppose to meet us backstage? <br>\r\n<br>\r\n“YES ! I was in your dressing room and this happened to me ! I need you help to get back to normal.” You shout in a small squeaky voice. <br>\r\n<br>\r\n“Back to normal? HA, yeah right. I think I like you just like this.” <br>\r\n<br>\r\nYour standing on the floor and he moves his socked foot toward you. So how does my foot smell down there, my pet?” he asks and knocks me over and lays his foot upon me pinning me down. I struggle under the weight and smell. He was getting aroused by the power. I could see him rubbing himself as he sat over me in the chair. <br>\r\n<br>\r\nI gag and cough. <br>\r\n<br>\r\nThe other guys see him doing something odd and approach as well. “What Cha got there?” they ask. <br>\r\n<br>\r\nLiam……<br>\r\n</span></div></div>",
            "created":1343797200,
            "id":1395399,
            "title":"liam"
        },
        "15":{
            "author_id":"sonicfan97",
            "author_name":"sonicfan97",
            "choices":[
                "Plays with you (Clean)",
                "Plays with you (Dirty)",
                "Gets his brothers so they can all play with you",
                "Ends your life right there and then",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You go to Louie to get help, thinking that he's an understandable guy and that he won't be as mad as the others are for you not showing up to meet them. You would soon find out you were terribly, horribly wrong. He was the angriest out of all of them. He thought of a few jokes he wanted to tell you, but he didn't get the chance. He was in his room resting, still pissed off at you.<br>\r\n<br>\r\nYou wandered through the house for a hour now, avoiding been seen by any other member of One Direction in case they were still angry, and you eventually come across Louis's room. You see the hot giant (you always did think he was the cutest out of them all) sleeping in his bed. You climbed up his dangling sheets slowly, which took a long time, and get to his ear and scream as loud as you possible can,\"WAKE UP LOUIS\", so he'd wake up. It worked. You head to the front of his eyes as he gets up in shock to see a tiny guy right in front of him. He stares in amazement and said,\"Who are you, and how'd you get so tiny?\" You reply,\"Um hi Louis, heh heh. Um....you see.. I'm the guy who was going to show up at your dressing room. I was going to---.\". He interrupted you and said,\"Wait, you're that jackass that left us waiting? Man. I'm still anger about that!! But it's ok\". You were confused and asked why.\"Because now I have a new toy all to myself to play with.\" He said grinning. You were scared from the way he looked at you.\"WAIT! PLEASE!! LET ME EXPLAIN!!!\".\"Too late for that little guy. I don't want you excuses. All I want now is revenge and pleasure\". You tried to run away but he caught you in an instant. He then....</span></div></div>",
            "created":1390885200,
            "id":1734615,
            "title":"Louie"
        },
        "152":{
            "author_id":"sonicfan97",
            "author_name":"sonicfan97",
            "choices":[
                "Louis tortures him for a week",
                "Louis tortures him then kills him",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>(If there are any spelling mistakes in my chapters. I apologize. I don't mean to, and I know that it ruins the flow of stories but mistakes are part of being human. That said, my additions are very inhuman.)<br>\r\n<br>\r\nLouis Point of view:<br>\r\n<br>\r\nI couldn't believe my luck today. I have a tiny person in my hand, and not just any person. The same jackass that showed us up today after the concert. I'm still really mad at him now but also happy inside because this is usually when I jack off but now that I have this tiny bug all to myself, I think I'll have a little bit of sadistic fun with him. I put him down on the ground as I go to lock my door so no one can ruin my fun or save this guy and just to be sure, I also close all the window blinds,(even though were on the 30th floor in our hotel), push my bed aside and push my drawer in front of the door so he can't go under the door. People don't know it, but I'm secretly the strongest out of one direction. All the time i'm doing this, he just stares at my cock , making me think he has a thing for me. I also like to sleep naked at night, since I find pajamas uncomfortable and I like to look at my hot body every now and then in the mirror. I ask him,\"dude are you gay for me or what?\". He just nods his head me in fear and awe. I then grin at him and say,\"Well don't you worry. I'm make sure you get some by the end of my fun\". Oh he'd get some of my seed alright, but not exactly in the way he thinks.<br>\r\n<br>\r\nI then start my fun with him by licking him to make him real scared of me. I get an erection.\"Mmmmm you taste great, maybe just skip my fun and eat you for dessert.\" I taunt. He starts to freak out and plea for mercy but I wouldn't show any tonight. In fact, all his pleading and begging just make my cock harder. I through him in my mouth to scare him some more and I even bite on him softly, but the pressure still caused him to lose some blood and scream loudly in pain. I almost moaned at his screams of pain and terror and start to get really hard but I held it in to let it later. I snicker at him and spit out onto the floor below. If it wasn't for my saliva surrounding him, he'd probably break every bone in his body from that fall. He tries crawls away in fear as I start walking slowly to him, but he had nowhere to go or hide. He look up in fear as I raise my dirty foot with a mean grin and pin him under it. Being up on stage, people can't smell me so they don't know I haven't showed in a month or two. My stink was really getting to him and he begged to get it off. I threaten him,\"take it in for a few more minutes bug, and maybe you won't become a red stain under my foot\". I apply a little pressure and he agreed to stay under. I just loved making him fear me. I didn't really mind cleaning up after the messes I make so I took my foot off of him and start to pee on him. I was sighing,\"Ahhhhhh.....yeeeaaahhhh..\", in relief from holding that in all day. He however, was struggling for air as he was pushed around by my golden shower. I stopped two minutes later and he inhaled deeply. I was just shocked he was still breathing from being in my piss for so long.<br>\r\n<br>\r\nYour point of view:<br>\r\n<br>\r\nI was coughing out piss from that crazy sadistic teen people call a singer. I wasn't so scared and even wonder if I'd make it out long enough to get any from him later, which I found was the only good thing that would happen tonight. I was so wrong in getting his meaning by that as I'll see later. This teen only gets more hard from all my pleas for help and cries of pain. So far he threaten to eat me, which I was convinced he wanted to do when he bite me, and squish me under his dirty,smelly foot. I kept begging for him to stop and forgive me but he just laughed at me. I didn't think it get much worse than this. I was totally wrong as I looked at him in complete terror of what he said he'd do to my next.<br>\r\n<br>\r\nLouis POV:<br>\r\nAfter he begged me to stop, which I laugh at and reply,\"No way bug. I won't forget what happened today and neither will the other members. You're out of luck.\", I then said to him,\"Now begins the real fun.\", as I turn around and show him my ass.\"Guess where you're going bug.\" I said to him in a mean and cruel way. He just looked up at me, frozen in fear. I then turn my head sideways to look down at his scared expression and grin as my round, bubble butt falls down on top of him. I then reach down with my hand, put it right under my ass and pick him up under it. I then shove him up my asshole and because he's still wet from my piss, I was moaning and got even harder. I then took my hand out from under my ass and put them to the side as I sat there and listened to his screams for mercy. I thought of something and said,\"Don't worry bug, I know how to make you dry. Heh heh heh.\", as I got ready to fart on him. I look at me ass with an massive evil grin as I licked my lips, thinking out all the terror I just put him. If he thought my asshole was the worse smell ever, he wouldn't be pleased with my farts. I then let out a massive, long, horrible smelling fart on him and he start to really struggle inside my hole. I sighed and moaned at the large amounts of pleasure I got from torturing him . His begging for my not to do it again only made me want to do it more so I was laughing cruelly as I bombarded with long and smelly farts for a good while. All through out it all, I was getting more harder and harder.I then decided it was time so I lifted my ass off the ground a little a let out a very strong fart as he shot out of my ass and into the floor. I then sat back down, grabbed him and stuck my tongue out in pleasure as I shoved him into my piss slit until only his head stuck out. He finally got my meaning and look up shaking his head, not wanting me to do it. I nod slowly at him and smirked evilly as I started to jack off. I was really getting off from all his struggling and I started to moan loudly. Lucky for me, everyone else in the hotel was a heavy sleeper and didn't wake up from my moaning or my roar a tiny bit later. I manage to say while moaning,\"Yeah....ughhh...I'm.....going to..keep you...as......my slave for...awhile...uggghhh.......and there's nothing you can do to stop me.....heh...heh...heh........ughhhh....gonna blow....gonna cum now\", as I was ready to explode. I roared in pleasure as I shot thick ropes of cum into the air and my new slave along with it. My seed rained down everywhere on the floor and on my foot, legs and ball sack and he just so happened to land on foot. I was panting a short while after. That was the best orgasm of my teenage life. I then see him struggling to get off my foot, but the cum stuck him to it. I grinned at him and say,\"well bug. looks like you'll just have to sleep there tonight, heheheheheh.\" as I laugh and walk over to push my bed back, and every step I took made my slave scream out in pain, and I loved every second if it. I then clean myself and the floor, avoiding my slave on my foot since I want to keep him there, and got into bed as I quickly fell asleep. I couldn't wait to do it again tomorrow.</span></div></div>",
            "created":1391058000,
            "id":1735608,
            "title":"Louis is a evil teen"
        },
        "1522":{
            "author_id":"sonicfan97",
            "author_name":"sonicfan97",
            "choices":[
                "Louis shrinks people to play with them",
                "Louis grows himself into a cruel giant",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Your point of view:<br>\r\n<br>\r\nOver the last 7 days, it's been nothing but pure torture for me. He kept torturing me in similar ways he did when he first found me but added a few new ways too and because of it, I'm too scared to even think about it. All I am going to say about is that I now have bruises everywhere and almost all my bones are broken. I can't even run away if I tried. I picked a horrible choice, Louis is by far the most meanest teen I have ever had the displeasure of coming across. I think the other guys would have helped me or at the very least let me explain why I didn't show up. Louis then came into the room and I started peeing my pants in fear of what he'd do to me next. After he threatened me some more, he then asked for something I wanted to say to him all along.<br>\r\n<br>\r\nLouis point of view:<br>\r\n<br>\r\nThis week was the best week of my life for sure. Every day would start out the same as any other except the first because I took my slave off my sticky foot, wanting to not kill right away. I put my slave inside a glass cage, since he was to weak to break it, and put in food so he wouldn't stave. I don't want explain how he did his business but let's just say, It involves a really long small tube. I made sure no one went my room when I was preforming on stage by locking my door before leaving. After preforming, I went to my room as quickly as I could and played with my slave like I did the first time while naked. The only things different I did was break a few of his bones with my foot so he screams would make my orgasm much more enjoyable and when I shot him out of my cock, he'd land somewhere different on me each time. I then start to wonder how he got so tiny in the first place so I decided to asked him today. I came back from another show, whoever is paying for these concerts must be rich, and saw my slave coward in fear so much that he peed himself. I then take off my shoes and socks and slam my foot right down on top of him, causing him to struggle under. He then sticks to my foot so I sit down on my bed and bring my foot up to my face.\"I want answers now bug. How did you get so small? If you don't tell me the truth, I'll pick you off my foot and squish you under my ass.\" I threatened him. I can tell he just wanted to yell at me in anger but I lift my hand and put real close to him and he told me quietly in fear.\"I don't know how, all I know is that I was going to meet you all backstage and then I felt dizzy and collapsed right outside of your dressing room. When I came to, I was now tiny and harry was coming right at me so I jumped onto his boot and hung on until I got here. Then harry went to take a shower and I went to find you so you could help me.\" he explained. I now know why he didn't show but didn't know how he got tiny. I was mad and grabbed me slave. He scream for mercy as I put down my pants and underwear and shove him up my asshole. I then pulled me clothes up and went to Harry's room to find answers.<br>\r\n<br>\r\nHarry was resting on his bed, watching TV. He door was open so I didn't have to knock it down. I then asked him if anything special happened to him when we waited for the fan backstage. Harry replies,\"Oh yeah, something cool happened to me that day. I found this weird looking gun right inside our dressing room. When I pick it and tried using it, it started shooting everywhere and everything it hit shrunk down. I looked at the shrunken stuff and found out it was a shrink ray. I kept in my pocket to use later, then you guys came in. We waited for our fan who won the chance to meet us but he never showed up. I then stormed off in anger and started taking out my anger on some people. I shrunk a few of them and squished them under my boot and even grabbed and put some in my underwear. When I got home I had blood stains all over my ass so I took a shower and didn't use the shrink ray again, unless I was pissed off\". Now it made sense! When the shrink ray shot everywhere, one shot must went out of the dressing room and hit my slave, which made him tiny. I was really mad at Harry now and said to him in anger,\"Did you even think and consider that one shot from that shrink ray could have hit our fan if he was just outside the dressing room!?!?!? Harry think thought about and nervously replied,\"No I guess I didn't, sorry. Hah hah\". With all my might, I then punched Harry in the face in anger and knocked him out cold.\"You stupid fool! I waited all that time for nothing because of you!!!!!\" I shouted at him in anger, even though he can't hear me. I then took a look at his shrink ray and notice a grow setting. It wasn't a shrink ray! It was a size ray!! I couldn't be more happy knowing what I could do with this now.</span></div></div>",
            "created":1391317200,
            "id":1737268,
            "title":"Louis is in control now"
        },
        "15222":{
            "author_id":"sonicfan97",
            "author_name":"sonicfan97",
            "choices":[
                "Louis destroys the military and continues his fun",
                "Louis finds another city to destroy"
            ],
            "content":"<div class=\"\"><div> <span>Your POV:<br>\r\n<br>\r\nI just heard Louis talking to Harry and now I know how I shrunk, it was Harry's fault! He shrunk me right before I met him and he's the reason I'm now suffering from this evil teen above me. I would have scream in anger but the smell of Louis's asshole was making me try to hold my breath as long as I can. I then heard something real horrifying, Louis just said to himself,\"I wonder. Should I shrink people and torture them life my slave or should I grow into a giant and squish people and their homes?\", making me realize he's got the size ray!!! I shuddered to think of what what happen to the world now.<br>\r\n<br>\r\nLouis POV:<br>\r\n<br>\r\nI was decided whether I should shrink everyone or be a massive and cruel giant. I then made up me mind. Being a giant would be more enjoyable so I used the grow function on the size ray and slowly grew myself to 120 feet tall. I was laughing evilly as my apartment started to crumble and my clothes started to rip off my body, leaving me naked which I didn't care for anymore. When everyone else in One Direction knew what was happening, they ran down the stairs and escaped the crumbling building. Even Harry, who quickly came to, noticed me growing and ran outside. When I finished growing, I looked down to find the other members of my groups and then I found and grabbed them. I then say to them,\"Sorry boys, this is the end of One Direction and this city. But since we've through so much together, I'll get rid you in a special way\". I then grin and started to swing my arm and then I threw them as hard as I could, sending them far away. Little did I know, they landed in a lake in some other part of the world so their still alive, not that it would matter. I then decide to start my fun with this city.<br>\r\n<br>\r\nI then saw a crowd of people staring at me, some in fear and some in awe of my hot body. I then grinned as I raised my massive and bloody foot, the blood comes from my slave when I broke his bones and blood leaked out onto my foot, and then I slam it down on the tiny crowd below, crushing them into a bigger mess under my foot. I then grind my foot into the street and grinned, snickering to myself,\"Stupid bugs, you're now nothing but toys for me to break. Heh Heh Heh.\", as I continue to grind them into dust. I then started to crush buildings under my feet and houses with my cock. Every time I hear people scream in fear of me, I get more and more hard. Any cop that shot me would have their bullets bounce off me. I was now invincible. I would then stomp on them hard and crush their cars as well. I started getting hungry so I picked up a few buildings and chew them to bits, killing everyone inside them. I loved the feeling of being all powerful and squishing everyone I came across. I then started to really mean and did a few things I did to my slave, who's still trapped in there..<br>\r\n<br>\r\nI began to buttcrush every building and crowd of people, or as I now call them 'bugs', I saw. I laughed as some of them got stuck on my ass and felt a ton of pain when I sat down again. I then grew my self to 600 feet tall when nearly every building and house was destroyed. I turn around and looked at city behind me with a cruel grin as I sat down and crushed every remain structure in the whole city. Some people were crushed under my ass checks and some were in between my buttcrack. I lick my lips thinking of what I'd do to them next. I then let out a massive fart on them all.\"Awww yeeeaahh, smell it all in bugs. Heh Heh Heh.\" I sighed and snickered out loud. I laughed as I decided to be more cruel and let out a ton of massive, long and smelly farts on them. Throughout all of this, my slave inside my asshole hung on to my flesh inside to not get blown away. After torture everyone with my farts, I got up, turned back around and grabbed almost everyone in the city with my hand. I then moaned as I stuffed them inside my cock's slit. Most of them where struggling to get their heads out. I then looked at them grinning meanly and drooling as I started to jack off with them. I moaned and pumped my cock for 5 minutes before I was ready to explode. I roared loudly in pleasure and came all over the city. My seed and people were all over the streets and on my cock, ball sack,stomach and face. I licked off the cum on my face and it tasted sweet since some people were also mixed in with it. I then looked down grinning at the bugs struggling to get out my my seed and then I turned around again. everyone looked up  crying in fear as I grinned and said to them,\"Goodbye bugs, you should be honored. You're their first of many cities that'll be destroyed under my ass. Heh Heh Heh\". I then slam my ass down hard onto the ground and squished everyone under it, leaving a red and white mess on it. I farted once more to make sure everyone'd dead and then I laughed evilly at the destruction I caused. I came a little bit more out of pleasure and then went off, crushing any trees, animals or travelers as I looked for the next city.</span></div></div>",
            "created":1391317200,
            "id":1737351,
            "title":"Louis the massive and evil giant"
        },
        "152222":{
            "author_id":"gianthazza",
            "author_name":"Gianthazza",
            "choices":[
                "Protein bursting jocks who are lifting weights",
                "Pubescent teens bursting with sweat and flavour "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Louie moves on and spots a beach. He heads towards it.<br>\r\n<br>\r\nOnce his large hairy feet step on the smooth sand panic let loose <br>\r\nHis huge hairy stomach rumbles and he sees</span></div></span></div>",
            "created":1463393520,
            "id":2148742,
            "title":"Louis finds another city with a beach"
        },
        "1522221":{
            "author_id":"gianthazza",
            "author_name":"Gianthazza",
            "choices":[
                "He spots some girls",
                "He spots some boys"
            ],
            "content":"<div class=\"\"><div> <span>Louie scoops up about 15 guys that are dripping with sweat and looks down at them in his palm \" you puny little men are all mine now hahahah\" his huge stomach moans for food once again  \"hhhmmm now i am really hungry and you guys look good enough to eat so thats what I'm gonna do ah so whos first\" <br>\r\nLouie sits down on the sand and starts devouring 5 of the sweaty jocks who have amazing flavour.<br>\r\nLouie lays back and lets out a massive belch he pats his tummy \" ahh this is the life hey guys do my pits smells\" louie pushes the jocks in his sweaty jungle of  dark brown hair. He closes the stinky pits and moves on</span></div></div>",
            "created":1463394120,
            "id":2148744,
            "title":"Protein bursting jocks who are lifting weights"
        }
    },
    "info":{
        "author_id":"xsadxstar98",
        "author_name":"luxury",
        "brief_description":"While at a one direction concert you get shrunk back stage with the 5 giant boys",
        "created":1340965320,
        "description":"<td align=\"left\" class=\"norm\">you get shrunk with the five sexiest guys ever.<br>\r\n<br>\r\nFew rules<br>\r\n<br>\r\n1.no female giants<br>\r\n2.good gramar.<br>\r\n3.have fun<br>\r\n<br>\r\n<br>\r\nand one hundred gps for every audition</td>",
        "id":1876619,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586979780,
        "modified":1586979780,
        "pretty_title":"giant one direction"
    }
}