{
    "chapters":{
        "1":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Weight gain/Inflation",
                "Macro/Micro",
                "Transformation/Transgender",
                "Hyper expansion",
                "Something weirder?"
            ],
            "content":"<div class=\"\"><div> <span>First we should establish, what sort of changes are you here to explore.<br>\r\n<br>\r\nWeight gain or inflation with creatures swelling into big blimps<br>\r\n<br>\r\nMacro or micro size changing fun<br>\r\n<br>\r\nTransformation or transgender into other shapes or forms<br>\r\n<br>\r\nHyper growth for some extreme sexual fun.<br>\r\n<br>\r\nOr would you prefer something far weirder?</span></div></div>",
            "created":1514696400,
            "id":2434677,
            "title":"First Choice"
        },
        "11":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Science Fiction",
                "Fantasy",
                "Modern Age",
                "Something else?",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>\"Imagination is more important than knowledge. For knowledge is limited, whereas imagination embraces the entire world, stimulating progress, giving birth to evolution.\" <br>\r\n- Albert Einstein <br>\r\n<br>\r\nFar off in the either, beyond anything known to the living world, lay the realm of potential. A ethereal place where all forms of creativity that have existed or would someday exist call home. <br>\r\n<br>\r\nAnd one realm of the limitless expanse lay dedicated to characters. Character of all kinds. Film, television, video game, books. All coexisted in a landscape as varied as the colors of the rainbow. <br>\r\n<br>\r\nMany who called the place home were stars in the making, Characters who's time had not yet come. Waiting to be drawn into existence (perhaps with some minor tweaks or adjustments) to fill a spot as an actor might play a part. Those of the longest running franchises were the biggest stars having the most fame and renown across all the creative landscape. <br>\r\n<br>\r\nHowever others had their time in the spotlight and faded back into average lives in this world of creativity.<br>\r\n<br>\r\nAlthough limitless really if the reality could be divided there were many 'continents' pertaining to characters various categories of science fiction, fantasy, modern age, and so on. The architecture or layout of each reflecting the category of the inhabitants.<br>\r\n<br>\r\nSo where to begin...</span></div></div>",
            "created":1514696400,
            "id":2434678,
            "title":"A New World (Weight Gain/Inflation)"
        },
        "112":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Yes!",
                "No?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about something related to the Spyro universe?</span></div></span></div>",
            "created":1517288400,
            "id":2446688,
            "title":"Fantasy"
        },
        "1121":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "He goes down to the beach.",
                "He goes to the nearest bar.",
                "He goes someplace else."
            ],
            "content":"<div class=\"\"><div> <span>After shopping for groceries and returning home, Spyro knew that his siblings didn't do their chores. The first sign was when he tried to open the door and found that it would not budge.<br>\r\n<br>\r\nFrowning, he put his shoulder against it and, with three hard pushes, shoved the door open. What he found inside made him groan. Mail, addressed to him and his bothers, were everywhere, so many that they were forming heaps that almost touched the roof.<br>\r\n<br>\r\nAnd it was one of those said piles that was blocking to doorway, but now the mail was raining down on the purple after being shoved so violently out of the way.<br>\r\n<br>\r\nAngered, Spyro shouted, \"Guys, get you butts down here, now!\"<br>\r\n<br>\r\nHe waited for a few minutes, but there was no reply, nether did his other siblings show up. Frustrated, Spyro stomped off, climbing up the staircase and arrived a room that belonged to one of his brother's.<br>\r\n<br>\r\nHe could hear a series of beeping and chirping noises inside, and he knew that his younger sibling had shrugged off his responsibilities to play video games, like he always did.<br>\r\n<br>\r\nSpyro barged in and saw that his brother was sitting on his sofa, his table heaped with junk food, and indeed playing video games.<br>\r\n<br>\r\nThe other chubby purple dragon turned to him, smiled innocently, and said, \"Hey bro, what's up?\"<br>\r\n<br>\r\n\"What's up?\" Spyro exclaimed, \"Did you see the mess downstairs? Didn't I tell you guys to clean it, Spyrro?\"<br>\r\n<br>\r\nSpyrro threw his paws into the air and said, \"Clean, clean, clean, that's all what we do! We get hundreds of thesw fan mail everyday. We can't keep up. My eyes and paw are sore from all the reading and replying.\"<br>\r\n<br>\r\n\"I didn't,\" Spyro said, \"ask you to read and reply. I asked you to move the mail to the garage, that's all.\"<br>\r\n<br>\r\nSpyrro folded his arms. \"That's not easy to do too,\" he said, \"Do you know how heavy does sacks are? It feels like I'm going to break my back every time I carry one.\"<br>\r\n<br>\r\n<br>\r\n\"It at least gets you off your lazy butt,\" said Spyro, \"You do far too little around here. Now, I'm going to take your console away.\"<br>\r\n<br>\r\n\"No, please,\" Spyrro pleaded, throwing himself at his brother's feet, \"Not my console! I got a late night gaming session. Please don't take it away!\"<br>\r\n<br>\r\n\"Then I suggest you get to work,\" said Spyro, \"And where the hell is Spy. I told him to short out the mail too.\"<br>\r\n<br>\r\nRelieved, Spyrro rose to his feet and said, \"O, him? Last time I saw him he arrived from work a few hours ago, took one look at the mail, yelled \"I can't take it anymore,\" and stormed off.\"<br>\r\n<br>\r\nSpyro's anger melted away and he grew very concerned when he heard this.<br>\r\n<br>\r\n\"Where is he?\"<br>\r\n<br>\r\nSpyrro shrugged his shoulder and said, \"Dunno exactly where he went. He just ran out the back door. That's the last time I saw him.\"<br>\r\n<br>\r\nSpyro nodded, already knowing a few places his youngest sibling could have gone.<br>\r\n<br>\r\n\"I'll be back soon,\" he said, \"and when I come back, I want this place to be devoid of any mail, got it?\"<br>\r\n<br>\r\nSpyrro nodded, doing a cheesy salute. \"Yes, sir!\"<br>\r\n<br>\r\nSpyro of rolled his eyes and left the house.<br>\r\n<br>\r\nWhere does he go to find his youngest brother?</span></div></div>",
            "created":1517374800,
            "id":2447433,
            "title":"Spyro, Spyrro and Spy."
        },
        "1122":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Yes!",
                "No, move along."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the characters from the Dan and Mab's Furry Adventure comic?</span></div></span></div>",
            "created":1558689660,
            "id":2663472,
            "title":"Dan and Mab's Furry Adventure"
        },
        "11221":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Allen (Alph Soulstealer)",
                "More characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose you character(s).</span></div></span></div>",
            "created":1558689720,
            "id":2663473,
            "title":"who will we expand?"
        },
        "112211":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "He goes to work",
                "He encounters someone he knows"
            ],
            "content":"<div class=\"\"><div> <span>Allen sat at the coffee house one cool autumn morning, sipping his latte while he scrolled through the comments on his laptop of his latest picture he took of himself.<br>\r\n<br>\r\nThe black stallion frowned. They weren't very positive.<br>\r\n<br>\r\n\"Better hit the gym,\" one warned, \"or you might get kicked off the show.\"<br>\r\n<br>\r\n\"Seems like someone is ready to give birth,\" one said mockingly.<br>\r\n<br>\r\n\"Hey big guy, can a give that ass smack?\" one pervert asked.<br>\r\n<br>\r\nThe picture that they were all ranting about was him standing in his bathroom, taking a selfie of himself in the mirror flexing his arm.<br>\r\n<br>\r\nAllen had always been a lean stallion with a bit of muscle on his arms and chest, something that drove the girls, and some guys, wild when he took a picture and posted it.<br>\r\n<br>\r\nBut these days Allen had been letting himself go, and that clearly showed on his figure. He was getting fat. One could clearly see in the picture that his belly was bulging against his shirt as big as a basket ball, and his hips and rump was getting rather thick.<br>\r\n<br>\r\nThey were right. He had to shed some pounds. He wasn't sure what the director would say on the show he starred in. There was the real risk that he could be let go, like he let go of himself.<br>\r\n<br>\r\n\"I'll hit the gym tomorrow,\" he said, closing his laptop and packing up his things.<br>\r\n<br>\r\nOutside the coffee house Allen started his shiny, black muscle car and drove to work. </span></div></div>",
            "created":1558689840,
            "id":2663474,
            "title":"Online backlash"
        },
        "1122111":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "In the dressing room...",
                "He bumps into Mandy, who plays Regina..."
            ],
            "content":"<div class=\"\"><div> <span>Allen walked into the square building where  Dan and Mab's Furry Adventure was filmed. He went and memorized his script for the last time before before rehearsals while he was munching on a cupcake at the food table.<br>\r\n<br>\r\n<br>\r\nBut he was suddenly startled when he felt someone pat his gut and say, \"Eating again, I see. Don't you have enough packing in there?\"<br>\r\n<br>\r\nAllen glared at Samantha, a zebra mare who had a flaming red tail and hair.<br>\r\n<br>\r\n\"Oh shut up,\" he said, \"It's not like you had not moved a size up.\"<br>\r\n<br>\r\nSamantha blushed and tucked at her pants, which hugged her wider hips, and adjusted her shirt, which was exposing more and more generous cleavage each day, almost transforming it into a muffin top.<br>\r\n<br>\r\nShe wanted to shoot back a clever retort, but then someone suddenly yelled, \"We are on in ten minutes! Get yourself ready, guys!\"<br>\r\n<br>\r\n\"Time to suit up,\" said Allen as he left.<br>\r\n<br>\r\nSamantha snorted.</span></div></div>",
            "created":1558689960,
            "id":2663475,
            "title":"Not the only one growing"
        },
        "11221111":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "While performing, the director pulls Samantha and Allen aside",
                "Someone pays him a visit"
            ],
            "content":"<div class=\"\"><div> <span>Allen had dreamt of playing some noble hero or plucky young sidekick in a movie, but he only managed to find a role as some kind of villain or anti-hero where ever he worked.<br>\r\n<br>\r\nThough, he wasn't complaining. He had learned fast that it takes a considerable amount of talent to play a villain. They managed to be more interesting than the heroes themselves!<br>\r\n<br>\r\nAnd it was there that the real career opportunities lied. People just loved villains, and producers, with dollar signs for eyes, flocked to these actors who played them well, offering them opportunities to be the main antagonist in their shows.<br>\r\n<br>\r\nAllen had gotten quite a few of these opportunities. He even had a few producers of a major motion blockbuster consider casting him.<br>\r\n<br>\r\nBut for now he was under contract here in the Dan and Mab's Furry Adventure show, which never seemed to end, already surpassing its tenth season.<br>\r\n<br>\r\nAs Allen got himself dressed in his costume, he took a moment to stare at himself in the mirror. Yikes, his belly was even bigger than it was in the picture he took, nearly hanging over his waist!<br>\r\n<br>\r\nHe just hoped that the director would not notice. He Alps hoped that his costume would not malfunction and tear either, which was already proving to be a challenge to fit into.</span></div></div>",
            "created":1558690260,
            "id":2663476,
            "title":"In the dressing room..."
        },
        "112211111":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Later, in the evening",
                "While Allen was driving home"
            ],
            "content":"<div class=\"\"><div> <span>Boris, a well-built wolf, who was the director, was sitting in his chair watching the scene play out. He did not like it, not because it was poorly acted. In fact everything was going smoothly.<br>\r\n<br>\r\nThe only problem he had was with Samantha and Allen. Their physical appearance bothered him to no end. They weight they had put on was making them look like a parody of the villains they were playing, their costumes hugging their bodies tightly.<br>\r\n<br>\r\n\"Cut, cut, cut!\" he yelled, ''Allen, Samantha, I need to talk to you guys really quick.\"<br>\r\n<br>\r\nHe took them aside and said, \"I'm going to give it to you straight. You two are getting too fat for your roles.\"<br>\r\n<br>\r\nAllen could feel his heart sink into his hooves. His worst case scenario was coming true. <br>\r\n<br>\r\nBut Samantha grinned and said, \"But I thought Character Haven liked woman with big boobs and wide hips.\"<br>\r\n<br>\r\n\"Yes, they do,\" said Boris, \"but the amount of skin you are showing these days will have to force us to push up the ratings of the show to more adult oriented. I highly doubt the producers will like that at all. They want to keep it PG13 to keep the younger viewers watching.\"<br>\r\n<br>\r\n\"I'm sorry, guys,\" he continued, \"But I fear that I have to replace you two if you don't lose weight. You still have time until the next season begins to shed some pounds. I'll see you two then.\"</span></div></div>",
            "created":1558690380,
            "id":2663477,
            "title":"The warning"
        },
        "11222":{
            "author_id":"theerror75",
            "author_name":"E.r.r.o.r.",
            "choices":[
                "Sure! Why the hell not~",
                "Nah, I'll Pass..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about something relating to Undertale and Deltarune?</span></div></span></div>",
            "created":1603127160,
            "id":2924777,
            "title":"An New Run..."
        },
        "113":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "\"American Dragon: Jake Long\"",
                "The Road Rovers",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Time for some character choices. It might be a modern setting but fantasy and sci-fi based characters can live here. It's just the location that's modern day.</span></div></span></div>",
            "created":1514696400,
            "id":2434699,
            "title":"Modern Age"
        },
        "1131":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Mark goes to the shop for a look at various magical artifacts. ",
                "Mark heads for home and orders up a big meal to celebrate time off.",
                "On the way home he's waylaid by something unusual."
            ],
            "content":"<div class=\"\"><div> <span>The sun was shining, the sky was blue, and in an office building in the middle of the business district a red and gold scaled dragon stared longingly out the window.<br>\r\n<br>\r\nMark heaved a long slow sigh, daydreaming of simply leaping out the window and going for a quick flight. But alas it was not to be. He glared at the stack of papers like they were a literal chain that bound him to his desk. The corporate world... somehow it existed in all realities. Rumor was even Heaven and Hell were more like businesses these days.<br>\r\n<br>\r\n\"Hey Mark. How's it hangin'?\" The red dragon blinked and looked up to spot a familiar blue and white furred wolf dressed in a light green button-down shirt and striped tie.<br>\r\n<br>\r\n\"Oh the usual, Trace,\" Mark replied, subconsciously adjusting his own light blue shirt and tie.<br>\r\n<br>\r\n\"That bad huh?\" the wolf gave a sympathetic smirk and sipped from a coffee cup with the words 'Be the Best' on the side.<br>\r\n<br>\r\n\"I just thought working here would be more interesting,\" Mark replied rubbing a clawed hand through his black hair, \"I mean this is the agency. Every new star goes through here. Shouldn't it be more, I don't know, creative?\"<br>\r\n<br>\r\nTrace just shook his head with a sigh, refraining from correcting Mark. Officially it was the Character Creation and Assessment Agency, but to most beings the place was simply known as 'The Agency'. \"Mark you were told when you were hired this place is as much a business as anywhere else. You saw some of it when you had your break.\"<br>\r\n<br>\r\n\"Yeah, but that was just the recruitment and contract signing stuff,\" the dragon sighed, jutting his tusk-like lower fangs out a bit further in a small pout, \"I didn't realize the rest of this place was so boring.\"<br>\r\n<br>\r\n\"Hate to break it to you but that's how it is everywhere. I hear even places like Heaven and Hell have a corporate structure.\"<br>\r\n<br>\r\n\"I wouldn't be surprised if Hell <i>invented</i> the corporate structure,\" Mark grumbled.\"<br>\r\n<br>\r\n\"Well maybe not the whole thing but i did hear they patented the idea of middle management and perhaps marketing departments.\"<br>\r\n<br>\r\nMark just groaned and rubbed his claws through his hair again, \"I gotta get out of here Trace, if just for a few days. Do you think the boss would let me?\"<br>\r\n<br>\r\n\"Well that's actually what i was coming to see you about,\" the wolf smiled, \"Apparently you're in the rotation for some time off. Apparently someone liked your efficiency and you can start your vacation as early as tomorrow. Three weeks at that too.\"<br>\r\n<br>\r\nMark let out a noise somewhere between a sigh of relief and a relaxed moan, \"Oh thank goodness. I'd ask if it comes with pay but... you know...\"<br>\r\n<br>\r\nTrace just nodded. In the realm of creativity money was not really a factor. Beings worked because they needed the skills and businesses needed the hands. Usually everyone tried different jobs until they found something they enjoyed and just stayed there. Some didn't even have jobs at all and just spent their days doing whatever they wanted.<br>\r\n<br>\r\n\"So what are you going to do with your time off?\"<br>\r\n<br>\r\nMark shrugged, \"Go flying, sleep in, grab some good meals, that sort of thing.\"<br>\r\n<br>\r\n\"That's it?\" Trace shook his head, \"You should bust out of the routine, try something different, go wild.\"<br>\r\n<br>\r\n\"And I suppose you have something in mind? The dragon raised an eyebrow expectantly.\"<br>\r\n<br>\r\n\"Actually I do,\" Trace smiled and reached into his pocket to pull out a folded pamphlet. Mark took it and unfolded the paper. \" 'Mystica's Magic Emporium'?\" he read aloud, \" 'Where your fantasies come true'?\"<br>\r\n<br>\r\n\"Trust me, this place is amazing. Just stop by after work and look around. I'm sure you'll find something to tickle your fancy.\"<br>\r\n<br>\r\nMark looked uncertain but tucked the papar away just in case.<br>\r\n<br>\r\nAt the end of the day...<br>\r\n</span></div></div>",
            "created":1514782800,
            "id":2435231,
            "title":"A Dragon's start."
        },
        "11311":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "He decides to experiment with the pills and mindfuck device.",
                "He decides to try out the strange fruit, perhaps the blueberries."
            ],
            "content":"<div class=\"\"><div> <span>When Mark was allowed to leave the confines of his work place and relieved of the mountains of paper work for a few days, he didn't even bother to use the main entrance of the building, instead flying out a open window. <br>\r\n<br>\r\n\"I'm free!\" he cried with joy, soaring over the tall buildings. <br>\r\n<br>\r\nHe had a hundred places he wanted to visit and wanted to make the most of it, his first destination being \"Mystica's Magical Emporium,\" like his co-worker had suggested. <br>\r\n<br>\r\nIt wasn't easy to find it, though, for, after looking from the sky, Mark couldn't find any trace of it. He asked around, but no one knew any sort of shop going by that name.  <br>\r\n<br>\r\nHeck, he couldn't even find any Google results when he looked it up!Mark began to think that he was the subject of some kind of prank, but then, as he ascended into the clouds again, he spotted something. <br>\r\n<br>\r\nIn the corner of his eye he spotted, hidden between two tall buildings, a sign, which flashed in bright colors the very store he was searching for. <br>\r\n<br>\r\nGlad that he finally found it, he descended and landed. In sharp contrast to the gloomy alleyway, where garbage drifted around in the sudden gusts of wind, Mystica's Magical Emporium was a well-lit, colorful building. <br>\r\n<br>\r\nMark walked up to the door and entered...only to duck when a flying toy train nearly crashed into him!He barely had time to recover when he had to jump out of the way when a spoon with legs came running past, chased by arolling plate.<br>\r\n<br>\r\nMark studied his surroundings with awe, the scene before him was something straight out of a whimsical story book.<br>\r\n<br>\r\nTen spite the building's small outward appearance, the inside was absolutely gigantic! The area it covered was about the size of a large warehouse, the ceiling stretching four storeys high. <br>\r\n<br>\r\nMark slowly walked between the rows of shelves, his maw wide open. Many of the products were strange yet amusing to look at, others having a consciences of their own and engaging in various activities.<br>\r\n<br>\r\nAfter exploring a bit, discovering that not only did this peculiar shop sold toys but food as well, he came across the store's checkout desk. <br>\r\n<br>\r\nNo one was there, and Mark, slightly confused, decided to investigate. He heard someone snoring, and looking over the counter he saw a strange creature. <br>\r\n<br>\r\nHe had long, pointy ears like a fox, but his along, thin snout resembled that of a rodent's. He wore a silk vest, shirt and breaches, but his belt buckle was undone, the zipper pulled down, allowing his bulging, furry belly some room. <br>\r\n<br>\r\nLeaning back in his chair, his bare feet on the desk, drool dripping from his mouth, he was fast asleep, mumbling incomprehensible thing sin his sleep. <br>\r\n<br>\r\nFrom the empty plates and pie tins Mark could only guess that he binged himself out at the food section of the store. <br>\r\n<br>\r\nClearing his throat, the red dragon said, \"Umm, hello?\" <br>\r\n<br>\r\nThe critter's ears twitched, but he did not wake up. <br>\r\n<br>\r\n\"Hello!\" Mark tried again, this time louder.<br>\r\n<br>\r\nThe rodent-like creature snorted, his eyes fluttering open. \"Huh?\" he said, confused, rubbing his eye and sitting up, looking around. <br>\r\n<br>\r\nHe spotted Mark, who was waving at him, and said while yawning, \"Whoopee, a costumer. What can I help ya?\" <br>\r\n<br>\r\n\"Are you the owner of this place?\" asked Mark. <br>\r\n<br>\r\n\"Nope,\" said he,\"The owner left me in charge, though I wish I was; lots of useful stuff in here, especially in the back. Now, coming back to my previous question, can I help you?\" <br>\r\n<br>\r\n\"Well...\" Mark began, rubbing his neck and surveying the massive store. <br>\r\n<br>\r\n\"Can't decide where to start, hey?\" asked the temporary shop owner as he sucked in his gut in order to buckled up his pants, \"Should I show you around. It's easy to get lost in here. Heck, I even got confused ones, and that's after spending more than a month here!\" <br>\r\n<br>\r\n\"That would be nice, yeah,\" said Mark. <br>\r\n<br>\r\n\"Alright then,\" he said, pulling on a pair of boots, jumping off the chair, and walked out from behind the counter. \"Follow me!\"<br>\r\n<br>\r\nHe gestured for the red dragon to follow, and Mark saw that he was small, only reaching the height of his pelvis, roughly three feet high, and had a bushy tail. <br>\r\n<br>\r\nAs they walked between the shelves, the red dragon said, \"I hope you don't mind me asking but what's your name? More importantly, what exactly are you?\" <br>\r\n<br>\r\nMark was indeed very curious about this creature, for he had never seen anything like him, even in a world were strange creatures live and thrive together. <br>\r\n<br>\r\n\"You can call me Andriux, or Andy, for short,\" he said,\"And I'm a Lunex. And yes, I'm not from around here.\"<br>\r\n<br>\r\nAndy showed Mark around the facility, and the red dragon was amazed what there was on offer. The store had everything you could imagine, even things Mark didn't know even existed!<br>\r\n<br>\r\n\"Check this thing out,\" said Andy, showing him a plastic helmet with various buttons on it, \"If you want to be literally mindfucked, use this! Even I used it a few times. Best round of sex I ever had in my life! Though, word of caution: remember to set the timer to stop or you'll be stuck in a perpetual wet dream.\"<br>\r\n<br>\r\n\"And if you combine it with this,\" he continued, showing Mark a bottle of pills, \"You'll never need the real thing ever again.\"<br>\r\n<br>\r\n\"What does it do exactly?\" asked Mark, pointing at the bottle.<br>\r\n<br>\r\nAndy patted his crotch. \"Makes dem gonads huge,\" he said with a grin, \"Still got some cum leftover from last time.\"<br>\r\n<br>\r\nThey came across a section where strange fruit were being sold, and And said, \"Read the warning labels. Every one of these have a certain effect on your body.\"<br>\r\n<br>\r\nTo demonstrate, he picked up an apple and took a bite out of it, and before Mark's eyes the Lunex grew nearly a foot taller, his clothes straining greatly around his figure.<br>\r\n<br>\r\nBut then he took a bite out of a peach and he shrank back to his original size.<br>\r\n<br>\r\n\"Interesting,\" said Mark, \"but what about those?\"<br>\r\n<br>\r\nHe pointed to a box filled with blueberries, and Andy gave a shudder and said, \"Best not eat those. The effects are quite...swelling. But at least it's backed up with magic so you won't die a horrible death.\"<br>\r\n<br>\r\nThe Lunex showed a few more oddities before his bulging gut growled loudly.<br>\r\n<br>\r\n\"Welp, that's the signal for my coffee break. Dame I'm hungry!\" said Andy, patting his belly, \"I think I showed you enough to figure out this place. I'll be at the food section if you need me...that's if I'm in any condition to help you and not a immobile blob. Be seeing ya!\"<br>\r\n<br>\r\nHe departed, leaving Mark behind to decide where to go next. Where did he go?</span></div></div>",
            "created":1521176400,
            "id":2465219,
            "title":"Mystica's Magical Emporium."
        },
        "1133":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Carmelita",
                "Sly Cooper",
                "Another character, possibly from another series?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sly or Carmelita from the games Sly Cooper?</span></div></span></div>",
            "created":1514782800,
            "id":2435558,
            "title":"Sly Cooper series maybe?"
        },
        "11331":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Weight loss drug",
                "Experimental program",
                "Protean shake"
            ],
            "content":"<div class=\"\"><div> <span>Valery sighed as she shifted in her striped lounge chair. To anyone else it would have not been the best day to lay outside. Mostly cloudy with a slight chance of rain, But Val was not 'anyone'. That wasn't to say she was a snob, she just liked things a little different from others. She say outside in less than picturesque days. She poured honey on her scrambled eggs. And she was not overly obsessed with her figure like many females.<br>\r\n<br>\r\nLifting her sunglasses a little she glanced down at herself and the two piece red bikini she wore over her red and cream colored fur. She was by most accounts 'fit and shapely', but to those with critical eyes they could see the added muffin top she'd developed in recent years.It wasn't much. Her once concave middle during her stardom era had softened to something more flat, which in turn rounded out slightly in to a <i>modest</i> belly. <br>\r\n<br>\r\nVal brushed her blue hair from her pointed ears and sighed. She was hardly addicted to stardom like some individuals, but she couldn't deny it had been interesting. Three games with rapidly evolving graphics and then quiet for years before getting called back in for a fourth. Would a fifth ever come? She just couldn't say. <br>\r\n<br>\r\nThey had been fun years though, she recalled with a smile. Sid, who played the star of the game Sly Cooper, had been a nice guy to work with. Not quite as charismatic as his on-screen persona, but friendly. They tended to stay in touch but definitely didn't have the same spark as their game personas. Not that that was a bad thing really. Val had never told him but she was a bit more interested in 'alternative lifestyles'.  Not strictly one side or the other but open to experimenting with both.<br>\r\n<br>\r\nAfter the third game had ended her pay had been enough to buy a new home in up-town. A penthouse suite to be exact, complete with it's own pool. Val had sunk most of the rest into opening her own baked goods store. It was modest but turned a decent profit. The only problem had been her weight.<br>\r\n<br>\r\nGetting the place running she had to try every item in the store to make sure they were good enough to sell and in doing so what had followed was a sudden ballooning of her weight. In less than a year she'd gone from a trim, 140 pound vixen to a chubby 320 pound gal. It had been a bit problematic but she was content with her own self image for the next few years. What was really bad was when they told her a fourth game was being made.<br>\r\n<br>\r\nWhat followed was an agonizing eight months of dieting, cutting down on sweets, and seemingly endless exercise. It had been grueling but she did it. The pay from the new game had allowed her to expand her bakery into a sweets shop selling candies and while she had dialed it back on tasting everything, the pounds were beginning to show once more.<br>\r\n<br>\r\nVal pinched the roll of flab on her middle and heaved a sigh. It looked like it was time for another diet and exercise...<br>\r\n<br>\r\nChoice 1: Val receives an ad in her mail that offers a new (experimental) weight loss drug and decides to order it, with surprising side effects.<br>\r\n<br>\r\nChoice 2: Val turns on the TV and sees a local lab offering paid volunteers the chance to sign up for several programs, one of which is an experimental weight loss regime.<br>\r\n<br>\r\nChoice 3: Val goes to the gym and manages to exercise but tries a new high energy protean shake and gets addicted. It being good for building muscle... provided one exercises every day.</span></div></div>",
            "created":1515646800,
            "id":2439349,
            "title":"Carmelita / Valery"
        },
        "11333":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Judy Hopps",
                "Nick Wild",
                "A couple more choices before moving on."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about characters from Zootopia like Nick or Judy?</span></div></span></div>",
            "created":1515128400,
            "id":2437176,
            "title":"Zootopia possibly?"
        },
        "113331":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Getting fatter",
                "Blueberry Inflation",
                "Gas inflation",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>It was nighttime in the city, the diurnal residents had long since said their good-nights while the nocturnal's and the party animals were still going strong.<br>\r\n<br>\r\nHigh above the streets in a large penthouse apartment, a figure slept very fitfully. Her grey fur was slick with sweat (among other things) as she tossed and turned in her bed. The female moaned in her sleep, one hand reaching down into her moist panties as she involuntarily bucked her hips.<br>\r\n<br>\r\n\"Oh... oh please...\" the rabbit moaned, \"No... can't... too much...\" And her body gave another shudder as her dreams wracked her with unwanted pleasure.<br>\r\n<br>\r\nWhat was she dreaming about?</span></div></div>",
            "created":1520226000,
            "id":2460993,
            "title":"Judy Hopps / Jennifer "
        },
        "1133312":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Dream 'Nick' eats her out and pops her, waking her up.",
                "A stranger offers her a deal.",
                "Exploding in the dream and desiring to become a blueberry for real.",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>The rabbit gave another moan as her dreams assaulted her sleeping mind...<br>\r\n<br>\r\n==========<br>\r\n<br>\r\nJenny moaned and hiccuped faintly, her mouth could barely open. Her cheeks were round and full and had begun to meld with the horizon of her body just as her chin had done a minute ago. In the distance she could see row after row of blueberry bushes all heavy with gigantically sweet berries. And yet they were all dwarfed by one.<br>\r\n<br>\r\nJenny herself.<br>\r\n<br>\r\nThe rabbit hiccuped again and felt her smooth skin tighten further, the blue-purple surface of her body rolled out in front of her like the curvature of the planet. Faint hills were all she could make out where her breasts had been. <br>\r\n<br>\r\nDespite her vision being so limited, jenny could somehow see herself as if from outside her body. An enormous blue-purple sphere easily fifteen feet wide. Her limbs had all been absorbed into divots around her form. Her only other visible feature besides her face was her feminine sex which gushed juice, though not nearly fast enough. Her body gave another heave and swelled a further few inches bigger  as Jenny's vision became even more constricted while juice poured from her sex like a waterfall. Every second she was sure the next heave would be the last. Her body would get too big, her stretched skin would rip, and she'd explode her juice filled insides all over the field.<br>\r\n<br>\r\nAnother gurgling slosh followed by an extended *creeeeek* rang in her bloated balloons of ears. Her cheeks had merged with her torso now and the back of her head was nearly consumed. She was soon a face and ears peering out of her spherical body. <br>\r\n<br>\r\nIt was then she saw something...<br>\r\n<br>\r\n<br>\r\nChoice 1: A dream variant of her co-star 'Nick' showed up and eats her out, popping her and waking her in the process.<br>\r\n<br>\r\nChoice 2: A strange being appears and says he will grant this desire of Jenny's wish in return for a favor.<br>\r\n<br>\r\nChoice 3: Jenny finally explodes with a rush of pleasurable relief and wakes up, determined to somehow make her dream a reality.<br>\r\n<br>\r\nChoice 4: Something else happens?</span></div></div>",
            "created":1520226000,
            "id":2461005,
            "title":"Blueberry Inflation"
        },
        "1133314":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Pussy or cock growth.",
                "Another option."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In her dreams her vagina was swelling bigger or she grew a cock.</span></div></span></div>",
            "created":1520398800,
            "id":2461606,
            "title":"Private expansion."
        },
        "11333141":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Vagina expansion.",
                "Cock growth."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one was it?</span></div></span></div>",
            "created":1520398800,
            "id":2461607,
            "title":"Pussy or cock growth."
        },
        "113333":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Gazelle",
                "Chief Bogo",
                "Alright, some other show or series."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a couple more choices before moving on?</span></div></span></div>",
            "created":1516165200,
            "id":2442069,
            "title":"More Zootopia characters"
        },
        "1133331":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Magical gift",
                "New modeling job",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>'Now playing, for one week only, Gina Johnson.'<br>\r\n<br>\r\nThat phrase had been burned into Gina's eyes for the last four years. and was second only to the phrase 'sing Try Everything' as her must hated, but only because that one had been around for less time.<br>\r\n<br>\r\nThe only time she had to herself was at that moment, the short time between arriving for a performance, getting ready, and going out on stage. After that would be the show itself, autographs, listening to her manager blab on all the way home and then a light meal before shower and bed.<br>\r\n<br>\r\nThe life of a singer, everyone thought it was glamorous and concerts and rubbing elbows with other famous individuals. The gazelle suppressed a bitter laugh as she checked her hair in the vanity mirror. If only they knew how hard it was.<br>\r\n<br>\r\nAnd it wasn't just coming up with new songs, staying on top of the latest fashions, or dealing with the occasional obsessed fan (that somewhat portly cheetah she'd worked with had been quite sweet even if he hyperventilated every time she walked in the room).<br>\r\n<br>\r\nNo, the thing Gina hated most about her carer was how stifling it was on just what she could do for herself. Anywhere she went it was either being mobbed by fans or stalked by paparazzi. She couldn't even go down to the local fast food chains and order a meal without some secret reporter snapping a pic and slapping it on some phony news story.<br>\r\n<br>\r\nAnd that really was the worst. Gina would never say it (lest some nosy reporter overhear) but she desperately missed junk food. Back when she'd just been starting out she starved herself for a year to meet the model standards. And what did the talent agent say to her?<br>\r\n<br>\r\n\"Sorry babe but frankly... you're too thin. We're looking for someone with a little more curvy shape in the lower regions, if you catch my drift.\"<br>\r\n<br>\r\nGina had glared daggers at the hyena after that but said she'd be back. After consulting a fitness professional she'd gone to town. Eating the delicious junk food and carefully exercising just right so the weight filled out her lower half by an additional couple inches.<br>\r\n<br>\r\nNow... now she couldn't eat so much as a candy bar without spending an hour swimming, on the treadmill or lifting weights to burn off those calories. And she hated it. It was her body and her life. The only thing stopping her was it would be the end of her job. Frankly she was desperate. The had to be a way to get what she wanted...<br>\r\n<br>\r\n<br>\r\nChoice 1: After the concert she's given a gift of an item that might change her weight at will or changes everyone's outlook so she always looks perfect no matter what size, or perhaps something else.<br>\r\n<br>\r\nChoice 2: Gina gets a call about a new job offer to model. Only it turns out it's for plus size clothing.<br>\r\n<br>\r\nChoice 3: Something else entirely?</span></div></div>",
            "created":1516165200,
            "id":2442206,
            "title":"Gazelle/Gina"
        },
        "1133332":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "The door on the left.",
                "The door on the right."
            ],
            "content":"<div class=\"\"><div> <span>It was a quiet and cloudless night, the stars twinkling in the dark sky and most of the residence of Character Heaven fast asleep. Though the time was approaching midnight, the security station at the chemical facility was still manned.<br>\r\n<br>\r\nThe office was as quiet as the night, the only noise being the whir of the fan, and sitting behind his desk, playing games on his phone, was a buffalo.<br>\r\n<br>\r\nHe looked unmistakably like Chief Bogo from Zootopia, and you would be half-right to think so; he did play the character in the film, but he was actually a completely different person offscreen.<br>\r\n<br>\r\nUnlike Chief Bogo, this buffalo was lazy, nervous, slow to react, and went by the simple name of Bob. He wasn't as fit as his counterpart in the film either, and, as he leaned back in his chair to stretch, his bulging beer gut strained the button's on his uniform.<br>\r\n<br>\r\nBut as Bob went back to playing his video games, he was blissfully unaware that an event was about to happen that would change his, and perhaps Character Heaven as a whole, life.<br>\r\n<br>\r\nThere was a loud crash from somewhere in the building, and Bob was alerted by the noise. He stood up, hitching up his too small jeans, grabbed a flashlight, and went to investigate the disturbance.<br>\r\n<br>\r\nAfter a while, he made it to the area were he thought the noise originated from. He was standing at the end of a hallway, two doors on his side. The one on his left led to a massive room fill of dams filled with unknown chemicals, and the door on his right to a small laboratory.<br>\r\n<br>\r\nHe chose...</span></div></div>",
            "created":1516597200,
            "id":2443687,
            "title":"Bob the buffalo."
        },
        "1133333":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "This idea.",
                "Move along."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>An anthro Cynder from the Legend of Spyro?</span></div></span></div>",
            "created":1531387620,
            "id":2518856,
            "title":"Alright, some other show or series."
        },
        "11333331":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "While riding to work on a bus...",
                "It's a nice day for a walk.",
                "Who walks or rides when they can fly?",
                "Something else happens."
            ],
            "content":"<div class=\"\"><div> <span>After silencing the alarm clock, which began to ring when it's timer struck 7 a.m., there was a shuffling of blankets as one lump in the bed rolled over, drifting back to sleep, while the second moaned and threw away the covers.<br>\r\n<br>\r\nCindy sat up, stark naked, rubbing her eyes and yawning. She was a black dragoness with a crimson underbelly, who's voluptuous figure stood six feet tall, sporting a pair of breasts as big as a man's head, each dotted with areolas the size of dinner plates.<br>\r\n<br>\r\nAt first glance, she looked like Cynder from the Legend of Spyro trilogy, but this one had quite a few major differences. First, she was anthropomorphic. Second, she was at least twice the age of her counterpart.<br>\r\n<br>\r\nThough, she did play as one of the key characters in Legend of Spyro: Dawn of the Boobs, a porno spoof of the Spyro trilogy, which gained her quite a lot if fame thanks to her extreme sex appeal.<br>\r\n<br>\r\nThough, ironically enough, despite her success in the parody film, she hadn't received many job offers afterwards. Of late, Cindy had been working in whatever film company requested her, even doing photo shoots in order to make ends meet.<br>\r\n<br>\r\nBut that was going to change soon, because she got a callback from the job interview she had a week ago, asking her to play a role as a secondary character in a show that had grown quite popular of late, and she immediately excepted.<br>\r\n<br>\r\nAnd today was the day for her to make her appearance. She rose from bed and took a shower, washing away the \"fun\" she had with her partner last night. She dressed herself in a pair of tight jeans, which showed off her ample hips and rear nicely, and a muffin top that showed a generous amount of cleavage.<br>\r\n<br>\r\nWhile she poured hot water into two cups of coffee, she smiled when she heard a soft, girlish voice calling from her room. \"Cindy, are you up?\"<br>\r\n<br>\r\n\"Yup, I'm up,\" said she, entering her room again, handing Emily her cup of coffer.<br>\r\n<br>\r\nLike Cindy, Emily was also a much older counterpart of a small pink dragoness named Ember. She was also just as attractive as the black dragoness, sporting breasts almost bigger than hers, but she was shorter by five inches, her body structure more sturdy.<br>\r\n<br>\r\n\"Thanks,\" said Emily after she received her cup full of coffee, \"Oh, do you really need to go? We had so much fun last night. I was hoping we can do a round two this morning.\"<br>\r\n<br>\r\n\"You know I need this,\" said Cindy, cupping Emily's cheeks affectionately, \"But when I return, I promise you we will have all the fun we can muster. Perhaps I'll bring someone along to join in the fun.\"<br>\r\n<br>\r\nEmily grinned. \"You do that.\"<br>\r\n<br>\r\n\"Well, goodbye, \" said Cindy, grabbing her handbag and heading out the door, \"See you tonight.\"<br>\r\n<br>\r\n\"See ya!\" Emily called back cheerfully.</span></div></div>",
            "created":1531387680,
            "id":2518857,
            "title":"First day on the job."
        },
        "113333311":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "It was the cast of The Pirate's Fate.",
                "It was the cast of 'Friendship is Magic' (it's a dragon lands episode)",
                "It's another 'show'.",
                "It was the cast of another show."
            ],
            "content":"<div class=\"\"><div> <span>Sitting between a rather bored looking xeromorph and a vixen that looked like Carmelita from Sly Cooper, Cindy was using the bus to get herself to work.<br>\r\n<br>\r\nFrom her handbag next to her she pulled out her cellphone, switched it on, and saw that she had a message. It was from one of her lovers, who was named Sam.<br>\r\n<br>\r\nHis profile pic was of a selfie he took while he was on the beach, the anthro purple dragon flexing his muscular body, the bulge of his privates visible against the red speedo he wore.<br>\r\n<br>\r\nSam: Hey, babe! :) Glad you are awake.<br>\r\n<br>\r\nCindy: Good to see ya too, sweetie. <br>\r\n<br>\r\nSam: You+me+the old studs=fun. :P<br>\r\n<br>\r\nCindy smiled, knowing exactly what Sam was talking about. He wanted another gang bang with the \"old studs\", who were the characters that played the Guardians in the Legend of Spyro spoof. Like Sam, they were just as muscular and sexy despite their apparent age. <br>\r\n<br>\r\nCindy: Sure. Care if Ember joins?? Perhaps we can get together after I'm finished at work.<br>\r\n<br>\r\nSam: That's sounds OK to me!!<br>\r\n<br>\r\nThey chatted a little longer before Cindy's stop arrived and she climbed off, heading inside the building where the show was being filmed. After showing her identifications to the security, she was shown to a room where the rest of the cast waited for rehearsals.<br>\r\n<br>\r\nBut to what show did this cast belong to?</span></div></div>",
            "created":1531392180,
            "id":2518870,
            "title":"While riding to work on a bus."
        },
        "1133333111":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Getting to know the green lizard.",
                "Getting to know the fat bat."
            ],
            "content":"<div class=\"\"><div> <span>It was the main cast to a show called The Pirate's Fate. There were five of them in the room. The first member was a pitbull with red air tied in a small ponytail, who was dressed in a dark suit, sitting on a foldout chair and reading a newspaper while sipping on a cup of coffee.<br>\r\n<br>\r\nSitting right next to him was a cat, though Cindy didn't know what specie she was. She was dressed in a baggy top and jeans that had several tears in it, and wore square glasses, her attention completely focused on a Nintendo console, which was making high-pitched chirping noises from the game she played. She must be a hipster, Cindy concluded.<br>\r\n<br>\r\nStanding in the back, checking her appearance in the mirror, was voluptuous female reptile. She wore a white dress, which was cut in a v-shape at the collar, exposing her ample amount of cleavage. Around her neck was a fluffy red scarf, which she seemed to enjoy stroking. She would make a nice pornstar, Cindy mused, rubbing her chin.<br>\r\n<br>\r\nIn the right corner was a short corgi, dressed in a leather jacket and skinny jeans, wearing dark glasses. He was in an argument on his cellphone, but he kept his voice hushed, because he most likely didn't want to make a scene.<br>\r\n<br>\r\nThe but most certainly not least was a female bat, who was busy making herself a sandwhich at the snack table, and her appearance grabbed Cindy's attention immediately. Dressed in an extra large green sweater and blue pants, one would call her fat, but the black dragoness knew better.<br>\r\n<br>\r\nShe was thicc. Her breasts, which pressed against her top, were as big as pomelos, looking, for a lack of better words, juicy. She had childbearing hips, her ass large and firm.<br>\r\n<br>\r\nNothing sagged on her, and Cindy thought that she was the perfect candidate to be a plus-sized model, the growing heat in her vagina also agreeing with her as well.<br>\r\n<br>\r\nIt was just that she seemed so...shy. When she turned around and noticed that Cindy was staring at her, she looked startled, blushed, and turned away.<br>\r\n<br>\r\nIt was then that the door of the room opened and a fox with a pointy beard entered the room. In his hand, Cindy saw, he held several papers, which must be the scripts. He must be the director, she thought.<br>\r\n<br>\r\n\"Okay people, listen up,\" he said, sounding a little frustrated as he handed out the papers, \"There's been a slight change in the scene, so you guys have to memorize this new script again.''<br>\r\n<br>\r\nThe whole cast groaned, and Cindy got the idea that something like this happened often. \"Yeah, yeah, I don't want to hear it,\" he said, \"I'm just as fed-up as you guys. Dam producers keep changing everything!\"<br>\r\n<br>\r\nIt was then that he noticed Cindy stainding awkwardly in one corner. \"Let me guess, you're that new secondary character we ordered, right?\" he asked.<br>\r\n<br>\r\nCindy flashed him a smile, saying, \"Yup. Just arrived a few moments ago,\" she answered.<br>\r\n<br>\r\nThe fox looked at her wearily, and Cindy wondered when was the last time he got a full night's rest. \"Alright,\" he said, handing the dragoness her script, \"here's your role. Rehearsals begin in one hour.\"<br>\r\n<br>\r\nWith that said, he turned and left. Cindy looked at the script, but what was the scene and her role about?<br>\r\n<br>\r\nChoice 1: Cindy was going to play the role as an unlikely savior, who rescues the character Tam Tam from being beheaded by the queens executioners.<br>\r\n<br>\r\nWhile she memorized the script, she decided to get to know the green, voluptuous reptile that was going to play the role as Tam Tam better. <br>\r\n<br>\r\nChoice 2: Cindy was going to play the role as a thief who tricks and steals away the magical coin the character Morgana owns. But when she has it in her possession, she will transform in weird ways.<br>\r\n<br>\r\nWhile she memorized the script, she decided to get to know the shy, fat bat who was going to play Morgana.</span></div></div>",
            "created":1531908480,
            "id":2521446,
            "title":"It was the cast of The Pirate's Fate."
        },
        "11333332":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Yes",
                "Open Choice Chapter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps an anthropomorphic version of the Paw Patrol would be something that you would all like to see?</span></div></span></div>",
            "created":1531953780,
            "id":2521715,
            "title":"Move along."
        },
        "12":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Science Fiction",
                "Fantasy",
                "Modern Age",
                "Something Else?",
                "Something Else?"
            ],
            "content":"<div class=\"\"><div> <span>\"Imagination is more important than knowledge. For knowledge is limited, whereas imagination embraces the entire world, stimulating progress, giving birth to evolution.\" <br>\r\n- Albert Einstein <br>\r\n<br>\r\nFar off in the either, beyond anything known to the living world, lay the realm of potential. A ethereal place where all forms of creativity that have existed or would someday exist call home. <br>\r\n<br>\r\nAnd one realm of the limitless expanse lay dedicated to characters. Character of all kinds. Film, television, video game, books. All coexisted in a landscape as varied as the colors of the rainbow. <br>\r\n<br>\r\nMany who called the place home were stars in the making, Characters who's time had not yet come. Waiting to be drawn into existence (perhaps with some minor tweaks or adjustments) to fill a spot as an actor might play a part. Those of the longest running franchises were the biggest stars having the most fame and renown across all the creative landscape. <br>\r\n<br>\r\nHowever others had their time in the spotlight and faded back into average lives in this world of creativity.<br>\r\n<br>\r\nAlthough limitless really if the reality could be divided there were many 'continents' pertaining to characters various categories of science fiction, fantasy, modern age, and so on. The architecture or layout of each reflecting the category of the inhabitants.<br>\r\n<br>\r\nSo where to begin...</span></div></div>",
            "created":1514696400,
            "id":2434679,
            "title":"A New World (Macro/Micro)"
        },
        "13":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Science Fiction",
                "Fantasy",
                "Modern Age",
                "Something Else?",
                "Something Else?"
            ],
            "content":"<div class=\"\"><div> <span>\"Imagination is more important than knowledge. For knowledge is limited, whereas imagination embraces the entire world, stimulating progress, giving birth to evolution.\" <br>\r\n- Albert Einstein <br>\r\n<br>\r\nFar off in the either, beyond anything known to the living world, lay the realm of potential. A ethereal place where all forms of creativity that have existed or would someday exist call home. <br>\r\n<br>\r\nAnd one realm of the limitless expanse lay dedicated to characters. Character of all kinds. Film, television, video game, books. All coexisted in a landscape as varied as the colors of the rainbow. <br>\r\n<br>\r\nMany who called the place home were stars in the making, Characters who's time had not yet come. Waiting to be drawn into existence (perhaps with some minor tweaks or adjustments) to fill a spot as an actor might play a part. Those of the longest running franchises were the biggest stars having the most fame and renown across all the creative landscape. <br>\r\n<br>\r\nHowever others had their time in the spotlight and faded back into average lives in this world of creativity.<br>\r\n<br>\r\nAlthough limitless really if the reality could be divided there were many 'continents' pertaining to characters various categories of science fiction, fantasy, modern age, and so on. The architecture or layout of each reflecting the category of the inhabitants.<br>\r\n<br>\r\nSo where to begin...</span></div></div>",
            "created":1514696400,
            "id":2434680,
            "title":"A New World (Transformation/Transgender)"
        },
        "14":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Science Fiction",
                "Fantasy",
                "Modern Age",
                "Something Else?",
                "Something Else?"
            ],
            "content":"<div class=\"\"><div> <span>\"Imagination is more important than knowledge. For knowledge is limited, whereas imagination embraces the entire world, stimulating progress, giving birth to evolution.\" <br>\r\n- Albert Einstein <br>\r\n<br>\r\nFar off in the either, beyond anything known to the living world, lay the realm of potential. A ethereal place where all forms of creativity that have existed or would someday exist call home. <br>\r\n<br>\r\nAnd one realm of the limitless expanse lay dedicated to characters. Character of all kinds. Film, television, video game, books. All coexisted in a landscape as varied as the colors of the rainbow. <br>\r\n<br>\r\nMany who called the place home were stars in the making, Characters who's time had not yet come. Waiting to be drawn into existence (perhaps with some minor tweaks or adjustments) to fill a spot as an actor might play a part. Those of the longest running franchises were the biggest stars having the most fame and renown across all the creative landscape. <br>\r\n<br>\r\nHowever others had their time in the spotlight and faded back into average lives in this world of creativity.<br>\r\n<br>\r\nAlthough limitless really if the reality could be divided there were many 'continents' pertaining to characters various categories of science fiction, fantasy, modern age, and so on. The architecture or layout of each reflecting the category of the inhabitants.<br>\r\n<br>\r\nSo where to begin...</span></div></div>",
            "created":1514696400,
            "id":2434682,
            "title":"A New World (Hyper expansion)"
        },
        "142":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "Yes!",
                "No?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about something related to the Spyro universe?</span></div></span></div>",
            "created":1517288400,
            "id":2446687,
            "title":"Fantasy"
        },
        "143":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Sabrina online.",
                "World of fizz",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Modern age choices</span></div></span></div>",
            "created":1589240400,
            "id":2834065,
            "title":"Modern Age"
        },
        "1433":{
            "author_id":"derpstar",
            "author_name":"SimpleSequences",
            "choices":[
                "Enter the pokemon world",
                "I always preferred Digimon myself",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Why not choose the wonderful world of pokemon as your world of choice? Although this one is a bit different from the world most would be used to. More a society where pokemon have become dominant in, one where trainers never came to control them, or at the very least, long, long after they existed to do so. <br>\r\n<br>\r\nThis afforded them to make their own advanced society, though still complete with arenas with which they can compete in if they so choose. There are even outright team competitions beyond that, gyms dedicated to the purpose of it. With... some interesting caveats in there being more ways than one in getting a more battle ready body. <br>\r\n<br>\r\nYes indeed, as well as being more fit, having a more voluptuous body has it's advantages as well, with pokemon that are granted with extremely voluptuous ones always somehow ending up on the top tiers, even if they clearly lack any musculature to speak of. <br>\r\n<br>\r\nOf course this does mean there are many ways to train. Specialized gyms for different areas of the body, battle styles to train those areas of your body more naturally, it's all the rage in this Pokemon world, where bigger truly does mean better in just about every way.<br>\r\n<br>\r\nThis has, however, had some unfortunate effects on the world as well. Good genes have become prize commodities, and families of more endowed pokemon are considered by and large to be the uppermost caste. <br>\r\n<br>\r\nWith all of this in mind, do you choose to explore this pokemon world? Or somewhere else?</span></div></div>",
            "created":1603789740,
            "id":2929729,
            "title":"More choices"
        },
        "15":{
            "author_id":"drakin",
            "author_name":"Drakin",
            "choices":[
                "Science Fiction",
                "Fantasy",
                "Modern Age",
                "Something Else?",
                "Something Else?"
            ],
            "content":"<div class=\"\"><div> <span>\"Imagination is more important than knowledge. For knowledge is limited, whereas imagination embraces the entire world, stimulating progress, giving birth to evolution.\" <br>\r\n- Albert Einstein <br>\r\n<br>\r\nFar off in the either, beyond anything known to the living world, lay the realm of potential. A ethereal place where all forms of creativity that have existed or would someday exist call home. <br>\r\n<br>\r\nAnd one realm of the limitless expanse lay dedicated to characters. Character of all kinds. Film, television, video game, books. All coexisted in a landscape as varied as the colors of the rainbow. <br>\r\n<br>\r\nMany who called the place home were stars in the making, Characters who's time had not yet come. Waiting to be drawn into existence (perhaps with some minor tweaks or adjustments) to fill a spot as an actor might play a part. Those of the longest running franchises were the biggest stars having the most fame and renown across all the creative landscape. <br>\r\n<br>\r\nHowever others had their time in the spotlight and faded back into average lives in this world of creativity.<br>\r\n<br>\r\nAlthough limitless really if the reality could be divided there were many 'continents' pertaining to characters various categories of science fiction, fantasy, modern age, and so on. The architecture or layout of each reflecting the category of the inhabitants.<br>\r\n<br>\r\nSo where to begin...</span></div></div>",
            "created":1514696400,
            "id":2434684,
            "title":"Something weirder?"
        },
        "155":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "The next day.",
                "During the night...",
                "Something else happens."
            ],
            "content":"<div class=\"\"><div> <span>The shabby 1970's Mustang came to a jerking halt right next to the road, the hood bellowing smoke. Fury got out of the car and opened it, shielding his face when he was assaulted by a blast of scolding heat, and when the smoke had cleared, he took a look at the engine.<br>\r\n<br>\r\n\"Yup, it's a goner,\" the human-dragon hybrid said to himself, looking at the blackened and burned block of steel that was supposed to be an engine.<br>\r\n<br>\r\nHe sighed, closing the hood and patting it. \"You served me well, my noble steed,\" Fury said.<br>\r\n<br>\r\nIndeed it had served him very well. The old tin can had taken him hundreds of miles, across states, borders and countries. It had finally drove its last mile when it hit the desert, the scourging heat enough to fry an egg.<br>\r\n<br>\r\nIt was approaching dusk, though, the temperatures falling, which meant Fury didn't have to worry about dehydration. But he still had a long way to go before he reached his destination.<br>\r\n<br>\r\n\"Well, leit's get walking,\" he told himself, grabbing his backpack from the back of the car.<br>\r\n<br>\r\nMaybe I should fly, he thought to himself. He had a pair of sturdy wings to do just that. But I need to conserve my energy, he thought, deciding against it, flying is exhausting.<br>\r\n<br>\r\nBut he was in luck. As he reached the top of a hill the road ran over, he could see the lights of what seemed like a motel.<br>\r\n<br>\r\nHmm, how convenient, he thought, just a mile from where I broke down....<br>\r\n<br>\r\nXXXX<br>\r\n<br>\r\nThe motel was a place with greasy walls, wornout carpets and a very bored and old looking receptionist, who was slightly creepy and rude to Fury when he asked him for a room.<br>\r\n<br>\r\nBut at least the rooms were cheap, even though the were infested with bugs. Fury sat down on his bed and studied the map that he managed to obtain from the lobby room.<br>\r\n<br>\r\nHe managed to spot the motel he was staying in and calculate the distance he still had to travel.<br>\r\n<br>\r\nFifty miles, he concluded. Fifty miles to go until he reached his destination: Character Heaven!<br>\r\n<br>\r\nIt was the city where dreams came true, many said. Where nobodies like Fury became movie stars in less than two years. Fame and fortune awaited him, and that was exactly what the hybrid dreamed of when he went to sleep that clear night.<br>\r\n</span></div></div>",
            "created":1551902700,
            "id":2627099,
            "title":"A new kid in town."
        }
    },
    "info":{
        "author_id":"drakin",
        "author_name":"Drakin",
        "brief_description":"Expand and alter anthro (and feral) characters from media past, present, and future.",
        "created":1514699460,
        "description":"<td align=\"left\" class=\"norm\">Imagine, if you will, that call characters in all media, movies, TV, video games, books... All of them live in a sort of 'Character Heaven', either having lived out their career in their media form or waiting for their 'big break'.<br>\r\n<br>\r\nHere's how it works. Say a creative individual down on our world comes up with a story they want to tell and a group of characters to fill the role. Well those characters already exist and have existed in 'Character Heaven' and are chosen to perform those roles. It' like being hired by a talent agency, only the exact character already exists.<br>\r\n<br>\r\nWhen the show or book or whatever is created they get the job. But for them it's like being a Hollywood actor. They perform in the movie or show and continue to live in Character Heaven. And when the show or movie is done being created they 'retire' until or unless a sequel is made. Those with the longest running franchises are the really big stars in this place.<br>\r\n<br>\r\nAnd being a reality of pure creative potential no being can really die. At most a 'death' will simply leave them unconscious until the next day when they regenerate. <br>\r\n<br>\r\nIn this reality it might be possible, for example, to see the dragon form of American Dragon: Jake Long sharing a lunch with 'Gorbash' from the animated film 'Flight of Dragons'. Or Balto talking with Charlie and Itchy from All Dogs Go to heaven and meeting the Road Rovers for a game of catch. Any sort of coss franchise interaction is possible.<br>\r\n<br>\r\nNow for the rules. First the RP specific rules.<br>\r\n<br>\r\n<u><b>RULE ONE:</b></u> No humans or humanoids as the main subject of a story path. They exist here of course, they can be friends and meet with the anthros and ferals, but this is a 'furry' story so let's keep the focus on the non-humanoids.<br>\r\n<br>\r\n<u><b>RULE TWO:</b></u> As you'll see Character Heaven is divided into sections based on things like 'Sci-fi', 'fantasy' and 'modern day'. Characters and move between them, but keep in mind the different factors of each. Like say magic in the fantasy district might not work in the sci-fi district. Or a gizmo of un-explainable technical abilities from the sci-fi district might not be as functional in the 'modern day' district. <br>\r\n<br>\r\n<u><b>RULE THREE:</b></u> original characters can exist here as their stories may not have been created yet  on Earth but <i>be sparing</i>, I don't want to see dozens of OC characters running about for every character from the media.<br>\r\n<br>\r\n<u><b>RULE FOUR:</b></u> These characters are to their roles in their stories as actors are to their roles in movies and TV. They do not have to have the same personality. To go back to an earlier example, Jake Long is the character in the show. His dragon form might be called Mark and be casual, laid back, and an avid bookworm. Nothing like the character he played in the show. Get creative. Dumb characters could be smart. Bullies could be nerds, anything is possible.<br>\r\n<br>\r\nAnd now for the general rules.<br>\r\n<br>\r\n#1 - Keep vore to a minimum. This might be a city of fat furs but I'm assuming most get that way by eating food, not others. I have Vore listed as minimal because there are other more interesting ways of voring individuals that could be used. Either way, for whatever reason, voring does not kill characters here.<br>\r\n<br>\r\n#3 - <b><u>No short posts.</u></b> Any post added must be a minimum of three paragraphs or approximately two hundred and fifty words. Which is not as hard as some might think. Longer posts will be greatly appreciated though. I'm not holding this one tight since sometimes just more choices are needed, but please at least try to make every chapter substantial even if it's just adding more choices. IE, if a character is browsing a shop trying to decide what magical item to buy, describe further browsing before giving more choices.<br>\r\n<br>\r\n#4 – Give everyone an out. All chapters should have two options at the very least. Give everyone a chance to follow the story you want to see and a way to escape that path if they want.<br>\r\n<br>\r\n#5 – Keep the flow. Everyone is entitled to interject their own ideas, however do not suddenly stop a story line for no reason to start a new one. So if there's a character given super powers, don't just suddenly strip them from him for some arbitrary reason and dump him somewhere to start your story. See rule 4. If everyone is given an 'out' then everyone will get the chance for the story they want.<br>\r\n<br>\r\n#6 – Weight Gain, Inflation, Hyper, Macro, Micro, Transformation, Transgender, and much more is all viable here, but be respectful. If you don't see a type of change you want to do and there's no more room for the choice don't just butt in with your idea. I'll try and offer a number of options from the start but I can't do everything right off. Just try and be respectful and I'll help where I can.<br>\r\n<br>\r\n#8 – Oviposition or egg-laying. Some furs like being expanded with hundreds of eggs, and I will allow this. However. All eggs laid must be infertile and not be destined to hatch into hundreds of babies. If having children is to be part of the story keep the number to a minimal amount no matter how many eggs are involved. Eggs or other pregnancies may produce clones or the like, but keep the number of actual infants to the barest minimum if at all.<br>\r\n<br>\r\n#9 -- Nothing gross or disgusting. Sorry, but stuff like scat and 'watersports' is right out. I won't tolerate disgusting excretions all over the place. Basically if you can imagine it covering your whole body being sticky or slimy and it makes you feel ill then don't do it. <br>\r\n<br>\r\n#10 – Lastly, have fun with this. This is a world to expand upon and grow huge with creative ideas. The rules above are guidelines rather than strict 'do not cross' guardrails for the most part. However, take note of each since anything falling into such categories <i>may</i> be removed if it is deemed inappropriate in one form or another. However, such actions will not happen without the author being told via on-site email and giving them a chance to correct their chapter. Any abuse or rude behavior, including mean spirited posting, will be removed without such notification though, so 'play nice'.</td>",
        "id":2144590,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603789740,
        "modified":1603789740,
        "pretty_title":"Expanding the Creative Universe"
    }
}