{
    "chapters":{
        "1":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "You Shrink ( Now)",
                "You Shrink ( Not Now)",
                "You Shrink (Really later)",
                "you Shrink (Slow)",
                "You shrink and faint"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Peter, you have 15 years old and your life is pretty normal for a guy at your age. You go to the college, work in a computer store and have some friends, who mostly are female.  You live in a apartment with your parents, and under your house lives a girl who goes to the school with you sometimes, Lucy. She is a little short, with her 5ft 34ins. She is cool and funny, have a b-cup and a great ass, in fact her ass is big and  round.  You always have secretly dreamed about get in there...<br>\r\n Today is monday and your parents have travel to go visit you grandpa that is very sick[?].They said the should go out for the rest of the month, and they will leave the house to you and the maid Natalie until then. <br>\r\n<br>\r\n“This must be a dream! Oh well, but i have to study for my exams first, then i will make some parties...”<br>\r\n<br>\r\nAfter saying this, your phone rings, it was Lucy, she wanted to study with you and she were comming.<br>\r\n<br>\r\n“Sure Lucy, I have nobody at home by now and we have some time alone until the maid come this afternoon.<br>\r\n<br>\r\nReally?” - she said with some excimment- “I'm going up then!”<br>\r\n<br>\r\nTwo minutes later she is opening your door with some books and notes. You stay in the living room, around the table when she says:<br>\r\n<br>\r\n“I'm kinda thirsty, mind if I go get some soda for us?<br>\r\n<br>\r\nSure, there is some in the fridge, help yourself.”<br>\r\n<br>\r\nShe giggle and goes to the kitchen, and you watch as she walk and wiggle her butt in the tight jeans. A minute later she comes back with a glass of soda for you. You didn't really want it, but you drink anyway.  Then...</span></div></div>",
            "created":1216530000,
            "id":670168,
            "title":"The fun begins..."
        },
        "11":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Massage her butt hole",
                "Screw that!"
            ],
            "content":"<div class=\"\"><div> <span>Just after you finished your Soda, you start to feel dizzy and funny. Your head start to spinning and you fall asleep and when wake up, you  don't recognize where you are, at least not in the first look.<br>\r\n<br>\r\n“Aaaaawww... You are so cute like this!”<br>\r\n<br>\r\nA tremendous voice come from up, and you see Lucy behind you, but she is in a gigantic proportion compared to you.<br>\r\n<br>\r\n“What the hell?<br>\r\nDon't worry Peter, i just shrunk you for...  Some fun... You know i always realize that you loved my ass and I was thinking about date you... Then I found this witch that sell to me this potion that could shrink you! Now you an be my toy forever! And knowing you like my butt so much... Now that you are half a inch you will be in heaven!”<br>\r\n<br>\r\nShe open her jeans and let them down, showing her pink panties, then she grabs you and put in her back end. It is  tight, and you are almost touching her anus. You are amazed  because you see that “him” could swallow you.  She pass her finger and push you to touch her hole, making her to moan.<br>\r\nAfter that she put her pant on again, zipped and sit back in the chair again.<br>\r\n<br>\r\n“You Know... I would really like a massage right now Pete.”</span></div></div>",
            "created":1216530000,
            "id":558255,
            "title":"You Shrink ( Now)"
        },
        "111":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "You stay the rest of the day inside her",
                "She needs to go to the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>You think at with you height it is better do what she says and you start do rub her butthole, besides your condition right now, this was your fantasy, and you are liking this a little. Lucy start to move herself in the chair, and with that, your hole body now is touching her asshole and your arms are now inside her. She can feel you there and make an evil smile, her holes start to expand and contract, pulling you to inside her more and more...<br>\r\n<br>\r\n“Wait Lucy... Don't...”<br>\r\n<br>\r\nToo late. Your body has been sucked to her butt hole. It is dark and slime and the light that has behind you disappeared, that means that her hole is closed and you are trapped in for a while. You strike the walls of her rectum, but this seem to be useless. On the outside, Lucy feels you struggling inside her, and thats only make her to moan in pleassure.<br>\r\n<br>\r\n\" You know what? I think I'm going to leave you there for now...\"</span></div></div>",
            "created":1216530000,
            "id":558277,
            "title":"Massage her butt hole"
        },
        "1111":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Go with her ( in her ass)",
                "Go with her ( in her pussy)",
                "Stay home"
            ],
            "content":"<div class=\"\"><div> <span>Countless hours have passed and you don't know more if is day or night. The air inside is thin and the smell is strong. this makes you fll down in sleep. outside, Lucy forget about you in her as and you spend the night inside her.<br>\r\nIn the next day you wake to discover that you still in her rectum, andalll of this wasn't a crazy dream. You start to pray that she lets you out somehow. And then the waves of her bowels start to move, and you fell a incredible mass of hot air pass toward you, carring you with it. Lucy farts you out, the fart blows you to the back of her panties. You didn't know but Lucy was on foot, curved, to make the fart come easily.She felt that you came out and with a yawn she said<br>\r\n<br>\r\n\"Morning Pete.\"<br>\r\n<br>\r\nShe Makes her way to the kitchen and with each step hers butt cheeks giggles, and you trie your way to her crack, but this seems to be useless. When she sits, you are crushed by her right cheek, until she starts to adjusts you in her seat, swinging her butt until you got to the center of her ass.<br>\r\n<br>\r\n\"Hope you are comfy in there Pete, I know I am.\"<br>\r\n<br>\r\nYou couls only see tonf of skin and flesh, and suport all the weight of Lucy for more half an hour, while she take her breakfast. When she finish, Lucy goes to teh bathroom and thre she takes you and puts in the sink.<br>\r\n<br>\r\n\"So, enjoying your new life as my butt slave?<br>\r\n<br>\r\nLucy I'm hungry! Please give me some food!<br>\r\n<br>\r\nWelll I was goign to brush my teeth, but i think you can clean it up and get your mela today.\"<br>\r\n<br>\r\nSaying this, Lucy open her mouth and puts you in her tongue. she carefuly puts you insede her mouth and says<br>\r\n<br>\r\n\"Don't worry, I wont swalow.\"<br>\r\n<br>\r\nYou gulp in fear and see that she could easily eat you. But you are really hungry and you look in her teeth for some rest of food. Humilhiated, you eat what left in her moth, but for you size, it was realy plenty of food.Lucy Start to roll you in her mouth, covering you with saliva, with her mouth shut it was dark and hot and you remember  when you were in her bowels, ate least this time you had more space. Sudely she spit you and says with a smile<br>\r\n<br>\r\n\"Scare the hell of you right?<br>\r\n<br>\r\nYou bet! Don't do this again!<br>\r\n<br>\r\nFine\"<br>\r\n<br>\r\nShe says with giggles.<br>\r\n<br>\r\n\"Listen, im' going to school now, so... You can come with me or stay in the house.\"</span></div></div>",
            "created":1221886800,
            "id":584964,
            "title":"The next day"
        },
        "11111":{
            "choices":[
                "she plays with you for the rest of the day",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll go with you\" you say \"awesome\" she turns around showing you her huge butt and her anus and pussy, then descends onto you, you brace for impact and feel her anus envelope your small body. You feel her anal folds close under your feet then she gets up and gets ready for school. She then goes to school and her muscles occasionally squeeze you and move around you, then she farts and your feet pop out her anus she feels you stick out then squeezes you and leaves you there. \"Mmmmmmmm\" she says slurping you inside after school was out she went home, when she got there she threw her stuff down and went to her room and took off her clothes and laid on her bed and stuck her finger in her anus pushing you deeper while sighing and rolling her eyes back. Then she raised her butt in the air and squeezed you out to your chest.</span></div></div>",
            "created":1471258260,
            "id":2196166,
            "title":"Go with her ( in her ass)"
        },
        "111111":{
            "choices":[
                "does she push the dildo all the way in",
                "puts you in her pussy"
            ],
            "content":"<div class=\"\"><div> <span>She then slurps you in and pushes you out repeatedly until she got up clenching her anus around your chest and she grabbed her dildo and string and tied you up to the dildo and placed you on the bed, she grabbed her lube and proceeded to dump it on you and the dildo. She quickly hovered her anus over you and farted then sat down, the dildo disappeared with you.   </span></div></div>",
            "created":1475220060,
            "id":2216848,
            "title":"she plays with you for the rest of the day"
        },
        "1111111":{
            "author_id":"jadooalh",
            "author_name":"jadoo0",
            "choices":[
                "she leaves you in with the dildo",
                "she craps you out "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she goes up and down with the dildo a couple of time  moaning before going all the why down taking you and the dildo completely up her asshole while she climaxes </span></div></span></div>",
            "created":1556415180,
            "id":2651545,
            "title":"does she push the dildo all the way in"
        },
        "11112":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Lucy or Evy(Lucy's best friend)",
                "Rose(Dont like Lucy) or Yomichiko( teacher)"
            ],
            "content":"<div class=\"\"><div> <span>“ I will go with you... Better than stay home with your mother and sister.<br>\r\n<br>\r\nYou bet.”<br>\r\n<br>\r\nLucy then leaves you in the sink while she go take a shower. When she finish to dry herself, she puts a white panties, and takes you with her hand. She shows a angel smile and gives you a kiss that cover your hole head.<br>\r\n<br>\r\n“I think I will put you in a different place today, hope you liked!”<br>\r\n<br>\r\nWith this she drop you in the front of her panties. You struggle for your life, but this only make her pubic hair to tie you up. You back to the dark of her body, your head is practically been eaten by her great lips with your arms and legs separated like an “X”. The smell is strong, but not all bad because the shower, and you really don't mind in staying in her pussy, it is really better than her ass.<br>\r\n<br>\r\nAs the day goes by, it is getting hotter and Lucy Start to sweat, and the smell of hers is getting more and more strong.As she walks, you fell yourself move and this makes tickles on her. It is so hot and the smell of her pussy is so strong that you faint for a while.<br>\r\n<br>\r\nWhen you wake up, you see you are in a bathroom by the side of one vase. Probably Lucy use the bathroom and you fell from her panties without her noticing. Now you are in your School, shrunk and alone. Thinking on what you can do, the door open and you see...</span></div></div>",
            "created":1224478800,
            "id":597784,
            "title":"Go with her ( in her pussy)"
        },
        "111121":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Lucy",
                "Evy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So?<br>\r\n<br>\r\nLucy you Already know... Evy is 1,70 m, short and brow hair, blue eyes, C cup, and have a round ass, almost so big as Lucy. She is Lucy best friend and would mind in share you with her...</span></div></span></div>",
            "created":1224478800,
            "id":597785,
            "title":"Lucy or Evy(Lucy's best friend)"
        },
        "1111211":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Lucy's ass finish his \"lunch\"",
                "Lucy stop to do other business"
            ],
            "content":"<div class=\"\"><div> <span>As you look back, you see the door open ans Lucy is staring at you with an angry look<br>\r\n<br>\r\n<span class=\"cIndigo\">You tough you could run away from me Peter?</span><br>\r\n<br>\r\nNo! I was...<br>\r\n<br>\r\n<span class=\"cIndigo\"> It doesn't matter, it is time for you to go home...</span><br>\r\n<br>\r\nSaying this, Lucy puts you in the toilet sit, turn back and drop her pants and panties, revealing her huge butt to you, then she spreads her cheeks and you clearly see her asshole moving in and out.<br>\r\n<br>\r\n<span class=\"cIndigo\"> See Pete, my ass is hungry and you are his lunch!</span><br>\r\n<br>\r\nWith this, Lucy is coming down and you are in the target of her ass. you tray to run away but it is too late, her ass is upon you and you are centimeter away from being swallowed again by her nasty hole. While you are struggling, Lucy lets out a big and wet fart.<br>\r\n<br>\r\n<span class=\"cIndigo\"> ops... I think i need to go...</span></span></div></div>",
            "created":1237438800,
            "id":663451,
            "title":"Lucy"
        },
        "11112111":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Lucy hands you to Sandy now",
                "Lucy hands you to Sandy later"
            ],
            "content":"<div class=\"\"><div> <span> After the fart over you face, all your forces are drained and now you don't ( and can't) resist for be sucked to Lucy asshole. First your legs, then your body slowly start to penetrate her hot, humid and smelly anus, when you are only your upper part out of her ass, Lucy use her finger and shoves you completely inside her. Doing this you can hear her moan in pleasure, and once again you are inside Lucy's bowel.<br>\r\n<br>\r\nYou spend all the day inside Lucy's bum, and you start to get used to the smell, and being pressed by all angles by her anal muscles. you start to think if this is gonna be your life for now on, be  the slave of your friend and live inside her rectum just to pleasure her.<br>\r\n<br>\r\nHours have passed and then you feel yourself moving. You start to see the light in the end of the tunnel, and  finally you are out of this giantess ass. you see that you are in a bowl, filled with a warm water, and above you the giant booty that were holding you captive for hours. looking in a state of shock, you realize that her anus was opening, and a piece of shit was coming out. you swim away and this giant (to you) brown log was floating in your direction. but quickly you see Lucy hand come and rescue from the shit.<br>\r\n<br>\r\n<span class=\"cViolet\">Hello again Pete, are you enjoying be in my butt? I am.</span><br>\r\n<br>\r\nLucy! Why did you do that to me? I thought we were friends! Did you really just shrank me for i can be a buttplug for you?<br>\r\n<br>\r\n<span class=\"corange\"> Of course not! She was going to share you with me!</span><br>\r\n<br>\r\nThis was Sandy Voice. Lucy's sister now you know you are going to face 2 giant butts...</span></div></div>",
            "created":1249448400,
            "id":739616,
            "title":"Lucy's ass finish his \"lunch\""
        },
        "111121111":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Sandy push you inside her",
                "Sandy fart"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"corange\">Of course not! She was going to share you with me!</span><br>\r\n<br>\r\nIt was Sandy voice, she was 18 years old, green eyes, red hair, 5,74 ft, C breasts and a butt as big and round as Lucy.Sometimes you wonder if they were really siblings, but when you look at her behinds, your doubt disappear.<br>\r\n<br>\r\n\"<span class=\"corange\">Can't believe you almost lost him today Lucy!</span><br>\r\n<br>\r\n<span class=\"cviolet\">Sorry, it was an accident, i put him alway from my ass and he escape... it won't happen again</span><br>\r\n<br>\r\nWhat you mean?<br>\r\n<br>\r\n<span class=\"cviolet\"> I won't keep you always from my ass again, this way you can't escape</span>\"<br>\r\n<br>\r\nNow you shiver in fear, knowing that this will be your destiny. be a buttplug for this girl<br>\r\n<br>\r\n<span class=\"corange\">Not so fast Lucy! You are not going to leave him 24 hours in your ass, i want him him too, and don't forget mom.</span><br>\r\n<br>\r\n<span class=\"cviolet\"> Yeah, i know, but you understand what i mean right?</span><br>\r\n<br>\r\n<span class=\"corange\">Sure... ok, you got him for yesterday and this morning, i guess it is my time now, don't you think?</span>\"<br>\r\n<br>\r\nLucy then hands you to her sister. She takes closer to her face.You can see she is smiling, An strange smile you think to yourself...<br>\r\n<br>\r\n<span class=\"corange\">First, let me wash you...</span><br>\r\n<br>\r\nSaying this, Sandy drops you in the sink and turn on the warm water. it feels good a little, then her giant hand start to scrub and wash you.You almost drown but she finish before you die.<br>\r\n<br>\r\n<span class=\"corange\">Now... Lucy was saying that her ass is your home now... then i think i will call my butt your work. What do you think Pete, with only 15 years you already have a home and a work to do. now... Since you skip your work yesterday, tonight you will need to do some extra hours!</span><br>\r\n<br>\r\nSandy says this jiggling, the she lower her pants and panties, puts you her back and give herself a good wedgie.<br>\r\n<br>\r\n<span class=\"corange\">Now, start working in my ass Peter</span><br>\r\n<br>\r\nNot knowing what to do, you start to massage her anus,which cause her to moan.<br>\r\n<br>\r\n<span class=\"corange\">Hum... Really nice, how about we add some kissing and licking</span><br>\r\n<br>\r\nThen you start to lick and massage this giant anus, that start moving in and out, and you start to have an idea what is comming next...</span></div></div>",
            "created":1250917200,
            "id":748424,
            "title":"Lucy hands you to Sandy now"
        },
        "1111212":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "she is going to the P.E class",
                "she is going to the library"
            ],
            "content":"<div class=\"\"><div> <span>Now you are in your School, shrunk and alone. Thinking on what you can do, the door open and you see Evy, Lucy's best friend and you always thought she was hot.  Desperate, you wave and yell for her until she finds you.<br>\r\n<br>\r\n\"OH my God! Peter, is that you?\"<br>\r\n<br>\r\nYou tell her the hole history and she is a little shocked and angered with Lucy.<br>\r\n<br>\r\n\"I can't believe in this! Lucy Shrunk you and didn't tell me? How can she not share things like this with her friends?<br>\r\n<br>\r\nWhat? I'm not a thing!<br>\r\n<br>\r\nOh... yeah... sorry...Maybe i can help you... but only after the school,  okay?\"<br>\r\n<br>\r\nShe says with a  mischievous smile.<br>\r\n<br>\r\n\"Ok... I think this will do...<br>\r\n<br>\r\nAnd two more thing... my pants don't have pocket and i can't let you in my hand the hole day so you are taking the ride in my panties, but first i need to handle one thing....\"<br>\r\n<br>\r\nShe puts you in her thigh and let out a big and wet fart, after that you realize she is taking a crap, and the smell is really strong, making you to feel dizzy. After some time, she finish taking her crap, clean herself an put you in the seat cover.<br>\r\n<br>\r\n“Now help me, tell me if is clean already”<br>\r\n<br>\r\nSaying this, she spread her cheeks and put her ass very close to you, almost making you fall in her crap below. The smell is strong and hot and you see her anus moving.<br>\r\n<br>\r\n“Yes... It is clean<br>\r\n<br>\r\nGreat! Then you won't mind in stay here all the rest of the day.”<br>\r\n<br>\r\nShe gets up, puts you in the back side of her panties and pulls up, you can only see her great ass coming with nothing to do.She adjust you, making you be glued with her asshole, which is pulsanting. With this she start to walk</span></div></div>",
            "created":1230613200,
            "id":626793,
            "title":"Evy finds you!"
        },
        "11112121":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Stay with Cindy",
                "Stay with Evy"
            ],
            "content":"<div class=\"\"><div> <span>Inside Evy's panties, you hear her talking to some people, but the sound isn't clear enough, after some time you can see a light above you, she is taking you from you prison. you can see that now you are in the gym, but only with Evy and her sister Cindy, who is the P.E. teacher. She is 25 years old, hot tights and a good ass with a B cup bra, short and blond hair.<br>\r\n<br>\r\n\"So Pete, I'm going to the PE class now and I want you to choose,  you can stay with me or go with my sis.\"<br>\r\n<br>\r\nWell, going with Cindy can be easy, after all she will not crush you or anything (you hope). Stay with Evy can be more risk, but you know deep inside you were really liking be the close to her ass.<br>\r\n<br>\r\n</span></div></div>",
            "created":1231736400,
            "id":632451,
            "title":"she is going to the P.E class"
        },
        "111121211":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Time to do some excercises",
                "go to the pool"
            ],
            "content":"<div class=\"\"><div> <span>\"I... guess i will stay with Cindy..\"<br>\r\n<br>\r\n\"Great!\"- Cindy says with a big smile-<br>\r\n<br>\r\nSo Evvy hands you to Cindy and goes to change, while Cindy takes you to her office, she places you in the table and smile to you.<br>\r\n<br>\r\n\"I'm really happy for you to had chosen me Pete, and I know you had been looking to my butt for a long time too...\"<br>\r\n<br>\r\nWhile she was talking, she gives her back to you, you are staring this giant booty, and she start to take off her clothes, to reveal her bikini.<br>\r\n<br>\r\n\"...And know... i will give to you what you have been  wanting for this long. but i don't know if this will be good for you.\"<br>\r\n<br>\r\nSaying this, Cindy drops you in the bottom of her bikini, and adjust you, putting you close to her anus. With every step she makes, your body touches the smelly and sweaty hole.</span></div></div>",
            "created":1261198800,
            "id":807912,
            "title":"Stay with Cindy"
        },
        "11112122":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "you are completed sealed in Evyy butt",
                "You are in a table, surrounded by giant girls"
            ],
            "content":"<div class=\"\"><div> <span>While she is walking her butt cheeks make you come closer and closer to her hole, which is pulsating like crazy, i start to think that she is trying to put you inside her for one way or other.<br>\r\n<br>\r\n<span class=\"crose\"> Ok Pete, I am going to the Library study, which mean i will stay like hours sitting, hope you like it... I know i will</span><br>\r\n<br>\r\nYou can hear and feel she giggle. some time walking and your lower part is touching her asshole, and you now are worried what will happen when she sits down...<br>\r\n<br>\r\nIt doesn't take too long to find out, the space you have become smaller and Evy's pink hole open, letting you go inside, until your chest.<br>\r\n<br>\r\n<span class=\"crose\"> ooh Pete, If you wanted to go that deep, you could warn me. this will make my studies more fun...</span><br>\r\n<br>\r\nWith this her ass start to suck you, making only your head out. As the time pass, the pressure in your body and the heat around you make you faint. When you wake up..</span></div></div>",
            "created":1238648400,
            "id":683712,
            "title":"she is going to the library"
        },
        "111121221":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Evvy tells Lucy about you",
                "Evvy goes away without telling about you"
            ],
            "content":"<div class=\"\"><div> <span>When you wake up again you find yourself completely surrounded by darkness. You feel like you are trapped in some hot and fetid place. The air you hair is small and have the taste of shit, fart and... Ass. With this you remember what happened after you pass out and you realize that now you are inside Evvy ass. Her ass muscles are moving, making you go deeper and deeper inside her bowels. The smell is getting strong and you don’t want to find out why. With this in you try to move yourself up (where you head is pointing), and your movement are felt by your keeper.<br>\r\n<br>\r\n<span class=\"cRose\">Ah finally you wake up! I was getting worried that you could have died. Well, I’m going to walk now, guess you don’t mind in spend a little more time in there, right?</span><br>\r\n<br>\r\nYou could not hear much clearly, but you understand the idea. Every night, Lucy and Evvy would take a walk in the park for some exercises. Now you are more worried than never! Evvy could talk to Lucy that she found you, and now you would be in two asses, making your life two times more difficult!<br>\r\nAs Evvy walks, her ass is making you go deeper, and you are struggling to at least stay in your position. All your fight to survive is making Evvy love this feeling. After some minutes, both girls meet each other and went to run for half an hour. To you was  hell. A hot, humid and fetid hell. You were being squeezed by all directions, while her butt was constantly trying to push you deeper. After this half hour of torture, they decide to walk. Just after they start walk, Evvy lets out a strong, long, but silence fart.  The smell made you choke and almost faint, but with all your left forces you were able to reach Evvy’s sphincter, but it close, pressuring you body too strong. Evvy loved that sensation you were giving her. After more 10 minutes of walk, they start to stretch. Evvy opened her legs and bend down; this made her anus open a little and makes you fall again in her large bowel. Finished the stretch…</span></div></div>",
            "created":1240981200,
            "id":683675,
            "title":"you are completed sealed in Evyy butt"
        },
        "1111212212":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "You start to drown, start licking",
                "Try to get out"
            ],
            "content":"<div class=\"\"><div> <span>Finished the Stretch, Evvy says good bye to Lucy and both go to theirs homes. For you, you keep trying to get out, crawling her rectum. When you are almost making your way to her sphincter, she lets out another powerful fart, that push you out, at least your head. As she walks, her butt cheeks press your head and her rectum press the rest of your body. Now it is really hard to breath, but in the other side, Evy is really loving  the sensation of power and the feeling you are giving to her.<br>\r\n<br>\r\nFinally Evy stay in her house, she goes to the bathroom, start to undress herself. Goes to the sink and... Shit you.<br>\r\n<br>\r\n<span class=\"crose\">So Peter, did you enjoy the ride?<img style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/pthb.png\" alt=\"*Pthb*\" class=\"emoteZ\" title=\"Pthb\" border=\"0\" width=\"15\" height=\"15\"> I did <img style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bigsmile.png\" alt=\"*Bigsmile*\" class=\"emoteZ\" title=\"Bigsmile\" border=\"0\" width=\"15\" height=\"15\"></span><br>\r\n<br>\r\nAre you Crazy? I almost die!<br>\r\n<br>\r\n<span class=\"crose\"> But you didn't so... This mean you are very tough, Now i want to know, wanna sleep inside my ass? I am really enjoying have you in there.</span><br>\r\n<br>\r\nOf course I don't wanna sleep in there!<br>\r\n<br>\r\n<span class=\"crose\"> oh yeah? Well, we will see this. Look,  if you wanna enter in my ass now you will have to lick it and i won't let you out until i need to shit so... this means when you enter now you will only be able to get out with my shit, did you understand?</span><br>\r\n<br>\r\nFine! I won't enter in you ass never again then.<br>\r\n<br>\r\n<span class=\"crose\">We will see... now i have to take a bath...</span><br>\r\n<br>\r\nShe says this with a evil smile in the face. Evvy then puts back her panties and takes you with her hand.<br>\r\n<br>\r\n<span class=\"crose\">Remember. You need to lick my hole to enter again.</span><br>\r\n<br>\r\nAnd saying this, she drops you in the back of her panties and go to the bathtub, sitting and relaxing in the warm water.</span></div></div>",
            "created":1245474000,
            "id":711289,
            "title":"Evvy goes away without telling about you"
        },
        "11112122121":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Goes to sleep",
                "Rose come off to a sleep party"
            ],
            "content":"<div class=\"\"><div> <span>Surrounded by the water, soon you start to loose your breath and you know you will drown. You try to swim away, but her butt is too powerful for you to scape. Then you see no other option. You need to go back to her hole. you start to push her butt cheeks apart and enter farther and farther in her crack, until you are able to see her giant hole there, looking to you as if he was waiting to you. You start to lick and massage. Evvy is purring in pleasure for what are you doing to her. You are getting desperate when you see her giant fingers come and press you body on her pink hole.Suddenly her anus open wide and a giant bubble pass over your body. Oh crap she was farting on the water! While the hole was open, she push you inside and seal you again in your prison. with this, Evvy finish her bath and...</span></div></div>",
            "created":1245474000,
            "id":711301,
            "title":"You start to drown, start licking"
        },
        "111121222":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Lucy",
                "Evy"
            ],
            "content":"<div class=\"\"><div> <span>When you wake up, you find yourself in a table, you look around to see that now you are surrounded by four giantess: Lucy, her sister Sandy, Evy and her Sister Cindy. Now you know that you are doomed, first you were slaved by Lucy, then for Evy, now you will be slaved by Lucy, Evy and her sister as well. You don't have any place to run or to hide, the table was small, made of glass, but for you it was too high for jump, and you would be catch by one of the girls either way.<br>\r\n<br>\r\n<span class=\"cViolet\">Well Peter, Evy told me all about your adventures and were thinking... I think we could share you, we are great friends, and I know you wouldn't mind, would you? And to celebrate this new step in your life, we were thinking in a game for we to play, we name it \"Find out what i have lunched today.\" It is quite simple in fact. You just need to discover what one of us lunched today.If u find out you will get a nice reward</span><br>\r\n<br>\r\nBut... what if i don't find out?<br>\r\n<br>\r\n<span class=\"cOrange\"> hum... Would be fun for every one too</span> - Sandy says with a evil grin in her face-<br>\r\n<br>\r\n<span class=\"cred\"> But to put the game easier to you we will give you 2 hints...And you only have 3 times to try guess the lunch for one girl</span><br>\r\n<br>\r\n<span class=\"cViolet\"> Enough of talk, lets start the game, which one you will try your first chance Peter?</span></span></div></div>",
            "created":1252904400,
            "id":760826,
            "title":"You are in a table, surrounded by giant girls"
        },
        "111122":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Rose",
                "Yomichiko"
            ],
            "content":"<div class=\"\"><div> <span>So?<br>\r\n<br>\r\nRose don't Like Lucy At all... She is 1,72m, red hair, green eyes, d cup, her ass is not so big and round, but she likes smothering (you showed to her a site on internet and she really like.)<br>\r\n<br>\r\n<br>\r\nYomichiko is your math teacher, she is japanese, C cup, incredible legs and a amazing round ass. You really like her and you think she likes you in some strange way...</span></div></div>",
            "created":1224478800,
            "id":597792,
            "title":"Rose(Dont like Lucy) or Yomichiko( teacher)"
        },
        "1111221":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "She sees you",
                "She doesn't see you"
            ],
            "content":"<div class=\"\"><div> <span>As you wake up, you realize you are in the floor of the girls bathroom and suddenly the door open, it is Rose, she was a good friend of you and Lucy, but then one day they had a fight, you didn't take a part of the fight, because you never knew what was the motive for the fight of those two. Just one day she stopped talk to you and Lucy. Nut now she was you only hope.... and you really hope she can help you somehow!<br>\r\n<br>\r\nAs Rose enter, she quickly drop her dark and tight jeans and her panties sitting in the toilet. you are between her feet waving for her to see you.</span></div></div>",
            "created":1238648400,
            "id":670154,
            "title":"Rose"
        },
        "11112211":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "You loose your balance again and fall in the water",
                "You loose you balance but are able to hold in one of her pubic hair"
            ],
            "content":"<div class=\"\"><div> <span>Rose look at the floor while she is concentrating and see you waving for her, for first she is really surprised and take you with her massive hand, putting you near her face. Her breathing was intense, her breath easily made you lost your balance and fall in the palm of her hands.<br>\r\n<br>\r\n<span class=\"cgreen\">What is this? Peter?! Is That you?!</span><br>\r\n<br>\r\nYes! please help me Rose! - you yell to her-<br>\r\n<br>\r\n<span class=\"cgreen\">Why are you so tiny? and first? Why are you in the girls bathroom? </span><br>\r\n<br>\r\nLucy did this! She shrink me some how to make me a pet of her, putting me in some nasty places...<br>\r\n<br>\r\nYou shake  just about thinking where were you...<br>\r\n<br>\r\n<span class=\"cgreen\"> Nasty places? What do you mean? </span><br>\r\n<br>\r\nHer... asshole, I spend the night in her asshole...<br>\r\n<br>\r\nAfter you say this, Rose lets out a big and smelly fart that continua for almost 10 seconds, the air in the room became fetid and made you choke<br>\r\n<br>\r\n<span class=\"cgreen\"> Ops, sorry Peter it was the black beans I've been eating a lot for some time, in lunch and dinner, i really love this beans!</span><br>\r\n<br>\r\nShe gently put you in her thigh and rip out another blast stronger then the last one</span></div></div>",
            "created":1238648400,
            "id":670173,
            "title":"She sees you"
        },
        "111122111":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "You go peacefuly",
                "You refuse"
            ],
            "content":"<div class=\"\"><div> <span>You fall in the water, which absorb the the impact making you still alive, but when you look up, you see Rose asshole opening and a huge log coming out of it. It was huge, even to you in a normal state, would have 2 inches in diameter and 8 inches of length. You see that it was almost hitting the water and was still coming out. when the log finally hit the water, the impact is so strong that create a giant wave that carry you to the porcelain. The smell was too strong. you are almost fainting whe Rose come and take you out of the vase.<br>\r\n<br>\r\n<span class=\"cgreen\">So... Lucy puts you in her ass? then you could help me cleaning me now</span></span></div></div>",
            "created":1238648400,
            "id":670181,
            "title":"You loose your balance again and fall in the water"
        },
        "1111221111":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "You wake up in the dark",
                "Wake upin ..."
            ],
            "content":"<div class=\"\"><div> <span>\"What?!\" -You shout out<br>\r\n<br>\r\n<span class=\"cgreen\">Don't worry, it is only to see if it is clean enough... nothing that bad right?</span><br>\r\n<br>\r\nRose says with a smile on the face. And saying this, she wipe herself a little, and the sits on you,while seeing this enormous ass coming to get you, you only close your eyes in despair. Rose makes your head almost enter in her ass, she moan and then ask:<br>\r\n<br>\r\n<span class=\"cgreen\"> Is it clean already?</span><br>\r\n<br>\r\nYou open your eye and see above you a piece of shit that is almost the size of your head, and when you are about to yell, a powerful gas blow form her anus, making the shit fall on your face... and you were with your mouth opened. You spit the shit out of your mouth, while cleaning your face and trying the best to breath little by little, because of the smell. You try your best, but the smell is horrible, and you fall unconscious.</span></div></div>",
            "created":1260334800,
            "id":803535,
            "title":"You go peacefuly"
        },
        "11112211112":{
            "author_id":"spongebob1234",
            "author_name":"Trisha",
            "choices":[
                "Shove you beyond the point of return up her rectum",
                "Flush you"
            ],
            "content":"<div class=\"\"><div> <span>HER ASS??<br>\r\n<br>\r\nAll you smell around you is the all too familiar stench of shit all around you.  Why did she put you in her ass?  You feel around and thankfully you're just between her cheeks and not all the way in her rectum....yet.  You scream, \"ROSE, ANSWER ME!\"  Then in response she bounces a bit in her chair, causing an earthquake from your perspective.  Apparently she won't answer you.  Oh, but she will!<br>\r\n<br>\r\nYou shimmy up her ass and start massaging her asshole to get her attention.  You hear her make soft noises from above.  This'll get her attention for sure, you think.  Soon her moaning grows a bit.  You hear her excuse herself to the bathroom.  You feel her cheeks grinding against you as she walks.  She pulls you out in a stall.<br>\r\n<br>\r\nShe. Is. Pissed.  <br>\r\n<br>\r\nBut what does she decide to do as punishment?</span></div></div>",
            "created":1318050000,
            "id":1203003,
            "title":"Wake up in......"
        },
        "111122111121":{
            "author_id":"sagget69",
            "author_name":"sagget69",
            "choices":[
                "In her ass for the night",
                "Another girl joins in on the fun"
            ],
            "content":"<div class=\"\"><div> <span>\"How <i>DARE YOU</i> make demands of your master slave,\" Rose shouts angrily. She was pissed! You try to calm her down by telling her that you'll stay quiet from now on, but Rose feels the need to teach you a lesson. \"You need to learn to respect your master slave, so you're going back into my ass, but this time...you're going a little deeper,\" Rose says with a grin.<br>\r\n<br>\r\nShe places you on the toilet seat lid, then turns around to show you her massive, round behind. After spreading her cheeks, Rose descends upon you with all her body weight. You try to run, but there's nowhere to run. You're trapped on top of the toilet seat lid with only one direction to go...down the <b>brown eye express</b>.<br>\r\n<br>\r\nYour head makes contact with her butt hole, and you get wedged inside. Once again, you are stuck inside a woman's bowels. Rose uses her powerful butt muscles to suck you inside. Rose hears a \"<i>POP</i>\" sound when your legs are sucked inside.<br>\r\n<br>\r\nShe continues flexing her huge, round booty to push you deeper into her booty. After five minutes of flexing, Rose notices a small bump protruding from her colon. Rose has sucked you deep enough into her booty that you've reached her colon.<br>\r\n<br>\r\n\"Well, I think that's a good place to stop for now,\" Rose says jokingly. \"We can pick up on the rest of your punishment after class.\"<br>\r\n<br>\r\nWhat is the rest of your punishment?</span></div></div>",
            "created":1345093200,
            "id":1406075,
            "title":"Shove you beyond the point of return up her rectum"
        },
        "1111221111212":{
            "author_id":"sagget69",
            "author_name":"sagget69",
            "choices":[
                "Butt Games",
                "Butt Torture"
            ],
            "content":"<div class=\"\"><div> <span>Rose pulls up her booty shorts to cover her huge ass, which explode from the seam of her pants. She goes back to class, as if it were any other day, leaving you stuck deep within the confines of her enormous ass. You try not to move, because any sudden movement causes her butt muscles to contract, sucking you in deeper. Time is slow when you're trapped in a girl's behind, but after what feels like forever Rose's anal muscles begin to push you towards the exit. After being squeezed out of Rose's butt hole, she plucks you from her cheeks then places you on the floor.<br>\r\n<br>\r\n\"Oh thank you Rose! I don't know how much longer I could stay in there,\" you say graciously.<br>\r\n<br>\r\n\"Who said your punishment was over,\" says Rose.<br>\r\n<br>\r\nYou turn around and see two massive, round booties aiming at you. One belongs to Rose, but you can't tell who owned the other one. \"Don't tell me you don't recognize me, Peter,\" says the other giantess. You recognize her voice. It's Carrie, one of Rose's friends who has a giantess-butt fetish. Nothing good can possibly come from being stuck behind a woman with a huge ass and a giantess-butt fetish, while you're stuck at your current size.<br>\r\n<br>\r\nRose turns around, pulls her pants up, then says, \"Carrie, I want you to use your butt to teach Peter a lesson about being a good butt slave.\"<br>\r\n<br>\r\n\"Oh, I will,\" says Carrie. Carrie positions butt hole directly above you, then falls on top of you. Once she has your body firmly pressed against her anus, she uses her index finger to push you deep inside. \"He's gonna be in a lot of butts this week isn't he Rose,\" Carrie asks.<br>\r\n<br>\r\n\"You bet your ass he is,\" Rose replies.<br>\r\n<br>\r\nCarrie uses her butt to suck you in deeper, then she stops to feel your struggles within her booty. \"This tickles, I'm going to enjoy this,\" Carrie says. \"What should we do first?\"<br>\r\n<br>\r\nWhat should they do first?</span></div></div>",
            "created":1345179600,
            "id":1406631,
            "title":"Another girl joins in on the fun"
        },
        "11112211112121":{
            "author_id":"sagget69",
            "author_name":"sagget69",
            "choices":[
                "Sleep Over",
                "Booty Contest"
            ],
            "content":"<div class=\"\"><div> <span>\"I have an idea for what you can do with him, Carrie, but it'll have to wait until later tonight,\" says Rose. Rose whispers something into Carrie's ear, making it hard for you to hear her idea, plus you're inside Carrie's ass, so most of what you can hear is muffled by the sound of bowel movements.<br>\r\n<br>\r\n\"That's a great idea! I'll be sure to invite all our friends,\" says Carrie. <br>\r\n<br>\r\nBased on what you've heard, things aren't looking too good for you right now. Suddenly, you can feel the motion of Carrie's body. You're rapidly gets pushed towards the exit, then Carrie sucks you in deeper when you get too close. This process repeats itself frequently during Carrie's jog. She's trying to jog and keep you inside her butt at the same time, but jogging causes her butt muscles to push you out, so she has to periodically push you back in.<br>\r\n<br>\r\nEventually, the nightmare stops and Carrie arrives at her house. She goes inside then runs upstairs to her room, locking the door behind her. She squeezes you out, then places you on her bed.<br>\r\n<br>\r\n\"Carrie, I heard Rose whisper something to you. What do you have planned for me that requires all of your friends,\" you ask.<br>\r\n<br>\r\nCarrie smiles, then says, \"I'm inviting people over to play with you. My friends and I are going to use you as the main attraction at our awesome...\"</span></div></div>",
            "created":1345316460,
            "id":1407340,
            "title":"Butt Games"
        },
        "111122111121211":{
            "author_id":"sagget69",
            "author_name":"sagget69",
            "choices":[
                "The girls are here! Begin the sleep over",
                "The girls are almost here. Carrie gets to play with you more"
            ],
            "content":"<div class=\"\"><div> <span>\"<i>A sleep over!</i> You're telling me that you've invited all of your friends over to shove me up their butts,\" you yell.<br>\r\n<br>\r\n\"Wow, you figured that out faster than I thought you would,\" Carrie says making fun of you.<br>\r\n<br>\r\n\"Carrie please, I don't want to be a part of this! I'm sick of be shoved up the ass of every girl I run into,\" you say.<br>\r\n<br>\r\n\"Hey, watch your tone when you're talking to me slave. I think Rose was right about teaching you a lesson about your inferiority, so I'm going to use you as my personal booty toy, until the sleep over starts, and the real fun begins,\" Carrie says.<br>\r\n<br>\r\nYou try running away again, but Carrie catches you instantly, then reaches for a tube of anal lubricant. She opens the top, then squeezes a bunch of lube into the hand that she's holding you with. You wipe the lube from your eyes just in time to see Carrie's ass cheeks approaching. She uses you to apply the large amount of anal lube to her butt crack. When her ass is glowing with the lubricant, she inserts you head first into her butt hole, then uses you like a pipe cleaner to apply the lube to her ass hole. Carrie does this for several minutes, until her butt hole is so slick and shiny with lube that you slip out of her hand and slide deep into her butt hole.<br>\r\n<br>\r\n\"I think I'll enjoy having you this way Peter! I've always wanted to satisfy my giantess-butt fetish, and you've made my dreams of dominating a shrunken man with my ass come true,\" Carrie says with a smile. Suddenly, the phone rings and Carrie goes to answer it. \"That must be the girls calling about the sleepover,\" she says.<br>\r\n<br>\r\nWhat's the situation with the sleep over</span></div></div>",
            "created":1345325940,
            "id":1407421,
            "title":"Sleep Over"
        },
        "1111221111212111":{
            "author_id":"sagget69",
            "author_name":"sagget69",
            "choices":[
                "Ewy",
                "Cindy"
            ],
            "content":"<div class=\"\"><div> <span>Carrie picks up the phone and answers, \"Hello!\"<br>\r\n<br>\r\n\"Hey girl, we're right outside your door,\" says Rose from the other end of the line.<br>\r\n<br>\r\nCarrie heads downstairs to open the door, which causes your booty prison to bounce and knock you around. She opens the door and welcomes all of her friends into her home, including Rose, Ewy, Lucy, Cindy, and the rest of Carrie's big booty friends. When the girls head upstairs, one of the asks where you are. \"Oh, he's still in my ass. Let me get him out,\" Carrie says. Carrie pulls down her pants and squeezes you out onto the floor.<br>\r\n<br>\r\n\"What's the first thing we should do with him,\" Ewy asks.<br>\r\n<br>\r\n\"I know what we can do! Let's play butt tag,\" Lucy suggests.<br>\r\n<br>\r\n\"How do you play butt tag,\" one of the girls asks.<br>\r\n<br>\r\n\"It's simple, Peter runs away from us while we all try to catch him with our booties. The girl who uses her booty to swallow him is the winner,\" Lucy says.<br>\r\n<br>\r\nAll the girls agree to butt tag, and within seconds you are surrounded by huge butts. After the game starts, you make a dash for the door, but Ewy's butt blocks your path, and it nearly engulfs you. You manage to escape Ewy, and make a run for the bed. You figure that if you can hide under the bed it'll be hard for them to find you, and impossible for them to shove you up their butts. You're close to the bed and you think you have a chance, then everything around you gets dark, and you smell a familiar scent. One of the girls jumped and landed on you, ass first, sending you back into another ass hole, but whose ass hole were you in this time?</span></div></div>",
            "created":1345337520,
            "id":1407502,
            "title":"The girls are here! Begin the sleep over"
        },
        "11112211112121111":{
            "author_id":"sagget69",
            "author_name":"sagget69",
            "choices":[
                "You're still in Ewy's ass",
                "Butt Tag: Round 2 has begun"
            ],
            "content":"<div class=\"\"><div> <span>You listen to the muffled voices of the girls outside for clues that might tell you whose ass you're in.<br>\r\n<br>\r\n\"Dang, I wanted to be the one who caught him,\" says Lucy.<br>\r\n<br>\r\n\"Sorry, but if you snooze you lose,\" says Ewy.<br>\r\n<br>\r\n\"<i>Damn it! Out of all the girls, I just had to be trapped inside Ewy's butt</i>,\" you think to yourself. You've sat with Ewy at the school cafeteria before, but she has a history of taking advantage of people when they're in a bad situation, which is why you aren't friends. This can only end badly!<br>\r\n<br>\r\n\"That wasn't much of a game,\" says one of the girls.<br>\r\n<br>\r\n\"Yeah! Ewy got to have all the fun,\" says Lucy.<br>\r\n<br>\r\n\"Alright, alright...how bout I play with him for thirty minutes, then we can have another round at the game,\" says Ewy.<br>\r\n<br>\r\nAfter all the girls agree, Ewy walks into the bathroom, locks the door behind her, then sits down. The sheer force of Ewy's ass colliding with the floor causes her booty to jiggle like a jello. The moment you can't feel her booty jiggling anymore, you are squeezed out of Ewy's ass hole, and you land in a pile of tissues. You look around and see that it's just you and Ewy locked inside the bathroom together.<br>\r\n<br>\r\n\"Ewy please, I've had enough,\" you beg.<br>\r\n<br>\r\n\"Oh, but the games have just begun,\" says Ewy motioning her eyes towards the tissues you're laying on.<br>\r\n<br>\r\n\"What's with the tissues Ewy,\" you ask.<br>\r\n<br>\r\n\"I don't feel like explaining, so how bout I just show you instead,\" she says. Ewy picks you and the tissues up with her hands, then uses her hands to roll them into a ball of tissues with you stuck in the center. Ewy pokes a hole in the tissue ball, so your head can see what's coming. When your head pops out for air you realize Ewy's plan. Ewy is shoving the tissue ball up her ass with you inside, and she wants you to see <b>everything</b>. Ewy rams the ball into her ass, then uses her butt muscles to push you into her large intestine. You pass out from the horrible smell, and when you wake up...</span></div></div>",
            "created":1345401480,
            "id":1408122,
            "title":"You're in Ewy's butt"
        },
        "111122111121211111":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Time limit.",
                "Secret Escape."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She had 30 mins with you. Did the 30 mins not passed yet? Or did she managed to secretly escape the party with to keep you all for herself?</span></div></span></div>",
            "created":1385540040,
            "id":1699585,
            "title":"You're still in Ewy's ass"
        },
        "111122111121211112":{
            "author_id":"sagget69",
            "author_name":"sagget69",
            "choices":[
                "Hailey (Carrie's mom)",
                "Carrie"
            ],
            "content":"<div class=\"\"><div> <span>When you wake up you notice you're in Carrie's bedroom again, stuck in the center of a circle of girls who have huge butts with cheeks that jiggle.<br>\r\n<br>\r\n\"Alright, this time we need to give him a head start,\" says Carrie.<br>\r\n<br>\r\n\"Don't be silly! We can just take our time with sending him down the hershey highway,\" says Lucy.<br>\r\n<br>\r\nSuddenly, Carrie's mom Hailey opens the door and says, \"Hi girls, what are you playing?\" The girls look at her funny, until her eyes stumble upon you trapped in the center of the group. \"Carrie, what have I told you about shrunken men? If you ever find one, be sure to tell me so I can satisfy my giantess-butt fetish,\" says Hailey. The girls are puzzled at first, but they get a glance at the incredible size of Hailey's ass and decide to include her in this round of butt tag.<br>\r\n<br>\r\nHere's an image of Hailey (Carrie's mom)<br>\r\n<a rel=\"nofollow\" href=\"http://www.deviantart.com/download/296453647/ashley_logan__hot_damn_2_by_sagget69-d4wi13j.jpg\" target=\"_blank\">http://www.deviantart.com/download/29645...</a><br>\r\n<br>\r\nYou decide to take the opportunity to escape, while the girls are explaining the rules of butt tag to Hailey. You slip past Rose and Lucy undetected, and look back just in time to see their massive rear ends greatly exposed by their pants. You don't feel like going back inside them, so you make a run for the door. You make it to the door just in time for the girls to notice your absence. One of the girls sees you trying to escape, which prompts them all to chase you down and punish you. After escaping through a crack in the door, you run down the hall. You turn around and see all of the big booty girls chasing after you. You have no doubt that if you're caught that you'll have to go deeper into their booties than usual. You're almost to a crack in the wall, but one of the girls just jumped and plans to land on you with her butt. If you can make it into the crack in the wall you'll be safe, but if you can't you'll be going deep inside another crack. You're close and can almost touch the exit, but then the girl's butt makes impact with you.<br>\r\n<br>\r\n\"Great, I'm stuck in another girl's ass hole again! Which one of them got me this time,\" you ask yourself angrily.</span></div></div>",
            "created":1345756680,
            "id":1411602,
            "title":"Butt Tag: Round 2 has begun"
        },
        "11113":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Stay and wait",
                "explore the house"
            ],
            "content":"<div class=\"\"><div> <span>\"No thanks, I prefer stay in home<br>\r\n<br>\r\n<span class=\"cviolet\">Hum... Fine, we can do some stuffs after i come back. But i need to promises me that u won't get out of my room</span><br>\r\n<br>\r\nOK, i promise...<br>\r\n<br>\r\nWhile you were having this little conversation, Lucy was putting her panties and bra. When you finished, she shove u again in her butt, making you stare at her anus, you try to stugglefrre, but this only tickles Lucy. With every step she makes, her asscheeks press you against her hole, wich make youmove more and only give her more pleasure. When Lucy arrive in her room, she goes to bed and knee over it.she startto chrush you whit her cheeks, keeping youwhere you are, then takes off her panties and release you, making you fall in the mattres,  giving you a image of her giant booty over you.<br>\r\n<br>\r\n<span class=\"cviolet\">Are you sure you don't wana spend the day in your new home?</span><br>\r\n<br>\r\nYes! I am sure!<br>\r\n<br>\r\n<span class=\"cviolet\">Fine...</span> - She said a little disapointed <span class=\"cviolet\">But don't get out of my room or else...</span><br>\r\n<br>\r\nYou really don't know what she ean with the \"or else\". What could be worse than be shoved in a girl ass? Wondering in this thought, Lucy finish dressing, putting a thight jeans and a shirt that shows her belly button. then she comes closer to you again and says<br>\r\n<br>\r\n<span class=\"cviolet\">Better stay were you are when i'm back, or else...</span><br>\r\n<br>\r\nThis time when she finish saying this, she bies the air pretty hard, you really thought that she was going to bite you, so you jumped back and keep looking to her frighten.But she only look at you with an angel smile.<br>\r\n<br>\r\n<span class=\"cviolet\">Bye Pete...</span><br>\r\n<br>\r\nLucy goes out and shut the door,now what? Stay and wait like a good pupy or go explore the house</span></div></div>",
            "created":1250917200,
            "id":748365,
            "title":"Stay home"
        },
        "111131":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Hide",
                "Wave and yell like crazy"
            ],
            "content":"<div class=\"\"><div> <span>You decide that you don't want to be eaten and you stay in the bed, waiting for Lucy return. You just stay there, looking to Lucy's room. You have been friend for a long time, and yet this is the firs time you are in her room.It is pretty normal, there is a desk with some books and a computer for her to study, a chair for her to sit ( and you to be seaten).Nothing much strange, some time has passed and you were almost sleeping when you hear the door open. <br>\r\n<br>\r\n\"Lucy?\"<br>\r\n<br>\r\nYou say in a low tone. but no, it was Lucy's mom, Stacey. she was going to clean the room! So, will you try to get her attention or hide?</span></div></div>",
            "created":1256446800,
            "id":781339,
            "title":"Stay and wait"
        },
        "1111312":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Lucy and Sandy comes back from school",
                "Stacey is alone in the house for some time"
            ],
            "content":"<div class=\"\"><div> <span>You start to jump and wave, hoping for Stacey to see you, but she goes to Lucy's desk and start to clean it off, so you can only see this giantess goddness back, waving her butt to you. When you are loosing your hopes, Stacey looks back and see you. first she get surprised and with her mouth open shout, she mumble:<br>\r\n<br>\r\n\"Wha-what... Peter, is that you?<br>\r\n<br>\r\nYes miss Stacey! Please Help me!<br>\r\n<br>\r\nWhat happen to you?\"<br>\r\n<br>\r\nYou tell her your story, about how Lucy shrunk you , made you massage her anus, shoving up in her butt, farted you out, while you are talking, you can see that Lucy's mom is trying to hold a devil smile, but not making much effort.<br>\r\n<br>\r\n\"So... You spend the night in my daughter asshole? Now I understand why she was so happy and smiling in this morning. You must be a really good butt massager.\"<br>\r\n<br>\r\nYou look to her and see that she have the same expression in tha eyes as Lucy when she was about to drop you in her pants.<br>\r\n<br>\r\n\"Please miss Stacey, don't do this to me...<br>\r\n<br>\r\nYou can call me Goddness from now on little man, but don't worry, i will have a serious talk with Lucy about this. Firstly, she can't do this things without share with her mother and sister. And second, she cant let you be so free or you can scape. Now you will be in a safe place.\"<br>\r\n<br>\r\nSaying this, Stacey holds you with two fingers, and then drops you in her buttcrack, then she start to open and release her ass cheeks, making you slowly go down, until you find her asshole.<br>\r\n<br>\r\n\"You can start rubbing my ass now, unless you want me to step on you\"<br>\r\n<br>\r\nWith this, you start to rub your hands and face in her anus. Each time she would bend over, your head would go straight inside her bowel, and you could hear a soft moan every time.</span></div></div>",
            "created":1256446800,
            "id":781346,
            "title":"Wave and yell like crazy"
        },
        "1112":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "more shit and farts are comming down",
                "she gets up",
                "Her sister is knocking the door"
            ],
            "content":"<div class=\"\"><div> <span>Out of strength, you give up and try to get comfy in this shit tube, you look in your pocket for something, and you remember that your key keeper had a lantern.<br>\r\n<br>\r\n\"At least I can see were I am...\"<br>\r\n<br>\r\nYou turn the light on, and you explore a little of her bowels. The smell of farts and shit is all around and you try to not faint. After some hours you feel all the walls moving side to side. like something is coming up...<br>\r\n<br>\r\n\"Shit! No!\"<br>\r\n<br>\r\nBut yes. A great log of shit is in coming in you direction and you can't escape this! Fascinated by the size of that thing, you only admire and hope that the stroke don't hurt a lot. The pile of shit hits you, but is soft and warm. covered by all directions with this shit, you are starting to loose the will to live. The log is going out and lucy can feel it trying to get out of her butt.<br>\r\n<br>\r\n\"Dammit, I need to take a crap... Right now I was having with Pete in my butt... Well, he can go back later.\"<br>\r\n<br>\r\nLucy holds you and the shit a little more, this makes the shit consume you more, making you enter more inside it. She leaves your house and lock the door, putting the key under the carpet. It was common to sometimes she do that and they would never suspect this. Lucy run down the ladder and enter in hurry to the bathroom of her house. Shitting you out of her. Probably you would die from the fall. But you have enter so much in her crap that it absorb that impact with the water, and you are only nauseated and dizzy. You climb the shit up and you see you floating in the sanitary. Looking up you her the anus that swallowed you some time ago and you shake in fear. Lucy then lets out a fart that continued for at least five seconds. you hear her say:<br>\r\n<br>\r\n\"Wow! That was a good one!</span></div></div>",
            "created":1217048400,
            "id":560823,
            "title":"She needs to go to the bathroom"
        },
        "11121":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "bath time (with help)",
                "bath time (no help)"
            ],
            "content":"<div class=\"\"><div> <span>The fart makes you nauseated and you fall on the cold water. Lucy pisses and makes the water warmer, after take a dump and you out of your ass, Lucy start to get up and light appear on your vision. You realize that you are surrounded by pieces of shit. Your sense of humanity has now gone and you think to yourself that he isn’t coming back so soon. Looking up you see Lucy’s asshole, when you think Lucy is getting up and finishing to humiliate you, she let’s out another fart and say:<br>\r\n<br>\r\n“Ops, I think I’m not done yet…”<br>\r\n<br>\r\nAnd then slowly sits down on the vase again, resting her big butt again in her throne, Lucy takes a deep breath and relax, and doing this, a stink, loud and long gas get out of her rectum, a little more than five seconds, but for you it was hell. It had the smell of hell, the heat of hell and the vision of… Well, looking for this gigantic ass fart and shit somehow made your dick hard, you always had this giantess fetish, but still was pretty scary see this in real life.<br>\r\n<br>\r\nAfter the long fart, a rain of feces was falling upon your head. Lucy was having a terrible diarrhea and unluckily, you were watching from the worst angle at all, right under her ass. You start to swim, to stay away from the rain of shit, and without realize you start to swim in direction of the log that almost kill you some moments ago. You dive and go under the log, to try use the log as a barricade from the wave of shit. Then you realize that there is no way to escape this. The diarrhea had covered the entire vase now, and for you to breath again you need to go up and make your way through Lucy shit.<br>\r\n<br>\r\nYour air was running out, it was a matter of survival, not from pride to go up. You close your eyes and swim up. Your hand meet with something hot and soft. Then you just push and continue up. Now your face had hit another thing, but that wasn’t soft it was hard, when you open your eyes you just see a huge corn seed, the same size of your face, still going up, until you finally feel air again, you were just too happy, and without thinking you take a deep breath from your mouth, and your lungs receive the shit and fart air, while your mouth gets filled with a little shit remains. You try to clean the remains on you face while spit, but your whole body is covered with the rests of Lucy, and then, another fart could be listened up ahead, and then Lucy start to push, it is a really hard fight. Lucy start to bend and make more force, with this some light now was coming from the back side of the vase.<br>\r\n<br>\r\nWith the light coming from her butt, you are now able to see perfectly something you really didn’t want to, the shit coming out. A large and big piece of shit was coming out, while was what look in the beginning, it part itself, falling down near you, making a wave of shit cover your body again. When you clean yourself the second part of the log had already fallen, making another wave, pushing you down, making you sink in her shit. You really start to wonder why God hate you so much. When you are able to go back, you can see Lucy giant face looking for you.<br>\r\n<br>\r\n“Phew, I was worried that you drowned down there. Sorry about that, yesterday me and my sister had a Mexican night.”<br>\r\n<br>\r\nWhile saying this, Lucy throws a piece o paper for you to hang on. You grab the paper like you were grabbing your life, because you really were. Lucy then flushes and let the feces go away, and look at you smiling:<br>\r\n<br>\r\n“Oh my god Pete, you look awful, let me clean you?” <br>\r\n<br>\r\nSaying this, Lucy careful drops you on the sink, turns on the warm water, and with the soap she wash you, making you clean again. Then she clean herself, and turn on the water over the bathtub…<br>\r\n</span></div></div>",
            "created":1264568400,
            "id":826630,
            "title":"Mexican night = Diarrhea day"
        },
        "11122":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "I'm too hungry...",
                "I think i can survive one day without eating..."
            ],
            "content":"<div class=\"\"><div> <span>\"Wow , that was a good one!\"<br>\r\n<br>\r\nSaying that, Lucy gets up and turn around to see you, laying on her shit, almost fainting. picking you up with one hand she ask with a evil smile:<br>\r\n<br>\r\n\"Don't you think? Do you like it?\"<br>\r\n<br>\r\nYou could almost read her mind now, if you say no she would get pissed and you could die, say yes and you will suffer the same way... But was better suffer without having her pissed.<br>\r\n<br>\r\n\"Yes... I really liked, it was very cool.<br>\r\n<br>\r\nAnd how about the time in my ass, was too smell?<br>\r\n<br>\r\nJust a little, but was warm and comfy inside it.<br>\r\n<br>\r\nI suppose you don't mind have been shited too right?<br>\r\n<br>\r\nWell...You see... The shit involved me and absorb the impact... Other way I could get killed, so please don't do this again ok?<br>\r\n<br>\r\nHow cute you stay asking for your life. Okay, I will try not do this again, I swear.\"<br>\r\n<br>\r\nWhile you are chatting, you feel your belly rumble and you realize that you don't lunch yet.<br>\r\n<br>\r\n\"Hum... Lucy, i'm kinda hungry... Do you have anything for me to eat?<br>\r\n<br>\r\nIn fact, I was waiting for you to say this.\"<br>\r\n<br>\r\nShe brings you again to the vase, to show you the shit in there<br>\r\n<br>\r\n\"That is too big for you, but i believe there is some smaller parts stuck in my hole now.<br>\r\n<br>\r\nLUCY! I WILL NOT EAT YOUR...<br>\r\n<br>\r\nOh shush! You will go there to clean either way, and this will be the only thing you will have. The choice is yours. So what will be?\"</span></div></div>",
            "created":1217048400,
            "id":560844,
            "title":"she gets up"
        },
        "111221":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "time  to enter again in her ass",
                "Stacey ( her mother) enter in the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>You hear your belly rumbling and see that she is serious about your meals from now on, and more and more you are loosing the will to live.<br>\r\n<br>\r\n\"O-okay<br>\r\n<br>\r\nOkay What?<br>\r\n<br>\r\nI will eat.<br>\r\n<br>\r\nNot like this. Say it: Goddess Lucy, please let me eat you shit.<br>\r\n<br>\r\nWhat the hell?!<br>\r\n<br>\r\nSay it or you will get nothing!<br>\r\n<br>\r\nOh! Goddess Lucy, please let me eat your  holy shit.<br>\r\n<br>\r\nThat's sound even better, ok my little worshipper, i will spare some of my shit with you.\"<br>\r\n<br>\r\nLucy grabs you with her thumb and her forefinger and with the free hand she opens one of her cheeks, revealing the anus covered with shit. Staying closer and closer, the smell  is terrible and thinking about what are you are gonna do, makes you feel sick and nauseated.<br>\r\n<br>\r\n\"Better you open your moth and put your tongue out.\"<br>\r\n<br>\r\nShe says looking to you with a smile. Then she press your head in her anus, taking you up and down, very slow two times. The shit comes to your mouth and you gulped. She lets you breath for a few seconds and do the same thing again. And again. IN the third one you say:<br>\r\n<br>\r\n\"Enough! Please!<br>\r\n<br>\r\nAlready? I was enjoying you licking my asshole, now that you finish eating, time to clean.\"<br>\r\n<br>\r\nLucy now press you hole body against her ass, and drives you up and down two times more, one with the front part and the other with your back. Then she cleans you with a paper. She do this one more time and you have finished in clean her ass.<br>\r\n<br>\r\n\"You could do with a paper in the first time!<br>\r\n<br>\r\nI could, but wouldn't be so fun for both right?\"</span></div></div>",
            "created":1217394000,
            "id":563706,
            "title":"I'm too hungry..."
        },
        "1112212":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Lucy lets you stay with her sister for now",
                "Satcey prefer to keep you for more time"
            ],
            "content":"<div class=\"\"><div> <span>Lucy is staring at you when the door open and you see Stacey, the mother of Lucy, entering in the bathroom, rubbing her belly.<br>\r\n<br>\r\n\"Ouch, I will never eat sushi again on that restaurant... Lucy? What is this?<br>\r\n<br>\r\nOH ! Hi mom, it is Pete, remember i told you i would shrink him?<br>\r\n<br>\r\nI thought you are just kidding! How could you do such a thing...\"<br>\r\n<br>\r\nBefore she finish her phrase, Stacey let's out a big fart, that looked like a explosion.<br>\r\n<br>\r\n\"Ouch... The sushi I ate... I need to fart but i can't! So much pain.<br>\r\n<br>\r\nDon't worry mom, Pete will massage you butthole, then you will be able to fart.\"<br>\r\n<br>\r\nAt first Stacey don't like the idea, but the pain was increasing, so she would try. She puts you in her crack and made you slide to her butthole. the smell was terrible and was really sweaty. You start to touch her anus, and the tou can feel the space around you getting smaller, she was sitting! Now, again, your hole body is touching her pinky hole, and you start to familiarize with the sensation. You rub her hole with you hand for a few minutes and you can feel the warm of her butt. Stacey was a hot mom, with only 34 years, she had a great body, especially her ass. it as round and firm, you know from who Lucy receive her ass. Consumed by the moment, you start to rub all you body in her ass and lick it. On the outside, Stacey could feel you pleasure her. This makes her body to relax and she start to fart. Fart after fart,  each one was worst the the last.<br>\r\nThe last fart was strong enough to blow you to the back of the panties, this makes you fell dizzy, and you stare at her anus, looking that he is opening.<br>\r\n<br>\r\n“No!, please don't shit in me!”<br>\r\n<br>\r\nLooking in horror the grat brown log that was comming in your direction, you could only pray that what happen some minutas agon do not repeat. Ande the you can see Stacey shit going back and entering in her hole, being closed. She quickly drop her pants with you and sit in the vaing, taking her time to relax.<br>\r\n<br>\r\n“You know, you were pretty good in there Pete. I know who to call now when i have a constipation.”<br>\r\n<br>\r\nSaying that, Stacey giggles and let out a huge fart. A few seconds later you can hear something falling in the water. She takes you in her hand and gets up, you and her stare her shit. If you fought that lucy shit was big and stinky, Lucy's mom was 10 times worst.<br>\r\n<br>\r\n“Lucy told me you were a good paer too...”<br>\r\n<br>\r\nSaying that, seh push you in her butthole again and squeeze you,  forcing you up and down, then she washes you and do that 2 more times, until you finally clean off her butt.<br>\r\n<br>\r\n“wow, this is really good. I think I can get used with you.<br>\r\n<br>\r\nMom! Are you Finished? I want to show Pete to Sandy before she leaves.</span></div></div>",
            "created":1219640400,
            "id":574182,
            "title":"Stacey ( her mother) enter in the bathroom"
        },
        "12":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Natalie ( the maid) comes in",
                "Lucy comes in looking for you"
            ],
            "content":"<div class=\"\"><div> <span>As the time goes by, you and Lucy are studying, and for some reason she is quite uncomfortable for something. You hear the door open, and is Natalie, your maid. She is 20 years, brunette, short hair( going to the shoulders), great legs, round ass and at least a D cup. She was incredible hot and sometimes you think she likes you, but your mom would freak out if she discover that you were dating the maid, so you stay on your own and let her alone. When she sees you in the living room  says<br>\r\n<br>\r\n“Keep studying you two... I'll go change myself and start to clean the bathroom for don't disturb you .”<br>\r\n<br>\r\nYou feel a little headache and goes to the bathroom get some pills. You enter the bathroom and you fell your head spinning... you try to hold in the sink, put is no use, you blanked out and wen you wake up, you are in a white and smooth ground. Looking at your surroundings, you see that you are in that huge bathroom, wait... this is YOUR BATHROOM and you shrunk!</span></div></div>",
            "created":1216530000,
            "id":558260,
            "title":"You Shrink ( Not Now)"
        },
        "121":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>A huge shade is form behind you, you look back and see that is Natalie, wearing a black spandex short a white top, in one hand a bucket and in the other a broom. You try to run but see that's doesn't care. Her size is incredible and with a few steps she reach you. There is only one thing to do. Try to get her attention. You realize that she is not wearing sandals or nothing, you star to climb her feet in hope for her to notices you. Does she?</span></div></div>",
            "created":1216530000,
            "id":558265,
            "title":"Natalie ( the maid) comes in"
        },
        "1212":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Natalie feels you",
                "She anal vores you",
                "She don't feel and you stay in the same place"
            ],
            "content":"<div class=\"\"><div> <span>As you climb her feet you are greeted by the powerful smell of it.<br>\r\n<br>\r\nDamn, she must have been wearing sneakers all day and her feet are pretty sweaty.You don't know why, but the smell and the grease of her feet's turn you on. You see that she is heading to the toilet seat, she stays in front of it and let scape a huge fart. She quickly turn around and close the door, and proceeds to move to the toilet seat. She starts to drop her shorts and panties, and another fart comes out of her bum. The giantess sit on the vase, and another fart comes, filling the bathroom with this putrid gas.<br>\r\n<br>\r\n\"Hum... That sounded wet...\" - She said.<br>\r\n<br>\r\nNatalie drops her shorts on the ankle, covering you, and as you try to get out of this maze ending up in her panties, you watch amazed the colossal view of your made, doing her business. You start hearing the sound of water dropping, witch would be her piss, and you hear her grunting and making pushing sound, when you finally hear a plop sound.<br>\r\n<br>\r\nHoly shit! Natalie is...<br>\r\n<br>\r\nNow you don't know if you should try to get her attention, she could think you are some kind of a pervert and could even squish you. as you are thinking about what to do, Natalie finish, take some paper and clean her ass. she gets up and you are able to see her shaved pussy above you, along with her large buttcheeks, soon  she get a hold of her panties and bring them up, making you fly high speed towards her ass. You see her butt come closer and closer, and you don't have much time to scream, as your moth get shoved in her firm, soft and warm cheeks.<br>\r\n<br>\r\nNatalie adjusts her panties and you are pushed to her crack, as she puts her shorts you just get pushed deeper. the feeling of Natalie's ass all around you get you even more horny, even the faint smell of crap and ass sweat is good. She flushes her bowel movement and start cleaning the bathroom. as sometimes she would bend over or crouch each time you would get push deeper and deeper between her cheeks, and when she would get to normal, the pressure around you would increase. Soon you start to feel something different, the touch of the skin around you in different, more  wrinkly, and the smell of ass and crap are much stronger now.<br>\r\n<br>\r\n\"Oh no! I'm in front of her asshole!\"<br>\r\n<br>\r\nAs Natalie moves around, You only get your body to be smashed and tossed around her asshole for what it seems like hours.</span></div></div>",
            "created":1352475420,
            "id":1464344,
            "title":"No"
        },
        "12122":{
            "author_id":"sons0fthesky",
            "author_name":"Schroedinger",
            "choices":[
                "She feels you",
                "She doesn't feel you"
            ],
            "content":"<div class=\"\"><div> <span>After a while, her anus starts to pulsate. Her asshole opens up to blast you with her hottest fart yet. When her anus closes, you feel your feet and shins squeezed from all sides. You look at you legs to see that you have been sucked into her painfully tight asshole. You begin to panic and try to push yourself out, but all your moving had done was cause her anus to suck you in to your waist. You sit still, not wanting to end up deeper inside her mountainous ass when Natalie starts talking to Lucy.<br>\r\n<br>\r\n\"Okay, I've finished cleaning for the day.\" Natalie says, while putting away the cleaning supplies.<br>\r\n<br>\r\n\"Thank you, you can go home now.\" Lucy says from another room.<br>\r\n<br>\r\n\"Okay, good bye!\" Natalie says before she walks outside.<br>\r\n<br>\r\nThe movement of her asscheeks started too slowly push you in deeper, but you barely managed to stay in place by placing your hands on both sides of her anus and pushing up. This worked for about a minute, until her asscheeks started moving three times faster. She was running! Despite your best efforts, the push of her massive cheeks was just to much for you to handle. You scream as you are sucked in past your shoulders, leaving only you hands outside of her anus. after a few minutes, you feel the bounce of her running slow down and stop. Suddenly, you feel an immense amount of pressure push your hands inside her as you feel her sit down. You decide that your only option left is to get her attention. You begin squirm as hard as you can as you bit the walls of her anus.</span></div></div>",
            "created":1536794640,
            "id":2546906,
            "title":"She anal vores you"
        },
        "121221":{
            "author_id":"sons0fthesky",
            "author_name":"Schroedinger",
            "choices":[
                "Help you",
                "Stick you back in her ass"
            ],
            "content":"<div class=\"\"><div> <span>You continue to struggle for about 15 minutes before you finally give up. You decide to lie still in her anus until she needs to use the restroom.<br>\r\n<br>\r\nOn the way home, Natalie felt something extremely good in her anus. When she got home, she began to feel what ever was inside her ass, start to move around violently, causing her legs to get weak and make her fall to the floor in pure ecstasy. After 15 minutes, the pleasure ends and she gets up and walks to her room. She begins to strip off her pants and panties and reach inside her ass to figure out what felt so good.<br>\r\n<br>\r\nSoon after you stop moving, you feel 2 fingers grab you by the shoulders. You are pulled out our Natalie's ass and before your eyes adjust to the light, you her her begin to talk.<br>\r\n<br>\r\n\"Peter? Is that really you?\" she asks with a bewildered expression.<br>\r\n<br>\r\n\"Yes! It's me!\" you answer, seeing that she has lifted you up to her face.<br>\r\n<br>\r\n\"I was wondering why Lucy dismissed me instead of you.\" she responds.<br>\r\n<br>\r\n\"Do you think you can help me get back to normal size?\" you request.<br>\r\n<br>\r\nIt take a minute for Natalie to answer but she eventually decides to...</span></div></div>",
            "created":1537167900,
            "id":2548767,
            "title":"She feels you"
        },
        "122":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Natalie Comes in and see you and her",
                "oh oh..."
            ],
            "content":"<div class=\"\"><div> <span>A huge shade is form behind you, you look back and see that is Lucy. She looks down and see you.<br>\r\n<br>\r\n“Well Pete, shrunk in a place like this... Gives me some ideas.<br>\r\n<br>\r\nWhat? Lucy, What are you talking about?<br>\r\n<br>\r\nThe soda i gave you, had a shrink potion. Take too long, but work. And you know what...”<br>\r\n<br>\r\nShe gets down and grabs you with one hand<br>\r\n<br>\r\n“ I think I need to use the bathroom now.”</span></div></div>",
            "created":1216530000,
            "id":558266,
            "title":"Lucy comes in looking for you"
        },
        "13":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Don't see you and sit over you",
                "See you and sit over you",
                "See you and sit next to you",
                "don't see you and sit next to you",
                "Someone in the door"
            ],
            "content":"<div class=\"\"><div> <span>You drink the soda, Lucy is looking at you with excitement, you ask her if she is okay, but she only changes the subject... As the time goes you are studying and when the night come off, Lucy goes away, you can see an expression of sadness in her face, but when you ask her what was the matter she only said it was nothing.<br>\r\n<br>\r\nIt is night already, and you are enjoying the first day of a full month alone in your house, when the door rings. It was Thais, your cousin<br>\r\n<br>\r\n\"What are you doing here?<br>\r\n<br>\r\n<span class=\"cpink\">Auntie told me to come and take care of you... She doesn't believe that you are able to survive alone for a month</span>\"<br>\r\n<br>\r\nThais was 15 years old, blond, 5.6ft, D cup and a nice booty. she always like to boss around, especially over you.And sometimes she have a really bad gas problem... sometimes you joke around saying that she is rotten, and she stay really angry with you, most of times she try to take revenge, waking you up farting in your face... You can't believe that your mom send her to take care of you...<br>\r\n<br>\r\n\"WE HAVE THE SAME AGE! HOW CAN YOU BE BETTER THAN ME?<br>\r\n<br>\r\n<span class=\"cpink\"> This is not a nice way to talk to the one in charge you know that?</span><br>\r\n<br>\r\nStop screwing around! I don't need you to do a shit!<br>\r\n<br>\r\n<span class=\"cPINK\"> You know, I'm not that happy for have to stay with you either... But Let's try to live together ok? After all we are cousins</span><br>\r\n<br>\r\nFine...I will order a pizza for us, what do you want?...\"<br>\r\n<br>\r\nYou order the pizza, You go to the kitchen and eat.. chatting and laughing, telling to yourselves your old stories. When suddenly you start to feel dizzy, you goes to the living room and lay on the sofa, when everything goes black. You faint. When you wake up you are surprised at what are you looking at... The world is bigger now! you must have shrunk to 1 inch. When you hear a booming voice of Thais.<br>\r\n<br>\r\n\"<span class=\"cpink\">Peter! Where are you? Are you okay?</span>\"<br>\r\n<br>\r\nShe comes to the sofa and then...</span></div></div>",
            "created":1251262800,
            "id":750852,
            "title":"You Shrink (Really later)"
        },
        "131":{
            "author_id":"mr.x",
            "author_name":"Mr. E",
            "choices":[
                "Under her Asscheeks.",
                "In between her buttcheeks in her buttcrack",
                "In between her buttcheeks close to her butthole"
            ],
            "content":"<div class=\"\"><div> <span>Your cousin walks to the couch and she doesnt even notice you an inch tall on the sofa.  she was wearing <span class=\"corange\"> orange sweatpants</span> and a <span class=\"clgreen\">green tank top</span> .  when she began to sit down her ass spread out so it looked like they were going to burst out of her pants and you could see the outline of her panties through the thin cotton material.  <br>\r\n<br>\r\nYou screamed \"No Thais im your cousin I dont want to get squashed under your butt Aaaahhhh<span style=\"font-family:impact, fantasy\">(squish)</span>.\"<br>\r\n<br>\r\nThais said \"oh good I've been waiting for this movie forever and i got a full bag of Tostitos tortilla chips and a <u>giant bowl of bean dip</u>.  Too bad Peter left, otherwise I could have farted in his face while he wasnt looking.\"  Little did she know her stinky wish might come true.<br>\r\n<br>\r\nThe teenage girl never even felt the shrunken boy under her rear end and would continue to watch the HBO movie for the next hour and a half with no commercials.  Peter would have to endure his cousins full weight for the next 90 minutes if he wanted to survive being crushed underneath a 15 year old girls booty.  that is if he even wanted to live to try and get help from the girl who might not even help him in the first place.  <br>\r\n<br>\r\nWhich part of her butt was Peter under?</span></div></div>",
            "created":1255582800,
            "id":776384,
            "title":"Don't see you and sits on top of you"
        },
        "134":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Thais shifts",
                "You decide to walk over to Thais",
                "Thais says \"Ugh, a bug?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Thankfully, Thais misses you on the couch. And just as good, she doesn't sit on top of you, but instead sits next to you. Then what happens?</span></div></span></div>",
            "created":1485643740,
            "id":2270379,
            "title":"don't see you and sit next to you"
        },
        "135":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Shit War",
                "Fart tournament",
                "Butt Catcher"
            ],
            "content":"<div class=\"\"><div> <span>Thais looks down to see you waving her arms, trying to get her atention. She picks you with her fingers to say:<br>\r\n<br>\r\n\"Oh y god! Peter, what happen to you?\"<br>\r\n<br>\r\nBefore you could answer she smiles and say<br>\r\n<br>\r\n\" You know, I always had this giantess fetish, and see you this way is making me have a lot of ideas...\"<br>\r\n<br>\r\nThen You can hear the door knocking, with this, Thais drops you in her cleavage and shoves you in. It is hard to breath, since you are being smothered by two balls of meat, but they are so soft and firm that you really don't care so much. Thais go to the door and see it is Lucy on the other way.<br>\r\n<br>\r\n\"Hey Tahis, Peter is ther?<br>\r\n<br>\r\nYes...<br>\r\n<br>\r\nCan I speak to him?<br>\r\n<br>\r\nNO... He is... busy...\"<br>\r\n<br>\r\nLucy looks down and see Thais's Cleavage moving a little, and see her trying to hide her smile, so she says<br>\r\n<br>\r\n\" He is in your cleavage right? I shrunk him this afternoon, did'nt know would take so long for the potion to work.<br>\r\n<br>\r\nSo.. It was you? Come in! I need to thank the one who did this to my little cousin.<br>\r\n<br>\r\nHum... Look, In the main plain, i was going to have Peter shrunk and have all the fun, but now i think we can share him, what about this?<br>\r\n<br>\r\nI think it is a great idea! How about a game to decide which one can have him for the first night?<br>\r\n<br>\r\nSplendid!, How about...</span></div></div>",
            "created":1255496400,
            "id":775905,
            "title":"Someone in the door"
        },
        "14":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Maria/ Carrie (Biologist and scientist)",
                "Natalie (in the maid room)",
                "Lucy"
            ],
            "content":"<div class=\"\"><div> <span>You start to drink your soda, Lucy is staring you with eyes that you never saw before, it is strange, but you drink it anyway. You felt that the soda was a little different, but you really didn’t care, when you finish, you go back to your book, and notice that Lucy keep staring at you with an eye of hunger.<br>\r\n<br>\r\nWhat?<br>\r\n<br>\r\nUh… nothing really<br>\r\n<br>\r\nYou keep studying, hours pass by, when Lucy finally goes home, you go lock your house, and you realize something… you were smaller! You were like 4 feet long!<br>\r\n<br>\r\nYou start to freak out and need to get some help, but from who?<br>\r\n<br>\r\n</span></div></div>",
            "created":1270184400,
            "id":861170,
            "title":"you Shrink (Slow)"
        },
        "141":{
            "author_id":"akrom",
            "author_name":"Akrom",
            "choices":[
                "Maria appears again",
                "Carrie has a bad flatulence",
                "Try to get her attention"
            ],
            "content":"<div class=\"\"><div> <span>The next door twins maybe could help, Maria was a biology teacher and Carrie a genetic scientist. If they couldn’t help you with this, no one could. You knock in their door and are greeted by Maria’s pussy right in you face.<br>\r\n<br>\r\n“Yes? Oh hello there little boy, are you lost?<br>\r\n<br>\r\nMaria, it is me Peter!<br>\r\n<br>\r\nOh my god! How did you get like this?<br>\r\n<br>\r\nI don’t know! Can you or Carrie help me I cant’ stop getting smaller!<br>\r\n<br>\r\nSure sweetie, enter!”<br>\r\n<br>\r\n Maria takes you to the living room and puts you in the sofa. When you sit in the sofa, you shrink to 2,5 feet.<br>\r\n<br>\r\n“Look sweetie I don’t know if it is a good idea show you to Carrie… She kinda has a giantess fetish and sees you in a doll size she can go crazy…”<br>\r\n<br>\r\nAfter this you shrink again, staying with only 1 foot. Maria takes you with both hands and places you carefully in the sofa.<br>\r\n<br>\r\n“Stay there like a good boy and I will soon come back”<br>\r\n<br>\r\nMaria disappears while enter in a door. And you continue shrinking, when you finally stop with 1 inch. Carrie enters in the room eating some sandwich and heading for the sofa. When she turns around and makes her move to sit. You can only look to the gigantic butt cheeks that are coming in your direction. Carrie sits down and grins her ass to adjust herself, and without knowing moving you closer to her crack, closer to her anus. And by the smell, you assume that she farted on her way to the sofa. After this…<br>\r\n</span></div></div>",
            "created":1270184400,
            "id":861174,
            "title":"Meeting the twins"
        },
        "15":{
            "author_id":"blueblur2",
            "author_name":"Bluelink999 ",
            "choices":[
                "Strips down to nothing ",
                "Gives you a new home which is a box "
            ],
            "content":"<div class=\"\"><div> <span>You take a drink of the soda then immediately feel tired \"hey I'm gonna have a quick nap ok\" you said. \"Ok\" she said you fell asleep and woke up an hour later at her house and YOUR TINY!?!?!?<br>\r\n<br>\r\n\"What happend\"<br>\r\n<br>\r\n\"I know you like my ass farts and shits so I shrunk you to keep you with them all the time\"<br>\r\nShe said <br>\r\n<br>\r\n\"Now what to do with you </span></div></div>",
            "created":1535851560,
            "id":2541644,
            "title":"In her house "
        },
        "152":{
            "author_id":"blueblur2",
            "author_name":"Bluelink999 ",
            "choices":[
                "Oh that was a wet one (toilet time in the box)",
                "More farting "
            ],
            "content":"<div class=\"\"><div> <span>\"Ok this plastic box I'm putting on air holes for you to breath and here is the special part it's big enough for you to sleep and for it to be my new toilet that's right every time I need to shit or piss it's going on one side will you sleep on the other and then when I'm away you can eat and drink it.\" She said she turned for her ass to face you and farted right in your face bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbfffffffffffffffffffrrrrrrrrrrrrrrrrrrrrtttt tttttr</span></div></div>",
            "created":1535851860,
            "id":2541645,
            "title":"your new home and your happy about it "
        }
    },
    "info":{
        "author_id":"akrom",
        "author_name":"Akrom",
        "brief_description":"You are Shrunk by Lucy, your neighbour, and now you try to escape from her butt ",
        "created":1216600320,
        "description":"<td align=\"left\" class=\"norm\">A quick promotion, will give 1000 GP's for every GOOD entry.<br>\r\n<br>\r\nAnother shrink and ass interaction story... sorry for my english people... i'm not that good at it... So... let's go for the rules.<br>\r\n<br>\r\n<br>\r\n1º) No other male character.<br>\r\nPete is the one and only.<br>\r\n2º)Don't use a one line chapter... Make at least a paragrah or some phrases for the dialogue.<br>\r\n3º) Try to use a correct grammar...<br>\r\n<br>\r\n<br>\r\nCome on people, don't be shy... add some chapter in this story too...<br>\r\n<br>\r\nPHOTOS!<br>\r\n<br>\r\nI'm copying MR.E, but i hope he doesn't mind<br>\r\n<br>\r\nHere are some shots of:<br>\r\n<br>\r\nLucy: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img694.imageshack.us/img694/7523/ogaaapjxhc4ewdkzunzfcjh.jpg\" target=\"_blank\">http://img694.imageshack.us/img694/7523/ogaaapjxhc4ewdkzunzfcjh.jpg</a><br>\r\n<br>\r\nLucy's back: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img4.imageshack.us/img4/5111/ogaaanc68kbjhlfbvs2icgi.jpg\" target=\"_blank\">http://img4.imageshack.us/img4/5111/ogaaanc68kbjhlfbvs2icgi.jpg</a><br>\r\n<br>\r\nRose: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img37.imageshack.us/img37/2223/ogaaalscutheimpta4apskh.jpg\" target=\"_blank\">http://img37.imageshack.us/img37/2223/ogaaalscutheimpta4apskh.jpg</a><br>\r\n<br>\r\nRose back: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img4.imageshack.us/img4/8016/ogaaanc2l6xih1pebnv36m1.jpg\" target=\"_blank\">http://img4.imageshack.us/img4/8016/ogaaanc2l6xih1pebnv36m1.jpg</a><br>\r\n<br>\r\nEvvy: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img697.imageshack.us/img697/1521/ogaaagvise7cmkmlii2gexn.jpg\" target=\"_blank\">http://img697.imageshack.us/img697/1521/ogaaagvise7cmkmlii2gexn.jpg</a><br>\r\n<br>\r\nEvvy's back: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img213.imageshack.us/img213/4567/ogaaansrnwy8vyc7zermxui.jpg\" target=\"_blank\">http://img213.imageshack.us/img213/4567/ogaaansrnwy8vyc7zermxui.jpg</a>   (please ignore the others in the photo)<br>\r\n<br>\r\n<br>\r\nCindy: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img706.imageshack.us/img706/843/cindyu.jpg\" target=\"_blank\">http://img706.imageshack.us/img706/843/cindyu.jpg</a><br>\r\n<br>\r\nMaria: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img12.imageshack.us/img12/9866/shaymariapart2004.jpg\" target=\"_blank\">http://img12.imageshack.us/img12/9866/shaymariapart2004.jpg</a><br>\r\n<br>\r\nCarrie: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img215.imageshack.us/img215/1438/shaymariapart2016.jpg\" target=\"_blank\">http://img215.imageshack.us/img215/1438/shaymariapart2016.jpg</a></td>",
        "id":1453104,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556415180,
        "modified":1556415180,
        "pretty_title":"Butt story"
    }
}